{
    "articleURL": "/tvshowbiz/article-12040767/Lewis-Capaldi-looks-smitten-actress-girlfriend-Ellie-MacDowall.html",
    "content": [
        "He recently gushed over his new romance with girlfriend Ellie MacDowall. ",
        "And Lewis Capaldi looked happily loved-up with the actress and model as they spent the day with his parents Mark and Carol in Hollywood on Tuesday. The singer, 26, strolled alongside his stunning partner as they soaked up the sunshine on their fun family outing. Casually clad, the Someone You Loved hitmaker opted for a black jumper that he paired with cropped trousers and colourful trainers. Emily, 23, also kept things low-key as she paired a green Nike jumper with black flared trousers and trainers. The actress - who is set for stardom playing Cary Grant's daughter in an ITV biopic - finished off her look with a pair of circular shades and slicked her hair half back. ",
        "It comes after Lewis discussed his new relationship - as well as his new single Wish You The Best - during a recent chat with Radio 1's Scott Mills.Lewis said: 'I have a girlfriend and that’s going really well, I am happy happy, she’s a lovely lady I feel good about everything.'The hitmaker was first spotted with his new girlfriend back in November, as the pair were pictured on a night out and then a romantic dinner in the early hours of the morning. They were then reportedly seen at the BRITs afterparty in February, where they struggled to keep their hands off each other. ",
        "It seems they have lots in common as well because Ellie works in the arts too and she's a fellow Scot. She's a triple threat - trained in acting, dancing and singing. This year Ellie will also have a starring role in new biopic Archie focusing on the actor Cary Grant.The four-part drama series will cover his humble beginnings in the UK to his phenomenal rise to success in America. ",
        "Ellie will be playing the part of his daughter, Jennifer Grant in the series, which will air on ITV's new streaming service, ITVX. It appears that Lewis' new song Wish You The Best - which was released last month - is not a comment on his current happy love life.Discussing his new song, Lewis said: 'It’s about someone moving on and that feeling where you know it’s the best thing for that person but you want to say to them and all you say is \"good luck I’m really happy for you.\"'He continued, poking fun at his own tendency to write songs about sad situations: 'But actually you are dying inside and want to tell them all the things you miss about them and why they should stay with you, so just a really happy song for the summer.'",
        "Scott and Lewis went on to discuss the impact of anxiety on their lives, as Scott admitted it meant he 'struggled to finish his GCSEs' as a teenager, while Lewis suffered with them just last weekend. Lewis said: 'I will never feel normal again. I’ll never get rid of these, I had multiple panic attacks on Saturday evening. 'I went out for a few beers on the Friday, I always feel anxious after drinking but I’d really hammered it after a long time of not boozing and my mum had to come down to calm me down, lie in bed with me and I was having panic attack after panic attack and the whole week after I felt off.' But the hitmaker added that he's been having a better week as he deals with the ups and downs of his mental health. ",
        "He added: 'I’m having a good day today I haven’t twitched that much, I still do that I still tick quite a lot but it’s one of these things. 'What’s mad is that there is no real treatment for Tourette’s so I’m in a position where I can cancel a whole day of work if I’m too stressed or my anxiety it too bad. 'For other people it must be so much worse, they don’t have the luxury I have.'",
        "In the documentary, Lewis' parents Mark and Carol showed where their son had inherited his iconic sense of humour from. The Somebody You Loved singer revealed that they tried to get involved in his songwriting process and had become like 'Simon Cowell'. He said: 'My mom and dad have all of a sudden become these muso’s, my mum is a nurse and my dad is a fishmonger and now all of a sudden they’re like Simon Cowell. 'It’s mental - I don’t tell my dad what halibut to sell!'But despite his sudden rise to fame, the singer is as close with his parents as ever, revealing that his mum still does his laundry. He added: 'Nowadays my mum does my laundry because I’ve shrunk a lot of my clothes!' ",
        "In one poignant scene, Carol broke down as she revealed Lewis had been in the house when her sister died by suicide. However, trolls took aim at Lewis' parents Mark and Carol following the release of the film, saying that they came across as 'harsh'.After this, Lewis' big sister Danielle took to TikTok to shut down the negative remarks, saying that the trolls haven't understood their 'Scottish patter'.Danielle, 30, showed she shared her brother's famous dry humour, posting a picture where they both showed their middle fingers to the camera in a gesture aimed at trolls.",
        "She captioned it: 'when reading negative comments on parents.'Danielle, who is a teacher, said: 'Lewis’ documentary has had a lot of positive responses but unfortunately there will always be people who have to look for problems where there arent any.'If you dont get scottish patter or parents who were worried about their son, dont comment.'Lewis previously dated Love Island winner Paige Turley on and off from 2014 to 2016 after they met at college in Motherwell.She is said to have inspired his smash hit album Divinely Uninspired To A Hellish Extent and his hit song, Someone You Loved.Speaking previously about the inspiration for the record, Lewis said: 'I met a lady. She was very nice. I loved her. I loved the look of her and I loved how she spoke.The singer shot to fame in 2019 after his hit single Somebody You Loved topped the UK Singles Chart for six weeks - and which recently became the UK's most streamed song of all time. He then was reported to have dated student Catherine Halliday for seven months before splitting in September 2020.Lewis revealed he was on dating app Hinge after being thrown off Tinder and Bumble because people thought he was pretending to be Lewis Capaldi.",
        "He has now achieved four number ones and his debut album, Divinely Uninspired To A Hellish Extent, sold over 10 million copies worldwide His second album Broken By Desire To Be Heavenly Sent will be released in May, before he performs at Glastonbury Festival in the summer. "
    ]
}