{
    "articleURL": "/sport/football/article-12047457/USA-soccer-legend-Landon-Donovan-Cesc-Fabregas-latest-stars-join-Soccer-Tournament.html",
    "content": [
        "Landon Donovan and Cesc Fabregas have joined Clint Dempsey as participantsWrexham and Borussia Dortmund will also be sending teams to the eventDailyMail.com provides all the latest international sports newsLandon Donovan and Cesc Fabregas will be heading to Cary, North Carolina this summer to play in The Soccer Tournament, a seven-a-side event also featuring delegations from Borussia Dortmund, West Ham and Wrexham.",
        "Fabregas, who plays for and part-owns Serie B side Como 1907, will be playing for and coaching the team in the tournament, while Donovan will turn out for his former LA Galaxy teammate Mike Magee's Sneaky Fox FC.The pair will also be joined by former Bengals star Chad Johnson, who will suit up for FC Cincinnati alumni squad Nati SC, while Mia Hamm will be among the former national team stars coaching the US Women.The tournament also received a previous commitment from former USA, Fulham and Spurs star Clint Dempsey, whose eponymous squad was one of the first two teams announced for the event last year.The $1million winner-take-all tournament will take place from June 1-4, and unveiled the eight groups for its 32 teams on Thursday.",
        "Most notably, Dempsey and Donovan (as well as former USA teammates Eddie Johnson and Jermaine Jones) will be facing off in Group G, while Fabregas will play against a team from Ryan Reynolds and Rob McElhenney's club Wrexham.Other big names that have signed up are Carlton Cole and Anton Ferdinand for West Ham, goalie Roman Weidenfeller for Dortmund and influencer Noah Beck for the black and yellow as well. Wolves will also field a side featuring 'former legends and talented academy prospects,' while former USMNT stars Geoff Cameron and Brek Shea will play on Blade and Grass FC alongside other ex-Premier League players like Stephen Ireland, according to ESPN.",
        "'Our launch speaks not only to the passion for the sport in America, but also the strength of seven-a-side soccer,' TST founder and CEO Jon Mugar said in a press release. ",
        "'We have no idea who or what style of play will walk away with $1 million dollars!”Each team will play three group stage games, with the top two from each advancing to the knockout round.The tournament follows in the footsteps of The Basketball Tournament, a similar summer event that has featured former college and pro players competing for a $1million prize since 2014.Both tournaments are produced by TNT Enterprises. "
    ]
}