{
    "articleURL": "/wires/pa/article-12060049/Ros-wins-Badminton-title-Canter.html",
    "content": [
        "Ros Canter continued recent British domination of the Badminton Horse Trials by claiming an historic title triumph aboard Lordships Graffalo.",
        "The Lincolnshire-based former world champion took a commanding nine-penalty lead with her into the showjumping phase following an outstanding cross-country performance on Sunday.And the 37-year-old was in no mood to let it slip, collecting just four time faults that meant she finished on a final score of 35.3 penalties.Her 15-penalty winning margin was the biggest across any competition in elite eventing history, underlining the quality of a combination that finished second at Badminton 12 months ago.A distant chasing pack was led by ex-world number one Oliver Townend and Ballaghmor Class, while Ireland’s Austin O’Connor took third aboard Colorado Blue.It was a first Badminton podium place for Cork-born O’Connor 24 years after his debut, with Townend recording a sixth top-three result across the prestigious Badminton, Burghley and Kentucky events on Ballaghmor Class.Canter’s pursuit of a £105,000 top prize proved relentless as she controlled proceedings from start to finish and also made a powerful early selection statement for the Paris Olympics. He loves himself, which is great, and today could not have gone any better for him. It is incredible  Ros Canter  It also meant a British winner for the third successive time after victories for Piggy March in 2019 and Olympic team gold medallist Laura Collett last year on Badminton’s return following the coronavirus pandemic.",
        "And Canter’s first Badminton crown can now be added to a career portfolio that already included world individual and team gold plus two European team titles.“He is the out-and-out event horse – he has got a classic technique,” world number three Canter said.“He loves himself, which is great, and today could not have gone any better for him. It is incredible.",
        "“This is certainly going to take a long time to sink in and the team I have around me, I just couldn’t do it without them.”Yorkshireman Townend won Badminton 14 years ago but although he had to be content with another second-placed outcome, the Tokyo Olympics British team gold medallist once again excelled on the big stage.“The horse is unreal,” Townend said. “He has had another amazing result, and I am absolutely delighted.”"
    ]
}