{
    "articleURL": "/news/article-12043655/Father-27-says-maxed-EIGHT-credit-cards-eating-out.html",
    "content": [
        "Texas dad Johnny stars in an episode of Caleb Hammer's 'Financial Audit' The 27-year-old explains he's maxed out eight credit cards by eating outHammer berates the new father in viral clip as he urges him to 'burn' his cards A father with eight maxed-out credit cards has revealed how he racked up the $35,000 debt by eating out at McDonald's and Panda Express. ",
        "The 27-year-old man named Johnny, from Jarrell, Texas, told YouTube finance guru Caleb Hammer that he and his wife had a household income of $120,000 a year - or $7,000 a month after taxes.But their excessive spending on credit cards and car repayments caused their debt to spiral across the eight cards. After claiming the debt came from eating out, Hammer replied: 'You're not eating out $8,000 a month. 'What, are you going to the nicest steak houses twice a day?'",
        "The clip - which has been viewed over 229,000 times - comes amid fears the cost-of-living crisis is forcing more families into debt.Figures from the Federal Reserve show the average American household carries $7,951 in credit card debt.Johnny's bank statements showed he started the month with -$222 in his bank account and ended it with -$433. Hammer then drills into the statements where he finds money was blown on food outlets including: McDonald's, Whataburger, Starbucks, Olive Garden, Wingstop and Panda Express. In all, the couple had spent $748 on overdraft fees so far in the year. In total they were $35,700 in debt. Despite this, they had $4,500 in savings - but Johnny said his wife didn't want to touch that. He also said he had no 401k while his partner had just started to save into one.",
        "Hammer replied: 'That's insane. I'm not angry at you, I'm angry at the debt.'Johnny explained the couple were also spending a lot of money on their six-month-old son and hadn't been making as much money with parental leave.He added: 'We definitely care, I don't know what it is.'We have the money and then we spend it, it's there and then it's gone. Whether it be gas or eating out or going shopping or whatever.'",
        "The new father - who works in natural gas - also said he had a car which he paid off at around $680 per month, while the couple spent $1,725 a month in rent. The exchange was broadcast on Hammer's YouTube channel 'Financial Audit' where he helps people seeking personal finance advice.The 28-year-old host urged his guest to 'burn' all of his credit cards, adding it was the highest amount of individual debts he had ever seen. He then recommended using the snowball method to pay off the debts.The method involves tackling the smallest first - even if it doesn't have the highest interest - to create momentum and keep the debtor motivated. Hammer estimated the couple could realistically be debt-free in a month and a half.  It comes after another woman on Hammer's show went viral after she revealed she had to work four jobs to pay off her $250,000 student debt.",
        "Teryca Brooks-Long explained that her main focus is modelling and acting but she also worked as an enrolment advisor for an online university, a virtual assistant for a realtor and had a role at an advertising agency.The clip was filmed last year but resurfaced again last week after Hammer said the story still 'sticks' with him, adding: 'That was a scary one.'A video of a 29-year-old who had racked up $1 million debt with her husband attracted similar attention last month.According to data from the Federal Reserve Bank of New York, Americans have $986 billion in credit and debit card debt.The figures are from the final quarter of 2022 and marked a 15.2 percent increase on the same period the previous year. It means the average American household carries an average of $7,951 in credit card debt."
    ]
}