{
    "articleURL": "/wires/ap/article-12057155/Yanks-Severino-eager-begin-minor-league-rehab-starts.html",
    "content": [
        "ST. PETERBURG, Fla, (AP) - New York Yankees right-hander Luis Severino said it was \"unnecessary\" that the team decided to have him pitch in a controlled minor league intrasquad game on Friday and not in a game with Class A Tampa.",
        "Severino has been on the 15-day injured list since the start of the regular season with a right lat strain. He had been originally scheduled to start Wednesday in a Florida State League game. It was first moved to Thursday before being canceled.\"I think it was unnecessary not throw in Low-A, but I do whatever they tell me to do,\" Severino said on Sunday before the Yankees played at the Tampa Bay Rays. \"I just want to go there and try to build my pitch count to where I feel comfortable, and I can come back sooner.\"Severino ended up throwing 40 pitches at Steinbrenner Field in Tampa, Florida, in the camp game and felt \"pretty good\" afterward.\"I know they want the best for me, but I'm one step closer now and hopefully I'll be back on the field soon,\" Severino said.Severino is also not totally happy with the plan going forward. He is scheduled to pitch for Triple-A Scranton/Wilkes-Barre in an 11:05 a.m. game on Wednesday, but would prefer the night game Thursday.\"I don't want to stay in Scranton, there's not much to do there,\" Severino said. \"And I don't want to drive at six in the morning (from the New York City area). So, hopefully (I can pitch Thursday). One day is not going to be a big deal.\"",
        "Severino has made just 26 starts because of injuries since going 19-8 in 2018. He has also been sidelined by Tommy John surgery and right rotator cuff inflammation.\"Certainly his history plays a little bit of a role in there,\" Yankees manager Aaron Boone said. \"He wants to pitch, he wants to get back here and he wants to be in the rotation. He feels good. I think that is a guy that wants to go.\"Severino said the intrasquad game didn't allow him to get back into the rhythm of the game, including the pitch clock.\"I was really good in spring training, but that was like months ago,\" Severino said.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}