{
    "articleURL": "/news/article-12039049/Liquidation-sales-begin-Bed-Bath-rival-Tuesday-Morning.html",
    "content": [
        "The 50-year-old discount home goods chain filed for bankruptcy in FebruaryBed Bath &amp; Beyond also began shuttering its 360 remaining stores last weekItems have been cut by 30 percent as shoppers rush to bag a bargain in sales Closing down sales have begun at Tuesday Morning stores, as it becomes the latest victim of the 'retail apocalypse' gripping the country. ",
        "The discount home goods chain, which has been in business for nearly 50 years, filed for bankruptcy in February. The retailer follows in the footsteps of Bed Bath &amp; Beyond, which began shuttering its stores last week - just days after it filed for bankruptcy after a last-ditch attempt to stay afloat failed.  Customers lined around the block to try and bag a bargain as the chain began the process of closing all its 360 stores before the end of June.  Tuesday Morning, which was founded in 1974, announced on Facebook that it was beginning liquidation sales across its remaining 464 stores. ",
        "'Starting today, we have begun the process of closing all our stores,' the post said. 'Our Going Out of Business Sale is in stores now, with savings up to 30 percent off.'Thank you for 49 years of loyalty and support.'A later post it urged shoppers not to miss out, and urged them to get in fast as 'the savings won't last.'It also warned customers that it would only accept gift cards through May 13. According to court records seen by WFOX, the company has 464 outlets in 39 states and employs more than 4,000 people. The closures come after the company filed for Chapter 11 bankruptcy on February 14 in Fort Worth, Texas. ",
        "As part of a reorganization effort, the company had planned to close stores in low-traffic areas in a bid to tackle 'exceedingly burdensome debt.' Bosses shut hundreds of stores, taking the portfolio to around 480, from 700 just three years ago. Tuesday Morning had also filed for bankruptcy in 2020 as it struggled to shore up its finances during the pandemic. ",
        "It comes just a week after rival chain Bed Bath &amp; Beyond began similar closing down sales nationwide. Closing down sales kicked off for both Bed Bath &amp; Beyond stores and baby gear sister store buybuy BABY, which has 120 sites across the country.The retailer also announced that shoppers can no longer redeem the store's famous 20 percent off coupons, but gift cards will still be accepted in stores through May 8.Its demise is among the most piercing in recent memory - the company was founded in 1971 and became ubiquitous in the American home goods market.Bed Bath &amp; Beyond warned of a potential bankruptcy in early January when it issued a 'going concern' notice that it might not be able to cover its expenses following a difficult holiday season.The retailer has had to grapple with low inventory levels, lagging sales and dwindling cash reserves. It filed for bankruptcy in a District of New Jersey court on April 23. ",
        "other major retailers"
    ]
}