{
    "articleURL": "/wires/ap/article-12039837/North-Carolina-Republicans-announce-abortion-bill-agreement.html",
    "content": [
        "RALEIGH, N.C. (AP) - North Carolina Republican legislative leaders said on Tuesday there's agreement in the GOP-dominated legislature on backing a measure that would prohibit abortion in nearly all cases after roughly the first trimester of pregnancy.",
        "House Speaker Tim Moore and Senate leader Phil Berger announced at an early-evening news conference that there's consensus between Republicans in the state House and Senate.North Carolina law currently bans nearly all abortions after 20 weeks of pregnancy. The measure would reduce that to 12 weeks, with new exceptions in cases of rape, incest or fetal abnormality. An existing exception for when the life of the pregnant woman is in danger would remain.Final votes for the agreed-upon legislation would occur Wednesday in the House and Thursday in the Senate, legislators said.The bill also contains provisions to make adoptions easier and to improve health care access for children and pregnant women.\"It´s time for North Carolina to take the next step forward in honoring the sanctity of human life,\" said Sen. Joyce Krawiec, a Forsyth County Republican and one of the negotiators of the agreement, adding that the bill \"will undoubtedly save lives and improve health outcomes for many pregnant women.\"",
        "The final measure would go to the desk of Democratic Gov. Roy Cooper, who is a strong supporter of abortion rights. He said in December he would consider it extreme to ban abortion after less than 20 weeks.In a fundraising email to supporters late Tuesday, Cooper called the bill \"an egregious, unacceptable attack on the women of our state.\" Cooper campaigned last fall for legislative candidates that he said would help uphold his vetoes on abortion.",
        "But Republicans now hold veto-proof majorities in both General Assembly chambers after then-Democratic Rep. Tricia Cotham, of Mecklenburg County, switched to the Republican Party last month. Cotham has declined to say publicly whether she would be willing to vote for new restrictions. If she doesn't vote for the bill, some House Democrats likely would have to vote for an override or be absent for Republicans to overcome a Cooper veto.According to legislators, the bill will place limits on the exceptions, capping abortions at 20 weeks in cases of rape or incest and 24 weeks for \"life-limiting\" fetal anomalies, including certain physical or genetic disorders that can be diagnosed prenatally. Doctors could face fines for failing to follow some restrictions in the measure.House and Senate Republicans have been working for months toward a consensus to further act upon last year´s U.S. Supreme Court decision overturning Roe v. Wade. At the time of the ruling last June, abortions were legal in North Carolina until fetal viability, which generally falls between 24 and 28 weeks of pregnancy, or in certain medical emergencies. That made North Carolina a locale for abortion access for those traveling from other Southern states where abortion was already banned.A federal judge in August reinstated the unenforced 20-week ban following the Supreme Court's ruling. At least 88% of the abortions involving North Carolina residents in 2020 occurred at or before 12 weeks of gestation, according to state Department of Health and Human Services data.",
        "Planned Parenthood South Atlantic spokesperson Jillian Riley said the restrictions will have \"detrimental effects\" on the health of North Carolina residents and others from the Southeast. Other critics complained about how the agreement was worked out privately among Republicans over several months without formal public input.\"The people of North Carolina are taking witness, they are listening, they are watching,\" Riley told reporters. \"They do not want any more bans on abortion care. We will remember who voted to strip away legal abortion in North Carolina.\"Republican leadership also billed the measure as a $160 million investment in child care access, maternal health care and paid parental leave for teachers and state employees. The bill includes millions of dollars in funding for foster care families and parents who are working to finish community college.The money set aside also would go to nonprofit community health centers to provide contraceptives to underserved, uninsured or medically indient patients.\"This is a pro-women and holistic approach,\" said Rep. Sarah Stevens, a Surry County Republican and the House's No. 2 leader. \"It´s equipped with as much information, as many options as we could give at this point, and focuses on the health and safety of the child.\"___Hannah Schoenbaum is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}