{
    "articleURL": "/news/article-12048981/Theatre-puts-coercive-control-trigger-warning-musical-romance-Fair-Lady-inspiration-play.html",
    "content": [
        "Pygmalion sees Cockney flower seller Eliza Doolittle turned into a society ladyA theatre has put a coercive control trigger warning on the play that inspired musical romance My Fair Lady inspiration over plot in which a professor gave a Cockney flower seller diction lessons.",
        "George Bernard Shaw's hit play Pygmalion sees Cockney flower seller Eliza Doolittle turned into a society lady by Professor Henry Higgins.Yet theatre-goers shelving out £75 for a chance to see the play at the Old Vic in London will be warned of 'portrayals of abuse, abusive language and coercive control'.Ann Widdecombe said the trigger warning was 'so daft it beggars belief'.The former MP told The Sun: 'One wonders what the point of it all really is. As Eliza Doolittle might say, 'Coercive control, duck? Not Pygmalion likely!'",
        "The play - a satire based on an Ancient Greek story - focuses on the English class system as Prof Higgins takes on a bet to say he can change a working-class flower seller into a would-be duchess in just six months. It was written in 1912 and features Olivier award-winning actors Bertie Carvel and Patsy Ferran.The pair returned to the historic London venue in George Bernard Shaw's classic play, which is being directed by Richard Jones.Carvel plays eccentric linguist professor Henry Higgins, while Ferran takes on the role of Eliza Doolittle.",
        "Pygmalion follows the story of professor Higgins' attempt to win a bet to pass the Covent Garden flower girl off as a lady amongst the great and good of London society.",
        "The production, which will run from September 6 to October 28, will be the first show of The Old Vic's 2023/24 season.Carvel is the recipient of two Olivier awards, the first of which he won for best actor in a leading role in a musical for his role as Miss Trunchbull in Matilda the Musical in 2012.In 2018 he won best actor in a supporting role for his performance as Rupert Murdoch in Ink, which also earned him a Tony award.Ferran won her best actress Olivier award in 2019 for her performance in Summer and Smoke.MailOnline has contacted The Old Vic for comment. "
    ]
}