{
    "articleURL": "/news/royals/article-12050733/Prince-Andrew-goes-solo-drive-Windsor-rest-royals-attend-Coronation-rehearsals.html",
    "content": [
        "The Duke of York, 63, was pictured in his Range Rover on Friday morning Prince Andrew appeared left out in the cold today as he took a solo drive around the grounds of Windsor Castle while the rest of the royals practiced for the Coronation. ",
        "The Duke of York, 63, was pictured in his Range Rover at the historic site in Berkshire this morning, just 24 hours before his brother is set to be crowned King. It came as Charles, Queen Consort Camilla and Prince William were all back at Westminster Abbey for more rehearsals for the big day on Saturday. While Andrew will be attending tomorrow, he - along with Prince Harry - will have no Ceremonial role because he is no longer a working member of the Royal Family. Nor are they expected to appear on the Buckingham Palace balcony following the service - with the Duke of Sussex hoping to jet back to Montecito, California to celebrate his son Archie's birthday with wife Meghan Markle. ",
        "William will be the only royal liege man at the ceremony, and only he will kneel to 'pay homage' to the King, before touching the crown and kissing his father's right cheek. The action is usually performed by all the royal dukes, but Charles scrapped the traditional obligation, effectively absolving Harry and Andrew of any ceremonial duties.   Charles and Camilla waved to crowds as they were driven down The Mall to the church for further preparations on Friday, before a run of diplomatic duties including hosting a Buckingham Palace lunch for VIPs. ",
        "The monarch was also joined by working royals at a special lunch for prime ministers and governors general at the Palace from midday.The King was then set to attend a Commonwealth Heads of Government leaders meeting and garden reception at London's Marlborough House this afternoon. William, the Prince of Wales was also photographed in the back of a car being driven to the Abbey today. Meanwhile Prince Harry may have already landed in the UK for his 24-hour visit for the Coronation - leaving his wife and two children at home.The Duke of Sussex is intending to fly back to California straight after the historic ceremony ends tomorrow afternoon so he can make it back to see Archie on his fourth birthday.This morning a private jet from Van Nuys airport in California landed at Farnborough, the airport closest to Windsor Castle. Van Nuys is just an hour from Harry and Meghan's Montecito mansion, but it is not yet known if he was on board.Some 100 heads of state are descending on London for the coronation on Saturday, with representatives from 203 countries due to attend. Japan's Crown Prince Akishino and Crown Princess Kiko were among those checking in at their London hotel this morning.",
        "On the eve of the coronation, the King and the Royal Family will host a reception for foreign royalty and other overseas dignitaries at the Palace tonight.",
        "French president Emmanuel Macron, Germany and Italy's ceremonial presidents Frank-Walter Steinmeier and Sergio Mattarella and Pakistan's prime minister Shehbaz Sharif will be among those in Westminster Abbey.Chinese vice-president Han Zheng, who presided over a civil liberties crackdown in Hong Kong, is also on the King's guest list, in a move branded 'outrageous' by Conservative MPs.Excitement for the Coronation risks being overshadowed by a furious row about China's involvement.",
        "Beijing yesterday confirmed it was sending Mr Han, accused of overseeing a brutal clampdown on freedom in Hong Kong, to attend the event tomorrow.Lord Patten, the last British governor of Hong Kong, said China's decision to nominate Mr Han to come to London for the celebration showed does not give 'two hoots' about the UK.The Daily Mail also revealed today that Chinese-made surveillance cameras banned from UK Government departments will be 'spying' on the Coronation crowds.Some 38 of the Hikvision devices have been placed across the parade route from Buckingham Palace to Trafalgar Square, sparking national security fears.",
        "Hikvision has worked closely with China's military in the past and British MPs have said its cameras have been deployed in Uighur internment camps in Xinjiang province.The US Government has banned the company from all federal agencies, and Chancellor of the Duchy of Lancaster Oliver Dowden ordered all Ministries last November to remove Hikvision cameras over security concerns.",
        "Lord Patten said the decision to send Mr Han, and the Foreign Office's offer to engage with him, reflects how China sees the UK.'It's an indication of the fact that, however much you grovel to China, however much you try to give them face, they don't give a toss about giving us face because they could have sent lots of other people,' he told BBC Radio 4's World At One programme.'There are, after all, 1.4billion of them and they chose to send the guy who's responsible for breaking their word about Hong Kong.'If it wasn't deliberate, then it shows how casually they actually treat us anyway. So, however hard we try to lean over backwards, horizontally sometimes, to accommodate their own political narrative, I don't think they really give two hoots about us.'"
    ]
}