{
    "articleURL": "/news/article-12043447/Donald-Trump-blasts-Joe-Biden-snubbing-King-Charless-Coronation.html",
    "content": [
        "Donald Trump says it's 'very disrespectful' for Joe Biden not to come to London Donald Trump tonight blasted Joe Biden for snubbing King Charles's Coronation as he suggested the US President was set to be sleeping through the historic event.",
        "The ex-president claimed it was 'very disrespectful' for his successor to be skipping the Westminster Abbey service on Saturday.Mr Biden is not travelling to London for the Coronation with his wife Jill to attend as America's representative instead.This is despite a number of other world leaders, such as French President Emmanuel Macron, heading to the capital for the occasion.Tory MPs have described it as 'foolish' for Mr Biden not to attend, which has increased concerns over his claimed 'anti-British' stance.",
        "The DUP said the US President revealed his 'priorities' with a three-day trip to his ancestral homeland in the Republic of Ireland last month - but deciding not to cross the Atlantic again for the Coronation.Mr and Mrs Biden both travelled to London for the funeral of the Queen last September.His no-show this weekend will not be unprecedented - as no US president has ever previously attended a Coronation ceremony.But, in an interview with Nigel Farage on GB News, Mr Trump joined the backlash at Mr Biden's Coronation snub and suggested the US President was not up to it physically.'I don't think he can do it physically, actually,' the 76-year-old said of his 80-year-old political rival.'I think that it's hard for him to do it physically. I think, getting over here for him.",
        "'He's got a lot of things going and a lot of strange things happen. But certainly he should be here as a representative of our country.'I was surprised when I heard that he wasn't coming.'Mr Trump, who was defeated by Mr Biden in the 2020 presidential election, branded Mr Biden 'incompetent'. He added: 'When you have somebody that's going to be sleeping instead of coming to the Coronation as president of the United States, I think that's, I think it's a bad thing.'Since being kicked out the White House by American voters, Mr Trump has become the first former US president to face criminal charges.They relate to alleged hush-money payments made to the adult film star Stormy Daniels during the 2016 presidential election campaign.But Mr Trump insisted he wasn't worried about an impending trial or a number of other legal cases he is facing.'No, they don't worry me because I'm right and the people who are with me look at my poll numbers,' he said.'I'm killing everybody. I'm way above everybody. Nobody's even close. Including Biden.'You know, I wonder how Biden gets any poll number frankly, the job he's doing. They have horrible policies In many cases, they're very sick, horrible people.'The White House last month rejected claims Mr Biden, who is intensely proud of his Irish heritage, is 'anti-British'.",
        "It came as the US President spent 18 hours in Northern Ireland on 11 and 12 April to mark the 25th anniversary of the Good Friday Agreement.He then headed to the Republic of Ireland for a three-day visit, which included trips to his ancestral homelands of County Mayo and County Louth."
    ]
}