{
    "articleURL": "/news/article-12043647/Protesters-rush-Antony-Blinken-stage-demand-free-Julian-Assange-press-freedom-event.html",
    "content": [
        "Antiwar protesters invaded stage Wednesday at press freedom eventThey urged the Biden administration to drop the extradition of Julian Assange The Wikileaks founder is being held in the UK and faces spy charges in the US  Secretary of State Antony Blinken had not even had a chance to answer the first question at the global press freedom day event on Wednesday when two pink-clad protesters clambered on stage. ",
        "'Excuse us,' said CodePink founder Medea Benjamin politely. 'We can't use this day without calling for the freedom of Julian Assange.' She held a 'Free Julian Assange' sign above her head as a security guard started to manhandle her away. A second protester held a similar sign.She hooked a leg around Blinken's chair, giving her time to demand: 'Stop the extradition request of Julian Assange.",
        "The secretary of state rose awkwardly from his chair as its leg became entangled with Medea's.But he was unflustered enough to urge the security guards not to use excessive force on the interloper.'Take it easy, take it easy guys,' he said.A voice from the audience then joined in. 'Not one word about journalist Shireen Abu-Akleh, who was murdered by the Israeli occupation forces,' he said, raising the case of an Al Jazeera journalist who died during a Israeli military raid in the occupied West Bank city of Jenin nearly a year ago.Then normal service was resumed.'We're here to celebrate freedom of expression, and we just experienced it,' said the event's host, Washington Post columnist David Ignatius.Wikileaks founder Assange, 51, is being held in the U.K., at London's Belmarsh prison.He has been there since 2019 while fighting extradition proceedings. He faces espionage charges in the U.S., and if found guilt could be sentenced to 175 years in prison for publishing thousands of classified documents involving the US military between 2010 and 2011.",
        "His role in revealing military secrets initially made him a free speech hero. However, he has alienated a string of supporters, including journalists who worked with him and the Ecuadorean government which granted him asylum in its London embassy until 2019.But he remains the darling of some anti-war protesters who now campaign for his release.That includes the female protest group Codepink.'This brave truth-teller continues to be incarcerated for exposing U.S crimes,' the group said a recent protect.'At any time, the US could bring this case to a halt by dropping the charges and this is what the Biden administration and the Department of Justice should do.'",
        "Julian Assange founded WikiLeaks in 2006 with the intention to release information on the internet that governments of corporations wanted to be kept secret.WikiLeaks got massive international attention in 2010 when it published a series of military leaks provided by US Army intelligence analyst Chelsea (formerly known as Bradley) Manning.After the 2010 leaks, the US government launched a criminal investigation into WikiLeaks.In November 2010, Sweden issued an arrest warrant for Assange over allegations of sexual misconduct.",
        "He denied the allegation and said the warrant was a ruse for a further extradition to the US over his role publishing secret US military documents. Assange breached bail in the UK and lived in Ecuador's embassy in London from June 2012 until April 2019. He was granted asylum by Ecuador in August 2012 on the grounds of political persecution.In early 2019 Swedish prosecutors dropped their investigation, saying their evidence had 'weakened considerably due to the long period of time that has elapsed since the events in question'.But on April 11, 2019, Assange's asylum was withdrawn after several disputes with Ecuadorian authorities.He was arrested by the British police and has been fighting extradition to the US ever since.  "
    ]
}