{
    "articleURL": "/sport/football/article-12050971/Frank-Lampard-insists-fans-accept-Chelsea-arent-eight-anymore.html",
    "content": [
        "Chelsea have suffered six straight defeats since Lampard returned as caretakerThe under-pressure boss admits it is time for his 12th-placed side to face reality  They make the trip to in-form Bournemouth in the Premier League on SaturdayChelsea boss Frank Lampard has told fans to accept the fact they are not going to finish in the top eight this season as reality of their dire season hits home.",
        "The Blues have lost all six of Lampard's matches since his return to the club as interim head coach and go away to an in-form Bournemouth side on Saturday.In his pre-match press conference, Lampard admitted it is time to face reality as Chelsea head to the Vitality Stadium languishing in 12th place after a shambolic campaign.'We at Chelsea have been fortunate for 20 years,' said Chelsea's all-time record goalscorer. 'When the spotlight is on you, it's on you. You have to understand and handle that. 'Even as a fanbase, you can be frustrated and want more but you can also be understanding of the last 20 years at Chelsea. ",
        "'It's not one for me to sit on and feel hurt by too much. More what's the action to get us out. The action this season won't get us in the Champions League or top eight. Not all fans want to hear that but it's a reality I've come back into.' Lampard continued to discuss his situation at the club, admitting it has been tough after taking as their fourth manager this season following Thomas Tuchel, Graham Potter and Bruno Saltor's departures.He continued: 'I think every situation is different. I'm the third, fourth manager. You can see from that it's been a tough season all round. Every situation is different. A new situation for me because I've been permanent before. ",
        "'It may be more common in the modern day because of the pressures of big business and modern football in the Premier League. 'If you manage, I've had three permanent jobs. Everybody understands the difficulty of the situation I've come into, I understood it coming in. Not much time to lay much down. You have to accept that. 'You have moments where things feel easy and some not so. If you want to list our last four Premier League games, no. They're not good. That's the full picture. Our league position is a reality, our points, goals scored are a reality of the season. Four managers through the season. 'There's a reality. It's not my job to focus too much on that or think on stats from the outside.'Chelsea sit 12th in the Premier League table and could drop as low as 14th if they fall to defeat against Bournemouth this weekend.",
        "The head coach concluded his press conference by telling his players to play for pride rather than position towards the end of the season.'Everyone from the outside wants to say there's not much on it but myself and the players have to show an immense amount of pride,' he said. 'Will we need a reboot in the summer? Sure.'",
        "While no permanent successor for Lampard has been revealed, Mauricio Pochettino has been heavily linked with the Stamford Bridge hot-seat.Lampard will have five matches to turn things around after losing six in a row after taking over from Potter and Saltor this season. "
    ]
}