{
    "articleURL": "/femail/article-12038083/Pub-lunch-Princess-Eugenies-sociable-week-continues-enjoys-Mayfair-outing-friends.html",
    "content": [
        "Princess Eugenie, heavily pregnant with her second child, headed to Mayfair on Tuesday to have lunch with friendsREAD MORE: The Royal Family: Latest news, views, gossip, photos and video | Daily Mail OnlineIt's clearly a week of celebration for Princess Eugenie, who enjoyed a pub lunch with friends in Mayfair today, after attending Ellie Goulding's son's second birthday in Chelsea on Monday.",
        "Prince Andrew and Sarah Ferguson's daughter, 33, who's heavily pregnant with her second child, stepped into a waiting taxi after leaving The Audley Pub in the upmarket London postcode. Wearing a smart camel mid-calf length camel S Max Mara 'Emma' coat and £250 navy Whistles dress with light blue detailing across it, the royal beamed as she bid farewell to pals. Wearing her hair loose and a simple pair of gold earrings and a comfy-looking pair of loafers, Eugenie appeared to have enjoyed an informal lunch with friends ahead of the pomp and ceremony of the Coronation on Saturday. ",
        "Carrying a navy blue handbag, she headed home in a regular London black taxi, with the cab driver opening the door for her.Yesterday, Eugenie was spotted wearing a strikingly similar blue maternity dress while out with her older sister on a star-studded day out as they took their children to Ellie Goulding's son Arthur's birthday.Princess Beatrice, 34, and Eugenie took Sienna Mapelli Mozzi and August Brooksbank to the Bluebird Cafe in Chelsea on Monday as the son of Ellie Goulding and Caspar Jopling turned two, Hello! reports.The sisters are long-time friends of 36-year-old pop singer Ellie, who attended Princess Eugenie's wedding in 2018 and has even holidayed with the sisters over the years. ",
        "It was a family affair as the royals were joined by their husbands, Edoardo Mapelli Mozzi, 37, and Jack Brooksbank, 36 - and the brothers-in-law even coordinated their outfits to attend the birthday.",
        "Both Edo and Jack donned dark jeans, which they paired with matching blue shirts and white T-shirts, and even the same navy-coloured baseball caps. Their sisters however, opted for similar but not matching ensembles, as they stepped out ahead of their uncle King Charles's coronation on Saturday.",
        "Eugenie, who is expecting her second child in the next few months, wore a blue smock dress from Whistles. The royal, who was also accompanied by the couple's two-year-old son August, paired her frock with flat white trainers, and a pair of chic, oversized shades.She wore her brunette hair down, letting it fall in loose waves, and accessorised her outfit with a simple gold necklace.Meanwhile older sibling Beatrice opted for a navy midi dress from Kitri, which she paired with beige trainers. She was pictured carrying carrying the daughter she shares with husband Edo, one-and-a-half-year-old Sienna, as she walked down the London street. ",
        "Both the couples' children - August and Sienna - wore touches of blue in their outfits as well. The outing comes just days ahead of King Charles' coronation, which will take place on May 6.Both Princess Eugenie and Princess Beatrice are expected to attend the event.However, their mother Sarah Ferguson, 63, the Duchess of York, has not been invited to the event. ",
        "Royal commentator Tom Bower told MailOnline that Sarah had excluded herself because of her previous 'conduct'. He added that her presence would 'provoke critical comment which Charles doesn't need'. And royal expert Richard Fitzwilliams praised the 'extremely wise' decision from the King because she has been an 'embarrassment to the Royal Family for many years'.But the apparent decision has surprised some royal watchers - with Meghan Markle's friend Omid Scobie tweeting: 'If true, this feels kinda cruel, no?'Since the snub, the Duchess was spotted in the passenger seat of a Range Rover being driven by her ex-husband.  "
    ]
}