{
    "articleURL": "/news/article-12055847/Australian-journalist-Cheng-Lei-detained-China-spent-1-000-days-bars.html",
    "content": [
        "Cheng Lei was arrested in 2020 and detained awaiting trialCharged with 'illegally supplying state secrets overseas'Details of the allegations have never been revealedThe family of an Australian journalist who has spent almost 1,000 days behind bars in Beijing has launched an appeal to the Chinese government for her release.",
        "Cheng Lei, 47, was a high-profile television anchor for CGTN, an English-language state TV channel aimed at foreign audiences, until August 2020 when she was arrested and charged with 'illegally supplying state secrets overseas'.The exact details of the allegations against her have never been revealed, despite the two-and-a-half years she has spent behind bars.",
        "Ms Cheng has not been allowed to speak with her children, age 14 and 11, who are living in Melbourne with her mother.On Sunday, her partner Nick Coyle told the Australian Financial Review: 'A thousand days is a shockingly long time and I would call upon the relevant authorities in China to resolve this awful situation as quickly as possible.''Fair-minded Australians, from business leaders to political leaders and in the general public, do not accept the status quo.'Ms Cheng was tried in a closed-door hearing in March, but the court is yet to hand down a verdict. A verdict due in April was deferred again for another three months. Her supporters were hopeful that Prime Minister Anthony Albanese could visit China later this year and secure her release, but Beijing has not indicated it would be prepared to let her go.Mr Coyle said his partner is in 'good health', but the separation from her children was a challenge.",
        "'The longer this drags on she really feels it with the kids. That is really difficult,' he told the publication. ",
        "Her only contact with the outside world is one consular visit a month. She is also allowed to write letters to Mr Coyle and her family which are passed on through the representative from the Australian embassy in Beijing.In March, Australian Foreign Minister Penny Wong said her government had 'advocated at every opportunity for Ms Cheng to be reunited with her family.''She is still waiting to learn the outcome of the trial,' Ms Wong said. 'We share the deep concerns of Ms. Cheng's family and friends about the ongoing delays in her case.'China's ambassador to Australia, Xiao Qian, said in January he hoped her case would be solved 'as soon as possible, but we need to respect the legal process'.According to Chinese criminal law, providing state secrets can carry sentences between five and 10 years if the case is considered minor.A case deemed 'serious' can carry a sentence of 10 years to life. China's courts have a conviction rate of 99 per cent. "
    ]
}