{
    "articleURL": "/wires/ap/article-12049477/River-rafters-say-big-California-snowmelt-means-epic-season.html",
    "content": [
        "COLOMA, Calif. (AP) - Triple Threat. Deadman´s Drop. Satan´s Cesspool. After years of drought, the rapids along California's American River are truly living up to their names.",
        "As a historic snowpack starts to melt, the spring runoff is fueling conditions for some of the best whitewater in years on the American River and its forks, which course through the Sierra Nevada northeast of Sacramento.\"This is an epic whitewater rafting season,\" said Deric Rothe, who owns Sierra Whitewater Inc. and has been rafting for decades. \"The conditions are awesome. If you compare the rafting to a rollercoaster, it´s bigger, faster, more fun and more exciting. So, we´re loving it.\"A series of powerful storms dumped record amounts of rain and snow across California this winter, replenishing rivers and reservoirs and bringing an end - mostly - to the state´s three-year drought.Cascading volumes of water are now flowing into various rivers at rates not seen in years.Even with the snowmelt only starting, the American River, which originates high in the Sierra Nevada just west of Lake Tahoe, is already seeing more than three times the volume of water rushing by per second compared to previous years, said Jessica Wallstrom of OARS, one of dozens of rafting companies offering trips on the river.",
        "\"It´s really fast,\" she said. \"Places that might seem mellow, there´s a lot of current going under the water at a very high speed, and you don´t really know that until you´re in it.\"",
        "On a recent day, an OARS guide barked instructions over the roaring waters for each side to row forward or backward. Then he suddenly yelled \"Stop!\" Rafters in life jackets and helmets pulled up their paddles and gripped the raft´s ropes, holding on before barreling down Satan´s Cesspool, a Class III+ rapids. The chilly water splashed as they whooped and cheered.The conditions are a sharp contrast to recent years, which were among the driest on record. Guides relied on scheduled releases of water from upstream dams to be able to offer trips a few days a week, and the seasons often were short, ending in late summer. This year rafting companies are planning to operate seven days a week and well into the fall.In 2022, only limited trips could be made on the river´s North Fork, which is mostly for expert rafters, because of the low water levels. This season the North Fork's levels have already risen too high for some outfitters, but the flows change daily, and it's expected to be among the best spots for experienced rafters, guides say.But more water also means more risks. Rafting companies say their guides have undergone additional safety training and swift water rescue courses, and they have navigated areas to know which spots to avoid while monitoring the changing flows.",
        "It´s not just the big, fast rapids that pose a danger, Wallstrom said.\"There´s a lot more trees in the water along the sides of the river, especially after four years of drought,\" she said.Conditions vary widely from river to river and even along the same river, like the American, with its South Fork being milder, offering places for even families with children to go.One way rafting guides keep their clients safe is by looking for river eddies, which are spots where part of the river doubles back and slows down, offering an off-ramp from the surging current.OARS guide Garret Thomason said he'll use an eddy to \"check in with my team, check in with my crew, maybe watch the rest of the boats go down the ramp and make sure they´re OK. Then we can pull back out, get in the current and continue downriver.\"In the Southern Sierra, Tulare County Sheriff Mike Boudreaux on Thursday issued temporary closures for parts of the Kaweah, Kern and Tule rivers due to the cold, swift water, restricting access to rafting companies with experienced guides and proper safety equipment, as well as experienced rafters and kayakers. Officials in neighboring Kern County also warned people to not raft on their own on the county's stretch of the Kern River but stopped short of issuing closures.",
        "Last week, National Park officials temporarily closed a portion of the Yosemite Valley after forecasters warned of flooding from the Merced River, also popular for rafting.Still, with so many rivers roaring to life, guides say there are plenty of spots to enjoy some of the best conditions in a long time.\"If people are sober, pay attention, listen to their guides and actively participate, they´ll be safe,\" said Rothe of Sierra Whitewater Inc. \"It´s going to be exciting. The best season ever.\"___Watson reported from San Diego."
    ]
}