{
    "articleURL": "/news/article-12059133/Motorists-VW-4x4-gets-caught-incoming-tide-wheels-sank-sand-Somerset-beach.html",
    "content": [
        "The Volkswage Tiguan got stuck in the sand and mud on Somerset's Brean BeachREAD MORE: 39-foot fin WHALE dies after becoming stranded in the North Sea A motorist's 4x4 got caught by the incoming tide after its wheels sank into the soft sand on a Somerset beach.",
        "The Volkswagen Tiguan got stuck in the sand and mud after it was driven too far down Brean Beach by a day tripper.Brean's beach warden raised the alarm just before 4.30pm and Burnham Coastguards were quickly on scene to check that the driver was safely out and no-one else was inside.Given its location so far down the beach, a commercial recovery service was called to try and retrieve the vehicle before the tide could reach it.However, crews were unable to do so before the tide surrounded it.",
        "The car driver, from the Midlands, told Burnham-On-Sea.com he was visiting Brean on a day trip when the drama unfolded.'I didn't realise the car would get stuck. 'I just drove down towards the sea and hit a soft patch where the wheels got stuck.'He added: 'I was surprised when I realised what was happening.'A further attempt to retrieve the vehicle will be undertaken.The beach is notorious for the number of that get stuck there, with countless incidences of by swamped vehicles. ",
        "In 2020, a car 'swallowed by the sea' faced multiple failed attempts at getting it free.And the coastguard issued a warning as there were reports of children 'jumping on the roof' and urged residents to stay away from the area. ",
        "At the time a Facebook post from the coastguard's page read: 'The ground around the vehicle could be unstable and have unexpected soft patches that you may become stuck in and the water around the vehicle could hide unseen dangers that you could cause injury especially if you fall off while climbing on it.'Please stay away from it at all times.'"
    ]
}