{
    "articleURL": "/sport/football/article-12055481/Man-United-boss-Erik-ten-Hag-hails-bravery-David-Moyes-succeeding-Sir-Alex-Ferguson.html",
    "content": [
        "Moyes was handpicked by Ferguson to replace him at Man United in 2013 Moyes’s ill-fated 10-month stint at Old Trafford tainted his own reputation Ten Hag is the fifth manager to try and restore the club to its glory yearsErik ten Hag says he admires David Moyes for the ‘bravery’ he showed to succeed Sir Alex Ferguson as manager of Manchester United.",
        "West Ham boss Moyes was handpicked by Ferguson to replace United’s greatest manager in 2013 the club won its 20th league title but the ‘Chosen One’ was sacked 10 months later.Moyes’s ill-fated stint at Old Trafford tainted his own reputation while United have long struggled to find a manager able to return the club to its glory years.Ten Hag is the fifth permanent appointment since Ferguson, following Moyes, Louis van Gaal, Jose Mourinho and Ole Gunnar Solskjaer and the first to shown signs of building for long-term success.‘It is quite clear that when you have to succeed Sir Alex that is a big challenge and a really difficult job to do,’ said Ten Hag ahead of the clash with Moyes’s West Ham.",
        "‘He did it and had the bravery to do it, that is why I admire him. He is also that long in the job already with many clubs in the Premier League. He is a great manager with a lot of skills, I know my team must be at their best and we must play our maximum if we want to get a result we need and that is a win.’United remain favourites to secure a top-four place albeit in the face of increasing pressure after their dramatic defeat at Brighton on Thursday when Luke Shaw’s handball gave the Seagulls a stoppage-time penalty at the end of an ill-tempered second half.",
        "Liverpool’s 1-0 victory over Brentford on Saturday means United sit just a point above Jurgen Klopp’s side but with two games in hand.‘We have to keep our heads clear,’ added Ten Hag after emotions bubbled over at the Amex Stadium with Shaw having received a yellow card for dissent moments before conceding the penalty.‘But I also demand passion and desire from my players. You need that it brought us to where we are now.‘That is what I am telling them every game and training session. You have to be ready for every game. If you want to be in four competitions, you have to be so prepared and need so much energy with a good game plan. You can't do it at 99 per cent, it has to be 100 per cent and it has to be for the full 95 minutes.‘We like it, that is why players like it but it costs energy. That is our job and we have to take it, Sunday we go again and I'm sure we will be there.’What’s most frustrating for Shaw is the knowledge that United were eight points clear inside the top four at the end of February – only for defeats to Liverpool, Newcastle and Brighton and a draw at Southampton to leave them scrapping for a Champions League place that had looked so secure.",
        "‘That’s what’s even more disappointing,’ said Shaw. ‘It was extremely comfortable at one point. But the way we have been playing and the results we have had, we've now got dragged back into a fight that we didn't want to be in.’Shaw admitted he ‘cost United a point’. ‘I can't even explain the decision, what happened, what I did – I’m just really disappointed,’ he added. ‘Not just for me, but for the team, the way we fought.‘I think we have to look at the whole game. In the first half, the big chances we created, we have to score them. Then it makes the game completely different. But I think that's the way our season has been really – we've had a lot of chances early on in games and not been clinical. And then we have a fight the whole game and it always goes down to the end.‘We have to refocus. We have to get ready because West Ham are fighting for their lives. Whenever we go there, it's a tough game. We have to move on quickly from this and refocus again.’Ten Hag also blamed United’s packed fixture list for their slump in performances with their run to the Europa League quarter-finals seeing them playing in Europe on Thursday nights before Premier League matches on a Sunday.",
        "Their run to the FA Cup final means United have played 16 games since the start of March.Ten Hag believes only West Ham, who are still in the semi-finals of the Europa Conference League, have had a more draining campaign.‘It has already an impact on the whole season and we are doing quite well with the schedule,’ said Ten Hag. ‘Not only quite well, really well. We have a big disadvantage against others. West Ham United have the worst schedule but we have showed all season already that we are very strong physically and mentally.‘That is the great advantage [of being in the Champions League]. Playing in the Champions League you have a better week.’"
    ]
}