{
    "articleURL": "/femail/article-12054305/Whos-Buckingham-Palace-balcony.html",
    "content": [
        "Senior members of the Royal Family and the late Queen's cousins were among those the Palace balcony Read more: King Charles Coronation LIVE - King is crowned in front of Queen Camilla, Harry, Kate and WilliamHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk A big question around King Charles and Queen Camilla's Coronation had been who would be seen on the Buckingham Palace balcony.",
        "We now have an answer - after senior members of the Royal Family, Camilla's grandchildren and those involved in the Coronation ceremony took to the traditional spot to watch a scaled-back flyover this afternoon.Wildcat helicopters took to the skies over Buckingham Palace due to the adverse weather, before the Red Arrows put on a fantastic display of red, white and blue for the thousands who had gathered in London to watch.Here, FEMAIL talks you through who made the cut for the Buckingham Palace balcony...",
        "1. Prince Edward, Duke of Edinburgh: The Queen's youngest child Prince Edward was today joined by his wife the Duchess of Edinburgh and children Lady Louise and James, Viscount Severn. He was granted the title of Duke of Edinburgh by Charles following the death of their mother the Queen.2. Lady Louise Windsor: The daughter of the Duke and Duchess of Edinburgh is often regarded as a secret weapon for the Royal Family, and tends to lead a low key life.3. James, Earl of Wessex: The late Queen's youngest grandchild, James, Viscount Severn, is only 15 years old but has stepped up to take a prominent role in events since his grandmother died. 4. Princess Charlotte: The granddaughter of the King and Queen is eight-year-old Princess Charlotte. The second-eldest Wales sibling celebrated her eighth birthday this week.",
        "5. Sophie, Duchess of Edinburgh: The Duchess of Edinburgh joined her husband and children for the big event today. She was famously close to her mother-in-law the late Queen and is considered by many to be a 'secret weapon' within the Royal Family.",
        "6. Vice Admiral Sir Timothy Laurence: The 67-year-old retired Royal Navy Vice Admiral, husband of the Princess Royal, is an unsung hero of the Royal Family who stays largely out of the spotlight. Today he joined his wife and brothers-in-law for the big day.7. Prince Louis: The third and youngest child of the Prince and Princess of Wales is five-year-old Louis. He is typically in childlike spirits - as you would expect - on state occasions like this.8. Princess Anne: The King's sister, who is often regarded as the 'hardest working royal', was in good spirits today as she joined members of the Royal Family for the event. 9. Princess of Wales: The Princess of Wales, 41, dazzled in a bespoke ivory Alexander McQueen gown and a stunning floral headpiece.10. Prince of Wales: Heir to the throne Prince William, who handed his father the crown during the Coronation ceremony, shared an emotional moment with his father inside Westminster Abbey.11. Lord Oliver Cholmondeley: The son of the Marquess of Cholmondeley was one of the King’s Pages of Honour. His twin brother Alexander was not involved in the Coronation.",
        "12. Prince George: The nine-year-old eldest child of the Prince and Princess of Wales was a page of honour in today's ceremony and carried his grandfather King Charles's train.13. Nicholas Barclay: The grandson of Sarah Troughton, one of the King’s second cousins.14. Ralph Tollemache: The son of King Charles’s godson, Edward Tollemache.15. King Charles: The King, 74, wore the Imperial State Crown, which is set with 2,868 diamonds, as he appeared on the balcony at Buckingham Palace.16. Queen Camilla: The Queen, 75, stood proudly with her husband King Charles and marvelled at the flypast as they stood on the balcony at Buckingham Palace.",
        "17. Freddy Parker Bowles: Queen Camilla's grandson and the son of food writer Tom Parker Bowles was a page of honour during the ceremony. His father recently joked that Freddy, 13, had been involved in 'a lot of rehearsals' ahead of the Coronation.18. Louis Lopes: Louis Lopes, 12, is the grandson of Queen Camilla and the twin brother of Gus. His mother is Laura Lopes, Queen Camilla's daughter.19. Arthur Elliot: Arthur Elliot is Queen Camilla's great-nephew, and the son of Ben Elliot and Mary-Clare Winwood.20. Annabel Elliot: Annabel Elliot is Queen Camilla's sister. She is an interior designer and antiques dealer. The sisters also had a brother, Mark Shand, who tragically died in 2014.",
        "21: Gus Lopes: Gus Lopes, 12, is the twin brother of Louis, and the son of Laura Lopes. There was speculation over whether Gus would be able to act as a page of honour after he broke his arm in a bike accident while on holiday.22. Lady Fiona Lansdowne: Fiona Petty-Fitzmaurice, Marchioness of Landsdowne, is a British peer and interior designer and a Lady in Attendance for Queen Camilla.23. Princess Alexandra: Princess Alexandra, the Honourable Lady Oglivy, 86, is a first cousin of the late Queen Elizabeth II, with her father being a brother of King George VI.24. Duke of Kent: Prince Edward, Duke of Kent, 87, is a first cousin of the late Queen Elizabeth II. He is married to Katharine, Duchess of Kent."
    ]
}