{
    "articleURL": "/wires/ap/article-12038817/Delhi-stuns-Gujarat-5-runs-Indian-Premier-League.html",
    "content": [
        "AHMEDABAD, India (AP) - Last-place Delhi Capitals knocked off mighty Gujarat Titans by five runs in a low-scoring game Tuesday in the Indian Premier League.",
        "Little-known Aman Khan (51) lifted Delhi from a precarious 23-5 to 130-8 with his first-ever half-century in any format after captain David Warner won the toss and elected to bat on a wicket where fast bowlers found plenty of assistance.Gujarat's top-order also stumbled against Delhi pace before captain Hardik Pandya´s unbeaten 59 went in vain as the experienced Ishant Sharma got the key wicket of Rahul Tewatia (20) in the last over to restrict the home team at 125-6.\"Our bowlers were absolutely amazing,\" Warner said. \"With Ishant forever getting younger and coming out and delivering, it´s amazing to see him. How much did he hold his nerves there at the end, credit to him.\"Tewatia brought down the target to 12 off the final six deliveries by smashing three successive sixes off Anrich Nortje's last three deliveries in the penultimate over, but spliced an easy catch at extra cover off Sharma´s length ball to give Delhi its third win in the last four matches.Gujarat still sits pretty atop the table with 12 points while Delhi is last with six.",
        "Mohammed Shami (4-11) bowled four brilliant overs at a stretch upfront that knocked off Delhi´s top-order and Warner was run-out in a mix-up with Priyam Garg in the second over.",
        "Shami had Phil Salt caught at covers off the first ball before finding outside edges of Garg, Rilee Rossouw and Manish Pandey´s bats with his impeccable lengths.But Aman revived Delhi´s hopes by sharing two half-century stands with Axar Patel, who made 27, and Ripal Patel (23).Gujarat also had a disastrous start when Wriddhiman Saha was caught behind without scoring off left-arm fast bowler Khaleel Ahmed and Nortje had impact player Shubman Gill caught in the cover off his first ball.Sharma bowled Vijay Shankar with a superb knuckle ball that took the pace of the ball and David Miller left Gujarat in deep trouble at 32-4 when he went for an overambitious ramp shot against Kuldeep Yadav and was clean bowled without scoring.Abhinav Manohar (26) put the chase back on track with Pandya, who completed his half-century off 44 balls with seven fours, but Delhi kept its nerves in the death overs against Tewatia´s late charge to pull off the win.\"I tried my best but could not capitalize,\" Pandya said. \"It boils down to me. We were hoping to get a couple of big overs in the middle but at that point of time we could not get rhythm.\"___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}