{
    "articleURL": "/wires/pa/article-12049739/Mechanic-lost-six-stone-just-10-months-playing-football-nominated-amazing-loser-award.html",
    "content": [
        "A mechanic who lost more than six stone in just 10 months by playing football has been nominated for an ‘amazing loser’ award.",
        "Lee O’Kelly, 33, who missed playing football during the pandemic, joined MAN v FAT, a weight loss programme where participants meet weekly for a weigh in and a game of five-a-side, in May 2022.Dropping from 17st 2lb to 11st in 10 months, Lee has now been nominated for an award by the programme which will hold the ceremony at the Football Museum in Manchester this month.",
        "Lee, who lives in Chester with his wife, Katy, 29, who works in a school, said: “What I love most about MAN v FAT is the camaraderie, it’s such a welcoming place.“It has also done wonders for my mental health by getting back out and doing something with a great bunch of guys that you know have your back when you’re feeling low.“It has been difficult at times, but I’ve always had the guys to fall back on and pick me up when I’m down, also with a strong backing from my wife keeping me going even when I was getting ‘hangry’!“Without these people in my life, I don’t think I’d have managed it.”Lee signed up to the MAN v FAT weight loss programme in May 2022 after his brother-in-law spotted an advert on TV and attended a meeting.",
        "Prior to the first Covid lockdown in March 2020, Lee would play football frequently with friends and family but said that after the pandemic, his motivation had waned.",
        "Looking for a way to get back into the sport, Lee joined his brother-in-law for a MAN v FAT meeting.He said: “It’s almost 12 months to the day since I went to my first session. The regular football I’d been doing broke down with lockdown and never really got going again once we were all allowed to start playing after Covid.”",
        "“I wasn’t doing anything in terms of sport or fitness when my brother-in-law told me about MAN v FAT and suggested I come along.”Weighing in on his first week at 17st 2lb, Lee said the weight started to drop easily through weekly football games with other men on the programme.He said: “When I first joined, I was the heaviest I’d been for some years and it really was getting me down. At first, I didn’t really change a lot dietwise and I thought I was getting away with it by gradually losing week by week until the week I thought I’d had a good week not eating too much rubbish, no alcohol and I put about 1.5kg on.”",
        "Breakfast – nothingLunch – Meal Deal sandwich with crisps, chocolate and an energy drink or sugary fizzy drinkSnack – biscuits or doughnutsDinner – a large portion of spaghetti bolognese with garlic bread and cheeseSnack – chocolate or sweets",
        "“This was a turning point for me. I felt I’d let my teammates down, so I began to look at my diet and really focus my mind. I cut out junk food, alcohol and started to eat healthily and to the right portion size.”Prior to his weight loss, Lee would order three takeaways a week, which he cut out along with snacking between meals.Controlling his portions, Lee began to shed the pounds, and by March 2023, he weighed in at 11st, 6st 2lb lighter than when he started.",
        "Lee said: “It’s been a massive change in the past year which friends and family have noticed.“A couple of friends have joked and said if I step sideways I’ll fall through a grid but everybody’s commented on the change.“I noticed my clothes getting bigger and having to buy new things, but I don’t think it really hit me until I saw side-by-side photos of me.”",
        "Lee’s wife has also been supportive of his weight loss journey. He said: “She quite happy to let me cook separately sometimes and has been a real support for me, as sometimes I’ve been ‘hangry’.”But Lee said the biggest change he has noticed has been his fitness levels and ability to do more.",
        "He added: “Before joining MAN v FAT, it was a bit of an effort to go up a couple flights of stairs, I’d be out of breath.”",
        "“Now I run to and from the weekly football games which take place three miles from where I live because the game itself isn’t enough of a workout for me anymore.“I feel great and it’s not only improved my physical health but my mental health too.”Now, Lee is working towards maintaining his weight and continues to attend the weekly football games.",
        "Breakfast – a protein yoghurt or overnight oatsLunch – a protein shake and a bananaDinner – chicken and rice",
        "He has since been nominated for a MAN v FAT Football award in the ‘Amazing Loser’ category, which recognises players who have had outstanding journeys through the programme, losing life-changing amounts of weight and acting as inspiration for their fellow players.The ceremony takes place at the Football Museum in Manchester on May 20, 2023.Lee said: “It’s nice to get recognition for the work I’ve put in. MAN v FAT is great because you end up with so many new people to talk to, it’s like I’ve got a brand new group of best mates.“I’ve found weight loss groups intimidating in the past but everyone I’ve met through football have been welcoming and I know we’re all here for the same reason, to get healthier and enjoy a game of football.”"
    ]
}