{
    "articleURL": "/columnists/article-12044157/PETER-HITCHENS-Archbishop-300-years-not-pray-terror-punishment-evildoers.html",
    "content": [
        "It turns out that Saturday's Coronation has been cleverly altered to make it fit in with the soppy liberalism of Justin Welby's Church of England and of the new elite.During the presentation of the Sword of State to the new monarch, every Archbishop for more than 300 years has prayed, as Geoffrey Fisher did before Queen Elizabeth II and as Cosmo Lang did before George VI, these rather moving words: 'Hear our prayers, O Lord, we beseech thee, and so direct and support thy servant Queen Elizabeth, that she may not bear the Sword in vain; but may use it as the minister of God for the terror and punishment of evildoers, and for the protection and encouragement of those that do well.'I have tracked this all the way back to the Coronation of William and Mary in April 1689, and the prayer has remained unchanged.",
        "At the Coronation of Charles II on April 23, 1661, they were if anything fiercer. Archbishop William Juxon said: 'Hear our Prayers we beseech thee O Lord, and vouchsafe by thy Right Hand of Majesty, to bless and sanctify this Sword, wherewith this thy Servant Charles desireth to be girt, that it may be a Defence and Protection, of Churches, Widows, and Orphans, and all thy Servants; and a Terror to all those that lie in wait to do mischief.'The gutted and denatured version of the prayer which survives runs: 'Hear our prayers, O Lord, we beseech thee and so direct and support thy servant King Charles, that he may not bear the Sword in vain; but may use it as the minister of God to resist evil and defend the good.' Those who broke the law suffered, swiftly and clearly  How striking it is to note, after a simple scan of the news yesterday, that the importance of the state's duty to protect good, gentle people against predatory evildoers has not gone away during the 70 years since the prayer was offered. It has grown more intense.I doubt whether London has ever been safer than it was in the years soon after the war, when the young Queen was crowned. Perhaps at that time the pledge seemed old-fashioned and archaic. But it is not. This newspaper reported yesterday that a woman, going about her lawful business on a London street at 4.45pm, in the full light of day, had been stabbed to death just yards from a police station (yes, they still exist).The victim was on the phone to her grandmother when the attacker struck and suddenly began shouting and screaming.Residents of the area had been begging the police to provide more of a presence, because of anti-social behaviour and drug use.Quite a lot of people living in the growing number of crime-infested areas of Britain can remember when things were better, when police patrolled, when crime was rare and when those who broke the law suffered, swiftly and clearly. This is how deterrence works — this is the 'terror' described in the prayer.The knowledge that cruel greed and brutality to your fellow creatures would be punished was a huge deterrent to the many who in those days considered committing crime, and then thought better of it.The huge difference between then and now is that those inclined towards crime know they will get away with it. Steal a car, rob a shop or burgle a house and it will not even be investigated. Bad people need to be afraid of authority  They know that the police are absent, that excuses will be made for them if they are stupid enough to be caught (and generally it is only the exceptionally dim and the stragglers who are caught). They know above all that severe punishment is very unlikely.If they eventually do go to prison, after perhaps 100 crimes overlooked, excused and feebly punished with meaningless cautions, uncollected fines, unactivated suspended sentences and rigour-free community service, they will be among friends in weakly run warehouse prisons, where drugs are readily available.It is the thousands who used to be afraid to rob and hurt, and who now are not, who demonstrate the failure of a system afraid to use the word 'punishment' and too naive to realise that bad people need to be afraid of authority, if the rest of us are to be allowed to get on with our lives.Long ago, before modern reformers took hold of this country, the English Prison Commissioners defined their task as 'the due punishment of fully responsible persons'. Note the tough, simple English of the words and the key assumptions: that criminals are responsible for their acts and punishment is due to them.This was still more or less true until the early 1960s, when the arch-reformer Roy Jenkins got hold of the justice system, doing enormous damage to the police, to justice as a whole and to the prisons.Since then the police have ceased to be stern law-enforcers, strongly biased against criminals, and become neutral referees between offender and victim. They therefore see no need to patrol the streets any more.It was in many ways the single greatest change in our way of life achieved by deliberate government action. And it was never put before the public in a manifesto. Nor, when it was done, did the Tory party make any effort to undo it.They, too, seemed to have swallowed the sociology and psychology mumbo-jumbo view that crime is caused by deprivation, abuse and poverty, rather than by human evil. Police ceased to be stern law-enforcers  But until now, the deep constitution of the country, embodied in the Coronation Service, was the one clause in our governing charter which reminded everyone of what we used to do.Importantly, it linked the idea of 'due punishment of fully responsible persons' (as it should be) to serious Christianity and to the beloved institution of monarchy.There are lots of other fascinating changes in the Coronation Service — most, though not all, of them in a milk-and-water, soppy, dumbed-down direction. But this gutting of the state's duty to deter and punish crime is absolutely not accidental.In an article on my fears for the Coronation, published back in January 2020, I actually wrote: 'Terror and punishment of evildoers'? I cannot hear these words in the bureaucratic accents of Mr Justin Welby, try as I may.'And now I never will hear them. There will have been a lot of thought about it and I would guess a lot of that thought was in Lambeth Palace.But I would also guess that Charles could have kept the traditional wording if he had wanted it. What a shame Church and Crown together have combined to endorse one of the biggest mistakes this country's governing class ever made."
    ]
}