{
    "articleURL": "/tvshowbiz/article-12060511/Holly-Willoughby-plunges-FREEZING-ice-bath.html",
    "content": [
        "Holly Willoughby braved a freezing cold ice bath on Monday which she proclaimed was 'bl**dy cold!'",
        "The This Morning presenter, 42, donned a long sleeve multicoloured swimsuit which showed off her figure as well as a beanie hat as she shared a clip on Instagram.Holly looked dubious at the start of the video as she showed off the chilly water and seemed nervous.She then lowered herself down and pulled some animated facial expressions as she acclimatised to the low temperatures. Holly then started smiling as she realised her achievement as she concentrated on her breathing and held her hands together in front of her chest. ",
        "She then jumped back out again after the effort as an inspirational quote played over the footage. She penned in the caption: 'Right let's begin this icy journey! After working with @iceman_hof and the whole #freezethefear team, it's taken a year, but I'm finally doing it for you… didn't last long but build up slowly right? 'Wow, that was bl**dy cold but I did feel incredible after… @brassmonkeyice I did it! #ice #breathe.'Holly presented Freeze the Fear with Wim Hof last year where a host of stars took on icy challenges. It comes after earlier this week Holly  showcased her new style as she posed for photos on Instagram in a glamorous linen striped suit.The beauty looked effortlessly glamorous in the black and white snap shared to her 8.2million followers. ",
        "She went barefoot in the wide legged trousers and fitted linen blazer from Marks and Spencer as she promoted the brands new collection. The ITV host applied a flawless palette of makeup to accentuate her beauty including an eye catching pink lipstick and bold black eyeliner. ",
        "Holly styled her blonde tresses in loose waves as they cascaded to her shoulders from a side parting.She penned: 'It's time for another M&amp;S edit and this time it's all about tailored suits...slightly obsessed with suits at the moment...This striped look is beautiful and elevated.'It came after Holly led the stars taking to social media in anticipation for the Coronation on Friday afternoon.The star uploaded an image of a crown shape cake she made following a segment on Thursday's This Morning in which chef Juliet Sear showed viewers how to make and decorate the iced treat.Holly revealed her plans for the day comprised eating cake with her kids, Chester, 13, Belle, 12, and Harry, eight, sipping bubbles and watching the festivities.Holly looked radiant in the snap as she smiled for the camera while brandishing the cake and revealing she has spent the entire night and day creating the treat.She penned: 'Well @julietsear and @thismorning I did it!!! Started it last night and just finished… don’t look too closely…",
        "'It may not be perfect but I can’t wait to have slice with the kids and a glass of bubbles whilst watching the Coronation tomorrow … whatever and wherever you are this weekend enjoy the moment and I hope cake is involved somewhere '."
    ]
}