{
    "articleURL": "/tvshowbiz/article-12044575/The-REAL-reason-Amber-Turner-Dan-Edgar-split-six-years-revealed.html",
    "content": [
        "The real reason Amber Turner and Dan Edgar split after a six-year romance has reportedly been revealed.",
        "The TOWIE star couple's break-up was confirmed by Amber, 29, on Instagram on Tuesday, who claimed that she felt forced to release a statement after split rumours swirled when Dan, 31, unfollowed her on social media.And now it's been claimed that the reason Amber ended their relationship is because she was tired of waiting for her long-term boyfriend to propose. It is said that Amber had been desperate to settle down with the hunk and 'lost her patience' after being left disappointed that he didn't pop the question after they purchased their dream home together last year.A source told The Sun: 'Amber has been desperate to settle down for years now, but Dan has always been hesitant.",
        "'She was convinced a proposal would be coming soon after they moved into their dream home together at the end of last year. But Dan has failed to make the changes he promised to make for Amber and still seems undecided about the future.'They went on: 'Amber was always willing to give Dan time as he shied away from commitment, but she lost patience.'The insider added that the blonde bombshell knows she wants to get married and have children some day, but refused to 'waste anymore time' on a person who just 'wasn't ready'.  ",
        "MailOnline have contacted representatives of Amber and Dan for comment. Amber told her followers this week of their split: 'I wasn't going to post anything but due to speculation and questions I feel like I need to. Yes me and Dan have split'.She continued: 'I honestly wish him the best for the future. Please respect our privacy at this time. Thank you'. Following the announcement, Amber was pictured driving away from the 'dream' Essex mansion they had recently purchased together just before Christmas.Amber was seen at the wheel of the white Mercedes 4x4 before heading to join her friend Courtney Green for a coffee in a local café.",
        "Later the same day, Dan was pictured arriving at the house. However it was previously understood that he has moved out of their home. Amber has just returned from a UAE city celebrating her mum Suzanne's 60th birthday following the shock split. Despite being an item since 2017, it's certainly not the first time cracks have shown in Dan and Amber's relationship. Last year, Ella Rae Wise slammed the former electrician for acting 'inappropriately' in a nightclub and claimed Amber shouldn't trust him.TOWIE star Ella, then 22, told MailOnline Dan 'needs to keep his hands to himself' and she was shocked he behaved in such a way given he's in a long-term relationship.",
        "In an exclusive interview, Ella explained that Dan is yet to apologise for the incident, which allegedly took place during a night out last year, and she's been branded a 'liar' by her co-stars, including Amber's close friends Chloe Meadows and Courtney Green.She said: 'Dan needs to keep his hands to himself really. He shouldn't touch up other girls when he has a girlfriend.'He was hands on and given he has a girlfriend, it was inappropriate.'With his track record I don't know how she can allow her man to go out.",
        "'I'm not the biggest fan of theirs and they're not the biggest fans of me but I'm the worst person he could have touched up in a club because I'm not going to keep it a secret.'I've been called a liar, which is fine because I've been called a liar before on the show and I can see why they would have animosity towards me but if her boyfriend were to touch up someone – I'm not the best person because I am going to tell the truth.'Those girls automatically thought I was lying about it, but I wasn't. Dan was horrible to me afterwards, but you'll see on the new series.'A source close to the show told MailOnline: 'Dan put his hands around Ella's waist while they were in a club – nothing more.'",
        "MailOnline revealed last June that Amber's relationship with Dan had been rocked following claims he 'always wanted a piece of Ella.' "
    ]
}