{
    "articleURL": "/wires/reuters/article-12045943/Lofty-prices-tarnish-golds-lustre-Asian-retail-hubs.html",
    "content": [
        "Chinese gold sellers slash premiums to boost sales",
        "Indian dealers offered discounts up to $57/ouncePotential buyers awaiting a further correction in gold pricesChina's gold demand expected to slow in second quarter - analystBy Amy Lv, Rajendra Jadhav and Kavya GuduruBEIJING/MUMBAI/BENGALURU, May 4 (Reuters) - On a recent evening in April, only three or four people browsed among the several gold jewellery booths in a plaza in Beijing's high-end Wangfujing shopping district and all left without buying anything.\"I'm just taking a look. I do not consider buying right now because prices are too high at the moment,\" said one of the people, a woman who declined to give her name when asked by Reuters, but said she was 50 years old. She said she might consider buying if gold prices fell to around 300 to 400 yuan a gram, from nearly 600 yuan ($87) a gram at the time.Shoppers leaving empty-handed complaining of high prices are becoming a more common sight at gold stores in China and India, respectively the world's largest and second-largest retail gold consumers.With gold prices just off their records of 2020, pushed higher by safe-haven investors seeking solace amid recession fears and banking crises in the U.S. and Europe, retail buyers are eschewing rings, earrings and necklaces.",
        "But without that retail support, there are concerns the rising gold prices will stall, especially as central banks have raised interest rates to their highest in years, reducing the allure of holding non-yielding bullion.\"To sustain a rally in global prices, physical demand from India and China is absolutely critical. Without this, there would be a natural cap on how high prices could potentially rise,\" said Prithviraj Kothari, the President of the India Bullion and Jewellers Association Ltd (IBJA).Global gold prices surged to $2,072.19 an ounce on Thursday, only cents away from the record set on Aug. 7, 2020. Prices have risen 12% so far in 2023.In India, local gold prices soared to a record 61,490 rupees ($752) per 10 grams on Thursday.Investment and jewellery consumption in China and India accounted for 48% of total global retail demand in 2022, according to Debajit Saha, analyst at Refinitiv Metals Research, making primary producers heavily dependent on them.Dealers in China have responded to the high prices by slashing premiums from as high as $40 an ounce over global spot prices in early March to small discounts toward the end of the month. Prices are now at small premiums of $1 to $9 per ounce.Although Chinese buyers were undeterred by high prices in the first quarter, \"we anticipate a slowdown in demand during the second quarter... the rapid depletion of premium reflects this expectation,\" with demand remaining flat thereafter, said Refinitiv's Saha.",
        "After a flurry of buying earlier this year, jewellery demand has receded partly due to rising prices, said Michael Lee, a designer at a company in Shenzhen's Shuibei jewellery hub.Feedback from Shenzhen showrooms and manufacturers suggests demand weakness continued during what normally would have been a period for retailers to add stock ahead of the May Day Holiday, said Yiyi Gao, senior analyst at Metals Focus.Retailers are hoping for a price correction to fuel a rebound, Gao added.DEEPER DISCOUNTSIndian dealers have also responded with deeper discounts, cutting them to as low as $57 an ounce under official domestic prices in late March. Though prices have since rebounded to discounts of $12 to the official prices, the dealers said.So far in 2023, Indian demand has been between 30%-40% lower than normal because of the squeeze from price increases and higher bank interest rates, said the IBJA's Kothari.India recently celebrated Akshaya Tritiya, the second-biggest gold-buying festival after Dhanteras, but that failed to spark a revival.Indian wedding season demand has also been weak this year, said the head of the bullion division at a Mumbai-based gold importing bank.With consumers unable to buy a large amount of new jewellery because of higher prices, people are exchanging old jewellery, resulting in lower imports, they added.",
        "But there could be an uptick in jewellery purchases during festivals later this year.\"Once consumers realize that gold prices will remain above 60,000 rupees, they're likely to start buying again,\" said Amit Modak, CEO at jeweller PN Gadgil and Sons, in the city of Pune. ($1 = 6.9044 Chinese yuan renminbi) ($1 = 81.8080 Indian rupee)(Reporting by Amy Lv in Beijing, Rajendra Jhadhav in Mumbai, Kavya Guduru and Swati Verma in Bengaluru; Editing by Christian Schmollinger)"
    ]
}