{
    "articleURL": "/sport/nhl/article-12039855/New-Jersey-Devils-employee-gets-sucker-punched-TWICE-raging-Rangers-fan-4-0-playoff-loss.html",
    "content": [
        "The alleged victim was hyping up the crowd before he was surprisingly sockedDo you know the pair involved? Contact patrick.djordjevic@mailonline.com DailyMail.com provides all the latest international sports newsA New Jersey Devils employee was sucker-punched by an enraged New York Rangers fan at the Provincial Center Monday night during the Battle of the Hudson NHL elimination game. ",
        "Semaj McLeod, a member of the Devils' 'Woo Crew', tweeted that he was clocked in the face by a Rangers fan in glasses in the hours following New Jersey's 4-0 win.'Got sucker punched in the face twice by a rangers fan, at my job, doing my job, celebrating a devils goal, if anyone know who he is pls dm,' he wrote. McLeod shared a photo of the man and a video which shows him hyping up the crowd before the unhinged alleged perpetrator lands one on McLeod's jaw. Another Twitter user then shared a clearer angle which displayed the ostensibly unprovoked assault.",
        "The 'Woo Crew' is a collection of Devils employees who 'engage and energize Devils fans at all home games and experiential events.'McLeod was seen hyping up the crowd moments before taking two punches to the face, holding a sign which read; 'Raise your voice - raise our game. RAISE HELL.'He has since urged users to 'retweet, boost, do whatever u can.' He said that he wants to 'find this dude.'The Devils gave a statement to DailyMail.com, saying the organization would be looking into the matter. 'There is no tolerance for that behavior at our arena, and we are investigating the incident to identify the suspect.' ",
        "DailyMail.com has also contacted both the New York Rangers for comment.  New Jersey's reward for winning its first round series vs. New York, is an Eastern Conference semifinal series against Carolina."
    ]
}