{
    "articleURL": "/news/article-12041963/Schoolgirl-13-dies-suddenly-just-days-winning-football-match.html",
    "content": [
        "Kaylee Black, 13, who played for Belfast club Crusaders, died suddenly this weekThe club said they were 'devastated' after learning of the youngster's deathFriends of a schoolgirl who died suddenly just days after winning a football match  have raised thousands for her grieving family.",
        "'Talented young footballer' Kaylee Black, 13, who was a goalkeeper for the U13s Belfast football club Crusaders, died on Monday. Family and friends have raised more than £8,000 following her death.The GoFundMe page also paid tribute to the 'young, beautiful girl' whose death 'has left a massive space in the hearts of her family'.Meanwhile the club she played for, the Crusaders said they were 'devastated' in a statement issued following the youngster's death.",
        "Club chairman, Ronnie Millar, paid tribute to the young goalkeeper who had been having fun with her teammates as recently as last week.A statement on the club's social media pages said: 'Crusaders Football Club are devastated to hear of the sad and sudden passing of Crusaders Titans U13's player Kaylee Black.'Only last week Kaylee and her team mates proudly showed off their U13 SBYL Trophy at the Crusaders Strikers first game of the season and to hear the news this evening has been heartbreaking.'Chairman Ronnie Millar wishes to pass on the deepest condolences and sympathy to Kaylee's family, team mates, friends and coaching staff at this sad time and asks we keep them all in our thoughts and prayers as they come to terms with Kaylee's passing.'Crusaders Strikers said in a statement they were 'deeply saddened' to learn of Kaylee's sudden passing.",
        "'Kaylee was goalkeeper and a valued member of our U13 SBYL league winning side, who lifted their trophy last week at our first team game at Seaview,' a statement read.'Our thoughts, and prayers are with her family, friends, teammates, coaches and everyone who loved her during this sad time.'"
    ]
}