{
    "articleURL": "/tvshowbiz/article-12057425/Paloma-Faith-makes-statement-two-kooky-looks-Coronation-Concert.html",
    "content": [
        "Paloma Faith made a climate change statement in a kooky ruffled gown before changing into a hot pink dress with ginormous sleeves at the Coronation Concert. ",
        "The singer, 41, who is known for her eclectic sense of style showcased two quirky looks both complete with long latex gloves at Windsor Castle on Sunday. Posing for photos on the red carpet ahead of her performance, Paloma slipped into a grey satin gown with a voluminous layered skirt and black net under layer. She topped off the punky look with a graphic 'climate' T-shirt from the late Vivienne Westwood's archive as she paid homage to King Charles' environmental work. Paloma accessorised with a studded leather choker, styling her platinum blonde hair into an updo. ",
        "As she took to the stage and entertained the 20,000 strong audience she changed into her second eye-catching look and belted out her song Lullaby. Speaking to Dermot O'Leary on BBC Radio 2, ahead of her performance she said: 'I feel privileged to be here. I've come here for sort of two specific reasons.'One is that I think the work that King Charles does on climate is really important and as you can see I'm sporting a 'climate' t-shirt because the late Vivienne Westwood was also actually a big fan of his, who sadly passed away. This is one of her archive pieces. I think it's an important homage to his work.'And also when I was a kid raised in Hackney, I was awarded a Prince's Trust grant grant. So I feel like yeah it's all part of kind of saying \"thank you.\"",
        "As the Coronation Concert got underway, Nicole Scherzinger sang a popular Disney hit, Olly Murs took to the stage to show off his moves and Steve Winwood sang to a cheering audience.Excitement was palpable as the celebrations for the King and Queen's crowning ramped up again in the star-studded show hosted by Downton Abbey star Hugh Bonneville.Olly Murs put on an energetic performance of his hit song Dance With Me Tonight while Pussycat Dolls frontwoman Scherzinger opted for a rendition of Reflection, which was written and produced for Disney's 1998 animated film Mulan. ",
        "The powerful performance prompted applause from both the King and Queen - with Charles turning to the Queen afterwards to say a few words.Paloma, veteran rock guitarist Steve Winwood, and classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill. Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.Scherzinger, who was accompanied by pianist Lang Lang, said backstage ahead of the event that she felt 'overjoyed' and 'honoured' to take the stage. "
    ]
}