{
    "articleURL": "/news/article-12051295/Colombia-piles-PRESSURE-Biden-halts-migrant-returns-deal-U-S.html",
    "content": [
        "The move by Bogota piles more pressure on the Biden administration Officials in the South American nation claims their nationals are being treated badly More than 125,000 Colombians tried to illegally enter the U.S. last year  Joe Biden faces more pressure over illegal immigration as Colombia halted a returns deal over what it branded 'mistreatment' of asylum-seekers. ",
        "The move is yet another blow to Biden's battle against illicit border crossings with anti-migration emergency Covid powers set to expire on May 11.More than 125,000 Colombians tried to sneak into the United States last year, according to data from the country's Customs and Border Protection agency.",
        "But Migration Colombia chief Fernando Garcia said late Thursday that he had decided to suspend return flights from the U.S. 'There are recurring complaints about the poor conditions in detention centers and mistreatment during flights,' the country's top migration official said, claiming passengers had their feet and hands cuffed.He also blamed U.S. immigration officials for grounding planes on May 1 and May 2 that had been set to return failed Colombian asylum-seekers home.Garcia gave no indication as to when flights would re-start. Authorities in Bogota had been set to receive some 1,200 migrants during the first week of May.The scheme, dubbed 'mom returns', focused on booting out women, children and adolescents from the U.S. and sending them back to Colombia.The plan saw expulsion flights to the country rise to around 20 per month, according to Migration Colombia.",
        " U.S immigration officials are trying to ramp up expulsions of illegals from the southern border before a Trump-era Covid diktat expires.Emergency powers, known as Title 42, allow the Department of Homeland Security to remove allegedly bogus asylum-seekers without hearing their claim.   ",
        "Derived from a near 80-year-old federal public health law, the Trump and Biden administration used Title 42 on the grounds of halting the spread of Covid. The United States has struck a similar deal with Mexico that will see their neighbor take back failed migrants from Venezuela, Haiti, Cuba and Nicaragua.But thousands of would-be immigrants have been camping out close to the southern border in the hope of illegally entering the U.S. once Title 42 disappears.Officials expect at least 13,000 people will try to get over the border every day as soon as that legislation scrapped.It is why several top Republicans have been demanding that the president consider an extension of the emergency law.Some border towns, including El Paso in Texas, have already declared a state of emergency.The administration says it will use different legal tools to try and stem the flow of people trying to cross.Those powers, known as Title 8, will mean undocumented migrants detained inside the United States will be banned from ever coming to the country legally.More than 2.3 million migrants tried to illegally cross into the United States across the Mexican border last year, according to U.S. Customs and Border Protection.That is up from 1.7 million people in 2021 and just over 450,000 the previous year when much of the world was locked down during the coronavirus pandemic."
    ]
}