{
    "articleURL": "/wires/pa/article-12045169/On-day-2018-Rangers-introduce-new-manager-Steven-Gerrard.html",
    "content": [
        "Steven Gerrard was introduced as the new manager of Rangers on this day in 2018.",
        "Gerrard would not take up the post until June 1 as he saw out the season with Liverpool’s academy, but said it was a “no-brainer” to take up his first role in management with the Glasgow giants.The former England midfielder replaced Graeme Murty, who had been sacked three days earlier in the wake of a 5-0 loss to reigning Scottish champions Celtic.",
        "Murty had stepped into the role on an interim basis after Pedro Caixinha’s exit the previous October, agreeing a deal to the end of the season in December.Gerrard’s task was clear – to bring Rangers back to the level required to reclaim the Scottish crown that Celtic had just clinched for a seventh consecutive season.Gerrard’s former Liverpool team-mate Gary McAllister joined as his assistant, while Michael Beale followed from Liverpool’s academy to be part of the backroom staff.Over the next three and a half years, Gerrard went on to succeed in many of the goals he started with.In his first season, he guided Rangers into the group stage of the Europa League for the first time in seven years and delivered a first Old Firm victory in six years, although Celtic would claim an eighth straight league title regardless.There was further improvement in the second campaign as they reached the last 16 of the Europa League and recorded a first win at Parkhead in eight years, but beating Celtic to the title would need to wait until the third season – one which began behind closed doors amid the coronavirus pandemic.",
        "When it came, Gerrard’s league-winning season was superb. Gers finished the league campaign unbeaten, winning three Old Firm derbies. They amassed 102 points and conceded only 13 goals.It would be Gerrard’s last full season in charge as Aston Villa came calling the following November, luring him away at a time when his side were top of the table again.Gerrard could not replicate his success in the Premier League and was sacked early in his second campaign after less than a year in charge, but his time at Ibrox is still remembered fondly in one half of Glasgow."
    ]
}