{
    "articleURL": "/wires/reuters/article-12061189/MORNING-BID-ASIA-Investors-glass-half-full.html",
    "content": [
        "By Jamie McGeever",
        "May 8 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever.Chinese trade and Japanese household spending data are on tap Tuesday, although Asian market sentiment looks set to be led once again by the ebb and flow of data and sentiment around U.S. banks, credit and loan demand. Asian stocks ex-Japan had their best day on Monday since March 23, China's Shanghai Composite had its best day in over two months, Wall Street held onto Friday's stellar gains, and Brent crude oil rose for a third day.If the mood in Asian markets on Tuesday reflects the broader global mood on Monday, there's every reason to expect an increase in risk appetite and risk assets, despite a higher dollar and Treasury yields. The Fed's quarterly Senior Loan Officer Opinion Survey ('SLOOS'), a snapshot of national lending and credit conditions, was not as gloomy as might have been the case, given the severe stress in the regional banking sector since early March.As U.S. Fed Chair Jerome Powell indicated last week, lending standards are getting tighter for firms of all sizes. And as analysts point out, conditions are consistent with previous recessions.But there was no obvious sign of a credit crunch, which fits with recent weekly bank deposit flow and lending data too. Next up is the National Federation of Independent Business's April survey of small businesses on Tuesday.",
        "The March report also raised red flags, but again, markets may need evidence of an obvious credit crunch if they are to wilt. In its semi-annual financial stability report on Monday, the Fed said the U.S. banking sector appears well-positioned to weather recent industry turmoil.Several positioning and sentiment indicators suggest investors are the most gloomy on stocks - especially Wall Street - than they have been in years, even decades. The burden of proof is very much on the bears, and the longer the capitulation doesn't materialize, the closer they get to throwing in the towel.World stocks might have been expected to follow Friday's rally - the strongest in five months - with a spot of profit-taking on Monday. They rose.There are reasons to be cautious, of course. U.S. President Joe Biden and Republican lawmakers meet on Tuesday to discuss the debt ceiling standoff. Treasury Secretary Janet Yellen on Monday again said that the government could run out of cash by June 1, and warned that default would be catastrophic.Asian markets appear to be looking at the U.S. banking and debt issues with a 'glass half-full' mentality. The yen fell against the dollar on Monday, always a good indication that safe-haven demand is at a low ebb.",
        "Here are three key developments that could provide more direction to markets on Tuesday:- China trade (April)- Japan household spending (March)- Australia consumer confidence (May)(By Jamie McGeever;)"
    ]
}