{
    "articleURL": "/wires/reuters/article-12051519/Lampard-not-hurting-despite-risk-seventh-successive-defeat.html",
    "content": [
        "LONDON, May 5 (Reuters) - Chelsea great Frank Lampard said he was \"not hurting\" despite a run of six defeats in six games in all competitions since he took over as caretaker manager in April.",
        "The club's all-time top scorer takes his side to in-form Bournemouth on Saturday with the possibility they could drop further down the Premier League table than their current 12th place.Lampard told reporters on Friday that he and the players cared but the situation had to be seen in the context of recent decades.\"I'm not hurting. It might be me but I've been part of this club through big success so when you see the highs and lows of sport, any sport can give you moments of adversity,\" he said. \"I think we at Chelsea have been pretty fortunate for 20 years.\"It's not one for me personally to sit on and feel hurt by too much, more what's the action that gets you out of it.\"The action this season is not going to get us in the Champions League. It's not going to get us maybe in the top eight or whatever but it'll be like the first small step.\"Of course maybe not all fans will want to hear that but it's the reality which I've come back into.\"Chelsea are one place ahead of Bournemouth and have not won since they played at relegation-threatened Leicester City on March 11.They have scored only twice in their last eight matches in all competitions, conceding 14, and a seventh defeat in a row would equal the club record.",
        "Lampard, Chelsea's fourth manager of a turbulent season, said there might appear to be little to play for with the club nine points clear of the drop zone and five matches remaining but the players had to show \"an immense amount of pride\".\"Will we need a reboot of some sense in the summer? Sure, that's clear,\" he said.Chelsea have no fresh injury concerns ahead of the trip to the Vitality Stadium. (Reporting by Alan Baldwin, editing by Ken Ferris)"
    ]
}