{
    "articleURL": "/femail/article-12053959/The-surprising-way-Kate-broke-tradition-Kings-Coronation.html",
    "content": [
        "The Princess of Wales has broken royal tradition, as she attended the Coronation todayCORONATION LIVEBLOG: Click here to follow live updates throughout the dayHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk The Princess of Wales looked radiant in a dazzling ivory Alexander McQueen dress as she attended the King’s Coronation alongside Prince William today.",
        "But the mother-of-three, 41, has impressed even further by bravely breaking royal protocol with her outfit choice.Royal fans watching from around the world might have expected her to mark the occasion by wearing a tiara.However she defied expectations and opted for a Jess Collett x Alexander McQueen Headpiece with silver bullion, crystal and silver threadwork three-dimensional leaf embroidery instead.As she arrived in London this morning, Kate was elegant in the stunning ivory silk crepe gown, which featured silver embroidery featuring rose, thistle, daffodil and shamrock motifs to represent each of the four nations.",
        "In a touching nod to her late mother-in-law, the Princess wore a set of Diana’s pearl and diamond earrings for the occasion.Meanwhile, she also paid tribute to the late Queen by wearing The George VI Festoon Necklace, which was a gift from King George VI for his daughter, then Princess Elizabeth.",
        "The Princess has long chosen to wear Alexander McQueen for significant moments in her life, most notably choosing its creative director Sarah Burton to design her wedding dress.The four flowers of the home nations - English rose, Scottish thistle, Welsh daffodil and Irish shamrock - were embroidered on to the dress.Kate donned pearl earrings that were gifted to Diana before her wedding to Prince Charles in 1981.",
        "The earrings, made by Collingwood, mark a touching handover from one Princess of Wales to the other.They became firm favourites of Diana and were sported on royal tours of Australia, Canada and Italy.The earrings feature a round diamond stud, from which is suspended an additional round diamond and a bell cap set with three more rows of small diamonds. The bell caps each contain a pearl drop.Diana began wearing the earrings before she was Princess of Wales. They were a gift from Collingwood, a jewellery firm that was a favourite of the Spencer family.She wore them on several occasions throughout her marriage.They made her gala outfits sparkle during her tour of the US in 1985, where she wore them with a lacy white gown and the Lover's Knot tiara for a gala dinner at the British Embassy.",
        "She also wore them with the form-fitting black dress she sported as she attended the Vanity Fair party at the Serpentine Gallery in November 1994 in London, which later became known as the Revenge Dress.Kate has worn the earrings several times, including in her official portrait released to mark her 40th birthday last year and for the Queen’s funeral last September.Meanwhile the glittering diamond festoon necklace belonged to the late Queen and was one of the monarch’s favourites in her lifetime.",
        "It was made from 105 loose diamonds that were kept in reserve at Garrard, stored in pouches marked ‘C’ for Crown, in case a monarch wanted to extend a necklace or improve a tiara.Queen Mary, the Queen’s grandmother, was said to have made regular use of the service.The resulting triple strand necklace has rows of graduated stones, suspended between two diamond triangles.It was also the Queen’s preferred necklace for wearing without a tiara.Last night, Kate commanded attention at a reception at Buckingham Palace ahead of the big day. The mother-of-three Kate donned a new £360 Self-Portrait wrap midi dress to attend the lavish event in London, hosted by King Charles on the eve of his Coronation.Joining foreign royals, world leaders and dignitaries including Queen Letizia of Spain at the glittering reception, the princess completed her ensemble with the Queen Mother's sapphire and diamond earrings.Enhancing her features with a smattering of glamorous makeup, Kate kept her hair in tight curls, with a statement side parting as she chatted to guests, including Crown Princess Mary and Crown Prince Frederik of Denmark and US First Lady Jill Biden.Kate appeared relaxed and at ease as she shared jokes with those invited, while King Charles was seen deep in conversation with the First Lady of Ukraine, President Zelensky's wife Olena Zelenska.",
        "Prince William was also on hand to greet guests as final preparations get under way for tomorrow's ceremony.Earlier in the day, the King and the Prince and Princess of Wales thrilled royal fans at the Mall as they made a surprise appearance to greet well-wishers less than 24 hours before the Coronation. Charles III's day of destiny today has arrived as the world prepares to watch the historic first Coronation of a British monarch in 70 years at Westminster Abbey where Britain will hail its new King.The monarch had been heir since the age of three, and is now ready to finally embrace his destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.Charles will be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain’s place on the world stage.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.‘There will be all the pomp and ceremony you could dream of, but as little of the “them and us” as possible,’ one senior royal aide said last night.Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary’s Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to ‘pace herself’ and also ensure ‘the day was about her husband’, sources said.",
        "‘She loves him unconditionally and always wants him to shine,’ a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.‘The calm before the storm – perhaps metaphorically as well as literally’, a friend said with a nod to the dismal weather forecast, something the new King and Queen’s celebrations have in common with the late Queen’s Coronation in 1953."
    ]
}