{
    "articleURL": "/wires/reuters/article-12045941/Canadian-Natural-misses-quarter-profit-estimates.html",
    "content": [
        "By Ankit Kumar and Nia Williams",
        "May 4 (Reuters) - Canadian Natural Resources Ltd reported a lower first-quarter profit on Thursday, narrowly missing analysts' estimates, as a drop in energy prices outweighed higher production from the country's largest oil and gas producer.Crude oil prices eased 20% on a year-over-year basis in the first three months of 2023, down from multi-year highs in the same period last year following Russia's invasion of Ukraine. The recent U.S. banking crisis and concerns over China's economy recovery are also weighing on oil prices.The Calgary-based company reported net earnings of C$1.8 billion ($1.32 billion), down from C$3.1 billion in the first quarter of 2022. Canadian Natural earned C$1.69 per share on an adjusted basis, slightly missing estimates of C$1.70, according to Refinitiv data.Production rose to 1.32 million barrels of oil equivalent per day (boepd) in the reported quarter, from 1.28 million boepd last year.Although the company hit record natural gas production in the quarter, Canadian Natural President Tim McKay said it may scale back gas drilling in favor of more oil wells, as oil is expected to be the more valuable commodity this year.\"From a capital allocation point of view gas will not compete relative to oil in the short term, so we may end up doing a few less gas wells and doing a few more oil wells,\" McKay told investors on an earnings call.",
        "The company's net debt increased about C$1.4 billion from the previous quarter to C$11.9 billion. Canadian Natural plans to increase free cash flow allocation to shareholders once net debt is below C$10 billion, and McKay said that level may not be reached until early 2024 if commodity prices stay low.Canadian Natural shares were last down 1.8% at C$75.09 on the Toronto Stock Exchange amid a broader decline in energy stocks. ($1 = 1.3585 Canadian dollars) (Reporting by Ankit Kumar; Editing by Savio D'Souza and Paul Simao)"
    ]
}