{
    "articleURL": "/money/bills/article-12038453/Tesco-Club-Card-versus-Sainsburys-Nectar-save-money.html",
    "content": [
        "Tesco's Clubcard Prices offer discounts to some 21million Clubcard holders  Sainsbury's new Nectar Prices scheme offers customers discounts of up to 50%Co-op, Waitrose and Morrisons are all  to launch loyalty card-only discountsSupermarkets are locked in a fierce battle to sign up shoppers to their loyalty schemes by offering discounts on groceries that are only available to scheme members.",
        "Tesco has led the way with its Clubcard Prices, which offer the 21 million members of its Clubcard loyalty scheme discounts on more than 8,000 products.But last month rival Sainsbury's entered the fray by launching Nectar Prices.This membership scheme offers 18 million Nectar customers discounts of up to 50 per cent on more than 450 supermarket essentials, such as washing up liquid, breakfast cereal and teabags.",
        "And the Co-op, Waitrose and Morrisons have also all announced plans to launch loyalty card-only discounts in the past fortnight. Savvy shoppers who take advantage of these deals could save hundreds of pounds on their shopping.Tesco claims, for example, that its Clubcard members can save up to £351 a year.The offers could not come at a better time, as the cost of a weekly shop is rising at its fastest rate in 45 years. Food is 19.2 per cent more expensive than it was a year ago, according to the Office for National Statistics.But using a loyalty scheme does not guarantee you are getting the cheapest deals. Ele Clark, retail editor at Which?, says: 'The competition between supermarkets over loyalty card schemes is fierce.'These cards can be a good way for people to save money with shops they already use.",
        "'However, these savings could easily be cancelled out if the shop's prices are higher than those of its competitors, so it is vital that shoppers are able to find out whether they are getting value for money.'Clive Black, retail analyst at Shore Capital, says supermarkets are ramping up their offering for members to boost loyalty and collect data about spending habits.'Supermarkets are battling to retain customer loyalty by offering the best value they can. Membership schemes also allow supermarkets to track customer spending and target shoppers with specific products, which will boost sales.'The main supermarket loyalty schemes are free to join and you can sign up online or in store.",
        "Sainsbury's vs TescoMoney Mail put the two biggest loyalty discount schemes from Tesco and Sainsbury's head to head.We compared prices at the two supermarkets on a typical basket of goods provided by retail research firm Assosia. The 14 staple items, such as cheddar cheese, eggs and pasta, were identified by Assosia as items included in an average weekly family shop.We found that Tesco was cheaper than Sainsbury's for a shopper who had not signed up to either loyalty scheme.It charged £43.87 for a basket of shopping, compared with £46.89 at Sainsbury's.",
        "However, if the shopper signed up to the loyalty schemes to take advantage of Nectar and Clubcard prices, Sainsbury's was slightly cheaper, at £37.24 versus £37.39 at Tesco. ",
        "Nectar Prices slashed £9.65 off the shopping bill, while Clubcard Prices reduced the bill by £6.48.Among the biggest savings was £1.05 off 80 Yorkshire teabags if purchased using Nectar Prices, bringing the price down to £2.25. The same teabags were £3.30 if purchased at Tesco and at the time of our snapshot of prices on May 1, they were not available at a Clubcard Price.Loyd Grossman tomato and basil pasta sauce was also cheaper at Sainsbury's, with a jar priced at £1.50 using Nectar Prices and £1.75 with a Tesco Clubcard. The cost for non-members is £3 at both supermarkets. At Tesco, 650g of chicken breast fillets cost £5.40, but was £4.75 with Clubcard Prices. At Sainsbury's 640g of fillets cost £4.95 as there was no Nectar Prices discount.Although Sainsbury's was cheaper overall in this snapshot example, it will not always be the case. Both supermarkets change their offers on a regular basis and the savings available will inevitably depend on what you buy. And Sainsbury's only currently offers discounts on around 450 products, while Tesco discounts more than 8,000 items.Nectar customers receive other benefits in addition to Nectar Prices, including personalised discounts on items they buy regularly. ",
        "They also earn points on shopping and fuel purchased, which can be spent at Sainsbury's or one of 300 partners including British Airways, Argos and Very.",
        "Tesco Clubcard holders can also collect points for money spent in store or online, which can be converted into vouchers to spend in store or at one of its partners such as Virgin Atlantic and Café Rouge. However, the value of points is dropping from June 14.Tesco also offers Clubcard Plus, which gives customers 10 per cent off clothing at F&amp;F and 10 per cent off any food shop twice a month.The subscription is £7.99 a month and, according to Tesco, membership could save shoppers up to £480 a year.Pick of the restThe Co-op launched Member Prices last month, which is a loyalty scheme that offers discounts on a range of products including pizzas, meal kits and frozen goods. The Co-op says members could save up to £300 a year. Although the selection of discounts is currently limited, it plans to invest a further £15 million into the scheme from this month.To sign up for the scheme, customers can download The Co-op app, join online or register in store. There is a £1 joining fee but for every £1 spent you'll earn 2p for yourself and 2p for your local community.You can support any of the 4,500 community groups The Co-op helps fund, from Aberdeen Riding for the Disabled Association to Nightingale House Hospice in Wrexham.",
        "Morrisons has also relaunched its More card in 20 stores in the North East of England, with a full UK rollout planned this summer. To receive discounts, customers will simply scan their card or app at the checkout.In addition to discounts, customers will also earn five points for every £1 they spend, as well as five points for every litre of fuel bought at a Morrisons petrol station. For every 5,000 points earned shoppers will receive a £5 voucher.John Lewis and Waitrose are preparing to launch a new loyalty scheme in 2024. The membership programme will combine the My Waitrose and My John Lewis cards to offer 14 million existing members personalised discounts and rewards.Asda has not announced plans to introduce member prices, despite being one of the big five supermarkets. Its rewards programme allows customers to collect points when they make purchases online and in store using the Asda rewards app.Iceland gives holders of its Bonus Card discounts on a range of items such as frozen Iceland own-brand chips and Chicken Tikka Masala and free home delivery on in-store shopping. They also receive a £1 bonus for every £20 they save on to the card — which can be done in store or online.Lidl offers member-only prices on a small range of items to shoppers signed up to Lidl Plus. Current offers include £20 off a Grillmeister 6 Burner Gas Barbecue and 20 per cent off Deluxe Tortilla chips. ",
        "The scheme is free to join, but members must download the Lidl Plus app and activate the relevant coupons.Aldi does not offer a loyalty scheme.However, prices at Aldi and Lidl are so competitive they may come out cheaper even after other supermarket loyalty discounts are factored in. In March a basket of 41 everyday items was £72.54 at Aldi, £7.73 cheaper than Sainsbury's and £9.04 cheaper than Tesco, according to Which? figures.a.cooke@dailymail.co.uk",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}