{
    "articleURL": "/wires/aap/article-12048297/PM-Albanese-praises-royals-concern-future.html",
    "content": [
        "Prime Minister Anthony Albanese wants Australians to put aside debates on constitutional arrangements ahead of the coronation of King Charles.",
        "Mr Albanese met the King's oldest son, Prince William, at Kensington Palace on Thursday before addressing a contingent of Australians invited to Saturday's ceremony.\"You are representing Australia at what is an incredible event of historic significance,\" he told the delegation which includes Matildas football star Sam Kerr, singer Nick Cave, Aboriginal artist Jasmine Coe, comedian Adam Hills and London-based nurse Emily Regan.Governor-General David Hurley and state governors are also attending.A self-described lifelong republican, Mr Albanese said Australians did not expect him to attend the coronation to cause controversy and he would follow protocol.\"I want to see an Australian as Australia's head of state ... I haven't changed my position on that but we have to respect the institutions which are there,\" he told ABC News.Advocacy group Real Republic Australia said the prime minister had taken a sensible approach to the coronation.\"Our current constitution means King Charles III is our head of state and there is nothing wrong with acknowledging and respecting that constitutional fact while advocating for change through ... lawful, constitutional and democratic processes,\" chair David Muir said.Mr Muir said the republic debate should not be about attacking the royal family or denigrating its current role in the constitution.But Greens deputy leader Mehreen Faruqi said pledging allegiance to the head of another country at the coronation was \"woeful\".",
        "Senator Faruqi said the only reason the prime minister should have travelled to the United Kingdom was to \"cut the apron strings\" with the monarchy.Mr Albanese said regardless of what Australians thought of the constitutional arrangements, there was \"enormous respect\" for the royal family.\"One of the things I certainly admire about King Charles and the Prince of Wales who is continuing that tradition, is their concern about the future,\" he said in his speech.\"Their concern and outspoken views about climate change, about the need to protect our planet, about the urban environment, about a whole range of issues, including respect for Indigenous Australians, which is why the palace's request - which was well received by a government such as mine - was so heartwarming.\"Mr Albanese told Prince William he and other members of the royal family were welcome to visit Australia at a time of their choosing.The Australian Republican Movement said the King would be welcome to visit, at his own expense, to discuss the monarchy's role in the nation's history.\"It is time for the Crown to accept responsibility for its role in the dispossession and massacre of First Nations people across the former British Empire and the ongoing suffering this is continuing to cause today, and apologise accordingly,\" co-chair Nova Peris said.",
        "Earlier on Thursday, the Prince and his wife Kate took their first trip on the Elizabeth Line of London's Underground, named after William's late grandmother Queen Elizabeth.Mr Albanese said the Queen had been \"a constant, reassuring presence in our lives ... and when she passed away, there was a great deal of mourning for someone who we had affection for but also incredible respect\".He said the royal family had been born into public life and served their nation and the Commonwealth with commitment.\"Queen Elizabeth served for 70 years, a remarkable period of service and diligence and duty,\" he said.\"Saturday will be the formal recognition of the fact we have a new head of state under our system, so it will be a historic moment.\""
    ]
}