{
    "articleURL": "/wires/reuters/article-12045697/Russian-rouble-nears-one-month-high-oil-prices-halt-slide.html",
    "content": [
        "May 4 (Reuters) - The Russian rouble edged towards a one-month high on Thursday after four straight sessions of gains, taking stock of a partial recovery in oil prices amid a reduced supply of foreign currency.",
        "At 0749 GMT, the rouble was 0.2% stronger against the dollar at 79.04, having hit 78.9025 on Wednesday, its strongest since April 4.It gained 0.4% to trade at 87.41 versus the euro and was 0.4% firmer against the yuan at 11.41 .The rouble strengthened sharply after the central bank held interest rates steady on Friday, but retained the prospect of future hikes. The rouble has also benefited with a lag from high oil prices throughout April, which translate to higher export revenues for Russian exporters.But after month-end taxes were paid on April 28, the rouble can now count on reduced supply of foreign currency in the market.Brent crude oil, a global benchmark for Russia's main export, was up 1.1% at $73.16 a barrel.The drop in oil prices to $73 from $80 per barrel will put pressure on the rouble and may lead to another wave of weakening, said Banki.ru chief analyst Bogdan Zvarich in a note.\"In the current situation, risks remain that the dollar-rouble pair will return to the 80-82.5 range,\" Zvarich said.Oil prices were recovering on Thursday but unable to claw back the more than 9% decline of the previous three days as demand concerns in major consumers overrode signals that the U.S. may pause its interest rates increases.",
        "Russian stock indexes were at around three-week lows.The dollar-denominated RTS index was down 0.1% to 1,007.3 points. The rouble-based MOEX Russian index was 0.2% lower at 2,527.2 points.Russian stocks are unlikely to see any serious buying interest before Russia's long weekend, said Sinara Investment Bank analysts. The country celebrates Victory Day on May 9.Geopolitics are partly to blame for Russian stocks' recent decline, while investors globally fear recession, hence the sustained drop in Brent, Sinara said.(Reporting by Alexander Marrow Editing by Christina Fincher)"
    ]
}