{
    "articleURL": "/sciencetech/article-12043111/Spotted-lanternflies-16-states-report-sightings-Asian-insect.html",
    "content": [
        "Americans in 16 states have reported sightings of spotted lanternfliesThe invasive species is said to have traveled from China in 2012READ MORE:  How the US fought a plague of Asian spotted lanternflies in 2022Spotted lanternflies have been spotted in 16 US states, meaning sidewalks and trees will soon be crawling with hundreds of millions of these Asian insects.",
        "The multi-colored bug, with spots on its back, is known to feast on more than 70 types of plants and leave resin covered in toxic black mold that slowly weakens vegetation. Residents are urged to stomp on adult lanternflies and scrape egg masses from trees and other outdoor surfaces to ease the imminent infestation.The 2022 infestation was dubbed 'worse than Egypt's locust' and while the season has just started, experts fear the spotted lanternflies are returning with a vengeance.",
        "Pennsylvania was the first to detect a spotted lanternfly in 2014. The one-inch insect has since cost the state $50.1 million annually - but a 2022 study suggests losses could soon reach $324 million.Two-thirds of Pennsylvania's counties are in a quarantine zone, meaning many transportation-based businesses must get a special permit.This is because the insects can sneak into materials transported across states.Although they seem harmless, the invasive insects from Asia are costing Americans hundreds of millions of dollars a year in economic damages and treatments to eradicate the pests. The states with sightings include Pennsylvania, Connecticut, Delaware, Indiana, Maryland, Massachusetts, Michigan, New Jersey, New York, North Carolina, Ohio, Rhode Island, Virginia, New Hampshire, Vermont and West Virginia. The spotted lanternfly is believed to have come to the US as egg masses on a stone shipment that originated in China.",
        "Both nymphs and adults of spotted lanternflies cause damage when they feed, sucking sap from stems and branches. This can reduce photosynthesis, weaken the plant, and eventually contribute to the plant's death.In addition, feeding can cause the plant to ooze or weep, resulting in a fermented odor, and the insects themselves excrete large amounts of fluid called honeydew.It's not the trees that are at greatest risk, though. 'If allowed to spread in the United States, this pest could seriously impact the country's grape, orchard and logging industries,' according to the USDA.Almonds, apples, blueberries, cherries, peaches, grapes and hops are some of the threatened crops. These fluids promote mold growth and attract other insects.",
        "State officials are sending residents on a mission to kill, urging people to crush or stomp on the bugs, put them in a container of alcohol, diluted Clorox or hand sanitizer and spray them with a mixture of rubbing alcohol and water.Infestations are identifiable by thick clusters of insects on tree trunks and branches. The public is also encouraged to inspect outdoor furniture, trailers and vehicles for these invasive bugs. People were creative with fighting last year's infestation.A woman in Staten Island used a vacuum cleaner to suck at least 80 pests off her grape vine. ",
        "But a few hours later, the vine was infested again.Another woman in New Jersey fed insects to a giant spider that had made its home on her porch."
    ]
}