{
    "articleURL": "/tvshowbiz/article-12058495/Taylor-Swift-gets-ahead-perform-Nashville-FOUR-HOUR-delay-severe-weather.html",
    "content": [
        "The new romance comes less than a month after Taylor, 33, split from her boyfriend of six years, actor Joe AlwynSwift's won Best Song at the MTV Movie &amp; TV Awards on Sunday for Carolina from Where The Crawdads SingREAD MORE: Taylor and Matt seen together amid new romance Taylor Swift finally received the go-ahead to perform after a four-hour weather delay kept fans waiting in Tennessee on Sunday.",
        "Taylor's third concert at Nashville's Nissan Stadium saw its start time delayed due to lightning in the area causing fans to remain under Shelter in Place until the storm passed. Nissan Stadium advised concert-goers that the lightning warning had been lifted in a tweet that referenced Swift's 2010 song Sparks Fly.'Drop everything now ... meet me in the pouring rain. Shelter in Place has officially been lifted. Fans, please start making your way to your seats. Once production wraps up, Taylor Swift will hit the stage.'Swift announced she would be taking to the stage at a delayed time with an Instagram post writing that she had been 'moved by these beautiful, generous Nashville crowds!!!! I just can’t believe it. PS I know there’s talk of a rainy weather vibe tonight but I’m ready to play, see you sooon!!'",
        "Also on Sunday, Taylor won Best Song at the MTV Movie &amp; TV Awards for Carolina from Where The Crawdads Sing.The record-breaking Eras tour arrived in Nashville on Friday for three nights at Nissan Stadium.The 12-time Grammy winner conquered the stage in multiple outfits, including a rhinestone leotard with nude tights, and a sultry one-legged black bodysuit bedazzled with ruby red snakes.The hitmaker recently dropped four new songs in celebration of her tour, three of which are re-recordings of past songs, to hype up fans for this tour. ",
        "The 33-year-old superstar was pictured for the first time with her rumored beau Matty Healy, 34, arriving to her condo at 12:30AM on Sunday following her second performance in Nashville.They sat beside each other in the back of their chauffeured vehicle, where Matty still wore the same bracelet he sported earlier that evening while attending her concert. The new romance comes less than a month after Taylor split from her boyfriend of six years, actor Joe Alwyn.  Many Swifties — her loyal and eagle-eyed fans — claimed that some of the songwriter's besties and inner circle reportedly broke ties on Instagram just shortly after being spotted hanging out with the star and perhaps learning what really happened.The bold moves on social media appeared to suggest that there may be more to the breakup than the public is aware of.Just after catching up over dinner with longtime friends Blake Lively and her husband Ryan Reynolds, for instance, the Deadpool actor allegedly immediately unfollowed Alwyn.The obvious snub was a shocking move considering Ryan had previously gushed about the British actor and their six-year-long friendship in a TIME100 Next article published in September 2022. (His wife does not currently follow Alwyn.)",
        "The Sun reported on Thursday that the rumored couple had plans to confirm the romance over the weekend during her Nashville stop.",
        "On Saturday, Matty strummed on his guitar as he made an appearance with Taylor's supporting act during the show. Whether he will hop onto the stage once again to perform with the Blank Space hitmaker has yet to seen.Taylor and Matty's rumored romance first came to light earlier this week on Wednesday, with a separate source telling The Sun, 'She and Matty are madly in love.''It’s super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out,' the insider added.In regards to her ex, the source informed the publication, 'Taylor and Joe actually split up back in February, so there was absolutely no crossover.''Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of Face-Timing and texting but she cannot wait to see him again,' and added that the two stars, 'are incredibly supportive of their respective careers.''They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.'While Taylor focuses on her Eras Tour, which is slated to conclude later this year in August, Matty is also in the middle of touring with his band, The 1975.",
        "Before making a surprise appearance to join the opening act, the Robbers musician was seen making a quick Starbucks run after reportedly spending time at Taylor's Nashville condo earlier Friday night.",
        "As the British-born singer exited the popular coffee shop chain on Saturday, he carried a warm drink in his hand while also looking through his smartphone as he was led by a security guard to a sleek, white SUV parked near the coffee shop.After grabbing a drink to get a boost of energy, Healy was later seen arriving at Nissan Stadium in the heart of Nashville ahead of Taylor's Saturday night performance in the city.Earlier on Friday, he was seen dancing along to Swift as she sang her hit track, Shake It Off, amongst fellow concert-goers in a secured area on the floor section of the venue.The video was posted on Twitter and quickly went viral amid rumors that Matty and Taylor have started a budding romance.Despite the speculation that the two have entered a relationship, both singers have yet to publicly confirm they are dating. ",
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)"
    ]
}