{
    "articleURL": "/wires/pa/article-12041975/George-Charlotte-Louis-join-King-coronation-rehearsal.html",
    "content": [
        "The King and Queen Consort and the Prince and Princess of Wales and their children have attended a coronation rehearsal at Westminster Abbey.",
        "Three days before the occasion, a relaxed-looking Charles and Camilla headed to the venue with William, Kate, Prince George, Princess Charlotte and Prince Louis.",
        "The royal family was greeted by the Dean of Westminster and shown inside the gothic church, where Charles and Camilla will be anointed and crowned on Saturday in front of 2,300 guests and a global audience of millions.Future king George, nine, has the duty of being one of his grandfather’s pages of honour and is expected to be tasked with holding the train of Charles’s regal robes.William will kneel before his father and vow to be his “liege man of life and limb” in the only homage of royal blood of the ceremony.He will also help clothe the King in his golden robe royal, also known as the mantle, ahead of his crowning.",
        "Louis, five, was spotted sat next to William in the back of a car as they left the rehearsal.Also there were Camilla’s grandsons, who will act as her pages of honour.The King’s sister, the Princess Royal, also attended after visiting soldiers from The Household Division at Wellington Barracks in the morning as they prepared for their roles in the military processions.",
        "The rehearsal in central London came after a man was arrested when suspected shotgun cartridges were thrown into the grounds of Buckingham Palace on Tuesday evening.",
        "Security minister Tom Tugendhat said police and intelligence agencies are mounting a “very complex” security operation around the ceremony – with the eyes of the world set to be on the UK.“The police are, to put it mildly, all over it and our intelligence and other security forces are extremely aware of the challenges that we face and ready to deal with them – as the police did quite brilliantly yesterday,” he told Times Radio on Wednesday morning.",
        "Mr Tugendhat said the coronation is “an opportunity to showcase the United Kingdom to the world”.With last-minute preparations ramping up, early morning rehearsals were staged in the capital, revealing the first glimpses of the grandeur of the coronation processions.Hundreds of soldiers, many on horseback, marched from Buckingham Palace past Trafalgar Square and Downing Street to Westminster Abbey shortly after midnight on Wednesday.",
        "The diamond jubilee state coach and gold state coach travelled down The Mall as part of the dry-run for the full event.Royal fans waited for more than three hours for the parade to make a return trip.Crowds ran through St James’ Park to find the best spots near the palace, with many trying to spot relatives in their military outfits.Lambeth Palace later confirmed the Right Reverend Graham Usher, Bishop of Norwich, and the Bishop of Hereford, the Right Reverend Richard Jackson, will serve as Bishops Assistant to Camilla during the coronation service at Westminster Abbey.",
        "Already announced are Charles’ Bishops Assistant – the Bishop of Durham, the Right Reverend Paul Butler, and the Bishop of Bath and Wells, the Right Reverend Michael Beasley."
    ]
}