{
    "articleURL": "/wires/pa/article-12052141/Russia-jails-theatre-director-amid-crackdown-dissent.html",
    "content": [
        "A Russian court has ordered pretrial detention for a theatre director facing charges of justifying terrorism, the latest move in a relentless crackdown on dissent in Russia since the start of the war in Ukraine.",
        "The Zamoskvoretsky District Court in Moscow jailed Zhenya Berkovich, a prominent independent theatre director and playwright, for two months pending investigation and trial.Ms Berkovich was detained in the Russian capital on Thursday because of the play she staged, Finist, The Brave Falcon. Police also raided the apartments of her parents and her grandmother in St Petersburg.The play, named after a Russian fairy tale, depicts Russian women who faced prosecution after being lured into marriage and life in Syria by representatives of radical Islam.It was written by playwright Svetlana Petriychuk, who was also detained on Thursday and appeared in the same court on Friday after Ms Berkovich.The authorities have alleged that the play justifies terrorism, accusations that both Ms Berkovich and Ms Petriychuk have rejected, maintaining their innocence.Ms Berkovich’s lawyer Yulia Tregubova pointed out in court on Friday that the play was supported by the Russian Culture Ministry and won the Golden Mask award, Russia’s most prestigious national theatre award.Justifying terrorism is a criminal offence in Russia, punishable by up to seven years in prison.The case against Ms Berkovich and Ms Petriychuk elicited outrage in Russia. An open letter in support of the two artists, started by the independent Novaya Gazeta newspaper, had been signed by more than 3,400 people by Friday evening.",
        "The play, the letter argued, “carries an absolutely clear anti-terrorist sentiment”.Dozens of Russian actors, directors and journalists also signed affidavits urging the court to release Ms Berkovich from custody pending investigation and trial.Immediately after Russia launched its full-scale invasion of Ukraine, the Kremlin unleashed a sweeping campaign of repression, unparalleled since the Soviet era.It has effectively criminalised any criticism of the war, with the authorities targeting not only prominent opposition figures who eventually received draconian prison terms, but anyone who spoke out against it, publicly or otherwise.Pressure has mounted on critical artists in Russia. Actors and directors were fired from state-run theatres, and musicians were blacklisted from performing in the country. Some were labelled “foreign agents”, which carries additional government scrutiny and strong negative connotations. Many left Russia.Ms Berkovich, who has two adopted daughters, has refused to leave Russia and continued working with her independent theatre production in Moscow, called Soso’s Daughters. Shortly after the start of the war in Ukraine, she staged an anti-war picket and was jailed for 11 days."
    ]
}