{
    "articleURL": "/femail/article-12052597/Maria-Menounos-goes-shopping-New-York-revealing-secret-pancreatic-cancer-battle.html",
    "content": [
        "Menounos, 44, was spotted leaving her hotel and hopping into a black SUVThe journalist and her husband, Keven Undergaro, were driven to Macy'sShe revealed this week that she's recovering from stage 2 pancreatic cancer  Maria Menounos enjoyed some shopping in New York City on Friday, two days after she revealed she had survived stage 2 pancreatic cancer while awaiting the birth of her first child via surrogate. ",
        "The entertainment journalist, who previously worked for E! News and Extra, was fresh off of her appearance on the Today show when she was spotted stepping out of her hotel and hopping into a black SUV. Menounos, 44, was chauffeured to Macy's, where she was photographed entering the famous department store with her husband, TV writer Keven Undergaro. She looked chic in a cream blazer paired with a white T-shirt and destroyed cropped jeans. She topped off her ensemble with white high-top sneakers, '90s-style sunglasses, and a black handbag. ",
        "Her long highlighted hair was worn loose around her shoulders and appeared to be freshly blown out. Menounos had a Starbucks coffee and a cellphone in her hand as she entered the SUV and was seen on her phone while sitting in traffic. The outing comes one day after she gave an emotional interview about her secret pancreatic diagnosis on the Today show. She explained that started experiencing 'excruciating abdominal pain' coupled with diarrhea last fall. She went to the hospital with her symptoms, but nothing out of the ordinary showed up on her tests and CT scan. The pain persisted and a friend who owns a company that offers full-body MRIs suggested she get one. She said the radiologist was nearly finished going through the scan when he saw a mass on her pancreas. ",
        "'The mass kept persisting in every image, and he goes, \"You need to go to the hospital right away,\"' she recalled. 'He's white as a ghost and he's shaking. 'My eyes started to well, and I just looked at him. I go, \"So I'm a goner, cool.\" I kind of just go to jokes fast, but it's not like a good joke.'   'All that kept flashing through my head was my baby,' she continued, her voice breaking as she held back tears. ",
        "'And I was like, \"Oh my God, I can't believe this is going to happen to me.\" Because when it's on your pancreas, you know you're not going to be okay.' Menounos said she tried to hold it together by focusing on consoling the radiologist 'because he was so upset.' After undergoing more tests, her doctors confirmed there was a mass and it was a cause for concern.  'I remember waking up the next morning and I hadn't really cried, but I just started guttural crying because I'm like, \"How could God finally bless me with a baby after 10 years, and now I'm not going to get to meet her?\"' she said.'And so Keven's devastated, I'm devastated, we can't tell anybody. I can't tell my dad, how much more can that man take?'",
        "'The more I thought about it, I was like, this doesn't make sense, this doesn't make sense,' she continued. 'And then I realized, it doesn't make sense, and that's when I shifted and said, \"I don't know anything, so why am I going to predict the worst? Why am I going to be thinking the worst?\"'",
        "The reporter was diagnosed with stage 2 pancreatic cancer in January and underwent surgery to remove a 3.9-centimeter (1.5-inch) tumor from her pancreas along with her spleen, a fibroid tumor, and 17 lymph nodes.Luckily, the star's cancer was caught early enough to keep her from undergoing further treatment such as chemotherapy or radiation.Menounos told People this week that the health scare made her fall into despair and she initially feared she wouldn't live long enough to meet her baby daughter.The diagnosis came right before she and Undergaro planned to reveal their pregnancy news, and she said she began to prepare for the worst. 'When you are met with a [potential] death sentence everything changes,' she explained.Undergaro helped Menounos get through her first bout of cancer in 2017 after doctors discovered a benign brain tumor, which was later removed. She was also diagnosed with type 1 diabetes last year. But this time around, they were both 'really scared' about the outcome.",
        "Menounos kept her cancer diagnosis and treatment a secret when she announced in February that she and her husband are expecting their first child via surrogate.",
        "'We are so overwhelmed by all the messages of love and joy we have received in the last 24 hours. It's been a long process, with a lot of ups and downs along the way,' she wrote, in part, in an Instagram post on February 8. She shared a photo that showed them excitedly holding up a baby onesie and a sign that read: 'We are having a baby!'Following her heartbreaking cancer diagnosis, the actress said she sat down with her husband and began listing the wishes she had for her child if she wasn't going to be around to see them through.The Massachusetts native admitted that she and Undergaro 'talked about it all' and 'imagined the worst.'She told him, 'If something happens, here are the people I want her around and what I want you to do. You'll probably have to move back East to be with my dad so that she has him.\"'While being devastated by the news of the cancer diagnosis, Menounos maintains she stopped short of asking, 'Why me?'She recalled how her father asked that very question when her late mother was fighting brain cancer, which she died of in 2021. ",
        "'My dad would say \"Why us?\" And I'd go, \"Dad, why not us?\"' she said. 'I'm not saying \"Why me?\" because I know it's \"Why everybody?\"'In the wake of all her fears and ultimate despair, Menounos has replaced those thoughts and feelings with a healthy dose of gratitude after getting a clean bill of health post-surgery.Over the past three months, she has been incorporating her meditation practice along with everything she has learned from her Heal Squad podcast into her daily life to maintain a healthy mind, body, and soul. 'I talk to my pancreas every day, I talk to all of my body organs and say \"I really love you. Thank you for handling everything,\"' she said of one of her new techniques. The former Access Hollywood correspondent and co-host also likes to talk to her unborn child by sending voice recordings to her surrogate, who in turn plays them near her belly.'I talk to her all the time. She kicks and moves around like crazy every time,' she said. 'I'm looking forward to that whole other chapter. I'm excited.'As part of her recovery, Menounos will have to continue to get regular scans of her pancreas for the next five years.The couple's daughter is expected to arrive this summer."
    ]
}