{
    "articleURL": "/tvshowbiz/article-12051217/Trooper-Bobby-Davro-performed-gig-just-one-day-beloved-fianc-e-Vicky-Wright-died.html",
    "content": [
        "Devastated Bobby Davro went back to work gigging just one day after his beloved fiancée Vicky Wright died - as he vowed to perform through the pain so not to disappoint his fans who had bought tickets to the show. ",
        "The 64-year-old was left devastated when his partner – the daughter of late England captain Billy Wright and Beverley Sisters singer Joy Beverley – passed away on Wednesday after a short battle with pancreatic cancer.Despite his grief, Bobby stepped on stage at the Tivoli Theatre in Wimborne on Thursday to perform four shows for his friend Jim Davidson's Ustreme online comedy channel.Jim, 69, took to his YouTube channel to confirm Bobby's appearance and praised the fellow showbiz legend for being a 'trooper' who knows the show must go on.The former Big Break presenter said: 'We have to say goodbye Vicky Wright. It's a sad old day. I'm down here in Wimborne at the Tivoli Theatre on the set of Ustream's Left, Right and Centre, the award-winning panel show and I'm sitting in Miles Crawford's seat and we're all a little bit quiet today.",
        "'Not only because we miss our friend Vicky Wright but because in 15 minutes her fiancé Bobby Davro will be turning up, he knows he's committed to appearing on these shows. 'He didn't come yesterday, obviously, and I sat in and Robert Hart sat in, but Bobby – the old trooper – he's brushed away the tears and he's back today to record four shows here at the Tivoli Theatre in Wimborne.",
        "'There are tickets on sale, we've got two shows this afternoon and two shows from 7:30 and we're all a little bit down thinking about Vicky.'Jim also remembered his friend Vicky and paid tribute to her as a person, loyal partner to Bobby and her wicked sense of humour.He said: 'Ustreme members know all about Vicky and for those of you who are not subscribers you might have seen little clips on YouTube of Sunday Night Live where we used to get the poor girl to read these children's poems and then do as much as we possibly could to put her off and I'd write the wrong words and put dirty words in and someone would have a fart machine and try and make her laugh and she put up with all of it, she was just great.'She's been Bobby's squeeze and girlfriend and fiancée for a long, long while and they were a great couple. She was the daughter of Billy Wright and Joy Beverley. The Beverley Sisters were like the white version of The Supremes in the '60s, I guess.''It's so sad that she's not here. We all deal with bereavement in different ways. I was speaking to someone today, as you get older you tend to go to more funerals than you go to weddings, I'm going off to Bob Potter's funeral soon.",
        "'So Vicky, up there somewhere talking to Jethro and her dad, goodbye from all of us that are watching on YouTube, and from all your friends and our members on Ustreme sleep well darling.'",
        "Jim also shared a clip of Vicky reading one of her rude bedtime stories for Ustreme, in what is believed to be her last appearance before her illness.Last weekend, Bobby bravely opened up about Vicky's cancer fight, admitting that it had been 'horrific and extremely painful' to see the love of his life get so sick.Bobby said: 'To see someone as beautiful as her with this ­illness is horrific. It's so sad. It's extremely, extremely, extremely painful...'My best advice for someone in a similar position is that laughter is the best medicine.'I always remember this quote: 'Don't let the world change your smile – get your smile to change the world.'It comes after it was revealed that Bobby poignantly admitted he was 'drinking, smoking and not looking after myself' as he watched his fiancée lose her battle with cancer.The TV comic, 64, added he had been suffering extreme 'stress' since his long-term partner Vicky Wright, 63, was diagnosed with the disease – which ended up claiming her life on Wednesday.He spoke in a podcast called Eyes And Teeth hosted by the comedy ventriloquist Steve Hewlett. It was recorded a few days before her death. ",
        "He said about how he was dealing with the agony of watching his long-time love fight the illness: 'I'm drinking, I'm smoking, I'm not looking after myself. I have a little bit of grief in my life – my lovely fiancée has got cancer unfortunately and it has brought a lot of stress.'Former EastEnders actor and panto stalwart Bobby also said he had taken a break from social media to help care for Vicky, to whom he got engaged in December after 12 years of dating.He added: 'I haven't done a lot of social networking because obviously I've had a few private issues with my fiancée and it's been difficult.'So I haven't really had a chance to do a lot of social networking but I'm going to try and get someone in to help me so I can get it out there.'Her 'incredibly devastating' death on Wednesday was announced by her daughter, Kelly.Davro had revealed his partner's pancreatic cancer diagnosis to the Daily Star Sunday newspaper in April.Through Wright's Twitter account, Kelly wrote: 'Hello everyone... Some incredibly devastating news to share...'My wonderful mum Vicky has sadly passed away this morning. I wanted to use this platform to let you all know, as I know how much she valued all your love and support in so many ways.'",
        "Wright's father was former Wolverhampton Wanderers star Billy, who played for England between September 1946 and May 1959 and was the first Englishman to win 100 caps before retiring and going on to be a TV football pundit.She recently presented The Billy Wright Story, a celebration of her father's life that gave an insight into his private life and career before his death at the age of 70 in 1994.Her mother was Joy, of The Beverley Sisters, who died in 2015 at the age of 91. The singing trio had hits including I Saw Mommy Kissing Santa Claus and Little Drummer Boy.Singer Beverley Knight paid tribute to Wright, writing on Twitter: 'My god no. I am so, so sorry. Vicky was a gem. Sending love and healing.'In a statement, football club Wolves said: 'Our thoughts go out to the friends and family of Vicky Wright.'An inspirational woman and the daughter of a true Wolves legend. She will be dearly missed. The whole pack stands with the Wright family.'BBC Midlands Today presenter Nick Owen wrote: 'Oh no. Shattering news. I had known Vicky for more than 40 years and loved her company.'Her dad Billy gave me my first job in television. I feel terribly sad tonight. Thoughts with all the family x.'",
        "Speaking last week, Bobby said he was trying to 'smile through the absolute agony' of his long-term partner's 'devastating' illness but admitted things haven't been easy.He told the Daily Star: 'To see someone as beautiful as her with this ­illness is horrific. It's so sad. It's extremely, ­extremely, ­extremely painful...'My best advice for someone in a similar position is that laughter is the best medicine.",
        "'I always remember this quote, 'Don't let the world change your smile – get your smile to change the world'.'Vicky's father Billy Wright, who spent his entire footballing career with Wolverhampton Wanderers, died from the same form of cancer in 1994.Vicky had performed as a singer and actress, following in the footsteps of her mother Joy Beverley.She also took the stage to perform a one-woman show about her father called the 'Billy Wright Story'."
    ]
}