{
    "articleURL": "/wires/pa/article-12057023/Pregnant-Princess-Eugenie-joins-bumper-crowd-Coronation-Big-Lunch.html",
    "content": [
        "A heavily pregnant Princess Eugenie joked she would use her baby bump to clear a path through the “fanatical” crowds during a Coronation Big Lunch event.",
        "Eugenie, who is expecting her second child this summer with husband Jack Brooksbank, joined sister Princess Beatrice on Chalfont St Giles’ village green in Buckinghamshire for the social gathering.",
        "As temperatures reached over 20C, the pair “lost” each other while crowds of “disbelieving” fans piled in to take selfies with them.At one point as Eugenie made her way through the green, she said: “I’m still waiting for my sister – I feel a bit weird without her.”When asked how she felt, she joked: “A bit pregnant – I can get people out of the way with my bump.”",
        "Paul Buchanan, president of the village show, described the atmosphere as “fanatical”.“There was just disbelief,” he added. “Everyone went to see them. They got such a huge buzz.”Referring to Eugenie’s pregnancy, he said: “Fair play – we got seats ready for her but she didn’t ask for one”.",
        "The event – one of many across the country – saw thousands of people turn out in the summer sun to celebrate the King’s coronation.Locals gathered on the quaint green, decorated with large cardboard crowns and bunting, where they shared food, listened to music and had a “best-dressed table” competition.The royal sisters, who 24 hours earlier were watching their uncle and his wife being crowned, were warmly embraced by dozens of fans at the party as live music blared from a stage.",
        "One lady embraced Eugenie, rubbing her back affectionately and saying: “You look amazing – what a beautiful young woman.”Beatrice, who was diagnosed with dyslexia when a young girl and is now patron of the Helen Arkell Dyslexia Charity, stopped to meet nine-year-old dyslexic Mia, and praised the coronation hat she had made at school before those around her broke into applause.",
        "Proud mother Nova Humphrys said afterwards: “My daughter is dyslexic and Beatrice told her she could still do great things.”The princesses also stopped to thank volunteers from All Together Community, which provided food for those in need during the lockdown.They then watched a performance by the local dance troupe before leaving with their entourage as revellers clapped.Speaking afterwards, Stephen Hinds, chairman of the event, said village residents would “remember this for the rest of their lives – probably centuries”."
    ]
}