{
    "articleURL": "/wires/ap/article-12058245/Mills-10-NBA-players-Australias-extended-squad.html",
    "content": [
        "MELBOURNE, Australia (AP) - Veteran Brooklyn Nets point guard Patty Mills and rising Oklahoma City star Josh Giddey are among the 10 NBA players selected in Australia´s extended squad of 18 to prepare for the basketball World Cup.",
        "Mills' teammate Ben Simmons is still recovering from injury and wasn´t picked for the squad´s upcoming training camp, but coach Brian Goorjian hasn´t ruled him out of calculations for the global tournament.Matisse Thybulle, Joe Ingles, Jock Landale, Josh Green, Matthew Dellavedova, Xavier Cooks, Jack White and Dyson Daniels are the other NBA players picked for the extended roster, which will be cut to 12 before Australia´s opening game against co-host Japan on Aug. 25.\"It´s been a thorough process. The coaches and I have had many discussions about getting the mix right but I´m really pleased with where we´ve landed with the guys we´ve selected, there´s a good balance across the court,\" Goorjian said in a statement Monday. \"The fact it´s been so tough goes to show the depth of talent we have in Australian basketball right now.\"Australia won the bronze medal at the Tokyo Olympics and will again be among the medal contenders in the FIBA World Cup, which is being co-hosted by Philippines, Japan and Indonesia.The Boomers have been drawn into Pool E with Japan, Germany and Finland and will play their group-stage games in Okinawa.Giddey, who was among the last players cut from the Olympic roster for Tokyo, will get his first chance to play for Australia at a major international meet.",
        "\"I´ve always dreamed of playing for the Boomers and representing Australia, so to get this opportunity is really special,\" Giddey said. \"There´s a lot of talent in this squad and I think we´ve got a good chance of matching it with every team -- I´m excited for the challenge.\"___Australia squad: Xavier Cooks, Dyson Daniels, Matthew Dellavedova, Dante Exum, Sam Froling, Josh Giddey, Chris Goulding, Josh Green, Joe Ingles, Nick Kay, Jock Landale, Thon Maker, Will McDowell-White, Patty Mills, Keanu Pinder, Duop Reath, Matisse Thybulle, Jack White.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}