{
    "articleURL": "/sport/mlb/article-12059795/Yankees-legend-Derek-Jeter-48-model-wife-Hannah-welcome-son-Kaius-Green.html",
    "content": [
        "Derek Jeter and his wife Hannah have announced the arrival of their fourth childKaius Green Jeter, the couple's first son, was born on Friday, Jeter announcedDailyMail.com provides all the latest international sports newsDerek Jeter and his wife Hannah have announced the arrival of their fourth child and first son, Kaius Green Jeter.",
        "'Welcome to the world lil man!!!@hannahbjeter,' Jeter wrote in an Instagram post that did not include a photo of the youngest family member.The legendary New York Yankees shortstop also tweaked his Instagram bio to 'sleep-deprived father of four.'He and Hannah, a model, began dating in 2012 before marrying in 2016 – two years after his retirement from baseball.Since then, Hannah has given birth to three daughters – River Rose, 17 months, Story Grey, 4, and Bella Raine, 5 – the eldest two of which were seen at Jeter's 2021 Hall of Fame induction in Cooperstown, New York.",
        "Jeter has been careful not to share too much of his family with the outside world.The famously private former player has released only a few pics of his daughters on social media, including one recent beach photo back in February.That picture shows Jeter carrying one of his daughters off the beach as she rests her head on his shoulder.'How do you stop time??' Jeter wrote in the caption.He did reveal some of his fatherly routine in a recent Tonight Show exchange with host Jimmy Fallon.",
        "'It's controlled chaos,' Jeter said. 'It's school pick-ups, drop-offs, they do my nails, my toenails, makeup, lipstick. It's the greatest thing I've ever experienced though, my girls, they are the absolute best.'",
        "Professionally, Jeter is embarking on an announcing career that is set to begin next month with MLB's London series between the St. Louis Cardinals and Chicago Cubs.Fox announced the Jeter addition before February's Super Bowl, when his former teammate, Alex Rodriguez, welcomed the five-time World Series champion to the broadcast booth.Previously, in 2017, Jeter became the lead executive of the Miami Marlins and purchased a 4-percent stake. He has since stepped down while selling his shares of the club."
    ]
}