{
    "articleURL": "/wires/reuters/article-12047491/Markets-bet-ECB-pause-hikes-soon-economy-feels-rate-pinch.html",
    "content": [
        "ECB message on rate hikes transmitting forcefully resonates",
        "Some analysts warn of mistake if ECB keeps goingEuro outlook dimsBy Naomi Rovnick and Dhara RanasingheLONDON, May 4 (Reuters) - The ECB may not be done with rate hikes just yet, but its own admission that aggressive tightening is now making itself felt in the euro zone economy is enough for markets to bet that peak rates could arrive sooner rather than later.Interest rate-sensitive two-year German bond yields and the euro fell on Thursday after the European Central Bank delivered its seventh straight hike but slowed the pace of its policy tightening with a quarter percentage point increase.ECB chief Christine Lagarde said the central bank for the 20 countries that share the euro was not pausing.But the ECB noted that past rate increases were being \"transmitted forcefully\" into financing and monetary conditions - resonating with investors who are assessing the impact of aggressive tightening globally on the banking sector and beyond.\"In our minds, we are in policy mistake territory,\" said Salman Ahmed, global head of macro and strategic asset allocation at Fidelity International. \"This is a very restrictive policy and it will turn into credit tightening and that will bring a recession.\"German and Italian two-year government bond yields fell to their lowest levels in around a month .",
        "Traders also moved to price in a roughly 70% chance of a quarter point move in June, versus 80% earlier in the day, and a peak rate around 3.65%, down from just over 3.7% before the ECB announcement.The ECB's Bank Lending Survey, released on Tuesday, showed a net 38% of euro zone banks reported a decline in demand for credit from companies in the first quarter, the biggest proportion since the global financial crisis of 2008-09.The ECB has now increased its key deposit rate by some 375 bps since last July, from -0.5%. U.S. rates have jumped 500 bps, with the Federal Reserve hiking again on Wednesday while opening the door to a pause.Higher rates have been blamed for recent turmoil in the U.S. banking sector, with PacWest Bancorp sliding again on Thursday on news the Los Angeles-based bank was in talks about strategic options.Richard Dias, head of research at investment consultancy Acorn Macro Consulting, said the ECB may stop raising rates \"if the U.S. banking crisis gets worse, which it very well could do\".But he added that Europe's banking system was in a better place than its U.S. counterpart because of different mortgage structures in the two regions. Thirty-year U.S. mortgage terms are making it harder for lenders there to match what they receive on home loans with the rates they now have to pay to fund themselves.",
        "Gareth Rudd, a European equity fund manager at Chelverton Asset Management, said he was negative on European bank stocks because regulators will want them to conserve capital instead of paying dividends.He said that while European equities had enjoyed a strong start to the year \"that's gradually paused and the business environment is getting harder\".Europe's broad STOXX 600 index is at its lowest in around a month, down from April's 14-months highs.\"There seems to be some mindfulness (at the ECB) about the fact there's this news coming from the U.S., and while we think we haven't got the banking problems they've got, we're alert, we've seen some weak euro zone data,\" said Societe Generale's chief global currency strategist Kit Juckes.In bond markets, room for falls in government bond yields were seen as limited.Mauro Valle, head of fixed income at Generali Investments Partners, said he was \"staying neutral\" on European bonds, with no short-term plans to buy or sell.Germany's 10-year bond yield, which moves inversely to the price, fell to a one-month low at 2.16% on Thursday and is down some 40 bps so far this year.The outlook for the euro, which has been boosted in recent weeks on expectations the ECB would keep hiking as the Fed hit pause, meanwhile dimmed.",
        "Societe Generale's Juckes said his target of the euro reaching $1.18 by year-end was now \"a stretch\".The euro was trading at around $1.0991, down from more than one-year highs hit last month.\"I'm frightened that having had a nice little leg up the euro goes to sleep again,\" he said.(Reporting by Dhara Ranasinghe and Naomi Rovnick; Editing by Catherine Evans)"
    ]
}