{
    "articleURL": "/wires/ap/article-12041297/US-Navy-Iran-seizes-oil-tanker-Strait-Hormuz.html",
    "content": [
        "DUBAI, United Arab Emirates (AP) - Iran's paramilitary Revolutionary Guard seized a Panamanian-flagged oil tanker in the strategic Strait of Hormuz on Wednesday, the second such capture by Tehran in under a week amid heightened tensions over its nuclear program.",
        "The taking of the oil tanker Niovi renewed concerns about Iran threatening maritime traffic in the strait, the narrow mouth of the Persian Gulf through which a fifth of all crude passes. It also comes amid the disappearance of a crude oil tanker in Southeast Asia believed to be carrying Iranian crude oil amid reports it may have been seized by the United States.The U.S. Navy published surveillance footage shot by an aerial drone of about dozen Guard vessels swarming the tanker on Wednesday morning. The drone had been on a routine patrol in the area and saw the seizure, though the Navy did not receive a distress call from the Niovi itself, 5th Fleet spokesman Cmdr. Timothy Hawkins said.Those Guard ships \"forced the oil tanker to reverse course and head toward Iranian territorial waters off the coast of Bandar Abbas, Iran,\" the Navy said.\"Iran´s actions are contrary to international law and disruptive to regional security and stability,\" the 5th Fleet said in a statement. \"Iran´s continued harassment of vessels and interference with navigational rights in regional waters are unwarranted, irresponsible and a present threat to maritime security and the global economy.\"Iran acknowledged the seizure, with the judiciary's Mizan news agency quoting the Tehran prosecutor's office as saying that a judge ordered it impounded over an unspecified complaint.",
        "Shipping registries show the Niovi is managed by Smart Tankers of Piraeus, Greece. A woman who answered the phone at the firm declined to immediately comment on the seizure. The Niovi had been coming from dry-dock repairs in Dubai, bound for Fujairah on the eastern coast of the United Arab Emirates without carrying any cargo, according to the data firm Refinitiv.Last week, Iran seized an oil tanker carrying crude for Chevron Corp. of San Ramon, California, amid wider tensions between Tehran and the U.S. over its nuclear program. The Advantage Sweet had 23 Indians and one Russian on board.Iran has accused the Advantage Sweet of colliding with another vessel, while offering no evidence to support its claim. Iran has offered a variety of unsupported claims in the past when seizing foreign-flagged ships amid tensions with the West.The taking of the two tankers in under a week comes amid the disappearance of the Marshall Island-flagged Suez Rajan, which had been in the South China Sea off Singapore for over a year after a report alleged it to smuggling sanctioned Iranian crude oil. Tracking data for the Suez Rajan last showed it off East Africa, moving in a direction that could take it to the Americas.The Financial Times, as well as the maritime intelligence firm Ambrey, both have reported the Suez Rajan was seized on order of American authorities. The ship's manager has not responded to queries from The Associated Press about the status of the ship. U.S. officials also have not commented.",
        "However, the Greek Ministry of Maritime Affairs acknowledged Wednesday recently sending a warning to Greek ships in the Mideast to be on alert when going through the Persian Gulf. The ministry did not say what prompted the warning.In Washington, State Department spokesperson Vedant Patel criticized Iran for seizing the ships.\"Candidly, Iran´s harassment of vessels and interference with navigational rights in regional and international waters are contrary to international law and disruptive to regional stability and security,\" he said.The seizure by Iran of two ships in the last week was the latest in a string of ship seizures and explosions to roil the region.The incidents began after then-President Donald Trump unilaterally withdrew the U.S. from Iran´s nuclear deal with world powers, which saw Tehran drastically limit its enrichment of uranium in exchange for the lifting of economic sanctions. They've continued under President Joe Biden and as diplomatic efforts at finding a way back to the accord remain stalemated.Also, the U.S. Navy has blamed Iran for a series of limpet mine attacks on vessels that damaged tankers in 2019, as well as for a fatal drone attack on an Israeli-linked oil tanker that killed two European crew members in 2021.Tehran denies carrying out the attacks, but a wider shadow war between Iran and the West has played out in the region´s volatile waters. Iranian tanker seizures have been a part of it since 2019. The last major seizure before recent days came when Iran took two Greek tankers in May 2022 and held them until November.",
        "In the wider Mideast, Iranian-backed militias in Syria have carried out attacks on U.S. forces, including one that killed an American contractor in March. The U.S. responded with airstrikes. It also has deployed A-10 Thunderbolt IIs into the region, as well as announced the presence of a guided-missile submarine in recent weeks.Since the collapse of the nuclear deal, Iran now enriches uranium closer than ever to weapons-grade levels. The head of the International Atomic Energy Agency has warned that Tehran now has enough of a uranium stockpile to build \"several\" nuclear weapons if it chooses. Iran long has insisted its program is for peaceful purposes, though the IAEA and Western intelligence agencies believe Tehran had a secret military nuclear program through 2003.Iran also has restricted the ability of IAEA inspectors to monitor its program. However, the IAEA on Wednesday acknowledged that \"work is ongoing\" to reinstall monitoring equipment at Iranian nuclear sites following a March visit by its director-general to Tehran. The agency did not elaborate and Tehran did not acknowledge the work.___Associated Press writers Nasser Karimi in Tehran, Iran, and Elena Becatoros in Athens, Greece, contributed to this report."
    ]
}