{
    "articleURL": "/news/article-12040591/Extremist-anti-LGBTQI-group-CitizenGO-looking-hire-Australian.html",
    "content": [
        "CitizenGO looking to hire in AustraliaGroup campaigns against LGBTQI groups An extremist European anti-LGBTQI group is now expanding into Australia with a position currently on offer for a 'campaigns director' Down Under.",
        "CitizenGO, founded in Madrid in 2013, describes itself as a 'community of active citizens who work together to defend and promote life, family, and liberty'.The group claims to 'influence institutions, governments and organisations' in 50 different countries, and is now hoping someone in Australia will join the team.The organisation is known for regularly campaigning against the LGBTQI+ community and peddling anti-gay rhetoric.  ",
        "The job description for Campaigns Director says the applicant will organise rallies, stunts, advertisements as well as coordinating campaign strategies on social media.'This is an exciting position at the heart of one of the most innovative and promising advocacy and mobilisation organisations in the world today,' the listing says.'It offers a unique platform from which to help develop and pursue large scale social change efforts.'CitizenGO claims it has more than 17 million 'active citizens' across the globe who 'stop radical lobbies from imposing their gender on society'.It was founded by far-right Catholic conservative group HazteOir and has links to Russia - with the latest job opening causing concern. The controversial group is pro-life and regularly shares petitions asking members to vote against abortion schemes.One of their latest petitions calls on people to boycott Nike, following the activewear brand's advertisement featuring transgender influencer Dylan Mulvaney.",
        "Another petition took aim at LGBTQI group Educate and Celebrate, which educates school children about gender identity and sexual orientation.CitizenGO described it as a 'controversial group' that is 'responsible for promoting materials such as the \"Gender Unicorn\" to teach a completely unscientific view of sex and gender'.",
        "The organisation is also sternly against Disney holding a pride concert, which will feature some of its classic songs performed by the San Francisco Gay Men's Choir.'Disney has become a twisted and predatory servant of the radical left and the LGBTQ agenda,' CitizenGO said.In December last year, the group's Twitter account was suspended after sharing a photo where it accused LGBT groups of 'normalising peadophilia'.The group also calls on members to reject any moves to legalise assisted dying.Daily Mail Australia contacted CitizenGo for comment. "
    ]
}