{
    "articleURL": "/wires/reuters/article-12052411/U-S-moving-ahead-500-million-arms-aid-Taiwan-source-says.html",
    "content": [
        "By Mike Stone",
        "WASHINGTON, May 5 (Reuters) - U.S. President Joe Biden's administration plans to send $500 million worth of weapons aid to Taiwan using the same emergency authority that has been used more than 35 times for Ukraine, a source familiar with the plan said on Friday.As a part of the 2023 budget, Congress authorized up to $1 billion worth of weapons aid for Taiwan using Presidential Drawdown Authority (PDA), a type of authority that expedites security assistance and has helped to send arms to Ukraine.This drawdown, which authorizes the president to transfer articles and services from U.S. stockpiles without congressional approval during an emergency, would be the first from that $1 billion authorization.China views democratically-governed Taiwan as its own territory and has increased military pressure on the island over the past three years. It has never renounced the use of force to bring the island under its control.Last month, China staged war games around Taiwan after Taiwan President Tsai Ing-wen met U.S. House of Representatives Speaker Kevin McCarthy in Los Angeles.In February, U.S. Defense Secretary Lloyd Austin testified before the Senate Armed Services Committee that he intended to make use of drawdown authority, a Pentagon spokesperson said on Friday. The spokesperson declined to comment on whether the U.S. was moving ahead with the $500 million aid package.",
        "\"Our approach remains consistent with longstanding U.S. policy... We're hard at work fulfilling our obligations under the TRA (Taiwan Relations Act), and we're going to continue to do so,\" the spokesperson said.Since 1979, the U.S.-Taiwan relationship has been governed by the Taiwan Relations Act, which gives a legal basis to provide Taiwan with the means to defend itself, but does not mandate that the United States come to Taiwan's aid if attacked.It was unclear what would be included in the aid package for Taiwan, which was first reported by Bloomberg news. The timing was also unknown.Taiwan has since last year complained of delays to U.S. weapon deliveries, such as Stinger anti-aircraft missiles, as manufacturers turned supplies to Ukraine as it battles invading Russian forces. The issue has concerned some U.S. lawmakers.Taiwan Defense Minister Chiu Kuo-cheng said on Thursday that the delivery of 66 advanced new F-16Vs from the United States had been delayed due to supply chain disruptions and the ministry was working to minimize the damage and \"make up deficiencies.\" (Reporting by Mike Stone in Washington, Editing by Rosalba O'Brien)"
    ]
}