{
    "articleURL": "/sport/football/article-12046129/Jose-Mourinho-hits-worst-referee-career-Romas-draw-Monza.html",
    "content": [
        "Jose Mourinho labelled referee Daniele Chiffi as the 'worst' he has encountered The Roma boss criticised the official after his side's 1-1 draw against MonzaMourinho has received three red cards this season over clashes with officialsJose Mourinho has claimed he wore a wire for his own protection during his side's match against Monza, with the Roma boss labelling referee Daniele Chiffi as the 'worst' he has encountered.",
        "Roma suffered a blow in their pursuit of European qualification on Wednesday, after drawing 1-1 with Monza.Stephan El Shaarawy’s opening goal was cancelled out by Monza's Luca Caldirola, with the result leaving Roma outside the European places in Serie A.Mourinho was angered by the decision from referee Chiffi to send off Mehmet Zeki Celik for a second bookable offence.The Portuguese coach claimed the official has 'no empathy' after sending off Celik in the fifth minute of second half stoppage time.",
        "Mourinho hit out at the referee in his post-match comments, adding that Roma were 'weak' for failing to demand that Chiffi does not officiate their matches. ‘This was the worst referee I have encountered in my entire career,’ Mourinho told DAZN, as quoted by Football Italia.‘Believe me, I have dealt with many bad referees. Usually, when I talk about referees, it is because they have a direct influence on the game.‘In this case, I don’t think that is true. But he is horrible, he makes no human connection with anyone, he has no empathy, he gives a red card to a player who slips because he is exhausted at the 96th minute.‘Unfortunately, this too is a sign of Roma’s weakness as a club, because we do not have the strength of other clubs who can say we don’t want this referee.",
        "‘I stopped working 20-30 minutes from the end, because I knew he would give me a red card for anything.‘There are clubs that say I don’t want this referee and Roma either don’t have this capability or the DNA or anything else.‘It’s horrible, with the few players I have in my squad, I could not get a red card.’",
        "According to Gabriele Marcotti, Mourinho added that he had worn a wire for the match for his own 'protection', following several disputes with officials during the season. Mourinho had been sent off by Chiffi back in September, after coming onto the pitch to remonstrate with the official having seen his side denied a penalty in a 1-0 defeat against Atalanta.The Roma boss has received three red cards during the campaign, having also been dismissed in matches against Torino and Cremonese.The 60-year-old received a two-match touchline ban last month for the red card against Cremonese, following an altercation with fourth official Marco Serra.Mourinho had threatened to take legal action following his dismissal. Roma's draw against Monza leaves Mourinho side seventh in Serie A, with AC Milan and Atalanta ahead only on goal difference.Roma are just two points behind fourth placed Inter Milan, who occupy the final Champions League spot.Mourinho's team also have a route to the competition through the Europa League, with the Italian side facing Bayer Leverkusen in the semi-finals."
    ]
}