{
    "articleURL": "/news/article-12047499/Disruptive-female-passenger-kicked-Frontier-flight-passengers-VOTE-rid-her.html",
    "content": [
        "The woman was voted off the flight for reportedly 'antagonizing' a couple who had earlier been booted off for arguing with a flight attendantA man in a red shirt could be seen on video calling for passengers to vote if they wanted the woman removedThe Frontier Airlines flight from Trenton to Atlanta was delayed for about an hour on the ground due to the debacle A disruptive woman was booted from a Frontier Airlines flight on Monday after fed-up passengers held a vote.",
        "The incredible moment occurred on a flight from Trenton to Atlanta and was filmed and posted on TikTok.A passenger in a red shirt and glasses could be heard asking the packed cabin: 'If you want her removed from the flight raise your hand.'I'm not even kidding. If you can hear me, raise your hand if you want her removed from the flight. I'm not even kidding, I got 40 hands up.'The footage then showed multiple passengers with their hands up before the self-appointed leader of the pack called for a security guard to come over.",
        "'Sir, I want her off the plane. I don't care, I'm trying to prove a point. If you want to be a d**k to people, we're going to be a d**k back.'The video then showed the woman gathering her things to leave the flight, which had been delayed about an hour on the ground.The bizarre incident began after a couple, sitting a few rows in front of the woman who was voted off, had a verbal altercation with a flight attendant.They had reportedly asked to sit closer to the front of the aircraft but were denied, sparking a back-and-forth with staff.'He did nothing wrong,' the female passenger in a black top could be heard saying to the flight attendant about her travel companion. ",
        "The woman who was voted off was reportedly making sly comments about the couple during their seat dispute.'Mind your f***ing business!' the female passenger could be heard yelling at the woman sitting behind her.The male passenger at one point walked over to the woman and handed her a few bills from a giant wad of cash, which she threw back in his face. The female passenger then shouted at the woman a few rows back saying: 'We've been asking you to mind your business this whole plane ride. What are you so invested in us for?' ",
        "Ground crew members in bright orange vests eventually pulled the couple off the flight but as they were being escorted away, the female passenger shouted that the other woman should get the boot for 'antagonizing' them the whole time.That is when passengers who had to sit through the debacle took matters into their own hands and voted the woman off the plane. A security officer approached her and said the airline could not have fighting at 30,000 feet and that she would have to deplane. One passenger on the budget airline flight wondered why passengers were left to deal with the chaotic situation.'I want to know why these regular people is on here telling these people to get off this plane. Because where is the police?' inquired one flyer."
    ]
}