{
    "articleURL": "/news/article-12055341/Biden-approves-NYC-congestion-charge-plan-charge-drivers-23-day-existing-tolls.html",
    "content": [
        "Drivers could be charged $23 to enter Manhattan's central business district Officials say plan would reduce the number of cars entering Manhattan by 20% Outside travelers could see fees as high as $120 under the MTA proposal The Biden administration has approved the release of the final environmental assessment for New York City's congestion pricing plan for public comment, a key step before the project can be green-lit and finally go ahead.",
        "The Federal Highway Administration approval is a milestone in efforts to implement the plan announced in 2019 to reduce traffic and provide funding to improve mass transit by using tolls to manage traffic in central Manhattan.The approval means the New York project sponsors are cleared to put the environmental assessment and draft finding of no significant impact out for a 30-day public notice before the federal agency makes its final determination.In August, New York said drivers could face a traffic congestion charge of up to $23 a day by mid-2024, while the cost of a round trip by car from areas like Princeton, New Jersey, could be as much as $120. The toll would be applied on top of existing bridge and tunnel tolls to congestion charges.",
        "A study released last year projected it would reduce the number of cars entering Manhattan by 15 to 20 percent.Other major global cities such as Singapore and London already have congestion pricing policies to clamp down traffic. In New York, the city wants to charge a daily variable toll for vehicles entering or remaining within the central business district, defined as between 60th Street in midtown Manhattan and Battery Park on Manhattan's southern tip.New York, which has the most congested U.S. traffic, would become the first major U.S. city to follow London, which began a similar charge in 2003.",
        "MTA officials have said they would need almost a year to set up the new tolling infrastructure once it obtains federal approval, putting it on track to meet its current target of launching congestion pricing in the second quarter of 2024.A spokesperson for Gov. Kathy Hochul said the finding 'is a critical step that will allow our Environmental Assessment to be publicly available for anyone to read, and we will continue to work with our partners to move congestion pricing forward.' 'Governor Hochul is committed to implementing congestion pricing to reduce traffic, improve air quality, and support our public transit system,' John Lindsay, a spokesperson for Hochul, said in a statement. 'We've worked closely with partners across government and with community members over the last four years to develop a plan that will achieve these goals.' ",
        "Democratic New Jersey Gov. Phil Murphy condemned the approval as 'unfair and ill-advised.''Everyone in the region deserves access to more reliable mass transit, but placing an unjustified financial burden on the backs of hardworking New Jersey commuters is wrong,' Murphy said in a statement. 'Simply put, it is a money grab.'New York lawmakers approved the plan in 2019, and it was originally projected to start in 2021, but the federal government under President Donald Trump did not take any action.",
        "The Metropolitan Transportation Authority (MTA) said on Friday that congestion pricing 'is a generational opportunity to make it easier for people to get around in, and get to, the Central Business District, by reducing traffic and funding improvements to the public transit system.'The MTA said it was grateful the Federal Highway Administration found the document met standards for legal sufficiency.",
        "Last year, the MTA said passenger vehicle drivers could pay between $9 and $23 to enter at peak times, while overnight tolls could be as little as $5. It would cost between $12 and $82 for trucks.A six-member Traffic Mobility Review Board will recommend a final pricing structure for the MTA board to approve. The environmental assessment found the charge would cut traffic, improve air quality, make buses more reliable and increase transit use by 1-2 percent. The toll would generate $1-$1.5 billion a year for MTA, which runs the city's public transit system and faces a financial crisis as ridership continues to lag behind pre-pandemic levels.The money would also support $15 billion in debt financing for mass transit improvement."
    ]
}