{
    "articleURL": "/wires/ap/article-12044409/Padres-rookie-Sullivan-hits-1st-HR-4-RBIs-7-1-win.html",
    "content": [
        "SAN DIEGO (AP) - Rookie Brett Sullivan hit his first home run and had his first four RBIs, and Juan Soto hit a three-run double to make up for a baserunning blunder that cost Xander Bogaerts a club-record on-base streak as the San Diego Padres beat the Cincinnati Reds 7-1 Wednesday to take two of three.",
        "Seth Lugo (3-2) pitched six strong innings for the Padres, who have won 7 of 10 heading into a home weekend series against the rival Los Angeles Dodgers. It'll be the teams' first meeting since the Padres eliminated the 111-win Dodgers in four games in the NL Division Series to reach their first NL Championship Series in 24 years.The 29-year-old Sullivan, catching a day game after a night game, hit a two-run double down the right field line with one out in the second and then drove a two-run homer to right with two outs in the fourth. His double, off Luis Cessa (1-4), snapped the Padres' 0-for-15 skid with runners in scoring position and brought in Jake Cronenworth and Ha-Seong Kim.Sullivan's homer came off Alex Young and scored Rougned Odor. Sullivan made his major league debut on April 18 against Atlanta and got his first hit, a single, at the Chicago Cubs on Thursday. Sullivan was recalled from Triple-A El Paso on April 16, two days after Luis Campusano sprained his left thumb. He was obtained in a trade with Milwaukee for catcher Victor Caratini on April 6, 2022.\"I'm feeling pretty good,\" said Sullivan, who had more than 200 messages waiting for him on his phone. \"Just to be able to get those RBIs for the boys early to take the lead, that's what probably felt the best. Then seeing that ball get out was a dream come true, and I definitely heard the fans. I tried to soak it in as much as I can but I blacked out a little bit.\"",
        "Said manager Bob Melvin, a former big league catcher: \"I had one big game, too, so he's got a couple at this point already. To come up to the big leagues and you don't really know what to expect and to catch a couple of wins, get your first big league hit and you have a game like that, it resonates with you. It's great we have an off day, too, that he can answer all his phone calls and texts.\"",
        "Soto cleared the bases with a two-out double into the right field corner with two outs in the sixth. He also walked three times to extend his big league lead to 31. He was erased on a double play in the third and then committed an embarrassing baserunning error in the fifth that cost Bogaerts a single.Soto took off for second on Bogaerts' sinking liner that bounced just in front of diving right fielder Stuart Fairchild. Soto, who rounded second, thought Fairchild caught it and touched second again as he headed back to first even though Bogaerts and acting first base coach David Macias were motioning for him to go back to second. It was ruled a 9-4 force-out.Bogaerts had two more chances to extend his club-record on-base streak of 30 games to open a season but he popped up to end the sixth and struck out to end the eighth.",
        "\"What can I say, it's baseball,\" Bogaerts said. \"You never know what to expect when you come to the ballpark. Obviously Soto didn't want to do it on purpose. So definitely he feels bad also. But I'll get more.\"Looking back on his streak, Bogaerts said, \"It's good, man. Now I can use my other cleats. I have two pair of cleats so I've been riding that one pretty hard. I've been superstitious with that one so I can probably break in my other set of cleats now.\"Lugo allowed only one run and seven hits in six innings while striking out five. His only big mistake was allowing Spencer Steer's leadoff homer to left in the sixth, his third.Cessa lasted only 3 1/3 innings, giving up three runs and four hits.NICE DPadres center fielder Trent Grisham, a two-time Gold Glove winner, doubled TJ Friedl off first to end the first after catching Steer's fly ball. Lugo made a terrific snag of Fairchild's liner to end the second, one play after Jake Fraley went first to third, sliding in headfirst, on Nick Senzel's routine grounder to third. In the bottom of the inning, Fraley made a nice diving catch of Odor's sinking liner to left.SOMBRERO SEASONThe Padres are getting great use out of the black, green, red and white sombrero Fernando Tatis Jr. bought at the team hotel in Mexico City on Friday night. Not only do the Padres put it on the head of whoever hits a home run and use in it clubhouse piñata parties after wins, but Nelson Cruz wore it out to the plate meeting to exchange lineup cards before Wednesday's game. Cruz wore the sombrero as he destroyed a Buzz Lightyear piñata while his teammates danced around, many wearing lucha libre masks, after a 16-11 win against San Francisco on Saturday night. Manny Machado, who got the day off, placed the sombrero on Sullivan's head after his homer.",
        "UP NEXTReds: RHP Hunter Greene (0-1, 2.89 ERA) is scheduled to start Friday night in the opener of a home series against the Chicago White Sox, who counter with Lance Lynn (0-4, 7.16).Padres: In a marquee matchup, Dodgers LHP Clayton Kershaw (5-1, 1.89) opposes RHP Joe Musgrove (1-0, 10.80) on Friday night in the opener of a three-game series.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}