{
    "articleURL": "/wires/reuters/article-12046723/US-STOCKS-Wall-St-set-lower-open-PacWest-woes-offset-Fed-pause-optimism.html",
    "content": [
        "PacWest slumps as it looks at strategic options",
        "Fed opens door to pause in tightening cycleMegacap, tech stocks edge up premarketFutures down: Dow 0.20%, S&amp;amp;P 0.28%, Nasdaq 0.14%(Updates prices, adds jobs data in paragraph 12)By Ankika Biswas and Sruthi ShankarMay 4 (Reuters) - U.S. stock indexes were set for a lower open as news of PacWest Bancorp exploring strategic options deepened concerns about the health of regional banks, countering optimism from the Federal Reserve's signal of a likely pause in its interest rate hikes.PacWest Bancorp tumbled 37.2% in premarket trading on Thursday after it confirmed it was exploring strategic options, including a sale, after shares of the regional lender and peers got hammered amid fears of a worsening banking crisis.Regulators seized troubled First Republic Bank and JPMorgan Chase agreed to buy majority of its assets earlier this week, marking the largest U.S. bank failure since the 2008 financial crisis.Shares of other regional lenders such as KeyCorp, Valley National Bancorp and Zions Bancorp fell between 7.7% and 9.6% on Thursday, while Western Alliance Bancorp dropped 13.4% despite noting that it had not experienced unusual deposit outflows following the sale of First Republic.\"PacWest is more evidence that the U.S. banking crisis is not over yet,\" said Stuart Cole, chief macro economist at Equiti Capital.",
        "\"It (PacWest) does appear that it is struggling, and I would be very surprised if it was not for the same reasons as those before it ... the market is circling all these regional U.S. banks like a vulture, looking which one to pick off next.\"The U.S. central bank on Wednesday raised interest rates by 25 basis points to the 5.00%-5.25% range and signaled a pause in its policy tightening, giving officials time to assess the recent bank failures, U.S. debt ceiling situation and sticky inflation.However, U.S. stocks dropped on Wednesday after Fed Chair Jerome Powell said that it was too soon to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.U.S. interest rate futures priced in a pause in tightening at the Fed's June and July policy meetings, according to the CME's FedWatch tool, and also factored in a nearly 50% chance of rate cuts at the September meeting.Although the end of Fed's market-punishing rate-hike cycle may be in sight, uncertainty over stock valuations and the economic outlook are keeping investors on alert for more turbulence ahead.Major technology and growth stocks such as Meta Platforms Inc, Microsoft Corp and Alphabet Inc edged up on Thursday, helped by a fall in U.S. Treasury yields.",
        "The number of Americans filing new claims for jobless benefits increased last week as the labor market gradually softens amid higher interest rates, which are cooling demand in the economy.Apple Inc shares fell 1.5%, with the iPhone maker set to report quarterly results after the closing bell.At 8:34 a.m. ET, Dow e-minis were down 68 points, or 0.20%, S&amp;amp;P 500 e-minis were down 11.5 points, or 0.28%, and Nasdaq 100 e-minis were down 18.25 points, or 0.14%.Qualcomm Inc slumped 7.4% after the chip designer's third-quarter forecasts missed estimates.Paramount Global Inc dropped 17.2% after missing first-quarter revenue estimates as it added fewer subscribers at its flagship streaming service and advertisers cut back on spending.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}