{
    "articleURL": "/wires/pa/article-12054793/Stuart-Kettlewell-targets-seventh-placed-finish-Motherwell-beat-Kilmarnock.html",
    "content": [
        "Motherwell manager Stuart Kettlewell revealed he has set his team the target of finishing seventh this season following their 2-0 home win over Kilmarnock.",
        "Goals from Blair Spittal and Kevin van Veen – the Dutchman’s 25th of the campaign – ensured the Fir Park side are all but safe from relegation with four games remaining.Kettlewell, though, insisted his focus has always been looking up the table rather than down the way, and wants Motherwell to aim to overhaul Livingston in seventh spot.He said: “It’s another good home win with a clean sheet for us.“We would maybe have liked that second goal to have come a wee bit earlier to calm the nerves. But it’s testament to the players who dealt with everything that came their way.“Their goalkeeper has had an outstanding day with some massive stops. Paul McGinn misses one from two yards that might haunt him, but we created a number of chances and deserved the win.",
        "“At no point have we been looking at what’s happening behind us. It’s a case of what we can affect. We have to go every week and approach it the way we did today. If we do, we have a chance to be a successful club.“What’s the best we can achieve? To finish top of the bottom six. We’d love to take that position but we only do that by doing our work through the week.”",
        "Kettlewell insisted there would be no prospect of his players now easing through to the summer break.He said: “We are functioning really well as a team. It seems a long way from when I first took over but these guys are knocking down barriers.“They are speaking about having Monday off but it’s not going to happen. We have four games to go and we need to give the utmost respect to what our goals are and reach them.”Kilmarnock boss Derek McInnes was left frustrated with his team’s performance, especially on the back of their victory at St Mirren last time out.He said: “It was very disappointing. We need better performances than that at this stage of the season.“This was always going to be the toughest of the five games, taking in mind our away form. We took confidence from beating St Mirren but we never got to those levels.“Motherwell have a maverick player in Van Veen and he inspires them. We missed Kyle Vassell but we still had enough as a team to get something from the game. If you can’t win, then make sure you don’t lose it.“The second goal was disappointing. Van Veen’s technique was good but we should defend that better.”"
    ]
}