{
    "articleURL": "/wires/pa/article-12052001/Royal-fans-globe-camp-Mall.html",
    "content": [
        "Royal fans from around the globe have arrived in London ahead of the coronation celebrations, with many camping out on the Mall to get a prime view of the procession.",
        "Even the poor weather forecast, which could see the flypast called off at the last moment, has not deterred fans from holding down their viewing spots by Buckingham Palace.Twin brothers Richard and John Griffin, 55, arrived at the Mall at 2pm on Friday.The brothers both grew up in London but John now lives in Perth, Australia, while Richard lives in south London.Richard told the PA news agency that he and John went to the Mall as “this is going to be one of those major things in the next fifty years”, with John adding that they are lifelong royal fans, having also gone for the platinum jubilee and the Queen’s funeral last year. I think it’s just a special time for everyone  Mary, from Houston, Texas  The brothers wore suits printed with £20 notes, which they say they originally bought for a stag do.",
        "“I think the King will be pretty good because he’s had a lot of practice,” Richard said. “He’s had a lot of experience,” added John.Both now project managers who specialise in building and maintenance, the brothers said they were well prepared for rain.“We want to see the new King and Queen, and the absolute regalia,” said Richard.“We’ve got waterproof clothing, we’ve got a tent behind us, we’ll be cool.”",
        "Four American women have been in front of Buckingham Palace, with one holding a sign saying “from America with love”, and another saying “we’re back”.They travelled to London to see the coronation, arriving on Sunday and camping out on the Mall since Thursday.“Everybody’s been so nice over here,” said Louanne, from Atlanta, Georgia, in the US, who added that she was most excited to see “all the glitz”.The women came to the UK in 2011 for the wedding of the Prince and Princess of Wales, which they said was “fabulous”.“I think it’s just a special time for everyone,” said Mary, from Houston, Texas. “It’s a nice, happy event, and I think it’s just special.The King “has had a lot of training, he’s going to do well,” added Denise, also from Houston."
    ]
}