{
    "articleURL": "/wires/ap/article-12061083/Indigenous-missing-person-cases-researchers-attention.html",
    "content": [
        "ALBUQUERQUE, N.M. (AP) - A New Mexico task force charged with addressing missing person cases involving Native Americans is teaming up with researchers in Nebraska on a data collection project that they hope will begin to close the gaps when it comes to tracking cases and their outcomes nationwide.",
        "The goal of the federally funded effort is to better define the scope of what many experts and activists have referred to as a \"silent crisis.\" The work began last week, said Melody Delmar, special projects coordinator with the New Mexico Indian Affairs Department.One of the challenges for policymakers across Indian Country has been the lack of a consistent and sustainable system for reporting and tracking such cases. Researchers at the University of Nebraska-Omaha will be using a model first developed for that state to address data collection across multiple law enforcement jurisdictions.It was only last year that the FBI started publishing a list of Indigenous people missing in New Mexico and the Navajo Nation. That list took six months to compile by validating different databases, and Delmar said this next phase of research will build on those efforts and help to guide future policymaking.\"While we´re working at the higher levels of government and at my level - policy work on the ground level - we know that people are still going missing. So we´re moving full steam ahead,\" she said.The U.S. Justice Department's research and evaluation arm is funding the New Mexico project with a grant worth nearly $250,000. In all, the National Institute of Justice awarded six grants totaling nearly $5 million for research that could help curb violence against women.",
        "Indigenous families, activists and advocacy groups gathered last Friday and over the weekend to bring more attention to the disproportionate number of tribal community members who have gone missing or have been killed in North America. While past studies have shown homicide and violence rates are exponentially higher for Native Americans and Alaska Natives, the number of missing and slain Indigenous women remains unknown.A 2022 congressional research report highlights jurisdictional overlaps among tribal, local, state and federal police forces as a top challenge, aside from the lack of data.In New Mexico, the state Department of Public Safety became the first agency in the United States to allow reporting agencies to identify Indigenous people and their respective tribes, pueblos, or nations. That was made possible when the department modified its National Crime Information Center.Delmar and others who are working on the issue say the next step for New Mexico will be consideration of an alert system for when Indigenous people go missing, like systems being developed in California and now Oklahoma.\"It's about identifying what other missing pieces are there,\" she said. \"And I think this is an important part, when we get done going through the research, that will help inform what kind of effective legislation we can improve on and work on.\"",
        "Nationally, the Urban Indian Health Institute distributed $1.2 million in grants last fall for groups to carry out best practices for data collection on American Indians and Alaska Natives. The institute refers to the effort as \"decolonizing data,\" as inaccurate categorization and racial misclassification has led to undercounts when it comes to representation of social, economic and health measures.Advocates say that has resulted in fewer resources being given to Native communities.In New Mexico's largest judicial direct, there are no extra resources being funneled to prosecutors to work on Missing and Murdered Indigenous Persons, or MMIP, cases. Still, Bernalillo County District Attorney Sam Bregman said the office has dedicated two staffers to review as many cases as they can. The special unit has been able to locate five people since its creation in December 2021, he said, but there are 28 still on the list.\"This is a work in progress, and we continue to get better at it,\" he said. \"And I think from what I´ve seen, the federal agencies involved are getting better at it as well.\"For Denise Billy and Kayleigh Otero, their work in the district attorney's office starts after cases are reported to law enforcement. They review the files and develop profiles that include the missing person's daily routine, whom they associated with and any other details the family can provide - even the smallest of details.",
        "\"That´s something that me and Denise think about the most: just really digging deep,\" Otero said. \"It´s important work and it´s work that we´re dedicated to doing. We don´t just turn it off when we get to go home.\""
    ]
}