{
    "articleURL": "/sport/golf/article-12054359/Tiger-Woods-accused-sexual-harassment-ex-girlfriend-Erica-Herman.html",
    "content": [
        "Herman sued Woods over an NDA she claims is being wrongfully enforced on her In the latest filing, she claims she was forced to sign the NDA or lose her jobDailyMail.com provides all the latest international sports newsTiger Woods's ex-girlfriend Erica Herman has accused him of sexual harassment that included her alleging that the golfer forced her to either sign a non-disclosure agreement or be fired from her job, according to a court document. ",
        "Herman, 38, who dated the 15-time major winner, 47, for almost six years, filed the document through her attorney, Benjamin Hobas in Martin County, Florida, late Friday.The filing is the latest in Herman's case against the golfing icon over an NDA she claims she is being wrongfully enforced on her, citing the Speak Out Act.In the latest filing, Herman alleged that Woods pursued a sexual relationship with her while she was his employee at his South Florida restaurant and forced her into signing an NDA. In the document obtained by DailyMail.com, Herman's attorney, Hodas, wrote, 'Mr. Woods was Ms. Herman's boss. ",
        "'On Mr. Woods's own portrayal of events, he imposed an NDA on her as a condition to keep her job when she began having a sexual relationship with him. A boss imposing different work conditions on his employee because of their sexual relationship is sexual harassment.' Hodas' document added: 'Tiger Woods, the internationally renowned athlete and one of the most powerful figures in global sports, decided to pursue a sexual relationship with his employee, then -- according to him -- forced her to sign an NDA about it or else be fired from her job. 'And, when he became disgruntled with their sexual relationship, he tricked her into leaving her home, locked her out, took her cash, pets, and personal possessions, and tried to strong-arm her into signing a different NDA.'",
        "Woods has previously attempted to steer the dispute into private arbitration proceedings in accordance with the NDA his attorney say they signed in 2017. However, Herman wants the court to determine that the NDA is invalid or unforeseeable for reasons including that she claims she was subject to sexual abuse by him. In the case, filed in March, to void the NDA, Herman made the startling allegation that the 82-time winner on the PGA Tour had sexually abused her but went into no detail as to what the alleged abuse entailed.However, in a filing from Woods in a separate dispute over her claimed tenancy agreement, Woods's attorneys noted that Herman has not asserted any claims for sexual assault or sexual harassment in that particular landlord-tenant action.Herman, who worked at The Woods Jupiter, his restaurant, also filed a lawsuit in October against the Jupiter Island Irrevocable Homestead Trust, which is the legal owner of his mansion in Hobe Sound where the two lived together. Herman also is suing the trust that she claims Woods controls, for $30million alleging that he tricked her into leaving the Florida mansion where they had lived together for six years following their breakup in October. ",
        "She claimed that she had an oral agreement with Woods's trust – the Jupiter Island Irrevocable Homestead Trust – which is the legal owner of his mansion in Hobe Sound where the two lived together, that allowed her to live at the property for 11 years. ",
        "The latest filing in her suit personally against Woods details more of Herman's version of events leading up to the break up. 'The landlord made the availability of her housing conditional on her having sexual relationship with a co-tenant,' the document read.'That conduct amounts to sexual harassment under federal and Florida fair housing laws.'The short summary of events here and the Defendant's own linking of the purported agreement to his sexual motivations in both her employment and housing are sufficient to bring this case within the ambit of the Ending Forced Arbitration Act.'In March, Woods filed a motion in the lawsuit over the tenancy dispute in the 19th Judicial Circuit Court in Martin County, Florida for an order to compel arbitration over the matter in the case against the trust. In Herman's filing on Friday, her attorney notes that Woods did not try to take their breakup dispute to arbitration when he kicked her out of the house in October.'Instead, he called a California attorney — who promotes himself as 'Ray Donovan with a pen' — to unceremoniously eject Ms. Herman from the house through trickery and break up with her for him,' said the document. ",
        "'The scheme involved convincing Ms. Herman to pack for a weekend excursion to the Bahamas. She and Mr. Woods often traveled on short notice for quick getaways, and she was told this would be another such trip. So, she took a minimum of items, expecting to return home in a few days.'",
        "Ray Donovan is a television character, who is a professional 'fixer' for the rich and famous. The filing then claims that Woods then drove her to the airport but rather than board the plane with her, he told her to speak to his lawyer. 'Then, Mr. Woods's California lawyer, out of the blue, told her that she was not going anywhere, would never see Mr. Woods again, had been locked out of the house, and could not return,' her filing stated. 'She would not even be able to see the children or her pets again. While still in the hangar, 'Ray Donovan with a pen' proceeded to insult Ms. Herman, (advised) her she had no legal rights, and (tried) to force her to agree to a (different) non-disclosure and arbitration agreement.' Her filing stated she refused to sign despite these 'brutish and high-pressure tactics.''Importantly, neither Mr. Woods, nor his lawyer, nor any of his other agents invoked some pre-existing arbitration agreement that day as they ejected Ms. Herman from the house and took away her personal property and pets,' the filing states.Woods has two children, daughter Sam, 15, and son Charlie, 14, with his ex-wife Elin Nordegren. ",
        "Woods and Herman were together for six years after being first spotted at the Presidents Cup in New Jersey in October 2017. ",
        "Once they started dating the two became inseparable, with Herman regularly supporting him at golf tournaments.Rumors first began swirling about them after Erica was seen wearing a 'player spouse' badge, usually given to wives and girlfriends.The following month, they went public about their relationship.Woods's lawyers state that he broke things off on October 13, 2022."
    ]
}