{
    "articleURL": "/wires/reuters/article-12048015/Lamar-Jackson--I-want-Raven.html",
    "content": [
        "Lamar Jackson officially signed his new five-year contract extension with the Baltimore Ravens on Thursday, saying that was his intention all along -- \"I wanted to be here.\"",
        "Jackson, flanked by head coach John Harbaugh and general manager Eric DeCosta, met with the media one week after agreeing to a contract that made him the highest-paid player in NFL history.\"I really didn't care for other teams really, I just really wanted to get something done here,\" the quarterback said. \"Other teams, cool, but I want to be a Raven. ... I really wanted to get this done before anything, before my time up and branch off somewhere else. I really want to finish my career here, win a Super Bowl here.\"Jackson, 26, and the Ravens last week agreed on a deal worth $260 million, five million more in total value than the deal involving Philadelphia Eagles quarterback Jalen Hurts on April 17. Jackson reportedly received $185 million in guaranteed money, falling way short of the $230 million guaranteed that Deshaun Watson got from the Cleveland Browns last year.\"Obviously, the Watson deal was really something that the media focused on quite a bit and was fascinated by on the impact that would have on the negotiation with Lamar,\" DeCosta told PFT in a story published Wednesday night. \"The Hurts deal hit before the Lamar deal got done. I would say that the contract that we did with Lamar is not that dissimilar from the contract that we offered Lamar in September, and I think that contract actually had the biggest impact of the whole thing because we felt at the time that was a strong contract offer.\"",
        "The agreement ends a lengthy saga that heated up this spring when the 2019 NFL MVP revealed he'd requested a trade on March 2.The Ravens placed the $32.41 million non-exclusive franchise tag on Jackson at the deadline in early March. Under the terms of the tag, Jackson was free to talk to other teams who could have made an offer sheet; if the Ravens then chose not to match the offer sheet, they would command two first-round picks in exchange for Jackson.\"I thought we would get the process done. I didn't have a doubt in my mind. They say they love me and I love being here. I love my teammates and I love the fan base,\" Jackson said.\"I didn't have a doubt really.\"--Field Level Media"
    ]
}