{
    "articleURL": "/health/article-12060005/Experts-reveal-reasons-youre-NOT-losing-weight-theyre-going-surprise-you.html",
    "content": [
        "Despite best efforts to shift the scales, many struggle to see the weight fall offA plateau, a lack of sleep and not enough water are factors that could be at playA diet shake-up, hitting the gym and upping the step count.",
        "These are the common first steps among those trying to shift the scales.But despite best efforts, many struggle to see the weight fall off.Hitting a plateau, a lack of sleep and not drinking enough water are just three things that can hamper progress, research shows.Experts have now explained how these, and other factors, could be at play.",
        "Not getting enough sleepToo little shut eye is already linked to diabetes, heart disease and depression.But it could also be hampering your weight loss progress.Studies show that those who don't get enough sleep are more likely to eat sugary foods, which can lead to weight gain over time.Experts believe this is down to changes in levels of the hormones leptin and ghrelin — which dictate how hungry we feel.One 2010 paper, by researchers in the US, found that among those on a two-week calorie-restricted diet, those who slept for 8.5 hours lost more weight than those who only were in bed for 5.5 hours.Writing in a 2020 article, Dr Ian Walshe, assistant professor in sport, exercise and rehabilitation at Northumbria University, said: 'It's clear that sleep is important for losing weight.''Sleep should therefore be considered as an essential alongside diet and physical activity as part of a healthy lifestyle,' he added.",
        "Losing fat but gaining muscleMost would expect to see their weight drop after a couple of weeks of healthy eating and hitting the gym.But those who don't see the scales shift shouldn't be disappointed.",
        "Adults are encouraged to do some type of physical activity every day. Exercise just once or twice a week can reduce the risk of heart disease or stroke.Over-18s should aim to:Do strengthening activities that work all the major muscle groups (legs, hips, back, abdomen, chest, shoulders and arms) on at least two days a week. This includes carrying heavy shopping bags, yoga, Pilates and lifting weights.Do at least 150 minutes of moderate intensity activity a week or 75 minutes of vigorous intensity activity a week. Moderate activity includes brisk walking, riding a bike, dancing and doubles tennis. Vigorous activity includes running, swimming and riding a bike fast or on hills.Spread exercise evenly over four to five days a week, or every dayReduce time spent sitting or lying down and break up long periods of not moving with some activityAdults can also achieve weekly activity target with:Several short sessions of very vigorous intensity activity. This includes lifting heavy weights, circuit training and sprinting up hills.A mix of moderate, vigorous and very vigorous intensity activitySource; NHS",
        "For they may have lost fat and put on muscle, which is more dense than fat.This means they could weigh the same but their body composition has changed.  Dr Duane Mellor, a leading dietitian from Aston University, told MailOnline: 'This is why the scales are not always the best way to measure success, especially when it comes to health.'He suggested tracking progress by focusing on other metrics of weight loss, such as clothes fitting better and a previously challenging workout becoming easier.'Focus on the wider health wins rather than the number on your scales,' he added.Not tracking progress accurately enoughKeeping an eye on what you're eating at meal times and snacking on is vital to losing weight, experts say.But those struggling to drop a few pounds may not be doing this as thoroughly as they think.",
        "For research shows that Brits eat the equivalent of three McDonald's cheeseburgers per day without realising it.  That's according to a team at the University of Essex, who quizzed 200 people on how much they thought they were eating per day.They then tracked how much they actually consumed and found that volunteers, who ranged from thin to fat, omitted an average of 900 calories worth of food daily.As well as under-estimating calorie intake, dieters could be over-estimating how much they're burning off.While they may provide a rough guide of calories used during a workout, fitness devices, such as Fitbit and Jawbone, have found to be 40 per cent off in studies. Hit a plateauAfter weeks or months of seeing the scales drop, it may suddenly flatten out.This plateau is normal, even among those who have kept up their diet and exercise routine.Experts say it occurs because the body is resistant to weight loss. It thinks it is being starved, so releases more hunger hormones in the hopes of getting more food.Dr Mellor said: 'Losing weight can be very challenging, as our biology has evolved largely to prevent this happening. ",
        "'So, when you find yourself plateauing, the first thing to do is to try and focus on what you have achieved and especially the improvements you have won in terms of your health. ",
        "'Too often, when people lose weight and the weight loss stops, they can start to think negatively about what they have done.'To overcome a plateau, Dr Mellor suggests reviewing portion sizes in case these have subtly crept up.He also recommends monitoring activity levels during the day, as while a person may be squeezing in more workouts, they may be sitting down more or walking less.Not drinking enough waterDrinking eight glasses a day is key to keeping the body hydrated, health chiefs say.But glugging H2O is also essential for those trying to shift the scales, as has been highlighted by dozens of studies. Research suggests that the more hydrated you are, the better your body is at completing tasks - from thinking to burning fat.Scientists have found that the liquid can suppress appetite, boost metabolism - the rate your body burns calories at - and increase motivation.One 2015 paper found that, among those following a low-calorie diet, those who drank 500ml of water before each meal lost an extra 2kg (4.4lbs) over the course of the three-month study. ",
        "Study author Dr Helen Parretti, a senior lecturer at the University of East Anglia whose research focuses on weight management and obesity, said at the time: 'The beauty of these findings is in the simplicity.",
        "'Just drinking a pint of water three times a day before your main meals may help reduce your weight. It's something that doesn't take much work to integrate into our busy everyday lives.'Juls Abernethy, a wellness business founder, told MailOnline that drinking water is vital for weight loss, as many cannot differentiate between thirst and hunger.'Feeling tired, light headed, sluggish [and] brain fog — probably the start of dehydration, but we learn to eat on these cues,' she said.Ms Abernethy added: 'When only mildly dehydrated you will feel sluggish and lacking in energy. 'When the energy slumps happen you will most likely reach for some fast acting, highly processed, high sugar and high carb snacks or drinks.'A medical conditionDiligently eating well, exercising and getting enough sleep may not be enough for some to lose weight. For an array of medical conditions can make it difficult to lose weight.These include an underactive thyroid.  This is where the thyroid glad does not produce enough hormones that are vital for regulating the body's metabolism - the process that turns food into energy. As a result, those with the condition burn fewer calories. Another is polycystic ovary syndrome, which is when women make slightly more of the male hormone, androgen, than is normal. ",
        "It can cause insulin resistance, meaning the body struggles to convert glucose in the bloodstream to energy, which can make those with the condition gain weight more easily than others. The NHS urges patients to speak to their GP if they think they may have the conditions.",
        "¿ Eat at least 5 portions of a variety of fruit and vegetables every day. All fresh, frozen, dried and canned fruit and vegetables count¿ Base meals on potatoes, bread, rice, pasta or other starchy carbohydrates, ideally wholegrain¿ 30 grams of fibre a day: This is the same as eating all of the following: 5 portions of fruit and vegetables, 2 whole-wheat cereal biscuits, 2 thick slices of wholemeal bread and large baked potato with the skin on¿ Have some dairy or dairy alternatives (such as soya drinks) choosing lower fat and lower sugar options¿ Eat some beans, pulses, fish, eggs, meat and other proteins (including 2 portions of fish every week, one of which should be oily)¿ Choose unsaturated oils and spreads and consuming in small amounts¿ Drink 6-8 cups/glasses of water a day¿ Adults should have less than 6g of salt and 20g of saturated fat for women or 30g for men a daySource: NHS Eatwell Guide  "
    ]
}