{
    "articleURL": "/wires/ap/article-12047973/COVID-dropped-4th-leading-cause-death-US-year.html",
    "content": [
        "NEW YORK (AP) - U.S. deaths fell last year, and COVID-19 dropped to the nation's No. 4 cause, the Centers for Disease Control and Prevention reported Thursday.",
        "COVID-19 deaths trailed those caused by heart disease, cancer and injuries such as drug overdoses, motor vehicle fatalities and shootings. In 2020 and 2021, only heart disease and cancer were ahead of the coronavirus.U.S. deaths usually rise year-to-year, in part because the nation´s population has been growing. The pandemic accelerated that trend, making 2021 the deadliest in U.S. history, with more than 3.4 million deaths. But 2022 saw the first drop in deaths since 2009.The 2022 tally was about 3.3 million - a 5% decline from 2021 but still much higher than in the years before the pandemic. The CDC cautioned that last year's numbers are preliminary and may change a little after further analysis.Coronavirus-associated death rates fell for nearly all Americans. The virus was deemed the underlying cause of about 187,000 U.S. deaths last year, accounting for about 6% of deaths. The highest COVID-19 death rates were in the South and in an adjacent region that stretches west to Texas, Oklahoma and New Mexico, the CDC said.The death rates for heart disease and cancer increased during the pandemic, the CDC said. The cancer death rate had been falling for 20 years before COVID-19 hit.",
        "The CDC report indicated a slight decline in the number of injury deaths last year, falling to about 218,000 from about 219,500 the year before. That would be a surprise, given recent trends in rising drug overdose and gun deaths.",
        "CDC officials noted that number could rise. Death certificate data for injury deaths tends to take longer because many involve police investigations.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}