{
    "articleURL": "/wires/reuters/article-12056965/Chinese-scour-Thailand-homes-looking-offset-risks-pandemic.html",
    "content": [
        "By Angie Teo, Chayut Setboonsarng and Devjyot Ghoshal",
        "BANGKOK, May 8 (Reuters) - Shanghai resident Daniel Bian drank in the sweeping views over the Thai capital as he lay on a deckchair beside a swimming pool on the 19th floor of a luxury condominium.\"I feel alive. I feel free,\" said an excited Bian, dapper in tinted sunglasses, flat-topped navy blue hat and a wraparound tunic cinched at the waist, his hair hanging loosely to his shoulders. \"This is my dream.\"Cooped up in China for three years under some of the world's toughest curbs against COVID-19, Bian is among a flood of mainland Chinese hunting for property buys in the southeast Asian nation since Beijing opened its borders this year.Many Chinese are eager to invest in a residence overseas, keen for a safety net in case of a similar disease outbreak, and also to hedge against economic risks at home.Thailand was the most popular outbound destination for Chinese travelers during the May labour day holiday, data from website Trip.com showed, followed by Japan and South Korea.And the Southeast Asian nation's good international schools and quality medical facilities are drawing increasing numbers keen to acquire a second home.Thailand expects at least 5 million Chinese visitors this year, some set to buy property, although the figure is still a far cry from the era before COVID, when they made up nearly a third of the 40 million arrivals.",
        "\"There is definitely demand from China for properties in Thailand,\" said Mesak Chunharakchot, the president of the Thai Real Estate Association.Topping buyers' lists are locations in major cities such as the capital, Bangkok, along with Chiang Mai in the mountainous north, the east coast beach resort of Pattaya and the northeastern region of Isan, he added.\"Chinese are buying houses, sending their children to international schools and having their parents come stay in Thailand to take care of the grandkids.\"Nearly 270,000 Chinese tourists visited Thailand in March, government data shows, a three-year high, though well below the figure of 985,227 in March 2019, before the pandemic took hold.The share of Chinese students at Singapore International School Bangkok rose to 12% to 13% early this year, or 400 from a student body of 3,100 on four campuses, outstripping the figure of 6% during pre-pandemic 2019.\"In China, when things are closed - it's overnight, nobody can go out,\" the school's chief executive, Kelvin Koh, told Reuters. \"This affected the behaviour of Chinese families.\"Despite Thai rules that limit foreign ownership to just 49% of the units in any condominium development, prospective buyers are pouring in, bringing business to real estate agents who target Chinese buyers.One such agent is Owen Zhu, who escorted Bian, 50, and his 70-year-old mother, fashionable in close-fitting white dress topped off with matching hat and veil, through viewings of three high-end apartments in Bangkok during a day-long property tour.",
        "\"It has changed a lot after the pandemic. Most of the Chinese choose to buy luxury apartments to live in,\" said Zhu.Many clients who earlier bought for investment purposes have now zeroed in on property typically costing more than 2 million yuan ($290,000), he added.\"The budget can only buy a simple home in China's first-tier cities, and its location might not be good,\" Zhu said.\"But with that money they can buy a luxury apartment in the heart of Bangkok. Therefore some would sell one of the houses in China and buy a property here for retirement.\"Bian, who organises cultural exchanges between China and other countries, also sees fewer constraints in Thailand.\"The freedom to enter or leave the country, to travel back and forth. As well as the freedom of society, and life. Freedom is very important,\" Bian said. ($1=6.9110 Chinese yuan renminbi) (Additional reporting by Juarawee Kittisilpa and Chayut Setboonsarng in Bangkok and Chen Lin in Singapore; Writing by Anne Marie Rantree, Editing by Clarence Fernandez)"
    ]
}