{
    "articleURL": "/wires/reuters/article-12053217/Chris-Sale-fans-10-streaking-Red-Sox-Phillies.html",
    "content": [
        "Chris Sale struck out 10 in six innings as the Boston Red Sox earned their seventh win in a row, a 5-3 decision against the host Philadelphia Phillies on Friday night.",
        "Sale (3-2) allowed three runs on seven hits and one walk. Richard Bleier, Chris Martin and Kenley Jansen each followed with a scoreless inning, and Jansen posted his seventh save.Zack Wheeler (3-2) had his worst home start of the season for the Phillies, giving up five runs (four earned) in 5 1/3 innings. He allowed seven hits and no walks while striking out five.Enrique Hernandez went 2-for-4 with a run and an RBI for Boston. Enmanuel Valdez finished 2-for-3 with an RBI, and Justin Turner, Rafael Devers and Triston Casas each drove in a run.Nick Castellanos led the way for Philadelphia at the plate, going 2-for-4 with an RBI double. J.T. Realmuto and Alec Bohm each tallied an RBI for the Phillies, who did all of their scoring in the fourth inning but wound up with their fifth consecutive loss.The Red Sox broke a 3-3 tie in the sixth inning, when Jarren Duran opened the frame with a double. Hernandez moved him over to third with a single. Casas brought Duran home with a sacrifice fly, ending Wheeler's night. Valdez greeted reliever Connor Brogdon with an RBI single to right, giving the Red Sox a 5-3 lead.Boston jumped out to a 1-0 edge in the top of the first inning. Raimel Tapia led off the game by getting to second on an error by left fielder Kyle Schwarber, and Devers drove him in with a two-out single to right.",
        "The Red Sox tacked on in the third, extending their lead to 3-0. Tapia led off with a bunt single before Masataka Yoshida extended his hitting streak to 15 games with a single to right. Turner drove in Tapia with a soft groundout, and three batters later, Hernandez knocked in Yoshida with a single.The Phillies tied the game at 3-3 with a big fourth inning. Bryce Harper beat out an infield single and Castellanos immediately drove him in with a double. Realmuto tripled to the right field corner to bring home Castellanos, and Bohm followed with an RBI single.--Field Level Media"
    ]
}