{
    "articleURL": "/tvshowbiz/article-12042321/Yellowstone-star-Luke-Grimes-assures-fans-marriage-thriving-Costner-announces-divorce.html",
    "content": [
        "Luke Grimes put the spotlight on his enduring romance on Tuesday.",
        "The 39-year-old star was seen kissing his wife, Brazilian model Bianca Rodrigues Grimes, while backstage at Stage Coach as he held his guitar in an image shared to his Instagram page.'To the only one that really matters,' wrote the No Horse To Ride crooner, making it clear his marriage is in great shape.The timing is interesting. The post comes hours after news that his Yellowstone co-star Kevin Costner will be divorcing his wife Christine Baumgartner. She filed for divorce from the movie and TV star after 18 years of marriage and three children together.Watch the epic final instalment of Yellowstone returns this November, only on Stan.",
        "The split is said to be due to 'irreconcilable differences,' with Baumgartner asking for joint custody of their kids - Cayden, 15, Hayes, 14, and Grace, 12.Costner filed his response to the divorce on Tuesday, and he is also seeking joint custody of their children.The 68-year-old actor and 49-year-old Baumgartner, a model and fashion designer, started dating in 2000 and tied the knot at Costner's Aspen, Colorado ranch in 2004.'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' a statement from Costner's rep read.",
        "Costner is worth a reported $250M. On Yellowstone, Grimes plays Costner's son Kaycee, a former soldier.It is not known when the fifth season will finish up as there is reportedly issues with Costner's schedule which his lawyer has denied. Meanwhile, Luke is working on his singing career.   'Dark cloud hangin’ over me…' wrote the actor in his caption as rain clouds could be seen behind him in the photo in January.This comes after the Ohio native thanked his show's producers for using his song No Horse To Ride during the mid-season finale of his hit Paramount Network series. ",
        "On January 2 Luke thanked his show.'Thanks for watching, and thanks @yellowstone for having my song in last night’s show. Means the world,' he wrote in his caption as he could be seen in character on a horse.The tune was one of several songs played on the Yellowstone soundtrack on New Year’s Day — Yellowstone, Season 5, Episode 8, A Knife And No Coin.",
        "The song was played as the herd of cows was place into trucks for the move to Texas for a year.Grimes’ song No Horse To Ride was released in December, 2022 via UMG Recordings.It is his first official single as he tries to enter the music world after years of acting in movies like American Sniper and Fifty Shades Of Grey.",
        "There are plenty of other singers that act on the show including Ryan Bingham (he has a large role as Walker), Lainey Wilson, Faith Hill and Tim McGraw (the 1883 stars appear in flashbacks on Yellowstone), Brian Tyler and Cody Johnson.",
        "Grimes revealed on the Today show in early January that he and his wife Rodrigues, moved to Montana almost three years ago.They fell in love with Montana when he was working on Yellowstone. 'She came up with me for work one year and just sort of fell in love with it, and we kind of got into the rhythm up there,' Grimes said on the morning show.'Going back to Texas didn’t sound like much fun so we stayed, we built a house.'He also shared he doesn't watch his own hit show.'I don’t … not because I don’t want to or I’m too cool to watch the show or something,' he said. 'It’s because I think it would affect my work, since we’re still doing it. So I think one day, when it’s all said and done, I’ll sit down and watch the whole (thing).'"
    ]
}