{
    "articleURL": "/wires/ap/article-12055897/Canelo-beats-Ryder-unanimous-decision-return-Mexico.html",
    "content": [
        "GUADALAJARA, Mexico (AP) - Canelo Alvarez returned home and remained the undisputed super middleweight champion Saturday night, beating John Ryder by unanimous decision before more than 50,000 fans in his first fight in Mexico since 2011.",
        "Alvarez bloodied the British challenger's nose and knocked him down, cruising to the victory by scores of 120-107 on one card and 118-109 on the other two to improve to 59-2-2.\"I hit him too much in the head and he did not go down,\" Canelo said at ring side after the fight. \"I've always said it, when they fight me, they give their 100%, it gets complicated because they usually give me the fight of their lives\".Ryder said that he suffered what is probably a broken nose in the second round and that played a major role in having his four-bout winning streak stopped and is 32-6.\"He´s probably past his best, he could not get me out there, he wanted to stop me and could not do it,\" Ryder said at a press conference. \"It could have been a little different without the problem to my nose, it took me a few rounds to get adjusted.\"It was Canelo´s first fight since he had surgery on his left wrist last March. Before the fight, he said the injury slowed him down in his previous four fights, including his loss to Russian light heavyweight champion Dmitry Bivol a year ago.",
        "\"In the first rounds I was not confident, but then I started punching strong with it, and that gives me motivation going forward,\" added the Mexican.",
        "After getting a hard-fought victory over Ryder, Canelo has his eyes set on a rematch against Bivol in September and plans to fight him at 175 pounds.\"I don't want to make any excuses from what happened the last time, it's pointless, but this time my preparation will be different because now (that he's injury free) I can do a different preparation to do all of the things that needs to be done.\"In a fight that was touted as the \"King is Coming Home\", the sold-out crowd at Akron stadium in Guadalajara, just 25 miles away from Juanacatlan, the small town where Canelo grew up, screamed deliriously during the whole fight.\"It was different, I´ve fought in stadiums before, but tonight was very different, the vibe of the crowd was awesome, I'm very thankful,\" added Alvarez.Amongst his family and friends, Canelo had his 94-year-old grandmother, Enedina, who watched him fight for the first time in his career.\"She gets really nervous, she does not even watch my fights on TV, it was hard convincing her to come, but she said that she wanted to do it for me, and it was very special,\" added Canelo.Alvarez and Ryder started a slow-paced fight in the first two rounds, but Canelo connected with a straight right and Ryder started bleeding from the nose after the third round.",
        "The Mexican kept pressing the action in the fourth round, landing body shots, and then sent Ryder to the mat with a right hook to the chin.Ryder made Canelo uncomfortable in the fifth and landed a few shots on the face of the Mexican, but Alvarez landed another right in the ninth. Ryder stumbled, but rallied and answered with a shot that shook the Mexican.Ryder, with a bloodied face, closed the fight well in the last two rounds, but was not enough to get the upset.In the undercard, Julio Cesar \"Rey\" Martinez (19-2) knocked out Ronal Batista (15-2) to retain the WBC flyweight title.___More AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}