{
    "articleURL": "/wires/ap/article-12039025/Revlon-emerges-bankruptcy-new-board-new-owners.html",
    "content": [
        "NEW YORK (AP) - Less than a year after filing for chapter 11, Revlon emerged from bankruptcy protection Tuesday as a privately held company with new owners, reduced debt and a new board.",
        "\"Today marks an important moment in Revlon's history and evolution,\" said Debra Perelman, president and CEO of Revlon, in a statement. \"We look forward to unlocking the full potential of our globally recognized brands and continuing to offer our customers the iconic products they have loved for decades.\"Revlon said it emerged from bankruptcy reorganization with $1.5 billion in debt after eliminating more than $2.7 billion in debt from its balance sheet. It also has $236 million in available liquidity. It also changed its corporate name to Revlon Group Holdings.The majority of the company´s reorganized equity is now owned by its former lenders, including affiliates of Glendon Capital Management, King Street Capital Management, Angelo, Gordon &amp; Co., Oak Hill Advisors and Cyrus Capital Partners LP, among others.Revlon's largest shareholder had been MacAndrews &amp; Forbes, owned by Perelman´s father Ron Perelman. MacAndrew &amp; Forbes held 85% of the company´s stock at the time of its bankruptcy filing in June 2022. He had acquired the company through a hostile takeover in 1985.The new board consists of Executive Chair Elizabeth A. Smith, former executive chairman and CEO of Bloom' Brands, and former chair of the Federal Reserve of Atlanta; Martin Brok, former global president and CEO of Sephora; Timothy McLevish, former chief financial officer at Walgreens Boots Alliance; Hans Melotte, former president of Starbucks' global channel development; and Paul Pressler, chairman of eBay.",
        "Revlon, a cosmetics maker that broke racial barriers and dictated beauty trends for much of the last century, has been a mainstay on store shelves since its founding 91 years ago in New York City. It oversees a stable of household names from Almay to Elizabeth Arden.But Revlon failed to keep pace with changing tastes, slow to follow women as they traded flashy red lipstick for more muted tones in the 1990s.In addition to losing market share to big rivals like Procter &amp; Gamble, newcomer cosmetic lines from Kylie Jenner and other celebrities successfully capitalized on the massive social media following of the famous faces that fronted the products.Already weighed down by rising debt, Revlon´s problems only intensified with the pandemic as lipstick gave way to a new era in fashion, this one featuring medical-grade masks. Sales rebounded but still lagged from pre-pandemic days. The global supply chain disruptions that hobbled hundreds of international companies were also too much for Revlon, which barely escaped bankruptcy in late 2020.But the company's latest results look promising. Net sales for the first quarter were $490 million, surpassing the $483 million forecasted in the company´s business plan set forth in December. Operating income was $51 million, more than double the $19 million projected in the business plan.",
        "___________Follow Anne D´Innocenzio: http://twitter.com/ADInnocenzio"
    ]
}