{
    "articleURL": "/tvshowbiz/article-12046865/Stars-humble-cars-millionaires-billionaires-stars-opt-reasonably-price-motors.html",
    "content": [
        "Celebrities are often seen speeding around in flashy cars, including Ferraris. ",
        "But they haven't always opted to drive expensive vehicles, with stars such as Simon Cowell and Claudia Schiffer selecting much more modest options.The television personalities and actors plumped for the less showy cars in the early 2000s in a bid to be more environmentally-friendly.They retailed from £15,000 to £34,000 at the time they were bought, a far cry from the £241,000 Ferraris on the market in 2023.Here, MailOnline takes a closer look at the reasonably-priced past cars of a selection of stars.  ",
        "SIMON COWELL (2011)Car: Smart Car Price: £15,000In 2011, Simon was spotted leaving the X Factor USA studios in a modest Smart Car, a stark difference from the $1m Bugatti Veyron he also owned back then.He smiled and made a peace sign as he left the studios in his new wheels, enjoying the smaller vehicle. The X Factor supremo took to Twitter to defend his choice at the time, writing: 'Everyone is laughing at my new car. But I love it and it glows in the dark!'The fuel-efficient motor retailed from about £9,200 - £15,000 at the time and was just one of the many cars in Simon's huge collection.He splashed out on the Bugatti Veyron in 2008 and snapped up a £300,000 Rolls Royce and also owned a 2011 Bentley.",
        "Mark Zuckerberg (2012)Car: Honda FitPrice: £12,000Despite being worth an reported £68 billion, Facebook founder Mark has been spotted in a very modestly priced motor.In 2012 he was snapped running errands in the humble silver four-door vehicle.According to Cartoq he opted for the Honda due to it being 'safe, comfortable and not ostentatious'.However for swanky occasions he has also been spotted in a Pagani Huayra Italian supercar, which reportledy cost the CEO cost £1M when he bought it in 2019.CAMERON DIAZ (2007)",
        "Car: Toyota Prius T-Spirit Price: £20,000 Superstar Cameron stepped out in Beverly Hills in 2007 with a Toyota Prius T-Spirit which retailed for £20,000.As she headed for a trip to the beauty salon, she stood by the hybrid, clad in a long grey top and strappy sandals.She was not the only star to opt for a T-Spirit in the early 2000s, with actor Leonardo Di Caprio buying one as well as politician Gordon Brown.The actress was one of the very first people to get a Toyota Prius when it launched in America and lives a sustainable lifestyle. It was reported by People in 2022 that Cameron has been pushing her pal Drew Barrymore to be more eco-conscious.  Drew said: 'I made a promise to my best friend, Cameron Diaz, that I would become someone who she had been pushing me to be my whole life, which was environmentally aware, conscientious and living a certain lifestyle that was sustainable.'",
        "CLAUDIA SCHIFFER (2008)Car: Toyota Prius Hybrid Price: £25,000 Using the street as her own personal catwalk, model Claudia Schiffer got into a Toyota Prius Hybrid in 2008.The beauty, who is a mother-of-three, had the motor to take her children to and from school in London. Claudia is mother to Caspar, Clementine and Cosima with film director husband Matthew Vaughn.  She was photographed picking them up twice in one week in the practical car, which retailed at £25,000 at the time. Claudia was one of many celebrities opting to buy into green motoring as the craze grew for more environmentally-friendly cars. ",
        "TOM HANKS (2010)Car: Hybrid Scion XB Price: £34,000 Tom and his wife Rita Wilson pulled up to film producer Joel Silver's memorial day party in a hybrid Scion XB in 2010.The film star has long been an advocate for electric cars and forked out £34,000 for the green energy-efficient ride at the time.Its top speed was 95 mph, and charging the 355 volt pack took between 2 and 5 hours at the time. He was one of the first celebrities to sing the praises of electric cars and has owned them since 2006.  The screen legend said in 2010: 'There are three electric cars sitting on the moon, and now another one in my garage.",
        "'The eBox makes even more sense in Los Angeles. I can drive all weekend, hauling dogs and helping my friends move, and the only reason I'll need to stop at a gas station is for beef jerky and lottery tickets.'"
    ]
}