{
    "articleURL": "/tvshowbiz/article-12060771/Emmerdale-viewers-rejoice-Paddy-Mandy-share-passionate-kiss.html",
    "content": [
        "Emmerdale fans were delighted as they watched Paddy Kirk and Mandy Dingle share a passionate kiss during Monday's episode.",
        "The pair have had an on-off relationship since 1999, with the pair marrying the same year before getting divorced in 2001.Vet Paddy (Dominic Brunt) has been struggling with his mental health in recent weeks following his split from cheating wife Chas Dingle (Lucy Pargeter), with the pair sharing a kiss last month.However, Paddy has once again attempted to move on from Chas and in the first episode of this week he was seen locking lips with former flame Mandy (Lisa Riley) after she invited him over to her house for dinner.Amid his battle with depression, Paddy took himself off to spend some quiet time along last week, leaving his fellow village residents concerned.",
        "He soon returned home but when Mandy saw him looking down during Monday's instalment, she invited him over for a bite to eat in a bid to cheer him up.As Paddy spoke fondly about their past after their meal, Mandy seemed uneasy, telling him she had to go to work and had chores to do around her home in an effort to usher him out.But Paddy did not want to leave, insisting he sit on the sofa and watch television so he did not have to go home and be alone.When Mandy joined him on the sofa, the chat turned to their past romance once again, and they were soon seen sharing a kiss in the heat of the moment.",
        "The scenes delighted viewers, with many taking to Twitter to express how pleased they were, while others questioned whether it was a good idea for the pair to reunite romantically. One person wrote: 'Mandy paddy belong together,' while another viewer shared: 'They definitely should put Paddy and Mandy back together.''Get Paddy and Mandy back together now,' remarked another viewer, while someone else shared: 'Love Paddy and Mandy, when are they getting together.''Please keep Mandy and Paddy together this time,' posted someone else.",
        "Another viewer tweeted: 'Mandy and Paddy kissing, oh my God. #Emmerdale.'And someone else shared: 'Some things should just be left in the past, Paddy and Mandy are definitely one of them #emmerdale.'For months Mandy's been struggling over her renewed love for her ex-husband, though she's continued to support him through his mental health battle.The pair drunkenly slept together earlier this year giving Mandy hope, but she was left heartbroken earlier this month after learning Paddy shared a kiss with his ex Chas Dingle.In upcoming scenes, Paddy will be seen apologising to Mandy over their kiss while she blinks away her tears, determined to do the right thing despite her feelings for him.",
        "As he leaves, it's a bittersweet moment for Mandy as she puts on a brave face amid her love woes.",
        "Determined to move on, Mandy informs son Vinny (Bradley Johnson) that she's planning on joining a dating app, despite pining for Paddy deep down.When Mandy later gets a match, she can't help think of Paddy, while Vinny tries to convince her to look towards the future.Emmerdale airs weekdays at 7:30pm on ITV1 and ITVX. "
    ]
}