{
    "articleURL": "/wires/pa/article-12057025/Music-fans-head-Windsor-Castle-Coronation-Concert.html",
    "content": [
        "Thousands of concertgoers have made their way down the Long Walk to Windsor Castle for the Coronation Concert.",
        "Royal fans wearing a huge range of Union flag clothing – including dresses, hats, glasses and suits – gathered for the show to celebrate the King.Sarah Edwards travelled more than two hours from Ipswich to the concert with her daughter Charlotte.",
        "The mother told the PA news agency: “We watched all the coronation on TV yesterday.“It made us really excited to be here today. I think it’s a big part of history for my daughter to be a part of.“I’m really excited to be part of such a big day.”Well-wishers had earlier gathered on the Long Walk to watch local groups perform a range of songs.A Windsor rock choir performed along with a local theatre group who sang tracks from the musical Matilda.The Prince and Princess of Wales made a surprise visit to the Long Walk and spent half an hour speaking with a range of performers and visitors.",
        "Faatimah and Hafsah Malik took the short journey from Slough to the concert.The pair were excited to watch Katy Perry and to try and catch a glimpse of the King.Hafsah Malik said: “I would like to meet them. This is a once-in-a-lifetime opportunity. It was really shocking to win the tickets.“I love Kate. She has a really beautiful style. It’s very simple but elegant.”",
        "Faatimah Malik met Charles when he was still a prince on a visit in Birmingham, and she has come to Windsor to try and see him again.Meanwhile, Take That superfans Dawn Fenwick and Sian Gould are excited to see the group perform at Windsor Castle.Ms Fenwick has been taking her daughter Ms Gould to Take That concerts since she was a child.The pair travelled from High Wycombe to see one of their favourite groups and to try and see the royal family dancing along.Ms Fenwick said: “I’m looking forward to seeing Charles having a bop.“Being a part of it is why we are here. It’s a shame it’s not the full five (members of Take That).”"
    ]
}