{
    "articleURL": "/wires/reuters/article-12061201/Its-series-Devils-hope-follow-familiar-script-vs-Canes.html",
    "content": [
        "Through three games in the Eastern Conference semifinals, the script looks awfully familiar to the New Jersey Devils.",
        "The Carolina Hurricanes have seen this before, too.Someone's narrative will change Tuesday night, when the Devils are slated to host the Hurricanes in Game 4 of the best-of-seven series in Newark, N.J.The Hurricanes lead the series 2-1 after the Devils took what amounted to a must-win game in Sunday's Game 3, when New Jersey rode a goalie change and a historic offensive outburst to an 8-4 victory.\"It's a series now,\" said center Nico Hischier, who was one of seven Devils to score a goal Sunday. \"That's what we wanted to do, have a bounce-back game, and scoring eight goals is a statement.\"The eight goals were the most for the Devils in a playoff game since April 22, 1988, when New Jersey beat the Washington Capitals 10-4 in Game 3 of the Patrick Division Finals.\"Well, we were no good,\" Hurricanes coach Rod Brind'Amour said. \"I don't know what else to say. I have never seen us play like that. I give credit to the other team. They were on it. They were dialed in.\"For the Devils, the most familiar element Sunday was responding to a 2-0 series hole by winning Game 3 with a new goalie.Vitek Vanecek -- who was benched after New Jersey was outscored 10-2 in dropping the first two games of the conference quarterfinals against the New York Rangers -- replaced Akira Schmid in net and recorded 26 saves.",
        "Schmid sparked the Devils' comeback against the Rangers by authoring shutouts in Games 5 and 7. But Schmid was pulled in each of the first two games against the Hurricanes, who victimized him for seven goals on just 36 shots in a little more than 60 minutes of game action.\"Akira took care of the first round,\" Vanecek told reporters following practice Monday. \"I always will be with him -- if I'm not playing or if I'm playing -- trying to give him confidence. That's what we have to do, us goalies. He had two tough games but the Carolina (team) is (a) very good team and then (the coaches) give me an opportunity.\"The Hurricanes are accustomed to watching a desperate opponent get back into a series with a resounding Game 3 win. Carolina raced out to a 2-0 series lead in the first round against the New York Islanders, who then scored four goals in a span of 2:18 -- the fastest four-goal flurry in playoff history -- late in the third period to earn a 5-1 win on April 21.But the Hurricanes responded to that loss by never trailing two days later, when they beat the Islanders 5-2. Carolina closed out the series with a 2-1 overtime win in Game 6, when Frederik Andersen replaced Antti Raanta in net and made 33 saves.",
        "In hopes of repeating history, the Hurricanes might take a page from the Devils' book by making another goalie change. On Sunday, Brind'Amour pulled Andersen in favor of Pyotr Kochetkov after Hischier's goal 53 seconds into the middle period gave the Devils a 4-0 lead.Raanta has been scratched the last two games due to an illness, but he manned a net by himself Monday afternoon, which is typically a gesture bestowed upon the goalie who will start the next game.Brind'Amour said he hadn't made a decision yet but said he was comfortable with any one of the three goalies, all of whom started at least 23 regular-season games for the Hurricanes.\"You'd like to ride a guy, but depending on how you use them during the year, depending on health issues, everybody is a little different,\" Brind'Amour said Monday. \"We've got two guys we used -- really three throughout the year -- and we had good success with them.\"--Field Level Media"
    ]
}