{
    "articleURL": "/wires/ap/article-12047483/NASCAR-75-Fan-growth-new-stars-looming-challenges.html",
    "content": [
        "NASCAR is crumbling. That is the image being presented to the casual fan early in this injury-plagued start to NASCAR's 75th anniversary season.",
        "Through the first 11 races this season, NASCAR has handed down massive penalties, some of which have been overturned by appeal panels.Team owners are in a stalemate with NASCAR leadership over a new revenue model and drivers have been unhappy with the second-year Next Gen car's performance at certain tracks.Most alarming, as NASCAR is in the thick of negotiating a new television contract, was the dramatic drop in TV ratings when Chase Elliott was sidelined earlier this season. Elliott has been voted NASCAR's most popular driver by the fans the last five years; when he spent six races recovering from a broken leg suffered in a snowboarding accident, ratings dropped by roughly 500,000 viewers.And when he returned? NASCAR saw back-to-back ratings increases.As part of the celebration of NASCAR´s 75th season, The Associated Press interviewed 12 veteran contributors to the industry on topics ranging from the greatest drivers to key challenges ahead. NASCAR Hall of Famer Richard Petty was succinct in his answer on the challenges ahead: \"How to attract new and younger fans.\"Of the 12 participants, only seven-time champion Jimmie Johnson made no mention of the fans when asked about NASCAR's biggest challenge ahead. While the 11 others included attracting a new audience, remaining relevant and rebuilding the fan base in their answers, Johnson said he believed the biggest challenge ahead is \"relative to alternative fuels, whatever that transition step is. In the next 10 to 15 years, what kind of fuel source we use.\"",
        "Denny Hamlin, one of NASCAR's current veterans and also the co-owner alongside Michael Jordan of 23XI Racing, has long noticed the waning mainstream popularity of the Cup Series stars since the retirements of Jeff Gordon, Tony Stewart, Carl Edwards, Danica Patrick, Matt Kenseth, Dale Earnhardt Jr. and Johnson.\"Lack of stars,\" he replied to the AP survey. \"No one even knows who the stars of our sport are now. They only know the old names. This comes from a list of issues but until we actually have `superstars,´ our sport will always be niche.\"Hamlin expanded on that answer after NASCAR saw a ratings bump when Elliott made his return to racing last month. He defended the massive marketing by NASCAR of Elliott's return to competition, but noted that superstars are developed on the track through dominant winning seasons.The parity created by the new Next Gen car - NASCAR saw 19 different winners last season in the Cup Series - has throttled the ability to develop superstars. The different winners came one season after Kyle Larson won 10 races and his first Cup title.\"To create superstars, you have to be able to look on TV and see that one driver is better than the other,\" Hamlin said. \"That's what we haven't seen. It's about track position. Who has the best car? The driver used to really make a huge difference in the finishing positions. Now that has changed because of data sharing... so everyone has gotten closer. Should races be won on pit road or not? I don't think so. I think we (drivers) should be winning races, not pit crews and track position.\"",
        "Gordon believes it is imperative for NASCAR and its participants to continue to grow fan engagement into the future because there are \"so many different forms of entertainment today, as well as a shorter attention span for viewing content.\"Our sport will continue to have challenges staying on top of what is relevant and keeps people tuned in,\" Gordon added.But there are solutions, per Elliott and team owner Rick Hendrick, who cited continuing innovation as the way to boost fan interest.\"Engaging fans with content and technology, nonstop investment in the fan experience at the racetrack,\" Hendrick offered as solutions. \"Creative scheduling and the introduction of different markets/venues. Ensuring our race cars are relevant to manufacturers, driver safety advancements.\"The problem isn't lost on NASCAR. Although chief operating officer Steve O'Donnell emphasized continued innovation as a challenge ahead, he tied the importance of it to fan engagement.\"I'd say our biggest challenge is keeping up with the constant innovation in not only motorsports, but the world,\" O'Donnell said. \"Technology and transportation continues to evolve, and NASCAR must evolve with it to stay relevant with the current and next generation of fans.\"__AP NASCAR at 75 voting panel: Edsel Ford, long-time Ford executive; Tony Gibson, retired NASCAR crew chief; Jeff Gordon, four-time NASCAR champion; Denny Hamlin, three-time Daytona 500 champion; Rick Hendrick, founder of Hendrick Motorsports; Jimmie Johnson, seven-time NASCAR champion; Winston Kelley, executive director of the NASCAR Hall of Fame; Steve O´Donnell, Chief Operating Officer for NASCAR; Richard Petty, NASCAR Hall of Fame driver; Lyn St. James, one of nine women who have qualified for the Indianapolis 500; Deb Williams, award-winning NASCAR journalist; Eddie Wood, co-owner of Wood Brothers Racing.",
        "___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}