{
    "articleURL": "/news/article-12047621/I-two-incapable-drunks-outside-house-Jury-hears-DCI-Banks-star-call-police.html",
    "content": [
        "In recording the actor is heard complaining about drunks in their underwear The star wore a dark suit and red tie as he entered Newcastle Crown Court todayThis is the phone call the star of DCI Banks made to police about 'incapable drunks outside my house' before he allegedly punched one to the floor. ",
        "When police arrived they found actor Stephen Tompkinson in a long silk dressing gown and slippers, while the drunk stranger was just in his underpants and snowman socks.The ITV star, 57, is on trial at Newcastle Crown Court accused of inflicting grievous bodily harm on Karl Poole at around 5.30am on May 30, 2021, and causing him traumatic brain injuries. He denies the charge and is set to argue self-defence.In a recording of the call the actor is heard saying: 'I have got incapable drunks outside my house.'One of them is just in his underwear.",
        "'They cannot stand.'They had a bottle of Jägermeister between them I have just taken off them.'I have asked them to move. They can't move.'In the recording - which was played to the jury earlier this week - the call handler tells Tompkinson he will get someone to come along as soon as he can.Stephen Tompkinson told police he had 'never thrown a punch in his life' when he was questioned for allegedly hitting a drunk stranger outside his home during a row about noise, a court has heard. The jury today heard from the first police officers to arrive at the scene, who said Tompkinson was wearing a long silk dressing gown and slippers, while Mr Poole was in just boxer shorts and snowman socks. ",
        "They also heard from a neighbour who claimed she saw Tompkinson strike a man in the street, as well as Mr Poole's friend who was with him at the time of the incident, who claimed he heard the 'hitting of flesh' followed by a 'cracking' sound when his pal hit the ground. Tompkinson was not arrested until later that same morning before being interviewed at just after 9pm at Middle Engine Lane in Wallsend, North Tyneside, the court was told. ",
        "One of the interviewing officers, DC Mark Thompson, outlined to the court the explanation given by Tompkinson when he was first questioned.Tompkinson said he was awake early that morning when he saw two men outside his home and initially thought they were 'placid and harmless' when spoken to but there then appeared to be a 'big switch' in the atmosphere, the court was told. The actor said the men ended up 'coming towards me aggressively' at a time when the front door to his home was open and he wanted to get them away, the court heard.Tompkinson denied punching Mr Poole and told police: 'I've never thrown a punch in my life. I've made a career out of being taught how not to hit people rather than hit them.'",
        "Tompkinson said he was 'a bit shaken' after the confrontation and did not want to hurt anyone.' It came after a neighbour of Tompkinson earlier told the court she saw the actor slap and punch a drunk man in the head after asking him to move away from his home in the early hours of the morning.Jurors have heard Mr Poole and his friend Andrew Hall had been drinking since around midnight and had gone to the beach to watch the sunrise before walking back past Tompkinson's home in Whitley Bay, North Tyneside.Tompkinson went outside to confront the two men for making noise outside his home and called the police at around 5.30am asking for them to be moved on, the court has heard.",
        "On Thursday, Tompkinson's neighbour Caroline Davidson said she was woken by 'hysterical laughter' and looked out of her bedroom window to see two men lying on the floor.She told the court the men appeared 'very drunk,' were 'wobbling' from side-to-side while one of them - Mr Poole - was just wearing boxer shorts.Mrs Davidson said she went back to bed but got up again when she heard a voice with a 'different tone'.The court heard she knew Tompkinson as the resident of the house across the road but had not spoken to him since he moved in two or three years previously.",
        "Mrs Davidson said Tompkinson 'was using hand movements to ask them to move away' and at one point 'pulled his fist back' but put it down 'more or less straight away' before walking back towards his house while apparently making a phone call.She told the court the two men then got up with some difficulty, put their arms around each other and 'started to try and walk off' when her neighbour came out again.She said: 'The two males started to turn. You could see maybe something was being said.'The next thing I knew the neighbour had stepped forward and he had slapped one of the gentlemen, the one without the top on, with his right hand and then punched him on the head with his left hand.'",
        "Asked by prosecutor Michael Bunch if there was anything that 'precipitated that action', Mrs Davidson said: 'No.'She said she was '100% sure' that the neighbour had moved towards the two men.Mrs Davidson told the court Mr Poole 'stumbled backwards and fell'.'He just went straight back and his head hit the ground. He just, he didn't move.'He didn't even put his hands out to stop himself, he just hit the ground.'Mrs Davidson said Tompkinson came out of his house when the police arrived and spoke to two officers.",
        "She said he then placed a bottle of Jagermeister at the feet of the man lying on the floor.Jurors have previously heard Tompkinson told police he had taken a bottle from the two men.",
        "Asked if the two men made any aggressive actions towards her neighbour at any point, Mrs Davidson said: 'No.'Earlier on Thursday, social worker Mr Hall told Newcastle Crown Court that he heard the 'hitting of flesh' followed by a 'cracking' sound as his friend Mr Poole fell to the ground in the alleged assault by Tompkinson.Mr Hall claimed that in the aftermath, Tompkinson showed 'a bit of humanity and remorse' and was seen 'on his haunches with his hands on his head.' Recalling the timeline of the incident, Mr Hall said he first heard 'shouting and a commotion' before spotting his drunken friend Mr Poole talking loudly with Tompkinson on the driveway of the TV star's home. Mr Hall said he then managed to calm the situation down and the two men walked away from Tompkinson, who was in his pyjamas and dressing gown.But moments later there was an incident that left Mr Poole lying unconscious on the ground with 'traumatic head injuries', the court heard. Mr Hall told Newcastle Crown Court: 'Someone came walking over and I heard the hit of flesh and Karl rapidly hit the floor.'",
        "He added: 'It was very quick, I heard the hitting of flesh. The speed and velocity and the sound when he hit the ground, it was obvious what had happened.'  ",
        "But in cross-examination by Nicholas Lumey KC, Mr Hall said he only heard Mr Poole's head hit the floor and did not hear the sound of the impact that caused him to fall.Asked what Tompkinson did after Mr Poole was on the ground, Mr Hall said: 'I think he had his phone out but it was clear he wasn't ringing for help.'Later on, I don't know the timescale, he showed a bit of humanity and a bit of remorse in my view, it must have sunk in what happened, but it didn't initially.'I believe he was on his haunches with his hands on his head.'Jurors have heard Tompkinson told police he pushed Mr Poole away in self-defence after the two had come towards him.The two men had been drinking for at least five hours before they walked down to the seafront where they paddled in the water and then began walking back to Mr Hall's house, also in Whitley Bay.Both were drunk and the men were making a noise when Tompkinson came outside to remonstrate with them, the court heard.After the alleged assault, which the prosecution claim was caused by a punch, Mr Hall said his friend remained unconscious on the ground and was 'snoring.'He rang the emergency services at 5.57am and told the ambulance operator Mr Poole had been 'knocked out by someone.'The operator asked him: 'He has been assaulted is that right?'Mr Hall replied: 'That's right yeah.'He added: 'I think he has been hit on the head, I can't get him to respond.'Under cross-examination from Nicholas Lumley, KC, Mr Hall admitted he didn't see Tompkinson strike his friend.'I never saw how he ended up on the floor,' he said.Mr Lumley said: 'You didn't hear the sound of the impact that caused him to fall?'Mr Hall said: 'No, not 100 per cent no.'Tompkinson, 57, who has starred in TV hits DCI Banks and Ballykissangel, has denied causing grievous bodily harm.The trial continues."
    ]
}