{
    "articleURL": "/wires/ap/article-12055325/Leafs-Devils-face-0-2-holes-heading-critical-Game-3s.html",
    "content": [
        "All the joy and elation fans of the Toronto Maple Leafs and New Jersey Devils felt after their teams advanced out of the first round of the NHL playoffs has been replaced by a bit of panic.",
        "The Maple Leafs and Devils both face 0-2 deficits heading into key Game 3 matchups in their respective Eastern Conference semifinal series Sunday.Toronto was stunned in dropping both Games 1 and 2 at home against Florida and now must find a way to solve the Panthers on their home ice in South Florida and avoid falling into what would seem to be an insurmountable hole.New Jersey will return home to host Carolina in Game 3, hoping the friendly confines of \"The Rock\" will help the Devils from being overwhelmed after they were outscored 11-2 over the first two games in Carolina.Meanwhile, the one series even at 1 takes place in the Pacific Northwest, where Seattle will host Dallas in Game 3. The Kraken took Game 1 in overtime before the Stars rebounded with an impressive 4-2 victory in Game 2.MAPLE LEAFS at PANTHERS, Florida leads 2-0. (6:30 p.m., TBS)",
        "Back in 1996, in their first-ever playoff round, the Florida Panthers took a 3-0 series lead on the Boston Bruins.The Panthers haven´t had a 3-0 playoff series lead since.They can change that Sunday.Coming off their stunning win over Boston, the Panthers are halfway to another stunner.\"At no point in our last nine games have we felt that we´ve dominated the game, where if we just play our game we should win,\" Panthers coach Paul Maurice said. \"The teams that we´re playing are way too powerful. So even with the win, we don´t walk away from the rink (Thursday) night and say, `Man, we really handed it to those guys.´\"",
        "The Panthers have already set a franchise record by winning five consecutive playoff games, all coming in a nine-day span, four of them in a pair of hockey´s toughest road environments - Boston and Toronto - and three while facing elimination.Put simply, they needed two days off to recharge. They were exhausted.\"These two days are huge for us to get some rest back into our team,\" Maurice said.At the breakfast table before leaving Toronto on Friday morning, Maurice talked with Panthers staffers - some of whom have been part of Stanley Cup wins - asking if they could remember any five-game stretch that was more daunting.They couldn´t.\"This five-game stretch is as intense - and in part because the physicality of that Boston series - a block of hockey I´ve ever seen,\" Maurice said.HURRICANES at DEVILS, Carolina leads 2-0 (3:30 p.m. ET, TBS)The Hurricanes have spent two games dominating 5-on-5 play. The Devils know things must change.Carolina won the first two games on home ice by a combined score of 11-2, with nine players scoring at least once and nine of those goals coming at even strength. The Hurricanes allowed just one shot in a suffocating opening period of Game 1, then erupted for four second-period goals in Game 2.",
        "\"At the end of the day, (playing on the road) doesn´t really change our mindset or our preparation,\" star forward Sebastian Aho said Saturday. \"We just want to do our thing and obviously just keep our foot on the gas.\"For the Devils, the frustration was apparent Friday night with captain Nico Hischier saying he was bothered by being \"outbattled again.\" Meanwhile coach Lindy Ruff said: \"Right now, 5 on 5, they´re the better team.\"The good news is New Jersey rallied from an 0-2 deficit in the first-round series against the New York Rangers, with both losses coming by a 5-1 score.\"We haven´t played our best,\" Devils star Jack Hughes said. \"We did it again. We dug ourselves a hole and it´s time to work ourselves out of it.\"Carolina has gone with Frederik Andersen in net for three straight games, including the Game 6 clincher in the first round against the New York Islanders. He has allowed one goal in each start after missing last year´s playoffs due to injury.Coach Rod Brind´Amour said rotation partner Antti Raanta feels \"not great\" due to an ailment that left Pyotr Kochetkov as the No. 2 goalie in Game 2. Raanta will travel north even as Andersen appears positioned for another start.",
        "The Hurricanes have chased Akira Schmid in each game so far, and Ruff said there is a probability Vitek Vanecek starts Game 3. New Jersey will also be without defenseman Ryan Graves with an upper-body injury. Luke Hughes will replace him after signing following the end of his college career at Michigan in the Frozen Four, adding a puck mover to the lineup.STARS AT KRAKEN, Series tied 1-1 (9:30 p.m. ET, TBS)Since the start of their first postseason run, the Kraken have been in a constant rhythm.Day off, game. Day off, game. Day off, game. Even after defeating Colorado in seven games, Seattle had just one day to get to Dallas before the start of this series.So it wasn´t surprising to see some exhaustion show up for the Kraken in their 4-2 loss to the Stars in Game 2 that evened the series.\"We saw a little bit of fatigue mentally and physically in our game,\" Seattle coach Dave Hakstol said.Under normal circumstances, the Kraken and Stars would have likely restarted their series Saturday night. But a concert at Climate Pledge Arena bumped Game 3 to Sunday and gave both teams the opportunity to enjoy an extra day off.\"Just gives the guys a little bit of time to re-energize and reboot,\" Seattle forward Jordan Eberle said.",
        "Dallas benefited from the tired Kraken in Game 2, dominating in shots and faceoff wins, and held a significant advantage in scoring chances around the net. Only a strong effort from Seattle goalie Philipp Grubauer kept Game 2 from being even more one-sided.The Stars outshot Seattle 30-14 over the first two periods and 37-27 for the game, and won 69% of the faceoffs.Dallas is trying to avoid a repeat of its opening round series against Minnesota where it won Game 2 impressively before going on the road and losing to the Wild in Game 3.\"We would have liked to not chase a series of losing Game 1 again. We´d like to get home ice and go steal one in their rink,\" Stars forward Tyler Seguin said. \"So like I said, there´s pressure and there´s opportunity, and right now we´re playing with the opportunity, and we´re excited.\"___AP Sports Writers Tim Reynolds, Aaron Beard, Tom Canavan and Stephen Hawkins contributed to this report.___AP NHL: https://apnews.com/hub/nhl and https://twitter.com/AP_Sports"
    ]
}