{
    "articleURL": "/femail/article-12057807/King-Charles-liked-Hugh-Bonnevilles-joke-introducing-artist-known-Prince.html",
    "content": [
        "King chuckled at several of the actor's jokes during tonight's Windsor concert Follow all the latest royal news and updates on Coronation events hereThe King was seen laughing as Hugh Bonneville weaved a few royal jokes into his presenting gig during the Coronation Concert tonight. ",
        "The Downton Abbey actor had the perilous task of hosting's the star-studded concert at Windsor Castle, which saw Take That, Katy Perry and Lionel Richie take to the stage. On top of skits with the Muppets, Bonneville couldn't resist adding a few quips about the newly crowned King. Lip reader Jacqui Press told Femail that the actor made the King chuckle when he referred to him as 'The man formerly known as Prince.'But while the King enjoyed Bonneville's jokes, many people at home found the actor's presenting skills wanting, with some saying they flicked the channel.  ",
        "Jacqui revealed that the Sovereign muttered to himself at Bonneville was 'very amusing,' after the actor made the joke in reference to the late singer Prince, who decided to go by 'The Artist Formerly Known as Prince' in the 1990s. The quip also referred the King's former title as the Prince of Wales, which he held from 1969 to the death of his late mother Queen Elizabeth II last September.  The King was then seen smiling and waving at the crowd following the joke, proving it had landed well. But while the royal enjoyed Bonneville's humour, some people online could have done with the actor's skits. 'As much as I love Hugh Bonneville I got bored with it and flicked over,' one said. ",
        "'Now picturing Hugh Bonneville as a wedding DJ,' another said. The King and Queen took centre stage for the Coronation Concert this evening - and got carried away with their family waving the Union Flag as well as dancing, singing and clapping to Lionel Richie, Katy Perry and a spectacular Take That finale.Charles III and his wife Camilla also laughed uproariously at Miss Piggy and Kermit the Frog, who even appeared in the royal box with them before the stage and Windsor Castle were turned a patriotic red, white and blue.The couple were roared throughout by the 20,000-strong crowd, who did three cheers for the King and Queen when they arrived as the sun set for the show beamed into homes in 100 countries around the world.And as night fell, the royals donned their glowstick wristbands, got to their feet and started dancing to Lionel, as he sang All Night Long. Katy Perry belted out hits including Roar before Take That closed the spectacular show that included Shakespeare, ballet and a drone show reflecting the monarch's love of the environment, culminating in a blue whale soaring over the castle.At the finale, choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's song Never Forget, which gave the show an uplifting finale.",
        "Prince George and Princess Charlotte clapped along with the song before the King also joined in - and there was a dancing Queen, as Camilla moved to the music.The royal couple then held up their Union flags as the concert came to a close, with William tickling George's nose with his.The King and Queen danced along to Take That's performance of Shine as Princess George and his sister Princess Charlotte enthusiastically waved their Union flags.In the final performance of the Windsor Coronation Concert, the band, who have not performed together for four years, ended with Never Forget - as Kermit the Frog danced along.Charles and Camilla laughed and chatted as they bopped along throughout, with Kate, Charlotte and George also getting into the groove - as did the Duke and Duchess of Edinburgh.",
        "William had slipped away so he could go on stage to give a moving tribute to his father, telling him: 'Pa, we are all so proud of you.' He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven on his Coronation weekend.Princess Charlotte attempted to get Prince George's attention and pointed at her father the Prince of Wales as he made his way onto the stage to deliver a speech during the Coronation Concert.",
        "As William concluded his speech, he said: 'God Save the King,' which was repeated loudly by the thousands in attendance. The speech was followed by the national anthem, which was sung by all present, including Prince George. The King smiled and waved to the crowd at the end of the national anthem.",
        "Just before Hugh introduced the final act, Take That, the BBC cut to the royal box, where Kermit the Frog waved a Union flag in front of a grinning Duke of Edinburgh.The King looked to his left as he clapped before Bonneville signed off: 'And, of course, thank you your majesties, for allowing us to perform for you here. We sincerely hope you and the frog have enjoyed yourselves.'The camera then showed a wide view of the royal box, with Charles and Camilla smiling while Kermit nodded. There was no sign of Miss Piggy."
    ]
}