{
    "articleURL": "/money/pensions/article-12051237/Does-housing-benefit-pension-credit-cover-rent.html",
    "content": [
        "Has your pension question been answered? Read Steve Webb's repliesI'm a single pensioner receiving the Guarantee Credit element of Pension Credit. ",
        "But my housing benefit only covers £85 per week out of my weekly rent which is £129 per week. Why is this?",
        "SCROLL DOWN TO FIND OUT HOW TO ASK STEVE YOUR PENSION QUESTIONSteve Webb replies: Although being on pension credit can often be a 'passport' to a range of other benefits such as help with rent, council tax and fuel bills, there are several reasons why your housing benefit may still be short of your full rent.Whether you rent from a social landlord (such as a council or housing association) or a private landlord, one reason for a shortfall could be if there are 'non-dependant' adults living with you. This could be, for example, a grown up son or daughter.In this case, the Government makes a deduction from your housing benefit on the assumption that this other person can be expected to make a contribution to the rent. The amount of the deduction depends on the circumstances of the non-dependant and is made whether or not they are actually making a rental contribution.The amount deducted can be very substantial. Even if the non-dependant is a young person on benefit, the deduction in 2023/24 is £18.10 per week. At the other end of the scale, if the non-dependant has gross income over £511 per week, they will be deemed to be contributing £116.75 per week to your rent, which is knocked off your housing benefit.",
        "For those who rent from a private landlord (as you have told me is true for you), there are further reasons why housing benefit may not cover your full rent.The first is that the 'local housing allowance' (LHA) scheme (which is the name given to housing benefit for private tenants) is based not on the actual rent you pay but on the sort of property you are deemed to need. There are two elements to this.First of all, rates of local housing allowance are set according to your bedroom 'need'. For example, a married couple would be allowed a bedroom, and teenage children of opposite sex would be allowed a bedroom each, but younger children might be expected to share a bedroom. The level of your housing benefit depends therefore on your family size and composition, regardless of the actual rent you pay. If your rent reflected a 'spare' bedroom, this could result in a gap between the standard benefit rate and your actual rent.But you have told me that you live in a one-bedroom property and therefore do not have any spare bedroom, and you also have no-one living with you so there is no deduction for a 'non-dependant'.The other main reason why people may be short is that the benefit system is explicitly designed only to cover rents towards the bottom end of the rental market. ",
        "The Government takes the view that those who are on benefit should not be able to live in the 'best parts of town', paid for by the taxpayer, when those in low paid work (for example) might not be able to afford to do so.The exact rate payable has varied over time, but roughly speaking the idea is that across the area where you live and the surrounding areas, the LHA limit would only cover in full the rent on around 1 in 3 properties (or fewer).An important point is that when they look at local rental levels they do not necessarily just look at the town in which you live but over a wider area known in the jargon as a 'broad rental market area'. This means that there may be few, if any, available properties near where you live where the standard benefit rate would cover the rent in full, but there should, in principle, be some such properties in a much wider area.You have told me where you live and I have confirmed that across your broad rental market area the standard rate for a one bedroom property is indeed £85 per week, and that is what you are getting, even though this is well short of your actual rent.",
        "If you are struggling to make ends meet because of the shortfall between your benefit and your actual rent, I'm afraid that your options are limited.You can apply to the council for a 'discretionary' housing payment to top up your benefit, but these are generally only granted in exceptional circumstances (eg if you have a particular short-term need or hardship) and are unlikely to permanently cover the shortfall.The other option would be to see if you can find a property in the wider area with a lower rent. If you could find a one-bed property at a rental of (say) £120 per week or £110 per week, you should still qualify for £85 per week in benefit, so this would reduce the shortfall that you have to make up out of your pension credit.",
        "Former Pensions Minister Steve Webb is This Is Money's Agony Uncle.He is ready to answer your questions, whether you are still saving, in the process of stopping work, or juggling your finances in retirement.Steve left the Department of Work and Pensions after the May 2015 election. He is now a partner at actuary and consulting firm Lane Clark &amp; Peacock.If you would like to ask Steve a question about pensions, please email him at pensionquestions@thisismoney.co.uk.Steve will do his best to reply to your message in a forthcoming column, but he won't be able to answer everyone or correspond privately with readers. Nothing in his replies constitutes regulated financial advice. Published questions are sometimes edited for brevity or other reasons.Please include a daytime contact number with your message - this will be kept confidential and not used for marketing purposes.If Steve is unable to answer your question, you can also contact MoneyHelper, a Government-backed organisation which gives free assistance on pensions to the public. It can be found here and its number is 0800 011 3797.Steve receives many questions about state pension forecasts and COPE – the Contracted Out Pension Equivalent. If you are writing to Steve on this topic, he responds to a typical reader question about COPE and the state pension here.  ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}