{
    "articleURL": "/wires/pa/article-12056889/Adrian-Meronk-finishes-strongly-win-Rome-boost-Ryder-Cup-hopes.html",
    "content": [
        "Poland’s Adrian Meronk breathed a sigh of relief after winning the DS Automobiles Open to boost his chances of securing a Ryder Cup debut.",
        "Meronk held his nerve on the closing stretch to withstand the challenge of French pair Romain Langasque and Julien Guerrier at Marco Simone Golf and Country Club, which will host the Ryder Cup later this year.Two birdies in the last three holes gave Meronk a final round of 69 and winning total of 13 under par, with Langasque a shot behind and 54-hole leader Guerrier another two strokes back.“It’s such a relief to be honest,” Meronk told Sky Sports after claiming his third DP World Tour title.“It was a tough day today. I didn’t play as good as previous days off the tee and tee to green so had to scramble a little bit, but super happy to come out on top and very proud of myself.”Meronk’s victory lifted him to fifth in the European Points List and within 100 points of an automatic qualifying place for Luke Donald’s team as he bids to become the first Polish player to feature in the Ryder Cup.",
        "“I think it’s a solid statement, a solid brick into the wall but it’s not over yet, I know that,” Meronk said.“It’s still a lot of time but I’m super excited. It’s one of my big goals this year and it would mean a lot to me. I will keep pushing, keep doing what I can to get on that team but I think (today) should help a little bit.”",
        "Guerrier took a one-shot lead into the final round but bogeyed the first two holes as Meronk and Langasque emerged as the most likely winners on a testing day.Meronk gained a crucial advantage with his fifth birdie of the day on the short 16th before holing from 15 feet for par on the next as Langasque fell two behind with a bogey on 16.Langasque bounced back superbly by chipping in for birdie on the 17th but, in the group ahead, Meronk two-putted from 75 feet for a closing birdie to effectively seal the win."
    ]
}