{
    "articleURL": "/femail/article-12060837/Woman-lives-van-reveals-like-date-road.html",
    "content": [
        "Lidia Rico, 32, travels the U.S. in her Ford E350 6.0 Power Stroke Diesel 4X4The YouTuber opened up about dating after her divorce in her latest video Lidia shared that 'everybody has sex in their van because it's convenient' A woman who lives in a van has lifted the lid on what it's like to date on the road after splitting from her husband, including where she gets intimate. ",
        "YouTuber Lidia Rico, 32, from Spain, was working as an au pair in the U.S. when she met her American ex-husband, Philip Miller, 36, in December 2014. They wed a year later and hit the road in their 2006 Ford E350 6.0 Power Stroke Diesel 4X4. After announcing her divorce last summer, she is traveling solo for the first time in nearly a decade. In her latest video, she opened up about the difficulties of dating when your home is on wheels. 'I recently got an account on Hinge, and it's because my friends made me do it,' she said, admitting that being on a dating app is 'pretty new' to her after being in a relationship for so long. ",
        "Lidia marked the start of the next chapter of her life by getting two divorce tattoos, which she proudly showed off. 'It's a snake that stabs my heart. That's how I felt betrayed when my ex left me,' she said of the first design. 'I got this tattoo so I never forget.'The second is a bald eagle with her date of birth that is meant to symbolize freedom, not forgetting about herself anymore, and being brave. Lidia insisted that her Hinge dates were 'not promising' so far, saying a lot of the guys were 'liars' who 'don't want anything serious.' ",
        "'I change my location when I'm traveling because sometimes I go to different towns,' she said of using the app. 'So if I'm sticking around some area, I'm gonna change my Hinge to see if there are any cute guys around. But normally I don't really connect with too many people.'Since she has only recently started dating again, she visited her friend Logan, who lives in his 1991 GMC Rally Wagon, and had him answer some of her fans' questions. ",
        "One person wanted to know if they get nervous when they have to tell their dates that they live in a van.'I embrace that s**t. It's half and half. They're either about it or they're [not],' Logan said of the responses he gets. 'Honestly, if they're living in an apartment, I'm probably gonna ask if I can use their shower,' he added. 'Other than that, I'm cruising in a van.'Lidia agreed that she embraces the lifestyle and feels confident when she tells people where she lives.  'Guys, they get pretty excited about it,' she explained. 'They really want to ride in my van. A lot of guys ask more questions about my van than about me sometimes.'She noted when she is staying in the same area and going to the same places, most people don't put it together until she tells them.  ",
        "'They don't think that you live in a van,' she said. 'They just think that you have an apartment down the street, but we live on the street in a van.'",
        "Another follower wanted to know if they have sex in their vans, which they have both done before.'Everybody has sex in their van, you know, because it's so convenient,' she said. 'It's a vibe,' Logan added, joking, 'If the van's a-rockin', don't come a-knockin'.'After returning to her own van, she crawled into bed to watch a movie while addressing what it's like to date an influencer with tens of thousands of followers. 'I don't know if I'm a well-known YouTuber, but it's awkward sometimes because I met with a couple dudes [who] really knew who I was, but they were lying. So they were pretending like they don't know who I am,' she said. 'There are other people that they just tell me right away, so I'd rather that you tell me that you know me than you lie.'Lidia concluded her video by sharing that definitely wants to be a mother one day, but she's not having kids now because she is single.  'If you know somebody that is handsome, emotionally available, with stability, and that doesn't scream, just send him my way,' she told her nearly 75,000 subscribers. "
    ]
}