{
    "articleURL": "/wires/aap/article-12044841/Cartwright-coaches-Broncos-flu-strikes-Walters.html",
    "content": [
        "John Cartwright has stepped in to coach Brisbane with Kevin Walters struck down by the flu.",
        "The Broncos assistant coach took charge of the side's captain's run on Thursday ahead of Friday night's Magic Round clash with Manly at Suncorp Stadium.Walters is no certainty to be at the game, but if Cartwright takes control in the coach's box it will not be unfamiliar territory for the 57-year-old who was mentor of the Gold Coast for eight seasons.\"(Walters) is just really cautious with flu season and how it can affect the playing group if it goes around, so it is more of a precaution than anything,\" Cartwright said.Cartwright said Walters would still have input during the game if he has to stay at home.\"We will no doubt have him on the phone I would say,\" Cartwright grinned.\"Technology these days is pretty good so we might get a screen up of him and he can Zoom in.\"Once the players get to game day, if it's not second nature for them now we haven't done our job in the off-season.\"We have a good mix of youth and experience and we don't change a hell of a lot from how we play week-to-week, just little subtle differences.\"Hopefully we go out there and I just have to sit back and smoke a cigar.\"Cartwright said he had no imminent plan to get back into head coaching and he was enjoying being a valuable right-hand man for Walters.",
        "\"I just love what I am doing,\" Cartwright said.\"As long as we keep winning here and the Broncs are happy with what I am doing I am more than happy here.\"Cartwright said the competition-leading Broncos learned lessons about the need to be defensively more secure after a 32-6 loss to South Sydney last week.The return of star prop Payne Haas from suspension will boost Brisbane's clout.\"Sometimes when you win games it just covers a few cracks that are there and a good side like Souths exposed them,\" Cartwright said.\"We have gone back to basics to make sure we are doing the little things in defence that we were doing earlier in the year and hopefully that fixes it.\"He will help any side, Payne. He is in rare form at the moment ... but you've only got to look at Manly's game a few weeks ago against the Storm (in an 18-8 win) where they made it very tough physically on the Storm.\"If they can do it to them they can do it to anyone so it is a challenge for our boys right across the park.\""
    ]
}