{
    "articleURL": "/wires/reuters/article-12046563/Royal-Caribbean-raises-profit-forecast-demand-rebounds.html",
    "content": [
        "Co expects Q2 adj. EPS of $1.50 to $1.60, vs estimates of 94 cents",
        "Bookings outpaced 2019 levels by a wide margin in Q1 and into April - CEOShares up nearly 8%(Adds comments from earnings call in paragraph 5, 6, analyst comment in paragraph 8)By Deborah Mary SophiaMay 4 (Reuters) - Royal Caribbean Group raised its annual profit forecast after upbeat quarterly results on Thursday, cruising on the back of higher ticket prices and pent-up leisure travel demand, sending shares up nearly 8%.The Miami, Florida-based company also projected current-quarter earnings well above Wall Street estimates and said bookings outpaced 2019 levels by \"a very wide margin\" throughout the first quarter and into April.Higher ticket prices from cruise liners aimed at offseting the impact of rising fuel costs have not deterred well-to-do Americans from splurging on cruise vacations including on-board amenities such as spas and gaming after the easing of pandemic restrictions.That has driven a sharp rebound in occupancy rates and booking volumes, propelling Royal Caribbean to a record \"wave season\", a crucial period between January and March when cruise operators offer special deals and discounts for the year.\"We knew that demand for our business was strong ... (but) what transpired over the past four months was much better than we had anticipated,\" Royal Caribbean CEO Jason Liberty said.",
        "\"The fact that demand for the coming 9 months is so much stronger ... says a lot about the strength of the consumer,\" Liberty added.Royal Caribbean, which owns Celebrity Cruises and Silversea Cruises, said on-board and other revenue more than doubled to $988.6 million in the quarter.\"This was the best quarterly cruise result vs. expectations we have seen in many years,\" Truist Securities analyst Patrick Scholes said.The company reported a per-share loss of 23 cents, excluding items, for the quarter ended March 31, much smaller than estimates of 70 cents. Revenue of $2.89 billion topped expectations of $2.82 billion.Royal Caribbean now expects annual adjusted profit of $4.40 to $4.80 per share, a \"big uptick\" from its earlier forecast of $3.00 to $3.60 per share.Earlier this week, rival Norwegian Cruise Line Holdings Ltd also raised its annual profit forecast.(Reporting by Anne Florentyna Gnanaraja Sekar and Deborah Sophia in Bengaluru; Editing by Vinay Dwivedi)"
    ]
}