{
    "articleURL": "/femail/article-12039071/Crime-reporter-reveals-shouldnt-car-fender-bender.html",
    "content": [
        "Lori Fullbright, 57, has covered crime for News On 6 in Oklahoma for 31 yearsThe anchor uses her knowledge to share potentially life-saving tips on TikTok She went viral after detailing what you should do when another driver hits youA crime reporter has revealed why you shouldn't immediately get out of your car after a fender bender, saying the driver who hit you may have a nefarious ulterior motive.",
        "Lori Fullbright, 57, has covered crime for News On 6 in Tulsa, Oklahoma, for the past 31 years, interviewing countless victims and perpetrators over the course of her career. The evening news anchor has more than 118,000 followers on TikTok, where she uses her knowledge of criminals and their behavior to share potentially life-saving tips. Fullbright went viral this week when she detailed what you should do when another driver hits you from behind in traffic.'Sometimes it's just a fender bender, but sometimes a person will use that to get you to pull over, so they can do something bad to you,' she explained.",
        "The journalist recalled covering a story about a teenage girl who was brutally murdered after being hit from behind in an unpopulated area. Fullbright shared how the teen had called her family and was warned to stay inside her car, but she insisted she would be fine. 'When police officers do get to the scene, her car is the only one that's there. The door is opened. Her purse is inside, and, of course, her body was found days later in a cemetery,' she said. Fullbright did not name the victim, but viewers believed she was referring to 19-year-old Amanda Morton, who was abducted, raped, and murdered by David Zink in Missouri in 2001. ",
        "'Obviously, if you get bumped from behind, and it's a very well-populated area, lots of people, lots of traffic, and it's broad daylight, then you can feel safer pulling over,' she said. 'You could still call 911 and say, \"I've been hit from behind. I don't feel safe. Could you send an officer?\" And they can do that.'Fullbright advised calling 911 first and then a family member, insisting there is nothing wrong with staying in your car until help arrives.  ",
        "'You can keep those windows up, keep those doors locked, and you could say to the person, \"I've called the cops. I will get out when they get here,\"' she said. 'I think it's perfectly okay to do that because you don't know what someone's motive is, and we have seen these little bumps from behind be used for worse purposes.'She reiterated that it likely would just be a fender bender, but it was a 'good idea' to have a plan in place ahead of time.  'You're perfectly in your rights to pull over, stay in your car with your windows up and doors locked, call 911, call family members, and not get out at that moment and exchange information,' she concluded. Fullbright's eye-opening video has been viewed one million times and has received more than 1,600 comments in just three days. ",
        "'What? New fear unlocked,' one person wrote. 'Thank you for this information,' someone else added. 'The first thing I would do is to get out of the vehicle. Not anymore. Your content is valuable [and] will save lives.''Very true, happened to me... I had a feeling I never had before, \"a doom feeling,\"' someone else recalled. 'Something told me not to get out, I did not, they sped off...'",
        "By Associated Press and DailyMail.com reporterDaniel Zink brutally murdered 19-year-old Amanda Morton in 2001 after hitting her car from behind on Interstate 44, a mile from her home in Strafford, Missouri.",
        "Just months before the slaying, Zink had been released from a Texas prison after serving 20 years on rape, abduction, and escape charges.Fearing that his drunken fender bender with Morton could violate his parole and send him back to prison, he abducted her and took her to a motel, where he raped her. Police found Morton's Chevrolet Cavalier abandoned on the ramp with the keys in the ignition, the engine running, and the headlights and hazard lights on.Her purse, credit card, and medication were found inside the car.When the motel's manager saw a televised news report about Morton's disappearance, he recognized her as the woman who had checked in with Zink. He gave investigators Zink's name and license plate number from motel registration.Zink was arrested at his parents' home and led authorities to Morton's body in Mt. Zion Cemetery. In his videotaped confession, he was matter-of-fact and even laughed as he recounted how he had tied Morton to a tree at the cemetery and told her to look up.  ",
        "Zink said he snapped her neck, choked her with his hands and a rope, and stuffed her mouth with mud and leaves.Worried that Morton might regain consciousness, he admitted that he used a knife to sever her spinal cord at the neck. He covered her body with leaves before retrieving a shovel from his home to bury her. An autopsy showed Morton had eight broken ribs and 50 to 100 blunt-force injuries. She also had been sexually assaulted, with DNA evidence linked to Zink found on her body.Zink was executed by lethal injection for the murder in 2015 aged 55. In a final written statement, Zink offered his 'sincerest apology' to Morton's family and friends for his actions. He also added a message to other inmates on death row.'For those who remain on death row, understand that everyone is going to die. Statistically speaking, we have a much easier death than most. So I encourage you to embrace it and celebrate our true liberation before society figures it out and condemns us to life without parole and we too will die a lingering death,' he said."
    ]
}