{
    "articleURL": "/wires/pa/article-12057275/Musical-extravaganza-marking-King-s-coronation-kicks-off.html",
    "content": [
        "The King and Queen were welcomed with cheers by an audience of thousands as a star-studded night celebrating their coronation began.",
        "Host and Downton Abbey actor Hugh Bonneville kicked off the show from a huge stage in the grounds of Windsor Castle, with 20,000 members of the public invited to the musical extravaganza.Kensington Palace confirmed the Prince of Wales is to take to the stage later and deliver a speech, after behind-the-scenes footage of William rehearsing and walking up to a microphone was shared on social media.",
        "The heir to the throne is likely to speak about his father the King who fulfilled his destiny on Saturday when he was crowned before the eyes of the world during a coronation ceremony at Westminster Abbey.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones are among those appearing via video message.The series of pre-recorded sketches will reveal little-known facts about the monarch and include moments from beloved literary character Winnie the Pooh – seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "Charles and Camilla were seated in the royal box and were joined by the royal family including the Prince and Princess of Wales and their children Prince George, who had played a starring role in the coronation, and Princess Charlotte.A Palace spokesman said the King and Queen were “profoundly grateful” for all those involved in organising the celebrations and ceremony, and the spectators who attended on the day.",
        "“Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion – and to the very many who turned out to show their support in such numbers in London and further afield,” he said.",
        "There will also be performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood – whose grandson Arthur Eliot was one of Camilla’s pages of honour – and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac."
    ]
}