{
    "articleURL": "/wires/reuters/article-12056013/IAEA-warns-dangers-Zaporizhzhia-nuclear-plant-evacuations-way.html",
    "content": [
        "May 6 (Reuters) -",
        "The head of the U.N.'s nuclear power watchdog warned on Saturday that the situation around the Russian-held Zaporizhzhia nuclear station has become \"potentially dangerous\" as Moscow-installed officials began evacuating people from nearby areas.Rafael Grossi, director general of the International Atomic Energy Agency (IAEA), called for measures to ensure the safe operation of Europe's largest nuclear plant as evacuations were under way in the nearby town of Enerhodar.\"The general situation in the area near the Zaporizhzhia nuclear power plant is becoming increasingly unpredictable and potentially dangerous,\" Grossi said on the agency's website.\"I'm extremely concerned about the very real nuclear safety and security risks facing the plant. We must act now to prevent the threat of a severe nuclear accident and its associated consequences for the population and the environment.\"Grossi said that while the operating staff of the plant remain at the site, the conditions for the personnel and their families are \"increasingly tense.\"The Russian-installed governor of the Moscow-controlled part of Ukraine's Zaporizhzhia region said on Friday that he had orderedthe evacuationof villages close to the front line as shelling had intensified in the area in recent days.A widely expected Ukrainian spring counter-offensive against Russian forces is viewed as likely to take in the Zaporizhzhia region, around 80% of which is held by Moscow.",
        "The General Staff of Ukraine's Armed Forces said on Sunday that the residents are being evacuated in the direction of Berdiansk and Prymorsk on the coast of the Sea of Azov.Reuters was not able to independently verify the reports.Russian forces seized the Zaporizhzhia plant days after President Vladimir Putin ordered the invasion of his neighbour in February 2022. Exchanges of fire have frequently occurred near the facility, with each side blaming the other.Grossi last visited the Zaporizhzhia station, Europe's largest nuclear power installation, in March, as part of efforts to speak to both sides to secure an agreement on safeguards to ensure the plant's safe operation.He has repeatedly warned of the dangers of military operations around the plant.The plant is located in the part of that region under Russian control, with many of the staff operating it living in Enerhodar on the south bank of the Dnipro River.(Reporting by Ron Popeski and Lidia Kelly; Editing by Kim Coghill)"
    ]
}