{
    "articleURL": "/money/cars/article-12045773/Petrol-diesel-prices-plummet-17p-litre-year.html",
    "content": [
        "Prices peaked last summer with petrol and diesel hovering at almost £2 a litreSince then, they have fallen back to 145.71p for petrol and 162.71p for diesel  Twelve of the shortest-lived cars: The models that didn't last longPetrol and diesel prices have fallen almost 50p a litre since they peaked last summer, but are still far higher than they were in 2021, new figures have shown.",
        "In its weekly report on road fuel prices, the Department of Energy Security and Net Zero reported that the average price of unleaded at the pump is now 145.71p per litre. Motorists with diesel cars are paying 162.71p.That is well below the peak of 191.55p for petrol and 199.22p for diesel last summer, but is also considerably higher than the 126.53p and 130.43p respective prices in early May 2021.Meanwhile, the RAC has cautioned that fuel prices could rise in the near future, due to an uplift in oil prices.Our interactive chart below reveals how petrol and diesel prices have changed over the past decade - allowing you to see what has happened to your bill.",
        "PGlmcmFtZSBjbGFzcz0iaWZyYW1lLWNyZWF0b3IiIGFsbG93PSJjbGlwYm9hcmQtd3JpdGUiICBuYW1lPSJ4cC1pZnJhbWUtbGlkOWpoeTlxcXV1MWE1anV3IiBzcmM9Imh0dHBzOi8vZGF0YXdyYXBwZXIuZHdjZG4ubmV0L2ZqRG45LzMvIiAgaGVpZ2h0PSI2MDAiIHN0eWxlPSJib3JkZXI6IDA7IHdpZHRoOiAxMDAlOyAgIj48L2lmcmFtZT4=",
        "Fuel prices have been an issue with governments for at least a century.On July 31, 1922, President of the Board of Trade Philip Lloyd-Greame responded to complaints about high prices from MPs with: 'His Majesty's Government are fully alive to the importance of petrol being available at reasonable prices.'Wind the clock forward to the present day and following the Russian invasion of Ukraine, fuel prices shot up, with diesel peaking at an  average of 199.22p per litre and petrol 191.55p per litre in July 2022.At that time, 91.26p of every litre of petrol and 92.79 of every litre of diesel was going directly to the Chancellor of the Exchequer in the form of fuel duty and VAT.",
        "This prompted emergency action to reduce fuel duty on petrol and diesel, as families faced the prospect of paying more than £100 to fill a standard runabout.Now, petrol prices are returning towards the levels last seen in the run-up to Russia's invasion of its neighbour Ukraine.",
        "At present, each litre bought at the local forecourt has fuel duty of 52.95p plus VAT at 20 per cent added to the cost. Over the past 12 months, petrol prices have fallen on average by 10 per cent, while diesel has reduced by six per cent. Though it is feared fuel prices may increase again after a shock decision by OPEC+ to cut production levels by almost 1.2 million barrels of oil per day.This saw oil prices on the international markets increase to £69.77 a barrel, up from £56.50 last month. RAC fuel spokesman Simon Williams said: 'The big question is whether retailers will raise their pump prices, and if so how quickly.'He added that, while the average cost at the pump should not increase immediately following the spike in oil prices, it could creep upwards if they remained elevated 'for several days'.If higher costs do feed through to forecourts, the AA predicted petrol prices could rise by between 3 and 5p per litre, equivalent to adding between £1.65 and £2.75 to the cost of filling a car's typical 55-litre tank.",
        "A recent parliamentary briefing paper laid the blame for the recent fuel crisis on the war in Ukraine, exacerbated by the weak pound.It said: 'The rates of duty on petrol and diesel were cut by five pence per litre on March 23, 2022. This initially led to a fall in the price of both fuels, but by less than five pence per litre. This drop in prices was soon reversed and there were particularly large increases in late May and June.",
        "The UK average price of diesel has slipped below £1.60-a-litre this week for the first time in 13 months. However, the fuel is still 13p-a-litre dearer than petrol, leading experts t claim drivers are being stung.&gt; Read more: Diesel prices dip ",
        "'The high international oil prices are magnified in the UK due to the relative weakness of sterling. Crude oil prices in sterling reached their highest ever levels in 2022. 'On top of this there were record refinery margins in early 2022, initially for diesel and latterly for petrol, due to a fall in refinery output/capacity and the impact of the war in Ukraine. 'This explains the rapid increase in road fuel prices between May and July 2022 at a time when oil prices increased more slowly.'Although prices paid by motorists at the pumps have softened, oil giant Shell today reported it made £1.4 billion more in profit than experts had expected it to make in the first three months of the year.",
        "The business joined its rival BP in reporting expectations-beating results this week.Shell said its adjusted earnings had risen by 5.7 per cent compared with the same quarter a year earlier, reaching £7.6 billion.The business said that, compared with the last three months of 2022, it had faced unfavourable tax movements, and the price it was able to sell oil and gas at dropped.However, Shell said it had managed to offset some of this through cutting operating expenses and a rise in its chemicals and products trading business.Shell said it had decreased production slightly compared with a year ago, to 2.9 million barrels of oil equivalent per day. Revenue rose 3.3 per cent to just under £69 billion.",
        "7 March 2001: 45.82p per litre1 October 2003: 47.10p per litre7 December 2006: 48.35p per litre1 October 2007: 50.35p per litre1 December 2008: 52.35p per litre1 April 2009: 54.19p per litre1 September 2009: 56.19p per litre1 April 2010: 57.19p per litre1 October 2010: 58.19p per litre1 January 2011: 58.95p per litre23 March 2011: 57.95p per litre23 March 2022: 52.95p per litre*Fuel duty cuts in bold",
        "It also announced plans to buy back shares worth £3.2 billion from investors over the next three months to return cash to its owners.",
        "On completion, Shell will have distributed around £9.6 billion to its shareholders in the first six months of 2023.Like its rival BP, Shell’s results immediately sparked calls for the Government to take a tougher stance against the oil majors.Shadow Chancellor Rachel Reeves said: 'Shell reports £7.6 billion profits for its first quarter, yet the Tories refuse to bring in a proper windfall tax on oil and gas giants to freeze council tax this year, as Labour would.'We’ll tackle the cost-of-living crisis, and put working people first.'Liberal Democrat leader Sir Ed Davey called on the Government to close the 'loopholes' in the windfall tax which allow companies to offset their investments in the North Sea against tax.'Shell’s latest profits once again demonstrate the urgent need for a robust windfall tax on big energy companies,' he said.'Rishi Sunak’s refusal to close windfall loopholes for big energy companies shows just how out of touch this Conservative Government is with the struggles that families are facing right now.'&gt; Fuel duty and VAT explained: How tax on petrol and diesel works and adds up  ",
        "Car insurance bills have a habit of creeping up, so comparing prices for the best deal is a wise move. New rules introduced to stop insurers bumping up renewal quotes haven't had the desired effect and it still makes sense to check for better deals on the comparison sites. We suggest:MoneySupermarket*Confused.com*GoCompare*Uswitch*Mail Finance* Also check Direct Line and Aviva, which do not appear on comparison sites.* Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. Car insurance: can you save money? &gt; Tips to cut the cost of car insurance &gt; Beware of these sneaky car cover fees ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}