{
    "articleURL": "/sport/nfl/article-12061493/Damar-Hamlin-says-hell-use-10m-gifts-donated-cardiac-arrest-fund-non-profit.html",
    "content": [
        "Hamlin says the donated funds will be used to bankroll his own foundation The Bills safety has returned to practicing in order to prepare for this season DailyMail.com provides all the latest international sports news Buffalo Bills safety Damar Hamlin will use the $10 million given to online fundraising campaigns by well-wishers after his on-field collapse to fund his own nonprofit, the Chasing M's Foundation.",
        "The decision, first shared with The Associated Press Monday, begins the 25-year-old's plan for the unprecedented outpouring of support that he received after his heart stopped following a tackle during a 'Monday Night Football' game in January.'We have been very deliberate and intentional about taking our time to set my charity up properly,' Hamlin said in a statement. 'I'm excited to begin sharing news about programs we are creating to impact a generation of youth and give back to others.'That people continue to give weekly, if not daily, to the fundraiser is just one measure of the emotional power and connection that Hamlin has with so many. So far, they've given more than $9 million to a GoFundMe campaign and nearly a million to a second online fundraiser set up by The Giving Back Fund, a nonprofit which helps athletes and celebrities manage their charitable giving, according to Kelley Denny, a spokesperson for Hamlin's charity.",
        "Hamlin's marketing representative said in January that his family had arranged for The Giving Back Fund to act as a fiscal sponsor for the funds given to GoFundMe, which allowed Hamlin's team to fundraise as a charitable entity. At the time, Hamlin's team said the millions given to the GoFundMe would eventually be transferred to The Giving Back Fund, but they have not been.",
        "Last week, the news outlet Sportico reported on turmoil within The Giving Back Fund in part sparked by the question of whether gifts to Hamlin's GoFundMe are charitable donations. Marc Pollick, CEO of The Giving Back Fund, disputed the accuracy of Sportico's reporting in a statement and said the organization's leadership 'has always operated ethically, appropriately, and legally.''My charity is not connected to the challenges being faced by the leadership of The Giving Back Fund,' Hamlin said in the statement, adding, 'Donors will have full tax-exempt status.'Hamlin first started Chasing M's Foundation in May 2020 when he was still a student playing with the University of Pittsburgh and applied last month for retroactive tax-exempt status, according to Denny. It was incorporated as a nonprofit in Pennsylvania.Experts say the question of whether the donors can claim a tax deduction for what they gave to the GoFundMe after his injury may depend on decisions by the IRS. Philadelphia attorney Don Kramer, who edits the website Nonprofit Issues, said the IRS has the discretion to retroactively recognize Hamlin's nonprofit as tax exempt. ",
        "That's despite the fact, Kramer said, the cut off for applying for retroactive status is usually 27 months after an organization is founded.Few donors to Hamlin's GoFundMe will likely have a significant interest in claiming a tax deduction for their gift. ",
        "Because of changes in the tax law made in 2017, only those who itemize their taxes, around 11% of filers, may claim deductions for charitable contributions.'I think the public needs to be educated a little bit more on checking whenever they give money and if they really think they´re giving it tax deductible,' said Lisa Delpy Neirotti, director of sport management programs at George Washington University School of Business. She encouraged GoFundMe to distinguish more clearly between fundraisers that are set up by tax exempt organizations and those that are not.GoFundMe confirmed that they continue to hold the funds given to Hamlin´s campaign and said that fundraisers specify when they benefit charitable organizations.Records filed with the Pennsylvania Secretary of State show that Hamlin applied on May 1 to update Chasing M's articles of incorporation, including its mission. Chasing M's Foundation will support 'the aspirations of youth and community members through sports, education' and other activities and 'promote health and safety in sports through CPR &amp; AED training.'",
        "Neirotti usually advises athletes to partner with major organizations that are already working on the causes that they care about, instead of starting their own nonprofit. But she said, the windfall of having millions of dollars all at once is unusual.'With that amount of money, you really could put it into a endowment that will last forever, long beyond his playing days,' she said of Hamlin.",
        "Since being released from the hospital, Hamlin has teamed up with the American Heart Association for a campaign to teach a simple version of CPR. He's also met President Joe Biden at the White House and advocated for access to defibrillators in schools with Congressional leaders. In April, Hamlin announced that he wanted to return to playing and has been cleared to practice with the Bills.Lora Golke, who leads donor engagement at the Arizona Community Foundation, said that many athletes and their families often underestimate the amount of work that it takes to run a nonprofit or foundation and the expertise and knowledge that is required.",
        "'You have to remember, at the same time, he's an athlete and is supposed to be doing his job. His job is not philanthropy,' Golke said. Her organization started a sport and philanthropy center in order to provide advice to former athletes who settle in the state and to its major teams about how they can make a difference in that community.In his first public statements posted in a video to social media on Jan. 28, Hamlin thanked those who had given money to the fundraiser but added that, 'I know that it isn't enough just to be thankful. 'This is just the beginning of the impact that I wanted to have on the world and with God's guidance I will continue to do wonderful and great things.'"
    ]
}