{
    "articleURL": "/wires/ap/article-12047681/Chiefs-sign-tackle-Donovan-Smith-1-year-deal.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The Kansas City Chiefs signed offensive tackle Donovan Smith to a contract for the upcoming season Thursday, adding a veteran to compete for playing time with two open jobs on the offensive line.",
        "The Chiefs were unable to sign franchise left tackle Orlando Brown Jr. to a long-term deal, allowing him to become a free agent, and right tackle Andrew Wylie also signed elsewhere in free agency. The Chiefs countered by signing Jawaan Taylor to handle one of the tackle jobs, but that still left an opening at the other tackle position.Taylor was expected to move from the right side to the left side to protect the blindside of quarterback Patrick Mahomes, and that would have allowed oft-injured Lucas Niang to compete with third-round pick Wanya Morris for the right tackle position.Smith's acquisition could change those plans.The 29-year-old Smith, who was released by the Buccaneers on March 7, started 124 regular-season games from the moment he became a second-round pick in 2015 through last season. But Smith struggled much of last season, partly due to elbow and foot injuries that caused him to miss four games, and that helped Tampa Bay reach the decision to let him go.Smith will have to earn the job, of course, but his experience will be a significant factor. Taylor has played just 18 snaps on the left side in his entire career; Smith has played 8,473 during his eight seasons in the NFL.Niang earned the starting right tackle job in 2021 but struggled with injuries, first a shoulder problem and then a rib injury that caused him to miss four games. He then tore a patellar tendon in Week 17 and was placed on injured reserve.",
        "Morris was a five-star recruit to Tennessee before transferring to Oklahoma, where he played his last two seasons. He also dealt with injuries, missing time with a shoulder problem, before opting out of the Sooners' bowl game this past season.\"I think we´ll have good competition between Niang (and) Wanya, and then I think (Darian) Kinnard has some flexibility, too,\" Chiefs general manager Brett Veach said earlier this week, in discussing the competition along the offensive line.\"I think all three of those guys will bounce in there. Kinnard will go back and forth to tackle and guard, and I think Wanya has some tackle guard-flex,\" Veach said. \"So I think you´ll see (offensive line) coach (Andy) Heck do a great job of just mixing and matching. Then we get to training camp (and) just let the competition speak for itself.\"___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}