{
    "articleURL": "/femail/article-12046253/I-bought-abandoned-one-euro-house-Sicily-cheap-transformed-dream-home.html",
    "content": [
        "Meredith Tabbone, 43, from Chicago, has now bought several local propertiesREAD MORE: I revamped my tired old kitchen for just £300 using bargains from B&amp;Q and The Range - it saved me thousands and looks amazingA woman has revealed how she snapped up a bargain property in the Italian village where her grandparents grew up and transformed it into her dream home. ",
        "Meredith Tabbone, 43, from Chicago, heard councils in Sicily were auctioning off abandoned houses with a €1 starting bid to regenerate the village.The building had no electricity or running water and the roof was thick with asbestos.Bids started at just €1 – but she threw in a random offer of £4,400 – and found out she was the successful buyer months later.It cost Meredith €750 (£661) to hire a team to remove the roof in an environmentally-safe way.",
        "Meredith then bought the empty home next door for £27,000 - and spent 46 months and £210,000 knocking them together to build a 3,000sqft four bed getaway.She plans to stay in the house part-time - and calls it her 'extended vacation home'.Since then, Meredith has bought two guest houses in the same village for £28,000 in total, and a disused building for £58,000 which she's turning into a gallery and café.She estimates her £230,000 investment in the original one euro house will be worth £3-400,000 when all the work is completed in autumn 2023.Meredith said: 'The house was in very bad condition, but in many ways, it was everything I expected it to be and more.'It had so much charm! It had such interesting architectural detail, you could really see the history coming through the walls. But it was a fixer-upper, to say the least.",
        "'When we first saw the house, it was 750 square feet, it had no electricity, running water or windows and it was thick with asbestos. At first, the plan was just to turn it into a small getaway house.",
        "'While we originally just wanted it as a tiny getaway – we've turned it into a dream home. 'It's very large and intricate. There are four beds, four baths, an outdoor kitchen, a living and a dining area.'We've also installed an upper terrace, lower terrace, spa and wine cellar – as well as a fireplace and a pizza oven.'Meredith Tabbone knew her dad Michael's family came from Sicily.But she didn't know any more until she began researching how to get an Italian citizenship in 2016.She discovered his great-grandfather, Fillippo Tabbone, came from Sambuca di Sicilia, a small village in Sicily.In January 2019 - one year into applying for her Italian citizenship - Meredith read an article about people bidding on €1 houses in Italy.On a 'whim', she placed a bid on a 'run-down fixer-upper' in Sambuca.She found out she had won it in May 2019 and started work a month later. ",
        "In August 2020, she bought the home next door via a private sale.With the help of an architect, Meredith converted the one-room building into a four-bedroom holiday home.",
        "They installed doors, windows and walls - as well as burying electrical wires - to turn the building into a home.She bought two guest houses nearby in March 2022 and another empty building in March 2021. Work is currently underway, due to be complete in late 2024.Sharing her three top tips for renovating a property abroad, Meredith said: 'Be patient, the process will take time, learn the local language if you can, and have fun with it!'"
    ]
}