{
    "articleURL": "/wires/reuters/article-12052473/GRAINS-Chicago-grains-end-week-no-new-Black-Sea-ships-authorized.html",
    "content": [
        "Russia, Ukraine, Turkey and UN fail to reach Black Sea agreement",
        "Markets have eye towards U.S. crop report(Adds new quote in paragraph 4, changes paragraph 1 to include new Black Sea details, adds information in paragraphs 2 and 3, adds closing prices, changes headline, changes bullets)By Cassandra GarrisonMEXICO CITY, May 5 (Reuters) - Chicago grains and soy ended the week higher on Friday as hopes dimmed for the renewal of a U.N.-brokered deal allowing the safe Black Sea exports of Ukraine grain.Ukraine, Russia, Turkey and the United Nations failed to reach an agreement to authorize any new vessels to carry out Black Sea grain exports on Friday, deputy U.N. spokesperson Farhan Haq said.The most-active wheat and corn futures contracts made their first weekly gains in three weeks, coming off two-year and nine-month lows, respectively. Russia has said it will not extend the Black Sea pact beyond May 18 unless its list of demands over its food and fertilizer exports is met.\"The Russians are giving no indication that they are budging on the corridor extension,\" said Charlie Sernatinger, head of grains for Marex Capital, in an analyst note.The pace of grain shipments from Ukraine under the initiative has slowed as concerns grow over ships getting stuck if a deal is not renewed, according to sources and data.",
        "The most-active wheat contract on the Chicago Board of Trade (CBOT) gained 15-1/4 cents to settle at $6.60-1/4 a bushel, after dipping this week to the lowest since April 2021.Corn ended 7-1/2 cents higher at $5.96-1/2 a bushel. In the week, it rose 2.1% after sinking to its lowest since July 25, 2022, on Wednesday.Soybeans settled up 18-3/4 cents at $14.36-1/2 a bushel, after touching a low not seen since October earlier in the week.Markets were looking ahead to a U.S. crop condition report on Monday, deficit negotiations in Washington and a monthly U.S. crop production report on May 12.\"We've got issues with lack of selling by the producer because it's planting season, we've got the debt ceiling concern and we have a crop report that's going to come out next Friday, expected to be negative,\" said Don Roose, president of Iowa-based U.S. Commodities. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Uttaresh Venkateshwaran, Varun H K, Sohini Goswami and Sandra Maler)"
    ]
}