{
    "articleURL": "/sport/football/article-12056491/Football-fans-leap-defence-Liverpool-captain-Jordan-Henderson.html",
    "content": [
        "Liverpool fans have reacted to Jordan Henderson singing the national anthemAnfield drowned out the pre-match tribute to the new King on SaturdayBut England international and Reds skipper Henderson sang along to the anthemJordan Henderson's decision to sing the national anthem in Liverpool's Saturday evening Premier League clash with Brentford has split opinion between club supporters and rival onlookers.",
        "Anti-monarch Liverpool supporters inside Anfield drowned out God Save The King and booed the national anthem that was played to mark the crowning of King Charles III and the Queen Consort at the request of the Premier League.There was additional visual rejection as signs and banners that read 'not my king' were held aloft before kick-off. The hostile reaction was widely expected but still shocked onlookers with Piers Morgan labelling Liverpool supporters who revolted as pathetic.Reds captain and England national team mainstay Henderson was one of the few players that joined in by singing along from the bench.",
        "However, English duo Trent Alexander-Arnold and Curtis Jones - who were both born in Liverpool - appeared to take a vow of silence when the music began to blast out of the stadium's PA system.Sections of Liverpool supporters are unhappy with their captain's decision to join in, while others have demonstrated their dismay at the actions of many inside Anfield that denounced the new King.One fuming Liverpool fan labelled Henderson as a disgrace, writing: 'Jordan Henderson is a disgrace get him out the club now.'Another claimed Alexander-Arnold is a 'hero' for refusing to sing, posting: 'Absolutely nothing is better than the camera panning on Henderson singing the anthem, then the camera pans to Trent and he’s not mouthing a word. ",
        "'I know which one of them better gets the club. Trent is a hero.'Other similarly annoyed fans sounded more calls for Henderson to leave his club, as one stated: 'That was the best boo I’ve ever seen, also terminate Jordan Henderson’s contract with immediate effect.'However, some fans joined rival onlookers in shameful rejection of thousands of Liverpool supporters that were involved in protesting the pre-match anthem.One viewer explained that the Reds skipper looked 'embarrassed' by what he was witnessing, posting online: 'Jordan Henderson totally embarrassed as are all the other England players. I honestly wish I hadn’t seen that to be honest. The shame of it.'",
        "Another similar viewer echoed: 'Well done Jordan Henderson. As a Liverpool supporter I find this shameful.'A bemused onlooker tried to explain why Henderson had joined in the singing, adding: 'So an English player (Jordan Henderson) by birth, has played for England, captained Liverpool and for so long lauded by their fans as a super hero has now been cast as the devil. 'His crime, he sang the National Anthem of the country he loves. Only in Liverpool.'While another Henderson sympathiser tweeted: 'Why is Jordan Henderson being terrorised by his own fans for singing his national anthem.'"
    ]
}