{
    "articleURL": "/tvshowbiz/article-12038901/Kai-Fagan-Sanam-Harrinanan-Ron-Hall-Lana-Jenkins-date-night.html",
    "content": [
        "Kai Fagan and Sanam Harrinanan joined Ron Hall and Lana Jenkins for a fun-filled double date night in Manchester on Tuesday.",
        "The 2023 winter Love Island winners looked as loved-up as ever as they held hands while joining Ron and Lana, both 25, for a night out at Menagerie Bar and Restaurant.The two couples have remained close friends since meeting on the ITV dating contest in South Africa earlier this year and often head on double dates. For their latest outing, former social worker Sanam, 24, cut a stylish figure in a plunging black long-sleeved top and fitted black trousers.She added a few extra inches to her frame with a pair of pointed black heeled boots and kept her essentials swept over one shoulder in a white handbag.",
        "Sanam styled her raven locks in a straight fashion across her shoulders and bolstered her striking features with a high-glamour make-up palette.She walked hand-in-hand with Kai as they appeared to be as smitten as ever during their romantic date night.Meanwhile, former PE teacher Kai, 24, cut a casual figure in a black T-shirt and dark jeans, which he styled with black trainers.He added a pop of colour to his stylish look with a washed-out purple collared jacket as he flashed a huge grin.The couple were joined by make-up artist Lana and her financial advisor boyfriend Ron, who looked equally as loved-up.",
        "Lana put on an edgy display in a strapless metallic silver top, which she styled with black cargo trousers.She kept comfortable in a pair of vibrant pink trainers and swept a black jacket across her shoulders.The blonde bombshell swept her golden tresses back into an up-do while her side fringe fell loosely to frame her face.Lana accentuated her natural beauty with a slick of eyeliner and lashings of mascara as she appeared to be in jovial form.Ron cut a laidback figure in blue jeans and a black Givenchy jumper, which he paired with a pair of white trainers.He wore his dark locks in his signature buzz cut and held hands with Lana as they enjoyed their night out.  Kai and Sanam were crowned winners of the 2023 winter series of Love Island, with Ron and Lana coming in as runners-up. Their latest date night comes after Ron admitted he 'struggles to be apart' from his girlfriend Lana but shared that they won't be moving in together yet. ",
        "Speaking exclusively to MailOnline, Ron, who is based in Essex, discussed his future plans with Manchester-based Lana after he previously made it clear that he will not be moving up North.He admitted despite 'only spending six days apart' since leaving the South African villa, he aims to 'buy his own place' before they commit to living together. ",
        "Ron confessed: 'I struggle to be apart from her. We’ve only spent six days a part since coming out. 'Our end goal is to move in together but at the minute we want to be able to buy our own places and then eventually move in together.'"
    ]
}