{
    "articleURL": "/wires/afp/article-12040627/Worlds-tallest-hemp-hotel-trails-South-Africas-green-credentials.html",
    "content": [
        "With 12 storeys, a breathtaking view of Cape Town's imposing Table Mountain and a minimal ecological footprint, the world's tallest building made with industrial hemp is soon to open its doors in South Africa.",
        "Workers in central Cape Town are putting the finishing touches on the 54-room Hemp Hotel, which is due to be completed in June.\"Hempcrete\" blocks derived from the cannabis plant have been used to fill the building's walls, supported by a concrete and cement structure.Hemp bricks are becoming increasingly popular in the construction world thanks to their insulating, fire-resistant and climate-friendly properties.Used notably in Europe for thermal renovation of existing buildings, the blocks are carbon negative -- meaning their production sucks more planet-warming gases out of the atmosphere than it puts in.",
        "\"The plant absorbs the carbon, it gets put into a block and is then stored into a building for 50 years or longer,\" explains Boshoff Muller, director of Afrimat Hemp, a subsidiary of South African construction group Afrimat, which produced the bricks for the hotel.\"What you see here is a whole bag full of carbon, quite literally,\" Muller says as he pats a bag of mulch at a brick factory on the outskirts of Cape Town, where hemp hurds, water and lime are mixed together to make the blocks.The industrial hemp used for the Hemp Hotel had to be imported from Britain as South Africa banned local production up to last year, when the government started issuing cultivation permits.",
        "President Cyril Ramaphosa has made developing the country's hemp and cannabis sector an economic priority, saying it could create more than 130,000 jobs.- Carbon credits -Afrimat Hemp is now preparing to produce its first blocks made only with South African hemp.Hemp Hotel architect Wolf Wolf, 52, sees this as a game changer to make hemp buildings more widespread in this corner of the world.",
        "\"It shouldn't be just a high-end product,\" says Wolf, whose firm is involved in several social housing projects in South Africa and neighbouring Mozambique.Yet cost remains an issue.\"Hemp is 20 percent more expensive to build with\" compared to conventional materials, says Afrimat Hemp's carbon consultant Wihan Bekker.But as the world races to lower carbon emissions, the firm sees \"huge opportunities\" for its green bricks, says Bekker.Carbon credits -- permits normally related to the planting of trees to safeguard tropical rainforests that companies buy to offset their emissions -- could help make hempcrete blocks more financially palatable, he says.\"We can fund forests, or we can fund someone to live in a hemp house. It's the same principle,\" Bekker says.The carbon footprint of a 40 square metre (430 square foot) house built with hemp is three tons of CO2 lower than that of a conventional building, according to Afrimat Hemp.",
        "\"We see this as a bit of a lighthouse project,\" Muller says of the Hemp Hotel.\"It shows hemp has its place in the construction sector.\"Hemp Hotel has been ranked the \"tallest building to incorporate hemp-based materials in the world\" by Steve Allin, director of the Ireland-based International Hemp Building Association."
    ]
}