{
    "articleURL": "/tvshowbiz/article-12050235/Cody-Simpson-attracts-thirsty-comments-posts-racy-photo.html",
    "content": [
        "Heartthrob Cody Simpson has attracted some very thirsty comments after he posted a photo of himself in tight Speedos. ",
        "On Thursday, the popstar-turned-swimmer shared several photos to Instagram of his recent adventures at the pool. In one snap, he shows off his washboard abs and toned physique in a pair of very tight black swimming trunks. He holds a towel in his right hand in the racy snap as his blonde hair is illuminated by the sun. Some of Simpson's over five million followers were quick to comment on the saucy photo. ",
        "One person wrote: 'How do I like the last picture 100 times, asking for a friend'. While another said: 'Your body is perfect'. And a third commented: 'The last pic' with four tongue hanging out emojis. Last month, Cody missed out on the final of of the 100m freestyle and bombed it in his pet event in the 100m butterfly at the Australian Swimming Championships. However, the 28-year-old has dismissed suggestions that results at the Gold Coast Aquatic Centre were a hit to his Olympic preparation, telling Wide World of Sports that such talk was 'ridiculous.'",
        "'Absolutely not - I think those headlines are ridiculous, because the Paris Olympic trials are in 15 months and we are in heavy training at the moment and everyone's at different stages of their preparation,' he said.He said that the Australian Championships were not the nationals, which would take place in two months, and that his coach's plan was not to have him at full pace.",
        "Simpson, who spent ten years as a musician before switching to swimming in 2020, said that he plans to continue to push for Paris selection in both the 100m butterfly and the 4x100m relay squad.He had missed qualification for the Tokyo Games but had previously indicated that Paris would likely be the only Olympics he chases before a potential return to music.However, Simpson now says he hasn't given retirement from swimming any further thought and hasn't ruled out making a charge for the LA Games in 2028."
    ]
}