{
    "articleURL": "/sport/football/article-12055049/Grant-Wahl-inducted-Soccer-Hall-Fame-five-months-death-Qatar-World-Cup.html",
    "content": [
        "Wahl died aged 49 in December after collapsing while covering the World CupHe was honored with the Colin Jose Media Award at Frisco in Texas on Saturday DailyMail.com provides all the latest international sports newsThe late Grant Wahl was inducted into the National Soccer Hall of Fame as he was honored posthumously with the Colin Jose Media Award.",
        "Wahl died at age 49 on December 10 after collapsing while covering the World Cup quarterfinal between Argentina and Holland at Lusail, Qatar.He was honored at the Hall of Fame induction at Frisco, Texas, with the award that is given to journalists who made long-term contributions to soccer in the United States.Upon announcing his award, the Hall of Fame's official Twitter account wrote: 'He dedicated his life to growing the game and left an indelible legacy on American soccer.'Wahl's wife Celine Gounder and his brother Eric accepted the award on his behalf. ",
        "The USMNT's also paid tribute to the late journalist by quotes-tweeting the Hall of Fame's announcement by posting: 'Today and every day, we remember and celebrate the work of Grant Wahl to grow our sport. His legacy now lives on forever in the @soccerhof.'Wahl worked for Sports Illustrated from 1996 to 2021, covering soccer and college basketball, then started his own website. He also worked for Fox and CBS, and he wrote the books 'The Beckham Experiment,' about England star David Beckham's move to Major League Soccer's LA Galaxy, and 'Masters of Modern Soccer.'Wahl - an accomplished sports journalist of over 25 years - was in Qatar covering his his eighth men's World Cup and his 12th World Cup overall.",
        "During the match, Wahl suddenly collapsed in his seat in the press box of the Lusail Iconic Stadium in Qatar.Paramedics on the scene treated him for about half an hour before he was transported to Hamad General Hospital in Doha, where he was pronounced dead on December 10.An autopsy by the New York City Medical Examiner's Office revealed the cause of death to be a ruptured aortic aneurysm with hemopericardium, Gounder wrote in a blog post.'No amount of CPR or shocks would have saved him. His death was unrelated to COVID. His death was unrelated to vaccination status. There was nothing nefarious about his death,' she wrote. ",
        "During the opening weekend of the MLS season, teams also honored Wahl with a seat in press boxes around the league reserved for him. In press boxes across the league, images of Wahl were placed alongside flowers, rainbow banners, memorabilia from his podcast, and cards encouraging people to share interactions with him as well as other memories from his life that impacted others.Meanwhile, USA women's star Hope Solo was also inducted into the Hall of Fame Saturday. The USWNT goalkeeper thanked her teammates throughout the years as she accepted the award. Landon Donovan, DaMarcus Beasley, Lauren Cheney Holiday, Kate Sobrero Markgraf, former US women's coach Jill Ellis and Steve Zungul will be inducted into the hall. "
    ]
}