{
    "articleURL": "/wires/pa/article-12043537/Convoy-taking-fire-vehicles-life-saving-kit-Ukraine-leaves-Liverpool.html",
    "content": [
        "A convoy taking UK fire and rescue vehicles and other life-saving equipment is on its way to Ukraine.",
        "Fire minister Chris Philp said he was “immensely proud of our continued contributions”, which included 21 fire and rescue vehicles as well as a further 8,000 pieces of equipment, with the convoy expected to arrive in Poland on Friday.The donations will be received by the head of Ukraine’s fire and rescue service and this shipment takes contributions by England and Wales’s fire services to support Ukraine to 86 fire and rescue vehicles and more than 100,000 items of equipment.",
        "The timing of the shipment is also to honour the Eurovision link between Ukraine and the UK, with the vehicles leaving Liverpool on Tuesday, the city which will host the competition later this month.“I am immensely proud of our continued contributions to support Ukrainians on the front line and of our fantastic colleagues from fire and rescue services who have volunteered to ensure the convoy’s safe passage,” Mr Philp said.“Putin’s barbaric invasion of Ukraine has decimated so many lives and has left fire and rescue services in the country with minimal equipment.",
        "“Putin is deliberately targeting civilians and civilian buildings in Ukraine so it is essential we do everything within our power to help them.”The Government collaborated with the National Fire Chiefs Council as well as fire and rescue services across England and Wales to co-ordinate the effort, which includes delivery of helmets, generators, lighting and hoses.",
        "A total of 17 fire and rescue services were involved in the transportation of the donations, while dozens of firefighters volunteered their time.Chair of the National Fire Chiefs Council Mark Hardingham said: “Firefighters on the front line in Ukraine are in desperate need of equipment as the war continues to devastate the country.“This fifth convoy means fire and rescue services have now donated 86 fire engines and more than 100,000 items of kit.“The determination and pride of all involved is testament to how committed everyone is to getting help to where it is needed.”"
    ]
}