{
    "articleURL": "/news/article-12049127/White-Houses-Sullivan-travel-Saudi-weekend.html",
    "content": [
        "Sullivan will be in Saudi Arabia at the weekend to bolster fraught relationsBefore leaving, he delivered a summary of U.S. Middle East policy He said the U.S. was working with allies to prevent Iran acquiring nukesPresident Joe Biden's national security adviser promised Thursday that the U.S. would do whatever was necessary to prevent Iran acquiring a nuclear weapon.",
        "Jake Sullivan delivered his message in a major speech at a thinktank setting out the administration's Middle East policy.He will be in Saudi Arabia at the weekend, as Washington tries to improve often fraught relations with Riyadh. Sullivan lamented the Trump administration's decision to abandon the 2015 Iran nuclear deal, which he said had now allowed Tehran to advance along the path to nuclear weapons. 'So from my perspective, we are back in a position that we were in before where Iran is enriching, is advancing, and this nuclear programme poses a genuine challenge to our fundamental non-proliferation goals,' he said at the Washington Institute for Near East Policy.",
        "'And we remain determined to ensure that that challenge does not cross the line to Iran acquiring a nuclear weapon. 'Yes, we will take the necessary action to ensure that Iran does not acquire a nuclear weapon. 'At the end of the day, that's the fundamental test. Iran cannot have a nuclear weapon. They do not today, and they cannot have one.'Sullivan said Washington was working with allies including Israel to deter Iran from developing a weapon.'We will continue to send a clear message about the costs and consequences of going too far, while at the same time continuing to seek the possibility of a diplomatically brokered outcome that puts Iran´s nuclear program back into a box.'",
        "He also said he would be traveling to Saudi Arabia on Saturday for talks with Saudi leaders.A source said Sullivan is expected to meet with Saudi Crown Prince Mohammed bin Salman.Oil production cuts by Saudi-led OPEC+ and differences between the United States and Saudi Arabia over the 2018 death of Washington Post journalist Jamal Khashoggi have damaged ties.",
        "Sullivan said that also going to Saudi Arabia will be representatives from India and the United Arab Emirates to discuss 'new areas of cooperation between New Delhi and the Gulf as well as the United States and the rest of the region.'Former President Donald Trump's administration brokered a number of normalization deals between Gulf allies and Israel. Sullivan said the United States was working hard to normalize relations between Israel and Saudi Arabia.'Ultimately getting to full normalization is a declared national security interest of the United States. We have been clear about that,' he said.'Now as a sign of my seriousness about how much we're focused on this, and how seriously we are taking this, I am not going to say anything further lest I upset the efforts we are undertaking on this issue.'Sullivan played down U.S. tensions with Israel that have developed since Benjamin Netanyahu took over again as Israeli prime minister late last year. He said he held a video conference with his Israeli counterpart on Wednesday and Netanyahu joined in for part of it.",
        "He did not say, however, when Biden would extend an invitation to the Israeli leader to visit Washington. "
    ]
}