{
    "articleURL": "/news/article-12053863/Tony-Blair-John-Major-Gordon-Brown-David-Cameron-Theresa-join-Boris-Johnson-Coronation.html",
    "content": [
        "Mr Major was without his wife Norma, 81, who was set to attend but is unwell CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Boris Johnson, Tony Blair and John Major led Britain's seven former prime ministers in attending the King's Coronation at Westminster Abbey today. ",
        "Mr Johnson arrived holding his wife Carrie's hand as Theresa May and her husband Philip walked ahead of them and Liz Truss trailed behind with her husband Hugh. Mr Major, 80, was seen talking to Mr Blair's wife Cherie as he arrived without his wife Norma, 81, who had been set to attend but is unwell.Mr Brown, 72, was joined by his wife Sarah, while David and Samantha Cameron rounded off the line of Britain's seven surviving former leaders and their spouses. ",
        "The group went to take their seats after current Prime Minister Rishi Sunak had also arrived with his wife Akshata Murthy.Mr Sunak replaced Ms Truss as PM last October after her disastrous short-lived stint in Downing Street. Ms Truss was PM when Her Late Majesty The Queen died aged 96.She became PM after Mr Johnson was forced to step down by his own MPs following a string of scandals. He had replaced Mrs May as PM in 2019 after the failure of her attempts to get her Brexit deal through Parliament. And Mr Cameron, 56, served as PM from 2010 until 2016, when he resigned after Britain voted to leave the EU.Mr Brown, the most recent Labour PM, was in Downing Street from 2007 until 2010 after replacing Mr Blair, who served for a decade from 1997.  ",
        "Meanwhile King Charles and Queen Consort Camilla left for the Abbey from Buckingham Palace in the Diamond Jubilee State Coach. The national anthem played and crowds shouted 'God Save the King' as he started on his 1.3-mile journey to Westminster Abbey through streets lined with 2million people and 7,000 British troops. 100million people are watching on TV around the world.The Diamond Jubilee State Coach, drawn by six Windsor grey horses, arrived at Buckingham Palace for the King and Queen at 10am. ",
        "Members of the Mounted Division of the Household Cavalry lined up at the entrance to The Mall ahead of the King's Procession to Westminster Abbey.A mile away from the Palace, Westminster Abbey was rammed with the great and good from Britain and around the world as Charles III's day of destiny finally arrived.More than 100million people around the world were about to watch the historic first coronation of a British monarch in 70 years - with an estimated 2million people on the streets of London to watch history unfold.Stars in the Abbey included Katy Perry, Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement. First lady Jill Biden was among the last to enter before the service, sitting with First Lady of Ukraine Olena Zelenska. President Joe Biden has stayed at home."
    ]
}