{
    "articleURL": "/tvshowbiz/article-12061393/Spice-Girls-never-heard-demos-sale-against-bands-wishes-7K.html",
    "content": [
        "Never before heard demos by iconic girl group The Spice Girls have gone on sale for £7K it's been reported.",
        "The rare vinyl of songs that failed to make the grade for the group's 2000 album Forever are said to have turned up with the hefty price tag on eBay. Tracks titled Woman, Too Hot and Go,Go,Go racked up more than 80 bids before being pulled from the site - however they have since been shared illegally online.The demos are believed to feature Victoria Beckham, 49, Mel C, 49, Emma Bunton, 47 and Mel B, 47 - though not Geri Halliwell, 50, who left the group two years earlier. A source told The Sun: 'It is unclear how someone got hold of this vinyl but they shouldn't sell it.",
        "'The contents should never have been made public and it is unfair to the group to have these unfinished songs shared, as it is against their wishes.'MailOnline have contacted reps for comment.  The Spice Girls first formed in 1994 and went on to release a number of international hits including Wannabe, Stop, Spice Up Your Life and Too Much.The group took a hiatus in 2000 and soon worked on solo material.They reunited for a tour in 2007 and released the track, Headlines (Friendship Never Ends). They also recently performed another tour called Spice World in 2019, without Posh Spice, which earned an incredible $78.2 million in ticket sales.",
        "Earlier this year it was reported Victoria reportedly earned £2million from the Spice Girls reunion tour without singing a single note, her accounts have revealed. The singer-turned-fashion designer's firm Moody Productions Ltd is said to have earned £703,000 in 2021, while in 2020, it brought in £403,000.",
        "While in 2019, despite not joining Emma Bunton, Mel B, Mel C and Geri Horner on the reunion tour, Victoria's company still raked in a whopping £1million. The Mirror reported in January that Moody Productions is still entitled to a cut of the takings from licensing deals, merchandising and endorsements generated from the tour, since Posh is still technically a band member. The publication reports that accounts filed show that Moody Productions Ltd paid £140,637 in Corporation Tax for the year 2021, meaning that Victoria bagged £703,000 from the group's back catalogue catalogue.Meanwhile, it was reported earlier this month that her husband David Beckham earned a jaw-dropping £657,322 per week in 2022 - as he and his wife Victoria shared an £8million dividend from their business empire.The power couple entered 2022 feeling flush after sales across their ventures surged following lockdowns - with the former Spice Girl's fashion range making a loss.Beckham Brand Holdings, which acts as the umbrella company for David's investments and branding and Victoria's fashion and beauty firm, revealed in accounts filed that profits for 2021 hit £19.1m, up from £11.6m a year earlier."
    ]
}