{
    "articleURL": "/wires/reuters/article-12050905/Canada-adds-jobs-expected-April-jobless-rate-holds-5-0.html",
    "content": [
        "By Ismail Shakil",
        "OTTAWA, May 5 (Reuters) -Canada's economy added far more jobs than expected in April and the jobless rate stayed near a record low for a fifth consecutive month in a show of continued labor market resilience despite signs of an economic slowdown, data showed on Friday.The economy gained a net 41,400 jobs in April, while the jobless rate stayed at 5.0%, Statistics Canada data showed.Analysts surveyed by Reuters had forecast that a net 20,000 jobs would be gained in April and the unemployment rate would edge up to 5.1%.It was the eighth straight monthly jobs gain and brought the net increase in the number of people employed since September to 423,900, Statscan said. The unemployment rate has remained just a notch above the record low of 4.9% since December.The employment gains last month were entirely in part-time work, which added a net 47,600 jobs, and more than offset the 6,200 full-time jobs lost. It was the first notable increase in part-time work since October 2022, Statscan said.\"Even though today's increase in employment was fairly narrowly based and driven by part-time work, the labor market is clearly stronger and tighter than we would have expected given signs of deceleration in economic growth,\" said Andrew Grantham, a senior economist with CIBC capital markets.",
        "A Statscan flash estimatereleased last weekshowed Canada's economy likely contracted in March, translating to a 2.5% annualized GDP growth in the first quarter.The Bank of Canada (BoC) expects positive but weak economic growth in the remaining three quarters of this year, as the impact of past rate hikes takes hold. It has kept interest rates unchanged in its last two meetings after hiking at eight consecutive policy meetings previously as it sought to cool the economy and bring inflation down.April's strong jobs data is unlikely to impact GDP growth forecasts for this year, said Nathan Janzen, senior economist at Royal Bank Of Canada.\"We have a negative GDP growth starting in Q2 and into Q3 and I don't think that will change as a result of this data,\" Janzen said.The average hourly wage for permanent employees - a figure the central bank watches closely - rose 5.2% from April 2022, the same as the March year-over-year increase. The BoC has said that interest rates may need to stay high for a while because of wage pressures in a tight labor market and sticky services prices.Governor Tiff Macklem on Thursday said the central bank's baseline scenario sees the labor market softening as growth slows, easing wage pressures and business price-setting behavior.",
        "\"We still don't expect the BoC to hike rates again but also inflation is still firm. We still have an unemployment rate that is really, really low,\" Janzen said.The services sector added 35,200 jobs in April, led by wholesale and retail trade and transportation and warehousing, while the goods sector gained a net 6,300 jobs, mostly in construction.The Canadian dollar strengthened 0.6% to touch a two-week high of 1.3454, or 74.33 U.S. cents, against its U.S. counterpart. (Reporting by Ismail Shakil; Additional reporting by Fergal Smith in Toronto and Dale Smith in Ottawa; Editing by Toby Chopra, Tim Ahmann, Paul Simao and Mark Porter)"
    ]
}