{
    "articleURL": "/wires/reuters/article-12055857/Sydney-FCs-season-revived-playoff-win-city-rivals.html",
    "content": [
        "SYDNEY, May 7 (Reuters) - Five-times Australian champions Sydney FC have endured a disappointing season by their standards but a late winner from Adam Le Fondre in the playoffs on Saturday night put them right back in the hunt for a sixth title.",
        "The English striker's 80th minute header gave the Sky Blues a 2-1 comeback win over city rivals Western Sydney Wanderers and sent them through to a semi-final against Melbourne City with a spot in the championship final on the line.Sydney FC finished fifth in the regular season standings but coach Steve Corica said they should not be written off over two legs against a City team that finished 11 points clear at the top of the A-League.\"We've had four wins in a row and played some good football, it's come at just the right time of the season,\" he told reporters.\"They (City) are beatable, we'll have to play really well to do that. We just have to make sure we get ourselves up for the (first leg).\"Corica expressed his disappointment that the club's main supporters group, the Cove, were boycotting the playoffs because of the league's controversial decision to play the championship final in Sydney for the next three years.\"I know why they're doing it, but I'm disappointed they weren't there,\" he added.\"We want our supporters there, they are our 12th man, of course we want them there next week.\"The other semi-final will pitch second-placed Central Coast Mariners against Adelaide United, who beat New Zealand's Wellington Phoenix 2-0 on Friday night to secure their place in the last four.",
        "While the prospect of potentially reaching a first championship final since they won their only title in 2016 has created excitement in South Australia, much of the talk after the match was focused on the future of Nestory Irankunda.The Tanzanian-born teenager has been in electric form off the bench this season and strongly linked in the media to a move to German giants Bayern Munich.Adelaide coach Carl Veart said he had never seen a player who excited fans as much as the 17-year-old winger but that no deal had been done yet.\"The last conversation I had is there's still quite a few clubs throwing their hat into the ring,\" he said.\"So I don't think it's going to be a straightforward decision.\" (Reporting by Nick Mulvenney, editing by ...)"
    ]
}