{
    "articleURL": "/news/article-12042649/Ron-DeSantis-signs-ESG-bill-banning-public-funds-invested-social-environmental-projects.html",
    "content": [
        "DeSantis continued his 'war on woke' by signing an anti E.S.G. bill on TuesdayIt affects funds that promote environmental, social and governance goalsIt means state officials cannot use E.S.G. factors in investment decisions Gov. Ron DeSantis on Tuesday signed a bill banning state officials from investing public money in funds that promote environmental, social and governance goals.",
        "Supporters of E.S.G. investments say they represent capitalism with a conscience, and that moving money away from fossil fuels, for example, represent a good bet on future returns in a greening economy.But DeSantis says they were an attempt to impose the politics of the 'Davos elites' through financial markets. 'They want to use economic power to impose this agenda on our society,' he said.'And we think in Florida, that is not gonna fly here.'",
        "The bill is one of the furthest-reaching efforts yet by Republicans to stamp out sustainable investing efforts.And it marks a clear message from DeSantis, as he sets out his culture war credentials ahead of an expected presidential run. The bill bars state and local governments from using ESG factors in investment decisions.House Bill 3 also required state-registered banks to make loans to companies in sectors such as fossil fuels, firearms and private prisons.Conservatives claim that banks are discriminating against businesses in controversial fields.The law also bars the sale of E.S.G. bonds, an increasingly popular way to fund green energy projects or that lower borrowing costs for companies that meet emissions or diversity targets.'Florida will not bow down to the political virtue signaling of martini millionaires,' said House Speaker Paul Renner.",
        "'Corporations have no right to bypass our democratic process. 'Companies that engage in E.S.G. hurt their customers and the communities they serve, including Florida's retirees, by making everything they produce more expensive.'Critics of the move say it will cut off Florida from E.S.G. mandated funding, and that it will be difficult to enforce.",
        "But the subject is something that Republicans have coalesced around. In March, 19 governors, including DeSantis, took aim at President Joe Biden and his embrace of the principles of E.S.G.'We as freedom loving states can work together and leverage our state pension funds to force change in how major asset managers invest the money of hardworking Americans, ensuring corporations are focused on maximizing shareholder value, rather than the proliferation of woke ideology,' they wrote.They said the would work together to 'keep fighting the administration's decision to jeopardize retirement savings for millions of Americans to promote far left priorities.'The issue triggered the first Biden veto of his presidency. He stopped a Republican-led bill that would have overturned his administration's rule letting retirement account planners take E.S.G. factors into account. Because climate change, social impacts and ongoing lawsuits have significant financial repercussions, administration officials argued that the investment limits were courting possible disaster. Biden, in a video released by the White House, said he vetoed the measure because it 'put at risk the retirement savings of individuals across the country.'"
    ]
}