{
    "articleURL": "/wires/ap/article-12043965/At-UN-worlds-divided-nations-agree-theres-little-trust.html",
    "content": [
        "UNITED NATIONS (AP) - The world´s divided nations agreed Wednesday on one thing: There is a lack of trust in a world beset by conflicts and crises.",
        "Diplomats at the U.N. Security Council presented ideas on how to move toward a more peaceful future - a task they see as difficult, but not impossible.Switzerland´s Foreign Minister Ignazio Cassis, whose country is in its first presidency of the U.N.´s most powerful body, chose the debate on trust, calling it a crucial element for peace. He recalled that when the United Nations was established on the ashes of World War II its mandate was to prevent another world war and there was trust among the former warring nations. Yet today, he said, \"we still live with war.\"International diplomacy is under stress and U.N. members have to acknowledge they haven´t taken account of the frustrations and challenges facing the planet, Cassis said. But the international system where the world´s nations act together is \"not bankrupt,\" and \"the real failure would be to do nothing,\" he stressed.Cassis challenged the Security Council to grasp its responsibility of ensuring international peace and security, rebuild broken bridges, and \"reflect on its potential for action in the face of the increasing number of crises.\"Russia´s U.N. Ambassador Vassily Nebenzia laid out the challenge of rebuilding bridges in stark terms, citing the deep-seated divide and \"trust deficit\" among the council´s 15 members. He blamed what he called the \"treacherous activities of our former Western partners.\"",
        "\"Over the last 15 to 20 years, they´ve managed to destroy step-by-step the green shoots of mutual understanding and cooperation which had sprung up after the end of the Cold War,\" Nebenzia said, citing what he said were broken promises of no NATO expansion, the West's promotion of revolutions in east European countries formerly part of the Soviet Union, and attempts to impose its own world order.The Russian ambassador stressed that he was referring first and foremost to Ukraine, which he said \"has been relegated to a pawn in the geopolitical confrontation between Russia and the West.\"Albania´s U.N. Ambassador Ferit Hoxha, whose country is a NATO member, countered that the Security Council´s role is \"to lead the battle for peace and security and not be taken hostage to contemplate aggression and drivers of instability in the world\" - including Russia´s ongoing war in Ukraine.He called trust \"the glue that holds people in societies together\" and said the conflict in Sudan, the frustrating failure to agree on elections in Libya, and the abandonment of Haiti to \"the claws of gangs\" also demonstrate what happens when there is no unity and a breaking of trust.U.N. Secretary-General Antonio Guterres and many countries have accused Russia of violating the U.N. Charter - which demands that every country´s sovereignty and territorial integrity be respected - by invading Ukraine.",
        "Nebenzia told the council that \"in order to overcome this crisis, we need joint efforts to come up with an updated, more sustainable international security architecture.\"France´s deputy U.N. ambassador, Nathalie Broadhurst, said violating international law and the U.N. Charter including on non-use of force and peaceful settlement of disputes - \"and I am thinking in particular of Russia´s war of aggression in Ukraine - undermines the international order based on common rules.\"She said the 193 U.N. member nations must build trust by respecting their international commitments, and the United Nations must help restore trust, including through its peacekeeping missions.China´s U.N. Ambassador Zhang Jun told the council the world faces \"a serious trust crisis\" and warned that without mutual trust and international rules and order \"humanity will once again be subject to the law of the jungle.\"He said nothing undermines political trust between countries more easily \"than blowing hot and cold or breaking promises in international relations\" and \"forming exclusive military blocs.\"Without naming the West, he accused it of damaging trust by distorting market rules, seeking technological monopolies, suppressing the development of other countries, and using human rights to interfere in a nation´s internal affairs.The world today is more interconnected than ever, Zhang said, and it needs \"to join hands globally to meet the challenges we face\" and create conditions for trust and lasting peace."
    ]
}