{
    "articleURL": "/wires/reuters/article-12050249/Germanys-union-enter-Thyssenkrupp-defence-sales-talks.html",
    "content": [
        "By Christoph Steitz and Tom Käckenhoff",
        "FRANKFURT/DUESSELDORF, May 5 (Reuters) - Influential labour representatives are open to private equity players taking a stake in Thyssenkrupp's warship division Marine Systems (TKMS) and will set up a committee in the coming days to join the negotiation process.\"We are not generally opposing private equity taking a stake in TKMS,\" said Daniel Friedrich, who leads the division at IG Metall, Germany's most powerful union, that represents workers in coastal areas.Thyssenkrupp is reviewing strategic options for the unit, which builds submarines and frigates, and held early talks with private equity firms KKR, Carlyle and CVC , according to two people familiar with the matter.Apart from a minority stake sale, TKMS could also be spun off, its chief executive and Thyssenkrupp board member Oliver Burkhard said last month.This is the first time the union has publicly backed private equity becoming a shareholder in TKMS. Labour support is vital to any major transaction at Thyssenkrupp, where IG Metall has traditionally wielded substantial influence.\"There have been positive experiences with PE players,\" Friedrich told Reuters, singling out KKR and the investor's past engagements at forklift truck maker Kion and defence firm Hensoldt.At 1.8 billion euros ($2 billion), TKMS, Germany's biggest warship builder, accounted for 4.5% of Thyssenkrupp's group sales in the last fiscal year. It employs around 7,200 staff, roughly 7% of Thyssenkrupp's total.",
        "PRESERVING INFLUENCEFriedrich said that IG Metall was open to private equity as long as it was clear how jobs and workers' influence over strategic decision-making were protected in the event of a subsequent exit.Either Thyssenkrupp or the German government should remain an anchor investor in TKMS with at least 25.1% were the business to be sold, he added.Germany holds such a blocking minority in Hensoldt.\"We are closely coordinating with the company. In the coming days, we will put together a so-called monitoring commission consisting of the works councils and IG Metall in order to enter into the negotiation process and conclude a best owner agreement with potential investors,\" Friedrich said.Such a best owner agreement was also struck before a private equity consortium led by Advent and Cinven acquired Thyssenkrupp's elevator division in 2020.\"There is pressure on the talks. Now it is a matter of becoming more concrete and moving from 'let's talk' to hard negotiations,\" Friedrich said.While there are plans to prepare TKMS for a standalone future, the group's fairly low profit level could make an investment by private equity difficult, the people familiar with the matter said, adding CVC had no interest in the asset after looking at it.A Thyssenkrupp spokesperson referred to comments by outgoing Chief Executive Martina Merz in February, saying Thyssenkrupp was targeting a standalone set-up for TKMS.",
        "KKR, Carlyle and CVC all declined to comment.Thyssenkrupp will get a new CEO from June after Merz requested a termination of her contract last month, raising concerns that the company could lose valuable time in turnaround efforts, a view Friedrich does not share.\"We assume that the process with regard to TKMS should be viewed separately from the CEO change at Thyssenkrupp.\" ($1 = 0.9072 euros) (Reporting by Christoph Steitz and Tom Kaeckenhoff; Additional reporting by Emma-Victoria Farr; editing by Matthias Williams and Keith Weir)"
    ]
}