{
    "articleURL": "/home/books/article-12048115/Brutal-beautiful-Ballerinas-survive-celery-juice-laxatives.html",
    "content": [
        "Ballet demands an innate masochistic streak, extreme discipline, and submission to the relentless pursuit of perfectionREAD MORE: The night Royal Ballet star danced herself off her feetMEMOIRDon’t Think, Dear: On Loving And Leaving Ballet by Alice Robb (Oneworld £16.99, 304pp) ",
        "Noel Coward warned Mrs Worthington not to put her daughter on the stage, and parents who read Alice Robb’s memoir might well whisk their little darlings away from pink tutus and pointe shoes altogether.This riveting memoir-meets-critical-appraisal examines classical ballet, revealing it to be less career, more cult — and as psychologically and physically brutal as it is beautiful.Like thousands of little girls, Alice Robb dreamed of being a ballerina. Unlike most of them, she almost made it. ",
        "Aged nine — at her third attempt — she gained entry to the School of American Ballet (feeder to the prestigious New York City Ballet). But the dream unravelled with puberty: Robb grew taller, her hips wider and, aged 12, she was summarily expelled.Nascent ballet mothers — a sub-section unto themselves — will wince at this evidence of ballet’s absolute ruthlessness. This, then, is no rose-tinted account. Ballet demands an innate masochistic streak, extreme discipline, and submission to the relentless pursuit of perfection. Its lessons take years to unlearn — even now that she is a successful journalist and author, there is still something of the ‘bunhead’ about Robb.Robb interweaves her own experience with those of famous ballerinas, including the Cuban star Alicia Alonso, who put dancing ahead of a detached retina and, as a result performed for years while nearly blind, and the legendary Margot Fonteyn, who was so indoctrinated by balletic discipline, one colleague described her as ‘the most passive person I have ever known’.",
        "Robb sees this reflected in the emotional legacy of her submissive ballet years, which — like Fonteyn — made her a sitting duck for the type of man who plays it mean.More poignantly, she includes the stories of the girls in her class at the School of American Ballet. Tellingly, only one of them is still dancing. Quite frankly, after reading this unsparing account in which their stories are backed up with studies and statistics, you marvel that even one of them made it.Ballet is pain. It involves contorting, or having your body wrenched into impossible positions, and pointe shoes are a longed-for agony.When dancing en pointe, the force of balancing on one foot is equivalent to letting the full weight of a grand piano fall on a single toe.Feet are regularly bloodied and broken. It is more Black Swan — the ballet psychodrama thriller that won Natalie Portman an Oscar — than Swan Lake.Robb quotes Portman on making Black Swan (the actress endured 16-hour training days, a broken rib, starving herself to the point of emaciation on a diet of carrots and almonds): ‘I thought I literally was going to die.’This, it transpires, is typical ballet fare. It’s an art form which invites children to examine their bodies for flaws, and tells teen girls to ‘lengthen’, an elegant euphemism for weight loss. ",
        "Common daily diets include a single apple and four tablespoons of cottage cheese, or celery juice and laxatives. Robb dreamed of slicing her thighs to make them thinner.One of her contemporaries wasn’t deemed sufficiently slender until she developed a digestive disorder that left her unable to eat.The ideal dancer’s body is preternaturally thin, with a tiny head perched atop a short torso with no hips and unfeasibly long legs.Such is the body dysmorphia this engenders that Robb finds herself critically assessing a room of fashion models and thinking none of them would pass muster in a ballet studio.At times, it reads like madness, but ballet is an autocracy. A dancer’s body is not her own — and nor is her mind. It’s a world in which an aged male teacher wrapping his hands around a teenager’s waist is considered a privilege.Towering over these submissive waifs looms the shadow of the genius choreographer George Balanchine, co-founder of the New York City Ballet. His diktat ‘Don’t think, dear. Just do’ helps give the book its title,Not content with telling women how to dance, Balanchine controlled what they ate (he would rap a girl’s ribs and say that he ‘must see the bones’), chose their perfume and who they dated — which was often Balanchine himself, who was not averse to having sexual relationships with his students. Yet he remains revered.",
        "One of his pupils, Carol Sumner, who is now in her 80s and still teaching according to his methods, laughs as she recalls his ‘grabby’ nature, adding cheerfully that he’d be in prison in today’s MeToo climate.Balanchine stands as a useful signifier for the paradox at the heart of this book, as Robb’s feelings about ballet veer between ‘longing and regret and feminist disdain’.It is, she freely acknowledges, an art form which, over the years, has harmed, infantilised and silenced women, and a pathological pursuit of perfection which is at times, quite literally, a theatre of cruelty.Even so, nothing equals its beauty — or the joy of losing herself in the pursuit of one perfect pirouette."
    ]
}