{
    "articleURL": "/tvshowbiz/article-12057745/Kaley-Cuoco-poses-loving-selfie-partner-Tom-Pelphrey-star-studded-Rock4EB-fundraiser.html",
    "content": [
        "Kaley Cuoco was radiant wearing a rainbow flannel as she posed for an adorable selfie with boyfriend, Tom Pelphrey, in a new Instagram post shared on Sunday from the Rock4EB! fundraiser. ",
        "The Big Bang Theory alum, 37, and the Ozark actor, 40, who welcomed their daughter Matilda in late March, joined other celebrities at the charity event earlier Saturday, such as Courtney Cox and Grammy winner Brandi Carlile. The Emmy nominated actress flashed a big smile as she sat next to Pelphrey outdoors in Malibu where the fundraiser was held, which aimed to bring awareness to the rare skin disease, Epidermolysis Bullosa. The new mother opted for a colorful, oversized button up with a hem that fell down past her waist. She paired the flannel shirt with a black, maxi skirt and slipped into a pair of white sneakers to stay comfortable for the weekend outing.  ",
        "Kaley layered her ensemble with an olive green coat to help her stay warm in the cooler, evening temperatures. Her long blonde locks were pulled up into a messy up do high on top of her head, allowing a few loose strands to fall down towards the base of her neck. While sitting outside under the setting sun, The Flight Attendant actress added a pair of reflective sunglasses. She accessorized her look for the event by wearing an assortment of necklaces, as well as a pair of mini, silver earrings. Tom, who was confirmed to be dating Cuoco in May 2022, also kept his look stylishly casual for the fundraiser, and donned an off-black, hooded sweatshirt. ",
        "The Love &amp; Death actor additionally slipped into a pair of black pants and added a pair of black-rimmed sunglasses while enjoying the fresh air.  The happy couple also paused for a quick photo inside the crowded venue, and Tom lovingly wrapped his warm around Kaley's shoulders to bring her closer to him as they flashed cheerful smiles towards the camera. Cuoco crossed paths with other celebrity guests, such as Friends alum, Courtney Cox, who was effortlessly chic. The pair paused for a memorable picture together, which Kaley also uploaded to the Instagram post. ",
        "Cox slipped into a pair of denim blue jeans which were secured with a thin, Celine black leather belt that contained a gold buckle. She tucked in a white, lace-trimmed tank top along with a white cardigan into the waist of the pants, and rolled up the sleeves towards her elbows. The Scream star added large, silver-hooped earrings as well as a few dainty necklaces to accessorize her look. Both Courtney and Kaley are on the Honorary Board for the Epidermolysis Bullosa Medical Research Foundation, along with other stars, including Brad Pitt, Jennifer Aniston, Adam Sandler and his wife, Jackie. According to the foundation's official website, EB is, 'is a group of genetic disorders characterized by blister formation after minor trauma to the skin,' and can, 'range in severity from mild to the severely disabling and life-threatening diseases of the skin.' ",
        "Brandi Carlile also made an appearance at the event on Saturday as a performer, which Kaley captured in a photo. The Grammy winner dressed to impress wearing cream-colored slacks and a matching blazer, along with a tan-colored blouse underneath. As she sang a few tracks for the guests on a stage, the scenic Pacific Ocean could be seen directly in the background. Cuoco took time for a photo session with an individual suffering from the rare disease, and the two sent smiles for the camera while posing outside once the sun set.  ",
        "In the caption of the star's latest post, she penned to her 7.8 million fans and followers, 'After a 3 year absence, we were finally able to put on another amazing @ebmrf fundraiser this weekend, and what a turn out!' Other attendees at the fundraiser included celebrities such as Tiffany Haddish, Billie Lourd, Cindy Crawford and her husband, Rande Gerber. She also encouraged her followers to take a look at the nonprofit organization, stating that it is, 'time to raise awareness to keep our research afloat so we can overcome EB.' The beauty concluded her message by giving a shout out to Brandi, adding, 'thank you @brandicarlile for lending your incredible voice and heart to our event.' Both Kaley and her boyfriend, Tom, appeared to have enjoyed their date night while simultaneously giving their support to the EB Medical Research Foundation to help find a cure for the disease. ",
        "While at the event, the Meet Cute actress gushed about parenthood and raising her one-month-old daughter, Matilda, with Pelphrey. Their little bundle of joy was welcomed to the world on March 30. When talking about the actor as a father, Kaley, who recently returned to the gym during her post-partum journey, revealed to People, 'I cannot believe how natural he is, how much he loves it.' ",
        "'I mean, when we were in the hospital, he did everything,' she explained to the outlet, adding, 'every diaper, he's the swaddle king. All the nurses said, \"Oh my God, you're the best guy swaddler we've ever seen.\"' Kaley also stated that their baby girl 'looks exactly like' Tom. 'And he has a very distinct voice, so when he talks to her, she's like 360. Her head turns around, and she's like, \"I know that voice.\" It's very sweet.' The actor has also previously discussed watching the actress become a mother and told Access Hollywood last month in April, 'Oh God, it's so cool. She is so good at it.''It's like all the qualities that I love Kaley about times 100. She's so funny and she's so nurturing and easy and playful and loving. I mean, so loving. You know, it's beautiful.'"
    ]
}