{
    "articleURL": "/femail/homes/article-12058257/How-teacher-bought-home-five-cent-deposit-government-shared-equity-scheme.html",
    "content": [
        "Teach buys her first home with a five per cent depositRuby used the NSW government's Shared Equity SchemeA young teacher has revealed the 'unconventional' method she used to buy a three-bedroom home by the beach despite her modest salary and rising interest rates.",
        "Ruby was able to purchase a house in her twenties after saving up a five per cent deposit thanks to the New South Wales' government's Shared Equity Scheme - but she warns there's a 'catch'. The teacher explained the scheme means the government can own up to 30 per cent of your home and it is only available to single parents, first home buyers who are key workers and single people over the age of 50. Regardless, Ruby said she was 'so lucky' to get her foot in the property market after the scheme allowed her to purchase her own home with a $30,000 deposit.  'It's not for everyone, some people would be like 'I don't want the government owning any of my house', but for me it was really a way I could afford to own my own home,' she said. Scroll down for video ",
        "Ruby said she started saving for a house deposit after returning from travelling when international borders shut during the Covid pandemic in 2020.'It's been three years of saving which is crazy because I didn't even have that much money,' she explained. Ruby, who works as a temporary high school teacher in northern New South Wales, said she heard about the state's Shared Equity Scheme at the beginning of this year. ",
        "'I kind of went the unconventional route and I wanted to tell people about this because it made it really possible for me to buy a house,' she said in a TikTok clip. 'Otherwise I wouldn't have been able to buy a house or definitely not in the area that I wanted to buy.'",
        "The NSW Government will contribute a proportion of the purchase price of a property in exchange for an equivalent interest in the property.The contribution is a percentage of the purchase price and the maximum amount is determined by whether it is a new or existing home:new home – up to 40 per centexisting home – up to 30 per centAs long as a participant remains eligible for the initiative, no repayments are required, and no rent or interest will be charged. Participants can also make voluntary payments to progressively increase their ownership share in the property.Participants must buy a home in NSW with the maximum property price determined by the home's location: $950,000 in Sydney and major regional centres (Newcastle &amp; Lake Macquarie, Illawarra, Central Coast and North Coast of NSW), or $600,000 in other regional areas of NSW. Source: nsw.gov.au ",
        "The scheme is a state government initiative to help eligible candidates buy their own home with a minimum two per cent deposit. The government will contribute either a 40 per cent proportion for new homes or 30 per cent for existing homes in exchange for an equivalent interest in the property. Those eligible for the scheme include single parents with dependent children, single people over 50 and first home buyers working as nurses, midwives, paramedics, teachers, early childhood educators or police officers.",
        "'You can chose to eventually pay off the other 30 per cent when you have the funds to do so,' Ruby explained. 'Or if you never end up paying that 30 per cent, when you eventually sell the house you make 70 per cent of any profit and the government takes the other 30.' ",
        "Ruby said she had saved $30,000 which accounts for around five per cent of what she bought her home for. 'You can put more than the two per cent. They recommend using more of your savings because then you own more of your house so I think I own about 75 per cent of the house,' she said. 'I ended up buying a three bedroom unit - it's not really a unit its more like a townhouse, it has a backyard, it's really cute...and it's one street back from the beach.'She said while the coastal suburb she bought in is expensive, it was much more affordable than Sydney or Byron Bay. Those eligible for the scheme can buy a home in New South Wales for up to $950,000 in Sydney and major regional centres or $600,000 in other regional areas.Candidates don't have to pay repayments, rent or interest to the government as long as they are eligible and can opt to make voluntary payments to increase their owner ship in the shared property. ",
        "VIC: Victorian Homebuyer FundIf you have a 5 per cent deposit, the Victorian Government could contribute up to 25 per cent of the purchase price in exchange for an equivalent share in the property.Participants are required to buy back the government's share in their property over time through refinancing, using savings, or upon sale of the property. The Victorian Government does not charge interest on its investment in participants' homes, but shares in any capital gains or losses proportionate to its share in the property. Eligibile candidates need to earn $128,000 or less per annum for individuals, or $204,800 or less per annum for joint applicants.They need to occupy the purchased property as their principal place of residence and have saved the required minimum deposit of the property price.Source: Victoria State GovernmentWA: Opening Doors' Shared Home Ownership initiativeUnder this unique initiative, the State Government (through the Department of Communities) acts as a silent partner, co-owning the home with you.We fund up to 30 per cent of the purchase price, which means you only need a loan for the remaining share, so your mortgage repayments will be lower.In most cases, you will have the opportunity to increase your share in your home when you can afford to do so.Eligible candidates include singles earning up to $70,000 per year and couples and families with a combined annual income of up to $90,000. Source: Opening Doors WAQLD: Pathways Shared Equity LoanIf you're a tenant in government-owned housing but can't afford to buy the home you're renting, this loan lets you enter into a partnership with us to buy a share of your home.The home must be the one you're currently renting and available for purchase.The loan repayments are no more than 35 per cent of your income and you don't pay rent on the department's share of the home.However, you're responsible for paying council rates, maintenance costs and home insurance.Over time, you may decide to buy more shares in the partnership and become a full home owner.Source: Queensland GovernmentSA: Shared Equity OptionThe Shared Equity Option is a secondary loan, taken out with a primary HomeStart loan. You can borrow up to 25 per cent of the purchase price or property valuation, whichever is lower. The Shared Equity Option cannot be greater than your primary loan and is capped at a maximum of $200,000. To be eligible for the Shared Equity Option you will need to meet the requirements of a HomeStart primary loan and buy an established property or build a home for you to live in. You can make voluntary repayments of $10,000 or more to the Shared Equity Option, on top of the minimum repayments to your primary loan, at any time.Source: HomeStart "
    ]
}