{
    "articleURL": "/debate/article-12054815/DAN-HODGES-nightmare-looming-Starmer-marionette-PM-dancing-maniacal-jig.html",
    "content": [
        "Addressing his jubilant supporters in the Kent district of Medway – which had just elected a Labour council for the first time in 20 years – Sir Keir Starmer crowed: ‘We are on course for a Labour majority at the next General Election!’",
        "They’re not. A rigorous analysis of the numbers suggests Britain is actually heading for a hung Parliament. And catastrophe.Be clear, Thursday’s results were a disaster for the Conservatives. As the polls narrowed over the past few weeks, Tory MPs began to convince themselves there was a chance they could turn their political fortunes around and pull off a stunning electoral comeback.Now those hopes have been shattered. Darlington. Tamworth. Windsor. Dover. The Red Wall, Blue Wall and just about everything in between is crumbling.It’s not hard to see why.The Prime Minister has promised delivery. No 10’s mantra is ‘Rishi identifies a problem, he focuses on it, then he fixes it’. But in the days leading up to the local elections, the struggles faced by most voters seemed all too familiar. Nurses’ strikes. Spiralling food inflation. Five hundred and thirty-five new small boat arrivals.",
        "There was another stark revelation for embattled Tory councillors and MPs. Rishi Sunak isn’t the asset on the doorsteps they hoped he would be, or need him to be.Last week, in Stockton-on-Tees – just half a mile from the factory where engineering workers in hard-hats unveiled their iconic ‘We Love Boris’ election placard – I chatted to a man who used to run a local market stall.",
        "‘Sunak doesn’t have Boris’s personality,’ he told me. ‘He can’t connect in the same way. People round here knew Boris had his faults, but at least they felt they knew him.’Labour’s ruthless attack machine was effective at exploiting this disconnect. In the final few weeks of the campaign, it dropped its disgusting attempt to claim the Prime Minister was soft on paedophiles and began to paint him as being ‘out of touch’ instead. And the strategy worked.From the industrial North East to the market towns of the South East, the message was the same: Sunak is rich. His wife is rich. They don’t understand the lives of working men and women.Against this backdrop, Labour should be surging towards a 1997-style landslide. But something is holding the party back. And that something is Sir Keir Starmer.",
        "Outside a polling booth in Stevenage, I asked Francis Taylor if she was aware she represented the key demographic – Stevenage Woman – that Starmer believes he must capture if he’s to secure a majority. ‘Well, then he’s going to have to work on it a little bit more,’ she told me laughing. ‘He’s not consistent enough. He’s always confronting the Tories on their policies, but he’s not telling us what he’d do that’s any different.’",
        "It’s a view that again is echoed across the country. People are trying to give Labour’s leader a hearing. But all they’re currently receiving in response is a vague commitment to not be another Jeremy Corbyn.Which is in turn opening the door to the real Jeremy Corbyn. Or at least, the 20 to 30 of his allies currently lurking on the Labour backbenches. Looking at last week’s results – 48 lost Tory councils, and more than 1,000 defeated councillors – it is almost impossible to see how Sunak can transform his party’s fortunes to the point where it can win an overall majority in just over a year’s time.And any outcome that leaves the Conservatives short of a majority effectively hands the keys of Downing Street to Sir Keir Starmer.But it’s becoming equally difficult to see how Starmer advances from here to secure his own majority.A significant number of Tory supporters sat on their hands on Thursday.History tells us that oppositions traditionally over-perform in local elections – where people feel emboldened to express a protest – then fall back at the subsequent General Election.And though Labour is triumphant, its gain of around 550 seats was well short of the benchmark of 700 psephologists had identified as the minimum required to enable it to be confident of even being the largest party in a future House of Commons.",
        "Which means a hung Parliament, or a Parliament in which Sir Keir only secures a slender majority, is the nightmare scenario now facing the nation. In that instance, the balance of power would fall instantly into the hands of the Nat Pack – an unholy alliance of SNP MPs and vengeful Corbynites.‘A Labour minority government in a hung Parliament would be a good result,’ leading Corbynite commentator Owen Jones claimed, as the full implications of the result became apparent.‘It’s increasingly clear that the SNP can hold the balance of power after the next Election – putting Scotland in prime position to pull the strings of a minority UK government,’ boasted Stephen Flynn, the SNP leader at Westminster.He’s right. In a hung Parliament, Prime Minister Starmer would become nothing more than a marionette, dancing a maniacal jig to whatever radical tune the Nationalists and Corbynites opted to play.",
        "Some on the liberal Left claim that at that moment the Lib Dems would ride to the country’s rescue. Indeed, many positively relish the prospect of finally securing their longed-for Progressive Realignment. But it’s hard to see how a new Lib-Lab pact would be sustainable. The Lib Dems are still suffering post-traumatic stress disorder from their stint in coalition from 2010 to 2015. They have already ruled out a formal coalition. And they are not going to align themselves with a single contentious policy that would risk a repeat of the tuition fees fiasco.",
        "So which pet Lib Dem policy would be the price for propping up Prime Minister Starmer and his administration day-to-day? £30 billion for a universal basic income? The abolition of mandatory prison sentences for possession of acid and knives? Or the real prize – their pledge to ‘work to create the conditions through which the UK is able to join the EU once again’.Over the past few years, the British people have found themselves lashed to the lead car of a political and economic rollercoaster. The parliamentary Brexit paralysis. Covid. The cost-of-living catastrophe. Industrial chaos. Putin’s nuclear adventurism. The Truss fiasco. The small boats crisis. And they want it to stop.Labour. Tory. They don’t care who delivers it.They crave stability. A respite from the chaos and uncertainty that seems to have become our natural national state.But based on Thursday’s results, they aren’t going to get it.‘We’re on course for a Labour majority!’ Sir Keir Starmer proclaimed. No. After these results, what Britain is actually heading towards is political anarchy."
    ]
}