{
    "articleURL": "/wires/ap/article-12039051/GOPs-Youngkin-says-no-presidential-campaign--now.html",
    "content": [
        "RICHMOND, Va. (AP) - Asked whether he´s going to be campaigning for president this year, Virginia Gov. Glenn Youngkin said no.",
        "But what about beyond that? That part remains unclear.Specifically, Youngkin was asked Monday at a conference where he was speaking in California if he would be \"getting out on the presidential campaign trail\" in 2023.\"No,\" the governor said. \"I´m going to be working in Virginia this year.\"Speculation about a presidential run has followed the former private equity executive ever since his 2021 election, which made him the first Republican elected to lead blue-trending Virginia in over a decade. But Youngkin has long redirected those those questions, focusing instead on next November's legislative elections, when all 140 state General Assembly seats will be on the ballot.Dave Rexrode, chairman of Youngkin´s Spirit of Virginia political action committee, said the governor's remarks on Monday were no different.",
        "\"Nothing has changed. He is focused on Virginia´s 2023 elections - that is his priority. He will be campaigning across the commonwealth this year to build a majority,\" Rexrode said.No, Youngkin and his political advisers have not publicly ruled out a presidential campaign in 2024. But they're pointing to the opportunity that Virginia elections this year provide for him to showcase a different kind of Republican politics that proved successful in a state where Democrat Joe Biden defeated Donald Trump in 2020.",
        "A person familiar with Youngkin´s political operation but not authorized to speak publicly by name said some media coverage suggesting Youngkin had ruled out a campaign was an overreaction. And the governor´s answer came in response to a question specifically about 2023 - not 2024.In an interview on Fox Business on Tuesday, Youngkin again gave a middling answer, saying, \"What I´ve been very clear with from the very beginning is how humbling it is for my name to be in this, this circle,\" of potential White House candidates. He said he wants to \"demonstrate that conservative commonsense leadership can in fact win in a purple state.\"Strategists have said that being a Republican who can win in Democrat-favored areas could set Youngkin apart from other GOP contenders like Trump, who is running again, or Florida Gov. Ron DeSantis, who is expected to enter the presidential race soon. DeSantis' election strength has thus far been tested only in his Republican-favored Florida, while Trump lost the 2020 national election and endorsed a string of 2022 candidates who lost their midterm races.Youngkin, who cannot seek a second consecutive term as governor, theoretically could run for president in 2024 once Virginia´s 2023 elections are over, but the ability for any candidate to put together a successful campaign later this year or early next year would be extremely difficult. That's true even for a candidate like Youngkin, who has dabbled in cross-country campaigning and can tap into his own personal fortune and lists of wealthy donors.",
        "There is no filing deadline for Republican candidates to win support in Iowa´s caucuses, the first-in-the-nation contest set for early February, but candidates typically need to start this year to secure support. Trump, who announced his campaign in late 2022, is using data from past campaigns to lock in his most loyal supporters - an obstacle for later entrants.A late campaign entry would also mean missing the first Republican primary debates, scheduled to start in August, and delaying the complex and time-consuming process to organize and woo delegates around the country who will actually choose the nominee at the GOP convention in July 2024.Top Republican operatives who worked on Youngkin´s 2021 campaign are already working on a potential rival's 2024 presidential race, having signed on for a super PAC urging DeSantis to run.On the other hand, Youngkin campaigned across the country in 2022, handing out red fleece vests to candidates that matched the one he donned in his own race - a softer, fuzzier incarnation of Trump´s distinctive Make America Great Again hats.He´s ramped up his campaign-style activities again lately, with frequent appearances on cable news, fundraising trips to Palm Beach, New York City and Dallas, high-profile speaking engagements, and an international trade mission to Taiwan amid heightened tensions between the U.S. and China, along with stops in Japan and South Korea.",
        "He raised $2.75 million over a few weeks for his Spirit of Virginia PAC, in addition to a $1 million check from billionaire Thomas Peterffy on April 20. The check came days after Peterffy told The Financial Times he was pausing his financial support for DeSantis because of his conservative stances \"on abortion and book banning.\"Peterffy attended an April 14 fundraising lunch in Palm Beach for Youngkin, which the governor followed with another fundraising event in Dallas on April 19. The next day, he spoke at the George W. Bush Presidential Center in Texas and an event back in Virginia for the conservative Heritage Foundation, and he is expected to make more trips around the country this year.He will likely be asked again about running for president, especially after his answer to a follow-up question on Monday in California, when the interviewer, The Wall Street Journal´s editor-at-large Gerard Baker, asked: \"So in the words of LBJ, you will not seek, and if nominated, you will not serve and accept the Republican nomination for president of the United States?\"Youngkin laughed and said, \"We´ll leave that one to LBJ.\"___Price reported from New York. Associated Press writer Thomas Beaumont in Des Moines, Iowa, contributed to this report."
    ]
}