{
    "articleURL": "/femail/article-12047009/Maria-Menounos-44-fights-tears-Today-interview-recalling-cancer-diagnosis.html",
    "content": [
        "Ex E! News host Maria has given an emotional interview about her health battleThe entertainment journalist, 44, was diagnosed with stage 2 pancreatic cancerFighting tears, she recalled telling the doctor: 'So I'm a goner'Entertainment journalist Maria Menounos has given an emotional interview while sharing more details of her secret battle with stage-two pancreatic cancer after learning she was expecting her first child via surrogate.",
        "The 44-year-old, who worked previously for E! News and Extra, told Today she knew something was seriously wrong when she got her scan results.She said the radiologist was going through the list of results and she was feeling relief as he neared the end of it, but then things took a terrible turn.'And he was like, \"Oh,\" and the mass kept persisting in every image, and goes: \"You need to go to the hospital right away.\" He's like white as a ghost and he's shaking,' Menounos, who is married to TV writer Keven Undergaro, said.",
        "'My eyes started to well and I just looked at him... \"Oh so I'm a goner\"... I kind of just go to jokes fast, but it's not like a good joke.'As her voice broke with emotion and she held back tears, Menounos continued: 'And all that kept flashing through my head was my baby. And I was like, \"Oh my God, I can't believe this is going to happen to me.\"'Because when it's on your pancreas, you know you're not going to be okay.'Sniffling as she recalled the story, Menounos said she tried to hold it together by trying to 'console' the radiologist. After her doctors confirmed that the mass was a cause for concern, the next morning Menounos remembers she hadn't really had a chance to process the news.",
        "'I remember waking up the next morning and I hadn't really cried, but I just started guttural crying because I'm like: \"How could God finally bless me with a baby after 10 years, and now I'm not going to get to meet her?\"' she said.'And so Keven's devastated, I'm devastated, we can't tell anybody. I can't tell my dad, how much more can that man take?'Menounos added: 'The more I thought about it, I was like, this doesn't make sense, this doesn't make sense. And then I realized, it doesn't make sense, and that's when I shifted and said, \"I don't know anything, so why am I going to predict the worst? Why am I going to be thinking the worst?\"'",
        "The entertainment reporter first revealed her diagnosis back in January, and eventually underwent surgery to remove a 3.9cm (1.5in) tumor from her pancreas along with her spleen, a fibroid tumor and 17 lymph nodes.Luckily, the star's cancer was caught early enough to keep her from undergoing further treatment such as chemotherapy or radiation.She told PEOPLE this week that the health scare made her fall into despair and she initially feared she wouldn't live long enough to meet her baby daughter.'When you are met with a [potential] death sentence everything changes,' she explained.",
        "Upon learning of her diagnosis, Menounos said that she began to prepare for the worst.It had also come just before she and Undergaro planned to reveal their pregnancy news.Undergaro helped Menounos get through her first bout of cancer in 2017 after doctors discovered a benign brain tumor, that was later removed.But this go around, she admitted that both of them were 'really scared' about the outcome.",
        "Menounos announced in February that she and her husband were expecting their first child via surrogate.'We are so overwhelmed by all the messages of love and joy we have received in the last 24 hours. It's been a long process, with a lot of ups and downs along the way,' she wrote, in part, in an Instagram post on February 8, alongside a photo that showed the excited parents holding up a baby onesie and a sign that read: 'We are having a baby!'Upon the heartbreaking health news, the journalist, television presenter and actress said she sat down with her husband and began listing the wishes she had for her child if she wasn't going to be around to see them through.The Massachusetts native admitted that she and Undergaro 'talked about it all' and 'imagined the worst,' telling him, '\"If something happens, here are the people I want her around and what I want you to do. You'll probably have to move back East to be with my dad so that she has him.\"'",
        "While being devastated by the news of the cancer diagnosis, Menounos maintains she stopped short of asking 'Why me?'",
        "She then recalled the time when her late mother was sick after a brain cancer diagnosis and her father did in fact ask that same question.'My dad would say \"Why us?\" And I'd go \"Dad, why not us?\"' she said of her mother's sickness that ultimately led to her passing away in 2021. 'I'm not saying \"Why me?\" because I know it's \"Why everybody?\"' she added.But in the wake of all her fears and ultimate despair, Menounos has replaced those thoughts and feelings with a healthy dose of gratitude in having a clean bill of health since surgery.And in those three months, Menounos has found the strength to incorporate her meditation practice with all the new things she has learned from her work with her Heal Squad podcast.Plus, she's added some new healing habits into her routine so she can maintain a healthy body, mind and spirit into motherhood and beyond.'I talk to my pancreas every day, I talk to all of my body organs and say \"I really love you. Thank you for handling everything,\"' she said of one of her new techniques. ",
        "The former Access Hollywood correspondent and co-host also likes to talk to her unborn child by sending voice recordings to her surrogate, who in turn plays them near her belly.",
        "'I talk to her all the time. She kicks and moves around like crazy every time,' she said of the other new practice in her life, adding, 'I'm looking forward to that whole other chapter. I'm excited.'As part of her recovery, Menounos will have to continue to get regular scans of her pancreas for the next five years.The couple's daughter, via the surrogate, is expected to arrive this summer."
    ]
}