{
    "articleURL": "/sport/football/article-12059083/Jose-Mourinho-advanced-negotiations-PSG-manager-summer.html",
    "content": [
        "Jose Mourinho is reportedly in advanced negotiations to take over at PSG  The Portuguese manager could replace Christophe Galtier in Paris this summerReports say he is interested despite his contract at Roma lasting until 2024 Jose Mourinho is reportedly in advanced talks to become the next Paris Saint-Germain manager. ",
        "The Portuguese coach is currently plying his trade at Roma, but there is some uncertainty over his future at the club with negotiations over his existing deal, which is set to expire in 2024, yet to be confirmed. But according to RMC Sport, PSG director Luis Campos has spoken with the two-time Champions League winner's agent about a possible arrival this summer.The Spanish outlet are also stating that negotiations are 'advanced' between Campos and Mourinho's agent Jorge Mendes, while claiming that the Roma coach is also interested in the PSG project.Having joined Roma in 2021, Mourinho lead the club to a European trophy last season after they clinched the Europa Conference League title. Roma currently sit seventh in the league standings, with Mourinho's side having won 17 and lost ten of their 34 matches this season, having also failed to register a win in their last four outings. ",
        "Some disagreements over transfers at the club have also started to materialise with Mourinho demanding the Serie A club bring in three new players as replacements for Tammy Abraham, should the forward leave this summerMail Sport also understands Mourinho would also be open to a sensational return to Chelsea, amid frustrations over a lack of financial backing at Roma. Meanwhile, RMC Sport say that PSG are looking for a new coach to take over from Christophe Galtier and have also been in contact with representatives of Thiago Motta and Julian Nagelsmann. ",
        "Galtier recently denied any wrongdoing after he was alleged to have made a racist comments about several of his players. On the pitch, Paris have struggled to achieve expected targets, crashing out of the Champions League, despite reigning supreme at the top of the Ligue 1 table. They were beaten 3-0 on aggregate by Bayern Munich in the last-16 of the tournament, in what was a disappointing and underwhelming end to their European cup run this season.After stuttering several times this season, the club were crowned French champions, albeit in muted conditions, after they drew 1-1 against second placed side Lens back in April. Concerns are also mounting over the morale of some of their key players, with Mail Sport reporting in February that senior squad members are unhappy with how the club's transfer business. Things have been bubbling away at the club for some time, with reports last October suggesting Kylian Mbappe was 'at the centre of a PSG squad split', while more recently the World Cup winner took aim at the club on Instagram for using his image without his consent. Meanwhile the club are set for a big rebuild, with concerns now mounting over Lionel Messi's future at the club, with the seven-time Ballon d'Or winner being linked with a move to Saudi Arabia. ",
        "The club suspended him last week after he took an un-authorised visit to the Middle East.  Meanwhile, there is some good news after reports Sergio Ramos 'wants to stay at PSG' despite being linked with a move to Saudi Arabia. The arrival of a figure of Mourinho's stature could help the club to keep some of their bigger stars, as well as attract more talents to the Parc des Princes. Having spent time throughout some of Europe's top divisions, notably managing Real Madrid, Inter Milan, Manchester United and Tottenham, the 60-year-old is yet to manage in France, but certainly possess the experience, having won two Champions League titles to help the Parisians secure a European trophy.    "
    ]
}