{
    "articleURL": "/wires/reuters/article-12061191/Nuggets-C-Nikola-Jokic-fined-not-suspended-sideline-incident.html",
    "content": [
        "Denver Nuggets center Nikola Jokic was fined $25,000 by the NBA on Monday but will not be subject to a suspension after an on-court run-in with Phoenix Suns owner Mat Ishbia during Game 4 of the Western Conference semifinals.",
        "NBA head of basketball operations Joe Dumars said in a statement that the fine was \"for making improper conduct with a spectator sitting courtside.\"Following the incident Sunday, Ishbia made a plea Monday for Jokic not to be suspended.Jokic was assessed a technical foul in the second quarter at Phoenix after making contact with Ishbia.After Jokic blocked Deandre Ayton's layup attempt, Suns guard Josh Okogie and Nuggets guard Jamal Murray scrambled for the loose ball, with Okogie -- and the ball -- flying into the first row of seats, close to where Ishbia was sitting.Ishbia ended up with the ball, and Jokic came over to try and strip it from him. Jokic was somewhat successful in his attempt, but as he was prying the ball loose, the Suns owner seemed to swat it, prompting the two-time MVP to push Ishbia aside.The gesture sent Ishbia back into his seat, where he flailed his arms up into the air as fans in the surrounding area reacted with shock.\"Great win for the Suns last night in an amazing series so far! That should be and is the only story,\" Ishbia tweeted Monday. \"Suspending or fining anyone over last nights incident would not be right. I have alot of respect for Jokic and don't want to see anything like that. Excited for game 5! Go Suns!\"",
        "The Suns tied the best-of-seven series at 2-2 with a 129-124 win despite a monster game from Jokic, who finished with 53 points and 11 assists.\"The fan put the hand on me first,\" Jokic said after the game. \"I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is a fan. Isn't he?\"Game 5 is set for Tuesday night in Denver.--Field Level Media"
    ]
}