{
    "articleURL": "/news/article-12051775/Father-suffers-Day-Triffids-nightmare-Japanese-knotweed-spread-Network-Rail.html",
    "content": [
        "Chris Leah, 45, has Stockport home with 'Network Rail's' Japanese knotweedREAD MORE: Lawyer predicts £10million payout to Japanese knotweed victimsFather-of-two Chris Leah is plagued by nightmares — and it's all because of Network Rail.",
        "The 45-year-old homeowner from Stockport, Cheshire, has been suffering from garish dreams about Day Of The Triffids ever since his beloved garden was overrun by 14-ft high Japanese knotweed. Me Leah and his wife chose their dream home because of its garden but he has already had to fence off a 10ft by 40ft patch to try and stop the plant spreading from Network Rail's land into his own.The credit controller is even too scared to go on holiday in case Britain's most invasive species, which can grow up to eight inches a day, encroaches further into his garden from the railway embankment and destroys his land. He told MailOnline: 'I bought this house because of the large garden but I am losing it bit by bit.",
        "'It is spoiling the dream home my wife and I thought would be forever. 'I wanted a summerhouse down there and maybe a shed but I can't because of this.   'This is diminishing the value of my home. I cannot move without admitting to the new owners there is a knotweed problem.'I have been to the solicitors and they are now on the case because this has cost me a lot of time and effort and I haven't got anywhere.'I have consulted knotweed experts and they say treatment over three to five years would cost £3,000 to £5,000 while excavation at over £10,000 is probably the better option.",
        "'I just want this sorting out once and for all.'",
        "The weed grows along the embankment at the back of Mr Leah and his neighbours' homes for around 120 yards by the railway line.Japanese knotweed was brought to Britain by the Victorians as an ornamental garden plant and to line railway tracks to stabilise the soil. Yet as it has no natural enemies in the UK, whereas in Asia it is controlled by fungus and insects, it has spread uncontrollably.The weed strangles other plants and can kill entire gardens.   Mr Leah's neighbours said one home was sold at a £15,000 discount because of the problem.The 45-year-old said the 'massive problem' started when his lawn mower broke and he didn't cut the grass for a few weeks.He said: 'I noticed all these sprigs of something springing up everywhere and my neighbour said, ''That's Japanese knotweed, you'd better do something about it''.'And I did. I tried everything including cutting and burning it but it keeps coming back because it needs a proper programme to eradicate it all.'I have no control over my own garden. There is no quick fix. 'I can't allow my dog into the fenced off section for fear it will spread it on his paws and we can sit down there to enjoy the late evening sun because the area is an eyesore. ",
        "'It is a really stressful situation but Network Rail don't seem to be doing anything about it. ",
        "'They keep telling me they have got it under control but I have never seen anyone around here treating it and I have worked from home since Covid.'They once sent someone round to treat it when I first complained but it was winter and I told them they were wasting their time because it has to be treated between April and September when it is active.'The plants at the back of my fence on Network Rail land are now over 14-ft high so that doesn't look like anyone is treating them.Mr Leah said the Japanese knotweed shoots grow underground and take over the earth at a 'fantastic rate'.He said they would 'wreak havoc on anything that gets in its way including bricks, metal and tarmac'.He added: 'You can only treat what you can see but to do it properly would probably involve digging a couple of metres down and hoping you get all of it out.",
        "'That would cost well over £10,000 and if you miss a bit the whole problem starts over again .'It's is getting me depressed and I can think of little else. It is like the Day Of The Triffids.'",
        "Japanese Knotweed is a species of plant that has bamboo-like stems and small white flowers.Native to Japan, it is considered an invasive species.The plant, scientific name Fallopia japonica, was brought to Britain by the Victorians as an ornamental garden plant and to line railway tracks to stabilise the soil.It has no natural enemies in the UK, whereas in Asia it is controlled by fungus and insects.It is incredibly durable and fast-growing and can seriously damage buildings and construction sites if left unchecked.The weed strangles other plants and can kill entire gardens.Capable of growing eight inches in one day, it deprives other plants of their key nutrients and water.",
        "Earlier this year MailOnline revealed that councils and Network Rail could be forced to pay up to £10million as hundreds of homeowners launch legal action after a landmark Japanese knotweed ruling.Mr Leah is one of the hundreds taking Network Rail to court over Japanese Knotweed.  Samantha Towle, director at JMP Solicitors, who are representing Mr Leah, said: 'For some owners, the only solution available is to commence legal proceedings to obtain the necessary insurance-backed guarantees for mortgage lenders and the diminished property value.'His neighbours also fear their gardens could be overrun and are consulting lawyers to try have the plant eradicated from the back of their homes. ",
        "Mother-of-one Pauline Byast, 57, said she and partner Mike Whittaker spent thousands of pounds trying to eliminate the plant after it spread into their land.She said: 'We got two massive diggers in and dug metres down but it has not solved it.'We cannot do anything while it is there. There is no use building an extension if it is going to be overrun by knotweed.'Priya Chohan, 29, lives a few doors away. She told MailOnline: 'Legally you are now unable to sell your home without telling a buyer that you have knotweed in your garden.'Network Rail keeps saying they are dealing with it but you know it is not true. 'You would think a big organisation like that would do the right thing.'MailOnline has contacted Network Rail for comment."
    ]
}