{
    "articleURL": "/wires/pa/article-12048893/Schools-increasingly-struggling-recruit-teachers.html",
    "content": [
        "Schools are struggling to recruit teachers, with tens of thousands of vacancies being advertised, according to new research.",
        "The Recruitment and Employment Confederation (REC) said issues over pay were not being addressed.Teachers are embroiled in a dispute over pay which has led to a series of strikes. Teachers face a double whammy because their pay has stagnated, but they are also losing classroom help, such as teaching assistants and new technology, because of a squeeze on school budgets  Neil Carberry, REC  REC chief executive Neil Carberry said: “Schools are increasingly struggling to recruit this year with more than 46,500 job adverts.“This is after the double-digit percentage rise in education vacancies we reported last month. This happens when employers fail to address pay and people’s experience at work.“Teachers face a double whammy because their pay has stagnated, but they are also losing classroom help, such as teaching assistants and new technology, because of a squeeze on school budgets.”",
        "REC reported that demand for workers remained “steady”, with almost 1.7 million job adverts across the UK. We have a shocking recruitment and retention crisis in education right now, and the Government is doing nothing to tackle it  Paul Whiteman, NAHT  There were 189,832 new job postings in the week of April 17 to 23, almost a third higher compared to the week before, as firms returned to hiring after the Easter break.",
        "Paul Whiteman, general secretary of school leaders’ union NAHT, said: “We have a shocking recruitment and retention crisis in education right now, and the Government is doing nothing to tackle it.“We have been sounding the warning for years, and now have been driven to balloting our members for strike action over it.“The crisis is being driven by eroded teacher pay, unmanageable workload levels and scant regard for well-being.” We want to continue bringing great people into teaching and have introduced bursaries worth up to £27,000 tax-free and scholarships worth up to £29,000 tax-free to attract talented trainees in subjects such as mathematics, physics, chemistry and computing  Department for Education  A Department for Education spokesperson said: “Since 2010 we’ve increased the number of teachers working in state-funded schools by 24,000, now totalling more than 465,000. Almost nine in 10 teachers who qualified in 2020 were still teaching one year after qualification, and just over two-thirds of teachers who started teaching five years ago are still teaching.“We want to continue bringing great people into teaching and have introduced bursaries worth up to £27,000 tax-free and scholarships worth up to £29,000 tax-free to attract talented trainees in subjects such as mathematics, physics, chemistry and computing.“We have made a fair and reasonable teacher pay offer to the unions, which recognises teachers’ hard work and commitment as well as delivering an additional £2 billion in funding for schools, which they asked for.”"
    ]
}