{
    "articleURL": "/news/article-12040029/Chinese-cars-three-spots-Australias-April-2023-10-bestseller-list-time-ever.html",
    "content": [
        "Chinese car sales surged 68.5 per cent in yearTesla equalled Toyota for top 10 spots in April Chinese-made cars now occupy three spots in Australia's top 10 list of bestsellers - with Tesla equalling Toyota for the number of most popular models for the first time ever. ",
        "Sales of cars made in China surged by 68.5 per cent compared with a year earlier.The rising popularity of electric cars last month saw the Tesla Model Y and Tesla Model 3 take out the fourth and tenth spots, respectively, as the MG ZS claimed the ninth position, Federal Chamber of Automotive Industries data showed.China's three spots in the monthly top 10 was equal to Thailand's three positions, and more than the two spots each for Japan and South Korea.",
        "1. FORD RANGER: 3,567 sales (made in Thailand)2. TOYOTA HILUX: 3,526 sales (made in Thailand)3. TOYOTA RAV4:  2,198 sales (made in Japan)4. TESLA MODEL Y: 2,095 sales (made in China)5. HYUNDAI I30:  2,029 sales (made in South Korea)6. MITSUBISHI OUTLANDER: 1,829 sales (made in Japan)7.  ISUZU D-MAX: 1,809 sales (made in Thailand)8. HYUNDAI TUCSON: 1,678 sales (made in South Korea)9. MG ZS: 1,588 sales (made in China)10. TESLA MODEL 3: 1,581 sales (made in China)Source: Federal Chamber of Automotive Industries ",
        "This is occurring as more Australians buy electric vehicles, with China making the most popular Teslas sold in Australia along with an EV version of the MG ZS and BYDs.When it came to car brands, Chinese-made cars took out two places in the top 10, with Tesla in seventh place with 3,676 sold last month, including 2,095 for the Model Y, priced from $68,900, and 1,581 for the Model 3, selling from $60,900.",
        "Toyota was Australia's No.1 brand but only had two cars in the top 10 - including the Toyota HiLux in second spot and the RAV4 in fourth place.For the time ever, Toyota had the same number of cars in the top 10 as Tesla. MG was Australia's eighth most popular brand with 3,463 sales in April, including 1,588 for the MG ZS.Year-to-date sales of cars from China, covering the first four months of 2023, were 68.5 per cent higher than the same period in 2022 with 13,426 sold in April.That meant 16 per cent of Australia's 82,137 new cars sold last month came from China.Japan was still the biggest source of vehicles with 22,304 sold in April, ahead of Thailand, where 15,886 cars leaving the showroom were made.But China was third, ahead of South Korea, the source of 12,952 cars sold last month.Electric cars had an 8 per cent market share in April but when petrol-electric hybrids and plug-in hybrids were included, that rose to 15.4 per cent. FCAI chief executive Tony Weber said half of Australia's most popular cars were available with an electric engine of some sort.",
        "'It is worth noting that five out of the top 10 models sold in April offer some form of electrification,' he said.",
        "Australia's perennial market leader Toyota doesn't have any fully-electric cars, but offers the Mirai, a hydrogen-fuelled car, and hybrid versions of the Prius, RAV4, Camry, Corolla and Yaris.Utes still dominate the sales charts, with the Australian designed but Thai-built Ford Ranger in the top spot for the second month running with 3,567 sales, ahead of the Toyota HiLux on 3,526 sales."
    ]
}