{
    "articleURL": "/wires/aap/article-12044643/No-bitterness-Seibolds-Brisbane-NRL-return.html",
    "content": [
        "Anthony Seibold insists there's no lingering bitterness as he prepares to coach in Brisbane against his former club for the first time since a messy Broncos divorce.",
        "Seibold's Manly will take on the ladder-leading Broncos on Friday at a sold-out Suncorp Stadium as part of the NRL's Magic Round.It's a fitting setting for the occasion and Seibold can appreciate the theatre after his chaotic exit midway through the 2020 season.A preliminary finalist with South Sydney in 2018, Siebold beat current coach Kevin Walters in the race to replace Wayne Bennett at Red Hill.Seibold was regularly the target of criticism from Broncos old boys and eventually replaced 18 months into a five-year deal by Walters, who took over fresh off a 2020 wooden-spoon season.After his exit, Seibold claimed he'd been unfairly treated and that agendas had contributed to a demise he feared would cost him another chance in the NRL.But three years on - with a cameo as Eddie Jones' defensive coach for England's rugby union team - he's back with the sixth-placed Sea Eagles.Seibold's Manly players have indicated the spicy subplot will serve as motivation for them on Friday night, even if the man himself says he's moved on.\"I come back to Queensland not with a bitter taste in my mouth, but with a real positivity, real growth as a person and coach,\" Seibold said.\"It's been a narrow focus this week on looking forward rather than looking back.\"",
        "Seibold assisted Jones to a win over the Wallabies in Brisbane last year and said his time in rugby had helped him move on from the Red Hill nightmare.\"Eddie's one of the elite coaches in world sport ... outstanding experience and I certainly feel it helped me grow as a person, as a coach,\" he said.\"In a different country, different code and since then really enjoyed my time back in Manly.\"Everyone ... I'm sure has had some ups and downs in their career.\"Unless you go through those challenges you might not be necessarily in this position.\"Seibold has observed two obvious factors behind the Broncos' 7-2 season start.\"They had 60 put on them by Melbourne Storm last year,\" he said.\"Defensively they've improved so much this year and Reece Walsh has added to their attack.\"Payne Haas and Ezra Mam return from suspensions to a Brisbane team humbled by South Sydney last weekend, while Tom Trbojevic will play for Manly but not his brother Jake (calf).\"Tom trained fully on Tuesday evening,\" Seibold said.\"He's in and he's a big in.\"Seibold also defended under-fire playmaker Josh Shuster, who has been sidelined in a \"collaborative decision\" to recover from a quad injury and improve his general fitness.",
        "\"I have been checking in on him because I feel as though there's been a lot of commentary around him at the moment which paints him in a negative light, when that's not the case,\" Seibold said."
    ]
}