{
    "articleURL": "/wires/reuters/article-12043505/Titans-Ryan-Tannehill-Another-year-rookie-QB.html",
    "content": [
        "Ryan Tannehill tackles challenges one day at a time, and the Tennessee Titans' starter plans to face the latest addition to the quarterback room just as he did in 2022.",
        "The Titans, under new general manager Ran Carthon, drafted quarterback Will Levis in the second round after selecting Malik Willis in the third round last year.\"We've been down this road before, so it's definitely a little bit of déjà vu,\" Tannehill said Wednesday. \"You can only control what you control. (Coach) Mike (Vrabel) and Ran make those decisions. My job is to go out and try to win football games.\"Tannehill pointed to his 12 years in the NFL, initially as a first-round pick of the Miami Dolphins and since being acquired by the Titans, for context of how rapidly things tend to change in the league.\"I appreciate being the starter. But nothing's given to you in this league,\" he said. \"Things change quickly. Every day, you try to go as a player. You have to progress every day you're given an opportunity.\"Tannehill, 34, was rumored to be on the trade block in March. He's back after Carthon clarified he was keeping Tannehill.The Titans have a new offensive coordinator, Tim Kelly, and plan a system that puts all the pressure on the defense. That would be a dramatic departure from a run-first scheme under fired Todd Downing.\"The whole system is pretty much different,\" Tannehill said.While Tannehill was torched by some last May for saying it wasn't his job to mentor Willis. While Carthon and Vrabel have stated Tannehill is the team's starter, he's also entering the final season of his current contract.",
        "\"My process doesn't really change,\" Tannehill said. \"I like to believe that I'm giving my all every time I go out there and prep, whether it's in an OTAs or Week 15, getting ready to go win a game. You want to have a process about how you go about things, take your job seriously each and every day, knowing that nothing's given to you, and gotta go out there and earn everything. So that process doesn't change.\"--Field Level Media"
    ]
}