{
    "articleURL": "/news/article-12045249/Monash-Council-cancel-drag-queen-story-event-Oakleigh-Library-following-anti-trans-protest.html",
    "content": [
        "Monash Council backflip and cancel 'drag queen storytime'Protesters stormed chambers on Wednesday against eventA council has backflipped on its controversial decision to hold a drag story-time library event for babies and preschool children.",
        "Protesters stormed the Monash Council chambers in Melbourne's southeast on Wednesday night to try to stop the sold-out event featuring drag queen performer Sam T at Oakleigh Library from going ahead.Tensions boiled over as protesters yelled abuse at pro-drag and LGBTIQA+ community supporters, banged on glass walls and screamed 'shame on you' at councillors.Monash CEO Dr Andi Diamond issued a statement on Thursday announcing the decision to cancel the upcoming Drag Storytime event in May.Dr Diamond cited the reason for the cancellation was safety concerns and the threats of violence against councillors, families attending, performers and staff.",
        "'It is incredibly disappointing to have to cancel an event designed to celebrate the International Day Against Homophobia, Biphobia and Transphobia but we were left with no choice after Victoria Police advised Council of the risks associated with holding the event,' Dr Diamond said.'Our drag storytime event was designed to introduce children to diverse role models and encourage acceptance, love, and respect of our LGBTIQA+ community. It is so disappointing that some people have a long way to go before this is achieved.'We understood this was not for everyone and scheduled it outside our regular library programs so that parents planning to bring their children were making a deliberate choice to attend.",
        "'Unfortunately, some in our community were not willing to allow that choice. In the end we were unable to guarantee that we would be able to hold the event safely.'At the demonstration on Wednesday, many protesters held signs while branding councillors 'paedophiles' and calling for them to be sacked.",
        "Mayor Tina Samardzija was forced to briefly suspend the meeting an hour in due to the commotion in the public gallery, which included young children in attendance.Police were deployed to the scene and at one stage were forced to move in separate protesters and pro-drag and LGBTIQA+ supporters.Two councillors were given a police escort from the building. No arrests were made on the night.Prior to the meeting, Councillor Josh Fergeus pleaded with event supporters to stay away and not get embroiled'I cannot state this strongly enough: if you want to support Drag Storytime do NOT attend tonight's meeting of Council. You will increase the risk of violence and disruption. Please stay away, stay safe and at home.'Cr Fergus has since thanked Monash council and library staff for holding firm against the backlash and threats of violence and abuse.Oakleigh Library will host the drag story-time hour for ages 1-6 to mark International Day Against Homophobia, Biphobia and Transphobia on May 19.",
        "Hosted by drag queen performer Sam B as a special guest, the hour-long upcoming event has been hailed as a morning of stories and songs to inspire while spreading a message of equality and appreciation of diversity.The event was sold out almost two months in advance, despite widespread community outrage and an online petition calling for the event to be cancelled.'We feel like we're not being heard … we've inundated them with emails, phone calls, we all get the same cookie cutter responses,' one protestor told 3AW broadcaster Neil Mitchell on Thursday. ",
        "Australian basketball legend Andrew Bogut was among those who have weighed into recent outrage over the event.Monash Council had previously held firm about not cancelling its event stating it was proud in joining other councils across Australia that have held similar successful events.'It's a way to challenge the idea that we're all supposed to look, act and behave in a certain way. It's about accepting and respecting differences using imagination, play, dressing up and reading stories,' Cr Samardzija said'We understand this is not for everyone and have scheduled it outside our regular library programs so that parents who bring their children have made a deliberate choice to attend. 'Clearly there are parents in our community who want this event, as it has booked out very quickly.",
        "'It is disappointing to hear negative comments and allegations being made by some people about an event that promotes inclusion.'"
    ]
}