{
    "articleURL": "/wires/ap/article-12054251/Abortion-pill-legal-challenge-threatens-miscarriage-care.html",
    "content": [
        "Less than a year after losing her daughter Emilia at five days old, Jillian Phillips suffered a miscarriage.",
        "It was Halloween weekend in 2016, and her doctor said she could wait for it to end naturally, have a surgical procedure or take medication. She chose the medicine, passed the remains of her nine-week pregnancy at home and buried them in a memorial garden, near some of Emilia´s ashes.\"Once I found out that the baby inside me was no longer viable, I didn´t want to just walk around carrying the emotional trauma of that,\" said Phillips, a 41-year-old single mother of three from North Brookfield, Mass. \"You just kind of want it finished. And the medication works pretty quickly.\"But the future of this common miscarriage treatment is in peril. The pill, mifepristone, is used in abortions, making it a target.Last month, a federal judge in Texas ruled to block mifepristone's approval by the Food and Drug Administration. The Supreme Court later preserved access to the drug while the lawsuit winds through the courts, a long road that continues with arguments before an appeals court on May 17.Doctors and patients fear mifepristone could be pulled off the market when the legal wrangling ends. Already, they say, a chilling effect keeps some doctors from prescribing it.",
        "A million U.S. women a year suffer miscarriages, which occur in at least 15% of known pregnancies. Mifepristone was approved in 2000 for early abortions but it is often used \"off label\" to treat early pregnancy loss or to speed up delivery when a fetus dies later in pregnancy. These uses are so common that U.S. senators urged manufacturer Danco to apply to the FDA to add miscarriage to the label of its drug, Mifeprex.",
        "Denise Harle, an attorney for the group that filed the Texas lawsuit on behalf of anti-abortion doctors and health care organizations, said they aren't challenging uses of the drug beyond abortion. But legal experts say if it´s taken off the market for its approved use, it wouldn´t be available for pregnancy loss.Dr. Kristyn Brandi said that would take away \"the gold standard of miscarriage management,\" the two-drug combination of mifepristone and misoprostol that helps empty the uterus and reduce the chance of infection.\"I offer it to every single patient whose miscarriage I manage,\" said Brandi, an OB-GYN in Newark, New Jersey. \"There will be a big impact if I am no longer able to use that medication.\"HELP THROUGH THE PAINBrandi said medication speeds up the miscarriage process at a time when women are already suffering physically and emotionally.Most patients naturally pass pregnancy tissue within two weeks of their diagnosis, but it can take several weeks, according to the American College of Obstetricians and Gynecologists. Tissue generally passes within 48 hours when women take the medication, which studies show is about 80%-90% effective.Brandi gives mifepristone to patients in her office. It blocks the hormone progesterone and primes the uterus to respond to the contraction-causing effect of misoprostol, which is taken later at home.",
        "Phillips, a social worker, said the medicine made a horrible situation a little more bearable.At her second ultrasound, doctors couldn´t detect cardiac activity in the fetus. Phillips considered getting a \"dilation and curettage\" procedure, but didn't like that she would need general anesthesia and couldn't take the remains home. Medication seemed a better option.She took mifepristone and wound up needing two doses of misoprostol. \"But the miscarriage itself was not really any more significant than my worst periods,\" she said. \"And I was in the comfort of my home with my family.\"Today, she finds solace in her memorial garden, where small angel figurines are arranged near a tree in her front yard.Myriad Norris, 25, of Lexington, Kentucky, said she was glad mifepristone was available when she had a miscarriage in late March - even though she ended up not needing it.About 12 hours after discovering she was pregnant, Norris started cramping, then bleeding. Worried she could develop an infection, she asked her doctor about mifepristone. She was just over five weeks pregnant, and the tissue passed on its own.Soon news broke about the Texas judge's ruling. Norris, a stay-at-home mom who is active in the group Kentucky for Reproductive Freedom, said it brought \"an additional layer of grief.\"",
        "`CHILLING EFFECT´ AND BACKUP PLANSMifepristone has long been subject to special restrictions, though experts say it´s as safe as the over-the-counter painkiller ibuprofen. For example, the FDA requires it to be dispensed by, or under the supervision of, a certified prescriber.Doctors say the current legal climate is tightening access further.\"It´s kind of creating this chilling effect\" where even though it's still approved and available, doctors \"aren´t going to give it because they´re too worried about whatever ramifications are coming afterward,\" Brandi said.Dr. Sarah Prager, an OB-GYN at the University of Washington School of Medicine, said her health system doesn´t restrict mifepristone, but others in her state do.\"Facilities that don´t want to have anything to do with abortion have chosen not to carry mifepristone on site,\" she said. That includes Catholic facilities, which house a growing percentage of acute care hospital beds.As doctors wait to learn mifepristone's fate, they're making backup plans for miscarriage care.One involves using only misoprostol to manage miscarriages. While it´s safe, research shows it´s not as effective at helping expel pregnancy tissue - which can lead to a dangerous infection if it stays in the uterus. The treatment success rate for miscarriage patients who got misoprostol only was 67%, compared with 84% for those who took the two drugs, a 2018 study in the New England Journal of Medicine found.",
        "That means misoprostol-only patients are more likely to need a follow-up surgical procedure or additional doses. It also leads to \"significantly more discomfort,\" Prager said.\"It really feels like we´re just punishing people by not being able to give them an evidence-based and least-impactful regimen of medication,\" she said.Phillips said patients deserve all the options she had.During a miscarriage, \"you already feel completely traumatized and devastated,\" Phillips said. \"It´s frightening to think that people may be in the same situation that I was and would not be able to get appropriate health care.\"___Associated Press reporter Heather Hollingsworth contributed to this report from Mission, Kansas.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}