{
    "articleURL": "/tvshowbiz/article-12044105/Im-Celeb-South-Africa-Andy-Whyment-fumes-Janice-Dickinson-brands-rude.html",
    "content": [
        "Things are seriously set to get heated between Andy Wyment and Janice Dickinson as a preview for Thursday's I'm A Celeb South Africa teased.",
        "Tensions will bubble over as the Coronation Street actor, 42, hits out for the model, 68, for being 'rude' after she made demands of him in camp.And Andy, who plays lovable Kirk Sutherland in the ITV soap, is far from impressed with Janice's attitude as he fumed about her to his fellow campmates, ranting: 'I'm not your slave!'The preview clip sees Janice say to him: 'Andy, I need a wreath. I need you to make me a wreath out of some leaves.' To which he replies: 'You've picked the wrong person there. I can't make a wreath.' ",
        "Firing back at Andy's comment, Janice then told co-star Myleene Klass: 'He doesn't want to do anything for me. He doesn't even want to have a conversation with me. He hates me.'To which Andy, overhearing their conversation, confronted her before later ranting about Janice for being 'rude'.He told other campmates: 'She is a massive star and I am Andy Whyment, Kirk from Corrie.'But there is no need to be rude to people just telling people to do things for you.'There was no 'please' and no nothing… It's like, Well no, I'm not your slave!' Watching the tense scenes unfold, I'm a Celeb viewers were quick to react, with many calling out Janice for her treatment of Andy. ",
        "'Janice LEAVE andy alone. team andy' commented one.While another shared: 'Who's Janice think she is coming at 'are Kirkehh' like that.'",
        "A third said: 'Andy and Janice are the last two people you'd ever expect to be arguing together. well that's #ImACeleb for ya.''Was not expecting storm Andy,' came the response from a third.'Do NOT upset Andy, Janice!' fumed a fourth.With another adding: 'Janice managed to annoy Andy? ANDY THE HUMAN EMBODIMENT OF PURE JOY? How dare she.'Elsewhere, there were further tensions in camp as Carol Vorderman and Fatima Whitbread moaned about people not pulling their weight in camp. ",
        "After noticing that some of their fellow celebrities were not completing their assigned chores, the two ladies were seen having a moan, with Carol suggesting that the laziness in camp is annoying her. After Fatima was forced to wake Andy to remind him to tend to the fire late at night, Carol had her day, telling her: 'I think we need to remind them what their responsibilities are.'Before the Countdown star went on to fume: 'There are quite a lot of people not pulling their weight', with Fatima agreeing: 'They need guidance.'However, with the ladies expressing their dismay, viewers at home were quick to slam them for moaning about chores, with one even quipping that the 'fun was sucked out of life' with them around.",
        "Elsewhere, the campmates were turned against each other during Wednesday's episode after hosts Anthony McPartlin and Declan Donnelly told them they would 'no longer work as one camp'.  Newcomers Joe, 41, and Dean, 45, were chosen as the leaders of each pride and they took it in turns to pick the campmates they wanted for their group, with Joe choosing first after winning a coin toss.Dramatic scenes then unfolded as Dean sent Myleene Klass and Jordan Banjo from his yellow pride, while Joe sent Georgia Toffolo and Fatima Whitbread from his green team, to face it off in a snakes and ladders themed trial, which had a picnic by the waterfall as a prize.The four competing campmates screamed and jumped their way through trial as they shoved their hands in holes in a bid to get hold of pieces for ladders which would lead them up out of cages and onto the roof where they could hit a buzzer to win the trial.Former Hear'Say singer Myleene was seen screaming and hugging Jordan after they made it to the top, with the two returning to the camp in Kruger National Park to tell the rest of the yellow pride they would be heading off on their picnic.",
        "Joe and Dean were seen arriving in camp during Wednesday's episode after the second half of their gruesome drinking trial aired.",
        "The actors were first seen trying to force disgusting cocktails down their throats in a bid to win treats for the campmates after they were revealed as late arrivals on the show on Tuesday.Both stars struggled to keep the drinks down, with the pair spluttering and projectile vomiting throughout the trial.Dean even entered the camp with vomit down his top while the rest of the campmates gleefully greeted him.Earlier in the show, viewers were in hysterics as they watched the newcomers vomit and splutter gruesome cocktails of animal innards just minutes after arriving on the show on Tuesday.Joe, 41, who won on his first run on the series in 2008 and Dean, 45, who previously appeared on the 2006 series, were tasked with drinking a variety of concoctions to win treats for each existing member of the camp in Kruger National Park.Dean, who played Robbie Jackson on the BBC soap EastEnders from 1993 to 2003, did not fair well with his Bushtucker Trials during his first time in the jungle, when he screamed his way through the challenges, with not much changing this time.And while Joe - who also was also in EastEnders as Mickey Miller from 2003 to 2008 - forced himself through his I'm A Celeb trials and also tried out many more as the host of former ITV2 spin-off show I'm a Celebrity... Extra Camp, he didn't have an easy ride this week either.",
        "The pair were told by hosts Ant McPartlin and Declan Donnelly to stand in front of a table and choose a log to turn over, with Dean first picking the log named 'Helen Fanny-gan', before he was tasked with drinking a glass of blended cow vagina.Before he had even picked up the glass, a bright red Dean was shuddering and screaming.He tipped half the contents of the glass into his mouth, slopping much of it down his top, before attempting to swallow it, with Dean visibly bringing the drink back up into his mouth and spraying it out onto the table despite having his lips tightly closed.Dean proceeded to vomit much of what he had swallowed onto the table as Joe yelled at him to 'drink it like a shot', while signalling for him to quickly tip the glass back, instructing Dean to: 'Bang it!'The screen star gulped the rest of the glass and managed to keep it down, successfully winning a prize of some lemonade for Helen Flanagan.Joe selected the log named 'Phil Tough-hell' and he was given a glass of blended maggots to consume.",
        "Describing it as 'a real thicky' Joe looked repulsed before he picked the glass up and took a gulp before instantly vomiting the grey smoothie back up into the glass, to which Dec observed: 'Oh! It's going back in,' while Dean looked on, crying with laughter, spraying saliva as he was unable to contain his guffaws.",
        "A sweaty Joe eventually managed to down the majority of the drink, winning some wine gums for campmate Phil Tufnell.The pair went on the heave and reach for each of the abundance of specially prepared items, much to the delight of viewers, with many taking to Twitter to comment on the trial.'Dean Gaffney and Joe Swash doing a drinking trial together is something I didn’t know I needed,' wrote one viewer.Someone else shared: 'This is absolute sheer gold from Dean Gaffney,' while another person wrote: 'Loving these two together .. but omg this trial is disgusting.'Noting Dean comforted himself by swaying backwards and forwards, someone commented: 'The level of rocking from Dean Gaffney is SEVERE.'",
        "While another viewer shared: 'Joe Swash and Dean Gaffney doing a trial together is the BEST, we do not deserve this series of #ImACeleb.''Joe Swash and Dean Gaffney doing a drinking trial is everything I was hoping for and more,' wrote another viewer, while someone else shared: 'I would pay to watch @joeswash and @deangaffney1 on a weekly challenge show we are in hysterics watching @imacelebrity.''Joe Swash drinking these drinks is the best TV I’ve seen so far in 2023,' declared another show fan.While someone else noted: 'Joe Swash has expressed more emotions with his face, in 30 seconds, than I have in 52 years.'And another person wrote: 'Dean Gaffney and Joe Swash are literally the best two people that could’ve entered the jungle right now! Creasing!'I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}