{
    "articleURL": "/wires/pa/article-12050725/Town-s-coronation-party-axed-organisers-fail-raise-money-whatsoever.html",
    "content": [
        "A town’s coronation party had to be cancelled after organisers failed to raise any money to cover costs, claiming there was a “lack of interest”.",
        "Caldicot, in south-east Wales, was due to host a celebration in the town centre complete with big screen and children’s entertainment, but with just over a week to go the event was axed.In an online post, Caldicot Town Team said a crowdfunding page had been running for 16 days, but despite being promoted on social media it had “failed to raise any money whatsoever”.The team said it had approached Monmouthshire County Council and other partners but were still unable to gather the funds needed for the event, which was expected to cost between £2,500 and  £3,000.The post added: “Caldicot Town Team have taken the decision that in the current financial crisis, it would not be a good investment of funds, and could be better spent throughout the year, such as Family Fun Day and Street Food Festivals.”It comes as other parties around the UK are cancelled, including one due to be held at The Rotary Club in Exmouth, east Devon, which failed to sell enough tickets to pay for it.",
        "The market town is in Monmouthshire, south-east Wales, which is the home county of Secretary of State for Wales David TC Davies.The community however, does not come under Mr Davies’ Monmouth constituency, but is in the Labour-held Newport East area, which is also served by a Labour Senedd member and Labour-run Monmouthshire County Council.",
        "The UK Government’s digital coronation map shows dozens of events and lunches taking place across Wales over the weekend, however notably fewer than elsewhere in the UK.Questions have been raised on social media about one event entered on the Eden Project’s map of coronation lunches.The “private” event in Nefyn, on the Llyn Peninsula in North Wales, is labelled Gwyl Clustiau Mawr, which in Welsh means Big Ears Festival.Only one official public screening of the coronation will take place in Wales on Saturday, in Cardiff Castle, with the Coronation Concert being shown afterwards on a screen in the city’s Roald Dahl Plass."
    ]
}