{
    "articleURL": "/wires/reuters/article-12041681/POLL-Dollar-remain-resilient-coming-months-despite-narrowing-rate-gap.html",
    "content": [
        "reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=EUR= poll data",
        "By Shaloo Shrivastava and Indradip GhoshBENGALURU, May 3 (Reuters) - The U.S. dollar will remain resilient against most major currencies over the coming months despite expectations of narrowing interest rate differentials, a Reuters poll of foreign exchange strategists predicted.Although the greenback weakened 0.8% last month, it was mild compared to March's 2.3% slide as persistently high inflation bolstered expectations of another Federal Reserve interest rate hike later on Wednesday.The dollar was forecast to trade around current levels against most major currencies over the next six months, according to the April 28-May 3 Reuters poll of 75 strategists.Easing concerns about the health of the banking system following the orderly failure of three U.S. mid-sized lenders since mid-March suggests inflation remains the key worry given the economy is holding up reasonably well.Most of the optimism around the dollar stems from the view that irrespective of whether the Fed is done with its tightening cycle on Wednesday, it is unlikely to start cutting rates any time soon as some in financial markets are betting.\"It is our view, that these cuts will be priced out in the coming months as the Fed, like many other G10 central banks, struggles to push services inflation lower,\" said Jane Foley, head of FX strategy at Rabobank.",
        "\"We also expect the dollar will see further bouts of support in the months ahead from safe-haven demand.\"Having risen by more than 3% already this year, the euro is expected to trade at $1.11 in six months, around current levels. Sterling was also seen broadly unchanged at $1.25 in six months.The pound has gained nearly 3.5% against the greenback this year, partially rebounding from a 10% slide in 2022.Over the next 12 months, the dollar is expected to fall 2.7% and 2.4% against the euro and pound, respectively.A slim majority of strategists, 20 of 39, said there would be an increase in net short dollar positions by the end of the month. Eleven said existing net shorts would not change much.The euro is also set to benefit from the European Central Bank's late entry to the current interest rate cycle, with strong expectations for more hikes in coming months.\"If short rate expectations are going to drive currency trends, we'll go on seeing the ECB's hawkish stance dominate and there's more upside to EUR/USD...to come,\" said Kit Juckes, chief FX strategist at Societe Generale.(For other stories from the May Reuters foreign exchange poll:)(Reporting by Indradip Ghosh and Shaloo Shrivastava; Polling by Sarupya Ganguly and Sujith Pai; Editing by Hari Kishan, Ross Finley, Kirsten Donovan)"
    ]
}