{
    "articleURL": "/wires/pa/article-12054781/Steven-MacLean-proud-St-Johnstone-players-pulling-vital-victory.html",
    "content": [
        "St Johnstone interim boss Steven MacLean praised the attitude of his players as the Perth side edged closer towards cinch Premiership safety with a vital 1-0 win over Dundee United at McDiarmid Park.",
        "Captain Liam Gordon steered home the crucial goal from close range after a Stevie May miscue before United saw Charlie Mulgrew sent off for hauling down Melker Hallberg.Steven Fletcher hit the goalframe for the visitors in the last minute but St Johnstone held on for a first victory since they beat the same opposition in February. It was also their first triumph at McDiarmid Park since they beat Rangers in early November.After taking four points from his two games in charge, MacLean hopes his side have stopped the rot.He said: “I’m proud. Happy for the players and happy for the supporters. I think it was deserved. I thought we played well.“We had to defend at the end which is what you have to do because they’re fighting for their lives as well.",
        "“They threw caution to the wind and threw bodies towards, put (Ryan) Edwards on up front so it’s always going to be tricky but we defended really well.“If I’ve got a gripe, it would be that we could’ve scored more. We had 17 shots. That’s 14 shots and 17 shots in the last two games which is good but we want to keep building.“I’m delighted. The players have reacted well and I’ve got a reaction out of them but it’s only one game.",
        "“We’re in tomorrow and we’re going to prepare for Motherwell and we’re going to do everything right.”MacLean also insisted he has not had any conversations with chairman Steve Brown about his long-term future, with his focus firmly on Saints’ fight against the drop.He added: “There’s been nothing. Hopefully he’ll be happy with me for getting a result. I’m sure I’ll speak to him. I spoke to him on Thursday.“He was good – he asked me how it had been and I thank him for giving me the opportunity. Hopefully he can sleep well tonight.Dundee United manager Jim Goodwin, meanwhile, rued Fletcher’s late miss as he praised his side for staying in the game.He said: “Credit to the players, they never gave up. We tried to get as many offensive bodies on the pitch as possible towards the end and we knew we’d leave ourselves light and we were hit on the counter on a couple of occasions.“I think if Fletcher’s effort at the end goes in then, over the piece, a draw would have been a fair outcome.”The United boss also said he has not decided if his club will appeal against the red card shown to Mulgrew.The defender was beaten to the ball by Hallberg and he caught the midfielder who was through on goal, although the offence did take place out wide towards the touchline.",
        "Goodwin added: “I haven’t had the chance to watch it back so I’ll wait and see, and sit with the analyst. Then we’ll give a response.“I’m reluctant to comment (on the prospect of losing Mulgrew) but of course Charlie has been a very important player.“We’ll have a look back at the situation. Was there a covering defender? Was it a clear goalscoring opportunity? And we’ll assess that on Monday morning and decide which way we want to go.”"
    ]
}