{
    "articleURL": "/tvshowbiz/article-12055983/Eva-Longoria-leads-stars-2nd-Annual-Gold-Gala-alongside-Sandra-Oh-Awkwafina.html",
    "content": [
        "Eva Longoria led the stars as she walked the red carpet at Gold House's 2nd annual Gold Gala at The Music Center in Los Angeles on Saturday. ",
        "The Tell It Like A Woman actress looked stunning in a rhinestone trimmed strapless midi dress with long diamond earrings.The 5ft 1in beauty added a few inches with rhinestone embellished black pumps and added a few chunky diamond rings.The Desperate Housewives star styled her dark hair back in a ponytail and opted for a glamorous makeup palette including lashes, smokey eyes, blush and a glossy nude lip. She was joined by a number of other stars, including Sandra Oh and Awkwafina. ",
        "The Grey's Anatomy alum donned a pink draped blouse with a long green ruched wrap skirt.The two-time Golden Globe winner, 51, had her dark tresses styled long and flowing well past her shoulders with bangs, and extra volume. She sported a bold pout and dusted her cheeks with a dash of magenta blush for a radiant finish. The actress' family-friendly film Turning Red by Pixar was nominated for Best Animated Feature Film at this year's Oscar's. She lent her voicing acting talents to the movie's matriarch Ming Lee.Sandra posed for a picture with Indiana Jones and the Temple of Doom actor Ke Huy Quan who donned a black suit with gold and white embroidery. Crazy Rich Asians star, Awkwafina stood out at the event in a long-sleeved, neon orange gathered V-neck dress with padded shoulders from Saint Laurent.",
        "The Renfield star styled her long black hair down in waves and wore black platform heels. She recently began filming the upcoming Amazon action-comedy Grand Death Lotto alongside John Cena.",
        "Brie Larson made an appearance in a beaded cream gown that flattered her slender frame and wore her honey blonde locks down with light makeup.Actress Jamie Chung looked stunning in a $4595 Monique Lhuillier off-the-shoulder draped sequin column gown.The 40-year-old SAG Award nominee applied a hint of pink shadow to her eyes, defined her brows, put pink blush on her cheeks, and styled her long brunette tresses in soft waves.Fashion designer Prabal Gurung looked dapper in a white jacket with a floral applique over a black v neck shirt with black pants and boots.Award-winning journalist and author Lisa Ling wore a one-shoulder multi-colored floral gown and styled her long sleek hair draped over her shoulder.Social media star Bella Poarch donned an elaborate leather top with pleated points on her shoulders and sheer sleeves that extended past her wrists.She paired the top with a green wrap skirt and platform heels and accessorizes her sleek black tresses with gold hardwear. Minari actor Alan Kim wore a black suit with a black satin bow-tie and black shoes.",
        "Real Housewives of Beverly Hills star Crystal Kung Minkoff looked magnificent in a floral gown, which she paired with black heels",
        "Maitreyi Ramakrishnan put on a busty display in a blue button up top, which she left partly unbuttoned, and oversized white pants.She was joined by husband Rob Minkoff who looked sharp in a suit.Trinity Bliss also opted for a floral look, showing off her legs in a pink, white and green mini dress, and pink heels.Daniel Dae Kim and Mia Kim made a stylish pair in pastel toned outfits. Kim Lee, 34, sizzled in a busty gold gown with a thigh-high slit.China Chow and Chloe Bennet both opted for vidid red ensembles.Patrick Starrr arrived in style, wearing a red tulle statement gown with a matching head piece Brooklyn Nine-Nine actress Sujata Day wore a multi-colored top to bottom sequined long-sleeved gown.She accessorized with beaded earrings and styled her long brown hair straight down her back with a part in the middle.",
        "Tan France showed off his style in a brown and white outfit. Ming-Na Wen dazzled in a glamorous black sequin gown with a feather trim. Stephanie Shepherd looked splendid in a Greecian inspired white gown.Michael Chow was dapper as ever in a black velvet tuxedo, while Chloe Kim looked elegant in a flowing black gown.The Gold Gala is a new event dedicated to celebrating Asian &amp; Pacific Islanders in entertainment.",
        "The event is hosted by Gold House, an Asian and Pacific Islander community group that puts out its A100 list every year that tries to recognize the most influential Asian and Pacific Islanders in any given year."
    ]
}