{
    "articleURL": "/wires/ap/article-12044235/MATCHDAY-Napoli-win-title-Brighton-Man-United-EPL.html",
    "content": [
        "A look at what´s happening in European soccer on Thursday:",
        "ITALYNapoli needs just a point at Udinese to seal its first Serie A title in more than three decades. Diego Maradona led the southern club to its only two Italian league championships in 1987 and 1990. Napoli coach Luciano Spalletti is coming full circle, having first showed promise at Udinese nearly two decades ago when he led the provincial club to a fourth-place finish and a spot in the Champions League. Napoli is 15-points ahead of second-place Lazio.ENGLANDManchester United looks to consolidate its place in the Premier League's top four when it plays the team perhaps best placed deny Erik ten Hag's side a spot in next season's Champions League. Brighton is coming off a 6-0 rout of Wolverhampton and is in eighth place, 11 points behind United with a game in hand. Win at the Amex Stadium and Brighton retains a slim hope of the top four, even if qualification for the minor European competitions is much more in the south-coast team's grasp. Brighton will also be looking to avenge the penalty-shootout loss to United in the FA Cup semifinals last month. United would move into third place, a point above Newcastle, with a win.SPAIN",
        "Still in the fight for European places in the Spanish league, seventh-place Athletic Bilbao hosts sixth-place Real Betis at San Mamés Stadium. Betis is trying to end a three-game winless streak, while Athletic hasn't won in two consecutive matches. In the fight against relegation, 19th-place Espanyol visits Sevilla and 16th-place Valladolid visits Rayo Vallecano. Espanyol defeated Getafe in the previous round to end an eight-match winless streak. Valladolid, sitting one point from the relegation zone, has won only two of its last eight league matches.",
        "___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}