{
    "articleURL": "/news/article-12049835/David-Walliams-Fatboy-Slims-luxury-homes-swept-sea-2040-erosion.html",
    "content": [
        " A £35million scheme aims to carry out work at six locations along the seafrontThe luxury homes and private beaches of millionaire DJ Fatboy Slim and comedian David Walliams could be swept into the sea unless action is taken to save them, MailOnline can reveal.",
        "The £4million seafront homes in Hove, East Sussex, are at risk from coastal erosion and could disappear into the sea by 2040.A multi-million-pound rescue plan has been unveiled to slow coastal erosion on the seafront in Brighton and Hove. The £35million scheme includes urgent work at six key locations along the seafront.Fatboy Slim, aka Norman Cook, and Walliams own homes in a row of 12 beachfront properties dubbed Millionaires' Row in Hove.",
        "Around 15,000 tons of granite would heaped on to the shingle beaches nearby in an attempt to keep the homes from being washed into the sea. The rock defences would stretch for around 261m near the 12 homes and along the beach and would be some 3m high.Known as the Western Esplanade, the prestigious properties were once home to Adele, Sir Paul McCartney and Heather Mills, actor Nick Berry and writer Robert Graves.They have stood there for more than 100 years, and each comes with a short stretch of shingle beach leading to the sea.The owners of the properties are contributing £81,061 - or £6,700 each - to the overall cost of the taxpayer-funded scheme. The 15-year project will protect not just the houses in the seafront row, but also nearby businesses including Shoreham Power Station and Shoreham Sewage Pumping Station.",
        "Brighton and Hove City Council is contributing £6.3million, while the rest is coming from Adur District Council, Shoreham Port Authority and the Government, which has approved more than £12million in funding.The planning application for the project, written by JBA Consulting, says: 'The shingle beach along the frontage provides the main form of coastal defence and is controlled by a series of timber, rock, masonry and concrete groynes.",
        "'Historic storm events have previously led to flooding of commercial premises and properties along Brighton seafront and on adjacent roads.'Emergency repair works have been undertaken to repair breaches in seawalls and some structures, but many remain in a collapsed or partially collapsed condition.'The proposed scheme aims to achieve a consistent standard of protection along the coastal frontage in six locations to reduce the risk of coastal erosion and coastal flooding through the refurbishment of existing defence assets where required, and the construction of new assets.'Consequently, it will provide material benefits by reducing erosion and flood risk to people, property and the environment.'Surveys on the six chosen sites are being carried out, and if planning permission is granted this month then work should begin over the summer.Brighton and Hove City Council said the cost calculations had been worked out on 'benefit-cost ratios' and agreed by all parties.",
        "It added: 'The Brighton Marina to River Adur Flood and Coastal Erosion Risk Management scheme covers 10km of seafront.'The stretch of seafront managed by the Western Esplanades Management Company is only a tiny fraction of the full 10km.'We are the lead agency for the scheme, and we work in close collaboration with our various coastal partners.'The development costs for the scheme were estimated in 2020 by our engineering consultants and costs distributed between the partners based upon benefit-cost ratios and partnership funding calculations in line with Environment Agency guidance and the Flood and Water Management Act 2010.'The contributions were subsequently agreed by all partners and approved by the Environment Agency.'Western Esplanade Management Company acted on the advice of the outline business case to raise their own groynes at their own expense. This work was completed independently to the financing and management of our ongoing scheme.'Cook and Walliams were approached for comment."
    ]
}