{
    "articleURL": "/news/article-12040811/Bodhi-Risby-Joness-alleged-naked-Indonesian-village-rampage-blamed-black-magic-poisoning.html",
    "content": [
        "'Black magic' blamed for alleged rampageNaked Bodhi Risby-Jones allegedly ran riot Brian Willy says he have been been poisoned  'Black magic' has been blamed for the alleged nude rampage by an Australian tradie in a remote Indonesian fishing village.",
        "Bodhi Mani Risby-Jones, 23, from Queensland's Sunshine Coast, faces years in an Indonesian prison and a public caning after he allegedly ran riot while drunk and naked, heaving a motorcycle at a fisherman and assaulting a security guard among others.He has since been sitting in a tiny 3x3 metre cement cell on the island of Simeulue, off the coast of Sumatra, where the alleged incident happened on Thursday night and has been unable to explain his alleged actions beyond suffering sunstroke.However, an explanation has been offered by Australian Brian Willy, who lived on the island for eight years.'When I heard about this guy (Mr Risby-Jones) the first thing that came to my mind was black magic,' Mr Willy told the Courier Mail. ",
        "'Black magic is basically poisoning and it sends them crazy, they (local residents) might put it in your coffee or tea.''They poison people by making up a potion or something.'There is lots of black magic going on since after Covid because people think they can make money out of it.'Belief in black magic is widespread in Indonesia and the sporadic killing of shamans (black magic practitioners) has been reported up until 2017.Mr Willy said although the region's Islamic beliefs imposed a strict norms of behaviour the island it was also famed for its marijuana. ",
        "Since the alleged rampage Mr Risby-Jones as struggled to say what came over him.'I feel like not myself, like almost possessed,' said while under police guard on Saturday",
        "'It was not a good feeling. I wasn't myself. Normally I'm very nice guy.'Aceh operates under a Sharia-based legal system, and alcohol consumption is banned.Police allege he had been drinking vodka in his hotel room at the Moon Beach Resort when he emerged without any clothes just after midnight last Thursday.Simeulue police chief Senior Commissioner Jatmiko alleged Mr Risby-Jones hit a security guard in the neck, causing him to fall to the ground, as he left the hotel.He is then alleged to have hit passing motorbike riders on the street, knocking one man to the ground where his bike fell on him causing a serious leg injury. Angered locals then chased him to the beach where they held him down and tied his arms while police were called.The fisherman who was alleged assaulted required 50 stitches. ",
        "Mr Willy said while living on the island in 2000 he witnessed a public flogging, a fate that could lie in store for Mr Risby-Jones who potentially faces 40 lashes with a heavy cane. 'It was a couple that had committed adultery and all the locals were there, even kids,' Mr Willy said recalling the spectacle.",
        "'They were all cheering the guy with his big stick, saying 'yeah, hit her, hit her' and I just thought 'that's so barbaric' you know. 'It disgusted me and I had to walk away.'"
    ]
}