{
    "articleURL": "/news/article-12044035/Neighbours-angry-note-barking-dog-Ku-ring-gai-Council-area-divides-opinion-Facebook.html",
    "content": [
        "Barking dog prompts angry note from neighbour The owner said the dog hadn't even been at home A furious neighbour's note to an Australian woman about her barking dog has sparked debate after the owner claimed the pet wasn't even at home.",
        "The woman, who lives in the scenic Ku-ring-gai Council region in northern Sydney, shared a picture of the handwritten note to social media on Wednesday.'To the dog owner, Your (sic) dog has been barking all day!' the note reads.The neighbour said they could hear barking from their lounge room 'with the TV on' as late as 11pm and threatened to report the woman to council.But responding to the faceless neighbour in a Facebook post, the woman said her dog hadn't been at home all week.",
        "'He has been at work with me from 7.30am to 4pm everyday,' she said.'Also he sleeps inside a crate and goes to bed when I do, which is usually before 10pm.'She then admitted the dog 'does have a habit of barking at birds in the backyard' but she brings him inside when he gets 'too carried away'.The woman added she wasn't concerned if the neighbour contacted council because she would 'tell them the exact same thing'.Commenters on the post were divided, with many saying the other residents had a right not to be disturbed but with some supporting the dog owner saying the neighbour was being overly sensitive.Across Australia the laws around barking dogs are fairly consistent.As a first step councils encourage speaking directly with the dog owner but if a resolution can't be reached, then councils have the power to step in.",
        "In NSW there are also Community Justice Centres (CJC) which can help mediate the problem.If complaints are substantiated by council a nuisance order or noise abatement order can be issued which brings a fine for non-compliance.Keeping a record of the dog's barking is also encouraged. The law in SA specifically states what is considered excessive noise: 240 barks per day between 7am and 9pm and 35 barks between 9pm and 7am."
    ]
}