{
    "articleURL": "/wires/pa/article-12046301/Putin-face-war-crimes-court-Ukraine-wins--Zelensky.html",
    "content": [
        "Volodymyr Zelensky has said he is convinced that Russian president Vladimir Putin will face an international war crimes court when Ukraine wins the war that has been raging for over a year.",
        "In a speech titled No Peace Without Justice For Ukraine given in The Hague, the city that hosts the International Criminal Court, the Ukrainian president said that Mr Putin “deserves to be sentenced for these criminal actions right here in the capital of the international law”.“And I’m sure we will see that happen when we win. And we will win,” he said.The ICC has issued an arrest warrant for Mr Putin for alleged war crimes in Ukraine, relating to the abduction of children.The ICC cannot prosecute the crime of war aggression itself and Mr Zelensky appealed for a fully fledged tribunal to prosecute that overarching crime.“If we want true justice, we should not look for excuses and should not refer to the shortcomings of the current international law but make bold decisions that will correct that shortcomings that unfortunately exist in international law,” he saidMr Zelensky’s speech came a day after he denied that Ukrainian forces were responsible for what the Kremlin called an attempt to assassinate Mr Putin in a drone attack on Moscow. The Kremlin promised retaliation for what it termed a “terrorist” act.On Thursday, Mr Putin’s spokesman accused the United States of being behind the alleged attack.Dmitry Peskov told reporters during a daily conference call that the Kremlin was “well aware that the decision on such actions and terrorist attacks is not made in Kyiv, but in Washington”.",
        "“And then Kyiv does what it’s told to do,” Mr Peskov said, without offering evidence for his claim.",
        "John Kirby, a spokesman for the National Security Council at the White House, described the claim as “ludicrous.”Mr Zelensky said in the Netherlands that he was “not interested” in the Kremlin’s opinion.Meanwhile, Ukraine’s military claimed three Russian drones that hit the southern city of Odesa early on Thursday had “for Moscow” and “for the Kremlin” written on them, seemingly referring to the strikes in Moscow. Also, Kyiv was the target of an air attack for the third time in four days.In total, Ukraine’s Air Forces intercepted 18 out of 24 Iranian-made drones launched by Russian forces in various regions. No casualties were reported.Mr Zelensky was welcomed outside the ICC building by the court’s president, Poland’s Piotr Hofmanski. Staff crowded at windows to get a glimpse of Mr Zelensky’s arrival and raised a Ukrainian flag next to the court’s own flag outside the building.Judges at the ICC last month announced they found “reasonable grounds to believe” that Mr Putin and his commissioner for children’s rights were responsible for the unlawful deportation and transfer of children from occupied areas of Ukraine to Russia.But the chances of Mr Putin standing trial in The Hague are remote. The court does not have a police force to execute its warrants, and the Russian leader is unlikely to travel to any of the ICC’s 123 member states that are under an obligation to arrest him if they can.",
        "The ICC said in a March 18 statement that Mr Putin “is allegedly responsible for the war crime of unlawful deportation of (children) and that of unlawful transfer of (children) from occupied areas of Ukraine to the Russian Federation”.",
        "ICC prosecutor Karim Khan has made repeated visits to Ukraine and is setting up an office in Kyiv to facilitate his ongoing investigations.However, the ICC does not have jurisdiction to prosecute Mr Putin for the crime of aggression — the unlawful invasion of another sovereign country. The Dutch government has offered to host a court that could be established to prosecute the crime of aggression and an office is being established to gather evidence.The new International Centre for Prosecution of the Crime of Aggression should be operational by summer, the European Union’s judicial cooperation agency, Eurojust, said in February.Mr Zelensky’s visit to The Hague came as questions continued to swirl around Russia’s claim that it foiled an attack by Ukrainian drones on the Kremlin early on Wednesday. Moscow branded it an unsuccessful assassination attempt against Mr Putin and promised retaliation for what it termed a “terrorist” act.Mr Putin was not in the Kremlin at the time and was at his Novo-Ogaryovo residence outside Moscow, his spokesman Dmitry Peskov told Russia’s state news agency RIA Novosti.",
        "There was no independent verification of the purported attack, which Russia authorities said occurred overnight but presented no evidence to support it.Questions also arose as to why it took the Kremlin hours to report the incident and why videos of it also surfaced later in the day.White House press secretary Karine Jean-Pierre said the US was “unable to confirm the authenticity” of Russia’s claims of a Ukrainian attack on Moscow.Asked whether the US believed Mr Putin was a lawful target of any potential Ukrainian strike, Ms Jean-Pierre said that since the start of the conflict, the US was “not encouraging or enabling Ukraine to strike beyond its border”.Asked whether the US was concerned that the accusation might have been a false flag operation by Russia to serve as a pretext for more aggressive military action on Ukraine, Ms Jean-Pierre said she did not want to speculate, but added: “Obviously Russia has a history of doing things like this.”The Netherlands has been a strong supporter of the Ukrainian war effort since Russia’s invasion last year.Among military equipment Prime Minister Mark Rutte’s government has promised are 14 modern Leopard 2 tanks it is buying together with Denmark. They are expected to be delivered next year.The Netherlands also joined forces with Germany and Denmark to buy at least 100 older Leopard 1 tanks for Ukraine.",
        "Among other military hardware, it also sent two Patriot air defence missile systems and promised two naval minehunter ships as well as sending military forensic experts to assist war crime investigations. Mr Zelensky’s visit came on the day the Dutch remember their war dead."
    ]
}