{
    "articleURL": "/news/article-12043489/What-Walmart-logo-means-Shoppers-shock.html",
    "content": [
        "Walmart changed its logo in 2008, moving away from just the store nameThe retail giant adopted what looks like a flower or a starWalmart shoppers are now shocked to find out it is something entirely differentShoppers are only just noticing what the Walmart logo actually represents but some believe the retail giant has missed the mark.",
        "Recognized worldwide as a brand for millions of shoppers thanks to its range of groceries, home goods and more, its logo makes it easy to spot.Customers will remember when the Walmart logo previously featured just a hyphen with a star between 'Wal' and 'Mart'.The logo was changed in 2008 when the retailer adopted what many thought looked like a flower or a star. ",
        "But despite the yellow logo baring close resemblance to both, the symbol actually resembles a spark. One person on Twitter said they couldn't believe it, tweeting: 'Just found out that the Walmart logo is a bunch of sparks and not a flower. Need some time to process.'Another chimed in: 'Life was better when Walmart's logo was the smiley face and not that weird little asterisk flower thing.' Walmart said the spark had a connection to its founder.'It's a symbol of the spark of inspiration Sam Walton had when he opened his very first store,' it said in a company statement.'It's a symbol of all of the great ideas that have helped to develop our company over the years. And it's a symbol of the inspiration that's inside all of us.'The Walmart Digital Museum says the six parts of the Walmart spark correspond to the company's values and principles: customer, respect, integrity, associates, service and excellence. ",
        "Walmart said the change in logo was to coincide with a store revamp.  'This update to the logo is simply a reflection of the refresh taking place inside our stores and our renewed sense of purpose to help people save money so they can live better,' it said in a statement.",
        "The retail giant, which has a net worth of $388bn, said last month that 65% of its stores would be serviced by 'automation' in the next three years.It's not immediately clear if the move would lead to more layoffs at the country's biggest private employer, which has about 1.7 million U.S. workers and another 60,000 abroad. But the company did say the moves would reduce the need for lower-paid roles.The world's largest retailer by sales maintained its forecast for the fiscal year ending Jan 31, 2024, predicting net sales to rise by 2.5 percent to 3 percent and earnings by $5.90 to $6.05 per share.It also kept its forecast for first-quarter sales to rise between 4.5 percent and 5 percent.Walmart hiked their minimum wages earlier this year across the country surpassing $17.50. "
    ]
}