{
    "articleURL": "/wires/ap/article-12050745/Study-Chinas-squid-fleet-avoids-Peru-dodge-new-port-law.html",
    "content": [
        "A port regulation adopted by Peru to combat illegal fishing by Chinese squid vessels appears to have backfired and driven the world's largest overseas fishing fleet deeper into the shadows, increasing the risk of forced labor, according to new research.",
        "Peru in 2020 began requiring any foreign fishing boat entering its ports to use a vessel monitoring system allowing its activities to be tracked in real time 24 hours a day. The equipment, which tracks a vessel´s geographic position and fishing activity through a proprietary satellite communication system, sought to provide authorities with visibility into several hundred Chinese squid vessels that every year amass off the west coast of South America. With the support of Global Fishing Watch, a non-profit that encourages sustainable fishing, Peru joined a handful of countries making the information publicly available as well.Decades of overfishing have pushed China´s fishing fleet farther from home. But its expansion to far-flung locations has been dogged by accusations of illegal fishing on the high seas, as well as instances of forced labor. It´s also drawn stiff criticism from the United States, which has made combatting illegal fishing a top priority and recently boosted efforts to monitor the Chinese fleet off the coast of South America.Instead of increasing oversight, the new Peruvian regulations appear to have driven Chinese ships away from the country's ports - and kept crews made up of impoverished Filipinos and Indonesians at sea for longer periods, exposing them to abuse, according to new research published by Peruvian fishing consultancy Artisonal.",
        "Artisonal, in the r eport published on its website, found that only three of the 671 Chinese vessels authorized to fish in the eastern Pacific have installed the equipment.___",
        "This story was supported by funding from the Walton Family Foundation. The AP is solely responsible for all content.___Meanwhile, port visits by Chinese vessels to Peru for maintenance, crew changes or to resupply have plummeted from over 300 in 2019 to just 21 last year. The bulk of the recent visits were the result of never before used and unspecified emergency requests - so called \"forced arrivals\" in Spanish - by ships lacking the at-sea monitoring devices. Instead of docking in Peru, some of the Chinese vessels appear to be making the long journey back to China between fishing seasons while others have moved to the Chilean port of Punta Arenas as an alternative logistical hub.Relying on satellite tracking technology, Artisonal found that instead of offloading crew and restocking in Peru, the closest coastline to the fishing area, the vessels are staying longer at sea - what it says is a red flag for potential abuse of the roughly 16,000 crew members aboard the giant fleet. Before the port regulations, foreign squid vessels spent on average 10-12 months at sea but now the length of the typical fishing trip has increased to 18-24 months before returning to China, according to Artisonal.",
        "\"A crew member´s life in the open ocean does not depend on themselves but on the skipper,\" said Eloy Aroni, one of Artisonal's owners and author of the report.Artisonal's research cites the case of the Chang Tai 802. In August 2019, the vessel entered the Peruvian port of Chimbote to leave a crew member with a kidney infection that required emergency care. The Associated Press spotted the same vessel in July 2021 in the eastern Pacific as part of an investigation into the activities of the Chinese distant water fishing fleet, which numbers at least 3,000 vessels. During an at-sea encounter an Indonesian crew member screamed from the stern of the vessel \"I want to go home.\" Family members who hadn't heard from their loved one for months expressed concern.Instead, the Chang Tai 802 fished another year and finally returned to port, in China, in August 2022, according to Artisonal. After a brief visit, it returned to South America a month later.The ship's owner, Haimen Changtai Pelagic, did not respond to an email requesting comment.Crews of several other vessels identified by Artisonal face similarly dire conditions, spending in some cases as long as three years at sea. To operate for such extended periods, giant support ships supply them with fuel and food while refrigerated cargo vessels haul their catch back to China.",
        "China's Agriculture Ministry, which regulates China's fishing fleet, didn't respond to a request for comment. Beijing in the past has said it has zero tolerance for illegal fishing and points to recent actions such as introducing a temporary moratorium every year on high seas squid fishing as evidence of its environmental stewardship. Those now criticizing China, including the U.S. and Europe, for decades raided the oceans themselves.Aroni, who previously worked for Peru's fishing industry, said the dramatic jump in previously unheard of \"forced arrivals\" last year was also a concern. He cited the case of the Zhe Pu Yuan 98, which was responsible for eight of the total 14 emergency landings recorded last year - each one lasting less than 24 hours. In the absence of additional information from Peruvian authorities, he said it was reasonable to suspect that the ship was taking advantage of the loophole to change crews. The ship's owner, Zhoushan Putuo Deep-Sea, did not respond to an email requesting comment.Not going to Peruvian ports allows the ships to avoid scrutiny not only of their labor practices but also potential safety risks as well as inspections for illegal fishing.Juan Carlos Sueiro, an expert on fishing in Peru with the international conservation group Oceana, said that China's fleet appears to be making a mockery of the new rules. He suggested Peru tighten regulations to make clear under what conditions foreign-flagged vessels can make \"emergency\" visits to ports in Peru.",
        "\"Activities that threaten the sustainability of resources are based on forms of modern slavery and are very dynamic,\" he said in an interview. \"Squid fishing is a case in point. The restrictions imposed by Peru for access to Peruvian ports has led the fleet to move to other ports, but above all by staying longer at sea, which further erodes crew members' already precarious labor rights.\"Follow Goodman on Twitter: @APJoshGoodman__Contact AP´s global investigative team at Investigative@ap.org or https://www.ap.org/tips/"
    ]
}