{
    "articleURL": "/femail/article-12038895/Disney-comes-furious-fire-characters-NOSES.html",
    "content": [
        "Disney has been called out over its films' depictions of princesses' nosesTikTok creators pointed out that women have tiny noses compared to villainsThey claim these representations are sending the wrong message to little girls Disney has been called out over its depiction of noses on princesses, with TikTok creators pointing out that the female characters in its movies have tiny noses compared to villains and men, sending the wrong message to little girls.",
        "With more than 5.3 million views, a TikTok video uploaded recently by @gangbanger_0 cycles through several images of Disney princesses - including Ariel, Moana, Elsa, Belle, Aurora and Snow White - with their petite noses circled.Then it cuts to villains who are part of the Disney universe - such as Jafar, Maleficent, Ursula, Clayton and Mother Gothel - to compare their larger and more defined noses to the ones shown before.The clip is set to the lyrics, 'Marceline, is it just you and me in the wreckage of the world? That must be so confusing for a little girl,' from the song, Remember You, by Adventure Time.",
        "Another video from Robin Reaction, which has also been viewed more than 5.1 million times, delves a little deeper into the issue.'How much nose is a Disney princess allowed to have?' the creator asks at the start of the video.'The answer depends on what year you were drawn and in most cases, not much. 'Going back to the earliest princesses, we can see their noses consists of a hint of nostril, and then depending on the angle, also like a slight curve.'This is in stark contrast to the women in these movies who are depicted as evil and therefore had to be ugly. One of the easiest ways to tell if a woman was going to be evil or very unf***able is to see if they have a nose that actually resembles a nose.",
        "'This lack of noses continued all the way through the '80s, '90s and 2000s, and when non-white princesses started to get introduced, they got the same lack of nose treatment,' Robin continued, referring to a photo of Pocahontas, Mulan and Tiana.'When 3D animation got introduced, they had to find new ways for their characters to technically have noses which take up as little space as possible. 'And I think it's worth noting that Disney knows how to draw extremely hot people that have defined noses, they've been doing it to men a long time. ",
        "'They just choose to keep women in this very narrow definition of beauty.'Robin added 'wokeness' became a threat to Disney and they had to 'adjust,' like in the cases of Moana and Mirabel.And the videos seem to have drawn mixed reactions from people. 'I've always wondered this tbh (to be honest) like they always gave the villains the ethnic noses,' one person said.'THIS OMG people never know what I'm talking about when I bring this up,' a second comment read.",
        "'This is probably why I always hated my nose and didn't realize,' a third TikTok user added, with another saying: 'Well there's where my nose insecurity stems.' But someone else claimed: 'Has anyone ever associated hooked noses with villains due to Disney? I'm not saying it's ok I'm just curious cause I never did.'",
        "While one TikTok user said it was just animation design, adding: 'Everyone saying it's a style choice make me confused. Why do they give the villains bigger and more defined noses then? And you have to think about.'"
    ]
}