{
    "articleURL": "/wires/reuters/article-12046665/Canada-posts-C-972-mln-trade-surplus-March-amid-widespread-declines.html",
    "content": [
        "By Ismail Shakil and Fergal Smith",
        "OTTAWA, May 4 (Reuters) -Canada's imports and exports dropped to one-year lows in March, data showed on Thursday, a sign that global demand is likely slowing after a series of interest rate hikes by the world's major central banks.Total exports fell 0.7% in March, largely on cheaper energy products, while imports declined 2.9%, driven by pharmaceuticals and other consumer goods, Statistics Canada said in a statement.Canada's global trade surplus came in at C$972 million ($714 million) in March, above analyst forecasts of a C$200 million surplus. February's trade balance was revised to a C$487 million deficit from an initially reported C$422 million surplus.\"Not a spectacular month but I think it needs to be seen in context ... We had explosive gains in January, we had some moderation in February,\" said Stuart Bergman, chief economist at Export Development Canada, the country's export credit agency.\"Looking at some early warning indicators here, we do have some concerns going forward just in terms of our outlook for global demand going forward,\" Bergman said.Overall, exports dropped to the lowest level since February 2022, mainly due to lower exports of crude oil.Despite the overall decline, exports of aircraft and other transportation equipment and parts increased. By volume, exports rose 0.1% in March.",
        "Imports dropped to their lowest level in a year, impacted by pharmaceutical products, as well as clothing, footwear and accessories. Imports of cellphones and computers also declined in March. By volume, imports fell 5.3%.Export volumes likely boosted Canada's first-quarter gross domestic product, but a contraction in import volumes in recent months indicates a slowdown in domestic demand, said TD economist Marc Ercolao in a note.\"We expect economic momentum to slow as interest rate increases work their way through the economy,\" Ercolao said.Canada's GDP likely grew 2.5% on an annualized basis in the first quarter, Statscan said in a preliminary estimate last week. The Bank of Canada expects positive but weak growth during the remaining three quarters of this year.The bank has kept interest rates on hold in its last two meetings after hikes at eight consecutive policy meetings previously as it sought to cool the economy and bring inflation down.The Canadian dollar was trading 0.2% higher at 1.3590 to the greenback, or 73.58 U.S. cents.($1 = 1.3605 Canadian dollars) (Reporting by Ismail Shakil in Ottawa and Fergal Smith in Toronto; Additional reporting by Dale Smith in Ottawa; Editing by Alexander Smith and Ken Ferris)"
    ]
}