{
    "articleURL": "/wires/reuters/article-12039213/Google-Microsoft-CEOs-called-AI-meeting-White-House.html",
    "content": [
        "By Nandita Bose and David Shepardson",
        "WASHINGTON, May 2 (Reuters) - The chief executives of Alphabet Inc's Google, Microsoft, OpenAI and Anthropic will meet with Vice President Kamala Harris and top administration officials to discuss key artificial intelligence (AI) issues on Thursday, said a White House official.The invitation seen by Reuters to the CEOs noted President Joe Biden's \"expectation that companies like yours must make sure their products are safe before making them available to the public.\"Concerns about fast-growing AI technology include privacy violations, bias and worries it could proliferate scams and misinformation.In April, Biden said it remains to be seen whether AI is dangerous but underscored that technology companies had a responsibility to ensure their products were safe. Social media had already illustrated the harm that powerful technologies can do without the right safeguards, he said.The administration has also been seeking public comments on proposed accountability measures for AI systems, as concerns grow about its impact on national security and education.On Monday, deputies from the White House Domestic Policy Council and White House Office of Science and Technology Policy wrote in a blog post about how the technology can pose a serious risk to workers.The Thursday meeting will be attended by Biden's Chief of Staff Jeff Zients, Deputy Chief of Staff Bruce Reed, National Security Adviser Jake Sullivan, Director of the National Economic Council Lael Brainard and Secretary of Commerce Gina Raimondo among others, said the White House official who did not wish to be named.",
        "The companies did not immediately respond to a request for comment.ChatGPT, an AI program that recently grabbed the public's attention for its ability to write answers quickly to a wide range of queries, in particular has attracted U.S. lawmakers' attention as it has grown to be the fastest-growing consumer application in history with more than 100 million monthly active users.\"I think we should be cautious with AI, and I think there should be some government oversight because it is a danger to the public,\" Tesla Chief Executive Elon Musk said last month in a television interview. (Reporting by Nandita Bose and David Shepardson; Editing by Josie Kao and Lisa Shumaker)"
    ]
}