{
    "articleURL": "/wires/ap/article-12055629/Pirates-lose-6th-straight-Belt-2-run-double-lifts-Blue-Jays.html",
    "content": [
        "PITTSBURGH (AP) - Brandon Belt hit a two-run double in a four-run first inning, and the Toronto Blue Jays extended the Pittsburgh Pirates´ losing streak to a season-high six games with an 8-2 victory on Saturday night.",
        "Belt entered the game hitting .172 in 19 games in his first season with the Blue Jays. He was signed as a free agent in the offseason after spending the first 12 seasons of his career with San Francisco.Blue Jays manager John Schneider said he has no doubt Belt is going to have a productive season.\"Just kind of the quality of the at-bats,\" Schneider said. \"He´s swinging at good pitches and his bat speed has been better. His at-bats early were consistent, but he wasn´t getting a lot of hits but now he´s coming around.\"The key for the 35-year-old Belt is remaining patient through his struggles.\"One thing I´ve learned over the years is you can´t try to force things,\" Belt said. \"You have to simplify your approach and make it see ball, hit ball. Everyone in this clubhouse has been great. The support system has been great and that´s made it a lot easier for me.\"",
        "José Berríos (3-3) gave up two runs and five hits over 6 1/3 innings with seven strikeouts and one walk as Toronto won its second straight after a five-game skid. He retired his first 13 batters before Jack Suwinski walked with one out in the fifth inning and Ke´Bryan Hayes followed with a single.",
        "\"He was really spinning it and the fastball execution was probably the best he´s had all year,\" Schneider said.Before a crowd of 34,882, the Pirates´ largest for a May home game since 2015, Johan Oviedo (2-3) gave up seven runs - six earned - 10 hits and three walks in five innings. It was the second straight poor outing for Oviedo, tagged for seven runs over 2 1/3 innings last Sunday at Washington.\"My last three games, I haven´t executed my slider the way I wanted to,\" Oviedo said.Pittsburgh has skidded since a 20-8 start, its best since 1992.\"We´ve kind of got to find our groove a little bit,\" Pirates manager Derek Shelton said. \"We´ve been inconsistent over the last six games, but I know our guys can hit. I know our approach can be good.\"Belt was ejected in the top of the eighth inning by plate umpire Carlos Torres for arguing a called third strike.Daulton Varsho hit a two-ahead single in the first for the Blue Jays, who outhit Pittsburgh 14-5, and Alejandro Kirk capped the inning with an RBI double.Toronto extended the lead to 7-0 in the third, when Kevin Kiermaier hit a two-run single after the first run of the inning scored on second baseman Rodolfo Castro´s throwing error.",
        "Kiermaier grounded into a run-scoring double play in the seventh.Connor Joe singled in a run in the sixth for the Pirates and Suwinski hit a leadoff home run in the seventh.Bryan Reynolds extended his hitting streak to 11 games.TRAINER´S ROOMBlue Jays: 1B Vladimir Guerrero Jr. was a late scratch because of left wrist discomfort. It marked just the fourth time Guerrero has missed a game since the start of the 2020 season. Guerrero was scheduled to be the designated hitter, but Belt shifted from first base to DH and Biggio started at first.Pirates: DH/OF Andrew McCutchen missed his second straight game with a sprained left ankle. ... INF/OF Ji Hwan Bae sat out after rolling his left ankle in Friday´s game.UP NEXTIn Sunday´s series finale, Blue Jays LHP Yusei Kikuchi (4-0, 4.02) will face RHP Roansy Contreras (3-2, 4.09) as Toronto goes for the sweep.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}