{
    "articleURL": "/tvshowbiz/article-12055179/Chantel-Jeffries-Karrueche-Tran-sizzle-tiny-bikinis-enjoy-beach-day-Miami.html",
    "content": [
        "Chantel Jeffries and Karrueche Tran put on an eye-popping display as they enjoyed a spring beach day together in Miami on Saturday.",
        "The 30-year-old former flame of Justin Bieber — who was spotted riding a Yamaha jet ski on Wednesday — flaunted her sensational figure in a tiny black two piece as she frolicked in the sea.Jeffries protected her eyes with silver glasses and styled her hair back in a low bun to keep her long brunette locks out of her face.Karrueche, 34, sizzled in a green bikini with white outlined straps that criss-crossed behind her back.The beauty's thong-style bottom gathered in the back and perfectly emphasized her toned derriere and tanned skin as she walked on shore.",
        "Tran donned long white nails and accessorized with multiple chunky rings, silver earrings, and orange glasses.Karrueche still has a short hairdo after cutting her braids and releasing them into the ocean following her father's death in January.In March, Karrueche shared a post to her Instagram account revealing that she released her braids into the ocean along with her father's ashes. The Bel Air actress posted several photos to her account to show off her hairdo and included a shot of herself holding a braid and a container of ashes before she released them into the water.She captioned the post: 'Being able to release my hair in the ocean along w some of my dads ashes was magical.. a full circle moment as my dad was also a hairstylist lol.'",
        "The actress added, 'Life is really LIFING right now and it was time for me to let go of a lot of old energy.'The Daytime Emmy-winning actress also wrote that she had been interested in taking on a new look for an extended period of time.'I've always wanted to cut my hair short short but never had the balls to do it.. I feel like a weight has been lifted...I feel so free and I honestly love it,' she wrote. Tran concluded her message by writing: 'Out with the old, in with the new.' ",
        "Meanwhile, Chantel, who also goes by 'Ceejay the DJ,' has been spending a lot of time at the beach in South Florida recently.On Wednesday, the beauty was seen on the same beach in Miami wearing a tiny red bikini as she hung out with friends and rode a jet ski. She frequently shares snaps in her various Fashion Nova swimsuits as she has a swimsuit line with the fashion brand. So does Megan Thee Stallion and several other celebrities.Jeffries recently turned 30 and celebrated that milestone while attending the Coachella Music and Arts Festival in Indio, California."
    ]
}