{
    "articleURL": "/tvshowbiz/article-12057931/Hailey-Bieber-shows-sexy-backside-latest-photo-dump-Instagram.html",
    "content": [
        "Hailey Bieber showed off her sultry backside on Instagram when she posted her latest photo dump on Sunday. ",
        "The 26-year-old supermodel – who recently flaunted her taught midriff and endless legs in a bikini – shared 'some things from the last few weeks' by posting a collection of random snaps.In her sexiest pic, the beauty rocked a black halter top and matching pants as she took a mirror selfie. Bieber's ears were gilded with gold and her brunette locks were slicked back in a chic bun.The Rhode Skin founder's slideshow also included a few candid snaps that showed her relaxing private life with her husband Justin Bieber and their beloved dogs. ",
        "Hailey rocked a big cozy blue sweater in one photo and an edgy black biker jacket in another selfie. Dunkin' Donuts coffee and delicious cupcakes were also featured in a few pictures as the model has a notorious sweet tooth. The Bieber's looked like they went on a road trip with their two pooches as Hailey posted a pair of pictures that showed off their cute dogs during a car ride.The influencer also included a funny picture of her husband in a hoodie that compared the pop star to Kermit dressed as the Emperor from Star Wars.Hailey's latest Instagram post comes on the heels of her and Justin missing last Monday's Met Gala, the glittering annual bash known as 'fashion's night out.'",
        "Held in memory of the late designer Karl Lagerfeld, this year's fete marked the first time Hailey skipped the Met Gala in eight years.Although she has refrained from addressing her absence in public, her decision comes after rumors of a feud with her husband's ex Selena Gomez.When Justin and Hailey attended the Americana-themed Met Gala together in September 2021, onlookers chanted 'Selena!' at them.",
        "This past October, Selena and Hailey cuddled up to one another for the cameras at the Academy Museum gala, suggesting they had buried the hatchet.By this February however Hailey found herself denying claims that she had taken a swipe at Selena on TikTok, and speculation exploded that the pair were on the outs.Then last month Selena wrote on social media: 'Hailey Bieber reached out to me and let me know that she has been receiving death threats and such hateful negativity.'She declared: 'This isn't what I stand for. No one should have to experience hate or bullying. I've always advocated for kindness and really want this all to stop.'"
    ]
}