{
    "articleURL": "/sport/nba/article-12058317/NBA-star-Ben-Simmons-left-Boomers-World-Cup-squad-heres-make-it.html",
    "content": [
        "18-man extended squad for World Cup named Simmons missed the squad, which will be cut to 12 He can still make the final Boomers squad Ben Simmons has been omitted from Brian Goorjian's 18-man extended Boomers squad for the FIBA World Cup in August, but there is still hope the prodigal son could make his Australian debut at the showpiece event.",
        "The squad included a host of NBA talent including rising superstars Josh Giddey and Dyson Daniels along with Tokyo Olympic bronze medal-winning heroes Patty Mills, Joe Ingles and Matthew Dellavedova.However one NBA player might be set to make way for Simmons in the squad before August, with Matisse 'Matty T' Thybulle no certainty to line up at the August World Cup.The 196cm swingman was a defensive rock for the Boomers at the Tokyo Olympics but lingering doubts over his future in the NBA could force him to withdraw from the World Cup.Thybulle becomes a free agent at the end of this NBA season, and if his next contract is not secured by World Cup time in August, he might not join the Boomers in the Philippines.",
        "In addition, there is a chance that Thybulle's new team might be reluctant to allow him to play in the tournament. Moreover, Thybulle has had a disappointing season, averaging just 12 minutes of court time compared to at least 20 minutes the previous three years. 'My plan is to play with the Boomers, but I don't know how the summer is going to go with contracts and how the timing works. If everything allows for it, then definitely the plan is to play in the World Cup,' Thybulle said.",
        "If Thybulle is out, that could pave the way for Simmons to claim his spot in the squad for the World Cup.",
        "Xavier Cooks*, Dyson Daniels*,  Matthew Dellavedova*, Dante Exum, Sam Froling, Josh Giddey*,  Chris Goulding, Josh Green*, Joe Ingles*, Nick Kay, Jock Landale*, Thon Maker, Will McDowell-White. Patty Mills*, Keanu Pinder, Duop Reath,  Matisse Thybulle*, Jack White**NBA contracted player",
        "Simmons had been cut from the 2014 World Cup roster, and he has prioritised his NBA commitments since then. However, the 26-year-old has now confirmed that he is putting all his efforts towards getting his body right.'I'm currently rehabilitating my back injury and putting my full effort and focus towards that,' Simmons said.Despite Simmons' injury, Boomers coach Brian Goorjian believes that the Brooklyn Nets guard is getting himself right before preparing for the upcoming tournament.'I think his [Ben's] mindset is getting healthy, getting in shape and getting ready to play in this [World Cup],' Goorjian said. 'Our door is always open to him, and during my time with the Boomers, he has always been straightforward with me. As we sit now, I think there is a really strong chance (that he plays at the World Cup).'If both Simmons and Thybulle are fit and available for the World Cup, it is also likely than an NBL player like veteran Chris Goulding or surprise picks Keanu Pinder and William McDowell-White could lose their spot in the final squad.",
        "'The coaches and I have had many discussions about getting the mix right, but I'm really pleased with where we've landed with the guys we've selected. There's a good balance across the court,' Goorjian said.'The fact it's been so tough goes to show the depth of talent we have in Australian basketball right now.'Australia will face Finland, Germany and co-hosts Japan in Okinawa, with the champion to be crowned in the Philippines on September 10.'I've always dreamed of playing for the Boomers and representing Australia. So, to get this opportunity is really special and I'm looking forward to competing at the World Cup,' Giddey said.'There's a lot of talent in this squad and I think we've got a good chance of matching it with every team — I'm excited for the challenge and to see what we can produce as a group on the world stage.'The final squad will be cut to 12 players for the World Cup before it tips off in August. "
    ]
}