{
    "articleURL": "/wires/ap/article-12052209/Supreme-Court-blocks-Richard-Glossip-s-execution-Oklahoma.html",
    "content": [
        "WASHINGTON (AP) - The Supreme Court on Friday blocked Oklahoma from executing death row inmate Richard Glossip for his role in a 1997 murder-for-hire after the state's attorney general agreed Glossip's life should be spared.",
        "While it's rare for the conservative-dominated court to put executions on hold, it's even more unusual for a prosecutor to side with the inmate.Glossip had been scheduled to be put to death on May 18 despite statements by new Oklahoma Attorney General Gentner Drummond that Glossip did not receive a fair trial.An Oklahoma appeals court subsequently upheld Glossip's conviction and the state's pardon and parole board deadlocked in a vote to grant him clemency.The high court put the execution on hold indefinitely while it reviews the case. Justice Neil Gorsuch took no part in the decision, presumably because he dealt with the case earlier as an appeals court judge.\"There is nothing more harrowing than the thought of executing a man who the state now admits has never received a fair trial,\" Glossip attorney Don Knight said in a statement. \"Our hope is that the court will reverse the decision of the (Oklahoma Court of Criminal Appeals) and vacate Mr. Glossip´s conviction once and for all.\"",
        "Drummond, a Republican and the state's top prosecutor, supported a high-court reprieve for Glossip, telling the justices, \"Glossip´s trial was unfair and unreliable.\" He in a statement he was grateful for the high court's decision.\"I will continue working to ensure justice prevails in this important case,\" he said.",
        "But Drummond also has said he does not believe Glossip is innocent of the murder-for-hire killing of Glossip´s former boss, Barry Van Treese, in 1997. Another man, Justin Sneed, admitted robbing and killing Van Treese after Glossip promised to pay him $10,000. Sneed received a life sentence in exchange for his testimony and was the key witness against Glossip.Van Treese´s brother, Ken Van Treese, declined to comment on Friday's ruling.Former Oklahoma County District Attorney David Prater has long said he believes Glossip persuaded Sneed to kill Van Treese. He said that while Sneed's testimony was most compelling, there was plenty of evidence to corroborate it.\"When police came to talk to Glossip about Van Treese's whereabouts, he directed him away from the room he knew Van Treese was in,\" Prater said Friday. \"At any point, Glossip had the opportunity to tell the police that Sneed did this. He never did that. He even helped Sneed clean up everything.\"Prater said Sneed and Glossip also both had a large amount of cash that Prater said they stole from Van Treese's car.\"In light of Gentner Drummond's position regarding the stay, I don't feel like the Supreme Court had much of a choice,\" Prater said. \"But the truth will come out.\"",
        "Two separate independent investigations have revealed problems with the prosecution's case.Drummond said Sneed lied on the stand about his psychiatric condition and his reason for taking the mood-stabilizing drug lithium, and that prosecutors knew Sneed was lying.Also, evidence was destroyed, Drummond said.Some Republican state lawmakers who support the death penalty have joined the growing chorus of Glossip supporters who are seeking to overturn his conviction.\"We're just ecstatic,\" state Rep. Kevin McDugle said in a brief telephone interview on Friday.Glossip was spending his last day of contact visitation with his wife, Lea Glossip, at the prison when he learned of the news, she said.\"We were reaching the end of the visit where we would have to say our goodbyes when the warden came in, pulled us out into the hallway and told us the news,\" Lea Glossip said in a text message to The Associated Press.\"It truly feels like answered prayers.\"Glossip's case has been to the Supreme Court before. He was given a reprieve in 2015, although the court later ruled 5-4 against him in a case involving the drugs used in lethal executions.Glossip has been just hours away from being executed three separate times. His last scheduled execution, in September 2015, was halted just moments before he was to be led to the death chamber when prison officials realized they had received the wrong lethal drug. That mix-up helped prompt a nearly seven-year moratorium on the death penalty in Oklahoma.",
        "Glossip´s case attracted international attention after actress Susan Sarandon - who won an Academy Award for her portrayal of death penalty opponent Sister Helen Prejean in the 1995 movie \"Dead Man Walking\" - took up his cause in real life. Prejean herself has served as Glossip´s spiritual adviser and frequently visited him in prison. His case also was featured in the 2017 documentary film \"Killing Richard Glossip.\"Glossip is the first inmate who was granted a reprieve by the justices since their term began in October. The court rejected pleas from 15 others, including Darryl B. Barwick, who was executed in Florida on Wednesday.But in a similar situation to Glossip's, the justices in January ordered a Texas appeals court to look again at the case of a death-row inmate who also had the backing of prosecutors. The inmate, Areli Escobar, had been convicted and sentenced to death based of forensic evidence that a judge later found to be flawed. But the Texas Court of Criminal Appeals overturned the judge´s order for a new trial, even though the newly elected prosecutor in Travis County, Texas, was no longer standing behind the conviction. When Escobar appealed to the Supreme Court, the prosecutor supported his bid. Escobar was not facing imminent execution.___",
        "Murphy reported from Oklahoma City."
    ]
}