{
    "articleURL": "/wires/reuters/article-12053467/Pirates-hope-turn-things-vs-Blue-Jays.html",
    "content": [
        "In a series that shaped up as a race to get things back on track, the visiting Toronto Blue Jays struck first, leaving the Pittsburgh Pirates still searching.",
        "Toronto won Friday 4-0 to end a five-game losing streak. The Pirates, in turn, lost their fifth in a row.Both teams had gotten off to strong starts in April before things turned in the new month.The Blue Jays broke loose Friday behind seven scoreless innings from Chris Bassitt and George Springer's two-run homer.\"George is what makes us go,\" Toronto manager John Schneider said. \"He's well aware of that. We're well aware of that.\"Springer said after the game that he has been battling an illness but has fed off encouragement from his teammates.\"I have a great group of guys ... who have had my back this whole time,\" Springer said. \"They're encouraging me to keep going.\"The Pirates not only were held to four hits Friday, but they also could not parlay those hits and four walks into anything. That was in large part because of some costly baserunning decisions.In the first, Ji Hwan Bae was thrown out trying to steal third with leading hitter Bryan Reynolds at the plate. In the second, Rodolfo Castro was thrown out at home trying to score from third on a wild pitch. And Carlos Santana tried to score from first on a Castro single in the fourth but was thrown out at home.",
        "\"We got over-aggressive and tried to create too much early on and ran into some bad outs,\" Pirates manager Derek Shelton said.\"Offensively, we just didn't find our groove. We're a little bit out of sync, and we've got to get back in sync. ... We need to get our timing back.\"Both teams are seeing injuries crop up.Before Friday's game, Toronto put reliever Zach Pop (right hamstring strain) on the 15-day IL and added Jay Jackson to the roster.Pittsburgh designated hitter Andrew McCutchen was a late scratch Friday because of a left ankle sprain and will be further evaluated Saturday, according to Shelton.That came not too long after Pirates starter Vince Velasquez went on the 15-day IL because of right elbow inflammation. He was replaced by Chase De Jong, who came off the IL and pitched a scoreless inning in relief Friday.In the eighth, Bae left Friday's game after he pulled up coming out of the batter's box on a groundout.\"His ankle grabbed on him,\" Shelton said of Bae.Saturday, Toronto is expected to start right-hander Jose Berrios (2-3, 5.29 ERA), with Pittsburgh going with right-hander Johan Oviedo (2-2, 4.78 ERA).Berrios, in his most recent outing, gave up five runs and 11 hits in 5 1/3 innings Monday against Boston without getting a decision. He had given up just three runs total over his previous three starts.",
        "Berrios is 1-0 with a 3.72 ERA in two career starts against the Pirates.Oviedo took the loss Sunday at Washington when he gave up seven runs and nine hits in 2 1/3 innings -- all season worsts.Oviedo has faced the Blue Jays once, a start in Toronto last Sept. 2 in his Pirates debut. He tossed three scoreless, no-hit innings, though Pittsburgh ultimately fell to the Blue Jays 4-0.--Field Level Media"
    ]
}