{
    "articleURL": "/news/article-12057529/Body-inside-car-Taylors-Hill-Melbourne.html",
    "content": [
        "Man dead after fatal shooting in MelbourneSecond crime scene set up 500m awayPolice probing links between four men in two vehicles An homicide investigation is underway after a man was shot inside a car in a suburban street.",
        "Police were called to Vaucluse Boulevard in Taylors Hill in Melbourne's north-west late Sunday night and found a man in the car had suffered gunshot wounds to his upper body.He was unable to be revived and died at the scene, despite paramedics' desperate attempts to save him.An SES tent was placed over the BMW sedan which had a large bullet hole in the passenger side on the windscreen.",
        "Vaucluse Boulevard remained cordoned off on Monday as forensic officers scoured the scene and interviewed residents. A second crime scene 500m away on Grange Terrace was also set up, where a white sedan with a damaged bonnet appears to have crashed on the one-way road. Detectives have since been told the BMW had been following the white Mitsubishi sedan through Taylors Hill prior to the incident.The Mitsubishi sedan crashed into bollards blocking vehicle access between Grange Terrace and Johnston Way.It's understood a man got out of the Mitsubishi and confronted the male driver and passenger in the BMW before firing a shot into the car.The passenger, who is still to be identified, died at the scene.",
        "Police are now trying to track down the male driver and passenger in the Mitsubishi and the BMW driver of the BMW, who left the area separately.",
        "No one else was injured.Investigators are yet to establish the exact circumstances but believe there's connection between the four occupants of the two vehicles.Shocked residents said they didn't hear anything during the night and don't believe the BMW belongs to anyone in the street.'I woke up and saw the blue light coming in through my window, but I didn't hear anything,' one woman told the Herald Sun.'I definitely didn't hear anything too loud last night, no gunshots or nothing. You get used to a bit of noise around here.'Another added: 'I heard the cars zooming past but didn't think it'd come to this.'Victoria Police are expect to provide a further update on Monday afternoon.Anyone who witnessed either incident or with further information is urged to contact Crime Stoppers."
    ]
}