{
    "articleURL": "/wires/pa/article-12046849/Flypast-scaled-cancelled-bad-weather--Ministry-Defence.html",
    "content": [
        "A flypast to celebrate the coronation could be scaled back and even cancelled in poor weather, the Ministry of Defence (MoD) said.",
        "Forecasters expect conditions in London to be cloudy and wet on Saturday, which could hamper the ability of pilots to fly safely.More than 60 aircraft from the Royal Navy, British Army and Royal Air Force – including the Red Arrows – are scheduled to fly over The Mall and Buckingham Palace at around 2.15pm.The King and Queen Consort are due to appear on the Palace balcony with other members of the royal family to watch the six-minute flypast.Asked about the potential for the flypast to be disrupted by the weather, an MoD spokesman told the PA news agency: “There are certain weather limits in terms of cloud base and visibility for a flypast involving a large number of aircraft which will need to be met.“The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.“If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.",
        "“Clearly there are many things the MoD does control, but the weather is not one of them.“Safety will always be our primary concern.”The decision on whether to go ahead with the flypast can be made by the RAF’s Air Vice-Marshal Mark Flewin, Air Officer Commanding No 1 Group, or the aircraft pilots.",
        "The Met Office expects Saturday to be a “cloudy, wet day” across large parts of the UK, with rain falling on London “by around lunchtime”.There were fears the flypast for the late Queen’s coronation in June 1953 would be called off due to bad weather, but after conditions improved it went ahead at 5.15pm after a delay."
    ]
}