{
    "articleURL": "/wires/reuters/article-12061139/GRAINS-Chicago-corn-ends-flat-soy-dips-US-planting-progresses.html",
    "content": [
        "No agreement to extend Ukrainian export shipping",
        "Ukraine deal expires May 18USDA releases weekly crop report progress(Adds closing prices, U.S. crop report data, changes lead, changes headline)By Cassandra GarrisonMEXICO CITY, May 8 (Reuters) - Chicago soybeans ended down and corn was flat on Monday, as U.S. planting progressed ahead of last year and uncertainty over whether Ukraine's safe shipping agreement for grain exports will be extended with the deal set to expire on May 18.Corn, one of the crops exported out of Ukraine, ended flat at $5.96-1/2 a bushel while soybeans settled down 2-3/4 cents at $14.33-3/4 a bushel.The U.S. Agriculture Department said in its weekly crop progress report that 49% of the U.S. corn crop had been planted compared to 21% a year earlier, while 35% of soybeans were planted compared to 11% this time last year.The report also showed a slight improvement to winter wheat ratings, though 29% in good and excellent condition was less than what analysts had expected.\"There's lots of rhetoric out there about the hard red winter wheat crop in dire conditions, and whatever rain that materializes over the near term for Oklahoma and Kansas, it's probably too little too late,\" said Tom Fritz, a partner with EFG Group in Chicago.Chicago Board of Trade most-active wheat lost 6-1/4 cents to settle at $6.54 a bushel, after hitting a two-week high of $6.69 a bushel earlier in the session.",
        "Ukraine's reconstruction ministry said Russia has effectively stopped the Black sea grain deal by refusing to register incoming vessels.Moscow has threatened to quit the agreement, while Turkey and the United Nations are working to extend it.Ukraine is also a wheat exporter.\"Russia is no longer inspecting incoming ships to the Ukrainian ports, so it pretty much shuts down exports coming out of Ukraine,\" Fritz said.The agricultural markets were looking ahead to a monthly U.S. crop production report on May 12. (Reporting by Cassandra Garrison in Mexico City, Michael Hogan in Hamburg, additional reporting by Naveen Thukral in Singapore; editing by Susan Fenton, Barbara Lewis and Grant McCool)"
    ]
}