{
    "articleURL": "/wires/ap/article-12058399/Its-Pulitzer-Prize-day-honoring-journalisms-best-work.html",
    "content": [
        "NEW YORK (AP) - The Associated Press won two Pulitzer Prizes on Monday for its coverage of the war in Ukraine, earning recognition for its breaking news photography of the Russian invasion, as well as the prestigious public service award for its startling - and exclusive - dispatches from the besieged port city of Mariupol.",
        "AP journalists were also finalists in two Pulitzer categories, for breaking news photography of Sri Lanka´s political crisis and for feature photography of the Ukraine war's impact on older people.For the public service award, the Pulitzer judges acknowledged AP - which had the only international journalists in Mariupol for nearly three weeks - for capturing notable images of an injured, pregnant woman being rushed to medical help and Russia firing on civilian targets.AP´s Mariupol team was made up of videojournalist Mstyslav Chernov, photographer Evgeniy Maloletka and video producer Vasilisa Stepanenko on the ground in the besieged city, and reporter Lori Hinnant in Paris.Other winners of two Pulitzers apiece were AL.com, of Birmingham, Alabama, the Los Angeles Times, The New York Times and The Washington Post.The Pulitzers honor the best in journalism from 2022 in 15 categories, as well as eight arts categories focused on books, music and theater. The public service winner receives a gold medal. All other winners receive $15,000.",
        "Kyle Whitmire, of AL.com, won a commentary award for \"measured and persuasive columns\" about Alabama´s Confederate heritage and a legacy of racism.His Alabama colleagues John Archibald, Ashley Remkus, Ramsey Archibald and Challen Stephens won a local reporting award for a probe into a local police force.",
        "It was a second Pulitzer win for John Archibald, who previously won in 2018 for commentary, and the first for his son, Ramsey Archibald. Remkus and Stephens were also picking up their second Pulitzers, after being part of a team that won in 2021 for national reporting.\"The recognition is tremendous and we´re grateful our work is being honored on the national stage like this,\" Kelly Ann Scott, editor in chief and vice president of Alabama Media Group, said in a statement. \"This is local journalism at its best - and local journalism is the heartbeat of this country´s journalism in general.\"The New York Times was honored with an international reporting award for its coverage of Russian killings in the Ukrainian town of Bucha. Pulitzers were also given for work surrounding the U.S. Supreme Court´s decision overturning the Roe v. Wade abortion standard, the government´s policy of child separation at the border, and welfare spending in Mississippi.The Washington Post´s Caroline Kitchener won for \"unflinching reporting\" on the consequences of the abortion decision, including the story of a Texas teenager who gave birth to twins after new restrictions denied her an abortion. The Post´s Eli Saslow won for feature writing.The Los Angeles Times won for breaking news for its stories revealing a secretly recorded conversation with city officials making racist comments. The newspaper´s Christina House won for feature photography, for her images of a 22-year-old pregnant woman living on the street.",
        "The AP coverage of Mariupol, according to the Ukrainian city´s deputy mayor, focused the world´s attention on the devastation there and ultimately pressured Russians to open an evacuation route, saving thousands of civilian lives.\"They told the world of the human toll of this war in its earliest days,\" AP Executive Editor Julie Pace said during a staff Zoom celebration. \"They served as a counterweight against Russian disinformation, and they helped open up a humanitarian corridor out of Mariupol with the power of their work.\"The AP team that won for breaking news photography included Maloletka, who was part of the Mariupol coverage, along with Bernat Armangue, Emilio Morenatti, Felipe Dana, Nariman El-Mofty, Rodrigo Abd and Vadim Ghirda.AP's director of photography, David Ake, credited winners in the breaking news photography category for simply staying put in a war zone to bear witness.\"You can´t make the moment that captures the world if you´re not there, and being there is often dirty and difficult and dangerous,\" he said.Pulitzer Prize Board co-chair Neil Brown highlighted the dangers faced by journalists, noting the imprisonment in Russia of Wall Street Journal reporter Evan Gershkovich on spying charges, which his family and the newspaper vehemently deny. Brown said the board demands Gershkovich's immediate release.",
        "The Atlantic won the Pulitzer for explanatory journalism for Caitlin Dickerson´s exhaustive probe of the Trump administration policy of separating parents from children at the U.S. border.The Wall Street Journal won for its investigation into federal officials holding stock that could have been affected by government action, including dozens who reported trading stock in companies shortly before their own agencies announced enforcement actions against them.Anna Wolfe, of Mississippi Today, was honored for her reporting on a former Mississippi governor sending federal welfare money to family and friends, including NFL Hall of Famer Brett Favre.Andrew Long Chu, of New York magazine, won a Pulitzer for criticism. Nancy Ancrum, Amy Driscoll, Luisa Yanez, Isadora Rangell and Lauren Constantino, of the Miami Herald, won for editorial writing. Mona Chalabi, a contributor to The New York Times, won for illustrated reporting and commentary. The staff of Gimlet Media won for audio reporting.The prizes were established in the will of newspaper publisher Joseph Pulitzer and first awarded in 1917."
    ]
}