{
    "articleURL": "/wires/reuters/article-12051713/Walmart-keeps-grocery-prices-steady-amid-inflation-antitrust-claims.html",
    "content": [
        "Dataweave analyzed prices of 589 products over 14-month period",
        "Walmart's avg. basket price rose 3% vs avg. inflation of 7.5%Walmart outpriced rivals on basket of food items where inflation was fiercestBy Siddharth CavaleNEW YORK, May 5 (Reuters) - A new analysis of Walmart's pricing strategy reveals it has consistently kept grocery prices lower than competitors while generally hiking prices at rates far below U.S. inflation, even while the firm now faces allegations of using its clout to gain unfair advantages over rivals.Data analytics firm Dataweave compared the prices of 589 name-brand products in 34 categories, including coffee, soup, cereals, baking goods, batteries, personal care items and pet food exclusively for Reuters.The firm pulled and examined prices at both store and online properties of Walmart, Kroger, Target and Amazon, for the items every day to arrive at one average price for each month between January 2022 and the end of February 2023.During the period, while U.S. inflation averaged 7.5% Walmart kept prices steady, the Dataweave analysis shows.Walmart stores and Walmart.com merchandise rose, on average, 3% in price overall in the 14 months through February 2023, compared to a 7.5% increase for the same products sold at Amazon and 9% at Kroger and Target, said Krishnan Thyagarajan, chief operating officer at Dataweave.Walmart reported net profits of $11.3 billion for its year ended Jan. 31, 2023, a 19% drop compared to last year, mainly due to restructuring charges related to its exit from the UK and Japan and a $3.3 billion opioid settlement. Gross margins also fell about 1 percentage point to 24.1%",
        "Among U.S. brick and mortar retailers, Walmart commands a 42% share, though its market share online is just 6.3% vs Amazon's 37.8%, according to market research firms. With over $400 billion in market value and operations spanning from Latin America to China, Walmart for years has used its heft to negotiate the lowest prices from suppliers.Its executives told investors this year they were leveraging metrics, including best-performing merchandise and best-performing categories, and were scrutinizing commodity costs item by item in negotiations with suppliers.Walmart in April claimed that automation in its distribution centers would also help maintain price gaps against competitors.Walmart already accounts for $1 out of every $4 spent on groceries, which has been a major focus for the world's largest retailer.U.S. inflation in 2022 soared to the highest levels since the early 1980s, making everything from food and clothing to gas and electronics more expensive.On a sample basket of 10 food items, including Kellogg's Pringles potato chips, Kraft Heinz's Miracle Whip Mayo and Del Monte's Green Beans, Walmart's prices were 4.6% cheaper than Target, 14.8% cheaper than Kroger and 17% cheaper than Amazon.This was during a time when world food prices hit record highs and U.S. food-at-home prices rose in the double digits.Food-at-home prices, or prices of food bought at grocery stores and supermarkets, are expected to rise a further 6.6% this year, according to the U.S. Department of Agriculture.",
        "\"The data shows Walmart's power over suppliers and its potential to gain market share from rivals like Amazon,\" said Parul Jain, a professor of finance and economics at Rutgers Business School, who reviewed the data for Reuters.Walmart, in an email to Reuters, said the data \"supports our commitment to Every Day Low Price (EDLP),\" referring to its strategy of setting low prices on products instead of relying on discounts and promotions to drive sales.The National Grocers' Association and the Wholesale Grocers Association, which represent independent and regional U.S. grocery chains, have in recent years been urging federal lawmakers and regulators to clamp down on the clout grocery giants including Walmart wield over suppliers and to more stringently enforce the Robinson-Patman Act, which prohibits price discrimination by manufacturers against retailers.Last week, consumers and retailers sued Walmart and battery maker Energizer for allegedly conspiring to raise prices of disposable batteries, in a program Energizer dubbed internally as Project Atlas. According to the lawsuit, Energizer agreed \"under pressure from Walmart\" to inflate wholesale battery practices for other retailers starting around January 2018 and required those retailers not to undercut Walmart on price.In an email to Reuters on Thursday, Walmart said it takes \"allegations like this seriously and will respond in court as appropriate.\"",
        "The data set, which included batteries in the basket of goods, showed that Walmart sold Energizer batteries at a significant discount to rivals. A 2-pack of Alkaline A23 batteries, for example, sold for $4.49 at Walmart vs. $4.64 at Amazon and $5.22 at Target. Similarly, at least two different types of Energizer coin batteries sold at Walmart were found to be between 30% and 35% cheaper than the next lowest priced rival.(Reporting by Siddharth Cavale in New York; Editing by Vanessa O'Connell and Josie Kao)"
    ]
}