{
    "articleURL": "/news/article-12047005/Is-Sainsburys-open-Coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        "MailOnline reveals Sainsbury's opening times for coronation and bank holiday With King Charles' coronation fast approaching, Sainsbury's has revealed its opening hours for the upcoming Bank Holiday. ",
        "Your nearest Sainsbury's store may be operating different opening hours, depending upon its size and location. The Bank Holiday for the coronation is the second to fall in May 2023, after the traditional early May Bank Holiday on 1 May. So, will Sainsbury's be open on coronation day? And what about hours on the Bank Holiday? MailOnline reveals all you need to know about Sainsbury's opening times during the coronation weekend. ",
        "Is Sainsbury's open on coronation day?On the day of Charles' coronation, Sainsbury's larger stores will be open at either 6am or 7am and will shut at either 10pm or 11pm. On Sunday, 7 May, Sainsbury's stores in England and Wales will be open from 10am to 4pm.However, stores in Scotland will operate with longer opening hours, from 8am until 8pm, with some open until 10pm on Sunday.Is Sainsbury's open on bank holiday Monday?On Monday, 8 May, the majority of its bigger stores will open their doors from 8am until 8pm, with Scottish branches staying open unitl 10pm.Smaller shops will be open from 7am until either 10pm or 11pm.Shoppers are encouraged to check with their local branch to find out more about exact opening times.To verify the opening hours of your nearest Sainsbury's branch, use their handy store locator tool, which can be found here.What is Nectar prices? In April 2023, Sainsbury's launched Nectar prices, a discount scheme similar to Tesco's Clubcard offering. ",
        "It offers customers discounts on the products in major stores and online for members of its scheme, as it aims to rival the perks offered by competitors.",
        "MailOnline recently pitted the two schemes against each other to see which of the Clubcard or Nectar prices schemes would save you more money. However, using a loyalty scheme does not guarantee you are getting the cheapest deals. Ele Clark, retail editor at Which?, says: 'The competition between supermarkets over loyalty card schemes is fierce. 'These cards can be a good way for people to save money with shops they already use.'However, these savings could easily be cancelled out if the shop's prices are higher than those of its competitors, so it is vital that shoppers are able to find out whether they are getting value for money.'"
    ]
}