{
    "articleURL": "/wires/afp/article-12038387/US-lawmakers-urge-scrutiny-fashion-firm-Shein-forced-labor-reports.html",
    "content": [
        "Multiple groups of US lawmakers have sought reassurances this week about clothing giant Shein and other brands facing allegations their products use forced Chinese labor or material from regions where such conditions allegedly occur.",
        "On Tuesday, a group of lawmakers sent letters to the CEOs of Adidas, Nike, Shein and Chinese shopping app Temu with questions about their supply chains.In the letters, seen by AFP, the House Select Committee on the Strategic Competition between the United States and the Chinese Communist Party cited witness testimony that alleged Nike and Adidas might be sourcing materials from China's Xinjiang region, in possible violation of US law.\"We would like to offer\" Nike and Adidas \"an opportunity to respond to these serious allegations and to provide information regarding\" compliance with the Uyghur Forced Labor Prevention Act, the letters read.The committee also reached out to Temu and Shein, asking their executives to explain how they verify the compliance of their supply chains with US law.The letters to brands came just a day after a separate bipartisan group of US lawmakers urged securities regulators to require Shein to attest it does not use forced Chinese labor as a condition of a public offering.Citing reports that the fast-growing discount apparel company uses cotton from the Xinjiang Uyghur Autonomous Region, two dozen members of the House of Representatives urged action from the head of the US Securities and Exchange Commission.\"Shein is aggressively raising capital and plans to execute an IPO before the end of this calendar year,\" they said in a May 1 letter.",
        "\"We request that you set forth regulations and mandate Shein to certify via independent verification that the company does not use Uyghur forced labor as a condition of being registered to issue securities in the United States.\"- Fast fashion -Human rights groups say China's Muslim-majority Uyghurs are subjected to mass incarceration in forced labor camps and banned from expressing their culture.Beijing says the ethnic minority is not being repressed and that any security measures in their northwestern region of Xinjiang are a response to a terrorism threat.The letter was organized by Virginia Democrat Jennifer Wexton and Tennessee Republican John Rose and signed by 24 House members.A Shein spokesperson said the company has no suppliers in the Xinjiang Region and that it has \"zero tolerance\" for forced labor.\"We take visibility across our entire supply chain seriously, and we are committed to respecting human rights and adhering to local laws in each market we operate in,\" the spokesperson said.\"Our suppliers must adhere to a strict code of conduct that is aligned to the International Labor Organization's core conventions.\"Founded in 2008 in China and currently based in Singapore, Shein has been called an example of \"fast fashion,\" utilizing TikTok and other online platforms to market its goods."
    ]
}