{
    "articleURL": "/wires/pa/article-12060697/Residents-Walford-host-coronation-themed-party-EastEnders-special.html",
    "content": [
        "EastEnders has honoured the coronation of the King with an episode featuring a street party for the Square amid the royal celebrations.",
        "The residents of Albert Square crowded around a TV in The Old Vic, which was decorated in coronation flags and Union flag colours, watching the moment Charles was crowned in Westminster Abbey.Tuesday’s episode begins with Linda Carter (Kellie Bright) telling children that the coronation is a “very special day”, particularly as during the pandemic it could not have happened.She said: “We were all stuck at home on our own weren’t we, school online, no weddings or funerals, clapping on the doorstep and putting rainbows in our windows.“It was a hard time but our Queen said then, she told us on the telly, better days will return. We will meet again.“And though she may not be here, she was right weren’t she. A coronation. Ain’t many people who can remember the last time this happened.",
        "“Cos it don’t matter what’s going on in your own life, don’t matter how rich or poor you are, today King Charles III gets crowned. And that is tradition.“In my book, it’s part of being British.”The episode features a talent show put on by the residents with Kim Fox (Tameka Empson) and Felix Baker as drag queen Tara Misu (Matthew Morrison) sporting matching blue dresses, orange gloves and blonde wigs singing Dusty Springfield’s I Only Want To Be With You.",
        "There is also a “best crown” competition which sees the children of Walford showing off their handmade creations and a food spread worthy of a king at the street party.It comes almost a year after Charles and Camilla made a cameo appearance in the BBC soap opera, surprising the square after Mick Carter (Danny Dyer) decided to throw a street party in honour of the Queen’s Platinum Jubilee."
    ]
}