{
    "articleURL": "/wires/ap/article-12043993/Nebraska-Democrats-look-2024-Tuesday-election-wins.html",
    "content": [
        "OMAHA, Neb. (AP) - A decisive win by Democrats in hotly-contested local races in Lincoln could be indicative of the party´s chances next year, including in a presidential election where Nebraska´s Omaha-centered 2nd Congressional District has twice given an electoral vote to Democratic presidential candidates.",
        "Nebraska and Maine are the only two states that allow their electoral votes to be split in presidential elections. That system has confounded Nebraska Republicans, who have been unable to force the state into a winner-take-all system since Barack Obama became the first presidential contender to shave off one of Nebraska's five electoral votes in 2008. It happened again in 2020, when President Joe Biden captured Nebraska's 2nd District electoral vote.Democratic Party leaders see an opportunity to capitalize on Republicans' hard shift to the right, particularly on religious and culture war issues issues - including the recent push across red states to target the transgender and LGBTQ+ community members, ban books from schools and libraries and vastly restrict abortion access. Those efforts are unpopular with the majority of voters, Nebraska Democratic Party Chairwoman Jane Kleeb said Wednesday.\"Women´s reproductive freedom will continue to be a key issue that voters want a clear answer from candidates on where they stand, and Republicans are simply out of step with the majority of Nebraskans,\" Kleeb said.Lincoln Mayor Leirion Gaylor Baird, a Democrat, handily won a second term Tuesday, despite an aggressive push by Republicans to oust her in favor of former Lincoln state Sen. Suzanne Geist, who saw more than $1.5 million pumped into her campaign by GOP donors. That included hundreds of thousands of dollars each by the family of former Gov. Pete Ricketts and the Peed family that owns publishing company Sandhills Global, based in Lincoln.",
        "Geist had stepped down from her legislative seat last month to focus on the mayor's race. Campaign ads supporting her painted Lincoln as an unsafe, crime-ridden city under Baird and blanketed airways for weeks before Tuesday's election.Lincoln, Nebraska's capital and home of the University of Nebraska-Lincoln, is one of the few communities in the conservative state where Democrats can claim regular election victories. But Tuesday's win stood out for the number wins Democrats scored, including 3 of 4 contested City Council seats, giving Democrats a dominant 6-1 advantage. And Republicans lost all three of the contested local school board seats.The only other area of the state where Democrats have seen some success in the last three decades is in Omaha, the state's largest city with more than 850,000 in the city and surrounding suburbs.\"We´ve learned many lessons over the last few cycles of what works and what we need to improve on,\" Kleeb said. \"As the Democratic Party, we are going to continue to build in the blue dots of Lincoln and Omaha while making sure we invest in rural towns that deeply care about public schools, access to abortion and protecting our democracy.\"The Nebraska Republican Party didn't address its Lincoln losses on its Twitter or Facebook pages, and state party chairman Eric Underwood did not immediately return a message Wednesday seeking comment.",
        "But the party has made no secret of its frustration over losing Omaha's electoral vote to Democrats in recent presidential elections. Republicans tried for nine years after first splitting the state's electoral votes to revert to a winner-take-all system, but those proposals failed year after year. The effort was resurrected after Biden won the Omaha vote in 2020, but it has gained little traction. A bill introduced this year has been stuck in committee.Republicans have instead relied on redistricting to curtail Democrats' progress in the 2nd District, having twice redrawn the district's boundaries since 2008 to favor Republican candidates.But even some Republcians have said that might not be enough to overcome a turnout of voters soured on the hot-button issues targeted by GOP-led legislatures this year.Nebraska Sen. Merv Riepe publicly warned his fellow Republican colleagues last week that efforts to ban abortion will cost them at the polls next year.Riepe, an 80-year-old former hospital administrator, had initially signed on as a cosponsor to a Nebraska bill that would effectively ban abortions as six weeks of pregnancy, with exceptions for rape, incest and to save the life of the mother. But he later refused to give the measure the final vote it needed to survive a filibuster over concerns the ban was too strict.",
        "Riepe pointed to his own election last year against a Democrat who made abortion rights central to her campaign, noting that his margin of victory dropped from 27 percentage points in the May primary election, which occurred before the U.S. Supreme Court overturned Roe v. Wade, to under 5 percentage points in the general election after the fall of Roe.\"This made the message clear to me how critical abortion will be in 2024,\" he said. \"We must embrace the future of reproductive rights.\""
    ]
}