{
    "articleURL": "/money/saving/article-12038099/Irate-customers-reveal-NS-service-collapsed-chaos.html",
    "content": [
        "Customers have been kept on hold for up to half an hour - before being cut off Others locked out of accounts for weeks due to issues with new security system Failings are a blow to boss Dax Harkins, who took over as chief exec last monthNational Savings &amp; Investments is descending into customer service chaos, Money Mail can reveal. ",
        "We have been inundated with emails and letters from customers who are at their wits’ end after chaotic dealings with NS&amp;I.Blunders include:Keeping customers on hold for up to half an hour — and then cutting them off.Locking customers out of their account for weeks due to issues with its new security system.Taking months to hand a deceased customer’s savings to his widow after losing an original death certificate.Rejecting applications for Premium Bonds without any explanation.",
        "Frustrated customers are also piling onto review website Trustpilot to share their complaints. NS&amp;I currently scores a rock-bottom one star out of five on the website.It has not received a single review above one star for the past ten days.The failings mark a dismal start for new boss Dax Harkins, who took over as chief executive of the state-owned savings provider last month.It also casts a shadow over recent improvements to the total prizes offered to Premium Bond savers.NS&amp;I increased the amount it pays out in prizes five times in the year to March.The number of £100,000 and £50,000 prizes also increased tenfold in last month’s draw, in comparison with the number available this time last year.Particularly worrying is escalating call times at the Treasury-backed savings provider, which 21 million customers entrust with their hard-earned cash.Money Mail believes that nobody should be left on hold for any longer than ten minutes.In our Pick Up Or Pay Up campaign, we are calling for new laws to force Britain’s big businesses to pick up the phone — or face costly fines.NS&amp;I outsources its call centre to French technology company Atos. However, this is not the first time the group has suffered failings in its customer services.",
        "Money Mail understands NS&amp;I is currently reviewing its contract with Atos, which is due to end next year.Last month, our sister paper The Mail on Sunday highlighted the plight of exasperated customers who have had applications for Premium Bonds rejected and their cash returned without any explanation from NS&amp;I.Following this, scores of customers have contacted us to share similar woeful stories and other customer service complaints.Lost my husband’s death certificateReader Belinda Scottow has spent months and waited hours on hold to NS&amp;I, pleading with customer services to return her late husband’s £5,200 Premium Bond holdings.Her husband, Nigel, died suddenly of heart failure last May at the age of 66, on the morning of their daughter’s wedding in Italy.The family went ahead with the marriage ceremony, knowing it is what Nigel would have wished.Belinda, a retired hotel cook, has been tying up Nigel’s affairs and sorting through paperwork since January.But, instead of helping Belinda at this difficult time, NS&amp;I has lost Nigel’s original death certificate and still has not returned his Premium Bond money.Without this vital paperwork Belinda would have been unable to sort out her husband’s probate — the legal and financial process of dealing with his personal matters, including money in the bank, property ownership and bills.",
        "Fortunately, she had taken copies of the original death certificate — and was later able to get them certified by a solicitor for £30.But without having the foresight to take a copy, Belinda would have been stranded without any access to her husband’s frozen finances.‘I sent the Italian death certificate and a UK coroner’s report confirming his death at the end of January by recorded delivery,’ says Belinda.‘But by March — having heard nothing but excuses as to why they still had no record of the paperwork — I realised they had lost it. But no one will take responsibility.‘Staff just try to fob me off claiming a “system scanning issue” is responsible — whatever on earth that means.‘It is deeply upsetting to have lost my husband’s personal paperwork. I have been offered £125 in compensation, but this just feels like a cheap insult.’NS&amp;I is taking so long to return the Premium Bonds that in the meantime, one of Nigel’s bonds has come up trumps with a win of £100.Belinda adds: ‘Now NS&amp;I is demanding a copy of the will as proof before returning the money. But obviously, as it has already lost a death certificate and coroner’s report, I am loath to send it off.’",
        "Ann, 82, and John, 84 have an old phone number registered to their account so they do not receive the passcodes.Ann has been trying to update their phone number since March. ‘I hung on the phone for half an hour before being automatically cut off,’ she says. ‘Then, I went online but the website told me to call the same customer service number that was not answering my call.’Ann, of Abingdon in Oxfordshire, says she has called NS&amp;I over several days at various times of the day. Each time she was cut off after waiting half an hour on the line.She adds: ‘I am trapped in phone purgatory. A customer service that fails to offer any service is simply not fit for purpose. It makes you wonder how many of its staff are actually at work answering calls.’",
        "Granddaughter can’t get winningsJohn Rees from Bath in Somerset bought £200 of Premium Bonds on the birth of his granddaughter, Emily. Now 23, Emily has just won prizes for the first time in her life, but NS&amp;I has yet to hand them over.Emily now lives with her parents in Canada, so John is helping her to get access to her winnings.But despite his best efforts, NS&amp;I has not paid up.Retired teacher John, 90, says: ‘Emily won £50 at the start of the year and £100 in March. The only problem is she cannot get hold of the prizes. I called on her behalf but spent hours on the phone unable to get through to NS&amp;I.",
        "‘It is clearly short-staffed, or no one bothered to answer my call despite me hanging on the line for half an hour at a time.’John has also written letters to the state savings bank.He says: ‘All I get in return is a standard letter, which states: “Sorry, we cannot disclose the details of any other bond holders”. I did not ask for this and only want her to get the prizes.’",
        "Locked out of my £50,000 accountCustomers are also experiencing problems with new security measures for NS&amp;I’s website, which are designed to stamp out fraud.NS&amp;I introduced a two-factor authentication process in August last year. Now, when a customer tries to log on to their account, NS&amp;I sends them a one-time passcode to their phone number to make sure it’s really them.The passcode is either sent as a text message or automated phone call.Adrian Smith [not his real name] has also been locked out of his account since mid-April and has been unable to access his £50,000 of Premium Bonds.The 59-year-old maintenance engineer from Bristol says: ‘I tried to log into my account numerous times using the two-factor security process, but my password would not work.‘I spent an hour on the phone and spoke to four different members of staff to reset my password. But they must have mistyped the new password because the next time I tried to log in it was rejected and I was told no more attempts could be made to access my money online.’",
        "Adrian endured several more fruitless phone calls, and was told he would be emailed a change of details form. ‘But so far, nothing,’ he says.This is not the first time NS&amp;I’s customer service has descended into chaos.Three years ago, it handed out £1 million in compensation to customers for poor service after receiving more than 40,000 complaints. At the time, NS&amp;I apologised for its errors and said it had learned from its mistakes.Of the latest failures, NS&amp;I says: ‘We are sorry that some of your readers have not received the high standard of service that they have come to expect from us.‘In April the average speed to answer phone calls was ten minutes but some times of the day are busier than others.’ NS&amp;I adds: ‘In regard to the bereavement claims process, we may require a copy of a will, probate or death certificate.‘These documents will be returned to the person that sent them to us.’ And of its anti-fraud measures, the bank says: ‘Last year, we added two-factor authentication to our website as part of our security. More than three million online customers have successfully enrolled. Those who have not been successful can call customer services on 08085 007 007.’",
        "PGRpdiBkYXRhLW1vZHVsZS12ZXJzaW9uPTEuNC4wIGRhdGEtbW9sLWZlLXhwbW9kdWxlLXNhdmluZ3MtbmV3c2xldHRlciBkYXRhLXBsYXRmb3JtPWlvcyBkYXRhLW5ld3NsZXR0ZXI9InNhdmluZ3MiIGRhdGEtY29sb3ItdGhlbWU9cHVycGxlIGRhdGEtZm9ybS1hY3Rpb24tdXJsPSJodHRwczovL2xpbmsubmV3cy50aGlzaXNtb25leS5jby51ay9zL1RoaXMrSXMrTW9uZXkrLStTYXZpbmdzK0FsZXJ0cyIgZGF0YS1wcml2YWN5LXBvbGljeS11cmw9Imh0dHBzOi8vd3d3LnRoaXNpc21vbmV5LmNvLnVrL2hvbWUvYXJ0aWNsZS03NzU5MjczL1ByaXZhY3ktQ29va2llcy1Qb2xpY3ktUG9saWN5Lmh0bWwiPjwvZGl2Pg==",
        "Savings rates are on the rise after many years in the doldrums, with savers now able to bag deals as high as 5 per cent.But many people still have money languishing in old sub-1 per cent paying savings accounts. Checking top rates is essential, but can also possible to make life easier to manage your savings pots in one place.  Over the past few years a number of savings platforms have launched, offering savers the option to switch as and when better deals become available and manage accounts from different banks and building societies.They each work slightly differently and include their own exclusives. To find out more and check out what's on offer visit our special savings platform top rates tables.You can also view our comprehensive best buy savings tables, independently curated by savings guru Sylvia Morris and the This is Money team.Savings essentials:&gt; Compare best savings rates in our tables &gt; Check the best rates from savings platforms &gt; Sign up to Savings Alerts to get top deals sent to you",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}