{
    "articleURL": "/wires/pa/article-12059901/Paul-Hurst-hails-huge-effort-Grimsby-finish-impressive-season-victory.html",
    "content": [
        "Grimsby manager Paul Hurst praised the huge effort his players have put in this season after closing out their first campaign back in the Football League with a 1-0 win against AFC Wimbledon.",
        "An own goal from Isaac Ogundere on seven minutes settled the scores at Blundell Park as Grimsby finished 11th in the standings to complement their FA Cup heroics, after they defied the odds to reach the quarter-final stage.Victory over Wimbledon – who ended up 21st in the table after going seven games without a win – was their 59th match in all competitions and the promotion winners from last term can finally put their feet up.Hurst said: “It was nice to finish with a win to make sure we finish in the top half.“It’s our best league finish for some time and that’s what I’ve been saying.“Of course, like the fans, I would like it if we could finish a bit higher, but overall in our first season back the idea is to over-achieve, and I think we have done that to a certain degree as a group and a club.",
        "“Add in the obvious cup run and it’s been a good season. It’s been a huge effort and maybe it’s nice that we can finally have a little breather.”The goal came after seven minutes when Danilo Orsi saw his low cross deflected past Nathan Broome by Ogundere and into the net.Josh Davison forced Max Crocombe into a decent save with his half-volley soon after the restart and the Wimbledon frontman also sent a powerful drive just wide on the hour mark.",
        "Grimsby went close to grabbing their second when Gavan Holohan and George Lloyd had quickfire attempts blocked in a penalty-area scramble, while Orsi headed wide after combining with substitute Otis Khan in the closing stages.Wimbledon manager Johnnie Jackson added: “It probably sums our season up.“It was another really close game, we conceded a freak goal at the start and it was a major setback for us, but we competed really well.“We had some really good moments in the game and just lacked some quality, whether it was with our final pass or shot selection.“I thought we worked the ball in some good areas but didn’t make the most of that and we deserved something out of the game.“We might have had two penalties in that second half, as well, so to lose to that and a freak goal stings a bit.”"
    ]
}