{
    "articleURL": "/wires/reuters/article-12041677/Israel-says-discussing-possible-direct-Haj-flights-Saudi-Arabia.html",
    "content": [
        "By Dan Williams",
        "JERUSALEM, May 3 (Reuters) - Israel voiced hope on Wednesday that Saudi authorities would admit direct flights for its Muslim citizens who want to make the Haj pilgrimage, which begins next month, in what would mark another step toward normalising relations.Saudia Arabia signalled approval for Israel's U.S.-sponsored forging of ties with Gulf neighbours United Arab Emirates and Bahrain in 2020 but has held off on following suit, saying Palestinian goals for statehood should be addressed first.Any such prospects have been further clouded, however, by Riyadh's strains with U.S. President Joe Biden, its recent fence-mending with regional rival Iran - a foe of Israel, and the rise of Benjamin Netanyahu's hard-right Israeli government.Netanyahu's centrist predecessor, Yair Lapid, said on March 10 that, as prime minister last year, he secured Saudi consent for what would be the first direct Haj flights from Israel, some 18% of whose population are Muslim.A U.S. official also predicted such flights in a June interview with Reuters. But Riyadh has not offered confirmation.Asked whether the direct flights would happen for the coming June-August pilgrimage to the holy Saudi city of Mecca, Israeli Foreign Minister Eli Cohen said a request had been submitted.\"This issue is under discussion. I cannot tell you if there is any progress,\" he said in an interview with Israel's Army Radio. \"But with that, I am optimistic that we can advance peace with Saudi Arabia.\"",
        "Muslims from Israel and the Palestinian territories currently travel to Mecca through third-party countries, which can spell additional expense and bother.Saudi Arabia has been allowing Israeli airlines to overfly it to UAE and Bahrain since 2020, a corridor that it and next-door Oman have since expandedto include other destinations. (Writing by Dan Williams; Editing by Angus MacSwan)"
    ]
}