{
    "articleURL": "/news/article-12057779/Jock-Zonfrillo-death-Disgusting-fake-rumour-spreading-Masterchef-stars-demise.html",
    "content": [
        "Conspiracy theorists link death with Covid jabThey have been slammed for the fake claims Anti-vaccine trolls have been branded 'opportunistic scum' after they hijacked the tragic death of Jock Zonfrillo to falsely claim he had died from the Covid-19 jab.",
        "Within hours of the Masterchef host's tragic death in Melbourne on May 1, conspiracy theorists began to claim the vaccine had killed the celebrity chef.The world-renowned chef died at the age of 46 from natural causes, with no suspicious circumstances, after having secretly fought bowel cancer for years.He had also battled drug addiction in his youth and later suffered from mental health issues and anxiety. But anti-vaxxers falsely claimed the sudden death - on the day of MasterChef's new season launch - must be linked to the Scots-born chef being fully vaccinated against Covid.",
        "'Pretty sure they could put this to rest by saying he wasn’t death jabbed, but he likely was, since they won’t,' tweeted an anti-vaxxer.'Being in denial doesn’t help anyone, the death jab is just that'Another posted: 'He didn’t take his life like legacy media tried to portray, and the rest of this headline says he might have been battling cancer. Might. 'He was fully vaxxed and died suddenly. These are indisputable facts. Rip.' One added: 'We're not saying HOW he died in our news reports so we're going to stack it full of conjecture - ie likely killed 12,000 in excess mortality.'MasterChef judge Jock Zonfrillo DIES SUDDENLY just like every Healthy Young Person right?'",
        "But the sick claims have been slammed by fans of the show and said those closest to chef are incensed by the 'disgusting and fake rumour'.",
        "'Of course the putrid cookers [conspiracy theorists] have already come out saying it was the covid vaccine that killed Jock Zonfrillo,' posted one. 'They really are opportunistic scum. RIP Jock.'Another added: 'WTAF is wrong with RWNJs speculating what Jock Zonfrillo died from. Blaming it on Covid vax. And if it was suicide, because of lockdowns. 'Not everything’s a f***ing conspiracy. Let the family mourn.'Another said the twisted theory had incensed the chef's friends and family. 'Many of his friends are enraged that educated people who do their own research are even suggesting it was caused by the Covid mRNA gene altering injection,' said one.Police were called to Zonfrillo's Carlton hotel Zagame's House on Lygon Street in the early hours of May 1 for a welfare check over concerns for the star.Well-placed sources have told Daily Mail Australia Zonfrillo's wife Lauren had raised the alarm from Italy after she had been unable to get hold of him.The chef had been in Rome with his family to start a new life in Europe and had only flown back to Australia for the new season debut of Masterchef, with its theme of Secrets and Surprises. ",
        "Police at the scene found Zonfrillo dead in his bed with no sign of anything suspicious or unusual.There was no drug paraphernalia located, no one else in the room and police believe the father-of-four, including two adult children from his previous marriages, died of natural causes.Daily Mail Australia previously revealed the Zonfrillo had been diagnosed with bowel cancer about May 2021, after an earlier bout went into remission in 2016.It is not suggested the cancer killed Zonfrillo, only that he had told friends its return was detected after a routine colonoscopy.A close friend and former neighbour of Zonfrillo told Daily Mail Australia the chef sometimes opened up to him about his 'demons' over a glass of whisky.Stuart Ayer said he and his wife struck up a close relationship with the TV star's family during the three years they were next-door neighbours in Carlton.Speaking about Zonfrillo's relationship with his wife, Mr Ayer said 'they were a really solid couple'.'The kids were the light of his life,' he said. 'They're great kids and it's such a tragedy.'Daily Mail Australia has been told Zonfrillo had been receiving treatment for bowel cancer from at least June 2021, a month after it was detected in a colonoscopy.A source said at the time: 'No one in his circle is aware of what he is going through. Neither colleagues or friends.'",
        "'He has not wanted anyone to know as he deals with this tough journey. He is coping poorly with chemo treatment, and the effects it is having.'In the months that followed, Zonfrillo was an out-patient at Kinghorn Cancer Centre in Sydney and Epworth Oncology in Melbourne as well as treatment in Queensland, the source said.Zonfrillo underwent chemotherapy while filming his second series of Celebrity MasterChef in 2021.",
        "Daily Mail Australia, which has seen evidence of Zonfrillo discussing the diagnosis with a close friend, contacted the chef and members of his family in August 2021 but received no response.Another source said Zonfrillo had been avoiding hospital and was instead being attended by a doctor who was flown in to treat him.'He claimed that each time he was getting any medical treatment there was a barrage of nurses that keep coming into his room, and he didn't want to be impolite by asking to be left alone,' the source said.A source said Zonfrillo kept his health problems from most friends and colleagues, usually receiving treatment including chemotherapy when the hit cooking show was not filming.In his 2021 memoir Last Shot he did not mention suffering from cancer, but did discuss his years of heroin addiction as a young man in Glasgow.",
        "An autopsy will now be conducted to determine the celebrity chef’s cause of death.Masterchef finally launched the new season on Sunday night after it was delayed six days by the tragedy. "
    ]
}