{
    "articleURL": "/tvshowbiz/article-12050081/Em-Rusciano-admits-shes-upset-got-paying-subscribers-fund-Emsolation.html",
    "content": [
        "Em Rusciano has admitted that she may lose her Emsolation podcast after leaving Spotify.",
        "The media personality told her fans this week that she had decided to leave the streaming platform because she wanted total creative control of her brand, and chose not to resign for another year. But that means the star is out on her own - her production costs, employee salaries and her own salary are no longer covered by the streaming giant.  The 44-year-old admitted that her business managers tried to advise her against the choice but she was determined. However it appears to have backfired, with Em admitting on Friday that she has not yet attracted enough subscribers to keep her show afloat. ",
        "Instead of making Emsolation a subscription only podcast, Em announced it would continue to be free, but she has added the additional show, Emsolation Extra, to her rotation, and that series requires a payment via the Supercast platform to listen. The funds raised by Emsolation Extra will go towards keeping Emsolation on the air, and it currently costs $9.95 per month, or $89.95 a year to tune in.  In an Instagram Stories post on Friday, Em confessed that she had only attracted 1500 subscribers for Emsolation Extra so far, and needed at least 4000 to keep the Emsolation podcast in business. 'If I'm being honest, I was a bit upset about it, my feelings were hurt. Because I was treating it like when I put a live show on sale, they go straight away,' she said on Instagram Stories. ",
        "'Everybody gets it. And this is the same price, a bit cheaper, and you're getting more. But it's a new thing and I've got to calm down and be patient' Em continued. 'I hope you all get it. You're actually getting 88 shows instead of one... I have faith. I know you are all coming.'Em earlier revealed she had 'agonised' over the decision to leave Spotify but had faith her community of fans would pull through for her. While she said she was 'excited' for the change and hoped her fans were 'proud of her' the performer added that she knew it was a risk. 'I'm just worried... My big fear is that I will have to wind up Emsolation, and that is why I felt so worried about going out on my own' she said on her podcast. 'Because I am kind of putting the thing I love most at risk. But I really believe my community will get it.'"
    ]
}