{
    "articleURL": "/sport/football/article-12054675/No-relegation-jokes-Chelsea-fans-hilariously-celebrate-Bournemouth-win-assures-safety.html",
    "content": [
        "Chelsea supporters are revelling in their side's 3-1 win over BournemouthThe Blues are now mathematically safe from Premier League relegationMATCH REPORT: Bournemouth 1-3 Chelsea: Frank Lampard stops the rot Chelsea supporters are celebrating their 3-1 win over Bournemouth on Saturday that saw Frank Lampard stop the rot and win his first game in charge as interim boss.",
        "Strikes from Conor Gallagher, Benoit Badiashile, and Joao Felix secured three points for the Blues who now move up to 11th in the Premier League standings.Three goals against an in-form Bournemouth side handed Chelsea their first victory in 56 days and supporters are thrilled to see their side finally on the up after a turbulent season.Lampard has been in the firing line since he was appointed Graham Potter's successor at the start of April until the end of the season.The club legend had failed to win any of his previous six games in charge with Chelsea being eliminated from the Champions League and looking way off their best as club owner Todd Boehly also came under pressure for his decision-making.",
        "Fans are now seeing the positive side after a dominant win on the south coast and are celebrating with some tongue-in-cheeky style across social media.One supporter joked after Badiashile's strike: 'Three goals in a game and Chelsea have two of them, tears in my eyes.'Another celebrating fan quipped: 'Chelsea overtake Crystal Palace in 11th. No longer the worst in London.'Other fans chose to focus on laughing off relegation suggestions with the Blues moving onto 42 points and now mathematically safe from dropping down to the Championship.",
        "One fan posted: 'Finally a win. Mathematically safe from relegation. Tears in my eyes. Happy weekend Chelsea fans around the world.'Another added: 'Lampard has now saved every team he’s managed from relegation.'Other commenters added similar posts such as: 'No more relegation jokes' and 'A huge win for us. Relegation safe!!! See you next season Premier League.'Lampard refused to get carried away with his side's battling performance against Bournemouth but did admit that there are some 'nice positives' to take away from the result.  ",
        "'You lose four games in the league as Chelsea, people look and comment,' Lampard told Sky Sports.'I walked in to this situation trying to help. You can't always control results and where you want the team to be. 'This was far more how we want to be and today was the day where we got some nice positives,' he added.Chelsea are next in action when they host Nottingham Forest at Stamford Bridge on Saturday. "
    ]
}