{
    "articleURL": "/money/comment/article-12043383/ALEX-BRUMMER-Rate-hikes-risk-hobbling-layer-banks.html",
    "content": [
        "The rise in US interest rates should be the last in the current cycle. ",
        "As keen as Federal Reserve chairman Jay Powell is to make up for past mistakes, by being tough on inflation, he is stoking up a conflagration in banking and commercial real estate, adding to the debt ceiling mandated by Congress.If anyone thinks the rescue of First Republic this week is the end of the current troubles in US banking, they should think again.The fragile share prices of regional banks such as PacWest Bancorp and Western Alliance Bancorp are not an accident. It is recognition that deposit outflows, wrong judgements on interest rates and some dodgy lending standards are taking a toll.",
        "It is bizarre, given additional risks which every rise in interest rates bestows on banking, that the Fed continues to hike borrowing costs. Until now, Joe Biden’s White House has been careful to avoid the Donald Trump error of seeking to dictate to an independent central bank.But top White House economist Heather Boushey acknowledges rate increases are having a ‘negative effect on the banking sector’. If a whole layer of US banks were to be hobbled by outflows it could bring the American economy to a shuddering halt.What I find extraordinary is how little has been learnt from the past. When Northern Rock collapsed in 2007, then-governor of the Bank of England Mervyn King was reluctant to act as lender of the last resort for fear of creating moral hazard.",
        "He went on to support the bailout of the Rock and the recapitalisation of most of the banking system.There was an acknowledgement, however, that bailing out the hopeless, foolish and unscrupulous is a game for mugs.There has been little recognition of this by US authorities. Stung from the fallout from the Lehman Brothers collapse in 2008, US Treasury Secretary Janet Yellen, regulators at the Fed and the Federal Deposit Insurance Corporation have behaved like deer caught in the headlights.Raising the deposit insurance ceiling from $250,000 (£200,000) and applying it to business deposits is an invite to reckless lending. The rule after 2008 was no bank should be ‘too big to fail’.The new standard is that even medium-sized banks should not be allowed to fail. One understands why authorities seek to hold the system together. Uninsured deposits at US banks tripled to $7.7trillion (£6.1trillion) between 2009 and 2022.Social media and online banking have made the edifice more vulnerable to speculative attacks. British and Continental banks have sought to push back at onerous capital and liquidity requirements which have hurt competitiveness.It is not yet clear, particularly in the eurozone, that banks are entirely safe. Yet they may be better prepared than their American counterparts to withstand the storm.",
        "Revving upBritain ought to be the home of sports and supercars with its innovative technology created in the Formula One motor racing hub around Silverstone.In spite of the marketing pizzazz derived from James Bond, and the inspiration of executive chairman Lawrence Stroll, Aston Martin struggles in the sports car stakes.Latest figures from the UK carmaker offer minimal encouragement. There is strong demand for its sports utility vehicle DBX, and it has lifted its average sale price to £180,000. Operating in a space dominated by Porsche and Ferrari, at a time when the industry is orientating towards advanced hybrid and electric models, is expensive.Aston’s pre-tax losses narrowed in the first quarter to £74.2million but capital spending on a new sports model and EVs meant a jump in negative cash flows to £118million.In contrast, Porsche appears unaffected by the squeeze across the globe, with first- quarter profits of £1.6billion. China accounted for a quarter of the 80,767 vehicles sold.Luxury cars look inured to the second Cold War.Hot airHard to hide the schadenfreude at seeing veteran corporate disrupter Carl Icahn being targeted by Hindenburg Research.The short-seller alleges that quoted Icahn Enterprises holds private assets on its books at inflated values.It claims that Icahn uses money from new investors to pay excessive dividends to longer-standing investors. Sounds familiar.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}