{
    "articleURL": "/news/article-12038223/Ed-Sheeran-arrives-NYC-court-100m-copyright-trial.html",
    "content": [
        "Yesterday, 32-year-old British singer-songwriter vehemently denied the claimsHe even vowed that if the jury does find him guilty, he will be 'done' with musicEd Sheeran has arrived at a New York Court for another day of a high-profile $100 million copyright trial where he is accused of ripping off Marvin Gaye's soul classic 'Let's Get it On' - a day after vowing to quit music if he is found guilty.",
        "The 32-year-old British singer-songwriter was seen climbing out of a black SUV in the rain, before entering the Manhattan court house.Sheeran vehemently denied the claims he infringed upon Gaye and his co-writer Ed Townsend's 1973 hit when he wrote and composed 'Thinking Out Loud' as he took the stand yesterday. He even vowed that he will be 'done' with music if found guilty.'If that happens, I'm done, I'm stopping,' Sheeran said when asked by his attorney Ilene Farkas about the toll the trial is taking on him.'I find it really insulting to devote my whole life to being a performer and a songwriter and have someone diminish it,' the 'Shape of You' singer added.",
        "His latest appearance at the court comes after it was made public that his beloved grandmother, who inspired one his most personal songs, had died. Anne Mary Sheeran, née Mulligan, passed away at a nursing home in the Republic of Ireland last Tuesday. She was the inspiration behind Sheeran's hit Nancy Mulligan, from his 2017 album Divide.  ",
        "The song tells the story of how his late grandfather William Sheeran, a Protestant from Belfast in Northern Ireland, and Nancy, a Catholic from the Republic of Ireland, met, fell in love during the Second World War and got married at the Wexford border.",
        "The singer's grandmother, who was known as Nancy, was remembered as by her family as a 'beloved wife of the late Bill and loving mother of Jim, Bill, Peter, Chris, John, MaryAnne, Bridget and the late Sally and sister of the late Thomas, Jim, May and Peggy. 'Deeply regretted by her loving sons, daughters, grandchildren, great grandchildren, sons-in-law, daughters-in-law, niece, nephews, relatives, friends and neighbours.' Sheeran is being sued by Townsend's heirs, who claim there are 'striking similarities' between the tracks. They are seeking a massive $100million in restitution.   At the Manhattan federal court last week, lawyers for Townsend's heirs displayed a video of Sheeran transitioning seamlessly between 'Thinking Out Loud' and 'Let's Get it On' during a live performance.Doing so, they said, amounted to a confession that he had ripped off the song.But in court on Monday, Sheeran said he and other performers frequently perform 'mash ups,' and that he had on other occasions combined 'Thinking Out Loud' with Van Morrison's 'Crazy in Love' and Dolly Parton's 'I Will Always Love You.''I mash up songs at lots of gigs. Many songs have similar chords. You can go from \"Let It Be\" to \"No Woman No Cry\" and switch back,' he said.'And quite frankly, if I'd done what you're accusing me of doing, I'd be quite an idiot to stand on a stage in front of 20,000 people and do that,' he added.",
        "He also noted that his hit song was actually been inspired by Irish musician Van Morrison. To prove his point, the singer strummed the four-chord sequence he is accused of lifting from 'Let's Get it On,' as part of his rendition of Morrison tracks, including 'Tupelo Honey' and 'Crazy Love.'"
    ]
}