{
    "articleURL": "/wires/ap/article-12042599/Lucknow-Chennai-share-points-rain-halts-IPL-game.html",
    "content": [
        "MOHALI, India (AP) - Mumbai Indians chased down a 200-plus target for the second straight game as they beat Punjab Kings by six wickets in the Indian Premier League on Wednesday.",
        "Ishan Kishan scored 75 off 41 balls and Suryakumar Yadav hit 66 off 31 balls as the visitors scored 216-4 (18.5 overs). Punjab rode Liam Livingstone's 82 not out off 42 balls to register 214-3 (20 overs).Put in to bat, Punjab lost opener Prabhsimran Singh for nine. Skipper Shikhar Dhawan scored 30 runs and put on 49 runs with Matthew Short (27) to lay the foundation for a tall score.Piyush Chawla then struck twice in four overs to remove both Dhawan and Short as Punjab was down to 95-3 in 11.2 overs.Livingstone and Jitesh Sharma then put on an unbeaten 119 off 53 balls for the fourth wicket to stun Mumbai´s attack.Sharam hit 49 not out off 27 balls, including five fours and two sixes. But it was Livingstone who stole the show with a 32-ball half-century.",
        "He scored 32 runs off the next 10 balls, hitting three consecutive sixes off Jofra Archer in the 19th over. Overall, Livingstone hit seven fours and four sixes in his knock.In reply, Mumbai got off to a torrid start as Rohit Sharma was out for another duck. It was his 15th score of zero in IPL´s history, joint highest with three other players.But Kishan and Cameron Green resurrected the innings with 54 runs off 33 balls for the second wicket.",
        "Green scored 23 runs before falling to impact player Nathan Ellis (2-34). Kishan meanwhile moved to 50 off 29 balls and put on 116 off 55 balls with Yadav for the third wicket.Yadav got to 50 off 23 balls, hitting two sixes and eight fours in total, as Mumbai was riding comfortably toward the target, before Arshdeep Singh and Ellis returned to dismiss the set duo in the space of seven balls.Kishan was caught off Singh in the deep, as Mumbai was 178-4 in 16.1 overs.Tilak Varma and Tim David though didn´t waste any time. They scored 38 runs off 16 balls to end the game in a hurry, with Varma smacking 26 not out off 10 balls including three sixes.It was a vital win for slow-starting Mumbai, which now has 10 points from nine games and has climbed up to sixth in the IPL table. Punjab is seventh with equal points, but lags on net run-rate.Earlier, rain forced the Lucknow Super Giants and Chennai Super Kings to share the points in their game.Ayush Badoni scored 59 not out off 33 balls to help Lucknow reach 125-7 in 19.2 overs before play was halted by a heavy shower. After a delay of more than 90 minutes the game was called, the first washout of the IPL season.",
        "The start of play was also delayed by a wet outfield after Chennai won the toss and opted to field.Lucknow made a few changes to its lineup with captain Lokesh Rahul ruled out of the tournament with a hip injury and batter Deepak Hooda left out.Manan Vohra and Karan Sharam fell for a combined 19 runs, as spin came to the fore once again at the Ekana Stadium.Chennai´s Maheesh Theekshana picked 2-37, including bowling opener Vohra. He also got stand-in captain Krunal Pandya for a golden duck, the two wickets coming off consecutive deliveries in the sixth over.Moeen Ali also picked 2-13, dismissing Kyle Mayers and Sharma, as Lucknow was down to 27-3.Ravindra Jadeja bowled Marcus Stoinis with an unplayable delivery, which turned away from the batsman and crashed into his off-stump, leaving Lucknow at 44-5.Badoni and Nicholas Pooran then added 59 off 48 balls for the sixth wicket.Pooran played out 31 deliveries for 20 runs, while Badoni went on the attack. He struck two fours and four sixes to reach 50 off 30 balls.Lucknow stole 44 runs in the final four overs against the run of play before the rain intervened.___ More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}