{
    "articleURL": "/news/article-12059123/More-12M-people-watched-King-Charles-Coronation-concert-BBC.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout todayMore than 12 million people tuned in to watch the spectacular music extravaganza put on for King Charles' Coronation on the BBC, viewing figures have revealed. ",
        "King Charles, 74, and Queen Camilla, 75, watched from a royal box in the grounds of Windsor Castle as Lionel Richie, Katy Perry and Take That took the stage in front of 20,000 spectators.The Coronation Concert on Sunday night was watched by an average of 10.1 million, overnight figures from the BBC show. The event had a peak audience of 12.3 million, the corporation said, which is one million fewer than last year's Platinum Party At the Palace show to mark the Queen's Jubilee. Kate Phillips, BBC Director of Unscripted, said: 'Last night's Coronation Concert was an unforgettable evening of spectacular performances that brought us all together in celebration. ",
        "'Against the stunning backdrop of Windsor Castle, the concert reflected many of the King's passions and highlighted the outstanding talent we have in the UK and beyond.Quoting a hit from the concert's closing act, Take That, she added: 'We hope that viewers 'never forget' it!'.One million fewer people watched last night's Coronation concert compared to the Platinum Party at the Palace show which was put on to mark the Queen's jubilee.A staggering 13.3 million people at its peak tuned in to watch the BBC One concert in honour of Her Majesty's Diamond Jubilee in June last year, with the concert averaging an audience of 11.2 million. ",
        "The pop show saw Diana Ross wow the crowds as she belted out soul classics while Sir Rod Stewart and Queen and Adam Lambert also put on sensational shows.Other performers for the Queen's Platinum Jubilee included George Ezra, Queen and Elbow who sang in front of a Buckingham Palace crowd of 22,000 fans.Meanwhile, provisional figures show the King's Coronation service at Westminster Abbey on Saturday was watched by more than 18 million viewers in the UK.The ceremony was broadcast simultaneously on a range of channels between about 11am and 1pm, including BBC One and Two, ITV and Sky News.An average of 18.8 million people watched across 11 channels and services, with audience figures peaking at 20.4 million when the King was crowned just after midday, according to overnight ratings released by the research organisation Barb.The figure is not quite as high as the ratings for the funeral service of the late Queen last September which was seen by 26.5 million people across more than 50 TV channels. ",
        "Last night's historic concert, presented by Downton Abbey star Hugh Bonneville, took place in the grounds of Windsor Castle and on the biggest stage ever built in Britain. The King and Queen were seen arriving for the Coronation Concert just after 8pm and immediately got in the spirit by waving the Union Flag as the show began. ",
        "Stars from the worlds of politics and royalty were out in force as they joined the newly-anointed King and Queen inside the royal box.It was a huge operation organised by the BBC, featuring a 70-piece orchestra, choirs and several unique dramatic performances.Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls OBE, Alan Titchmarsh, and Sir Tom Jones gave pre-recorded video messages in honour of the King throughout the concert.Top Gun star Tom Cruise also delivered a video message from his War Bird plane, saying: 'Pilot to pilot. Your Majesty, you can be my wingman any time,' before saluting and banking away. ",
        "Musical collaborations included opera stars Andrea Bocelli and Sir Bryn Terfel, who sang You'll Never Walk Alone, and classical pianist Lang Lang and pop star Nicole Scherzinger, who performed Reflection from Mulan.More reflective moments included Stella McCartney's address about the environment and a Winnie the Pooh skit which did not seem to elicit as much of a response as Paddington Bear's appearance with Queen Elizabeth II during the late monarch's Platinum Jubilee celebrations.During the concert, the entertainment was also interspersed with more serious moments.",
        "Prince William paid a moving tribute to his father, telling him: 'Pa, we are all so proud of you.'",
        "He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven.The concert was considered by many to be a crowning touch on the magnificent weekend, after joyous Big Lunch celebrations and a surprise walkabout by the Prince and Princess of Wales.Events to mark Saturday's Coronation will culminate today with a 'day of service' dubbed the Big Help Out as senior royals join volunteers around the country. Today, King Charles and Queen Camilla are encouraging people to come together in communities and volunteer as part of the initiative on Bank Holiday Monday.The scheme, which aims to inspire a new generation of volunteers by giving people a taster of what they can achieve, has been backed by celebrities across the country.More than 1,500 charities have signed up. The Big Help Out has been organised by The Together Coalition and leading charities."
    ]
}