{
    "articleURL": "/wires/ap/article-12050443/Cejudo-counts-championship-comeback-bout-UFC-288.html",
    "content": [
        "MORRISTOWN, N.J. (AP) - Henry Cejudo carried his young daughter to the podium and plopped her on his lap until she got restless and slithered off as dad explained why he´s breaking a three-year retirement to fight again inside a cage.",
        "Cejudo´s wife eventually ducked under a row of cameras and whisked away their cooing daughter, America.Someone had to keep an eye on their 1-year-old girl.Sort of how Cejudo says Aljamain Sterling has kept UFC´s 135-pound championship warm for him during his absence.\"He´s babysitting my belt,\" Cejudo said.Cejudo, the only person to win an Olympic gold medal and a UFC title, held that bantamweight crown when he abruptly retired in May 2020 after he successfully defended the championship against Dominick Cruz.",
        "Some critics said Cejudo´s retirement was a negotiating tactic. But the 36-year-old fighter insisted he was simply out of challenges after achieving all he could in mixed martial arts.So Cejudo called it a day and decided to train fighters at Jackson´s MMA Acoma gym in Arizona. He married wife, Karolina, had a baby and another one is due this year. Meanwhile, the bantamweight belt shuffled from waist to waist before Sterling unified the division last April and he won his last defense against T.J. Dillashaw in October.These must be the reasons why Cejudo ended his sabbatical, right? For his wife, who will be among the crowd Saturday night at UFC 288. To reclaim the championship he never lost against a fighter Cejudo believes doesn´t have the credentials to rival his MMA pedigree. To truly etch his name on the short list of greatest pound-for-pound UFC fighters in history.",
        "Sometimes, though, the answer for why fighters fight is the easy one.\"Because it´s easy money,\" Cejudo said.Well, there you go. But the explanation for his comeback does, in fact, dive a bit deeper than a lucrative payday. Cejudo rattled off a list of fantastic fighters he helped train during his break and realized he still had the elite skill level needed to compete at the highest level.\"As good as these guys are, I also start to understand my ability a little more,\" Cejudo said.The 33-year-old Sterling said he thought Cejudo's comeback \"was a joke\" when the fight was first pitched to him.\"He's been sitting on the sideline just making YouTube videos and just criticizing everybody after he just quit and took himself out of competition,\" he said.Cejudo can only hope this comeback goes better than his last one as an amateur.At 21, Cejudo became the youngest American to capture an Olympic wrestling gold medal when he won the freestyle 55-kilogram division in 2008.Cejudo, a native of Phoenix who grew up in poverty as one of six children, stepped away from the sport for three years to write a book, fulfill speaking engagements and speak out on immigration issues. Though Cejudo eventually returned to the mat, he fell short of an Olympic repeat when he lost in the semifinals of the 2012 U.S. Olympic trials.",
        "He made his MMA debut in 2013, joined UFC a year later and became the fourth fighter to hold titles in two different weight classes simultaneously, and the second to defend titles in two different weight divisions. And he was still a champ when he quit.\"Even if I never came back, I´m happy with my career,\" Cejudo said. \"I can retire now and I´d be alright. But I love the fact that this fight can put me in a category -- you may not like the persona, you might not like the `The Cringe´ - but you will definitely respect me and put me on the gold mountain.\"Cejudo said a win in the main event at the Prudential Center in New Jersey after such a lengthy break would rank him among the all-time greats with fighters such as Jon Jones and Georges St. Pierre. St. Pierre ended a four-year break and beat Michael Bisping in 2017 to win the middleweight championship and Jones sat out three years before he returned in March and won the heavyweight crown.Cejudo joked he ate fried chicken during his time off and his weight got up to \"enough to break the ice.\" But the reality was, Cejudo spent most of the past year training for this comeback.",
        "Cejudo said it was a conversation with former rival Demetrious Johnson -- they split their two UFC fights -- that spurred his interest in fighting again. Johnson didn´t understand why Cejudo wasn´t fighting when he had plenty left in the tank. Cejudo told Johnson his new family, the training and other business ventures brought him enough fulfillment that he he didn´t have to step inside the octagon.\"Yeah,\" Johnson told him, \"but fighting is the easiest way to make money.\"\"I was like, he´s right!!\" Cejudo said, laughing.Perhaps, but Cejudo said there would be no more retirements on Saturday and already started shouting out his next opponents. He said Sterling was nothing more than a tune-up to bigger fights - and paydays - ahead.\"I'm here to give my best,\" he said. \"That's it.\"It might be enough to become a UFC champion one more time."
    ]
}