{
    "articleURL": "/wires/reuters/article-12048229/Motor-racing-Ocon-says-FIA-F1-apologized-Baku-pitlane-incident.html",
    "content": [
        "MIAMI, May 4 (Reuters) - Formula One and governing FIA have apologized for a dangerous pitlane incident at the end of last weekend's Azerbaijan Grand Prix in Baku, Alpine's Esteban Ocon said on Thursday.",
        "The FIA promised an immediate review of procedures after mechanics and photographers were in the fast lane awaiting the finish when the French driver pitted and had to brake hard.Ocon called it a 'scary moment'.\"The FIA have apologized and Formula One, they assured us that this is not going to happen any more,\" he said on Thursday ahead of this weekend's fifth round of the season in Miami.\"Thank God nothing happened. So all good from now.\"The FIA have assured us they are making sure they are changing the protocols and making sure there is nobody in the pitlane until the end. I am confident we are not going to see that any more.\"Renault-owned Alpine scored no points in the last two races and had a nightmare weekend in Baku, with a series of setbacks on what was the first sprint weekend of the season.Ocon said upgrades taken to Baku had worked, even if not evident at the time with only a handful of laps in the only practice session and the car not optimized.Team mate Pierre Gasly's car caught fire in Friday practice and he then crashed in qualifying.In the previous race in Australia, Ocon and Gasly collided in a late restart after red flags.",
        "\"There's three (practice) sessions here to turn things around and the aim is to come back into the points for this weekend,\" said Ocon, who started from the pitlane in both races in Azerbaijan due to suspension changes.\"We didn't show what the car was capable of, we were not extremely fast of course. This weekend is a chance for us to turn things around, have a solid weekend where we get the maximum out of the car and hopefully we are going to do so.\" (Reporting by Alan Baldwin in London, editing by Pritha Sarkar)"
    ]
}