{
    "articleURL": "/wires/ap/article-12048205/Justin-Verlander-gives-2-HRs-Tigers-2-0-win-Mets.html",
    "content": [
        "DETROIT (AP) - Justin Verlander grabbed the bill of his cap two times as he faced home plate, acknowledging a warm welcome from fans in Detroit, then had to whip his head around twice toward the outfield as the Tigers sent pitches over the right-field wall.",
        "Verlander gave up back-to-back home runs in his New York Mets debut and Eduardo Rodriguez threw eight scoreless innings and the Detroit Tigers completed a three-game sweep with a 2-0 win Thursday.In the end, though, Verlander appreciated the crowd's collective gesture at the start of his outing.\"Any athlete in any situation, when they gave that much to an organization and that much of their career somewhere, it´s nice to hear the ovation, hear the applause,\" said Verlander, who was drafted by the Tigers in 2004 and traded by them to Houston in 2017. \"That´s a fan´s way of saying thank you. Of course, it means a lot.\"Riley Greene and Javier Baez hit solo homers off Verlander in the first inning and that was enough offense for the Tigers, who had 18,369 fans in the stands for their biggest crowd in nearly a month.\"He´s really good at what he does and he´s been doing it for a long time now,\" Greene said. \"When there's a big crowd, we feed off it. We look up and we're like, 'Yeah, let's go,' and we give it 1% more.\"",
        "Rodriguez (3-2) gave up just two hits and one walk while striking out nine. Alex Lange pitched the ninth for his fifth save.",
        "Verlander (0-1) settled in after his rough start, showing signs of the form that led to him winning the Cy Young Award last year for the third time and helping the Astros win the World Series for a second time.The 40-year-old right-hander gave up two runs and five hits and a walk while striking out five in his 79-pitch outing. He started the season on the injured list with a muscle strain in his upper back.Jeff Brigham, Dominic Leone and Drew Smith combined to throw three innings of scoreless relief, but the slumping Mets could not take advantage of their good pitching or opportunities on the base paths and were shut out for the sixth time this season.Brandon Nimmo singled off Lange with one out in the ninth inning and was thrown out trying to steal second, a questionable decision down two runs.Starling Marte struck out moments later to end the game.Nimmo said the decision to go was his alone.\"That isn´t what beat us,\" Mets manager Buck Showalter said. \"What did we hit, one ball hard all day? So that´s the thing that I dwell on.\"Tommy Pham, one of three Mets to have one hit, was caught stealing by catcher Jake Rogers in the second inning.",
        "\"In a close game, those plays matter so much,\" Detroit manager A.J. Hinch said. \"We didn't allow them to create any momentum.\"New York has lost nine of its last 11 games, falling to .500 after winning 14 of the first 21 games.Detroit has won three straight and is 13-17, bouncing back from a 2-9 start.RODRIGUEZ ROLLINGRodriguez has given up a total of two runs over his past five starts, looking like the pitcher Detroit signed to a $77 million, five-year deal and not the one whose debut season with the franchise was affected by personal matters that put him on the restricted list.\"These guys are people first and when things are settled at home, I see a different version of these guys,\" Hinch said.CABRERA COMEBACKMiguel Cabrera is expected to return to Detroit's lineup on Friday night in St. Louis after missing four games with an illness.UP NEXTThe Tigers start a six-game road trip Friday night at St. Louis where Detroit LHP Matthew Boyd (1-2) and Cardinals LHP Jordan Montgomery (2-4) are the probable pitchers.The Mets return home to face Colorado on Friday night when New York will hope RHP Kodai Senga (3-1) can snap its slump against Rockies RHP Antonio Senzatela (0-0).",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}