{
    "articleURL": "/wires/ap/article-12051455/FDA-weighing-1st-counter-birth-control-pill.html",
    "content": [
        "WASHINGTON (AP) - U.S. health regulators are weighing the first-ever request to make a birth control pill available without a prescription.",
        "But in an initial review posted Friday, the Food and Drug Administration raised numerous concerns about drugmaker Perrigo´s application to sell its decades-old pill over the counter.The FDA cited problems with the reliability of some of the company´s data on the drug, Opill, and questioned whether women with certain other medical conditions would correctly opt out of taking it. The agency also noted signs that study participants had trouble understanding the labeling instructions.Advisers to the FDA meet next week to review drugmaker Perrigo's application. The two-day public meeting is one of the last steps before a final FDA decision.If the agency grants the company's request, Opill would become the first contraceptive pill to be moved out from behind the pharmacy counter onto store shelves or online.Friday's FDA review suggests regulators have serious reservations about broad access to the drug, including whether younger teenagers will be able to correctly follow the labeling directions.",
        "At the end of the meeting, the FDA panel will vote on whether the benefits of making the pill more widely available outweigh the potential risks. The panel vote is not binding and the FDA is expected to make its final decision this summer.Perrigo executives say Opill could be an important new option for the estimated 15 million U.S. women - or one-fifth of those who are child-bearing age - who currently use no birth control or less effective methods, such as condoms.",
        "\"We have no doubt that our data clearly shows that women of all ages can safely use Opill in the over-the-counter setting,\" Frederique Welgryn, the company's global vice president for women's health, said this week.The company's application has no relation to the ongoing lawsuits over the abortion pill mifepristone, which is not a contraceptive. Research for over-the-counter sales of the pill began nearly a decade ago.Hormone-based pills, like Opill, have long been the most common form of birth control in the U.S., used by tens of millions of women since the 1960s.Opill was first approved in the U.S. 50 years ago. Perrigo acquired rights to the drug last year with its buyout of Paris-based HRA Pharma, which bought the pill from Pfizer in 2014. It´s not currently marketed in the U.S. but is sold without a prescription in the U.K.FDA's decision won't apply to other birth control pills, only Opill, although advocates hope that an approval decision might push other pill makers to seek over-the-counter sales. Birth control pills are available without a prescription across much of South America, Asia and Africa.Many common medications have made the over-the-counter switch, including drugs for pain relief, heartburn and allergies. Generally, drugmakers must show that consumers can accurately understand and follow the labeling instructions to safely and effectively use the drug. Non-prescription medicines are usually cheaper, but generally not covered by insurance. Forcing insurers to cover over-the-counter birth control would require a regulatory change by the Department of Health and Human Services.",
        "Perrigo´s main study tracked nearly 900 U.S. women taking its pill without professional supervision for up to six months. The group included women of different ages, races, educational and cultural backgrounds.Women were paid to track and record their use of the pill, including whether they followed instructions to take it during the same 3-hour window each day. That consistency is key to the drug´s ability to block pregnancy.But after Perrigo wrapped up its study, the FDA identified a problem: nearly 30% of women erroneously reported taking more pills than they were actually supplied.The FDA said Friday these cases of \"improbable dosing\" call into question the company's results.Perrigo will present a reanalysis of the data that excludes the participants who overreported. The company says the results showed the study still achieved its goal of demonstrating that most women used the pill correctly.Women reported taking the pill on a daily basis 92% of the time during the study, the company says.The company says its data show there would be about two pregnancies for every 100 women who take its pill for a year. But the FDA called this figure \"an imprecise estimate\" because the study was significantly smaller than those typically used to evaluate contraceptive effectiveness.The most popular birth control pills today contain a combination of synthetic hormone progestin, which helps block pregnancy, plus estrogen. The addition of estrogen can help make periods lighter and more regular but it also carries the risk of rare blood clots.",
        "Opill contains only progestin, making it a safer option and, according to experts, an easier regulatory switch to over-the-counter status. But progestin-only pills have downsides, including reduced effectiveness if they´re not taken at the same time daily.The FDA review also flagged concerns that women with potential health problems will appropriately avoid taking the drug.Women with a history of breast cancer should not take the pill, though a few participants in preliminary research incorrectly said they thought they could. And women who have unusual vaginal bleeding are instructed to talk to a doctor first, because it could indicate a medical problem. But the FDA notes that half of women in Perrigo´s study who had unexplained bleeding incorrectly said Opill would be appropriate for them.Several major U.S. medical groups, including the American Medical Association, support making the drugs available over the counter. The 60-year history of birth control pills shows \"the benefits of widespread, nonprescription availability far outweigh the limited risk,\" the group stated in comments submitted to the FDA.Catholic groups, including the United States Conference of Catholic Bishops, are opposing Opill's application, saying women should be evaluated by a doctor before getting it.___Follow Matthew Perrone on Twitter: @AP_FDAwriter___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}