{
    "articleURL": "/tvshowbiz/article-12039977/Controversial-MAFS-star-reveals-quit-OnlyFans-banking-100-000.html",
    "content": [
        "Married At First Sight groom Daniel Holmes has decided to quit the adult subscription site OnlyFans after making over $100,000 in just nine months.",
        "The 31-year-old TV groom shared the news with his followers on Instagram stories on Tuesday night, explaining that he has deactivated his OnlyFans profile.Holmes initially joined the platform to capitalise on the increased attention following his appearance on the Channel Nine dating show last year.'I just did it for a quick bag [of cash]. I knew coming off MAFS there would be a large influx of eyes, so I just capitalised on that,' he told Daily Mail Australia on Wednesday.Holmes went on to clarify that while he made over $100,000 from the website, being on OnlyFans did not align with his long-term goals or personal identity.",
        "'It's not really my identity or something I'd see long-term purpose in,' he added.The decision to leave OnlyFans marks a significant shift for the personal trainer, who had previously gained a stable income through the platform.It comes just weeks after Holmes admitted that he 'regretted' getting the Covid-19 vaccine so he could appear on last year's season.Daniel, at first said he would 'never' get the jab but changed his tune when MAFS producers enforced a vaccine mandate for all cast members.",
        "Now, almost two years after getting the shot without any adverse side effects, Daniel says he wishes he hadn't agreed to roll up his sleeve.",
        "He wrote on Instagram on April 13: 'I honestly wish so bad that I had never got the jab. Oh well, too late now, but definitely a regret.'Endemol Shine, the production company behind MAFS, had required all cast and crew to be fully vaccinated while filming season nine in late 2021.",
        "About a month before entering the experiment as an intruder, Holmes had shared a fiery Facebook post claiming he would never get the Covid shot because it took away his 'freedoms'.'They're gonna have to tie me down before I get vaccinated,' the Brisbane native wrote in the now-deleted post on September 25, 2021.'Not because I don't believe in it, but because they're taking away my freedoms if I don't. It's the oldest rule in the book of sales. Get the prospect saying yes and they're easier to convert,' he added.But as soon as Holmes was cast on Married At First Sight in October 2021, he promptly agreed to get both Covid-19 jabs."
    ]
}