{
    "articleURL": "/wires/pa/article-12048009/Tyre-Nichols-died-blunt-force-head-injuries-report-reveals.html",
    "content": [
        "Tyre Nichols died of blunt force injuries to the head after he was beaten by police in Memphis during an arrest in January, a report released on Thursday showed.",
        "The post-mortem examination report said the manner of death was homicide. It described multiple contusions, brain injuries, cuts and bruises to the head and other parts of the body.Mr Nichols was black, as were the five police officers dismissed and charged with second-degree murder and other counts after his death. They pleaded not guilty on February 17.Mr Nichols was stopped by police on January 7 for an alleged traffic violation and was aggressively pulled out of his car by officers.An officer shot at Mr Nichols with a stun gun, but he ran away towards his nearby home, according to video footage released by the city of Memphis and other police records.Officers who were part of a crime-suppression team known as Scorpion caught up with Mr Nichols and punched him, kicked him and hit him with a baton as he yelled for his mother.After the beating, officers stood by and talked to one another as Mr Nichols struggled with his injuries while he was on the ground, video showed.One officer also took photos of Mr Nichols as he was propped up against an unmarked police car, video and other records showed.Mr Nichols was taken to hospital in an ambulance that left the site of the beating 27 minutes after emergency medical technicians arrived, authorities said.",
        "Mr Nichols, 29, died three days later.Police said Mr Nichols had been suspected of reckless driving, but no verified evidence of a traffic violation has emerged in public documents or in video footage, and Memphis Police Chief Cerelyn Davis has said she has seen no evidence justifying the stop or the officers’ response.She disbanded the Scorpion unit after Mr Nichols’ death.In addition to the five black officers charged with murder, one white officer who was involved in the initial traffic stop has been dismissed. That officer will not face charges for his role in Mr Nichols’ death.Another officer who has not been identified also has been sacked. An additional officer retired before he could be dismissed.Three Memphis Fire Department employees who were at the site of the arrest have been sacked. Two Shelby County sheriff’s deputies who also were there were suspended.Mr Nichols’ family, their lawyers, community leaders and activists have called for changes within the Memphis Police Department concerning issues related to traffic stops, use of force, improving transparency and other policies.The city council has passed an ordinance ending traffic stops based solely on a single secondary violation, such as an improperly placed licence tag.Mr Nichols’ mother has filed a 550 million dollar (£397 million) federal lawsuit against the city, the police department and police chief Cerelyn Davis. The city has declined comment on the lawsuit."
    ]
}