{
    "articleURL": "/wires/reuters/article-12041683/UPDATE-1-Ukraines-Zelenskiy-come-Berlin-May-13--Tagesspiegel.html",
    "content": [
        "BERLIN, May 3 (Reuters) -",
        "German police said on Wednesday Ukrainian President Volodymyr Zelenskiy would travel to Berlin on May 13, though a security source later told Reuters that the public disclosure of the visit was premature and it was now unclear if it would go ahead.Police and local media had reported that Zelenskiy would travel to Berlin on May 13 at the invitation of German Chancellor Olaf Scholz and then on to the western city of Aachen the next day to receive the 2023 Charlemagne prize.According to a report by the Berlin daily Tagesspiegel, Zelenskiy would be received by Scholz with military honours.\"At the invitation of the Federal Chancellor, the President of Ukraine, Mr Volodymyr Zelenskiy, is expected to make an official visit to Berlin and Aachen from May 13 to 14,\" the federal police said in a statement sent to Reuters.However, a government spokesperson declined to confirm the visit, saying only that Scholz's appointments were announced every Friday for the following week.A security source told Reuters that the police's public confirmation meant Zelenskiy's visit was now in doubt.\"We have to wait and see whether a visit can still take place under these circumstances,\" the source said.The Ukrainian leader has mostly addressed meetings abroad via video link from Kyiv since Russia's invasion of Ukraine last year, and his rare foreign travels have typically not been disclosed in advance for security reasons.",
        "German police did not respond to a request for further comment. The Ukrainian embassy in Berlin and Zelenskiy's office in Kyiv did not immediately respond to requests for comment.German media outlet t-online said Kyiv was disappointed with Berlin's handling of Zelenskiy's visit, citing sources close to the Ukrainian leadership.The announcement was \"irresponsible\" and there is now doubt over whether the trip could still take place, t-online quoted the sources as saying.Germany rallied behind Ukraine after the Russian invasion in February last year, imposing sanctions on Moscow along with other Western partners and shipping aid and weapons to Kyiv. (Reporting by Andreas Rinke, Friederike Heine, Pavel Polityuk; Writing by Matthias Williams, editing by Maria Sheahan and Mark Heinrich)"
    ]
}