{
    "articleURL": "/femail/article-12058997/Watch-Princess-Charlotte-forgets-curtsy-Queen-Camilla-Coronation-concert.html",
    "content": [
        "The Princess, eight, almost lost her footing when curtseying to  King CharlesRead More: What DID Kate and Will say to each other during the Muppets sketch? Lipreader reveals how royals reacted to skit at the Coronation concertThis is the adorable moment Princess Charlotte forgot to curtsy to her step-grandmother Queen Camilla. ",
        "Last night, the Royal Family watched stars including Lionel Richie, Katy Perry and Take That perform at the Coronation concert outside Windsor Castle.As the most senior members of the Royal Family, the newly-crowned King and Queen were the last to take their seats in the royal box. The couple were seated in the middle of the front row of the box - meaning they had to walk past the Prince and Princess of Wales and their two eldest children Prince George, nine, and Princess Charlotte, eight.As her grandfather passed her, Princess Charlotte did her best curtsy as a mark of respect for the new King.",
        "But as she went to stand up again, Prince William and Kate Middleton's second child lost her footing for a split second.After recovering herself, Charlotte looked over to her big brother and father to see if they'd seen her small stumble.In doing so, Charlotte was accidentally turned away from Camilla as she passed - meaning she was too late to curtsy for the Queen.Having witnessed Charlotte's toppled curtsy, Queen Camilla tried to reassure her step-granddaughter.As she walked past, Camilla gave the young royal a gentle pat on the shoulder - prompting Charlotte to smile back at her.Later in the evening, the Princess turned to her mother for help adjusting her wristband - which had become loose during the celebrations. ",
        "Charlotte looked to be struggling with the paper around her arm as she waved her Union Jack about in the stands, looking lost before she sought out the Princess of Wales. Kate, 41 - who was effortlessly elegant in a scarlet suit tonight - was quick to aid her daughter by tightening the rogue band so she could continue having fun.",
        "She helped little Charlotte fasten it tighter before tuning back in for the star-studded line-up.The King and Queen took centre stage for the Concert - and got carried away with their family waving the Union Flag as well as dancing, singing and clapping to Lionel Richie, Katy Perry and a spectacular Take That finale.Charles III and his wife Camilla also laughed uproariously at Miss Piggy and Kermit the Frog, who even appeared in the royal box with them before the stage and Windsor Castle were turned a patriotic red, white and blue.The couple were roared throughout by the 20,000-strong crowd, who did three cheers for the King and Queen when they arrived as the sun set for the show beamed into homes in 100 countries around the world.And as night fell, the royals donned their glowstick wristbands, got to their feet and started dancing to Lionel, as he sang All Night Long.",
        "Katy Perry belted out hits including Roar before Take That closed the spectacular show that included Shakespeare, ballet and a drone show reflecting the monarch's love of the environment, culminating in a blue whale soaring over the castle.At the finale, choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's song Never Forget, which gave the show an uplifting finale.",
        "Prince George and Princess Charlotte clapped along with the song before the King also joined in - and there was a dancing Queen, as Camilla moved to the music. The royal couple then held up their Union flags as the concert came to a close, with William tickling George's nose with his.The King and Queen danced along to Take That's performance of Shine as Princess George and his sister Princess Charlotte enthusiastically waved their Union flags.In the final performance of the Windsor Coronation Concert, the band, who have not performed together for four years, ended with Never Forget - as Kermit the Frog danced along.Charles and Camilla laughed and chatted as they bopped along throughout, with Kate, Charlotte and George also getting into the groove - as did the Duke and Duchess of Edinburgh.William had slipped away so he could go on stage to give a moving tribute to his father, telling him: 'Pa, we are all so proud of you.'",
        "He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven on his Coronation weekend."
    ]
}