{
    "articleURL": "/wires/ap/article-12056213/Nuclear-watchdog-growingly-worried-Ukraine-plant-safety.html",
    "content": [
        "KYIV, Ukraine (AP) - Anxiety about the safety of Europe's largest nuclear power plant grew Sunday after the Moscow-installed governor of the Ukrainian region where it is located ordered civilian evacuations, including from the city where most plant workers live.",
        "International Atomic Energy Agency Director General Rafael Grossi has spent months trying to persuade Russian and Ukrainian officials to establish a security zone around the Zaporizhzhia Nuclear Power Plant to prevent the war from causing a radiation leak.The evacuations ordered by the Russia-backed governor of Ukraine's Zaporizhzhia province, Yegeny Balitsky, raised fears that fighting in the area would intensify. Balitsky on Friday ordered civilians to leave 18 Russian-occupied communities, including Enerhodar, home to most of the plant staff.More than 1,500 people had been evacuated from two unspecified cities in the region as of Sunday, Balitsky said. The Ukrainian General Staff confirmed the evacuation of Enerhodar was underway.Moscow's troops seized the plant soon after invading Ukraine last year, but Ukrainian employees have continued to run it during the occupation, at times under extreme duress.Ukraine has regularly fired at the Russian side of the lines, while Russia has repeatedly shelled Ukrainian-held communities across the Dnieper River. The fighting has intensified as Ukraine prepares to launch a long-promised counteroffensive to reclaim ground taken by Russia.",
        "Ukrainian authorities on Sunday said that a 72-year-old woman was killed and three others were wounded when Russian forces fired more than 30 shells at the city of Nikopol, about 10 kilometers (6 miles) across the river from the plant.",
        "Grossi said the evacuation of civilians suggested a further escalation.\"The general situation in the area near the Zaporizhzhia Nuclear Power Plant is becoming increasingly unpredictable and potentially dangerous,\" Grossi warned Saturday.\"We must act now to prevent the threat of a severe nuclear accident and its associated consequences for the population and the environment. This major nuclear facility must be protected,\" he said.Although none of the plant's six reactors are operating because of the war, the station needs a reliable power supply for cooling systems essential to preventing a potentially catastrophic radiation disaster.Analysts have for months pointed to the southern Zaporizhzhia region as one of the possible targets of Ukraine´s expected spring counteroffensive, speculating that Kyiv´s forces might try to choke off Russia´s \"land corridor\" to the Crimean Peninsula and split Russian forces in two by pressing on to the Azov Sea coast.Balitsky said Ukraine's forces had intensified attacks on the area in the past several days.Some of the fiercest ongoing fighting is in the eastern city of Bakhmut, where Ukrainian forces are still clinging to a position on the western outskirts despite Russia trying to take the city for more than nine months.Russian Defense Ministry spokesman Igor Konashenkov said Sunday that Moscow's forces had captured two more districts in the city's west and northwest, but provided no further details.",
        "Ukraine´s Special Operations Forces on Saturday accused Russia of using phosphorus in the city and on Sunday released a new video showing the telltale white fire from such munitions.International law prohibits the use of white phosphorus or other incendiary weapons - munitions designed to set fire to objects or cause burn injuries - in areas where there could be concentrations of civilians, though it can also be used for illumination or to create smoke screens.It wasn't possible to independently verify where the video was shot or when, but chemical weapons expert Hamish de Bretton-Gordon, a former British army colonel, said it was clearly white phosphorus.\"This is being fired directly at Ukraine positions and this would be a war crime,\" he said.\"I expect because the Russians have failed to take Bakmut conventionally, they are now using unconventional tactics to burn the Ukrainian soldiers to death or to get them to flee.\"Russian forces haven't commented on the claim, but have rejected previous accusations from Ukraine that they had used phosphorus munitions.In the south, an aide to the exiled Ukrainian mayor of the Russia-occupied coastal city of Mariupol said in a Telegram post Sunday that there was evidence that Moscow's forces had intensified their transfer of tracked vehicles through the city and into Zaporizhzhia province.",
        "Petro Andryushchenko claimed that more and more vehicles were being spotted crossing Mariupol \"every day.\"He posted a short video showing heavy trucks transporting armored vehicles along an expressway, without specifying where or when it was taken.In Enerhodar, the first residents evacuated were those who took Russian citizenship following the capture of the city by Moscow early in the war, the General Staff of Ukraine's armed forces said.They were being taken to the Russia-occupied Azov Sea coast, about 200 kilometers (120 miles) to the southeast, which is where Mariupol is located, the General Staff reported on Facebook.Grossi said Zaporizhzhia plant's core operating staff hadn't been evacuated as of Saturday but that most live in Enerhodar and the situation has contributed to \"increasingly tense, stressful and challenging conditions for personnel and their families.\"He added that IAEA experts at the nuclear site \"are continuing to hear shelling on a regular basis.\"Elsewhere, Russian shelling on Saturday and overnight killed six civilians and wounded four others in Ukraine´s southern Kherson region, according to a Telegram update published Sunday by the local administration.Five civilians were wounded in the eastern Donetsk province, the epicenter of the fighting in recent months, local Gov. Pavlo Kyrylenko reported on Sunday morning.Meanwhile, Ukrainian forces overnight attacked the largest port in Russia-occupied Crimea with drones, a Kremlin-installed local official said on Telegram early Sunday.",
        "According to the post by Mikhail Razvozhayev, the governor of Sevastopol, 10 Ukrainian drones targeted the city, three of which were shot down by air defense systems. Razvozhayev said there was no damage.___Joanna Kozlowska contributed to this story from London.___Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}