{
    "articleURL": "/wires/pa/article-12053499/Live-Eyes-world-King-s-coronation.html",
    "content": [
        "The King and Queen waved to well-wishers from the Buckingham Palace balcony after arriving back from their coronation at Westminster Abbey.",
        "Joined by other royal family members, they appeared shortly after 2.25pm to loud applause from an ocean of people gathered outside the gates below.",
        "During the earlier ceremony at the royal church, the St Edward’s Crown was placed on Charles’s head, with Camilla coronated with Queen Mary’s Crown shortly after.A 2.30pm flypast to mark the end of proceedings was scaled down – featuring only helicopters and the Red Arrows – because of the weather.",
        "King crowned with St Edward's Crown and Queen coronated with Queen Mary's CrownPair arrive back at Buckingham Palace in Gold State Coach before appearing on balcony to wave at well-wishersScaled-down military flypast as rain fails to dampen spirtsSeveral arrests made amid protests",
        "4.05pmPA’s live coronation page has now ended.",
        "3.49pm In Scotland hundreds of people gathered on Calton Hill in Edinburgh for an anti-monarchy rally organised by Our Republic.Some waved Saltire flags while others wore them as cloaks, and held signs with slogans such as “Not our King” and “down with the crown”.Speakers included Scottish Greens co-leader Lorna Slater who is a Scottish Government minister.She said: “When it comes to the monarchy Scotland says no.“Let’s do better, let’s build a better, brighter democratic future in an independent Scottish republic.”3.48pm Ant and Dec have spoken about how “fantastic” it was to witness the coronation in Westminster Abbey.",
        "“The view was very good by the way, we were here, and then there was only one row, then he (the King) walked past, they all walked past,” presenter Anthony McPartlin told ITV News as he left Westminster Abbey.McPartlin said that the most amazing moment of the ceremony was “when the crown went on”.“The crowning, the whole thing, just a fantastic day,” added Declan Donnelly.",
        "3.47pm Linda Old came to look at Buckingham Palace after watching the coronation in Hyde Park.She told the PA news agency that the ceremony brought back memories of other royal events, most recently the Queen’s funeral when she camped overnight to see the late Queen lying in state.Ms Old, from Islington, north London, said: “It has been very well organised. I was emotional watching it.“I’ve come with my family. Just being here with everybody is special.“We all stood up for God Save The King. It’s special, there’s a lot of memories.”3.46pm ",
        "3.34pm Speaking outside Buckingham Palace after the coronation, wearing a miniature crown and cape, Patricia Ferrier said: “You could not be anywhere else.“You had to be here. There was no other choice.",
        "“On the one hand I’m sad to be here because the Queen has died. I had a few flashbacks during the service.",
        "“But all the pomp is so special. It is what the Brits do best.”3.19pm Historian David Olusoga said the King’s coronation was a “huge effort to show the diversity of faith within Britain”.He told BBC news: “Today we’ve been reminded of the deep religious history of the country,” adding the ceremony had “echoes of the mediaeval age”.“That sense of continuity, that sense of tradition, as a historian is absolutely fascinating.“It’s done now, a new reign formally begins,” he continued.“I think what you saw today was a strong representation and a huge effort to show the diversity of faith within Britain, one of the things that’s very different between the Britain of today and the Britain of 1953.“I think it’s more difficult with a thousand-year-old ceremony to retroflect the fact we are one of the more secular nations in the world.”3.05pm Fans were able to watch the coronation on a big screen in Park Lane Square outside the South Stand of Tottenham Hotspur Stadium before Spurs’ Premier League match against Crystal Palace.Prior to the 3pm kick-off, players and officials gathered around the centre circle for a rendition of God Save the King to mark the occasion, with commemorative signs projected around the stadium.",
        "At Manchester City’s Etihad stadium the big screen marked the coronation before kick-off against Leeds.",
        "3.05pm Crowds took pictures, screamed and laughed as they watched the Red Arrows pass over Buckingham Palace.Royal fans moved onto The Mall to take selfies and film the helicopters and planes as they passed over. Others popped champagne corks and shouted “God Save the King”.Alan Dodd, Graham Dodd and Victoria Dodd travelled to London from Southampton to experience the flyover.Victoria Dodd said: “It was so unexpected. We thought it had been cancelled.”Graham Dodd added: “It makes you proud to be British.”2.58pm Members of the public in front of Buckingham Palace began to disperse after a surprise second appearance from the King and Queen.The couple were welcomed by deafening applause as they returned to the balcony to wave a few more times before retiring inside the palace. ",
        "2.53pm The public started chanting “God Save The King” and gave three cheers as the royal family emerged on the balcony of Buckingham Palace. They gave a resounding cheer when the King waved to members of the public gathered in front of the palace.2.52pm The crowd in front of Buckingham Palace sang the national anthem and chanted as the reduced flyover passed over the royal family on the balcony.A resounding cheer rang through the crowd as the King gave a final wave before returning into Buckingham Palace.",
        "2.49pm As the aircraft approached, the Princess of Wales was seen speaking to Prince Louis and encouraging him to look up from the Buckingham Palace balcony.The Prince of Wales made a remark as he leaned closer to his wife, prompting her to turn and smile.2.45pm The Red Arrows were still able to thrill the crowd on The Mall despite the scaled-back flypast.",
        "2.44pm The Queen smiled on the balcony as she appeared to speak to the King about the wet weather, raising her outstretched palm towards the sky.2.42pm The royal family spent a little under 10 minutes on the balcony before going back inside.The King and Queen then re-emerged moments later to loud cheers from the crowds watching below.",
        "Camilla then called for their pages to help them rearrange their trains.They went back into the palace shortly before 2.40pm, with the King lingering for one final wave.2.35pm The military flypast over The Mall signalled the end of the day’s proceedings.Many members of the royal family looked up and pointed at the aircraft – while the King and Queen looked ahead to ensure nothing happened to their crowns.The flypast lasted for two minutes and thirty seconds rather than the scheduled six minutes.",
        "At least 10 helicopters took part in the flypast alongside a Red Arrows squad of nine Hawk jets.",
        "2.31pm The King’s coronation was an “extraordinary” occasion, Dame Joanna Lumley has said.Speaking on Sky News with her husband Stephen Barlow, the much-loved actress and TV presenter described what it was like to witness the coronation in Westminster Abbey.“It was just an extraordinary feeling, first of all it was a bit like a cocktail party because you seem to know everybody who’s coming in,” she said.“The music’s playing, it’s adorable, we’re looking around. Then gradually it begins closing in, and it’s a bit more formal, then suddenly it’s like we’ve stepped over the threshold into a mediaeval ceremony, something so extraordinary and uplifting, very religious, it was extraordinary.”",
        "Mr Barlow, who is a conductor, added that the music played throughout the coronation was “stunning”.“It’s stunning, 12 newly commissioned pieces, all of different types and some very formal, some very celebratory,” he said. “The effect was absolutely overwhelming.”“The King had apparently said that he wanted something people could go out humming, and I think people will when they can get a hold of it again, I think they might have to hear it one more time,” said Dame Joanna.2.26pm The King, Queen and royal family members have appeared on the Buckingham Palace balcony to huge applause ahead of the coronation flypast.2.17pm A sea of people has gathered outside Buckingham Palace to see the King and Queen’s appearance on the balcony.",
        "2.13pm Writer and actor Stephen Fry said the coronation was “magnificent” as he also praised the music used in the ceremony.Fry was among the more than 2,000 guests watching as Charles became the 40th reigning sovereign to be crowned at Westminster Abbey.Speaking after the event, he told PA News agency: “I thought the service was magnificent.“I mean truly wonderful, the music to start with was just inspiring, both the real kind of hammer-blow classics, the principal one I suppose has to be Handel’s Zadok The Priest at the time of the anointing because it quotes a passage of the Bible, which is exactly consonant with this idea of anointing.“And it just has this power that only Handel could muster – it’s similar to his Hallelujah Chorus, you know, just has this phenomenal sort of depth and force to it.",
        "“It was very moving and the King looked vulnerable, which all monarchs do when they’re being crowned. They’re being encumbered with all these symbols and all this heavy cloak and this sceptre, the orb, the heavy crown, which means he can barely move.“And in a strange way, I’m sure not deliberately originally, but it’s kind of symbolic of the encumbrances in life that you have if you’re a monarch, so it’s a very touching ceremony.“He’s quite lonely somehow – as the queen was if you watch the 1953 coronation – but I feel very lucky to have been there.”2.10pm More than 60 aircraft from the Royal Navy, British Army and Royal Air Force had been due to take part in the flypast at about 2.30pm.But the event will now only involve helicopters and the Red Arrows aerobatic display team, the Ministry of Defence (MoD) said.The King and Queen are expected to watch the flypast from the balcony of Buckingham Palace.",
        "The display over The Mall and Buckingham Palace was originally meant to last for six minutes, but the scaled-down version will last for less than half that time.The MoD said it would last for two minutes and 30 seconds.2.06pm Members of the public lining the procession route along Whitehall and around Trafalgar Square are now being allowed to queue up to make their way onto The Mall to see the King and Queen appear on the Buckingham Palace balcony.",
        "There is a hum of excited chatter and one lone man loudly singing God Save The King to cheers as people follow police officers in an orderly fashion down towards the palace.2.04pm Just as the coronation procession finished, the rain over central London eased.Royal watchers emerged from hoods and umbrellas, with some remarking on the coincidence.“That carriage… it blew me away,” said one woman as she was departing.1.59pm The military flypast over Buckingham Palace to mark the coronation will be scaled down because of the weather, the Ministry of Defence said.It will now be formed of helicopters and the Red Arrows.1.56pm The King and Queen appeared on the West Terrace of Buckingham Palace before personnel gave a royal salute.The royal salute order was given by Lieutenant Colonel James Coleby, who commanded personnel in the garden.Personnel then gave three cheers for the King before the Massed Bands of the armed forces, directed by Lieutenant Colonel Dave Barringer, played the national anthem.The Garrison Sergeant Major, Warrant Officer Vern Stokes, then gave personnel the order to remove headdress.",
        "1.52pm As procession groups arrived at Buckingham Palace gardens, they were given the order to “Halt, advance, ground arms/return swords”.The Massed Pipes and Drums played waiting music as they formed up.1.51pm",
        "1.48pm Applause sounded from a crowd in a grandstand outside Buckingham Palace as personnel marched around the Queen Victoria Memorial carrying flags from Commonwealth countries.1.46pm A republican protest in Trafalgar Square is being held but mainly away from the procession route.Earlier on Saturday, demonstrators from campaign group Republic protested close to the route on the Embankment side but that has been blocked off and supporters are now in front of the National Gallery in the square.One demonstrator claimed police had told them the Embankment side was blocked for anti-terror purposes.",
        "Hundreds gathered in the heavy rain and shouted chants of “down with the coronation”, “down with the Crown”, “don’t talk to the police” and “get a real job”.Meanwhile, Hundreds of people have now joined a march through Cardiff city centre in protest against the monarchy as the King was crowned.Demonstrators walking down Queen Street shouted “Down with the Crown, Not my King” and “God save the poor”.The procession will later head to Bute Park where a “Big Republican Lunch” is due to take place.1.45pm Led by the King and Queen, members of the royal family arrived back at Buckingham Palace at 1.34pm.The King appeared reflective as the Gold State Coach rounded the Queen Victoria Memorial in front of the palace and he disappeared from public view.",
        "1.43pm The King and Queen waved to cheering crowds in a grandstand in front of Buckingham Palace as they rounded the side of the Queen Victoria Memorial in the Gold State Coach.The rain appeared to ease as the Armed Service personnel leading the coronation procession arrived at the Palace.Thousands paraded past the Queen Victoria Memorial before entering the palace forecourt.They entered through the side gate before taking position in the gardens."
    ]
}