{
    "articleURL": "/wires/reuters/article-12038457/LATAM-POLITICS-TODAY-Brazil-lawmakers-vote-controversial-bill-clean-social-media.html",
    "content": [
        "Brazil pushes back on campaign against 'fake news' law",
        "US to temporarily deploy troops to Mexico borderMexico's deputy foreign minister resigns(Adds items and details)May 2 (Reuters) - The latest in Latin American politics on Tuesday:OAS: No reason to doubt Paraguay's election resultsThe Organization of American States (OAS) said that its electoral observation mission saw no reason to doubt Paraguay's election results, following protests by supporters of a right-wing candidate who came in third.Police and supporters of Paraguayo Cubas clashed amid complaints of fraud in a vote that the conservative ruling Colorado Party won comfortably.President-elect Santiago Peña won 43% of the vote on Sunday compared with 27% for runner-up Efrain Alegre. Cubas, who surprised observers by winning nearly 23%, called for a recount and asked his supporters to protest.Brazil pushes back on campaign against 'fake news' lawBRASILIA - Brazil's government and judiciary objected to big tech firms campaigning against an internet regulation bill aimed at cracking down on fake news, alleging undue interference in the debate in Congress.Bill 2630, also known as the \"Fake News Law,\" puts the onus on the internet companies, search engines and social messaging services to find and report illegal material, instead of leaving it to the courts, and will charge hefty fines for failures to do so.",
        "Tech firms have been campaigning against the bill, including Google, which had added a link on its search engine in Brazil connecting to blogs against the bill and asking users to lobby their representatives.U.S. to temporarily send 1,500 troops to Mexico borderWASHINGTON - President Joe Biden's administration will temporarily deploy 1,500 additional troops to help secure the U.S.-Mexico border, the Pentagon said, in preparation for a possible rise in illegal immigration when COVID-19 border restrictions lift later this month.The 90-day deployment of active-duty troops will supplement the work of the U.S. Border Patrol but not carry out law enforcement duties, according to a Pentagon spokesperson.Biden, a Democrat running for reelection in 2024, has grappled with record numbers of migrants caught illegally crossing the U.S.-Mexico border since he took office in 2021.Mexican deputy foreign minister resignsMEXICO CITY - Mexican Deputy Foreign Minister Martha Delgado is resigning from her post, she wrote on Twitter, to begin \"personal and political projects\" which she said require her full attention.In a letter of resignation addressed to Foreign Minister Marcelo Ebrard, Delgado thanked him and President Andres Manuel Lopez Obrador for her almost-five years in the role, but did not provide additional details on her future plans. (Compiled by Brendan O'Boyle and Steven Grattan; Editing by Sandra Maler and Grant McCool)"
    ]
}