{
    "articleURL": "/wires/reuters/article-12058333/Rangers-Mariners-upbeat-heading-three-game-series.html",
    "content": [
        "Seattle Mariners manager Scott Servais wore a Kraken hockey sweater to his postgame news conference on Sunday, supporting the home team prior to Game 3 of the NHL's Western Conference semifinal series against the Dallas Stars.",
        "\"Go, Kraken!\" Servais exclaimed after his ballclub defeated the visiting Houston Astros 3-1 for its sixth victory in seven games to get back to the .500 mark (17-17).The eyes of the Dallas-Fort Worth Metroplex will remain on the Pacific Northwest for the next few days, as the American League West-leading Texas Rangers open a three-game road series against the Mariners on Monday night.The teams will be facing off for the first time this season.Monday's opener will feature a pair of hard-throwing right-handers, Texas' Jon Gray (1-1, 4.40 ERA) and Seattle's Logan Gilbert (1-1, 4.01). Gray is 1-2 with a 5.53 ERA in five career starts against the Mariners. Gilbert is 2-0, 2.85 in seven lifetime starts vs. the Rangers.The Mariners won Sunday as Julio Rodriguez broke out of a 1-for-18 slump with a 454-foot home run to center field. Rookie Bryce Miller, making his second major league start, pitched six scoreless innings for his first victory.\"It felt great, obviously,\" Rodriguez said. \"It's been kind of overdue for it. It's a buildup to it. To be able to hit that for the team against a great team, too, it's always gonna bring a lot of emotions out of me.\"Rodriguez, the reigning AL Rookie of the Year, missed two games last week due to lower back soreness. He was in a 5-for-42 (.119) slump before Sunday.",
        "\"I just keep grinding because if I start crying and complaining about it, what am I going to do with that?\" he said. \"What am I going to achieve with crying?\"I feel like it's putting in the work, putting in the effort, showing up every day and just keep grinding, keep figuring out yourself, keep adjusting. That's what this game is about. So I feel like there is no room for crying or complaining about it.\"The Rangers won 16-8 against the Los Angeles Angels on Sunday in Anaheim, Calif., as Adolis Garcia, Ezequiel Duran and Josh H. Smith hit home runs.Leody Taveras had a career-high four hits and added four RBIs as the Rangers scored 16 or more runs for the third time this season. The major leagues' other 29 teams have combined to hit that mark four times in 2023.\"I'll hope we do it a few more times,\" Rangers manager Bruce Bochy said. \"It's a good offense. Power and good discipline. You get to the bottom of the lineup and Leo (Taveras) hitting over .300, so it's a lineup that is tough to navigate through.\"The Rangers' offensive success has come with shortstop Corey Seager and catcher/designated hitter Mitch Garver on the injured list for most of the season.",
        "\"Once those two get back, it is going to be tough to put together a lineup. That's a good problem to have,\" Texas second baseman Marcus Semien said. \"The group that we have right now has been playing well together and feeding off each other.\"--Field Level Media"
    ]
}