{
    "articleURL": "/wires/reuters/article-12038877/Biden-Harris-planning-1st-2024-fundraisers-soon-week.html",
    "content": [
        "By Trevor Hunnicutt",
        "WASHINGTON, May 2 (Reuters) - U.S. President Joe Biden and Vice President Kamala Harris are gearing up for their first fundraising events as soon as next week to help kick off their 2024 reelection campaign, according to people briefed on the plans.Some of the events being planned for Biden include a reception and dinner that could take place in New York City on May 10, the people said.The final dates for the events could change and the president's schedule was not finalized as he deals with a debt limit crisis in Washington and a diplomatic trip to the Asia-Pacific region in two weeks.Harris, meanwhile, is being scheduled for what will likely be her own first fundraising event for the campaign on May 12 in the key swing state of Georgia, according to a person familiar with the matter. She was already scheduled to be in Atlanta for a previously announced event benefiting the state Democratic Party.The Biden campaign declined to comment.While Biden has largely focused on his presidential duties since announcing his bid for re-election, his campaign operation is coming to life.The first events being planned for Biden are designed to be intimate, small-group functions of fewer than 40 high-dollar donors, and are expected to generate some $2.5 million for Biden, according to the sources.",
        "The money is helping the campaign get an early start on building an audience of voters and potential donors online. They've already spent $767,000 on Meta Platforms Inc's Facebook and $246,000 on Alphabet Inc-owned Google, according to those companies.Biden's campaign in 2020 was the first presidential campaign in history to raise over $1 billion, as he battled incumbent Republican Donald Trump.His campaign team and Democratic National Committee (DNC) allies expect they may need more this time to reelect Biden, hold the Senate and regain control of the House of Representatives, which Republicans took in the 2022 midterm elections.\"You raised more money for me last time than I raised in my whole life,\" Biden told top volunteer fundraisers for his campaign last week in Washington. \"It's because of you I'm standing here, and it's going to be because of you we win this next time around.\" (Reporting by Trevor Hunnicutt in Washington Editing by Chris Reese, Matthew Lewis and Jonathan Oatis)"
    ]
}