{
    "articleURL": "/usshowbiz/article-12048591/ALISON-BOSHOFF-Amber-Heard-quits-Hollywood-moves-Madrid.html",
    "content": [
        "The end of his marriage — and the court cases that followed — are the subject of a major new book, and Johnny Depp will be the star attraction on the opening night of the Cannes Film Festival later this month.",
        "But what of Amber Heard? She’s been absent from the spotlight since the end of the defamation trial in Virginia last year in which she was found to have libelled her former husband.I can reveal that Heard has quit Hollywood and quietly relocated to Spain with her young daughter Oonagh. A friend said: ‘She’s bilingual in Spanish and is happy there, raising her daughter away from all the noise.‘I don’t think she is in any hurry to return to work or to Hollywood, but she will probably come back when the time is right for the right project.’The Aquaman actress sold her home in Yucca Valley, California, in July last year for $1.1million (nearly double what she paid for it). ",
        "Then, in October, she was photographed on a beach in Majorca with her girlfriend Eve Barlow. At the time, she was rumoured to be living in a rented house on the island.But I’m told she has now moved permanently to a new home outside Madrid with Oonagh, who is two.Heard hasn’t worked since filming Aquaman And The Lost Kingdom in 2021, and a modestly budgeted thriller, In The Fire, last spring. (The Aquaman film comes out, finally, at the end of this year.) It’s not known whether Heard is still with Eve Barlow, who has remained in Los Angeles and is working as a writer.",
        "At Christmas, Barlow appeared to suggest they had split when she posted an essay on Substack saying that she was ‘searching for optimism at the end of a life-altering year’.She added: ‘Today I was reminded of a beautiful passage from a Khalil Gibran poem about why strength has to be renourished and revitalized in ourselves, often alone.’Meanwhile, Depp recently spent a holiday on his island — Little Parrot Cay — in the Bahamas with Sandra, the widow of his pal Jeff Beck, and her friend Wendy, who is the mum of singer Joss Stone.On May 22 and 23, Depp will play at a Jeff Beck charity benefit in support of animal charities at the Royal Albert Hall in London. Later in the summer, he’ll return to the movies by directing a film about the artist Modigliani — and then go on the road with his band, The Hollywood Vampires.What did they do to Elvis? Austin Butler lost his hair and eyebrows to become villain Feyd-Rautha (left) in Dune: Part Two which comes out in November. Butler (pictured right as Elvis) stars with Florence Pugh, Timothee Chalamet and Zendaya. The character was played by singer Sting in the 1984 David Lynch adaptation.",
        "Butler’s co-star Dave Bautista said: ‘I don’t know who this guy was, but it’s not Austin Butler. It’s not Elvis. His voice is different, his look is different. Everything about his demeanour is terrifying.’",
        "A bit of Tommy — Just like hat!Tommy Cooper’s fez is among items up for auction in a new Channel 4 series.",
        "The Greatest Auction, fronted by the ubiquitous A.J. Odudu, sees a dealer bring the fez to sale — and achieve well above the £3,250 reserve price in the first episode, which will be screened next Tuesday.The history of the iconic titfer is that Cooper, who died in 1984, gave it to an outfitter in Blackpool in exchange for a suit. Another Cooper fez is held in the V&amp;A museum.Some stars keep their Oscars in the loo, to show they don’t care for the trappings of fame. ",
        "Funnyman Jim Carrey is at the other extreme and has the costumes he’s worn in movies displayed in museum-style glass boxes in his home cinema room — his Riddler, Grinch and Ace Ventura (above) outfits among them.How Jamie chilled outJamie Oliver has revealed he was so cocky as a teen that he would regularly get locked in the freezer at the pub run by his father Trevor.",
        "Oliver said that from the age of about 11, he helped out in the kitchen of The Cricketers in Clavering, Essex; and by the time he was 14 he was better than some of the chefs in the kitchen.",
        "‘When you’re 14, you haven’t got a hair on your chin and these 21-year-olds looked like men. Obviously being young, I was cocky as well, so I often ended up in the freezer for about 15 minutes.’ His father didn’t come to his rescue. ‘I think he felt it was a kind of initiation of some description.’She has been perhaps the ultimate celebrity yo-yo dieter, but everyone at Cinema Con in Las Vegas last weekend was talking about Oprah Winfrey, who is in an extremely slim phase.",
        "Winfrey has transformed herself physically since her Meghan and Harry interview in 2021.She was in town to promote a new musical film version of The Color Purple, which she executive produced. (Winfrey, of course, was one of the stars of the original big screen adaptation in 1985, which was directed by Steven Spielberg.)The new movie, which is also called The Color Purple, follows a stage musical based on the Alice Walker book.It’s all change at the Academy, after the Andrea Riseborough affair. Fans of her film To Leslie managed to land her on the Best Actress ballot this year following a guerrilla social media campaign.But from now on, all mention of voting intentions on social media will be banned; and there is a hotline for snitches — so folks had better watch their step when enthusing.",
        "In addition, only four hosted screenings will be permitted before nominations . . . and none afterwards.Previously there was no limit on either; and millions were spent by film studios on ‘getting a conversation going’ about their pictures.Is Aaron bulking up for Bond? Get ready to see a lot more of Aaron Taylor-Johnson. Footage from the forthcoming Marvel film Kraven The Hunter screened recently at Cinema Con in Las Vegas shows the British actor, who plays the title character, spends most of the movie topless.Kraven acquires the speed, strength and senses of a jungle cat after drinking a herbal potion in the film, which is going to be Marvel’s first ‘R’ rated movie thanks to some bloody violence which had Cinema Con delegates wincing. Russell Crowe plays his father.Taylor-Johnson, 32, from High Wycombe, was notably weedy as Dave Lizewski in Kick Ass back in 2010. But he has clearly been working out and bulking up since then.",
        "Indeed, so thorough is his physical transformation from wiry youth to hench hunk that he has been hired as the ‘face’ of Calvin Klein underwear; and shot a buff advertising campaign earlier this year. This was accompanied by a semi-clad video which rather set Instagram alight.One fan wrote: ‘I got pregnant after watching this video, and I’m a man.’",
        "Taylor-Johnson’s friend Jamie Dornan, who was the face of Calvin Klein pants himself back in 2014, wrote: ‘You really should have got yourself in better shape for this. Did you forget about it or something?’If he ends up being the next James Bond — and he’s among those who have apparently met with Barbara Broccoli — he will make his predecessor Daniel Craig look like a nine-stone weakling.The actor is married to director Sam Taylor-Johnson, 56, who has just finished production on her controversial Amy Winehouse biopic, Back To Black. They live largely in Somerset and have two children.Jack Whitehall is encouraging people to watch his latest movie, sci-fi romcom Robots, on as small a screen as possible — to spare his blushes.‘There’s quite a bit of nudity and, especially on a big screen, it’s pretty unforgiving,’ says Jack of the film, which reaches cinemas next month. ‘I’d normally encourage people to watch a film in a cinema, but maybe they could please view this on a laptop — or even their phone?’ Ioan ‘too poor’ to pay for his family’s home   Tough times for actress Alice Evans, who is moving out of the $2million home she shared with actor husband Ioan Gruffudd this weekend.Evans, 54, is bound for a rented house with their two daughters Elsie and Ella after Gruffudd pleaded with a court to allow the home to be sold, saying he didn’t have the money to keep up with mortgage payments for his family following their split in 2021. The three-bedroom house in La Jolla, San Diego, is the only home his children have ever known.Gruffudd is now living in Los Angeles with girlfriend Bianca Wallace, 29. A friend says: ‘Alice is packing up and it’s been a devastating period. She is very sad that she and the children have to move out, but there was no option.’The Fantastic Four star told a court in a document filed last year that neither he nor Evans could afford the $6,750 a month in mortgage payments, insurance and property tax.He said he’d had just one paid job in the past year and was so poor he was relying on handouts from his young girlfriend. ‘The rent for my apartment is $3,400 per month; I live there with my girlfriend, who has been paying the majority of our living expenses, and all of our rent, since September 2022 due to my financial circumstances,’ he said.He added: ‘I have explained these financial circumstances to Alice and have asked her numerous times since we separated, through counsel, to help financially and to agree to sell the La Jolla residence . . . but Alice has not agreed to my requests.’Gruffudd filed for divorce in March 2021 after Evans revealed on social media that her husband of 14 years was walking out on her and their two daughters.In September he went public with Bianca, an Australian actress who was an extra on TV drama Harrow — which Gruffudd starred in.Evans’s Instagram bio reads: ‘I am so disappointed in so many people now that my life has suddenly changed for the worst.’"
    ]
}