{
    "articleURL": "/sport/football/article-12038677/Thousands-fans-line-streets-celebrate-Wrexham-open-parade-promotion.html",
    "content": [
        "Reynolds and McElhenney waved to fans during Wrexham's victory paradeThe club were celebrating winning the National League and being promotedThousands of fans flocked to the streets to soak in the historic scenes  Wrexham's fans, players and club owners celebrated winning the National League and being promoted back to the English Football League with an open-top parade on Tuesday evening.",
        "Wrexham went head-to-head with their rivals Notts County last month and all but won the league after beating Luke Williams' side 3-2 thanks to Ben Foster's heroics in goal.The Welsh club went on to secure their promotion with a win over Boreham Wood on Saturday - leaving Wrexham's Hollywood owners Ryan Reynolds and Rob McElhenney in tears. To celebrate their achievement, Reynolds and McElhenney arranged a victory parade - which got underway at 6.15pm on Tuesday and saw the players head through the city for an hour before finishing up at the Racecourse Ground.Thousands of fans lined the streets to catch a glimpse of Phil Parkinson's men and the club's Hollywood owners. It is believed some fans even travelled from New Zealand and the USA for the occasion. ",
        "Reynolds and Rob McElhenney were spotted waving to the crowd while sitting on the women's team bus as they celebrated their promotion into the Genero Adran Premier. Queen's iconic song 'We are the Champions' was heard blaring out of the speaker on the bus as they made their way along the 3.5-mile route. While supporters let off red flares to create an even greater atmosphere for the parade. Reynolds and McElhenney recently revealed that celebrations would not stop after the parade and that they were arranging a Sin City trip for the squad. ",
        "According to star striker Paul Mullin, Reynolds and McElhenney will fund a trip for its players to Las Vegas after securing promotion to the English Football League.Mullin told the Footballers' Football podcast that the players were going to be boarding a flight to Las Vegas soon after the open-top bus parade through Wrexham.'I don't know if I can say it yet but we're off to Vegas,' Mullin said. 'It should be unbelievable, that's literally what they were texting me about two minutes ago. I don't think she is too happy about it,' Mullin said speaking about his partner.'But if the owners tell you you've got to go, you've got to go. I don't really want to go either, I'm devastated,' he sarcastically joked.Wrexham's top scorer - 46 goals in all competitions - also described the unique reality of having two globally-known actors as owners.'It's mental, it's absolutely mental,' he said. 'You get used to it in the end but from the start until now, every week something mad happens.'One day you're training like normal and you go back in the changing room and Will Ferrell is sat there, what are you meant to do?''Just normal lads from around the block and A-listers turn up every week. They're sound guys Rob and Ryan and it's unbelievable.",
        "'Honestly, you'll be at training one day and then they'll turn up and sit down with the lads and have dinner, they're so accessible. Two seconds before I got on the phone they were both messaging me.'It's just mental how accessible they are, so open as people and so genuine, they make you feel that comfortable you can text them about anything, ask for help, they're always willing to help.'When they come over they can't wait to come in the changing room, they're like two schoolboys or like me when I was a kid wanting to meet the Liverpool players.' "
    ]
}