{
    "articleURL": "/sport/football/article-12050711/Brighton-set-sign-James-Milner-free-transfer-Liverpool-summer-one-year-deal.html",
    "content": [
        "James Milner is set to join Brighton on a free from Liverpool in the summer The 37-year-old midfielder has spent the last eight years of his career at Anfield He's made 328 appearances for the club and won seven trophies in the process Brighton are set to sign James Milner on a one-year deal, bring the midfielder's eight-year spell at Anfield to an end.",
        "Journalist Fabrizio Romano took to Twitter on Friday to break the news, writing: 'Brighton are set to sign James Milner, here we go — the final proposal and all the clauses have been accepted. Deal will be valid until June 2024.'Milner has enjoyed a fruitful eight-year spell at Anfield, chalking up 328 appearances and winning a Champions League, Premier League, Club World Cup, FA Cup and League Cup with the club. The Seagulls are bidding to qualify for the Europa League ahead of next campaign and are eager to bolster Roberto De Zerbi's squad with reinforcements. It is understood Brighton wanted Milner because of the experience and know-how he would bring to the team, in particular if they qualify for Europe. ",
        "Mail Sport understands that Jurgen Klopp was keen on keeping the 37-year-old as he rebuilds his midfield.The veteran has featured in 27 Premier league games this season but only six of those have been starts.His minutes have dwindled as the season has gone on and his last top-flight start came over two months ago at Crystal Palace.",
        "Speaking in January, Klopp signaled his intention to keep working with Milner beyond the summer.'We have different plans for Milly but Milly wants to keep playing,' said Klopp. 'When you see him play the other night I think everyone understands that. You can't judge him normal for his age. He is 37, doesn't look a day like this when he is in training.",
        "'He is an incredibly important player and in this game (Wolves) you saw on the pitch as well. It is not that Milly expects to play 64 games a season but in 64 games a season Milly could be extremely important. That is how it is. Milly has reached 600 games and most of them for Liverpool.'There might be more fancy players out there but no one with a similar mind-set and that makes him incredibly valuable for us. And it is not because I am too loyal. It is just a fact.' "
    ]
}