{
    "articleURL": "/tvshowbiz/article-12048377/EDEN-CONFIDENTIAL-Young-royals-not-invited-Coronation-despite-attending-previous-big-events.html",
    "content": [
        "They have been welcome guests at every major royal occasion throughout their lives, but a generation of Windsors have been surprised to discover that they are not invited to King Charles and Queen Camilla's Coronation.",
        "I can disclose that the grandchildren of Queen Elizabeth's cousins – including Lady Amelia Windsor, who was named as the 'most beautiful member of the Royal Family' by Tatler magazine, and the King's godson Lord Nicholas Windsor – will not be at Westminster Abbey on Saturday.And friends claim some of them are 'furious' at the snub. 'They can't understand why they haven't been invited when they were invited to every other state occasion,' one pal tells me.In a reference to Prince Harry's attacks on the Royal Family, the friend adds: 'They have never put a foot wrong and been the souls of discretion yet have been cast out. It's not right.'Zenouska Mowatt, granddaughter of Queen Elizabeth's cousin Princess Alexandra, confirms that she is one of those not invited. 'I'm not going to the Coronation, but I'm really looking forward to watching it [on television],' she tells me.",
        "She was on the balcony of Buckingham Palace on the last occasion that Meghan Markle was, at Trooping the Colour in 2019.Zenouska, 32, was so close to the Queen that Her Majesty made a point of being photographed with her at Windsor Castle in March last year when she was in failing health, six months before her death.The Queen was pictured inspecting a collection of china made by the luxury goods business Halcyon Days, for which Zenouska works. 'It was a really lovely event,' she tells me at a Coronation celebration at the Garrison Chapel in Chelsea, West London. 'Everyone had very fond memories [of the Queen]. She was a very kind individual. Any time anyone spoke to her, she would make them feel like one in a million.'",
        "She says her mother, Marina Mowatt, 56, who became known as the 'royal rebel' in the Eighties when she became pregnant outside marriage, is invited tomorrow, as well as her grandmother.Zenouska insists that she holds no grudges about not being invited herself. 'It's going to be fantastic and everyone is so excited,' she says.Some of the royals not invited are attending their own party. 'I'll be with family anyway,' she says. 'My street is doing a street party.'She will be in good company. Last month, I disclosed that most of Britain's 24 non-royal dukes had not been invited to the Coronation, as well as lower ranks of the nobility.The Duke of Rutland was one of the many left dismayed and bewildered. 'I have not been asked,' he told me, saying he did 'not really understand' why. 'It has been families like mine that have supported the Royal Family over 1,000 years or thereabouts.'Dip down memory lane ",
        "King Charles's goddaughter India Hicks, who is not invited to the Coronation, has shared this intimate photograph of the dashing future monarch in his swimming trunks during her childhood.The 55-year-old granddaughter of the 1st Earl Mountbatten of Burma says the snap, taken on holiday in the Bahamas in the 1970s, illustrates His Majesty's patience. She explains: 'We were all sitting around the pool. In this picture I've got these little plastic animals and I'm balancing them all over Charles's back and shoulders. I seem to remember it went on for hours and he sat there patiently letting me do it.'",
        "Well, he has waited 70 years to become King...Historian Dan Snow has no doubt which part of the King's Coronation procession will be the most poignant. 'It will be powerful when he goes past where Charles I was executed,' Snow tells me, referring to Banqueting House. Speaking at the ARIAS at London's Theatre Royal, Snow adds: 'But I think that will not be mentioned.' Snow knows what he's talking about: his wife is Lady Edwina Grosvenor, whose brother, the Duke of Westminster, will be in the procession. Harry's aide is asked backHe is a man of remarkable talents. Who else could go from playing Racing Demon with the Queen Mother — in his role as equerry — to passing the brutal selection process for the SAS?Little wonder, then, that this week Jamie Lowther-Pinkerton, 62, has been back at Buckingham Palace, where Coronation rehearsals have been taking place, a decade after he stepped down as Private Secretary to Prince William, Catherine and Harry.The former Irish Guards officer is godfather to Prince George and also continues to be held in the highest regard by Harry.A unique talent indeed.JCB chairman Lord Bamford and his wife, Carole, who created the Daylesford food empire, are keen to share their good fortune in being invited to the Coronation. I hear they have given hampers to 8,500 staff, filled with mugs, mints and tea in commemorative tins — designed by famed artist, Hugo Guinness. ",
        "Priyanka's teen time behind bars",
        "Priyanka Chopra who stars in Prime drama Citadel, was so popular with the boys when she was a teenager that her father installed bars over her bedroom window.'One of them jumped onto my balcony at night,' reveals the former Miss World.'I saw him and screamed. My dad came and he went away. The next day, my dad was like, \"You need rules. F*** this! Bars, all your jeans are confiscated, you're going to wear Indian suits\".'John Cleese's decision to revive Fawlty Towers after nearly 45 years has not been greeted with enthusiasm by Sir Michael Palin. 'Come on, John, you're 83! Sit down. Play golf,' Palin, 79, says on a Channel Five show about the hit sitcom this weekend. He adds of the original: 'What John wanted was to make the perfect comedy. He actually produced this wonderfully choreographed piece of madness.'  Gwyneth Paltrow is taking luvvies to the cleaners by charging £36 for washing detergent.The 900ml bottle of Laveree comes in two types: 'Wind' and 'Forest'. Most cost-conscious households would be able to source a cheaper version almost anywhere. But the Hollywood star's Goop site says her eco-friendly product has squeaky-clean credentials."
    ]
}