{
    "articleURL": "/sport/football/article-12058761/West-Ham-targeting-ex-Premier-League-flop-replace-Declan-Rice.html",
    "content": [
        "West Ham have identified their replacement for club skipper Declan RiceThe star midfielder is expected to leave for a new team in the summerA former Arsenal figure could be brought back to London to fill the midfield void West Ham are considering a former Arsenal midfielder to be Declan Rice's replacement' should he leave the club in the summer.",
        "Rice, who helped lead the Hammers to a 1-0 victory over Manchester United on Sunday, is expected to be snatched up by one of the Premier League giants in the upcoming transfer market.The England international's existing deal has just a year left to run, with the option to activate another year on top, but West Ham will likely want to cash in on their most valued player amid interest from Arsenal, Manchester United, and Newcastle.West Ham are expected to demand at least £100million for their defensive midfielder who has been influential to helping David Moyes' side ward off relegation.His departure would leave Moyes and his backroom staff with a gaping midfield hole to fill, and they have reportedly already identified the midfielder they believe can take over from Rice.",
        "The club's quest to find a replacement for Arsenal target Declan Rice has led them to spring-haired former 'Gooner' Matteo Guendouzi at Marseille. The feisty 24-year-old has been fighting to secure Champions League football with his club but they were dealt a blow losing to rivals Lens on Saturday. West Ham head of recruitment Rob Newman also looked at Djibril Sow last month, who impressed for Eintracht Frankfurt against West Ham in last season's Europa League. The Frenchman made 82 appearances for Arsenal during a three-year spell where he won the FA Cup before being shipped out on separate loan spells before eventually being sold on a permanent deal.",
        "Gunners boss Mikel Arteta viewed Guendouzi as surplus to requirements as the Spaniard sought to overhaul his midfield while he shaped his own team.He has since thrived since moving back to his homeland and has recorded five goals and five assists this season as Marseille try to make a push to qualify for the Champions League places.West Ham believe that Guendouzi would fit in well back in England and have earmarked the midfielder for a potential move to the London stadium.",
        "Should he make the switch then the Hammers would be adding another international star to their growing team of talent with Guendouzi a regular fixture in the French national set-up.He was part of Didier Deschamps's side that lost last year's World Cup final to Argentina and made one appearance at the competition in Qatar.Guendouzi has garnered a hot-headed reputation and previously fell out with Arteta after taunting Brighton players over their salary compared to his then £40k-per-week Arsenal wage.He then further rattled his team-mates upon joining Marseille as it was alleged some stars were 'fed up' with his approach to working."
    ]
}