{
    "articleURL": "/wires/pa/article-12053693/Brighton-boss-Roberto-De-Zerbi-believes-Moises-Caicedo-play-anywhere.html",
    "content": [
        "Brighton boss Roberto De Zerbi believes “top player” Moises Caicedo is capable of playing any position on the pitch.",
        "Caicedo has starred in the Seagulls’ midfield all season but was required to fill in at right-back during Thursday’s dramatic 1-0 win over Manchester United due to injuries to Pascal Gross, Joel Veltman and Tariq Lamptey.With Gross facing a fitness test ahead of Monday evening’s clash with Everton and Veltman likely to remain on the sidelines alongside Lamptey, the Ecuador international could once again be deployed in the makeshift role.Head coach De Zerbi was reluctant to deviate from a four-man defence against United or drop midfielder Billy Gilmour following his starring role in last Saturday’s 6-0 thrashing of Wolves.And the Italian’s decision was vindicated as Caicedo performed admirably in a pulsating game settled by Alexis Mac Allister’s last-gasp penalty.“I thought to change to play with three defenders but I think we reach a high level of football and we have the right technologies playing in this tactical disposition,” said De Zerbi.",
        "“And I didn’t want to change.“I think Caicedo can play everywhere. He’s a top, top player.“I love giving players the chance to show me their quality and Gilmour was fantastic against Wolverhampton – I thought like this.”Mac Allister slammed home from the spot in the ninth minute of added time following Luke Shaw’s handball to boost Brighton’s chances of reaching Europe.",
        "The Seagulls are now preparing to complete a trio of consecutive home games against Sean Dyche’s relegation-threatened Toffees.With a further five Premier League fixtures to come during the next three weeks, De Zerbi has urged every member of his squad to be prepared to aid the club’s quest to secure continental qualification.“I want that they stay ready always to play because now we need everybody,” he said.“We need everybody to achieve our target.”Gross and striker Evan Ferguson will be assessed ahead of the Everton clash but Veltman is not expected to be available due to a hamstring issue.Lamptey, Adam Lallana, Jakub Moder and Jeremy Sarmiento remain sidelined for the Seagulls."
    ]
}