{
    "articleURL": "/tvshowbiz/article-12048905/Heidi-Klum-celebrates-daughter-Lenis-19th-birthday-day-NYC.html",
    "content": [
        "After receiving backlash over their mother-daughter lingerie shoot, Emmy-winning host Heidi Klum and her eldest child - Leni Olumi Klum Samuel - spent 'all day' together in Manhattan's Meatpacking District in honor of her 19th birthday on Thursday.",
        "'@leniklum day! Born in the big apple 19 long years ago,' the 49-year-old German presenter - who boasts 23M social media followers - gushed on Instagram.'Time flies when you're having fun!'Despite the legal drinking age being 21 in the States, Heidi and her 5ft4in mini-me with ex-partner Flavio Briatore then enjoyed plastic cups of what appeared to be champagne.'I'm very proud of my daughter and her modeling,' Klum told People in March.",
        "'And she's studying [interior design at a NYC college] at the same time, she's juggling already.'The Making the Cut producer-host and Leni's street sighting came two days after Intimissimi, an Italian lingerie label founded in 1996, unveiled their second campaign captioned: 'Great style runs in the family.'In the comments of Intimissimi's Instagram post - some called the bra and panty shoot 'nepotism,' 'uncomfortable,' 'awkward,' and 'disgraceful' while others believed it was just 'modeling' or 'sharing a passion.'Samuel was only 18 when she and Heidi starred in their first Intimissimi's campaign, a 'celebration of women' which dropped October 10.'I did get help starting off, and I know that people would dream to start off with what I had,' the CAA Fashion model admitted to People of her nepo-baby privilege.'I'm so grateful that I've been able to take what was gifted to me by my mom. But I am doing the work and putting in the time. Now I'm working on my own, traveling alone, going to school. My mom and I just have the same love for the same thing.'",
        "Leni has Klum to thank for her first magazine cover, German Vogue, which she scored at age 16 in 2020 and last year she served guest judging duties on Germany's next Topmodel.The 'Queen of Halloween' is also mother to three younger children - son Henry, 17; son Johan, 16; and daughter Lou, 13 - from her six-year marriage to four-time Grammy winner Seal (last name Samuel), which ended in 2014.",
        "Heidi's third husband - Tokio Hotel guitarist Tom Kaulitz - is currently in Europe for his band's tour, which ends May 22 in Poland.Klum currently hosts/judges the Los Angeles-set 18th season of Germany's Next Topmodel, which airs Thursdays on ProSieben.Audiences can next catch the retired VS Angel and SI Swimsuit stunner judging the 18th season of America's Got Talent, which premieres May 30 on NBC.In 2021, The Cinemaholic reported that Heidi earns $2.5M per season, judge Howie Mandel earns $1.75M per season, judge Sofia Vergara earns $10M per season, and creator/judge Simon Cowell earns $45M per season."
    ]
}