{
    "articleURL": "/wires/reuters/article-12044859/North-Carolina-House-passes-12-week-abortion-ban.html",
    "content": [
        "May 3 (Reuters) - North Carolina's Republican-dominated House on Wednesday passed and sent to the state Senate a controversial bill limiting most abortions to the first 12 weeks of pregnancy, a sharp drop from the state's current limit of 20 weeks' gestation.",
        "The bill passed 71-46 along party lines, with one Republican and two Democratic lawmakers not voting.If the state Senate passes the bill on Thursday as expected, Democratic Governor Roy Cooper will almost certainly veto it. But Republicans have a supermajority in the House, thanks to a formerly Democratic lawmaker who switched parties in April, and can override Cooper's veto if the lone Republican who abstained from Wednesday's vote supports it.The legislation would have far-reaching consequences for women who had been traveling to North Carolina for abortions from nearby conservative Southern states that banned or strictly limited the procedure after the U.S. Supreme Court last year overturned the 1973 ruling establishing federal abortion rights.Under the North Carolina proposal, elective abortions after the first trimester would be banned except in instances of rape, incest, life-limiting fetal anomalies and medical emergencies.If the bill becomes law, it would also require doctors to be present when abortion medication is administered, levying a $5,000 fine against anyone who mails abortion pills or holds a telemedicine appointment for an abortion that does not occur in the presence of a doctor.Key to the North Carolina House Republicans' veto-proof majority is former Democratic state Representative Tricia Cotham, who in April changed her party affiliation to Republican.",
        "Cotham's Wednesday vote marked a dramatic change in her stance from just one year ago, when she wrote on Twitter that the country needed \"leaders who will be unwavering and unapologetic in their support of abortion rights,\" and vowed to \"continue my strong record of defending the right to choose.\"Hundreds of abortion rights supporters lined up outside the North Carolina general assembly on Wednesday to watch lawmakers vote on the bill, carrying signs with slogans such as \"Let Healthcare Workers Do Their Job\" and \"Respect Bodily Autonomy\", according to social media posts.Abortions in North Carolina rose by 37%, more than any other state, in the first two months after the Supreme Court revoked federal abortion rights in June 2022, according to a study by the Society of Family Planning, a nonprofit organization that promotes abortion rights and research.In the six months after the ruling, there were 3,978 monthly abortions on average in North Carolina, up 788 from the average in the two months beforehand, the society said. (Reporting by Julia Harte. Editing by Gerry Doyle)"
    ]
}