{
    "articleURL": "/wires/ap/article-12038215/Biden-admin-asks-1-500-troops-US-Mexico-border.html",
    "content": [
        "WASHINGTON (AP) - The Biden administration will send 1,500 active-duty troops to the U.S.-Mexico border starting next week, ahead of an expected migrant surge following the end of coronavirus pandemic-era restrictions.",
        "Military personnel will do data entry, warehouse support and other administrative tasks so that U.S. Customs and Border Protection can focus on fieldwork, White House spokeswoman Karine Jean-Pierre said Tuesday. The troops \"will not be performing law enforcement functions or interacting with immigrants, or migrants,\" Jean-Pierre said. \"This will free up Border Patrol agents to perform their critical law enforcement duties.\"They will be deployed for 90 days, and will be pulled from the Army and Marine Corps, and Defense Secretary Lloyd Austin will look to backfill with National Guard or Reserve troops during that period, Pentagon spokesman Air Force Brig. Gen. Pat Ryder said. There are already 2,500 National Guard members at the border.The COVID-19 restrictions have allowed U.S. officials to turn away tens of thousands of migrants crossing the southern border, but those restrictions will lift May 11, and border officials are bracing for a surge. Even amid the restrictions, the administration has seen record numbers of people crossing the border, and President Joe Biden has responded by cracking down on those who cross illegally and by creating new pathways meant to offer alternatives to a dangerous and often deadly journey.For Biden, who announced his Democratic reelection campaign a week ago, the decision signals his administration is taking seriously an effort to tamp down the number of illegal crossings, a potent source of Republican attacks, and sends a message to potential border crossers not to attempt the journey. But it also draws potentially unwelcome comparisons to Biden's Republican predecessor, whose policies Biden frequently criticized. Congress, meanwhile, has refused to take any substantial immigration-related actions.",
        "Then-President Donald Trump deployed active-duty troops to the border to assist border patrol personnel in processing large migrant caravans, on top of National Guard forces that were already working in that capacity.",
        "Jean-Pierre downplayed any similarity between Biden's immigration management and Trump's use of troops during his term. \"DOD personnel have been supporting CBP at the border for almost two decades now,\" Jean-Pierre said. \"So this is a common practice.\"But some in Biden's own party objected to the decision.\"The Biden administration´s militarization of the border is unacceptable,\" said Senate Committee on Foreign Relations chair Bob Menendez, D-N.J. \"There is already a humanitarian crisis in the Western Hemisphere, and deploying military personnel only signals that migrants are a threat that require our nation´s troops to contain. Nothing could be further from the truth.\"It's another line of defense in an effort to manage overcrowding and other possible issues that might arise as border officials move away from the COVID-19 restrictions. Last week, administration officials announced they would work to swiftly screen migrants seeking asylum at the border, quickly deport those deemed as not being qualified, and penalize people who cross illegally into the U.S. or illegally through another country on their way to the U.S. border.They will also open centers outside the United States for people fleeing violence and poverty to apply to fly in legally and settle in the United States, Spain or Canada. The first processing centers will open in Guatemala and Colombia, with others expected to follow.",
        "The Pentagon on Tuesday approved the request for troops by Homeland Security, which manages the border.The deployments have a catch: As a condition for Austin´s previous approval of National Guard troops to the border through Oct. 1, Homeland Security had to agree to work with the White House and Congress to develop a plan for longer-term staffing solutions and funding shortfalls, \"to maintain border security and the safe, orderly, and humane processing of migrants that do not involve the continued use of DOD personnel and resources,\" said Pentagon spokesman Air Force Lt. Col. Devin Robinson.As part of the agreement, the Pentagon has requested quarterly updates from Homeland Security on how it would staff its border mission without servicemembers. It was not immediately clear if those updates have happened or if border officials will be able to meet their terms of the agreement - particularly under the strain of another expected migrant surge.Homeland Security said it was working on it. \"U.S. Customs and Border Protection is investing in technology and personnel to reduce its need for DOD support in coming years, and we continue to call on Congress to support us in this task,\" the agency said in a statement.___Associated Press writers Zeke Miller, Rebecca Santana, Lolita Baldor and Michael Balsamo contributed to this report."
    ]
}