{
    "articleURL": "/wires/reuters/article-12043247/FTC-proposes-ban-Meta-profiting-minors-data.html",
    "content": [
        "WASHINGTON, May 3 (Reuters) - The U.S. Federal Trade Commission on Wednesday accused Meta's Facebook of misleading parents about protections for children and proposed tightening an existing agreement on privacy to include a ban on making money from minors' data.",
        "Specifically, the FTC said Facebook misled parents about how much control they had over who their children had contact with in the Messenger Kids app and was deceptive about how much access app developers had to users' private data, breaching a 2019 agreement on privacy.The FTC's proposed changes include barring Facebook from making money off data collected on users under age 18, including in its virtual reality business. It would also face expanded limitations on using facial recognition technology.Meta shares fell as much as 2% on Wednesday but pared most of those losses and were off 0.3% at $238.50.Meta, which also owns Instagram, relies on digital ads targeted on the basis of its users' personal data for more than 98% of its revenue.The company maintains the world's biggest social networks, but is battling short video app TikTok for young users' attention after it soared to popularity with American teens several years ago.In a statement, Meta said the FTC action was \"a political stunt\" and that the FTC failed to act against \"Chinese companies, like TikTok.\"\"We will vigorously fight this action and expect to prevail,\" the company said.The FTC move on Wednesday is the first step in the process of changing the 2019 agreement. Facebook will have 30 days to respond. The company also can appeal any commission decision to an appeals court.",
        "\"This is a very substantial statement from the FTC about whether or not Meta has fulfilled its duties to protect children,\" said Debra Williamson of Insider Intelligence, adding that \"the revenue implications are not likely very large.\"Williamson said that some 5.2% of Facebook's monthly U.S. users are under 18, along with 12.6% of Instagram users.\"Facebook has repeatedly violated its privacy promises,\" said Samuel Levine, director of the FTC's Bureau of Consumer Protection. \"The company´s recklessness has put young users at risk, and Facebook needs to answer for its failures.\"The FTC has twice before settled with Facebook over privacy violations.The first was in 2012. Facebook agreed in 2019 to pay a record $5 billion fine to resolve allegations it had violated the 2012 consent order by misleading users about how much control they had over their personal data. That order was finalized in 2020.Separately, the FTC sued to stop Meta from buying the virtual reality content maker Within Unlimited but lost in court. The agency also asked a federal court in 2020 to order Facebook to sell Instagram, which it bought for $1 billion in 2012, and WhatsApp, which it bought for $19 billion in 2014. The case is underway. (Reporting by Diane Bartz and Katie Paul; Editing by Deepa Babington and Bill Berkrot)"
    ]
}