{
    "articleURL": "/sport/football/article-12056407/Brentford-target-Caoimhin-Kelleher-David-Rayas-replacement.html",
    "content": [
        "Brentford are reportedly interested in signing Liverpool's Caoimhin KelleherThe Anfield back-up keeper is keen to secure more first-team minutesKelleher could replace Bees keeper David Raya should he leave in the summer Brentford have reportedly identified Liverpool's back-up goalkeeper Caoimhin Kelleher as replacement for current number one David Raya.",
        "Raya is tipped for a summer departure from Brentford amid interest from Manchester United and other Premier League clubs following a string of impressive performances throughout the season.Should he be lured away then Brentford boss Thomas Frank will be left needing a new first-choice shot-stopper, with the Liverpool goalkeeper apparently top pick.Kelleher is keen to secure more first-team minutes in the Premier League and will likely pursue a move out of Anfield in the summer, according to The Sun.The 24-year-old has carried the baton as Alisson's number two in recent seasons, but with no plans to ditch the Brazilian, Kelleher's opportunities to establish himself in the English top-flight lie at another club.",
        "Brentford should have funds to spend on new talent after supposedly slapping a £35million asking price on Raya that isn't expected to put off Man United.The Red Devils are currently negotiating a new deal with David de Gea but could dip into the market for another goalkeeper as Erik ten Hag looks to build a new-look side.Kelleher would reportedly be available for a cut-price fee between £10-£20m given his current status as a reserve in the Liverpool set-up.The Republic of Ireland international has been part of a Liverpool squad that has won the Premier League, FA Cup, League Cup, and Champions League title in recent seasons.",
        "But, he only played a bit-part in all of those successes and has made just three appearances across the two domestic cup competitions during the ongoing campaign.",
        "Meanwhile, Klopp has refused to budge on starting Alisson in big matches with the Brazilian playing every Premier League and Champions League clash so far this season.Kelleher has enjoyed more minutes representing the Republic of Ireland national team where after rising through the Under 21 ranks has gone on to make 10 appearances.Brentford could look to bring in further youth talent alongside the Liverpool keeper with former Spurs winger Jack Clarke - now at Sunderland - also catching the eye.Clarke's impressive performances in the Championship has reportedly also peaked the interest of Crystal Palace. "
    ]
}