{
    "articleURL": "/news/article-12059735/Retired-Navy-Commander-slams-Republican-lawmaker-criticizing-drag-queen-recruitment-video.html",
    "content": [
        "A multitude of conservative voices have dissented in response to the Navy's latest recruitment effort, which included using a Drag Queen sailorA 30-year veteran of the Navy argued that the digital effort was an attempt to engage with factions of the country that the armed services often overlookAuthorities say the Navy is still expected to fall 8,000 short of its recruitment goals for the year Retired US Navy Commander Julianna Vida has slammed a Republican lawmaker's criticism of the use of a drag queen to  boost recruitment.",
        "Vida told Fox News that Alabama's Senator Tommy Tuberville's position was 'destructive' and works to 'undermine' the Navy's ability to recruit new members.She called the drag queen promotional campaign a 'critical' method to welcome 'traditionally excluded segments of our population.' Tuberville last week warned the military branch had become 'preoccupied with identity politics' after it announced that Joshua Kelley, who goes by the stage name Harpy Daniels, had been promoted to become its 'Digital Ambassador.'Vida, a 30-year veteran who is member of the Naval Academy Alumni Association Board of Trustees, said that the conservative senator's criticism is merely a 'trope' that plays well exclusively to a 'socially conservative base.' ",
        "Harnessing the power of social media to reach out to the LGBTQ community, she said, is a way for the Navy to appeal 'to all people in a society who are willing and able to volunteer their lives to the service of the nation.''In my opinion his comments reflect a political or social agenda designed to instigate and undermine instead of inform or inspire confidence in our armed forces,' said Vida, who spent eight years of her service career at the Pentagon.'The decline in recruiting or US military might… can be tied to the mismatch of budget and funding requests from senior military leaders with the domain expertise to justify them and the budget authorized and appropriated by Congress,' she added.",
        "'But to blame [military problems] on any social construct such as ‘wokeness’ is in my opinion irresponsible and insulting to our brave and dedicated military servicemembers and their leaders.'Tuberville last week lambasted the move in a Wall Street Journal Op-ed, citing his experience with motivating young men as a college football coach.'My concern is that our new national obsession with sexuality, race and gender is focused on self rather than on purpose, ability or service. I spent 40 years recruiting young men to play football. What the Navy is doing isn't a good recruiting strategy,' he wrote.The senator declared the Navy's ad to be the branch's 'Bud Light moment,' referring to recent controversy that erupted out of the Anheuser-Busch brand's use of transgender influencer Dylan Mulvaney as a spokesperson.Tuberville offered additional context for his criticism in that he argued the threat of China's growing military power has become existential for the nation, and needs to be taken seriously in a way that is not on full display with the Navy's latest recruitment tactic.'The Pentagon's most recent China Military Power report shows that China's army, navy and space assets are accelerating at a pace one American four-star admiral called 'breathtaking.' China already has the largest navy in the world and it's getting larger,' he wrote.",
        "Tuberville, however, is far from the only voice that has been deeply critical of the Navy's latest socially progressive recruitment effort.Robert J. O'Neill, who has claimed he is one of the Navy SEALs who shot and killed Osama Bin Laden, tweeted: 'I can't believe I fought for this bullsh**.'",
        "'Alright. The US Navy is now using an enlisted sailor Drag Queen as a recruiter. I'm done. China is going to destroy us. YOU GOT THIS NAVY,' he added. Specifically, dissenters are reacting to a TikTok video of Yeoman 2nd Class Kelley, AKA Harpy Daniels. Kelley joined the Navy in 2016 and has since performed as his stage alter ego for his fellow sailors a number of times.In 2022, Kelley was one of five people selected to become a digital ambassador for the branch. He does not receive compensation for his work.In 2020, Kelley said: 'The diversity and acceptance from everyone at the command allows me to be comfortable with myself in a professional setting.''Growing up gay wasn't easy, but having the opportunity to show the world who I am has inspired many individuals to be themselves and show there is a community who will accept them for who they are.'This keeps me moving forward and doing what I love to do today, and that is being Harpy Daniels.'",
        "Conservative congressman Jim Banks also responded negatively to Kelley's video, writing, 'Biden's DoD's recruitment is as good as Bud Light's marketing.'Conservative filmmaker Robby Starbuck described the Drag Queen-forward recruitment initiative as 'insane.''The military has a huge recruiting/retention crisis because they went woke. How did they try to fix it? By going more woke,' he wrote.A spokesperson for the Navy previously defended the video and the recruitment strategy by saying: 'The Navy is proud of and stands by any person who is willing to take an oath to put their life on the line in defense of this nation.'Much like the country we serve, our Navy is stronger when we draw upon our diverse resources, skills, capabilities and talents. We remain committed to an inclusive environment.'Authorities say the Navy is still expected to fall 8,000 short of its recruitment goals for the year.",
        "'We entered this fiscal year with a record low Delayed Entry Pool after exhausting all means to meet the recruiting goal in FY2022,' she wrote of a program that allows people to accept contracts with the Navy but remain on hold before shipping off to boot camp,' wrote Vice Chief of Naval Operations Adm. Lisa Franchetti in written testimony to he House Armed Services Committee. The Navy's decision to promote Kelley was part of its larger efforts to reach Gen Z.",
        "It ran a series of ads on social media platforms like Instagram, as well as on TV and streaming services tailored to the younger generation.The military branch even updated its Diversity, Equity and Inclusion statement, which it promoted prominently online.'Our Navy is committed to enabling a workforce demographic similar to that of the nation it serves,' the statement now reads.'With nearly 50 percent of recruitable talent coming from diverse talent, the Navy must be deliberate to create a culture where every person, regardless of their background, has the opportunity to succeed.'"
    ]
}