{
    "articleURL": "/news/article-12056179/UN-warns-threat-severe-nuclear-accident-Putin-orders-evacuation-Zaporizhzhia.html",
    "content": [
        "International Atomic Energy Agency again warns of renewed nuclear threatMayor tells of humanitarian crisis as Russia rushes to evacuate occupied regions A 'mad panic' has swept occupied Ukrainian territories as Russia calls to evacuate 18 settlements in the Zaporizhzhia region, ahead of the awaited Ukrainian offensive.",
        "Ivan Fedorov, the mayor of Melitopol in Zaporizhzhia Oblast, said that the order had caused chaos and five-hour long queues of cars at the checkpoint into Crimea.The official warned a humanitarian crisis was 'growing' as shops stopped receiving goods, hospitals closed and threats had been made to cut off power and water.The evacuations are said to affect Enerhodar, near Ukraine's largest power plant - with the UN's nuclear watchdog warning of a possible 'severe nuclear accident'.Rafael Grossi, director general of the International Atomic Energy Agency, warned the situation is 'becoming increasingly unpredictable and potentially dangerous.'The news comes as Ukraine gears up for a spring counter-offensive, breaking the winter deadlock with a push into occupied regions in the south and east. ",
        "Writing earlier this morning, Mr Fedorov said that 'Under the guise of a contrived 'evacuation', the occupiers are preparing real provocations. 'The humanitarian catastrophe caused by the sick fantasy of the Rashists ['Russian fascists'] is no less real.'",
        "He added later that 'the occupiers promise the residents of the front-line territories golden mountains - comfortable accommodation at the captured recreation centres of Kyrylivka and Berdyansk.'MailOnline was unable to verify the evacuation of Ukrainian refugees to the seaside beach-facing settlements - though eyewitnesses have echoed the reports.",
        "LB.ua reported Saturday that locals were hiding their children as Russian occupants tried to evacuate them, in some cases without their parents, to recreation centres in Kyrylivka and Berdyansk.The independent Ukrainian outlet said law enforcement agencies had confirmed the claims.Mr Fedorov added: 'In fact, only [some] of the evacuees are brought to the coast - they are settled among the collaborators and the military. Others are taken to continental Russia.'He said that Ukrainians evacuated from Kherson last year had found themselves later unable to return to Ukraine.Russian state media confirmed the evacuation of the 18 occupied regions on Friday. ",
        "Meanwhile, the International Atomic Energy Agency (IAEA) has warned clashes around the Zaporizhzhia power plant in the city of Enerhodar threatens catastrophe.",
        "Mr Grossi said: 'I'm extremely concerned about the very real nuclear safety and security risks facing the plant. 'We must act now to prevent the threat of a severe nuclear accident and its associated consequences for the population and the environment.' For months, both sides fought tirelessly around Europe's largest power station, which remained staffed by Ukrainian employees under Russian control until September.The plant at Zaporizhzhia is one of the ten biggest in the world and was responsible for nearly half the nuclear output of Ukraine's four reactors. ",
        "Ukrainian forces had little luck trying to recover the plant after the initial invasion, with rockets from both sides coming dangerously close to hitting the station.Ukraine has warned since that damage to the structure risks a 'Chernobyl-style' catastrophe.In September, the IAEA were able to inspect the integrity of the plant. Both Russia and Ukraine accused each other of trying to sabotage the IAEA mission.Mr Grossi, who has continued to visit the site for Russian-organised inspections, has said the 'plant and physical integrity of the plant' had been 'violated several times'.In April, it was reported that dissenting plant workers - who refused to keep the plant active for Russian forces - had been the victims of torture during the occupation.Ukrainian President Zelensky last week called for Putin to be tried in the Hague for 'criminal acts'. ",
        "Ukraine is expected to launch a counteroffensive this spring to break to winter stalemate.In April, Pentagon leaks revealed American officials doubted the ability of Ukraine to wage an effective assault.In recent days, Russian confidence has looked more exposed as Wagner Group threatens to withdraw from the contested city of Bakhmut in the east.Russia has said it is ready to replace Wagner Group forces with Akhmat special forces from Chechnya in recent days - though experts warn the effectiveness is likely overstated."
    ]
}