{
    "articleURL": "/wires/reuters/article-12049623/Republican-leaders-Australia-NZ-pledge-allegiance-king.html",
    "content": [
        "By Alasdair Pal and Lucy Craymer",
        "SYDNEY/WELLINGTON, May 5 (Reuters) - The leaders of Australia and New Zealand will pledge their allegiance to King Charles at his coronation in London on Saturday even though both are life-long republicans who do not shy away from making their positions clear.Australian Prime Minister Anthony Albanese and his New Zealand counterpart, Chris Hipkins, have travelled to London where they are due to meet Prime Minister Rishi Sunak on Friday.They met the king earlier in the week.King Charles is head of state in Australia, New Zealand and 12 other Commonwealth realms outside the United Kingdom, although the role is largely ceremonial.The two countries are holding events to celebrate the coronation, from tree-planting to military fly-pasts, though there is expected to be less pageantry than after the death of Queen Elizabeth last year.The death of the queen reignited debate in Australia about the need to retain a distant constitutional monarchy.Australia held a referendum in 1999 on becoming a republic with 55% of voters opposed. Polls in recent years have shown varying support for a republic, with most showing a small majority of Australians in favour.But neither Albanese nor Hipkins are actively campaigning for the British monarch to be replaced as head of state despite their republican convictions.",
        "\"I haven't changed my position on that and I've made that very clear. I want to see an Australian as Australia's head of state,\" Albanese said in an interview with state broadcaster ABC on Friday.\"That doesn't mean that you can not have respect for the institution, which is the system of government that we have.\"Albanese said would take the oath of allegiance to King Charles at the ceremony.\"People expect me to not come to the king's coronation in order to create a controversy,\" he said.Hipkins told a news conference on Monday he was on \"record as being a Republican\" but that \"it's not something I intend to push\".\"I don't regard it as a priority,\" he said. \"The constitutional arrangements that we have are working quite soundly at the moment.\"New Zealand's defence force will fire off two 21-gun salutes on Sunday, while the Australian air force is planning a fly-past over Parliament House in Canberra.Various prominent buildings including Auckland´s Harbour Bridge and Skytower and parliament buildings in both capitals will be lit up - but not Sydney's famous Harbour Bridge and Opera House. (Reporting by Alasdair Pal in Sydney and Lucy Craymer in Wellington; Editing by Robert Birsel)"
    ]
}