{
    "articleURL": "/news/article-12044613/Minyama-neighbours-clash-Sunshine-Coast-council-approve-pontoon-jetty.html",
    "content": [
        "Neighbours on a canal have clashed over a pontoonThe Sunshine Coast Council approved the pontoonDo you know more? Email tips@dailymail.com War has erupted between two millionaire neighbours after one built a jetty outside their property - meaning the wealthy couple next door are now unable to squeeze in a large boat.",
        "Jay and Elisabeth Heather and Glynn and Karan Moseley live in million-dollar mansions along a canal in Minyama on Queensland's Sunshine Coast.The Moseleys built a jetty at their property after gaining approval from Sunshine Coast Regional Council last year. The Heathers challenged the decision saying they wouldn't be able to use a bigger boat on their own ramp because the new pontoon restricts access to it. ",
        "Both houses are adjacent to each other, leaving little room between the pontoon and the ramp. The Moseleys originally lodged an application for 'an overwater deck with a pontoon and gangway attached' for their $1.43million home in March 2020. The application was approved by the local council a week before the Heathers snatched up the neighbouring home for $1.495million in June 2020.Court documents revealed the Heathers were unable to appeal the decision to construct the jetty and pontoon as the application was code assessable, the Courier Mail reported.The couple later applied to declare the decision was invalid because of an alleged jurisdictional error. In their application, the Heathers argued there was an error in the council's assessment as they didn't consider the need to manoeuvre vessels or access the concrete boat ramp on their property.They also alleged the approval was 'legally unreasonable' and 'the conditions attached to the approval' were unreasonable. ",
        "The appeal made by the Heathers was dismissed by Judge Glen Cash last year.Judge Cash found that the Heathers had 'not shown that the decision was materially affected by jurisdictional error or was legally unreasonable'. ",
        "The Moseleys later applied to have their legal costs reimbursed as a result of the  proceedings brought on by the Heather family.They slammed their neighbours' appeal in their application as 'frivolous' and 'vexatious'.They claimed the appeal was conducted for an 'improper purpose', was 'doomed to fail' and was an attempt to challenge the merits of the Council's decision, according to court documents. Judge Cash ruled the proceeding was not frivolous or vexatious and was not started by the Heathers for an improper purpose or 'doomed to fail'. He dismissed the application made by the Moseleys on March 14. "
    ]
}