{
    "articleURL": "/sport/football/article-12040861/LEquipe-react-Lionel-Messis-two-week-SUSPENSION-PSG.html",
    "content": [
        "Lionel Messi has been suspended for two weeks by PSG over Saudi Arabia tripFrench newspaper L'Equipe believe the punishment is the sign of PSG's 'new era'The story is dominating French media, with PSG's stars getting 'fewer privileges' Paris Saint-Germain have 'made an example' out of Lionel Messi, with his suspension the sign of a 'new era' where star players have 'more requirements and fewer privileges.'",
        "That is according to French newspaper L'Equipe, who ran news of Messi's two-week suspension for an unauthorised trip to Saudi Arabia this week on their front page on Wednesday.Along with the headline 'La Rupture' was a picture of a pensive Messi and PSG owner Nasser Al-Khelaifi, with L'Equipe reporting that Messi's time in Paris is heading towards its conclusion this summer. World Cup winner Messi had pre-arranged the visit for one of his commercial commitments as ambassador for tourism there. PSG players were supposed to be off on Monday, however, following their 3-1 defeat to Lorient on Sunday, manager Christophe Galtier called the squad in for training instead. Messi, though, was already in transit to Saudi Arabia and unable to turn back.",
        "'Who would have imagined that the story would end like this?' L'Equipe wrote.'Last summer, during the induction of [Christophe] Galtier as coach, he had insisted on the discipline he wanted to put in place with football adviser Luis Campos.'The duo wanted to embody a new era, with more requirements, and fewer privileges. 'So often criticised for its weakness, PSG has made an example and sent a message that even the biggest star, a seven-time Ballon d'Or winner, and recently crowned world champion, is not above the rules.'",
        "Messi, who will miss the next two PSG games, at Troyes this Sunday, and against Ajaccio on Saturday May 13, has been offered a new contract by PSG on the same financial terms, but doubt remains on his side about the sporting project.In L'Equipe's reporting it appears there is also doubt on the side of PSG whether their relationship with the Argentine extends beyond the summer.They add that their decision to suspend Messi has caused an 'explosion' which could have a 'planetary impact'.Those around Messi say the trip was previously postponed twice and it was difficult to do so at short notice for a third time.",
        "He signed a lucrative £25m-a-year deal with Saudi Arabia to promote the kingdom in May last year as a tourism ambassador, with Messi taking his first trip in the role when he visited Jeddah soon after.Saudi minister of tourism Ahmed Al Khateeb confirmed Messi was in the kingdom for his trip as he tweeted on Monday: 'I am happy to welcome #Messi and his family to Saudi to enjoy the magical tourist destinations and authentic experiences. 'We welcome visitors from all around the world to experience a unique trip to Saudi Arabia and its hospitality.'Messi also posted a photo on his Instagram from his stay with the caption: 'Who thought Saudi has so much green? I love to explore its unexpected wonders whenever I can. #visitsaudi.' "
    ]
}