{
    "articleURL": "/wires/reuters/article-12046091/Latin-American-election-influence-operation-linked-Miami-marketing-firm.html",
    "content": [
        "By Zeba Siddiqui and Christopher Bing",
        "SAN FRANCISCO/WASHINGTON, May 4 (Reuters) - A Miami-based digital marketing firm was behind a series of covert political influence operations in Latin America over the last year, Facebook-owner Meta said this week, a rare exposé of an apparent U.S.-based misinformation-for-hire outfit.Predictvia, which is registered as a business in Florida, says on its website that it stands on the \"front line of the fight against misinformation\" and combats \"coordinated efforts to manipulate public discourse.\"Meta analysts found, however, that Predictvia ran a network of fake accounts - four on Instagram and 24 on Facebook, along with 54 Facebook pages - that posed as news media outlets, journalists, and lifestyle brands.The accounts posted criticisms of the mayor of the Guatemalan city of San Juan Sacatepequez, Juan Carlos Pellecer, and in Honduras they focused on alleged political corruption and criticism of the president of the Congress, Luis Redondo. Neither politician returned a request for comment.Predictvia also ran extensive information operations that sought to interfere with politics in Honduras and Guatemala on Twitter, two former Twitter employees, who asked to stay anonymous, told Reuters. The extent of the company's Twitter activity established by the news agency has not been previously disclosed. Twitter did not respond to requests for comment on this article.",
        "\"It's a classic pattern that you tend to see with for-hire influence operations,\" said Ben Nimmo, Meta's Global Threat Intelligence Lead. \"There isn't a single narrative that they're pushing across different countries; it tends to be much more tailored per country.\"Predictvia Chief Executive Ernesto Olivo Valverde and other senior staff did not respond to multiple requests for comment from Reuters.Reuters was unable to determine who Predictvia was working for, or to assess the success of its misinformation efforts.Meta said it had banned Predictvia - which it said operated from both Venezuela and the United States - from its services and had sent it a cease and desist letter.Government officials in Honduras and Guatemala did not immediately respond to requests for comment about the alleged misinformation operation against politicians in their countries.Meta says it regularly takes down disinformation and misinformation operations in order to maintain the integrity of its platform. It said in its report that the investigation into Predictvia was triggered by Reuters questions earlier this year.Around 6,700 accounts followed one or more of the Facebook pages in Predictvia's influence network, and it had 400 followers on Instagram, Meta said.The Predictvia network also included other social media platforms, Meta said. Its analysts found two Twitter accounts linked to the company, one of which describes itself online as a civil organization seeking to post \"truthful content\" ahead of Guatemala's national elections in June. Both were active as of Tuesday.",
        "TWITTER OPERATIONSLast year, Twitter staff traced thousands of fake accounts on its platform to a small number of Predictvia employees, the former Twitter employees, who said they were involved with that probe, told Reuters.\"I was amazed that they were basically doing all of this on their own,\" one of the employees said. \"Just the scale of it was quite significant.\"Three former Twitter employees told Reuters that Twitter had turned over its data on the fake accounts last August to a nonprofit Latin American research group named Cazadores de ('Hunters of') Fake News. The data sets given to Cazadores by Twitter did not mention Predictvia, the former employees said.Twitter said in a September 2022 blog that it had shared datasets about influence operations with Cazadores. In August 2022, Cazadores also published three reports on Honduran and Guatemalan politics that it said were based on the Twitter information, although those reports did not name Predictvia.The exchange was part of a program called The Twitter Moderation Research Consortium (TMRC) that sought to combat manipulation by sharing data with academics and researchers. Former Twitter employees told Reuters in January that most of the staff involved in the TMRC had since left and Reuters could not determine if it was still operational.",
        "In one of the Cazadores reports, it said the data showed there were more than 1,300 accounts posting about Honduras. It said \"several\" of the accounts \"manipulated the conversation on Twitter\" by posting messages encouraging abstention from voting in the 2021 presidential election and criticisms of two opposition candidates, Xiomara Castro and Yani Rosenthal.Neither immediately responded to a request for comment. Castro won the presidency and it was not clear if the influence operation had any impact on the election outcome.\"The election influence and misinformation campaign studied was at least partially based on \"astroturfing\" i.e. the pushing of inauthentic narratives, with the use of covert accounts posing as real users,\" the Cazadores report said.The network separately operated 2,000 accounts spreading disinformation and \"defamatory\" content against several targets in Guatemala, Cazadores said in another report.Some of the accounts criticized the country's anti-corruption agency, CICIG, in a coordinated manner to make it look like a subject of significant discontent, the group said in its report. While the agency was closed by the government in 2019, several misinformation campaigns against CICIG-initiated cases that were still active took place in 2020-2021, it found. The former director of CICIG did not return a request for comment.Twitter had since suspended all the accounts in these networks, the report added.",
        "Founded in 2013 by Valverde, Predictvia was originally focused on developing an artificial intelligence-based market research tool, according to three former employees who spoke to Reuters on condition of anonymity.In 2015, the company described itself on its website as a team of nine programmers, mathematicians, data specialists, and game designers using tools \"to predict what things people (specific users) like the best or hate the most.\" (Reporting by Zeba Siddiqui in San Francisco and Christopher Bing in Washington; Additional reporting by Sofia Menchu in Guatemala City, Gustavo Palencia and Orfa Mejia in Tegucigalpa, and Daina Beth Solomon in Mexico City; Editing by Chris Sanders and Rosalba O'Brien)"
    ]
}