{
    "articleURL": "/wires/aap/article-12053397/Wests-Tigers-confirm-Warrior-Shaun-Johnson.html",
    "content": [
        "Warriors coach Andrew Webster is backing his close relationship with Shaun Johnson to help keep him out of the Wests Tigers' clutches after Tim Sheens confirmed the Kiwi veteran was in his club's sights.",
        "Johnson, 32, has flourished since the Warriors returned to Auckland full-time this season, turning the clock back to guide the side up the New Zealand ladder in Webster's first year at the helm.On Saturday, Tigers coach Sheens confirmed he had the off-contract Johnson on his radar.The Tigers have lost first-choice five-eighth Doueihi to his second ACL injury in as many years and have been in the market for a game-managing half since releasing Jackson Hastings in the off-season.Since the end of last season, the joint venture have made failed plays for Mitchell Moses, Cameron Munster and Jack Wighton and are currently fielding a halves combination of off-contract Luke Brooks and Brandon Wakeham, who did not join the club until mid-way through the pre-season.\"We're down to two halfbacks of first-grade calibre,\" Sheens said.\"Shaun Johnson has been discussed but that's only because we've lost Adam.\"We're not talking about this year. I don't think Adam will play much next year, either, just quietly.\"Hopefully he will but at the moment we can't count on that so we're looking for a short-term fix for that.\"Brooksy and young Wakeham have got all year to put it together as far as combinations are concerned and play well but we've got to recruit again in that position.\"",
        "After the Warriors' 18-6 loss to Penrith, Webster confirmed he planned to broach Johnson's contract situation with him at the right moment.\"Shaun and I have got a really good relationship so when the time comes for that to be brought up, we'll sit down and have a good discussion around it,\" Webster said.\"Also too, keeping recruitment especially retention out of the media is always really important. Keep it between the player and us.\"I understand there's going to be speculation but I won't be diving into that. All I can say is that Shaun and I get on great. We'll work that out.\"The Tigers' plans to lure Johnson are still in their early stages and the major challenge is likely to be enticing Johnson away from New Zealand after he spent significant time away from his young family during the COVID-19 pandemic.Johnson's partner, professional netballer Kayla Johnson, did not join him in Cronulla's Queensland biosecurity bubble during the 2021 season and when he joined the Warriors for 2022 the halfback had to leave his family behind again to relocate to Australia.After spending so much time away from home, Auckland appears to be bringing the best out of Johnson.\"Whether or not he'll leave New Zealand is another thing,\" Sheens said.",
        "\"It's only one of a few discussions to be quite honest that we've got planned.\""
    ]
}