{
    "articleURL": "/news/article-12054987/Scottish-cops-asked-Britains-FBI-help-probe-missing-SNP-finances.html",
    "content": [
        "Scottish Police reportedly called in 'Britain's FBI' to help on SNP investigations Scottish cops asked 'Britain's FBI' to help with their probe into the missing SNP finances before arresting Nicola Sturgeon's husband.",
        "National Crime Agency (NCA) officers are the frontline on serious and organised crime, but they were reportedly called in by Scottish Police to help with the SNP investigation.They were drafted in several months before Nicola Sturgeon's husband Peter Murrell was arrested.Specialist officers were asked to bring fresh ideas to the table once they had seen the evidence.They conducted what has been reported as a 'peer review' into Police Scotland's investigation last year, between October and December.",
        "The force had been looking into allegation of fraud pertaining to £600,000 in donations that should have been ring-fenced for pro-independence campaigning since 2021.Nicola Sturgeon resigned as SNP leader in February, just a few months after the alleged NCA review.Her husband was arrested in April and questioned for 11 hours before he was released without charge.Peer reviews are standard practice in policing and it would not be out of the ordinary for Police Scotland to have requested one, as The Times reported. It came as detectives carrying out a fraud inquiry into the Scottish National Party are  investigating the whereabouts of £400,000 bequeathed to it in supporters' wills. ",
        "Police Scotland is probing what happened to some £660,000 given to the party to fund a second independence referendum.The party received some large bequeaths in recent years, including £300,000 from the estate of Estelle Brownrigg, who died aged 73 in 2018. ",
        "The Sunday Mail reported that the party has received a million in this way since 2021, with a source saying: 'Large sums left to the party in wills are being looked at as part of the investigation. 'Huge amounts have been left over the years, including donations declared to the Electoral Commission in recent months.'In terms of the independence fund money which has been reported as missing, there is around £400,000 which officers are trying to account for. It is a complex investigation being run by specialist officers with training in financial fraud.'They are looking at company accounts and bank accounts and at specific items which have been purchased and where funds and items have ultimately ended up.'Police Scotland declined to comment when approached by MailOnline. MailOnline has contacted the National Crime Agency for comment."
    ]
}