{
    "articleURL": "/news/article-12054649/Retail-bloodbath-continues-Christmas-Tree-Shops-files-bankruptcy.html",
    "content": [
        "The popular retailer has 83 locations around the country according to its websiteFor more than five decades, the bargain retailer has sold household furnitureIt comes after previous owners of the company, Bed, Bath &amp; Beyond, started liquidation sales as they wrap up business Discount home goods chain Christmas Tree Shops has filed for bankruptcy, making it the latest in a series of retail shops deciding to close up. ",
        "Christmas Tree Shops said in a statement that its bankruptcy was a 'strictly financial restructuring,' and that most of its stores would remain open without disruption.The store - which last year was forced to rebrand to CTS as some customers assumed they only sold Christmas trees - has 83 locations around the country according to its website. The Middleborough, Massachusetts, based company has between $50 million and $100 million in assets and between $100 million and $500 million in debts.",
        "The company said its debt had become unsustainable due to interest rates, inflationary pressures and decreased consumer demand for its home decor and seasonal products.CTS entered bankruptcy with a $45 million loan from Eclipse Business Capital SPV LLC and ReStore Capital LLC, according to the company.The company intends to close 10 of its 83 stores during its bankruptcy, seeking to emerge from Chapter 11 by August.For more than five decades, the bargain retailer has sold household furniture, food, toys as well as the eponymous Christmas decorations. The company now has 14 locations in New York, 10 in New Jersey, seven in Pennsylvania and five in Florida. With 5,700 employees nationwide, according to PitchBook, the company has not filed a Worker Adjustment and Retraining Act notice in the state, according to Forbes.",
        "It comes after Bed, Bath &amp; Beyond, who previously owned Christmas Tree Shops, decided to shutter all of their 360 locations. ",
        "The home goods retailer filed for bankruptcy in a District of New Jersey court, listing both its estimated assets and liabilities in the range of $1 billion and $10 billion, according to the court filing.Bed, Bath &amp; Beyond stores will stay open for the time being, but a liquidation process has begun which will eventually see all 360 of its stores closing.The company said that it has received a commitment of approximately $240 million in debtor-in-possession financing from Sixth Street Specialty Lending Inc, according to a separate statement.The store has since moved to 'slash' prices to empty some of its defunct stock."
    ]
}