{
    "articleURL": "/money/markets/article-12041479/Coca-Cola-HBC-says-benefited-price-hikes.html",
    "content": [
        "Coca-Cola HBC expects its full-year profit to reach the top end of forecasts In February the group said it would increase prices this year amid higher costs Bottling group Coca-Cola HBC AG expects its full-year profit growth to reach the top end of its guidance, aided by strong demand for its soft drinks and price increases.",
        "The FTSE 100-listed business said growth was driven by price-mix and volume growth in its sparkling, energy and coffee divisions, but this was offset by falls in stills, primarily due to an anticipated weakness in water. Coca-Cola HBC shares rose today and were up 2.47 per cent or 60.00p to 2,493.00p this afternoon. In the past year the company's share price has surged over 50 per cent. ",
        "On pricing, the company noted today: 'Low-teens percent COGS/case increases in 2023.' HBC's net sales revenue per case for the quarter grew by 21 per cent on an organic basis, smashing analyst forecasts of 16.7 per cent growth.The group said it expected organic earnings before interest and taxes growth to be at the high end of its forecast range of -3 per cent to +3 per cent.It continues to expect organic revenue growth above its 5 to 6 per cent average target range at a group level. Boss Zoran Bogdanovic, said: 'Market shares improved for both non-alcoholic ready-to-drink and sparkling, while we effectively implemented thoughtful price and mix changes in the face of continued cost inflation.'   Many drinks makers have raised prices in line with a rise in energy and commodity prices after Russia's invasion of Ukraine last year, but businesses like Coca-Cola HBC have witnessed sustained demand as customers continued to spend on soft drinks.",
        "In the first quarter ending 31 March, the group saw its value share rise by 70 basis points in the non-alcoholic ready-to-drink market, while sparkling value share increased by 10 basis points.But foreign exchange movements hit reported revenue growth by 0.6 percentage points, primarily due to currency devaluation in Nigeria and Egypt. The group said it continued to invest in its '24/7' portfolio, including the build-out of the energy category in Egypt, the relaunch of the adult sparkling brand Kinley in the second quarter, and the launch of Jack Daniel's and Coca-Cola in Poland, Ireland and Hungary in April.The company is also gearing up for additional Caffè Vergnano launches for the second quarter in Czech Republic and Slovakia.Bogdanovic, said: 'Although some markets have been impacted by a tougher consumer environment, our track record of successful revenue growth management and our sustained focus on investing in data enhanced growth capabilities puts us in a strong position to adapt.'We have continued to invest in our portfolio to strengthen our position as 'the leading 24/7 beverage partner.'Looking ahead, the company, said: 'We have delivered a good start to 2023, led by execution of price increases and a robust volume performance across key markets and categories. 'While being mindful of ongoing macroeconomic and geopolitical risks, we now have greater confidence in achieving positive organic EBIT growth in 2023.'",
        "In February the group announced it would increase prices this year to tackle a rise in costs. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}