{
    "articleURL": "/sciencetech/article-12041381/Woolly-mammoths-SEX-mind-Males-experienced-surges-testosterone-analysis-reveals.html",
    "content": [
        "Experts have drawn parallels between today's elephants and woolly mammothsWoolly mammoths experienced a testosterone surge during a state of 'musth'This is a period of frenzied excitement and aggression among large mammals Dribbling urine and huge hormonal surges are two key - albeit unromantic - signs that it's time for an elephant to mate.",
        "Now, scientists have drawn significant parallels between these modern-day giants and their extinct mammoth relatives who may have exhibited similar signals.Analysis of tusks from over 30,000 years ago has unveiled that woolly mammoths experienced enormous surges in testosterone during mating season.This state, known as 'musth', comes from the Hindi word for intoxicated, marking a period of frenzied sexual excitement and aggression among larger mammals.The University of Michigan-led research is a historic landmark for uncovering the past mysteries of mammoths, being the first piece of evidence to prove they underwent musth.",
        "'Temporal patterns of testosterone preserved in fossil tusks show that, like modern elephants, mature bull mammoths experienced musth,' said study lead author Michael Cherney, a research affiliate at the U-M Museum of Paleontology.",
        "Woolly mammoth (Mammuthus primigenius) is an extinct species of elephant found in fossil deposits in Europe, northern Asia, and North America. The species was known for its large size, fur, and imposing tusks, which were curvier than today's elephants.Thriving during the Pleistocene ice ages, woolly mammoths died out after much of their habitat was lost as Earth’s climate warmed in the aftermath of the last ice age. ",
        "He also told MailOnline: 'For the first time, we can see these testosterone surges in an extinct species of elephant, the woolly mammoth. ",
        "'This might be as close as we're going to get to having direct evidence that these ice-age animals experienced the entire suite of attributes that we associate with musth, including aggressive behavior, dribbling urine, secretions from the temporal gland behind the eye, and even a change in posture and how they walk.'Woolly mammoths (Mammuthus primigenius) were one of the last in a line of mammoth species to exist before their extinction around 4,000 years ago.The species co-existed with early humans, who hunted them for food and used their bones and tusks for making weapons and art.The cause of their extinction is currently uncertain, with intense debate on the roles of human hunting and severe climatic change.In this study, scientists used the bony material of dentin to help reconstruct the histories of mammoths.This tissue not only makes up human teeth but the bulk of elephant and woolly mammoth tusks, preserving hormone fluctuations.'Tusks hold particular promise for reconstructing aspects of mammoth life history because they preserve a record of growth in layers of dentin that form throughout an individual's life,\" said study co-author Daniel Fisher, a professor in the Department of Earth and Environmental Sciences.'Because musth is associated with dramatically elevated testosterone in modern elephants, it provides a starting point for assessing the feasibility of using hormones preserved in tusk growth records to investigate temporal changes in endocrine physiology.'",
        "To get a full picture, the team looked at the tusks of a 55-year-old male mammoth that lived between 38,866 to 33,291 years ago and a female that lived nearly 6,000 years ago. ",
        "The male's right tusk was discovered by a diamond-mining company in Siberia around 16 years ago.The female's was also found off the coast of Russia at Wrangel Island - the last known place where woolly mammoths survived. These were compared with the tusk of a 30-to-40-year-old modern day African elephant that was killed near Maun, Botswana in 1963.This elephant was understood to have experienced testosterone 20 times higher during musth than any other point in the year.On the flip side, male mammoth surges were seen to be just 10 times higher than other points in the year - half of that experienced by elephants.The female mammoth showed even lower but more stable testosterone levels, according to the researchers based in Russia, France, the Netherlands, and the US. 'Lower mean hormone levels in the mammoth tusks compared with those in the elephant tusk might be a result of degradation or other technical factors associated with preservation, but patterns of relative abundance appear to persist and are similar in modern and fossil records,' the study said.The scientists hope their research will pave the way for further exploration into the lives of ancient organisms, humans and extinct apes.",
        "They stress that teeth and tusks are vital tools for piecing together history as they do not decay or become contaminated like hair and nails. 'With reliable results for some steroids from samples as small as 5 mg of dentin, these methods could be used to investigate records of organisms with smaller teeth, including humans and other hominids,' the authors wrote. 'Endocrine records in modern and ancient dentin provide a new approach to investigating reproductive ecology, life history, population dynamics, disease, and behavior in modern and prehistoric contexts.'",
        "The latest mammoth research comes just a month after scientists found that woolly mammoths were perhaps not as fluffy as history remembers them. The new study was conducted by researchers at the Centre for Palaeogenetics, Stockholm University and the Swedish Museum of Natural History. 'We wanted to know what makes a mammoth a woolly mammoth,' said lead author David Díez-del-Molino at the Centre for Palaeogenetics.'Woolly mammoths have some very characteristic morphological features, like their thick fur and small ears, that you obviously expect based on what frozen specimens look like.'But there are also many other adaptations like fat metabolism and cold perception that are not so evident because they're at the molecular level.'",
        "There are several leading theories for what killed off the ice age giants like the woolly mammoths.Woolly mammoths are thought to have roamed the Earth from about 200,000 years ago before eventually dying out 10,000 years ago.At this time the planet was undergoing a major change in climate that is thought to have led to the shrinkage of their habitat.Unable to find the food they needed their populations became smaller and increasingly isolated.A study in 2008 estimated that changes in climate as a result of the end of the last glacial period saw their habitat shrink from 3 million square miles to 310,000 square miles.Some researchers have suggested that the spread of forests, which overtook the extensive areas of frozen grassland and tundra where mammoths thrived, led to their extinction.The changes in climate also opened up large parts of the northern hemisphere to humans, allowing groups to spread more widely around North America, Asia and Europe.Many blame overhunting by humans for finally finishing off the dwindling populations of megafauna like mammoths.More recently some scientists have adopted theories that sudden changes in climate, known as the Younger Dyas period, left many large animal species unable to cope.It is thought this period of cooling may have been caused by the collapse of the North American ice sheets into the Atlantic Ocean, leading to the seas cooling dramatically.Others have suggested this was triggered by a large explosion from an asteroid or comet impact that spread debris around the globe.The woolly mammoth - a cousin of of today's Asian elephants - were commonly found in North America and Siberia and forced into extinction about 4,000 years ago. They were covered in thick brown hair to keep them warm in their freezing conditions, which would often fall to as low as −50°C.They woolly mammoths were around 13ft tall with fur that reached lengths of 3ft. They lived in the Pleistocene Period, which started 1.8million years ago but ended around 10,000 years ago with the last Ice Age. Woolly mammoths and modern-day elephants are closely related, sharing 99.4 per cent of their genes.  "
    ]
}