{
    "articleURL": "/wires/reuters/article-12040751/Haleon-quarterly-profit-squeezed-higher-costs.html",
    "content": [
        "By Natalie Grover",
        "LONDON, May 3 (Reuters) - Pfizer's plan to sell its Haleon stake is not a surprise, the consumer health company's finance chief Tobias Hestler told Reuters on Wednesday.London-listed Haleon was carved out as an independent company in July and comprises consumer health assets once owned by GSK and Pfizer.Pfizer, which has a 32% stake in the maker of Sensodyne toothpaste and Panadol painkillers, told the Financial Times on Tuesday that it intends to offload that stake in a \"slow and methodical\" manner within months.Hestler said Pfizer has long been clear about its intention to sell off the stake, suggesting that the reason the potential of the selloff has gained traction is because the selling window opens around the time that Haleon's results are announced.\"This will happen every quarter from now until they're sold off...this is just what's expected,\" he said, adding: \"If I get a courtesy call the evening before they do it then that would be nice, but they don't even have to do that.\"Shares of the world's biggest standalone consumer health business were down more than 3% in early trading.\"These stock 'overhangs' can depress share prices in the short term, but it seems unlikely anyone will not buy a pack of Advil or Tums because Pfizer are thinking of selling a non-core investment,\" said Steve Clayton, head of equity funds at Hargreaves Lansdown.",
        "Haleon, which sells non-prescription drugs, vitamins and oral care products, on Wednesday reported a fall in quarterly adjusted profit margin, mainly because of \"cost inflation and incremental standalone costs\".Like its consumer staples competitors, Haleon has been subject to cost inflation, which rose during the COVID-19 pandemic and was exacerbated by Russia's invasion of Ukraine.Apart from somewhat lower energy prices, most costs that make a difference to Haleon such as packaging, aluminium and labour are still rising, albeit at a slower pace, Hestler said.\"What I'm seeing right now is probably single digit cost inflation so there's still cost inflation coming through in the business, he said. (Reporting by Natalie Grover in London; Editing by David Goodman and Alexander Smith)"
    ]
}