{
    "articleURL": "/travel/article-12041323/Kick-St-Kitts-Caribbean-island-beautiful-beaches.html",
    "content": [
        "St. Kitts is proof that good things come in small packages. Along with its even tinier sister island of Nevis, it's the smallest country in the Western Hemisphere but it's packed with pure joy.",
        "Just 18 miles long, St. Kitts – named by the explorer Christopher Columbus – is an unspoiled gem with everything you'd expect from an incredible sunshine holiday…and a lot more besides.",
        "With a unique history to uncover, a volcano deep in the heart of the rainforest and festivals galore – and with the thermometer staying at a steady 25-28C all year round - you can really make the most of your break.And with British Airways flying to St. Kitts up to two times a week year round, it's incredibly easy to reach.So what makes St. Kitts so special?ALL ABOARD!",
        "If you only do one thing in St. Kitts, make it the Scenic Railway. You'll be serenaded by a choir on the double decker train as it chugs along giving you extraordinary views of the island's mountains, coast and plantations.You'll love a tasting tour at the Old Road Rum Co – the oldest standing distillery in the Caribbean – or a visit to St. Kitts Eco Park, home to the largest greenhouse in the islands.And try to get down to Black Rocks to watch the waves pounding over the black lava coastline...MADE FOR ADVENTURE",
        "Deep in the heart of the rainforest is Mount Liamuiga, the crowning glory of St. Kitts and a dormant volcano standing a massive 3,972 ft high. It's a challenging two-hour hike but the views are worth it.",
        "High octane enthusiasts can get their thrills ziplining, with a quad bike tour, horse-riding, scuba diving or sailing a catamaran around the island.Or try your hand at water sports like kite surfing, paddleboarding and kayaking. RICH HISTORY",
        "Growing up in St. Kitts, my fondest memory is watching local folklore groups, such as the masquerades and moko jumbies (stilt walkers), performing in my village during Christmas and Carnival season.I love how friendly and genuine the locals are. The scenery is amazing, our rich history and culture makes St. Kitts unique but it's the vibe of Kittitians that make the island unforgettable.The most beautiful sunsets can be found at the Timothy Hill look-out point where the Caribbean Sea meets the Atlantic Ocean and also at Sunset Reef with its unobstructed water views.St. Kitts is simply a gem on its own. It remains authentic in every avenue, and I think that is what differentiates the island from other neighbouring islands.Danielle Weekes of St. Kitts Tourism Authority ",
        "St. Kitts' story is one of colonial battles and sugarcane cultivation.Visitors can find out more at the National Museum in the capital Basseterre, also home to the beautiful Old Treasury Building and The Circus which was inspired by London's Piccadilly.There's also the remarkable UNESCO World Heritage site of Brimstone Hill Fortress National Park, dating from 1690, to visit. ",
        "The gardens of Romney Manor were once owned by a forefather of US president Thomas Jefferson, and are now open for the public to explore.FOODIE HEAVENFresh fish is a St. Kitts speciality so, for a sea-to-fork dining experience, try Arthur's in Dieppe Bay or the Sprat Net which has live bands twice a week.But St. Kitts is not just about seafood.Vegans should head to Ital Creations, wine buffs to the Carambola Beach Club (home to 4,000 of the finest bottles) while El Fredo's serves hearty portions of conch fritters and other St. Kitts classics.Just don't forget to try the national dish of saltfish, dumplings, breadfruit and plantain and a tot of rum! ",
        "HEAVENLY HOTELSKick back and relax in one of British Airways Holidays carefully selected hotels. Nestled on the secluded beach of Banana Bay is the Park Hyatt St. Kitts Christophe Harbour which has 77 rooms and 47 suites all with stunning ocean views – and some with private pools. There are three restaurants, adult and child pools, a gorgeous spa and activities for little ones.Also geared to families is St. Kitts Marriott Resort – the largest on the island – at North Frigate Bay. Its five restaurants, three pools and a spa should keep everyone happy!FESTIVAL FEVER",
        "St. Kitts knows how to party! And the biggest is Sugar Mas between November and January this year – similar to Mardi Gras and the very best way to experience Kittitian culture.",
        "But there's more. In June comes the three-day St. Kitts Music Festival where local and international artists perform side by side, July sees Restaurant Week where the island's culinary talents create one-off menus while the Latin Fiesta in October celebrates Hispanic music.There's a channel swim for everyone between the two islands in March while in August and September professional sportsmen take over as the Caribbean Premier League T20 Cricket competition comes to town.NEVER FORGET NEVIS",
        "It's just over two miles away from St. Kitts by sea but time has stood still on Nevis, once a favourite hideaway for Lord Nelson and Princess Diana. Explore the exotic flora and fauna of the lush rainforests, hike to Nevis Peak and snorkel in the island's beautiful waters. Then soak your weary muscles in the healing waters of Nevis' hot springs before a sundowner on the beach…*For more information and to book your St. Kitts holiday head to ba.com/stkitts",
        "British Airways flies to 14 different Caribbean islands – more than any other UK airline.Their in-house tour operator, British Airways Holidays offers the full package from flights and hotels to car hire and airport transfers.All British Airways Holidays are ATOL protected, include 23kg checked baggage allowance per person as standard and offer a 24-hour holiday helpline to ensure peace of mind throughout your holiday.And it's so easy to book an amazing trip with British Airways Holidays as you can secure your holiday with a low deposit from just £75pp, with flexible payment options before you fly*.*T&amp;Cs apply. Deposit balance due 7 weeks in advance for long haul. See ba.com/deposits for more information."
    ]
}