{
    "articleURL": "/sport/afl/article-12058273/Incredible-moment-Gold-Coast-Suns-AFL-star-Matt-Rowell-eats-grass-loss-Melbourne-Demons.html",
    "content": [
        " Pre-game ritual completely baffles everyone Star's dietary habits caught by Seven's cameras Eating turf is not a wise moveIn 2019, star AFL midfielder Matt Rowell was the first player picked in the draft that year. In 2023, he became the first AFL player to be caught on camera eating the grass from the surface of the stadium he was about to play on.",
        "In what can only be described as a truly bizarre moment, the Suns gun got down on his haunches, grabbed a handful of the Heritage Bank Stadium turf before Saturday's match against the Demons - and ate it.Now, don't be overly alarmed. ",
        "In principle, people can consume some grasses. Many are non-toxic and edible, and in fact our ancient ancestors dined on grass millions of years ago, according to a study published in the Proceedings of the National Academy of Sciences. As a practical food source, however, your lawn leaves a lot to be desired.And some grasses can cause enormous problems.The regular grass that grows on footy fields, for example, is not good to eat. Aside from the risks of dirt, germs and bacteria, which Rowell would have consumed in abundance, it contains a large amount of cellulose, which humans can't digest. So, kids, don't try this at home. Or on Saturdays prior to a match. Fox Footy host Andrew Gaze came up with a theory when he saw footage of Rowell's insane preparation for the match.'That's about connecting,' Gaze reasoned.'You connect with your environment and then it all comes back, it's like this big circle.'",
        "Just as well Gazey didn't do same during his career. Imagine the splinters. ",
        "Comments started flying all over social media and were as varied as the concept of eating grass was odd.Brian Marshall on twitter said: 'Weird? But dangerous, the grounds have probably been sprayed with fertilizer and weed killer.' Jenny Beck was a tad more sassy, 'Ffs. No. Change. That's disgusting,' while Dee Folt seemed just take it all in his stride with, 'The guy's a gun. Weird, but a gun!'Anyway, as symbolic as the gesture was for Rowell, the Suns played bravely but went down to Melbourne by just five points, despite missing key players.For what it's worth, Matty Rowell played extremely well. The Demons' 13.12 (90) to 13.7 (85) win was their 11th straight defeat of the Suns.Darcy Macpherson missed his shot to tie the game with 20 seconds remaining, while key forward Ben King was earlier controversially denied a free kick at a crucial stage.Gold Coast were without injured star trio Touk Miller, Ben Ainsworth and Lachie Weller but Noah Anderson stepped up to the tune of 36 touches and one goal.He and the resident bull Rowell - 11 clearances, 13 contested possessions - held sway with Christian Petracca and Clayton Oliver among Melbourne's best as the Suns  dropped to three wins and five defeats for the season."
    ]
}