{
    "articleURL": "/tvshowbiz/article-12054425/Mayim-Bialiks-comedy-series-Call-Kat-canceled-Fox-losing-viewership.html",
    "content": [
        "The Mayim Bialik–starring comedy series Call Me Kat has been canceled after three seasons on the air.",
        "The news about the program was revealed by Deadline on Friday, and it was also reported that the show, which aired on Fox, had experienced a drop in viewership over the course of its run, particularly in its third season.Call Me Kat was also struck by tragedy in October of last year, when one of its stars, Will &amp; Grace actor Leslie Jordan, suffered a medical emergency while driving and crashed his car into the side of a building in Hollywood. The 67-year-old comic star was pronounced dead at the scene.Bialik, who recently spoke about The Big Bang Theory's upcoming spinoff, recently promoted the finale of the third season, which aired on Thursday evening, on her Instagram account.A spokesperson for Fox gave a statement to Deadline to elaborate on why Call Me Kat was being taken off the air.",
        "'We are very proud of Call Me Kat. But, unfortunately, the audience response to it was not as strong as we had hoped,' they said. The spokesperson went on to express that the company was grateful for the efforts that had been made by the show's creative team over the years. 'We are thankful for our partnership with Warner Bros. Television, That’s Wonderful Productions, Sad Clown Productions, BBC Studios... and the entire cast and crew for their work and dedication to Call Me Kat,' they said.",
        "It was also reported that Fox's head of comedy, Cheryl Dolins, is currently planning on bringing more shows to the network.Call Me Kat was adapted from the British program Miranda, which starred Miranda Hart and ran from 2009 until 2015.The original show's star also served as one of the remake's executive producers.Call Me Kat was centered on a woman who gave up her job as a professor in order to open a cat cafe while dealing with the trials and tribulations of her late 30s.In addition to Bialik, who portrayed the show's title character, the program's cast included performers such as Swoosie Kurtz, Kyla Pratt and Leslie Jordan.The 47-year-old Jeopardy! host also served as one of the program's executive producers alongside her Big Bang Theory cast mate Jim Parsons.",
        "Call Me Kat's inaugural season premiered in January of 2021 and ran for a total of 13 episodes.The show's second season was comprised of 18 episodes that aired from January to May of last year.The program's final season debuted this past September and concluded with its finale, entitled Call Me A Donut Wall, which premiered on Thursday night.Call Me Kat received mixed to negative reviews throughout its run, and it currently holds a 53% average audience score on Rotten Tomatoes. "
    ]
}