{
    "articleURL": "/wires/aap/article-12058455/Paro-plans-sidestep-dodgy-decisions-title-fight.html",
    "content": [
        "Rising Australian boxing star Liam Paro wants to avoid any reliance on \"dodgy\" judges after landing a world-title shot that has been four years in the making.",
        "The undefeated super-lightweight will fight for the same WBC strap Australian boxing great Kostya Tszyu held more than 20 years ago when he takes on Regis Prograis in the reigning champion's New Orleans home town on June 17.Paro has been in the mix for a world-title shot for almost four years and had two fights scuppered by injury and administrative hurdles since his devastating first-round knockout of compatriot Brock Jarvis in Brisbane last October.But the wait is over thanks to Prograis' move to Eddie Hearn's Matchroom stable, which also houses plucky Mackay product Paro.Hearn has made no secret of who's top dog, though, trumpeting his marquee man at this week's Canelo Alvarez fight before announcing the Paro match-up.Another Australian, Stevie Spark, was denied in a split-points decision on that card, while Liam Wilson was beaten in controversial fashion in his world-title fight against Emanuel Navarrete in another partisan call in Phoenix in February.The Paro-Prograis title fight will headline the card at the Smoothie King Centre and Paro knows the odds will be stacked against him given the Louisiana native's standing.\"To put him away would be unreal, then we wouldn't have to worry about the dodgy judges,\" Paro said on Monday.\"But I'm confident I can give him a boxing lesson and win on a unanimous decision.",
        "\"If it goes 12 rounds, I feel I have the legs and skills to outbox this guy.\"Prograis has already talked about what he'll do once he beats Paro, who will head to the United States at the end of the week to begin his fight camp.\"I pray he is overlooking me, because he's going to cop a rude shock,\" Paro said.\"I'd love to crush his dreams; go over there to his backyard and do that in front of his friends, family and fans.\""
    ]
}