{
    "articleURL": "/news/article-12047349/Donald-Trump-defends-infamous-grab-p-y-comments-deposition-rape-trial.html",
    "content": [
        "Donald Trump said in a video deposition played at his rape trial that the lewd comments he made in the infamous Access Hollywood tape were trueThe 45-minute deposition was played as part of the civil battery case brought by advice columnist E. Jean Carroll at New York court Thursday Trump has been in Scotland and Ireland all week visiting his golf courses, but said Thursday he would appear at the trial  Donald Trump defended his lewd comments in the infamous Access Hollywood tape and said they were 'true' in a taped deposition taken by rape accuser E. Jean Carroll's lawyers.",
        "The former president said that when he claimed he could grab women 'by the p***y' in a 2005 exchange with host Billy Bush that it was 'true of [all] stars.'Asked in his deposition if Trump considered himself a star, he said: 'Yeah.'The comments became public just days before the 2016 election and at the time Trump insisted what he said was just 'locker room talk.'The 45-minute deposition was played in court Thursday as part of the civil battery case brought by advice columnist E. Jean Carroll, who claims Trump raped her in a department store dressing room in 1996.The deposition was filmed in October last year and showed Trump sitting at a desk wearing a dark suit and a light blue tie. He appears bored and dismissive of the proceedings, rarely smiling when questioned by Carroll's attorney Roberta Kaplan, who is off screen.",
        "Carroll is also suing for defamation after Trump called her a liar on social media and in official statements while he was president.Trump told reporters on while in Ireland Thursday, 'I have to leave Ireland and I have to leave Scotland where I have great properties. I have to leave early. I don't have to, but I choose to.'Then he was asked if he will attend Carroll's trial.",
        "'I probably will and i think it's a disgrace,' he said. 'It's a disgrace that it's allowed to happen against a rich guy or in my case, against a famous, rich and political person that's leading the polls by 40 points. 'And I have to go back for a woman that made a false accusation about me, and I have a judge who is extremely hostile and I'm going to go back and I'm going to confront this. 'But this woman is a disgrace and it shouldn't be allowed to happen in our country.'His lawyer Joe Tacopina however cast doubt on Trump appearing at the court proceedings.He simply said 'no' when asked to confirm Trump's travel plans.Tacopina had also previously told the court that the defense would not bring any witnesses – shutting down the possibility that Trump would appear on the stand to refute Carroll's allegations. ",
        "Trump was shown the Access Hollywood tape, which was filmed in 2005 and showed him on a hot mic with Billy Bush.Trump looked away briefly when he was heard remarking that because he was famous he could 'grab 'em by the p***y', referring to women he met.Kaplan asked what Trump meant by that remark. He said: 'Historically that's been true of the stars.'",
        "Kaplan pressed him again and Trump said, 'If you look at the last million years that's been largely true. Unfortunately or fortunately'.Kaplan asked if Trump considered himself to be a star. He replied: 'I think I can say that, yeah'.Kaplan asked if Trump's previous claim that his remarks were 'locker room talk' meant it wasn't true.Trump dodged and said, 'It's locker room talk, it's the way people talk.'During the deposition Trump bristled repeatedly and became irate at the questioning.He insulted Carroll and claimed her 'big claim to fame' was meeting him several years before the alleged rape when the crossed paths at a charity gala.Trump was asked about his remarks on social media that Carroll was 'not my type'.",
        "He said: 'I saw her in a picture. I didn't know what she looked like. I said it and I'll say it with as much respect as I can but she's not my type.'Physically she's not my type. Now I have gotten to hear things about her she wouldn't be my type in any way, shape or form'.Trump called Carroll a 'wack job', adding: 'I think she's sick, mentally sick'.Trump was asked about why he used the word 'swooned' in one of his statements attacking Carroll.",
        "He said that it was 'a nicer word than the word that starts with an F'.He said that using the F-word would have been 'inappropriate' in a public statement.Kaplan pointed out that the dictionary definition of swoon was to 'faint with extreme emotion' and asked Trump if that was what he meant.He said: 'That's what she said I did to her. She fainted with great emotion. She indicated she loved it until a commercial break. I think she said it was sexy to be raped'.The remark was in relation to an interview that Carroll gave to CNN host Anderson Cooper in 2019 in which she discussed her lawsuit.Trump said that in the interview Carroll 'said that rape is sexy, which it's not by the way'.He said: 'She said rape was sexy. She said things which were very strange. He (Cooper) said we're going to take a break right now. He was very upset. She came back and she was a much different woman in the second half (of the interview).Kaplan asked if Trump seriously meant Carroll said she loved being sexually assaulted. He replied: 'She said something to that effect.'I believe she said rape was sexy. Anderson Cooper was dying, (he said) let's go to commercial break'.",
        "Kaplan tried to suggest that Carroll's point was that some people view hold the that rape is sexy.He said: 'I believe she said rape is sexy'.Trump called Carroll a 'nut job' and said he stood by his public comments about her not being his type.He said: 'It's not politically correct to say she's not my type, I know that but I will say it anyway'.Trump got worked up and visibly irate as he said: 'She's accusing me of rape. A woman who I have no idea who she is. She's accusing me of rape. The worst charge. And it's not true'.Addressing Kaplan, he said: 'You're a political operative. You're a disgrace'Kaplan asked Trump what else he considered a 'hoax', the word he used to describe Carroll's claims.He reeled off the various investigations into him including 'Russia, Russia, Russia' and 'Ukraine, Ukraine, Ukraine'.He called Carroll a 'sick person, really sick, there's something wrong with her'.",
        "At that point Trump was shown the Access Hollywood tape. Afterwards he said it was 'old news' that had been 'litigated during debates' and that he stood by his comments it was just 'locker room talk'.Kaplan asked if he really did take the woman in question to a furniture store, as he claimed in the tape.",
        "Trump said: 'I actually did…it was a long time ago'.Kaplan asked about claims by journalist Natasha Stoynoff, who testified that Trump sexually assaulted her in 2005 at his Florida estate while she was writing an article for People magazine about the first anniversary of his wedding to wife Melania.Trump called the allegations 'phony'.Trump was also asked about the other accuser, Jessica Leeds, who said he groped and kissed her on a flight in 1979 against her will. He was shown a video of himself speaking at a rally where he said that Leeds 'wouldn't be my first choice'.He said that it was a 'made up story'. He said he had a 'right to be angry' because the story was false.He said: 'This is a disgrace'.Turning to Kaplan, he said: 'You wouldn't be a choice of mine either. I hope you're not insulted. I wouldn't under any circumstances have any interest in you.'When people accuse me of something I have the right to be insulting'."
    ]
}