{
    "articleURL": "/wires/pa/article-12051621/Bojan-Miovski-keen-pass-20-goal-mark-season-Aberdeen.html",
    "content": [
        "Aberdeen striker Bojan Miovski is eager to break the 20-goal mark in his first season in Scotland but does not care whether he is the club’s top scorer.",
        "Both Miovski and Luis ‘Duk’ Lopes have netted 18 goals so far and 16 of them each in the league.The North Macedonia international said: “It’s not like a competition. We support each other, we play for the same club. I am happy when he scores and he is happy when I score. If we continue to score goals then I think everyone at the club will be happy.“At the start of the season our aim was to finish third and to score goals. I think that I have done well until now but we have five more games. Nothing is finished.“We need to keep on this way and continue winning games. I want to score 20 goals so I am close to this number and I want to score more if I get 20.”Duk is on a rich vein of form with six goals in his last six games, while Miovski ended a recent six-match barren spell by scoring against Rangers last time out.",
        "Miovski is thriving in the partnership with the former Benfica attacker.“He is such a funny guy,” Miovski said. “We enjoy playing on the pitch and we speak everyday at training as well on how we can improve and make new things on the pitch. I really love it when I play with him.”",
        "The Dons are on a seven-game winning run which saw Barry Robson being handed a two-year contract as manager this week.“He is a great manager and I am happy he has signed for two years more,” Miovski said.“Of course we are enjoying it. We play very good football. Now we are more aggressive and we don’t concede a lot of goals.”The Dons have the chance to consolidate third place in the cinch Premiership when they travel to Ibrox on Sunday.“It’s always difficult when you play there but we are motivated,” Miovski said. “We beat them at home and we will go with the same mentality.”"
    ]
}