{
    "articleURL": "/wires/ap/article-12048075/California-lawmakers-OK-emergency-loans-failing-hospitals.html",
    "content": [
        "SACRAMENTO, Calif. (AP) - Alarmed by the closure of a rural hospital earlier this year, California lawmakers on Thursday voted to loan $150 million to struggling medical centers in the hope of preventing a cascade of similar failures across the state.",
        "The only hospital in Madera County closed in December, leaving the community of nearly 160,000 people with no medical center within a 30-minute drive. The closure was a startling reminder of the plight of many community hospitals in mostly rural areas of the country that have struggled to stay open during the coronavirus pandemic.Since then, hospitals in El Centro, Montebello, Hawkins and Visalia have all teetered on the brink of collapse, with one declaring bankruptcy and another being taken over by a state university to prevent its closure. A report last month paid for by the California Hospital Association warned that 20% of the state's more than 400 hospitals were at risk of closing.California lawmakers typically don't approve new spending until June following months of debate and negotiations with the governor's office. But the crisis is so severe that legislative leaders and Gov. Gavin Newsom agreed to go ahead and spend this money now, pledging to do more later in the year when the budget is finished.\"I don't think people are appreciating what's going on out there. I am very worried,\" said Carmela Coyle, president and CEO of the California Hospital Association, an industry trade group.The pandemic upended hospitals across the country. While many were inundated with COVID-19 cases, patients for other things - like elective surgeries - dried up. Since then, rising inflation and labor costs have made it difficult for hospitals to recover.",
        "In California, the problem has been compounded by an increase in the number of people who get their health care costs paid for by the government. The state's Medicaid rolls increased dramatically during the pandemic, a combination of emergency rules to make the program more accessible and a decision by Democrats to make all low-income adults eligible for the program regardless of their immigration status.While more people are on Medicaid, how much Medicaid pays hospitals has stayed the same. On average, for every dollar a hospital spends to care for someone, Medicaid gives it 74 cents back, Coyle said.That's a problem for hospitals like Kaweah Medical Center in Visalia, where most of its patients are on either Medicaid or Medicare. Nestled in the heart of the San Joaquin Valley, the hospital serves a mostly agricultural community made up of low-income farmworkers.Before the pandemic, the hospital would turn a modest profit of 3% or so each year, according to CEO Gary Herbst. But since 2020, Herbst said the hospital has lost $138 million. It has about $218 million in debt that a credit ratings agency recently downgraded to \"junk\" status.The hospital is supposed to have at least 90 days of operating cash on hand at any time. Before the pandemic, the lowest it ever got was 110 days. At the end of March, it dropped to just 62 days. Herbst said the hospital has lost $39 million through the first nine months of the fiscal year, or more than it lost in all of last year combined.",
        "Herbst said he hopes the hospital will break even next year because of various cost-cutting measures, including laying off about 200 people and cutting back on services. That includes cutting the number of elective procedures for Medicaid patients by 35% because, he said, on \"every one of those procedures we lose money.\"\"If you were an outpatient surgeon who did 10 elective (Medicaid) surgeries a month, you can only do six now. And you have to put your other patients on a waiting list,\" Herbst said.The state will give out the $150 million in the form of interest-free loans to nonprofit or public hospitals that meet certain conditions. The state will prioritize loans for medical centers in rural areas and those that have a disproportionate number of patients on Medicaid, the joint state and federal government health insurance program for the poor and the disabled.The $150 million likely won't be enough to fix the problem. Herbst, CEO of Kaweah Health Medical Center in Visalia, said his hospital needs $50 million - one-third of the money available - to give it \"some breathing room.\"During legislative hearings this week, lawmakers pledged their intent to offer more money in June when the state budget is finished.\"This is just a beginning. It's antiseptic ointment on the cut. We haven´t even started with the Band-Aid,\" said state Sen. Anna Caballero, a Democrat whose district includes the Madera Community Hospital that closed.",
        "But it's unclear how much more the state could pay. The California Hospital Association has asked for a one-time payment of $1.5 billion. But California has a projected $22.5 billion budget deficit, limiting the state's ability to approve new spending.One idea is to bring back a tax on managed care organizations, private companies that administer the state's Medicaid program. The tax triggers more Medicaid payments from the federal government. The last time it was in place, it saved the state $1.5 billion. The tax expired in 2020, but Newsom and some lawmakers want to bring it back.The Newsom administration says it plans to use some of that new tax money to increase payments to hospitals for Medicaid patients. But those increases wouldn't happen until next year at the earliest.\"Any business plan or business model that gets reimbursed 74 cents on every dollar that you spend is a pathway to bankruptcy,\" said state Sen. Shannon Grove, a Republican from Bakersfield."
    ]
}