{
    "articleURL": "/news/article-12042143/Kentucky-Derby-Secretariats-legend-lives-descendants-favorite-Forte.html",
    "content": [
        "The 149th Kentucky Derby on Saturday marks 50 years since Secretariat's winSeven of the 18-horse field this year are his great-great-great grandsonsGoing further back, all but one of the runners has Secretariat in their pedigree Fifty years after Secretariat stunned the world at the Kentucky Derby on his way to a Triple Crown victory, the legendary racehorse's legacy continues through his progeny.",
        "When the starting gates clang open on Saturday for the 149th Kentucky Derby at Churchill Downs, seven horses set to run in the 18-horse field will be great-great-great grandsons of Secretariat.Forte, the early favorite at 3-1 odds, who won this year's Florida Derby with a thrilling late close down the stretch, was also among them but was scratched hours before the race Saturday.Going back further than five generations, Secretariat is found in the pedigrees of every Derby entry except for one: Derma Sotogake, one of the two Japanese-bred colts slated to run this year. A half-century later, no horse has bested the times Secretariat clocked in all three 1973 Triple Crown races, including his stunning victory by 31 lengths at the Belmont Stakes in 2:24 flat, considered an unbreakable record. ",
        "Widely viewed as the greatest thoroughbred racehorse of all time, the horse nicknamed 'Big Red' officially sired 663 foals, with his most prominent legacy coming through his daughters, as a top broodmare sire. 'It is just heartening to know that, in this very special year, there is such a strong Secretariat presence in the Derby,' said Patricia McQueen, author of Secretariat's Legacy, in a phone interview with DailyMail.com.McQueen noted that a five-generation limit excludes several descendants of Secretariat's grandson Storm Cat, a leading sire found in the pedigrees of 12 of this year's Derby runners. ",
        "Another Secretariat grandson, A.P. Indy, is found in the pedigrees of 10 out of the original 19 runners in this year's race, McQueen said.  Storm Cat, A.P. Indy, and Gone West, another ancestor of multiple Derby entries, were all out of the daughters of Secretariat, highlighting Big Red's strength as a broodmare sire.'That so much of the Derby field are descendants of Secretariat -- it just shows that 50 years later, he appears, and mostly through his grandsons,' she said. 'What great sires have always been expected to do is sire sons that went on to be great sires... and that's the one thing Secretariat did not do,' said McQueen. 'The fascinating fact is, his grandsons through his mares did.' Following his death in 1989, it was discovered that Secretariat had a heart more than twice as large as a normal thoroughbred, partly explaining the colt's unmatched performance. 'He had just about everything,' Secretariat's jockey Ron Turcotte told the Associated Press this week. 'He was a good-looking horse, he was a very strong horse, had a long stride that covered a lot of ground, a very cooperative and generous horse. He would give you whatever you asked of him.' ",
        "Big Red's path to legendary status began in the Kentucky Derby, the race known as the 'Greatest Two Minutes in Sports.' ",
        "He was the first horse to cover the Derby's mile-and-a-quarter distance in under two minutes, with a time of 1:59.40, a record that still stands today. After breaking poorly in the Preakness Stakes at Pimlico Race Course, Secretariat came from behind to win by 2 1/2 lengths over Sham, who had also finished second in the Derby. In 2012, a review of video of the race found the track's timing device had malfunctioned, and Secretariat's Preakness time was revised to 1:53, a track record.In the 1973 Belmont Stakes, Secretariat was the heavy 1-10 favorite in the grueling mile-and-half race against just four rivals, including Sham who was back for another try. After setting a blistering early pace and fending off a challenge by Sham in the first half mile, Big Red opened up a massive lead and won by 31 lengths in the greatest performance in racing history.The $3 million Kentucky Derby on Saturday will kick off this year's Triple Crown of races for three-year-old horses, followed by the Preakness Stakes on May 20 and the Belmont Stakes on June 10. Last year, longshot Rich Strike stunned racing fans by winning the Derby as a longshot also-eligible entry, beating the field at 80-1 odds. ",
        "Tapit Trice is now the 4-1 favorite after drawing the No. 5 post, while trainer Brad Cox's Angel of Empire the 8-1 second choice after drawing the No. 14 post. ",
        "Angel of Empire is descended from Secretariat through Storm Cat on his sire's side as well as A.P. Indy on his dam's side.  Hall of Fame trainer Pletcher is seeking his third Kentucky Derby win, having previously won with Super Saver in 2010 and Always Dreaming in 2017.Pletcher also has bay colt Kingsbarns breaking from the No. 6 post at 12-1 odds. Kingsbarns is a great-great grandson of A.P. Indy, Secretariat's grandson.King Russell (50-1), who drew into the Derby after other entries scratched, is a fifth-generation descendant of Secretariat on both sides: through Storm Cat by his sire and Gone West by his dam. Also drawing attention this year are two Japanese colts competing in the Derby, a level of representation for Japan unprecedented in the race's history.They are Hidetaka Otonashi-trained Derma Sotogake (10-1) and and Terunobu Fujita-trained Mandarin Hero (20-1).Derma Sotogake will break from the 17th gate with Christophe Lemaire in the irons, after cruising to a wire-to-wire win in the $1 million UAE Derby (G2) in March.Of all the horses entered in this year's Derby, Derma Sotogake is the only one that does not have Secretariat somewhere in his pedigree, according to the author McQueen. ",
        "Jockey Kazushi Kimura will ride Mandarin Hero, who lost by a nose in the Santa Anita Derby (G1) last month. ",
        "Mandarin Hero is a great-great grandson of Storm Cat, Secretariat's grandson.In the history of the Kentucky Derby, only two Japanese-bred horses have ever contended: Master Fencer, who finished sixth in 2019, and Crown Pride, who came in 13th last year.The four entries that had scratched from the race by Friday afternoon were all also descendants of Secretariat, including fifth-generation progeny Skinner and Lord Miles. Post time for the Derby is 6.57pm ET on Saturday, with NBC carrying the broadcast. "
    ]
}