{
    "articleURL": "/wires/ap/article-12048405/Durant-Suns-work-pull-2-0-hole-against-Nuggets.html",
    "content": [
        "PHOENIX (AP) - Kevin Durant has done just about everything an NBA player can do: He has won two championships, was named league MVP once, made 13 All-Star games and now has a lifetime contract with Nike, joining LeBron James and Michael Jordan.",
        "So it's not surprising that the 34-year-old knows what it takes to overcome a 2-0 playoff deficit.The Suns will lean on that expertise on Friday night, when they attempt to climb out of a 2-0 hole against the top-seeded Denver Nuggets in Game 3 of their Western Conference semifinal series.Durant played for Oklahoma City in 2012 when the Thunder lost the first two games of the Western Conference Finals against the San Antonio Spurs before winning the next four.\"One possession at time,\" Durant said. \"You can´t get everything back at once. Just having that focus, that togetherness on every possession, will lead to something solid.\"The Suns could use a better shooting night from Durant on Friday. He made just 10 of 27 shots, including 2 of 12 3-point attempts, in a 97-87 loss in Game 2.",
        "Nuggets coach Michael Malone said veteran forward Aaron Gordon was doing a good job making life difficult for Durant on the offensive end.\"He is not stopping Kevin Durant. No one is. But he´s making it hard,\" Malone said. \"That´s all you all you can hope for: He´s making it hard and not giving him any easy ones. So he´s locked in, he´s disciplined.\"The Nuggets-Suns series has had the scheduling quirk of three off days between Games 2 and 3, giving both teams plenty of time to rest. That's been particularly useful for the Suns, who likely will play Friday without 12-time All-Star Chris Paul, who has a strained left groin and didn't practice with the team on Thursday.",
        "\"We're a bunch of sore losers,\" Suns coach Monty Williams said. \"That pushes you to get in the gym and look at what you can do better.\"The Nuggets certainly sound like a team that expects to get the Suns' best shot on Friday.\"Obviously, these games on the road are going to be a lot harder than they are at home,\" Denver's Bruce Brown said. \"They´re going to have their fans, they´re going to have their role players play better at home. So we´ve got to be extremely locked in. We´re not going to get calls. We know how that goes. So we´ve just got to be ready to play.\"CELTICS AT 76ERSSeries tied 1-1. Game 3, 7:30 p.m EDT, Friday, ESPN- NEED TO KNOW: The Celtics came out angry in Game 2 after they dropped the opener at home. Boston responded with a 34-point victory, tied for the third-largest margin of victory in a playoff game in team history. The Celtics handled the 76ers 3-1 in the season series, one reason why they are still a 1 1/2-point road favorite, per FanDuel Sportsbook, in Game 3 when the series shifts to Philadelphia.- KEEP AN EYE ON: Jayson Tatum. The All-Star is looking to rebound after being hampered by foul trouble and scoring just seven points in Game 2. The last time Tatum was held to single digits in scoring (nine points on May 25, 2021, in a Game 2 loss to Brooklyn in the first round), he scored a playoff career-high 50 the next game in the Celtics´ lone victory of that series. He has been held to single digits in scoring only six times in 82 career playoff games.",
        "- PRESSURE IS ON: 76ers. Joel Embiid hardly played like an MVP on Wednesday, when he finished with 15 points, three rebounds and five blocks in Game 2, his first game back from a sprained right knee that caused him to miss the final game of the 76ers´ first-round sweep of Brooklyn. He also sat out Philadelphia´s Game 1 win on Monday.- INJURY WATCH: Embiid. It appears unlikely the newly named MVP can regain his form from an injury he was told could take four to six weeks to heal. Yes, the 76ers pulled out a gutsy road win without Embiid in Game 1. But trying to win a series with Embiid not at full strength just might be too much for coach Doc Rivers´ team.NUGGETS AT SUNSDenver leads 2-0. Game 3, 10 p.m. EDT, Friday, ESPN- NEED TO KNOW: The Nuggets are riding high after two double-digit wins in Denver gave them a 2-0 lead in the series. Jamal Murray was the star in Game 1 while Nikola Jokic, who finished second in the league's MVP voting, had a dominant Game 2.- KEEP AN EYE ON: Jokic certainly looked like an MVP in Monday's Game 2 win, notching 39 points and 16 rebounds. It wouldn't be surprising if the 6-foot-11 center has a little extra motivation from the snub over the next few games.",
        "- PRESSURE IS ON: Suns. Phoenix made a dramatic deal for Durant at the trade deadline, hoping to win its first championship in its 55-year history. Now the Suns are two losses from the end of their season.- INJURY WATCH: Paul's likely absence in Game 3 will shake up the playing rotation for the Suns. Cameron Payne - a playoff hero for a few games two seasons ago - should get more playing time. Landry Shamet, Terrence Ross, Damion Lee and T.J. Warren could also see a bigger role.___AP Sports Writers Dan Gelston in Philadelphia and Pat Graham in Denver contributed to this report.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}