{
    "articleURL": "/wires/ap/article-12048321/Mexican-brand-counterfeiting-reaches-new-heights-Coca-Cola.html",
    "content": [
        "MEXICO CITY (AP) - Mexico has long had a problem with piracy and brand counterfeiting, but this week it reached a new height: fake Coca-Cola. As with so many products in Mexico, \"the Real Thing\" may not be that at all.",
        "Mexico City prosecutors said late Wednesday they had raided a property in a rough neighborhood on the city´s east side and found thousands of bottles bearing the Coca-Cola brand.Most of the bottles were empty, but some were filled with what prosecutors called \"supposed\" cola. Investigators also found hoses, pumps, bottle washing facilities and new bottle caps, suggesting that criminals were making their own Coke.They also found stolen delivery trucks, suggesting the gang had been distributing the drinks.\"Information came to light that this property was possibly being used to manufacture soft drinks with similar characteristics to a well known cola brand,\" said prosecution spokesperson Ulises Lara.Lara said agents found crates containing about 780 full bottles, and almost 20,000 empty bottles \"ready to be refilled.\" It was not clear if any of the so-called \"Mexican Coke,\" prized for its cane sugar and glass bottles, had made it to the export market.Mexico's Coca-Cola FEMSA, which describes itself as \"the largest Coca-Cola franchise bottler in the world by sales volume,\" did not immediately respond to an emailed request for comment on the raid.The raid comes less than two weeks after the U.S. trade representative released a damning report saying Mexico's intellectual-property and anti-counterfeiting actions - already weak - have gotten weaker in recent years.",
        "\"The prevalence of counterfeit goods at notorious physical marketplaces remains a significant problem, exacerbated by the involvement of transnational criminal organizations,\" according to the report, released April 26.The report said that Mexican authorities used to raid such markets but that \"this enforcement activity appears to have ceased in recent years.\"\"Criminal investigations and prosecutions for trademark counterfeiting and copyright piracy appears to be non-existent,\" the report said.For decades, Mexico has had a problem with counterfeiters falsifying everything from name-brand blue jeans and sneakers, to prescription medications. U.S. authorities regularly issue alerts about counterfeit pills that are cleverly disguised to look like the real thing."
    ]
}