{
    "articleURL": "/wires/aap/article-12039967/Former-Liberal-president-Tony-Staley-dies-aged-83.html",
    "content": [
        "Former Liberal Party president Tony Staley, who for decades was at the centre of the party's leadership fights, has died aged 83.",
        "The intellectual politician and political assassin, who found inspiration and courage in poetry, served as a minister in Malcolm Fraser's government for four years.Anthony (Tony) Allan Staley was born on May 15, 1939 and died in Melbourne, where he was visited in recent weeks by current Liberal Party heavyweights, including Opposition Leader Peter Dutton.In a statement on Wednesday, Mr Dutton said Mr Staley had shaped Australia's political history in \"two pivotal ways\" - helping to lift Mr Fraser to the Liberal leadership and bring down the Whitlam government.\"I was honoured to visit Tony and his family recently in Melbourne and thanked him for his lifetime of service to the Liberal Party and to his country,\" he said.Former prime minister John Howard said he was sorry to learn of the death of his friend and former colleague, who he described as \"a devoted servant of and contributor to\" the Liberal Party.\"He was a man of great resilience and strength. This was demonstrated by his remarkable courage in the wake of a terrible car accident in 1990, which left him severely disabled,\" he said.Mr Staley took a law degree from Melbourne University, where he was active in student politics.He was a senior lecturer in political science at the university when he won the federal Melbourne seat of Chisholm in a by-election.",
        "He shared a house in Canberra with Mr Fraser in 1972-73 and the pair became close.They would argue late into the night about society and the possibilities and limits of government because, in Mr Staley's words, \"we found it enthralling, not because it mattered to the day's work\".Mr Fraser's biographer Philip Ayres said Mr Staley's interest in politics was intellectual. His ideas were a mixture: right-wing in some areas and quite left-wing in others.Mr Staley was parliamentary secretary to Liberal leader Billy Snedden when he decided in 1974 that Mr Fraser should take over.Many years later, he recalled that two poems by James McAuley gave him the courage to do what he had to do.\"(McAuley's) railing against obsessive materialism without conviction or values is as relevant today as it was when he wrote it many years ago,\" he said.Mr Staley became Mr Fraser's chief numbers man in an unusually public stalking exercise that overthrew Mr Snedden early in 1975.After the dismissal and the subsequent landslide that swept Mr Fraser to power, Mr Staley became minister for the capital territory and, in 1977, minister for post and telecommunications.A broadcasting technology enthusiast, he put public broadcasting on a firm legislative footing, oversaw the introduction of commercial FM broadcasting and started the process for the introduction of pay TV.",
        "He resigned from parliament in 1980 to work mainly in telecommunications. Always interested in the arts, he directed the Melbourne International Comedy Festival.He also remained big in the Victorian Liberal machine as the rivalry between Mr Howard and Andrew Peacock consumed the party for most of the 1980s.In 1990, Mr Staley was almost killed in a car accident. He spent two years in and out of hospital and was left wheelchair-bound.But it didn't end his political activities and, in 1993, with Mr Howard's strong support, he defeated his old mate Mr Fraser for the federal presidency.Mr Staley was heavily involved - more publicly than is usual for party bosses - in the leadership manoeuvres following John Hewson's defeat in 1993.Early, he flirted with the idea of parachuting Nick Greiner, whose blend of dry economics and social awareness he admired, into the federal leadership.After that came to nothing, he helped Alexander Downer defeat Hewson in 1994.When Mr Downer fizzled, he transferred his support to Mr Howard, who took over in 1995 and led the Liberals out of the wilderness the following year.Mr Staley also took on Paul Keating, pursuing his controversial piggery interests before and after his fall.He was Liberal president until 1999, the year he tried unsuccessfully to persuade Mr Howard to embrace the republican cause.",
        "He then became chairman of the National Museum of Australia Council. With the history wars rumbling, that involved him in politics of a different sort.Mr Staley married several times and had three sons and a daughter with his first wife Elsa, and a daughter with his second, Maggie."
    ]
}