{
    "articleURL": "/wires/ap/article-12051603/US-Joe-Scally-growing-fast-German-league.html",
    "content": [
        "DUESSELDORF, Germany (AP) - Joe Scally arrived in Germany just after his 18th birthday in the depths of a pandemic lockdown and soon became a regular starter in the German soccer league.",
        "The next step is to become a regular with the U.S. national team.After breaking into the team at Borussia Mönchengladbach, Scally was included in the U.S. squad for the World Cup in Qatar last year but did not play a single minute. He's already looking ahead to the 2026 World Cup that will be co-hosted by the U.S., when Scally is determined to have a much bigger role.\"Not being able to play one minute (in Qatar) definitely affected me immensely just because, playing every single game in the Bundesliga then to not even get a minute, I don´t understand that,\" the 20-year-old Scally said in a recent call with reporters. \"I definitely have that next World Cup, you know, circled on my calendar to be playing. When you see the guys out there walking out on the national anthem, it is, I´m sure, no better feeling. And to have it home in the U.S. with family and friends there, I think it´ll be the biggest World Cup yet. So I´m very excited for that.\"The U.S. heads into a CONCACAF Nations League semifinal against Mexico in Las Vegas on June 15, then a potential final, followed by the Gold Cup. Scally has four appearances for the U.S., most recently in a 7-1 win over Grenada in March, but faces tough competition from Sergiño Dest for the right-back spot. Having recently extended his contract at Gladbach through 2027, he is looking to the long term for both club and country.",
        "The Long Island native came through the academy at Major League Soccer team New York City FC and signed a deal in 2019 to join Gladbach after he turned 18. When that birthday came around - New Year's Eve 2020 - the coronavirus pandemic had hit and Germany was in its second lockdown. Masks were mandatory in shops, and bars and restaurants were closed.",
        "\"The biggest part where I grew up was when I first moved over here. I was 18 and it was COVID. My family was not allowed to visit and I wasn´t even in an apartment,\" Scally said. \"I was in the hotel here at Gladbach (next to the stadium) and it was so bad. I was in a hotel room all day, walking down the stairs to training, just walking back up to my room, and it was soccer, soccer, soccer, 24-7. I think this was something that definitely helped me grow up and realize there´s so much more to life than just focusing on soccer 24-7, because it´ll just like blow your head up.\"Scally soon became a regular for Gladbach, at first as a versatile utility player able to operate as a wing-back or wide midfielder on either flank, and this season as a more conventional right back, a shift he says has made him a more capable all-round player whose defense is no longer \"a liability.\"",
        "His club career has already seen him rack up more than 60 games in the last two seasons with Gladbach. If he keeps developing, the number of national team appearances could soon grow, too.\"To be playing, you can see it when you go to camps or something else, you´re more sharp, more experienced, more ready, more fit, so I think the biggest thing as a young player is just to play games,\" Scally said. \"And that definitely affected my option to stay at Gladbach because they were giving me games, they were giving me the opportunity to play. At 20 years old, I can´t ask for anything else.\"___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}