{
    "articleURL": "/money/markets/article-12038963/Boost-HSBC-profits-surge-10-3bn-ahead-AGM-battle.html",
    "content": [
        "HSBC was given a boost yesterday as it reported a surge in first-quarter profits and won the backing of a major investor ahead of an AGM battle later this week.",
        "The £10.3billion result was three times higher than earnings over the same period last year – helped by rising interest rates as well as a series of one-off factors.And it meant that the UK-based bank was able to announce its first quarterly dividend since 2019.The results came ahead of a shareholder meeting on Friday when the board faces a showdown with China’s Ping An insurance group, which wants the lender to spin off its Asian business in a bid to boost shareholder returns.",
        "Ping An will support a motion at the AGM which pushes for restructuring that has been rejected by HSBC. But yesterday Norway’s sovereign wealth fund, the bank’s third biggest shareholder, said it would vote in line with the bank’s management.It adds to the backing of shareholder advisory firms Glass Lewis and ISS, which have also opposed the spin-off proposals.Chief executive Noel Quinn acknowledged a ‘difference of opinion’ with Ping An but said both shared ‘a desire to improve the performance of the bank’.Quinn shrugged off turmoil elsewhere in the banking sector, saying HSBC had not seen a ‘negative impact’.Shares climbed 3.5 per cent, or 20.1p, to 593.9p, bucking the falls among other lenders. That was despite delays in the bank’s plan to sell its French and Canadian divisions, part of the plan to pivot towards Asia, where the bank already earns most of its income.",
        "Profits were given a £1.2billion boost by the acquisition of the UK arm of collapsed American lender Silicon Valley Bank (SVB) even though an assessment of its balance sheet prompted it to knock £186million off the value of its assets.Quinn said there had been ‘no nasty surprises’ from the emergency £1 deal, hatched by the Treasury and Bank of England after the US parent firm collapsed.HSBC plans to change the name of SVB UK but will not look to cut any staff or fold its London office into the wider group’s HQ, Quinn said.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}