{
    "articleURL": "/wires/reuters/article-12044791/Nationals-score-late-edge-Cubs-2-1.html",
    "content": [
        "Lane Thomas tripled and scored on CJ Abrams' single in the seventh inning and the Washington Nationals beat the visiting Chicago Cubs 2-1 on Wednesday night to win for the second consecutive night.",
        "Five Washington pitchers combined on a six-hitter on a night when Jake Irvin made his major league debut.Two of Chicago's hits came from its first two batters of the ninth inning, with Seiya Suzuki and Trey Mancini opening the frame with singles off Kyle Finnegan. A fielder's choice bunt put runners at the corners before Patrick Wisdom grounded into a game-ending double play.Thomas had the game's only extra-base hit. He joined Joey Meneses and Victor Robles with two hits for the Nationals.Cubs starter Marcus Stroman turned in a strong six-inning effort, holding the Nationals to one run on five hits. He struck out five and walked three.Irvin was Washington's starting pitcher, logging 4 1/3 innings and giving up a first-inning run. The right-hander allowed two hits, walked four and struck out three.Irvin was called up from Triple-A Rochester as the Nationals, who had a game last Friday postponed causing Saturday's doubleheader, needed a fill-in starter.Carl Edwards Jr. (1-1) was the winning pitcher with one shutout inning. Finnegan ended up with his seventh save.Adbert Alzolay (1-1) took the loss as he was unable to complete an inning in relief.Abrams has driven in 14 runs, with seven of those coming in the past week.Chicago posted a first-inning run on Suzuki's two-out single. That drove in Nico Hoerner, who was hit by an Irvin pitch as the game's first batter.",
        "The Nationals countered in the second inning with their run, though they were limited after putting runners at first and third with no outs. The run scored when Dominic Smith grounded into a double play.Mancini and Ian Happ joined Suzuki with two hits.--Field Level Media"
    ]
}