{
    "articleURL": "/wires/aap/article-12049245/National-body-ease-shock-clean-energy-transition.html",
    "content": [
        "The federal budget will include a National Net Zero Authority to support coal-dependent communities across Australia and usher in new industries.",
        "The new body announced by Climate Change and Energy Minister Chris Bowen in Muswellbrook on Friday will start work on July 1, ahead of new laws to formally establish the independent agency.Business Council chief executive Jennifer Westacott said the authority is \"crucial\" for keeping manufacturing jobs onshore and leaving Australians better off as the economy goes through monumental economic change.\"Regions like the Hunter, the Illawarra and Western Sydney represent the arc of our economic opportunity, but better coordination is crucial to unleash their full potential,\" she said.The new body will steer private investment into clean energy opportunities in traditional mining and energy communities, and work with businesses as old operations scale down and new ones ramp up.The authority will work with all levels of governments and regional organisations, unions, industry, investors, Indigenous groups and others.The federal government also pledged additional funding from the $1.9 billion Powering the Regions Fund to support existing industry - such as rail and aviation - and new clean energy industries, with the creation of a $400 million Industrial Transformation Stream.The independent Climate Council said the authority should coordinate realistic closure dates for all Australian coal-fired power generators.It should also plan for the broader, urgent phase down of fossil fuels like coal and gas across Australia, the council said.",
        "The Australian Manufacturing Workers' Union welcomed the skills and training support the new body will bring for workers needing new jobs.Union boss Steve Murphy said the authority has the potential to be one of the Albanese government's greatest legacies.\"This is a big, big day - for mining and energy workers, for their communities, for the union movement and for the country,\" he said.\"It delivers on the promise Labor made to workers that they would be looked after, not left behind.\"The recent closure of the Liddell coal-fired power station near Muswellbrook in the Hunter Valley and plans for fast-tracked power plant closures in Victoria and Queensland fuelled calls for better co-ordination to avoid chaos during the transition to clean energy.Clean Energy Council CEO Kane Thornton said the establishment of the national body was long overdue.\"The authority will be an essential building block as part of a Renewable Energy Superpower Masterplan, which the Clean Energy Council is advocating for within next week's budget,\" he said.The Australian Council of Superannuation Investors (ACSI) said the authority would oversee an orderly transition to a low-carbon economy.\"It will take leadership from government, in collaboration with workers, First Nations peoples, communities, business and investors, to ensure that this transformation is a just one, leaving no community or workforce behind,\" ACSI chief executive Louise Davidson said.",
        "Opposition energy spokesman Ted O'Brien said Australian households and businesses are suffering the costs of the broken promise on reducing energy prices.\"Everyday Australians are doing it tough,\" he said.\"Labor must immediately reinstate a technology agnostic capacity mechanism, work with Origin to extend the life of Eraring, scrap its uncommercial green hydrogen plan for Kurri Kurri and ensure Snowy 2.0 is operational as soon as possible.\"Unions have been calling for federal support for those workers and communities who have powered Australia for decades.Transition hotspots include the Hunter Valley in NSW, Collie in Western Australia and the Latrobe Valley in Victoria."
    ]
}