{
    "articleURL": "/news/article-12047313/Ed-Sheeran-arrives-NYC-court-jury-decides-music-future-100m-Marvin-Gaye-copyright-case.html",
    "content": [
        "Ed Sheeran returns to court in Manhattan after closing arguments yesterday Lawyer said Marvin Gaye copyright trial 'should never have been brought' Jurors were dismissed Wednesday and are continuing to deliberate todayEd Sheeran has arrived at the Manhattan federal court to await jurors' verdict in his $100million copyright trial - which his lawyer says 'should never have been brought'.",
        "In closing arguments, his lawyer Ilene Farkas said similarities in the chord progressions and rhythms of Marvin Gaye's 'Let's Get it On' and Sheeran's 'Thinking Out Loud' were 'the letters of the alphabet of music.'The singer's fate remains in the hands of the jurors, who were sent home shortly after closing arguments yesterday and will now return this morning to deliberate, and potentially deliver their verdict.Sheeran has vehemently denied the allegations that his song stole fundamental musical elements from Gaye's song. The lawsuit was brought on by the heirs of the song's co-writer, Ed Townsend.The 32-year-old has been so outspoken about his stance that he staked his whole career on it, vowing that he will be 'done' with music if found guilty. ",
        "'These are basic musical building blocks that songwriters now and forever must be free to use, or all of us who love music will be poorer for it,' she said.Keisha Rice, who represents Townsend's heirs, said her clients were not claiming to own basic musical elements but rather 'the way in which these common elements were uniquely combined.''Mr. Sheeran is counting on you to be very, very overwhelmed by his commercial success,' she said, urging jurors to use their 'common sense' to decide whether the songs are similar.",
        "Sheeran has said that if he looses the $100million suit, it could be the end of his music career. 'If that happens, I'm done, I'm stopping,' Sheeran said when asked during the trial about the toll the case has taken. 'I find it really insulting to devote my whole life to being a performer and a songwriter and have someone diminish it.'",
        "Townsend's heirs in 2017 sued Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing, claiming infringement of their copyright interest in the Gaye song.Sheeran and his co-writer, Amy Wadge, both testified during the trial that they did not copy 'Let's Get It On.' Sheeran said he had only passing familiarity with the song and that 'Thinking Out Loud' was inspired by Irish musician Van Morrison.Gaye, who died in 1984, collaborated with Townsend, who died in 2003, to write 'Let's Get It On,' which topped the Billboard charts in 1973. 'Thinking Out Loud' peaked at No. 2 on the Billboard Hot 100 in 2015.Sheeran is also facing claims over 'Thinking Out Loud' in the same court from a company owned by investment banker David Pullman that holds copyright interests in the Gaye song.Sheeran won a trial in London last year in a separate copyright case over his hit 'Shape of You.'",
        "Gaye's heirs in 2015 won a $5.3 million judgment from a lawsuit claiming the Robin Thicke and Pharrell Williams song 'Blurred Lines' copied Gaye's 'Got to Give It Up.'"
    ]
}