{
    "articleURL": "/news/article-12051313/Mother-five-jailed-trying-hire-hitman-murder-colleague-spurned-advances.html",
    "content": [
        "Helen Hewlett, 44, had a brief assignation with Paul Belton in a Norfolk carpark Hewlett sent the cash to a Romanian fraudster purporting to be a hitman A married mother-of-five who tried to hire a hitman to kill a former colleague after they had a brief fling and he spurned her advances was jailed for seven and a half years today.",
        "Helen Hewlett, 44, was also given an extended five year licence period on top of her custodial sentence after a judge ruled that she was a 'dangerous offender'.Norwich Crown Court heard how she paid Bitcoin worth more than £20,000 to a website on the dark web called Online Killers Market to try and get Paul Belton, 50, murdered in what looked like an accident.She denied soliciting murder and stalking between January 1, 2020 and August 13 last year, but a jury found her unanimously guilty of both charges in February following two days deliberation after an 11-day trial.The trial heard how the website she used was an 'absolute sham' designed to steal money from people who wanted someone killed, and that the cryptocurrency she paid had landed up in an account in Romania.",
        "But prosecutors argued that she had an intention to have married father-of-three Mr Belton murdered.Hewlett of King's Lynn, Norfolk, who was given a concurrent three month sentence for stalking was earlier cleared of a more serious offence of stalking causing alarm or distress.Jurors were told how she and Mr Belton had flirted with each other when they were both working at the Linda McCartney vegetarian food factory in Fakenham, Norfolk.The pair had had a single sexual encounter in her car in the factory's overflow car park which Mr Belton was said to have immediately regretted.",
        "Judge Katharine Moore told Hewlett today: 'You were angry and upset when Paul Belton did not wish to pursue a relationship with you.'Your response to that rejection was to embark on a course of action which began with attempts to engage him in communication, progressed into stalking and culminated in solicitation to murder.'",
        "The trial heard how Hewlett became 'utterly fixated' with Mr Belton and repeatedly sent him emails begging to see him again, as well as nude photographs of herself, but he constantly made it clear he did not want anything to do with her.He was made redundant and got a new job at the Kinnerton Confectionery factory in Fakenham which supplies chocolate products to Tesco, but she also got a job there in order to pursue him.She called him a 'coward' for not wanting to speak to her and posted comments on Facebook, saying that he 'needs shooting in the bollocks'.Hewlett left her job as a mixer in the 'nut' department at Kinnerton in August 2021, saying that she was quitting due to bullying by Mr Belton and his sexual harassment of women.Management rejected her claims as 'malicious' after Mr Belton showed them emails she had sent him.Hewlett was also suspected of making an anonymous whistleblower complaint to Tesco last April, claiming that Mr Belton had used homophobic language about some of his colleagues at the Kinnerton plant. ",
        "Bosses at the firm suspected that Hewlett had made the complaint and dismissed it after advising Mr Belton to go to the police to report he was being harassed.The trial heard how Hewlett had set up a Coinbase account to buy cryptocurrency in January last year.She transferred £22,601 into it from her current bank accounts in 35 transactions, using savings, an overdraft and loans for £7,000 and £5,000 from the Royal Bank of Scotland.Hewlett used a browser called Tor to search the dark web and found the website Online Killers Market which claimed to have hundreds of hitmen, drawn from gangs or former military personnel, available to shoot people or hit them with cars.The website claimed it could arrange deaths from undetectable poison or even snake bites, saying it had 'a 100% job completion rate.It even provided a price list in US dollars, detailing a sniper shooting as costing between $20,000 and $60,000, an arson attack for up to $20,000 or a simple beating for as little as $2,000.Hewlett posted a message under the username 'Horses5' in a forum, saying: 'Need someone killed in Norfolk - vital it looks like an accident' before exchanging messages with a member of the site called 'Marksman'.She transferred Bitcoin worth £20,547 into an account together with Mr Belton's name, home and work addresses and his picture.",
        "The website falsely promised to activate hitmen on payment of fees into a so-called Escrow intermediate account, saying it would not take the money until authorised by the client after a hit was carried out.But the trial heard that the account on the website was not a genuine one which would have had a multi-signature wallet to authorise payment when all parties were in agreement.Hewlett was arrested on August 12 last year after police traced her Bitcoin payments as coming from a regulated Coinbase account which had recorded her name and personal details.The court heard police found she had searched for news articles about fatalities in Norfolk.Judge Moore told Hewlett: 'You were doing so to check whether your solicitation to murder was acted upon. In fact there is nothing to suggest that you managed to arrange a contract killing.'Rather it appears you were duped into paying money to a fraudulent website. The fact that nobody acted on your request is significant, but it is also a matter of good fortune as far as you are concerned.'Judge Moore said she had 'a vengeful streak' and called her 'a dangerous offender' who had shown little remorse.The trial heard how Hewlett had earlier been told by police to stop trying to contact Mr Belton after she was suspected of making the malicious whistleblower complaint about him.",
        "Hewlett ignored the warning and carried on putting money into her online account which she used to purchase Bitcoin to take out the contract on Mr Belton.She did not give evidence in court, but told police that she had not really intended to have him killed.Hewlett said: 'I put a post on a forum. It was to vent more than anything and to say things that I was feeling. It was more stupid than serious. It was a way of making me feel better.'She claimed that she believed that Mr Belton would not be harmed until she gave her consent for a hit to go ahead.Matthew McNiff, defending, described the website as an 'absolute sham' and said its claims of providing hitmen as 'palpable nonsense'.He said her posts about wanting Mr Belton killed had been a 'way for her to vent and feel that she was being heard and listened to', and she did not intend for him to be murdered.Mr McNiff added today: 'All her attempts were rebuffed and rejected. In the world that she had created for herself, this was something that served a therapeutic purpose.'He added that she had been 'cut adrift' by her family since her arrest with her husband and family wanting nothing more to do with her.",
        "But prosecutor Marti Blair said today: 'Mrs Hewlett took every step possible which she could do in terms of wanting to get a hitman to carry out the job.'She made a deposit, negotiated the price, and made further payments. Even when she was potentially put off because of the price, she ignored that and transferred more money. She believed she was dealing with a genuine hitman.'Mr Belton said in a victim Impact statement read out to the court that he had once been confident and outgoing, but was now left feeling 'scared, afraid of everyone' and very wary of strangers.He added: 'I'm now anxious, suffering from anxiety most days of my life now, whether it's getting to and from work, shopping, football. I find myself constantly checking my driveway and am worried if anyone that I don't recognise approaches my house'.Detective Chief Inspector Michael Pereira, of the Specialist Digital &amp; Serious Organised Crime unit for Norfolk and Suffolk police, said after the hearing: 'This investigation has been complex and intensive and has involved a number of teams working together which has been critical to secure this conviction.'We built and gathered evidence for the case identifying a woman using crypto currency to arrange for someone to kill the intended victim.'Cyber-crime investigators looked at her cryptocurrency activity and worked with private industry and regional colleagues to provide evidence of payment transactions between the woman and the 'hit man' on the dark web. This provided crucial evidence in the investigation leading to the successful conviction today.'This case really demonstrates a true team effort between serious crime disruption team, cybercrime investigators and regional colleagues to safeguard individuals from harm and tackle these types of crime which can have huge impact on the victims and their family.'DCI Michael Pereira, from Specialist Digital &amp; Serious Organised Crime for Norfolk and Suffolk Constabularies, said: 'This investigation has been complex and intensive and has involved a number of teams working together which has been critical to secure this conviction. DC Frank Jepson from the Norfolk Serious Crime Disruption Team ran the investigation working alongside the joint Norfolk and Suffolk Cybercrime Team and specialist regional colleagues who helped identify Helen Hewlett as the perpetrator in this case.'This crucial joint working work helped to divert a possible 'hit' on the victim and prevent them coming to harm. We built and gathered evidence for the case identifying a woman using cryptocurrency to arrange for someone to kill the intended victim.'Cyber-crime investigators looked at her cryptocurrency activity and worked with private industry and regional colleagues to provide evidence of payment transactions between the woman and the 'hitman' on the dark web. This provided crucial evidence in the investigation leading to the successful conviction today.'This case really demonstrates a true team effort between serious crime disruption team, cybercrime investigators and regional colleagues to safeguard individuals from harm and tackle these types of crime which can have huge impact on the victims and their family.'"
    ]
}