{
    "articleURL": "/wires/ap/article-12054695/AP-PHOTOS-Who-wore-King-Charles-IIIs-coronation.html",
    "content": [
        "LONDON (AP) - What does one wear to a coronation?",
        "For senior royals like Queen Camilla and Kate, the Princess of Wales, the theme was pale, subdued dresses to let their regal robes and glittering jewelry do the talking.Camilla, who was crowned alongside King Charles III at Westminster Abbey on Saturday, wore an embroidered silk gown in ivory, silver and gold tones with a short train by Bruce Oldfield - a British designer favored by the royal family - with matching shoes.Kate wore an ivory silk crepe dress by British fashion house Alexander McQueen under her cobalt blue and red Royal Victorian Order mantle, or robe. She didn´t wear a tiara, instead opting for a large silver and crystal headpiece designed by milliner Jess Collett in collaboration with McQueen.She also sported pearl and diamond earrings belonging to William´s late mother, Princess Diana.Her 8-year-old daughter, Princess Charlotte, wore a similar headpiece and ivory McQueen dress with cape, embroidered with rose, thistle, daffodil and shamrock motifs to represent the four countries of the United Kingdom.",
        "Many of the guests opted for eye-catching pastel outfits that provided cheerful pops of color in the wet grey weather.U.S. first lady Jill Biden wore a cornflower blue skirt suit by Ralph Lauren, with a matching hairpiece and gloves. She appeared with her granddaughter Finnegan Biden, who wore a yellow dress with matching cape by New York label Markarian.",
        "Pink was a particularly popular choice for many. France's Brigitte Macron chose a pale pink short dress with matching coat, by designer Nicolas Ghesquière for Louis Vuitton. Spain´s Queen Letizia also opted for pink, sporting a skirt suit with peplum frills, matching heels, and a large stylish hat.Pop star Katy Perry, who is due to perform at a coronation concert Sunday, wore a Vivienne Westwood jacket with matching tailored skirt. She styled the tailored look with a headpiece featuring a crinoline base with a layer of tulle and merry widow veiling, adorned with a ribbon bow.British lawmaker Penny Mordaunt, who carried the \"sword of state\" during the coronation ceremony, stole the show with a striking teal blue cape dress and hat embroidered with gold ferns.Prince Harry, who attended the ceremony without his wife, Meghan, wore a custom three-piece black and grey tail suit by Dior."
    ]
}