{
    "articleURL": "/wires/aap/article-12043285/Inquiries-continue-SA-police-stabbings.html",
    "content": [
        "A South Australian police officer, critically injured after being stabbed, continues to improve following emergency surgery as his family thanked those who came to his aid, particularly a good samaritan who was first on the scene.",
        "Sergeant Ian Todd, 53, suffered life-threatening wounds to his neck, arms and hands and was in emergency surgery for several hours until late on Wednesday after the incident in the small mid-north town of Crystal Brook.Police Commissioner Grant Stevens said the surgery had gone well and Sgt Todd continued to show progress.Another officer who received serious wounds to his right leg and arm in the attack, Sergeant Jordan Allely, has since been discharged from hospitalThe two men had gone to a property in Symons Street to speak with Sean Ferris in relation to a minor incident at the local supermarket the day before which reportedly involved a complaint about his dog.In the course of what followed, Mr Ferris was shot dead.In a statement, the family of Sgt Todd thanked police, ambulance officers, doctors, nurses and other first responders, who had helped the 53-year-old and his 32-year-old colleague.\"In particular, we would like to thank the member of the public who came to the scene and rendered assistance to them both,\" the family said.\"We are grateful for the courage that they displayed during such a confronting incident.\"We are also grateful to our local police community, the wider policing community, family, friends and other well-wishers for all of the messages we have received.",
        "\"That overwhelming support has made a huge difference to our family at this difficult time.\"Mr Stevens said it was hoped both officers would be able to return to work, but that would depend on their individual circumstances.\"This is something that we will work through with each of the officers,\" he said.\"Dealing with an event like this is not just about recovering from physical injuries but it's about taking into account what they've had to do as police officers and the impact that will have on them going forward.\"My hope is that we can work with them to restore them to full duties but we'll do whatever we can to make sure that they come out of this as best as possible.\"Mr Stevens declined to elaborate further on the circumstances surrounding the incident, with both an internal inquiry, major crime and coronial investigations underway.He said he did not intend to interfere with those investigations.\"There will be a point in time when we can disclose more details about what actually transpired,\" he said.\"We do need to let the investigation take its course.\"Mr Stevens said a detective superintendent had been appointed to head the police internal inquiry.SA Police Minister Joe Szakacs said he had contacted the families of both the injured officers to let them know that \"all South Australians stood with them\".",
        "\"I can't begin to imagine the anxiety, the worry, the stress that they and their families are going through,\" he said."
    ]
}