{
    "articleURL": "/news/article-12047057/Bud-Light-owner-Anheuser-Busch-tops-Wall-St-estimates-sales-RISE-despite-Dylan-Mulvaney-backlash.html",
    "content": [
        "Anheuser-Busch InBev makes around a quarter of all beer drunk globallyThe company has reported higher than expected profits in the first quarter READ MORE: Anheuser-Busch CEO FINALLY disavows Mulvaney partnership Profits at Bud Light owner Anheuser-Busch have risen more than expected - despite backlash over the brand's Dylan Mulvaney partnership. ",
        "The Belgium-based company, which also makes Budweiser, Stella Artois and Corona, saw its core profit soar 13.6 percent year on year to $4.76 billion in the first quarter. This was compared to an average 5.6 percent increase expected. Sales at Anheuser-Busch InBev, which makes around a quarter of all beer drunk globally, also rose by 0.4 percent - buoyed by a sharp rise in China due to a rollback in its strict Covid-19 restrictions. It comes despite Bud Light sales having plunged over a quarter, year on year, after the brand's controversial campaign with transgender influencer Dylan Mulvaney. ",
        "Anheuser-Busch is the world's largest brewer, also making Michelob Ultra, Hoegaarden and Presidente beer - meaning its overall profit is rarely affected by one product.Year on year, core profit at the company has risen 13.6 percent from $4.49 billion in the first quarter of 2022. This rose steadily throughout the year before dipping slightly in the last quarter of 2022. The company repeated its 2023 forecast that core profit would grow in line with its medium term outlook of between 4 percent and 8 percent.Anheuser-Busch said the results confirmed the resilience of the beer market in the face of economic challenges, notably inflation, with consumers buying its beers despite higher prices.Revenue rose sharply as the company pushed through price increases and some consumers switched to more expensive beers or package formats. ",
        "The better than expected results for the company come despite tanking Bud Light sales. The brand launched its campaign with Mulvaney on April 1, prompting backlash.A boycott was declared, singer Kid Rock used Bud Light cans as target practice, and $5 billion was wiped off the value of the brand. Two senior marketing executives have taken leave of absence amid the fiasco. ",
        " According to Beer Business Daily reported that the beer's off-premise sales volume - meaning the amount of beer sold outside of restaurants and bars - had fallen by 26.1 percent from a year earlier in the week ended April 22.Sales were down 21.1 percent in the prior week. While competitors, Coors Light and Miller Lite, saw consumers turning to their brands as both have had an increase in sales.So far this year, volumes of the beer are down 8 percent.'The shocking deterioration of Bud Light Blue's market share continued apace through the third week of April – and actually somehow worsened,' the outlet wrote on its website.'We've never seen such a dramatic shift in national share in such a short period of time.'A beer industry expert has said that Bud Light is in danger of losing its status as the country's top selling beer, if sales of the product continue to plunge.",
        "'I think it runs the risk of losing that No. 1 position at the end of calendar year 2023 to Modelo Especial,' said Bump Williams, the founder of Bump Williams Consulting, a firm specializing in the alcoholic beverage industry.According to Williams, last year $4.8 billion worth of Bud Light was sold in stores, making it the top US beer brand, followed by Modelo Especial with $3.75 billion and Michelob Ultra with $3.3 billion."
    ]
}