{
    "articleURL": "/tvshowbiz/article-12043297/Rachel-Bilson-makes-raunchy-revelations-favorite-sex-positions.html",
    "content": [
        "Rachel Bilson has made yet another saucy revelation about her sex life and preferred positions during intercourse in a raunchy new chat on her Broad Ideas podcast this week.",
        "The OC actress, 41, who previously revealed she didn't orgasm from sex until she was 38, waxed lyrical about her love for romps in the missionary position and her least favorite position in the chat.She said: 'I’ve learned that if you want to have an orgasm during sex, you have to be on top. But missionary is my favorite. I want to be f*****g manhandled.'The star said - depending on her partner's manhood size - that her least favorite position was doggy style because it could 'hurt' her.  In March, the star, who previously dated comedian Bill Hader, revealed she did not have an orgasm during sexual intercourse until she was 38.",
        "Bilson declared: 'Isn't that crazy?' as she recounted her experience, but did not reveal who she shared the encounter with.Cummings then revealed she was able to orgasm through intercourse in the last year after quitting birth control. Bilson later added new details, saying: 'It has nothing to do with any partner. It had to do with me knowing my body.''I just jumped on that and I was like, \"When I was older I was able to do that too,\"' said Bilson.Bilson said she did not intend to spark speculation about her romantic history in the wake of her revelation.",
        "'Apparently there were names brought up in both regards and I am not OK with that, because it had nothing to do with that,' she said.After Viall said that they were 'not shaming any exes,' Bilson added, 'Or giving a trophy to any other exes.'The Take Two star said that 'nobody was involved other than' herself.Last year Rachel confirmed her previous romance with Hader, which ended in 2020, the year she turned 39. ",
        "Bilson was previously in a decade-long on/off romance (and 18-month engagement) with actor Hayden Christensen, which ended in September 2017. The pair share a daughter Briar-Rose, eight. The acting duo originally met playing love interests in Doug Liman's caper Jumper and they went on to co-star in the 2009 rom-com anthology New York, I Love You as well as Sarik Andreasyan's 2014 drama American Heist. The actress sparked speculation of a romance with Saturday Night Live alum Hader, 44, when they attended the Golden Globes together back in 2020.'[Bill and I] dated two years ago! I went with him to the f****** Golden Globes, Rachel said during Monday's episode of her Broad Ideas podcast.Rachel - who is known to audiences for her role as Summer Roberts on the teen drama series The O.C - was chatting to Aubrey Plaza when she made the revelation and the podcast host appeared to be shocked at the revelation. ",
        "Aubrey said: 'Are you serious?! I don't know s***! I don't know anything!'",
        "While Rachel did not share anything more about Bill specifically, she admitted that she had been through a 'really hard breakup' during the COVID-19 lockdown back in 2020.She told guest Mandy Moore, 'I could not leave my house, you know what I mean? I had nothing else to do but sit in it, and deal with it and feel it. 'It was probably the hardest thing I've ever done⁠, harder than childbirth. It hurt like a motherf******!'Around the same time, it was alleged by an insider that Rachel had gone through an 'amicable' separation from Bill.However, Rachel admitted on the podcast that she had managed to move past the breakup and is now 'looking for the next thing.'She said: 'If you actually face it, you can come out of it and be like, 'OK, I did that and I'm ready for the next thing.'Back in August 2022, Bilson confirmed she had a new boyfriend,  rumored to be artist Zac LaRoc.She also had a high-profile romance with The OC co-star Adam Brody from 2003-2006."
    ]
}