{
    "articleURL": "/wires/pa/article-12058163/Eurovision-champions-share-excitement-contest-kicks-Liverpool.html",
    "content": [
        "Former Eurovision champions Loreen and Kalush Orchestra have voiced their excitement ahead of the contest taking place in Liverpool this week.",
        "The city has been transformed for the international music competition, which the UK is hosting on behalf of Ukraine amid the Russian invasion.Outside the series of arena live shows, two weeks of mostly free events are taking place featuring concerts, art exhibitions, flash mobs and more.",
        "Swedish singer Loreen told the PA news agency she “loved” the UK and hailed it as a “creative hub”.The 39-year-old, who is returning to compete for her country more than a decade after triumphing at the 2012 contest with her dance-pop anthem Euphoria, added: “The UK is like the trendsetter because there are so many creative people.“They create stuff and they send it out in the world and then everybody else is like, ‘Oh, I’m inspired’.“They are this inspirational hub sending stuff out to the world. The rest of us are like, ‘Oh, it’s happening in the UK, let’s do something with it’.“I’m very excited to go to the UK. I love it. I also love the whole multiculturalist feel of it.“There’s a mash-up of different people – and Liverpool specifically.”The singer, who will compete in Liverpool with new track Tattoo – written by the same team behind Euphoria, added that she plans to see some of the countryside around the city.",
        "“I’m a nature girl so I want to go out to the countryside of Liverpool,” she said.“Maybe an hour outside, just sit in the field and just watch raw nature.”",
        "Ukrainian group Kalush Orchestra, who swept to victory in last year’s contest, said they were “grateful” to the UK for hosting the contest.Tymofii Muzychuk, a piper who forms part of the seven-piece, told PA: “We believe that something incredible awaits us in Liverpool, of course, with a Ukrainian flavour.”He said the band, who will perform during the grand final on Saturday, were keeping the nature of their routine under wraps.“We will not reveal any details yet,” he said. “Soon you will see everything with your own eyes.”He added that they would be voicing their support for this year’s Ukrainian act, electronic music duo Tvorchi.He said: “We wish the boys victory and will support them during the final. We love their track Heart Of Steel.”Mae Muller, 25, will compete for the UK with her track I Wrote A Song, which features tongue-in-cheek lyrics about a cheating ex-boyfriend, and a propulsive dance beat.A total of 37 countries are set to take part in Eurovision this year, with Ukraine automatically qualifying for the grand final as 2022 winners as well as the so-called “big five” – the UK, France, Germany, Italy and Spain – who each get a free pass because of their financial contributions to the event.",
        "Wild Youth will represent Ireland with their song We Are One.To reach the final on Saturday, the group will have to qualify from Tuesday’s semi-final which also includes entries from competition favourites Sweden and Finland.Ireland has participated in Eurovision more than 50 times and has a record seven wins, but has failed to qualify for the final since Ryan O’Shaughnessy entered with his song Together in 2018.The semi-finals will be broadcast on the BBC on May 9 and May 11 with the grand final on May 13 also being shown in cinemas."
    ]
}