{
    "articleURL": "/wires/reuters/article-12054689/Motor-racing-Horner-says-new-F1-teams-hard-fit-in.html",
    "content": [
        "May 6 (Reuters) - Formula One is assessing potential new teams but Red Bull boss Christian Horner says it would be very difficult to fit them in because of limited space in paddocks and pitlanes.",
        "While some circuits can accommodate more than the current 10 two-car teams, others, and particularly some of the older historic venues, could find it more challenging.\"If you look at the pit lane, for example, here or somewhere like Monaco, Zandvoort, or some of the circuits that we're now racing at, where would we be able to accommodate an 11th team?,\" Horner said at the Miami Grand Prix.\"Just operationally, where do we put the motorhomes? Where do we put the support? Where do the trucks go?,\" added the Briton.\"I just think it would be an incredibly difficult thing to be accommodated with the way that the sport has currently evolved as well.\"Formula One's governing body has sought bids from potential new teams with a mid-May deadline. The 2023 sporting regulations state that no more than 26 cars will be admitted to the championship.Potential new teams include a U.S.-owned Andretti Cadillac entry and Panthera Team Asia.Formula One has had 10 teams since the end of 2016, when Manor folded. There were 12 from 2010 to 2012 and in the 1980s and 1990s the sport had to have pre-qualifying to reduce the field.Current Formula One teams, who have no say in the decision, have been lukewarm towards expanding the grid, wary of diluting the overall pot of revenues in a sport going through a popularity boom.",
        "Some feel the current $200 million entry fee for a new team, which would be shared among the existing entrants as compensation, is not enough.\"I think the issues remain the same as 12 months ago, both fiscally -- what is the incentive for an existing team or franchise to accept an 11th entrant? -- and then ultimately, who pays?,\" said Horner.\"I mean, if it dilutes the income of the 10, it's like turkeys voting for Christmas. Why would they do that?\"McLaren boss Zak Brown said he would love to see more cars on the grid, if the teams really brought something to the sport, while Haas's Guenther Steiner agreed there needed to be an \"upside\".\"Financially, everybody's stable. Why should we rock that boat, you know, if there is not more coming to us?,\" said Steiner. (Reporting by Alan Baldwin in London, editing by Pritha Sarkar)"
    ]
}