{
    "articleURL": "/wires/ap/article-12058657/Iran-hangs-2-rare-blasphemy-case-executions-surge.html",
    "content": [
        "DUBAI, United Arab Emirates (AP) - Iran hanged two men Monday convicted of blasphemy, authorities said, carrying out rare death sentences for the crime as executions surge across the Islamic Republic following months of unrest.",
        "Iran remains one of the world's top executioners, having put to death at least 203 prisoners since the start of this year alone, according to the Oslo-based group Iran Human Rights. But carrying out executions for blasphemy remains rare, as previous cases saw the sentences reduced by authorities.The two men executed, Yousef Mehrad and Sadrollah Fazeli Zare, died at Arak Prison in central Iran. They had been arrested in May 2020, accused of being involved in a channel on the Telegram message app called \"Critique of Superstition and Religion,\" according to the U.S. Commission on International Religious Freedom. Both men faced months of solitary confinement and could not contact their families, the commission said.\"It is of extreme concern to us. I don´t believe this is just a one-off event,\" Rabbi Sharon Kleinbaum, a member of the Congressionally mandated commission, told The Associated Press. \"I think that there is a sense that Iran is increasingly desperate. And when we know authoritarian theocracies are desperate, they often turn to very, very extreme acts.\"The Mizan news agency of Iran's judiciary confirmed the executions, describing the two men as having insulted Islam's Prophet Muhammad and promoted atheism. Mizan also accused them of burning a Quran, Islam's holy book, though it wasn't clear whether the men allegedly did that or such imagery was shared in the Telegram channel.",
        "Mahmood Amiry-Moghaddam, who leads Iran Human Rights, decried the executions as exposing the \"medieval nature\" of Iran's theocracy.\"The international community must show with its reaction that executions for expressing an opinion is intolerable,\" he said in a statement. \"The refusal of the international community to react decisively is a green light for the Iranian government and all their like-minded people around the world.\"It wasn't immediately clear when Iran carried out its last execution for blasphemy. Other countries in the Middle East, like Saudi Arabia, also allow for death sentences to be imposed for blasphemy.The streak of executions, including members of ethnic minority groups in Iran, comes as monthslong protests over the September death of 22-year-old Mahsa Amini after her arrest by the country's morality police have cooled. Already, at least four people charged over alleged crimes from the demonstrations have been put to death. The protests, which reportedly saw over 500 people killed and 19,000 others arrested, marked one of the biggest challenges to Iran´s theocracy since the 1979 Islamic Revolution.Kleinbaum called on the White House to condemn the execution and further sanction Iran, as well as push for Russia and China to allow the United Nations Security Council to refer Tehran to the International Criminal Court.",
        "\"This level of cruelty indicates that Iran´s government is desperate to maintain power through force, and we condemn it,\" she said.State Department deputy spokesman Vedant Patel told reporters in Washington that the U.S. condemned the executions. \"These latest executions are a grave reminder of the Iranian regime´s penchant for abusing and violating the human rights of the Iranian people,\" he said.In 2022, Iran executed at least 582 people, up from 333 people in 2021, according to Iran Human Rights. Amnesty International's most-recent report on executions put Iran as the world's second-largest executioner, behind only China, where thousands are believed to be put to death a year.While some executions are publicized, others are not in Iran.Many have been for drug-related offenses, but there also have been executions of a British-Iranian accused of spying and another of a Swedish-Iranian convicted of masterminding a 2018 attack on a military parade that killed at least 25.A German-Iranian who lives in California, Jamshid Sharmahd, also faces a looming execution as tensions remain high between Tehran and the West over its accelerating nuclear program. The European Union's top diplomat, Josep Borrell, said he spoke Monday with Iranian Foreign Minister Hossein Amirabdollahian about Sharmahd and \"asked Iran not to execute\" him.Human Rights Activists in Iran, another group monitoring the Islamic Republic, warned last week about the \"alarming surge\" in executions.",
        "\"Iranian authorities have an absolute obligation to uphold international human rights standards and instead, there is ongoing impunity for grave violations of the right to life - and more,\" said Skylar Thompson, the head of global advocacy and accountability at the group.___Associated Press writer Matthew Lee in Washington contributed to this report.___Follow Jon Gambrell on Twitter at www.twitter.com/jongambrellAP."
    ]
}