{
    "articleURL": "/tvshowbiz/article-12041081/EastEnders-Jamie-Borthwick-films-Lolas-heartbreaking-funeral-scenes.html",
    "content": [
        "EastEnders star Jamie Borthwick was seen back to work filming Lola Pearce's funeral on Wednesday.",
        "The actor, 28, donned a grey funeral suit while pausing to sign an autograph for a fan as he arrived at the set to resume work on moving episodes.After grabbing lunch to take back to the set, Jamie was seen speaking to a waiting fan as he arrived for filming.Jamie's character Jay Brown is set to be left devastating in upcoming episodes, as Lola tragically dies after battling a brain tumour.Her emotional final scenes have already been filmed, and will air in the coming weeks, after viewers saw Lola learn she had less than six months to live.",
        "Terminally-ill Lola (Danielle Harold) was given six months to live in March amid her brain tumour battle and now her passing has been lined up for future scenes. A funeral cortege, with the hearse and flowers spelling out Lola's name, was spotted arriving at the set of the BBC One soap this week.A white coffin was seen inside, with a number of special messages from Walford icons, including Kat Slater, written on the side.A message written by Bobby Beale reads: 'Life can be so cruel, so heartbroken.'It comes after last month Danielle broke her silence on her impending departure from EastEnders after she filmed some of her final scenes for the soap.",
        "The actress took to Instagram to share a heartfelt message of thanks to everyone who has helped tell Lola's story.The character has a terminal brain tumour and was recently given only months to live, with her final scenes expected to air later this year.Danielle shared a snap of herself as Lola lying in hospital with a bandage around her head as she was comforted by her husband Jay Mitchell (Jamie Borthwick).",
        "Alongside the photo, Danielle wrote: 'Lola's story has been a very hard one to tell and one that means so much to me and sadly effects so many people.'Brain tumours kill more children and adults under the age of 40 than any other cancer yet historically only 1% of research is allocated to this devastating disease.'I would like to take a moment for everybody that has reached out to me and shared their experiences with me, I have read every message and hold all of your messages close to my heart whilst playing this story. 'I have been blessed to meet the most incredible people and work with some wonderful charities along the way and I want to thank each and every one of you from the bottom of my heart for all your support advise and love ❤️'.",
        "Alongside them in the heartbreaking scene were Ben Mitchell (Max Bowden) and his husband Callum (Tony Clay). Several of Danielle's EastEnders co-stars commented on the post, with Max Bowden writing: 'Our girl ❤️❤️❤️❤️ YOU have helped save people's lives. And are giving the greatest performance. An absolute beacon and a superstar. Emma Barton, who plays Honey Mitchell, said: 'Words cannot express how I feel about you darling one… you are a masterpiece, talent, true, honest &amp; WOW!'Clair Norris, who stars as Bernadette Taylor wrote: 'So proud of you! ❤️'Gurlaine Kaur Gartcha, who plays Ash Kaur added: 'You are amazing'.",
        "On the show, Ben Mitchell's mental health will continue to plunge to new depths as Lola drops the bombshell after learning she has months to live.Recent episodes have seen Ben struggle to cope with his ex's prognosis, and in upcoming scenes, he decides to ignore his feelings by fighting in a boxing match.After some unexpected news from the police, things get even worse for Ben as he continues to bottle his feelings.And after sharing her prognosis with her father Billy, Lola realises she needs to get things in order, and tells Jay she wants him to adopt her daughter Lexi.EastEnders airs Mondays to Thursdays at 7:30pm on BBC One and iPlayer. "
    ]
}