{
    "articleURL": "/wires/reuters/article-12040017/Australias-biggest-hydropower-project-faces-delay-2028.html",
    "content": [
        "By Renju Jose",
        "SYDNEY, May 3 (Reuters) - Australia's biggest hydropower project faces a delay of up to two years, likely pushing its start-up out to 2028, the company said on Wednesday, in the latest setback for the A$5 billion ($3.33 billion) renewable energy project.The Snowy 2.0 project is now expected to cost more due to the delay, which the government-owned company blamed on a shortage of skilled workers, complex designs, soft ground and supply chain disruptions.The updated guidance meant the first power could be generated as late as December 2028. The setback comes as the federal government aims to get 82% of the east coast market's power from renewables by 2030, up from 30% now.The government had first hoped Snowy 2.0 would be built by 2021, but that deadline was later pushed out to 2026.The market will need power from the Snowy 2.0 project to help replace capacity from three coal-fired power stations due to close by 2028.\"We are proactively managing the inevitable issues and challenges that arise in a complex project like this,\" Snowy Hydro CEO Dennis Barnes said in a statement.Barnes did not specify the expected cost blowout, which the company said \"remained under review.\" The company last year dismissed as \"fiction\" a media report that said the project was facing an additional A$2.2 billion in costs.",
        "Snowy 2.0 is expected to add 2,000 megawatts of capacity, pumping water uphill into a dam when power prices are low and releasing the water downhill to generate power when prices and demand are high. It will store enough energy to power 3 million homes for a week.The construction, which involves boring 27 km (17 miles) of waterway tunnels connecting two existing dams and excavating a vast cavern between them for an underground power station, was paused in March on a key section after a ground collapse. ($1 = 1.4999 Australian dollars) (Reporting by Renju Jose in Sydney; Editing by Jamie Freed)"
    ]
}