{
    "articleURL": "/femail/real-life/article-12061233/Reddit-Aussies-outraged-British-parmo-parmi-parma-chicken-parmigiana-debate-continues.html",
    "content": [
        "Aussies are up in arms over British version of a chicken parmigianaA British restaurant labelled a version of the dish a 'parmo'  A British restaurant has been slammed by Australian diners after labelling their chicken parmigiana a 'parmo' - before enraging them further with a strange twist on the dish. ",
        "The menu offers different versions of the humble chicken parmigiana - better known Down Under as a 'parmi' or 'parma'. A conversation over the correct abbreviation sparked shortly after an image of the menu surfaced on Reddit - and at first Aussies were furious. But as it turns out 'parmo' is in fact short for Teesside Parmesan - a classic northern English dish that differs to the Aussie chicken parmigiana as it's topped with a white béchamel sauce and cheese. ",
        "A number of angered Australians were quick to share their thoughts on the matter. 'I don't even know why it's an argument to begin with, it's full name is 'parmigiana' ergo, 'parmi'. There is no other name for it,' one wrote. 'WTF is a parmo? Incandescently angry now,' another added, a third joked: 'No wonder the empire is crumbling.'  One person took it a step further and said: 'Republic NOW.' Despite the uproar, others offered a simple explanation - and as it turns out the Australian and British dishes aren't entirely linked. ",
        "A chicken parmigiana is made from succulent chicken breast covered in panko breadcrumbs and topped with tomato sauce and cheese. In Australia the classic pub meal is abbreviated to either a 'parmi' or 'parma'. Whereas a Teesside Parmesan, or a 'parmo', is a classic northern English dish' originating in Middlesbrough, North Yorkshire. It consists of a breaded cutlet of chicken or pork topped with a white béchamel sauce and cheese, usually cheddar cheese.Source: Wikipedia",
        "One said a 'parmo', or Teesside Parmesan, is a dish originating in Middlesbrough, North Yorkshire and is a popular take-away food in the Teesside area. 'It consists of a breaded cutlet of chicken or pork topped with a white béchamel sauce and cheese, usually cheddar cheese,' the person wrote. This is in contrast to the chicken parmigiana that's made with a panko breadcrumb coating and topped with tomato sauce and cheese. Another supported the claim and wrote: 'It's clearly a menu from the UK. They don't say everything exactly the same as Australians.'And as it turns out the Teesside Parmesan originates from Britain while the Australian chicken parmigiana traces back to Italy. ",
        "Australians have long declared chicken parmigiana one of their favourite pub meals - but there's a keen debate over whether the abbreviated version is parma, parmi or even parmy. In Queensland parmi, sometimes spelled parmy, is the generally accepted name for the dish - but it doesn't necessarily translate across state lines.In Victoria most people call the popular pub feed a parma while other states remain divided on the issue.In NSW, the parmi versus parma debate is pretty evenly split, while punters in Western Australia are also divided down the middle.While those in South Australia agree the word sounds like par-mee but are at arms over how to spell it, arguing the 'i' and 'y' variations aren't interchangeable. The debate has been sparked again thanks to a recent call for the slang names of Australian food to be officially included in the newest update of the Oxford Dictionary.Read more "
    ]
}