{
    "articleURL": "/wires/reuters/article-12057849/Brewers-power-past-Giants-snap-6-game-losing-skid.html",
    "content": [
        "William Contreras and Willy Adames belted two-run home runs as the Milwaukee Brewers salvaged one win on their six-game Western swing with a 7-3 victory over the San Francisco Giants on Sunday afternoon.",
        "Adames added a sacrifice fly and a run-scoring single to complete a season-best, four-RBI day for the Brewers, who had lost the first two games of the series after suffering a three-game sweep in Colorado against the Rockies.Adrian Houser came within one out of a potential win in his season debut, but the right-hander was lifted two outs into the fifth inning with a 5-2 lead. Relievers Hoby Milner, Joel Payamps and Pete Strzelecki did much of the heavy lifting from there, but not without a few anxious moments.Milwaukee's early three-run lead was the product of Contreras' second homer of the season in the second, Adames' sacrifice fly in the third and his home run in the fifth.The Brewers' first five runs came against San Francisco starter Ross Stripling (0-2), who worked the first five innings, allowing five runs and seven hits. He walked two and struck out three.The Giants brought the potential tying run to the plate in three of the final five innings, but Milner struck out Joc Pederson in the fifth, Payamps struck out Austin Slater and got Brett Wisely to pop up in the sixth, and Strzelecki whiffed J.D. Davis and Wisely consecutively in the eighth, all with two runners aboard.In ending a six-game losing streak, the Brewers tacked on two insurance runs in the ninth on RBI singles by Christian Yelich and Adames.",
        "Payamps (1-0), who got five outs, was credited with the win after Houser had given up two runs and seven hits in his 4 2/3 innings. Houser walked one and struck out five after missing the first five weeks of the season with a strained groin.Contreras finished with three hits and Yelich scored twice after two hits for the Brewers, whose seven runs were two more than they'd totaled in the first two games of the series.Thairo Estrada homered, his sixth of the season, as part of a three-hit day for the Giants, who had won four in a row.Blake Sabol also had three hits for San Francisco, while LaMonte Wade Jr., Mitch Haniger and Wilmer Flores collected two apiece. The Giants out-hit the Brewers 13-12.--Field Level Media"
    ]
}