{
    "articleURL": "/wires/ap/article-12044241/Councilman-pleads-not-guilty-perjury-49ers-report-leak.html",
    "content": [
        "SAN JOSE, Calif. (AP) - A Silicon Valley city councilman accused of leaking a confidential grand jury report criticizing the San Francisco 49ers' outsize political influence and then lying about the leak pleaded not guilty Wednesday.",
        "Santa Clara City Councilmember Anthony Becker is charged with one felony count of perjury under oath and also a misdemeanor count of willful failure to perform duty.He had declined to enter a plea when he made his first court appearance last month, saying he wanted to find a lawyer other than Christopher Montoya, his appointed public defender.Becker was still being represented by Montoya when he pleaded not guilty Wednesday, however, the Bay Area News Group reported.\"First-time impressions of a case are often wrong or incomplete,\" Montoya told reporters afterward.Jason Malinsky, a deputy district attorney, said after the hearing that the victims are the community.Becker, whose next court date is Aug. 2, was indicted in April and faces four years in county jail if convicted on the perjury charge.He is accused of providing the secret report to the NFL team´s former top spokesperson and a local news outlet in 2022, days ahead of its official release, and then lying to the grand jury about it. The report, titled \"Unsportsmanlike Conduct: Santa Clara City Council,\" alleged that councilmembers regularly voted \"in a manner that is favorable to the 49ers.\"The 49ers play in Levi's Stadium in Santa Clara, about 35 miles (55 kilometers) south of San Francisco. Santa Clara owns the stadium and leases it to the team, and the two sides have feuded for years through ethics complaints and legal disputes.",
        "Santa Clara County prosecutors said the football team has bankrolled Becker´s political career by spending at least $3.2 million through independent expenditure committees for his 2020 city council race, which he won, as well as an unsuccessful bid for mayor last year."
    ]
}