{
    "articleURL": "/news/article-12040583/Police-face-security-questions-man-threw-shotgun-shells-Buckingham-Palace-grounds.html",
    "content": [
        "Police also carried out controlled explosion on a suspicious bag as a precautionPolice are facing security questions today after a man carrying a suspicious package and a knife who had camped for days allegedly ranting he was going to kill the King threw suspected shotgun cartridges into the grounds of Buckingham Palace before he was arrested last night.",
        "The palace was on lockdown yesterday after the Metropolitan Police detained the man at about 7pm after he approached the gates in central London and threw a number of items. He is being held on suspicion of possession of an offensive weapon after a knife was found, the force said.Though neither the King nor Queen were in residence at the time, Camilla's grandchildren had been seen arriving at Buckingham Palace hours before - while Charles himself had held an audience with Australian Prime Minister Anthony Albanese earlier in the day.Police carried out a precautionary controlled explosion which could be heard live on GB News, while cordons were put up in the area. Scotland Yard is not treating the incident as terror-related, and it understood it is being treated as an isolated mental health incident.",
        "The bag held two passports, a phone, wallet, keys, bank cards, laptop case, picture of a child, and a large brown letter, according to The Sun. There was also a copy of the book The Happiness Advantage by Harvard lecturer Shawn Achor. ",
        "Minister Tom Tugendhat this morning appeared to play down concerns about the scare and insisted 'we are in no way complacent' about the security challenge posed by the Coronation on Saturday.He told Times Radio: 'The police are, to put it mildly, all over it, and our intelligence and other security forces are extremely aware of the challenge that we face. What we've been planning for a number of months now is one of the most important security operations that the country has put into plan.'",
        "The arrest comes as a ring of steel is expected in the capital for the Coronation at Westminster Abbey.Former head of Royal Protection Dai Davies said the Coronation represents ‘a far greater security risk’ to the Royals, visiting dignitaries and members of the public.‘You can never drop your guard as far as the royals are concerned’, he said.‘Of course, for hundreds of years you might expect protesters at events such as this but never before have activists been able to organise on the scale of groups such as Just Stop Oil and Extinction Rebellion.‘There are considerable groups that pose a threat. Often it is the lone wolf that wants publicity. This incident indicates that the police are on full alert.’Witnesses said the man was seen throwing a 'number of items' in the residence grounds before he was arrested.Footage shows how the handcuffed suspect hung his head as officers took him into custody. Police later carried out a controlled explosion on a suspicious bag as a precaution. ",
        "A witness told The Sun that the suspect had stationed himself outside the palace over the 'last few nights' and was heard shouting: 'I'm going to kill the King.'Police cordoned off the area outside the palace after the suspect began targeting the royal residence.",
        "Met Police chief superintendent Joseph McDonald said officers 'worked immediately to detain the man' - who is currently in custody.A witness alleged that officers 'jumped' on the man 'as soon as he placed the bag on the ground'.'They were shouting at him 'get down on the floor,'' the witness told The Sun, adding that it was 'astonishing' that the man was even able to get that close to the Palace with the Coronation just days away.Royal super fans who are camped along The Mall told MailOnline they were shocked after the 'big bang' from the controlled explosion went off at Buckingham Palace.While none saw the incident, many remarked they had heard a bang that sounded like a 'gunshot' as authorities detonated the suspected shotgun cartridges thrown over the fence.Mary-Jane Willows, who has camped out at multiple royal events including the Diamond Jubilee, said: 'The police threw a cordon up and there was a bang.'But she added that royal super fans wouldn't let the person responsible ruin their fun and he would be quickly forgotten when the event got closer.",
        "'Let's rub him away and forget about him', she said.One passerby remarked it was worrying, but the police had acted swiftly. The person, who asked to remain anonymous, said: 'It's concerning that someone would do something like this. Why would you want to do that? Everyone's so excited about Saturday, it's a shame someone wants to ruin that.",
        "'But the police seemed to have it under control, we didn't know anything had happened until the big explosion.'",
        "A controlled explosion was conducted as a precaution, Scotland Yard said, and the detonation was heard live on GB News.The items thrown into the palace grounds 'have been recovered and will be taken for specialist examination', the Met said.There were no reports of any shots fired, or any injuries to officers or members of the public.'Officers remain at the scene and further inquiries are ongoing,' added Mr McDonald.  ",
        "MP Jacob Rees-Mogg was presenting from the palace for GB News while police carried out the controlled explosion. The politician told MailOnline that he arrived at Buckingham Palace around 7.20pm, after the man had already been arrested.'It was all a bit odd,' Mr Rees-Mogg recalled. 'It wasn't closed off yet.'The MP, who was evacuated as the incident unfolded, added: 'It wasn't much at all. We could've carried on broadcasting rather than evacuating.'Mr Rees-Mogg said that despite the incident, he has no safety concerns for the upcoming Coronation festivities.Noting how the suspect 'wasn't near the King,' Mr Rees-Mogg stated: 'An event with millions of people poses some element of risk. The question is getting the balance right.'He said the 'key to this is not to overreact' and believes the risk posed with the Coronation is 'proportionate to scale of event'.",
        "The arrest comes as police and security services prepare for King Charles' coronation on Saturday, which is expected to see large crowds line the streets of London and heads of state from around the world attend the formal coronation ceremony.Royal fans were also starting to set up camp along The Mall to ensure front-row seats of the historic event this weekend. More than a dozen brave souls have set up tents and makeshift accommodation at the barriers days before thousands of people are expected to line the streets for the Coronation.A jovial atmosphere has sprung up among the group, but this was punctured by the explosion.Policing minister Chris Philp has said a ring of steel is expected in the capital for Charles's coronation at Westminster Abbey on Saturday.He described it as a 'huge policing operation', and heads of state and foreign royals from around the world are set to travel to the UK.",
        "In February, Jaswant Singh Chail, then 21, admitted a charge under the Treason Act of trying to harm the late Queen.He was caught in the grounds of Windsor Castle with a loaded crossbow on Christmas Day 2021, close to the late Queen's private residence, where she and other members of the royal family were at the time.",
        "The former supermarket worker had scaled the perimeter of the grounds with a nylon rope ladder at around 6am - wearing black clothes, gloves and a metal mask - and later told an officer: 'I'm here to kill the Queen.'Chail, from Southampton, Hampshire, appeared at the Old Bailey by video link in February and pleaded guilty to three charges, including an offence under the Treason Act.He also admitted to making a threat to kill the Queen and having a loaded crossbow in a public place."
    ]
}