{
    "articleURL": "/money/markets/article-12048285/More-regional-banks-brink-crisis-deepens.html",
    "content": [
        "America's banking crisis escalated last night as the future of three US lenders was left hanging in the balance.",
        "In another torrid day for regional banks, anxiety about contagion ripped through trading desks on Wall Street as stocks were routed.Shares in California-based Pacwest crashed to a record low, falling around 50 per cent at one point before closing down by nearly 42 per cent after it admitted it was looking for a buyer.Arizona’s Western Alliance tumbled 35 per cent as it clarified that it has not hired advisers to explore a sale.Western Alliance, which has a £1.5billion market cap and holds £60billion of assets, also sought to reassure investors by saying deposit flows were normal, with US officials understood to be watching withdrawals more closely than share prices.",
        "Nevertheless, regulators stepped in to halt trading during the session of both banks, although suspensions were only temporary.A third lender – Memphis-based First Horizon – was thrust into the spotlight when a £10billion takeover by Canada’s TD Bank collapsed.The two banks blamed uncertainty about regulatory approval but analysts said the current climate was no time for a merger. First Horizon shares fell 33.1 per cent.Jitters spread to heavyweights, including Bank of America, which slid 3 per cent, while Wells Fargo was off 4.3 per cent, Citigroup was down 1.8 per cent, and Goldman Sachs fell 2.4 per cent.",
        "Neil Wilson, an analyst at Markets, said: ‘The damage is spiralling now right across the sector. JP Morgan won’t step in again to save the day. So who does?’Bank runs have brought down four US lenders since March: Silicon Valley Bank (SVB), Signature Bank, Silvergate and First Republic. The latter was put into receivership on Monday in a deal that resulted in JP Morgan taking over most of the failed company.There has been no respite. Activist investor Nelson Peltz, whose daughter is married to Brooklyn Beckham, warned First Republic will not be the last to fail.He called for deposit insurance to be extended to aid regional lenders, saying depositors with more than $250,000 (£200,000) in a US-accredited bank should pay a small premium to the Federal Deposit Insurance Corporation.Peltz said: ‘It should stop the deposit outflow from the small regional and community banks. I don’t think we want all of the funds just going to major banks.‘I don’t have a crystal ball and I don’t know what the balance sheets of these banks look like.‘If this stops with First Republic being acquired by JP Morgan, I would be happy, but it may not.’Bill Ackman, chief executive of New York hedge fund Pershing Square, said the entire US regional banking system was now at risk.",
        "He wrote on Twitter: ‘Confidence in a financial institution is built over decades and destroyed in days. As each domino falls, the next weakest bank begins to wobble. We are running out of time to fix this.’The sell-offs came despite reassurances from the chairman of the Federal Reserve, Jerome Powell, who on Wednesday said the US banking system remained ‘sound and resilient’.He was speaking after the US central bank voted to raise interest rates to a 16-year high of between 5 per cent and 5.25 per cent.So far the fallout in the UK has been muted although Bank of England figures yesterday showed Brits withdrew record amounts of cash from accounts in March, the same month that SVB went bust.In total, £4.8billion was pulled out of UK banks and building societies in March – the most since records began in 1997. Last week a string of banks posted deposit outflows, including NatWest.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}