{
    "articleURL": "/news/article-12059509/How-America-went-meltdown-Bud-Lights-disastrous-tie-Dylan-Mulvaney.html",
    "content": [
        "Bud Light's partnership with influencer Dylan Mulvaney sparked fierce backlashMillions of Americans have ditched the beer brand and sales have plummetedREAD MORE: 'There is a subset of American consumers who will not drink a Bud Light for the foreseeable future,' warns JPMorganMass boycotts across America, billions of dollars down the drain and bomb threats aren't what the marketing executives of Bud Light had in mind when they brought in transgender influencer Dylan Mulvaney for a new partnership.",
        "But that's exactly what happened.For decades, Bud Light has been a staple in homes across the United States as the country's top-selling beer but those days are fast disappearing with millions ditching the brand.It all kicked off with Mulvaney, 26, sharing a video to her 10.8 million Instagram followers of herself cracking open a can of Bud Light on April 1, along with the hashtag #budlightpartner. Mulvaney was even given a beer can with her face on it to celebrate the influencer's first year as an openly transgender woman.Marketing executives including Alissa Heinerscheid had hoped the partnership with the transgender influencer would freshen up Bud Light's image - but instead, it very nearly destroyed it, with celebrities and customers slamming the company for going 'woke'.The company's decision to partner with Mulvaney has become a symbol of how divisive transgender issues are in the US - and there are no signs that the anger or boycotts will stop any time soon almost six weeks on. Indeed, the global CEO of parent company Anheuser-Busch this week continued to deflect blame for the saga and instead blamed 'social media' for triggering the boycott which has seen Bud Light sales fall 21.4 per cent in April. ",
        "Within days of Mulvaney's social media posts, American singer Kid Rock, 52, decided to stack cases of Bud Light beer on a table and use them as shooting practice in a video that went viral. ",
        "Rock's commentary of 'f*** Bud Light' while the cans sprayed into the air was the opposite of what the marketing team had in mind when they decided to partner with Mulvaney. Other celebrities joined Kid Rock in slamming the partnership, with country singers John Rich and Travis Tritt publicly denouncing the brand. Beer lovers in Tritt's hometown Marietta, Georgia, quickly followed suit and started drinking Coors Light instead of Bud Light following the controversy. And the nightmare for the Bud Light executives didn't end there.Millions of customers ditched the American brand within days of Mulvaney's social media posts, with scores filming themselves pouring the beer down the sink and throwing the cans into bins.And as the polarisation spilled into bars across America, with patrons trading insults and recriminations over each other's beer choices, some bar owners said they would stop selling Bud Light simply to prevent fights. Scores have said Bud Light's partnership with Mulvaney went too far at a time when transgender issues - including gender-affirming health care and participation in sports - are a divisive social issue. Indeed, a poll of some 1,000 adults found that most Americans support the boycott, with many saying the brewing giant 'stepped into a hornets' nest' by getting the controversial TikToker to promote their beer.",
        "The PR disaster has seen Anheuser-Busch lose more than $6billion in market capitalisation and its sales of Bud Light have dropped by 26 per cent amid the backlash.",
        "It meant Bud Light declined to the fourth spot of the most popular draft beer in America following the controversy – losing out to Coors Light.And to make matters worse for all those who work at the company, the Budweiser factory in Los Angeles was targeted by a series of bomb threats in the wake of the Mulvaney controversy. Other facilities owned by Bud Light's parent company Anheuser-Busch across the country were also targeted.Despite the decision by millions of once loyal Bud Light customers to ditch the brand, plummeting sales and bomb threats, the company - aside from an initial terse statement - remained tight-lipped about the situation. The brand's social media accounts fell silent as conservatives howled over the Mulvaney partnership.Advertising and brands expert Ben Schott called the Bud Light saga 'a marketing case study for the ages' in 'how not to handle brand collaborations in a dangerously polarised space.''But Bud Light's action is worse than a gaffe, it's a betrayal,' wrote Schott, noting that the brand retreated into 'cowardly' silence, leaving Mulvaney high and dry, as the controversy exploded online and in bars across the country.",
        "'Bud Light actively and eagerly sought out a controversial influencer in a dangerously polarized space, with neither the wisdom to plan for a backlash nor the bravery to stand by its partner,' he wrote.And it took 14 days for Anheuser-Busch US CEO Brendan Whitworth to address the polarisation in America over the controversial partnership.'We never intended to be part of a discussion that divides people,' Doukeris wrote on April 14. 'We are in the business of bringing people together over a beer.'",
        "Reaction to the statement was not what Whitworth had hoped for. 'That statement is one of the worst statements I've ever seen,' Gerard Braud, a crisis communications expert, said. 'It says absolutely nothing… and it took 15 days to formulate it.' And this week the global CEO of the company, Michel Doukeris, continued to deflect blame for the fiasco and doubled down on his claims that Mulvaney was never a partner of Bud Light.It was just the latest excuse Anheuser-Busch executives have made for the calamitous advertisements, after previously saying it was created by an outside agency and nobody in the company was aware of the campaign - despite two of Bud Light's marketing executives stepping down in the aftermath.Indeed, behind the scenes at the firm, there have been hints of internal turmoil and finger-pointing over fallout from the controversy.",
        "According to sources cited by the Daily Wire, 'no one at a senior level' was aware of the Mulvaney brand partnership before it launched, and the campaign was undertaken by a 'low-level marketing staffer.'The PR disaster has seen two senior Bud Light executives placed on leave so far. Bud Light's VP of marketing Alissa Heinerscheid took a leave of absence and was quickly followed by Daniel Blake, who is the Anheuser-Busch vice president for mainstream brands.",
        "Blake is Heinerscheid's boss and the move highlights the turmoil at the multinational business, which is valued at more than $100 billion, over Bud Light's deal with Mulvaney.The firm said both bosses 'decided' to temporarily step down, but their decisions were reportedly not voluntary.But the decision came after it was revealed that Heinerschied gave an interview to a business podcast in which she said she wanted to make Bud Light less 'fratty' and more 'inclusive'.Just two days later, Mulvaney - who began transitioning to a woman in 2021 - announced that she was partnering with the company.But PR experts have said that the responsibility for overseeing protocols to approve new marketing campaigns ultimately falls with the company's US CEO, Brendan Whitworth.Whitworth, a former Marine lieutenant, CIA officer, and Harvard Business School graduate joined A-B in 2014 and became the CEO in 2021 after serving as a senior executive at Frito-Lay.",
        "Some American conservatives have pushed the bizarre conspiracy theory that Whitworth was placed as CEO of Anheuser-Busch by the CIA in order to make the company 'woke'.And since the CEOs Doukeris and Whitworth unceremoniously disowned the disastrous stunt, there has been a boycott to the boycott with gay bars being so furious they started ditching the beer too.2Bears Tavern group, a bar with four locations throughout Chicago, pledged not to sell Bud Light because the company had 'abandoned' their support of Mulvaney.The bar said Doukeris' and Whitworth's response was 'cruel' and 'hateful' while insisting the beer company simply fed an 'anti-trans criticism'.'Anheuser-Busch's decision to drop its support of Mulvaney in response to ignorant and hateful objections by some of its customers shows how little Anheuser-Busch cares about the LGBTQIA+ community, and in particular transgender people, who have been under unrelenting attack in this country,' the bar wrote in a statement. 'CEO Brendan Whitworth's excuse that Anheuser-Busch 'never intended to be part of a discussion that divides people' was tantamount to saying that the rights and safety of transgender people are topics worthy of debate.'The headache for executives at the firm doesn't look to be ending any time soon, with the company's handling of the backlash being branded as a historically-bad marketing gaff by experts. They've also criticised the company for abandoning Mulvaney when things got tough. Mulvaney has struggled to gain standing in the trans community, and is often described as more akin to a drag queen, a pantomime performer, or a grifter. ",
        "She underwent 'facial feminization surgery' in December, and described the 'insane swelling' from alterations to her hairline, chin, jaw, cheeks, nose, lips, and trachea.",
        "Though painful, the surgery was cosmetic, and is seldom the first gender-affirming treatment that most male-to-female transitioners select. Mulvaney does not appear to be taking cross-sex hormones, even though she can afford them.She came out as a trans woman in March 2022 and began chronicling her 'Days of Girlhood' on TikTok, detailing her experience of transitioning.And Bud Light had created a special edition can to celebrate 365 days since she began living as a woman, with the influencer posting a images of it on Instagram. The move sparked intense backlash, with women sharing their own 'days of womanhood' online with posts beginning with the phrase 'Today, I celebrate'. One woman posted a photo of her pregnant stomach and said: 'Today, I celebrate 12,065 days of being a woman.'I'm a sister, aunt, daughter, granddaughter, and now a mother. I've endured 229 menstrual cycles. I've been pregnant one time &amp; gave birth to a beautiful baby boy. My body grew a human child, and my body is now feeding a human child.'No man can say he has done these things because you cannot change your gender.'Mulvaney is typically theatrical and buoyant in her clips. They seldom last more than a couple of minutes, while giving viewers a brief window into her everyday life.In one bizarre posting to TikTok, Dylan explains how she had been carrying around a selection of feminine hygiene products despite not being physically capable of menstruating.'Day 75 of being girl - I've been carrying around tampons and pads for the past two months but I've never actually opened one up, so let's do it. Woohoo!' she begins before using a euphemism for vagina. 'I thought the letters stood for small, medium and large based on the size of your 'Barbie pouch' but after Googling I found out it's actually the level of your flow.' Dylan was allegedly offered a paid partnership with Tampax to advertise the menstruation products, but the posting generated a host of angry responses, particularly among gender-critical feminists.Dylan's TikToks documenting her 'days of girlhood' have accumulated millions of views. In the videos, she was often seen doing and acting in excessively 'feminine' ways which are often perceived as representing harmful, sexist stereotypes. While 'being a girl,' Dylan often attributes her womanhood to what she is wearing, her makeup, eating habits and dramatic emotions which lead to crying and binge shopping."
    ]
}