{
    "articleURL": "/news/article-12056657/Fury-campers-abandoned-tents-left-piles-rubbish-Mall-Kings-Coronation.html",
    "content": [
        "Fury at campers who left rubbish on the Mall after King Charles III's CoronationKing Charles Coronation LIVE: King and Queen 'deeply touched' by celebrations Brits have vented their fury at 'selfish' campers who abandoned tents and left piles of rubbish down The Mall after the King's Coronation.",
        "Tents, empty cartons and bags of rubbish littered the floor after Charles's big day on Saturday.Thousands of well-wishers lined the King's processional route from Buckingham Palace to Westminster Abbey.Some had camped for days to secure their spot but many have left the site looking 'worse than Glastonbury'. Westminster Council contractors the clean up on Sunday as crews picked up rubbish and camping gear discarded carelessly by some of the royalists.",
        "Livid Brits raged online about the ugly state The Mall was left in. One said: 'I find this deeply distressing. Surely if you're the kind of person who claims to love your country you wouldn't do this?'I despair at the mindset of people who claim to be patriotic and yet would do this. Sickening.'Another said: 'Glastonbury has litter-pickers who clean up regularly. I did it once - it never looked this bad.'",
        "A third said: 'Because they are all so keen to take part in Coronation events presumably they are volunteering tomorrow. Maybe start with picking up their own rubbish?' Janine Lewis, a councillor for Reading Borough Council, said: 'This sight is quite abhorrent. 'Showing this respect for the environment and then saying you were there to be part of history is like stabbing the King. 'He would be heartbroken to see such a shameful decimation of the land. I could go on... heartbreaking.'",
        "Rubbish crews were spotted along the Mall this morning, cleaning up the slew of litter - ranging from tents to empty cups, plastic bottles and forgotten sun hats - that had been left behind during yesterday's joyous celebrations.Volunteers with grabbers and white bin bags took to the streets yesterday to tidy up after the royal spectacle.",
        "It came after the King and Queen set the seal on their historic coronation day with a double Buckingham Palace balcony appearance to acknowledge the nation.Charles and Camilla in lavish robes and wearing their crowns returned with a wave the cheers of the crowds, who filled The Mall after braving downpours to see a colourful ceremonial military procession not seen for 70 years.The Prince and Princess of Wales and their children Prince George, Princess Charlotte and Prince Louis joined the monarch, as did the pages of honour and other royals - and then wellwishers were treated to an encore with just the King and Queen.",
        "The royals watched a flypast from the balcony, which was scaled down to include only helicopters and the Red Arrows due to the poor weather.The family spent a little under 10 minutes on the balcony before going back inside, but the King and Queen re-emerged moments later to loud cheers.",
        "At a few minutes past midday on Saturday, Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, the nation's coronation church since 1066, as Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.The historic moment, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.The coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the Abbey's high altar and receiving homage from his son and heir the Prince of Wales."
    ]
}