{
    "articleURL": "/news/article-12061413/Mother-kidnapped-Angel-Lynn-says-daughter-able-stand-time.html",
    "content": [
        "Angel Lynn, 21, was left paralysed and unable to eat following the 2020 ordealShe had been forced into the van by her boyfriend at the time Chay BowskillThe mother of a kidnapped woman who was left brain-damaged after falling out of a van said her daughter has been able to stand for the first time since the horror attack. ",
        "Angel Lynn, 21, suffered catastrophic brain injuries when she fell out of a moving van head-first at 60mph on the A6 after being kidnapped by her ex-boyfriend in September 2020.Her parents Nikki, 48, and Patrick Lynn, 53, were told their daughter would not survive. But Angel has defined the odds and can now stand and she has started to swallow.Nikki, who runs a cleaning business, told he Sun: 'She is communicating more and more.",
        "'I know it won't change things but I'm hoping one day she will speak and tell me what happened. 'I do think she was pushed because of the injuries she suffered, the force with which she hit the ground.'Angel, from Loughborough, is recovering and undergoing rehabilitative treatment after Chay Bowskill, her ex-boyfriend, left her paralysed and unable to eat, walk or talk by herself.",
        "Nearing the end of their relationship, Bowskill became increasingly threatening and Angel began to withdraw before attempting to leave him. In September last year, Angel's mother said she was warned her daughter's injuries were fatal but she was starting to regain movement on her left side and relearn how to swallow.Angel’s fight for survival has astonished doctors at the Queen’s Medical Centre, Nottingham, where she was given the last rites three times.",
        "Her family hope that soon she might be able to recount what happened in the run-up to Bowskill kidnapping her.CCTV caught the moment Angel was forced into a van by Bowskill and his accomplice Rocco Sansome, in Rothley, Leicestershire, in September 2020 after an argument.She then fell out of the vehicle, which was driven by Sansome, as it travelled at 60mph, before she was found by horrified members of the public.",
        "In January 2022, Bowskill was handed a seven-and-a-half-year sentence after being found guilty of kidnap, coercive and controlling behaviour, and perverting the course of justice, following a trial at Leicester Crown Court.His sentence was then nearly doubled after senior judges at the Court of Appeal concluded his original term for the kidnap was not long enough and handed him four-and-a-half more years.Sansome received 21 months. Bowkill's sentence was later increased to 12 years, although Sansome's was not changed.Bowskill, of Syston, Leicestershire, was also convicted of coercive and controlling behaviour and perverting the course of justice.He was cleared of causing grievous bodily harm after it became unclear how Angel had left the van.Angel was attending college and working part-time as a cleaner when she met Bowskill through a mutual friend around a year before the incident. ",
        "Her mother said Bowskill admitted in court that the last thing he said to her daughter before she plunged from the van was: 'I f***ing hate you, bitch.'Nikki and Patrick, who run a cleaning business, are also parents to Reannon, 31, Lewis, 29, Lester, 27, Kelsie, 12, and ten-year-old Jimmy. "
    ]
}