{
    "articleURL": "/tvshowbiz/nicola-peltz/article-12056517/Nicola-Peltz-epitome-glamour-red-embroidered-ord.html",
    "content": [
        "Nicola Peltz looked sensational in a busty red co-ord as she took to her Instagram on Sunday.",
        "The American actress, 28, displayed her stunning figure in a red embroidered blazer and a matching mini skirt which displayed her toned legs.Nicola flaunted her cleavage as she flashed a racy black bralette underneath.The stunner shared a mirror selfie snap on her stories as she posed up with pal Andie Jane - who owns a scent candle business - doing a peace sign.The Our House actress slicked her hair back with a black large headband and wore her brown tresses down.",
        "Nicola showcased her natural features by opting for a light and quite natural make up look.The Bates Motel star highlighted her cheeks and added pink blush to it, and finished off with a nude lip-gloss. Later in the day, Nicola shared another snap as she sat in the backseat of the car as she held a paper glass in her hand with a toothpaste and a toothbrush inside it.The model posed for the camera as she flashed a big smile. She also shared a sweet snap of her hugging her dad as he laid on the bed.'I love you so much dad,' she captioned with a white heart emoji.It comes after Nicola and her husband Brooklyn, 24,  kept a low profile while out in New York on Wednesday - after Gillian McKeith's daughter Afton claimed she once had a fling with him.",
        "The famous son of Victoria and David Beckham and the actress were shopping in What Goes Around Comes Around in Soho, New York.Brooklyn held their beloved pooch Lamb on a lead as he dotingly followed behind his wife, who he tied the knot with in April 2022. ",
        "He opted for a laid-back look as he sported a black sweatshirt and matching denim jeans.Meanwhile, Nicola looked stylish even for a casual outing in a black fitted top that exposed a portion of her toned midriff.She added denim mom jeans and chunky heeled boots for a practical look as she walked her dog. Gillian McKeith's daughter Afton claimed that she once had a fling with Nicola's husband Brooklyn.The 23-year-old claimed she dated the famous nepo baby when she was younger - but added she no longer 'keeps up' with what he's doing.She also told how she recently had an awkward run in with Brooklyn and his wife Nicola at an LA supermarket.She told The Sun: 'I didn't watch any of his wedding. I actually don't keep up with what he does.'But I actually bumped into him not so long ago in Los Angeles at my local supermarket - Erewhon - and her as well. It was extremely awkward.",
        "'You know, they seem good. I wish them the best. I hope they have a really long and happy marriage.'Afton has previously told how Brooklyn blocked her on Instagram.Their fling was reportedly in between Brooklyn's relationships with Madison Beer and Chloe Grace Moretz.A source told The Star at the time: 'The romance didn't last too long but Afton definitely grew feelings for Brooklyn.'Reps for Brooklyn have been contacted by MailOnline for comment."
    ]
}