{
    "articleURL": "/columnists/article-12052815/Todays-ceremony-strange-arcane-think-alternative-shout-Vivat-Rex.html",
    "content": [
        "The mood of the nation, if I have read it correctly, has been one of muted joy over the past few weeks. We are not in ecstasies. We are not in a state of hysterical euphoria. We are not like Catholics expecting the enthronement of a Pope, still less like music fans in an arena awaiting the arrival of our favourite rock star.",
        "We certainly are not treating the Coronation as an excuse for saying how much we love the King personally, or indeed any of the Royal Family, some of whose members are not only bad jokes in themselves, but threaten to make the whole monarchical system itself seem like a bad joke. But, nonetheless, despite this, we are quietly and strangely happy.‘I’m really looking forward to it,’ said the kind young woman at a lending library which I visit every few weeks. If she had been in her late middle-age, the remark would not have struck me as surprising. But she can’t be more than 25. She is of Bangladeshi origin, I’d guess. She wears the hijab. ‘We’re all looking forward to it, aren’t we?’The barista who sells me my coffee each morning is, again, not your stereotypical royalist. He and his friend march in Gay Pride every year, and it is usually about such events, or of the holidays from which he has returned, that he speaks as he hands over my flat white. Yet his words were almost word-for-word the same as those of the librarian. ‘I’m really looking forward to it. Everyone is going to have fun.’On buses and trains, where I am an unabashed nosy parker and listen to the conversations of my fellow passengers, I have noticed that people have been talking about it for weeks.",
        "True, only last week, I heard a young man saying how ridiculous he thought it was — why could we not simply have an unassuming accession ceremony, as they have with Scandinavian monarchies, in which the incoming king or queen swears an oath to uphold the constitution? Why all the palaver?But most of the conversations I have heard have been different. People are planning family get-togethers, or parties with their neighbours. Some of the really ancient crocks (i.e. a tiny bit older than me) have been talking about their memories of the last coronation, when, of course, very few people in the street had a telly.But most people — the middle-aged and the young — have absolutely no memory of the last coronation and are simply looking forward to it.I grow more and more cynical with age, and I have to admit that, if you had asked me at the beginning of this year what were my feelings about the impending Coronation, the reply would have been a groan.Why? I suppose my answer would have been that Britain has changed so irrevocably since the last coronation that any attempt to revive the atmosphere of 1953 was bound to be cringe-worthy.In the last coronation, a tired, proud, poverty-stricken nation had just come through World War II.",
        "The nation had been united by the tough experience of its cities being bombed, its young people killed in action. Whereas, before the war, there was real bitterness between the classes, the experience of fighting Hitler had made the nation come together.Everyone lived on the same food rations every week. Everyone had similar experiences of fear and bereavement. And when it was over, everyone could feel a sense of shared pride that Britain had done the decent thing, stood up to the dictators, and liberated Europe from fascism.",
        "In contrast, the nation of 2023 is not united. Brexit and the culture wars have revealed to us that we are at odds with one another. Old versus young. Pro-Europe versus anti-Europe. Socially liberal versus those who, because of age or religious belief, feel that in a whole range of matters ‘things have gone too far’.In 1953, a majority of the population claimed to belong to the Church of England, so it made some sense to continue the tradition of having a coronation, which was a religious ceremony conducted by the Archbishop of Canterbury, with other bishops in tow.Compare that with Britain today, when only a tiny proportion of the population are regular Anglican church-goers; when the majority of church-goers are actually Roman Catholics; and where, since the migrations which began in the 1950s, vast numbers of Muslims, Hindus and Sikhs are now fellow citizens alongside Christians.",
        "So I’d have said a few months ago: what right has the C of E to hog the show? In what sense does an Archbishop of Canterbury, dressed up in arcane clothing and indulging in strange rituals, which to most people would seem to be mere mumbo-jumbo, represent the nation? Is this really the most appropriate way of inaugurating a head of state in the 21st century?And while we are about it, how can we justify choosing a head of state entirely on the hereditary principle?At the last coronation, the old hereditary peers came tottering into the Abbey wearing the moth-eaten robes of their ancestors, which had been rotting in their stately homes since 1937, when last fished out for service. At the moment of crowning, the peers — all men, of course — raised their coronets and shouted: ‘Long live the Queen!’ Only in Latin.If there is anything which tells us that we are living in a different world, it is the thought of those old peers shouting ‘Vivat!’ in 1953.The British have always taken the class system with a pinch of salt, making snobbery the butt of their jokes and only half accepting the hierarchy of society.",
        "But now the class system is all but over and done with. Only a small proportion of the hereditary peers remain in the House of Lords, which is made up chiefly of political appointees, nominated by prime ministers for their own strange reasons.",
        "So the people organising today’s Coronation were in a pickle. They couldn’t call the old peerage out of mothballs and get them to shout ‘Vivat!’ to King Charles. But, on the other hand, if they assembled a few life peers, preferably chosen for their religious and ethnic diversity, what was that going to symbolise?It would show that the hereditary principle was dead as a doornail. And if that is the case, what are we all doing, watching a ceremony in which we choose a head of state purely on the hereditary principle?The funny thing is that, although it is always easy to pick holes in and to mock these sorts of events, I have changed my mind as this one has approached — and I suspect that most of us will not feel like mocking it.The Coronation’s ceremonies will speak for themselves, and whether they are carried out as in the 1950s by some old geezer whose family have been landowners for generations, or a newly appointed female life peer, it won’t really matter.That is the great thing about ceremonies when they are solemnly conducted. They are impersonal.The strangely clad participants, carrying the priceless Crown Jewels and the accompanying regalia will seem like dolls in a beautifully choreographed puppet show. And the central figure will, too.",
        "Today’s Coronation reminds me of two wise observations by the 20th-century journalist and poet G. K. Chesterton. One is that ‘man was a ritualist before he could speak’ — the fact is, rituals such as today’s ceremony speak more eloquently than words, and it will probably take us months or years to turn into English the feelings which we have had when watching this spectacle.Chesterton also remarked that he would have been happy to choose the head of state by simply opening a telephone directory with his eyes shut and sticking a pin in someone’s name. Then, having made the observation, he realised that the hereditary principle is just as arbitrary as this.True, we no longer live in an age of deference, and the hereditary aristocracy has only a very small role to play in our Parliament, and less and less in the way our society is conducted.",
        "But the sheer randomness of how we choose the head of state is actually tremendously in our constitution’s favour.The Coronation is not a rally of the King Charles Fan Club. It would still go ahead, whatever our views of the man — though as it happens, the majority of the British people would surely, in this week at least, acknowledge that Charles had been a public-spirited person, endeavouring through his many charitable concerns to make life better for his fellow mortals.That is not, however, why he is the King. He’s King simply because someone wearing a blindfold stuck a pin in a list of names. Only it wasn’t a person, it was Fate, or Destiny, or Luck.In the era when most of Europe was getting rid of its kings, queens and emperors, there were a great many British people who felt we should do the same. Why not be like the Russians, and have Comrade Lenin? Or, as the fascists rose to power, why not have some strutting, uniformed despot who solved unemployment and made the trains run on time?But as the confused bloodbath which was the 20th century unfolded, history provided some clear answers to this. Many British people came to feel very grateful that we did not have a communist or a fascist government. And the reason we didn’t was in large part because we have maintained the idea of a constitutional monarchy.Under this system, the Crown — the symbol of power — is ‘above politics’. The person who wears it is a guardian of the institutions which keep us free — namely the rule of law, the judiciary, jury trial and Parliament. The monarch works in tandem with the political Establishment, often as a sounding block, having laboriously ploughed through the state papers brought to them in the red boxes.Our kings and queens have the advantage of being an embodied link with the great weight of history — all their ancestors and that of the British people — stretching back to Alfred the Great. This is why, at times of national solemnity, the monarch is so much bigger a person than any elected president could ever be.The Crown is not placed on the head of the most powerful person in the country. We do not crown a king because he is the cleverest or the most handsome or the most popular person in the realm.Instead, we ask the Archbishop of Canterbury to invest power, using the symbols of crown, orb and sceptre, in a human being who is chosen, as it were, at random.",
        "During World War II, when Stalin, Hitler and Mussolini were reducing millions of human lives to misery, Britain had a king who was the polar opposite of the dictators.George VI, a small chain-smoker with a stammer, who had clearly loathed the idea of being thrust into this role by his selfish brother’s abdication, was the perfect symbolic definition of why we valued our constitutional monarchy.The absolute power symbolised by the Crown was being placed on the head of someone who did not want it and who was, by human standards, rather weak — as his biographer Philip Ziegler suggested, he was ‘extraordinary in his ordinariness’.Yet after the abdication crisis of 1936, he was determined to re-establish the monarchy as the paradigm of decorum and reliability, which was exactly what his subjects wanted.This Coronation will inevitably bring thoughts of our history to mind and, in my case, feelings of gratitude that we have had a monarchy rather than some of the gruesome political alternatives.But it will also cheer us up. The vast majority of people in Britain want our society to work, want it to be fair and compassionate, as well as well-ordered and just. We want to get on with our neighbours and work colleagues.The celebrations of the Coronation are an expression of all these harmless hopes. The ceremony itself is, as a matter of fact, only a small part of what will make us happy on Coronation Day. The real cause for rejoicing is that, despite all our problems in Britain, we live in a reasonably prosperous, reasonably peaceful society.If you sometimes feel depressed about the state of the nation, imagine being an American, who will likely have to choose between a dodderer and an old crook at their next presidential election. Imagine being in Putin’s Russia, or Macron’s faction-torn France. Think of the countries of the Middle East; think of Sudan.The British have much to be thankful for. Without quite spelling out what those things are, they will be mysteriously expressed, not only by the Coronation ceremonies we watch on our tellies, but in the street parties, family get-togethers and jolly noises coming from pubs. Vivat! Vivat!"
    ]
}