{
    "articleURL": "/wires/ap/article-12055289/Cards-skid-8-Wainwright-returns-Tigers-win-6-5-10.html",
    "content": [
        "ST. LOUIS (AP) - The St. Louis Cardinals extended a losing steak to eight for the first time in 16 years, losing to the Detroit Tigers 6-5 on Saturday in Adam Wainwright's return from the injured list as Akil Baddoo hit a go-ahead double in the 10th inning.",
        "\"I really wanted to end that,\" Wainwright said. \"It´s not all on my shoulders, I know, but when a starter goes out and puts up zeros then a team can really rally behind that, We had a lead twice to do it and let them get back into it both times.\"St. Louis is on its longest skid since nine straight losses from Sept. 7-15, 2007. At a National League-worst 10-24, the Cardinals are 14 games under .500 for the first time since ending the 1997 season at 73-89.\"I´ve been through stretches like this before, and they´re tough,\" said Cardinals third baseman Nolan Arenado, who hit a two-run homer. \"I think you just continue to go, and, hopefully, it turns. I don´t know when it´s going to turn, but you've just got to keep going and keep pushing. It´s hard to do, but that´s the only way.\"A squirrel got one of the day's biggest ovations when he scampered across the infield in the bottom off the seventh.Baddoo doubled off Giovanny Gallegos (1-2) to drive in automatic runner Jonathan Schoop.",
        "Wainwright, starting his 19th and what he said will be his final major league season, allowed four runs and eight hits over five-plus innings struck out five and walked none. His 31 fastballs averaged 87.6 mph.",
        "Wainwright had started the season on the injured list after hurting a groin.\"I felt great out there,\" Wainwright said. \"I felt in control of things and commanding the ball and commanding counts. I really can´t understand what happened in that fifth inning. I feel like I pitched a scoreless game and I gave up four runs. I really don´t know why.\"The 41-year-old right-hander pitched two-hit ball for four innings and was staked to a three-run lead, then allowed Detroit to tie the score 3-3 in the fifth on RBI singles by Eric Haase and Riley Greene around Zack McKinstry´s sacrifice fly.Wainwright left with a 5-4 lead after Nick Maton doubled and scored on Spencer Torkelson´s single in the sixth. Torkelson tied the score with a RBI single in the seventh off Genesis Cabrera.\"He´s an unbelievable pitcher,\" Torkelson said of Wainwright. \"His velocity wasn´t really there, so he´s nibbling and getting the corner. I think we did a really good job of kind of waiting it out and then getting our mistakes later.\"The second-oldest active pitcher in the major leagues, Wainwright missed the first 33 games while recovering from an injury sustained when working out with the U.S. during the World Baseball Classic.Chasen Shreve, Will Vest, Tyler Holton and José Cisnero (2-0) combined for 5 1/3 shutout innings in relief of Spencer Turnbull, who allowed five runs and seven hits in 4 2/3 innings.",
        "\"We had a lot of guys down, and the guys that we had were fresh.\" Tigers manager A.J. Hinch said. \"We´re going to rely on every guy that we have down there in different ways. Sometimes it´s going to be sort of normal roles and kind of easy to see when I´m going to use them. Other days it´s going to be like this where you've got some guys pitching in leverage that that need to do their part if you want to win the game.\"Dylan Carlson hit a three-run homer in the second and Arenado had a two-run homer in the fifth for a 4-3 lead, Arenado´s third home run this season and first in 85 plate appearances since April 12 at Colorado.UPON FURTHER REVIEWCardinals manager Oliver Marmol challenged Badoo´s steal of second base in the the fifth inning, but the call stood.MOVESSt. Louis selected the contract of C Tres Barrera from Triple-A Memphis, optioned RHP Guillermo Zuñiga to Memphis and designated INF/OF Taylor Motter for assignment.TRAINER´S ROOMTigers: RHP Freddy Pacheco (right elbow sprain) threw a bullpen session before Friday´s game and is throw another session next week. He was placed on the 60-day injured list on March 28.Cardinals: INF Nolan Gorman (lower back strain) was held out of the starting lineup for the second straight game but pinch hit for Tommy Edman in the 10th and hit a game-ending groundout.",
        "UP NEXTDetroit will recall RHP Alex Faedo from Triple-A Toledo to make his season debut against Cardinals LHP Steven Matz (0-4, 6.39 ERA). ___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}