{
    "articleURL": "/wires/reuters/article-12051785/Weekend-preview-Kansas-Speedway.html",
    "content": [
        "DAYTONA BEACH, Fla. -- In the relatively short time since Kansas Speedway debuted on the NASCAR scene in 2001, the 1.5-mile track has featured a long list of race winners from Hall of Famer Jeff Gordon, the first to celebrate in Victory Lane, to Bubba Wallace, the most recent last fall.",
        "There have been six different race winners in the last six Kansas races. And defending winner of Sunday's AdventHealth 400 (3 p.m. ET on FS1, MRN and SiriusXM NASCAR Radio) Kurt Busch will be in the FS1 broadcast booth not behind the wheel this week after stepping away from competition last season. The Busch and Wallace 2022 wins for 23XI Racing marked the fourth time a team has swept races at the Kansas track.Of the three most successful active drivers at Kansas -- three-time winners Joey Logano, Denny Hamlin and Kevin Harvick -- only Logano has a victory (at Atlanta) through the opening 11 races of the 2023 season.Kansas has proven to be a competitive track and the 2023 season has proven to be every bit the competitive season as 2022, which featured 19 different winners in the debut of the NextGen car. That tyies the mark for race winners set in 2001, the very year this week's venue Kansas Speedway joined the NASCAR Cup Series calendar.Three drivers currently ranked among the top five in the championship points standings -- including leader Ross Chastain, Harvick and Ryan Blaney -- are still racing for their first wins of the season. The Trackhouse Racing driver Chastain, who holds a slim three-point edge on Joe Gibbs Racing driver Christopher Bell has not won since last April at Talladega, Ala. He finished seventh in both Kansas races last year.",
        "Harvick, driver of the No. 4 Stewart-Haas Racing Ford, is ranked third in the championship, 38 points off Chastain. He's not only tied for the most wins ever at Kansas, he has the most top-five (12) and top-10 (19) finishes and most poles (five) among active drivers and his 949 laps led is 100 more than anyone else on Sunday's grid.So, the big question is whether Harvick's positive history at Kansas translate into his first win of the year -- and first since last summer at Richmond. The 2014 NASCAR Cup Series champion, who is retiring at the end of the season, has five top 10s through the first 12 races of the season, but hasn't had one in the last three races and only two in the last seven.Last week's race winner Martin Truex Jr. is ranked fourth, now only two-points behind Harvick. His victory Monday at his hometown Dover (Del.) Motor Speedway the first for the Joe Gibbs Racing driver in the last 55 races.Certainly, the other three-race Kansas winner, Hamlin has to be considered a favorite this weekend. The driver of the No. 11 Joe Gibbs Racing Toyota is ranked seventh in the championship, 53 points out of the lead but only 15 points behind third place Harvick. He earned back-to-back wins at Kansas in 2019-20 and hoisted his first trophy there in 2012.",
        "It's been a bit of an up-and-down season for the perennial championship contender, but he has earned both of his top-five finishes in the last three races. His best work to date, a fourth place run at Martinsville, Va. three weeks ago.Hamlin is especially optimistic about Kansas considering he is part-owner of the 23XI Racing team that swept the trophies last year. The Joe Gibbs Racing team he drives for had all four cars finish in the top-six in the 2022 Spring race and three among the top-five in the fall race at the track.\"Kansas has been a great track for us the past few years, so I'm looking forward to this weekend,\" Hamlin said. \"I'm excited about how our 11 team ran and how well Toyota ran as a manufacturer there last year with all the JGR cars up front. We feel like this is an opportunity for us to put ourselves in contention and we'll just have to execute all day to give ourselves a chance.\"Practice for the AdventHealth 400 is set for 5 p.m. ET on Saturday with qualifying following - both televised on FS1.CRAFTSMAN TRUCK SERIESAfter a two-week layoff NASCAR's Truck Series returns to competition in Saturday night's Heart of America 200 (8 p.m. ET on FS1, MRN and SiriusXM NASCAR Radio) and the two winningest drivers in the track history will both be on the grid.",
        "Three-time series champion Matt Crafton and two-time NASCAR Cup Series champion Kyle Busch each have three Truck Series wins at Kansas. Either is a good bet to earn the wins-record solo after this week, although Saturday night's race does feature a robust five former winners in the field -- including defending race winner Zane Smith, Ross Chastain and Johnny Sauter. A win for Busch would mark a historic 100th victory for Kyle Busch Motorsports.Crafton's last series win actually came at Kansas Speedway in 2020. The veteran would love to end the winless streak he'd endured since and comes into the race ranked seventh in the championship with three Top-10 finishes in the opening seven races. When it comes to Kansas, not only is the driver of the No. 88 ThorSport Ford tops in victories, but he leads the series in Top-5 (seven) and Top-10 (14) finishes as well as starts (25) and laps competed (3,889) at the track.The series reigning champion Smith has proven to be especially strong at Kansas as well. He has top-10 finishes in all but one of his six starts there and since last year boasts six top-five finishes at the 1.5-mile tracks like Kansas - including a runner-up showing already this season at Las Vegas.",
        "With victories already at Daytona and Austin, Texas, the Front Row Motorsports driver Smith is ranked second in points, 36 points behind Ty Majeski, who is still racing for his first 2023 trophy but who's top-five (five) and top-10 (six) efforts in the opening seven races are best in the field. Majeski, driver of the No. 98 ThorSport Ford, has finished 11th or better in three of his four Kansas starts, including a runner-up showing to Zane Smith in this race last year.Toyota leads all manufacturers with 11 wins and has won at least one Kansas race in nine of the last 10 seasons. The Fall Kansas winner, John Hunter Nemechek - one of only three drivers to earn a Kansas victory from pole position - is not entered this week. No driver has ever won back-to-back Kansas races and there have been eight different winners in the last eight races.Of note, ARCA standout Tony Breidinger is hoping to pull double-duty this weekend and make her NASCAR Truck Series debut. The 23-year-old, who also competes fulltime in the ARCA Menards Series, is entered in the No. 1 Tricon Garage Toyota for the NASCAR Truck race. Should she make the field, Breidinger would become the first Arab American woman to compete in the series.",
        "Practice for the Heart of America 200 is set for noon on Saturday with qualifying following the session on FS1.--By NASCAR NewsWire, Special to Field Level Media"
    ]
}