{
    "articleURL": "/news/article-12038919/White-House-shuts-question-Bidens-seventh-grandchild.html",
    "content": [
        "The White House refused to answer why Joe Biden will not recognize Navy Joan, 4, as one of his familyIt came one day after Hunter Biden, 53, appeared in court in the long-running child support legal rowThe president's son says he needs to reduce payments to a former stripper and the mother of their child The White House brushed off questions about Hunter Biden's fling with an ex-stripper on Tuesday, refusing to say why the U.S. president will not recognize his seventh grandchild.",
        "DailyMail.com pressed Joe Biden's press secretary Karine Jean-Pierre as to why the commander-in-chief will not admit Navy Joan, 4, is Hunter's daughter.'I'm not going to speak on that from here,' the senior presidential aide said.",
        "The president told a student at 'take your child to work day' last week that he had just six grandchildren.'I have six grandchildren. And I'm crazy about them. And I speak to them every single day,' he said on the White House lawn.Biden then offered the audience of children a brief background on each of his six grandchildren.'They're crazy about me because I pay so much attention to them,' he bragged but did not mention Navy.Navy's mother, Lunden Roberts, 32, is suing the president's son in an Arkansas lawsuit in a row over unpaid child support for her daughter Navy.Hunter appeared in court on Monday where a judge ripped into him for redacting many of his financial records. 'The ability to redact is somewhat being abused,' Judge Holly Meyer fumed. 'I'm seeing a lot of things filed, especially by Mr. Biden's counsel, sealing things, redacting things, that are not confidential.'She suggested lawyers for the First Son's former squeeze should subpoena a downtown Manhattan art gallery to find out how much he has made from selling his art.",
        "They have been trying to find out how Hunter's finances have cratered while he's selling paintings for up to $500,000 apiece under his new guise as an abstract artist.Attorneys Clint and Jennifer Lancaster, a husband-and-wife legal team for Roberts, have also sought information on Biden's shady business dealings abroad, as well as his travel records. Roberts, a former stripper, won a reported $2.5 million settlement from Hunter after taking him to court in 2019.She also forced the ex-Navy reservist, booted out of the military in 2014 for testing positive for cocaine, to take a DNA test to prove he fathered their daughter, Navy Joan, during their 2017 fling.",
        "But the recovering drug addict abruptly reopened the case last September by claiming he had suffered 'a substantial material change' in his income and couldn't afford the payments.Roberts refused to buckle and raised the stakes by petitioning the court to officially rename her daughter Navy Joan Biden to 'benefit from carrying the Biden Family name,' a move Hunter dismissed as 'political warfare.'She also served Hunter with a sprawling discovery request covering everything from his business dealings in Ukraine and China to the names of the mystery art lovers who have paid hundreds of thousands of dollars for his beginner paintings.",
        "Roberts became pregnant about five years ago when she worked at a high-end Washington strip club.The girl was born in August 2018 and the initial paternity suit was filed in May 2019.It is the same month Hunter married his second wife, Melissa Cohen, with whom he now shares a young son, named Beau after his late brother who passed away in 2015 from brain cancer.Unlike 4-year-old Navy, the 3-year-old Beau is often photographed at the White House with both his father and president grandfather, most recently during the annual Easter Egg Roll."
    ]
}