{
    "articleURL": "/sport/football/article-12041541/Pep-Guardiola-tells-Arsenal-fans-happy-securing-four-finish.html",
    "content": [
        "Guardiola says Arsenal should be happy regardless of how the title race finishesThe Gunners have already achieved their pre-season target of a top four finish Man City will return to the top of the table if they beat West Ham on Wednesday Pep Guardiola has claimed Arsenal fans should be happy despite losing control of the title race, with the Manchester City boss insisting the Gunners have achieved the 'most important title' by qualifying for the Champions League.",
        "Man City struck a potentially decisive blow last week by beating Arsenal 4-1 at the Etihad.The Spaniard suggested that, while Arsenal fans will have been disappointed by the result, they should be happy with the club's season - regardless of the eventual outcome of the Premier League title race.Arsenal secured their place in the Champions League despite the 4-1 defeat and will play in Europe's top-tier club competition next season for the first time since the 2016-17 campaign. 'Arsenal have already achieved Champions League qualification after seven years,' Guardiola told Sky Sports.",
        "'Maybe the mood there is a bit down.'After seven years they won the most important title of the season for the club – to qualify next season for the Champions League.'Because financially, it is prestigious, new signings.'For many reasons it is the most important title, by far, and it is already there.'They lost the last game [against Man City] and they are sad, but I am pretty sure they have to be so happy because they make an incredible achievement.'Arsenal boss Mikel Arteta, Guardiola's former assistant, said this week that the club were not satisfied despite achieving their pre-season target.‘We are in the Champions League and everyone is still unsatisfied with the situation. This is what we need to move forward as a club and a team,' Arteta said.",
        "'We are Arsenal football club. We have to be here to win every single trophy. The demands have to be there.’",
        "Man City briefly moved to the top of the table for the first time since February by overcoming Fulham 2-1 on Sunday.The Gunners responded on Tuesday by earning a 3-1 home win against Chelsea to move back to the summit.Guardiola's side are two points behind Arsenal but the reigning champions have two games in hand on their challengers.City will reclaim top spot should they beat West Ham at home on Wednesday night."
    ]
}