{
    "articleURL": "/wires/reuters/article-12038923/Brazil-working-payment-solution-exports-Argentina-says-minister.html",
    "content": [
        "By Lisandra Paraguassu",
        "BRASILIA, May 2 (Reuters) - Brazil offered on Tuesday to help cash-strapped Argentina and provide support to Brazilian exporters so that they can continue to sell to the neighboring country, their main exporting market for manufactured goods.\"We are not discussing just helping Argentina. We need to help Brazilian businesses that export to Argentina, like China helps Chinese exporters,\" President Luis Inacio Lula da Silva said at a joint news conference with Argentina's Alberto Fernandez.Brazil's Finance Minister Fernando Haddad said earlier that the Brazilian government is working on a solution to ensure that Brazilian exporters are paid for sales to Argentina, which is currently facing a severe economic crisis and a shortage of U.S. dollars.More than 200 Brazilian companies have stopped exporting to Argentina or are not receiving payments due to the lack of foreign currency there, he said.Haddad emphasized that Brazil does not want to lose its export market share to Argentina, which is Brazil's third-largest trading partner after China and the United States.He said a solution \"necessarily\" involved granting collateral guarantees by Argentina that are being studied.Lula said he would ask Haddad to ask the International Monetary Fund (IMF) to help Argentina.He also said the BRICS group of leading emerging nations should change its rules so it can help non-member countries. Brazil will propose the group, through its New Development Bank, create a fund to provide the guarantees needed by Argentina, he added.",
        "Despite the scenario, Brazilian exports to Argentina surged 38% in April and 26% year to date, government data showed on Tuesday.Herlon Brandao, the director of Foreign Trade Intelligence and Statistics, highlighted that Argentina is a major soy producer but has been importing the product from Brazil to supply its processing plants for biofuel production.He also noted the growth in exports of auto parts and vehicles. Given that the two countries' automotive industries are integrated, \"there is an effort by businessmen to maintain the markets, wait to receive exported value, and also intra-company trade, which ends up being strong.\"In January, the two countries announced their intention to advance discussions on a common South American currency to be used in clearing houses to execute trade payments between the two countries, helping in part to trim reliance on the dollar.Brazil also decided to recently simplify procedures of the local currency payment system (SML), an infrastructure that brings together the central banks of Brazil, Argentina, Paraguay and Uruguay. (Reporting by Lisandra Paraguassu and Marcela Ayres; Editing by Stephen Coates)"
    ]
}