{
    "articleURL": "/wires/reuters/article-12040555/Indias-April-services-activity-hits-near-13-year-high-inflation-accelerates.html",
    "content": [
        "By Anant Chandak",
        "BENGALURU, May 3 (Reuters) - India's services activity expanded at the fastest pace in nearly 13 years in April, driven by robust demand, according to a private survey which also showed price pressures increased at their fastest rate in recent months.Strong growth in services, which make up around 60% of India's overall gross domestic product output, paints an encouraging picture for the South Asian nation's economic prospects, at least for the near term.The S&amp;amp;P Global India services Purchasing Managers' Index jumped to 62.0 last month from 57.8 in March, its highest since June 2010 and well above all forecasts in a Reuters poll which had predicted a fall to 57.0.It was above the 50-mark separating growth from contraction for a 21st straight month, the longest stretch of expansion since August 2011.\"India's service sector posted a remarkable performance in April, with demand strength backing the strongest increases in new business and output in just under 13 years,\" said Pollyanna De Lima, economics associate director at S&amp;amp;P Global Market Intelligence.\"Finance and Insurance was the brightest spot, topping the sectoral growth rankings for both measures.\"Along with robust domestic demand, international demand was strong as the sub-index rose to a four-month peak and business optimism hit its highest since December.",
        "However, employment generation in the services industry only saw a marginal uptick as most firms reported sufficient labour capacities to meet rising demand.Meanwhile, the input prices index was at a three-month high from a 2-1/2-year low in March and firms raised their charges at the fastest pace this year. The prices charged index rose to 53.5 from 52.4.\"Having retreated in each month since the start of the current calendar year, input price inflation quickened in April...Accommodative demand conditions facilitated the pass-through of additional expenses to clients.\"Rising price pressures, alongside an improving economic outlook, mean the Reserve Bank of India will likely lean towards keeping its key interest rate on hold rather than easing it anytime soon.The overall S&amp;amp;P Global India Composite PMI Output Index rose to 61.6 in April, the highest since July 2010, as activity in both manufacturing and services remained strong.(Reporting by Anant Chandak Editing by Shri Navaratnam)"
    ]
}