{
    "articleURL": "/wires/reuters/article-12050965/INSTANT-VIEW-Canada-gains-41-400-jobs-April-jobless-rate-holds-5-0.html",
    "content": [
        "TORONTO, May 5 (Reuters) - Canada's economy gained a net 41,400 jobs in April, entirely in part-time work and ahead of analyst forecasts, Statistics Canada data showed on Friday. The jobless rate held at 5.0%, beating forecasts it would rise to 5.1%.",
        "Employment in the goods producing sector grew by a net 6,300 jobs, largely in construction. The services sector was up by a net 35,200 positions, mostly in wholesale and retail trade, as well as transportation and warehousing.Market reaction: CAD/STORY:Linkhttps://www150.statcan.gc.ca/n1/daily-quotidien/230505/dq230505a-eng.htmCOMMENTARYANDREW GRANTHAM, SENIOR ECONOMIST, CIBC CAPITAL MARKETS\"Even though today's increase in employment was fairly narrowly based and driven by part-time work, the labor market is clearly stronger and tighter than we would have expected given signs of deceleration in economic growth to end Q1, which supports the continued hawkish tone from the Bank of Canada.\"DEREK HOLT, VICE PRESIDENT OF CAPITAL MARKETS ECONOMICS, SCOTIABANK\"The details weren't all that great but they continue to stay on the right side of the ledger. The serial pattern of too much bearishness toward Canadian and U.S. jobs continues. They keep surprising to the upside.\"\"I don't think this really matters to the Bank. I think they are focused upon the dance between financial conditions and inflation and how to strike a balance between the two and they are going to be on that pattern for a while yet I think.\"NATHAN JANZEN, SENIOR ECONOMIST AT ROYAL BANK OF CANADA\"The headline numbers are still quite strong but in the details, all the gains... were part-time jobs.\"",
        "\"There're some facts that labor demand is off under the surface, so job openings have been slowing for a while now. There are some signs there are cracks but it's still a really strong labor market.\"\"We still don't expect the Bank of Canada to hike rates again but also inflation is still firm. We still have an unemployment rate that is really, really low.\"\"We have a negative GDP growth starting in Q2 and into Q3 and I don't think that will change as a result of this data.\"(Reporting by Maiya Keidan, Fergal Smith Editing by Denny Thomas)"
    ]
}