{
    "articleURL": "/sport/tennis/article-12039077/MIKE-DICKSON-British-tennis-listen-Dan-Evans-not-putting-hard-yards.html",
    "content": [
        "Dan Evans says there's a soft underbelly to performance aspect of British tennisGB will not have a top 100 ranked women's player for the first time in 15 yearsMeanwhile, Carlos Alcaraz has become Rafael Nadal's superstar replacementWhen Dan Evans suggests that there may be a soft underbelly to the high performance aspect of British tennis it is worth having a listen.",
        "A broadly disappointing Madrid Open for the Brits has seen a solitary singles win, in contrast to twelve months previously, and there was just one player who attempted qualifying. As a result the 32 year-old Midlander wondered out loud whether enough players are getting out there on tour and learning their trade.Evans, the world number 24, has certainly learned his since he used to play against adults in the Birmingham leagues. After making his Futures debut in 2005 he has played 837 professional singles matches and gone on a journey like few others.For years he was an underachiever who lived on the wild side, but has come through that to establish a serious career. This despite his relative lack of physical stature in a sport increasingly dominated by strapping hulks. If, like in boxing, there was the benefit of particular weight divisions he might have had a world championship belt by now.Evans is also passionate about the British game and his experience and knowledge means that, one day, he should be a significant asset to it on the coaching side. Whether the Lawn Tennis Association would welcome someone who is, against the norm, willing to give an unfiltered view of how he sees things is open to question.",
        "His point at the weekend was that some players are simply not following the example of himself and particularly Cam Norrie, in doing the hard yards when it comes to international competition.The admirable Norrie was the only British singles winner in Madrid, and while he is British he can hardly be described as a product of the UK game. Moreover, next Monday, GB will not have a top 100 ranked women's player for the first time in fifteen years after Emma Raducanu drops her Madrid points.It is a fact that, in the intervening time, more than £500 million has flowed into the LTA's coffers just from the annual surplus made by Wimbledon.This really ought to be turned to an advantage. Yet it can also create a certain cosiness and jobs-for-life culture which is not conducive to producing players who have to battle against East Europeans and others, who compete as if their next meal depends on the outcome of every match.British prospects often fall down in the transition period that comes after showing promise as a junior. Do all singing and dancing national academies, or Roehampton's swish National Training Centre - said to be eerily quiet on a Friday as staff work from home - prepare people to hustle for points in places like Tunisia and Uzbekistan?",
        "The support network in areas such as sports science and medicine for those earmarked as elite prospects is meant to be all-encompassing. Yet GB players seem to get injured at least as much as those from other countries with far fewer resources.These matters come into sharper focus after a recent run for the higher performing Brits which has seen more withdrawals, defeat at the Billie Jean King Cup, a singles wipeout at the Miami Open and only Norrie preventing the same thing happening in Madrid.The LTA can reasonably point to its roster of Grand Slam champions in singles and doubles events over the past ten years - thanks to the outliers Murray and Raducanu - but the gold standard is producing a volume of elite singles players, and that remains elusive.",
        "GB has seven men and women in the top 200. Australia has eleven and seven in the same bracket, France 20 and 12. Non-Grand Slam host Italy has a whopping 22 in that men's category.Producing top pros is not easy in a global individual sport, and there is no doubt that the situation in the UK has broadly improved. There was not always a clutch of six women within sight of the top 100, and four men in the top sixty. There is a smattering of far-off junior standouts and more immediately Jack Draper - who may still be growing into his height - could be a stellar talent in the works.",
        "But there have been more setbacks than anticipated so far this year, and it is timely for Evans to bring up a few inconvenient truths. You will not find them reported by the LTA's extensive social media operation, but that does not mean they should be ignored.Rafael Nadal's superstar replacement Carlos Alcaraz Rafael Nadal's absence has been keenly felt in Madrid, although the Spanish are lucky to have a ready-made superstar to replace him in Carlos Alcaraz. At the time of writing there was no official word about whether the great clay-courter will be there to defend his crown at Roland Garros this year. The word around the Caja Magica, however, was encouraging on that score. A few people generally well acquainted with the tightly-knit circle around Nadal are optimistic that he will be in Paris, and quite likely in Rome next week.",
        "Emma Raducanu snub is an exception 'You aren't the story' is among the better mottos for journalists to live by, although very occasionally there are unavoidable exceptions to the rule. One such example was being caught up in last week's awkward non-interview with Emma Raducanu, during which myself and a colleague became the butt of frustrations she is feeling right now. Given the attention around her the episode attracted a mass of comment, from former Grand Slam champions to the usual anonymous keyboard warriors.",
        "I could have sworn there were only four people present (self, Telegraph colleague, Emma and a WTA staffer) to experience the full context of what happened, but it turns out there may have been several thousand.",
        "One theme among the commenters was the idea of her relentlessly facing the same questions from the same journos. It was therefore an interesting afterthought to consider just how many formal interactions/press conferences the UK tennis media have had with the 2021 US Open champion in recent times. The answer in my case - and it will not be much different for any of the group who turn up regularly on the tennis beat - is that there have been four of these with Raducanu in the eight months since August 30 last year. Dealing with the media, especially after a loss, is not always an unalloyed pleasure, but still.",
        "Life on Tour: Visiting Madrid  Life On Tour: If you really want to be in a city that never sleeps then modern Madrid probably tops New York, which is a tamer place these days, especially since the pandemic.Madrid can be a dangerous place in the sense that it is probably the bar capital of the world, excellent value and runs to hours which accommodate even the 24/7 nature of modern tennis events.",
        "Unmissable is centrally-located nugget La Venencia, which has survived all of Spain's upheavals in the past 90 years and whose decor is unchanged since the 30s, serving only sherry, tapas and water. It is now widely discovered, though, and can get overrun at peak times. If that's the case you can always nip round the corner to Mucho, which has a contrastingly sleek and modernist look, and is a very welcoming spot offering tequila and interesting orange wine."
    ]
}