{
    "articleURL": "/wires/reuters/article-12046081/MORNING-BID-AMERICAS-Hike-hold-bank-angst-Apple.html",
    "content": [
        "A look at the day ahead in U.S. and global markets from Mike Dolan If the Federal Reserve needs more information on what to do for its next move on interest rates, relentless stress in regional bank shares again this week may yet figure highly.",
        "As the Fed delivered what markets assume will be the last rate hike of a brutal 13-month, 500-basis-point tightening cycle, further aftershocks from the March bank blowups reverberated in the background.Seeking a potential sale or further capital raising, Los Angeles-based PacWest is the latest in the crosshairs - with its stock losing more than 50% on Wednesday and a further 40% overnight.Even though Fed supervisors remain on high alert, the central bank's monetary policymakers insist they focus only on how the stresses affect credit to the wider economy. And given they had advance knowledge of next week's quarterly loan survey before Wednesday's rate decision, it suggests the bigger picture they see remains somewhat equivocal.\"We're closer, or maybe even there,\" Fed chair Jerome Powell said of the end of the tightening cycle - after the Fed dropped from its statement wording that it \"anticipates\" more hikes.But Powell continued to insist the standing Fed view that no rate cuts are likely this year and it was still just as likely the U.S. economy dodged recession as not - underlining the tension with markets that currently see 75bps of cuts by December.With the European Central Bank, the world's second most important monetary authority, set to deliver a similar quarter-point rate rise later on Thursday - and as the biggest U.S. company Apple reports earnings after the bell tonight - edgy world markets remain in two minds about what happens next.",
        "Awaiting both those events, S&amp;amp;P500 stock futures held steady early Thursday despite a late post-Fed selloff in the cash market yesterday that clocked a 0.7% drop on the day.The VIX index of implied volatility crept higher to 19, back around its 30-year average.Two-year Treasury yields ebbed further, hitting their lowest in a month at 3.8%. Crude oil prices steadied after a blistering 3-day rout that has year-on-year declines running close to 35%.Gold rose to within a whisker of 2020's record high amid simmering geopolitics following Wednesday's drone attack on the Kremlin, the bank tension and the U.S. debt ceiling standoff - with the Swiss franc hitting its strongest levels against the dollar since January 2021.European stocks were down about half a percent ahead of the ECB decision, with the euro easing back a touch from 1-year highs about $1.11. Norway's central bank raised interest rates as expected and signalled more to come.In macro news, and in line with the Fed's equivocation on recession ahead, U.S. private sector hiring was much bigger than expected in April. The full national payrolls report is due on Friday. On the other hand, China's manufacturing activity slipped back into contractionary territory last month too.With Apple dominating the day's earnings diary, some 342 firms in the S&amp;amp;P500 have now reported Q1s and the aggregate annual profit drop is now estimated at just 1% versus pre-season forecasts for a fall of 5%.",
        "Advanced Micro Devices shares fell 9.3% after the chipmaker forecast quarterly sales below estimates due to a weak PC market. Events to watch for on Thursday: * European Central Bank policy decision, statement and news conference * U.S. first quarter unit labor costs and productivity, April layoffs, March trade balance, weekly jobless claims. Canada March trade balance * U.S. corp earnings: Apple, ConocoPhillips, AIG, Booking, Consolidated Edison, Regeneron, Shopify, ICE, Moderna, PG&amp;amp;E, Paramount, Expedia, Lyft, Peloton, Alliant Energy, Monster Beverage, Microchip Technology, Motorola Solutions, Vulcan Materials, Kellogg, PPL, Royal Caribbean Cruises, Borgwarner, Stanley Black &amp;amp; Decker, Sempra Energy, Constellation Energy etc(By Mike Dolan, editing by Christina Fincher; mike.dolan@thomsonreuters.com. Twitter: @reutersMikeD)"
    ]
}