{
    "articleURL": "/health/article-12046941/My-brain-exploded-SNEEZED-Alabama-man-26-needed-surgery-blood-clot-burst-skull.html",
    "content": [
        "Sam Messina, 26, was lying in bed when a sneeze caused him to suffer a strokeDoctors diagnosed him with a rare condition which causes tangled blood vesselsREAD MORE: Doctors perform world-first brain surgery on babyAn Alabama man suffered a dangerous brain bleed after a sneeze caused a blood clot to rupture in his skull.",
        "University student Sam Messina, 26, was lying in bed in September 2016 when he let out a sneeze and suffered a stroke.The pressure of the sneeze caused blood to shoot out of his nose, which set off a stroke and caused him to pass out a few minutes later.Mr Messina had to undergo three surgeries in the space of a week to remove the blood clot and thankfully made a full recovery.",
        "Doctors discovered a deadly aneurysm and he was diagnosed with arteriovenous malformation (AVM), a condition that causes a tangle of the blood vessels that connect arteries and veins in the brain. The arteries and veins can rupture, causing bleeding in the head.'I was in the middle of thriving in college after starting my junior year when I was lying in bed, and I sneezed,' Mr Messina said.'And when I sneezed, I basically had an aneurysm. I had a blood clot – a condition where I had a blood clot in my brain that doesn't rupture until your 20s.'He said: 'My brain pretty much exploded and the clot came out of my nostrils.",
        "A woman was shocked to learn a spot on her hip she thought was a birthmark was a deadly cancer. ",
        "'It caused me to have a stroke as well, so I passed out and pretty much should have died.'",
        "He added: 'But since I sneezed it was the most peaceful way for this thing to rupture.'When I sneezed, before passing out, I managed to scramble for my phone.'I called my mom, who called my girlfriend, who ended up getting me out of my apartment and to the hospital.'Doctors soon realized Mr Messina had a bleed in his brain and he was immediately rushed to another hospital for further treatment and surgery.Mr Messina said: 'It was terrifying but I knew if that was what needed doing, I’d have to do it.'He dropped out of school to have the surgery and was in hospital for a week. Mr Messina had 27 staples put in, then recovered in bed at home for a month before having the staples removed.He said: 'It was a really weird time. All I could think of was how to get my life back on track.'The pressure caused by a sneeze can lead to the rupturing of a brain aneurysm.In most cases, people are born with AVM, but they can appear shortly after birth or later in life. Sometimes they are even passed down through families. Doctors are not sure what causes them.AVMs are thought to affect approximately 1.4 in every 100,000 people. ",
        "Arteries transport oxygen-rich blood from the heart to the brain, while veins take oxygen-depleted blood back to the lungs and heart.An AVM in the brain is disturbs this vital process. AVMs can occur anywhere in the body but usually happen to the brain and spinal cord, but overall, brain AVMs are rare.Some people with a brain AVM can suffer headaches or seizures. It is often not discovered until after a hemorrhage — when the blood vessels rupture and bleed.",
        "An arteriovenous malformation (AVM) is a specific term used to describe a tangle of blood vessels with abnormal connections between arteries and veins.High-pressure arteries containing fast-flowing blood are directly connected to low-pressure veins, which normally only contain slow-flowing blood.This means that blood from the arteries drains directly into the veins - without stopping to supply the normal tissues in that part of the body with essential substances like oxygen and nutrition.Over time this can lead to the normal tissues becoming painful or fragile.It also means that the AVM gets progressively larger over time as the amount of blood flowing through it increases, and it can cause problems due to its size.Finally, it may also mean that the heart has to work harder to keep up with the extra blood flow.Some doctors describe an AVM as 'a ring road that bypasses the high street of a town'.Traffic (or blood) will use the bypass rather than the high street which suffers as a result.Source: Great Ormond Street Hospital "
    ]
}