{
    "articleURL": "/wires/reuters/article-12043697/From-Cameroon-MVP-Joel-Embiids-journey-reaches-zenith.html",
    "content": [
        "After back-to-back seasons of being the runner-up for the NBA's most coveted individual award, Joel Embiid finally is the owner of an NBA MVP trophy.",
        "The Philadelphia 76ers center had downplayed the possibility in recent weeks but it is the clear the award he won on Tuesday night is meaningful for the 29-year-old from Cameroon.\"It's hard to win this league; it's hard to be successful in this league,\" Embiid said after Philadelphia's shootaround in Boston, hours ahead of Wednesday's Game 2 of the Eastern Conference semifinals against the Celtics.\"There's a reason why these are the best basketball players in the world. And to be sitting here and feel like I won something as far as the Most Valuable Player is great. But then again, it's also part of my story because I've always felt like I was a role model -- especially to my Cameroonian people and my African people -- and I feel like, just looking at my story, they can look at it and be like, 'Wow, he did it.'\"Being the best player in the NBA wasn't on the goals list when Embiid first start bouncing an orange basketball.\"Probably the probability of someone like me, starting playing basketball at 15, to get the chance to be the MVP of the league is, I'd say, probably negative zero,\" he said. .\".. We don't have a lot of opportunities back in Africa in general to get to this point. But improbable doesn't mean impossible, and you can accomplish anything you set your mind to. As long as you believe in it, and you know, keep working hard, anything can happen.\"",
        "Embiid was superb in the regular season and averaged 33.1 points to lead the NBA in scoring for the second straight season. He also averaged 10.2 rebounds and 4.2 assists in 66 games.After the close calls where he fell short against Denver Nuggets star Nikola Jokic the past two seasons, Embiid received 73 of the 100 first-place votes this time around to finish well ahead of second-place Jokic and third-place Giannis Antetokounmpo, another two-time winner, of the Milwaukee Bucks.Now the player who missed his first two seasons due to foot injuries, has etched his name into NBA lore. He joined former Houston Rockets star Hakeem Olajuwon (1993-94) as the lone players from Africa to win the award.\"I went through a lot, and that's just a validation that the sacrifices and everything you went through, it's paying off in some ways,\" Embiid said. \"Obviously, winning a championship is going to be way better, and we have that opportunity. But I'm just competitive.\"I want it all. I want to win everything that I can get my hands on, and everybody around me knows that. ... I know I've always said I don't care (about MVP), but it was just for you guys to leave me alone and not ask me questions about it. But I do care in the way that it validates all the work that you put in. And just to be sitting here, it's amazing.\"",
        "Embiid gave credit to 76ers star James Harden, the 2017-18 MVP for the Rockets. The three-time scoring champion has made adjustments in his game to mesh with Embiid and the partnership is thriving in their first full season as teammates.\"I think since he's been here, he won't tell me, but I think he kind of made it his goal for me to be the MVP,\" Embiid said of Harden. \"He's given up a lot. I've always said he is the best playmaker I've ever played with, and he's the best playmaker probably in the NBA.\"He was just extremely happy for me, just like all (of my teammates) were. And that meant a lot for me. That meant a lot to me to know that your teammates care about you as much as I care about them.\"Embiid missed the first game of the playoff series with the Celtics due to a knee injury and is listed as doubtful for Game 2. But he said he hasn't given up hope of playing Wednesday night.The 76ers won Game 1 without him, 119-115 in Boston.--Field Level Media"
    ]
}