{
    "articleURL": "/wires/reuters/article-12038825/Group-EU-states-seeks-reduce-dependency-China-pharmaceuticals.html",
    "content": [
        "By Julia Payne",
        "BRUSSELS, May 2 (Reuters) - A group of 19 European Union member states are pushing for measures to reduce the bloc's dependency on Chinese imports of pharmaceutical ingredients, a paper dated May 2 showed.The move comes a week after the European Commission proposed an overhaul of the legislation governing its 136 billion euro ($148 billion) pharmaceuticals industry.The Commission's proposed bill aims to revive investment, reduce shortages and boost access to affordable drugs at a time when health budgets have been drained by the costs of treating COVID-19.However, the countries backing the paper - including Belgium, France, Spain and Germany - want the EU to take more \"drastic steps\" to shore up Europe's security of supply for vital drug ingredients with a Critical Medicines Act.The countries are concerned about the global reliance on China for key ingredients and a handful of manufacturers. Less than five sites manufacture more than 50% of the ingredients that meet European standards.\"The EU is becoming increasingly dependent on imports from a few manufacturers and regions...In 2019, globally more than 40% of APIs (Active pharmaceutical ingredients) were sourced from China,\" the paper said.\"Furthermore, almost all API producers depend on China for intermediate inputs.\"The Commission is aiming to put a list of critical medicines that will require more monitoring to ensure shortages are avoided across the bloc.",
        "\"For these medicines, the supply must be monitored, the global value chains must be mapped and (potential) suppliers and vulnerabilities identified,\" the paper said.The list should start with those medications that have repeatedly been in short supply, it said.The countries would also like to see measures that allow EU member states to rely on each other in \"extreme cases where no alternative suppliers or medicines can be found\". (Reporting by Julia Payne; Editing by Angus MacSwan)"
    ]
}