{
    "articleURL": "/news/article-12040877/Crystal-Brook-shooting-cop-fighting-life-horror-stabbing-coma.html",
    "content": [
        "Sean Ferris, 52, shot dead after stabbing two copsBoth in induced comas while one is said to be fighting for life They had been paying Ferris a visit over complaints about his dog Footage has emerged of Ferris screaming at residents  A dog owner who was shot dead after stabbing two police officers was filmed screaming and threatening other residents over his 'aggressive husky' less than a day before his frenzied attack. ",
        "Footage has emerged of the man, who has been named as 52-year-old Sean Ferris, shouting at people about his dog - a husky called Buddy - outside a supermarket in the small town of Crystal Brook, in South Australia's mid north, on Tuesday.Ferris tells them he is 'sick of a**eholes like you whinging about my dog and causing me trouble'.Within 24 hours a police officer would be left fighting for his life and another in an induced coma after visiting the man's property over the altercation.  Brevet Sergeant Ian Todd, 53, and Brevet Sergeant Jordan Allely, 32, were stabbed by the man after attending his home for a welfare check at 10.15am on Wednesday.It is unclear what exactly happened but the officers were left with serious knife wounds before Ferris was shot and killed at the scene. ",
        "Brevet Sergeant Todd sustained life-threatening injuries after being stabbed in the neck, arm and hands, while Brevet Sergeant Allely suffered knife wounds to his right leg and arm.Both men are in medically-induced comas at Royal Adelaide Hospital.Ferris had had a few run-ins with the police, having been arrested for refusing to wear a mask in November 2021, according to The Advertiser.On the same day he was arrested for assault and disorderly behaviour and later charged with hindering police.",
        "Police eventually dropped the assault charge and Ferris pleaded guilty to breaching Covid restrictions, disorderly behaviour and hindering police.  He was ordered to pay costs and had no further penalty imposed after the magistrate took into account the time he had spent in custody following his arrest.Police Commissioner Grant Stevens revealed that the officers were paying Ferris a visit following a 'disturbance' at the local supermarket on Tuesday. 'There was a minor disturbance at the local supermarket in Crystal Brook,' he said.'The police officers were following up as a result of that incident.' He later described the incident as 'relatively benign' but said it warranted the police to follow-up.",
        "It now appears that the incident was caught on camera by a local resident. Footage, first published by The Advertiser, shows Ferris yelling at another man outside the Foodland while holding a husky and what appears to be a walking stick.'You're the one causing me trouble, (unintelligible) try and do your job,' the man can be heard saying, before shouting: 'Leave me alone'.'I'm sick of a**eholes like you whinging about my dog and causing me trouble … don't tell me what I should do with my life.'   Crystal Brook resident Tom Sawyer witnessed the altercation and said he had heard elsewhere that the man had threatened someone with a knife.",
        "'I heard that in passing today,' he told The Advertiser. 'People would get frustrated with the dog, it would make a lot of noise but I never saw it get aggressive.''He was a nice guy whenever I talked to him.'He'd go down to the shops once a day and then have his lunch under the rotunda … (then) he'd come down again in the afternoon and walk his dog along the trails around town.'",
        "However, there were multiple reports of him confronting strangers with his walking stick and also threatening to unleash his husky.Commissioner Stevens said the shocking incident had devastated the tight-knit police community in Crytsal Brook and the surrounding area. 'Ian has a son-in-law who is the officer in charge of Kadina police station, while Jordan's partner is a constable and his father is also a police officer and the officer in charge of Hallett police,' he said.'So as you can appreciate, there are family members who are directly involved in terms of the impact of this particular incident both as family members and also as police officers.'The police commissioner also revealed that a local resident had provided aid to one of the injured officers during the incident.'We're very grateful for that person stepping forward and providing critical support,' Comm Stevens said.",
        "Comm Stevens praised the first responders. 'In all likelihood (ambulance officers') swift actions very likely saved the life of at least one police officer,' he said.Officers from the Forensic Response Section were seen outside the house in white hazmat suits analysing the crime scene.Major Crime Detectives and the officers from the Internal Investigation Section were also attending the scene, with police cars lining the streets.",
        "A local shop owner who did not wish to be identified said Ferris had been in to buy his weekly lotto ticket before the attack occurred.The shop owner said people had been complaining about the dog for 'some time'.'It was a very aggressive dog, both in his front yard and when it was tied up out the front of shops in the main street,' they told The Advertiser.'I actually felt sorry for the dog because it would get quite anxious when it was tied up.'The shop owner said Ferris had been living in the area for about five years.'He kept to himself, when he came into the shop he was always very pleasant and polite,' they said. Another Crystal Brook shop worker called Chloe said she had just served Ferris before the incident unfolded.'I served him probably just over half an hour before the incident took place … I'm in shock,' she told FIVEaa.",
        "'It was just a normal interaction with him. He has come in the past a few times a bit on edge after a few incidents with his dog but this was just a normal morning and he seemed very happy and we were just chatting about the rain and how it takes him so long to dry his dog because of how big he is.'Not long after we found out there was a siege down the street where he lived.''It was pretty scary and hard to hear – these things don't happen in your small country town very often. We serve him daily, it's not nice to hear.'Police Association president Mark Carroll said the incident was a reminder of the dangerous of working on the force. 'This is a horrifying reminder of the levels of extreme violence front-line police officers face in the line of duty,' he said.'Details about this tragic incident are scarce at the moment, but we do know that both officers are badly hurt, and one is in a serious condition in hospital.'The Police Association is currently providing support to both the impacted officers and their families.'Premier Peter Malinauskas has been briefed on the incident.  'Our frontline police do an inherently difficult and dangerous job each day when they go to work,' he said. ",
        "'They exercise this duty with courage and bravery. My thoughts, and I'm sure those of all members, are with these two officers and their families.'"
    ]
}