{
    "articleURL": "/wires/pa/article-12044757/Men-facing-jail-trying-sell-undeclared-Anglo-Saxon-coins-abroad.html",
    "content": [
        "Two metal detectorists are facing years in jail after being found guilty of hatching an illegal plot to sell Anglo-Saxon coins of “immense historical significance” abroad.",
        "Craig Best, 46, and Roger Pilling, 75, were convicted of conspiring to sell criminal property worth £766,000 – namely ninth century coins believed to have been buried by a Viking and which have never been declared as Treasure, and have not been handed to the Crown.The defendants will be sentenced at Durham Crown Court on Thursday after they were also convicted of separate charges of possessing the criminal property, which was thought to be part of a larger, undeclared find known as the Herefordshire Hoard.After the trial last week, Judge James Adkin told the pair: “You have both been convicted of what I consider to be compelling evidence of serious criminality, in relation to these artefacts.",
        "“You are both aware of what the sentence is likely to be, imprisonment for years.”Best, of South View, Bishop Auckland, was arrested with three coins at a Durham hotel in May 2019 in a police sting operation.Best thought he was meeting a metals expert, employed by a broker working for a wealthy US-based buyer, but was, in fact, speaking to an undercover detective.Pilling, who owned an engineering business, was arrested at his home in Loveclough, Lancashire, and a further 41 coins were seized.These 44 coins originated from the Herefordshire Hoard, discovered in 2015, worth millions of pounds, and which was also not declared.",
        "Four people have already been convicted for their roles in concealing that find.The undercover police operation was set up after Best tried to sell coins to a real American collector, who then contacted UK-based experts about the apparent availability of extremely rare and valuable examples, and the authorities were alerted.It was believed the coins were made between 874 CE and 879 CE and were buried by a Viking during this particularly violent period of English history.They included two extremely rare examples of two-headed coins, showing Alfred of Wessex and Ceolwulf, a figure who was discredited by Saxon writers as a Viking puppet ruler."
    ]
}