{
    "articleURL": "/sport/football/article-12053869/Osasuna-fell-tier-face-Real-Madrid-Copa-del-Rey-final.html",
    "content": [
        "Osasuna's sole Copa del Rey final appearance was a defeat to Real Betis in 2005 Club captain David Garcia was in attendance in Madrid as a 10-year-old boy Ex-Real Madrid boss Arsenio Iglesias dies aged 92 after 41 years in the dugout Wherever you looked, they were there. Red shirts filled the streets of Seville, from the grand plazas around the Catedral and Alcazar down to the banks of the River Guadalquivir, Osasuna fans painted this city in their bright colours.",
        "At an open training session, red flares filled the sky one day out from a second date with destiny. Osasuna have played in a Copa del Rey final before - they were edged out by Real Betis in 2005, part of a glory era for the club - but this time is different.The journey in the 18 years following that day at the Vicente Calderon has been long and arduous. As nearly 25,000 Osasunistas descend on La Cartuja, and thousands more pack out Pamplona’s Plaza del Castillo to watch on big screens, fans recall their last mass movement.Not eight years ago, Osasuna fans travelled to Sabadell knowing their team needed to draw to avoid relegation from the Segunda division, and with it possibly devastating consequences. They came from two goals down to equalise in stoppage time.",
        "‘In the Nova Creu Alta, 3,000 rojillo fans gave the team the strength to equalise in the last minute,’ president Luis Sabalza told The Athletic this week. ‘Thanks to them, we are here today. A club like Osasuna can never forget where it came from.‘I consider myself a naturally optimistic person, but never in my wildest dreams could I have imagined being here preparing for this. There will be at least 24,000 of our fans at La Cartuja, the biggest mass movement of Osasunistas in history.’",
        "At that moment, the club was in £70.1million (€80m) debt and the local electric firm threatened to cut off its supply, with taxes also unpaid. A match-fixing scandal, Caso Osasuna, saw five directors handed prison sentences for their involvement.Since then, Osasuna have had two promotions. They came up and went straight back down, with fans blaming the strategy of using the LaLiga broadcast funds to pay off debts. Finances are more steady now, though, with the club in its fourth straight top-flight season.Osasuna - a word which means ‘health’ or ‘strength’ in Basque - relies heavily on youth development. They are the only professional club in Navarra, the region in between the Basque Country and Aragon.They do not have a free pass on players, with huge historic clubs like Athletic Club Bilbao and Real Sociedad to the west, and Barcelona having a heavy scouting network in the region, but the Rojillos have a rich academy tradition.David Garcia, the club captain, watched their only previous Copa final from the stands in Madrid as a 10-year-old boy. ‘For me this game means everything, it is the most important match of my career,’ he said on Friday.",
        "‘It was a bittersweet taste, but I remember the atmosphere and so many years later, being here and playing in the final, imagine how excited I am!’",
        "Osasunistas are widely regarded as the loudest fans in the country - a Spanish record 115.17decibels was recorded at El Sadar when they beat Real Madrid in 2009 - and their supporters brought a unique noise to the Andaluscian capital, arriving in their masses on Friday.The club are billing this final as David versus Goliath, in terms of both budget and the fact that Real Madrid are searching for their 20th Copa del Rey and 101st trophy in total, a figure which dwarfs four Segunda titles.So as red flares fill the streets of Seville and Estadio La Cartuja on Saturday, Osasuna will remember that day they descended on Sabadell. As one club-organised billboard read: ‘Every happy story has a starting point – ours was Sabadell.’"
    ]
}