{
    "articleURL": "/news/article-12044563/Maid-honor-bride-killed-drunk-driver-25-says-furious-drunk-driver.html",
    "content": [
        "Ashley Favret was maid of honor at Samantha Miller's wedding to Aric Hutchinson She said that the wedding had gone perfectly up until that point and called the decision to drive drunk by Jamie Komoroski 'stupid''She brought light to pretty much everywhere,' Favret said. 'I miss her. I don't know what I'm going to do without her' The maid of honor of a newlywed woman killed by a drunk driver just hours after her wedding said she was heartbroken and furious at the events that led to her best friend's death.",
        "Samantha Miller, 34, and Aric Hutchinson, 36, celebrated their nuptials moments before they were allegedly rear-ended by Jamie Komoroski, 25, at Folly Beach, South Carolina, on Friday. Maid of honor Ashley Favret said that the wedding had gone perfectly up until that point and that she can't believe a drunk driver killed her best friend.'It makes me angry. A stupid decision because of alcohol cost her life,' Favret said. Favret added that up until then, Miller's wedding 'was everything she had dreamed for that day to be.' ",
        "Noting that Hutchinson had lost the love of his life, Favret referred to Miller as a soulmate and doesn't know how to go on without her best friend of over 15 years.'She brought light to pretty much everywhere,' Favret said. 'I miss her. I don't know what I'm going to do without her.' Heartbreaking pictures showed the happy couple moments before tragedy struck, beaming as they were waved off by their guests with sparklers.The 'sweet' newlyweds and two other occupants of the buggy were inside the vehicle when it rolled several times over 100 yards, killing the bride instantly.Komoroski was allegedly traveling at 65mph in a 25mph zone and was drunk behind the wheel of a rented Toyota Camry, according to Folly Beach Police.",
        "Aric has been left in critical condition, according to a GoFundMe page set up by his mother, Annette Hutchinson.It is unclear if the groom is aware that his wife has died, as he has been in a critical condition since the incident.  He has had one reconstruction surgery and is set to have another, as well as suffering numerous broken bones and a brain injury.",
        "Sam and Aric were being escorted by his brother-in-law Ben Garrett and nephew Brogan when they were allegedly hit by Komoroski. Ben was also seriously injured.A family member confirmed that Brogan was released on Sunday, and is recovering despite being 'banged up and sore'.The GoFundMe has raised more than $626,000 with Anette writing: 'I was handed Aric's wedding ring in a plastic bag at the hospital, five hours after Sam placed it on his finger and they read each other their vows. Aric has lost the love of his life.'The couple made their home in both the groom's home state of Utah and the state of South Carolina. The bride is from North Carolina.'The groom graduated from Bonneville High School in South Ogden, Utah and played college football for Snow College and Utah Tech.'",
        "Charleston County Coroner's Office confirmed that Sam died on scene from blunt force injuries sustained in the crash. ",
        "Her friends paid tribute to the bride, calling her 'one of the kindest people', saying of the couple: 'Nobody deserves this but especially not Aric and Sam, a dream couple that brought so much life, laughter and spice into life.'Another added: 'I'll never forget when she interviewed for her job at the office we asked her where she saw herself in 10 years. 'Her answer, without missing a beat, was married to the love of her life and a mom.'That was all tragically taken by one careless individual on the night her dream was just beginning.'Andrew Gilreath, director of the Folly Beach Public Safety Department, said the golf cart — a six-person, low-speed model with a maximum speed of 25 mph — was legal to drive at night.",
        "Folly Beach Police Department confirmed that the incident took place at around 10pm, on the 1200 block of East Ashley Avenue.Komoroski was the sole occupant of the vehicle when she rear-ended the cart and has been charged with three counts of felony DUI resulting in great bodily harm or death and one count of reckless homicide.The Logistics Account Executive remains in custody at the Sheriff Al Cannon Detention Center and is set to appear in court in connection with the incident in June.",
        "She could face up to 25 years in prison for the death of the bride, as well of a fine of up to $25,100, and an additional 15 years and $10,100 for the serious injury caused to the men in the buggy.For the reckless homicide she could be handed a sentence of 10 years in prison, and a fine of up to $5,000 – as well as having her license revoked for five years on her release."
    ]
}