{
    "articleURL": "/tvshowbiz/article-12061287/Love-Islands-Chloe-Burrows-shares-kiss-Gogglebox-star-Joe-Baggs-celebrates-birthday.html",
    "content": [
        "Chloe Burrows took to Instagram on Monday to share a snap of her planting a snog on Joe Baggs to celebrate his 25th birthday.",
        "The Love Island star, 27, posted a picture to her Instagram Story of her kissing her close pal while laughing.She captioned the post saying: 'Happy birthday to the most gorgeous boy ever!! Have the best day@joebxggs.'She added: 'Ps we're bezzie mates before anyone wants to say anything scandalous x.'Joe is known for starring on Gogglebox alongside his family for two years and is openly gay.",
        "He currently has a podcast with his brother George Baggs called Not My Bag, which Chloe has appeared on.The post comes after Chloe appeared to accidentally confirm her best friend Millie Court has reunited with her ex-boyfriend Liam Reardon.She shared a video on her TikTok account which showed her and Millie ordering a Chinese takeaway.As Chloe filmed, Millie was heard asking a mystery man for a drink. His voice was muffled at first, with Millie responding: 'Yeah, I'll have a Coke Zero please'.Then, a voice sounding just like Liam said: 'Chlo?' to which she replied: 'Yeah go on then,' before doing an imitation of a Welsh accent. Fans quickly voiced their suspicions it was Liam in the clip, with one user writing: 'Thanks for the confirmation Chlo'.Another said: 'The confirmation we all needed. Thanks chlo'. A third user added: 'That is def Liam we have the same accent we're from the same town, I know a Merthyr accent when I hear one.'",
        "It comes after MailOnline exclusively revealed Liam and Millie had reconciled nine months after splitting.  The couple, who ended their relationship in July after a year together, were spotted enjoying a secret romantic weekend together over the Easter break.Millie and Liam spent the Bank Holiday in the Lake District, making the most of the countryside and having a cosy takeaway on Saturday evening.",
        "Following the breakdown of their romance a year after they won Love Island in 2021, Liam went on E4 show Celebs Go Dating, while Millie has recently been rumoured to be dating Gogglebox star George Baggs.However, a source close to the pair has told MailOnline that the couple have been talking again, meeting up in secret and are working through their previous issues.An insider said: 'Millie and Liam have been talking again, but it's early days for them.'They weren't expecting to get back together after their breakup was so painful for them both, but months have passed, and they still couldn't stop thinking about each other.'Coming out of Love Island was a whirlwind and now they're just looking to take things slowly and see if they can rebuild their relationship, which may take some time.'",
        "The couple were seen arriving at a Domino's in Windermere where they collected their takeaway pizza together.",
        "Attempting to go unnoticed, Liam wore his hood up as he exited his Audi while Millie wore jeans and a hoodie with trainers, as well as her designer sunglasses.Millie posted about her 'wholesome' Easter weekend on Instagram, sharing photos from the couple's reunion, including snaps from romantic countryside walks.After winning Love Island, Millie and Liam lived together in Essex but went their separate ways after splitting."
    ]
}