{
    "articleURL": "/wires/reuters/article-12042213/US-STOCKS-Wall-St-poised-higher-open-ahead-Fed-meeting-outcome.html",
    "content": [
        "Regional banks slip again",
        "Fed decision at 2 p.m. ETAMD slumps after weak forecastFutures up: Dow 0.13%, S&amp;amp;P 0.23%, Nasdaq 0.23%(Updates prices throughout)By Ankika Biswas and Sruthi ShankarMay 3 (Reuters) - Wall Street's main indexes were set to open higher on Wednesday after a selloff in the previous session, with investors awaiting more economic data ahead of the outcome of a Federal Reserve policy meeting later in the day.Major U.S. stock indexes dropped more than 1% on Tuesday as regional bank shares tumbled on renewed fears over the financial system and as investors tried to gauge how much longer the Fed may need to hike interest rates.Regional lenders such as PacWest Bancorp and Western Alliance Bank extended losses in premarket trading on Wednesday, with their shares down 2% and 1%, respectively.\"There's a reasonable belief that some regional banks could be exposed to similar circumstances given rising rates and that we're heading right into a Fed meeting in which they're continuing to raise,\" said Jason Pride, chief of investment strategy and research at Glenmede.While the Fed is widely expected to deliver a 25-basis point interest rate hike, investor focus will be on cues if further hikes are on the cards given inflation remains above the U.S. central bank's 2% target level.",
        "\"The Fed may want to deliver as little in the way of guidance as possible, keeping the door open for a pause or even an additional hike,\" Saxo Bank analysts said.Major global central banks have embarked on an aggressive interest rate hike campaign to tackle sticky inflation, with the Fed already having hiked its benchmark rates nine times by 475 basis points to a range of 4.75%-5.00% since March 2022.On the data front, ADP National Employment's report showed U.S. private employers boosted hiring in April, but there were signs that the labor market is slowing amid higher interest rates.Surveys on U.S. services sector activity in April are also due after market open.Meanwhile, top U.S. Senate Republicans on Tuesday called on President Joe Biden to accept their party's debt-ceiling package or make a counter-offer, while a top Democrat said the Senate might try to advance a \"clean\" debt-ceiling hike next week.At 8:27 a.m. ET, Dow e-minis were up 44 points, or 0.13%, S&amp;amp;P 500 e-minis were up 9.5 points, or 0.23%, and Nasdaq 100 e-minis were up 30.75 points, or 0.23%.Analysts expect quarterly earnings for S&amp;amp;P 500 companies to decline 1.4% from a year earlier, according to IBES data from Refinitiv, compared with a 5.1% drop expected at the start of April.",
        "Advanced Micro Devices slumped 7.3% after the chipmaker forecast quarterly sales below estimates due to a weak PC market, pushing rival Intel Corp up 3.1%.Eli Lilly and Co gained 4.9% as an experimental Alzheimer's drug developed by the company slowed cognitive decline by 35% in a closely watched late-stage trial. Rival Biogen Inc fell 1.4%.Estee Lauder Cos Inc slid 15% as the MAC lipstick maker forecast a bigger drop in full-year sales and profit on a slower-than-expected recovery in Asia travel retail and major market China.Kraft Heinz Co gained 2.8% after the Jell-O maker raised its full-year profit forecast after beating first-quarter expectations, while CVS Health Corp dropped 2.4% after trimming its annual profit forecast.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru, Additional reporting by Amruta Khandekar; Editing by Shounak Dasgupta)"
    ]
}