{
    "articleURL": "/tvshowbiz/article-12059419/MAFS-AU-Alyssa-Barmonde-flees-Australia-Hawaii-following-villain-edit.html",
    "content": [
        "Married at First Sight star Alyssa Barmonde has fled Australia after 'coincidentally' losing her job amid the fallout of her 'villain edit'.",
        "The 35-year-old single mother took to her Instagram to share a photo of her holidaying in Hawaii on Monday with two friends.'Aloha,' she wrote alongside the hashtags #fledtohawaii #everyotherweekend.One photo shared by her friend shows Alyssa dressed up to the nines in a black and white floral print dress posing with two friends. Another shows her sipping on what appears to be an alcohol beverage at breakfast time, while dressed in a colourful dress.",
        "It comes after a source close to Barmonde told Daily Mail Australia that the baker was planning a trip overseas because she has been 'unhappy since the show went to air' and just needed to wind down.'She really just wants to move on and forget that she was ever on the show. It has been completely unfair. What we saw on television was not her,' the source said.It comes after Alyssa was sacked from her job as an executive assistant for a Sydney company - a position she had held for seven years.",
        "Speaking to The Daily Telegraph last month, Alyssa pointed out the 'coincidence' of being made redundant just two weeks after the MAFS finale aired.During the second half of the season, she was portrayed negatively, with edited scenes focusing on her emotional outbursts, mistreatment of husband Duncan James, and constantly using 'I have a child' as an excuse for her poor behaviour.",
        "The ex-Mormon, however, insists this portrayal was one-sided and unfair, arguing that many of her clashes with Duncan, from whom she split at the final vows, lacked proper context on screen.",
        "She confessed she went through a 'really dark... couple of months' while the show was airing and had to stop watching after the couples' retreat because 'I could see what the edit was'.Alyssa revealed she was harassed by viewers who tracked down her mobile number and business accounts, receiving 'the most vile messages'.She asked Channel Nine's publicity department to give her access to her Instagram account so she could challenge the narrative of the show's edit, but they denied the request until the season has finished airing in the UK.",
        "'They're protecting the show and the narrative they've created, rather than letting me have my own voice,' she claimed.Alyssa feels hurt and betrayed by producers after watching the series and seeing all the problems in her relationship with Duncan blamed on her single parent status.She is being supported by her therapist, whom she has been seeing for twenty years, during sessions three times per week, and has 'upped' the dosage of her anxiety medication.A new season of Married At First Sight is currently in pre-production.",
        "For confidential support call the Lifeline 24-hour crisis support on 13 11 14Kids Helpline: 1800 55 1800"
    ]
}