{
    "articleURL": "/news/article-12059429/Louis-steals-Young-prince-controls-JCB-makes-grab-marshmallows.html",
    "content": [
        "Louis missed the concert on Sunday night because it was past his bedtime Prince Louis stole the show again today as he got behind the controls of a JCB digger, chowed down on toasted marshmallows and took a very enthusiastic shot at archery during a jam-packed day of volunteering. ",
        "The young royal joined his big brother and sister - Prince George and Princess Charlotte - in helping renovate a Scout hut in Slough as part of 'The Big Help Out' to mark the final day of King Charles' Coronation. He appeared full of energy after being sorely missed at the Coronation Concert at Windsor Castle last night, which he was forced to sit out on as it took place past his bedtime.Videos of Louis' volunteering efforts have seen an outpouring of affection from royal fans online, as they branded him an 'entertainer', a 'little legend' and their 'favourite royal.'When the Prince of Wales took control of a digger this morning, Louis sat in his father's lap as William moved the mechanical arm and grabbed a bucket full of soil before dumping it on a spoil heap.Later the five-year-old prince was given the task of filling a wheelbarrow with what looked like builders' sand and he focused on the job, diligently shovelling the material before wheeling the barrow himself.",
        "Louis also tried his hand at interior decorating, making hand prints on a wall under the direction of his mother Kate the Princess of Wales.The event was another milestone for Louis, who has made a number of official public appearances including attending the Christmas Day service at Sandringham with his parents and siblings.",
        "The young royals got a reward for their hard work on Monday, toasting marshmallows over a barbecue before trying their hand at archery.One video shows Louis eating a marshmallow before throwing the stick it was attached to into a fire. In another clip he is seen covering his eyes with his forearm due to the smoke coming from the flames. He is then given a 's'more' - a marshmallow squashed between two crackers or biscuits - by a fellow volunteer. But as he goes to take a bit Kate steps in to ask him: 'What do you say?', before he thanks the woman and eagerly tucks in. The youngest of the Wales family is then seen giving archery a try, rapidly firing plastic arrows towards a target sheet while baring his teeth. The videos of Louis have gone viral online, with one fan declaring: 'He is my favourite royal!'  ",
        "'I'm very much enjoying all the videos of Prince Louis,' wrote one, while another added: 'Prince Louis is such a character!'Another said: 'I'm sure he's a handful but there's something so loveable and appealing about Prince Louis.'  Responding to a clip of Louis clamoring for a marshmallow s'more, another wrote:  'Prince Louis is a foodie and I predict he’s going to be a chef and run the coolest restaurant in Windsor.' ",
        "George, meanwhile, was allowed to use a drill and concentrated as he worked making a hole in a piece of wood.Charlotte was also spotted painting what appeared to be doors. Across the country people have been encouraged to devote some free time on the Monday of the coronation bank holiday weekend for the Big Help Out, aimed at showcasing volunteering.",
        "The event was a change from Sunday night's star-studded coronation concert, where George and Charlotte waved Union flags, sang and sported glowing wristbands during the Windsor Castle event that featured global stars including Lionel Richie, Katie Perry and a host of celebrities from film, TV and theatre.William and Kate looked relaxed after their late night, which ended with them hosting an after-show reception for some of those involved in the show and which was attended by the Duke and Duchess of Edinburgh and their daughter Lady Louise.The duke paid a moving tribute to the King during the concert, telling his father: 'Pa, we are all so proud of you.'Louis, the fourth-in-line to the throne, attended his grandfather's coronation ceremony on Saturday at Westminster Abbey, where he stole the show yet again.He disappeared from the two-hour ceremony for a while, with fans wondering where he had gone and whether he had been told off.",
        "However, it was always the plan that the youngster would retire for some parts of the ceremony, which would have been a long time to sit still for the five-year-old.Louis reappeared to sing the National Anthem at the ceremony, before leaving the Abbey to make an appearance on the Buckingham Palace balcony. Photos from inside the carriage after the ceremony saw Louis, five, peering out of the window - with some people taking to Twitter to say his style was echoing that of a James Bond villain. The mischievous royal made a whole host of funny hilarious facial expressions from the balcony - including his signature yelling face during the flypast. But it seems that Louis' antics also tired out his sister, Princess Charlotte, as the Princess of Wales said the eight-year-old was 'tired' after making sure her little brother, Louis, five, behaved himself during the Coronation service."
    ]
}