{
    "articleURL": "/news/article-12049157/Autistic-boy-10-abused-Perth-school-bullies-leaving-severed-dolls-head-home.html",
    "content": [
        "Autistic boy, 10, in Perth has been bullied  Severed doll's head found at his homeHarassment has been going on for monthsAn autistic boy has been copping ongoing abuse from school bullies who planted a doll's severed head and letters with dog faeces smeared on them at his home. ",
        "The child was harassed for months leading up to the disturbing items being left at his home this year by young school children in Perth.The 10 year old's distraught mother - who cannot be named to protect the boy - said her son has difficulty reading social cues and can be blunt in his communication.He often tries to make friends with children who do not want to be friends with him because of his autistic condition. The single mum said the bullying has made his anxiety 'go through the roof' and she cannot leave him to play by himself in the front garden. 'He just doesn't feel safe in his home. Every single knock on the door makes him really afraid,' she told the West Australian. ",
        "He has been called 'retarded' and a 'freak' and has faced difficulties at a traditional school - so she now homeschools him. But the children who live locally still harass the boy often passing by and calling him names or bailing him up at the park. The mother said there is one main bully about the same age as her son who has it in for her child - and he hangs around with three or four other boys. In January the bullying took a disturbing turn after the family found a severed doll's head that smelt like dog poo at their home.",
        "It had writing and drawings all over it with excrement wiped over its face.'I saw it as a threat because it had my child's name written on the back of the neck,' the mum said, revealing she hoped the bullying would stop. But on Wednesday morning disturbing notes were found stuffed in the family's letterbox which also had faeces all over them. The menacing notes had sexual acts and genitalia drawn on them with threats the bully would rape her son. 'I will rape you and you will be raped,' one note scrawled on a Christmas card read. The bizarre note also had 'I love you' and 'Oh Daddy' scribbled in black felt pen. The letters also had expletive-ridden insults scribbled across them calling her son 'ugly' and 'dirty' and telling him to 'f*** off'.One note had the bully's name written on it while her son's name also appeared on most of them.  The mother said the bullying has isolated her 'beautiful child' even more after she took him out of school due to the difficulties he faced there. She said he was making progress after she started to homeschool him but said this recent escalation has really set him back 'dramatically'. The boy has a passion for animals and Minecraft and is interested in archaeology, science and 'anything to do with the natural world'.",
        "The desperate mum said the school had done all it could to control her son's relentless bullying but more education was needed.She pleaded with parents to teach their kids to be kind to others including those with special needs. National Autism Helpline: 1300 308 699"
    ]
}