{
    "articleURL": "/wires/reuters/article-12044511/Kraken-look-turning-heads-visit-Stars-Game-2.html",
    "content": [
        "The Dallas Stars are only one game into their second-round Western Conference playoff series with the Seattle Kraken, but they are already under the gun.",
        "After Seattle claimed a wildly entertaining 5-4 overtime victory in Tuesday's series opener, the Stars must regroup when they host Game 2 on Thursday night.\"We need to learn from the mistakes we made, and learn from the stuff we did well,\" Dallas goaltender Jake Oettinger said. \"When we played well, we dominated. I think every guy in this room and every person in this building thought we were getting the next goal. So, if we play the right way, we feel we can beat these guys.\"The Kraken staked a 4-2 first-period lead with a flurry of goals, three of them 52 seconds apart, before Joe Pavelski tallied twice in the third period to cap his incredible four-goal performance. However, Seattle regrouped, and Yanni Gourde scored the game-winner.Pavelski, whose outing was even more impressive considering he returned after suffering a concussion in the first game of his team's opening-round series, was more concerned about the remainder of the series.\"They play fast. You play that Minnesota series, and they slowed it down at times,\" said Pavelski, who became the oldest player (38 years, 295 days) in NHL history to score four goals in a game. \"This team, they're looking to attack.\"Now the onus is on the Stars to answer.",
        "\"We did a good job of clawing back into that game,\" Dallas forward Max Domi said. \"There's a lot of good that comes out of it. ... We'll clean up some things and get ready for Game 2.\"The Kraken, who upset the defending Stanley Cup-champion Colorado Avalanche in the first round, are certainly turning heads and maybe even surprising the hockey world in just their second season of existence.Seattle has reached this point with a truly team-wide gameplan. The Kraken had five different goal scorers in Monday's victory.The Kraken also showed plenty of mettle. Dallas, which is heavily favored in the series, opened the scoring at the 2:25 mark of the first, but the visitors displayed the effectiveness of their speed and forechecking by responding with four goals by the end of the period.Then, upon seeing their two-goal edge disappear in the third period, they recovered to see Gourde net the winner.\"This is how you want to start the series,\" Gourde said. \"We know it's a huge game. I loved our response. I loved our composure. We're a pretty mature group in there. We trusted that the process was going to get it done.\"Plus, as much as the Kraken are bracing for the Stars to elevate their game, they are well aware of aspects of their own game that they need to focus on more.",
        "\"That's not a typical first period in playoff hockey, but sometimes you get those,\" Seattle coach Dave Hakstol said of Tuesday's first 20 minutes of action. \"There's a lot going on there. Obviously, on the defensive side, play without the puck ... we've got to clean some things up there. What I did like is we go down and (were) able to push back right away and just do it in a way where we've generated offense that way all year.\"We were able to get inside a little bit, which you have to do on Oettinger. That was a big part of some of the offense we were able to create.\"--Field Level Media"
    ]
}