{
    "articleURL": "/wires/reuters/article-12040151/Panthers-maintain-momentum-beat-Leafs-Game-1.html",
    "content": [
        "Matthew Tkachuk had three assists to help the visiting Florida Panthers to a 4-2 win against the Toronto Maple Leafs in Game 1 of their Eastern Conference second-round playoff series on Tuesday night.",
        "Sam Bennett had a goal and an assist, Nick Cousins, Carter Verhaeghe and Brandon Montour also scored and Sergei Bobrovsky made 34 saves for Florida, which upset the Boston Bruins in the first round by winning the final three games.Tkachuk's assist total tied the franchise record for a single postseason game, a mark set by Verhaeghe on April 26.Matthew Knies and Michael Bunting scored and Ilya Samsonov made 24 saves for the Maple Leafs, who reached the second round for the first time since 2004 by getting past the Tampa Bay Lightning in six games.Game 2 is Thursday night in Toronto.The Panthers took a 1-0 lead at 9:25 of the first period when Cousins fought off Toronto defenseman Jake McCabe for a rebound and scored with a backhand.Florida moved ahead 2-0 at 7:58 of the second period. Aaron Ekblad took a point shot that went off the stick of Knies and then was tipped into the net by Bennett.The Maple Leafs answered nine seconds later when Knies scored his first NHL goal in his ninth game (regular season and postseason).Knies took a centering pass off the wall from Auston Matthews. His initial shot was saved, but he followed up with a spinning backhand that hit the net to make it 2-1 at 8:09.",
        "Matthews extended his point streak to seven games (five goals, six assists), and Morgan Rielly also assisted on the goal to extend his point streak to six games ((three goals, six assists).The Maple Leafs tied it 2-2 at 14:51 of the second. Calle Jarnkrok fed Bunting driving through the slot, and Bunting faked out Bobrovsky before lifting the puck into the net.Verhaeghe got loose on a breakaway and scored to make it 3-2 at 17:47 of the second. It was his 11th playoff goal with the Panthers, setting a team record.Montour scored his sixth goal of the 2023 playoffs with a slap shot during a delayed penalty to extend the lead to 4-2 at 12:24 of the third period.Bennett was called for a double-minor high-sticking penalty with 37 seconds left and Maple Leafs pulled Samsonov for a two-man advantage, but they were unable to generate a scoring chance.Florida had lost eight consecutive Game 1s.--Field Level Media"
    ]
}