{
    "articleURL": "/femail/article-12056185/Was-Kates-stunning-headpiece-tribute-Queen-Elizabeth.html",
    "content": [
        "The Princess of Wales's floral headpiece may have been tribute to the late QueenRead More: The Princess of Wales mastered power glamour at the Coronation The Princess of Wales's stunning floral Coronation headpiece may have been a sweet tribute to the late Queen Elizabeth II as it harked back to her wedding day.",
        "Princess Kate, 41, looked radiant in her Alexander McQueen gown and Jess Collett x Alexander McQueen Headpiece made from with silver bullion, crystal and silver threadwork three-dimensional leaf embroidery - which looked strikingly similar to the tiaras worn by the late queen's bridesmaids in 1947.Balcony photos from the late Queen's wedding to Prince Philip show her bridesmaids dressed in gowns with tulle bardot necklines and floral headpieces in a very similar style to that worn by Kate yesterday.Eight-year-old Princess Charlotte, who was dressed in a matching Alexander McQueen gown to her mother, also donned the stunning headpiece in what may have been a subtle yet sweet tribute to the late monarch on her son's Coronation day.The dazzling headpiece was a break from tradition for the Princess of Wales who chose not to wear a tiara for the occasion.",
        "She did, however, pay tribute to her late mother-in-law Princess Diana with her pearl and diamond earrings to compliment her outfit.The earrings, made by Collingwood and given to Diana by King Charles ahead of their wedding in 1981, mark a touching handover from one Princess of Wales to the other. Kate arrived at Westminster Abbey with Prince William in a breathtaking ivory silk crepe gown, which featured silver embroidery featuring rose, thistle, daffodil and shamrock motifs to represent each of the four nations.",
        "The Princess has long chosen to wear Alexander McQueen for significant moments in her life, most notably choosing its creative director Sarah Burton to design her wedding dress.The four flowers of the home nations - English rose, Scottish thistle, Welsh daffodil and Irish shamrock - were embroidered on to the dress.However Kate's subtle nod to the late Queen's wedding day was clearly evident yesterday. ",
        "There were eight bridesmaids at the then Princess Elizabeth and Prince Philip’s wedding – Princess Margaret, Princess Alexandra, Lady Pamela Mountbatten, Diana Bowes-Lyon, Lady Elizabeth Lambart, Margaret Elphinstone, Lady Caroline Montagu-Douglas-Scott and Lady Mary Cambridge.The Royal wedding took place on November 20 1947 at Westminster Abbey in London.Elizabeth first met Prince Philip of Greece and Denmark in 1934, at the wedding of Philip's cousin, Princess Marina of Greece and Denmark, and again in 1937.Before the marriage, Philip renounced his Greek and Danish titles, converted from Greek Orthodoxy to Anglicanism and adopted the style Lieutenant Philip Mountbatten, taking the surname of his mother's British family.The wedding was designed to lift post-war spirits in an era when much of London still lay in ruins and economic travails were creating hardship for ordinary families.On the morning of her wedding, as Princess Elizabeth was getting dressed at Buckingham Palace before leaving for Westminster Abbey, her tiara snapped.",
        "Luckily the court jeweller was standing by in case of emergency. The jeweller was rushed to his work room by a police escort.",
        "For her wedding dress she still required ration coupons to buy the material for her gown, designed by Norman Hartnell.The official wedding cake was made by McVities and Price, although eleven other cakes were given as presents.With post-war food rationing still in place, ingredients were sent as wedding presents from overseas.The official cake was made using ingredients given as a wedding gift by the Australian Girl Guides.The wedding ceremony was officiated by the Archbishop of Canterbury, Geoffrey Fisher and the Archbishop of York, Cyril Garbett.The ceremony was recorded and broadcast by BBC radio to 200 million people around the world.Elizabeth and Philip then proceeded to Buckingham Palace, where a breakfast was held at the Ball Supper-room.",
        "The wedding breakfast was held after the marriage ceremony at Westminster Abbey in the Ball Supper-room at Buckingham Palace.The menu was Filet de Sole Mountbatten, Perdreau en Casserole (a braised partridge dish) and Bombe Glacee.The couple received over 2,500 wedding presents from around the world and around 10,000 telegrams of congratulations.Among the Queen and the Duke's wedding presents were 500 tins of pineapple, 131 pairs of nylons, 17 pairs of silk stockings, 16 nightgowns, 30 scarves, 38 handbags, 24 pairs of gloves and a refrigerator.",
        "Prince Philip's own gift to his new wife was a platinum and diamond bracelet crafted from a tiara that belonged to his mother Princess Andrew of Greece.The couple departed from Waterloo station with the Queen's corgi, Susan, for their honeymoon.The newlyweds spent their wedding night at Broadlands in Hampshire, home of Prince Philip’s uncle Earl Mountbatten.The second part of the honeymoon was spent at Birkhall on the Balmoral Estate."
    ]
}