{
    "articleURL": "/femail/article-12042425/My-husband-treated-25-000-surgery-push-present.html",
    "content": [
        "Erebi, 27, from London was gifted a tummy tuck and breast implantsREAD MORE: I travelled to Turkey for £16k surgery to get the 'Instagram look'A woman has received a staggering £25,000 worth of plastic surgery as a gift from her husband - but now claims she was just as happy with her body before.",
        "Eberi Bowring, from East London, was gifted a 'push present' of a tummy tuck, liposuction, breast lift and implants back in February, to remove excess skin.A push present is a gift from a partner or family member to a mother, to mark the occasion of giving birth to a child. The 27-year-old went under the knife at Highgate Private Hospital in London, after giving birth to her two sons in June 2016 and September 2020.The mother-of-two happily accepted the 'mummy makeover' because she thought the procedure would make her feel better - but her insecurities still lingered after the surgery.",
        "And now the stay-at-home mother warns other women going under the knife to love their bodies before getting the op because it  'won't cure all insecurities.'She said: 'It's not an easy thing to do. It's a shock to the system and it will affect you and your whole family massively.''I was definitely very depressed after my surgery and I couldn't do anything for myself and I was in so much pain' she added.'The pain was the worst thing. I was stuck indoors and the first time I went out was two weeks after my surgery and I did a 10-minute walk down the road that took me an hour.'",
        "'It was weird knowing a couple of hours before I could move freely but then all of a sudden, I couldn't move.'Erebi was left feeling insecure after birthing her children and soon developed an eating disorder - which saw her lose five stone and go from and a size 16 to a size 10.A combination of heavy dieting and weightlifting helped Erebi see fast results, but she eventually plateaued and her husband's gift was the 'last step.'Despite family and friends warning her about how serious the procedure would be at first, Erebi is still glad she went ahead and says it's okay for mothers to do it 'if it makes them happy.'",
        "She added: 'The most important thing women need to know is that it is a major surgery. Just because it's called a cosmetic surgery doesn't mean it isn't a major thing.''I know everyone's budget is different, but I definitely wouldn't recommend going to Turkey for surgery - especially knowing how I felt after. The surgery itself you don't have to worry about as it's someone else's job and you're asleep.''However, the recovery is all on you. That's the bit you don't usually see online, but it's the hardest bit.'Erebi concedes that motherhood is hard work, and so cosmetic surgery can be rewarding - but she advises mothers to love themselves first before altering their exterior.",
        "She said: 'You've given so much to your kids and if you're looking in the mirror and you're not happy, why not do this for yourself?'Sometimes you just have to ignore what people are saying and do what makes you happy.''I would say though that I didn't get surgery until I maintained my weight loss for two years. I also did love my body before - I was in a bikini with loose skin and everything.''Don't get surgery if you're not already content with yourself, your surgeon is only a person not a magician. But overall, I would say so long as you have a great support network around you, then go for it.'"
    ]
}