{
    "articleURL": "/wires/reuters/article-12039017/GRAINS-Chicago-wheat-hits-25-month-session-low-good-news-crops.html",
    "content": [
        "Wheat hits 25-month session low",
        "European Commission restrictions until June 5 on Ukraine grainMarket eyes talks on Black Sea grain corridor(Adds closing prices, changes first paragraph, changes headline, changes bullets)By Cassandra GarrisonMEXICO CITY, May 2 (Reuters) - Chicago wheat hit a 25-month low in the session to close lower on Tuesday, on weather that looked good for U.S. crop development and improving crop conditions.Wheat has been pressured down in recent days after the winter wheat crop rating as of Sunday was up 2 points from the prior week at 28% good to excellent, according to the U.S. Department of Agriculture.\"The market had expected a bigger improvement than what it got, but it was still an improvement, and that's being considered a little negative,\" said Jack Scoville, analyst with the Price Futures Group in Chicago.Corn and soybeans also closed down as concerns eased over planting weather and export demand weakened.The most-active wheat contract on the Chicago Board of Trade (CBOT) fell 9 cents to $6.09-1/4 a bushel, after dipping to a session low of $6.07-1/2, the lowest since April 2021.Corn ended 4-1/2 cents lower at $5.80 a bushel and soybeans settled down 16-3/4 cents at $14.10-3/4 a bushel.Eyes were also on the U.N.-brokered deal that allows safe exports of Ukrainian grain through the Black Sea.",
        "The Kremlin said that the window to extend the Black Sea grain deal was shrinking, and that talks between the parties were continuing, but without any results.Meanwhile, the European Commission said it had set restrictions until June 5 on imports of Ukrainian wheat, maize, rapeseed and sunflower seed to ease the excess supply of these grains in Bulgaria, Hungary, Poland, Romania and Slovakia.Ukraine's grain exports could fall to around 26 million tonnes in the 2023/24 season as the grain harvest has sunk, largely due to Russia's invasion, a senior ministry official said. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Sherry Jacob-Phillips, Uttaresh Venkateshwaran, Subhranshu Sahu and Jonathan Oatis)"
    ]
}