{
    "articleURL": "/wires/reuters/article-12047865/Hojbjerg-blames-Tottenhams-management-upheaval-recent-winless-run.html",
    "content": [
        "May 4 (Reuters) - Tottenham Hotspur's run of abysmal results is directly related to the management merry-go-round the players have had to deal with in recent weeks, midfielder Pierre-Emile Hojbjerg said on Thursday.",
        "The Premier League club are winless in their last four league matches, a run that included a humiliating 6-1 thrashing by Newcastle United, and have won only one of their last seven games.Within a space of four weeks, the North London side parted ways with manager Antonio Conte, football director Fabio Paratici and acting head coach Cristian Stellini. Assistant coach Ryan Mason is currently leading the side.\"When you have three coaches in a very short time, there is some change, some instability,\" Denmark international Hojbjerg told Sky Sports News.Just seven days after the debacle against Newcastle, Spurs fell 3-0 behind within the first 15 minutes against Liverpool before they mounted a comeback. However, they conceded a goal in the dying seconds to hand Juergen Klopp's side a 4-3 victory.Hojbjerg said the result was \"devastating\".\"I would even go and say it felt embarrassing. In terms of being down 3-0 and making a fantastic comeback. And then throwing it away last second,\" he said.With four matches still to play, Tottenham's lacklustre season has left them in sixth place in the standings and nine points behind Manchester United in fourth, making it highly unlikely that they will qualify for next season's Champions League.Hojbjerg acknowledged that there is no one-size-fits-all approach to leadership and success in football but emphasised the need for a team to find a way to create \"some sort of power and some sort of energy going in that way\".",
        "\"You see the teams that are dominating more or less the football in Europe are teams that over a long time are doing the right stuff with the right values and then you can say, what is the right way,\" he said. (Reporting by Tommy Lund in Gdansk, editing by Pritha Sarkar)"
    ]
}