{
    "articleURL": "/wires/reuters/article-12059805/Texas-deploys-special-border-force-drive-expected-migrant-surge.html",
    "content": [
        "By Doina Chiacu",
        "WASHINGTON, May 8 (Reuters) - Texas deployed a special border force on Monday to target \"hot spots\" where migrants try to enter the United States illegally after sweeping COVID-19 restrictions at the Mexican border end this week, Governor Greg Abbott said.Abbott, a Republican who has been fiercely critical of Democratic President Joe Biden's decision to end the Title 42 policy on Thursday, said members of the Texas Tactical Border Force, a new specially trained National Guard unit, were being loaded onto Black Hawk helicopters for deployment.\"They will be deployed to hot spots along the border to intercept to repel and to turn back migrants who are trying to enter Texas illegally,\" Abbott said at a news conference.A similar tactic was used in El Paso successfully last December, he said. In the last couple of days, he said, the National Guard identified and suppressed a surge in crossings at Brownsville, the same city where a driver plowed into a group of migrants on Sunday.The elite National Guard team will focus on any such surges that occur, identifying crossing points and shutting them down, he said. They will have access to aircraft, boats, night vision equipment and riot gear, he said.Title 42 allows border agents to rapidly expel migrants to Mexico. It was first implemented in March 2020 at the beginning of the pandemic to stem the spread of the coronavirus in crowded detention settings.",
        "Its repeal is expected to lead to a rise in border arrivals as a result of pent-up demand and the perception among migrants - many of whom have traveled thousands of miles from places including Mexico, Central America and Venezuela - that they will be allowed in.The Biden administration is sending 1,500 additional troops to help secure the U.S.-Mexico border this week. The government also will finalize by Thursday a new rule denying asylum to many migrants caught crossing the U.S.-Mexico border illegally.Abbott said he would continue busing migrants from small Texas border towns to big cities like Chicago and New York.He said he was working with state lawmakers to make it a felony to illegally enter Texas from Mexico or to be involved in so-called stash houses for migrants who have crossed the border illegally. Another measure would impose a 10-year minimum jail sentence for anyone convicted of smuggling people into Texas. (Reporting by Doina Chiacu, editing by Deepa Babington)"
    ]
}