{
    "articleURL": "/wires/reuters/article-12042033/The-Ndrangheta-Italys-powerful-mafia-group.html",
    "content": [
        "May 3 (Reuters) - Italy's 'Ndrangheta has supplanted Sicily's Cosa Nostra as the country's most powerful mafia organisation, and has spread across Europe and the rest of the world. Here are a few facts about the fearsome group.",
        "ORIGIN, CELEBRITY KIDNAPPING AND COCAINEThe 'Ndrangheta originates from Calabria, the impoverished southern region at the tip of Italy's boot. Its name is believed to come from the ancient Greek words \"andros\" and \"agathos\", meaning brave or valiant man.It expanded substantially from the 1970s onwards, when it reinvested ransom money from kidnappings - one of its main activities at the time - into public work projects and drug trafficking, especially cocaine.The 'Ndrangheta kidnapped dozens of high-profile victims, including celebrities such as John Paul Getty III, the scion of the U.S. oil family, abducted in Rome in 1973 and held prisoner for five months in the Calabrian mountains.Getty's right ear was cut off to pressure his family into paying a reported $3 million - a story that was fictionalised in the Ridley Scott film \"All the Money in the World\" and in the Danny Boyle TV series \"Trust\".POWER AND WEALTHIn its latest six-monthly report, Italy's Anti-Mafia Investigative Directorate (DIA) calls the 'Ndrangheta \"the absolute dominant force in the criminal world\" well beyond its home turf of Calabria.Its strength lies in its capacity to rely on traditional clan and family loyalties while having \"maximum flexibility\" in exploring new business opportunities in the legal and illegal economy, the DIA said.",
        "In 2008, Italian research group Eurispes valued the 'Ndrangheta's annual turnover at a staggering 44 billion euros ($48.54 billion), about 3% of Italy's gross domestic product at the time.The estimate has since been disputed by some experts, but most agree that the Calabrian mob is extremely powerful and wealthy, largely thanks to its role as a major smuggler of cocaine from Latin America to Europe.The DIA said it also makes money from illegal waste trafficking, racketeering and loan sharking, typically offering credit to struggling businesses and then gradually taking over control of them.INTERNATIONAL REACHThe 'Ndrangheta is known to have an established presence as far as Canada and Australia, as well as in most of Western Europe, with local cells that usually retain strong links with their Calabrian homeland.Italian prosecutors and investigators routinely complain that their European counterparts underestimate the extent to which the Calabrian mob has infiltrated their countries, and say all EU nations should copy Italy's tough anti-mafia laws.Nevertheless, pan-European operations against the 'Ndrangheta - like the \"Eureka\" raid that led to more than 100 arrests on Wednesday and which alleged that mobsters used Chinese money brokers - have become more common.Italian authorities also made domestic progress against the 'Ndrangheta, for example in 2021 with the launch of a so-called \"maxi-trial\" against more than 320 suspected mobsters and associates, including top boss Luigi Mancuso.",
        "Judges later decided to have a separate trial for Mancuso, which is still ongoing.THE SAN LUCA FEUDIn Germany, the 'Ndrangheta notably made headlines in 2007, when six men were shot outside a pizzeria in the western city of Duisburg as part of a long-running war between rival mafia clans.The notorious San Luca feud between the Pelle-Vottari and Nirta-Strangio families started with a carnival prank in 1991 that prompted a string of killings, including the 2006 Christmas Day execution of the wife of a Strangio family mobster. ($1 = 0.9065 euros) (Reporting by Alvise Armellini; Editing by Alison Williams)"
    ]
}