{
    "articleURL": "/wires/aap/article-12058545/Jones-brings-England-rugby-mind-coach-Wallabies.html",
    "content": [
        "Eddie Jones has engaged the sports psychologist who helped England to the 2019 Rugby World Cup final to work with the Wallabies ahead of this year's tournament in France.",
        "Jones recruited Corinne Reid to help heal the wounds from England's disastrous 2015 campaign, when they became the first hosts ever to crash out in the pool stages.The West Australian professor, who helped Australia win hockey gold at the 1996 and 2000 Olympics, ran honesty sessions which helped the players clear away \"baggage\" and improve communication on the field.The result was England powering through to the final in the Tokyo tournament before falling to South Africa.A clinical psychologist who now has her own consultancy, Reid was brought in for last month's Wallabies camp on the Gold Coast.Winger Andrew Kellaway, part of the team's leadership group, said Reid made an impact on the group.\"We've been working with Corinne Reid, who has been fantastic,\" Kellaway told AAP.\"She's a very sharp lady, she brings a real edge.\"She's been fantastic on a personal level and for us as a group, offering insights from her experience, which has been extensive.\"The Wallabies lost a number of Tests by a whisker last year. On the Spring tour their biggest losing margin in three games was three points.A stand-out defeat also came in the Bledisloe Cup match in Melbourne when the Australians failed to manage a controversial refereeing call and allowed New Zealand to cross after the full-time siren to win.",
        "Kellaway said the team were working on their leadership across the board to better handle such pressure-cooker situations.\"We've talked about understanding what leadership entails and then how that's applied in different situations,\" the 21-Test outside back said.\"We've talked about that being a real point of difference for us.\"I think if we'd gotten that right in the past maybe some of those tight results go in our favour and it's something that Eddie brought to our awareness.\"It's been a really cool experience to see these things through a different lens.\"The Melbourne Rebels flyer was part of a six-man leadership group who broke away at the camp to speak with Jones.Kellaway said that group - including Michael Hooper, James Slipper, Allan Alaalatoa and Jed Holloway - was anointed by previous Test coach Dave Rennie and he wasn't sure how Jones would proceed.\"I'm not sure whether that'll change or not, I'm just enjoying being a part of it and seeing how they operate,\" the 27-year-old said.\"Aside from the boss obviously, seeing the way those guys operate and the level of thought that goes into everything they do, I'm really grateful to be a part of that and whether that changes I don't know.\"Jones previously said he was yet to decide what leadership model he would pursue, with the team's longest-serving captain Hooper putting his hand up to resume the role.",
        "Veteran prop Slipper has led the side since Hooper stepped away in Argentina last August for mental health reasons."
    ]
}