{
    "articleURL": "/sport/boxing/article-12052545/Canelo-Alvarez-feted-native-Guadalajara-challenger-John-Ryder-make-weight.html",
    "content": [
        "John Ryder hit the scales exactly at the 168-pound limit on Friday in GuadalajaraAlvarez, who was serenaded by his hometown fans, came in at 167.5 pounds DailyMail.com provides all the latest international sports newsOn the grand stage of a neo-classical theatre in which Royal Opera House-goers would have felt at home, Canelo Alvarez and John Ryder raised the curtain ahead of their bout for the undisputed world super-middleweight title.",
        "By a deliciously relevant quirk, El Teatro Degallado translates into English as the 'Throat Cut Theatre.'The courteous proceedings themselves were more suited to the rococo setting. Once a mariachi band had flooded the auditorium with patriotic music, the thousands of children invited for the occasion raised the roof as their Canelo and his English challenger weighed in.Ryder hit the scales exactly at the 168-pound limit. Canelo was half a pound under for his first fight on home soil in almost 12 years.The squeals of delight as the Mexican hero took off his shirt will turn blood-curdling roars in the Akron Stadium this Saturday night. ",
        "Naturally, Ryder seems to be the only person in Guadalajara giving himself much of a chance on Saturday. Ryder's resume isn't bare. He beat former champion Daniel Jacobs by a split decision in 2022, and according to the Islington native, he was robbed in his 2019 unanimous-decision defeat to Callum Smith – someone who suffered the same result to Alvarez a year later. 'I'm sure people do see it as an easy fight [for Canelo] but I'm in there to make a statement and stake my own claim on the super-middleweight division,' Ryder told told the PA news agency. 'I want to show people I do deserve to be a true world champion. I was harshly judged on in the fight with [Callum] Smith and already should have a world title but I'm blessed that this opportunity has come now.",
        "'I've worked hard, I've had a few more fights in and around that level, picked up the interim world title and now I'm sitting in a fantastic position taking on Canelo next.'Saturday's fight will be the first ever boxing match at Akron Stadium, where roughly 48,000 fans are expected.And even though they're likely rooting for Alvarez, Ryder still plans to give them a show.'I think the Mexican fans are real fight fans,' Ryder said. 'As long as you've giving them what they want to see and putting it all on the line… I'm sure they might boo on the way in but cheer on the way out.'"
    ]
}