{
    "articleURL": "/news/article-12046207/Canadian-chef-charged-aiding-suicide-selling-poison-linked-eight-deaths-UK.html",
    "content": [
        "Law was arrested on Tuesday by Toronto police and is set to appear later in courtHe was charged for alleged online sales and distribution of the lethal substanceFor confidential support call the Samaritans on 116123 or go to samaritans.org A Canadian chef who admitted supplying a lethal poison through the post to suicidal youngsters is reportedly linked to eight deaths in Britain.",
        "Kenneth Law, 57, from Ontario, Canada, was charged for alleged online sales and distribution of the substance said to be related to two deaths in Toronto.Now police in the UK are 'tracing buyers to conduct welfare checks' after they discovered 'links to eight deaths', The Times reported.For at least two years, Law allegedly sent the lethal substance through the post to vulnerable customers around the world.Canadian authorities sent a list of British buyers from Law's websites to The National Crime Agency. According to The Times, the agency then sent officers to check on those listed and seize unused packets of the substance. ",
        "Law was arrested on Tuesday evening by Toronto police and was subsequently charged with two counts of counseling or aiding suicide. 'It is believed that the suspect distributed and marketed the substance online to target individuals at risk of self-harm,' police said. Speaking to reporters following the arrest on Tuesday, Peel deputy chief Marc Andrews said investigators believed around 1,200 packages have been shipped out by Law to 40 separate countries. Andrews noted that police were unable to confirm if all the packages contained the same substance. 'Investigators are working in collaboration with multiple jurisdictions across Ontario, nationally and internationally as we believe there could be more victims,' Andrews said, as reported by the Times.",
        "'The mental health and well-being of our communities is our main priority.'As such, we will not tolerate criminal actions by those who prey on vulnerable individuals in our community.'Law's alleged actions were uncovered in an investigation by The Times last week that claimed the chef had sent the substance out to vulnerable customers around the world from a post office near Toronto.Eight deaths in the UK have been linked to the poison sold online, The Times investigation claimed, including that of Tom Parfett, from Maidenhead in Berkshire, who took his own life aged 22 after buying the substance from Law's company.Mr Parfett's father, David, said that Law had 'effectively handed a loaded gun to my son'.He told The Times: 'I believe my son would still be alive if it wasn't for this man and this substance.'",
        "The National Crime Agency would not comment on how many had bought the substance in the UK, The Times reported. An undercover reporter had posed as a suicidal customer of Law's. He was said to have boasted about supplying the substance, claiming he was doing 'God's work'.It was reported Law also admitted to sending the poison to hundreds of buyers in the UK, and said he would continue doing so until he had exhausted his inventory.",
        "While the substance has caused at least 70 deaths in Britain, it is still is legal to sell and serves purposes other than as a poison. Retailers must still alert the authorities if it is suspected to have been bought to cause harm.Assisting suicide in the UK and Canada is punishable by up to 14 years in prison.Anthony Jones, a 17-year-old American, was another of Law's alleged victims. He ran to his mother shouting 'I want to live' after ingesting the substance, which eventually killed him, The Times investigation said.In Britain, Mr Parfett, Michael Dunham, 38, Neha Raju, 23, and a 21-year-old student have all died in the past 18 months after buying products from Law's company.Mr Parfett's father said Law was playing God by supplying vulnerable people with the means to kill themselves.'He is knowingly supplying a substance for people to take their own life and gaining some kind of perverse pleasure from the knowledge that they are doing it,' he added.Law told the undercover reporter that 'many, many, many, many' people had died after ingesting the poison.He said he went into the business of selling the poison after seeing his mother suffer following a stroke.Police have since warned the public to alert officials if they have received a package from the following businesses: Imtime Cuisine; AmbuCA; Academic/ACademic; Escape Mode/escMode; and ICemac.",
        "Anyone who has received such a package or has any further information is invited to contact police at 1-888-714-0003 or 11Divproject@peelpolice.ca.For help and support, contact the Samaritans for free, anonymously, on 116 123"
    ]
}