{
    "articleURL": "/wires/aap/article-12043277/Five-die-daily-drug-overdose-rates-plateau.html",
    "content": [
        "Today, five Australians will die from drug use.",
        "A UNSW report paints a stark picture of the state of Australia's drug-induced fatalities, showing there is more prevention work to be done.Between 2002 and 2017 the rate of drug-induced deaths grew 3.5 per cent per year, worrying experts.While the rate of increase has eased, researcher Amy Peacock said early estimates show more than 1700 people died from drugs in 2021.\"Overseas, there was an increase in drug-induced deaths during the pandemic,\" she told AAP on Wednesday.\"We're still being cautious but we aren't seeing evidence of that in Australia.\"The 2021 data also shows opioid-related deaths decreasing although still the most common, making up 58 per cent of total drug-induced deaths.Three out of every four overdoses occurred at home, which Professor Peacock said could be prevented with the opioid reversal drug naloxone.\"Australia in some senses leads the way in opioid therapy and take-home naloxone treatment,\" she said.\"But these deaths show there is always more to be done.\"While naloxone - sold under brand name Narcan - is available over the counter for free for anyone at risk of experiencing an overdose, Prof Peacock said opioid therapy was not the only solution.\"It's also important that a range of evidence-based treatment and harm reduction services are available to people - both in the community and in custodial settings,\" she said.",
        "The study from the National Drug and Research Centre showed the majority of drug-induced deaths were due to unintentional overdose.Only one in eight unintentional overdoses involved people with a history of self-harm.Prof Peacock said studying drug-induced deaths was important to identify risk factors and ultimately influence policymaking.\"The fact we've still got five people dying per day from an overdose means we have a whole lot more work to do,\" she said.Lifeline 13 11 14beyondblue 1300 22 4636"
    ]
}