{
    "articleURL": "/news/article-12058397/North-Queensland-men-slammed-wading-crocodile-infested-Jardine-River.html",
    "content": [
        "Two men have walked in croc-infested waters in north QLDThe pair are criticised for the dangerous act on TikTok It comes days after a hotel owner was attacked and eatenTwo men have been slammed for wading in croc-infested waters just over a week after a hotel owner was killed and eaten by two crocodiles while fishing. ",
        "The men were captured on camera walking waist-deep through the Jardine River at Cape York in Queensland's Far North.One of the men is shirtless holding a can of beer while the other brandishes a lever action rifle. Both men trudge through the murky water before making it to the shoreline.Footage of the incident was uploaded to TikTok with the video overlaid with the popular song, 'Dumb Ways To Die'. 'Checking the depth of croc infested Jardine River,' the caption read.",
        "A number of viewers slammed the pair over the reckless act due to the sheer number of crocodiles that lurk in the river.'Croc would be on you dude before you could aim - seriously, you're in their world now,' said one person in the comments.'Sorry mate but the gun ain't gonna keep ya safe they go under water not above won't see it coming they hunt for a living,' another commented.A third added: 'They wouldn't see it coming, until it grabbed one of them.''Two tough thinking non-locals come up this way and think they own the place, doing stupid s**t like this,' another wrote.A Department of Environment and Science spokesman said the DES strongly condemned the dangerous actions of the men.'DES wildlife officers work hard to equip people with the tools and education they need to be Crocwise, and it is frustrating to see people take unnecessary, life-threatening risks in known crocodile habitat,' he said.",
        "It is currently illegal to shoot a crocodile in Queensland. The reckless act comes just over a week after publican Kevin Darmody, 65, was killed by two saltwater crocodiles at Rinyirru (Lakefield) National Park, which is about 600km south from the Jardine River.",
        "Mr Darmody had been fishing along the banks of the Kennedy River at 3:30pm on April 29.Nearby campers recalled hearing screams and frantic splashing with fears raised he was taken by a crocodile.Authorities believe Mr Darmody went to the water's edge to retrieve a fishing lure when he was snatched by one of the reptiles. Wildlife rangers from the Department of Environment and Science (DES) shot two crocodiles, measuring 4.1 metres and 2.8 metres, two days after the attack.The pair of reptiles were located about 1.5 kilometres upstream from where Mr Darmody was last seen.Human remains were found in one of the reptiles following a necropsy - a post-mortem examination of an animal - but both crocodiles are believed to be involved in the attack.",
        "The suspected attack has sparked calls for changes to how Queensland manages the reptiles.Queensland's Australian Party leader Robbie Katter has advocated to cull crocodiles because the territorial predators are moving up the river system and overtaking the waterways.'My immediate response and it sounds a bit blunt, but how about we dump them in your river and see how you go co-existing with them,' Mr Katter said.",
        "'I take my family to the Gregory River and that's where we swim because there are no crocs but they now coming up the Gregory.'At Lake Placid, where I used to swim as a kid, you can't swim there anymore either.'"
    ]
}