{
    "articleURL": "/sport/mlb/article-12039101/Trevor-Bauer-debut-Yokohama-DeNA-Baystars-TOMORROW-receiving-warm-welcome-Japan.html",
    "content": [
        "Bauer was released by the LA Dodgers in January and was not signed in the MLB Resultantly, he signed a one-year-contract with Japanese club Yokohama DeNA DailyMail.com provides all the latest international sports news Former MLB star Trevor Bauer will pitch his first official game for Japan's Yokohama DeNA BayStars Wednesday after an enforced exile from the major leagues. ",
        "Despite never being found guilty of sexual assault or domestic violence, Bauer was ostensibly too much of a burden for franchises to sign this season. While he is viewed by some in the United States as a controversial figure, Bauer has received widespread adulation in the Japanese port city. To promote his debut, a local department store is to unveil a seven-story poster of the former Cy Young Award winner on its façade.MLB Commissioner Rob Manfred suspended Bauer in April of 2022 after a San Diego woman accused him of beating and sexually abusing her in 2021. Bauer disputed her claims and said that everything that happened between them was consensual. He was never charged with a crime and a California judge found the woman's claims 'materially misleading.'Bauer was released by the Los Angeles Dodgers on January 12 despite an arbitrator reducing his unprecedented 324-game suspension to 194 games after a successful appeal. ",
        "Following its investigation, the MLB found Bauer to be in violation of the domestic violence and sexual assault policy of both the league and the players' association. Bauer has filed a defamation lawsuit against his accuser, Lindsey Hill, who has since countersued the 32-year-old pitcher, claiming that he is trying to silence her. Hill was 27 when she says Bauer sexually assaulted her in April and May of 2021. ",
        "Hill, a San Diego native, was granted a temporary restraining order against Bauer on June 28, 2021 after being treated for her injuries at hospital near her home and giving a statement to police. Her attempts to obtain a permanent restraining order against him here denied and prosecutors in Los Angeles said in February of 2022 that they would not pursue criminal charges because there was insufficient evidence to prove her claims beyond a reasonable doubt.Bauer has admitted the two had intercourse, but says both encounters were 'wholly consensual.' Hill is among three women who have accused Bauer of sexual assault.As the Washington Post uncovered in August of 2021, an Ohio woman had also tried to get a temporary restraining order against Bauer in June of 2020, and police reports showed that she accused him of physical assault in 2017 after receiving death threats from the pitcher.In April 2022, the Post reported another Ohio woman's claim that Bauer had also choked her unconscious and sodomized her without consent during his time with Cleveland's minor league affiliate in Columbus, Ohio. She also shared screenshots of text messages with the Post, purportedly showing Bauer telling her: 'I want to f*** you while you're completely unconscious.' Bauer has also denied these allegations.",
        "Last year, Bauer's attorneys filed text messages between Hill and Bauer as well as others between Hill and her cousin in which she describes sex with their client as 'consensual' but said he 'took it too far' by leaving her with black eyes.",
        "In response to the release of the Hill's text messages, her attorneys provided DailyMail.com with an unredacted photo of their client showing the injuries she allegedly suffered as a result a sexual encounter with Bauer.'Look at this picture,' attorney Bryan Freedman told DailyMail.com in a statement. 'No one – absolutely no one – can consent to this, logically or legally. Trevor Bauer's team continues to try to abuse an assault victim. They need to stop. Now.'Attorneys for Bauer and for the woman said during a court session in February they intend to call several witnesses, including Bauer, and argue over the order in a hearing that's expected to last three days. That hearing in Los Angeles County Superior Court has been pushed back to August 16.In present day Japan, replica posters of the department store version dot train stations around town spelling out 'Bauer' in English with the message in Japanese - 'He's here.''My face is too big,' Bauer said recently, breaking into a seldom-seen laugh with reporters. 'It's very cool. It's very cool. Growing up as a kid you see professional athletes and movie stars on billboards like that; kind of cool for me to be there myself.'",
        "Not a single Japanese reporter asked him about his suspension in the U.S. over domestic violence allegations or the circumstances surrounding it at his introductory press conference last month. Many Japanese know the basics of allegations against Bauer but don't seem to care. Others argue he wasn't convicted in a court. Some know little at all. And for most fans, it's strictly about baseball.'The Japanese people know that Trevor Bauer had a domestic violence problem in the United States,' said Fumihiro Fujisawa, the president of Japan's Association of American Baseball Research. He said signing Bauer came down to a business deal with both sides seeing a 'win-win.'",
        "Bauer has pitched three minor league games and got his pitch count up to 93. His biggest challenge might be batting, since Japan's Central League does not use the DH.He still gets termination pay from the Dodgers for this season and is a savvy marketer, with a recent YouTube video accumulating 1.1 million views.'Look, I recognize that I've made mistakes,' he said in a video segment on his channel. 'I have to live with those. I've made plenty of errors of judgement and stupid choices that someone in my position never should have made. And I reacted the wrong way to things said about me in the press and on social media.'",
        "Bauer and the team have established the 'Trevor Bauer Official Fanclub.' Joining is pricey. A 'VIP' membership is 2,200,000 yen, or about $16,200 for the season. A 'deluxe' membership is 330,000 yen, or about $2,500.The perks include everything from a 'special observation seat' to limousine service to the game. At the lower end are an 'autographed actual-wear uniform,' an autographed ball, and other 'original goods.''Life is about experiences, and so I want to offer an experience - not just things but an experience they'll remember and they'll cherish and that it brings positivity in their life,' Bauer said at a recent post-game interview.",
        "Bauer, who is reported to be paid $4 million for the one-year deal, is also promoting his own merchandise and club offerings. Hundreds of fans have been seen at his minor league preparation games wearing his No. 96 jersey.A new glove has 'sword' written on the side, a reference to the Samurai sword imitation he often goes through after striking out a batter. With both hands, he pretends to thrust the imaginary sword into an imaginary sheath on his left hip.BayStars reliever Yasuaki Yamasaki initially labeled Bauer's call for fans to copy his celebration, 'disrespectful.' Though, he has since clarified on social media - in a photo with Bauer - that his message was misunderstood. ",
        "Fans have lined up outside the stadiums for three minor league games to catch a glimpse or an autograph. Sayaka Chiba and Saya Ikeya - 20-year-old women - jumped and screamed when Bauer walked across a stadium parking lot.'Bauer is cool,' Sayaka said, immediately imitating Bauer's sword routine. Asked about the domestic violence charges in the United States, she added, 'I see him as a baseball player. But, yes, what happened does matters a little bit to me.'Sean Atkinson, retired from the United States Navy and a fan who attended about 50 Yokohama games last season, summed up Bauer's appeal.",
        "'The Japanese are going crazy for Bauer,' Atkinson said. 'All you have to say is: Cy Young winner.'Brian Rioux, a retired United States Marine, said he has a 20-year-old daughter and, though he's a Yokohama fan who went to more than 70 games last year, he's torn.'I have mixed feelings,' he said at a recent minor league game near Yokosuka, the home of the United States Seventh Fleet. 'Of course with something like this, I would take my daughter's side. I don´t know how I'd react.''But of course,' he added, 'we are all on the outside of this story.'"
    ]
}