{
    "articleURL": "/news/article-12050119/Qantas-new-CEO-Vanessa-Hudson-paid-600-000-outgoing-boss-Alan-Joyce.html",
    "content": [
        "Vanessa Hudson will be on $1.6million base salaryAlan Joyce will step down on $2.2million base salary Qantas' new female CEO Vanessa Hudson will be paid $600,000 less than her predecessor Alan Joyce.",
        "Ms Hudson's base salary when she steps up as the airline's boss in November will be $1.6million - about 25 per cent less than Mr Joyce's base salary of $2.2million.The current chief financial officer could however rake in around $5.8million in potential bonuses, and is also entitled to four long-haul and 12 shorter flights a year.During Mr Joyce's first year in the top job in 2008, he was on a base salary of $2million, which was about 25 per cent less than the man before him, Geoff Dixon.Ms Hudson's promotion will reportedly bring her about a 50 per cent pay increase from her current role as CFO.",
        "Ms Hudson, who's been with the airline for 28 years, was announced as the new CEO on Tuesday.But an embarrassing blunder by Qantas chairman Richard Goyder at a press conference saw him refer to Ms Hudson as 'Olivia' - referencing another CEO candidate and Qantas Loyalty chief Olivia Wirth'While it's never easy, the board firmly feels Olivia is the right person to take Qantas forward,' he said.Ms Hudson, a mother-of-two, said it was an 'honour' to step into the esteemed role.",
        "'This is an exceptional company full of incredibly talented people and it's very well positioned for the future,' she said.",
        "'My focus will be delivering for those we rely on and who rely on us – our customers, our employees, our shareholders and the communities we serve.'She began her career at Qantas in 1994 as an internal audit supervisor.Mr Joyce has been credited with helping to turn around the airline's fortunes, including the delivery of soaring profits after it emerged from the devastations of the Covid pandemic.However, he has also attracted controversy over his battles with unions, including over a 2020 decision to outsource the jobs of about 1600 ground crew.The Federal Court found the pandemic-era move was illegal, a decision the airline has appealed to the High Court.Ms Hudson's salary will be reviewed next August. "
    ]
}