{
    "articleURL": "/news/article-12051757/Female-cadet-21-banned-relationship-army-sergeant-months-hanged.html",
    "content": [
        "Cadet Olivia Perks, 21, was in banned relationship with Sgt Mark EasingwoodMs Perks was found hanged and dead at Sandhurst on February 6, 2019A former Army staff sergeant has told an inquest he was in a banned relationship with a young officer cadet in the months before she was found hanged in her room.",
        "Olivia Perks, 21, was discovered dead at Sandhurst military academy in Berkshire on February 6 2019.An earlier inquest hearing recorded her provisional cause of death as asphyxia due to hanging.Her inquest at Reading Town Hall heard she began a relationship with Mark Easingwood, who was then a staff sergeant but has now left the Army, after a social event in Windsor in autumn 2018.Mr Easingwood, who worked as a fitness instructor for cadets, told the hearing he spent time with her at hotels in Reading, Oxford and Newbury in the months before she died.",
        "He also said she had spent time in his room at Sandhurst where they watched TV together.The inquest heard on Wednesday that Ms Perks had told Sophie Given, who she met on a dating site, that she had slept with a staff sergeant and 'may be pregnant'.Later she told Ms Given the staff sergeant 'encouraged her to get drunk' and that she wanted to go back to Sandhurst during the date.However he did not admit they had had a sexual relationship when he gave evidence on Friday.All relationships between officer cadets and their superiors are banned regardless of whether they are sexual.Asked by counsel to the coroner Bridget Dolan KC whether a relationship began after the social at Windsor he replied 'yes, yes'.",
        "Ms Dolan asked if the relationship was 'physically and emotionally intimate', and he said they 'kissed once' when they were out for drinks and had an 'emotional bond'.When Ms Dolan asked if they had spent two nights in Sandhurst together as well as others in hotels, he replied 'we spent time together, yes'.Ms Perks spent the night in the mess of another non-commissioned officer, named only as Colour Sergeant Griffith, after a Falklands Ball on January 1 2019.Mr Easingwood said he was aware of what happened and they spoke about it on the phone.He said: 'I don't recall what we discussed. I was worried about her and, obviously, I was hurt that she had spent the night with another person.'",
        "Ms Dolan asked: 'Was there anything in what she said to you that gave you an indication of what was to come?'He replied: 'No.'He denied knowing anything about a suicide attempt Ms Perks made during a Royal Engineers visit in July 2018 and said he was 'shocked' to find out.He said: 'She kept pretty much her whole private life private. I think maybe that's why she liked spending time with me.'There were a few occasions when we tried to talk about private things and she completely changed the topic.",
        "'I didn't know about the attempts. Maybe that's why she liked spending time with me as well because she knew I didn't know.'The inquest resumes on Thursday."
    ]
}