{
    "articleURL": "/sport/football/article-12051893/Red-Stars-fire-GM-finding-NWSL-suspended-coach-works-youth-club-affiliated-them.html",
    "content": [
        "Craig Harrington worked with Chicago Empire FC, a youth team affiliated with the NWSL club and tied to now-fired Red Stars GM Michelle Lomnicki Harrington was suspended two years after a league-wide misconduct probe DailyMail.com provides all the latest international sports news The Chicago Red Stars have fired their newly appointed general manager Michelle Lomnicki after being informed that a suspended NWSL coach works for a youth club that is affiliated with the team.",
        "Lomnicki was tied to Chicago Empire FC, a youth affiliate club of the Red Stars up until 2021. According to The Athletic, former Utah Royals coach Craig Harrington is still working in his role as a coach with that youth team.Harrington has been suspended for two years from coaching in the NWSL stemming from a report that found 'widespread misconduct in the league'.A statement from the Red Stars said, 'Yesterday, the Board of the Chicago Red Stars ended Michelle Lomnicki's employment effective immediately after learning about a lapse in judgement to not share important information with club leadership.'The statement added, 'the board determined that it is in the best interest of the players, staff and organization to part ways at this time.' ",
        "According to The Athletic, a source from within the Red Stars said the team wasn't aware with Harrington's role with Chicago Empire FC until they were contacted by the league's legal team. Lomnicki was hired to be the Red Stars' general manager in January. She was listed as a technical and performance consultant for the youth club until early May, but in a statement to The Athletic, she says that she 'ceased all youth contracting or club coaching as of January 2023, when I was hired as the (Red Stars') general manager.'",
        "She added, 'My performance consultant role with Chicago Empire involved being a reference for girls in the club as they dealt with items such as competitive anxiety or college recruiting. I had no role in any hiring decisions for the club.'The NWSL's misconduct report says Harrington 'blurred professional boundaries with players', including two reports from players that said, 'while intoxicated [Harrington made] comments about cheating on his wife and made comments about players' appearances.'Harrington denies these reports, but the reporting team, 'did not find his denials to be credible when viewed against the accounts of multiple other witnesses'.The coach was given a two-year suspension back on January 9 of this year and by late January, Harrington was rehired by Chicago Empire FC and appeared on their website. A statement to The Athletic from Empire FC's director of operations Matt Tunis said the club, 'engaged Craig Harrington as an independent contractor' in late January. The club conducted 'risk management diligence' by performing a background check through the National Center for Safety Initiatives, which was 'clean'.They also obtained 'certification of his U.S. Center for SafeSport training' and 'confirmed that Mr. Harrington’s licenses were in good standing with the U.S. Soccer Federation'. He was cleared to coach by both the Illinois Youth Soccer Association and the Illinois Women's Soccer League.",
        "Tunis then says, 'On April 25th, the Illinois Youth Soccer Association notified the Club that Mr. Harrington’s membership had been suspended. 'The club immediately relieved Mr. Harrington of his duties, terminated his contract and removed his information from the club website. 'At no time since February has Mr. Harrington been listed on either the SafeSport or US Soccer risk management list of ineligible, suspended or disciplined individuals.'However, US Soccer confirmed to The Athletic that, 'coaches sanctioned by the NWSL on Jan. 9, including Harrington, were added to the federation’s risk management list following that announcement.'"
    ]
}