{
    "articleURL": "/tvshowbiz/article-12038931/Tasha-Gushi-stuns-joins-beau-Andrew-Le-Page-Guardians-Galaxy-3-screening.html",
    "content": [
        "Love Island's Tasha Ghouri took to the red carpet with beau Andrew Le Page at a Guardians of the Galaxy Vol 3 screening in London on Tuesday. ",
        "The stunner, 24, flaunted her jaw-dropping figure in a tiny black bralette which she teamed with a silver sequinned wrap skirt.Her stylish ensemble left little to the imagination and she showcased her toned abs and tiny waist. Opting for a dewey make-up look Tasha slicked back her blonde locks and slipped her feet into strappy black heels. Meanwhile Andrew, 27, looked smart in an Axel sweater and chinos as he posed up a storm with his gorgeous girlfriend. ",
        "The first Guardians Of The Galaxy movie, which had been projected to be a flop, was released in 2014, and received critical acclaim. The film raked in a whopping $773.3 million in the global box office, and also received two Oscar nominations.The sequel, simply titled Guardians Of The Galaxy Vol. 2, was released three years later in 2017, and garnered even higher box office numbers with $863.8 million in global sales.The new flick's offical synopsis reads: 'Peter Quill (Chris Pratt) must rally his team to defend the universe and protect one of their own. If the mission is not completely successful, it could possibly lead to the end of the Guardians as we know them.The red carpet appearance comes after Tasha hit back at trolls who accused her of having a boob job on Monday.",
        "The Ann Summers model had posted stunning selfies in a sexy blue bikini as she gave a glimpse behind the scenes at her most recent shoot with the brand. Sporting a shorter than usual hairstyle, blonde beauty Tasha captioned the post: 'I think summer is calling for a bob moment.' One then commented under the Instagram post 'I so read that as a boob job' - to which Tasha replied: 'Well you're very wrong, all natural.'Someone else then said: 'I think someone has had a boob job.'",
        "In response, Tasha hit back: 'They're natural lmaooooo try to troll on nothing.' Another troll wrote: 'Looks like she's just like the rest of them after all. Those boobs don't look natural to me.'Tasha showed off her slim figure while donning the turquoise bikini with sequin emblazoned patches.As the piece was complete with a cross-over torso strap and silver metal ring detail, she added a matching sarong on top.Putting her model credentials to good use, the blonde beauty flashed a sultry look to the camera while posing poolside in a sunny destination.Her shoulder-length locks were left to fall freely in a tousled style as they were pulled into a deep side parting.",
        "Tasha added a pair of silver drop earrings to accessorise the look, alongside a nude lip and soft base over her freckled complexion. ",
        "Posing for a slew of snaps, the star could also be seen taking a dip as she added a nude bucket hat to the look. While she joined a number of other models for the poolside shoot, as they all showed off the underwear brand's new summer swimwear collection.The dancer and model joined forces with Ann Summers last year and has fronted a number of their campaigns as an ambassador, including the brand's Valentine's Day collection earlier this year.Guardians of the Galaxy Vol. 3 is released in cinemas May 3 "
    ]
}