{
    "articleURL": "/wires/reuters/article-12059255/Euro-zone-yields-tick-eye-market-rate-bets.html",
    "content": [
        "By Stefano Rebaudo",
        "May 8 (Reuters) - Euro zone government bond yields edged higher on Monday with markets expecting European Central Bank officials to reiterate their commitment to higher interest rates.ECB chief economist Philip Lane said on Monday said there was still a lot of momentum in price growth, including for underlying goods and services, although he still expected disinflation to come later this year.Dutch Central Bank President Klaas Knot said rate hikes were starting to have an effect, but more would be needed to contain inflation and he could support a rise to 5% or even higher from the current 3.25%.U.S. Treasuries could also guide euro zone bond prices with the Federal Reserve's Senior Loan Officer Opinion Survey on Monday and U.S. consumer price inflation data on Wednesday offering more clues about the health of the U.S. economy amid expectations the Fed will pause its hiking cycle.Fears of a banking crisis have led to a tightening of bank lending standards with a potential adverse impact on growth, injecting some caution into investors' views of the ECB's own policy path.Germany's 2-year government bond yield, most sensitive to monetary policy expectations, was 3 basis points (bps) higher at 2.648% but shy of levels seen on Thursday immediately before the ECB's smaller 25 bp rate hike.",
        "\"The busy line-up of ECB speakers this week ... is likely to confirm last week's determined message on rates,\" said Commerzbank rate strategist Rainer Guntermann.The equivalent Treasury yield was up 5 bps at 3.974%.Financial markets continue to price fewer than two 25 bp ECB rate hikes by September, including a terminal rate slightly below 3.75%. Nomura considers that to be a modest under-pricing of the policy path, itself seeing two more 25 bp rate hikes, in June and July, but other analysts expect rates to peak at 4% or possibly higher.Citi, for example, maintains its expectations for 25 bp rate hikes in June, July and plausibly September, saying an unambiguous downturn in core inflation - which they expect in late autumn - rather then just a downward shift in ECB inflation projections is necessary to end the tightening cycle.The September ECB euro short-term rate was at 3.56%, implying market expectations for the ECB deposit facility rate to peak at around 3.66%.\"The ECB probably has one or two more hikes in the tank, but the more severe the U.S. recession, the harder it will be to keep rates up in Europe,\" said Antoine Bouvet, head of European rates strategy at ING.Germany's 10-year government bond yield, the benchmark for the bloc, was 2.5 bps higher at 2.316%.",
        "Data showed German industrial production fell more than expected in March, partly due to a weak performance in the automotive sector.Italy's 10-year bond yield was up 3.5 bps at 4.232%, with the spread between Italian and German 10-year yields - a gauge of investor sentiment towards the euro area's most indebted countries - at around 190 bps. (Reporting by Stefano Rebaudo; Editing by Kirsten Donovan and Alison Williams)"
    ]
}