{
    "articleURL": "/debate/article-12055185/Prince-William-glances-Kate-look-love-couple-enter-Westminster-Abbey.html",
    "content": [
        "It was a look of love and admiration captured in the blink of an eye. As Prince William entered Westminster Abbey, he glanced over at his wife as if to say he was the luckiest man in the world.",
        "Not because he is the heir to the throne, but because he has such a wonderful woman by his side.Like most busy mothers, she appeared not to notice the compliment – perhaps pre-occupied looking over her shoulder to check on the children.Yet the weight of the moment would surely not have been lost on her. It was almost 12 years to the day that William and Kate married in the Abbey.He was a shy Prince and she was a Royal novice.",
        "Now, they are self-assured senior Royals, returning as the Prince and Princess of Wales – and with three little Waleses, too.They seem not only more confident but also more obviously in love than ever before.Wearing formal robes and mantles – as requested by the King – Kate dazzled even without a tiara.Instead, she chose a delicate three-dimensional leaf headpiece fashioned with silver bullion, crystal and silver threadwork.Not the work of a crown jeweller, this was a collaboration between milliner Jess Collett and the Alexander McQueen fashion studio. She also wore an Alexander McQueen dress – the same fashion house that created her wedding dress.Yesterday’s ivory silk crepe with silver bullion might even have passed for a wedding dress under different circumstances.Thoughtful threadwork embroidery featured rose, thistle, daffodil and shamrock motifs to celebrate the four nations of the union.",
        "The George VI Festoon Necklace she wore was a nod to the late Queen, having been made in 1950 by King George VI for his daughter, then Princess Elizabeth.On a recent walkabout, Kate told a member of the public that the family missed Diana, Princess of Wales, every day.Yesterday, Kate paid tribute to her late mother-in-law by wearing her pearl and diamond earrings.",
        "The true family jewels for the Waleses, however, are their three children.Together, the Fab Five signpost a secure and happy future for a family blighted by tragedy and division.Prince George, nine, was a faultless page boy to his grandfather the King, serving him right up to his appearance on the balcony.His sister Princess Charlotte, eight, was charming throughout, looking up at her parents to smile and share the occasional chuckle.Dressed by the same designer as her mother, she bit her lip and appeared deep in thought throughout the service, taking it all in. Little Prince Louis, five, looked on before being whisked away after the first hymn and a little yawn.He returned for the finale of the national anthem and a carriage ride back to the Palace with his family.It’s not just the children who have grown so quickly. Since becoming the Prince and Princess of Wales, both William and Kate appear to have grown in stature.",
        "The day before the Coronation, a relaxed Kate was not only posing for selfies with crowds on the Mall but even speaking down the phone to a sick aunt in America.After enduring the slings and arrows from Prince Harry in Montecito, they have weathered the storms and come through smiling.Kate – and the Middleton family, who attended the service – must be credited not just for raising the children but helping William grow too as he feels more inclined to show his softer side.His relationship with his father seems stronger as a result.One of the most touching elements of the ceremony was the simple kiss he gave the King after paying homage to him on bended knee. On a day of extraordinary emotion, a humbled Charles III appeared to say: ‘Thank you, William.’It was a moment of regeneration for the Royals. Whatever the magnificence of the occasion, at its heart is a family.The kiss for the King was scripted, but was nevertheless heartfelt.If Charles’s Coronation was a marriage between King and public, then William was his best man.And what comfort he must find in William.The next big formal event for the Royal Family might be an investiture for William as the Prince of Wales – but aides say that it is ‘not on the table’ at the moment.",
        "What is ‘on the table’, however, is a drive to support good causes.For one day – indeed sooner than the previous seven-decade wait – we must expect that William will be King and, in the fullness of time, so will George.The monarchy will look different by then.But with the Waleses waiting in the wings, its future – one way or another – looks set to be happy and glorious."
    ]
}