{
    "articleURL": "/sport/afl/article-12049571/Former-Gold-Coast-Suns-AFL-rookie-Patrick-Murtagh-handed-dream-opportunity-NFL-Detroit-Lions.html",
    "content": [
        "Picked as a tight end, not as a punter Follows in footsteps of Jordan Mailata Comes after Gold Coast delisted him Former Gold Coast Suns AFL player Patrick Murtagh has signed with the Detroit Lions in the NFL, following the same route as Aussie NFL star Jordan Mailata. ",
        "The 23-year-old is one of 12 players selected for the NFL International Player Pathway (IPP) program, despite never playing a senior game for the Suns during his three years on their senior list.The NFL IPP program is an initiative designed to give players from outside the United States the opportunity to compete in the NFL. The program is highly competitive, with only a select few players being chosen each year. Murtagh is one of the few who made it through the program, earning a spot on the Lions' roster.",
        "Murtagh's achievement is made even more impressive by the fact that unlike most Aussie gridiron players, he's not getting a shot because of his punting skills.Instead, he's a tight end - a challenging position which calls on players to catch, block and learn a mountain of complicated plays.  Murtagh spent 10 weeks honing his skills at the IMG Academy in Florida, where he had the opportunity to work out with NFL star Odell Beckham Jr. Murtagh described the experience as 'surreal,' saying it was a core memory that will stay with him forever. 'Detroit Lions bound,' Murtagh wrote on Instagram.'Beyond grateful for everyone that's been apart of this journey. To my team around me, friends, family and everyone else out there Thank you! Here is to us! We are going to Detroit.'",
        "While at the academy, Murtagh watched tape of Kansas City Chiefs star Travis Kelce, admiring his athleticism, route-running, blocking, and leadership.Murtagh's journey to the NFL began when he was delisted from the Gold Coast Suns in 2022. He then tried out for the IPP program, where he impressed the coaches with his athleticism and dedication to the sport. Murtagh is viewed as a project player by the Lions, much like how the Philadelphia Eagles first saw Mailata. He will train with the Lions through the preseason, and if he does not make the 53-man roster, Detroit can still keep him as an extra developmental player on their practice squad through the regular season.Murtagh's achievement is a significant milestone for Australian players in the NFL, particularly those who do not play as punters. Murtagh joins Mailata and Adam Gotsis as Aussies who do not play as punters in the NFL. ",
        "Michael Dickson, Mitch Wishnowsky, and Arryn Siposs are current Aussie NFL players who occupy the punter role at Seattle, San Francisco and Philadelphia, respectively.Mailata, who also came to the NFL through the IPP program, offered some advice to other overseas players. 'Enjoy and respect the process. Give it everything you've got. Embrace the opportunity and don't let it go to waste. Hard work will always outlast talent,' he said.",
        "North Queensland Cowboys NRL star Valentine Holmes was the last Aussie to progress through the IPP before Murtagh and Mailata, making it to the New York Jets roster in 2019. Holmes trained at the IMG Academy in Florida alongside other international players for several months before being allocated to the New York Jets' practice squad before ultimately returning to the NRL. "
    ]
}