{
    "articleURL": "/tvshowbiz/article-12044855/Kendall-Jenner-dons-gray-trench-coat-red-animal-print-collar-steps-NYC.html",
    "content": [
        "Kendall Jenner put on a sleek, stylish display of fashion as she stepped out in New York City. ",
        "The 27-year-old bombshell - who is dating Bad Bunny - turned heads in a statement-making textured gray coat with a red and black leopard print collar.The supermodel shielded her brown eyes in a pair of dark, narrow sunglasses despite being out at nighttime.The 818 Tequila founder added a pair of tight black pants and knee-high black leather boots.It comes after the runway regular commanded attention at the Met Gala on Monday night. ",
        "Stylist Dani Michelle has been coordinating the reality television personality's looks and is likely responsible for this one as well.Jenner tightly tied the long coat around her trim waistline with a matching belt.She cuffed the sleeves and the coat was designed with supersized pockets on either side of the front.The second-to-last youngest of the Kardashian/Jenner clan wore a light face of matte makeup. Her lengthy and lustrous ombre locks were parted down the middle as they fell over one of her shoulders in a straighty style.The entrepreneur stepped out of a black luxury SUV as a bodyguard followed closely behind her.The star flaunted a short white manicure as she continued her fashionable streak in the Big Apple.One night earlier she was pictured out with Bad Bunny after they enjoyed a romantic dinner date.",
        "Kendall looked chic in a brown leather jacket and a gray crop top, which she teamed with cream trousers and leather shoes.She accessorised with a camouflage-print baseball cap and a cream-colored handbag while entering a swanky hotel via the back door.Bad Bunny - real name Benito Ocasio - wrapped up in a black coat while keeping things casual in faded jeans.The music artist, 29, looked trendy in an orange hat as he hopped out of a luxury car and followed closely behind his new lady.Kendall and Bad Bunny were both seen arriving at the Mark Hotel in New York City on Monday ahead of their highly-anticipated arrival at the Met Gala later in the evening.It was previously reported by some outlets that Anna Wintour was cracking down on the guest list at this year's Met Gala, following criticism of last year's event for featuring too many influencers and lower-tier celebrities.Initially thought to be on the chopping block were the Kardashian–Jenner clan, though Page Six later reported that Kim Kardashian would be attending.The 2022 event marked the first time that Bad Bunny attended the fundraising event.",
        "On Monday, a source told People that Bad Bunny and his new love had been 'getting more serious.''They are very cute together. Kendall is happy,' they said. 'He is a fun guy. Very much a gentleman and charming. She likes his vibe. He is very chill.'",
        "Although the two took their time with a 'slow start,' they now 'spend almost every day together.''He hangs out with her friends and she hangs out with his. It's more of a relationship now,' they continued. 'Kendall is not seeing anyone else. She really likes him.'"
    ]
}