{
    "articleURL": "/wires/reuters/article-12043327/Shooting-Atlanta-medical-building-leaves-one-dead-3-hospitalized-police.html",
    "content": [
        "By Rich McKay",
        "ATLANTA, May 3 (Reuters) - Police have arrested a former U.S. Coast Guardsman suspected of killing one person and wounding four, all of them women, in a shooting on Wednesday at a medical building in Atlanta, then carjacking a vehicle to flee the scene, authorities said.The suspected gunman, identified as Deion Patterson, 24, was taken into custody without incident after an undercover officer spotted him north of the city in suburban Cobb County several hours after the 12:30 p.m. shooting at the Northside Medical facility, police said.The U.S. Centers for Disease Control and Prevention said in an emailed statement that the woman killed was one of its employees, but did not identify her. The Atlanta Journal-Constitution newspaper identified the slain woman as Amy St. Pierre, citing her husband Julian St. Pierre.The motive for the shooting, and whether the suspect knew or targeted any of his victims, had yet to be determined, police said.\"We know that he had an appointment at the facility, but why he did what he did, all of that is under investigation,\" Atlanta's deputy police chief of criminal investigations, Charles Hampton, said at a news briefing after the arrest.Atlanta Police Chief Darin Schierbaum told an earlier press conference that it was too early in the investigation to determine if the five women who were shot were patients or employees.",
        "The woman who died was 39. The four wounded women ranged in age from 25 to 71, media reported. Three of them were in critical condition and underwent surgery at Grady Memorial Hospital, officials said. The fourth was treated at the hospital's emergency room.Schierbaum described them as \"fighting for their lives.\"Hampton said the gunman opened fire with a pistol and was only inside the medical center for about two minutes, then fled on foot and headed to a nearby gasoline station, where he commandeered a pickup truck that had been left running unattended and drove away.At one point during the hunt, police searched a building under construction that the suspect had entered near Battery Atlanta, a commercial complex being developed adjacent to Truist Park stadium, home of the Atlanta Braves baseball team, Cobb County Police Chief Stuart VanHoozer told reporters. But that search came up empty-handed, he said.The suspect's apparent proximity to the Battery \"was a concern to us because many people would be at that location,\" the chief said.Police analyzed a barrage of surveillance camera images and telephone tips from the public on sightings to ultimately narrow down the suspect's location, VanHoozer said.The gunman arrived at the medical center with his mother, Schierbaum said, but she was not injured. Police said she and other family members were cooperating with investigators.",
        "Little was immediately known about the suspect's background.The U.S. Coast Guard said Patterson joined the force in July 2018 and was discharged from active duty in January, after having last served as an electrician's mate second class. No reason for his discharge was given.Atlanta Mayor Andre Dickens decried the shooting as the latest act of carnage in what has become \"a national epidemic of gun violence\" turning schools, workplaces, churches and doctors' offices into potential killing zones.He said active-shooter drills have become so common that a business in the area of Cobb County where Patterson was arrested happened to be conducting such an exercise as police closed in on the suspect nearby. (Reporting by Rich McKay, Tyler Clifford, Steve Gorman, Dan Whitcomb and Eric Beech; Editing by Doina Chiacu, Cynthia Osterman, Matthew Lewis and Leslie Adler)"
    ]
}