{
    "articleURL": "/news/article-12049995/Hero-brothers-pluck-lorry-driver-overturned-truck-crocodile-infested-river.html",
    "content": [
        "Taru Carr-Hartley, 22, and brother Roan, 20, flew their helicopter over the riverTrucker was crossing a causeway over Kenyan River Galana when flash flood hitThese hero brothers dramatically saved the life of a terrified trucker who had been clinging to the cab of his stricken petrol tanker for over six hours in a raging crocodile-infested river.",
        "Brave chopper pilot Taru Carr-Hartley, 22, and kid brother and crewman Roan, 20, who are both wildlife conservation fliers, pulled off this amazing rescue worthy of Mission Impossible star Tom Cruise.The trucker was crossing a causeway over the River Galana in the Tsavo East National Park in Kenya when it was suddenly hit by a flash flood after heavy rains 30 miles upstream.The driver's fully laden tanker was washed off the crossing and to the driver's horror was then rolled over onto its side trapping him in the cab with no chance of being reached.He managed to open the cab window at 10am and climb out and rescuers on the riverbank hoped the floods would subside so they could reach the driver but the water level continued to rise.",
        "Six-and-a-half hours later when all seemed lost a desperate call was put into the world renowned Sheldrick Wildlife Trust asking if they had a helicopter available for a last-gasp rescue effort.The game park's aerial unit which normally uses choppers to protect and rescue elephants and rhinos was despatched immediately with the Trust owners two ranger sons Taru and Roan crewing it.A Sheldrick Wildlife Trust spokesman said: 'When they reached the River Galana causeway the boys could immediately spot the breached truck completely dwarfed by a very angry river.",
        "'As they flew closer they were relieved to see the driver still hanging on but the water had pushed the tanker onto its side smashing the windscreen and engulfing the cabin and time was running out.'It was only a matter of time before the river totally engulfed the entire vehicle and onlookers were watching helplessly from the shore horrified but unable to help due to the swirling current.'It was impossible to get to them from the bank and Taru and Roan were the drivers only chance and Taru slowly guided the chopper down to within six inches of the truck.",
        "'Roan put his harness on and stepped out and onto the truck and grabbed the driver's hand and guided him into the helicopter and then got back in himself – a textbook rescue!'It was a high stakes rescue mission that ended with the best possible outcome' the Trust said.The overjoyed trucker was set down on higher ground where land based rescuers were waiting and the hero brothers took off again and returned to base in the national park.A short while later it was reported that the petrol tanker was swept further downstream into deeper water which would have seen the stranded driver almost certainly lose his life.",
        "It was not the first time Roan has been hailed a hero as in December 2022 a 4-year-old goat herder had lost contact with his brother and disappered in the remote African wilderness.",
        "Fixed wing pilot Roan went up looking for him in the national park along with 70 local villager but the boys tracks were washed away by rain and trackers had to find them again.Six days later they picked up the missing boys tracks eleven miles from the village deep in hyena territory and again Roan took off and several hours later he spotted the boy.He used his aircraft to guide the villagers to the starving boy who had survived six days and nights in the wild full of predators suffering only a multitude of painful mosquito bites.The villagers renamed the boy Roan after his saviour and presented the pilot with a goat.The Sheldrick Wildlife Trust was founded by conservationist Dame Daphne Sheldrick in 1977 in memory of husband David and covers over 2 million acres of Kenyan wilderness.",
        "It is the world's most successful orphan elephant and rhino rescue, rehabilitation and reintergration projects in the world and is now run by Daphne's CEO daughter Angela.She married Robert Carr-Hartley and they both run the SWT ably helped by their two daredevil and dashing sons Taru and Roan who are both experienced fixed wing and helicopter pilots.",
        "They are also hands-on rangers working in the bush to conserve and rescue the wildlife and the land.A family friend said: 'From the moment they were born they were real life Mowgli's and despite their youth there is not very much they don't know about the African wildlife.",
        "'They are as at home in the air as they are in the bush doing what they can for Kenya's animals and this amazing chopper rescue is something they will just take in their stride.'Just another day at work in a very beautiful office for that pair' she said.One person commented on the You Tube video: 'What incredible flying and to get that close to the tanker in those flying conditions was just remarkable – both very very brave'.Another said: 'Absolutely amazing.God bless you all.The men operating that helicopter must have nerves of steel.Good job guys and thank you so much. It was that truckers lucky day'.Trust founder Daphne Sheldrick who was born in Kenya but had British roots was made an MBE by the Queen in 1989 then a Dame in 2006 for her life of untiring conservation work.Her daughter Angela – the mother of Taru and Roan – took over as CEO of the Trust in 2001 and sadly her mother Daphne passed away in 2018 at the ripe old age of 83.",
        "Taru and Roan's father Robert Carr-Hartley as well as running the Trust with his wife is a top helicopter pilot and award winning photographer who was a consultant on blockbusting films Out of Africa and Lion King."
    ]
}