{
    "articleURL": "/sport/college-basketball/article-12060509/LSU-Angel-Reese-visit-Joe-Biden-White-House-celebrate-March-Madness-win.html",
    "content": [
        " LSU comfortably defeated Iowa in the national championship game last monthAngel Reese was vocally critical of Jill Biden &amp; said she would not go to the WH DailyMail.com provides all the latest international sports news President Joe Biden and First Lady Jill Biden will welcome the LSU women's and UConn men's basketball teams to the White House on May 26 to celebrate their national championships.",
        "The women's basketball team, including the polarizing Angel Reese, will be the fourth squad from LSU to celebrate a national title at the White House -- joining the Tigers' baseball, football, and track and field teams. Times of the ceremonies will be announced at a later date.While the Lady Tigers predictably aren't going alone, they will not be joined by their national championship opponents, Iowa. The White House's resident doctor bizarrely suggested the defeated Hawkeyes should join LSU at the Oval Office. Naturally, this received widespread ridicule and criticism.It is only custom for the winner of a championship to be invited to the capital. A team has never attended to celebrate its loss on the big stage. ",
        "'Last night, I attended the NCAA women's basketball championship,' the First Lady said last month. 'So I know we'll have the champions come to the White House, we always do. So, we hope LSU will come but, you know, I'm going to tell Joe I think Iowa should come, too, because they played such a good game.' Reese called the First Lady's invitation to visit the White House to celebrate their title victory a 'joke' amid the hypothetical possibility of Iowa's inclusion.'If we were to lose, we would not be getting invited to the White House,' she said on I Am Athlete's 'Paper Route'.",
        "'Remember she made a comment about how both teams should be invited because of sportsmanship. I'm like, \"Are you saying that because of what I did?\"'Stuff like that bothers me because you are a woman at the end of the day, white, black, Mexican, it doesn't matter. You're supposed to be standing behind us before anything.According to the White House, Biden 'spoke to LSU Tigers women's basketball head coach Kim Mulkey' to congratulate her on winning the national championship over Iowa and to invite the team to the White House.Additionally, Biden spoke to Women's Final Four Most Outstanding Player Angel Reese, 'to congratulate her on LSU's historic season and championship win.'",
        "It wasn't revealed if the 80-year-old apologized for his wife's rather strange suggestion. Last month, Reese confirmed she would attend the White House after all despite initially stating she would instead visit the Obamas -- despite never receiving an invite from Barack and Michelle.'In the beginning we were hurt -- it was emotional because we know how hard we worked all year for everything,' Reese said while on ESPN last month.'You don't get that experience ever, and I know my team probably wants to go for sure and my coaches are supportive of that so I'm going to do what's best for the team and we've decided we're going to go. I'm a team player. I'm going to do what's best for the team. I'm the captain.'",
        "LSU's Reese caused controversy for taunting Iowa star Clark in the final throes of the national title game, which the Tigers won comfortably. Reese waved her hand in front of face, an ode to John Cena's WWE diss move -- which Clark did during the Final Four vs. South Carolina. ",
        "Defenders of Reese quickly pointed to the taunt being identical. However, they neglected to grasp that - conversely to Clark - Reese repeatedly used the gesture in the sequence, moving around the court in an attempt to goad Clark as opposed to the once-off motion by the Naismith Player of the Year in the previous game. The LSU Most Outstanding Player of the NCAA Tournament then tapped her ring finger at Clark, signifying her imminent championship ring. Some of the media's largest personalities, including Shannon Sharpe and Shaquille O'Neal were quick to suggest the harsher critique of Reese was based on her skin color. In other words, because Reese is African American and Clark is Caucasian.For UConn, this will be the fifth visit for its men to the White House. The Huskies met with President Bill Clinton in 1999, President George W. Bush in 2004 and President Barack Obama in 2011 and 2014. Coach Dan Hurley and UConn defeated San Diego State 76-59 on April 3."
    ]
}