{
    "articleURL": "/wires/ap/article-12038467/Bank-stocks-continue-fall-following-First-Republic-demise.html",
    "content": [
        "NEW YORK (AP) - Regulators have barely written the epitaph for First Republic Bank, but investors on Wall Street have already moved onto speculating which bank might be the next to fail.",
        "Bank stocks fell sharply Tuesday, led downward by smaller banks with heavy exposure to uninsured deposits and commercial banks such as Western Alliance Bank, PacWest Bancorp, Comerica and Zions Bank. Shares of Western Alliance dropped 15% and PacWest fell 28%, with trading of both stocks halted briefly due to high volatility.The second day of bank stock declines comes after regulators closed First Republic Bank on Monday and sold the vast majority of its operations to JPMorgan Chase in a fire sale. It was the second-largest bank failure in U.S. history and the third bank failure in six weeks, following the collapse of Silicon Valley Bank and Signature Bank.While discussing the deal to buy First Republic, JPMorgan CEO Jamie Dimon said Monday that he believed \"this part of this (banking) crisis is over.\" But the resolution of First Republic's ordeal didn't resolve all the problems at other banks.The ongoing concern among investors and regulators is that banks such as PacWest have large amounts of uninsured deposits - those above $250,000 - which have become a larger liability because rich and wealthy clients have shown themselves willing to pull their money out at the first sign of trouble. The banks are also exposed to low-interest loans that are now worth less on the open market due to the fact they were underwritten when interest rates were substantially lower.",
        "When Western Alliance reported its results last week, the bank noted that it had to start selling off some of its commercial and industrial loans in order to restore the health of its balance sheet, with the bank taking a loss on most of those loans. PacWest reported a loss in the first quarter because it had to write down some of the loans it planned to sell to clean up its own balance sheet.",
        "There are also lingering fears about commercial real estate loans, which have been a sore spot since the pandemic changed employee behavior around the the need to be in the office five days a week. Companies are needing less office space, and larger employers like Facebook parent company Meta, Google, Microsoft, Amazon and banks have been laying off employees, which should impact the demand for office space as well.Roughly a third of PacWest's balance sheet is tied up in construction and commercial real estate loans, while more than half of Western Alliance's balance sheet is commercial real estate, industrial loans and construction. These were partially the reason why credit rating agency Moody's downgraded Western Alliance's credit rating last month.While banks typically benefitted from higher interest rates because they can charge more for loans, depositors are now increasingly shopping around for higher yielding accounts as well. That means banks are paying more to depositors, which is impacting profitability."
    ]
}