{
    "articleURL": "/news/article-12059677/16-bank-branches-including-HSBC-NatWest-Halifax-close-week.html",
    "content": [
        "Latest cull will see closures for HSBC, Lloyds, NatWest, TSB and HalifaxREAD MORE: All 76 bank branches that are shutting its doors this month Nearly twenty bank branches are set to close this week in another blow to the UK's High Streets. ",
        "In the latest cull are 16 branches for HSBC, NatWest, Lloyds, TSB and Halifax. They are some of the first of the 76 branches closing in this month alone.Banks say they are cutting branches because they have noticed big drops in the number of customers visiting, as people opt for using their mobile phones or computers to manage their money instead. But closures are expected to isolate older or more vulnerable customers who do not have access to internet or online banking and require in-person advice.It was also recently revealed that a fifth of customers are now even more isolated as they have to make an hour round-trip to visit their nearest branch - with dozens of towns across the country being left without a single bank.",
        "A survey conducted in April revealed that a third of people in the UK would rather do all their banking in person. But many people still want to go into their local bank branch to seek human advice amid cost-of-living pressures, despite increasingly being able to do so digitally, the survey found.While 44 per cent of over-55s said they would rather visit a branch, the survey found it is not just the older generations who are hesitant to fully switch to mobile banking.",
        "A fifth of 18 to 34-year-olds said they prefer to do all their banking in person, according to the survey of more than 2,400 banking customers by professional services company Accenture. Furthermore, while 38 per cent of Britons now have a digital-only bank account, just a tenth use it as their main bank, it found.Customers still want the option to visit a branch or speak to staff, or have concerns about data security and the financial stability of digital banks, Accenture found.The flurry of closures have left some towns without a single bank.  The last bank in Fishguard, North Wales, closed in 2018 and residents now have to travel 15 miles each way to find the nearest branch, in Haverfordwest.In Knaresborough, North Yorkshire, there has not been a bank since 2020, with a promised 'banking hub' failing to materialise. The nearest bank is in Harrogate, nearly four miles away.",
        "By the end of this year HSBC, NatWest, Nationwide, Barclays, Virgin Money, TSB, Santander and Lloyds will have shut down 2,277 outlets since 2019.The worst offender is Barclays with 614 branches either closed down or set for closure over that period, according to Which?.Here is the full list of the branches set to close this week: HSBC closures",
        "Tuesday May 926 Biggin Street, Dover, England, CT16 1BJ5 High Street, Brecon, Wales, LD3 7AH104 Front Street, Arnold, England, NG5 7EG186 Broadway, Didcot,England, OX11 8RPWellington Square, Minehead, England, TA24 5LHHalifax closuresWednesday May 1079 Victoria Road, Surbiton, England, KT6 4NSLloyds Bank closuresWednesday May 101C Church Street, Weybridge, England, KT13 8DAThursday May 1117 Heath Road, Twickenham, England, TW1 4AW14 High Street, Whitstable, England, CT5 1BHThe Square, Beeston, England, NG9 1EFNatWest closuresTuesday May 9Exeter, 18 St. Thomas Centre, England, EX4 1DEWednesday May 10Bootle, 329 Stanley Road, England, L20 3EHThursday May 11Crawley, Gatwick Road, England, RH10 9RFFrome, 4 Market Place, England, BA11 1AETSB closuresTuesday May 937 Castlegate, Newark, England, NG24 1BDThursday May 11675 Ormskirk Road, Wigan, England, WN5 8AH"
    ]
}