{
    "articleURL": "/wires/ap/article-12057085/Napoli-celebrates-title-fans.html",
    "content": [
        "Napoli players and fans chanted \"It´s us, it´s us, we are the champions of Italy\" as the southern team marked winning the league title with a joyous celebration lasting more than two hours at the Stadio Diego Armando Maradona.",
        "The partying outside the stadium will likely go on many more hours, days and even weeks - long after Napoli is presented with the trophy at the end of the season.Napoli beat Fiorentina 1-0 in Serie A on Sunday in its first home match since ending its 33-year wait for the scudetto with a 1-1 draw at Udinese on Thursday.\"When you see such a strong outpouring of joy it makes you happy to know you have contributed a little bit so there could be this atmosphere here,\" Napoli coach Luciano Spalletti said.\"We haven't slept at all the past couple of days.\"The team walked around each corner of the stadium, dancing and singing, decked in Napoli scarves and waving flags. They also took turns giving Hirving Lozano piggybacks as the Napoli winger had injured himself during the match.",
        "That started a night of further celebrations in the stadium - directed by Italian film director Paolo Sorrentino - accompanied by Neapolitan musicians.Around 55,00 fans were packed into the Stadio Diego Armando Maradona, with thousands more outside.After a short film and speeches by Sorrentino and Napoli president Aurelio De Laurentiis, the players and staff were introduced back onto the field one-by-one and with each of them wearing a special shirt with three images of themselves on it. Napoli captain Giovanni Di Lorenzo was first to the song \"Eye of the Tiger.\"",
        "Khvicha Kvaratskhelia came out wrapped in a Georgia flag, while Victor Osimhen had a special face mask with the symbol of the scudetto with the number three on it. He had worn the same mask during the match and vowed to keep it as a special souvenir.Spalletti was last out.\"It's really true that Naples is the city of miracles, if you managed to get me to win a title, anything can happen!\" he said.Fireworks were then let off inside the stadium - and throughout the city - while \"We are the champions\" played. The singing and dancing continued, with Napoli midfielder Matteo Politano even doing so while straddling the crossbar of the goal.The celebrations had started before the match and the Fiorentina players gave the Napoli team a guard of honor when it walked out ahead of kickoff.The pre-match choreography at one end of the stadium depicted a giant Italy flag and the number three to signify Napoli´s third Italian championship - and the first since Diego Maradona led the team to two titles in 1987 and 1990.Fans were singing and chanting in and around the stadium hours before kickoff, while the team bus was accompanied from the hotel by flag-waving supporters on scooters as it went through streets lined by more cheering fans.",
        "The noise inside the stadium was ramped up still further when Napoli came out for the warmup. Politano had dyed his hair in the club's blue colors, while teammates Elif Elmas and Giovanni Simeone had blue streaks in their hair.Simeone´s father - Atlético Madrid coach Diego Simeone - was among those present.There were people standing around the field with giant blue balloons, each with a banner hanging off it representing a player and their number.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}