{
    "articleURL": "/news/article-12041795/King-Charles-arrives-Coronation-rehearsals-Westminster-Abbey.html",
    "content": [
        "Follow MailOnline's new Royals page to keep up to date on all the latest news about the Royal Family King Charles and Prince William led the Royal Family today in rehearsals for the Coronation at Westminster Abbey.",
        "With just days to go until the historic event, His Majesty was pictured beaming outside the church in central London as he arrived with the Prince and Princess of Wales and their children Prince George, nine, Charlotte, eight, and Louis, five. Princess Anne and Queen Consort Camilla were there to greet the Dean of Westminster and other church officials before they went inside. The royals were also joined by Prime Minister Rishi Sunak.It comes after thousands of personnel from the Army, Royal Navy and Royal Air Force marched from Buckingham Palace to the Abbey in the early hours of this morning as they practiced for the big day on Saturday, May 6.  The Diamond Jubilee State Coach and Gold State Coach were also used in the full-scale rehearsal shortly after midnight.Royal fans waited for more than three hours for the parade to make a return journey down the Mall. And commuters heading home from London Waterloo were treated to extraordinary scenes as they saw some 6,000 soldiers march through the station on their way to the rehearsals. ",
        "After today's rehearsals, King Charles gave a wave to throngs of fans as he travelled back to Buckingham Palace.Supporters cheered as his Bentley drove past. American fan Justin Klamerus, who has flown in for the Coronation from Atlanta, Georgia, told MailOnline: 'Who would've thought that I would get to see the King of England so close?",
        "'I arrived on Monday I went straight to Windsor and did see really very much. 'But this was absolutely amazing. It's an experience that I will remember forever, as I'm a big fan of the royal family, and that's why I came here.' 'I also saw Princess Anne going by earlier and as they say, great things always come along in twos! ''But I am here to witness history being made. I wish the King all the very best. I'm sure he'll be a great ruler for Britain.'Around 25 tents have been set up along the Mall by fans who are camping out for the Coronation. Among the first to take up position was careworker Lucy Edwards, 51, from Bristol, who will be joined by her 74-year-old mother Linda and teenage son Jacob tomorrow.She said: 'It has been very, very cold and the ground here is very hard to sleep on.'I have witnessed most of Charles's life, his marriage, his divorce, and when he got married again. Now I'm here for the Coronation.'All of these events that made him the man that he is and he appears happy in his life. He is going to be a great King and bring the country together.'Mother of five Sharon McEwan, 62, from Kilburn, said: 'Hail King Charles. He is going to make the nation wonderful throughout his reign.",
        "'I am a regular at royal events and enjoy meeting the same people who love the royal family and meeting new people from all over the world. This will be a fantastic day.'Faith Nicholson, 61, from Althorne, Essex, was draped in Union Jack colours and carried a Paddington Bear in honour of the Queen's sketch with the character at her Platinum Jubilee last year. She said: 'There is so much to celebrate about our Royal Family. They are loved the world over, and we will see that over the next few days.'They are the best advert for our country. You cannot fail to love them. And Charles will make a magnificent King with his sense of fair play, and he has been a pioneer in so many ways over things like environmental concerns.'I have been to all the major Royal occasions and they have provided such positive memories for me as Saturday will do too.",
        "Here is a rundown of all the timings so far for the Coronation this Saturday:5am - Pedestrian restrictions in Central London come into effect6am - Viewing areas open along the procession route.7.15-8.30am - Guests for Westminster Abbey begin to arrive at security check points in Victoria Tower Gardens.9am - Congregation to be seated inside the Abbey.9.30-10.45am - Heads of state, overseas government representatives, Government ministers, First Ministers, former PMs, foreign royals and members of the royal family arrive.9.45am - The Sovereign's Escort of the Household Cavalry begin to gather ready for the procession from Buckingham Palace.10.20am - The King and Queen Consort's procession sets off from the Palace.10.53am - The King and Queen Consort arrive at Westminster Abbey.11am - Charles and Camilla enter the Abbey through the Great West Door and the service begins.12pm - The King is crowned. The Archbishop of Canterbury places the St Edward's Crown on Charles's head. Trumpets will sound and gun salutes will be fired across the UK.1pm - The service ends and the newly crowned King and Queen begin their coronation procession back to Buckingham Palace in the Gold State Coach.1.33pm - Charles and Camilla are expected to enter Buckingham Palace through the Centre Arch.1.45pm - The King and Queen Consort receive a royal salute from the military in the Palace gardensAround 2.15pm - The King, Queen Consort and members of the royal family appear on the Palace balcony to watch the flypast.",
        "'It is such an incredible thing to be among many thousands of people who have the same love for the Royal family. I can't wait for Saturday. But I'll be here until then. 'Professor Chris Imafidon, who has worked closely with the Prince's Trust, said: 'I run an organisation called Excellence in Education and the King has been very supportive.",
        "'When there were riots in Hackney in 2011, neither the prime minister or any of the other leading politicians visited, but Charles came by himself and quietly without any press or fuss.'He really cares about people and is that kind of dedicated man. And we have to show our love and support for him on Saturday and that is why we are here.'I do feel sorry about the situation with Harry and Meghan. What she hasn't accepted is that joining the Royal family is duty and not Hollywood.'But I do think the blood ties are very strong and Harry and Meghan will be reunited with Charles and the rest of the Royal family. It is my sincere hope.'Yesterday, crowds gathered in St James's Park to find the best spots near the palace with many trying to spot their relatives in their military outfits.Soldiers carried instruments including saxophones, trumpets, horns and cymbals but only the drums were played by marching troops before they marched back down the Mall after 3am.The parade kicked off when soldiers dressed in bright yellow uniforms began the short journey and the brass band on horseback practised as they accompanied the stage coach. Onlookers skipped along next to the stage coach and ran after the regiments of mounted soldiers that followed. Soldiers from a wide variety of regiments marched down the Mall after 1am.",
        "Buckingham Palace remained mostly silent with soldiers quietly maintaining protocol until a regiment playing the bagpipes brought the area to life shortly after 2.30am.John Loughrey, 68, claimed to be the first person to set up his tent on the Mall on April 27, nine days before the Coronation.Yesterday he said: 'We like the build up, the rehearsals and seeing people throughout the day. There are a lot of tourists and they come and say they wish they had something like this in their country.'",
        "Mr Loughrey explained he had been camping outside royal events for 26 years and spent a month camping out after Princess Charlotte was born. He added: 'We did a lot of research. We (picked this spot) because there are no trees so you can see the Red Arrows.'Other soldiers were spotted parading in Parliament Square and practised changing position as Big Ben chimed.Artillery regiments rehearsed moving cannons on horseback and soldiers were seen pretending to fire the ceremonial weapons.The procession returned to Buckingham Palace shortly after 3am with bands in full swing. The Gold State Coach was spotted passing Buckingham Palace shortly after 3.20am.The rehearsal took place hours after a man was arrested outside Buckingham Palace after throwing suspected shotgun cartridges into the palace grounds.",
        "The man was held on suspicion of possession of an offensive weapon after he was searched and a knife was found, but he was not carrying a gun.",
        "Cordons were put in place and Scotland Yard said a controlled explosion was carried out as a precaution as the man had a 'suspicious bag'.Ricardo Sousa and Elizabeth Godfrey, who are among those camping at the Mall, said they 'didn't even know anything had happened'.'We work not far from here and we're night owls so instead of going to bed we thought we should come down and watch,' the pair explained.'It's something to be part of and it's nice to see the military from different parts of world united.'Gemma Gale, whose husband is a Royal Navy reserve who was marching during the rehearsal, said it was 'disgusting' that there was a police incident earlier in the night.Ms Gale, 41, said: 'We're from the south coast and my husband is marching tonight. This is brilliant, it's all amazing.'It doesn't surprise me something happened earlier tonight, unfortunately, it's to be expected.'With events like this it's opportunists, they're all out because they have a big audience with the coronation. It's not right, it's disgusting.'At least 15 tents are already positioned along the mall and royal fans got to test out what view they will have of the King when a carriage was pulled along the Mall by white horses.",
        "With just four days to go until the coronation, superfans have said they are prepared to camp out for several days to secure front-row seats to Saturday's festivities.'This is a moment in history. We are so fortunate that we are living through a coronation,' Marie Scott, who was among the first to set up camp on the avenue leading to Buckingham Palace, said yesterday.Ms Scott, 52, has been attending royal events since the wedding of Prince William and Kate Middleton in 2011. She said being there in person is not the same as watching it from a TV screen.'You've got to see them with your own eyes and get the feel of everything around you,' Ms Scott explained as she finished setting up a tent.'It's magical, seeing all the military, the military bands coming down. It makes you proud, proud to be British.'",
        "Ms Scott is with a group of friends, who have reserved their spots days in advance. Among them is Carol Foster, 63, who has been camping on The Mall since last Thursday.'We wanted to get a good spot, because we think it's going to be busy. And it's a once-in-a-lifetime thing,' Ms Foster said after her first night of camping.Also part of their group is Patrick O'Neill, who flew in from Belfast in Northern Ireland and is a seasoned attendee of royal events.He said he has come to 'soak up the atmosphere' in the run-up to the coronation and to spend time with people who share a common passion.'It's important that I'll be with my friends that I've met over the years from all different places in the country,' said Mr O'Neill, donning a plastic crown and wrapped in a Union Jack flag with a portrait of King Charles.'It's a real interest. It's a real passion... It's hard to put into words how much it means to me,' he said.",
        "Further up the Mall and a few steps closer to Buckingham Palace was Faith Nicholson, who shares a long list of royal events that she has attended over the years.'It's a great atmosphere, everybody is really kind and everyone looks after each other,' Ms Nicholson said. 'Once it really kicks off, it's really memorable'.The upcoming coronation - the first since 1953 - has also attracted visitors from abroad, like Thomas Moore, an American with English roots who travelled from near Salt Lake City with his wife Stephanie.Mr Moore, 80, said they have crossed the Atlantic for many royal events over the years, the last being Queen Elizabeth II's Platinum Jubilee, marking her 70 years on the throne, last year.'I get goosebumps when I see a King driving by. I'm part of an old generation where that means a lot,' Moore said as they set up folding camping chairs.'This is a very special occasion. This is going into your blood.'"
    ]
}