{
    "articleURL": "/wires/pa/article-12053993/Camilla-s-Bruce-Oldfield-coronation-gown-decorated-wildflowers-bunting.html",
    "content": [
        "The Queen’s coronation gown, designed by Bruce Oldfield, is a tailored ivory, silver and gold coat-like dress embroidered with delicate garlands of British wildflowers.",
        "Motifs of daisy chains, forget-me-nots, celandine and scarlet pimpernel from fields and hedgerows, representing the King and Camilla’s affection for nature and the nation’s countryside, are among the embellishments.Celebratory bunting, in antique gold and silver thread, is also intertwined amongst the swathes of blooms on the historic dress, worn for Camilla’s crowning.On top, for her arrival at Westminster Abbey, the Queen wore the crimson velvet Robe of State with long train originally made for Queen Elizabeth II in 1953.",
        "The King meanwhile wore his grandfather George VI’s crimson Robe of State with a new crimson Coronation Tunic, with cream silk overshirt and Royal Naval trousers for his arrival. His regal red Coronation Tunic, made by Ede and Ravenscroft, was inspired by similar tunics worn by George V and George VI at their coronations.Camilla’s couture coronation dress is cut from Peau de Soie, a silk fabric with a dull lustre finish, and woven by Stephen Walters in Suffolk, and has bracelet length sleeves, a strong shoulder and a wide V-neck neckline.Oldfield’s vision was to create a sophisticated and modern dress that showcases Camilla’s style and personality in its details, Buckingham Palace said, describing it as “simple and tailored”.Oldfield, one of Camilla’s favourite go-to designers, used to create outfits for the late Diana, Princess of Wales.",
        "“I gave Diana her glamour and Camilla her confidence,” he is once said to have remarked.",
        "The curved shape-lines of the dress swoop into a short train, the length and shape of which was designed to complement the Robe of State, and Camilla’s new purple velvet Robe of Estate worn for her departure from the Abbey.The dress has an embroidered skirt underneath, and is embellished on the front hem and on the cuffs of each sleeve with the flower emblems of the four nations of the United Kingdom – a rose, a thistle, a daffodil and a shamrock.It features Oldfield’s signature panelling to the back and was made in his couture workrooms in Battersea, south London, with his team of pattern-cutters, seamstresses and embroiderers.Working with an artist and a textile designer, every detail of the embroidery was painstakingly transferred onto the paper patterns ready for the embroiderers could begin their work.For the King’s outfit, his Robe of State – which is nearly 90 years old – was conserved by the Royal School of Needlework, with the lining and gold lace worked on by Ede and Ravenscroft.His traditional Coronation Tunic is made from Order of the Bath crimson satin, trimmed with gold artillery lace.The cream silk overshirt is based on the design of similar ones worn by George V and George VI at their coronations.",
        "The overshirt was made Turnbull &amp; Asser in Gloucestershire using English home spun silk, and the collars and cuffs feature embroidered oak leaves and acorns.The Royal Naval trousers belong to Charles and he regularly wears them as part of his Royal Navy full ceremonial tailcoat."
    ]
}