{
    "articleURL": "/wires/ap/article-12039545/Texas-man-suing-abortion-accused-abuse-court-docs.html",
    "content": [
        "GALVESTON, Texas (AP) - A man who filed a lawsuit in Texas against three women he said helped his now-ex-wife obtain medication for an abortion is accused in a new court filing of using the lawsuit as an extension of the manipulative, controlling and emotionally abusive behavior he displayed toward her during their marriage.",
        "Marcus Silva had found the first pill that begins a medication abortion while secretly going through his then-wife's purse last summer but instead of talking to her about it or throwing it away, he took photos of text messages on her phone between her and two of her friends, according to a document filed Monday on behalf of those friends, who are two of the defendants in Silva's lawsuit.The filing, which asks for Silva's claims to be dismissed, says Silva broke the law by accessing his wife´s phone without her consent, and invaded her friends´ privacy by reading her text exchanges with them.\"He wasn´t interested in stopping her from terminating a possible pregnancy,\" the filing said. \"Instead, he wanted to obtain evidence he could use against her if she refused to stay under his control, which is precisely what he tried to do.\"Silva´s lawsuit, filed in March in Galveston County, says one of the two friends arranged the delivery of the abortion medication through the third woman, who is also named as a defendant.Houston attorney Rusty Hardin is representing the two defendants who were friends with Silva's wife. Hardin's two clients, the filing says, talked to Silva's wife about her options, shared information on resources and supported her decision to self-administer abortion medication.",
        "Silva´s wife filed for divorce in May 2022, but continued to live with him, the filing said. She took the medication in July 2022, weeks after the Supreme Court struck down the constitutional right to abortion that had been in place since 1973. Their divorce was finalized this February and Silva filed the lawsuit the next month.Silva's lawsuit is another test of state-enforced abortion bans since the U.S. Supreme Court overturned the Roe v. Wade decision. Texas has one of the strictest bans in the country, outlawing the procedure in nearly every case with the exception of medical emergencies.Texas law protects women who get an abortion from being held liable.Silva is being represented by Jonathan Mitchell - a former Texas solicitor general who helped create one of the state´s abortion bans. Mitchell did not immediately return a call for comment on Tuesday."
    ]
}