{
    "articleURL": "/wires/reuters/article-12041703/Brazil-police-raid-Bolsonaros-home-COVID-vaccine-probe-source.html",
    "content": [
        "By Lisandra Paraguassu and Ricardo Brito",
        "BRASILIA, May 3 (Reuters) - Brazilian police on Wednesday raided former President Jair Bolsonaro's home, arrested his trusted aides, and seized his cell phone as part of a probe into his COVID-19 vaccination records.The investigation may answer questions about how Bolsonaro, a strident coronavirus skeptic who vowed never to get a COVID vaccine, was registered as vaccinated in health records made public in February.Supreme Court documents showed federal police had found evidence of tampering with Bolsonaro's vaccine records in his last weeks as president in late December, before he flew to the United States, where most foreign visitors must be vaccinated.Bolsonaro confirmed the raid on his home in Brasilia to journalists and reiterated that he had never taken a COVID vaccine. He denied any role in allegedly forging documents.\"For my part, there was nothing falsified. I didn't take the vaccine. Period,\" he said, adding that his phone was seized.The vaccine probe is one of many putting the former far-right leader under pressure, including investigations into alleged voter suppression, his attacks on the legitimacy of Brazilian elections, and embezzlement of foreign gifts.Bolsonaro has denied any wrongdoing in those cases.Federal police in a statement said they were serving 16 search warrants and six preventive arrest warrants in Brasilia and Rio de Janeiro as part of the operation, without naming those targeted.",
        "The Supreme Court, which is overseeing the case, released court documents on Wednesday that included an arrest warrant for Mauro Cid, one of Bolsonaro's personal assistants when he was president, who stayed on as an aide after he stepped down.Police cited evidence that Cid designed a scheme in which Bolsonaro was registered on Dec. 21 as vaccinated against COVID, court documents showed. The entry, made in a public health office in suburban Rio de Janeiro, was removed a week later, according to the documents.Bolsonaro's personal security officers Max Guilherme and Sergio Cordeiro, who have stayed on as part of his detail, were also arrested in Wednesday's operation over accusations they falsified their vaccine records before flying with Bolsonaro to the United States.Cid and the other aides could not immediately be reached for comment.Police said they were investigating a scheme to insert \"false data\" in a national COVID-19 database between November 2021 and December 2022.\"As a result, they were able to issue vaccine certificates and use them to circumvent restrictions imposed by public authorities in Brazil and the United States,\" police said.The investigation points to \"ideological\" reasons for circumventing vaccination rules, police said, \"in order to keep up a discourse of attacking vaccination against COVID-19.\"\"We trust that all legal doubts will be cleared up and it will be proven that Bolsonaro did not commit illegal acts,\" Valdemar Costa Neto, the head of Bolsonaro's political party, wrote on social media. (Reporting by Lisandra Paraguassu and Ricardo Brito; Additional reporting by Anthony Boadle in Brasilia and Gabriel Araujo in Sao Paulo; Editing by Brad Haynes, Daniel Wallis and Rosalba O'Brien)"
    ]
}