{
    "articleURL": "/wires/reuters/article-12038073/US-concerned-Chinas-punitive-actions-American-firms.html",
    "content": [
        "By Michael Martina and David Brunnstrom",
        "WASHINGTON, May 2 (Reuters) - U.S. Ambassador to China Nicholas Burns said on Tuesday Washington was very concerned about China's recent \"punitive\" action toward some U.S. companies, and that foreign firms are delaying investments in the country due to uncertainty about the openness of its economy.Businesses groups have warned about the rise in China's use of exit bans, heightened scrutiny toward due diligence firms, and the vague wording of China's new counterespionage law, which bans the transfer of any information related to national security and broadens the definition of spying.Burns, speaking by video link with the Stimson Center think tank in Washington, said the legislation could \"imperil\" academic researchers, professors, and journalists, and make illegal mundane activities and due diligence needed before companies can make rational business decisions.\"If you put that together with some of the punitive actions that the government here in Beijing has taken against several American companies recently, we're very concerned about this,\" Burns said, adding: \"We intend to have a full discussion with the government here about it.\"\"We think American businesses here ought to be free of intimidation from the government, and ... they shouldn't be targeted mainly because there are political differences and competitive differences in the U.S.-China relationship,\" Burns said.U.S. corporate due diligence firm Mintz Group said in late March authorities had raided its Beijing office and detained five local staff. China's foreign ministry said at the time Mintz was suspected of engaging in unlawful business operations. Police visited Bain &amp;amp; Co's office in Shanghai and questioned staff, the U.S. management consultancy said last week.",
        "China has also said it will conduct a cybersecurity review of products sold in the country by U.S. memory chip manufacturer Micron Technology Inc, amid U.S. moves to bar Chinese access to cutting-edge chip technology.Chinese leader Xi Jinping has emphasized national security since taking office in 2012 as suspicion of the U.S. and its allies grows, but that focus contrasts with Beijing's message that it is opening up to overseas investment and travel after emerging from the isolation of some of the world's tightest COVID-19 curbs.Burns said a lot of foreign firms were delaying making major investments until they could see some consistency in messaging from China.He said he had warned American companies to carefully abide by a U.S. law that prohibits importing goods from China's Xinjiang region over concerns about forced labor by Uyghurs and other Muslim ethnic minorities.\"Don't get close to the line on that particular law. Observe it in every respect,\" Burns said.But Burns said China and the U.S. needed greater stability in relations, and that China's COVID restrictions and granting of fewer visas meant only about 350 American students were studying there.\"We've had a decoupling of our societies over the last three years. It's not healthy. It's not smart,\" Burns said. (Reporting by Michael Martina, David Brunnstrom and Doina Chiacu; Editing by Chizu Nomiyama and Jonathan Oatis)"
    ]
}