{
    "articleURL": "/wires/reuters/article-12059667/Emerging-markets-draw-net-inflows-April-China-sees-outflows.html",
    "content": [
        "NEW YORK, May 8 (Reuters) - Foreign investors funnelled nearly $10 billion into emerging market portfolios in April, with Asia taking the lion's share despite net outflows from China, data from the Institute of International Finance shows.",
        "Net inflows have now extended to four consecutive months, the longest streak in over a year, although volumes are much lower than in the first two months of the year, according to the data released on Monday.April saw $7.7 billion of net inflows to EM debt securities and $2.1 billion to stocks. The combined $9.8 billion compares to $9.1 billion in March and a $7.6 billion outflow in April 2022.Flows to Asia were the strongest regionally at $5.2 billion, even as China posted outflows of $1 billion in debt and $3.8 billion in stocks.\"China securities suffered outflows during April, as the positive effect of the reopening fades away,\" said IIF economist Jonathan Fortun in a statement.Chinese debt has seen outflows in eight of the past 12 months, the data shows, while equities posted a monthly outflow after five months of inflows.April marked the second straight month that total inflows have fallen below $10 billion after January saw a massive $68 billion cash pull toward EMs and February followed with $19 billion.\"For the coming months, we expect the level of inflows to lower, mainly explained by a more cautious market due to renewed market turmoil, low growth in G3 economies, and geopolitical risk steaming from upcoming elections for a handful of EMs,\" Fortun wrote.",
        "Turkey, which holds elections on Sunday, saw its fifth consecutive month of outflows from equities while flows to debt securities were positive for a third month running, according to preliminary IIF data.In a move closely watched by emerging market investors, the U.S. Federal Reserve last week raised its benchmark interest rate by a quarter of a percentage point to the 5.00%-5.25% range.But in a bullish signal to emerging markets, which can benefit from lower rates in developed markets, the Fed stopped saying it anticipates further rate increases will be needed.Futures traders are pricing in a 25 basis-point Fed rate cut as early as September and two by November according to the CME's FedWatch tool.(Reporting by Rodrigo Campos; Editing by Susan Fenton)"
    ]
}