{
    "articleURL": "/wires/ap/article-12038317/Furyk-appointed-Presidents-Cup-2024-matches-Canada.html",
    "content": [
        "Jim Furyk gets another crack at being U.S. captain for a road game, this time the Presidents Cup in Canada.",
        "The PGA Tour on Tuesday introduced Furyk as captain for the 2024 matches at Royal Montreal, where the Americans will try to win for the 10th consecutive time.Mike Weir previously was named International team captain for the Presidents Cup, which returns to Canada for the second time.\"Being selected by my peers to take on the role as captain of the U.S. Team for the 2024 Presidents Cup is truly an honor that I am humbled and excited to accept,\" Furyk said.Furyk is the fourth Presidents Cup captain - and second in a row - to have been a Ryder Cup captain previously. He had that job in 2018 in France against a hostile crowd, and it ended with a seven-point European victory.\"My favorite question is, `Would you have done anything differently?´ I laugh,\" Furyk said in an interview in October, after he served as an assistant Ryder Cup captain to Steve Stricker at Whistling Straits. \"How much of an arrogant (person) would you have to be to say, `No, I´d do it the same way.´ Of course I´d do things different.",
        "\"For the first year or year-and-a-half, that Ryder Cup in France, there wasn´t a week or day that I didn´t think, `This is what I would have done. This is what I could have changed.´\"",
        "The Presidents Cup is different. The Americans have lost only once since the matches began in 1994, and that was in 1998 in Australia. They won last year at Quail Hollow Club in North Carolina against an international team that had been depleted by defections to LIV Golf.Furyk played seven times in the Presidents Cup, including the U.S. victory at Royal Montreal in 2007 when Jack Nicklaus was captain for the fourth time. Furyk also is a back-to-back winner of the Canadian Open, at Hamilton Golf Club in 2006 and Angus Glen in 2007.FATHER FINAUTony Finau's work was not through after his three-shot victory over Jon Rahm in the Mexico Open. A few hours later, he was on the par-3 course under the lights at Vallarta Vidanta playing golf with two of his five children.Sharon Shin, a PGA Tour tournament administration manager, happened to catch a short video of Finau.\"I'm a part-time golfer, full-time father,\" Finau said Tuesday at the Wells Fargo Championship.This was not a one-time occasion. Finau also played with his family and friends at the Bay Course at Kapalua while competing in the Sentry Tournament of Champions. It reminds him of how he fell in love with golf playing in the evening with his father and brother.",
        "\"Hopefully my boys are enjoying it like I was when I was a kid, just being with my dad and my brother,\" Finau said. \"It´s just special to be with them no matter what. If I would have finished second I would have been with them still. My boys were counting on me and that´s something that I take pride in just as a father.\"And, yes, they kept score. Nothing is given in the Finau family.\"Man, I cleaned house last week,\" Finau said with a smile. \"I beat up on my boy fortunately all week on the par 3 and then was able to take the trophy at the Mexico Open. It was a good all-around week in golf for me.\"AUSSIE (TAX) RULESLIV Golf Adelaide was such a hit that players began lobbying for another tournament Down Under because of big crowds and high energy.Turns out there was something else big about the Australian event: taxes.Talor Gooch realized the $4 million he earned for his first LIV Golf title wasn't all that it seemed.\"It was a little bit disheartening seeing 47 1/2(%) because Australian taxes (do) not enter the account,\" he said on The Fore Play podcast. \"And that was coming a week after Uncle Sam paid another another visit. It was a big one, yeah, but it sucked that 47 1/2% was withheld for Australian taxes.",
        "\"By no means am I complaining,\" added Gooch, who won the following week in Singapore for another $4 million payday and now has $8,937,000 (before taxes) in five events this year.INTERNATIONAL CROWNThe International Crown returns to the LPGA Tour this week, one of the most innovative formats and the lone tournament where multiple countries compete against each other.The Solheim Cup was a decade old when South Korea began to emerge as the dominant country in women's golf and Karrie Webb of Australia was winning majors at an amazing clip. So the International Crown, which began in 2014, looked after non-European players.But there's still no place for Lydia Ko of New Zealand except for the Olympics.The eight teams are based on cumulative world ranking of players. Ko recently fell to No. 2 in the world, but only one other Kiwi - Momoka Kobori at No. 185 - is in the top 200 and in the top 500, Hanee Song sits at No. 442.England took a big hit when Georgia Hall (No. 10) and Charley Hull (No. 17) withdrew on Monday. Hall has a nagging foot injury and Hull has been dealing with stomach issues. They were replaced by Alice Hewson (No. 165) and Liz Young (No. 207). England is the No. 5 seed, though its cumulative world ranking (520) now puts it eighth behind China.",
        "MONEY MATTERSScottie Scheffler set a PGA Tour record last year with $14,046,910 in official earnings. That mark lasted all of eight months and won't stand very long.Such is to be expected with massive boosts in prize money on the PGA Tour. Jon Rahm was runner-up in Mexico Open, and with four wins already this year, the Masters champion already has $14,462,840.Still to come are three majors, two $20 million elevated events and two $20 million FedEx Cup playoff events.Scheffler already is at $12.5 million.DIVOTSCameron Kuchar, the 15-year-old son of Matt Kuchar, has made it through the first stage of U.S. Open qualifying. His father is No. 47 in the world and needs to stay in the top 60 over the next three weeks to be exempt for the U.S. Open. Final qualifying for Cameron Kuchar is June 5. ... The European tour has an alliance with the Korean PGA in which the leading three players from the Korean circuit will have a one-year exemption on the European tour. Previously, only the top player from the KPGA received the one-year exemption. ... The PGA Championship at Oak Hill in two weeks is officially a sellout. The PGA Championship is expecting about 225,000 spectators for May 19-22. ... Lydia Ko will play the Saudi-backed Aramco Team Series at Trump International in West Palm Beach, Florida, on May 19-21. It's part of the Ladies European Tour schedule. Ko won the Aramco Saudi Ladies International earlier this year for the second time.",
        "STAT OF THE WEEKPhil Mickelson made $1,584,000 from his two-way tie for second at the Masters. He has made $1,135,000 from his five starts in LIV Golf this year.FINAL WORD\"I practice with Jon a couple days a week, so just being around him has made me a better player. Iron sharpens iron. I hope he´d say the same.\" - Tony Finau on Jon Rahm after his three-shot victory over Rahm in the Mexico Open.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}