{
    "articleURL": "/wires/pa/article-12054705/Harry-s-whistlestop-tour-King-s-coronation.html",
    "content": [
        "The Duke of Sussex’s whistlestop tour to witness his father’s coronation came to an end as Harry headed to Heathrow within hours of the historic ceremony.",
        "Harry had a seat in the third row for the crowning of Charles and the duke’s stepmother the Queen in Westminster Abbey, and was placed two rows behind his brother the Prince of Wales.All eyes were on Harry for his first public appearance alongside the royals since he lambasted his family in his controversial memoir Spare.",
        "The duke chatted to his cousin Princess Beatrice and her husband Edoardo Mapelli Mozzi as he entered the church on Saturday in the drizzling rain.He also nodded and smiled to guests as he processed behind them, walking down the nave of the abbey alone.It is understood the duke wore what he was asked to wear, which consisted of a dark morning suit and tie, his Afghanistan and Jubilee medals pinned to his suit jacket, and a Royal Victorian Order star and neck decoration.",
        "Harry is a Knight Commander of the Royal Victorian Order (KCVO) after being made so by the late Queen in 2015.Buckingham Palace said the appropriate insignia for a KCVO was a star and neck decoration with no mantle.French luxury fashion house Dior tweeted that it had dressed Harry in a custom design by celebrity favourite British-born Kim Jones.The brand has often been a go-to choice for Harry’s wife the Duchess of Sussex.",
        "The duke was seen near Heathrow following the ceremony, with two police outriders appearing to be escorting his car.His son Prince Archie turned four on Saturday, with the duke expected to be rushing back to the US to celebrate his youngster’s birthday.Meghan stayed at home in Montecito, California, with Archie and Princess Lili.",
        "There was no appearance from Harry nor the Duke of York on the Palace balcony for the finale of the day, with the Palace confirming earlier that the ex-working royals had no formal role at the event.For the late Queen’s funeral last September, Harry sat in the second row at Westminster Abbey, behind Charles.The duke, 38, was seated between his cousin Princess Eugenie’s husband, Jack Brooksbank, and the late Queen’s cousin Princess Alexandra, in the same row as Eugenie, Beatrice and Mr Mapelli Mozzi.",
        "During the service, as the congregation paid homage to the King, Harry was seen, along with the other royals around him, speaking the words: “God save King Charles. Long live King Charles. May the King live forever.”Also in the third row, at the other end from Harry, was Andrew, who stopped using the His Royal Highness style in an official capacity in January 2022.Andrew wore his Order of the Garter robe which holds special significance for the royals.",
        "The Order of the Garter is the oldest and most senior Order of Chivalry in Britain.Last June, Andrew did not appear alongside senior members of the royal family at the annual Order of the Garter ceremony at Windsor Castle.",
        "William and Kate sat in the front row at the abbey for the historic ceremony, with their children Princess Charlotte and Prince Louis.Louis, who recently turned five, took his seat next to his mother after processing through the abbey, spending more than an hour watching the crownings, before retiring for a brief break.Also in the front row to see Charles and Camilla crowned was the Duke and Duchess of Edinburgh.In the second row were the Duke and Duchess of Kent and the Duke and Duchess of Gloucester, alongside the Princess Royal.Harry and Andrew were also absent from the procession behind the Gold State Coach carrying the newly crowned King and Queen back to Buckingham Palace after the ceremony.Andrew stepped away from public life after a controversial Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein.Virginia Giuffre sued Andrew for allegedly sexually assaulting her when she was 17 after she was trafficked by Epstein.Andrew denied the claims but paid millions in an out-of-court settlement in the US civil case."
    ]
}