{
    "articleURL": "/tvshowbiz/article-12053575/Myleene-Klass-45-hits-showers-skimpy-white-bikini.html",
    "content": [
        "Myleene Klass is set to recreate her iconic shower scene in a skimpy white bikini on Saturday night's I'm A Celebrity, 17 years on from her original appearance.",
        "In the show, the television and radio personality, 45, will show off her incredible figure in the triangle string swimwear as she clutches a towel.Her ensemble, which is from her Next collection, is very similar to the original, which sent fans swooning in 2006 during her first jungle stint.Myleene wore her brunette locks loose and donned a fedora during the episode, grinning as she strolled in the jungle.  She previously revealed that the first bikini sold for a whopping £7,500 after the show- and will now set pulses racing again in the new bikini. ",
        "Despite the scene being synonymous with Myleene, she warned viewers before the new show aired not to expect the same shower scenes as her first time around as she 'doesn't look like that anymore'.But she appeared to have made a U-turn on her decision as she sizzled in the stunning swimwear. Ahead of entering the camp, Myleene spoke about her white bikini.She explained: 'After doing the programme I saw the photo and I was like '\"y goodness, it does look glamorous\", but it certainly didn't feel like it - far from it!'There are worse things to be known for than being really clean! Since then, I have had three babies and I don't look like that now.'",
        "She added: 'I am really proud of how strong my body has been. It has been through lots of trials and tribulations since and part of the reason for doing this all star version is I want to remind myself of that.'I do feel like a different person, I was in my 20s when I first came into the jungle and now I'm in my 40s.'I think I will smell the campfire and it will be like yesterday!",
        "'I've got so many great memories to pick from but I liked some of the things you don't see on camera – like at night when the jungle came alive. All you could see was a wall of green dots, green eyes, reflected by the moonlight.'While touching on the iconic bikini from her 2006 series, she said in her pre-entry interview: 'I bought that white bikini for £40. After the show I sold it off - for £7,500!'The famous tiny white bikini was auctioned for charity for £7,500 and Myleene later revealed it was a last-minute purchase.She explained she had spent just £40 on the skimpy two-piece after producers informed her the striped number she had originally packed would not look good on film."
    ]
}