{
    "articleURL": "/wires/reuters/article-12049889/European-airlines-bumper-summer-bookings.html",
    "content": [
        "IAG first-quarter results better than expected",
        "IAG raises full-year profit guidanceAir France-KLM revenue jumps, operating loss hits sharesBy Sarah Young and Federica MileoLONDON/PARIS May 5 (Reuters) - British Airways-owner IAG and Air France-KLM reported bumper summer bookings as travellers pressed ahead with holiday plans despite a cost-of-living crisis, though IAG's boss warned strikes and lack of staff could still disrupt major airports.European airlines and airports are under pressure to avoid a repeat of last summer's chaotic scenes that marred the return to mass travel after the freeze caused by the COVID-19 pandemic.IAG, which also owns Iberia, Vueling and Aer Lingus, said on Friday strong ticket sales for summer and a winter season that beat expectations meant 2023 profit would come in above its previous forecasts.Its positive outlook chimed with other major European airlines. Lufthansa, easyJet and Ryanair have all pointed to robust summer bookings, showing consumers prioritising travel spend despite high inflation and an uncertain economic outlook.IAG called the outlook for the summer \"encouraging\" and said capacity in its key North Atlantic and Latin American markets was now back at pre-pandemic levels, with demand from leisure travellers driving bookings.However, Chief Executive Luis Gallego said he was concerned about capacity at London's Heathrow airport this summer and possible new strikes by air traffic controllers (ATC) in France, where protests over a rise in the retirement age have disrupted travel since January.",
        "British Airways had to cut flights over the Easter holidays due to labour unrest at Heathrow, though the hub - which last summer put a cap on passenger numbers to cope with staff shortages - has said there won't be a similar measure this year.\"We are very worried about the French ATC,\" Gallego told analysts on a post-earnings call. \"For example Vueling, 80% of their flights are above French air space so I think it's something we are worried (about).\"The group said it now expected annual profit to come in above the top end of a 1.8-2.3 billion euros ($2.0-$2.5 billion)range given in February, sending its shares up 3% by 0750 GMT. The top end of that range already represented a jump of as much as 90% on last year's result.For the three months to the end of March - often loss-making for airlines as fewer people travel then - IAG said high demand combined with lower fuel prices helped it turn a profit.It made an operating profit before exceptional items of 9 million euros, well above the 179 million euro loss expected by analysts.Air France-KLM also said it was seeing strong summer ticket sales after first-quarter revenue rose 42% year-on-year to 6.33 billion euros. Its shares fell 5% in early trade, though, as its operating loss of 306 million euros was above market expectations for a loss of 294 million euros.",
        "The airline also forecast 2023 capacity at 95% of pre-pandemic levels, compared with 95-100% previously.In another sign of travel recovery, Holiday Inn owner IHG Plc reported a 33% jump in first-quarter revenue per available room (RevPAR) - a key measure for a hotel's top-line performance.Hotel operators are benefiting from China lifting its COVID-19 restrictions, boosting travel throughout the Asia Pacific region.($1 = 0.9058 euros) (Reporting by Sarah Young and Federica Mileo; Writing by Matt Scuffham and Silvia Aloisi; Editing by Mark Potter)"
    ]
}