{
    "articleURL": "/wires/pa/article-12059455/Concert-drone-organiser-describes-nerve-wracking-exciting-evening.html",
    "content": [
        "The mastermind behind the “largest ever multi-location UK drone show” said pulling off the Coronation Concert spectacle was a “nerve-wracking but exciting” experience.",
        "Patrick O’Mahony, founder and director of Skymagic, said 1,000 drones took part in the light shows over Windsor Castle, Cardiff Bay and the Eden Project in Cornwall on Sunday.The lights of the drones formed shapes celebrating the King’s love of the natural world, including a blue whale which appeared in the sky above Windsor during the concert.",
        "Artists including Lionel Richie, Katy Perry and Take That performed as part of a star-studded line-up.The Department for Culture, Media and Sport hailed the “spectacular scenes”, saying it was the “largest ever multi-location UK drone show”.When US singer Perry, 38, walked out singing the opening lyrics to her hit Roar, a drone projection of a lion’s head appeared in the sky above her.And when British-Moroccan singer Zak Abel sang the Simple Minds hit Don’t You Forget About Me, a drone scene of a Prince Charles clematis flower appeared in the sky over Windsor, followed by a giant multi-coloured butterfly.Speaking on Monday, Mr O’Mahony told BBC Radio 4’s Today programme: “It was the biggest single performance across multi sites we’ve ever done, so to try and co-ordinate it all from one central location in Windsor and trigger three shows all at the same time, all with obviously not rehearsing, giving the game away in advance, it was a quite nerve-wracking but exciting evening really.”",
        "He said they had rehearsed at a “secret location up in Yorkshire” so as not to spoil the surprise.On how many drones were involved, he said: “It was 1,000 across all three sites, so the biggest show we’ve done like that.”He said three operators were needed to run the entire fleet, one per site.",
        "Mr O’Mahony added: “Each individual drone has its own little mission loaded onto it and we have then one operator and a back-up operator who triggers that show sequence and sends the drones up.“And then in effect we, at the right, very precise time, press the ‘go’ button and each little drone then flies its own individual mission.“No one drone knows where the other drones are in the fleet so they’re not talking, they’re all individual in terms of that movement, they fly the entire routine and luckily come back home at the end of it.“When we have the final file, our pilot then uploads that to all the drones but each individual drone has its own separate file attached to it.”",
        "On whether anything went wrong, he added: “No, we had a perfect run.“The weather was great, which was always a big relief for us, and then each individual site all their fleets went up, came down and we were bang on time across locations which was really wonderful to see.",
        "“We can fly in light rain, if it was very, very heavy rain then that would stop us, the same with very high winds. But normally we can fly in most conditions.”The concert was watched by an average audience of 10.1 million, according to overnight figures from the BBC.The event was hosted by actor Hugh Bonneville and featured a cameo from The Muppet characters Kermit the Frog and Miss Piggy, as well as a recorded video message to Charles from Top Gun star Tom Cruise."
    ]
}