{
    "articleURL": "/news/article-12047615/British-girl-six-fights-life-hospital-head-car-crash-Ibiza-kills-mother.html",
    "content": [
        "It is not immediately clear whether she was holidaying or living on the islandMedics airlifted her to Majorca because of the seriousness of her injuriesA six-year-old British girl is reported to be fighting for her life after a road accident in Ibiza in which her mum died.",
        "The youngster's 42-year-old mum died on Wednesday afternoon after a head-on crash near an MOT centre on the road to the town of Santa Gertrudis.Her nationality has not yet been revealed.But island press are describing her daughter, who was admitted to Can Misses Hospital in Ibiza in a 'critical condition' on Wednesday night before being transferred to Son Espases Hospital in the Majorcan capital Palma, as British.Medics made the decision to airlift her to Majorca because of the seriousness of her injuries.",
        "A 40-year-old Norwegian woman was also hurt in the crash and remains in hospital in Ibiza.Local reports said the woman who died was in a Ford Focus with her daughter which was hit head-on by a Toyota rental car whose driver lost control of the vehicle and smashed into a roadside crash barrier before invading the oncoming carriageway.The other car involved was an Opel Meriva which was travelling behind one of the other two vehicles and overturned as it swerved to try to avoid them.Firefighters, police and paramedics rushed to the scene after the alarm was raised, just after 6.30pm local time.The woman who lost her life was pronounced dead at the scene after being cut out of the wreckage of her vehicle by firefighters. Her daughter suffered what are being described as 'multiple injuries.'",
        "Initial reports described the youngster as five but it later emerged she was six.It was not immediately clear today if mother and daughter were holidaying in Ibiza or lived on the island, or who was at the wheel of the rented Toyota.All three vehicles involved in the crash are said to have been left write-offs.The Civil Guard could not be reached this evening evening  for comment."
    ]
}