{
    "articleURL": "/sport/rugbyunion/article-12060247/Luke-Cowan-Dickie-set-handed-contract-lifeline-Sale-hint-interest.html",
    "content": [
        "Exeter's Luke Cowan-Dickie could be handed a contract at Sale for next season Sale's Alex Sanderson has hinted that he'd be interesting in signing hooker Cowan-Dickie's move to Marseille looks to be off as club have injury concerns Premiership semi-finalists Sale are ready to step in and hand Luke Cowan-Dickie a potential contract lifeline with the England hooker’s scheduled move to Montpellier now all but over.",
        "Cowan-Dickie, a British Lion in 2021, had agreed to join the TOP14 champions from Exeter for the start of next season and after this year’s World Cup.But a combination of injury concerns and the 31-year-old’s boozy night out in the French city last month mean that deal is unlikely to happen.Cowan-Dickie spent a night in a Montpellier police cell in April when visiting what was set to be his new club and was 'the subject of a procedure for manifest and public drunkenness.'Montpellier also have concerns over Cowan-Dickie’s ongoing neck and knee injuries which have put his England World Cup participation in doubt.",
        "No-nonsense Montpellier boss Philippe Saint-Andre is now set to pull out of the deal and move for Australia hooker Tolu Latu – who had been a target for Sale – instead.Asked if his side would be interested in Cowan-Dickie, who has 43 England caps, Sale director of rugby Alex Sanderson said: ‘Why wouldn’t you? He’s a great player.‘I don’t know if we’d be in the right price point but he’s got mates up here as well. He fits our game model.‘He’s a banger. He ticks a lot of boxes on those fronts but I haven’t spoken to him.’Sale, who host Leicester on Sunday for a place in the Premiership final, have lost back-up hooker Ewan Ashman to Edinburgh for next season so have a gap to fill.",
        "Sanderson appeared to inadvertently confirm Cowan-Dickie’s Montpellier move is over when asked about Latu.‘I’ve heard he’s been signed for twice the amount of money we offered him,’ he said. Montpellier have shown their ruthless edge with Cowan-Dickie and it is understood the player’s fitness problems – rather than his night in the ‘drunk tank’ – is the main reason for them pulling out of the deal.The reality, though, is that the brush with French police will hardly have helped.",
        "In addition to a possible move for Cowan-Dickie, MailSport understands Sale are also set to sign former Leicester and current Stade Francais back Telusa Veainu.The enigmatic Saint-Andre has also cancelled former England prop Henry Thomas’ Montpellier contract after his shock call-up for Wales’ extended World Cup training squad.Thomas has been told he must now leave the French side at the end of the season because a potential Welsh World Cup call would mean he couldn’t play for Montpellier at the start of the 2023/24 campaign.Elsewhere, Northampton are in negotiations with the Royal Navy about the availability of hooker Sam Matavesi for their play-off at title favourites Saracens on Saturday.",
        "Fiji international Matavesi has taken ownership of the club’s No 2 shirt but the semi-final clashes with the annual Army-Navy fixture.",
        "Matavesi is a serving member of the Navy and there is a precedent for contracted players to miss big games for club and country to represent the Armed Forces.Last month, England hooker Amy Cokayne missed her team’s Women’s Six Nations clash with Wales to represent the Royal Air Force.Northampton coach Sam Vesty said of Matavesi: ‘Negotiations are ongoing.’"
    ]
}