{
    "articleURL": "/tvshowbiz/article-12052727/Hailey-Bieber-showcases-toned-legs-tiny-gym-shorts-friend-Lori-Harvey.html",
    "content": [
        "Hailey Bieber showed off her long legs in tiny gym shorts as she was accompanied by her close friend, Lori Harvey, on a quick coffee run in Los Angeles on Friday. ",
        "The Rhode founder, 26, who enjoyed a romantic date night with husband, Justin Bieber, earlier Thursday, sipped on a refreshing iced coffee as she strolled alongside the media personality, also 26, under the warm sunshine. The businesswoman donned a green, oversized hooded sweatshirt that was zipped up towards her upper chest. She also wore a pair of tiny, gray shorts along with bluish-green colored sneakers that were tightly secured with laces. The star accessorized her ensemble for the daytime outing by simply throwing on a pair of black shades for a stylish flare, but opted to not add any flashy pieces of jewelry to her simplistic look. ",
        "Her short locks were parted in the middle, and naturally flowed down to nearly brush the base of her neck. Hailey chose to not carry any purses or handbags during the errand run, and instead held two iced coffees in each of her hands. Lori also opted for stylish comfort while accompanying her close friend, and donned a pair of black, fitted leggings that were partially covered with white and black-striped crew socks. The model slipped into a pair of nude-colored, open toed slip-ons to make walking around simple and easy. The daughter of Steve Harvey additionally threw on a long-sleeved, gray cropped top that gave a glimpse of her toned midriff. ",
        "Her locks were slicked back into a chic up do, preventing any loose strands from falling onto her face. She also threw on a pair of black sunglasses and accessorized her ensemble with dainty, gold-hooped earrings. Both Hailey and Lori were seen strolling across a side alley after picking up a few tasty drinks and held a light-hearted conversation as they prepared to head to their next destination. The two stars have maintained a close friendship, with Hailey notably attending Harvey's 26th birthday bash in West Hollywood earlier this year in January.  ",
        "Earlier Thursday night, the Rhode founder was seen enjoying a romantic date night at a popular sushi restaurant with husband, Justin Bieber, in Los Angeles. The beauty donned a tan-colored cropped top along with a pair of high-waisted jeans, and layered the outfit with a tan jacket that she chose to leave unzipped. The Peaches hitmaker opted for a black, crew-neck sweater and added a white T-shirt underneath. He also slipped into a pair of denim blue jeans for the casual weeknight dinner together. The couple's sushi date comes shortly after Justin was reported to be heartbroken due to his wife's mental health. Last month in April, following Hailey's statement where she opened up about having a difficult year, a source told Us Weekly that, 'It breaks Justin’s heart to have seen Hailey struggling emotionally the way she has been these past few months.'",
        "The insider added, 'He loves his wife more than anything and knows she has a heart of gold.'The star, who currently boasts 49.5 million Instagram followers, admitted in a statement that she was having a 'hard time' and added that in 2023, she has had 'some of the saddest, hardest moments in my adult life and my mind and emotions have been fragile to say the least...'In conclusion, Hailey called for 'love' and wrote, 'Let's be there for people...let's keep showing up for each other even when it's hard. We're better together.' ",
        "Earlier this year in January, Hailey and Kendall Jenner posted a since-deleted TikTok video as they lip-synced, 'And I’m not saying she deserved it, but I’m saying God’s timing is always right.' Fans of Selena Gomez quickly speculated that the lyrics were in reference to the Justin's ex. However, in March, the Only Murders In The Building actress jumped to her Instagram stories to call for peace and broke silence on the drama.For the first time in eight years, Hailey chose to not attend the MET Gala, but still made her way to the Big Apple earlier last week to attend the Tiffany &amp; Co. grand re-opening in NYC.  "
    ]
}