{
    "articleURL": "/sport/football/article-12045367/Sydney-FCs-Luke-Brattan-adamant-Western-Sydney-Wanderers-vulnerable.html",
    "content": [
        "Western Sydney Wanderers tipped to beat Sydney FCSky Blues are happy to be the underdogs on SaturdayThe loser in A-League final will see their season overMany Sydney FC fans from the Cove won't be attendingBoycott follows APL's decision to sell the A-League grand finalSydney FC midfielder Luke Brattan has declared the Western Sydney Wanderers  need to produce on the big stage ahead of Saturday's A-League elimination final.",
        "The hosts won the right to host the derby at Commbank Stadium after finishing one spot above their bitter rivals in the home and away season - and Marko Rudan's squad are also widely tipped to win on home soil.Adding further spice to the contest is that the loser will see their season over. 'We are happy to be the underdogs, the Wanderers are a good side,' Brattan told Daily Mail Australia.'No one expects us to win, but we will go there with a game plan and we will back ourselves to get the result.",
        "'We have experience all over the park, and big game players like Wilks (Alex Wilkinson) and Alf (Adam Le Fondre).'We believe they are vulnerable in a few areas.'Brattan, 33, who won the double with Sydney FC in 2019-20, pinpointed in form Brandon Borrello as the man his team must contain.After the winger was shifted up front by coach Marko Rudan, Borrello has been a revelation, scoring 13 goals.Borrello also recently turned out for the Socceroos against Eucador - and was again on the scoresheet.'He has had a great season, but in saying that the Wanderers have quality all over the park,' Brattan said.Many of Sydney FC's passionate supporters won't be in attendance - members of the Cove confirmed on social media earlier this week they won't be making their voices heard at Parramatta.",
        "The mass boycott follows the APL's controversial decision last December to sell the A-League grand final to Destination NSW until 2025 for a reported $12million.",
        "Previously, A-League men's and women's clubs who excelled in their respective finals series won the right to host deciders.Veteran Sydney FC defender Alex Wilkinson was left downcast by news many Sky Blues fans will instead be watching the action from the Star in Pyrmont.'As a club and as players we want them there,' he said.'We are disappointed that they are not going to be there for what is the biggest game of the season to date.'Their support throughout the year has been unbelievable. Without a doubt they can give you an edge.'Being such an important game and with everything on the line, it would be fantastic if we could have both sets of (active) fans there creating that atmosphere which would just add to the occasion and make that game that little bit more special.'We've had the biggest average crowd out of any team this year and a lot of that's got to do with their (The Cove's) support and the atmosphere they create at games, so not having them there is going to make our job a little bit harder on Saturday night.'",
        "Wanderers fans from the RBB and in general admission seats have no plans to boycott the elimination final. "
    ]
}