{
    "articleURL": "/wires/pa/article-12047033/Northern-Ireland-budget-decimate-public-services--Alliance-Party-leader.html",
    "content": [
        "The current budget will “decimate public services” in Northern Ireland, the Alliance Party leader has warned.",
        "Naomi Long also said Secretary of State Chris Heaton-Harris’s hands were not clean in creating the current financial problems in the region.At the Alliance local election manifesto launch on Thursday, Ms Long responded to Mr Heaton-Harris’s claim that: “Northern Ireland politicians got the budget into the state it’s in, Northern Ireland politicians need to get us out of it.”In the absence of a devolved government Mr Heaton-Harris was responsible for setting the budget for Northern Ireland.",
        "The Stormont Executive is not currently functioning due to the DUP’s ongoing protest against post-Brexit trading arrangements.Several Stormont departments have already warned they are facing significant challenges, with the PSNI citing a funding gap of £141 million and the Department of Health looking at a shortfall of £470 million.The Department of Infrastructure has warned that its budget pressures may result in streetlights being turned off and roads not being gritted in winter.Ms Long said: “In terms of the budget, and in terms of the Secretary of State, I have to say, I listened carefully to his throwaway remark yesterday that the budgetary problems in Northern Ireland are as a result of Northern Ireland’s politicians.“It’s almost as though Chris Heaton-Harris didn’t support government austerity cuts, it’s almost as though he didn’t champion Brexit, which has caused much of the disruption that we’re facing at the moment, it’s almost as though he didn’t back Boris Johnson and Liz Truss who damaged our economy immeasurably.",
        "“The idea that all of the challenges we face are simply down to local politicians, and that his hands are clean, is frankly laughable.“What Chris Heaton-Harris needs to do if he really wants to be a Secretary of State for Northern Ireland is work with local politicians to work on the strategy.”",
        "In her opening remarks Ms Long referred to the budget as a “punishment budget” and said it would “decimate public services” in Northern Ireland. She also said the impact of the cuts will still be felt when the Stormont Assembly is eventually restored. “The first is the budgetary constraints, and yes, they are significant and there is a punishment element to that budget, I think everyone acknowledges that,” Ms Long said. She added: “And to be really clear, some of the changes that are being made, some of the cuts that are being imposed, are cuts that will not be able to be redressed in weeks or months if an Assembly is restored, which is why it’s critical that we have an Assembly now. “To actually send our executive ministers, not party leaders but executive ministers, to Treasury to talk about what’s required in terms of having an invest to save strategy for Northern Ireland, a way of reforming our public services to make them sustainable, but also the pot of money that’s needed to do that properly, and not by salami slicing what we already have.”"
    ]
}