{
    "articleURL": "/tvshowbiz/article-12056569/Jamie-Oliver-praises-Sunday-Project-amazing-tribute-MasterChefs-Jock-Zonfrillo.html",
    "content": [
        "Celebrity chef Jamie Oliver has praised The Sunday Project for its 'amazing' tribute to MasterChef Australia judge Jock Zonfrillo following his death at age 46. ",
        "Oliver, 47, who was a close friend of Zonfrillo's, took to social media on Sunday night to express his gratitude to the show's producers and presenters.'A sincere thank you to Channel 10 and the wonderful team at The Project for making this amazing tribute show for Jock and his family tonight and turning the show around so fast. I know many of you knew him personally and this must have been so hard to do but the right thing to do. Bless you all Jamie oxxx,' he wrote.The hour-long tribute to Zonfrillo featured interviews with his friends and colleagues, as well as footage of him cooking and mentoring contestants.The show also featured a performance by Jimmy Barnes, who was also a close friend of Zonfrillo's.",
        "Viewers also took to social media to praise The Sunday Project's moving tribute, with many saying it was a fitting way to remember Zonfrillo.'Beautiful tribute to Jock. Jock, you will be so missed,' one fan wrote.'What a beautiful heartfelt tribute to Jock from The Project and the wonderful Andy Allen. Well done Channel10. Thank you ❤️,' a second wrote.'That tribute to Jock Zonfrillo was incredible; so emotional and heartbreaking. Vale Jock ♥️,' added a thirdAnother wrote: 'I knew it was going to be hard, I didn't think it would be this hard.'",
        "'Beautiful tribute to a beautiful persons. Loved everything including the finale by Jimmy Barnes,' said one more'I need a bloody hug. I'm gonna miss jock so much,' wrote another.",
        "The Scottish-Australian chef was found dead by police at a hotel on Lygon Street in Carlton, Melbourne, at about 2am on Monday, May 1.Zonfrillo, who joined MasterChef Australia as a judge in 2019, quickly became a favourite with fans due to his warm demeanor, culinary expertise, and mentorship to contestants.His passion for Indigenous Australian ingredients and his philanthropic efforts in the culinary world were well-known and admired.Police found Zonfrillo's body after they were called to a hotel in Carlton, Melbourne for a welfare check."
    ]
}