{
    "articleURL": "/wires/ap/article-12053525/5-things-look-King-Charles-IIIs-coronation.html",
    "content": [
        "LONDON (AP) - King Charles III´s coronation is a chance to unite people with the history and pageantry of the monarchy, but those traditions are also full of potential controversies as he tries to show that the monarchy still has a role to play in modern Britain.",
        "The new king has already recognized these challenges by adjusting the coronation festivities to the realities of today.This coronation will be shorter and more inclusive than his mother´s in 1953. Faith leaders from outside the Church of England will take an active role in the ceremony for the first time. And people from all four nations of the United Kingdom, as well as the Commonwealth, will take part.Here are five artifacts that will play a central role in Saturday´s events.THE CORONATION CHAIR AND STONE OF SCONEKing Charles III will sit atop more than 1,500 years of Irish, Scottish and English history when he is crowned Saturday at Westminster Abbey.",
        "The crown will be placed on Charles´ head as he sits in the Coronation Chair suspended over the Stone of Scone (pronounced \"scoon\") - the sacred slab of sandstone on which Scottish kings were crowned. The chair has been part of every coronation since 1308.The 2.05-meter (6 feet 9 inches) tall chair is made of oak and was originally covered in gold leaf and colored glass. The gold has long since worn away and the chair is now pocked with graffiti, including one message that reads \"P. Abbott slept in this chair 5-6 July 1800.\"Edward I had the chair built specifically to enclose the Stone of Scone, known by Scots as the Stone of Destiny, after he forcibly took the artifact from Scotland and moved it to the abbey in the late 13th Century. The stone's history goes back much further, however. Fergus Mor MacEirc, the founder of Scotland´s royal line, reputedly brought the stone with him when he moved his seat from Ireland to Scotland around 498, Westminster Abbey said. Before that time, it was used as the coronation stone for Irish kings.",
        "In 1996, Prime Minister John Major returned the stone to Scotland, with the understanding that it would come back to England for use in future coronations. In recent days, the stone was temporarily removed from its current home at Edinburgh Castle in a ceremony overseen by Scottish First Minister Humza Yousaf, then transported to the abbey, where a special service was held to mark its return.CORONATION SPOONThe gold-plated silver Coronation Spoon is the only piece of the coronation regalia that survived the English Civil War. After King Charles I was executed in 1649, the rest of the collection was either melted down or sold off as Parliament sought to abolish the monarchy forever.The spoon is central to the most sacred part of the coronation ceremony, when the Archbishop of Canterbury will pour holy oil from an eagle-shaped ampulla, or flask, into the spoon and then rub it on the king´s hands, breast and head.The ceremony has roots in the biblical story of the anointing of King Solomon and was originally designed to confirm that the sovereign was appointed directly by God. While the monarch is no longer considered divine, the ceremony confirms his status as supreme governor of the Church of England.The 26.7-centimeter (10.5-inch) spoon is believed to have been made during the 12th Century for either King Henry II or King Richard I, and may have originally been used for mixing water and wine, according to the Royal Collection Trust.",
        "THE CULLINAN DIAMONDTwo stones cut from the Cullinan Diamond - the largest rough diamond ever found - will feature prominently in the coronation, fueling controversy the royal family would rather avoid.For many in South Africa, where the original stone was found in 1905, the gems are a symbol of colonial oppression under British rule and they should be returned.Cullinan I, a huge drop-shaped stone weighing 530.2 carats, is mounted in the Sovereign´s Sceptre with Cross. On Saturday, the scepter will be handed to Charles as a symbol of his temporal power.Cullinan II, a cushion-shaped gem of 317.4 carats, is mounted on the front of the Imperial State Crown that Charles will wear as he leaves Westminster Abbey.Charles sidestepped a similar controversy when Buckingham Palace announced that his wife, Camilla, wouldn´t wear the crown of Queen Elizabeth, the queen mother, on coronation day.That crown contains the famous Koh-i-noor diamond that India, Pakistan and Iran all claim. The gem became part of the Crown Jewels after 11-year-old Maharaja Duleep Singh was forced to surrender it after the conquest of the Punjab in 1849.ST. EDWARD'S CROWNThe crowning moment of the coronation ceremony will occur, literally, when the Archbishop of Canterbury places St. Edward´s Crown on Charles´ head.",
        "Because of its significance as the centerpiece of the coronation, this will be the only time during his reign that the monarch will wear the solid gold crown, which features a purple velvet cap, ermine band and criss-crossed arches topped by a cross.After the ceremony, Charles will swap the 2.08-kilogram (4.6-pound) crown for the Imperial State Crown, which weighs about half as much, for the procession back to Buckingham Palace.Queen Elizabeth II once said that even the lighter crown was tricky because it would fall off if she didn´t keep her head upright while reading the annual speech at the state opening of Parliament.\"There are some disadvantages to crowns, but otherwise they´re quite important things,\" the late queen told Sky News in 2018, flashing a smile.The current St. Edward´s Crown was made for the coronation of King Charles II in 1661 and has been used in every coronation since then. It is a replica of the original crown, which was created in the 11th century and melted down after the execution of Charles I in 1649.The crown glitters with stones including tourmalines, white and yellow topazes, rubies, amethysts, sapphires, garnet, peridot, zircons, spinel and aquamarines.Until the early 20th century, the crown was decorated with rented stones that were returned after the coronation, according to the Royal Collection Trust. It was permanently set with semi-precious stones ahead of the coronation of George V in 1911.",
        "THE GOLD STATE COACHKing Charles III and Queen Camilla will travel back to Buckingham Palace from Westminster Abbey in the Gold State Coach, a 261-year-old relic that is renowned as much for its uncomfortable ride as its lavish decoration.The coach was built in 1762 under the reign of King George III and it has been used in every coronation since 1831.It is made of wood and plated with gold leaf, from the cherubs on the roof to the Greek sea gods over each wheel. About the only things that aren´t gilded are the side panels painted with Roman gods and goddesses and, of course, the interior, which is upholstered in satin and velvet.But the coach is heavy - four tons - and old, meaning it only ever travels at walking speed.And while it may look luxurious, the coach features a notoriously bumpy ride because it is slung from leather straps rather than modern metal springs.The late queen wasn´t a fan.\"Horrible! It´s not meant for traveling in at all,\" she said in 2018 in an interview with Sky News. \"Not very comfortable.\"That´s one reason Charles and Camilla will ride to the coronation in the Diamond Jubilee State Coach, which is equipped with hydraulic shock absorbers, as well as heat and air conditioning."
    ]
}