{
    "articleURL": "/money/cars/article-12046313/More-1-5million-motorists-70-driving-illegally.html",
    "content": [
        "One in four motorists over 70 have admitted not updating their driving licencesFailure to renew the document places motorists at risk of fines of up to £1,000 One-in-four motorists aged over 70 - an estimated 1.5 million people - have not updated their driving licences in line with a little-known law, which could see them fined up to £1,000. ",
        "Once drivers hit 70, they must renew their driving licences if they wish to remain on the road. Under the regulations, the document must be updated at 70 and then every three years. These rules have been in place since 1976. Driving with a licence which has expired could leave an older driver facing a trip to the local magistrates' court and the prospect of a £1,000 fine. But research conducted by Scrap Car Comparison found that one in four older motorists are leaving it at least four years to replace their driving licences having hit 70. One in five in this age group admitted they were unaware of the regulations. ",
        "Drivers can renew their licence for free with the DVLA if they are 70 or over, or will reach that age within 90 days. They should avoid falling victim to copycat websites looking to charge them and only use the official DVLA website.A total of 500 drivers aged between 70 and 90 across the UK were questioned as part of the survey conducted during April. The Department of Transport said there were 5.8 million drivers aged 70 and over on British roads in 2022. Extrapolating the figures from the research indicates an estimated 1.5 million elderly motorists may be breaking the law and at risk of fines worth a combined total of £1.5bn. ",
        "Almost one in ten older drivers admitted to never renewing their driving licence after 70, while half of those aged between 70 and 80 claimed they took at least four years to update the vital documents. ",
        "More than three quarters of motorists aged over 81 said they were not aware of the need to continually renew their documents to remain within the law. David Kottaun, operations manager at Scrap Car Comparison said: 'It’s been a shock to discover that so many motorists are not renewing their licenses following their 70th birthdays – and therefore leaving themselves no longer able to legally operate a vehicle, and at risk of receiving a big fine if caught.'The DVLA should send drivers a D46P application form around 90 days before they turn 70 years old – however if you do not receive one through the post, paper copies of the form can be obtained from your local Post Office.'Ultimately, the reason behind getting mature drivers to regularly renew their license is to ensure the safety of the drivers themselves, and everyone else on the roads. 'The renewal process is quick, easy and motorists can continue to drive while their license is being renewed as long as: they have the support of their doctor to continue driving, had a valid license and their last license wasn’t revoked or refused for medical reasons – so there is no excuse to not be regularly renewing this documentation.' ",
        "Age UK explains that people can still drive while they are waiting for their new licence. It says: 'When you reach the age of 70, your driving licence expires – but this doesn't necessarily mean you have to stop driving. If you want to continue, you just need to renew your licence. You'll need to renew it every three years after that. Renewal is free of charge.'Older motorists have recently hit out at the rise in council's use of app and phone based parking payments, which some say penalises them. Separate research found that older motorists would avoid locations where they would have to use contactless methods to pay for parking.  ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}