{
    "articleURL": "/wires/reuters/article-12061187/Democrats-press-Biden-administration-climate-impact-LNG-buildout.html",
    "content": [
        "WASHINGTON, May 8 (Reuters) - Dozens of Democratic lawmakers on Monday called on the Biden administration to consider the climate and environmental justice impacts of the expansion of the liquefied natural gas (LNG) industry.",
        "The 44 lawmakers, including Senators Jeffrey Merkley, Edward Markey and Representatives Jared Huffman and Raul Grijalva, urged the Council on Environmental Quality, a White House office, to \"include greater scrutiny on the entire LNG supply chain\" as it finalizes guidance on greenhouse gas emissions and climate change under bedrock U.S. environmental law.In a letter to Brenda Mallory, the CEQ chair, the lawmakers asked for the scrutiny \"from wellhead, through export outside the United States, to combustion.\"The CEQ did not immediately respond to a request for comment.As the U.S. vies for the top LNG exporting spot, administration officials have been holding talks with global energy companies and foreign officials about potential ways to certify emissions reductions of natural gas.While some gas drillers are marketing certified, or responsibly sourced gas, with carbon reductions certified by third parties, the administration has not weighed in on how such certification should work.As Europe cuts gas purchases from Russia after its invasion of Ukraine, the Biden administration has approving exports of LNG from projects, a step in opening potential projects.In the latest support for the industry, it approved LNG exports from Alaska LNG last month. Project backers hope it will be open by 2030, though no final investment decision has not been made.",
        "\"Existing LNG infrastructure already has a disproportionate impact on Black, Brown, Indigenous, and poor communities; this will only be exacerbated with the addition of the proposed projects,\" the letter said.The lawmakers said U.S. agencies decide on LNG projects based on a public interest determination made during the era of former President Donald Trump that fails to incorporate drilling emissions of methane, a potent greenhouse gas, which, they said, makes LNG exports worse than coal. (Reporting by Timothy Gardner Editing by Marguerita Choy)"
    ]
}