{
    "articleURL": "/wires/afp/article-12055263/New-York-cyclists-gather-blessing-perils-city.html",
    "content": [
        "Hundreds of cyclists received \"blessings\" Saturday in the Cathedral of St. John the Divine, a ritual for a quarter of a century aimed at protecting riders from accidents in New York City.",
        "Cyclists in racing togs lined up next to everyday commuters to receive a sprinkling of holy water.\"May the wind be ever at your back. May your paths be always joyful. May all your journeying be joyous... May the Lord hold you and your bicycles in the palm of his hand,\" proclaimed the Very Reverend Patrick Malloy, dean of St. John the Divine Cathedral in northwest Manhattan, one of the largest churches in the world.Greeting a particularly large crowd this year after the lengthy Covid-19 pandemic, Reverend Malloy rode his bicycle through the entire nave sprinkling holy water on his congregants after reading from the Gospel and delivering a homily.- 'May God be with you' -\"Nothing is going to happen to your bike today,\" said Reverend Malloy, a high dignitary of the Episcopalian Church, a branch of Anglicanism in the United States.Once \"blessed,\" the cyclists applauded and rang their bicycle bells, then went around the nave and transept of this late 19th-century neo-Gothic church, modeled on the architecture of French cathedrals.",
        "The \"blessing of the bikes\" -- open to all faiths and nonbelievers alike -- has been a beloved service for 25 years at the cathedral near Columbia University in the Morningside Heights neighborhood.- Cyclists face peril -",
        "As in Europe, cycling is encouraged for environmental and public health reasons by New York City's Democratic administration.But in this city of 8.5 million, sprawling and chaotic, cyclists dwell in a kingdom of cars and trucks and face mounting perils.",
        "According to the municipal Department of Transportation, 17 people died on bicycles in 2022 in the city's five boroughs, and at Saturday's ceremony, worshippers recalled the names of 13 people killed on the streets already this year.They also remembered the 132 pedestrians killed in accidents in the city last year.\"It's a real travesty that it's so dangerous to be a cyclist in New York,\" Allison Considine, a 28-year-old environmental activist, told AFP as she left the church.\"A lot of motorists drive really dangerously in this city and think that the road is just for them.\"She said city officials know what works -- dedicated bike lanes in the city and on bridges and even streets closed off entirely to vehicular traffic.\"Every year that passes that they don't do that, they have to do things like the memorial for people who've died.\"Katherine Schoeller, a 32-year-old manager from Austria, said she felt glad to be among so many cyclists.\"It's nice to know there's a lot of people out there who bike and, you know, want to be, like, safe,\" she said."
    ]
}