{
    "articleURL": "/wires/reuters/article-12050251/Cepsa-CEO-blasts-Spains-windfall-tax-sank-loss.html",
    "content": [
        "By Pietro Lombardi",
        "MADRID, May 5 (Reuters) - Spanish oil company Cepsa's CEO on Friday criticised a windfall tax slapped on Spain's largest energy firms by Madrid as poorly designed after it dragged the company to a first-quarter loss.The temporary levy, and a similar one on banks, was approved by the country's left-wing coalition in December to raise funds to help tackle the cost of living crisis, but it has angered affected companies and industry groups.CEO Maarten Wetselaar said the tax had \"more than double the impact\" on Cepsa as on its main competitors in proportion to net income.\"The fact that the extraordinary tax imposed on Spanish energy companies pushed Cepsa into an IFRS loss in the first quarter illustrates its poor design and disproportionate impact,\" he said.The Spanish electricity utilities association AELEC has launched an appeal against the tax before the country's High Court.The 1.2% levy on utilities' sales will cost Cepsa 323 million euros ($356 million) this year. It has already paid 164 million euros, taking a charge to account for the overall amount.As the tax applies only to Spanish operations, it has a bigger impact on locally-focused Cepsa than other Spanish energy giants with larger international operations.Repsol REP.MC, which reported a 1.1 billion euro profit in the first quarter, will have to pay 450 million euros, while Iberdrola IBE.MC paid 216 million euros, about 15% of its first-quarter profit.",
        "Cepsa, controlled by Abu Dhabi state investor Mubadala and U.S. firm Carlyle Group, swung to a quarterly loss of 297 million euros from a profit of 265 million euros a year earlier. Net profit at current cost of supplies had almost tripled to 176 million, boosted by stronger refining margins.It has launched a 3.6 billion euro investment plan over the next three years, with a key focus on sustainable energy and mobility.($1 = 0.9069 euros) (Reporting by Pietro Lombardi; Editing by Jan Harvey, Kirsten Donovan)"
    ]
}