{
    "articleURL": "/wires/ap/article-12052851/Pretty-Mischievous-wins-Kentucky-Oaks-Churchill-Downs.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - An equipment change helped Pretty Mischievous bounce back from a disappointing tuneup with a statement performance in the Kentucky Oaks.",
        "Wearing blinkers for the first time, the Brendan Walsh-trained filly took charge in the stretch and survived a late push by Gambling Girl to win the $1.25 million Oaks by a neck on Friday at Churchill Downs.Pretty Mischievous started from the No. 14 outside post at 10-1 odds and stayed within sight of pacesetters Flying Connection and Defining Purpose through the far turn before making her move through the turn for home. Pretty Mischievous broke clear entering the stretch and kept charging even as Gambling Girl rallied from the outside, holding on for her fifth career win in seven starts and giving stable Godolphin its first win in the premier race for 3-year-old fillies.Most appreciative was owner Sheikh Mohammed bin Rashid Al Maktoum, the ruler of Dubai and vice president and prime minister of the United Arab Emirates. He's winless in 12 Kentucky Derby starts since 1999 and doesn´t have a colt in Saturday´s 149th Run for the Roses, though Essential Quality finished third in 2021 as the race favorite.As he pursues his ultimate prize, Sheikh Mohammed and Godolphin can savor a breakthrough in the Oaks.\"Sheikh Mohammed has developed a beautiful broodmare band here in the U.S.,\" said Michael Banahan, bloodstock director for Godolphin. \"I think we are reaping the rewards with the horses we´ve had over the last couple of years.",
        "\"But to me, there´s only the one classic for fillies in the U.S. and that´s today in the Oaks. And so to be able to win that just means everything.\"Pretty Mischievous covered 1 1/8 mile in 1:49.77 under jockey Tyler Gaffalione and paid $22.74, $10.10 and $7.40.\"We had a lot of confidence in her,\" said Gaffalione, who earned his first Oaks victory along with Walsh. \"She probably was the best horse in our last race. She has a tendency to kind of wait on horses. She did the same thing a little bit today. But the addition of blinkers, I think, helped with that.\"Gambling Girl returned $12.84 and $8.36, while The Alys Look paid $13.80 while finishing 2 1/2 lengths back in third.\"We just missed,\" said Irad Ortiz Jr., Gambling Girl's rider. \"Two more jumps and we would have got it.\"Godolphin had two Oaks entries, though much of the attention was focused on Wet Paint, the 5-2 morning line favorite and The Alys Look's stablemate. Wet Paint and 4-1 second choice Botanical were among a trio of fillies trained by Louisville-born Brad Cox, who sought his third Oaks win since 2018 and first since 2020 with Monomoy Girl, the champion 3-year-old.That quest must wait until next May, though Cox has four chances to win his first Derby outright with Angel of Empire the 8-1 third choice. Those more-heralded fillies both had 3-0 starts this season quashed as Botanical finished 13th. Neither horse was a factor entering the backstretch, though Wet Paint recovered to get near the leaders at the stretch.",
        "\"I got a good trip,\" jockey Flavien Prat said of Wet Paint. \"It set up good for me. The track isn´t as fast as Oaklawn (where she won the Arkansas Derby) and I think she was struggling on a bit on it. She made a move but not as good as at Oaklawn.\"Pretty Mischievous was in control by that point and didn't let up, winning the biggest race of her career in front of a crowd of 106,381.The Kentucky-bred daughter of Into Mischief and Pretty City Dancer by Tapit sought a rebound after squandering the lead down the stretch in the Grade 2 Fair Grounds Oaks and finishing 3 1/4 lengths behind Southlawn. Pretty Mischievous had won four of five before that with a third in the Grade II Golden Rod Stakes at Churchill Downs in November.The outlook is different now with a Grade I win.\"She´s won a Grade II. Now she´s won an Oaks, which is very hard to do, too,\" Walsh said. \"And I think she´s actually getting better, and I still don´t think we saw the very best of her today, even.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}