{
    "articleURL": "/wires/reuters/article-12042987/Thousands-protest-against-government-strip-teachers-public-servant-status.html",
    "content": [
        "By Boldizsar Gyori",
        "BUDAPEST, May 3 (Reuters) - Thousands rallied in Budapest on Wednesday to protest against new government-sponsored legislation that would eliminate the public servant status of teachers and significantly increase their workload.Almost 5,000 teachers have already said they will leave their profession if the so-called Status Law comes into force, but Prime Minister Viktor Orban's government is going ahead with the reforms that would strip teachers of some of their job security.Wednesday's protest came after a year of teacher strikes and demonstrations for higher wages as Hungary's inflation - running above 25% - erodes teachers' salaries that are already below the national average and second to last among OECD countries according to 2021 data.Many critics refer to the draft as the \"Revenge Law\", perceived as punishment for teachers' year-long resistance.\"I am entirely against this law, which is not called the 'revenge law' in public discourse by accident,\" said Katalin Torley, one of the most vocal critics of Orban's education policies.\"It is a response to the wave of protests seen over the past year...which have exposed the dire problems of the public education system.\"The government said the new legislation aimed to improve the quality of education.According to a former version of the draft, teacher behaviour and communications would have been monitored by technical means. Although the government promised to take this and other minor provisions out from the draft, negotiations are still ongoing between the government and teachers' trade unions.",
        "If the law passes in its current form, from June 1 teachers´ maximum daily working time would increase from 8 to 12 hours, the weekly working time from 40 to 48 hours, and the number of substitutions from 30 to 80 hours per year.Hungary is facing a growing shortage of teachers mainly due to low wages and the unpredictability in the regulatory environment. (Reporting by Boldizsar Gyori, Editing by Angus MacSwan)"
    ]
}