{
    "articleURL": "/wires/aap/article-12043283/We-farmland-Riewoldt-spruiks-Tassie-AFL-club.html",
    "content": [
        "Patrick Dangerfield, the AFL's most influential player voice, has thrown his support behind the new Tasmanian club luring contracted talent away from rival teams.",
        "The Geelong captain believes the AFL's 19th club needed to succeed when it enters the competition in 2028, even if it meant other teams giving up at least one player.\"My view is that the Tasmanian team should have access to contracted players,\" Dangerfield, the AFL Players Association president, told SEN on Thursday.\"One from every club, regardless of contract, if they choose to join Tasmania, then they should be able to do that.\"I think if we're going to do this and do this properly, then Tasmania should have access to not only the best talent, but the best possible people in order to create something that's truly unique and truly special.\"Dangerfield said it was up to the existing 18 clubs to build a successful culture before Tasmania joins the AFL in five years.\"What it does is promote clubs to provide the best possible environment, so they don't want to leave because the environment they're in is successful,\" the Cats superstar said.\"I think it generates competition with the existing clubs to provide a great framework for their players to enjoy and not want to leave.\"The draft concessions Tasmania get are not expected to be anywhere as dramatic as what Gold Coast and GWS received when they entered the AFL in 2011 and 2012.",
        "Richmond veteran Jack Riewoldt believes his home state can offer something different to entice players and off-field to sign on.Hawthorn captain James Sicily apologised last month after saying there was \"not much\" happening in Tasmania and he couldn't imagine living there.Hobart-born Riewoldt, who was at the licence announcement at North Hobart Oval, said Tasmania could be compared to a location like Geelong.\"There is certainly the type of person who will be attracted to coming down here,\" he said.\"I look at arguably one of the best players in the competition at the moment, Jeremy Cameron, who lives on a farm not far out of Geelong.\"Riewoldt, 34, said he would jump at the chance to be involved with the Tasmanian club.Outgoing AFL boss Gillon McLachlan said plans for a training base would develop in coming months and a community campaign to choose the club's name would be launched later this year.He brushed off concerns Tasmania would not be an attractive destination for young players.\"There's been legitimate concerns historically but this is a different city, a different state,\" McLachlan said.\"The training and administration facility is going to be first-class and they'll be playing in what I think will be an incredible, pumping venue in the middle of a great city.\"",
        "Tasmania's bid got across the line after the federal government chipped in $240 million for a contentious $715 million new waterfront stadium in Hobart.The stadium was the final piece required by the AFL before approving the licence, which was unanimously backed by the 18 existing club presidents on Tuesday.POTENTIAL TARGETS FOR THE NEW TASMANIAN TEAM:Riley Thilthorpe (Adelaide), Will Ashcroft (Brisbane Lions), Sam Walsh (Carlton), Nick Daicos (Collingwood), Sam Draper (Essendon), Caleb Serong (Fremantle), Ollie Henry (Geelong), Matt Rowell (Gold Coast), Aaron Cadman (GWS), Will Day (Hawthorn), Kysaiah Pickett (Melbourne), Harry Sheezel (North Melbourne), Connor Rozee (Port Adelaide), Noah Balta (Richmond), Max King (St Kilda), Errol Gulden (Sydney), Oscar Allen (West Coast), Sam Darcy (Western Bulldogs)."
    ]
}