{
    "articleURL": "/wires/ap/article-12047763/Jaguars-looking-pass-rush-help-free-agency-draft.html",
    "content": [
        "JACKSONVILLE, Fla. (AP) - The Jacksonville Jaguars are still in the market for a pass rusher, even after free agency and a draft in which they had the most picks (13) in franchise history.",
        "Fortunately for general manager Trent Baalke, there are plenty of available options.More than a dozen veteran edge rushers - including Frank Clark, Leonard Floyd, Yannick Ngakoue and Robert Quinn - are looking to continue their NFL careers with new teams. Of course, the price could be steep for those four since they made at least $13 million in 2022.Jacksonville, maybe not coincidentally, has roughly $14 million in salary cap space and could create more room by signing tight end Evan Engram to a long-term deal. Engram is schedule to play under a one-year deal worth $11.3 million, although he has yet to sign the franchise tender.\"There´s always time to add,\" Baalke said. \"We´re in a good situation from a cap perspective. There´s room to work here. ... We´re not done putting this team together. We´re going to take a hard look at what we have.\"Jacksonville didn't have enough to pressure opposing quarterbacks with any regularity last season.",
        "The Jaguars finished tied for 25th in the NFL with 35 sacks in 2022 and managed just three in two playoff games. A lingering memory from Jacksonville´s 27-20 playoff loss at Kansas City was repeatedly failing to get to Patrick Mahomes despite the star quarterback limping around on a badly sprained right ankle.",
        "And while Baalke and coach Doug Pederson expect their defense to make strides after starting two rookies - first-round draft picks Travon Walker and Devin Lloyd - most of last season, they still have holes.Backup pass rushers Arden Key and Dawuane Smoot are gone: Key signed with rival Tennessee in free agency and Smoot is a free agent who is recovering from a torn Achilles tendon sustained in December.Smoot could end up re-signing with Jacksonville, but he´s unlikely to be ready for training camp.Jacksonville does have Jordan Smith, a fourth-round draft pick from UAB in 2021, coming off reconstructive knee surgery and second-year pro De´Shaan Dixon.But the position is hardly set for this upcoming season or beyond. Former first-round picks Josh Allen (seventh overall in 2019) and K´Lavon Chaisson (20th in 2020) are entering the final year of their rookie deals, and Jacksonville waited until the fifth round to add a pass rusher in last week´s draft.Baalke chose Louisville´s Yasir Abdullah with the 136th overall selection. The 6-foot-1, 235-pound Miami native had 19½ sacks during his last two seasons, leading the Atlantic Coast Conference with 9½ sacks in 2022 and ranking second with 10 in 2021.And undersized pass rushers have become more common since James Harrison, Dwight Freeney and Elvis Dumervil broke the mold.",
        "\"What you see with the smaller guys that are having success in this league is it´s hard for the 6-6, 6-7 tackles to get down to their level, and it´s a changeup for our guys,\" Baalke said. \"And our defensive staff was looking for a guy that was a changeup to what we currently have.\"Even with Abdullah in the mix, the Jaguars want more options as they head into a season with expectations of repeating as AFC South champions and closing the gap on conference heavyweights Kansas City, Buffalo and Cincinnati.And there are guys who would fit.Clark, 29, has 58 1/2 sacks in eight seasons, including the past four with the Chiefs. The 30-year-old Floyd had 29 sacks the past three years with the Los Angeles Rams.Quinn, 32, was traded from Chicago to Philadelphia last season and finished with one sack after getting a Bears record 18 1/2 in 2021. The 28-year-old Ngakoue might be a better option. He's had at least eight sacks in each of his seven NFL seasons, but he's also played for five teams over the past four years - he's been traded three times - and ended his tenure in Jacksonville with a Twitter spat involving co-owner Tony Khan.Fellow edge rushers Jadeveon Clowney, Markus Golden, Justin Houston and Melvin Ingram also are available.",
        "\"I do feel strongly that our locker room is capable of handling any person, any player, any situation,\" Pederson said.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}