{
    "articleURL": "/tvshowbiz/article-12053737/Julie-Bishop-shares-glimpse-inside-Westminster-Abbey-ahead-Coronation-King-Charles-III.html",
    "content": [
        "Julie Bishop has a prime spot at the Coronation of King Charles III.",
        "The former Australian Minister for Foreign Affairs shared a glimpse inside Westminster Abbey ahead of the ceremony to her Instagram Stories on Saturday. The 66-year-old, who wore an elaborate hat and designer beige dress, beamed alongside American singer Lionel Richie. 'And I take my seat at the Coronation next to Lionel Ritchie, Prince's Trust Global  Ambassador' she wrote in her caption. 'I'm excited about attending today the coronation of their Majesties,' Bishop told The Daily Telegraph on her way into the venue earlier. ",
        "'I chair the Prince's Trust in Australia and it's also a wonderful opportunity to highlight the great work of King Charles around the world in two countries with employment and education. So, it's an amazing opportunity.' On Friday, Julie shared a photo of herself in London alongside her 'plus one' Tayla Green-Aldridge. 'We at Prince's Trust Australia are thrilled that Tayla Green-Aldridge, a proud young Wiradjuri and Yuin woman from NSW and a recent graduate of @princes.trust.au' she wrote in her Instagram caption. 'Her first trip overseas, in fact her first time on a plane, Tayla is taking London - and the Australian media - in her stride! Congratulations to all Prince's Trust alumni who will be witnessing this historic occasion' Bishop added. ",
        "Bishop, Nick Cave and soccer superstar Sam Kerr are among a handful of Australians invited to King Charles III's Coronation.",
        "Prime Minister Anthony Albanese and his partner Jodie Haydon will lead the group of Australians attending the ceremony at Westminster Abbey, in London.Millions of people around the globe will tune in to watch King Charles and Queen Consort Camilla be crowned at Westminster Abbey in London on Saturday.All the pomp and splendor will start at 7.30pm AEST with the King's procession to Westminster Abbey and the Coronation will begin at 8pm.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.At Saturday's coronation, he and Queen Consort Camilla will be officially crowned by the Archbishop of Canterbury, Justin Welby.",
        "Ms Sam Kerr OAMMs Leanne Benjamin AM OBEMr Nick Cave AOMs Jasmine CoeMr Adam Hills MBEDr Daniel NourMiss Yasmin PooleMs Emily ReganMs Minette SalmonMs Claire Spencer AMProfessor Merryn VoyseyCorporal Daniel Keighran VCMr Richard Joyes CVMs Yvonne Kenny AMJulie BishopTayla Green-AldridgeAnthony Albanese and Jodie HaydonDavid Hurley and Linda Hurley "
    ]
}