{
    "articleURL": "/wires/ap/article-12043781/X-Games-return-Southern-California-coast-tour-July.html",
    "content": [
        "VENTURA, Calif. (AP) - The X Games are coming home to Southern California this summer for an eight-day tour of the Pacific coast.",
        "The action sports competition announced Wednesday that it will host events in San Diego, Los Angeles and Ventura from July 16-23. The full slate of summer sports will include skateboarding, BMX and motocross competitions, with more than 150 athletes expected to participate in the tour that'll culminate at the seaside Ventura County Fairgrounds on July 21-23.Fans also will be allowed back at X Games in the U.S. for the first time since the COVID-19 pandemic began. The competition staged unattended events in Southern California in the past two years.The 2023 summer edition of the 28-year-old X Games is the first since ESPN sold a majority stake in the competition to MSP Sports Capital, a private equity firm. ESPN and ABC are still broadcasting the events.Steve Flisler, a former executive at Twitch, took over as the X Games' CEO late last year and quickly announced his desire to return the event to its roots. The X Games have been staged frequently over the past quarter-century in Southern California, an action sports hotbed and the ancestral home of both skateboarding and BMX competition.\"It was easy for us to say, `Let´s start the next chapter in the birthplace of action sports,'\" Flisler said shortly after formally announcing the X Games' return to California in a ceremony in front of Ventura's city hall.",
        "\"There's so much lineage here, and also in downtown LA at LA Live,\" Flisler added. \"It was a natural fit, and it allows us to focus on the athletes and the energy with a pretty incredible backdrop here in Ventura.\"San Diego hosted the third and fourth editions of the X Games in the 1990s, and Los Angeles hosted the events from 2003-13 before organizers fragmented the competition worldwide among several cities.Flisler said the X Games decided to split up the competition among three sites and two weekends in 2023 to allow more fans to attend the competitions easily. The X Games also announced a partnership with Amtrak's Pacific Surfliner train service, which runs through 350 miles of picturesque California scenery, to encourage sustainable travel to the events.\"That´s the nature of what action sports are,\" Flisler said. \"It´s community-based. We want to give more access, and I think it´s our role to provide more opportunities for the athletes to compete, but also to showcase them.\"San Diego will host the popular Best Trick competition for street skaters and BMX riders, and organizers are planning a large fan event during the ensuing competition in downtown Los Angeles before the event finals in Ventura.\"This event is going to be bigger and better than anything we´ve ever done, especially in the last 10 years,\" X Games vice president Valerie Ryan said.",
        "MSP Sports Capital is backed by billionaire Jahm Najafi, a part-owner of the Phoenix Suns, and former sports agent Jeff Moorad. The firm also invests in the McLaren auto racing team and five European soccer teams, including Augsburg in the German Bundesliga.The new X Games leadership already staged the winter event last January in Aspen, where longtime action sports broadcaster Selema Masekela returned as the event´s television host.___AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}