{
    "articleURL": "/wires/reuters/article-12057145/Soccer-Dortmund-crush-Wolfsburg-6-0-stay-point-Bayern.html",
    "content": [
        "DORTMUND, Germany, May 7 (Reuters) - Borussia Dortmund demolished hapless VfL Wolfsburg 6-0 on Sunday, with two goals apiece from Karim Adeyemi and Jude Bellingham, to stay hot on the heels of Bundesliga leaders Bayern with three games left in the season.",
        "The Ruhr valley club fired three goals past the Wolves in the first half to take the wind out of their sails and added three more after the break in a one-sided game which Wolfsburg littered with defensive errors.Dortmund are now on 64 points, one behind Bayern, 2-1 winners against Werder Bremen on Saturday.\"We are satisfied today but a long way from happy,\" said Dortmund coach Edin Terzic. \"But if we go into the next games with such readiness then we have good chances of winning the last three games.\"It was a good sign today but it will mean nothing if we don't build on it,\" he added. \"Three weeks left, three matches, two at home. If we win the last three and maybe take the lead first in the final game then we have increased the pressure.\"This season feels crazy and we will hope to keep it crazy until the end and to have something to celebrate.\"Dortmund host Borussia Moenchengladbach next Saturday while Bayern take on Schalke 04.In front of a sold-out crowd of more than 81,000, the hosts went in front after 14 minutes with Adeyemi rising high to head in his fifth goal of the season.The Wolves had only one chance in the first half and they should have levelled when Patrick Wimmer failed to beat keeper Gregor Kobel from close range in the 20th and Jonas Wind missed the target with his rebound.",
        "Instead it was Dortmund who struck again in the 28th when Adeyemi delivered a pin-point assist for Sebastien Haller to tap in.Donyell Malen did the same from a Julian Brandt assist in the 37th and after the break the hosts picked up where they had left off with Bellingham seeing his shot initially blocked by keeper Koen Casteels before the ball bounced off the bar and rolled in.Wolfsburg's disastrous defending continued, with another wrong pass allowing Adeyemi to slip in and make it 5-0 in the 59th. The Germany international could have earned his first Bundesliga hat-trick but he thundered a 65th-minute penalty over the bar.Bellingham put an end to Wolfsburg's ordeal in the 86th. (Reporting by Karolos Grohmann; editing by Clare Fallon)"
    ]
}