{
    "articleURL": "/sport/formulaone/article-12060047/Miami-GP-slammed-wild-food-prices-fan-shares-snap-dire-42-Wagyu-steak-sandwich.html",
    "content": [
        "Red Bull's Max Verstappen took out Sunday's race to further his place at the top Fans have conveyed their outrage online regarding the offerings at the Miami GPDailyMail.com provides all the latest international sports news Fans who attended the Miami GP may have been satisfied with the weekend's racing but some were outraged by the quality and ostensibly exorbitant pricing.",
        "The glamorous Grand Prix had prices to match with attendees sharing photos of food and the menus from which they were ordered from on social media. Billionaires Elon Musk and Jeff Bezos were in attendance throughout the weekend at the Florida and it seems some offerings were made for a wallet akin to theirs. A watermelon and tomatillo would reportedly set someone back $250, something a fruit salad; $295, U-5 chilled prawns; $500, even $275 carne asada nachos. For crustacean lovers, seemingly succulent lobster rolls could be purchased for a cool $450.The gourmet menu shared to Twitter does show the reported dishes were for four people, softening the blow of the steep pricing. ",
        "A photo purportedly showing a wagyu sandwich reported to have cost $42 at the course, surrounding the Miami Dolphins' Hard Rock Stadium.'$42 Wagyu steak sandwich at Miami F1…Fyre festival vibes,' said crypto commentator Peter McCormack alongside a photo of the rather unpleasant looking sandwich. If caviar was desired by racegoers, because why wouldn't it be? That was an offer too, at $400 an ounce.Another Twitter said 'I thought this was a different currency at first', before tweeting at Musk, offering a suggestion as to how he should next spend his time.'@elonmusk for your next venture you need to solve these prices. Even you can't afford this at Miami F1!' ",
        "The Miami GP guest experiences department are yet to respond to Dailymail.com's request for comment. While there were a litany of exclusive gourmet dishes were available, simpler and more affordable options were too. According to News.com.au, there were hamburgers on sale for $15, fries for $4.75 and steak chaufa for $21 at various food spots. 'We really pride ourselves on delivering the very best food and beverages from the South Florida region and incorporating it into this global event, including 14 locally based, minority-owned restaurants,' Miami GP president Tyler Epp told Miami New Times. 'We've really upped the ante this year.'",
        "Away from the food venues, Verstappen continued to assert himself as the preeminent driver on this season's F1 circuit, winning the GP ahead of Ferrari's Sergio Perez and Aston Martin's Fernando Alonso. The Dutchman sits atop the drivers standings -- with three race wins and five podiums -- on 119 points. Perez (105 pts) and Alonso (75) are next best placed ahead of fourth-placed Brit, Lewis Hamilton (56).As expected, there were a litany of celebrities in attendance for the Miami GP, with Tom Cruise, Shakira, Roger Federer, Dak Prescott, CeeDee Lamb, Vin Diesel and Ludacris to name just a few. Next up on the circuit is the Emilia Romagna Grand Prix. One would figure the food may be a little cheaper in Bologna. "
    ]
}