{
    "articleURL": "/wires/pa/article-12041565/Grenfell-bereaved-face-longer-road-ahead-report-not-2024.html",
    "content": [
        "News the Grenfell Inquiry’s final report is unlikely to be published until next year is a sign “justice is being kicked further down the road”, a campaign group said.",
        "The final hearing took place in November 2022 and a panel and inquiry team have been working on their phase two report since then.On Tuesday, in a monthly newsletter published on its website, the inquiry confirmed the final report is unlikely to be published until 2024. History is repeating itself. It’s what we expected. Justice is being kicked further down the road  Grenfell United  Phase two examined how the tower block came to be in a condition that allowed the fire on 14 June 2017 to spread.The report into phase one, which focused on the factual narrative of the events on the night of the fire, was published in October 2019.It concluded the tower’s cladding did not comply with building regulations and was the “principal” reason for the rapid and “profoundly shocking” spread of the blaze.The inquiry team said it will “spare no effort” to finish the final report as soon as possible.It acknowledged “everyone involved in the inquiry wants the report to be published as soon as possible and we fully understand the importance that has for them and for the wider public”.But it said the report must be “complete and accurate”.Chapters are at different stages of drafting and several stages are yet to be completed, it said.",
        "The team said the report will be sent to the Prime Minister “as soon as we can, but that will probably not be possible before the beginning of next year”, after which Rishi Sunak will decide when it will be published publicly.",
        "Campaign group Grenfell United, which represents survivors and bereaved families of the west London fire, which claimed 72 lives, said those affected now face an “even longer road ahead”.In a statement, the group said: “We went through this same delay following the conclusion of phase one, which was pushed back by six months.“This news is no surprise. History is repeating itself. It’s what we expected. Justice is being kicked further down the road as the system continues to protect those who should be held accountable. A system we have no influence over.“It’s just another reminder of what we are forced to battle against. Six years, no justice and now an even longer road ahead.”Also on Tuesday, a judge approved a “global” settlement of compensation claims made by people affected by the fire.Lawyers representing bereaved relatives, survivors and local residents told a High Court hearing in London there had been a global settlement of about 900 cases and a global sum of about £150 million compensation agreed."
    ]
}