{
    "articleURL": "/wires/pa/article-12038067/Landmarks-light-celebration-King-s-coronation.html",
    "content": [
        "Colourful illuminations will light up landmarks across the UK to celebrate the King’s coronation this weekend.",
        "As part of the Coronation Concert, choreographed lasers, projections and drone displays will radiate over historic bridges and buildings on Sunday.Seven of the 10 locations involved in the event, Lighting up the Nation, have been disclosed so far, including Blackpool seafront in Lancashire, where people can join a viewing party from Blackpool Tower.Sheffield Town Hall will showcase a display in the Peace Gardens, while Newcastle’s Tyne Bridge and Gateshead’s Millennium Bridge lights will cast riverside reflections for an audience stretching between the quays.",
        "A drone show will light up the sky above the Eden Project in Cornwall, and its biomes will become multicoloured for spectators invited from the local volunteer community.Light shows will also brighten up Belfast, Edinburgh and Cardiff at various locations.The remaining three locations will be revealed during the concert.Lighting up the Nation will be broadcast live on the BBC, accompanied by a poetry reading by James Nesbitt.The Bloodlands actor will read a piece written for the occasion by Daljit Nagra, chairman of the Royal Society of Literature.Meanwhile, British popstar Paloma Faith will perform one of her hits as a soundtrack to the illumination sequence.Catherine Catton, head of commissioning and events at the BBC, said “The Lighting up the Nation sequence promises to be a truly spectacular part of the Coronation Concert.",
        "“With stunning light shows illuminating some of our most iconic locations, alongside performances from James Nesbitt and Paloma Faith, this is going to be a very special moment for people all across the country to come together in celebration.”The Coronation Concert will be broadcast to 20,000 guests in the grounds of Windsor Castle, Berkshire, and live on the BBC One from 8pm."
    ]
}