{
    "articleURL": "/wires/pa/article-12056757/Morecambe-boss-Derek-Adams-says-players-gave-bid-stay-up.html",
    "content": [
        "Morecambe manager Derek Adams felt his side did all they could to stay up after a 3-2 defeat at Exeter saw the Shrimps condemned to relegation from League One.",
        "After a dire first half, Jay Stansfield put Exeter in front, only for Cole Stockton to equalise and give Morecambe hope of staying up.But Stansfield dashed those hopes with two more to complete his hat-trick before Stockton’s consolation strike, deep into 14 minutes of stoppage time.“We needed to try and win today and it was 0-0 at half-time,” Adams said. “We knew Cambridge were 2-0 up so it meant we definitely needed to win the game.“We tried our best but they scored a goal early in the second half. We pulled one back but then they got a second. We found it difficult after that because we were chasing the game and there were big holes all over the pitch.“We took nearly 900 supporters with us today which is fantastic. Not so long ago, we didn’t have 900 home supporters, it is fantastic they have come with us today.",
        "“We had tremendous backing throughout the season. But it is not about losing today, it is over the season. The players have given their best.“It was cagey in the first half, neither side really threatened the goalkeeper. If we scored a wee bit earlier, we might have been able to pull it back as there was a lot of injury time.",
        "“The players gave everything and worked hard throughout the campaign and we just came up short.”As for Exeter, the day belonged to Stansfield in was the final game of his loan spell from Fulham.The 20-year-old celebrated his hat-trick goal by running towards and pointing to the stand that bears his late father’s name in what was a truly emotional moment.City boss Gary Caldwell said: “Jay is brilliant and I am running out of words to describe him.“He’s an absolute pleasure to work with and he has had difficult periods in the season where he doesn’t score, but he’s a fantastic team player – he works hard for the team.“He does all the right things in terms of his preparation and how he trains and that (hat-trick) was well deserved for all of his hard work this season and I am delighted that he had that moment with the supporters inside the stadium.”On his team’s performance, Caldwell added: “It is always good to win games of football. I thought we were the better team throughout.“In the first half, I thought the possession was too slow, but we came out with a better intensity, we played much quicker and we scored three brilliant goals.“I was disappointed with the two goals we conceded and that is an area we definitely have to improve next season but, overall, after the season we have had and the run we’ve been on, I am delighted to finish with a win.”"
    ]
}