{
    "articleURL": "/wires/reuters/article-12052603/US-STOCKS-Dow-best-day-Jan-6-Apple-rally-jobs-data.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers add 253,000 jobs in AprilIndexes: Dow up 1.7%, S&amp;amp;P 500 up 1.9%, Nasdaq up 2.3%(New throughout, updates with official closing prices, volume, details on regional banks' rally, earnings graphic)By Caroline ValetkevitchNEW YORK May 5 (Reuters) - U.S. stocks rallied on Friday, with the Dow posting its biggest one-day percentage gain since Jan. 6, as shares of Apple surged more than 4% after upbeat results and U.S. jobs data pointed to a resilient labor market.Adding to the bullish momentum, regional bank shares rebounded from declines tied to the collapse of First Republic Bank. Analysts upgraded a number of lenders they said were oversold.PacWest Bancorp rallied 81.7% and Western Alliance Bancorp jumped 49.2%, while the KBW regional bank index advanced 4.7%.Apple's quarterly results also cheered investors worried about a potential recession. The iPhone maker's shares hit their highest level in about nine months, and the stock ended up 4.7% in its biggest daily percentage gain since November.The stock was the biggest positive influence on all three major U.S. stock indexes.The U.S. Labor Department report showed job growth accelerated in April and wage gains increased solidly, suggesting the labor market has stayed strong despite recent interest rate hikes from the Federal Reserve.",
        "With the jobs report, \"it's about the state of the U.S. economy, and what we saw today suggests it's in a better position than previously expected,\" said Kristina Hooper, chief global market Strategist at Invesco in New York.Investors have been worried that the rate hikes may eventually push the economy into recession.The Dow Jones Industrial Average rose 546.64 points, or 1.65%, to 33,674.38, the S&amp;amp;P 500 gained 75.03 points, or 1.85%, to 4,136.25 and the Nasdaq Composite added 269.02 points, or 2.25%, to 12,235.41.The Cboe Volatility index registered its biggest one-day decline since March 16.The Dow and S&amp;amp;P 500 still registered losses for the week, however, while the Nasdaq ended with a slight gain for the week.On Wednesday, the U.S. central bank raised rates by 25 basis points as expected, but Fed Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Apple drove gains in other tech shares, but all 11 major S&amp;amp;P sectors were higher on the day.The estimated decline in first-quarter S&amp;amp;P 500 earnings has been getting smaller since the start of the reporting season and is now at just 0.7% year-over-year, Refinitiv data showed on Friday.Volume on U.S. exchanges was 10.57 billion shares, compared with the 10.70 billion average for the full session over the last 20 trading days.",
        "Advancing issues outnumbered declining ones on the NYSE by a 4.95-to-1 ratio; on Nasdaq, a 2.75-to-1 ratio favored advancers.The S&amp;amp;P 500 posted 13 new 52-week highs and 3 new lows; the Nasdaq Composite recorded 87 new highs and 104 new lows.(Additional reporting by Ankika Biswas and Sruthi Shankar in Bengaluru and Sinead Carew in New York; Editing by Subhranshu Sahu, Shounak Dasgupta and David Gregorio)"
    ]
}