{
    "articleURL": "/news/article-12060677/Meet-photographer-immortalising-King-family-two-decades.html",
    "content": [
        "Hugo Burnand, 59, is the only portrait photographer with a King's Royal WarrantHe said he uses jelly beans to keep his subjects in line while photographing themSociety photographer Hugo Burnand has a secret weapon when it comes to portraits of the Royal Family – jelly beans. ",
        "He used bowls of the sweets to keep William and Kate's bridesmaids and page boys in line while photographing them with the royal couple at their wedding. Mr Burnand has not said whether he has used the trick on any of his other subjects, however. These include the late Queen, Baroness Thatcher, former US President Bill Clinton and artist Lucian Freud. The father-of-four has had an enormous amount of success regardless – he is now the only portrait photographer with a Royal Warrant given by the King.",
        "He has been capturing royal portraits for almost two decades. But he first turned down the opportunity that launched him into his career as a royal photographer - Charles' wedding to Camilla wedding in 2005. Mr Burnand, a society photographer for Tatler magazine, had taken a career break to take his young children to South America for six months in 2004. Disaster struck when thieves stole the family's money, passports and Mr Burnand's camera equipment. It was only when the photographer found an internet cafe to try to contact his insurers that he saw an email from Clarence House, asking him to get in touch. Mr Burnand initially said no to the job but said he realised while trekking in the jungle that he had just turned down the chance of a lifetime – the future King's wedding.",
        "This change of heart changed his life and he has since photographed William and Kate's 2011 wedding, and taken official portraits of Charles on his 60th and 70th birthdays, and of Charles and Camilla in the run-up to the Coronation. He also photographed the Princess Royal to mark her 70th birthday, and took the official pictures for the wedding of Lady Gabriella Windsor in 2019. Mr Burnand, 59, has said he likes his portraits to have an 'approachable' quality and wants viewers to feel 'you are almost talking to the person'. However, his method has had to accommodate for the second-by-second precision of royal events, for which Mr Burnand has to prepare rigorously. He and his stepmother Ursy Burnand, who is also a photographer, rehearsed for William and Kate's wedding for more than three weeks, taking over the Throne Room at Buckingham Palace.",
        "Knowing they could not over-run by a moment, they used stopwatches and Palace staff to rehearse the group photographs as they knew they would have only 26 minutes before an RAF flypast for which the entire family had to appear on the balcony. 'We had spares for everything and then spares for the spares,' Mr Burnand said in an interview. 'We did dress rehearsals with stopwatches using endless staff from Buckingham Palace to fill in as family members, so we knew we had just enough time.' ",
        "He said bowls of various sweets were on hand for the young bridesmaids and page boys, telling Tatler magazine: 'We had bowls full of jelly beans and other sweets as rewards. Interestingly, all the jelly beans disappeared, although I'm not convinced it was only the little people who ate them.' Born in Cannes, France, Mr Burnand was raised in Berkshire and went to Cheam School in Headley, Hampshire, the prep school attended by the King and the late Duke of Edinburgh. He won his first photography competition at the school, aged seven, and practised his skills while at Harrow, taking portraits of school-leavers. His mother Susan Gordon was killed in a car crash in 1964, the year after he was born, and he was raised by his father Peter and his stepmother Ursy, from whom he learned his early photography skills. After working as a stable hand and then as an insurance broker at Lloyd's of London, he became a professional photographer at 27 and worked as Tatler's society photographer for its Bystander party column for more than 20 years.",
        "He took the photos at David and Samantha Cameron's wedding in 1996 and his other famous subjects include Spike Milligan, Victoria Beckham and Michael Jackson. But he is best known for his images of the Royal Family, following in the footsteps of Cecil Beaton, who photographed Queen Elizabeth II after her 1953 Coronation. ",
        "Mr Burnand said he had spent weeks studying images from past coronations, including the portraits of the late Queen. Beaton later revealed in his diaries that he had such nerves about the 1953 Coronation that he drank heavily the night before and woke up badly hung over.When he came to the task, he feared he had the lighting wrong but realised he did not have time to change anything. He wrote: 'I was banging away and getting pictures at a great rate. I had only the foggiest notion of whether I was taking black and white, or colour, or giving the right exposures.' "
    ]
}