{
    "articleURL": "/wires/afp/article-12058323/Thailand-chokes-pollution-greens-struggle-heard-election.html",
    "content": [
        "Trudging along Bangkok's hot and dusty streets, green candidates struggle to canvass support ahead of Thailand's election, with record-breaking pollution failing to spur anything more than political hot air.",
        "For the past three months, much of the kingdom has been choking on dangerous air pollution, with smoke from forest fires and farmers burning crop stubble suffocating northern Chiang Mai and cloaking the capital with hazardous smog.Despite the region facing recent record-breaking heatwaves and worsening flooding due in part to rising sea levels, green movements have gained little traction with Thai voters.\"People acknowledge it but they have no hope that politicians can solve this problem,\" Green Party leader and founder Phongsa Choonaem told AFP while he campaigned for the May 14 vote.As he distributed tree leaves rather than paper flyers to bemused bystanders, he said the public's understanding of environmental issues was improving.But the party is fielding just a handful of candidates for the 500-seat lower house.\"We are not aiming for the prime minister position, we want to solve the environmental problem,\" said Phongsa.- 'Public health crisis' -",
        "Thailand's election is gearing up to be a clash between reformist movements -- the Pheu Thai and Move Forward parties -- and establishment outfits like Palang Pracharath Party (PPRP) and Prime Minister Prayut Chan-o-Cha's new United Thai Nation Party.But alongside the circus of parties vying to outbid each other with populist welfare policies, environmental issues have been a sideshow.",
        "Move Forward has rolled out proposals to drive growth and reduce carbon emissions, including agricultural subsidies and promoting electric vehicle technology, while Pheu Thai has pledged to stop the stubble burning within a year.Pheu Thai -- along with PPRP, and the Democrat Party -- has also backed a version of the Clean Air Act, initially drafted and proposed by the citizen think tank Clean Air Network (CAN).\"This is a real public health crisis,\" said CAN's Weenarin Lulitanonda, noting that about two million people have needed hospital treatment this year because of air pollution.She cautiously welcomed politicians finally talking about the issue, but characterised many of their election promises as \"loosey-goosey\" in detail.Delivering results in the form of legislation is what will count, she said.",
        "A long-time campaigner on air pollution, Weenarin said voters' growing awareness of the issue was encouraging, but warned against framing it as a choice between the environment on one side and economic growth, healthcare and democracy on the other.\"These things can be done in parallel, because maintaining your health and being alive is a really important precondition for any other issue that you care about,\" she said.\"This is something that has to be above political or business interests, whether that's the case or not is to be seen.\"",
        "Hampering substantive change is Thailand's system of political patronage, in which wealthy clans leverage links to further their business interests, said Danny Marks, assistant professor of environmental politics and policy at Dublin City University.Air pollution is blamed on poor rural farmers burning their crops, he said, but they are paid by huge multinational Thai firms.\"Those who benefit basically from everyone breathing the bad air, unfortunately, are those who are quite close to the government,\" Marks told AFP.He noted that even leading opposition parties like Pheu Thai had never prioritised air pollution or environmental issues.\"I think they have always been allied to big business,\" Marks said.- 'Hear us' -The northern city of Chiang Mai, long a favourite with backpackers, has this year earned an unenviable international reputation for poor air quality, regularly beating notorious hotspots such as Beijing and Delhi in the list of most polluted cities.",
        "Verapol Charasirilert was studying in Chiang Mai but returned to Bangkok because the pollution was so bad.\"I don't think political parties have enough policies on the environment,\" the 19-year-old told AFP, saying he planned to vote for Move Forward.An ISEAS-Yusof Ishak Institute climate report late last year found 66 percent of Thais felt political parties did not prioritise climate change enough.",
        "On the front line of the public health crisis caused by pollution, Chiang Mai cardiologist Rungsrit Kanjanavanit agreed.\"The policymakers need to understand the science and they need to realise the importance of it,\" he told AFP.\"People have been yelling, screaming a lot so they are beginning to hear us.\""
    ]
}