{
    "articleURL": "/wires/reuters/article-12059995/Euro-zone-inflation-slow-momentum-high-ECBs-Lane.html",
    "content": [
        "May 8 (Reuters) - Euro zone inflation will slow sharply this year but price growth momentum remains high for now, including for underlying goods and services, European Central Bank chief economist Philip Lane said on Monday.",
        "The ECB has lifted rates at its past seven meetings but slowed the pace of hikes last week, arguing that plenty of policy tightening is already in the pipeline and overall inflation has already turned around after double-digit readings last autumn.\"There's a lot of disinflation coming later this year (but) not quite yet,\" Lane said in a lecture organised by the Forum New Economy in Berlin. \"We're still (seeing) a lot of momentum in inflation... there's still momentum in food and core inflation.\"Lane argued that sharply lower energy prices and easing bottlenecks should speed disinflation while corporate profit margins, a key driver of prices last year, should also come down.\"This year (businesses) expect margins to fall quite a bit, because they may face cost increases, including labour costs increases, but they won't be able to increase prices by so much because demand is normalising,\" Lane said.The ECB projects inflation falling below 3% by the fourth quarter but it could then take almost two more years before it falls to the bank's 2% target.Some policymakers question this projection and argue that there's a risk that price growth could get stuck above the ECB's target.A key reason for such a protracted process is that nominal wage growth could stay relatively strong for years as workers recover incomes lost to inflation.",
        "\"There's a very basic imperative for the labour market to rebuild real wages,\" Lane said. \"This is a kind of transition phase lasting several years, which helps explain why inflation is not immediately dropping back to 2%.\" (Reporting by Balazs Koranyi; editing by Philippa Fletcher and Susan Fenton)"
    ]
}