{
    "articleURL": "/wires/afp/article-12045767/Sudan-truce-efforts-tatters-fighting-rages-on.html",
    "content": [
        "US President Joe Biden on Thursday threatened to impose new sanctions over Sudan's conflict, saying the fighting \"must end\", as gunfire and explosions rocked Khartoum for a 20th straight day.",
        "Hundreds of people have been killed in Sudan since battles began on April 15 between army chief Abdel Fattah al-Burhan's forces and his former deputy Mohamed Hamdan Daglo's Rapid Support Forces (RSF).As the latest ceasefire expired at midnight (2200 GMT), the army said it was ready to abide by a new seven-day truce, but there was no word from its foes in the paramilitary RSF.Biden signed an executive order on Thursday that broadens authority to impose sanctions on those responsible for \"threatening the peace, security, and stability of Sudan\" and \"undermining Sudan's democratic transition\", the US leader said in a statement without naming potential targets.",
        "\"The violence taking place in Sudan is a tragedy -- and it is a betrayal of the Sudanese people's clear demand for civilian government and a transition to democracy. It must end,\" Biden said.Within hours of the latest supposed ceasefire taking effect, witnesses in Khartoum reported explosions and exchanges of fire on the streets around dawn and clashes during the day in the city of five million people.The foreign ministry later accused the RSF of attacking the Indian embassy and other evacuated diplomatic missions.In El Obeid, some 300 kilometres (185 miles) south of the capital, witnesses also reported battles.The fighting has killed about 700 people so far across Sudan, most of them in Khartoum and the western Darfur region, according to the Armed Conflict Location and Event Data Project.",
        "- 'Peace at stake' -The UN refugee agency said it was preparing for an outflow of 860,000 people from the north African country, adding that $445 million would be needed to support them just through October.\"The needs are vast... If the crisis continues, peace and stability across the region could be at stake,\" said Raouf Mazou, the UNHCR's assistant chief of operations.",
        "More than 100,000 people have already fled Sudan since the fighting erupted.On the day it began, Burhan and Daglo had been due to meet with international mediators to discuss the RSF's integration into the army -- a key condition for the transition to democratic rule.Instead, Khartoum awoke to the sound of gunfire as the ongoing dispute became a bitter struggle for power.The UN's top humanitarian official, Martin Griffiths, on Wednesday visited Sudan to try to negotiate safe passage for aid and aid workers, after six trucks of supplies from the World Food Programme were looted on their way to war-torn Darfur.",
        "The region is still scarred by a war that erupted in 2003 when then-president Omar al-Bashir unleashed the Janjaweed militia against ethnic minority rebels.The Janjaweed -- whose actions led to war crimes charges against Bashir and others -- later evolved into the RSF.",
        "The United Nations said Darfur civilians were again being armed in the latest fighting.The Norwegian Refugee Council said violence in the West Darfur state capital, El Geneina, has \"resulted in the loss of at least 191 lives\".\"Dozens of settlements have been burnt and destroyed, and thousands have been displaced,\" it said.- 'African solutions' -UN Secretary-General Antonio Guterres acknowledged Wednesday the international community had \"failed\" Sudan.\"A country like Sudan, that has suffered so much... cannot afford a struggle for power between two people,\" he said.",
        "Mediation efforts have multiplied since the conflict began, with Egyptian Foreign Minister Sameh Shoukry saying Thursday he had spoken with both rival generals by phone.The army said Wednesday it favoured those of the East African regional bloc IGAD, because it wanted \"African solutions to the continent's issues\". Burhan's envoy arrived Thursday in the Ethiopian capital Addis Ababa.The army said it was also considering a Saudi-US bid to halt the fighting.Arab League foreign ministers will meet on Sunday to discuss the conflict ahead of a summit in Saudi Arabia later this month, a diplomat told AFP.Nearly 450,000 civilians have fled their homes since fighting began, the International Organization for Migration said, including the more than 115,000 who have sought refuge in neighbouring countries.",
        "Foreigners are fleeing the country primarily via Port Sudan on the Red Sea. The UN said \"more than 50,000 people crossed on May 3\" into Egypt, some \"30,000 to Chad\" and 11,000 more went to Ethiopia.Since Bashir's ouster in a 2019 coup, international mediators have sought to bring civilians and the military to the negotiating table.But in the process, analysts believe, they gave too much credit to Burhan and Daglo, who worked together in the coup that derailed the transition to elective civilian rule before falling out in a power struggle."
    ]
}