{
    "articleURL": "/sport/football/article-12056295/Frank-Lampard-insists-Chelsea-need-develop-killer-instinct-attack-catch-sides.html",
    "content": [
        "Frank Lampard says Chelsea need to develop a killer instinct to catch top clubs It comes after he secured his first win as interim manager against BournemouthLampard also backed the club's owner Todd Boehly to eventually be successful Frank Lampard believes Chelsea need to become \"killers\" in attack in order to build on an overdue victory and begin bridging the sizeable gap to the Premier League's leading clubs.",
        "The mid-table Blues ended a nine-match winless run on Saturday, including six successive defeats since Lampard was reappointed, by beating Bournemouth 3-1.Conor Gallagher headed the visitors in front at Vitality Stadium but, after Matias Vina's leveller, they were largely toothless going forward until late finishes from Benoit Badiashile and Joao Felix halted the prolonged slump.While a top-half finish is the extent of Chelsea's potential this season, they will hope to be challenging for Champions League qualification at the very least next term.Interim manager Lampard, who is due to leave Stamford Bridge in the summer, feels the Blues must develop a ruthless streak in order to do that and suggested the club may need further recruits, despite having already spent more than £600million on transfers since Todd Boehly's takeover.",
        "\"We controlled a lot of the game,\" he said of the south-coast success.\"Without the killer instinct, we were running inside their box a lot in the first half, we had a lot of overloads on the side of the pitch.\"And as this team develops or as we add to the squad I think you have to be more killers at the top end of the pitch.\"If you look at the top half of the table, that's what you will see all across it. At the moment, we haven't got that. But you saw nice individual performances in a positive direction.\"",
        "Two-time European champions Chelsea sit in 11th position, a staggering 40 points behind leaders Manchester City and well adrift of the top four.Travelling supporters celebrated the long-awaited triumph with self-deprecating cries of 'we are staying up', having earlier directed derogatory chants at American businessman Boehly.Lampard backed the club's owners to eventually be successful following a dismal first campaign at the helm.\"The fans have been used to a lot of success, they want a lot of success,\" said the former Blues midfielder.\"What I do know is the fans will stick with this club. I do know there are a lot of intentions to take this club where we want to get it to again.\"There's not one club out there of our size that hasn't had transitional periods.\"People would give a left arm to have the success we've had for 20 years, so if it's our year where we have to go again and work a bit and try and come back stronger next year, everyone stick together, then I'm sure we will.\"The west London club move on to meetings with relegation-threatened Nottingham Forest, reigning champions City, and Champions League hopefuls Manchester United and Newcastle.Lampard is concerned left-back Ben Chilwell will be unavailable for the run-in after he limped off against the Cherries.",
        "\"It's a hamstring injury,\" he said.\"We don't know if it's serious but with a hamstring injury at this stage of the season it's clearly a worry for the last few games.\"",
        "Bournemouth began the weekend level on 39 points with Chelsea and had the better chances for a winner before suffering late disappointment, with Badiashile's pivotal strike coming from Hakim Ziyech's free-kick into the penalty area.The Cherries have the worst record in the division for conceding goals from set-pieces, an issue head coach Gary O'Neil is eager to address.\"We've struggled with defending balls into the box,\" he said. \"We're obviously aware of it and it's something we need to improve.\"I'm hopeful we can put some work in now week to week but then we can put things in place for next season to make us much stronger in that area.\""
    ]
}