{
    "articleURL": "/travel/article-12053743/Secrets-Lakes-Head-lesser-known-Lake-District-wonders-glorious-hikes.html",
    "content": [
        "Tom Chesshyre, the author of a new book about the Lake District, shares his tips Loweswater and Crummock Water - half a mile apart - are 'wonderfully peaceful'READ MORE: Travel experiences guaranteed to change you foreverDaniel Defoe once described the Lake District as ‘eminent only for being the wildest, most barren and frightful of any land I have passed over’. ",
        "And he didn’t finish there. He went on to tell of the ‘horror’ of the place adding, ‘all the pleasant part of England was at an end’.Fast forward three centuries and I’m not sure what the creator of Robinson Crusoe would make of this Cumbrian hotspot, to where some 20 million visitors flock each year. Let’s just say it can get a little overcrowded.So where do you go to enjoy some ‘wandering lonely as a cloud’, as suggested by a (more upbeat) scribe William Wordsworth, poet and local? ",
        "Here’s our guide to some of the best, quiet lakeside walks. And I’ve done, and enjoyed, them all.ROUTE 1: NORTHERN SECRETOf the 16 main Lake District lakes, only one officially goes by that name: Bassenthwaite Lake, the most northerly. The rest are ‘meres’ or ‘waters’.Most tourists make for nearby Derwentwater, yet Bassenthwaite has many delights including a rare pair of ospreys, seen between April and August. ",
        "Then there is Mirehouse: an eclectic country house that once hosted Wordsworth and has pretty gardens (mirehouse.co.uk). It’s just a stroll from there to elegant little St Bega’s Church, parts of which date from the 14th century. Across the way, award-winning Lakes Distillery offers whisky, gin and vodka tastings (lakesdistillery.com).GREAT WALK: From Mirehouse to Scarness Bay and back: five miles (1 hr 45 min).",
        "WHERE TO STAY: Doubles from £228 at Armathwaite Hall Hotel and Spa (armathwaite-hall.com).ROUTE 2: QUIET DELIGHTSIn the north-west corner of the Lakes, Loweswater and Crummock Water - half a mile apart - are wonderfully peaceful.Low Ling Crag is especially relaxing, a narrow peninsula that juts into the centre of Crummock: a perfect place for a picnic. Tranquillity reigns at Loweswater, too, with glorious fells towering all around. In between the two lakes, stop at the higgledy-piggledy Kirkstile Inn with its great beer garden.",
        "GREAT WALK: Around Loweswater: four miles (1 hr 30 min). Around Crummock Water: 8.5 miles (4 hr 30 min).WHERE TO STAY: Doubles at Kirkstile Inn from £140 B&amp;B (kirkstile.com).ROUTE 3: HIKERS’ HEAVENButtermere, south of Crummock Water, is peaceful too, although the village’s pubs and cafes have a buzz. The fells around Buttermere are loved by hikers. Haystacks (579 metres), is where the ashes of legendary Lake District writer and fellwalker Alfred Wainwright (1907-1991) were scattered. Tiny St James’s Church in Buttermere village has a touching memorial to him.",
        "The village is also home to an 18th-century scandal, set around Buttermere Court Hotel, then the Fish Inn. Here a bankrupt fraudster illegally pretending to be an MP wooed and bigamously married local beauty the Maid of Buttermere (the innkeeper’s daughter). He was found out, caught, convicted and hanged.",
        "GREAT WALK: Around Buttermere: 4.5 miles (2 hr).WHERE TO STAY: Doubles at Buttermere Court Hotel from £98 B&amp;B (buttermerecourthotel.co.uk).ROUTE 4: WILD WESTEnnerdale Water is the most westerly lake, renowned for re-wilding projects which include increasing red squirrel numbers, encouraging marsh fritillary butterflies and a plan to reintroduce beavers.It’s the only big lake without a road and there’s a romantic sense of isolation, with great banks of scree and thick woodland; on its shores former U.S. President Bill Clinton proposed to Hillary in 1973. Nearby Ennerdale Bridge village has inviting pubs including the Fox &amp; Hounds, plus The Gather community centre/café (visited by the then Prince Charles in 2017).",
        "GREAT WALK: Around Ennerdale Water: seven miles (3 hr 20 min).WHERE TO STAY: Doubles at the Fox &amp; Hounds from £95 B&amp;B (foxandhoundsinn.org).ROUTE 5: THE LOFTY ONEDevoke Water is one of the smallest of the 16 main lakes and is officially a ‘tarn’ (a small mountain lake). Its name means ‘dark one’, and it’s tucked away in the far south-west on Birker Fell (235 m).",
        "The joy of Devoke Water is the mysterious lofty location, with ghosts of Bronze Age settlements seeming to gather by its shores. No one is usually around. Devoke is three-quarters of a mile long and a quarter of a mile wide. On clear days you can see Scafell Pike, England’s highest peak (978m).",
        "GREAT WALK: From Austhwaite Brow, round Devoke Water and back: three miles (1 hr 15 min).WHERE TO STAY: Self-catering at the King George IV Inn from £100 (kinggeorge- eskdale.com).ROUTE 6: GIVE THIRL A SWIRLNot many tourists make a beeline for Thirlmere - sandwiched as it is between popular Derwentwater and Ullswater. Yet there’s plenty to intrigue.Thirlmere is a reservoir created when a dam was built in 1894 to supply water to Manchester. In the process, the hamlet of Armboth was submerged, provoking an outcry from John Ruskin, the prominent local social campaigner, thinker and critic.",
        "You can walk across the dam and continue onto gently undulating trails through tree-lined banks. Thirlmere is also a good starting point for Helvellyn (950m).GREAT WALK: From the King’s Head pub to Helvellyn and back: 11 miles (7 hr).WHERE TO STAY: Doubles at the King’s Head from £90 (lakedistrictinns.co.uk).ROUTE 7: TRANQUIL TEMPTATIONFor a hideaway close to some great hiking, Brothers Water is perfect. The little lake has a 2.5-mile looping trail. Dorothy Wordsworth, William’s sister, once described the walk as ‘exquisite’.Head east, and you come to the Knott (739m) and High Street (828m), so named as the Romans built a road there. To the west is Hart Crag (822m) and Fairfield (873m), with splendid views to Ambleside.",
        "There’s a good pub, Brotherswater Inn, plus a campsite. The name Brothers Water may derive from two brothers who drowned there while ice skating in 1785.",
        "GREAT WALK: From Brothers Water to the Knott and back: five miles (3 hr 20 min).WHERE TO STAY: Doubles at Brotherswater Inn from £110 B&amp;B (sykeside.co.uk).ROUTE 8: EASTERN SURPRISEThere are no settlements along the shores of Haweswater, the most easterly lake and almost eerily quiet yet with an elemental splendour.Like Thirlmere, it’s a reservoir - and a controversial one, too, as construction in 1929 to supply water to the fast-growing conurbations of the North West meant the destruction of Mardale Green and Measand villages.",
        "It’s four miles long and half a mile wide, and was, until 2016, home to England’s last golden eagle - thought to have died of natural causes. Parts of the cult 1987 film Withnail And I were shot by Haweswater’s banks and at nearby Wet Sleddale valley.GREAT WALK: Around Haweswater: ten miles (5 hr).WHERE TO STAY: Doubles at the Haweswater Hotel from £143 (haweswaterhotel.com).ROUTE 9: POTTER ALONGBetween the pretty village of Hawkshead, where Wordsworth went to school, and the village of Near Sawrey, where Beatrix Potter lived at Hill Top Farm, tiny Esthwaite Water rarely gets a look in. But it makes a fine stroll away from the tourist hordes.",
        "From April until August, ospreys can be seen above the lake, which is well stocked with trout on which the birds feed.",
        "The Boathouse Cafe has a live webcam on a nest and offers guided ‘Osprey Safaris’ by boat; fly fishing is also available (esthwaitewater.com).GREAT WALK: Hawkshead to Near Sawrey and back: five miles (1 hr 45 min).WHERE TO STAY: Doubles at the Red Lion Inn in Hawkshead from £90 (booking.com).ROUTE 10: FAST AND FABULOUS",
        "Many holidaymakers head for Coniston Water, with its boat rides, watersports and cosy inns. Then there is Brantwood, once the home of John Ruskin (brantwood.org.uk), its gardens and ancient woodland, plus the local museum that explains the tragic exploits of Donald Campbell, who died on Coniston attempting to break the world water speed record in 1967 (ruskinmuseum.com).It can be busy in summer, but if you take the quiet hiking route up the Old Man of Coniston (803m) you can often find yourself alone. This trail passes Levers Water, one of the Lake District’s most beautiful tarns: a lovely, secretive spot.GREAT WALK: Coniston to Levers Water and back: four miles (2 hr 20 min).WHERE TO STAY: Doubles at the Sun Hotel from about £100 B&amp;B (thesunconiston.com).Tom Chesshyre is the author of Lost In The Lakes: Notes From A 379-Mile Hike Around The Lake District (Summersdale), out now."
    ]
}