{
    "articleURL": "/money/comment/article-12054035/JEFF-PRESTRIDGE-Harold-Fry-wont-Lloyds-bank-branch.html",
    "content": [
        "Seven days ago, I chuckled (and cried) my way through the film adaptation of Rachel Joyce's wonderful book The Unlikely Pilgrimage Of Harold Fry.",
        "It's a life-affirming story of an older gentleman's epic journey by foot to visit a former work colleague (Queenie) before she dies in the hospice she has been admitted to.For Harold, the walk – from Devon to Berwick-upon-Tweed – is both painful and cathartic. Painful because the loafers he is wearing leave his feet battered and blistered. Cathartic because the journey allows him to come to terms with the longstanding guilt he has felt over the suicide of his gifted son – a death that caused a rift in his marriage to Maureen.To the main point I want to make. Before the film (which I urge you to go and see), I was 'treated' to the latest advert from Lloyds.The bank's adverts are always worth watching – after all, who can't be mesmerised by a mix of graceful horses and Alicia Keys singing Girl On Fire. But not necessarily for the main message Lloyds is desperate to get across to viewers – that it's a lovely, cuddly, all-inclusive bank rather than a business that made £2.3billion of profits in the first quarter of this year, essentially by taking many savers for a proverbial ride.",
        "The current advert promotes the bank's Smart Start, a combined savings and bank account for kids aged 11 to 15. No problems with that – getting kids to save from an early age is to be encouraged.",
        "Yet the advert hasn't gone down particularly well in the Tate household. Paul and Helen Tate live in Fulwell, Sunderland – within sight of the North Sea – and have been customers of Lloyds for more than 35 years. Now in their 70s, they like to do their banking the traditional way – by visiting their local Lloyds branch. They are part of the 40 per cent of over-65s identified by charity Age UK who have bank accounts, but do not manage their money online. Sadly, banking is going to become far more problematic for the Tates in late July when Lloyds shuts its Fulwell branch. The closure will leave the community bankless – it was once home to both Barclays and NatWest branches.The couple will then have to traipse into Sunderland to do their banking – not as epic a journey as Harold Fry's, but an inconvenience nonetheless.Paul, who works part-time at Asda, says a petition has been launched to keep the Lloyds branch open, but he doesn't hold out much hope. 'It's a great shame the branch is closing,' he told me last week. 'The impact on local shops will be awful while it will present issues for many elderly residents who will have to travel into town to use a bank branch.'",
        "Age UK believes face-to-face banking services should be protected so that communities such as Fulwell are not left bankless. It's a view that Paul shares.'I don't have an issue with Lloyds targeting youngsters in its adverts,' he says. 'But it would be nice if, for a change, the bank accommodated the particular banking needs of the elderly – the 70 and 80-year-olds. We are the forgotten ones.' Why credit unions are key part of financial jigsawCredit unions are low-key organisations, providing a mix of financial products – including savings accounts and loans – to groups of individuals whose bond is their profession (for example, policing or firefighting) or where they live.Seven days ago, I stumbled across credit union M4Money, which had a stall at a 10km running event I was participating in at Frimley Green in Surrey. M4Money draws members from a number of London boroughs, the counties of Berkshire and Buckinghamshire and hospitals such as Frimley Park. Like other credit unions, it is set up on a not-for-profit basis, with savers providing the funds for M4Money to lend to those who need to borrow.Savers, whose funds are protected by the Financial Services Compensation Scheme, earn an annual dividend (the equivalent of interest). Borrowers get access to loans that maybe a bank would not grant them.",
        "Credit unions are part of the country's financial jigsaw. Take a look at the website of the Association of British Credit Unions: www.abcul.coop.Are bonuses last straw for members of NFU Mutual?",
        "Financial services group NFU Mutual is loved by most of its customers – which is something you can't say of many of its rivals.Last year, it paid 97 per cent of all general insurance (home and car) claims, delivered excellent customer service and rewarded loyal customers with a 'mutual bonus' (a premium discount) when they renewed their policies.Yet 2022 was a rough and tumble year for the Warwickshire-based business, as it concedes in the mailing it has just sent out to some 900,000 customers (members) ahead of its annual general meeting next month. Losses for the year, it reports, were in excess of £1billion, although it stresses that the business remains robust and is underpinned by mountains of capital. 'During 2022, we have seen some of the toughest market conditions in over 20 years,' concedes chairman Jim McLaren. 'But through prioritising our relationship with our members, calmly adapting to change, and hard work, NFU Mutual delivered for our customers and will continue to do so for many years to come.' Reassuring words, but some customers are now beginning to question their love affair with the mutual as a result of the handsome financial packages given last year to the business's executives (past, as well as present).",
        "The mailing confirms that despite the business's losses, the four executive directors who served on the mutual's board during 2022 earned combined annual bonuses in excess of £1million – with chief executive Nick Turner receiving the biggest slice (nearly £477,000). Their total remuneration was not far short of £3.3million.Even former boss Lindsay Sinclair, who left the business in March 2021, continued to share in the boardroom spoils, getting a £310,674 payment.One customer who I spoke to last week said the remuneration paid to the directors (current and former) was 'outrageous'. She added: 'I'm sure many of the farmers who are core NFU Mutual customers will be shocked by these sums – especially given the difficulties they are facing just to survive in business.'Fair point, I say. Expect some fireworks when the group holds its AGM at the British Motor Museum in Gaydon, Warwickshire, on June 21.Leaving a gift in your will to charity ticks many boxesIt can help reduce a potential inheritance tax bill (gifts to charity are IHT-free) – as well as provide vital funds for a charity close to your heart.A substantial charitable gift made in a will can also result in a lower rate of IHT being charged – 36 per cent instead of 40 per cent on assets above the nil-rate band of £325,000.",
        "So (chefs') hats off to Ken Hom – multi-talented author, BBC TV presenter and chef – for telling Donna Ferguson (our brilliant Me and My Money columnist) that he will be leaving Prostate Cancer UK a six-figure sum in his will. This is a charity that funds vital research into a cancer that kills one man every 45 minutes in the UK.The gift stems from 74-year-old Hom being successfully treated for prostate cancer ten years ago.He has since gone on to become an ambassador for the charity.Good on you, Ken.Supporting wonderful charities such as Prostate Cancer UK through gifting, donating, and fundraising is as cathartic as Harold Fry's epic journey was to see Queenie. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}