{
    "articleURL": "/wires/reuters/article-12058137/Resurgent-Rockies-open-series-vs-skidding-Pirates.html",
    "content": [
        "If the struggling Pittsburgh Pirates are relying on a rematch with the visiting Colorado Rockies to provide the fodder to turn things around, they could be disappointed.",
        "The teams open a three-game series in Pittsburgh on Monday.The Pirates were flying high and grabbing the attention of the baseball world when the teams met April 17-19 in Denver.Pittsburgh continued its strong start with a three-game sweep of the Rockies, prevailing by a combined 33-9 run advantage.The Pirates then stretched their winning streak to seven games with a four-game sweep against Cincinnati.However, Pittsburgh is 4-8 since then, including a current seven-game losing streak. The Pirates were swept at home in three games over the weekend by the Toronto Blue Jays, who outscored Pittsburgh 22-3.\"Right now, we're just not getting that big hit,\" Pittsburgh manager Derek Shelton said. \"I think no one expected that (early) pace to keep up. ...\"During that time, we were playing full games. (Now,) we're not pitching extremely well. We're not swinging the bats extremely well. We've had some plays we should have made. So we need to reset a little bit and get back to the consistency we had.\"Colorado continued to falter after the series against the Pirates, finishing with a 7-20 record in April.May has been better. A lot better. The Rockies are 5-1 this month, including a three-game sweep of the Milwaukee Brewers last week, followed by a series win over the New York Mets on the weekend.",
        "The recent stretch has Colorado in good spirits. The Rockies blasted the Mets 13-6 on Sunday, and rookie outfielder Brenton Doyle was giddy after belting his first career homer in a three-hit game. He had three runs and three RBIs.\"Freaking amazing,\" Doyle told AT&amp;amp;T Sportsnet. \"It's even better that we clinched the series win.\"In the opener of the upcoming series, Colorado left-hander Kyle Freeland (3-3, 3.76 ERA) is slated to start against Pittsburgh right-hander Mitch Keller (3-1, 3.32).Freeland evened his record with a win on Wednesday against Milwaukee, when he pitched five scoreless, three-hit innings with five strikeouts and no walks.That came with a tiny scare as he winced after his first pitch of the fifth but remained in the game.\"I felt really good,\" Freeland said in general of the outing. \"The ball's coming out really well. I had a slight concern with the neck, but I've always firmly believed if you're not playing a little banged up, you're not playing hard enough.\"Freeland has been susceptible to the long ball, as he has served up seven homers in his past five starts.Against the Pirates, Freeland is 3-3 with a 5.12 ERA in eight career starts, but he is 0-2 with a 6.50 ERA in Pittsburgh. The Pirates tagged him for nine runs (seven earned) on eight hits in 2 2/3 innings on April 17 in Denver.",
        "Keller picked up his first loss on Wednesday against the Tampa Bay Rays. It was a tough-luck game, as he allowed five runs -- just one earned -- and five hits in five innings with eight strikeouts and one walk.Keller is 1-1 with a 0.63 ERA in three career games, two of them starts, against the Rockies. He did not face them in the teams' series last month.--Field Level Media"
    ]
}