{
    "articleURL": "/news/article-12044979/BoozeBud-collapses-online-bottle-shop-lays-staff-immediately.html",
    "content": [
        "Bottle shop Boozebud has collapsedInsufficient funds led to the collapse Australian online bottle shop BoozeBud has collapsed with staff laid off immediately.",
        "The company announced that it was no longer taking customers orders on their website on Tuesday. The directors of Boozebud Holdings Ltd and Pocko Pty Ltd have appointed Michael Brereton and Sean Wengel of William Buck as joint administrators of both companies. Mr Brereton revealed that a lack of funds had led to the Sydney-based company's collapse.",
        "'We have made the difficult decision that the company has insufficient funds to continue operating,' he told news.com.au.'We have accordingly been forced to stop taking future orders via the online portal. We have also made the difficult decision to lay off staff.'Mr Brereton added that a 'majority of the board of directors' had resigned from Boozebud over the past few months. The company was launched in 2014 by Alex Gale, Mark Woollcott, and Andy Williamson under the name Beerbud.It initially focused on selling craft beer and competing against brick-and-mortar bottle shops and online alcohol retailers.The bottle shop was rebranded to Boozebud in 2016 in order to sell a wider range of liquor.",
        "It was acquired by ZX Ventures, who is the global investment and innovation group of AB InBev, in 2018. AB InBev are the former owner of Carlton United Breweries’. AB InBev was acquired by Asahi in 2019. The Japanese beverage conglomerate then sold Boozebud back to it founders in 2020. ",
        "Boozebud later bought out Get Wines Direct in December 2021. Get Wines Direct now operates as an independent business and it's understood the online bottle service won't be affected by Boozebud's collapse.  Boozebud is the latest online delivery service to fall after the collapse of Send, DashMart, Voly, MilkRun and Deliveroo. "
    ]
}