{
    "articleURL": "/wires/aap/article-12049647/Bennett-threatens-walk-1227-magic-number.html",
    "content": [
        "Wayne Bennett threatened to cut short his pre-milestone match press conference but he has never been able to walk away from a coaching career that now numbers 1227 games.",
        "While Saturday night's clash between the Dolphins and Cronulla at Suncorp Stadium will be his 900th premiership match, there is more to the story.Rugby league statistician David Middleton told AAP that premiership statistics for players and coaches refer to the NRL and its predecessors the NSWRL, ARL and Super League competitions.\"When you are looking at Wayne's career it is quite legitimate to include those games he coached in the Brisbane Rugby League (BRL) as part of his career, but that is a separate record,\" Middleton said.When the NRL, in consultation with Middleton, compiled statistics for Hall of Fame inductees they included all the games played in other competitions including midweek cups and official pre-season games.Bennett is not inducted in the Hall of Fame as a coach but Middleton said his overall coaching career stands at 1227 games.There are 171 games in the Brisbane Rugby League (BRL) and 42 matches that include pre-season, state league and other matches. Add another 115 for rep games at the helm of All Stars, Queensland, Australia, Great Britain and England.\"I came up with a grand total of 1227,\" Middleton said.\"Wayne has a winning percentage of 60.8 per cent ... and of all premiership games played since 1908 he has been coach in six per cent of them.\"",
        "Middleton said Bennett's coaching career started in 1976 with an Ipswich representative team in the Carlton Cup competition.Bennett was not keen to talk about his 900th premiership match at Thursday's presser.\"You obviously want to talk about me today so we either change the subject or I just move on because I am not talking about my achievements,\" he said.The questions continued and he added: \"If you want to talk about me I'll just have to leave the conference.\"He did say that he \"never thought about being a coach\".\"It is not something that I kind of wanted to do and I am still not sure if I want to be a coach,\" he said.\"I never had a plan about my coaching life and my coaching career. I just found myself doing it and I am still doing it today.\"Bennett said he had \"no idea\" what had kept him in the job.\"I'm trying to work that out. I am not sure if I am enjoying it.\"Bennett is as cryptic and mysterious as Bob Dylan when answering questions that cut to the heart of his motivations.His answers can be taken on face value or dissected and investigated for deeper meanings.However they are interpreted, it is all part of the 'Wayne Bennett Show'.",
        "Bennett said his coaching career numbered \"well over 900\" matches and added that a lot of great players had achieved plenty in other competitions outside the auspices of the NRL which should be recognised."
    ]
}