{
    "articleURL": "/usshowbiz/article-12047071/Jamie-Oliver-comeback-kid-Naked-Chef-bouncing-back.html",
    "content": [
        "Jamie Oliver announced he would be launching a new restaurant chain this yearBut the TV chef's moves comes after a string of disastrous business ventures After a string of calamitous business ventures and a cooking show axed after just one series, 'Naked Chef' Jamie Oliver is attempting a comeback - by opening another restaurant chain.  ",
        "The 47-year-old announced he will be launching a new eatery firm four years after the spectacular collapse of his Jamie's Italian business – which owed £83million to creditors.Oliver claimed to have been badly advised over the ill-fated casual dining group which grew to 63 outlets before going bust with the loss of 1,000 jobs.Despite suffering a personal loss of £25million from the collapse, the chef has revealed he would open a new restaurant later this year at London's Theatre Royal. If successful, more will follow.But the move comes just days after TV bosses at Channel 4 announced they would be axing Great Cookbook Challenge with Jamie Oliver after just one series - and follows the collapse of his artisan food range a decade ago.",
        "Speaking last week, Oliver was hopeful his new venture would not turn out like his previous ill-fated ones.  Oliver said: '[The new restaurant] is about going back to my culinary roots inspired by the dishes I grew up cooking in my mum and dad's pub restaurant. 'It's about celebrating Britain's rich and diverse food scene in what I hope will be an iconic, trusted restaurant in a very special place.'The new Jamie Oliver restaurant – which is yet to be named – is expected be more upmarket than Jamie's Italian.",
        "The launch is the first part of a planned expansion being masterminded by Kevin Styles, the former Vue cinema boss hired last year as Oliver's new chief executive. News of the business follows reports that Channel 4 will be shelving the Great Cookbook Challenge after its debut run ended in March.  The show saw 18 cooks compete to win a book publishing deal and release their very own cookbooks, by creating dishes in the hope of impressing a panel of judges.Each chef would pitch their book ideas and various recipes that would appear inside it, with the contestants slowly whittled down to the final three. According to The Sun, Channel 4 have decided not to renew the show for a second series, with a source saying: 'Bosses have decided to leave Great Cookbook Challenge at one series.",
        "'They're proud of the show and will be continuing to work with Jamie on other shows currently in the pipeline.'It's the latest humiliating blow for the millionaire celebrity chef, who has lost vast amounts of his fortune with pursuing his various businesses. The chef's last firm to collapse was Jamie's Italian, which went bust in May 2019 after profits plunged and customers stayed away. The Italian chain went through a painful restructuring when it offloaded its unprofitable sites, in a bid to stay afloat. ",
        "Almost 1,000 jobs were lost with 22 of the celebrity chef's 25 outlets closing, in a move Oliver described as the 'hardest thing I've ever had to do'.  The spectacular downfall of the 47-year-old father-of-five's business empire came amid a downturn in the casual dining sector, with other companies including Byron, Gaucho, and Gourmet Burger Kitchen having struggled pre-pandemic. Speaking at the end of last year, Oliver insisted it had just been a 'minor blip', saying: 'It happens, and I would call it a minor blip really, in the vision and the dream. A very painful one. But definitely, I'm better for it.",
        "'We had 13 amazing years and learned loads. I was a young man when I started, I'm much older and wiser now.' Asked whether or not he had learned from the closure of his Italian restaurant chain, the TV personality said: 'Yeah, for sure, and every other failure that I've had - which is about 50 per cent. But I've never been more rounded, I've never been more experienced.'As well as launching his new restaurant, Oliver also hopes to cook up a storm with another venture, Pasta Dreams, which he announced last year.   Starting with two pop-up spaces - in London's Soho and Paris - he aims to roll the service out across London and other UK cities at a rate of two sites a month.  And the chef added he has hopes of reviving his collection of restaurants, too.",
        "'We're really well positioned to go again, and we will go again, and I will go back to restaurants again, as soon as I can,' he said. 'It's in my blood, it's really all I know. It was never a size problem, it was rent and rates that got us really, and high street decline.'In 2012, Oliver pulled the plug on his signature range of  artisan food amid multi-million pound losses and bitter criticism from his suppliers.The celebrity chef had launched his 'Jme' food range just two years earlier amid great fanfare.  The collection of sauces, biscuits and jams were said to be a ground-breaking collaboration between the TV cook and a hand-picked group  of independent, small-scale food producers in Britain and Italy.",
        "But despite being stocked in more than 150 retailers, poor sales left Jme owing parent group Jamie Oliver Ltd £14 million.Jme made losses of £3.8 million in 2012, double its deficit of £1.9 million the year before. The range was discontinued by the end of the year.Suppliers and wholesalers confirmed they were sent an email informing them the line was ending, leading some producers to attack Jme's 'commercial ineptitude' and 'poor branding'. One producer claimed he is still owed money by Jme and said his final dealings with the business had left a 'sour taste' in his mouth.",
        "'We had a lot of difficulties with them,' said Gary Reid, of shortbread bakers Reids of Caithness. 'I'm not going to be harsh on Jamie Oliver because the failure is down to his team.'To be honest, I'm not surprised the range has been cut. It turned out to be a really poor business. Many of their buyers ignored top-quality importers who wanted to take our products on abroad.'It's such a shame because the brand had such potential. I've been so furious about it.'"
    ]
}