{
    "articleURL": "/wires/ap/article-12056239/Arab-League-poised-vote-restoring-Syria-membership.html",
    "content": [
        "CAIRO (AP) - The Arab League agreed Sunday to reinstate Syria, ending a 12-year suspension and taking another step toward bringing Syrian President Bashar Assad, a long-time regional pariah, back into the fold.",
        "Some influential league members remain opposed to reinstating Syria, chief among them Qatar, which did not send its foreign minister to Sunday's gathering. Thirteen out of the league's 22 member states sent their foreign ministers to the meeting in Cairo.The decision represented a victory for Damascus, albeit a largely symbolic one. Given that Western sanctions against Assad's government remain in place, the return to the Arab League is not expected to lead to a quick release of reconstruction funds in the war-battered country.Syria´s membership in the Arab League was suspended early on during the country's 2011 uprising against Assad's rule that was met by a violent crackdown and quickly turned into a civil war. The conflict has killed nearly a half million people since March 2011 and displaced half of the country´s pre-war population of 23 million.Arab League Secretary-General Ahmed Aboul Gheit said in a televised statement that the decision to return Syria to the organization, which will allow Assad to take part in the group's upcoming May 19 summit, is part of a gradual process of resolving the conflict.\"This doesn´t mean that the Syria crisis has been resolved, on the contrary,\" he said. \"But it allows the Arab (states) for the first time in years to communicate with the Syrian government to discuss all the problems.\"",
        "Aboul Gheit also said restoring Syria´s membership in the organization does not mean all Arab countries have normalized with Damascus.\"These are sovereign decisions for each state individually,\" he said.Syrian Prime Minister Hussein Arnous claimed Sunday that Syria had been the victim of \"misinformation and distortion campaigns launched by our enemies\" for 12 years. He said Sunday's consultations reflected the \"prestigious position\" Syria holds regionally and internationally.Opponents of Assad saw the move toward normalization as a betrayal.\"Arab states have put their own cynical realpolitik and diplomatic agendas above basic humanity,\" said Laila Kiki, executive director of The Syria Campaign, an international advocacy group. The move, she said, has \"cruelly betrayed tens of thousands of victims of the regime´s war crimes and granted Assad a green light to continue committing horrific crimes with impunity.\"Sunday's decision came days after regional top diplomats met in Jordan to discuss a road map to return Syria to the Arab fold as the conflict continues to de-escalate. The next Arab League summit is to take place May 19 in Saudi Arabia.The Arab League generally tries to reach agreements by consensus but sometimes opts for simple majorities. Sunday's session was held behind closed doors, and it was not immediately clear which countries had registered objections.",
        "A spokesperson for Qatar's Ministry of Foreign Affairs said in a statement published by state media that normalization with Syria should be tied to a political solution to the conflict but that it \"always seeks to support what will achieve an Arab consensus and will not be an obstacle to that.\"Sunday's decision also includes a commitment by Arab governments to try to reach a political solution to the conflict, in line with U.N. Security Council Resolution 2254. Saudi Arabia, Lebanon, Jordan and Iraq were asked by the league to follow up on developments.The league welcomed what it said was the Syrian government´s willingness to cooperate with Arab countries to resolve \"humanitarian, security, and political\" crises that affected Syria and the region due to the conflict, including refugees, \"the threat of terrorism and drug smuggling.\"Many observers had anticipated Syria´s imminent return to the organization.Arab rapprochement with Damascus accelerated after a deadly Feb. 6 earthquake that shattered parts of the war-torn country. One of the countries pushing normalization is Saudi Arabia, which once backed opposition groups trying to overthrow Assad.Egyptian Foreign Minister Samer Shoukry said before Sunday's meeting that only an Arab-led \"political solution without foreign dictates\" can end the ongoing conflict. \"The different stages of the Syrian crisis proved that it has no military solution, and that there is no victor nor defeated in this conflict,\" he said.",
        "In recent years, as Assad regained control of most of the country with the help of key allies Russia and Iran, neighbors of Syria that hosted large refugee populations took steps towards reopening diplomatic links with Damascus. Meanwhile, two Gulf monarchies, the United Arab Emirates and Bahrain, reestablished ties.The Feb. 6 earthquake that rocked Turkey and Syria was a catalyst for further normalization across the Arab world. China helped to broker a recent rapprochement between arch-rivals Saudi Arabia and Iran, which had backed opposing sides in the Syrian conflict.Jordan last week hosted regional talks that included envoys from Saudi Arabia, Iraq, Egypt, and Syria. They agreed on a framework, dubbed the \"Jordanian initiative,\" that would slowly bring Damascus back into the Arab fold. Amman´s top diplomat said the meeting was the \"beginning of an Arab-led political path\" for a solution to the crisis.The conflict in Sudan is also on the agenda, as Arab states try to stabilize a shaky cease-fire in the ongoing fighting that has killed hundreds of people over the past few weeks.Chehayeb reported from Beirut. Associated Press writers Abby Sewell in Beirut, Sam Magdy and Noha El Hennawy in Cairo, contributed to this report."
    ]
}