{
    "articleURL": "/wires/reuters/article-12059855/US-consumers-inflation-expectations-mixed-April-NY-Fed-report-shows.html",
    "content": [
        "By Michael S. Derby",
        "May 8 (Reuters) -U.S. consumers said last month they expected slightly lower inflation in a year's time, the New York Federal Reserve said in a report that also showed the bank stresses that kicked off in March weren't weighing heavily on the moods of Americans.The regional Fed bank reported as part of its April Survey of Consumer Expectations that respondents see inflation one year from now at 4.4%, down from 4.7% in the March survey. Inflation three years from now was seen at 2.9%, compared to 2.8% in March, while five years from now it was expected to be at 2.6%, versus 2.5% in the prior month.The Fed has been pressing forward aggressively with interest rate rises to lower some of the highest inflation pressures in decades. The U.S. central bank raised rates last week in an action that may be the last of its current tightening campaign, as inflation pressures have started to ease.At his press conference after the release of the policy decision, Fed Chair Jerome Powell said, \"despite elevated inflation, longer-term inflation expectations appear to remain well-anchored,\" a sign he believes the public remains confident the central bank will bring price pressures back to its 2% target.The New York Fed report also found that the banking sector stress that began nearly two months ago, spurring fears about the health of the financial system and forcing the central bank to provide extensive liquidity to the financial system, hasn't left much of a mark on consumers attitudes so far.",
        "The April survey found \"mixed\" views on credit access, noting \"both the share of households reporting it is easier and the share reporting it is harder to obtain credit now than one year ago declined.\"The report also found that perceptions in April surrounding respondents' current financial situation improved, while their expectations \"deteriorated slightly, with fewer respondents expecting to be better off a year from now.\"It also said that households still expected to see rising earnings, although spending was projected to moderate to a 5.2% gain, the weakest since September 2021, from the 5.7% forecast in March. Survey respondents also said they expect higher unemployment and a greater probability of losing their jobs, as well as a harder time finding new work. (Reporting by Michael S. Derby; Editing by Paul Simao)"
    ]
}