{
    "articleURL": "/sport/football/article-12038389/Karl-Robinson-set-brought-Sam-Allardyces-assistant-manager-Leeds.html",
    "content": [
        "Karl Robinson - formerly of Oxford United and MK Dons - set to come in as No 2Sam AIlardyce set to takeover from Javi Gracia for the final four games of seasonLeeds set to sack Javi Gracia after disastrous April that saw them lose four timesKarl Robinson is due to be brought in as Sam Allardyce's assistant manager at Leeds United. ",
        "Leeds are set to appoint Allardyce less than three months on from having settled on Javi Gracia to takeover from Jesse March with their Premier League status in real peril.Reports first emerged on Tuesday night suggesting Leeds were pondering making the switch for the final four games of the season, and on Wednesday nights Allardyce agreed to take the job.Mail Sport understands Robinson will be brought in as his No 2 for the remainder of the season, not Allardyce's traditional assistant in Sammy Lee, as the Leeds hierarchy plot a seemingly unlikely path to safety.Robinson, 42, enjoyed a relatively minor playing career but has enjoyed some success as a manager in the lower leagues of English football.",
        "He notably took charge of MK Dons for six years between 2010 and 2016, taking them up to the Championship for the first time in their short history in 2015.From there, he went to Charlton where he lasted just two years under a tumultuous ownership regime and significant financial constraints.His most recent job was with Oxford United, a job he lost in February of this year following a run of eight games without a win.Robinson's spell with Oxford was bookmarked by a number of significant victories and achievements, including reaching the League One play-offs twice - losing out in the final once.",
        "Interestingly, Robinson has been on the record in the past detailing his turning down of the Leeds manager's job in 2016, when the club was owned by controversial figure Massimo Cellino.'I met them on the Friday. I didn’t sleep on the Friday, I didn’t sleep on the Saturday so something didn’t feel right. Leeds weren’t the Leeds they were today, but they were still Leeds,' he said in March.'I actually saw Sam Allardyce on the Monday and he said to go and meet them again, so I arranged to meet them and they weren’t there – 10am not there, 10.30am not there – so I phoned Sam and asked what to do, and he said to wait until 11am. 'Next thing they turned up and the conversation was a little erratic, unstable, and I thought, this isn’t me. It didn’t feel right.'The fact that it was Leeds, it just wasn’t the right time. I’d just got relegated a few days before with MK Dons, and I felt so guilty for that. My personality meant I had a lot of guilt about that relegation – but then I got sacked by MK Dons two months later!'With developments moving swiftly, director of football Victor Orta and manager Gracia were given their marching orders following a disastrous two-and-a-half month spell that has seen Leeds slide further and further into trouble.",
        "Leeds released a statement confirming Orta's departure, writing: 'Leeds United can confirm Victor Orta has left the club by mutual consent.'Victor joined the Whites in the summer of 2017 and helped oversee changes at the club that led to Leeds United being promoted back to the Premier League in 2020.",
        "'Over the years Victor and his team have been responsible for recruiting players and staff that have gone on to become legends of the club.Owner Andrea Radrizzani said: 'I am deeply saddened by the way that this chapter closes as Victor has been responsible for some of the best moments of my time as owner of Leeds United and I thank him and his people for all they have done in the past six years.'However, it is clear that it is time to change direction and therefore we have agreed that Victor will leave the club. I understand supporters are hurt and upset, but now is a time for unity.'We have four cup finals left to play this season and working together, I believe we can survive.'"
    ]
}