{
    "articleURL": "/news/article-12038141/Is-favorite-threat-postponed-Hollywood-writers-strike.html",
    "content": [
        "The Writers Guild of America authorized the strike on Tuesday, sending its nearly 12,000 unionized screenwriters to the picket line for the first time since 2008All script writing has stopped, with late-night shows and 'Saturday Night Live' expected to immediately go darkREAD MORE: Why are Writers Guild of America members on strike in Hollywood?Thousands of Hollywood writers have closed their laptops and began their strike, leaving viewers to wonder what will happen to their favorite shows. ",
        "From late-night shows, to popular reality television and major movies, the strike over a dispute about the writers' low pay in the streaming era could have a significant impact what millions of viewers watch every day. The most immediate effect of the strike viewers are likely to notice will be on late-night shows and 'Saturday Night Live.' All are expected to immediately go dark. The Writers Guild of America launched the strike on Tuesday sending nearly 12,000 unionized screenwriters to the picket line for the first time since 2008.",
        "The labor dispute could have a cascading effect on TV and film productions depending on how long the strike lasts, and it comes as streaming services are under growing pressure from Wall Street to show profits. The Writers Guild of America's screenwriters prepared to picket after negotiations with studios, which began in March, failed by Monday's deadline to yield a new contract. All script writing is to immediately cease, the guild informed its members.The guild is seeking higher minimum pay, less thinly staffed writing rooms, shorter exclusive contracts and a reworking of residual pay — all conditions the WGA says have been diminished in the content boom driven by streaming.So what does this mean for your favorite shows? With a walkout long expected, writers have rushed to get scripts in and studios have sought to prepare their pipelines to keep churning out content for at least the short term.",
        "'We're assuming the worst from a business perspective,' David Zaslav, chief executive of Warner Bros. Discovery, said last month. 'We've got ourselves ready. We've had a lot of content that's been produced.'Overseas series could also fill some of the void. 'If there is one, we have a large base of upcoming shows and films from around the world,' said Ted Sarandos, Netflix co-chief executive, on the company's earnings call in April.Late-night shows  ",
        "The most immediate effect of the strike viewers are likely to notice will be on late-night shows - including Stephen Colbert, Jimmy Fallon, Jimmy Kimmel and Seth Meyers - along with 'Saturday Night Live.' All are expected to immediately go dark. Pete Davidson who attended the Met Gala Monday night was due to return to Saturday Night Live this weekend, this time to hostIt is unclear if the show, the final one in the season, will proceed. SNL fully relies on its writers as its scripted in the days and sometimes mere hours before it airs. It's possible the three shows slated for May, including the season finale, would be canceled and they would replaced with reruns like was done in 2007. On Friday's episode of 'Late Night,' Seth Meyers, a WGA member who said he supported the union's demands, prepared viewers for re-runs while lamenting the hardship a strike entails.",
        "'It doesn't just affect the writers, it affects all the incredible non-writing staff on these shows,' Meyers said. 'And it would really be a miserable thing for people to have to go through, especially considering we're on the heels of that awful pandemic that affected, not just show business, but all of us.''Then there was a writers' strike and there was nothing we could do,' Craig later recounted. 'We couldn't employ a writer to finish it. I say to myself, 'Never again', but who knows? There was me trying to rewrite scenes — and a writer I am not.' During the 2007 strike, late-night hosts eventually returned to the air and improvised material. Jay Leno wrote his own monologues, a move that angered union leadership.Game shows",
        "Jeopardy! and Wheel of Fortune could be affected because guild writers are used to write the clues. However, the shows are taped months in advance, so unless the strike stretches past summer, they should not be immediately affected. Jeopardy! also tapes five shows in one day, and has banked a slew of clues, so production could last longer if needed.Daytime soap operas",
        "Daytime soap operas are on a daily schedule, but have several weeks of banked episodes so it would be at least a few weeks before they'd need new material. ",
        "General Hospital, The Bold and the Beautiful, The Young and the Restless and Days of Our Lives are still popular shows that millions of viewers tune into every day. Broadcast scripted series Scripted series that are half-hour and hour-long comedies and dramas on networks like ABC, NBC and CBS will take longer to be affected. Many shows have already wrapped, or are wrapping in May, so their season is complete. But if a strike continued through the summer, fall schedules could be upended.  Streaming and cable scripted shows",
        "Many streaming services have planned ahead for the possible shutdown and coming off the pandemic, realized that having a bank of shows and movies would only benefit them in the long run. Streaming giant Netflix's Co-CEO Ted Sarandos said last week that they have a 'pretty robust slate of releases' they'll be able to use to get through a strike. Cable shows, like HBO originals, also work ahead and have been planning for a potential shutdown, so there likely wouldn't be an immediate impact. Popular HBO drama Succession wrapped shooting for their season in February. The highly-anticipated finale, which is also the last episode of the entire series, will air on May 28. David Zaslav, CEO of Warner Bros. Discovery, which includes Warner Bros. film and TV studios and HBO, said last month, 'We're assuming the worst from a business perspective,' but 'we've got ourselves ready. We've had a lot of content that's been produced.'",
        "MoviesMovies are rarely affected because a strike would have to last several months before viewers began to notice as films are planned about a year ahead. Some movies can continue - or at least start filming - even if the screenplay isn't finished. However, during the 2007 strike, the James Bond film 'Quantum of Solace' was one of many films rushed into production with what Daniel Craig called 'the bare bones of a script.Daytime talk showsDaytime talk shows including The View, The Talk and Live With Kelly &amp; Mark would all most likely be uninterrupted because they fill their time with interviews and don't have scripted monologues.Reality shows and news programsReality television shows and news programs would not be affected because they are covered by different union contracts. However, there's a significant chance that there could be more reality shows released during this time and that viewership would increase. ",
        "A shutdown has been widely forecast for months due to the scope of the discord. The writers last month voted overwhelming to authorize a strike, with 98 percent of membership in support.At issue is how writers are compensated in an industry where streaming has changed the rules of Hollywood economics.Writers say they aren't being paid enough, TV writer rooms have shrunk too much and the old calculus for how residuals are paid out needs to be redrawn.",
        "'The survival of our profession is at stake,' the guild has said.Streaming has exploded the number of series and films that are annually made, meaning more jobs for writers. But WGA members say they're making much less money and working under more strained conditions. Showrunners on streaming series receive just 46 percent of the pay that showrunners on broadcast series receive, the WGA claims.The guild is seeking more compensation on the front-end of deals. Many of the back-end payments writers have historically profited by – like syndication and international licensing – have been largely phased out by the onset of streaming. The cost of the WGA's last strike cost Southern California $2.1 billion, according to the Milken Institute. How painful this strike is remains to be seen. But as of late Monday evening, laptops were being closed shut all over Hollywood.'Pencils down,' said 'Halt and Catch Fire' showrunner and co-creator Christopher Cantwell on Twitter shortly after the strike announcement. 'Don't even type in the document.'"
    ]
}