{
    "articleURL": "/tvshowbiz/article-12061353/Nick-Jonas-doting-dad-steps-adorable-daughter-Malti-Marie.html",
    "content": [
        "Nick Jonas looked every inch the doting father as he pushed his one-year-old daughter, Malti Marie Chopra Jonas around the streets of New York City on Monday. ",
        "The 30-year-old singer - who attended the Formula One Grand Prix in Miami on Sunday - wore a green bag crossbody over a grey t-shirt.The two-time Grammy nominee donned dark glasses and styled his short dark hair spiked and messy.Baby Malti looked cute as she enjoyed her time outside in a yellow outfit with coordinated socks. She wore a dainty gold bracelet. Not pictured on the outing was Malti's Indian superstar mother, Priyanka Chopra, who previously stated it was 'very tough' to film reshoots for Citadel after little Malti - who was welcomed via surrogate - spent her first 110 days in the NICU.",
        "Earlier this week, Priyanka shared a sweet snap of her 15-month-old daughter checking out the view from their penthouse apartment at the Four Seasons Residences in downtown Manhattan on Tuesday.The Citadel action star - who recently opened up about her botched face surgery - captioned the picture of her toddler: '[You] make it all worthwhile.' On Wednesday, the happy couple attended the New York screening of her upcoming rom-com Love Again. The former Miss World 2000 plays Mira Ray, a grieving woman who falls for journalist Rob Burns (Sam Heughan), in Jim Strouse's rom-com that hit US theaters on Friday.In the film, the former Miss World 2000 plays Mira Ray, a grieving woman who's just making her way back to the dating pool after losing someone she loved dearly. ",
        "Her character sends text messages to the phone number belonging to her late fiance - only to bond with the man on the other line, a journalist played by Sam Heughan.Jonas makes a cameo appearance in the film, playing a character who takes her on an unfortunate date. In an interview with Entertainment Weekly, the actress revealed how Mira's date was supposed to lick her face, but due to the ongoing COVID-19 pandemic, the actor would have had to wait around in quarantine before filming his scene.'They were going to cast a random actor who would’ve eventually had to lick my face during COVID, which meant that he had to quarantine for 14 days and sit in a hotel room just waiting to lick my face. It was just awful,' she explained.'Nick came to help me settle in, and our director Jim (professionally known as James C. Strouse) had the bright idea. He was like, \"Do you think Nick would consider this?\" And I was like, \"Yes. Yes, please!\"'she recalled. ",
        "The Indian native went on to share how her husband actually saved the day on the set. 'So Nick took one for the team and was extremely gracious and lovely,' she added.Speaking of the face-licking scene, she said, 'He turned out to be so funny. It was so hard for me to act like I was embarrassed or mad at him because I just couldn't stop laughing.'",
        "The former Disney Channel star's boyband, The Jonas Brothers, will release their sixth studio record, The Album, on May 12."
    ]
}