{
    "articleURL": "/wires/ap/article-12050505/New-Zealand-wins-toss-field-ODI-against-Pakistan.html",
    "content": [
        "KARACHI, Pakistan (AP) - Run machine Babar Azam's 18th century made the difference as Pakistan defeated New Zealand by 102 runs on Friday and closed in on a one-day international series sweep.",
        "Babar's 107 off 117 balls propped up Pakistan's 334-6, and New Zealand stumbled to 232 all out, its lowest total of the series.The most lopsided win of the series lifted Pakistan to No. 1 in the ICC ODI rankings and a 4-0 lead. The fifth and last ODI is on Sunday.\"Credit goes to the entire team and support staff for becoming the No. 1 ranked ODI team,\" captain Babar said.\"We felt it was a 300-plus wicket and if you build a partnership you can get to that total. We wanted to give a proper run to every player and since there are big events coming up, we are happy to find 15-16 players.\"Babar and Agha Salman revived Pakistan from 128-3 in the 25th over with a 117-run fourth-wicket stand. Their charge allowed Shaheen Shah Afridi and Mohammad Haris to smash 38 off the last two overs and put up an imposing total.",
        "\"Credit to the way they played, Babar played fantastically,\" New Zealand captain Tom Latham said. \"We are trying to build partnerships and needed someone to bat through tonight, but a big partnership was missing.\"New Zealand started well. Fast bowler Matt Henry removed Fakhar Zaman, who top-edged a pull to wicketkeeper Tom Blundell.Shan Masood, who replaced Imam-ul-Haq, scored 44 at a brisk pace before he was stumped off Ish Sodhi, and Henry ran out Mohammad Rizwan off a direct throw from mid-on.",
        "But that brought Babar and Salman together. Salman dominated the spinners with sweep shots as he hit 58 off 46 balls with four boundaries and two sixes.Henry plucked a brilliant low one-handed catch off his own bowling to dismiss Salman, then Babar raised his century off 113 balls in another useful stand with Iftikhar Ahmed.Babar holed out in the deep to give debutant fast bowler Ben Lister his first ODI wicket, but the world´s top-ranked ODI batter completed 5,000 runs in his 97th inning, surpassing South African Hashim Amla´s record of reaching the milestone in 101 outings.New Zealand was in a similar position to Pakistan at the halfway stage, at 129-3 after 26 overs. Latham, who top-scored with 60, and Mark Chapman, with 46, tried to accelerate in the middle overs, but Latham's demise when he was caught behind off Shah Afridi triggered a collapse.The Black Caps lost their last seven wickets for 48 runs.Mohammad Wasim (3-40) and legspinner Usama Mir (4-43), one of five changes Pakistan made after sealing the series 3-0 on Wednesday, ran through the middle and lower order.___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}