{
    "articleURL": "/sport/football/article-12059045/Pep-Guardiola-FREED-African-curse-imposed-shamans-linked-Yaya-Toure.html",
    "content": [
        "Yaya Toure's ex-agent once claimed a curse had been placed on Pep Guardiola He said City would fail in Europe after Toure's lack of minutes in 2017-18 But Dimitri Seluk said the 'spell' was lifted and that City would be successful Yaya Toure's agent Dimitri Seluk has said the curse he once called to be placed on Pep Guardiola by 'African shamans' to stop the manager from winning the Champions League has been lifted. ",
        "The brouhaha stemmed from Toure's relationship with Guardiola deteriorating during the Ivorian's final season at the club, which saw him make just one Premier League start during Manchester City's 2017/18 campaign. At the time, Toure said to France Football that the Catalan manager did 'everything to spoil [his] last season' and queried Guardiola's approach to selecting African players. 'The day he picks a team with five Africans in it, I promise I will send him a cake', the player said in an apparent reference to Toure's 2014 'birthday cake snub', which saw the City legend's birthday allegedly go without recognition from his club. In the wake of the comments Seluk said that an 'African curse' would stem from Toure's dissatisfaction with his coach, stymying any future chance of glory in Europe. ",
        "But as per the Mirror, Seluk apologised and said that both he and Toure wish 'nothing but success for City'. 'I want to apologise for this matter,' the Ukrainian agent said. 'I think it is time for this bitterness to stop – and I know that Yaya feels the same because he wishes nothing but success for City.'I can say that the spell has now been lifted by the shamans – and that I think City will win the Champions League under Pep.",
        "'They have a good chance of winning it this year. But whatever happens they will definitely win it in the next three years.'However, Toure was quick to distance himself from the comments - which he called 'lazy and nonsense' - stressing that the stereotype was 'harmful'.'My former agent is being quoted by the media about a \"curse\",' he wrote on Twitter. 'Please don’t associate me with this nonsense and lazy stereotypes about African curses!?",
        "'Media… move on please. This man does not represent me in any way. Amplifying these stereotypes is harmful.'City have never won a Champions League title and it's no secret that the trophy is deeply desired by both Guardiola and his side. In 2021, the Cityzens reached the final but lost 1-0 to Thomas Tuchel's Chelsea after a goal from Kai Havertz proved the difference for the west London outfit. The Manchester side will be cheered to hear that the 'curse' has been lifted ahead of the first leg of the semi-final tie against Real Madrid after being knocked out of the competition at the same stage by the same opponents last season. Carlo Ancelotti's side went on to meet Liverpool in Paris and hoist the trophy aloft after beating City 6-5 on aggregate. Toure's agent had previously fanned the flames of the feud when in September 2018 he posted a controversial cartoon of a figure – believed to be Toure – dressed as a witch doctor, sticking pins in a voodoo doll with Guardiola shown feeling a pain in the same area of his body. ",
        "'Do you remember when I once criticised City for not giving Yaya a cake on his birthday?' Seluk continued.'Well it is my birthday this month and my present is for this curse to be ended. In fact, it is my hope that City win the treble this season.'This will come as the worst possible news to City's crosstown rivals Manchester United, who will hope that the noisy neighbours aren't the first English side to replicate their peerless 1998/99 season which saw them make history with Sir Alex Ferguson. A month after his 2018 comments, Toure said that he had made a 'mistake' and in 2021 he confirmed that he had written an apology letter to his former coach, but had not heard from the ex-Barcelona manager. ",
        "Seluk went on to claim responsibility for his initial remarks about a potential hex, saying that as his agent, he felt a responsibility to 'defend him'.  'I think he was the first great player City signed after Sheikh Mansour bought the club. But what I said about Pep being cursed has caused even more bad blood that wasn't necessary,' Seluk added. 'It has got to the point where people think I am football's equivalent of Nostradamus! I can't predict the future, but it is my opinion that Pep will win the Champions League with Manchester City.",
        "'I am reaching out before the game against Madrid to tell everyone at the club and their fans that they have all of my support.'After leaving City five years ago, Toure moved to Olympiacos and former Chinese Super League outfit Qingdao Huanghai before hanging up his boots. Since August 2022, Toure has taken over coaching Tottenham's under-16 side. "
    ]
}