{
    "articleURL": "/femail/weekend-features/article-12042775/The-genius-hack-stop-ears-popping-flights.html",
    "content": [
        "TikToker Charlotte Stanley shares way to stop pressure building in ears on flightsRegular flyers have praised the ear nurse for sharing the 'amazing' hackIf you suffer from excruciating ear pain during flights, this is what you should do to stop it.",
        "A nurse has revealed the clever method you can use to prevent your ears from hurting during take off and landing - and it costs next to nothing.Because air pressure in the cabin changes quickly during an ascent or descent, this can trigger what is known as 'airplane ear'.But in order to stop this annoying and, quite frankly, painful pressure building up in your ear drums, a ear nurse and TikToker has shared a genius method.Charlotte Stanley, who goes by @the_ear_nurse on the social media app, showed how cups and paper towels on the ears may be a better solution than yawning, swallowing or chewing gum.",
        "And the ingenious method has garnered more than 66,000 likes on the social media site. Ms Stanley filmed herself showing how the 'hack' works during a flight she took, as users praised her for sharing the 'amazing' tip.  The TikToker starts off the video by showing the two plastic cups she has, filled nearly halfway with hot paper towels.She says: 'I'm going to show you the ear ache hack in real time.'Ask your flight attendant for two plastic cups with hot paper towels. Trust me, they'll know exactly what you're asking for.'She then proceeds to place the transparent cups over her ears - with the towels stuck firmly on the bottom - which she says stabalise the pressure in the middle of the ear.   ",
        "Ms Stanley says: 'Put these on both of your ears, causing an airtight seal. 'The steam helps stabilise the pressure in the middle ear.'It's all to do with barometric pressure. When the plane rapidly climbs or descends, it changes the pressures so quickly that the eustachian tube often can't keep up. 'It can be used on adults and children.' During the sudden ascend or descend of an airplane, ear cavity pressure is often decreased complemented by an increase in the cabin - compared to the outside air pressure. To be more scientific about it, the unusual stretching of the eardrum, or tympanic membrane, may precipitate pain in the ear and therefore cause what is known as airplane ear. Regular flyers and travelers have thanked Ms Stanley for sharing the advice, as many of them confirmed how well her advice works.",
        "One person wrote on TikTok: 'If I ever end up needing to fly when sick, I'll try this. It's happened twice when I had to fly sick and was nearly deaf both times.' And second commented: 'This absolutely works - a flight attendant taught us this when my six year old had an issue on a flight home many years ago!'Another added: 'I used to be a flight attendant and this is amazing! Hot cups! Best invention ever.'",
        "While a fourth put: 'Flight attendants did this for me back in 1981. Throwback!' One person said that this hack will help them fly again, writing: 'Thank you for sharing!! I had ear pain so bad once I cried now I’m scared to fly.' While other people commented the other ways people can get rid of ear aches on flights, with one person saying: ''I chew a toffee sweet just as the plane is about takes off and land no ear pain at all.'And another put: 'Or wear ear plugs for take off and landing. But don’t take the plugs out till you are off the plane after you land.'A third person said that you should try blowing your ears after massaging them, writing: 'Massage your ears under the lobe too then try pop your ears just repeat don't blow too hard though.'"
    ]
}