{
    "articleURL": "/wires/reuters/article-12058229/Motor-racing-Drivers-unimpressed-F1-plans-splashy-intros.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 7 (Reuters) - Formula One has decided that a big show needs a big introduction and the Miami Grand Prix opened with a bang on Sunday as drivers appeared through a line of pompom-waving cheerleaders and a 30-piece orchestra provided a musical backdrop.That over-the-top scene seemed to go down quite well with fans but left drivers unimpressed, with some looking unsure of what to do beyond wave and smile.\"I understand the point of view of everybody but I'm not a big fan of those kinds of things just before the race,\" said double world champion Fernando Alonso.The Aston Martin driver's sentiment was shared by race winner Max Verstappen and his Red Bull team mate Sergio Perez, who both hoped the routine does not become a regular part of race weekends.It is no coincidence that F1 chose Miami, one of America's major party hubs, to introduce two new fan focused features by rolling out a Formula One theme song and the glitzy pre-race showbiz-style introduction.F1 says it plans similar splashy intros at eight races this season.\"I just hope we don't have that every single time, because we have a very long season, so we don't need an entry like that every time,\" said Verstappen.",
        "\"But it also depends a bit on the crowd, I think, in terms of what you want in terms of entertainment.\"Some people like to be more in the spotlight, some people don't. I personally don't. So for me, I think that naturally, of course, what they did today is not necessary.\"Formula One tried something similar at the U.S. Grand Prix in Austin when famed boxing announcer Michael Buffer, known for his \"Let's Get Ready to Rumble\" catchphrase, introduced each driver before the start of the 2017 race.It was widely panned and scrapped.The emcee in Miami was rapper LL Cool J, who called the drivers out one by one as will.i.am provided the soundtrack with his new release 'The Formula', written specifically for F1.The idea behind the catwalk is to provide more interaction between drivers and fans. But drivers say that engagement comes at a cost by taking away time they need to prepare to race.\"If we have to do it, I think we need to remove some of the other stuff we are doing like the parade lap or something like that,\" said Spaniard Alonso. \"It's really in the middle of the preparation with the engineers and the strategy meeting.\"And I disagree a little bit if we do it, we have to do it everywhere because I don't think that the Miami fans are better than the Italian fans in Imola or in Spain or in Mexico or in Japan.",
        "\"I think we need to make everyone with the same rules and the same show before the race.\" (Reporting by Steve Keating in Miami. Editing by Peter Rutherford)"
    ]
}