{
    "articleURL": "/wires/afp/article-12051247/April-heat-western-Med-impossible-without-climate-change.html",
    "content": [
        "The extreme heat that engulfed the Iberian peninsula and parts of North Africa last week would have been \"almost impossible without climate change\", an international scientific study found on Friday.",
        "The \"exceptional early heatwave\" involved \"local temperatures up to 20 degrees hotter than normal and April records being broken by up to 6 degrees\", said the report by the World Weather Attribution (WWA), whose scientists study the link between extreme weather events and climate change.A mass of hot, dry air from North Africa reached the Iberian peninsula early last week, driving temperatures to record highs for April, with the mercury hitting 38.8 degrees Celsius (101.8 degrees Fahrenheit) in southern Spain and 36.9C in central Portugal.Such temperatures only tend to occur in July.In Morocco, local records were broken with temperatures soaring above 41C in some places, while in Algeria, they exceeded 40C.Spain this year recorded its driest and hottest April since at least 1961, when such records began, national weather agency AEMET said.\"Human-caused climate change made the record-breaking heatwave in Spain, Portugal, Morocco and Algeria at least 100 times more likely and the heat would have been almost impossible without climate change,\" the WWA report found.It caused \"temperatures up to 3.5 degrees C hotter than they would have been without climate change\", provoking an event they described as \"rare\".- More frequent, more intense -\"We will see more frequent and more intense heatwaves in the future as global warming continues,\" Sjoukje Philip, a researcher at the Royal Netherlands Meteorological Institute, said at the report's launch.",
        "Such abnormally high temperatures followed \"a historical multi-year drought in those regions, exacerbating the impacts of the heat on agriculture which is already threatened by an increasing water scarcity,\" the WWA said.In Spain, which is known as Europe's vegetable garden, the main farmers' union, COAG, has warned that 60 percent of agricultural land is currently \"suffocating\" from the lack of rainfall.With water reservoirs at half their capacity, Spain has asked Brussels to help by activating the European Union's agriculture crisis reserve funds.Experts say parts of Spain are the driest in a thousand years, with the ongoing drought prompting some farmers to choose not to sow crops this year.\"The Mediterranean is one of the most vulnerable regions to climate change in Europe,\" said Friederike Otto, a senior climate science expert at the Grantham Institute for Climate Change and the Environment at London's Imperial College.\"The region is already experiencing a very intense and long-lasting drought and these high temperatures at a time of the year when it should be raining is worsening the situation.\"- Spain forecasters under attack -After experiencing its hottest year on record in 2022 and the extreme April heatwave, Spain's government was on Friday forced to come to the defence of AEMET, whose forecasts have been met with a barrage of threats and abuse from climate conspiracy theorists.",
        "\"Murderers\", \"Criminals\", \"You'll pay for this\" and \"We're watching you\" were just some of the anonymous messages sent to AEMET in recent weeks on social media, by email and even by phone.\"Enough is enough,\" wrote Ecology Minister Teresa Ribera on social media.\"Lying, fuelling conspiracies and fear, being insulting... impoverishes us as a society and has unacceptable consequences,\" she said."
    ]
}