{
    "articleURL": "/sport/boxing/article-12060395/Chris-Eubank-Jrs-huge-rematch-Liam-Smith-set-postponed-Beefys-training-injury.html",
    "content": [
        "Liam Smith has reportedly picked up an injury in training for a huge rematchIt means his clash with Chris Eubank Jr will be postponed for a couple of weeks Eubank Jr and Smith were set to swap blows again in Manchester on June 17 Liam Smith has picked up an injury in training for his rematch with Chris Eubank Jr, forcing their June 17 meeting to be delayed for a couple of weeks, according to a new report.",
        "The Liverpudlian surprised the bookmakers to beat Eubank Jr by TKO in the fourth round of their initial middleweight meeting in January.But after defeat, Eubank activated his rematch clause, which was confirmed last month to take place in Manchester's AO Arena in Manchester.Less than two weeks after the fight confirmation, ESPN reporter Mike Coppinger has said that the fight will be temporarily delayed due to an injury setback for January's victor.Coppinger tweeted: 'Liam Smith suffered an injury while training and his June 17 rematch with Chris Eubank Jr. has been postponed, sources tell ESPN. ",
        "'The middleweight fight is expected to only be delayed a couple of weeks. Smith scored an upset TKO-4 victory when they met in January.' The exact nature of the 34-year-old's injury has not been confirmed, but it is unlikely to be a serious issue if the delay is only a few weeks.  The rematch was expected to be shown by Sky Sports Box Office, but the PPV now looks to be temporarily delayed while Smith's injury heals. Savannah Marshall’s challenge to undisputed champion Franchon Crews-Dezurn -  the chief support on the event's undercard - is expected to move with the main event. Eubank Jr had won six fights in a row before being knocked-out in January, a victory which took Smith to four straight wins since defeat to Magomed Kurbanov in May 2021.  "
    ]
}