{
    "articleURL": "/wires/reuters/article-12044983/Justin-Verlander-ready-make-Mets-debut-vs-Tigers.html",
    "content": [
        "It's always special when Justin Verlander pitches in Detroit. Adding to the intrigue on Thursday is that Verlander will make his long-awaited New York Mets debut against the host Tigers.",
        "Verlander's stint with the Mets was delayed by a right teres major strain. He tuned up with a rehab start at Double-A Binghamton on Friday and tossed 4 2/3 scoreless innings.\"I was hoping it would be quicker, but it just didn't quite cooperate,\" Verlander said of the injury. \"It took a little longer to heal than we anticipated.\"Verlander (18-4, 1.75 ERA in 2022) signed a two-year, $86.7 million contract with the Mets after a Cy Young Award season with Houston. The Mets are hoping Verlander is the missing piece to a World Series title, which has eluded them since 1986.Verlander built up a Hall of Fame resume with the Tigers from 2005-17. He was traded that final season to the Astros, where he won two championships.In four starts against the Tigers since that deal, he's 2-2 with a 3.10 ERA.He'll be making his 190th start at Detroit's Comerica Park on Thursday while going for his 100th victory on that mound. He's 99-50 with a 3.19 ERA at the Tigers' ballpark.\"It's funny how baseball works,\" Verlander said. \"Obviously, I wouldn't like to start the year on the IL at all, but baseball, as always, tends to have some funny stories and connections. So, here I am, my first start as a Met in Detroit.\"",
        "The Tigers came up short of winning a championship during Verlander's years, losing in the 2006 and 2012 World Series.\"I don't look at anything negatively, just appreciate it for what it was and close the chapter and move on to the new one,\" Verlander said. \"I'm right in the thick of a brand new chapter with the New York Mets. I'm very pleased with my time in Houston, as well. \"That (one in Detroit) was the first chapter of my baseball career, a long one, and it ended and ended peacefully.\"Verlander will be opposed by left-hander Eduardo Rodriguez (2-2, 2.21 ERA), who has emerged as the ace of the Tigers' staff. Rodriguez has allowed just two runs in his last four starts, spanning 26 2/3 innings. He has walked three and struck out 24 during that stretch.Rodriguez gave up one run and four hits in 5 2/3 innings in a win against Baltimore on Saturday.The Tigers swept a doubleheader from the Mets on Wednesday behind Eric Haase. He drove in five runs in the opener, including a three-run homer and two-run single, as Detroit pulled out a 6-5 win. He added a solo homer and two runs as the Tigers cruised to an 8-1 victory in the nightcap. New York has now lost eight of its last 10 games.",
        "Haase hit a combined 36 homers over the previous two seasons but hadn't gone deep in 2023 until Wednesday.\"We've been having our opportunities, getting guys on base and haven't been able to capitalize on those opportunities,\" Haase said. \"Thankfully (Wednesday) I had some pitches over the plate and I was able to keep it rolling.\"Detroit knocked out Max Scherzer in the fourth inning of the second game.\"Just really good at-bats,\" Tigers manager A.J. Hinch said. \"We had to feel him out a little bit and our at-bats got better and better.\"--Field Level Media"
    ]
}