{
    "articleURL": "/wires/reuters/article-12048459/FTX-gets-approval-LedgerX-sale-asserts-3-9-bln-Genesis-claim.html",
    "content": [
        "By Dietrich Knauth",
        "May 4 (Reuters) - Bankrupt crypto exchange FTX received U.S. bankruptcy court permission on Thursday to sell its LedgerX business for $50 million, raising additional funds to repay creditors.At a hearing in Wilmington, Delaware, U.S. Bankruptcy Judge John Dorsey signed off on FTX's sale of LedgerX, its non-bankrupt crypto derivatives trading platform, to an affiliate of Miami International Holdings.Miami International Holdings owns the Bermuda Stock Exchange and several U.S.-registered securities exchanges, including the Miami International Securities Exchange.FTX is attempting to repay an estimated $11 billion to customers through a combination of asset sales and clawback actions. Since filing for bankruptcy in November, FTX has recovered more than $7.3 billion in cash and liquid crypto assets, the company reported in April.As part of that broader effort, FTX on Wednesday said it would seek repayment of nearly $4 billion from Genesis Global Capital (GGC), the bankrupt lending arm of crypto firm Genesis.FTX said in a court filing that Genesis owes it that money as a result of transactions that took place shortly before FTX's bankruptcy filing. Under U.S. bankruptcy law, debtors can try to claw back payments made in the 90 days before a bankruptcy filing so that those funds can be more equitably distributed among creditors.Genesis was a primary \"feeder fund\" for FTX-affiliated hedge fund Alameda Research, loaning Alameda crypto assets that it used for further loans and investments, according to FTX.",
        "At one point, Alameda held $8 billion in loans provided by Genesis, according to FTX. Genesis, unlike other creditors, was largely repaid before FTX went bankrupt, FTX said.Companies in the crypto lending industry were highly intertwined during a turbulent 2022 that saw many tumble into bankruptcy. FTX, a once-prominent crypto exchange, filed for Chapter 11 amid allegations that founder Sam Bankman-Fried used FTX customers' money to prop up Alameda's balance sheet.Bankman-Fried has been indicted on fraud charges for his role in the company's collapse, and he has pleaded not guilty. Former members of his inner circle have pleaded guilty and agreed to cooperate with prosecutors. (Reporting by Dietrich Knauth; Editing by Alexia Garamfalvi and Daniel Wallis)"
    ]
}