{
    "articleURL": "/wires/ap/article-12047777/US-ambassador-visits-American-Paul-Whelan-Russian-prison.html",
    "content": [
        "MOSCOW (AP) - The U.S. ambassador to Russia visited Michigan corporate security executive Paul Whelan in a remote Russian prison on Thursday, as U.S. officials try to persuade Russian officials to agree to a proposal for gaining his release.",
        "\"Paul has been wrongfully detained in Russia for more than four years, and his release remains an absolute priority,\" Ambassador Lynne Tracy wrote on Twitter. \"The U.S. government will continue to engage Russian authorities on his case so Paul can come home as soon as possible.\"Tracy did not comment on Whelan's condition or say what she discussed with the retired U.S. Marine, who was detained in 2018 and is serving a 16-year sentence for espionage. Whelan and Washington deny he spied in Russia.The Biden administration had hoped to secure Whelan's release during the negotiations on the prisoner exchange that eventually freed American basketball star Brittney Griner from a Russian prison in December.U.S. officials have said that Washington presented a \"serious proposal\" to Moscow to try to get Whelan out.Analysts have pointed out that Moscow may be using jailed Americans as bargaining chips in soaring U.S.-Russian tensions over the Kremlin´s military operation in Ukraine.",
        "Another American jailed in Russia is Wall Street Journal reporter Evan Gershkovich, who was arrested March 29 and accused of trying to obtain classified information.Gershkovich is the first U.S. correspondent since the Cold War to be detained in Russia on spying charges, which his family and the newspaper vehemently deny.Tracy visited Whelan in IK-17, a remote Russian penal colony in Mordovia, a region 350 kilometers (210 miles) southeast of Moscow that human rights advocates say is known for harsh conditions and violent criminals. It´s in a region once synonymous with the Soviet gulag."
    ]
}