{
    "articleURL": "/wires/reuters/article-12042659/Stark-choices-Lebanons-trans-people-economic-freefall.html",
    "content": [
        "Hormones prove hard to find in economic crisis",
        "High cost and low supplies hinder accessLack of meds spurs illness, delays transitionBy Nazih OsseiranBEIRUT, May 3 (Thomson Reuters Foundation) - Meals or meds? It is a painful choice that 26-year-old Rayan often faces as a Lebanese trans man who struggles to afford food on top of his hormone therapy.The drugs usually win.\"My medicine comes before my food and drink,\" he said. \"A lot of the time I buy my medicine and do not eat.\"He needs about $12 a month, $5 for each of his two injections and another $2 in nursing fees for administering the jabs.On top of that come frequent visits to a doctor who monitors his general health and advises him on hormone medication - sessions that set back the uninsured barman another $50 a time.He works 18-hour days at an underground Beirut bar, earning $180 a month in a country that is suffering economic freefall.Lebanon has been crippled by the collapse of its currency, which has lost some 98% of its value against the U.S. dollar since 2019, triggering triple-digit inflation and plunging many Lebanese into poverty.The World Bank has called it one of the worst crises of the modern era.Activists and physicians say the fallout has had an outsized effect on trans people.",
        "They say the crisis is forcing them to seek cheaper and sometimes risky medication, or stop taking their hormones altogether. All of which makes it harder to transition and qualify for vital ID documents that match their desired gender.Finding - and affording - healthcare is a daily struggle for most trans people in Lebanon, according to medics and activists.Rayan, along with 36 of 48 trans people surveyed by Nada Ghorayeb for a local rights group, said money was the main barrier to accessing care and hormone treatment, while 22 respondents said they could not even find a specialist to treat them nor track down the medication they need.The survey has yet to be published but the doctor shared her results with the Thomson Reuters Foundation.In 2021, the government cut subsidies to medicine. Prices sky-rocketed and medicines disappeared off the shelves.Almost 80% of the population of some 6.5 million living in Lebanon are poor, the United Nations said.Surgery to change his body remains a dream for Rayan.\"I cannot afford those operations even if I work and save for years and years.\"DEMAND BUT NO SUPPLYThroughout 2020, Rumi, a 31-year-old trans woman, would spend weeks driving across Lebanon - searching for oestrogen pills.She rarely found any.",
        "\"Before we had much easier access to the hormones,\" she said. The same goes for skin and hair products used by trans women to feminise themselves, said Rumi.Many of her friends cannot find the old products they need and cheap alternatives are running out of stock.The lucky few with access to dollars ask friends abroad to buy drugs for them. Others turn to cheaper substitutes.\"People are reaching out now asking for pregnancy pills and cheap versions of these kinds of pills which is very bad,\" said Leah Zraika, who works at Helem, a Beirut-based rights organisation that supports LGBTQ+ rights.A sudden stop in hormone treatment can cause depression, dysmorphia and body aches, Zraika said.So people are rationing, pooling resources, sharing drugs - anything, she said, to get at least a fraction of their needs.PLUGGING THE GAPSOrganisations like Proud Lebanon are trying to cushion the crisis by providing free healthcare to many LGBTQ+ Lebanese.\"After we saw that a lot were taking over-the-counter abortion pills, we started engaging more,\" Berto Maxi, the group's director said from their offices in an unmarked and half-finished building in the suburbs of Beirut.\"We offer medical support and discounted rates,\" he said, meaning cheaper tests and checkups for trans people.",
        "Batoul Jaafar runs a practice that provides gender affirming care in a system where many trans people fear going to their regular doctor as they seek to transition.\"They don't show up to my clinic any more and I think a big part of it is the money - they cannot afford it,\" she said.Misuse of hormones, or a sudden freeze in medication, poses risks to both bones and heart, the doctor said.Nor can she keep plugging the yawning money gap herself.\"I used to help patients as much as I can, but a doctor has expenses at the end of the day,\" she said. \"We cannot afford to be living in debt, we have costs.\"LEGAL LIMBOPaperwork for transitioning is fraught with problems, too, and many trans people are deterred from getting new ID papers due to high costs, protracted court proceedings and a dearth of legal aid, said a 2022 Human Rights Watch report.\"The legal system will not change your ID until all your hormone treatment and surgery (are done),\" said Nora Noralla, author of the report and a human rights researcher.\"Maybe you, as a trans woman, will start expressing your identity by acting and dressing socially like women, but you will never be a woman because the legal requirement has such a high threshold,\" she said.",
        "\"You will be left in legal limbo forever.\" (Reporting by Nazih Osseiran ; Editing by Lyndsay Griffiths. The Thomson Reuters Foundation is the charitable arm of Thomson Reuters. Visit https://context.news/)"
    ]
}