{
    "articleURL": "/wires/ap/article-12057721/Harden-makes-winning-3-OT-76ers-tie-series-Celtics.html",
    "content": [
        "PHILADELPHIA (AP) - James Harden had a new friend he called his good-luck charm in the arena and the grit he needed to turn in a vintage effort - in the form of tying and winning shots -for the 76ers.",
        "Looking down-and-out in the previous two games, Good Game James saved the 76ers in Game 4.Harden hit the floater with 16 seconds left in regulation that tied the game, buried the go-ahead 3-pointer with 18 seconds remaining in overtime and scored 42 points to help the Sixers stave off a wild Boston Celtics comeback in a 116-115 victory on Sunday.\"I just want to win,\" Harden said. \"Today was do-or-die for us.\"The 76ers tied their playoff series at 2-2 with Game 5 set for Tuesday.Harden won the game in front of John Hao, a paralyzed Michigan State shooting survivor who developed a long-distance friendship with the 10-time All-Star. Harden invited Hao to a game as soon as he was able to travel.",
        "\"He's strong, he's bouncing back, he's recovering very well,\" Harden said. \"I feel like it's my job to give him that light, that smile that he deserves. Hopefully today was one of those days where he can smile.\"Harden waved over Hao and signed his game-worn sneakers moments after Marcus Smart's potential winner was a tick too late. The 76ers are now guaranteed to return home for Game 6 on Thursday.Jaylen Brown said his poor defensive read when he ditched Harden to try and double Joel Embiid was a pivotal moment.",
        "\"It's a gamble at the wrong time and a big shot by James Harden,\" he said. \"That's my fault. I take full accountability.\"The Celtics did almost all they could to snuff out that chance. Smart and Jayson Tatum keyed a Celtics rally from 15 points down with 2 minutes left in the third quarter.Boston´s fun began in the fourth when Smart and Brown buried consecutive 3-pointers and Tatum attacked the rim for a bucket that wiped out an eight-point hole in 90 seconds. Al Horford put them ahead 98-90 - on a possession that started on the other end when Tyrese Maxey had his shot blocked - and shimmied for the crowd as boos rained on him.Yes, the 76ers had home court but fans tensed up as memories all those second-round exits since 2001 stirred inside the building. Smart and Malcolm Brogdon hit consecutive 3s for a 105-100 lead.But it was P.J. Tucker, the heart and guts of the Sixers, who again did the dirty work on a defensive rebound and a bucket. He made the free throw with 1:05 left and the tie game gave the Sixers new life.Smart hit two free throws and Harden tied it 107-all to guarantee a thriller.The Sixers were on the brink of defeat numerous times over the final 17 minutes, none more than when Embiid crashed into Smart on a driving, one-handed bank shot with 1:49 left in overtime and was whistled for an offensive foul. The play was reviewed and the call stood. Boston kept its 112-111 lead",
        "Embiid, the NBA MVP who had 34 points and 13 rebounds, kept his composure and eventually got to the line to sink two free throws with 59 seconds left and the season in the balance.Tatum - who struggled to score early but finished with 24 points, 18 rebounds, six assists and four blocks - hit a step-back 3 for a 115-113 lead. Harden made sure Boston would never challenge again.\"Jayson Tatum's 3 was awful that (a push-off) wasn't called,\" 76ers coach Doc Rivers said. \"You've got to call that play. I know it's a big play and I'm a big fan of refs not deciding (the game) but it could have decided the game.\"Brown scored 23 points and Smart had 21.Brown, though, took only three shots in the fourth quarter and none in OT when the Celtics needed him.\"I guess I've got to demand the ball a little bit more,\" he said. \"I thought good things happened when I had it in my hands. I thought our offense was OK. We chipped away, we made big-time shots, we got great looks all game long. We just came up short in the end.\"Harden did this already when he played in Game 1 like he was still the MVP in Houston and dropped 45 points to spur the upset road victory. Then, his game disappeared and he played two of the worst games of his career.",
        "Harden´s 5-for-28 combined shooting in Games 2 and 3 was worst effort for him over any two-game span in his career - regular season or playoffs.The best the 76ers could do ahead of Game 4 was only hope for a productive Harden.Philly got him.Harden hit all three 3s in the first half and scored 21 points, five more than his Game 3 total. Embiid was as potent as he could be on one good knee and had 19 points and 11 boards to give the 76ers a 59-50 lead at the break.\"Tonight, playing a lot of minutes kind of got to me at the end,\" Embiid said. \"We made the plays when we needed. PJ with the big and-1. Obviously, the James shot. I thought we stuck with it. But that's been us all season long. We stick together and fight through everything.\"TIP-INSCeltics: Tatum missed his first eight shots before he scored a bucket just before the first half ended.76ers: Julius Erving was in the house. ... Embiid and Harden are the first Sixers teammates with 30 points each in a playoff game since Embiid and Seth Curry did it in June 2021 against Atlanta.UP NEXT___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}