{
    "articleURL": "/news/article-12047503/Hell-paradise-Epsteins-Pedophile-Island-transformed-luxury-five-star-resort.html",
    "content": [
        "Investor and entrepreneur Stephen Deckoff has bought Jeffrey Epstein's 'Pedophile Island' as part of a $60m deal and plans to build a luxury resortBut the main challenge could be convincing people to vacation in a place that's now synonymous with Epstein's twisted abuseEpstein bought Little St James in 1998 and used it to abuse young girls and host lavish parties for his rich and famous friendsJeffrey Epstein's 'pedophile island' has been snapped up for $60 million by a billionaire with plans to transform it into a luxury, five-star resort.",
        "Stephen Deckoff, the entrepreneur and investor behind the project, will develop a 25-room retreat across the islands of Little St James and Great St James, in the US Virgin Islands, with the aim of a grand opening by 2025.But Deckoff might find that constructing his 'dream' resort with such an ambitious timeline is the easy part. Much more difficult will be convincing wealthy tourists to spend their downtime on an island once used by Epstein to rape and abuse young women. Little St James was dubbed 'Pedophile Island' by residents of the US Virgin Islands during the blatant, wholesale abuse conducted by Epstein after he bought the isle in 1998 for $7.5 million. He bought Great St James, the larger island beside it, in 2016 for $22.5 million to protect his privacy.It was revealed on Wednesday that Deckoff has purchased both for $60 million. Announcing his vision for the islands, Deckoff emphasized that he never met Epstein and visited the islands for the first time after they were listed for sale.",
        "The troubling past of Little St James has been widely documented in photographs, victim testimony and court cases against Epstein and his associates.Epstein - with help from his confidante and fixer Ghislaine Maxwell - trafficked many young girls to the island, where they were raped and abused. ",
        "Photographs previously published by DailyMail.com show young girls posing on the paradise island, or giving massages to Epstein while makes telephone calls.Maxwell is seen in other pictures being waited on by the legion of staff who Epstein recruited to manage the island.Epstein is said to have imported 200 workers after his purchase of the island to build a stone mansion, two guest houses, a helipad and a bizarre gold-domed structure that resembles a temple.The temple structure was built between 2009 and 2013 but it remains unclear what the building was for. ",
        "Several of Epstein's victims have recalled the abuse and suffering they faced on the island.Sarah Ransome, a British victim of Epstein, claimed she was raped up to three times a day during months imprisoned there.She says she was so determined to escape that she hatched a plan to swim the surrounding shark-infested waters. However she was spotted on the video cameras Epstein installed across the island and stopped by his cronies.Chauntae Davies, another accuser, said Epstein raped her before bragging about his relationship with Prince Andrew. Davies said the disgraced financier became a 'monster' behind closed doors.Prince Andrew has admitted he has visited the island, but always maintained he was not aware of Epstein's crimes and never took part in anything illegal.",
        "Davies said she fell into Epstein's clutches when she was a 21-year-old trainee massage therapist in Los Angeles and treated Ghislaine Maxwell at Beverly Hills' Four Seasons Hotel.Davies later worked as Epstein's masseuse and as an air hostess on his private plane the 'Lolita Express'.",
        "The island has drawn several thrill-seekers who've ignored the no trespassing signs to explore the property.Luke Rudkowski of We Are Change and Jeff Berwick were able to get onto the island and explore Epstein's office, a few of the underground lairs and get close enough to the pedophile's infamous temple on Little St James to reveal that the doors of the structure are in fact painted on the building.Rudkowski explored several underground structures, including one that appeared to house the island's generator.There have also been claims the island has its own subterranean tunnel network, though this has never been substantiated. Epstein's resort also include a ten-person shower for orgies, according to a maintenance worker. Steve Scully said in 2020 that Epstein installed the shower in a bathroom whose walls were covered with pictures of naked girls. Epstein had remodeled his bedroom several times and during these renovations he put in a 'ten-showerhead shower - for group showers', Scully claimed.'There were more pictures in the bathroom than anywhere else – including of young, barely clothed or semi-nude girls,' he added.",
        "Announcing his plans for the islands, Deckoff said: 'I've been proud to call the U.S. Virgin Islands home for more than a decade and am tremendously pleased to be able to bring the area a world-class destination befitting its natural grace and beauty.'There is simply no place in the world as special as the U.S. Virgin Islands and I am humbled by the opportunity to share its splendor with visitors in a manner that will provide economic benefits to the region while respecting its culture, history and natural beauty.'I very much look forward to working with the U.S. Virgin Islands to make this dream a reality.'Deckoff is in the process of retaining architects and engineers to develop the resort on the islands"
    ]
}