{
    "articleURL": "/wires/afp/article-12048467/New-York-California-attorneys-general-launch-NFL-probe.html",
    "content": [
        "Attorneys General in New York and California announced Thursday they have launched a joint investigation into allegations of NFL employment discrimination and a hostile work environment.",
        "New York Attorney General Letitia James and California Attorney General Rob Bonta cited persistent reports and claims of abuses upon women by NFL players and male staff and concerns the league has not taken sufficient effective steps to prevent harassment, retaliation and discrimination in the workplace.The NFL, the world's richest sports league, had an average team value of $4.47 billion last August, with the Dallas Cowboys topping the list at $8 billion.The league, with more than 1,000 employees in its New York and California offices, will be the subject of a joint probe into workplace culture and allegations made by former employees, including potential violations of federal and state pay equity and anti-discrimination laws.\"No person should ever have to endure harassment, discrimination, or abuse in the workplace,\" James said in a statement.\"No matter how powerful or influential, no institution is above the law and we will ensure the NFL is held accountable.\"James and Bonta issued subpoenas to the NFL on Thursday seeking relevant information regarding gender pay disparities in compensation, harassment and gender and race discrimination.\"California will not tolerate any form of discrimination,\" Bonta said.\"We have serious concerns about the NFL's role in creating an extremely hostile and detrimental work environment. No company is too big or popular to avoid being held responsible for their actions.\"",
        "Bonta and James cited a 2022 New York Times report on more than 30 former NFL female employees claiming gender discrimination and retaliation after they filed complaints with the NFL's human resources division.A former female manager filed an employment discrimination lawsuit in Los Angeles Superior Court claiming age, sex and gender discrimination and a hostile work environment.Additional lawsuits filed against the NFL cited by James and Bonta included one on race discrimination targeting a Black female employee and sexual harassment of a female wardrobe stylist.The US Congressional Committee on Oversight and Reform began an inquiry into allegations of workplace misconduct by the Washington Commanders' owner Dan Snyder last year. The committee held oversight hearings to examine the situation, including the role of NFL leadership, and included calls for reform in its report."
    ]
}