{
    "articleURL": "/tvshowbiz/article-12058705/Larsa-Pippen-Marcus-Jordan-arrive-final-night-Carbone-Beach-Miami.html",
    "content": [
        "Larsa Pippen and Marcus Jordan attended the final night of the Carbone Beach event in Miami, Florida following the Formula 1 Grand Prix race on Sunday.",
        "The 48-year-old ex-wife of Scottie Pippen held hands with the 32-year-old athlete as they walked the function's red carpet toward the exclusive dining area.The media figure and the son of Michael Jordan, who are currently fielding rumors about a potential marriage, have been romantically linked since they were first spotted in each other's company in 2022.The mother-of-four flaunted her curves in an impressive Cult Gaia rhinestone-embellished stretch-woven maxi dress that featured side cutouts, a boat neck, long sleeves, and an open back. Pippen paired the glittering number with gold metallic platform heels and accessorized with a pair of statement earrings.",
        "Larsa slicked back her long, straight tresses into a polished ponytail and carried a $25,000 Hermès Epsom Kelly 28 Sellier bag in Anemone.She finished off her glamorous look with smokey eye makeup and a pink lip stain.Meanwhile, Marcus rocked a black shirt and pants with black and white low-top Jordan sneakers with an olive swoosh. The social media star shocked fans when she sparked up a romance with Jordan - who is the son of her ex-husband Scottie Pippen's biggest NBA rival - but told Tamron Hall there was no malice behind her decision to date the younger man.Pippen spoke about her relationship with Jordan during an interview with Tamron Hall saying, 'We have everything in common, I don't feel like age determines if you're mature. Scottie is 10 years older than me...'",
        "When asked if the pair were in love, she said: 'I think so. We're in a really good place.'Larsa said she had spent 'a lot of time' with Marcus' father, Michael, 60, and his mother, Juanita, 63, who were 'fine' with the romance. Other A-listers attending the event included Brooklyn Beckham, Nicola Peltz, Karrueche Tran, Lisa Hochstein, and LL Cool J.Larsa posed for a snap alongside Lisa Hochstein who looked lovely in a blue cut-out dress that gathered around the neck.The 24-year-old son of Victoria and David Beckham wore a black sweater, black jeans, and white sneakers with black cap worn backwards.His other half, 28-year-old daughter of billionaire businessman Nelson Peltz, looked stunning in a one-shoulder top paired with a quilted leather miniskirt and platform boots. ",
        "Before she began dating Jordan, the social media figure was married to basketball legend Scottie Pippen, with whom she tied the knot in 1997.The pair welcomed sons Scottie Jr, Preston and Justin, aged 22, 20 and 17, as well as a daughter named Sophia, aged 14, during the course of their marriage.The former couple separated in 2016 and reconciled before splitting for good in 2018, after which their union was formally dissolved in 2021.Speaking of which, Larsa admitted she was left exhausted having so much sex with the 57-year-old retired NBA legend.",
        "'[I] always had sex four times a night,' the Peacock reality star dished last Thursday during part two of the three-part fifth season reunion.'I had sex four times a night every night. I never had a day off for 23 years.'After Pippen's (born Younan) NSFW confession, executive producer Andy Cohen wisecracked that her current toyboy 'has really big shoes to fill.' ",
        "The Syrian-American influencer was still technically married to Scottie when she met the 32-year-old son of Michael Jordan through friends at a 2019 LA party, but they began dating last September.'I just met him a few years ago. I never met him before. I was with Scottie the very last year that [Scottie] played with Michael,' she clarified.'Michael and his wife were going through a divorce, so I never met his wife, never met his kids. 'It wasn't like we had families that were intertwined. I never knew them,' said Larsa."
    ]
}