{
    "articleURL": "/tvshowbiz/article-12061397/Deni-Todorovic-dropped-multiple-brands-drugs-confession.html",
    "content": [
        "Non-binary influencer and activist Deni Todorović has been dropped by several high-profile brands following a string of alarming social media posts - including a threatening email to Bonds. ",
        "The 35-year-old, who currently identifies by all pronouns after previously going by just they/them, is known for his headline-grabbing campaigns for the likes of Seafolly - which was so controversial it led to a customer boycott in March.But his days as an edgy spokesperson for fashion and beauty brands could be numbered with the likes of underwear label Bonds, youth charity Minus 18, and gin brand Tanqueray all cutting ties with, or distancing themselves from, Todorović in recent weeks. His podcast for Mamamia has also come to an end.",
        "Todorović's erratic behaviour has intensified over the last few days, with several Instagram posts appearing on his account making wild accusations against some of his former associates along with threats to 'expose' them.One since deleted screenshot obtained by Daily Mail Australia showed an email they sent to two senior staff members at underwear giant, Bonds.  The email read: 'I have photo evidence that proves I have done drugs with your staff.'If you'd like them leaked I'll happily share them .... I am my new manager. Consider our contract terminated.'  ",
        "'Send this to your CEO .... PAC brands (Pacific Brands) is about to get the shock of its life. Bye b***h.' Daily Mail Australia has contacted Deni Todorović for comment. Bonds declined to comment.While Todorović has always been something of a provocateur, his behaviour started to raise eyebrows late last month when he sensationally announced on Instagram he likes 'a line or two' of cocaine.",
        "Despite the outrageous admission, Todorović told his followers he had been sober for the past two weeks and insisted he doesn't have a problem with substance abuse.'I will give you a motherf**king urine sample if you need one because I have not been on motherf**king drugs for fifteen days today,' he ranted.'And I haven't drank - abused, rather - alcohol for fifteen days. I had a glass of f**king champagne with my mother when we made her the manager and a shot of limoncello out of respect to the Italian venue that we were at.",
        "'I had a glass of a cocktail last night with my mother and a scotch with my business partner yesterday morning, but things got a little bit horsey about two weeks ago where I was putting scotch in my coffee and I didn't want to become the drunk uncles that raised my mother.'",
        "Many of Todorović's followers expressed concern in the comments section of the video, which has now been deleted from his account.'This is coming from a loving place but I'm worried about you,' one wrote. 'Please take care of your health and mental health.'Another wrote: 'Watching this I'm actually worried for you right now. Please be okay and take time off and away from socials to heal. I hope you find peace.'",
        "Late last month, Todorović admitted he 'loves a line of cocaine' and invited brands to drop him if they disagreed.Hours later, his agent Pru Corrigan, who founded PR consultancy group One Day Dream, announced she had parted ways with the influencer as a client.'I am no longer behind the wheel of Deni's car,' Corrigan said on Instagram.'It's with mixed emotions that I say goodbye to this time in my life. I am very grateful for the time we shared as partners but like everything else - the show much go on.'The move came as a huge shock, as Todorović and Corrigan appeared to be joined at the hip on social media.In one gushing post, the influencer called Corrigan 'my business partner, my sister, my soul flame.'",
        "Todorović, who controversially partnered with swimwear brand Seafolly earlier this year, shared their thoughts on illegal substances in an Instagram post last month. He said that he's 'partial to a line or two [of cocaine] just like every AFL footy player who does it behind the world's back'.He went on to extol the virtues of drug legalisation - noting how the policy has reduced crime rates in countries like Portugal - then challenged 'any of the brands I work with' to nix their deals with them if that 'doesn't align with your ethos'.",
        "Just a few weeks prior, Australian swimwear brand Seafolly distanced themselves from the activist after a photo shoot which left consumers divided.",
        "At the time, some feminist critics said that having a biological male promote women's swimwear was 'erasing women', and noted the unfortunate proximity of the Seafolly campaign to International Women's Day.Writer Alexandra Marshall was one of those who had spoken out against brand's partnership with Todorović, saying the swimwear brand was 'mocking women' and said she would boycott Seafolly as a result.'Bye @seafolly. Never again. Been buying swimsuits from you for many years. Never again,' she posted on Twitter.A source with knowledge of the situation said: 'Seafolly will never work with Deni again. They said, in so many words, that Deni is a liability to the brand and alienating customers. There were even talks of financiers withdrawing investment.'Seafolly issued a public statement at the time of the scandal, insisting that they are 'supportive of all women' and that supermodel Joanna Halpin was always their official ambassador, not Todorović.Daily Mail Australia understands the brand was particularly mortified when Todorović put out a statement saying 'some women have penises' during the backlash.",
        "Since the scandal, the once-celebrated swimwear brand has been put up for sale less than three years after it was saved from administration.",
        "Deni has exploded on the celebrity scene in the past two years and become one of the leading faces of the nonbinary movement in Australia.He previously identified with the gender-neutral pronouns of they/them, but in April confirmed that he was now comfortable using male pronouns again.'I am so comfortable in my own skin that now I use he/him/she/her/they/them. I don't give a f**k what you call me. I'm just Deni. So they are my pronouns.'"
    ]
}