{
    "articleURL": "/news/article-12039639/Bali-holiday-horror-family-falls-victim-150-000-myGov-scam-identitys-stolen.html",
    "content": [
        "Aussie couple robbed in BaliSome $150,000 stolen from myGovAn Australian mum said she and her husband were robbed while on a family holiday before being hit in a $150,000 scam.  ",
        "Melbourne social media influencer Anna De Rieu and her partner were on the trip of a lifetime with family when they were robbed of their belongings.The couple's details were then used by thieves to hack into their myGov account and withdraw $150,000 in government support payments under their name.",
        "Ms De Rieu said she had no idea so much money had been taken out until she went to log into her account herself.She and her husband were blocked from accessing it which prompted them to phone Centrelink to try and resolve the issue.They were then informed their details and home addresses had been changed multiple times with money taken out in their names.Ms De Rieu said it took about six months to resolve the issue and she now fears she could be the victim of more hacks in the future. Several families have fallen victim to scammers defrauding their myGov accounts by accessing and changing their personal and tax information.Through myGov, users can access services including Centrelink, the Australian Taxation Office and Medicare.Ms De Rieu told 7News the scammers had claimed payments from flood and pandemic relief to jobseeker.'Every time they would make a claim, they would change (our) address,' she said.Melbourne woman Leah Wilson was also sent a massive bill due to cyber criminals filing fraudulent tax returns in her name.",
        "'I noticed (through myGov) there were three separate organisations that put through that I was working for them,' she said.'I ended up with a $27,000 tax bill... and it was really difficult trying to prove it wasn't me.'I had a mini heart attack, I'm not going to lie.'",
        "Ms Wilson was among the millions of Australians whose details were stolen in the Optus data breach last year and says ever since she has received several scam emails and calls.It comes as Australians have been told to remain vigilant of scam emails or texts claiming to be sent by myGov following an uptick in fraudulent messages.Scammers are posing as government officials and telling recipients to click on dodgy links so they can claim a refund or rebate.Services Australia says anyone who has received a message that alleges their account has been changed in some way should consider it a scam.'You may have recently got a text message to advise you've made a change to your myGov account' Services Australia said in a statement.'The scam text message asks you to click a link if the myGov activity was not made by you.'The text message may ask you to click on a link or access a web form.",
        "'If you do, you may be redirected to a fake myGov site designed to steal your personal information and banking details.'It may tell you that your information is being transferred securely. This is a trick to gain your trust and get you to click on the link.'",
        "Services Australia recommends users only log into their myGov account by searching my.gov.au on a web browser and never click on links attached to an email or text message.One example of a scam text will read: 'Your profile security information was successfully changed if you didn't make this change Go To [link].'Another tells the user that their 'profile has been placed on hold pending review' and then adds a link at the end to 'resolve' it.ScamWatch has shared several tips and tricks to help everyday Australians recognise a scam text message or email.They say poor grammar or punctuation are among the major red flags found in scam messages and hyperlinks will never be included in any email or text message sent by myGov.Emails sent by the government agency will also not include the logo and simply inform the recipient they have received a new message in their inbox.Anyone who believes they may have already fallen victim to a myGov scam should call the Services Australia Scams and Identity Theft Helpdesk immediately."
    ]
}