{
    "articleURL": "/wires/pa/article-12038379/Australia-batter-Steve-Smith-excited-start-Sussex-spell.html",
    "content": [
        "Steve Smith is excited to gain his first taste of County Championship cricket after “the stars aligned” to give him the chance to play for Sussex ahead of the Ashes.",
        "The Australia batter will play three games for the club in May starting with the trip to Worcestershire on Thursday, before games at Leicestershire and at home to Glamorgan.The first Ashes Test will begin at Edgbaston on June 16, and some critics have questioned whether it could damage England’s chances giving Smith the opportunity to have game time in the country in the weeks leading up.",
        "Sussex coach Paul Farbrace dismissed the suggestion that it could put Australia at an advantage and said having a player of the 33-year-old’s calibre in the County Championship can only be good for English cricket.Smith’s arrival has been a coup for Sussex after they finished seventh in Division Two last season, and despite having served a 12-month ban from cricket for his role in Australia’s ball-tampering scandal in 2018, he remains an elite player.Last year he announced he had elected not to take part in this year’s Indian Premier League (IPL).“I’m excited by the next couple of weeks,” said Smith. “I originally didn’t put my name in the IPL auction. Particularly coming off the Test series there, I’ve done that a couple of times and it’s very long, having the IPL on the back of it.“I’ve got a lot of cricket coming up and a window opened up to come and play some county cricket. It’s something I’ve never done and have always wanted to do, so the stars aligned in a way.",
        "“We are over here for the English summer and it’s a good opportunity to play some county cricket, which is something I’ve wanted to do for a long time. I’m excited.“I don’t know if it’s career-defining, not sure about that. It’s certainly going to be a good couple of months. I’m excited by everything that is coming up.“I’m just looking forward to getting a few games in here for Sussex where hopefully I can have an impact on some younger players and the team has started really well this year. Hopefully get some good results and help Sussex win some games of cricket.”Farbrace was emphatic that Smith’s presence was a sign of the growing appeal of the County Championship.England captain Ben Stokes in January questioned his involvement so close to the start of the Ashes, saying: “I think it’s one of those where you would probably prefer them (Australian players) not to get any game time out here before the Ashes.”",
        "But the Sussex coach insisted the club have not compromised England’s chances of winning a first series since 2015 after failing to regain the urn at the last three attempts.“Sport is all about opinions,” said Farbrace. “That’s what we love about the game. I’ve got very strong views on Chelsea. The fact that people are talking about Championship cricket is only good for the game.",
        "“I’ve got good friends who think that we’re helping Australia to win the Ashes. We’re not at all. I think this is really good for English cricket.“It was a very easy decision and conversation with Rob Andrew the CEO. We both realise it’s about trying to create this winning mentality and a culture within our set-up that we expect to win.”Of his side’s chances of winning this summer, Smith added: “England just play tremendous cricket at home all the time. We generally play pretty well at home as well. Anyone who plays at home knows the conditions a lot better.“It’s going to be a terrific summer. Both teams are playing good cricket, different brands of cricket.”"
    ]
}