{
    "articleURL": "/wires/afp/article-12059317/Tales-horror-thousands-flee-ethnic-violence-northeast-India.html",
    "content": [
        "Father-of-five S. Mamang Vaiphei hid in the jungle for three nights after a mob attacked his village in Manipur, the remote Indian state where ethnic violence has reportedly killed at least 54 people.",
        "Around 23,000 people have fled the unrest which erupted last week in the hilly northeast state bordering Myanmar.\"The Meitei people first burnt down 26 or 27 houses,\" Mamang, now sleeping out in the open in an army camp with around 900 others bringing similar horror stories, told AFP.\"Then they came again and finished all 92 houses (in the village), ransacked the church, the school and whatever was left,\" the 54-year-old said, surrounded by exhausted and traumatised men, women and children.The far-flung states of northeast India sandwiched between Bangladesh, China and Myanmar have long been a tinder box of tensions between different ethnic groups as well as a hotbed of separatism.",
        "The latest clashes erupted last week between the majority Meitei people, who are mostly Hindu, living in and around the Manipur capital Imphal and the mainly Christian Kuki tribe of the hills.The spark was a protest about plans to give the Meitei \"Scheduled Tribe\" status giving them, in a form of affirmative action, guaranteed quotas of government jobs and college admissions.Violence erupted in Imphal and elsewhere with protestors setting fire to vehicles and buildings and according to villagers, Meitei mobs armed with guns and petrol cans then attacking Kuki settlements in the hills.- 'Shoot-at-sight' -",
        "The military has deployed thousands of troops, issued \"shoot-at-sight\" orders in \"extreme cases\", imposed curfews and cut the internet.Mamang, spending his fifth night homeless on Sunday, is one of around 23,000 people that the military says it has brought to safety.",
        "He said that on May 4 he fled his village of Kamuching, which had a population of more than 500 people before the unrest, when a \"large crowd\" starting attacking.\"Everything was on fire... We ran away, all of us ran to the jungle and we try to survive,\" he said.Mostly people only managed to grab a small bag with a few personal belongings, an extra pair of clothes or their smartphones.In the absence of social media with the internet shutdown -- to curb disinformation, which could fuel further tensions -- others at the army camp had similar stories.\"Every one of us here, we're nervous, we're afraid of death,\" said Alun Vaiphei, 50, a Kuki tribal villager from Gotangkot.",
        "\"To save our lives, we contacted Assam Rifles, so that they rescued us from our place of hiding,\" he told AFP.In and around Imphal on Sunday, life had come to a standstill, with businesses shut and deserted roads still littered with charred cars.The violence has eased but Brigadier Sandeep Kapoor from the Indian army said on Sunday they still received \"50 to 60 calls\" for help.",
        "His teams had rescued about 2,000 people -- both Kukis and some Meitis -- in the last 48 hours, he said.- 'Nowhere to go' -The army said that bringing people to safety was not easy given the polarisation and complete breakdown of dialogue between the communities.",
        "\"We can't move them in the open as there are chances that if members of the other community see them, when we cross their villages along the highway, they may get aggressive,\" another Indian army officer told AFP.A few men, infants, older women and young girls were huddled inside three military trucks, including Leh Haokip, 35, from Gotangkot village.He told AFP he saw the \"looting of my home, the stealing of my cattle and the fire\" from a distance.\"There was no police or state help and now we don't know what to do or where to go,\" he said."
    ]
}