{
    "articleURL": "/wires/pa/article-12043189/Sam-Allardyce-I-m-good-Pep-Guardiola-Jurgen-Klopp-Mikel-Arteta.html",
    "content": [
        "Sam Allardyce claimed he is as good a manager as Pep Guardiola, Jurgen Klopp and Mikel Arteta as he was unveiled as Leeds’ new boss on Wednesday.",
        "Leeds have turned to former England manager Allardyce, 68, in a last-ditch bid to retain their Premier League status after sacking Javi Gracia with four games remaining.Allardyce, relegated from the top flight for the first time in his 30-year managerial career in his last job at West Brom two years ago, said: “Far too many people think that I am old and antiquated, which is far from the truth.",
        "“I might be 68 and old, but there’s nobody ahead of me in football terms. Not Pep, not Klopp, not Arteta.“It’s all there with me. They do what they do, I do what I do. In terms of knowledge and depth of knowledge, I’m up there with them. I’m not saying I’m better than them, but certainly as good as they are.”Former Bolton, Newcastle, West Ham and Everton boss Allardyce takes charge of his first game for Leeds at Guardiola’s title-chasing Manchester City on Saturday.Having already removed director of football Victor Orta, Leeds announced the departure of Gracia on Wednesday morning along with his backroom staff.Allardyce said: “I’ve had a lot of responses from many people that I know sending their congratulations. A few others said I must be mad.“But I enjoy the game so much and to try and save this club and keep it in the Premier League is a big responsibility and a big challenge. But it’s one I’m prepared to take because of who Leeds are.”",
        "Allardyce is the club’s third permanent manager of the season, with Gracia having replaced Jesse Marsch in February.The former England boss is hoping for an immediate response from a demoralised squad who are languishing in 17th place, out of the relegation zone only on goal difference.",
        "“It’s probably only the biggest challenge (of my career) because of the shortness of games that are left,” he said.Allardyce is reported to have agreed a basic salary of £500,000 for his four games in charge, with a £2.5million bonus if he can keep Leeds up.When asked if there was a chance he would stay at Elland Road beyond the remainder of this season, he said: “Never say never.“It depends what happens at the end of the four matches and what the conversation is all about, how I feel and more importantly how my wife feels.”",
        "Former MK Dons, Charlton and Oxford boss Karl Robinson will be Allardyce’s assistant and ex-Leeds striker Robbie Keane has also joined the backroom staff.Allardyce had hoped to have been assisted by Sammy Lee, who is unavailable after being refused permission to cancel jury duty.“The judge has left Sammy unemployed and wouldn’t let them off,” Allardyce added. “I think it’s very poor judgment indeed. It’s a real shame because he loves being with me and I love having him with me.”",
        "After Allardyce’s first game at the Etihad Stadium on Saturday, Leeds face Champions League hopefuls Newcastle at Elland Road the following week.The final two games of the season are a trip to West Ham, one of Allardyce’s former clubs, and the visit of Tottenham, who are bidding to qualify for Europe.Leeds have lost five of their last seven games, with Sunday’s 4-1 reverse at Bournemouth following 4-1, 5-1 and 6-1 defeats to Arsenal, Crystal Palace and Liverpool respectively last month.On Sunday, fans’ group the Leeds United Supporters Advisory Board issued a vote of no confidence in both the club’s board and Gracia.The players subsequently issued a statement on Monday apologising for their performance at Bournemouth and for failing to acknowledge fans at the team hotel.",
        "Gracia leaves Leeds after only 11 league games in charge. The Spaniard collected 10 points from his first six fixtures, but a dreadful run of results in April left the club in a downward spiral.Gracia said in a statement: “I’m grateful for this opportunity and proud of the team, both players and coaching staff. That’s how I would like to summarise my time at Leeds United.“I would have preferred a different moment, but the circumstances have changed. We arrived on a short three-month contract, and we did it because we believed in this team.”"
    ]
}