{
    "articleURL": "/wires/reuters/article-12058055/Oil-prices-inch-recession-fears-begin-fade.html",
    "content": [
        "By Sudarshan Varadhan",
        "SINGAPORE, May 8 (Reuters) - Oil prices rose slightly in early Asian trade on Monday as fears of a recession in the U.S., which drove prices down for three straight weeks for the first time since November, began to recede.Brent crude futures were up 6 cents at $75.36 a barrel at 0022 GMT. U.S. West Texas Intermediate (WTI) crude futures were up 8 cents at $71.42.Concerns that the U.S. banking crisis will slow the economy and sap fuel demand in the world's biggest oil consuming nation drove the Brent benchmark down 5.3% last week and sent WTI plunging 7.1%, despite a sharp rebound on Friday which saw the benchmarks gain about 4% each.A healthy U.S. jobs report for April, a weaker dollar, and expectations of supply cuts at the next meeting of the Organization of the Petroleum Exporting Countries and allies, together called OPEC+, in June have helped stop the slide in prices.\"Oil's rebound follows energy stocks' comeback on Wall Street last Friday after the U.S. reported strong job data, which eased concerns about an imminent economic recession that led to the selloff early in the week,\" said Tina Teng, an analyst at CMC Markets.The United States is expected to report consumer price inflation figures for April on Wednesday, which could provide further clues on interest rate moves amid broad expectations that the U.S. Federal Reserve will pause rate hikes.",
        "Also in focus are two reports on U.S. credit conditions and loan demand, which will be more closely watched than usual, in light of the recent stress in the regional banking system.Traders this week will also keenly watch Chinese economic indicators including trade, inflation, lending and money supply figures for April, as market participants continue to gauge economic recovery in the world's second largest oil consumer.\"Crude prices may continue to take the rebounding tailwind,\" CMC'S Teng said. (Reporting by Sudarshan Varadhan; Editing by Sonali Paul)"
    ]
}