{
    "articleURL": "/travel/article-12051581/Im-former-flight-attendant-disgusting-things-Ive-witnessed-cabin.html",
    "content": [
        "'Diary of A Flight Attendant' is a warts-and-all look at life at 38,000ft It's by Marika Mikusova, who spent five years working for a 'luxury airline'  READ MORE: The top 10 most annoying things people do on holiday revealed ",
        "Think the life of a flight attendant is one big party?",
        "One former air hostess has set the record straight in a book that pulls together her diary entries made while working for a 'luxury airline' over a period of five years.'Diary of A Flight Attendant' by Marika Mikusova is a warts-and-all behind-the-scenes look at what it's really like to work at 38,000ft. Read on for revelations about some of the most disgusting things she's witnessed on a plane, from used diapers in seat pockets to bags of urine on the floor.ATTACK OF THE SMELLY FEETMarika reveals that 'hardly any flights are without smelly feet' and recalls a flight during which a passenger took off his shoes and stretched his legs into the aisle 'so that his toes peeked into the galley from behind the curtain'. The aroma, she says, was one of 'pretty stale cheese'.  A passenger wipes his armpits thoroughly with the towel and hands it to me with two fingers To combat this, her colleague sprayed the carpet outside the galley with perfume.BAGS OF URINE ON THE FLOOROn one flight, a trio of Turkish passengers that the crew suspected had stolen some perfume from the duty-free trolley were consigned to their seats – and at the end of the flight 'left a bag of urine on the floor'.",
        "STAINS AND URINE COVERED WITH A BLANKETMarika says that if the cleaners are in a rush, they sometimes just cover up a stain or a wet patch.She writes: 'Sometimes they cover [period] blood or a wet seat with a blanket. Then the passenger who is supposed to be sitting in the seat notices it. Very nice welcome indeed. It's not always the cleaner's fault though. It's their supervisor's - the one in charge of the cleaning team who's cracking the imaginary whip over them. There's never time for perfect cleaning.'THE PASSENGER WHO WIPED HIS ARMPITS WITH THE TOWELMarika reveals: 'On the Indian flights passengers use [the hot towels] to wipe the soles of their feet. On one flight though, a passenger took it up a notch, stopping me with his index finger as I attempted to collect used towels. He wipes his armpits thoroughly with the towel and hands it to me with two fingers, clearly disgusted with himself.'I hesitate for a moment, but then I grab hold of the towel with the tongs and throw it into the plastic bag.'",
        "SURPRISE 'DIAPER PRESENTS'Marika recalls a passenger changing her baby's nappy on the flight at her seat – just before the meal service.Marika writes: 'I try to indicate to her that it may not be pleasant for other passengers, especially since we're just starting to serve meals.",
        "'The lady just smiles: \"It's okay, I'm done anyway.\" At the end of the flight I find used diapers under her seat. This isn't the only flight where I've found these \"surprises\" at the end.'Marika adds: 'Parents [also] leave used diapers in seat pockets.'HOW ARE THE CREWS AT CLEANING THE LAVATORIES?Marika says: 'When the crew goes to \"clean the lavatory\", what that really means for a lot of them is that they just lock themselves inside for five minutes to check their cell phones.'COMING CLEAN ABOUT THE CLEANERSAfter one flight, Marika witnessed a cleaner wiping the surface of the galley 'with the same rag he just used to wipe the toilet floor'. She adds: 'I've seen it so many times, I'm not surprised at all.'Diary of a Flight Attendant is out now. Click here to order a copy. You can find Marika tweeting at twitter.com/letuska_m and her Instagram account is here. "
    ]
}