{
    "articleURL": "/news/article-12047559/Chinese-cameras-spy-Coronation-crowds.html",
    "content": [
        "MPs warned of a potential Coronation security threat today after it emerged Chinese-made CCTV cameras banned in government departments will be 'spying' on the crowds.",
        "Thirty-eight of the devices by Hikvision, which has worked closely with China's military, have been specially erected along the parade route stretching from Buckingham Palace to Trafalgar Square.The cameras can capture 'up to five faces at the same time' and offer 'human and vehicle targets classification based on deep learning,' according to the manufacturer's brochure.It prompted fears information harvested from the thousands flocking to watch the Coronation parade in central London on Saturday will be passed back to Beijing.Hikvision is banned by the US Government from all federal agencies, and Oliver Dowden, Chancellor of the Duchy of Lancaster, last November ordered all British ministries to remove Hikvision cameras because of security concerns.",
        "The Commons foreign affairs committee has also previously called for the prohibition of equipment manufactured by Hikvision and other companies said to have had their cameras deployed in internment camps in China's Xinjiang province.The cameras at the Buckingham Gate entrance to St James's ParkSir Iain Duncan Smith, former Tory leader and co-chairman of the Inter-Parliamentary Alliance on China, said: 'Nothing surprises me any more about the incompetence of the authorities when it comes to China.'The reality is the security services have told us that these cameras are a threat.'Former British military intelligence officer, Colonel Philip Ingram, said: 'Using them for such a prestigious and important event flies in the face of every bit of security advice that has been given in recent months.",
        "'There are many British-manufactured camera solutions that would be much more relevant for a very British occasion.'The use of devices where many experts in the UK and US have raised very real concerns about, also increases the potential of cyber vulnerability around the infrastructure protecting the Coronation. Let's hope this risk has been properly assessed.'Madeleine Stone, Legal and Policy Officer at Big Brother Watch, said: 'The Chinese government has a law, the National Intelligence Law, which obliges Chinese businesses and citizens to assist the intelligence services in espionage. And of course, that's kept secret. So the risk is astronomical.'The Met said it was not responsible for the Hikvision cameras but is intending to use separate cameras at the Coronation fitted to vans with facial recognition technology to analyse thousands of pedestrians a minute.Security guards on the Coronation procession route said the Hikvision cameras had been unloaded by trucks belonging to an events management company earlier this week.Fixed on to temporary metal gantries, viewing platforms and 10ft-tall tripods, the cameras appeared to be trained towards the Mall's many entry points and designated crowd areas.",
        "The cameras also face pedestrians on Birdcage Walk and Buckingham Gate, overlooking parts of St James's Park, above the South African Royal Artillery Memorial, the Diana Princess of Wales Memorial Walk, Admiralty Arch, Hoarse Guards Road, and four at the press platform by the equestrian statue of Charles I.",
        "One security guard, who asked to remain anonymous, said: 'The cameras are all going to be watching the crowds and the public on the day, helping with crowd control, making sure nothing goes wrong.'Hikvision has denied handing any footage to the Chinese government and says it complies with UK legislation.But the firm is subject to China's National Intelligence Law, which can order companies to hand over data to its intelligence service.In February a damning report from surveillance tsar Fraser Sampson warned that Beijing-linked technology was increasingly common and too many people were ignoring – or were unaware of – the risks.Last year the US government banned the sale or import of new Hikvision products and branded the state-owned firm's technology an 'unacceptable risk to national security'."
    ]
}