{
    "articleURL": "/tvshowbiz/article-12040329/Kim-Kardashian-recalls-fashion-shoot-Karl-Lagerfeld-stars-honored-Met-Gala.html",
    "content": [
        "Kim Kardashian took to Instagram on Tuesday to share memories of her 'first fashion shoot ever' with the late Karl Lagerfeld.",
        "The 42-year-old mogul — who was recently spotted outside her office in Calabasas — posted photos from a 2013 CR Fashion Book shoot.The star, who was pregnant with her firstborn child North at the time, recalled the career highlight via the app's Stories feature.She wrote alongside one image, 'My 1st fashion shoot ever with North in my belly. I gave birth a few weeks after this.'It comes one day after A-list celebrities honored the German fashion designer at the 2023 Met Gala. ",
        "In one snapshot Kim, who was dating Kanye West at the time, wore a long white coat as she chatted with Karl.The designer, who designed for fashion houses Chloe and Chanel during his career, stood next to Kim in his signature black blazer and fingerless gloves.His white-gray hair was pulled back into a small ponytail and he wore dark sunglasses.In another outtake Kardashian, who hadn't yet built her empire, was dressed in black pajamas as she posed on a bed with black sheets.She looked stunning in the satin pants set and a matching bra, exposing her burgeoning baby bump.In the behind-the-scenes shots Kim was doted on by a glam squad on the set, which was in Paris.In another photo from the shoot, Kim donned an oversized cream turtleneck sweater as she lay on a white bed. ",
        "And the mother-of-four also shared an image of Lagerfeld with her mom Kris Jenner, who at the time stole the spotlight from her daughter during her big day. ",
        "Speaking to The Cut, a subset of New York Magazine, in 2019, the former E! personality recalled how upset she was with Jenner at the time.The Keeping Up With the Kardashians alum was excited about her first photoshoot with the fashion designer and had been tipped off by friends that he usually gifted his models with a special accessory.However, Kim was horrified when her mother turned up to their meeting and struck up an instant bond with the Chanel legend.She detailed the situation as she said, 'I go to Paris. My mom comes with me. I sit there; I wait. I do the fitting...''I had told one of my girlfriends that I'm doing this with Karl, and she's like, \"Oh my God, he's going to give you a bag. He gives everyone of his models, especially on their first shoot, a bag.\"'Halfway through the shoot, my mom walks in and she's wearing Chanel leggings, Chanel thigh-high boots, blazer, turtleneck, dangling earrings, Chanel cuffs, gloves, sunglasses, beret: She was decked in Chanel from the '80s.'Karl stops the shoot and walks over to her and is like, \"Oh my God, are you her mother? I remember this jacket! I remember these gloves! I did those earrings!\"",
        "'The two of them have this love affair like I've never seen before.'",
        "Kim recalled feeling 'embarrassed' that her mom had stolen her special moment.She continued: 'I'm like, This is so embarrassing, and this is so annoying. I remember texting my sisters and being like, 'Guys, mom is stealing my shiiiine. This is my first fashion shoot!''So then the shoot's over, and he comes out with something behind his back. And I'm like: \"THE BAAAAAG. IT'S HEEEERRE. OH MY GOD.\"'I'm thinking: I will cherish this forever, and I'm pregnant, so one day I'll give this bag to my daughter.'Then he comes up and he's like, \"Kim, this was the best shoot. Thank you so much. But Kris, here is a bag for you,\" and he gives the f***ing bag to my mom. And it was a LEGO clutch.'She explained: 'They were like ten grand, and you could never get one. And this was all Swarovski crystal with hand stones that was just a sample that never made it to production.'",
        "Kim said she cried afterwards as she felt Kris had taken over her day.She added: 'So I go into the bathroom and start crying. I was like, \"Oh my God, she fully stole my life. She stole my whole day today! This was my biggest moment ever in fashion, with Carine, Riccardo, and Karl!\"'",
        "And Kim - who has North, nine, Saint, 7, Chicago, 5, and Psalm, 3, with ex-husband Kanye - regularly reminds Kris to leave the bag to her oldest daughter when she dies.She said: 'To this day, she has the bag in her closet. And I've said to her: \"Just so we're clear, in your will, this goes to North.\" I don't need it. That bag was for my daughter.'"
    ]
}