{
    "articleURL": "/sport/football/article-12056285/Former-Spurs-star-Ramon-Vega-SLAMS-Tottenham-Hotspur-Stadium-visit-Crystal-Palace-win.html",
    "content": [
        "Ramon Vega attended Tottenham's 1-0 win over Crystal Palace on SaturdayFormer Spurs defender tweeted to voice his discontent with the club's stadiumVega made 84 appearances in all competitions for Spurs between 1997 and 2001Ramon Vega has criticised the Tottenham Hotspur Stadium after attending Spurs' 1-0 over Crystal Palace.",
        "Harry Kane netted his 209th Premier League goal on the brink of half-time on Saturday, to give the club their first Premier League win since the start of April.However, despite his former club emerging victorious in the London derby, the former defender took to social media after the game to voice his discontent with the £1billion Tottenham Hotspur Stadium.'It was great to visit my ex-Club @SpursOfficial,' Vega wrote on Twitter.'But I still prefer the old stadium White Hart Lane much better atmosphere, it felt cold and disconnected.'",
        "Built on the site of their former ground, Spurs moved into their new 62,580 stadium in 2019, following 118 years at White Hart lane.In addition to hosting the club's home games, the Tottenham Hotspur Stadium's state-of-the art facilities has made it a go-to venue for sports and entertainment.Since opening in 2019, the stadium has hosted Anthony Joshua's first clash with Oleksandr Usyk, games from the NFL International Series and concerts from the likes of Lady Gaga and Beyonce.Vega spent three seasons in North London after joining the club for a fee of £3.75million in 1997.The Swiss international was part of George Graham's side that won the League cup in 1997, making a crucial tackle with his side 1-0 up in the final against Leicester City to deny the Foxes an equaliser.",
        "Since hanging up his boots the 51-year-old has embarked on a career in business and currently serves as a board adviser for Dubai-based AI software company Creed&amp;Bear."
    ]
}