{
    "articleURL": "/news/article-12050957/Pair-jailed-total-27-years-terrifying-shotgun-attack-house.html",
    "content": [
        "Aaron Giles, 29, and Kevin Chapman, 40, were found guilty of firearms offencesThey have been sentenced to a total of 27 years in prison for the horrific attack  Read more: Terrifying moment masked gunman fires shotgun at mother's house Two men who were convicted over the blasting a shotgun at a mother's house while her toddler cowered inside have been jailed for a total of 27 years. ",
        "CCTV from the night in September 2022 shows two bright flashes and a loud bang before the unidentified shooter flees the scene on foot. Accomplices Aaron Giles, 29, and Kevin Chapman, 40, were found guilty of possessing a firearm at Newcastle Crown Court in March and were sentenced to 15 years and 12 years respectively. But the man who pulled the trigger has not yet been brought to justice.The court previously heard Giles had engaged in a 'tit-for-tat' row with Ryan Carr, although the exact cause of the dispute remains unclear.",
        "Sentencing them at Newcastle Crown Court, Mr Justice Martin Spencer said: 'The gunman discharged both barrels into the front door, thereby endangering the lives of all those in the house, including Sharna Hadaway's one-year-old son.'I don't accept submissions that the damage to the inner lounge door was so slight no-one's life was endangered. Anyone in the way of that shout would be in mortal danger. Thankfully no-one was in fact hurt or killed.'There was a high risk of death or severe physical injury.'The row escalated dramatically after Giles sent a gunman to the property where Carr was living with his partner, Sharna Hadaway, and her toddler. All three were inside at the time of the shooting. ",
        "Video of the shocking incident shows the gunman approaching the property, opening the garden gate and then firing two shots from a shotgun at the house before running away.A jury found Giles and Chapman, both of South Shields, not guilty of conspiracy to murder, but guilty of possessing a firearm with intent to endanger life.Prosecutor Jamie Hill KC told the court there had been shouting outside the house leading Mr Carr and Ms Hadaway to investigate shortly before the gunman opened fire. Fortunately no-one was injured in the incident. Ms Hadaway, who was inside the house at the time, told detectives: 'Me and Ryan were talking in the kitchen and I was having a tab at the backdoor and I heard \"Ryan\".'I went out in the back garden and had a look and couldn't see anything and I went back in the house.",
        "'I said to Ryan there is shouting outside. He went to the front door and had a look and no one was there.'About five to ten minutes later there was two massive bangs to my door and my door was rattling.'She then went to inspect the damage of the door and found multiple holes, some of which were described as 'massive' and others 'tiny'.",
        "Speaking after the trial, Detective Chief Inspector Louise Jenkins, of Northumbria Police, said: 'This was an appalling incident that saw a shotgun brazenly fired at an address in South Shields. It is sheer luck that nobody was seriously injured or killed.'From the outset of this investigation, we were determined to ensure effective justice was brought against anybody found to have had any involvement in this shooting - and I am pleased that the jury have now convicted Giles and Chapman for their roles.'This outcome is only possible thanks to the outstanding work of a team of detectives and staff from across the Force who carried out a huge amount of enquiries in order to ensure both defendants had their day in court.'I would also like to thank our colleagues at the Crown Prosecution Service for their continued support.'Incidents of this nature are rare in our area, but when they do occur we take them extremely seriously and are committed to acting quickly and robustly.'Both Giles and Chapman were remanded into custody and are set to be sentenced at Newcastle Crown Court on May 5."
    ]
}