{
    "articleURL": "/femail/article-12061013/My-Daily-Horoscope-does-9-2023-hold-star-sign-Oscar-Cainer-tells-all.html",
    "content": [
        "'Life is a series of collisions with the future; it is not the sum of what we've been, but what we yearn to be.' So said Spanish philosopher Jose Ortega y Gasset, born 140 years ago today. With the Sun — representing goals and aspirations — meeting Uranus, the planet of progress, it's an apt message. Following the Eclipse, realisations about necessary change reframe visions of the future. It's time to strive to be better and bolder.",
        "Read more horoscopes from MailOnline.ARIESMar 21 - Apr 20 Life sometimes feels like a sequence of confusing developments — and more often than not, we're responsible for the confusion. We say one thing and mean another. We make a plan and do something different. And then we create complicated excuses to explain why we didn't do what we said we were going to do. Aargh! You're being pulled in so many different directions, you don't know whether you're coming or going. The Sun/Uranus link brings a moment of clarity. You'll know which path to choose to find satisfaction. Transform your life! To move forwards in a positive direction, there's good news when you call 0906 751 5601.TAURUSApr 21 - May 21 The great advantage of education is that when we learn a skill, subject or trade, that knowledge stays with us for ever. Often, though, we forget the learning process takes persistence and dedication. The University of Life is preparing you for an advanced diploma. It will open lots of doors and bring you rewards and pleasures. But, before that, there's an exam to pass. Although you feel as though you're struggling, even overwhelmed, by the issues you're dealing with, you're getting somewhere worthwhile. For advice to guide you through the twists and turns ahead, call your four-minute forecast: 0906 751 5602.",
        "GEMINIMay 22 - June 22 Imagine yourself looking into a crystal ball. If you relax your gaze, and peer into its depths, you'll be able to see two different images. The contrast between them is so distinct that one almost looks like a 'negative' of the other. So which gives a true representation of your future? You have a choice. If you go one way, things will go well. If you choose another, they might not be quite so pleasing. Which path should you take? The one that leads away from fear and towards hope. Your faith is fully justified now. How can you stay focused and happy? Your weekly forecast holds the advice you need. Call 0906 751 5603.CANCERJune 23 - July 23 Something has to change. There's no way everything can carry on in the same way for much longer. The question is how, where and when that change is going to happen. Try as hard as you like, but you can't figure out what to do to trigger the transformation. In the absence of a brilliant idea or a helpful opportunity, you just need to summon up more faith. Will a door open? Will someone make a valuable suggestion? Will a ray of light appear at the end of the tunnel? With Venus entering your sign, all these things are possible. What's the best way to move forward and ensure success? Call your four-minute weekly forecast: 0906 751 5604.",
        "LEOJuly 24 - Aug 23It would be far easier if you could be in charge all the time. You'd be able to sort out all those people who make out as though they know everything but, in truth, don't know their knees from their elbows. Some even have the nerve to act as if they know everything, which explains why so many mistakes get made. Although there's a limit to the amount you can take charge of, in at least one important area of life where you've felt sidelined, you're getting the chance to seize the reins of power and influence. There's no need to worry. All you require is some guidance. Your week-ahead forecast can help. Call 0906 751 5605.VIRGOAug 24 - Sep 23 The cosmos isn't kind or cruel. It simply is what it is … and we react, respond and interpret the events that come along in ways that suit us. We can celebrate the good and bemoan the bad, or decide that we're not capable of discerning the difference between the two, and just accept everything as part and parcel of life. The only thing we know, with certainty is that we need stamina. If we want to overcome our anxieties in our search for fulfilment, we need endurance. Luckily, you have as much strength as you need right now. What does your heart desire and how can you achieve what you really want? Call your weekly forecast: 0906 751 5606.",
        "LIBRASep 24 - Oct 23 In the days before Peppa Pig and Disney films, kids were brought up on fairy stories and legends. They heard tales of swashbuckling heroes, ingenious heroines, mythical castles and bravery in battle. These stories all shared a common theme: struggle. Life wasn't easy back then. It seems some things never change. But one other important aspect of those stories remains true. Good always triumphs over bad. As Venus, your ruler, changes signs, a happy end to a tricky situation awaits. Curious to know more? There's valuable news in your latest, in-depth, four-minute forecast. Call 0906 751 5607.",
        "SCORPIOOct 24 - Nov 22 We don't need to be told that sweeping things under the carpet is a bad idea. But that doesn't stop us from sticking problems into metaphorical dark cupboards. 'Out of sight' might feel like 'out of mind', but those problematic things don't disappear. And while we're not looking, they can grow bigger. The issue you're trying to ignore exists more in your mind than in your reality. If you're courageous enough to take a good look at it, you'll know what to do to deal with it. And that will bring a great sense of relief. Success is about attitude and timing. Your four-minute forecast shows the way to positive change. Call 0906 751 5608.",
        "SAGITTARIUSNov 23 - Dec 21 You are a confident Sagittarian, but even you suffer occasional moments of feeling inferior. This uncomfortable (but very human) sensation is especially challenging when you find yourself feeling small and uncertain just when you need to be at your most assertive. At such times, you have to stop and remind yourself of your skills and accomplishments. It might be easier to acquiesce to someone else's will today. But don't! Here comes the confidence to stand your ground and speak your truth. You've got lots to look forward to. The inspiration you need is in your four-minute forecast. Call 0906 751 5609.CAPRICORN Dec 22 - Jan 20 Are we really all created equal? Do we all arrive on planet Earth with equal opportunities, potential and resilience? Or are some people born blessed with greater quantities of these qualities? Do some of us have to work harder than others to acquire our advantages? You don't always have it easy. You know what it's like to have to fight to make your voice heard. As Venus, the planet of love, moves opposite your sign, no matter how things have been going recently, you're getting a helpful hand from a supportive sky. Knowledge is power. Find out how to take full advantage of your astrological assets. Call 0906 751 5610.",
        "AQUARIUSJan 21 - Feb 19 Why must everything be such hard work? Are we doomed to live lives filled with endless strife and struggle? You feel as if you're stuck in quicksand. The more you try to get out of a difficult situation, the harder it gets. So what can be done? Is there a way to free yourself and see a return on the energy you've invested? Actually, there is. As the Sun links with your ruler, Uranus, an idea will enable you to move onwards and upwards. Your efforts have made a difference. The finishing line is in sight. What's in the sky for you? Helpful planetary alignments! For good news, call your in-depth forecast: 0906 751 5611.PISCESFeb 20 - Mar 20 They say that 'if you don't ask, you don't get'. In reality, even if you do ask, you can't guarantee you'll get what you want, but at least you have the satisfaction of knowing you were courageous enough to ask. And if you receive a negative response, at least you have more information and can rethink your plans. Don't let pride get in the way of an important discovery today. Be bold enough to say what inspires you. Ignore your anxious misgivings. What you hear back will be of great benefit. Make the most of your opportunities. Your latest, in-depth forecast has inspiring news. Call 0906 751 5612.Calls cost 80p per minute plus your phone company's access charge. To report a phone line problem, call 0800 138 9789. Go to cainer.com and join the 5 Star Service for personalised messages, audio, video, discounts on full readings, and more! "
    ]
}