{
    "articleURL": "/sport/nba/article-12054677/Draymond-Greens-son-hilariously-calls-lie-practiced.html",
    "content": [
        "Draymond Green nearly had a triple-double vs. the Lakers in Game 2 ThursdayBut his son humbled him after the game, calling him out for an apparent fibDailyMail.com provides all the latest international sports newsFollowing the Warriors' much-needed Game 2 win over the Lakers, Draymond Green shared a hilarious moment with his son DJ, as the youngster accused his dad of lying about a story involving him.",
        "Green spoke at the podium after the 127-100 series-tying win about having his children around his basketball career when his son called him out for an apparent fib. 'Last night I was in the gym. He was here with me,' Green said, tapping his son on the head. 'They love that.' DJ made a bemused face before firing back, 'No, I wasn't!'Green cracked a smile before continuing his point.",
        "'It just pushes you way harder knowing they're watching every single thing you do.'Regardless of the story's veracity, Green made a point Thursday to show his appreciation for being able to have his kids with him at work, calling it 'special' to spend that time with them.'We miss so much times with our kids,' he said. 'And I think that's every working parent, its not just us as basketball players. You have an obligation to provide for your child.'When you're able to share these moments with them, it's special, I'll look back at some of these pictures, I'll look back at some of these interviews and moments, and you just really appreciate them. 'And I'm always thankful of the Warriors organization and the NBA as a whole because they don't have to allow our kids to be up here.'",
        "Green also spoke about the positivity that kids bring to the Warriors' setup, as teammates Steph Curry and Andrew Wiggins are also fathers.'We always talk about like kid energy in here, you bring the kid energy, it just lightens the mood. It's always so serious, and you do this over and over and over again.'And when you're just able to get the energy of children in here, it's always special. So that's something I don't take for granted.'The Warriors will face the the Lakers in Game 3 on Saturday."
    ]
}