{
    "articleURL": "/sport/football/article-12047513/Chelsea-legend-Petr-Cech-believes-Frank-Lampard-solutions-players.html",
    "content": [
        "Chelsea have failed to win any of their last nine games in all competitionsFrank Lampard has lost all six of his matches while in interim charge of the BluesBut Petr Cech still believes his former team-mate can turn the club's form aroundPetr Cech believes Chelsea can still end the season on a high but that interim boss Frank Lampard must start 'finding solutions' with his players.",
        "The Blues are on a horrific run of form, losing their last six games in all competitions, which have all taken place under Lampard's tenure as interim manager.But Chelsea are also on a run of having not won any of their last nine games, last tasting three points in a 3-1 victory at Leicester City in the middle of March. Cech though, who won four league titles with the Blues and played with Lampard for a decade before the midfielder's 2014 departure, believes his former team-mate can still end his interim spell on a high ending into the club's final five games. The goalkeeper, who has the most clean sheets in the Premier League with 202, was speaking on Wednesday night at the league's Hall of Fame event in London where he was one of the inductees and admitted it was tough seeing his former team going through a rough patch. ",
        "'It's sad to see the club as they are in the table but there is a lot of experienced players and which obviously experience difficult moments in their careers like that,' Cech said. 'I hope Frank Lampard gets with the players and they find solutions for the upcoming games. Sometimes you need just one win or one positive result to turn a corner so hopefully they achieve that.'",
        "The Blues are reeling following their 3-1 beating at London rivals Arsenal, their latest loss, on Tuesday night, where their display was largely criticised by pundits and former players.Former centre-back Frank Leboeuf described their defeat at the Emirates Stadium as 'Shameful, disgraceful, pitiful'.He added: 'I don't know if the players understand what they are doing right now. On top of dirtying the image of the club, they are dirtying their own image. What they are showing is the worst in the world of football.'You can be bad, everybody can be bad, everyone has been bad — that can happen. But when you show no character, no commitment in what you are trying to do, it shows that you are unprofessional. ",
        "'The players have shown to the world that they don't deserve the Chelsea shirt. I make a difference between club and team. The club is a big club. The team is a shambles, a shame of that club. I wanted to turn off the TV, I was that ashamed.'Meanwhile, former Blues striker Chris Sutton is concerned how Lampard's reputation could suffer given his nightmare record on his return to Stamford Bridge.Cesc Fabregas used an amusing anecdote to summarise his former club, saying: ‘When I was little, I had a coach with 11 olives and he would throw them on the table with no tactics. This is how I see Chelsea.’",
        "Chelsea are back in action when they visit relegation threatened Bournemouth on Saturday. "
    ]
}