{
    "articleURL": "/columnists/article-12052497/ANDREW-NEIL-calamity-Tories-Starmer-out.html",
    "content": [
        "Rishi Sunak is a lucky man. The Tory drubbing in Thursday’s local elections — a ‘calamity’ according to Britain’s leading psephologist John Curtice — is being squeezed out of the headlines by today’s Coronation and the festivities that will celebrate it over the rest of the weekend. By Monday, the Tory meltdown might even seem like old hat.",
        "So let’s just put on the record how bad it was. Tory spin doctors, deploying the usual tools of expectations management, averred at every opportunity in the run-up to voting that they could lose 1,000 council seats: a very bad result.In fact, their private hope was to keep losses to around 700, allowing them to claim they’d ‘done better than expected’.But, at the time of writing, it looks as if the Tories really are on track to lose around 1,000 seats, if not more. Reality has matched even their worst public expectations.The Tories have been the victims of a predictable Labour-Liberal Democrat pincer movement, people voting tactically for whatever of the two main English opposition parties was likely to defeat the Tories. Voters 1, Tory spinners 0.",
        "In truth, the local elections largely reinforce what we already know. Labour remains clear favourite to win the next general election.Lib Dems can always count on a mid-term bounce. Most voters are still scunnered, to use a good Scottish word, by the Tories’ performance in government.Who can blame them? As the worst cost-of-living crisis in living memory was brewing last summer, the governing party descended into a self-indulgent shambles of three prime ministers in almost as many months. We made Italy look like a beacon of political stability.",
        "As the Tories selfishly and recklessly played musical chairs in 10 Downing Street, plain folks struggled to cope with the highest food and energy prices ever, with which even decent pay rises could not keep pace.Their pain was made all the worse when Tory shenanigans pushed interest rates and taxes higher than they need have been to assuage the financial markets, on whose willingness to lend to us we were more dependent than ever",
        "That pain is still with us. The idea that, because Sunak has somewhat steadied the ship these past six months or so, voters were no longer minded to give the Tories a kicking was always for the fairies. Kicking the Tories is still what drives them to the polling booths, as Thursday illustrated.Yet for all the Tories’ self-inflicted indulgence and stupidities, Labour is still not a shoo-in come the next election, even after this week’s victories, which saw them collapse Tory strongholds from Medway to East Staffs, Plymouth to Stoke to Dover. For a start, to put it bluntly, Keir Starmer is no Tony Blair.Voters are not clamouring to see him in 10 Downing Street as they were Blair in 1997. They’re much keener to see the Tories out than Labour in.By late yesterday afternoon, with results still coming in, Curtice was projecting a nine point Labour lead over the Tories (35 per cent versus 26 per cent) in terms of share of the vote. This is a decent lead but, significantly, it is only half the lead Labour enjoys in the opinion polls and, crucially, it is probably not enough to give Labour an overall majority.",
        "The Lib Dems are raining on Labour’s victory parade. By picking up disillusioned voters in the Tories’ southern heartlands, as they did in Windsor and Maidenhead (Theresa May’s constituency), they are making it harder for Labour to attract enough votes for an overall majority.Suddenly, the future of British politics becomes a lot more complicated than the simple prospect of a Labour majority big and robust enough to last for five years. The risk of a hung parliament is clear, with Labour as the largest party but, perhaps, dependent on Lib Dems for a House of Commons majority. Lib Dem leader Ed Davey has not ruled out some sort of parliamentary co-operation with Labour, though he has — understandably, given what happened last time — with the Tories.The Conservatives will use the prospect of a Lib-Lab pact to bolster their southern vulnerabilities (‘vote Lib Dem, get a Labour government’). And Labour will become even more dependent on revival north of the border, where they currently have only one seat in what was once their Scottish fiefdom. An extra 15 to 20 Scottish seats (not impossible given the SNP’s present path of semi-self-destruction) could solve all Starmer’s problems when it comes to a decent working majority, even with a Lib-Dem revival in the south.",
        "But perhaps not quite. A Starmer landslide condemns the Labour Left to irrelevance for five years. A small Starmer majority, or a Labour government dependent on Lib Dem support, would give it a new lease of life. The Labour Left would return from the wilderness and demand a price for its support. As I say, without the certainty of a clear Labour majority, British politics is all the more unpredictable.",
        "Of course the Tories, battered and bruised as they deserve to be, are not entirely down and out. Sunak has brought some stability.If he can use that to get on top of inflation, which has remained stubbornly high, thereby mitigating the cost-of-living crisis, get NHS waiting lists down and, above all for his Red Wall seats, curb the small boats coming across the English Channel this summer, then he’s still in with a shout.He can proceed to get the Tory show back on the road safe in the knowledge that Boris Johnson is in no position to mount a challenge. In the aftermath of Thursday’s Tory beating, some Johnson cheerleaders were talking up their man. Outside a small hard core of Johnson diehards, nobody was listening.But if Sunak is to energise the Tory base — and that is a sine qua non for even the remote possibility of the Tories being re-elected — then he needs to feed it some red meat. That makes essential a 2024 spring budget that cuts taxes for those on average incomes, releases enterprise and promotes growth. He might even have the fiscal headroom to do it on some scale.",
        "I would then strongly advise he shelves any thoughts of calling an election until the autumn of next year. A tax-cutting budget followed by a late spring dash to the polls is bound to fail.",
        "As that wise old Tory grandee Harold Macmillan once said, it’s not enough just to cut taxes, you need to let the money ‘fructify’ in people’s pockets. So let any tax cuts fructify through the summer months before going to the country.The odds are still against the Tories. The public desire to give them a kicking is deeply embedded and may be impossible to dispel this side of an election. The party has failed to build on Johnson’s remarkable election victory in 2019, which ushered in the prospect of a new populist, centre-right coalition drawing support largely from non-metropolitan working and lower-middle class voters.Brexit made that realignment possible. The Tories, more concerned with their own infighting, have squandered it. It is hard to see Sunak as the man to pump fresh impetus into the project. It might be too late anyway.What should comfort Starmer most from Thursday’s voting is how the swing to Labour was often biggest in those areas which were strongly pro-Brexit.So the Tories can’t count on Brexit to win them the votes it did in 2019. Nor do they have Jeremy Corbyn as an ally. He was instrumental in swinging patriotic, moderate Labour voters to the Tories. Now he’s irrelevant and doesn’t scare them any more.",
        "All this explains why Sunak has a mountain to climb. But mountains can be scaled if you have the tenacity, focus and strategy required.The local elections confirm the next general election is still Starmer’s to lose. But in today’s febrile political world in which fortunes can spin on a sixpence, you can do a lot of losing in 18 months."
    ]
}