{
    "articleURL": "/wires/reuters/article-12054735/Devils-looking-series-woes-vs-Hurricanes.html",
    "content": [
        "The New Jersey Devils will need to come back from a 2-0 series deficit -- again -- if they are to advance to the Eastern Conference finals. They did it in the first round against the New York Rangers, but the Hurricanes present a different kind of challenge.",
        "The Hurricanes won the Metropolitan Division, after all, by being among the NHL's top forechecking teams, and they opened the series with a pair of dominating wins.Now the Hurricanes get a chance to put a stranglehold on their second-round Eastern Conference series when the teams shift to Newark, N.J., for Game 3 on Sunday afternoon.If Carolina can win Sunday, it can go for the sweep on Tuesday. If New Jersey wins, it will assure a return trip to Raleigh, N.C., for Game 5 on Thursday.The Hurricanes are 7-2 in a best-of-seven series when holding a two-games-to-none lead while the Devils are 2-7 when dropping the first two, including an 0-5 mark when they do not own the home ice advantage.The Rangers opened the first-round series with a pair of 5-1 road wins, but the Devils rallied back to win the series in seven by winning the next three games and winning a seventh game Monday. Aside from shifting goalies from Vitek Vanecek to Akira Schmid, New Jersey allowed two goals in its four wins and advanced to face the Hurricanes with a 4-0 win on Monday.After getting time to enjoy beating their rival in seven, the Devils gave up two goals in the first period of a 5-1 loss to Carolina in the series opener Wednesday before falling apart in the second period Friday. After an evenly played opening period, Carolina scored two of its four goals within the opening 3:58 of the second period en route to a 6-1 rout.",
        "\"Right now, five on five, they are the better team,\" Devils coach Lindy Ruff said. \"We've got to win more battles, got to be more determined. I thought we started the game really good but as the game went on, we got frustrated, made some poor decisions with the puck, gave the puck away.\"Jesperi Kotkaniemi scored twice after scoring the third goal in Game 1. He scored a power-play goal after an interference penalty by New Jersey defenseman Jonas Siegenthaler and then scored again after Jordan Martinook and Jesper Fast forced a turnover along the boards in the offensive zone.\"That's been our style all year long, which is first and foremost give them nothing, and then just be tenacious on the puck and create turnovers and send it to the net,\" Carolina's Jordan Staal said.Kotkaniemi scored before Staal, Martin Necas, Martinook and Stefan Noesen tallied. Overall, nine players have scored for the Hurricanes, who are missing Andrei Svechnikov, Teuvo Teravainen and Max Pacioretty due to injuries.\"No secret, we're missing some firepower, so where are you going to find it?\" Carolina coach Rod Brind'Amour said. \"Right now, we're getting it up and down the lineup.\"So far, New Jersey's goals are from Miles Wood and Nathan Bastian. Jack Hughes has taken six shots on goal while Nico Hischier has taken two and Jesper Bratt has taken three. The trio is a combined minus-11 for the series.",
        "\"What bothers me the most is we got outbattled again today,\" Hischier said. \"It's the playoffs. Skill doesn't mean a thing. You've got to battle hard for your opportunities.\"The Devils are also returning home after Schmid was pulled in each of the first two games. Schmid stopped 31 shots in Game 7 against the Rangers but has since allowed seven goals on 36 shots and was pulled after two periods Friday night.--Field Level Media"
    ]
}