{
    "articleURL": "/wires/afp/article-12061445/Texas-governor-orders-national-guard-border-ahead-rule-change.html",
    "content": [
        "The Republican governor of Texas on Monday ordered hundreds of National Guard soldiers to the US-Mexico border, in what he said was a bid to stem an expected surge of migration when Covid-era rules lapse this week.",
        "In an illustration of the deep political divisions in the United States over immigration, Greg Abbott lashed out at President Joe Biden for an anticipated spike in illegal immigration.\"With the ending of Title 42 on Thursday, President Biden is laying down the welcome mat to people across the entire world,\" said Abbott.\"The Texas National Guard is loading Blackhawk helicopters and C-130s and deploying specially trained soldiers for the Texas Tactical Border Force, who will be deployed to hotspots all along the border to help intercept and repel large groups of migrants trying to enter Texas illegally.\"Title 42 is the name of a set of rules imposed under then-president Donald Trump ostensibly to prevent people infected with Covid-19 from entering the country.In practice it became a crude immigration control method that allowed border guards to turn away would-be asylum-seekers without accepting their claims.After years of to-and-froing, the rules lapse on Thursday night, to be replaced by what the Biden administration says are legal pathways to asylum for those qualified and who do it properly, and strict punishments for those trying to cross the border illegally.Border towns along the 3,100-kilometer (1,900-mile) frontier are readying for what could be several thousand people trying to cross into the United States every day.",
        "The Texan cities of El Paso, Brownsville and Laredo have declared a state of emergency, as they struggle to cope with the hundreds of people -- most from Latin America, some from China, Russia and Turkey -- who are already there.In El Paso, hundreds of people including children sleep on the streets, cowering from the sun under sheets, or sleeping on cardboard, some begging for money.Migration is a wedge issue that Republican Party politicians have repeatedly use to bash their Democratic Party opponents with.The politicking is expected to intensify as America's electoral cycle spins towards next November's presidential poll."
    ]
}