{
    "articleURL": "/wires/aap/article-12038607/Greens-call-rent-freeze-housing-ministers-gather.html",
    "content": [
        "Voters are keen to see measures which start tackling the housing crisis in the upcoming federal budget and the Greens are pushing for reforms to prevent landlords from starting a bidding war between prospective tenants.",
        "Housing Minister Julie Collins met with her state and territory counterparts on Wednesday to discuss measures to increase affordable housing stock and take pressure off renters.The ministers - all from Labor governments except Tasmanian MP Guy Barnett - signed a letter urging federal senators to support the proposed $10 billion housing future fund.The fund is expected to deliver 30,000 social and affordable houses in the first five years.But the Greens, whose vote is crucial to the legislation passing, say this number is far exceeded by what is needed to address the housing crisis.Independent MP David Pocock has also called on the government to propose a more ambitious housing strategy.\"Delays to the passage of this important piece of legislation will put this delivery at risk, delaying Australians' access to safe and secure housing, delaying much needed investments in acute housing needs and delaying action in the midst of serious housing challenges,\" the letter said.\"States and territories welcome the Commonwealth's commitment to be a part of the solution and have been engaging extensively with the National Housing Finance and Investment Corporation to support the rapid delivery of social and affordable homes once the (fund) is operational.\"NSW Housing Minister Rose Jackson said her colleagues had agreed tenant protections needed to be strengthened across the nation.",
        "\"The private rental market is a really difficult place right now ... there's no uniformity, whether it's things like minimum standards in rentals, pets in rentals, at the moment it is very scattered,\" she told ABC TV.\"There is an understanding that it's not working, so (states) want to learn from each other and try and lift (rental) standards overall.\"Treasurer Jim Chalmers also criticised the Greens and opposition for not supporting the government's housing fund.\"What we will see in the budget is there is substantial upward pressure on rents - vacancy rates are low (and) rents are growing faster than we would like,\" he told reporters in Canberra on Wednesday.\"It beggars belief that with a $10 billion fund on the table, the Greens, the Liberals and the Nationals are indicating they want to vote against that.\"Opposition finance spokeswoman Jane Hume said any housing plan from the government must not increase inflation.She also urged the government to align housing and infrastructure plans with immigration measures to ensure existing pressures were not made worse.\"Infrastructure is being cut. Having an increased migration intake but a decreased amount of infrastructure to support that migration on top of the housing crisis, that's a recipe for disaster,\" she told AAP."
    ]
}