{
    "articleURL": "/wires/ap/article-12044423/Wyoming-mayor-Sorry-fiery-abortion-clinic-Facebook-post.html",
    "content": [
        "CHEYENNE, Wyo. (AP) - A new abortion clinic in deeply conservative Wyoming is stirring strong emotions, with the mayor of the state's second-biggest city apologizing for a Facebook post some said evoked an arson attack that delayed the clinic's opening by almost a year.",
        "The post was intended to suggest hellfire, not violence, Casper Mayor Bruce Knell said in a long and at times tearful statement in which he apologized to the city's residents.\"In poor taste, I made a comment that I feel was misinterpreted. I did not put a picture of a burning building. I didn´t do that. I put a picture of a guy dancing in a fire because in my religious beliefs: When you sin against God, you get to go to hell unless you repent,\" Knell said at the close of a city council meeting Tuesday where more than a dozen people spoke for and against the clinic.Wyoming lawmakers have passed a law banning abortion except in cases of rape or incest reported to police, or when the mother´s life is in danger. A state district court judge has put the ban on hold while a lawsuit against it proceeds. The state has also approved a first-in-the-nation ban on abortion pills, which is set to take effect in July.Last May, a woman broke into the Wellspring Health Access clinic in Casper and lit gasoline she stashed and splattered around the facility as it was being prepared to open, according to police.The clinic finally opened April 20 and Knell's Facebook post came in response to a news article about it posted by Oil City, a local online news outlet. Knell later told Oil City he didn´t mean to incite violence and the news outlet removed the original story and comments from Facebook, citing an unspecified policy.",
        "The mayor's post nonetheless caught attention, including from Wellspring, which had representatives and supporters at Tuesday's council meeting.\"For the mayor to post an image of fire in response to Wellspring finally opening, even if it wasn´t directly alluding to the arson, was careless and cruel. Casper deserves better,\" Holly Thompson, a member of Wellspring's board of directors, said at the meeting.Knell said people shouldn't confuse his personal views opposing abortion with his position as mayor that the new business is welcome in Casper. But he made his personal views clear at the meeting, saying he was simply \"trying to give information\" about potential peril in the afterlife.Knell also said he knew from the start the post would cause controversy.\"You don´t think for a minute when I posted that that I didn´t know I was going to get it? I knew what was coming. But I´m telling you, I am strong in my convictions. I´m OK with what I said. I just wish I would've said it a different way so that it wasn´t offensive to anybody,\" he said.The mayor would not heed calls to resign, he said to applause.The arson caused almost $300,000 in damage to the clinic. Police had no suspects until March, when tipsters responding to a higher reward in the case led them to Lorna Green.",
        "The 22-year-old Casper college student allegedly told investigators she opposed abortion and burned the clinic because it was giving her anxiety and nightmares. Green, who has been released from jail, has not yet entered a plea.She faces up to 20 years in prison and a $250,000 fine if convicted. Her attorney, Ryan Semerad, has said he looks forward to defending her in court."
    ]
}