{
    "articleURL": "/news/article-12042107/Husband-missing-Suzanne-Morphew-files-15-million-lawsuit-claiming-civil-rights-violated.html",
    "content": [
        "Barry Morphew, 55, was charged with killing his estranged wife Suzanne, who went missing in 2020 during a bike ride in Salida. Her body was never foundProsecutors dropped all charges against Morphew last year after a judge sanctioned the district attorney's office for discovery violationsMorphew is now seeking $15 million for what he says was a malicious criminal prosecution in his wife's disappearance and violated his constitutional rightsThe husband of Suzanne Morphew has filed a civil rights lawsuit seeking $15 million claiming he was wrongfully charged with the missing Colorado mom's murder.",
        "Barry Morphew, 55, was charged in May 2021 with murder of his wife Suzanne, who vanished while out on a bike ride in Salida on Mother's Day 2020. Her body has never been found.Last year, prosecutors dropped all charges against Morphew after a judge sanctioned the district attorney's office for discovery violations.Morphew filed the federal civil rights lawsuit on Tuesday against more than 20 prosecutors and law enforcement officials for 'irreparably' tarnishing his 'name and reputation' with a 'conspiracy to violate his state and federal constitutional rights.'",
        "The 185-page complaint claims that the authorities conspired to wrongly arrest Morphew, that they fabricated evidence, concealed exculpatory evidence and conducted a reckless investigation, all which led to Morphew being wrongly prosecuted.'As result of the Defendants' conduct Barry was charged, arrested, and prosecuted, and his property seized, for a crime he did not commit,' the lawsuit says. 'As result of the Defendants' conduct Barry spent five months in jail, approximately 6 more months wearing a GPS ankle monitor with severe restrictions on his movement, and almost a year defending against the criminal charges. To this date, Barry's property remains in the CCSD's possession.'The lawsuit claims that Morphew's 'name and reputation has been irreparably tarnished in Colorado and all around the country.' ",
        "Those named in the lawsuit including Chaffee County, the sheriff's office and board of commissioners, 11th Judicial District Attorney Linda Stanley and her staff, and Colorado Bureau of Investigation and FBI agents. ",
        "Last month, Morphew's attorney Iris Eytan filed a complaint against Judge Stanley and her office, accusing the prosecutors of misconduct and unethical behavior during the case.'Barry suffered the indignity of being wrongfully arrested, jailed and prosecuted for a crime he did not commit,' Eytan said in a statement Tuesday. 'We will not rest until those responsible for this miscarriage of justice are held accountable.'The complaint alleged that six prosecutors pursued 'a political agenda of locking up Mr. Morphew in response to a media frenzy that prosecutors themselves helped create' after Suzanne's disappearance. Morphew's lawyers also asked for the prosecutors to face punishment up to and including disbarment. They said a decision was made to arrest Morphew in 2021 even though DNA from an unknown male was found in Suzanne Morphew's SUV. They also cited Stanley's appearances on true crime podcasts such as 'Profiling Evil' to talk about the case.The office had opened an investigation into Stanley last year because of complaints arising from the Morphew prosecution, and the lawyers´ complaint will now become part of that investigation, attorney regulation counsel Jessica Yates said.",
        "However, another prosecutor in the office, Mark Hurlbert, who is one of those named in the complaint, said he had not seen it yet.'We will fight it vigorously because we did nothing wrong,' he said.Morphew is still considered a suspect in the case, Hurlbert said, and he added that prosecutors will keep an 'open mind' as the investigation into what happened continues.Last year, Stanley said the exclusion of the witnesses was only part of the reason she asked for the charges to be dropped. She emphasized that investigators needed more time to find Suzanne Morphew's body, saying for the first time that investigators believe her remains are in an area covered deep in snow near the couple's former home in the southern Colorado mountains.However, at a later court hearing, Hurlbert told a judge that they were wrong about being close to finding the body, KUSA-TV reported in October.Morphew's wife Suzanne was 49 years old when she vanished on Mother's Day in May 2020 from their Salida home, sparking a huge search and rescue effort.",
        "Morphew issued a series of tearful pleas for her return but soon became embroiled in the police investigation, with DailyMail.com reporting that Colorado Bureau of Investigation officials had descended on the home just three days after she went missing.",
        "He had claimed to be on a landscaping job in Broomfield, Colorado, when his wife vanished but as DailyMail.com revealed in September 2020, co-workers were suspicious of his movements and said he had left his Holiday Inn hotel room stinking of bleach.He also left a trash can filled with shredded correspondence that was later turned over to the CBI.Morphew began the legal process of having Suzanne's assets and their joint property transferred to him shortly after she vanished.In November 2020, he cast a vote for Donald Trump in her name claiming she would have done it anyway.Investigators later said Morphew had told them he did it 'just because I wanted to vote for Trump to win. I just thought, 'Give him another vote.''I figured all these other guys were cheating. I figured she (Suzanne) was going to vote for Trump anyway.'In May 2021, a year after Suzanne disappeared, Morphew was arrested and charged with her murder – despite police not having found a body.A hearing in September 2020 shredded Morphew's description of his marriage to Suzanne as being a happy and loving one, with investigators revealing she had been having a long-running affair with married dad-of-six Jeff Libler.Libler, who has never spoken about Suzanne, was due to testify at Morphew's trial and received Suzanne's final photo – a bikini selfie taken on May 9, 2020 in the garden of her $1.3m home.",
        "The court also heard how spent tranquilizer cartridges were found inside the laundry room at the Morphew home, that Morphew had scratches on his arms in the days after Suzanne's disappearance and that she had complained of his controlling behavior to her family.A series of text messages revealed how anguished Suzanne had discussed ending her marriage in conversations with friends and called Morphew 'a Jekyll and Hyde character'.Another message, sent to Morphew himself, read: 'I'm done. I could care less what you're up to and have been for years.' ",
        "His defense attorneys spent most of the hearings attempting to pick holes in the prosecution case – pointing to unknown male DNA discovered in the glove box of her car and suggesting a link to a sex offender arrested in Arizona.Morphew's case was then scheduled for a full trial beginning May 1 but it was dramatically halted a week before it was due to start when prosecutors announced they were tossing the case.The move came after the judge due to preside over the trial banned the prosecution from using a series of witnesses on the grounds of discovery violations, while police said they were close to finding Suzanne's remains and were waiting for the snow to melt.  The case was then dismissed without prejudice, despite objections from the defense, which means it could still be re-filed should new evidence come to light.",
        "Suzanne Morphew's body has still not been found despite the snow having melted. "
    ]
}