{
    "articleURL": "/sciencetech/article-12042239/Why-bubbles-Champagne-fizz-straight-line-beer-not.html",
    "content": [
        "Scientists blew gas bubbles through champagne, beer and other drinksThey found that adding a 'surfactant' molecule made them rise in a straight lineProteins in Champagne act as a surfactant, keeping its bubble chains stable When enjoying a glass of Champagne, most of us are only concerned that the direction the bubbles are going in is down our throats.",
        "Scientists from Brown University, however, couldn't stop wondering why they go straight upwards, while those in other carbonated drinks do not. To work it out, they poured out containers of Champagne, beer, sparkling water and sparkling wine, and pumped in gas at the bottom.They then altered the bubble size and added different ingredients to the drinks, all the while noting down how the bubbles were affected. It was found that larger bubbles and the addition of special proteins in Champagne stabilise the bubble chains, allowing them to rise in a straight line.",
        "'This is the type of research that I've been working out for years,' said the study's senior author Professor Roberto Zenit. ",
        "Champagne contains proteins that act as 'surfactant' molecules, which can stabilise bubbles and allow them to rise in a straight line.Surfactants have two ends - one that is attracted to water (hydrophilic) and the other that is repelled by water (hydrophobic). When gas is blown into a liquid which contains surfactants, the molecules align themselves at the surface of the bubble it forms.The hydrophilic end remains in the liquid, and the hydrophobic end pokes into the gas, creating a barrier between the two.This stabilises the bubble by reducing the surface tension and preventing it from popping and helping it rise smoothly.",
        "'Most people have never seen an ocean seep or an aeration tank but most of them have had a soda, a beer or a glass of Champagne. 'By talking about Champagne and beer, our master plan is to make people understand that fluid mechanics is important in their daily lives.'Fizzy drinks have bubbles due to the dissolved carbon dioxide gas in the liquid. This is added to create a fizzy texture, enhance the flavour and, sometimes, preserve the shelf life by inhibiting bacterial growth.When the drink is opened, the pressure is released, causing the carbon dioxide to come out of the solution in the form of bubbles. The bubbles rise to the surface one after the other, forming a chain with a direction that depends on the individual beverage's fluid dynamics.In Champagne and sparkling wine, the gas bubbles rise in a single-file line that goes straight upwards, and is what's known as a 'stable' bubble chain.In beer, sparkling water and other carbonated drinks, however, the bubbles can veer off to the side as they come up in an 'unstable' bubble chain.An unstable chain makes it look as though they are not in a chain at all, and that multiple bubbles are rising at once.For their study, published today in Physical Review Fluids, the researchers wanted to see what elements affected bubble chain stability.",
        "Bubbles in sparkling water always form unstable chains - where they do not follow each other in a straight line - because it does not contain any surfactant molecules.This means that they are not protected from the wake left by the bubble that came before them in their chain.The wake knocks them out of line and causes them to veer off to the side.",
        "Firstly, they poured out a drink - either Pellegrino sparkling water, Tecate beer, Charles de Cazanove champagne or a Spanish-style brut - into a rectangular container.They then inserted a needle into the bottom through which they pumped a steady stream of air to create a bubble chain.The researchers then gradually changed the bubbles size by increasing or decreasing the air flow, and studied its impact on the chain.They also added a special sort of molecule called a 'surfactant' which are known to help stabilise bubbles.They do this because they have two ends - one that is attracted to water (hydrophilic) and the other that is repelled by water (hydrophobic). When gas is blown into a liquid which contains surfactants, the molecules align themselves at the surface of the bubble it forms.The hydrophilic end remains in the liquid, and the hydrophobic end pokes into the gas, creating a barrier between the two.",
        "This stabilises the bubble by reducing the surface tension and preventing it from popping and - in a carbonated drink - helping it rise smoothly.The researchers found that larger bubbles form more stable bubble chains, even without any surfactant present.This explains why the bubbles form unstable chains in most carbonated drinks, because they tend to have smaller bubbles.The addition of surfactant molecules also created stable bubble chains, because they stop them from being knocked out of line by the wake of the bubble in front.This is thought to be the main reason why Champagne bubbles rise in a straight line - the proteins inside it act as surfactants.",
        "'The theory is that in Champagne these contaminants that act as surfactants are the good stuff,' said Professor Zenit. 'These protein molecules that give flavour and uniqueness to the liquid are what makes the bubbles chains they produce stable.'It is also why, despite their small size, bubbles in some beer varieties rise in straight and stable chains - they too contain some proteins that act as surfactants.Bubbles in sparkling water always form unstable chains, because it does not contain any surfactant proteins to protect the bubbles from each other's wakes.'This wake, this velocity disturbance, causes the bubbles to be knocked out,' said Professor Zenit. ",
        "'Instead of having one line, the bubbles end up going up in more of a cone.'After the physical experiments, the researchers also created computer simulations of the bubbles in each drink.This told them how much of the surfactants go into the gas bubbles, the weight of the bubbles and their velocity.They hope that their findings will help those designing aeration tanks and other bubble-induced mixing technologies.An improved understanding of bubble flows may also help explain ocean seeps, where methane and carbon dioxide emerges from the seabed.Professor Zenit said: 'We're interested in how these bubbles move and their relationship to industrial applications and in nature.'",
        "Pulling off the perfect pint can take a little practice, with beer drinkers often turning their nose up at foamy heads.But this may soon be a thing of the past, as scientists have unveiled a new can design that could solve the froth problem once and for all.Japanese firm Nendo claims the so-called 'golden ratio' of beer to foam can be achieved using its newly designed product. At a glance, it may look just like an ordinary can, but the product's two pull tabs are said to make a huge difference. Nendo claims that this innovative design results in a pint with the perfect head. Read more here"
    ]
}