{
    "articleURL": "/news/article-12058911/How-King-Charles-learnt-fly-Havilland-Chipmunk-trainer-1969.html",
    "content": [
        "Coronation LIVE: Meghan Markle hikes in LA, Prince William's tribute to King Charles and Big Help Out - latest updates It was in a dayglo red trainer aircraft known as the Red Dragon that King Charles flew solo for the first time. ",
        "As the Prince of Wales, Charles made his first flight in the tandem, two-seat aircraft on January 14, 1969, before being awarded his private pilot's licence two months later and his RAF wings in August 1971. Yesterday, the 70-year-old Royal de Havilland Chipmunk WP903 took to the skies once again at the King and Country Air Show at Old Warden Airfield in Bedfordshire. Charles was a student at Cambridge University when he began his flying career, which he chose to bring to an end in 1994 after crashing the Queen's Flight - a £10million 'Whisper Jet' - while attempting to land in Scotland. ",
        "Built in 1952, the Royal Chipmunk served with the RAF Queens Flight from September 20, 1960 to June 12, 1964.The Chipmunk was also used to teach the Duke of Kent and the late Queen's cousins Prince Michael and Prince William to fly.William, older brother of the Duke of Gloucester, would die in an air crash while piloting his plane in a competition in 1972 at the age of 30.On leaving the RAF in 1974, WP903 was acquired by the Culdrose Gliding Club and served as a Glider Tug until December 1996.Since 2001, the Chipmunk has been operated by the Henlow Chipmunk Group and based out of the Old Warden Aerodrome near Bedford since 2020.",
        "Charles gained his RAF wings just five months after completing a parachute jump. According retired Squadron Leader Philip Pinney, the man who taught Charles to fly, he completed 101 sorties in the plane. His father Prince Philip was present to watch him receive his wings at RAF Cranwell in Lincolnshire.He later went supersonic, flying at 1,000mph as a co-pilot in a Phantom Intercepter.And in five years in the Royal Navy, the King flew helicopters, before both of his sons followed in his footsteps by flying the aircraft.",
        "He used to regularly take over controls of the Queen's Flight when traveling to engagements.But in June 1994, when he was trying to land on the island of Islay in the Inner Hebrides during a five-day tour of Scotland, the King's flying skills were put to the ultimate test. After taking over the controls from the flight's official pilot, Squadron Leader Graham Laurie, Charles carried too much speed amid 33mph tailwinds and three tyres burst when the plane hit the runway.Charles had to dramatically turn to avoid going onto rough land that was followed by a 14ft drop. None of the plane's 11 occupants were hurt, but the British Aerospace 146 aircraft was left with a damaged nose cone, landing gear and weather radar. ",
        "Whilst Charles insisted shortly afterwards that the near miss 'wasn't quite a crash', he quickly decided to hang up his flying gloves, and has not piloted a plane since. Responsibility for the accident was placed on the pilot, Squadron Leader Graham Laurie, even though Charles was at the controls.An official Ministry of Defence inquiry ruled that he should have taken over command of the plane when it was clear it was going too quickly to land safely, or should have told Charles to fly around the runway again to make another attempt.However, despite the reprimand and claims that his career would suffer, Squadron Leader Laurie would go on to pilot the plane that carried the body of Princess Diana back to England after she was killed in a car crash in Paris in 1997.Speaking in 2019 in Channel 5 documentary, Laurie admitted he should have gotten the King to pull up the plane and make another approach, but instead told him to land, and he 'did exactly what he was told to do.'"
    ]
}