{
    "articleURL": "/news/article-12061533/Joanna-Cherry-gives-Fringe-venue-seven-day-ultimatum-cancelled-amid-gender-row.html",
    "content": [
        "Joanna Cherry threatens legal action against comedy club for cancelling showThe Stand staff refused to work night of her show due to 'gender critical' viewsREAD MORE: JK Rowling shows support Joanna Cherry after show was cancelledJoanna Cherry has warned a comedy club it must reinstate her Festival show and apologise, or she will take it to court.",
        "The SNP Edinburgh South MP is threatening to sue The Stand, co-founded by party colleague Tommy Sheppard, for cancelling her show – a decision she claims is unlawful.A letter has been sent to The Stand by Ms Cherry's lawyers warning that if it does not back down, she will seek damages and legal fees.Some venue staff have refused to work on the night of her Fringe show.Ms Cherry believes they were reluctant due to her outspoken 'gender critical' views and opposition to the Scottish Government's attempts to reform how people can legally change gender.",
        "A statement from the venue saying that it could not run the event 'on a properly staffed, safe and legally-compliant basis', has been cited by her lawyers as potentially defamatory 'as it clearly suggests that our client represents some form of danger'.",
        "An In Conversation... talk with Ms Cherry was scheduled for August 10 as part of a series of political interviews, with other events featuring Manchester Mayor Andy Burnham and former Labour leader Jeremy Corbyn.But the venue sparked a backlash for cancelling Ms Cherry's show because many staff were 'unwilling to work on this event'.She said the cancellation was the 'thin end of the wedge' of an attack on freedom of speech.",
        "Ms Cherry said: 'The actions of The Stand and all that has followed thereon are symptomatic of a wider problem in our society.'I am very concerned that those who hold perfectly legitimate views on a variety of issues, including women like me, are regularly being misrepresented, de- platformed and, in some cases, facing damage to or loss of our livelihoods.'In the letter to The Stand, her lawyers demand an agreed statement acknowledging the club has 'acted unlawfully by discriminating against our client' and an apology with a wording agreed by the MP.She also wants 'restoration of the event' in the Scottish capital.If The Stand does not agree with the terms set out, her lawyers said they would 'pursue all legal remedies open to her in court'.",
        "Ms Cherry has pledged to donate any money she wins to a charity of her choice.",
        "An edited extract from the letter sent by Ms Cherry's lawyer, David McKie, to The Stand:Dear Sirs,It is not her [our client's] wish to litigate this matter, but she will not hesitate to do so to vindicate not only her own rights, but the vital rights of individuals to hold and express legitimate philosophical views and not to be discriminated against for so doing. She seeks a prompt and amicable resolution.Accordingly, to resolve this matter our client seeks the following:A statement and acknowledgment in agreed terms that The Stand has acted unlawfully by discriminating against our client. An accompanying apology, the terms of which would require to be agreed in advance.Restoration of the event on 10th August (or a date in the Fringe calendar in 2023 at the same venue).If you agree to these reasonable requests, our client is willing to waive any claim for damages. She is prepared to allow you 7 days to respond, failing which she has instructed us to proceed with an action in Edinburgh Sheriff Court without further reference to you.",
        "She is a critic of Scotland's gender recognition reform plans, which make it easier for people to change their legally-recognised sex.Last week, she said she felt she had been 'cancelled and no-platformed' because she was a lesbian who holds gender- critical views. But she said was 'greatly heartened' by the support she had received.Defending her 'reasonable requests' to the club, Ms Cherry added: 'I am prepared to take whatever legal action is necessary to vindicate my right not to be misrepresented and not to be discriminated against. This is not about money. My primary goal is to have the actions of The Stand acknowledged as unlawful and to ensure that the event proceeds.'I have asked the Stand to apologise to me too. If they don't agree with my reasonable requests, I intend to ask the court to decide on the issue.'David McKie, of Glasgow-based law firm Levy &amp; McRae, said it was 'the clear and unequivocal opinion' of the firm that the decision to cancel the show was 'unlawful and discriminatory'.He told the club: 'There is no defence available to you which would or could justify the decision as a matter of law.'Mr McKie added that an action would be raised in Edinburgh Sheriff Court if The Stand did not respond within seven days.",
        "Last week, the club said a number of its key operational staff, including venue management and box office personnel, were unwilling to work on the event. It added: 'We will not compel our staff to work on this event and so have concluded that the event is unable to proceed on a properly staffed, safe and legally-compliant basis.'The Stand – which was set up in 1995 by Mr Sheppard – has been approached for comment."
    ]
}