{
    "articleURL": "/news/article-12059177/Thug-dances-outside-court-avoids-jail-shaving-girlfriends-head-vandalising-home.html",
    "content": [
        "Owen James Tysoe, 32, 'lost his temper' and shouted 'you’re a wh**e' to partnerBut he was overjoyed after being handed a 12-month community order last weekA thug jumped for joy as he avoided a prison sentence for shaving his girlfriend's head and vandalising her home and car during a jealous rage.",
        "Owen James Tysoe, 32, 'lost his temper' and screamed 'you’re a wh**e, you don’t deserve to live' at his partner of three years on January 29 earlier this year.The unnamed woman woke up at 7am to find him standing over her, before he started shaving chunks out of her hair.He had accused his partner of cheating and went on to smash her bedroom TV and kick her door of its hinges.Tysoe, a former warehouse manager, also keyed 'I love **'s c**k' on the bonnet of her car and shouted 'you’re cheating ****s' during the terrifying ordeal.",
        "The woman was left with minor injuries from where she had tried to defend herself when Tysoe began shaving her head.Tysoe appeared at Northampton Crown Court on Thursday charged with assault occasioning actual bodily harm and two counts of criminal damage.But he posed for pictures and danced outside the court after avoiding a jail term.Nathalie Carter, representing Tysoe, had earlier said in mitigation that the event was 'very out-of-character' and he had 'lost his very good job as a result'.The barrister added: 'Because he was incarcerated they couldn’t hold out that long for him.' She said the incident caused Tysoe to lose his job, where he is said to have been in charge of more than 400 people. ",
        "Ms Carter continued: 'He knew the man she was having an affair with. They flaunted it in his face while his father was dying.'",
        "Passing sentence, His Honour Judge David Herbert KC told the court: 'You completely lost your temper with her.  You caused her relatively minor injuries although they were unpleasant and frightening as far as she’s concerned.' He added: 'You have a chance now. You can move on and start your new job.'Tysoe was subsequently handed a 12-month community order, including 30 rehabilitation requirement days. He was also ordered to pay £250 compensation as well as cover court costs. "
    ]
}