{
    "articleURL": "/wires/ap/article-12048283/Jackson-Ravens-excited-new-contract.html",
    "content": [
        "OWINGS MILLS, Md. (AP) - After an unusually long contract saga between him and the Baltimore Ravens, Lamar Jackson was ready to move forward.",
        "That much seemed clear after the star quarterback fielded questions for the first time since agreeing to a five-year, $260 million deal.\"I absolutely wanted to get it done. I was just tired of going back and forth about it,\" Jackson said Thursday. \"We´ve been doing it for years. The time had come. The numbers were right.\"A week after announcing the agreement, the Ravens held a news conference with Jackson, coach John Harbaugh and general manager Eric DeCosta.It was an understandably upbeat occasion after several days of excitement and relief in Baltimore.Jackson didn't offer any major details about what suddenly clicked between him and the team, but there's now plenty of optimism as the Ravens look forward to a future with one of the game's most dynamic players.",
        "\"It has been a long wait, but I think we were all in the same place all along, and we´re all in the same place going forward,\" Harbaugh said. \"Can´t wait to get to work.\"Jackson played out his rookie contract, and then the team used the franchise tag on him in March. About three weeks after that, he announced that he'd requested a trade before the team tagged him. Then a month after that announcement, he was staying in Baltimore after agreeing to the new deal.",
        "Needless to say, there's still a bit of mystery about how all that unfolded behind the scenes. When asked about the trade request, Jackson said he wanted to focus on the future. He also said he didn't really want to leave - even though the nonexclusive franchise tag allowed other teams to negotiate with him.\"Teams reached out,\" he said. \"I really didn´t care about other teams. I wanted to be here.\"Jackson said negotiations with the Ravens never really stopped. He said he dealt strictly with DeCosta, as opposed to owner Steve Bisciotti.\"The worst thing you could do in any kind of situation is just basically shut off from everything, and not engage and just give up. We didn´t want to do that,\" DeCosta said. \"I´m not going to lie to you and say every day was great. It´s been a long stretch. But we know Lamar, we know the kind of person he is.\"Jackson said he asked whether the Ravens could acquire receivers Odell Beckham Jr. and DeAndre Hopkins - they did sign Beckham - but he described that as more of a question than a demand.\"That wasn´t like, `Oh, I want them or nothing else,´\" he said. \"That´s not how you conduct business.\"Now that Baltimore has boosted its receiving group with Beckham and first-round draft pick Zay Flowers, Jackson spoke openly about the possibility of passing for 6,000 yards in a season. It was a day for the Ravens to dream big.",
        "It was also a time for Jackson to reflect on the woman he called a \"superhero\" - his mother, who is also his manager.\"Just seeing how she grinds and works without complaining. Not wanting me to get a job, telling me to focus on football and she's going to take care of everything else,\" Jackson said. \"Just seeing that - if she can do that, I can do anything. She's raising four kids on her own and not asking for a handout.\"In terms of guaranteed money, Jackson's deal fell short of the $230 million, fully guaranteed contract Deshaun Watson received from Cleveland.Still, Jackson didn't express any regret about negotiating without an agent. He said he received plenty of overtures from people interested in representing him.\"Every week it was somebody new texting me,\" he said. \"I don't know how they were getting my number.\"Now Jackson has the security of a massive long-term contract, and the Ravens have a lot more certainty at quarterback. For DeCosta, this was a day worth waiting for.\"He's a phenomenal football player, but you don't make a phenomenal football player the highest-paid player in the league,\" DeCosta said. \"You make a phenomenal football player who's also a phenomenal person the highest-paid player in the league.\"",
        "___Follow Noah Trister at https://twitter.com/noahtrister___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}