{
    "articleURL": "/wires/pa/article-12042367/Toxic-industrial-chemicals-run-water-woodland-near-landfill.html",
    "content": [
        "Toxic chemicals have been found in water spilling from a South Wales landfill through a woodland used by children and dog walkers, raising concerns about pollution to people, animals and the environment.",
        "The Ty Llwyd quarry in the village of Ynysddu, Gwent, was used in the 1960s and 70s as a dump site by the now-defunct chemicals manufacturer Monsanto.The company used it to dispose of various substances including carcinogenic polychlorinated biphenyls (PCBs), which have been shown to be toxic in humans and wildlife and are known as forever chemicals because they do not break down in the environment.Village residents have complained multiple times about a foul-smelling brown, foamy liquid flowing from the quarry after heavy rain through the woodland, which they said has been happening for at least 20 years. It frightens me and the council doesn't seem to want to take this seriously  Janine Reed, Ynysddu councillor  Testing of samples taken from water in an aeration chamber downstream from the landfill, which is designed to evaporate any hazardous substances, found a number of toxic and persistent industrial chemicals including a PCB.Six samples were taken by independent councillors for Ynysddu, Jan Jones and Janine Reed; three from a stream running from the quarry, two from the woodland’s soil and one from a pond in the aeration chamber. They were analysed in a Greenpeace laboratory.Dr David Santillo, of Greenpeace’s Science Unit, who analysed the samples, said: “Some of the chemicals that we were finding in the woodland linked back to what was in the aeration pond and these are not naturally occurring chemicals.",
        "“They could only have come from industrial sources, they’re not things that you would normally find in nature and they’re quite toxic and persistent, so once they’re in the environment they’re very hard to get rid of.",
        "“An aeration pond cannot deal with some of these persistent organic pollutants because they’re not going to evaporate over time. So if that aeration pond fills up, they will just wash off and go further down the gradient.”A scrutiny committee for Caerphilly County Borough Council (CCBC), which owns the quarry and the woodland, passed a motion on Tuesday night to back calls for a public inquiry into the contamination issues.The council has also admitted that contaminated liquid from the quarry, known as leachate, did mix with rainwater in January which washed onto public land, though it said there was no public health risk.Testing commissioned by CCBC in January at the edge of the woodland did not find any evidence of significant contamination.",
        "However, the lowest limit for PCB detection was set 10 times higher than the Environment Agency’s minimum reporting level, so any PCBs present at this level would not have registered.A CCBC spokesperson said: “In December 2022, and January of this year, there was a prolonged period of wet weather and unfortunately the systems in place did not cope, resulting in water containing leachate leaving land owned by the council.",
        "“The council is currently looking at further improvements for this system and has entered into pre-application discussions with Natural Resources Wales to determine whether there is a requirement for a water discharge consent on the site in question.”Ms Reed said: “There are people that transverse that woodland day in and day out walking their dogs, playing with their kids, having exercise. They’re not protecting those people.“Dog’s paws are walking in this. There are kids in there digging up dirt because they’re building dens and all kinds of stuff.“They’re going home, probably not washing their hands and they’re eating and drinking. It frightens me and the council doesn’t seem to want to take this seriously.”Ty Llwyd was not the only site used by Monsanto. A combination of documents published after legal cases in the US and freedom of information requests have revealed that PCB waste may be lying in dozens of unregulated landfills across England and Wales and sitting in the sediment of major estuaries.Monsanto manufactured PCBs in the UK from a plant in Newport, South Wales, filling quarries around the area with hazardous waste.Documents show they discussed transporting waste to Shropshire, Merseyside and Cumbria and detail how a large number of damaged drums containing PCBs were offloaded from a ship on Teesside.",
        "Monsanto employees also discussed PCB waste being discharged into the environment by one of their customers in Borehamwood, Hertfordshire, in the Thames catchment.Dr David Megson, an environmental chemist at Manchester Metropolitan University, said landfills “shouldn’t be a significant source of PCBs but they probably are”.The researcher added: “There is a common perception that PCB pollution is a thing of the past. It is absolutely not.“Although environmental levels have declined they are starting to plateau and this level is still way beyond the toxic threshold for wildlife.“Given that most marine mammals contain toxic levels of PCBs, and we live on an island where fish is an important food source, we should be doing everything in our power to limit their release to the environment.”"
    ]
}