{
    "articleURL": "/wires/reuters/article-12061089/SNAPSHOT-Russias-war-Ukraine-latest-Wave-attacks-cities-Victory-Day-holiday.html",
    "content": [
        "May 8 (Reuters) - Russia launched its biggest swarm of drones for months against Ukraine on the eve of Russia's May 9 holiday celebrating the defeat of Nazi Germany in 1945, striking the capital Kyiv, the Black Sea city of Odesa and shelling other cities.",
        "CONFLICT* In a new break with Moscow, Ukraine marked the anniversary on Monday, rather than Tuesday, in line with the practice of its Western allies.* Kyiv's mayor said Russia had fired 60 Iranian-made kamikaze drones, including 36 at Kyiv, all of which had been shot down. However, debris hit apartments and other buildings, injuring at least five people.* The head of Russia's mercenary Wagner group said his troops were beginning to receive ammunition needed to press their advance to capture the long-besieged eastern Ukrainian city of Bakhmut.* The General Staff of the Ukrainian Armed Forces said there had been heavy fighting in Bakhmut and surrounding areas.* More than 20 towns and villages came under shelling in central Zaporizhzhia region, the armed forces said in a statement. The southern city of Kherson and at least seven other centres in that region were also shelled, it said.* The Russian-appointed governor of Zaporizhzhia region, Yevgeny Balitsky, said around 3,000 civilians had been evacuated from areas near the front line that had come under shelling in Zaporizhzhia, one of the areas where Ukraine could launch a counteroffensive.* Reuters was unable to verify the battlefield accounts.* Operations at the Zaporizhzhia nuclear plant are being suspended in case of \"provocations\" by Ukrainian forces, TASS news agency.",
        "GRAIN DEAL* Russia has effectively stopped the Black sea grain deal, which expires on May 18, by refusing to register incoming vessels, Ukraine's reconstruction ministry said. Moscow has threatened to quit the agreement, which is meant to help ease a global food crisis.RECENT IN-DEPTH STORIES* INSIGHT-Ukraine farms lose workers to war, complicating tough harvest* ANALYSIS-Russia's mercenary boss deepens fog of Ukraine war while deflecting blame* INSIGHT-Ukraine's nuclear deal with Canada's Cameco carries big risks, rewards* ANALYSIS-Kremlin incident gives Putin cover to deepen war* COLUMN-Global ammunition race may decide Ukraine war (Compiled by Reuters editors)"
    ]
}