{
    "articleURL": "/tvshowbiz/article-12047853/Kevin-Costners-145million-beachfront-compound-highlight-newly-single-actors-property-empire.html",
    "content": [
        "Costner, 68, owns a 10-acre compound in California celebrity enclave, CarpinteriaBaumgartner, 49, a fashion designer, cited 'irreconcilable differences' in her divorce filing on Monday, May 1Both parties have requested joint custody of their three children - Cayden, 15, Hayes, 14, and Grace, 12READ MORE: Who is Kevin Costner's estranged wife Christine Baumgartner?  Kevin Costner's multimillion dollar estate has become the subject of much speculation after his wife Christine Baumgartner filed for divorce - with questions remaining as to how his assets will be split between the pair.",
        "It was revealed Tuesday that Baumgartner, 49, a fashion designer and 68-year-old Costner's second wife, had cited 'irreconcilable differences' in her divorce filing on Monday, May 1 and requested joint custody of the pair's three children.It remains to be seen what Christine will receive as part of the divorce. Both have filed for joint custody of their children and it has also been reported that the Dances With Wolves star has a pre-nuptial agreement.The jewel in the crown of Costner's property empire is undoubtedly his sprawling, lavish, 10-acre beachfront compound in celebrity favorite, Carpinteria, California - worth an estimated $145million.Costner already had a home on the beach in Carpinteria but bought a 17-acre parcel of land complete with a modest two-bedroom, two-bathroom ranch in 2006 for $28.5million - after jogging past one day and seeing a for sale sign.",
        "In 2007, he sold seven acres of the land to a neighbor, but combined his homes to create one seamless estate.The home is perched on a clifftop and boasts unrivaled ocean views. Costner originally designed a dream home with a pool and guest house but, due to family commitments and spending time at his Aspen home, he never got around to redeveloping the site.The compound comes with 500 feet of private beach, surrounded by cliffs, and Costner has built an apparent recreational house on the property which is surrounded by outdoor furniture and umbrellas. ",
        "The original parcel of land came with a polo practice field which Costner converted to a baseball field, with a longtime pal of the star telling WSJ in 2017: 'We’ve had some great baseball games there.'The home also boasts views of the Santa Barbara mountains, several islands and its own horseback riding trail. In 2017, the star put the stunning property on the market for a cool $60million.The home's listing was removed without being sold sometime later that year,In 2022, the house next to Costner's was listed for $109 million.",
        "The family's primary residence was in Ventura, California, 30 miles south of Santa Barbara. That's in addition to the 160-acre estate that Costner owns in Aspen, where the couple married in 2004. Online records show that Costner has a number of other real estate investments, including apartments in Los Angeles.Costner is said to have a net worth of around $250 million. The actor currently collects a reported $1.5 million per episode of his hit show Yellowstone.In 2022, the actor became the best paid actor on TV when his salary hit $1.5 million per episode, reports Variety.During the 1990s, Costner became one of the best paid stars in Hollywood when he received $14 million for his role in Waterworld.",
        "In 1990, Costner was paid $3 million for his part in Dances With Wolves, a year later he earned over $40 million for his role in Robin Hood: Prince of Thieves, thanks to a deal that saw him take a share of the profits.In 2014, he settled a lawsuit with the movie's producers for an undisclosed amount claiming he hadn't been paid the full 15 percent of the movie's profits.Costner is the owner of Ocean Therapy Solutions, a company that works with other businesses in environmental clean-up.The company sold equipment to BP in 2010 in the wake of the Gulf of Mexico oil spill for around $52 million.",
        "In January, it emerged that Costner was renting out his 160-acre Aspen estate in Colorado for a whopping $36,000 per night.'I could live a lot of places — I choose to live here. It’s the perfect earth pushed right up against the mountain shoved against the ocean — it’s just smashed right in here and it’s our little paradise. The town has never outgrown itself. There’s still a charm to Ventura. When you look at the hills, they’ve really held back development and I hope they continue to do that,' Costner told Visit Ventura in 2017.In the same interview, Costner spoke about wanting to build on the land.",
        "Costner and Baumgartner first began dating in 1998, having met around 1996 while Costner was filming his movie Tin Cup. The Bodyguard star said that at the time he first met her, he wasn't ready to fall in love again.Both are graduates of California State University - Fullerton. Baumgartner graduated with a degree in business.They married in 2004 in Aspen, Colorado.The reason for the long courtship was because Costner was not sure if wanted more kids. The uncertainty even led them to break up for a period prior to their engagement.'Fear kept me from marrying Christine. [She] wanted a child, but I was afraid I couldn’t be an effective father.''I woke up and thought, ‘Am I going to lose a beautiful woman who is willing to be with me to my very last breath because I am afraid to say yes to a child?' That’s all it took. Sometimes you learn the thing you’re most afraid of will save your life,' he told Closer Weekly in 2018.Costner was 'completely blindsided' by Baumgartner's decision to call it quits, according to TMZ.",
        "Although he's previously faced allegations of infidelity, a rep for Costner has insisted that the TV star remained faithful to Baumgartner throughout their marriage.It was also reported Wednesday that Costner will not be returning to his hit Pararmount+ series Yellowstone despite an unfinished fifth season.",
        "Rumored tensions between Costner and showrunner Taylor Sheridan - who a source told DailyMail.com had developed a 'God complex' - may have contributed to his abrupt exit.Baumgartner is said to not be filing for spousal support despite her husband's $250million net worth. Costner filed his response on Tuesday, and he is also seeking joint custody of their children - Cayden, 15, Hayes, 14, and Grace, 12.'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' a representative for Costner said in a statement.'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time,' it concluded. Costner's response was filed by celebrity divorce attorney Laura Wasser, who has represented the likes of reality TV star Kim Kardashian and Academy Award-winner Angelina Jolie.'Spousal support to be payable to petitioner pursuant to the terms of the parties' Premarital Agreement,' Wasser said, indicating there is a pre-nuptial agreement between Costner and Baumgartner.A representative for Costner informed Page Six on Wednesday that any allegations that the actor cheated on his spouse are 'absolutely not true.'A source who claims to be close to Costner also told the outlet that 'there was no issue of cheating at all' and that he remains 'very surprised by Christine's actions.'",
        "They continued: 'He obviously doesn't want the divorce and he would take her back. It's disappointing, he loves her and he loves his children.'The insider also stated that they 'have no idea if Kevin even knows what the reasons are' for the split.TMZ was the first to report the divorce news.The Bodyguard star was previously married to Cindy Silva from 1978 to 1994 and they share three children - Annie, 39, Lily, 36, and Joe, 35.",
        "He also shares a son Liam Costner with Bridget Rooney, who he dated after his split with Silva.Last year, RadarOnline claimed that Baumgartner was fed up with Costner's intense shooting schedule and put pressure on him to exit the Paramount+ show after season five.'It's really knocked a hole in their family life,' a source told the outlet. 'The show is such a mega-hit, producers want it to go on forever!'They continued: 'However, Christine wants her husband to hang up his cowboy hat.'She allegedly posed an ultimatum to her longtime spouse. 'She wants a firm commitment this is his last season — or he might have to hit the dusty trail!'Costner has led the cast as patriarch John Dutton since 2018 and raked in $1.5million per episode.ET reported Wednesday that Costner made the decision to depart the hit Western show - which broke records with 12.1 million viewers for its season five premiere.The second half of season five has yet to be finished, and no update has been provided on when the cast and crew are set to return to Montana to continue working on the remainder of the season.The uncertainty has led to lots of confusion and frustration, the outlet added.",
        "Kevin Costner's marriage to second wife Christine Baumgartner is coming to an end after 18 years and three children together.Baumgartner, 49, cited 'irreconcilable differences' as the reason for the shock split, which reportedly 'blindsided' the Yellowstone star, 68.And in wake of his latest failed union, DailyMail.com is taking a deep dive into the actor's colorful love life.",
        "First wife Cindy Silva",
        "In November 1994, Costner's then wife, Cindy Silva, filed for divorce after 16 years of marriage.'We have amicably resolved all issues regarding our children and financial affairs and a full marital settlement has been reached. We ask to be allowed the dignity of sorting through this more painful part of our lives in private,' a statement from the couple read in 1994. Costner and Silva met while they were both students at California State University - Fullerton.They would go on to have three children together.The pair split amid multiple reports that Costner had been having an affair with a celebrated hula dancer named Michele Amaral while he was filming his multi-million dollar flop Waterworld in Hawaii.Eventually, Silva was awarded around $80 million in the divorce settlement.In a 1995 interview, The Bodyguard star took responsibility for his role in the demise of his marriage, but did not go into detail.'A series of events conspired to happen at the same time. I know it hurt some people that I had failed in my marriage. And the marriage was my own failure,' he said.Costner said in a 1995 interview with Parade Magazine that he never even spoke to Amaral on the phone.He also listed off the other women he was supposedly linked to including Playboy model Angie Everheart and the daughter of casino magnate Steve Wynn.'It was hard on Cindy and our children. It didn't help things. The only thing it did was hurt. The collapse of my marriage was the hardest thing of all for me,' the Dances With Wolves star said.Costner went on to express his love for his first wife: 'You can put this on the record. Through all the pain, Cindy's been what I always thought she was a real lady. I still have love for Cindy.'Silva supported Costner when he was a struggling actor, taking on odd-jobs that included performing as Snow White at Disneyland.Short-lived fling Bridget Rooney",
        "Less than two years after his split from Silva, Costner had a son, Liam, with Bridget Rooney.She is heiress to the Pittsburgh Steelers, and the aunt of actresses Rooney and Kate Mara.In 1996 Rooney insisted that she was '110% sure who the father' of her child was. But Rooney still 'insisted on a paternity test' to prove paternity, according to a 2002 article from PEOPLE.That months-long affair is rumored to have cost the actor $7 million.Liam in now 27-years-old.'Mistress' Michele Amaral ",
        "Costner allegedly had an affair with a celebrated hula dancer named Michele Amaral while he was filming his multi-million dollar flop Waterworld in Hawaii. Amaral was also married as well as being a mother-of-two when she met Costner.A report at the time in the New York Daily News said that the pair met at the Mauna Lani hotel and shortly afterwards Amaral was 'spotted creeping out of his $4,500-a-day villa.According to a Departures Magazine feature, Amaral has taught hula across the world and is known as the island's premier soloist.The Daily News report said that Silva was alerted to the affair by someone who was working on Waterworld and was fired.The same article accused Costner of multiple infidelities during his marriage.At the time Costner strenuously denied the allegations saying that he was merely interviewing Amaral for a job.During an interview where Amaral was brought up, Costner became infuriated.'This woman has done nothing wrong and yet has had to share the harsh light of celebrity with me. I feel embarrassed, and I don't think there's one thing I can do to make her life better.''This woman has a name and to make her a thing is the worst part of all. It's wrong for her and her husband,' Costner said.Second wife Christine Baumgartner ",
        "Costner and second wife Baumgartner first began dating in 1998, having met around 1996 while Costner was filming his movie Tin Cup.The Bodyguard star said that at the time he first met her, he wasn't ready to fall in love again. Both are graduates of California State University - Fullerton. Baumgartner graduated with a degree in business. They married in 2004 in Aspen, Colorado, where Costner has long maintained a 160-acre ranch, known as The Dunbar. Rooms can be rented on the property for as much as $36,000 per night.The reason for the long courtship was because Costner was not sure if wanted more kids. The uncertainty even led them to break up for a period prior to their engagement.'Fear kept me from marrying Christine. [She] wanted a child, but I was afraid I couldn't be an effective father.''I woke up and thought, 'Am I going to lose a beautiful woman who is willing to be with me to my very last breath because I am afraid to say yes to a child?' That's all it took. Sometimes you learn the thing you're most afraid of will save your life,' he told Closer Weekly in 2018.Costner told the Daily Telegraph in 2011 that the reason for his four year hiatus from making movies was because of his new family.As a recently as 2020, Costner spoke glowingly about how the couple's relationship strengthened during the Covid-19 pandemic. He told People: 'Our partnership has really come into focus about what we do for each other and how we deal with our family.'",
        "In 2022, Radar Online reported that Costner was given an ultimatum from his wife. The report said that she was demanding that he quit his hit show Yellowstone due to the fact that he was gone from home so often.'The show is such a mega-hit, producers want it to go on forever! [Baumgartner] wants a firm commitment this is his last season — or he might have to!,' a source told the website.And on Tuesday, May 2, it was revealed that Baumgartner had filed for divorce after 18 years of marriage.A representative for the Yellowstone star asked for privacy  while saying that 'circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action' with Baumgartner.The couple share three children, 12, 14 and 15, and both have filed for joint custody.The family's primary residence was in Ventura, California, 30 miles south of Santa Barbara, where they also own an oceanfront mansion.The couple has a prenup, reports TMZ."
    ]
}