{
    "articleURL": "/wires/pa/article-12048209/Prince-highway-named-home-city-Minneapolis.html",
    "content": [
        "The late pop star Prince will have a highway named after him in his home state, following a vote by Minnesota lawmakers on Thursday.",
        "The senate vote was 55-5 to rename the highway that runs past Prince’s Paisley Park museum and studios.Among those watching was his oldest sister, Sharon Nelson. The Bill passed the House unanimously last month on the seventh anniversary of Prince’s death, and now goes to governor Tim Walz, who is expected to sign.Purple signs will soon go up along a seven-mile stretch of State Highway 5 in the Minneapolis suburbs of Chanhassen and Eden Prairie — designating it the Prince Rogers Nelson Memorial Highway.Prince’s friends and fans are footing the bill, said the lead sponsor, Republican senator Julia Coleman, of Waconia.“Prince was a true genius, a visionary artist who pushed the boundaries of music and cultures in ways that will never be forgotten,” Coleman told her fellow senators.“His influence can be heard in the work of countless musicians who came after him, and his legacy continues to inspire new generations of artists to this day.”Paisley Park, where Prince lived and recorded, now draws visitors from around the world.Paisley Park is also where Prince died on April 21 2016, of an accidental fentanyl overdose at age 57.The 65,000 sq ft complex in Chanhassen is now a museum run by his estate as well as an event venue and recoding studio.",
        "Sharon Nelson told reporters her brother’s music will live forever and that his spirt “sneaks up on me sometimes”. And she urged fans to take the tour and see his 3,000 shoes on display.The idea to name the highway after Prince came three years ago from Mark Webster, a long-time friend of the star who works security at Paisley Park.He was among the fans who gathered at the Minnesota Capitol to celebrate the vote. He said they will find a date that works for fans soon for the signs to go up.Prince’s birthday was June 7 but he did not celebrate birthdays because he was a Jehovah’s Witness.The singer, songwriter, arranger and instrumentalist broke through in the late 1970s and was inducted into the Rock &amp; Roll Hall of Fame in 2004.He created hits including Little Red Corvette, Let’s Go Crazy and When Doves Cry, and sold more than 100 million records worldwide.Several years ago, Prince’s 1984 Purple Rain was added by the Library of Congress for preservation in the National Film Registry.After a six-year legal battle that consumed tens of millions of dollars, the Internal Revenue Service and the estate administrator put the value of his estate at 156.4 million US dollars (£125 million).",
        "Since Prince died without a will, his six surviving siblings at the time of his death were designated as his heirs. The three youngest eventually sold most of their interests to the music company Primary Wave."
    ]
}