{
    "articleURL": "/wires/aap/article-12049831/Pandemic-leaves-medicos-burnout-pains-own.html",
    "content": [
        "Two out of three pain specialists experience severe burnout, in some cases compromising the treatment of patients.",
        "Australian social psychologist Claire Ashton-James said chronic patient pain was increasing and so too the prevalence among their specialists of burnout - a prolonged response to chronic emotional and interpersonal stressors.During the COVID-19 pandemic, burnout levels worsened.Speaking to the Faculty of Pain Medicine at the Australian and New Zealand College of Anaesthetists, Dr Ashton-James quoted a US study from 2021 which reflected Australian trends.\"Anaesthetists - specialising in airways and breathing - have the highest levels of burnout at 63 per cent, whereas sub-specialities are lower,\" she said in Sydney on Friday.\"Anaesthetists were relied on heavily to treat patients during COVID, they were at the front line.\"The costs of burnout were cognitive impairment, diagnostic inaccuracy, anxiety, low patient treatment expectations, lack of self-value, substance abuse and leaving the profession.Dr Ashton-James cited studies highlighting physicians' lack of self-worth.\"If you can't make their symptoms better, then what are you there for? I was feeling really, totally incompetent. The part of it that was challenging was the feeling of futility ... that I wasn't really contributing to anything.\"The symptoms came on insidiously, Dr Ashton-James said.\"It's a chronic and long-term exposure to emotional and interpersonal stress. It's not an acute episode where you know what the causes are, it's a slow burn and it gets to a point where your resources for coping get drained.",
        "\"The consequence is that you might become more irritable and hostile towards others. Or you might withdraw.\"Some doctors turned to drugs and alcohol, leaving patients in the hands of multidisciplinary team members, while private patients generally opted to change doctors.\"When patients experienced a lack of empathy they usually went elsewhere.\"Disgruntled patients could also rate doctors on social media, often destroying reputations.\"Pain specialists are rare and vital to patient outcomes and recovery,\" Dr Ashton-James said.It was a myth that burnout was caused by a large workload or physical fatigue.\"Burnout is an emotional fatigue,\" she said.\"They (pain specialists) are exposed to trauma, complexity, uncertainty, patient dissatisfaction. Anyone living with chronic pain expects a lot.\"Pressure was also exacerbated by opioid-dependent patients requesting prescriptions.Bemoaning the lack of research, Dr Ashton-James said strategies to prevent burnout included peer and group support but more was needed.\"We must raise awareness of the risks for burnout, and find a way to fend it off and help our small but mighty pain specialist workforce to thrive.\"There are 560 specialist pain medicine physicians in Australia who are fellows of the faculty, including anaesthetists.They were vital to patient outcomes and recovery, faculty dean Kieran Davis said.\"The burden of pain in the community is significant,\" Dr Davis said.",
        "\"Chronic pain affects about one in five people so it is vital that we not only work with our patients to help them manage their pain but also help educate the community about pain and how it is treated.\"Pain medicine specialists serve as consultants to other physicians and are often the principal treating physician.The spectrum of care provided by a pain medicine specialist includes coordinating rehabilitation services, counselling patients and their families, directing multi-disciplinary teams, liaising with other healthcare professionals and reviewing and adjusting medication."
    ]
}