{
    "articleURL": "/femail/article-12060935/Inside-highest-expensive-penthouse-world-250-MILLION.html",
    "content": [
        "The One Above All Else in New York City has made its mark as the tallest residential complex in the worldTo showcase its offerings, its listing agent invited YouTuber Enes Yilmazer to film a comprehensive tour Some of the highlights include a 1,500 sq ft 'grand salon' and a ballroom that can fit up to 300 people When it comes to rooms with views, this penthouse perched 1,416 ft high wins hands down. ",
        "Known as 'The One Above All Else,' the lofty seven-bedroom apartment in New York City has made its mark as the tallest residential complex in the world and the most expensive, as it is currently on the market for $250million. In a bid to showcase its offerings, the home's listing agent invited YouTuber Enes Yilmazer to film a comprehensive tour and it's clear that even he is blown away by the dizzying height of the place.The property tour guru exclaims at one point: 'We're so high up, I've never seen a view like this in my life. This unit is so quiet, its hard to believe that you have New York City below you.'",
        "Set across three floors, Enes starts his tour of the sky-high dwelling on the first level, which is accessible via two private elevators. Off the lobby there is a washroom, a media room, a formal dining room that can seat 12 people, an observatory-cum-lounge area decked out with telescopes and a smart office facing Central Park. Enes says of the observatory: 'This has to be one of my favorite rooms in the penthouse... everything about it just looks right.'However, when it comes to the grandest room in the property, he directs viewers to the 'grand salon.'This cavernous room - measuring 1,500sq ft - certainly makes for an impressive sight, with 27ft high ceilings, 'multiple seating areas,' 'curated furniture,' and 'breathtaking views.'",
        "'This is just unreal,' Enes says as he looks North towards Central Park and upstate New York through the towering floor to ceiling windows.He explains: 'You can see the entire park and the lake from Central Park looks so small from here.' To the South, the social media star points out the Statue of Liberty in the distance.  Moving on with his walk around, Enes navigates the kitchen which comes with lacquered cabinetry and an island in the center topped with quartzite countertops.",
        "Other perks of the cooking area include a wine fridge, a state-of-the-art Miele oven and cooktop, two dishwashers and a refrigerator-freezer combo cunningly disguised behind smart dark wood doors. Off the kitchen, there is a smaller dining room which Enes suggests could also be used as a family room. In terms of sleeping spaces, there are two guests suites on the first floor with their own bathrooms. To get to the next floor, Enes takes viewers to an 'incredible, structural staircase' which corkscrews the entire height of the property and connects each level.On the second floor, he reveals that there are four guest suites and the primary bedroom suite furnished with a plush king size bed. For extra convenience, the primary bedroom boasts two full marble-clad bathrooms and one of the washrooms includes a freestanding tub overlooking Central Park.",
        "Topping things off, there are two dedicated rooms for walk in closets. These are currently unfurnished so they can be fitted out to meet the owner's tastes. The top floor of the record-breaking apartment serves as a space for entertaining, with a 1,000 sq ft ballroom.The space, Enes says, is 'perfect for private dinners, runway shows, fundraisers and the list goes on.' ",
        "'You could easily have 200 to 300 people here very comfortably,' he adds.Off the ballroom there are two bathrooms and a chef's kitchen. Then, serving as the pièce de résistance, there is a 1,433sq ft terrace space with glass barriers allowing the views to take center stage. The One Above All Else is located within the 1,550 ft-high Central Park Tower. It is listed by agent Loy Carlos of real estate agency Serhant. Enes explains that the structure took almost two decades to complete, with the build costing $3 billion. In total there are 179 units in the skyscraper. There is also a residential club that owners can access with the offerings including multiple lounge spaces, an outdoor terrace complete with a pool, a screening room and a wellness center with an indoor pool. Also, on the 100th floor, there is a private ballroom residents can book out, along with a cigar lounge, wine room and private bar and restaurant with menus curated by Michelin-starred chefs. ",
        "To stop the tower from wobbling in high winds, architects installed the world's biggest and heaviest tuned mass damper on the 137th floor. This mechanical structure - weighing around 1,200 tons - helps to absorb vibrations. Currently there are 11 units still available within Central Park Tower, with the prices ranging from $6.5 million to $62.5 million. Then, The One Above All Else penthouse, with 17,545sq ft of interior space, is in a league of its own.Summing up the property, listing agent Ryan Serhant said: 'When you live above sound, when you are high enough above the concrete jungle that is New York City, there is something about the passage of time when you are in this home that I have never experienced anywhere else in the world. 'And it's not just the height, it's the volume the 30ft ceilings, the space that's been crafted to be unlike anything else. which is why we call it The One Above All Else.'"
    ]
}