{
    "articleURL": "/wires/aap/article-12060421/Cairns-hosts-Qld-sittings-regional-parliament.html",
    "content": [
        "The cost of living, youth crime and the Path to Treaty laws are among the issues facing Queensland MPs as parliament meets in the state's far north.",
        "Cairns is hosting the chamber from Tuesday to Thursday, almost four years since the previous regional sittings were held in Townsville.The Palaszczuk and shadow cabinets met on Monday, and the state government made its first budget announcement, earmarking $16 million to expand the Cairns Great Barrier Reef International Maritime College.Premier Annastacia Palaszczuk also flagged the budget to be handed down on June 13 would be \"firmly focused\" on cost-of-living relief as households struggled with higher bills and rising interest rates.The Liberal Nationals continued to criticise the government over its handling of youth crime, demanding more police and tougher laws.Among the legislation to be debated is a bill that sets out a proposed map to a treaty between Indigenous peoples and Queensland.The proposed laws tabled in February sets out a map to a treaty and would set up a truth and healing inquiry.The sittings at the Cairns Convention Centre are the sixth to be held in regional Queensland cities since 2002.The week's broader program includes events with the region's mayors, Indigenous representatives, business and community leaders, and school groups.The premier said the regional sittings were a chance to see democracy in action and to hear key issues for their area debated.\"It's also about engaging and listening to the local community in their own backyard so we can help boost the local economy and provide better infrastructure and services for them,\" Ms Palaszczuk said.",
        "Opposition Leader David Crisafulli said during their visit his team would meet residents, small-business owners, community leaders and victims of crime.\"I encourage all locals across the far north to speak up and share their experiences with youth crime, hospitals, schools and soaring cost-of-living pressures,\" he said."
    ]
}