{
    "articleURL": "/sport/mlb/article-12053001/Spectator-Phillies-Red-Sox-game-falls-Bostons-BULLPEN-shortly-pitch.html",
    "content": [
        "A man at Friday's Red Sox-Phillies game was treated by medics in Boston's penThe spectator appears to have fallen into the bullpen, but remained conscious  DailyMail.com provides all the latest international sports news Friday's Phillies game against the visiting Red Sox got off to a frightening start in Philadelphia when first responders and paramedics were called to Boston's bullpen when a fan fell from the centerfield bleachers. ",
        "According to a team statement provided to DailyMail.com, a ball was tossed to the fan from the visitor's bullpen, but landed in a flower bed abutting the fence that separates spectators from the relief pitchers below. When the fan reached to retrieve the ball, he fell down to the bullpen suffering unspecified injuries, according to the team. Fortunately, the man remained conscious as he was rushed to a Philadelphia-area hospital. Video from NBC Sports Philadelphia showed a man being removed from the bullpen on a stretcher. He appeared to be awake as he was being treated. Later, a Phillies employee was spotted cleaning blood off the concrete area where the man landed. ",
        "'It was definitely scary for a lot of us,' Boston reliever Josh Winckowski said. 'We were all pretty worried, feeling uneasy.'Winckowski said he was concerned the fan might have died from the fall. He and Boston's other relievers were able to relax a bit after they got a call saying the fan was conscious and responsive.'That meant a lot,' Winckowski said. 'Helped a bunch.'The game was restarted after a 10-minute delay. Further details about the incident remain unclear, and it is not yet known who threw the ball that ended up in the flower bed. But according to one fan account, simply falling over the fence in centerfield is no easy task. ",
        "'Anyone who has been out there in Ashburn Alley above the bullpens knows it would not be easy to fall over into the visiting pen,' read a tweet from the Phillies Bell fan account. 'You'd almost have to intentionally jump.' This is not the first time a fan has suffered an injury due to a fall at a Major League Baseball game. In 2011, a firefighter named Shannon Stone fell from a significant height while trying to haul in a home run hit by Texas Rangers slugger Josh Hamilton. Stone would ultimately pass away due to the injuries he suffered.Four years later, an Atlanta Braves fan named Gregory Murrey died after falling from the upper deck at Turner Field, the club's former stadium.Fans remained on the railing later in the game in Ashburn Alley, named after Hall of Famer and former Phillies outfielder Richie Ashburn, which has been a popular hangout spot since the ballpark opened in 2004. In addition to the railing over the bullpen, which includes a ledge to accommodate food and beverages, fans also can watch relievers closely from a seated area that also has a ledge.Some fans wondered on Friday night if they would be prohibited from watching the game from that area going forward after the fan's fall.",
        "In the initial plan for the ballpark, Phillies relievers were seated on the top part of the bullpen closest to the fans. But the visiting bullpen was switched to the top level and the home bullpen was moved below."
    ]
}