{
    "articleURL": "/news/article-12043349/Trans-woman-abused-daughter-7-videos-moved-New-Jersey-womens-prison.html",
    "content": [
        "Transgender woman Marina Volz was moved to a woman's prison in New JerseyVolz was sentenced to 25 years in prison for sexually abusing her daughter, 7She is now in the notorious Edna Mahan facility with a transgender accompliceA transgender female pedophile who filmed her seven year-old daughter being sexually abused for horrific porn videos is being housed in a New Jersey women's prison despite still having a penis, it is claimed.",
        "Marina Volz, 34, is serving her 25 year sentence at the notorious Edna Mahan Correctional Facility alongside her accomplice Ashley Romero, 30, who joined in the abuse of the girl.Volz, born a man named Matthew, is now recorded as 'female' in official prison records, with her presence at Edna Mahan said to be causing terror among biological women housed there.Shockingly, Volz is even said to want to marry Romero, so they can share a cell together, Reduxx reported, after the publication spoke to other inmates there. Volz, Romero and two others were found guilty for their roles in sexually abusing Volz's daughter in the basement of her New Jersey home as part of a scheme to create pornographic films.Volz, who ran a transgender fetish porn studio, took the youngster from her mother's home in Oregon, then brought her back to New Jersey, where she was subjected to horrific sexual abuse, the details of which are too graphic to repeat. ",
        "After their sentencing in May 2022, Reduxx reported that Romero was sent to Edna Mahan but that Volz was initially processed as a man and placed in the South Woods State Prison for men.Two months later Volz was said to have been transferred to Edna Mahan but was still recorded as being a male inmate in Department of Corrections records. ",
        "Last April two inmates in Edna Mahan fell pregnant after having consensual sex with transgender inmates. It now houses around 30 transgender prisoners and over 800 women.The prison first began accommodating transgender women in 2021, soon after a settlement following a lawsuit brought by a trans woman and the American Civil Liberties Union (ACLU) of New Jersey.Shortly after, two Edna Mahan prisoners filed a lawsuit seeking for the gender identity policy to be revoked after they were allegedly harassed by transgender prisoners.Critics of the settlement with the ACLU argue that the measure was yet another burden for a state prison that has faced reports of abuse and rape by guards throughout the last decade.   In June 2021 Governor Philip D. Murphy announced he would close the prison after the Department of Justice found it to be violating the constitutional rights of inmates by failing to protect them from sexual abuse by staff. In September, 14 guards at Edna Mahan were indicted over a raid in 2021 that left two women with serious injuries.",
        "Previously Matthew Volz, Volz was sentenced last May at Somerset County Superior Court alongside Romero, previously Adam Romero, and two others, Sean Allen, 54, and Dulcinea Gnecco, 21.Volz ran a 'family-owned transgender pornography production studio specializing in amateur, BDSM and taboo fetish content' from her Coburn Lane home in Franklin Township, according to acting prosecutor Annmarie Taggart, where she allowed her accomplices to sexually abuse her young daughter.",
        "The involvement of all four defendants was made clear in a string of group messages in which they discussed their plans to abuse Volz's child.Somerset county assistant prosecutor Brian Stack told Judge Peter Tober at sentencing that the four orchestrated a 'vortex of darkness' that 'snuffed out' the young girl, adding the group was 'incapable of redemption' and had 'not accepted full responsibility'.Tober said the crime was said 'heinous, cruel and depraved', and said the child endured abuse involving a basement cage and other implements of torture. The judge sentenced Volz and Romero to 25 years without parole, while Allen and Gnecco received 12 and five-year sentences respectively.An investigation by the Somerset County Prosecutor's Office Sex Crimes and Child Abuse Unit found Volz managed to win custody of the child in 2018, before taking her from her mother's home on the West Coast and bringing her back to New Jersey.",
        "Once in captivity, the young girl was subjected to sexual abuse and filmed on multiple electronic devices.Investigators who raided the property one night after they assumed custody of the child following an anonymous tip-off in January 2019 discovered more than 30 computers, cameras and digital storage devices containing extensive evidence of child pornography and sexual abuse.They also discovered firearms, a high-capacity magazine and cocaine, according to The Daily Voice.",
        "Anthony Cowell, Volz's public defender, confirmed the child has been adopted by relatives and added his client had relinquished all parental rights.'She will never see her child again... I can't wrap my head around what happened in this case,' he said, adding the evidence was 'some of the worst images I have ever seen in my life' according to My Central Jersey.Cowell explained Volz had no criminal record, had served in the US Army and was not deemed to be a violent sexual predator prior to the case. The judge meanwhile said it will be years before the full extent of the psychological harm endured by Volz's daughter is known, declaring the girl had 'suffered grievously' at the hands of her captors.He also stated that she herself had suffered sexual abuse in her childhood and had attempted to commit suicide on numerous occasions.",
        "All four defendants pleaded guilty in November 2021 to a range of charges including human trafficking, aggravated sexual assault, creation of child pornography and possession of child pornography, as well as charges related to possession of firearms and high-capacity magazines.Romero's lawyer insisted his client 'has her head on the right way for redemption... there is hope for her'.Allen, a US Navy veteran, said he was complicit in orchestrating the cross-country transport of a minor for the purposes of sexual gratification, and had also engaged in the sexual abuse.",
        "Gnecco meanwhile received a lesser sentence, as the judge established she had not participated in the abuse of the child.The 21-year-old acted as the child's carer and was tasked mostly with cooking and cleaning in Volz's New Jersey home, according to her lawyer Jack Venturi.She ultimately pleaded guilty to counts of endangering the welfare of a child. Acting prosecutor Taggart said the case served as an example of the importance of reporting suspicions of child abuse, arguing that without the anonymous tip-off from a concerned member of the community, Volz and her accomplices may never have been brought to justice.  Calls to the New Jersey Division of Child Protection and Permanency (NJ DCP&amp;P) Child Abuse Hotline may be made anonymously, 24 hours a day, by calling 1-877-NJ ABUSE (1-877-652-2873)."
    ]
}