{
    "articleURL": "/wires/pa/article-12038949/Hollywood-stars-join-jubilant-fans-Wrexham-enjoy-promotion-party.html",
    "content": [
        "Ryan Reynolds and Rob McElhenney joined the party as thousands of fans lined the streets to celebrate Wrexham’s return to the Football League with a trophy parade on Tuesday evening.",
        "Phil Parkinson’s side – who picked up a National League record 111 points as they edged out Notts County in a gripping title race – showed off their trophy, along with the women’s team, who have earned promotion to the Genero Adran Premier.Three open top buses slowly navigated their way around the city on a loop that started and finished outside the Racecourse Ground, cutting through a fog of red smoke from the ubiquitous flares.",
        "Hollywood stars Reynolds and McElhenney, whose takeover and £10million investment in the Red Dragons has helped transform the club’s fortunes, joined the women’s team on the second of three buses, with Parkinson alongside his staff on the third.The men’s team soaked up the adulation from the top of the first. Fans chanted ‘One more year’ at former Premier League goalkeeper Ben Foster, who came out of retirement to sign a one-year deal in September, and several of his team-mates joined in.Such is the global nature of this north Wales club these days that there were Canadian maple leafs and the American stars and stripes among the hundreds of Welsh dragons along the route, while Skid the Dachshund sported a custom-made hat.An American couple joined the hundreds of fans who set up camp in the car park of The Turf pub alongside the Racecourse Ground, having taken time out from a holiday in Ireland to experience the party laid on by a club they discovered during lockdown.",
        "“With Covid happening all around the world we heard this story and we watched them on the streaming services,” said Robin Beattie. “We fell in love with it.“We happened to be on vacation in Dublin and said, ‘Let’s hop on over’. We’re very happy to see the excitement in the town. It’s a Cinderella story. We love it.”",
        "But, while there was inevitably an international presence on the day, this was a party primarily enjoyed by the locals, those fans that Parkinson had talked about when he said earning promotion was about ending 15 years of hurt in the town.Supporters could have been forgiven for wondering what would become of their club when two Hollywood stars decided to buy it in 2021.But Reynolds and McElhenney have won them over by embracing its traditions and ensuring its identity has not fundamentally changed, even with the influx of new fans from around the world.",
        "“This is world class, fantastic,” said Wrexham native Darren Jackson. “They’ve done it the right way. It’s still the same club, but all this is brilliant.”Gareth Bale may have turned down what was a tongue-in-cheek attempt to lure him off the golf course, but Reynolds and McElhenney are serious about their plans to keep pushing this club higher and higher.",
        "Promotion to League One is the target now.If they reach their goal, there will be another parade in Wrexham this time next year."
    ]
}