{
    "articleURL": "/wires/ap/article-12055091/Andretti-Miami-awaiting-word-F1-expansion.html",
    "content": [
        "MIAMI GARDENS, Fla. (AP) - Michael Andretti is back at the Miami Grand Prix with his financial backers networking throughout the paddock in his bid to land a Formula One team.",
        "Andretti Global is one of four known applicants to submit official \"expression of interest\" documentation to the FIA, which in January created a formal process to explore expanding the grid beyond its current 10 teams. The initial deadline of April 30 was extended to May 15th.The process began after Andretti, who in 2021 failed to purchase the Sauber team, asked the FIA to expand the F1 grid so he could field an American two-car team. Andretti at last year's inaugural race in Miami went team-to-team in an unsuccessful request to have them sign a petition in support of his efforts.All but two teams have been vehemently opposed to the addition of Andretti - or expanding the grid in general - because they don't want to dilute revenue.Current F1 regulations contain provisions for up to 13 teams, and the FIA isn't expected to rule on any new applications until later this summer. The original deadline was June 30, but that was pushed back when the application deadline was extended.The four known applicants are Andretti in a venture with General Motors and Cadillac; a Craig Pollock-effort called Formula Equal that is believed to have funding from Saudi Arabia; a British-based team calling itself Hitech Grand Prix; and LKY SUNZ, a southeast Asia-backed effort.",
        "Back in Miami where Andretti was roaming the paddock, the team principals who have been so opposed to his participation conceded they ultimately don't have any influence on the process.\"First of all, we have no say in this,\" said Mercedes head Toto Wolff. \"If we´re being asked, our opinion is being asked. But we´re not part of the process of choosing a team or not.\"Wolff has steadfastly maintained that any new entrant would need to have the funds to invest heavily in order to help grow the sport.\"We´ve gone through really difficult times where Formula One wasn´t the blockbuster it is today, and therefore whoever enters the sport, I think it would be beneficial for all of us if they can really bring something new to the show,\" Wolff said. \"If it can help us to increase our audiences or if there is lots of marketing dollars that are being invested, similar to what we have done over the years.\"Red Bull and Mercedes (have invested) hundreds of millions. And if that were the case, I think we need to be all open-minded and say how can we contribute to making that happen? I would very much hope that we find someone, if we decided to go for another team, that somebody can really leverage what we have today and make it even greater.\"",
        "Red Bull team principal Christian Horner wondered if many of the current F1 venues can even accommodate more teams, as well as the general concern about sharing the existing prize money.\"The issues remain the same as 12 months ago: What is the incentive for an existing team or franchise to accept an 11th entrant, and then ultimately, who pays? If it dilutes the income of the (current) 10, it´s like turkeys voting for Christmas. Why would they do that?\"\"Are (commercial rights holder) Liberty Media prepared to pay and fund an 11th team, are the FIA prepared to reduce their fees to help accommodate it? There are all the financial aspects, but beyond that, if you look at the pit lane here, or somewhere like Monaco or Zandvoort, where would we be able to accommodate an 11th team?\" Horner continued. \"Where do we put the motorhomes? Where do we put the support? Where do the trucks go? It would be an incredibly difficult thing to be accommodated with the way that the sport has currently evolved.\"McLaren head Zak Brown, an American and friend of Andretti's, has been supportive of the Andretti bid all along and was one of only two team principals to sign Andretti's petition last year. But he's in favor of expansion - not specific to Andretti - provided a team has the financial ability to be viable in F1. He cited Haas, which entered F1 in 2016, as an entrant that has established its organization.",
        "\"As long as they are additive to our sport, I´d love to see more cars on the grid. I think it´s exciting,\" said Brown. \"I remember when I started following Formula One, you had pre-qualifying, I think there were 30-31 cars trying to show up to make the show. So I think an increase in the grid of the right teams that bring the right resources and are additive to what we´re all trying to do and help grow the sport, I´m all for it.\"Really the only credible, sustainable team that I´ve seen in the last decade is (Haas). What we do need to make sure of is if someone enters that they really have the commitment and can do what it takes. In a variety of motorsports, you do see a lot of dreamers and what we don´t need is a team coming in, underestimating what it´s going to take and two years later, they´re gone.\"___https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}