{
    "articleURL": "/wires/reuters/article-12047461/Motor-racing-NASCAR-Le-Mans-entry-springboard-Button-Johnson.html",
    "content": [
        "By Alan Baldwin",
        "LONDON, May 4 (Reuters) - Former Formula One champion Jenson Button wants to drive a Hypercar at Le Mans next year and says he would be up for a full season of the world endurance championship if the right opportunity comes along.The Briton will be taking part in the 24 Hours race at the Sarthe circuit on June 10-11 this year as part of a special NASCAR entry with seven times NASCAR champion Jimmie Johnson and former Le Mans winner Mike Rockenfeller.The trio will share a modified Hendrick Motorsports Next Gen Chevrolet Camaro ZL1 stock car as a 'Garage 56' entry highlighting future technologyLe Mans, the jewel in the crown of sportscar racing, is celebrating its 100th birthday while U.S.-based NASCAR has turned 75.Johnson, 47, has never been to Le Mans while Button, 43, endured a short-lived debut in 2018 with the Russian-backed SMP team. Both drivers are keen to parlay this year's appearance into something more competitive.\"I would like to race there in a Hypercar next year: I still have the hunger, I still have the fitness, the reactions, and when you have that, why not?,\" California-based Button told reporters this week on a video call.\"I don't want to do 10 or 15 races a year. I can't, I'm too busy doing other things. But if I could find a drive that suits my needs and it's fun and enjoyable, I'm up for it.",
        "\"Endurance racing for me is fun because you get to work with great drivers, great teams and it's such an emotional rollercoaster.\"The World Endurance Championship (WEC) has seven rounds, including Le Mans, while the North American IMSA series has 11 but is nearer to home.\"I would be open to both,\" said Button.Johnson has retired as a full-time driver but still has a bucket list to work through.\"I´m running out of items, especially in a major professional setting,\" said the Californian, who was never able to race Le Mans previously due to calendar clashes with NASCAR and IndyCars.\"Although we´re not racing for a GT win or a prototype win at least I get to go over and experience the event truly being in the race,\" he told Reuters. \"And who knows, maybe next year I can land a proper ride.\"I´m open to many more, without a doubt. I love being behind the wheel and I love marquee events. Hopefully I can parlay this into something more.\"I do feel there are opportunities in LMP2 (second tier) and GT that I could pursue pretty quickly. The top division with Hypercar would be a little more of a stretch but only time will tell.\" (Reporting by Alan Baldwin, editing by Ken Ferris)"
    ]
}