{
    "articleURL": "/news/article-12038311/DNA-clothing-murdered-child-linked-suspect-30-years-later-court-hears.html",
    "content": [
        "Nikki Allan taken to disused building in Sunderland in October 1992 and beaten with a brick which shattered her skull before she was stabbed multiple timesDNA consistant neighbour David Boyd found on clothing more than 30 years onNow 55, he says result of spitting onto path below while he was on his verandaTraces of DNA found on the clothing of a seven-year-old girl who was found stabbed to death have been linked to the man accused of killing her more than 30 years ago.",
        "Neighbour David Boyd took Nikki Allan to a disused building in an area of wasteland in Sunderland in October 1992, where he beat her with a brick and shattered her skull before stabbing her multiple times until she was dead, it is claimed.Newcastle Crown Court has heard how a witness had seen a young girl, who prosecutors claim was Nikki, with a man, walking towards the area where she was killed.The woman told how the child would skip to catch up if she fell behind him as they walked.The schoolgirl's body was found inside the Old Exchange building the following day by a 16-year-old who was helping search for her. ",
        "Boyd, 55, of Stockton-on-Tees, near Middlesbrough, denies murder and is being tried by a jury.The court heard Nikki sustained 37 stab wounds including eight to the heart - as well as being struck on the head with a brick.Giving evidence from the witness stand today, forensic scientist James Chapman said examinations of four areas of Nikki's clothing found traces of DNA consistent with that of Boyd's profile.Jurors heard Nikki's front collar had been tested and an almost complete male profile was found. Mr Chapman said that when compared to Boyd's DNA, the two profiles matched.",
        "In other samples taken from Nikki's t-shirt, Boyd's profile was described as being a 'potential contributor' to DNA found there from more than one man.Mr Chapman added that the majority of DNA taken from Nikki's right hip could be predominantly traced as matching that of Boyd's.There were also traces found on one armpit area of Nikki's T-Shirt.However, jurors heard the forensic analysis could not determine when or in what circumstances the DNA had got there.",
        "The court also heard a number of swabs from Nikki's body and other items of clothing including her underwear and socks were sampled, but no DNA found could be 'meaningfully compared'.Mr Chapman told the court that advancements in scientific methods have been significant and that current practices allow for more areas of DNA in blood samples to be tested than in years gone by.He told jurors that experts can now revisit old cases where blood samples were kept by police, such as in Nikki's murder.Mr Chapman added: 'We knew the case circumstances suggested she had been hoisted or helped through the window of the derelict building where her body was eventually recovered.'We were trying to think about how someone would help her in that given the opening was some six feet high off the ground.'",
        "During several police interviews Boyd denied any involvement in the killing of Nikki and said his DNA could have been present on her clothing as a result of him spitting down onto the path below while he was on his veranda.",
        "The court heard no traces of saliva were found but it could not be ruled out that there wasn't any on her at the time.Jurors also heard there was no DNA detected on the brick used. However, Mr Chapman said this was not a surprise due to the amount of testing it had undergone.Mr Chapman said samples from hundreds of other men living in the Garths, the complex where Nikki lived, were taken, but none matched the DNA extracted from Nikki's clothes.The trial continues."
    ]
}