{
    "articleURL": "/femail/article-12051905/Princess-Beatrice-opts-low-key-look-steps-Chelsea.html",
    "content": [
        "Beatrice appeared to have enjoyed a shopping trip ahead of the CoronationRead More: The royal was spotted making the most of Soho's nightlifePrincess Beatrice was seen hitting the shops on the eve of her uncle King Charles III’s Coronation tomorrow along the aptly named King's Road in Chelsea, London.",
        "The 34-year-old royal, who is ninth-in-line to the throne, appeared to be enjoying a shopping trip.Managing to keep things comfy and stylish, the mother-of-one opted for a grey oversized sweatshirt, a loose camel boyfriend-style coat, dark grey leggings and tobacco-coloured slip-on trainers.Beatrice, who shares daughter Sienna with husband Edoardo Mapelli Mozzi, was seen clutching a paper bag that appeared to be filled with colourful garments. The royal went make-up free for the shopping trip, wearing her long red hair down and opting to forgo jewellery apart from her engagement ring that could be seen sparkling on her left hand.",
        "Meanwhile, Beatrice appeared to have gotten a head start on Coronation celebrations last night as she joined her husband and brother-in-law for an evening out in Soho.The 34-year-old royal was seen leaving Chiltern Firehouse with Edo Mapelli Mozzi, 39, and Princess Eugenie's husband Jack Brooksbank, 37.While Beatrice's younger sister Eugenie, who is heavily pregnant with her second child, didn't join in the fun, the group appeared in high spirits on the night out.The trio were joined by socialite Philip Sallon, who cheekily dressed as Beatrice's uncle King Charles in a nod to the monarch's coronation tomorrow.Sallon is renowned for his role as a nightclub promoter and impresario through the early punk and New Romantic movements and was Boy George's chief collaborator before the pair had a falling out.",
        "Mother-of-one Beatrice is expected to attend a number of official events over the weekend as the UK crowns its new Sovereign.Beatrice looked stylish in a black dress, which she paired with a sparkly black and white bomber jacket.Beatrice wore the midi dress with the shimmery blazer, as well as a smart pair of heels and black tights.",
        "Her silky strawberry blonde locks were styled in a straight blow-dry that rested on her shoulders, tucked behind her ears.She also sported a natural makeup with a dash of eyeliner and mascara to bring the focus to her blue eyes.She flashed the cameras a wide grin as she made her way into the club with her husband Edo, who was dressed in a black-jeans-white-trainers combo with a navy sleeves jacket over a crisp white shirt.Meanwhile, her brother-in-law donned a very casual pair of blue jeans which he paired with a white shirt and a green parka jacket.The trio looked happy with their time out on the town ahead of a weekend that will see them attend several events for King Charles' Coronation.Getting into the spirit of these royal festivities, socialite Philip Sallon donned his own regalia last night, donning a red and white cape with a white costume underneath and a toy crown."
    ]
}