{
    "articleURL": "/tvshowbiz/article-12044797/Cancer-free-Maria-Menounos-says-thought-pancreatic-tumor-death-sentence.html",
    "content": [
        "Maria Menounos is opening up about battling stage 2 pancreatic cancer while simultaneously anticipating the birth of her first child via surrogate.",
        "Back in January, Menounos revealed her diagnosis and eventually underwent surgery to remove a 3.9 cm tumor from her pancreas along with her spleen, a fibroid tumor and 17 lymph nodes.Luckily, the star's cancer was caught early enough to keep her from undergoing further treatment such as chemotherapy or radiation.She told PEOPLE that the health scare made her fall into despair and she intially feared she wouldn't live long enough to meet her baby daughter.'When you are met with a [potential] death sentence everything changes,' she explained.Upon learning of her diagnosis, Menounos said that she began to prepare for the worst.",
        "It had also come just before she and her husband Keven Undergaro planned to reveal their pregnancy news.Undergaro helped Menounos get through her first bout of cancer in 2017 after doctors discovered a benign brain tumor, that was later removed.But this go around, she admitted that both of them were 'really scared' about the outcome.'I was like \"How could God finally bless me with a baby and then take me before I get to meet her?\"' she recalled, before sharing, 'I guttural cried, it was so intense.'Menounos, 44, announced in February that she and her husband were expecting their first child via surrogate.'We are so overwhelmed by all the messages of love and joy we have received in the last 24 hours. It's been a long process, with a lot of ups and downs along the way,' she wrote, in part, in an Instagram post on February 8, alongside a photo that showed the excited parents holding up a baby onesie and a sign that read: 'We are having a baby!'",
        "Upon the heartbreaking health news, the journalist, television presenter and actress says she sat down with her husband and began listing the wishes she had for her child if she wasn't going to be around to see them through. The Massachusetts native admitted that she and Undergaro 'talked about it all' and 'imagined the worst,' telling him, '\"If something happens, here are the people I want her around and what I want you to do. You'll probably have to move back East to be with my dad so that she has him.\"'While being devastated by the news of the cancer diagnosis, Menounos maintains she stopped short of asking 'Why me?'She then recalled the time when her late mother was sick after a brain cancer diagnosis and her father did in fact ask that same question.'My dad would say \"why us?\" And I'd go \"Dad, why not us?\" she said of her mother's sickness that ultimately led to her passing away in 2021. 'I'm not saying \"Why me?\" because I know it's \"Why everybody?\"' she added.",
        "But in the wake of all her fears and ultimate despair, Menounos has replaced those thoughts and feelings with a healthy dose of gratitude in having a clean bill of health since surgery.And in those three months, Menounos has found the strength to incorporate her meditation practice with all the new things she has learned from her work with her Heal Squad podcast.",
        "Plus, she's added some new healing habits into her routine so she can maintain a healthy body, mind and spirit into motherhood and beyond.'I talk to my pancreas every day, I talk to all of my body organs and say \"I really love you. Thank you for handling everything,\"' she said of one of her new techniques. ",
        "The former Access Hollywood correspondent and co-host also likes to talk to her unborn child by sending voice recordings to her surrogate, who in turn plays them near her belly.'I talk to her all the time. She kicks and moves around like crazy every time,' she said of the other new practice in her life, adding, 'I'm looking forward to that whole other chapter. I'm excited.'As part of her recovery, Menounos will have to continue to get regular scans of her pancreas for the next five years.The couple's daughter , via the surrogate, is expected to arrive into their lives this summer."
    ]
}