{
    "articleURL": "/sport/football/article-12058177/Matildas-Chelsea-superstar-Sam-Kerr-suffers-injury-scare-just-weeks-World-Cup.html",
    "content": [
        "Kerr scored in Chelsea's easy 7-0 win Forced from field with injury Commentator said star is fatigued Matildas fans were left with their hearts in their mouths as superstar striker Sam Kerr went down with an injury just weeks out from a home World Cup.",
        "The Australian skipper had already netted a goal in Chelsea's 7-nil thrashing over Everton, who featured compatriot Clare Wheeler, when she was forced from the field with an apparent ankle injury. Kerr was seen hobbling shortly after she headed home and required treatment on the pitch before being able to walk off under her own power before she was replaced by Pernille Harder in the 32nd minute.Blues coach Emma Hayes provided fans of both her side and the Matildas with some good news after the game as she explained that the injury does not appear to be serious. ",
        "'Sam was sick last night,' Hayes told chelseafc.com. 'She decided to play but her calf was cramping up, so we decided to take her out.' The 29-year-old will be a crucial part of Chelsea's FA Cup final against Manchester United at a sold-out Wembley stadium next week if she's fit. 'Sam Kerr is a huge player for club and country,' commentator Samantha Miller said on the BBC.'She is the captain of the Matildas and she has spoken about how important that will be for her country. They look up to her in terms of what she brings and how she plays.'They are quite reliant on a player like her. For Chelsea, she scores a lot of their goals.",
        "'She is obviously fatigued at the moment and that is when you have to be careful because that is often when they do get injured.'",
        "Chelsea sit second on the ladder, four points behind Manchester United but with two games in hand with four matches remaining. The scare at King Power Stadium came soon after Kerr led Australia's delegation at the coronation of King Charles.   The Aussie spoke of her pride in receiving the nod, but admitted the ceremony had been 'in the back of my mind' with Chelsea still fighting to stay in the race for a WSL title. 'It will be massive and obviously it's an amazing honour,' said Kerr.'We've had so many big games recently that it's kind of been in the back of my mind and I hadn't had a chance to really think about it until it was coming up, so I'm a bit nervous.'"
    ]
}