{
    "articleURL": "/wires/aap/article-12050799/Broncos-thrash-Manly-Cobbo-hat-trick-hero-again.html",
    "content": [
        "Brisbane winger Selwyn Cobbo scored his second Magic Round hat-trick against Manly in a row to seal a comprehensive 32-6 win and send a warning to NSW ahead of the State of Origin series.",
        "Having scored a hat-trick in last year's 38-0 Magic Round victory over Manly, the speed demon's third try on Friday was a classic as he intercepted a Tom Trbojevic pass with a nonchalant juggle and raced 80m to cross for the eighth time this year.His teammate, fullback Reece Walsh, also made another compelling case for a Maroons debut.The 20-year-old set up two tries for Cobbo in the first half, one with a silky grubber and the other with a slick pass, to take the Broncos to a 20-0 halftime lead in front of 50,007 fans at Suncorp Stadium.\"He is a good young player and still learning how good he can actually be,\" Broncos coach Kevin Walters said of Cobbo.\"That right side of ours is pretty lethal and Selwyn is a part of that.\"It is up to Billy Slater and his gang (of Maroons selectors), but Selwyn wouldn't look out of place in a Queensland jumper.\"Walsh outplayed his opposite number Trbojevic, who was returning from a groin injury. The Sea Eagles custodian made little impact as the visitors bumbled their way through an error-ridden opening period.It was Manly mentor Anthony Seibold's first game against the club he coached to the wooden spoon in 2020 but his players were unable to deliver.",
        "There was drama in the hours leading up to kick-off, with Walters initially ruling himself out of attending the match after suffering flu-like symptoms.\"I thought I was done but then this afternoon I started to get a lot of energy and just wanted to be part of a great experience,\" he said.Seibold said the first half cruelled his side.\"We just gave too much of a head start,\" he said.\"In the second half we competed pretty strongly, but ultimately we couldn't get across the line.\"An anxious Walsh had vomited into a wheelie bin in the tunnel on his way onto the field and had a couple of handling errors early but his nerves soon dissipated and he notched his 11th try assist for the season as Maroons coach Billy Slater watched on.It was Walsh's resolve and willingness to put his body on the line under the high ball and in defence in the second half that would have caught Slater's eye.Brisbane hooker Billy Walters and winger Jesse Arthars both scored first-half tries.The Sea Eagles improved in the second stanza and dominated for periods but the Broncos defensive resolve was first class before they finished with a flourish.\"The six points against was probably the most pleasing thing on the night,\" Walters said.",
        "Prop Payne Haas returned from a one-week suspension and turned in a powerhouse display to underline how important he is to Brisbane's success."
    ]
}