{
    "articleURL": "/wires/ap/article-12052459/Chicago-Red-Stars-dismiss-GM-lapse-judgement.html",
    "content": [
        "CHICAGO (AP) - The general manager of the Chicago Red Stars has been fired for a \"lapse of judgement\" some four months after she was promoted into the position.",
        "Michelle Lomnicki was dismissed in advance of a report in The Athletic on Friday that said the youth soccer club Chicago Empire FC had employed Craig Harrington, who was suspended from coaching in the National Women's Soccer League for two years because of inappropriate conduct while coach of the Utah Royals.Lomnicki, who was named associate GM of the Red Stars in January 2022 before she was promoted in January, has ties to the youth team, an affiliate of the Red Stars until 2021. Her husband, Wes Lomnicki, is Empire´s sporting director.\"Yesterday the Board of the Chicago Red Stars ended Michelle Lomnicki´s employment effective immediately after learning about a lapse in judgment to not share important information with club leadership. The Board determined that it is in the best interest of the players, staff and organization to part ways at this time,\" the team's board said in a statement Friday.Lomnicki and Harrington did not respond to requests for comment by The Associated Press. The team's statement did not specify the reasons for her dismissal.Lomnicki told The Athletic in a statement that she had no role in hiring decisions for the Empire.In January, Harrington was among six people disciplined by the NWSL in the wake of a pair of investigations into misconduct across the league.",
        "Former North Carolina coach Paul Riley, former Chicago Red Stars coach Rory Dames, former Washington Spirit coach Richie Burke and former Racing Louisville coach Christy Holly were all banned from coaching in the league. Harrington and former Gotham general manager Alyse LaHue were suspended from working in the NWSL for two years, until Jan. 9, 2025.Harrington was coach of the Royals in 2020 before he was placed on leave for alleged verbal abuse. The team folded later that year.___AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}