{
    "articleURL": "/news/article-12050837/Kate-stuns-ahead-King-Charles-big-day-Buckingham-Palace-lunch.html",
    "content": [
        "Follow MailOnline's liveblog for all the latest news ahead of King Charles III's Coronation The King and the Prince and Princess of Wales thrilled royal fans at The Mall as they made a surprise appearance to greet well-wishers this afternoon, less than 24 hours before the coronation.",
        "The road leading to Buckingham Palace was cleared and royal fans eagerly lined the route, having likely figured out that they may well catch a glimpse of the new King due to the security and media presence.The King laughed when asked by a man if he was 'nervous for tomorrow' and was was heard joking to some children, 'No school? You've done very well!' William told one woman 'I love your hair bow', while Kate told another person that the occasion 'is a great moment for celebration'.People cheered and could be heard shouting 'God Save the King' as the senior figures of the monarchy arrived to shake hands with well-wishers. One woman told Charles: 'You look much younger in the flesh'  - causing him to jokingly grimace.Royal superfans who have been sleeping along the route all week were left blown away by the visit, which came just hours after a downpour soaked thousands of people camped out at The Mall, with one person telling Sky News: 'This is the happiest moment in my life.'Royal fan Joan, 70, told MailOnline that she was left in tears. She said: 'Charles stepped out of the car and walked towards us and he said 'has anybody over-nighted'? And he was shaking a few hands and I said 'yes, I did' and he looked and he could see that my hair is really sticking up, and yes I am sleeping on the pavement.",
        "'He leaned forward purposefully and shook my hand, and it was just so beautiful - I am proud of being here today. Very emotional - I burst into tears afterwards. I have been here for William's wedding, Harry's wedding, the Jubilee and now I've come for the Coronation. I wish himself and Camilla the very best. I think they're both good people. I've been here since Wednesday afternoon, sleeping here. Before I just slept on the pavement but the security people suggested I'd get a tent because it's going to rain.'The King went to one side of The Mall while William and Kate went to another to greet well-wishers. One woman told Charles 'Love you Charlie' while others passed on their congratulations to him.Kate and William posed for selfies with fans, while Kate even appeared to join one person in a video call before also speaking on another fan's phone before handing it back. ",
        "The encounter left one Royal Family enthusiast 'ecstatic' after shaking the King's hand the day before he is crowned.Alison Cowburn, 62, from Derby, who arrived in central London this morning, was in the cheering crowd during Charles' walkabout on The Mall, and shook his hand.She said: 'I said it was very nice to meet him and he said 'have you been camping?'",
        "'I said no we are just down for the day and he said 'nothing so rash as that then'.'On how she felt after the encounter, she said: 'Brilliant, so delighted. Absolutely ecstatic.'King Charles also gave a huge smile today after reading a sign made by a well-wisher which proclaimed: 'Mummy would be proud.'He spotted the heartfelt tribute this afternoon as he greeted hundreds of people who have set up camp on The Mall ahead of tomorrow's Coronation.Helen Graziano, 68, originally from Plymouth but who flew in specially from her home in Spain, brought along the sign - which features a picture of Charles on one side and one of the late Queen Elizabeth II on the other.She told MailOnline: 'I really wanted him to see it - especially after all he's been through losing his mother and the issues he's had with Harry and Meghan and the Republican protesters.'I wanted him to know that he has a core group of people who support him. As he got nearer and nearer, I managed to get his attention.'He came over and shook my hand and I asked him to please read my sign. He did so for quite a few seconds and gave a really big smile and said 'oh how wonderful'.",
        "'It was a short meeting but one that brought tears to my eyes and a memory I'll always treasure.'Ms Graziano was with friend Razika Boukhenoufa, 28, who had come all the way from Algiers in Algeria.She gushed: 'He shook my hand and I told him that I'd come from Algeria. He said 'Wow, Algeria? That's so nice.''I'm really glad I got to meet him and speak to him before his big day. It was such a thrill.'",
        "During the same walkabout, the Prince of Wales revealed the sadness he will carry with him as he sees his father crowned King.William spoke with well-wishers about his grandmother's death last year as he strolled alongside Princess Kate and King Charles in an impromptu walkabout in The Mall on the eve of the Coronation.Chatting with retired nurse Tess Hart, 69, from Leeds, he spoke of Queen Elizabeth's passing and said she would be in his thoughts.Mrs Hart told William she was in The Mall last September for her funeral.William said: 'Tomorrow will be more joyous. That day had a different mood. But I will remember the Queen tomorrow. We will miss her.'The King chatted with 84-year old Edwin Rye who was on the same spot on The Mall 70 years ago when Queen Elizabeth was crowned as sovereign.",
        "Mr Rye, a retired horticulturalist from Wendover, said: 'I told the King I was here right in the same position on The Mall for his mother's coronation and I would be right here tomorrow too. He said, 'You were actually right here?''He said he was also at his mother's coronation ' But I wasn't as old!'.American travel agent Lisa Mann, 35, from Pasadena, California, chatted with the King and said: 'I am totally starstruck!'She said: 'We shook hands, and that is incredible. I am such a royalist and I have been since I was a child from so far away from the UK.'I'm only here for three days and this has happened. I cannot believe it at this point.'William also chatted with West Ham fan John Prowse, a store manager from Marlow. The Prince told him he thought West Ham, who are in a relegation battle, would be safe from dropping out of the Premier League. Mr Prowse told him he believed the East London club needed four more points to survive the drop and the Prince told him: 'I am sure West Ham will get them'Aston Villa fan William said he was 'hopeful' his team would qualify for European football.Shop worker Haley Faulkner,49, whose grandfather Charlie was a football scout for West Ham, said: 'William was very nice and said we were very brave for camping out here.'",
        "Esther Sykes, 69, a retired caterer from Leeds said: 'William is just as beauitful as his mother Diana. He said he hoped we could stay dry.'Kate asked us about camping and said we were welcome.'Rose Southern, 66, of West Bromwich chatted with the King. The retired home help said: 'Charles asked me about me camping here and what it was like. He is such a nice, jolly person.'I could see he was thrilled by the number of people here shouting their congratulations.'Police officer Nic Blake, 38, from Salisbury was camping with friends and said: 'I talk to Kate about her interest in education. Are used to work at an outdoor learning school and she said that I should write to her and she even asked my name. She was absolutely genuine. Shebby came back to check my name.'She was thanking everyone saying what an exciting time it was for all of us.'Twin brothers Richard and John Griffin, 55, arrived at the Mall at 2pm on Friday ahead of the King's coronation. The brothers said they both grew up close to London, but John now lives in Perth, Australia, while Richard lives in south London. ",
        "Richard said he and John came out to the Mall as 'this is going to be one of those major things in the next fifty years,' with John adding the two are lifelong royal fanatics, having also camped out for the Platinum Jubilee and the Queen's funeral.The brothers came wearing suits printed with £20 notes, which they said they originally bought for a stag do.'I think the King will be pretty good because he's had a lot of practice,' Richard said.'He's very experienced,' added John, who has flown into London to see the celebrations.Earlier, the King took part a final coronation rehearsal at Westminster Abbey, where a 2,300-strong congregation, and a television audience likely to be in the tens of millions, will watch him being crowned on Saturday. As excitement ramps for Britain's first coronation in 70 years, Charles and Kate joined a lunch for VIPs at Buckingham Palace.His Majesty was joined by working royals at a special event for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence were at the event. Completing the royal contingent were the Duke and Duchess of Gloucester and the Duke of Kent. But there was no invite for Prince Andrew, who was seen driving around Windsor this lunchtime. ",
        "There were 42 attendees in total, including UK Prime Minister Rishi Sunak, Australia's republican Prime Minister Anthony Albanese, and Prime Minister of New Zealand Chris Hipkins. Charles, Queen Consort Camilla and Prince William had been at Westminster Abbey this morning for final rehearsals ahead of the Coronation tomorrow, around the time Prince Harry may have landed in the UK. His Majesty and his wife waved to crowds as he was driven down The Mall to the church for further preparations, before a run of diplomatic duties including hosting a Buckingham Palace lunch for VIPs. But the monarch looked shocked by the heavy rain as he passed thousands of people who are camped out along the route from the Abbey to the Palace including the packed Mall, dubbed Chaztonbury due to the huge numbers camped out there.",
        "Charles was joined by working royals at a special lunch for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.After today's lunch, the King, who is head of the Commonwealth, will also attend a Commonwealth Heads of Government leaders meeting and garden reception at London's Marlborough House this afternoon.Guests arrived in the white drawing room before a drinks reception in the music room followed by lunch in the blue drawing room.Mr Sunak was laughing and chatting with guests while Kate, wearing a white dress, spoke to leaders including Mr Albanese and Mr Hipkins.William, the Prince of Wales was also photographed in the back of a car being driven to the Abbey today. Meanwhile Prince Harry may have already landed in the UK for his 24-hour visit for the Coronation - leaving his wife and two children at home.The Duke of Sussex is intending to fly back to California straight after the historic ceremony ends tomorrow afternoon so he can make it back to see Archie on his fourth birthday.This morning a private jet from Van Nuys airport in California landed at Farnborough, the airport closest to Windsor Castle. Van Nuys is just an hour from Harry and Meghan's Montecito mansion, but it is not yet known if he was on board.",
        "Some 100 heads of state are descending on London for the coronation on Saturday, with representatives from 203 countries due to attend. ",
        "Japan's Crown Prince Akishino and Crown Princess Kiko were among those checking in at their London hotel this morning.On the eve of the coronation, the King and the Royal Family will host a reception for foreign royalty and other overseas dignitaries at the Palace tonight.French president Emmanuel Macron, Germany and Italy's ceremonial presidents Frank-Walter Steinmeier and Sergio Mattarella and Pakistan's prime minister Shehbaz Sharif will be among those in Westminster Abbey.Chinese vice-president Han Zheng, who presided over a civil liberties crackdown in Hong Kong, is also on the King's guest list, in a move branded 'outrageous' by Conservative MPs.Excitement for the Coronation risks being overshadowed by a furious row about China's involvement.Beijing yesterday confirmed it was sending Mr Han, accused of overseeing a brutal clampdown on freedom in Hong Kong, to attend the event tomorrow.Lord Patten, the last British governor of Hong Kong, said China's decision to nominate Mr Han to come to London for the celebration showed does not give 'two hoots' about the UK.The Daily Mail also revealed today that Chinese-made surveillance cameras banned from UK Government departments will be 'spying' on the Coronation crowds.Some 38 of the Hikvision devices have been placed across the parade route from Buckingham Palace to Trafalgar Square, sparking national security fears.",
        "Hikvision has worked closely with China's military in the past and British MPs have said its cameras have been deployed in Uighur internment camps in Xinjiang province.The US Government has banned the company from all federal agencies, and Chancellor of the Duchy of Lancaster Oliver Dowden ordered all Ministries last November to remove Hikvision cameras over security concerns.Lord Patten said the decision to send Mr Han, and the Foreign Office's offer to engage with him, reflects how China sees the UK.'It's an indication of the fact that, however much you grovel to China, however much you try to give them face, they don't give a toss about giving us face because they could have sent lots of other people,' he told BBC Radio 4's World At One programme.'There are, after all, 1.4billion of them and they chose to send the guy who's responsible for breaking their word about Hong Kong.'If it wasn't deliberate, then it shows how casually they actually treat us anyway. So, however hard we try to lean over backwards, horizontally sometimes, to accommodate their own political narrative, I don't think they really give two hoots about us.'The final preparations come as broadcaster Jonathan Dimbleby, a friend of Charles who wrote his authorised biography, said the monarch would find the Homage of the People 'abhorrent'.For the first time, those watching the coronation ceremony will be invited to make their own homage to Charles, replacing the traditional homage of peers, but some commentators have criticised the new element as divisive.Mr Dimbleby told BBC Radio 4's Today programme: 'I can think of nothing that he would find more abhorrent.'He's never wanted to be revered, he's never wanted - so as far as I know - to have anyone pay homage to him except in mock terms as a joke.'He wants, I think, to feel that people will share in the event and I don't quite know how this might have happened.'Meanwhile, those travelling across the UK on public transport are being reminded to 'mind the gap' by the King.Charles and Camilla have recorded an announcement which is being played between Friday and Monday at every railway station across the UK and all London Underground stations, industry body the Rail Delivery Group said.In the message, the King begins by telling passengers: 'My wife and I wish you and your families a wonderful coronation weekend.'Camilla then says: 'Wherever you are travelling, we hope you have a safe and pleasant journey.'The message concludes with Charles adding: 'And remember, please mind the gap.'It was recorded at Highgrove earlier this year by the audio team from Transport for London."
    ]
}