{
    "articleURL": "/wires/pa/article-12060551/Paul-Heckingbottom-hails-Sheffield-United-final-day-win-Birmingham.html",
    "content": [
        "Sheffield United boss Paul Heckingbottom said “he couldn’t be any prouder” of his players after they secured their 28th win of the season by beating Birmingham 2-1.",
        "Oli McBurnie fired the Premier League-bound Blades ahead in the 53rd minute when he headed home his 13th goal of the season before James McAtee tapped the ball into an empty net a few minutes later to double the lead.Dion Sanderson pulled one back for Blues late on but in the end it was a deserved victory for Heckingbottom’s men who will follow champions Burnley back up to the big time.Heckingbottom said: “I’m delighted the game was good and I’m pleased we won. It’s important to talk about how well everyone’s done all season, 28 wins, 91 points.“I spoke to them (the players) before the game and usually we’ll talk about the opposition, but I just wanted to thank them for this season, thank them for the last 18 months.“For the majority of us our journey started last November, and it’s taken us this long to achieve what we wanted.",
        "“There’s been some moments from a footballing point of view when I’m on the sidelines I couldn’t be prouder, they’ll know what I mean. We’ve played well but also with a presence that has sacred teams to death and that’s been really pleasing.”Blues boss John Eustace said: “I think it’s been an excellent season. It’s been very good. We were made favourites for relegation at the start of the season so to get 53 points, the highest number of points in six years, is good.",
        "“There’s lots to build on of course there is but there’s been some fantastic memories throughout the season.“I also said throughout the season there were going to be some really difficult moments which there were, but the way we stuck together and got through it was exceptional.“To get the most minutes for Under-18 players in Europe is an exceptional achievement in the toughest league in Europe.“To get the most minutes for Under-20s in the Championship is an exceptional achievement. To do that and stay in the league and be competitive in every game we play, I think we’ve done well.”Before the game, Birmingham released a statement confirming details of a takeover which will see Tom Wagner’s group assume ownership.The statement read: “After the transfer of shares Shelby Companies Limited will own 45.64% of Birmingham City PLC and all of the St. Andrews Stadium.“Shelby Companies Limited is a subsidiary of Knighthead Annuity &amp; Life Assurance Company, and managed by American financier, Tom Wagner. Both SPA’s are subject to approval from both the English Football League (EFL) and the Hong Kong Stock Exchange.“Birmingham City will remain under the control of the current Board until the relevant Owners and Directors Tests (OADT) have been approved by the EFL and after the completion of the contracts.”"
    ]
}