{
    "articleURL": "/wires/reuters/article-12052191/Athletics-Richardson-storms-100m-win-Diamond-League-Kerley-wins-200m.html",
    "content": [
        "DOHA, May 5 (Reuters) - Sha'Carri Richardson left her rivals in the dust as the American streaked to 100 metres victory in the first Diamond League meeting of the season in Doha on Friday.",
        "Richardson, who was expected to be one of the biggest draws at the Tokyo Olympics in 2021 before she accepted a one-month ban after testing positive for cannabis, set a meet record in Doha with a time of 10.76 seconds.The 23-year-old beat Jamaica's world 200 metres champion Shericka Jackson (10.85) while Briton Dina Asher-Smith was third (10.98) in a field that featured five Americans on the start line.\"I'm so blessed and thankful, I feel at peace. All I do is the best I do and I'm excited to do it,\" Richardson said.\"Like I said it before, I had to be kicked out from another 100 metres race, so I had to do my best no matter what. Peace, love and life.\"Asher Smith, who won the world 200 metres title in Doha in 2019, said she was happy with her third-placed finish.\"The whole point about my season is to race against the best and I did that tonight. I am really happy with my race, third place is a good start and the time is decent,\" she said.In the men's 200 metres, American Fred Kerley stormed to victory in lane seven, clocking 19.92 seconds, using his long strides to his advantage in the final 40 metres.",
        "The American, who won the silver in the 100 metres at the Tokyo Olympics, reeled in compatriot and Tokyo 200m silver medallist Kenneth Bednarek (20.11) who finished second while Canadian Aaron Brown (20.20) was third.\"I was comfortable, but I know I still got work to do. The most important was to win and I did,\" Kerley said.\"I was happy with the competition, it was a good one, the guys gave me a fight. Next is Japan, (I will) open up my season in the 100 (metres).\"Fellow Canadian and reigning Olympic champion Andre De Grasse was in lane eight and could only manage a sixth-placed finish despite a season best time.CHOPRA, KIPYEGON WINIndia's Neeraj Chopra and Kenya's Faith Kipyegon, reigning Olympic champions in the men's javelin and women's 1,500 metres, began their Diamond League title defences with wins in their respective events.Chopra set the tone for the competition with his very first attempt even though he showed disappointment with his throw, a world-leading 88.67 metres.The Czech Republic's Jakub Vadlejch, who won silver in Tokyo, finished second again -- four centimetres shy of Chopra's mark.The pair were the only two athletes to breach the 88 metres-mark with Grenada's Anderson Peters third (85.88).In the final event of the night, Kipyegon became the fifth athlete to set a world-leading mark when she finished the 1,500 metres in 3:58.57 to beat the Ethiopian duo of Diribe Welteji, who finished less than a second behind, and Freweyni Hailu. (Reporting by Rohith Nair in Bengaluru Editing by Toby Davis)"
    ]
}