{
    "articleURL": "/wires/ap/article-12045365/Pollock-Su-rez-homer-late-Mariners-beat-A-s-7-2-10.html",
    "content": [
        "OAKLAND, Calif. (AP) - Eugenio Suárez hit a three-run homer in the 10th inning after AJ Pollock tied the game with a solo home run in the ninth, and the Seattle Mariners defeated the Oakland Athletics 7-2 on Wednesday night.",
        "\"Not the prettiest win,\" Seattle manager Scott Servais said. \"They don´t ask how you got there as long as you get there, and we got there.\"The start was delayed 65 minutes by rain, contributing to a paltry crowd of 2,685 one night after the A's drew 2,583.With two outs in the 10th, Suárez drove a fastball from Adam Oller (1-1) over the wall in right-center field to give the Mariners their first lead. Seattle then loaded the bases and J.P. Crawford added a two-run single to make it 7-2.\"For me, (what´s) more important is that I helped the team win a game and now we won the series,\" Suárez said. \"That´s our game. We never give up. We never quit.\"Pollock homered off Zach Jackson with one out in the ninth to even it at 2, his second straight game with a tying home run in the late innings.",
        "\"It feels really good,\" Pollock said. \"You come up in a big spot and able to do something for the team. ... Doing it in a win is great.\"Oakland´s bullpen was charged with a blown save for the fourth consecutive game. The A´s fell to 0-4 when leading after seven innings and have lost their first 10 series for the first time in franchise history.",
        "The Mariners' rally took a win away from Oakland starter JP Sears, who pitched six shutout innings with seven strikeouts. A´s starting pitchers have yet to earn a victory through 31 games, the longest streak to start a season in MLB history, according to the Elias Sports Bureau.\"Outstanding job by Sears,\" Oakland manager Mark Kotsay said. \"Unfortunately, the back end and the bullpen just haven't been able to close it down.\"Seattle starter Logan Gilbert allowed two runs on three hits in six innings, striking out six and walking two. Matt Brash (3-2) pitched 1 2/3 scoreless innings with two strikeouts to pick up the win.Esteury Ruiz broke a scoreless tie in the sixth with a run-scoring double off Gilbert. Tony Kemp followed with an RBI double to make it 2-0.José Caballero responded in the seventh with an RBI single to bring Seattle within a run. Caballero went 3 for 5 after starting his career 4 for 23.KELENIC TOSSEDMariners center fielder Jarred Kelenic was ejected by plate umpire Nestor Ceja after striking out swinging in the sixth. Kelenic was upset about the first called strike and was thrown out as he walked back toward the dugout. He turned around to briefly argue with Ceja before walking off the field. Kelenic was replaced by Taylor Trammell.",
        "ROSTER MOVESOakland recalled OF JJ Bleday and optioned OF Conner Capel to Triple-A Las Vegas. Bleday went 0 for 4 in his A´s debut, but threw out Teoscar Hernández trying to stretch a single in the sixth.TRAINER´S ROOMMariners: OF Julio Rodríguez returned to the lineup after missing two games with lower back soreness. He led off and went 0 for 4 with a walk. ... LHP Robbie Ray underwent Tommy John surgery and a flexor tendon repair on his left elbow and will miss the rest of the season. Dr. Keith Meister performed the procedure in Arlington, Texas. Ray will begin his rehabilitation in two to three weeks in Arizona.Athletics: RHP Trevor May, on the injured list due to anxiety-related issues, threw 17 pitches in a scoreless inning during a rehab assignment with Triple-A Las Vegas on Tuesday. Kotsay said May will likely need another rehab outing of 25 or 30 pitches. ... RHP Paul Blackburn (right middle fingernail avulsion) threw all his pitches in a bullpen session Wednesday morning. He will either throw one more bullpen or pitch in a game for Las Vegas.UP NEXTRHP George Kirby (2-2, 2.93 ERA) starts Thursday afternoon´s series finale for Seattle. He has allowed two runs or fewer in four consecutive starts.",
        "Oakland counters with RHP Drew Rucinski (0-1, 4.76), who gave up five runs (three earned) in 5 2/3 innings against Cincinnati last Friday in his A´s debut.___More AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}