{
    "articleURL": "/sport/nhl/article-12059775/NHL-Draft-Lottery-teams-clamoring-17-year-old-Connor-Bedard.html",
    "content": [
        "Monday's NHL Draft Lottery will determine the order of June's draftThe Anaheim Ducks have the best chance at landing the top pick, likely Bedard DailyMail.com provides all the latest international sports newsWhile the basketball world awaits the results of next week's NBA Draft Lottery to learn who will be taking 7-foot-4 French sensation Victor Wembanyama, the hockey universe is equally focused on Monday's NHL Draft Lottery due to a similarly promising talent.",
        "Connor Bedard, Canada's latest hockey prodigy, is the prize of this year's draft class after leading the country to gold at the world junior hockey championship in January.'I've been going to that tournament for more than two decades,' one NHL scout told ESPN. 'And what Connor Bedard did, especially with all of the attention and eyes on him, is as impressive of an individual performance as you'll ever see. The only way I can describe it is pure dominance.'Since then, NHL teams have been eyeing Monday's lottery to see which club will get the chance to take him in June's draft.Anaheim, the NHL's worst team in 2022-23, has an 18.5 percent chance at the top pick, followed by Columbus (13.5 percent), Chicago (11.5), San Jose (9.5), Montreal (8.5), Arizona (7.5), Philadelphia (6.5), Washington (6), Detroit (5), St. Louis (3.5), Vancouver (3.0), Ottawa (2.5), Buffalo (2), Pittsburgh (1.5), Nashville (0.5) and Calgary (0.5).",
        "There had been talk before the event that fellow forward Adam Fantilli — a teammate and a blue-chip prospect in his own right — might be closing the gap on the 17-year-old standout, but Bedard, has proven just how wide the gulf is between himself and his contemporaries.'He's a professional already,' Canadian goaltender Thomas Milic said following the gold-medal game win in January. 'He's so good at everything he does — the way he prepares, the way he looks at the game, studies it. Incredible to see a mind like that at such a young age.'",
        "The rest of the package is pretty good, too.With moves and vision that have been compared to Maple Leafs winger Mitch Marner, and a shot likened to the release of Toronto center Auston Matthews, NHL executives — especially the ones whose teams sit near the bottom of the standings — have to be dreaming of what Bedard would mean for their franchise.'What a talent,' Marner said in January. 'He's got a lot of skill … his shot's unreal. But his work ethic, his compete on pucks has been great to watch.'For all the gaudy numbers Bedard put up, however, he declined to discuss those accomplishments in the wake of the gold medal.'I want to talk about us and what we accomplished,' Bedard, who had 23 points in seven games.",
        "Canadian captain and Seattle Kraken prospect Shane Wright, who went No. 4 at the 2022 draft, said Bedard is humble and 'cares about the team more than himself.'Speaks to the type of character guy he is, the type of person he is,' he said.His coach at worlds, Dennis Williams, said he was impressed with how a player already mentioned in the same breath as Connor McDavid and Sidney Crosby handled the demands.'A lot of people look at what he does on the ice and don't realize just how humble and cerebral a kid he is,' Williams said, according to The Candian Press. 'I couldn't imagine being in his shoes with the amount of attention and pressure he gets night in, night out. He's mature beyond his age.'",
        "The countdown continues to June's draft when the projected top pick will almost certainly hear his name called first.",
        "And Bedard isn't the only prize.Fantilli, a University of Michigan star, would be quite a return for whichever team gets the No. 2 pick. Matvei Michkov and Leo Carlsson also are expected to go in the top five.Land one of the those top spots in Monday's lottery, and a rebuilding team could decide to accelerate its timeline through free agency. The franchise that takes a chance on Michkov, who has a more uncertain future because of his contract with his Russian team, could position itself for another top pick in 2024.The tantalizing talent of Bedard and Fantilli was an undercurrent throughout a season when the bottom of the standings was almost as interesting as what was going on at the top."
    ]
}