{
    "articleURL": "/wires/pa/article-12042829/Trump-Sturgeon-negative-force-hurt-Scotland.html",
    "content": [
        "Donald Trump has said Scotland’s former first minister Nicola Sturgeon is a “negative force” who “hurt Scotland”.",
        "The former US president made the claims as he visited his golf resort Trump Turnberry in South Ayrshire on the third day of his visit to Scotland.He told the Scottish Sun: “Nicola Sturgeon has not been very nice to me.“She never liked what we did for Scotland. My mother was Scottish. The people of Scotland are very proud of what I did for Scotland.",
        "“I think she (Sturgeon) was anti-business. She is a negative force.”Mr Trump said Ms Sturgeon “has been a very successful politician” but her resignation as first minister was a “good change for Scotland”.He added: “She has hurt Scotland. She has hurt education and tourism. She should have embraced us.”He said he believes “you should embrace people like my friend Sean Connery”, and claimed the late James Bond star was “very proud of me and what I did for Scotland”.Questioned by the newspaper on Ms Sturgeon’s successor Humza Yousaf, Mr Trump said: “I don’t know the gentleman but I hear he is a good man.”He also said he hopes Prime Minister Rishi Sunak will step in to help Trump Turnberry secure the British Open golf championship.A source close to the former first minister said: “If Donald Trump wants to see a politician who has had a negative impact on a country then he should maybe reach for a mirror.",
        "“Whilst Nicola is flattered that the former President remains upset that she did not fall for his charms, she has moved on.”Mr Trump played a round at the resort on Wednesday for the second day running.His son Eric accompanied him as he took the wheel of a golf buggy.",
        "Later Mr Trump appeared on GB News, where he criticised Ms Sturgeon again, and said he “felt she didn’t love Scotland”.Mr Trump is visiting his golf resorts in Scotland and Ireland this week as he faces legal trouble in the US.A civil trial at the Federal District Court in Manhattan is hearing allegations, denied by Mr Trump, that he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.In a separate case, he has pleaded not guilty to charges of falsifying business records to hide damaging information ahead of the 2016 presidential election.Mr Trump arrived in Scotland on his private jet on Monday to cut a ribbon at a ceremony to break ground for a second course at his Menie Estate golf resort near Aberdeen. It will be named the MacLeod course – dedicated to his late mother, Mary Anne MacLeod.",
        "She was born on Lewis in the Western Isles before emigrating to the US.",
        "The former president then flew to Prestwick Airport and travelled to Turnberry on Tuesday, where staff lined the steps and waved hats which said “we make Turnberry great again” to greet him.Wearing a red baseball cap with the words “Make America Great Again” on it, Mr Trump shook hands and chatted to some of those waiting to welcome him.He travelled to Ireland later on Wednesday where he was expected to visit his golf course at Doonbeg, Co Clare, on Ireland’s west coast.This was Mr Trump’s first trip to Scotland since leaving office.He spent two days at his Turnberry course on a visit in 2018, which was met with widespread protests, and during which he also met then PM Theresa May and the Queen during his stay."
    ]
}