{
    "articleURL": "/news/article-12060163/NY-Republicans-blast-NYC-Mayor-Eric-Adams-ambush-plan-house-migrant-surge-towns.html",
    "content": [
        "Republican Ed Day, the County Executive of Rockland, said he wants to 'grab Adams by the throat' over the move Orangetown Supervisor Teresa Kenny said officials discovered stockpiles of shirts, Covid-19 tests and medicine at a hotel on Sunday New York City officials are expecting at least 800 asylum seekers to arrive daily once Title 42 comes to an end  Raging New York state officials have slammed NYC Mayor Eric Adams for 'ambushing' them with his plan to send hundreds of migrants to their towns.",
        "Orange and Rockland County in upstate New York have been left in uproar over Adams' plans to spread the migrant crisis, saying their main concern is 'public safety.'Republican Ed Day, the County Executive of Rockland, said he wants to 'grab Adams by the throat' for his decision to bus people out of the Big Apple as Title 42 is set to end on Thursday.Rockland has issued a state of emergency, which means that migrants traveling to the cities in the area will be banned from housing migrants – with Day threatening to fine hotels $2,000 per day per migrant.Orangetown Supervisor Teresa Kenny told Fox and Friends that she was not consulted over the move, with Adams describing it as a 'preliminary plan'.",
        "She said: 'Our concern is public safety. We don't know if there have been background checks on these people.'Anyone who's been around for a long time knows we had a very sad incident where someone was killed by an immigrant. 'I'm not saying I think all immigrants are criminals – it just takes one, and we're not getting any answers.'Our town code says a hotel to be used for transient purposes for up to 30 days. - they're making this a city shelter in one of our hotels.",
        "'We have served them with a violation. We are prepared to go to court. I'm sorry, Mr. Mayor, you do not get to trump our local codes. This is a hotel. It's not a city shelter.'Officials in Orangetown also discovered hundreds of beds outside of the Armoni Inn and Suites on Sunday, alongside stockpiles of shirts, Covid-19 tests and medicine.The hotel, which is $93 a night and boasts a fitness center and outdoor pool, is expected to house least 340 adult male migrants for four months while they are integrated into the community.Rockland, which did not declare itself a sanctuary city, will see more than 300 migrants housed in the Crossroads Hotel – which costs $184 a night and also boasts an outdoor pool.",
        "New York City issued its own state of emergency in October, to get federal resources to help with the growing migrant population.Rockland is the first county in the state outside of New York City to issue a similar order. It is thought that the buses could arrive as soon as Saturday or Sunday. Day, who worked as a Commanding officer for the NYPD in the Bronx, retiring in 2000, also earned 40 citations for meritorious and conspicuous actions in the line of duty.",
        "Day said: 'Rockland is not going to stand idly by as your administration which boasts itself as a sanctuary city diverts busloads of undocumented individuals to our county,'This is a duplicitous plan and everybody involved in it should be utterly ashamed of themselves.'Right now, our state of emergency is in effect. We have law enforcement deployed in various areas of the county, ready to react to anything that comes up to this county.'For starters, we are establishing a licensing requirement for all hotels. If these hotels are not licensed and approved by my office, they cannot function and operate.'It's a $2,000-per-day, per-immigrant fine. That's almost $68,000 daily that we will levy.'",
        "'This is not about immigrants and about children and about being kind or being good. There is a legitimate process to do that.'He has threatened to use court procedures and local police to stop the buses from getting to the cities.Day ranted that Adams just said: 'Screw you Rockland County', and did not ask for an opinion on sending the migrants to the area.He branded Adams as a 'bully' who believes 'we're just going to roll over', before adding that he would not get away with it and 'you picked the wrong person to fight with.'",
        "The executive said during a radio interview, Day said: 'Mr. Adams, you can try to run us over, [and] I will reach up and grab you by the throat for the people of Rockland County.'Within that cadre of people who are coming here, who are not vetted, we have child rapists, we have criminals, we have MS-13. There's a reason why there's a process.'New York City has reportedly taken in over 60,000 migrants over the last year, with more than half of those houses at the 122 city-run shelters that have been set up to handle the influx.In a statement Adams said: 'This new, voluntary program will provide asylum seekers with temporary housing, access to services, and connections to local communities as they build a stable life in New York state.' ",
        "He is continuing to demand more help from the federal government to assist with asylum seekers.While announcing the new plans, Adams said the city is only getting $30 million in FEMA funding out of the $350 million in total funds it applied for.A statement from City Hall confirmed that the city would ship 'up to 300 people' upstate, with the migrants having the choice of whether to be relocated voluntarily.Officials also said the city would foot the bill for four months of shelter at the upstate hotels, along with meals, health care, laundry and other living expenses.",
        "It comes after a five-page draft memo was revealed on Friday, with officials outlining possible solutions for the influx of migrants expected following the end of Title 42.New York City officials are expecting at least 800 asylum seekers to arrive daily, with five buses arriving on Friday from Texas carrying men, women and children.Currently they are being housed in a former police academy, which was previously used as a training facility.Options outlined in the documents include gyms at local colleges, public schools once classes are out, tents in public parks like Central Park and Prospect Park and parking lots at Citi Field and the Aqueduct Racetrack.Erecting tents on Randall's Island and using cruise ships to house migrants are again being discussed, as is a proposal to erect 'temporary housing in containers or tiny homes.'Another proposal included a plan to retrofit unused airplane hangars at John F. Kennedy Airport."
    ]
}