{
    "articleURL": "/news/article-12048573/King-Charless-touching-floral-tribute-Queen-featuring-bloom-wedding-day.html",
    "content": [
        "Unlike his mother's Coronation, Charles's big day will have flowers at the AbbeyThe plants were chosen because they are in season by Florist Shane ConnollyKing Charles has made a touching tribute to his wife by featuring a flower from the buttonhole he wore to their wedding as part of the stunning floral displays at Westminster Abbey for his Coronation.",
        "The arrangements will feature hellebores – a particular favourite of the King – as well as honeysuckle, tulips, blossom, jasmine, ranunculus and aquilegia – an ancient symbol of the Holy Spirit.They will also include foliage of rosemary, birch, bay and hazel and wild broom grown on the Isle of Skye.The plants have all been chosen because they are in season and will be donated to Floral Angels, which repurposes arrangements from events into bouquets to share with care homes, hospices and shelters. Camilla is the charity's patron.Florist Shane Connolly, who is in charge of the arrangements, said that at the late Queen's 1953 coronation there were no flowers in the Abbey, only on the processional route. ",
        "'The Abbey was so full of people, and everyone wearing scarlet robes, that there was no place for flowers,' he said. By contrast, the guest list for Charles's ceremony tomorrow has been cut down to 2,300 from Queen Elizabeth's 8,000 – leaving room for a spectacle of colour.They have been provided by Flowers from the Farm, a non-profit association that champions artisan growers, with foliage from the Royal Horticultural Society (RHS) at the High Altar.",
        "More than 120 varieties of flowers have been grown by 80 gardeners across the UK including in Cornwall and the village of Tobermore, Northern Ireland.",
        "In line with the King's passion for 'sustainability', the flowers and foliage will be arranged without single-use plastics or floral foam.The arrangements will reflect Their Majesties' deep affection for the natural world and their shared passion for gardening, and showcase the 'best of the British countryside in the spring'. Mr Connolly – who also did the flowers for the Prince and Princess of Wales' wedding – said his arrangements would 'reflect the real characters of the King and Queen'.'That's what it's all about – those personal things. It's not about showing off. It's all about this emotion and sentiment,' he said.The 60-year-old said he wanted to use British-grown seasonal flowers on a grand scale, adding: 'If guests take away something, I would love it to be, 'Wow, that was all grown in Britain! Isn't that amazing!' 'So many big events people go to are full of flowers that have been flown halfway round the world. This is British, grown in the soil of the kingdom.'"
    ]
}