{
    "articleURL": "/tvshowbiz/article-12061357/Pierce-Brosnan-wife-Keely-Shaye-Smith-wish-son-Paris-congrats-graduates-college.html",
    "content": [
        "Pierce Brosnan and wife Keely Shaye Smith took to social media on Saturday to celebrate the college graduation of their youngest son, Dylan, from Loyola Marymount University in Los Angeles.",
        "Brosnan, 69 and Smith, 59 — who attended the Met Gala last week — have been wed for more than 21 years and are parents to sons Dylan, 26, and Paris, 22.In a series of shots from the event, the Mrs. Doubtfire actor was clad in an aegean blue suit with a white button-up shirt and sunglasses.Smith donned an off white coat over a lacy pink dress and wore sunglasses with her brown locks down.",
        "Smith and her son wore Hawaiian leis at the graduation ceremony, as he was in a black cap and gown. The GoldenEye actor captioned a shot of himself, his wife and Paris, 'Dearest Paris, Heartfelt congratulations on your graduation from Loyola Marymount University School of Film &amp; Television.'The James Bond actor advised his youngest child, 'Go into the world with a brave heart and create stories that will make the world a better place.'Smith told Paris she and the Remington Steele alum are 'beyond proud of' him and his 'incredible passion and talent.'Go forth and do good things. A man becomes what he dreams… dream well.'Paris shared shots from the ceremony on his Instagram, captioning the post, 'The graduate.'Paris's older brother Dylan in 2020 graduated from the University of Southern California's School of Cinematic Arts, and is a musician and model. ",
        "Paris earlier this month showcased his art in an exhibition titled The Company We Keep at the Robina Benson Design House in Los Angeles.",
        "Paris's work was in a showcase of paintings by fellow artists Alexandria Hilfiger and Nikki Haskell, and curated by art advisor Kipton Cronkite. 'Each of the works provoke the viewer to recall childhood memories, feelings of nostalgia, and purity through their human experience,' the design house said in a statement.Both Pierce and Keely were at the gathering, as well as other notable names such as model Dree Hemingway, actress Jacqueline Bisset and Candy Spelling.The art exhibition is slated to run through May 25."
    ]
}