{
    "articleURL": "/tvshowbiz/article-12051407/Mae-Muller-dons-racy-black-jumpsuit-sheer-bodice-Liverpool.html",
    "content": [
        "Mae Muller put on a rather racy display outside a hotel in Liverpool as she arrived in the city ahead of the Eurovision Song Contest 2023.",
        "The singer, 25, showed off her incredible figure in a racy jumpsuit as she made sure eyes were all on her just days ahead of the annual contest in the city.Mae, who will represent the UK with I Wrote a Song, teamed up her all-black outfit of with a stack of chunky necklaces, one which had a M initial.While she wore her brunette tresses loosely across her shoulders, her smokey-eye make-up matched perfectly with the neutral shade of her lipstick.She was joined by Australian singer Andrew Lambrou as the pair were seen chatting outside the hotel.",
        "Andrew will be representing Cyprus at the worldwide singing contest, which will be held in Liverpool on May 13.It comes after Mae gushed about keeping her Eurovision news a secret for two months.She told BBC Radio 2's Zoe Ball and Rylan Clark that 'it felt surreal' for her participation to be out in the open. 'Oh my God, I have been waiting to say that for months. I am shaking. That has been on my lips and in the brain and in the soul and on the nails,' she gushed.She said she has been getting tips from Eurovision's last UK entry Sam Ryder, who finished in a shocking second place behind winners Ukraine, the best British result in years.",
        "She said: 'We spoke yesterday he sent me some voice notes, just the loveliest man in the world, he's given me some tips as well.'Mae, along with Andrew Lambrou will take to the stage at the live final, which will be hosted in Liverpool as the UK are holding the contest on behalf of Ukraine.",
        "Talking about her participation in Eurovision, the songwriter said she was 'so excited' to represent the UK.She said: 'I'm SO excited to participate in Eurovision this year and represent the UK! I've loved watching Eurovision all my life, so to compete in such a massive music competition is simply brilliant.'I'm a huge fan of so many of the artists that have found success at Eurovision, from ABBA to Måneskin! Sam Ryder was so amazing last year and proved the UK can be back on the left-hand side of the leader board!'I wrote the song I Wrote A Song a few months ago when I was going through a hard time and wanted to feel empowered about relationships, so for it to be chosen for this year's UK Eurovision song is honestly a dream!'Adding to this TaP Music co-founders Ben Mawson and Ed Millett said: 'We have always been fans of Mae for her voice, songs and star charisma, and when we heard I Wrote A Song, we were really taken by its impactful message - ''songs as a form of therapy'' (a great message for the biggest song contest in the world!) alongside its playful tone and up-tempo fun production.",
        "'From the moment we met Mae, we knew she would be an incredible ambassador for the UK at Eurovision.'Alongside her abundant talent, she has the most wonderfully warm and fun personality and expressed positivity and excitement about the opportunity to represent the UK. 'We are super excited to work with Mae, EMI and her management company Modest! on supporting Mae to get another great result at Eurovision.'Last week, Mae met up with King Charles and the Queen Consort in Liverpool ahead of the annual contest."
    ]
}