{
    "articleURL": "/sport/football/article-12060231/OLIVER-HOLT-study-Haaland-witness-tutorial-art-modern-goalscoring.html",
    "content": [
        "Man City striker has 35 league goals with four matches still to play marks himJimmy Greaves was last player to score 40 goals in the English top flight in 1961 THE NOTEBOOK: Erling Haaland draws a rare blank in front of goal against LeedsIn the face of the widespread determination, particularly prevalent among broadcasters, to pretend that English football was invented in 1992 and that it did not produce any great goalscorers, or players, until the Premier League was formed, it seems valid to point out Jimmy Greaves scored as many or more league goals as Erling Haaland has scored this season in three seasons out of four in the 1960s.",
        "Greaves’ highest single season league total was 41 in 1960-61. John Charles got 38 for Leeds United in 1956-57. Ted Drake got 42 for Arsenal in 1934-35, Pongo Waring got 49 for Aston Villa in 1930-31 and Dixie Dean scored 60 for Everton in 1926-27. Haaland may yet threaten Dean’s single-season record of 63 goals in all competitions in the English game but Dean did not play matches in European competition so the comparison is skewed.That is the end of my attempt at restraint. The caveats about past greatness of others do not alter the fact that every chance to watch Haaland play for Manchester City this season has been a privilege. Every time watching him play, every time watching him score, has been loaded with the feeling that we are watching something special. We are watching history unfolding in front of us.",
        "Sure, Haaland still has frontiers to cross but I have always thought of Greaves as the benchmark for greatness and I did not think I would see a striker get close to his season total of 41 top-flight goals in my lifetime. That Haaland is on 35 league goals with four matches still to play in a highly competitive division marks him out as a phenomenon. To have studied him, to have watched analysis of his methods, has been like a tutorial in the art of modern goalscoring.",
        "In the end, his astonishing hunger and consistency and brilliance made it easy to put his name on my ballot paper this week for the Football Writers’ Association Men’s Footballer of the Year award, which will be announced on Friday. Even in the context of a compelling title race, my expectation is that Haaland will win by a landslide.It is not for want of other fine candidates. Alexis Mac Allister has had a superb season for Brighton and the small matter of playing a leading role in Argentina winning the World Cup in December elevates him in anyone’s thinking. Ivan Toney has had another excellent season for Brentford, somehow continuing to excel despite the FA charges hanging over him.Miguel Almiron and Bruno Guimaraes have led Newcastle’s climb into the top four, Bukayo Saka has been a joy to watch as he has spearheaded Arsenal’s title challenge. Martin Odegaard has been the best midfielder in the country, although Kevin De Bruyne has been breathtakingly good in the last few months.But none of them can match Haaland’s contribution. It is not just the goals, either, although the goals would probably be enough. It is the way that Haaland has grown and grown as a player as the season has progressed. It is the way that he has made such a difference to a City side that was already formidable.",
        "It is the way that a man playing in a position that often calls for blinkered selfishness on a football pitch has begun to find more and more satisfaction in being a team player, in creating goals for others. ",
        "It is the way, even with history beckoning him at every turn, Haaland has chosen to give team-mates the chance to score rather than hoard the chances for himself.I was at the Etihad to see him play against Leeds on Saturday, a game that was notable for the fact that he didn’t score. It was far from his best game, actually. He missed several gilt-edged chances and hit the post when he should have scored. His tilt at Greaves’ total and Dean’s total got stuck.In those circumstances, it felt even more admirable that when City got a penalty late in the game, Haaland sacrificed the chance to take it so that Ilkay Gundogan could have a chance of adding a third goal to the two he had already scored and completing his first-ever hat-trick.Gundogan missed the penalty, ensuring that both he and Haaland incurred the wrath of Pep Guardiola but what will remain is that a goalscorer-supreme like Haaland was willing to give up a penalty for his captain. Almost every other striker I can think of would have insisted on taking that kick himself.",
        "But even if his generosity was misguided, Haaland’s gesture spoke of a wider significance to his team. He is about far more than individual statistics. I have enjoyed his goals this season but the moments that have stuck out have been the way he eschewed the chance to shoot at a critical juncture of City’s Champions League quarter-final first leg against Bayern Munich last month and floated a perfect cross into the path of Bernardo Silva, whose header put City two up.The other moment was when he took down a long ball from John Stones, under pressure from Rob Holding, who was climbing all over him, in the biggest game of the season against Arsenal last month. Haaland shielded the ball brilliantly and then played a perfect lay-off into the path of De Bruyne, who ran on to put City ahead.Even at the weekend, Guardiola spoke admiringly of Haaland’s commitment to the cause. Success has not dimmed his hunger one iota. The City manager said Haaland had gone to the training ground for treatment at 11pm last week in his quest to recover better from a match against West Ham.",
        "Other players at other clubs do this, too, but it was another sign of Haaland’s unrelenting professionalism. It has not escaped notice that at a time when other players may be tiring after a long season, their appearances rationed, Haaland has played the full 90 minutes in each of City’s last four games.",
        "Wayne Rooney pointed out in his newspaper column at the weekend that Haaland has transformed the threat City pose to opponents this season, particularly against the leading teams. It may be that his signing proves to be the last piece in the jigsaw City have put together in their quest to win the Champions League for the first time.Whether they do it or not, whether he scores against Real Madrid in the Bernabeu in the first leg of their semi-final tonight or not, his impact on English football this season has been explosive.To have witnessed a player break Premier League records set by strikers as brilliant as Alan Shearer and Andy Cole, to have seen Haaland get to a point where it is even conceivable that he will equal or surpass Greaves’ league total of 41, is enough to tell us that we are in the presence of a generational talent.Why heroic Houghton gets my voteI voted for Steph Houghton as my FWA Women’s Footballer of the Year. I don’t want to ignore the remarkable season Manchester United have put together in the WSL but I have to confess to some bias regarding Houghton. To have seen her rebound from injury and the crushing disappointment of missing out on England’s Euros victory, to have seen her rediscover her best form at the age of 35, re-establish herself at Manchester City and lead their own title challenge, all while supporting her husband Stephen Darby in his battle against motor neurone disease, has been to witness an inspirational footballer.",
        "Warnock has brought pride and joy Neil Warnock has carved out a place as one of the great figures in English football history. He will not be remembered for the kind of glories achieved by Sir Alex Ferguson, Bob Paisley, Brian Clough or Pep Guardiola but he will be remembered for managing more games than any other and for the joy and the pride that he has brought to millions of fans in the heartlands of our game. His masterminding of Huddersfield Town’s great escape from relegation at the foot of the Championship this season was just the latest example of a talent for man-management, and for populism, in football that few can equal."
    ]
}