{
    "articleURL": "/wires/pa/article-12053757/Emma-Thompson-Ant-Dec-Katy-Perry-attend-King-s-coronation-service.html",
    "content": [
        "TV presenters Anthony McPartlin and Declan Donnelly have joined other celebrity guests including Dame Emma Thompson, Lord Lloyd-Webber, Dame Judi Dench and Stephen Fry at Westminster Abbey for the King’s coronation service.",
        "The TV duo are attending in their capacity as goodwill ambassadors for the Prince’s Trust, a role they took up in 2021 after two decades working with the charity.US singer Katy Perry, Australian musician Nick Cave, British Vogue’s editor-in-chief Edward Enninful, BBC director-general Tim Davie, actress Dame Joanna Lumley, TV host Jay Blades and singer Lionel Richie, who will perform at the coronation concert on Sunday, were also in attendance.Before the ceremony, McPartlin and Donnelly told Good Morning Britain it was an “honour and a privilege” to be invited to the event in central London.McPartlin added that the Prince’s Trust is the “best legacy” for the King to leave.“He started the Prince’s Trust with his Navy pension back in 1976 and since then, the Prince’s Trust has grown every year and it’s now worldwide,” he said.“We’re just very proud to be part of it and we can see now first-hand how it does help young people in this country and around the world.”",
        "The pair, who are currently on-screen presenting I’m A Celebrity… South Africa, entered the abbey just before 9am in their morning suits, greeting other guests with waves and smiles.As the pair grinned and said hello to members of the congregation in the North Transept, they were welcomed with impromptu cheers.",
        "Best known for fronting shows including Saturday Night Takeaway, I’m A Celebrity… Get Me Out Of Here! and Britain’s Got Talent, Ant and Dec have hosted the Prince’s Trust Awards 10 times and recently collaborated with the charity on a course to make the media industry more accessible.",
        "Oscar-winning actress Dame Emma, wearing a red floral jacket and her damehood medal and insignia, was accompanied by her husband, actor Greg Wise, for the ceremony.Australian singer Cave was in conversation with former Archbishop of Canterbury Rowan Williams as they arrived at the abbey.As part of the BBC’s centenary celebrations last year, Charles visited Blades for a special episode of The Repair Shop where his bracket clock and a piece made for Queen Victoria’s diamond jubilee by British ceramics maker Wemyss Ware were fixed.Spice Girl Melanie Brown also spoke to ITV outside the abbey, recounting the girl group’s famous encounter with Charles in 1997.She said: “I think because we were all so excited on the day we all just kind of freaked out a bit, and broke protocol, and I gave him a kiss and then Geri gave him a kiss and pinched his bum… we were just overwhelmed with excitedness. I don’t think I’d do that again though… we were all just too excited.”",
        "Fry told BBC News he was grateful to have been invited to the “thousand-year-old ceremony, so rooted in the history of our islands”.Singer-songwriter Joan Armatrading, who received a CBE for services to music, charity and equal rights in the late Queen’s 2020 birthday honours, and magician Dynamo, real name Steven Frayne, were also pictured seated in the Abbey.Other notable faces expected to be in the audience include David and Victoria Beckham, Stella McCartney, Rowan Atkinson and Bear Grylls.Heads of state and kings and queens from across the globe, everyday heroes and family and friends of the royal couple are also on the guest list."
    ]
}