{
    "articleURL": "/wires/pa/article-12044693/What-papers-say--May-4.html",
    "content": [
        "Royal stories again take centre stage on several of Thursday’s newspaper front pages, but a range of other topics battle for attention.",
        "Security in London is the main focus of the royal stories as the countdown to the coronation continues.The Daily Mail splits its front page between a picture of the coronation rehearsal on The Mall and what it calls the “biggest security operation ever” with 11,500 police officers and facial recognition cameras scanning the crowd.Metro says a “ring of steel” is being placed around the King with security reviewed following the arrest of a man outside Buckingham Palace.Security is also the focus of the Daily Mirror front page as it warns police will take “very swift” action against any protests which disrupt the coronation.The i takes a different royal slant, saying Charles is set to play a central role in improving relations between the UK and Europe after Brexit.",
        "A picture of the Queen Consort and a story on potential coronation protests make the front of The Daily Telegraph, but the lead focuses on a “best ever” drug in the fight against Alzheimer’s.That story also makes the front page of the Daily Express which says the new treatment, which slows the condition by more than a third in patients showing early symptoms, provides “real hope” for millions.The Times also features the Alzheimer’s treatment and a coronation rehearsal picture, but it focuses on warnings from Conservative MPs that the party must avoid becoming the “party of nimbyism” after dropping housebuilding targets.",
        "Tennis star Emma Raducanu is pictured on the front of The Guardian after surgery which will rule her out of Wimbledon, but the front page concentrates on elite UK schools with links to the slave trade.The Sun concentrates on a showbiz story, revealing that Taylor Swift is dating The 1975 singer Matty Healy.The Financial Times focuses on the head of the London Stock Exchange calling for higher pay for bosses to deter companies from moving overseas.And the Daily Star delves into the world of artificial intelligence and fears it will create new religions."
    ]
}