{
    "articleURL": "/wires/aap/article-12056329/A-snapshot-round-10-NRL-season.html",
    "content": [
        "SNAPSHOT OF ROUND 10 NRL ACTION",
        "PLAYER OF THE ROUND: In a loss to Gold Coast in which only goal-kicking was the difference, Parramatta five-eighth Dylan Brown was in everything. He threaded a kick through the line to set Clint Gutherson up, found Andrew Davey on the right for a late try that threatened to snatch victory, and finished with 232 run metres.QUOTE OF THE ROUND: \"It is not something that I kind of wanted to do and I am still not sure if I want to be a coach.\" Seven-time premiership-winning Dolphins mentor Wayne Bennett celebrated his 900th game as an NRL coach by claiming not to know whether he enjoys being a coach.TALKING POINT: Are South Sydney the team to beat in 2023? The Rabbitohs dominated Melbourne in the latest chapter of their five-game winning streak, which has also featured victories over reigning premiers Penrith and ladder-leading Brisbane.STAT THAT MATTERS: By bagging three tries in Brisbane's 32-6 demolition of Manly, winger Selwyn Cobbo became the first player to score a hat-trick at more than one Magic Round. The 20-year-old notched the first three-timer of his NRL career at the 2022 edition of the football festival.MAGIC MOMENT: Dolphins centre Valynce Te Whare, already nicknamed 'Val Meninga' by the media, had a dream NRL debut against Cronulla. The 117kg rugby union convert crossed for two tries and dominated formidable opponent Siosifa Talakai as his side ran out to a 36-16 win.",
        "ANOTHER MAGIC MOMENT: Wests Tigers have rookie fullback Jahream Bula to thank for their first back-to-back wins in more than a year. His side up by two points with two minutes to play against St George Illawarra, Bula scrambled over in cover defence to push Mikaele Ravalawa over the sidelines just as he looked certain to score the game-winning try.CASUALTY WARD: Warriors - Edward Kosi (knee), Jackson Ford (head); Dolphins - Euan Aitken (hamstring); Broncos - Kurt Capewell (concussion); Tigers - John Bateman (hamstring); Roosters - Egan Butcher (concussion); Eels - Mitch Moses (concussion)JUDICIARY WATCH: Jamayne Taunoa-Brown (high tackle)UNDER PRESSURE: The heat on St George Illawarra coach Anthony Griffin is approaching critical mass after a fifth consecutive loss. The Dragons again scored the same number of tries as their rivals Wests Tigers, but failed to turn late chances into a lead. The club's board is actively sounding out candidates for next season but Griffin is no guarantee to be there at the end of this one."
    ]
}