{
    "articleURL": "/wires/pa/article-12052955/All-key-timings-coronation-day.html",
    "content": [
        "Here is a rundown of the timings for coronation day:",
        "– 6am – Viewing areas open along the procession route.– 7.15-8.30am – Guests for Westminster Abbey begin to arrive at security checkpoints in Victoria Tower Gardens.– 9am – General congregation to be seated inside the Abbey. Pre-coronation music begins.– 9.30-9.55am – Heads of state and overseas government representatives arrive at the Abbey.– By 10am – The sovereign’s escort will be in position at Buckingham Palace.",
        "– 10am – Procession of faith leaders and ecumenical leaders through Westminster Abbey.– 10.15am – Procession of Commonwealth realms through the Abbey– 10.20am – The King and Queen leave Buckingham Palace in the Diamond Jubilee State Coach in the King’s procession.– 10.25am – Members of foreign royal families arrive at the Great West Door of the Abbey.– 10.35am – Members of the royal family arrive at the Great West Door.– 10.45am – The Prince and Princess of Wales and Prince George, Princess Charlotte and Prince Louis arrive at the West Gate of the Abbey.– 10.50am – The equerry and pages of honour to the King, equerry and pages of honour and companions to the Queen arrive at the West Gate to await the arrival of the King and Queen.",
        "– 10.53am – The King and Queen arrive at the West Gate of the Abbey. The state trumpeters of the Household Cavalry, stationed in the Abbey, sound a fanfare.",
        "The King’s procession, led by the Cross of Wales, begins.– 10.54am – The Abbey bells are rung.– 11am – The coronation service begins.After the procession, the greeting of the King takes place with chorister Samuel Strachan, 14.The King has a moment of silent prayer. The Archbishop of Canterbury gives an introduction.During the recognition, the King stands in the coronation theatre and turns to show himself to the people at each of the four directions – east, south, west and north.He is presented with the coronation bible and takes the oath, and then prays aloud with the King’s Prayer.",
        "Prime Minister Rishi Sunak reads the Epistle and the archbishop delivers his sermon.The King takes off his crimson robe of state and wears a simple white shirt for the private anointing with holy oil in the coronation chair behind a screen, in the most sacred part of the ceremony.In the investiture, the King puts on a sleeveless white garment called the colobium sindonis, a shimmering gold-sleeved coat called the supertunica and a golden coronation girdle around his waist.He is presented with the golden spurs, symbolising knighthood and chivalry, the jewelled sword of offering and the armills, the bracelets of sincerity of wisdom.The King puts on the stole royal – a long, narrow embroidered band of gold silk which goes around the shoulders, mirroring outfits worn by a priest or a bishop.",
        "The Prince of Wales steps forward to help dress the King in the golden brocaded cloak, the imperial mantle – or robe royal.",
        "Next the King holds the sovereign’s orb, before it is returned to the altar and touches the sovereign’s ring, puts on the single white coronation glove to hold the sovereign’s sceptre with cross in his right hand, with sovereign’s sceptre with dove in his left, ready to be crowned.– 12pm approx – The crowning – the King is crowned by the Archbishop of Canterbury with St Edward’s Crown.A fanfare sounds. The Abbey bells ring for two minutes and a gun salute is fired by the King’s Troop Royal Horse Artillery stationed at Horse Guards Parade.Gun salutes at the Tower of London are fired by the Honourable Artillery Company, and at all saluting stations throughout the UK, Gibraltar, Bermuda, and ships at sea.After a blessing, the King is enthroned on his throne chair.The archbishop pays homage, followed by the Prince of Wales’s homage of royal blood, and then the new homage of the people takes place.The Queen is anointed with holy oil in full public view in her chair of estate.She touches the Queen Consort’s ring.The Queen is crowned by the archbishop with Queen Mary’s Crown.",
        "She touches the Queen Consort’s sceptre with cross and the ivory Queen Consort’s rod with dove.Camilla is enthroned on her throne chair.The Lord’s Prayer is said and the King and Queen take holy communion.They change into their purple robes of estate in St Edward’s Chapel behind the altar and Charles puts on the Imperial State Crown.The national anthem is sung and the King’s outward procession, including the Prince and Princess of Wales and their children, makes its way to the Great West Door, where the King receives a greeting by leaders and representatives from different faith communities.– 1pm approx – The grand coronation procession departs the Abbey, with the King and Queen in the Gold State Coach and the Prince and Princess of Wales in the next carriage. The Abbey bells will ring.– 1.45pm – The King and Queen appear on the West Terrace at Buckingham Palace for a royal salute with the UK and Commonwealth armed forces-2 .30pm – The royal family watch the flypast from the palace balcony."
    ]
}