{
    "articleURL": "/news/article-12061341/Qantas-horror-Couple-recall-European-ordeal-left-facing-huge-19-000-bill.html",
    "content": [
        "Aussie couple travelled to the Netherlands However, their return flight was then delayed Were forced to pay $19,000 to get a new flight An Australian couple have revealed they were forced to spend over $19,000 to get home after a mistake from Qantas left them stranded in the Netherlands. ",
        "Andrew and Meagan Lewis, from Sydney, said they had a 'horrible experience' while attempting to come home from their trip to Europe in February. The couple had booked business class flights to and from Europe using Qantas Frequent Flyer points around 12 months before they set off for the Netherlands.However, on midnight the day before they were to fly home, they were told that one of their return flights was delayed. They were assured that the problem would be resolved, and an email fixing the problem would be sent the following day. That email never arrived and, after a last-gasp call that saw him being passed around, Mr Andrews was eventually told the couple would not be able to make their flight because of the delay. To make matters worse, the only available replacement flight was more than $19,000 - and was not eligible for a refund from Qantas. ",
        "'It was an all-round horrible experience,' Mr Lewis told news.com.au.'They advised us we could pay for a flight via Frankfurt [in a few days time]. So we'd have to get a train from Amsterdam to Frankfurt and then it was going to be with Emirates from Frankfurt to Dubai to Sydney for a total cost of just over $19,000 for the two of us.",
        "'We felt we had no other option because we had work obligations to get home to.'We were away quite a time so we were forced to pay the money to them over the phone.'To make matters worse, he had to pay two nights additional accommodation in Amsterdam, two train tickets and an additional night's accommodation in Frankfurt, costing an extra $1,600. The couple also discovered that their frequent flyer points were not refunded to his account as promised.It took numerous phone calls over several weeks to get this situation rectified.  ",
        "Mr Lewis also explained how he was a Qantas gold member for about a decade or so before the pandemic.'All that loyalty, building up points, building up status credits, I was treated like I was nobody to them,' he said.Qantas eventually offered Mr Lewis an apology and refund on the money he paid to get back home - three months after his ordeal.'The re-accommodation of customers after a cancellation or schedule change is always the responsibility of the airline operating the flight.'Once we became aware that Mr Lewis’s Japan Airlines flight had been delayed and that he required a new flight, we should have contacted Japan Airlines to resolve the booking.'We apologise to Mr Lewis for this experience.'"
    ]
}