{
    "articleURL": "/wires/pa/article-12043955/Mohamed-Salah-nets-winner-Liverpool-slim-four-hopes-alive.html",
    "content": [
        "Liverpool turned up the pressure on Manchester United with a 1-0 victory over Fulham moving them four points off fourth place as Mohamed Salah’s winner edged him even closer to a Steven Gerrard record.",
        "There was none of the drama or histrionics of Sunday’s 4-3 win over Tottenham in bringing up a fifth successive Premier League victory for the first time since April last year.Salah’s 39th-minute penalty, his second in successive games after back-to-back misses, took him to 185 goals for the club, one behind Gerrard, while also going fifth on the club’s list of all-time league scorers with 136.Manager Jurgen Klopp’s behaviour in the technical area was the very model of exemplary following a Football Association misconduct charge for comments about Sunday’s referee Paul Tierney.",
        "He was perhaps making the most of his time on the touchline as he has until Friday to respond to the charges and, having already served a one-match ban this season, the punishment could be much more severe.Klopp had written in his programme notes that going 3-0 up inside the opening 15 minutes against Tottenham – a match they eventually went on to win with an added-time goal – had given them some problems.And although they set off looking like they might replicate that with Trent Alexander-Arnold alone having three attempts on goal in the first 10 minutes, they lacked some of the sharpness they had shown at the weekend.Also, Fulham were also more organised than their fellow Londoners and that kept opportunities down to half-chances at best.",
        "Alexander-Arnold’s advanced position stepping into midfield allowed him to get closer to his opponents’ goal but, unusually for him, he was off target with two attempts with another hit tamely at goalkeeper Bernd Leno.",
        "Salah, whose cross just evaded Darwin Nunez eight yards out, weaved his way past a couple of defenders close to the byline but could not find the target from a narrow angle, while Luis Diaz also had a shot deflected wide.Liverpool’s mastery of control in the opposition half was almost absolute, regularly winning back possession before Fulham had time to begin the semblance of an attack, but in their own final third it was much less so.Virgil Van Dijk had to slide in to turn Harry Wilson’s cross behind after the former Liverpool winger had broken into the space behind Kostas Tsimikas, with Carlos Vinicius exploiting Ibrahima Konate’s hesitation to force a good save out of Alisson Becker.When the breakthrough arrived it was no surprise it came from a counter-press after Nunez had initially lost possession 15 yards outside Fulham’s penalty area.",
        "Tosin Adarabioyo squared a short pass to Issa Diop but the centre-half, back in the team due to Tim Ream’s season-ending injury, dawdled in making his clearance and Nunez was on him like a shot to nick the ball off his toes with the Frenchman’s swing at fresh air catching the forward’s back leg as he went past him.",
        "Referee Stuart Attwell pointed to the spot and Salah scored an identical penalty to the one against Spurs, blasted straight down the middle.The second half was much of the same, with Liverpool exerting most of the pressure without really pressing home their advantage.That made their slender lead vulnerable and Alisson had to save well from Vinicius to prevent the equaliser with 13 minutes remaining to keep their slim Champions League qualification hopes alive.They are, however, still relying on United to drop points as their arch-rivals have two matches in hand, starting at Brighton on Thursday."
    ]
}