{
    "articleURL": "/sport/football/article-12054135/Fans-poke-fun-King-Charles-III-coronation-hymn-bears-similarity-Champions-League-anthem.html",
    "content": [
        "Zadok the Priest was played during King Charles III's coronation on SaturdayThe historic hymn served as the basis of the iconic Champions League anthemFans online were quick to poke fun at the similarities between the two songsFans have poked fun online after a hymn performed during King Charles III's coronation bore a striking resemblance to the Champions League theme.",
        "During the ceremony, a familiar song began playing that left football fans on social media questioning whether they had just heard the famous anthem.However, the song performed was not 'Champions League' but instead 'Zadok the Priest', a coronation anthem composed by George Frideric Handel in 1727 for the coronation of King George II.As covered by Mail Sport earlier this week, the anthem that has become synonymous with European football was written by Tony Britten and took inspiration from the classic hymn. But football fans couldn't help but take to social media during the ceremony to playfully poke fun at the similarity.",
        "@AlexanderFoxEtc wrote: 'Zadok the Priest. You simply cannot beat Champions League fixtures like this in Westminster.'@Virtualstatman added: 'And with that, King Charles III now qualifies automatically for next year’s UEFA Champions League' @FPLReactions asked: 'Am I that obsessed with football I’m hearing the Champions League anthem during the coronation I think I’m losing it'Meanwhile comedian Dara O'Briain joked: 'Tuned out for a while; now they are building a box to the Champions League music. Does Charles pop out the top?'Rachel Wearmouth wrote: 'I'm sure a good chunk of the population only know this as the Champions League music'",
        "Another user concurred: 'Swear I thought it was the champions league anthem'",
        "Speaking with the BBC in 2020, Britten expanded on the origins of his work, and insisted that the similarity between his football anthem and the historic coronation hymn is isolated to the first string phrase.'Some say the tune is nicked from Handel, but it's not,' he insisted. 'It's just the first writing string phrase, and the rest is me.'"
    ]
}