{
    "articleURL": "/wires/ap/article-12050473/Arab-ministers-meet-Syrias-return-Arab-league.html",
    "content": [
        "CAIRO (AP) - Diplomats from Arab nations are planning an emergency meeting in Cairo over the weekend about the fighting in Sudan and the prospect of Syria's return to the Arab League more than a decade after its membership was suspended, an official said Friday.",
        "Sunday´s meeting, confirmed by Gamal Rushdy, a spokesman for the Arab League, comes as some Arab countries, including Egypt and Saudi Arabia, have opened up relations with Syrian President Bashar Assad and their foreign ministers have visited Damascus in recent weeks. Syria´s foreign minister also visited Cairo and the Saudi capital of Riyadh in April, the first such visits in more than a decade.Syria´s membership in the 22-member Arab League was suspended in the early months of the war 12 years ago, and Arab countries later imposed economic sanctions. The conflict has killed nearly a half million people since March 2011 and displaced half of the country´s pre-war population of 23 million.Saudi Arabia is hosting the next Arab League summit on May 19, when Syria´s membership is widely expected to be on the table. Some members, mainly gas-rich Qatar, have opposed Damascus´ return to the organization.In November 2011, 18 of the 22 members of the Arab League backed the suspension of Syria´s membership. Lebanon, Yemen and Syria voted against the decision, while Iraq abstained.Jordanian Foreign Minister Ayman Safadi told CNN that he believes there are enough votes among Arab League members for Syria to return to the organization.",
        "The meeting in Cairo on Sunday by Arab foreign ministers will focus on restoring Syria´s membership and comes at the request of Egypt and Saudi Arabia, said Rushdy, the Arab League spokesman.",
        "When asked about the vote count, Rushdy said Arab League decisions are resolutions usually made by consensus, but each country has the right to submit its reservations.An Iraqi diplomat who also spoke on condition of anonymity because he was not authorized to speak to journalists said that in addition to Syria and Sudan, the recent events in Israel and the Palestinian territories would be on the agenda.In recent years, as Assad consolidated control over most of the country with help from his main allies Russia and Iran, Syria´s neighbors have begun to take steps toward rapprochement. The overtures picked up pace since the massive Feb. 6 earthquake in Turkey and Syria, and the Chinese-brokered reestablishment of ties between Saudi Arabia and Iran, which had backed opposing sides in the Syrian conflict.Syria and Saudi Arabia said last month they were moving toward reopening embassies and resuming flights between the two countries for the first time in more than a decade.Syria´s pro-government Al-Watan daily reported Friday that a foreign ministry delegation visited the Syrian embassy in Riyadh recently in preparation to reopen the mission in the coming weeks.The foreign ministers will also discuss Sudan, which has plunged into chaos since fighting erupted in mid-April between the country´s two rival top generals, killing more than 400 people. The conflict started on April 15, preceded by months of escalating tensions between the military, led by Gen. Abdel-Fattah Burhan, and a rival paramilitary group called the Rapid Support Forces, or RSF, commanded by Gen. Mohamed Hamdan Dagalo.",
        "The fighting turned urban areas into battlefields and foreign governments rushed to evacuate their diplomats and thousands of foreign nationals out of Sudan.___Mroue reported from Beirut. Associated Press writer Qassim Abdul-Zahra contributed to this report from Baghdad."
    ]
}