{
    "articleURL": "/wires/aap/article-12055619/Rabbitohs-recall-left-speechless-Liam-Knight.html",
    "content": [
        "South Sydney forward Liam Knight admits his NRL recall quite literally left him speechless.",
        "Playing reserve grade for the Rabbitohs last July, Knight ruptured his anterior cruciate and medial collateral ligaments in a cannonball tackle, an illegal hit where a defender wipes the ball-carrier's legs out from behind.The dangerous shot enraged the Rabbitohs at the time but the prospect of spending up to a year out of the game was only the beginning of Knight's worries.In the pre-season, he opened up on his battle to overcome alcohol and prescription-drug dependency while he recovered from his injury, revealing he had spent a month getting clean in a rehabilitation facility.Once he checked out, the 28-year-old began focusing on making an NRL return and played his first game of reserve grade last week.Knight received a rousing reception at Souths' Maroubra training base when coach Jason Demetriou told the playing group the forward would be playing NSW Cup in round nine.A week later, Knight returned to the big league; coming off the bench in the Rabbitohs' Magic Round defeat of Melbourne.Saturday's game came little more than 10 months after the horror injury that upended Knight's world.\"(Demetriou) called me up on Tuesday and asked if I was keen,\" Knight said.\"I didn't think it'd be that quick. I was so excited, I didn't speak for at least 10 seconds.",
        "\"It's a lot of confidence he's given me, so I'm really grateful.\"That NRL recall was not just a feel-good news story for Demetriou.Injecting Knight into the contest as a ball-playing middle forward allowed captain Cameron Murray to have a spell on the bench, and the coach has been impressed by Knight's resolve on his journey back to the NRL.\"I saw enough from him in the reserve-grade game last week, and I've seen enough in him in the last three or four months, to know he was ready to step up,\" Demetriou said.Knight attended Alcoholics Anonymous after leaving rehab and has been dry for six-and-a-half months, but knows it has taken more than just his own efforts to get him back on the field.He has drawn strength from his teammates, and especially former housemate Jai Arrow.\"Jai's one of my best mates,\" Knight said.\"He got me through some tough times when we were living together and then after when I came back and started training again. He was massive for me.\"Now that he's back in action, Knight has only one goal: To continue repaying the Rabbitohs' faith with a view to earning a contract beyond 2023.\"I just need to take care of me and the rest will sort itself out,\" he said.",
        "\"I'm not too fazed by (the contract situation) at the moment.\"I'm in the best place I've been in.\"Six-and-a-half months off the p**s, which is probably the best thing for me.\"It's changed my life.\""
    ]
}