{
    "articleURL": "/wires/ap/article-12047099/Video-Game-HOF-winners-extended-reach-girls-grandparents.html",
    "content": [
        "ROCHESTER, N.Y. (AP) - The first commercial video game and the first one marketed to girls are headed to the World Video Game Hall of Fame, alongside a post-apocalyptic nail-biter and a system that made gamers out of grandparents.",
        "Computer Space, Barbie Fashion Designer, The Last of Us and Wii Sports were announced Thursday as the Hall of Fame's class of 2023.The Hall of Fame honors arcade, console, computer, handheld and mobile games that have influenced popular culture or the video game industry. This year's additions bring to 40 the number of games to be enshrined since its opening at The Strong museum in 2015.The winners were voted in by a panel of experts from a field of finalists that also included Age of Empires, Angry Birds, Call of Duty 4: Modern Warfare, FIFA International Soccer, Goldeneye 007, NBA 2K, Quake and Wizardry.Nutting Associates' coin-operated Computer Space appeared in 1971 as the first commercial video game and was recognized for proving that video games could reach paying audiences outside of the labs where they were being developed. It didn't garner the kind of commercial success that would bring video games to the masses, according to the hall, but it did lay the foundation for the gaming industry: The developers went on to establish the gaming giant Atari Inc.\"There was no video game industry in 1970. The games that we´d now call video games were still mostly locked away on computers in university and research labs, inaccessible to the public,\" Jeremy Saucier, assistant vice president for interpretation and electronic games at The Strong, said in a news release.",
        "Barbie Fashion Designer was the first video game to target girls, letting them design and print clothes for their Barbie dolls. It quickly took off, selling more than 500,000 copies in two months after its 1996 release by Digital Domain/Mattel Media. The game not only expanded the audience for video games but also began a discussion about gender and stereotypes in gaming that continues today, according to the Hall of Fame.\"Barbie Fashion Designer became a jumping-off point for the girls´ games movement and shook up the software and gaming scene,\" collections manager Kristy Hisert said. \"It also sparked important questions and debate. What does it mean to be a game for girls? Should there even be games `for girls´? What are the implications of these games? What are the consequences of gendering games?\"The Last of Us, with its memorable characters and storytelling, quickly stood out in the field of post-apocalyptic zombie games when it was released by Naughty Dog and Sony Interactive Entertainment. More than 200 publications named it the game of the year when it entered the scene in 2013. Ten years later, millions of viewers now tune in for the HBO series it inspired.\"The 2023 HBO adaptation has expanded the game´s reach and popularity. Created with Naughty Dog´s involvement, the show has garnered support from both critics and fans as one of the best video game adaptations ever made,\" video game curator Lindsey Kurano said.",
        "Wii Sports, which launched with the Nintendo Wii home video game system in 2006, was honored for putting motion-based technology into living rooms across the world, where anyone from young children to older adults could grab the controller and join in virtual bowling, tennis matches and rounds of golf. Community centers for older adults embraced the games for their health and social benefits.\"With more than 82 million copies sold, Wii Sports is one of the best-selling video games of all time, but its true influence comes from the fact that it made gamers out of millions of people around the world who´d never thought about playing one before,\" said Aryol Prater, research specialist for Black play and culture at The Strong.Anyone can nominate a game for consideration by the World Video Game Hall of Fame. The hall is set to move to an expanded space in The Strong in Rochester come June 30."
    ]
}