{
    "articleURL": "/wires/pa/article-12043891/How-record-breaker-Erling-Haaland-compares-Premier-League-scorers.html",
    "content": [
        "Manchester City striker Erling Haaland broke the record for most goals scored in a Premier League season with his 35th of the campaign against West Ham on Wednesday.",
        "His feat is even more impressive as the record of 34 was set in the league’s early 42-game seasons by Andy Cole and Alan Shearer.Here, the PA news agency looks at how Haaland compares.",
        "Andy Cole, Newcastle, 1993-94",
        "Appearances: 40 Goals: 34 Assists: 13Cole scored only once in the first four games but got 15 in the next 12, including all the goals in a 3-0 win over Liverpool and doubles against Sheffield Wednesday, West Ham and Oldham.Another hat-trick against Coventry and a standout performance in the return game with the Hammers, with a goal and three assists in a 4-2 win, were further highlights of his season. His 13 assists also led the Premier League as Newcastle finished third, making him the only man until Harry Kane in 2020-21 to top both charts outright.Alan Shearer, Blackburn, 1994-95",
        "Appearances: 42 Goals: 34 Assists: 13Shearer was ever-present as he equalled Cole’s record and led Blackburn to the title – like Cole, completing his tally with a goal on the final day of the season. He scored three hat-tricks – all in 3-0 wins at Ewood Park, against QPR, West Ham and Ipswich – and four doubles in his second of three straight 30-goal seasons.He matched Cole’s assists tally as well, ranking third in the top flight as he and strike partner Chris Sutton combined to set each other up on 13 occasions, a record broken by Kane two years ago in tandem with Spurs team-mate Son Heung-min.",
        "Erling Haaland, Manchester City, 2022-23",
        "Appearances: 31 Goals: 35 Assists: 7Haaland wasted no time making his mark in the Premier League – scoring two goals on his debut against West Ham, a record nine in his first five games and 15 in nine. He has four hat-tricks to his name and one more will equal Shearer’s record of five in a season set in his 31-goal 1995-96 campaign.His record-equalling penalty against Fulham at Craven Cottage last weekend brought up his half-century in all competitions, having scored 12 goals in eight Champions League appearances and four in the domestic cups, with his strike against the Hammers sending him clear in Premier League history.Haaland’s league assist tally, though in single figures, still ranks joint-sixth in the top flight this season, defying scrutiny of his perceived one-dimensional role in Pep Guardiola’s side.Roll of honour",
        "Haaland began hauling in previous Golden Boot-winning tallies as early as November 5 after 18 goals in his first 12 games.The 23-goal mark that has won the last three awards lasted only until January’s hat-trick against Wolves, which accounted for nine previous Golden Boot seasons in all, while he matched Mohamed Salah’s 38-game record of 32 in just 28 appearances.18 goals – Michael Owen, Dion Dublin and Chris Sutton 1997-98; Owen, Jimmy Floyd Hasselbaink and Dwight Yorke 1998-99 Appearances: 12 v Fulham (H), November 5",
        "19 – Nicolas Anelka 2008-09 Appearances: 14 v Leeds (A), December 2820 – Didier Drogba 2006-07; Dimitar Berbatov and Carlos Tevez 2010-11 Appearances: 14 v Leeds (A), December 28",
        "22 – Teddy Sheringham 1992-93; Mohamed Salah, Sadio Mane and Pierre-Emerick Aubameyang 2018-19 Appearances: 18 v Tottenham (H), January 1923 – Hasselbaink 2000-01; Jamie Vardy 2019-20; Harry Kane 2020-21; Salah and Son Heung-min 2021-22 Appearances: 19 v Wolves (H), January 2224 – Thierry Henry 2001-02 Appearances: 19 v Wolves (H), January 2225 – Alan Shearer 1996-97; Ruud van Nistelrooy 2002-03; Henry 2004-05; Kane 2015-16 Appearances: 19 v Wolves (H), January 2226 – Robin van Persie 2012-13; Sergio Aguero 2014-15 Appearances: 22 v Arsenal (A), February 15",
        "27 – Henry 2005-06 Appearances: 24 v Bournemouth (A), February 2529 – Drogba 2009-10; Kane 2016-17 Appearances: 27 v Southampton (A), April 830 – Kevin Phillips 1999-2000; Henry 2003-04; Van Persie 2011-12 Appearances: 27 v Southampton (A), April 831 – Shearer 1995-96; Cristiano Ronaldo 2007-08; Luis Suarez 2013-14 Appearances: 28 v Leicester (H), April 1532 – Salah 2017-18 Appearances: 28 v Leicester (H), April 1534 – Andy Cole 1993-94; Shearer 1994-95 Appearances: 30 v Fulham (A), April 30"
    ]
}