{
    "articleURL": "/sport/football/article-12053723/Barcelona-eye-cut-price-attacking-trio-Pierre-Emerick-Aubameyang-Yannick-Carrasco-Abde.html",
    "content": [
        "Barcelona must make up a financial deficit of £178million to sign any players Youngster Abde has impressed the club while out on loan at Osasuna this term Messi has been offered £320m-a-year at Al-Hilal but what would his life be like? Barcelona's summer plans are thought to revolve heavily around a return to the Nou Camp for icon Lionel Messi, however they have also highlighted further options should they part company with a number of attacking players. ",
        "It was confirmed earlier in May that Messi would be leaving PSG at the end of his current contract, with Barca, Inter Miami and Al-Hilal all linked with a move for the 35-year-old. But for the Blaugrana to have any chance of landing their former star they must sell players to make up a financial deficit to the tune of £178million before bringing in any new faces in summer. As such, the club are thought to have outlined further cut-price options to strengthen their ranks given that a number of players may have to depart in order to raise the necessary funds, as reported by Mundo Deportivo.Among that list is thought to be the attacking triumvirate of Atletico Madrid's Yannick Carrasco, former Barca star Pierre-Emerick Aubameyang, and the club's young loanee Abde Ezzalzouli, plying his trade at Copa del Rey finalists Osasuna. ",
        "And those potentially leaving the club to free up some much needed space in the budget are believed to include the likes of Raphinha, Ansu Fati and Ferran Torres in attack, as per the Spanish outlet.Belgium international Carrasco is believed to be available to the Catalan giants for around £13.3m (€15m) in the summer, with his contract at the Civitas Metropolitano up at the end of next season. ",
        "The deal to send Memphis Depay to Atleti in January reportedly included an agreement that Barca would be able to land their man for the outlined fee.His agent - Pini Zahavi - is a good friend of Barca chief Joan Laporta's, and the player is thought to have an admirer in Xavi, and would provide greater support as a left-footed right winger as a strong passer and dribbler on the ball.Raphinha is currently operating in that role, and Ousmane Dembele has starred at times this term, but the Brazilian is one such player rumoured to be departing the club.Aubameyang only departed last summer for Chelsea, but has since had a torrid time struggling for minutes and goals, and has been heavily linked with an exit just a year into his stay. The Gabonese striker still has two years left on a three-year deal signed at the start of the season at Stamford Bridge, but both Barca and the player are eyeing a free transfer. Though his output has been below par at the Blues, he did enjoy some success in his brief stint at the Nou Camp at the end of last season, having arrived from Arsenal. ",
        "In 24 games across all competitions, Aubameyang notched 13 goals and an assist, including a hat-trick against Valencia in his third game at the club. ",
        "The third prong of the budget trident could be made up by Abde, who has starred while on loan at Osasuna this season.Already on their books, his return would of course come as a bonus given he will cost the Blaugrana nothing, but now brings plenty of top-flight experience after his year on the road, grabbing five goals and two assists in 29 games. The Moroccan World Cup hero is highly regarded at the club, and only a seismic offer is believed to be capable of convincing Barca to sell. "
    ]
}