{
    "articleURL": "/news/article-12045185/Alyviahs-mother-breaks-silence-ex-boyfriend-shook-baby-daughter-death.html",
    "content": [
        "Alyvia Hayne killed in December, 2015Mother Brooke Skinner left baby in ex-boyfriend's careJake Luscombe, 27, pleaded guilty to manslaughter A grief-stricken mother whose baby girl was shaken to death by her ex-boyfriend has broken her silence after almost a decade as he pleads guilty to manslaughter. ",
        "Brooke Skinner left her seven-month-old Alyviah Hayne in the care of her former partner Jake Luscombe for just 41 minutes in December of 2015. She left her happy and bubbly baby in a red walker while she visited her father's home just up the road from her property in Grafton, in northeastern NSW. ",
        "When she returned 10 minutes later, her baby was frothing from the nose. Despite the frantic efforts of a neighbour and paramedics to revive the baby, the seven-month-old died at the home. In 2015, a cause of death was never confirmed. However, the findings of an inquest five years later saw Luscombe charged in 2022.Almost a decade later, Luscombe admitted to killing baby Alyviah, pleading guilty to manslaughter in Grafton Local Court on Tuesday. Ms Skinner was in the court when her former partner entered the plea. 'It's hard, but at least it's finally coming to an end,' she told 7News. 'I'm happy that she's finally getting justice, but no one wants to hear it, especially from the killer's mouth.'The inquest into Alyviah's death found she had suffered unexplained trauma to her body, bruising to her forehead and buttocks and had a swollen brain. An expert said one of two haemorrhages detected in the seven-month-old would have required a 'significant amount of force to occur'.",
        "They suggested 'vigorous shaking' may have caused her head to whiplash. The inquest heard Luscombe gave several accounts of what had happened, telling police he had given the baby a bottle and then left for 20 minutes. 'I gave her a bottle, she drank a little bit... and I came back 20 minutes later,' he said.No liquids or solids were found in the baby's stomach. ",
        "The seven-month-old was blue and cold to the touch, with mottling on both sides of her body, which commonly occurs the heart struggles to pump blood effectively.  In his first interview with police, Luscombe said he had been washing the dishes while Alyviah was asleep. In his second, the 27-year-old claimed he was downstairs cleaning the fish tank. After almost eight years of hiding her identity, Ms Skinner has come forward to share a heartbreaking message with every parent. 'Tell your kids you love them,' she said through tears. 'Because you may never be able to again.'She says her decision to leave her baby in Luscombe's care is one that she regrets every day but that she was happy to receive justice. Alyviah would have celebrated her eighth birthday this year. Luscombe is due to face sentencing at Coffs Harbour District Court later this month. "
    ]
}