{
    "articleURL": "/sport/mma/article-12045901/Conor-McGregor-revels-Paradigm-Sports-legal-battle-win-Manny-Pacquiao.html",
    "content": [
        "Jury in California sided with Paradigm Sports over Manny Pacquiao in big caseThey will be awarded damages and Pacquiao also has to cover legal fees Conor McGregor took to social media to revel in the successful law suit Conor McGregor is revelling in his management company Paradigm Sports winning a high profile law suit against legendary boxer Manny Pacquiao. ",
        "The Irishman, who is the most famous athlete on the books of Paradigm Sports, took to social media after the company successfully brought a case in California for breach of contract. In total, Pacquiao owes $8million (£6.3m), with £4m in damages, £1.7m in legal fees and additional 10 percent annual interest on the verdict amount for three years. McGregor took to social media, replying to one tweet of the news, writing: 'And don't let it happen again, @MannyPacquiao.'And in a now-deleted tweet, the Dubliner also wrote: 'Manny owes 8 in all. 5.1 he owes and then 2.1 in legal costs. Legal fees are heavy but that's what we do. Heavy weight operations. ",
        "'Rartem, you already owe me two rounds of court fees, awarded by the judge. There will be a judgement put on your home as this...', and tweet cuts off.The Orange County jury voted 9-3 in favor of Paradigm in the case. 'We are elated to learn of the jury’s ruling in Paradigm’s favor in our suit against Manny Pacquiao,' Paradigm CEO Audie Attar said in a statement. 'The jury plainly found that Pacquiao testified falsely in denying Paradigm’s claims against him, and his excuses for his conduct proves our case that a breach of contract was committed.'We are appreciative of the court’s time and the jury’s careful attention to the facts of this case. ",
        "'Hopefully, Manny will have learned a lesson from the verdict and will henceforth act with the honesty and integrity that was so lacking in his treatment of Paradigm.'Paradigm signed Pacquiao as a client back in 2020 and McGregor tweeted that they were trying to arrange a fight between the legendary Filipino boxer and Mikey Garcia. ",
        "The fight then fell off, allegedly due to interference from Pacquiao's other representatives and he then worked with Al Haymon’s Premier Boxing Champions instead.It led to Paradigm filing the lawsuit, which 44-year-old Pacquiao lost, as well as the jury ruling that he acted in bad faith. For a time it appeared as though McGregor himself might fight Pacquiao in a huge crossover bout similar to the one he lost against Floyd Mayweather in 2017. That never materialised and Pacquiao has now retired from professional boxing, juggling his work in politics as a Senator with lucrative exhibition matches."
    ]
}