{
    "articleURL": "/femail/article-12048675/CBD-face-acne-treatment.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "Are you tired of dealing with pesky acne breakouts? Beauty lovers are raving about a CBD face oil they claim 'works wonders', helping to reduce the frequency and appearance of blemishes.The KLORIS CBD Superboost Face Oil, which users praise as a natural treatment for acne-prone skin, contains a powerful 600mg dose of premium CBD oil.   KLORIS CBD Superboost Face Oil, 10ml  With a powerful 600mg dose of premium CBD oil, a proven antioxidant, the KLORIS CBD Superboost Face Oil revitalises stressed and problematic skin.Suitable for all skin types, it's supercharged with anti-inflammatory Hemp Seed Oil, skin-plumping and glow-inducing Squalane and Cucumber Seed Oil which provides long-lasting moisturisation while promoting the regeneration of healthy skin cells.And for a limited time, you can save 10 per cent on the KLORIS CBD Superboost Face Oil using discount code CLEARSKIN10 at checkout. £27 (save £3) Shop",
        "CBD, or cannabidiol, is a compound extracted from the cannabis plant. It has been shown to have anti-inflammatory and antibacterial properties, making it a promising treatment for acne.When applied topically, CBD oil can help reduce redness, inflammation, and irritation associated with acne.And for a limited time, you can save 10 per cent on the KLORIS CBD Superboost Face Oil using discount code CLEARSKIN10 at checkout.",
        "Dozens of users have credited the face oil, which is completely vegan and cruelty-free, with transforming their complexions, calling it a 'great product for helping with acne', noting their skin is 'much clearer' and 'less inflamed' since incorporating it into their skincare routine.",
        "'I've suddenly developed acne around chin area,' one five-star reviewer shared. 'This facial oil has calmed it down, reduced the redness &amp; cleared up all the spots in a couple of weeks.''I've noticed an improvement in my skin particularly as I suffer from acne around my nose and mouth,' a second shopper wrote. 'And using a few drops at night does seem to calm the redness and reduce the spots.'",
        "A third user agreed, raving: 'THE best! I suffer from psoriasis and had psoriatic spots on my face - after using this oil the spots have gone away, my skin is smooth and hydrated. Never been happier!'Some credit the natural face oil with calming redness and treating flaky and dry skin.'Only used for three days and can really feel and see the difference skin is so soft I had bad dry patches, but they have all gone.'Suitable for all skin types, the KLORIS CBD Superboost Face Oil is supercharged with anti-inflammatory Hemp Seed Oil, skin-plumping and glow-inducing Squalane and Cucumber Seed Oil which provides long-lasting moisturisation, while promoting the regeneration of healthy skin cells.",
        "Add three to eight drops daily to skin, either before or after cleansing or blended with moisturiser to boost your skin's vitality and natural defences.",
        "It's important to note that CBD oil is not a miracle cure for spots. Consistency is key when it comes to treating spots, so be patient and stick to a consistent skincare routine.If you're struggling with severe or persistent spots, it's best to consult with a dermatologist.   "
    ]
}