{
    "articleURL": "/news/article-12046323/Clay-Travis-says-Bud-Light-faces-unmitigated-disaster-Dylan-Mulvaney-tie-up.html",
    "content": [
        "Bud Light angered some by partnering with Dylan Mulvaney to promote the beerOutKick founder Clay Travis says the company has 'alienated' male customersREAD MORE: Anheuser-Busch CEO FINALLY disavows Dylan Mulvaney Bud Light partnership and says 'it was not a campaign'Clay Travis has claimed Bud Light faces an 'unmitigated disaster' after sales plummeted 26 per cent following the beer company's partnership with transgender influencer Dylan Mulvaney.",
        "The beer brand presented Mulvaney with personalized cans featuring her face, which she promoted on April 1, sharing clips of them with her over 10 million TikTok followers.Conservative commentators and Bud Light consumers - among them Tomi Lahren and Kid Rock - responded with a boycott of Bud Light, and around $5 billion was wiped off the value of the brand.Two senior marketing executives have taken leave of absence amid the fiasco and the company has released commercials which appear to be aimed at winning back conservative audiences.Now the OutKick founder and political commentator Travis has waded in saying Bud Light has 'broken' its brand with the ad, while its marketing previously involved 'football', 'party', 'humor' and 'pretty women'.",
        "'For Bud Light, I think this is an unmitigated disaster, it is completely and totally self-inflicted and I don't really know how they are going to climb out of this mess,' he told Fox News.The founder of college football site OutKick said the slump in sales has proven to other brands that there can be consequences for 'going super-woke'. The OutKick the Show host, who boasts about being banned from CNN and ESPN for being 'too honest', argued that men, Bud Light's key demographic, don't respond well to transgender influencers.",
        "'I think it's emblematic of Bud Light not really understanding who their consumer is and really alienating [customers].'Because let's be honest, who was Bud Light really going to add by advertising in this manner versus the people that they alienated.'They used to make everybody laugh, they used to sell football, they used to sell party, they used to sell, let's be honest, humor and also pretty women. 'That was the way you got men to buy beer and that's none of these things,' he claimed.Bud Light released a 'countrified' ad this week, which many have said is pandering to more traditional themes associated with its customer base, showing four friends  at a country music festival with the song Chicken Fried playing.The ad, which debuted during the Thursday NFL Draft, had the comments switched off on YouTube as the controversy continues. It comes after another attempt to placate fans with a 'back-to-basics' Clydesdale Budweiser advert , released soon after Mulvaney's promotions of Bud Light.On Sunday, Beer Business Daily reported that the beer's off-premise sales volume - meaning the amount of beer sold outside of restaurants and bars - had fallen by 26.1 percent from a year earlier in the week ended April 22.",
        "Sales were down 21.1 percent in the prior week. While competitors, Coors Light and Miller Lite, saw consumers turning to their brands as both have had an increase in sales.",
        "So far this year, Bud Light volumes are down 8 percent.'The shocking deterioration of Bud Light Blue's market share continued apace through the third week of April – and actually somehow worsened.'We've never seen such a dramatic shift in national share in such a short period of time,' Beer Business Daily wrote on its website.Coors Light's volume was up 13.3 percent for the same time period, and Miller Lite rose 13.6 percent."
    ]
}