{
    "articleURL": "/wires/ap/article-12047301/Lawyer-Trump-seeking-criminal-case-federal-court.html",
    "content": [
        "NEW YORK (AP) - Donald Trump 's lawyers have asked a federal court to take control of his New York City criminal case. They argued Thursday that the former president can´t be tried in the state court where his historic indictment was brought because the alleged conduct occurred while he was in office.",
        "In court papers, Trump's lawyers said the criminal case \"involves important federal questions,\" including alleged violations of federal election law. Federal officers, including former presidents, have the right to be tried in federal court for charges arising from \"conduct performed while in office,\" the lawyers argued.Echoing Trump's claims that his indictment is \"politically motivated,\" lawyer Susan Necheles urged the federal court to exert its \"protective jurisdiction\" and seize the case from the state courts where Manhattan District Attorney Alvin Bragg routinely practices.Such requests are rarely granted in criminal cases, although Trump's request is unprecedented because he´s the first former president ever charged with a crime.\"This effort is extremely unlikely to succeed,\" said Rebecca Roiphe, a professor at New York Law School. \"It´s not even clear that this would be a particularly effective delay tactic.\"Moving the case could give Trump some advantages, such as a broader, more politically diverse jury pool - but the fundamentals of the case would remain largely intact.The Manhattan district attorney's office would still prosecute him and state law would still apply, but with the oversight of a federal judge, said University of Iowa law professor Derek Muller.\"It´s essentially just a change in courthouses,\" Muller said.Trump´s attorney, Todd Blanche, first raised the prospect of moving the case to federal court during a state court hearing Thursday where a judge indicated he'd put limits on Trump's access to certain evidence, as prosecutors requested.",
        "But Judge Juan Manuel Merchan said he wouldn't issue a gag order or bar Trump from speaking publicly about the case.Trump´s lawyers faced a Thursday deadline to file paperwork seeking to move the case - 30 days after the April 4 state court arraignment where he pleaded not guilty to 34 felony counts of falsifying business records.A federal judge will now weigh whether to grant the request. While that plays out, the case will proceed in state court and all pretrial deadlines will remain in effect.\"It is possible to remove a state prosecution to federal court but the reasons for doing so are narrow and none seem to apply in this case,\" Roiphe, a former Manhattan prosecutor, said.Prosecutors didn't address the request during Thursday's hearing. Manhattan District Attorney Alvin Bragg´s office issued a statement saying it was reviewing the request to transfer the case and would file an \"appropriate response\" with the court.The criminal charges are related to payments Trump's company made to his former lawyer, Michael Cohen. Prosecutors say those payments, most of which took place in 2017, while Trump was president, were intended to reimburse and compensate Cohen for orchestrating hush money payments during the 2016 campaign to bury allegations of extramarital sexual encounters.",
        "Federal prosecutors in Manhattan previously investigated and only charged one person: Cohen, who pleaded guilty to violating federal campaign finance law in connection with the hush money payments. Cohen is a key witness in the state case against Trump.Trump, a Republican, has denied wrongdoing and pleaded not guilty.Earlier in the hearing Thursday, the judge sought to broker a compromise between Trump´s lawyers and prosecutors, who raised concerns that he would use evidence obtained in the pretrial discovery process to attack witnesses and other people involved in the case, as he has in the past.Merchan, a target of Trump's social media ire in the wake of his indictment, did not rule on the prosecution's request for what's known as a protective order. But he suggested he wants to balance the sanctity of the case, the safety of people involved, and Trump's free speech rights.The judge said Trump's fame and megaphone make him different from other criminal defendants, but \"with that comes responsibility that his words, especially when used in the form of rhetoric, can have consequences.\"Blanche said Trump wasn't seeking to put evidence on social media nor was he objecting to a prosecution request, based in part on safety concerns, to keep identifying information about district attorney's office employees secret until the trial starts.",
        "Once he rules, Merchan said, he will hold a hybrid conference - lawyers in court, Trump appearing by video - where he will apprise him of the dos and don'ts of his impending order.Merchan asked the defense and prosecution to agree on a trial date in February or March 2024. Barring removal to federal court, that could land Trump, who´s making a comeback run for the White House, in court during next year´s primaries.William Dow III, a Connecticut attorney for more than 50 years, said he´d never heard of a state criminal case being removed to federal court. He said such moves are a delaying ploy.\"Sometimes people who want to run away from their problems take any avenue that´s available, whether it´s accurate or not. I think this (Trump´s case) is subject to that interpretation,\" said Dow, whose clients have included former Connecticut Gov. John Rowland in a political corruption case that forced him to resign in 2004.___Associated Press reporter Dave Collins in Hartford, Connecticut, contributed to this report.___Follow Michael Sisak on Twitter at twitter.com/mikesisak and send confidential tips by visiting https://www.ap.org/tips/"
    ]
}