{
    "articleURL": "/news/article-12042427/Russian-F1-racing-driver-Nikita-Mazepin-launches-High-Court-fight-against-Government-sanctions.html",
    "content": [
        "Russian racing driver Nikita Mazepin, 24, and father Dmitry face UK sanctionsMazepin has launched legal action against Foreign Secretary James CleverlyRussian racing driver Nikita Mazepin has begun a High Court fight with British Government ministers after being made subject to sanctions in the wake of Russia's invasion of Ukraine.",
        "Mazepin, 24, who used to drive for the Haas Formula 1 Team, wants sanctions lifted and has taken legal action against Foreign Secretary James Cleverly.A judge considered preliminary issues at a High Court hearing in London today.Mr Justice Chamberlain heard that Mazepin and his father Dmitry Mazepin - a Russian businessman and ally of Vladimir Putin - had been made subject to sanctions in mid-March 2022.In September 2022, Mazepin requested 'revocation of his designation', but ministers decided to 'take no action'.",
        "A judge is due to oversee a further hearing in London in June.Mr Justice Chamberlain was told that Mazepin was involved in a similar bid to get sanctions lifted in Canada.Neither Mazepin nor his father were at the hearing.",
        "Barrister Tom Leary, representing Mr Cleverly, told the judge that Haas had 'terminated its relationship' with Mazepin in early March 2022, following the outbreak of war.He said Mazepin had not driven for a Formula 1 team since.Mazepin and his father were 'subject to an asset freeze and travel ban', the judge was told.Mr Leary indicated that one of the reasons Mazepin wanted sanctions lifted was so that he could travel to Britain to negotiate with race teams for the 2024 season.Mr Justice Chamberlain suggested that a trial judge might have to stage part of the proceedings in private in order to consider any 'closed' material presented by ministers.",
        "Barrister Rachel Scott, representing Mazepin, told Mr Justice Chamberlain in a written case outline: 'The UK sanctions to which he has been made subject, alongside the imposition of restrictive measures at EU level, effectively ended his racing career.'He missed the 2022 season and, almost certainly, the 2023 season and, whilst those sanctions are in place, no Formula 1 team will take him on as a test, reserve or full driver.'She added: 'The claimant will, in effect, be unable to negotiate a place on a Formula 1 team for 2024 unless he is free to travel to and from the UK to attend negotiations at teams' bases in the UK, bearing in mind that seven of the ten teams are based in the UK.'Negotiations to join a Formula 1 team usually begin in May or June of the previous year. Thereafter he must be able to enter the UK, not just for the British Formula 1 race, but for briefings, ergonomics design work, training and attending the team's base.'Last month, Mr  Cleverly announced a raft of penalties targeting those who knowingly assisted the oligarchs as they scrambled to hide their assets in complex financial networks.Among those sanctioned are the wife and daughter of billionaire Vladimir Yevtushenkov, the the largest shareholder in the Russian IT company Sistema.",
        "Also targeted in the new sanctions is popular Russian television presenter Oksana Marchenko, the wife of key Putin ally Victor Medvedchuk, and owner of multiple luxury properties in Crimea.",
        "The TV star, and friend of Putin, has previously begged for the release of her husband from a Ukrainian prison on video.These 'financial fixers' have been hit with asset freezes, travel bans, transport sanctions and trust services sanctions, the Foreign, Commonwealth and Development Office said.The new measures will affect Gulnara Kerimova, the daughter of Putin-linked oligarch Suleyman Kerimov, who holds four luxury villas in France on behalf of her father. The penalties have also hit Tatiana Yevtushenkova, who has been the acting director of firm Redline Capital which is owned by her father, Vladimir Yevtushenkov.Billionaire Yevtushenkov owned a company which reportedly supplied Putin's forces with drones used for deadly bombing raids in Ukraine and until 2021 owned key Russian defence contractor RTI.The financial sanctions also extend to his wife, Natalia Yevtushenkov, who holds board positions in banks and other companies in which her husband owns stakes, including MTS Bank."
    ]
}