{
    "articleURL": "/wires/reuters/article-12041801/Rockies-Kyle-Freeland-bids-track-vs-Brewers.html",
    "content": [
        "The Colorado Rockies likely will rely even more on Kyle Freeland after losing one of the anchors of their rotation.",
        "German Marquez, who along with Freeland formed the top part of Colorado's starting staff, said Tuesday he will need Tommy John surgery. The Rockies will have to fill the hole in the rotation -- likely with right-hander Antonio Senzatela, who is returning soon from a torn ACL. Regardless, it will be tough to replace Marquez's effectiveness.Freeland will do his part to save Colorado's sinking season on Wednesday when he gets the start against the visiting Milwaukee Brewers in the second contest of the three-game series in Denver.Freeland (2-3, 4.32 ERA) will square off against Milwaukee's Eric Lauer (3-2, 5.19) in a battle of left-handers.Freeland has struggled since winning his first two starts of the season. After recording his last win on April 6 against the Washington Nationals, he left his next start versus the St. Louis Cardinals with a lead and then allowed 14 earned runs combined over his next three outings.Freeland pitched relatively well in his last start against the Arizona Diamondbacks on Friday but was tagged with the loss despite having a quality start.He is 3-2 with a 2.32 ERA in five career starts against the Brewers.The Rockies have lost 20 of their first 30 games and have committed the most errors in the National League (21, tied with San Francisco), so there are few bright spots. Catcher Elias Diaz has provided many of those happy moments, and he added a few in Tuesday night's 3-2 win over the Brewers.",
        "Diaz belted a 453-foot solo homer in the fourth inning and drove in the winning run with an RBI single in the eighth.He said he has shed the pressures of his contract and focused on playing in the moment.\"I don't worry about anything,\" Diaz said. \"I just go day by day. I take care of today. I don't know what's going to happen tomorrow, so what matters is today.\"Diaz and his Colorado teammates can pad their stats against Lauer if history is a barometer. Lauer is 1-5 with an 8.39 ERA in 11 career starts against the Rockies, and the numbers get worse in Denver. Six of his starts have come there, where he is 0-5 with a bloated 15.91 ERA.Milwaukee outfielder Tyrone Taylor made his season debut on Tuesday after being sidelined with a right elbow sprain. His return adds depth to the roster.Taylor said he has been dealing with the injured elbow since last season and throughout the offseason. He received a platelet-rich plasma injection and said he's healthy enough to play.\"It feels good,\" Taylor said. \"It's something that's going to be there probably the rest of the season, but it's feeling a lot more manageable than it was.\"It looked fine in the fourth inning on Tuesday night when he threw home from right field to nab Randal Grichuk, who was trying to score on a flyout by Ezequiel Tovar.",
        "--Field Level Media"
    ]
}