{
    "articleURL": "/news/article-12046691/Banking-fears-flare-PacWest-scrambles-buyer-cash-injection.html",
    "content": [
        "PacWest on Thursday confirmed it is considering 'all options' including a saleFirst Horizon said TD Bank called off merger due regulatory approval issuesDevelopments renewed anxiety about the stability of the US banking sector Concerns about the US banking system are rising once again, after Pacific Western Bank and First Horizon Bank both issued updates that rattled investors.",
        "Los Angeles-based PacWest confirmed early on Thursday it was considering 'all options' including asset sales.Tennessee-based First Horizon revealed that its $13 billion merger agreement with TD Bank has been terminated.PacWest shares were down 45 percent in early trading, while First Horizon stock slid as much as 40 percent, and anxiety over the potential for contagion pummeled shares of other regional banks.It came just hours after Federal Reserve Chair Jerome Powell sought to assuage fears following the failures of three banks since March, saying at a Wednesday press conference that 'the US banking system is sound and resilient.' A number of banks have been knocked off balance by the Fed's fight against inflation, and the central bank this week raised its key interest rate again by a quarter-point, to the highest level in 16 years.",
        "On Sunday, San Francisco-based First Republic Bank was seized by federal regulators and sold to JPMorgan Chase, in the second-largest bank failure in US history.If followed the collapse last month of Silicon Valley Bank and Signature Bank of New York, which are now the third and fourth largest bank failures in US history.In all three cases, concerns about the banks' balance sheets led to a rush of customers withdrawing deposits that tipped them into failure. ",
        "PacWest and First Horizon are both smaller than the three recently failed banks. PacWest has assets of roughly $40 billion, while First Horizon has about $79 billion in assets. Concerns about PacWest emerged on Wednesday night, with reports that the company was exploring strategic options, including a sale or injection of fresh capital.In a statement early Thursday, the bank insisted that it had not experienced out-of-the-ordinary deposit flows following First Republic's failure over the weekend.'Core customer deposits have increased since March 31, 2023, with total deposits totaling $28 billion as of May 2, 2023 with insured deposits totaling 75% vs. 71% at quarter end and 73% as of April 24, 2023,' the statement said.However, PacWest confirmed it was continuing to explore 'all options' including strategic assets sales and discussions with 'several potential partners and investors'.Investors have viewed PacWest as vulnerable in part because it is especially exposed to fluctuations in commercial real estate.Analysis by Barrons found that commercial real estate loans amounted to more than 375 percent of PacWest's capital at the end of December - significantly above the 300 percent level recommended in federal guidelines.Furthermore, the most volatile real estate loans, for land and construction, represented almost 140 percent of the bank's capital, which represents its cushion for loan losses.",
        "Meanwhile, First Horizon issued a statement early Thursday saying that its previously announced merger deal with Canadian giant TD Bank had been terminated.The merger was first announced in February, before the early signs of problems in the banking system, but the two banks insisted that the deal had been called off due to regulatory issues, rather than any concerns about First Horizon's stability.'TD informed First Horizon that TD does not have a timetable for regulatory approvals to be obtained for reasons unrelated to First Horizon,' the statement said. 'Because there is uncertainty as to when and if these regulatory approvals can be obtained, the parties mutually agreed to terminate the merger agreement,' it added.The deal faced greater scrutiny given recent events in the banking system, and TD Bank has sizeable operations in the US, potentially raising antitrust issues with regulators. Meanwhile, fears of contagion and instability drove down stock in other regional banks in the pre-market  Western Alliance Bancorp shares slumped 15 percent despite its efforts to reassure investors that it had not seen unusual deposit outflows ",
        "Zion Bancorporation tumbled 10.0 percent and Comerica fell 7.5 percent, while KeyCorp and Valley National Bancorp dropped 8 percent and 5 percent. The SPDR S&amp;P Regional Banking ETF shed 3.7 percent.",
        "The common theme among the banking stocks that have sold off sharply is that they reported large deposit declines in the first quarter with operations in California, said Truist Securities analyst Brandon King, while calling the selloff 'overdone.'Others expressed fears that anxiety about regional US banks could continue to rattle the sector without stronger intervention from regulators. 'It was hoped that the First Republic's assets being purchased by JPMorgan would stabilize the rest of the sector, but it's still a question of confidence,' said Rick Meckler, partner at Cherry Lane Investments.'I don't think we want to be a country of just five huge banks, so the Treasury Department is going to have to get involved in trying to stabilize the situation a little bit more.'"
    ]
}