{
    "articleURL": "/wires/afp/article-12054047/Togolese-rush-register-elections.html",
    "content": [
        "Togolese student Sarath Sidibe tried to get her name on the electoral register for three days, hoping to vote in her country's legislative and local elections later this year.",
        "But between missing papers, broken registration machines, and above all the crowds, the 22-year-old struggled to get it done. Still, she did not give up.\"This is the first time that I want to vote and I want to get my voter card,\" she said. \"I want things to change in this country.\"After boycotting the last elections, Togo's opposition has called for a registration surge, hoping to challenge President Faure Gnassingbe, who has ruled Togo since 2005 after the death of his father -- who governed before him for nearly four decades.Since coming to office, Gnassingbe has won every election, though the opposition challenged all those results.Starting last week, including in the capital Lome, the voter registration appears to have generated widespread enthusiasm, and the Independent National Electoral Commission said late Friday that it was extending the deadline.Initially set for Saturday, registration will now continue until May 8, the commission's president Dago Yabre said in a statement.Many Togolese were angry over logistical problems and delays getting their voters card.\"The cards are ready and no one is attending to us. It's really unfortunate,\" said one woman in a group of agitated young people sitting in front of a Lome school set up for voter registration.Opposition leaders have criticised the process and were calling for an extension.",
        "\"The mess we are seeing is the result of poor preparation and the clear desire to limit as much as possible the registration of the populations of this area,\" the National Alliance for Change coalition said in a statement.- 'I have to vote' -No date has been announced for the elections, but they are to be held later this year, Gnassingbe said in December.The main opposition political parties boycotted the 2018 legislative elections and the electoral census, after denouncing \"irregularities\".But leaders of the main opposition parties have been mobilised for several months, calling on supporters to \"massively\" get out to sign up.Since Monday, long queues have formed every day at several centres in the capital where voter cards are issued.In front of the public primary school Be-Aklassouou, supermarket worker Evariste Toganou, 38, was losing patience.\"I'm going to get my voter card regardless of the hassle. Because this time, I have to vote,\" said Toganou, who did not vote during the 2018 poll.\"The 'real opposition' must regain its place in the National Assembly to properly control those who lead us.\"In 2018, Gnassingbe's party won a majority of 59 seats out of 91 in the National Assembly, after the leaders of the main coalition of 14 parties did not present any candidates.",
        "The opposition coalition decided to boycott after more than a year of political standoff and dozens of violently suppressed protests against a reform authorising the president to run for re-election in 2020 and 2025.Gnassingbe came to power after the death of his father, General Gnassingbe Eyadema, who ruled Togo with an iron fist for 38 years.The West African country of around eight million is ranked among the poorest in the world, and is also struggling with attacks from jihadists from across its northern border with Burkina Faso.After the voter registration ends in Lome, it will take place in other parts of the country until June 3."
    ]
}