{
    "articleURL": "/tvshowbiz/article-12059199/Bikini-clad-Lottie-Tomlinson-soaks-sun-poolside-son-Lucky.html",
    "content": [
        "She is soaking up the sun on an idyllic family holiday. ",
        "And Lottie Tomlinson, 24, was sure to keep her fans up to date with her Ibiza trip as she shared a slew of snaps showing her fun and frolics with her boyfriend Lewis Burton, 30, and their nine-month-old son Lucky.The star, who is the younger sister of 1D's Louis Tomlinson, looked sensational in a blue bikini as she larked around with her beloved baby and boyfriend. Ensuring she was at her influencer best, her make-up was preened to perfection for the outing, despite being poolside, while Lewis was showing his buff figure. Little Lucky looked adorable in a sun-protecting hat as he cosied up to his parents, including in a stunning snap showing Lottie offering a kiss to the tot.  ",
        "Seemingly in a nod to their transformed lifestyle, she added a caption reading: 'our new Ibiza normal @bambukuibiza the best day thank you'.  The holiday comes after the blonde beauty was pictured having a heated exchange with her boyfriend Lewis in central London last month.The couple appeared to be hashing things out during an tense chat. Lewis waved his arms in the air while in mid discussion with Lottie - who he began dating in 2020.When approached for comment, Lottie's representatives told MailOnline: 'There were no tense conversations and they are happy.' The pair took a night off from parenting duties to celebrate Lottie's sister Daisy Tomlinson's birthday.",
        "Lottie and Lewis announced the birth of son Lucky in a sweet Instagram post on August 9, 2022. Alongside a picture of Lucky, she wrote 'dreams do come true', while a post from her sister Phoebe confirmed the couple had welcomed a baby boy.Lottie and former tennis player Lewis confirmed their relationship in July 2020. The pair are said to have bonded over the grief of losing their respective loved ones.",
        "She sadly lost her mother and sister in recent years and Lewis lost ex-girlfriend Caroline Flack in February 2020.Lottie's sister Félicité, 18, died after an accidental drug overdose, three years after the death of her mother Johannah, who died of cancer.It's understood Lottie became better acquainted with Lewis at a house party in May 2020 hosted by Caroline's close friend Lou Teasdale, 36, which was held to mark three months since her tragic passing.In late July that year, a source exclusively told MailOnline: 'Lewis and Lottie have grown close after spending time together at a party at Lou's house.'They have been meeting up in secret for weeks but their newfound friendship hasn't gone unnoticed by mutual pals.",
        "'Not all of Caroline's friends are happy with how the situation appears to be developing but can understand that both Lottie and Lewis have been there for each other as a shoulder to cry on.'",
        "Caroline died by suicide in her London home at the age of 40, days before she was due to face trial for assaulting Lewis, with whom she had been in a relationship for just over six months.The star was arrested in December for assault and charged with attacking the model at her home in Islington. Lewis dropped his assault complaint against Caroline yet prosecutors pursued the case and the couple was told not to have any contact.It was confirmed following the inquest that Caroline took her own life after hearing she would definitely be prosecuted for assaulting her boyfriend, a coroner ruled."
    ]
}