{
    "articleURL": "/wires/aap/article-12045499/Deputy-premier-slams-critics-politicising-tragedy.html",
    "content": [
        "Queensland's government has defended its approach to youth crime and touted the results of a young offenders program as it remains on the defensive following a tragic car crash.",
        "Deputy Premier Steven Miles accused critics of politicising the recent deaths of three people allegedly caused by a 13-year-old driving a stolen car, and challenged LNP leader David Crisafulli to outline a better approach.\"The only policy I can see is mandatory detention,\" Mr Miles told reporters on Thursday.\"Is he suggesting he would increase youth detention capacity by 10 times to detain every single young person who is charged?\"He defended the state's action on youth crime following the introduction of harsher penalties and expanded programs introduced this year, and said Labor would continue \"to take the advice of police, of the Justice Department, of the courts, of experts\".Mr Miles' comments came a day after Premier Annastacia Palaszczuk said the government's tougher youth crime laws needed time to work.The opposition leader says Queenslanders continue to demand reform on youth justice.\"They want to see the unshackling of the judiciary and the removal of things like detention as a last resort,\" Mr Crisafulli said on Wednesday.The Palaszczuk government has encountered widespread community anger over the issue following Sunday's triple-fatal collision involving the stolen Mercedes in Maryborough.The teenager has faced court charged with three counts of dangerous driving causing death.Amid the criticism, the government on Thursday pointed to a study suggesting a police-sponsored program in Cairns has significantly reduced offending among its teen participants.",
        "The Sunshine Coast University research also found young people who completed the program were less likely to commit violent offences.The You Got this initiative, by the academy of rugby league legend Johnathan Thurston, is designed to boost the courage and self-belief of disadvantaged people aged between nine and 16 years.Of 10 participants who had offended in the 12 months before the program, only one committed a criminal offence within the following nine months.\"I think it's 80 per cent of the kids that are in the system are Indigenous. That breaks my heart,\" Thurston said in Cairns on Thursday.\"We want to help them make better choices and and better decisions.\"The academy was started to help change lives and that's what we're doing.\"You Got This is funded by the Community Based Crime Action Committees initiative and Police Minister Mark Ryan said \"we are seeing terrific outcomes as a result of the hundreds of CBCAC programs being rolled out across the state\"."
    ]
}