{
    "articleURL": "/news/article-12056031/UK-weather-latest-Coronation-Big-Lunch-Windsor-Castle-concert.html",
    "content": [
        "22C temperatures would make today the UK's warmest day of the year so far Best of weather conditions will be in London and the South East this afternoonBritons could enjoy the warmest day of the year so far today with temperatures rising to 22C (72F) as ten million people enjoy the Coronation Big Lunch outdoors.",
        "The best of the weather will be in London and the South East this afternoon, with pleasant conditions also expected in Windsor for the Coronation Concert tonight.Most of the UK will see good periods of sunshine today and it will be mainly dry, but large areas of cloud cover will bring a threat of showers to some eastern areas.The sunny forecast is a stark contrast to the washout conditions in London for the Coronation yesterday which resulted in the military flypast being scaled back.The Met Office said temperatures could 'could get to 22C in the South East' today, while the South West and North should see 18C (64F) and the Midlands 20C (68F). Scotland and Wales will also see 18C, while Northern Ireland will get to 17C (63F).",
        "The expected highs this afternoon would make it the UK's warmest day of the year so far - beating the 21.2C (70.2F) recorded on April 17 at Kinlochewe in Scotland.",
        "Up to ten million people could attend an estimated 67,000 Big Lunches across Britain to celebrate the Coronation today - up from the 17,000 held last June for Queen Elizabeth II's Platinum Jubilee. The Met Office said today will start off dry and bright in many western areas, but cloudier with some rain and drizzle in the East.",
        "Western and central parts of Britain are then expected to have a mainly fine, warm and dry day with sunny spells, which will eventually spread to all areas.However, forecasters said the early cloud and rain in the East may break out into slow moving heavy and locally thundery downpours.They added that parts of North East England and eastern Scotland could remain fairly grey, wet and cool throughout the day.But the Met Office also said tomorrow will be much wetter across the country.Eastern areas will start out mostly dry but cloudy or murky, while an area of heavy rain and showers in the West will sweep eastwards throughout the day bringing downpours to most places.The far north of Scotland has the best chance of a drier, and warmer, day.While drier weather will develop into the West later, it is likely to remain cloudy with patchy rain or drizzle, especially on hills.The outlook for the rest of the week remains unsettled with more heavy showers and thundery outbreaks expected, particularly on Tuesday and Wednesday.",
        "Yesterday, thousands of Britons braved rainy weather and grey skies over London to witness the coronation pomp and pageantry.",
        "In true British style, rain has fallen on the last five coronation days, according to Met Office analysis.A trawl through the archives by weather experts shows that rain fell on all four coronation days before yesterday's ceremony, including that of the late Queen in 1953.Crowds in London for the coronation of King Charles III were also forced to put up umbrellas and wear plastic ponchos as rain dominated yesterday.A Met Office spokesman said: 'Rain on coronations seems to be a running theme - for the coronation today, we saw rain.'It isn't unusual at this (or any) time of year to see rain, more of just a coincidence that they have all seen rain at points throughout the day.'The coronations have all been held at different times of the year so it becomes less of a comparison, but it's still overall an interesting fact.'On Saturday in London, the Met Office said temperatures got to 15C. The historic average for the day is 16C.It also said the coronation of Queen Elizabeth II saw temperature highs of just 11.8C on June 2, 1953, with some light rain through the day.The coronation of King George V was the mildest of the last four coronations, with daytime highs of 17C on June 22, 1911, but also some rain.Meanwhile, the late Queen's father George VI also saw rainfall on May 12, 1937, while Edward VII's in August 1902 also saw showers. The Met Office was established in 1854.",
        "This raised fears that the military flypast of more than 60 aircraft over Buckingham Palace at 2.30pm yesterday could be called off.But the Ministry of Defence instead announced it would be scaled down and formed of helicopters and The Red Arrows.Met Office meteorologist Marco Petagna said Britons can expect 'a bit more of an east/west split' of weather conditions today, compared to yesterday.He added: 'In the East we will see further heavy showers, particularly across eastern England, whereas out towards the West it's drier and brighter and a bit warmer tomorrow as well, temperatures tomorrow could get to 22C in the South East.'That would make it the warmest day of the year so far.'He said these highs could be enjoyed in 'the London area'.Mr Petagna added that there would be 'wet and fairly windy weather moving across from the West, sweeping eastwards across all areas Sunday night into Monday.'He said this would be 'followed by sunshine and showers in the west late on Monday' and it would 'vary day to day'.'Whereas tomorrow, it's more east and south-east England and then on Monday the rain coming in will be heaviest on hills in the west and north west.'He said areas in South East England and potentially in Northern Ireland could get highs of 18C or 19C (66F) on Monday.",
        "The warmest temperature recorded in the UK yesterday was 19.6C – again at Kinlochewe, where the 2023 record was set."
    ]
}