{
    "articleURL": "/wires/reuters/article-12049827/Bain-Capital-nearing-final-close-Asia-fund-worth-6-billion--sources.html",
    "content": [
        "By Kane Wu",
        "HONG KONG, May 5 (Reuters) - U.S. private equity firm Bain Capital is nearing the final close of its fifth and biggest Asia-focused fund after having raised around $6 billion from global investors, said two people with knowledge of the situation.The committed capital to the fund has exceeded the firm's initial target of $5 billion, said one of the two people and a third source with knowledge of the fundraising.Bain Capital, which started fundraising in the second half of last year, aims to complete the exercise in the coming weeks, said the three people, who all declined to be identified as the information is confidential.Bain Capital declined to comment.Bain Capital's latest fundraising comes as investors globally are battling geopolitical uncertainties, a higher interest environment, market volatility, and macroeconomic headwinds in many markets.In Asia, investors have been cautious about deploying capital in China due to an economic slowdown, regulatory crackdown and Sino-U.S. tensions - all of which cast a shadow over Asia funds with a heavier allocation to the country.About $131.6 billion in total was raised in 2022 for Asia-focused funds, about half of 2021's $251.2 billion, Preqin data showed. Fundraising so far this year has totalled just $15.5 billion, the data showed.Private equity-backed deals across Asia Pacific, including Japan, have slumped 41% to $41 billion so far this year from the same period last year, the lowest level since 2020, Refinitiv data showed.",
        "Similarly, in China, private equity-backed deals so far this year have dropped 39% year on year to $9.7 billion after having plunged to a six-year low last year, the Refinitiv data showed.NEW FUNDRAISINGBain Capital's new Asia fund will focus heavily on Japan, where it has landed marquee deals such as the $18 billion buyout of Toshiba Corp's memory chip business, said two of the three people.The firm invests across multiple asset classes, including credit, public equity, venture capital, and real estate, managing approximately $160 billion in total assets globally.It most recently agreed to take joint ownership of Japanese human-resources software provider Works Human Intelligence with Singapore's GIC for an undisclosed amount.Last year, Bain Capital closed a $2 billion \"special situations fund\" for Asia Pacific to cover a range of asset types but with a focus on real estate.Bain Capital's U.S. rival Carlyle Group is still in the market seeking to raise $8.5 billion for its new Asia-focused fund, separate sources with knowledge of Carlyle's fundraising said.Hong Kong-based PAG, which started fundraising more than a year ago, has cut its fund size target to $6 billion from $9 billion, according to media reports and people with knowledge of its plans.Carlyle and PAG both declined to comment. (Reporting by Kane Wu; Editing by Sumeet Chatterjee and Sonali Paul)"
    ]
}