{
    "articleURL": "/news/article-12057493/BBC-suddenly-stops-broadcast-King-Charles-Coronation-Concert-runs-over.html",
    "content": [
        " Take That had been invited to close the show with a medley of their greatest hitsTV viewers were left in the lurch as the BBC suddenly stopped its broadcast of the King Charles' Coronation concert after Take That's encore ran overtime.",
        "The British pop royalty had been invited to close the show with a medley of their greatest hits and started the performance by taking to the stage with German DJ Robin Schulz as they sing their single Greatest Day.After belting out Shine, the choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's third song, Never Forget, which gave the show an uplifting finale.King Charles and Queen Camilla were along members of the royal family dancing along and waving their Union Jack flags as the concert came to a close.But the show cut off just past 10pm, with those watching at home noticing that the show had ended up a rather abrupt fashion.",
        "People at home took to social media to question what happened, with one person writing: '@BBCOne Why did you cut the #CoronationCocnert before it had completely finished? Travesty. I bet Take That sang another song and the other artists came back on stage.'",
        "Another said: 'So who did they cut out? #CoronationConcert'.A third added: 'Bit of an abrupt ending jeez #Coronation Concert'.Another chimed in: 'A rudely abrupt end to your broadcast @BBCOne? #CoronationConcert'. But while viewers at home vented their frustration, those at the concert in the grounds of Windsor Castle appeared to be having the time of their life",
        "Kermit the Frog could be seen soaking up the celebratory atmosphere as he joined the s audience belting out the chorus of Never Forget.Prime Minister Rishi Sunak, who is also in the royal box, was also seen singing to the hit while Princess Charlotte waved her Union Jack flag.The trio, comprising of Gary Barlow, Mark Owen and Howard Donald, finished the show with a huge applause and took a bow. The BBC said it would not be commenting when approached.Around 20,000 jubilant spectators were also in the grounds to watch the Coronation concert, as millions more watched from around the world. The King and Queen were seen arriving for the Coronation Concert just after 8pm and immediately got in the spirit by waving the Union Flag as the show began.Charles III and his wife Camilla walked into the royal box to roars from the jubilant crowd who did three cheers for the couple who waved and grinned back as the sun set over Windsor Castle.Stars including Nicole Scherzinger and Amanda Holden are also in place for tonight's spectacular show on a Union Flag-shaped stage where pop icons including Katy Perry, Lionel Richie and Take That will perform.The concert is considered by many to be a crowning touch on the magnificent weekend, after joyous big lunch celebrations today and a surprise walkabout by the Prince and Princess of Wales.",
        "And as night fell, the royals donned their glowstick wristbands, go to their feet and started dancing to Lionel, as he sang All Night Long. Katy Perry belted out hits before Take That closed the show. During tonight's celebrations, Prince William paid a moving tribute to his father, telling him: 'Pa, we are all so proud of you.'He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven.",
        "William delivered his emotional address from Windsor Castle as the nation celebrated the crowning of King Charles and Queen Camilla with the official Coronation Concert, a glorious mix of music, dance and the spoken word.Set on a spectacular stage shaped like a multi-tier Union flag, it was an unashamedly patriotic highlight of a long weekend of celebrations.Events to mark Saturday's Coronation will culminate today with a 'day of service' dubbed the Big Help Out as senior royals join volunteers around the country.The King and Queen danced along to Take That's performance of Shine as Princess George and his sister Princess Charlotte enthusiastically waved their Union flags.In the final performance of the Windsor Coronation Concert, the band, who have not performed together for four years, ended with Never Forget - as Kermit the Frog danced along.",
        "Charles and Camilla laughed and chatted as they bopped along throughout, with Kate, Charlotte and George also getting into the groove - as did the Duke and Duchess of Edinburgh.",
        "William had slipped away so he could go on stage to give a moving tribute to his father, telling him: 'Pa, we are all so proud of you.' He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven on his Coronation weekend.Princess Charlotte attempted to get Prince George's attention and pointed at her father the Prince of Wales as he made his way onto the stage to deliver a speech during the Coronation Concert.As William concluded his speech, he said: 'God Save the King,' which was repeated loudly by the thousands in attendance. The speech was followed by the national anthem, which was sung by all present, including Prince George. The King smiled and waved to the crowd at the end of the national anthem.",
        "Just before Hugh Bonneville introduced the final act, Take That, the BBC cut to the royal box, where Kermit the Frog waved a Union flag in front of a grinning Duke of Edinburgh.The King looked to his left as he clapped before Bonneville signed off: 'And, of course, thank you your majesties, for allowing us to perform for you here. We sincerely hope you and the frog have enjoyed yourselves.'",
        "The camera then showed a wide view of the royal box, with Charles and Camilla smiling while Kermit nodded.There was no sign of Miss Piggy."
    ]
}