{
    "articleURL": "/tvshowbiz/article-12043885/Im-Celeb-South-Africa-Carol-Fatima-fume-people-not-pulling-weight.html",
    "content": [
        "Tensions were rising in the I'm A Celebrity camp on Wednesday as Carol Vorderman and Fatima Whitbread moaned about people not pulling their weight in camp. ",
        "After noticing that some of their fellow celebrities were not completing their assigned chores, the two ladies were seen having a moan, with Carol suggesting that the laziness in camp is annoying her. After Fatima was forced to wake Andy Whyment to remind him to tend to the fire late at night, Carol had her day, telling her: 'I think we need to remind them what their responsibilities are.'Before the Countdown star went on to fume: 'There are quite a lot of people not pulling their weight', with Fatima agreeing: 'They need guidance.'However, with the ladies expressing their dismay, viewers at home were quick to slam them for moaning about chores, with one even quipping that the 'fun was sucked out of life' with them around. ",
        "Taking to Twitter, viewers were quick to have their say, with several not impressed by Carol and Fatima's attitudes. 'Fatima and Carol moaning go and tell Phil to his face to do more Not everyone is the same' commented one viewer.While another moaned: 'Fatima and carol would do my head in.''Fatima bore off. Fun sucked out of life. Carol you are not far behind' tweeted a third.'Carol and Fatima best not be talking smack about my Phil or Andy!!!' commented a fourth watcher.",
        "With another adding 'Carol and Fatima are two moans but I still love them.'It comes as I'm A Celebrity viewers were left in stitches during the episode as Dean Gaffney repeatedly vomited during a gruesome drinking challenge.",
        "The former EastEnders star, 45, got more than he bargained for when he was greeted with a mixture of animal penis and vagina which made him gag before he even took a gulp.Dean quickly threw up the revolting mixture - and hilariously insisted he hadn't got sick - as hosts Ant McPartlin and Declan Donnelly howled with laughter.The trial - which Dean completed with fellow new arrival Joe Swash - went down a treat with viewers who proclaimed it one of the best Bushtucker Trials ever.I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}