{
    "articleURL": "/wires/reuters/article-12058561/FOREX-Dollar-pressure-traders-wait-loans-data.html",
    "content": [
        "By Tom Westbrook SINGAPORE, May 8 (Reuters) - The dollar began the week under pressure on Monday, with traders betting it might have peaked along with U.S. interest rates, and selling it against peers that seem to have hikes ahead, though with a wary eye on looming inflation and loans data. Sterling, hovering at an 11-month high of $1.2652, was also in focus ahead of an expected Bank of England rate increase on Thursday that markets do not think will be the last. The euro, which has rallied nearly 16% from September lows, was up 0.2% to $1.1042 though it has not been able to punch through resistance at $1.11. The Australian dollar hit a three-week high and rose 0.4% to $0.6774. The yen held steady at 134.75 per dollar. Last week the Federal Reserve raised rates by 25 basis points but sounded slightly more cautious than peers on the outlook, dropping guidance about the need for future hikes. U.S. interest rate futures are pricing about a one-third chance of a rate cut as soon as July, according to the CME FedWatch tool - even though stronger-than-forecast U.S. jobs data released on Friday suggests that might be premature. \"The Fed has tended to guide away from the possibility of rate cuts this year, which is somewhat at odds with a rates market which is pricing in cuts,\" HSBC analysts said in a note. \"If the Fed is proved right over the course of 2023, then it will make it harder for the dollar decline to extend,\" the analysts wrote. \"But for the time being, the market is likely to run with the theme of a peak in Fed rates justifying a clear peak in the dollar.\" The U.S. dollar index dropped for a second week in a row last week, losing about 0.4%, and was down about 0.2% to 101.10 in Asia on Monday. The New Zealand dollar nudged up 0.3% to $0.6313. Later Monday, the Fed's loan officer survey might show whether and how hard banks are tightening up on credit after three U.S. lenders failed over recent weeks - which could weigh on the dollar if it puts downward pressure on interest rates. Traders will also be watching headlines from Capitol Hill as lawmakers attempt to negotiate an impasse over the looming U.S. debt ceiling, with the Treasury Secretary warning the government might be unable to pay debts by June 1. U.S. inflation data is due on Wednesday. \"There is a risk that regional bank issues could escalate, posing a broader risk to the financial system and taking the dollar (higher),\" said Standard Chartered's head of G10 FX research, Steve Englander. \"However, the resilience of big banks makes that unlikely, in our view,\" Englander said. \"We think that the escalation of debt-ceiling concerns is a more likely source of risk-off dollar strength via demand for immediate dollar liquidity.\" ======================================================== Currency bid prices at 0503 GMT Description RIC Last U.S. Close Pct Change YTD Pct High Bid Low Bid Previous Change Session Euro/Dollar $1.1043 $1.1019 +0.23% +0.00% +1.1045 +1.1016 Dollar/Yen 134.7350 134.7900 -0.02% +0.00% +135.2850 +134.7600 Euro/Yen &amp;lt;EURJPY=EB S&gt; 148.80 148.57 +0.15% +0.00% +149.0800 +148.6400 Dollar/Swiss 0.8888 0.8905 -0.17% +0.00% +0.8912 +0.8890 Sterling/Dollar 1.2652 1.2631 +0.17% +0.00% +1.2653 +1.2627 Dollar/Canadian 1.3369 1.3374 -0.04% +0.00% +1.3387 +1.3368 Aussie/Dollar 0.6773 0.6750 +0.35% +0.00% +0.6775 +0.6740 NZ Dollar/Dollar 0.6314 0.6293 +0.33% +0.00% +0.6314 +0.6294 All spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ (Reporting by Tom Westbrook.)"
    ]
}