{
    "articleURL": "/wires/reuters/article-12051185/CORRECTED-World-food-prices-rise-time-year-FAO.html",
    "content": [
        "ROME, May 5 (Reuters) - The United Nations food agency's world price index rose in April for the first time in a year, but is still some 20% down on a record high hit in March 2022 following Russia's invasion of Ukraine.",
        "The Food and Agriculture Organization's (FAO) price index, which tracks the most globally traded food commodities, averaged 127.2 points last month against 126.5 for March, the agency said on Friday. The March reading was originally given as 126.9.The Rome-based agency said the April rise reflected higher prices for sugar, meat and rice, which offset declines in the cereals, dairy and vegetable oil price indices.\"As economies recover from significant slowdowns, demand will increase, exerting upward pressure on food prices,\" said FAO Chief Economist Maximo Torero.The sugar price index surged 17.6% from March, hitting its highest level since October 2011. FAO said the rise was linked to concerns of tighter supplies following downward revisions to production forecasts for India and China, along with lower-than-earlier-expected outputs in Thailand and the European Union.While the meat index rose 1.3% month-on-month, dairy prices dipped 1.7%, vegetable oil prices fell 1.3% and the cereal price index shed 1.7%, with a decline in world prices of all major grains outweighing an increase in rice prices.\"The increase in rice prices is extremely worrisome and it is essential that the Black Sea initiative is renewed to avoid any other spikes in wheat and maize,\" said Torero, referring to a deal to allow the export of Ukrainian grain via the Black Sea.",
        "In a separate report on cereals supply and demand, the FAO forecast world wheat production in 2023 of 785 million tonnes, slightly below 2022 levels but nonetheless the second largest outturn on record.\"(The) 2023/24 prospects for rice production along and south of the equator are mixed, largely due to the regionally varied impact of the La Niña event,\" FAO said.FAO raised its forecast for world cereal production in 2022 to 2.785 billion tonnes from a previous 2.777 billion, just 1.0% down from the previous year.World cereal utilisation in the 2022/23 period was seen at 2.780 billion tonnes, FAO said, down 0.7% from 2021/22. World cereal stocks by the close of the 2022/2023 seasons are expected to ease by 0.2% from their opening levels to 855 million tonnes. (Editing by Crispian Balmer)"
    ]
}