{
    "articleURL": "/sport/nfl/article-12059351/Jim-Irsay-warns-NFL-rivals-retired-QB-Andrew-Luck-Washington-phoned-him.html",
    "content": [
        "Andrew Luck stunned the NFL by retiring two weeks prior to the 2014 season Luck was then a four-time Pro Bowl quarterback and a mere 29 years of age DailyMail.com provides all the latest international sports news Indianapolis Colts owner Jim Irsay was explicit in the consequences for communicating with retired star quarterback Andrew Luck amid a report linking the Commanders to the Stanford graduate. ",
        "Washington had reportedly called several NFL franchises last offseason with the intent of trading should the right opportunity present -- their search even included checking in on the status of Luck, per ESPN's John Keim.The four-time Pro Bowl quarterback shocking retired after seven seasons, aged just 29, two weeks prior to the start of the 2019 regular season. He had three years remaining on a five-year, $122m deal -- meaning Indianapolis own his rights. Contact with Luck is only permissible if green-lighted by the Colts.'If any NFL team attempted to contact Andrew Luck (or any associate of him)... to play for their Franchise -- it would be a clear violation of the League's Tampering Policy,' Irsay posted on Twitter Sunday night.Keim's report stated the Commanders had 'phoned about' Luck, suggesting it was done in an indirect manner -- one which depending on the individuals involved, could indeed bring about a tampering case against the organization.",
        "According to another ESPN report, the Colts are seeking to further understand what exactly played out, and if indeed tampering transpired.Under the NFL's anti-tampering policy, it is illegal to contact the player, his representatives or a media member relating to interest in him. 'Any public or private statement of interest, qualified or unqualified, in another club's player to that player's agent or representative, or to a member of the news media, is a violation,' the policy reads.",
        "The Miami Dolphins were most recently found in breach of said policy, resultantly losing its first-round pick in the recently completed NFL Draft.The franchise was found to have engaged in 'impermissible communications' with Brady and now-current Denver Broncos coach Sean Payton between 2019 and 2022.",
        "As it pertains to Brady, conversations allegedly involved talks of the future Hall of Famer becoming a limited partner with the team.Contact with Brady was found to have occurred during the 2019 season and postseason, when he was on the Patriots, and during and after the 2021 season, when he was with the  Buccaneers. It is understandable why Washington would attempt to understand if playing was an option swirling in Luck's mind given the greatness he exhibited while with Indianapolis. Luck threw for 25,925 yards, 183 touchdowns and 93 interceptions in 94 games (including the postseason). He led the Colts to the AFC Championship in 2014, losing to New England in the infamous 'Deflategate' game."
    ]
}