{
    "articleURL": "/wires/ap/article-12039833/New-reversal-Twitter-sparked-MTA-withdrawl.html",
    "content": [
        "In an about-face, Twitter says it has restored free access to a key tool for verified government and \"publicly owned\" services so they can tweet weather, transit and other alerts after New York City's transit agency said earlier this week it would no longer use the platform for its service advisories.",
        "The Metropolitan Transportation Authority is among countless official and unofficial accounts that abruptly lost access to Twitter´s API, or application programming interface, to send out automated alerts about service changes and emergencies last week. By Thursday afternoon, senior executives agreed to cease publishing service alerts to the platform altogether.The decision put the country´s largest transportation network among a growing number of accounts, from National Public Radio to Elton John, who have reduced their Twitter presence or left the platform since its takeover by Elon Musk.Twitter had signaled that the days of private accounts disseminating troves of information at no cost may be ending. Last month, the company announced a new pricing system that would charge for access to its API, which is used by accounts that post frequent alerts, such as transit and weather agencies.MTA officials estimated the cost could run as high as $50,000 a month. For a transit agency that faces a multibillion dollar deficit, paying that much raised concerns.So last Thursday, the MTA told its 1 million Twitter followers that it will no longer use the platform for service alerts and information.",
        "On Tuesday, Twitter backtracked and announced that \"Verified gov or publicly owned services who tweet weather alerts, transport updates and emergency notifications may use the API, for these critical purposes, for free.\"",
        "In recent days, MTA officials have been in touch with Twitter´s development team, though the agency has not said whether it will return to publishing service alerts on Twitter in light of the change.A representative for the MTA did not immediately respond to a message for comment.__Associated Press Writer Jake Offenhartz contributed to this story from New York."
    ]
}