{
    "articleURL": "/wires/ap/article-12053409/Qatar-flies-aid-Sudan-airlifts-evacuees-amid-fighting.html",
    "content": [
        "PORT SUDAN, Sudan (AP) - Qatar flew a relief flight into Sudan carrying some 40 tons of food and left with 150 evacuees early Saturday as fighting continued between two generals vying for power in the African nation.",
        "The Qatari Emiri Air Force C-17 Globemaster touched down in Port Sudan, some 670 kilometers (415 miles) northeast of Sudan's violence-torn capital of Khartoum. The port city has been spared in the fighting and has become one of the few safe transit points out of the country, whether by air or by ships crossing the Red Sea heading to Jeddah, Saudi Arabia.Evacuees boarded the C-17 bearing the livery of Qatar Airways, the energy-rich nation's long-haul carrier. Those who spoke to The Associated Press described facing \"very scary, terrifying\" conditions trying to leave Khartoum for the airfield.\"We still faced many difficulties because of the lack of security in the country due to the security forces being occupied with the battles. We were faced by mobs on the way,\" said Nemat Allah Saber Ibrahim, a Sudanese doctor evacuated who lives in Qatar. \"Other than the burden of travel and the different checkpoints by both security forces and Rapid Support Forces. But thank God we have arrived safely to the Port of Sudan.\"The conflict started on April 15 after months of escalating tensions between the military, led by Gen. Abdel-Fattah Burhan, and a rival paramilitary group called the Rapid Support Forces, commanded by Gen. Mohamed Hamdan Dagalo. The fighting has turned urban areas into battlefields. Foreign governments have rushed to evacuate their diplomats and thousands of foreign nationals out of Sudan.",
        "Despite repeated cease-fires being declared, the warring sides have shown little commitment to even short-term promises to stop the fighting. Qatar in the past has held peace talks between warring parties in Sudan's Darfur region, as well as those between Sudan and South Sudan.",
        "\"We are leaving but unfortunately Khartoum is in a dire situation. Khartoum is done,\" said Aliah Helelo, another Sudanese resident of Qatar being evacuated. \"We are leaving with our hearts in our hands. We left our families behind and we fear for them. But thank God. I pray that God avenges and punishes whoever caused this.\"The food carried into Sudan by the Qatari military aircraft included bags of rice, dates, oil, lentils and tomato sauce. Hunger is becoming a problem in Sudan as stores remain closed amid the fighting and food is in scarce supply. Prices across the country \"are reportedly skyrocketing, making critical goods unaffordable for many people,\" the United Nations Office for the Coordination of Humanitarian Affairs said.Khaled Mahmoud Osman, the deputy chief of mission at the Sudanese Embassy in Qatar, told journalists gathered at Qatar´s sprawling Al-Udeid Air Base before the flight that the food aid was \"of the utmost importance to our people.\"\"In Sudan, these are some of the unfortunate events caused by the rebellion of the Rapid Support Forces, which have affected the lives of civilians in all Sudanese cities and Khartoum in particular, in hospitals, neighborhoods, markets and in areas supplying food from villages,\" he said.",
        "\"We ask Allah almighty for peace to prevail in Sudan soon, to support the Sudanese armed forces, to take care of the rebels or they would surrender. I mean, that they will lay down arms for the mercy of civilians.\"Separately, the World Health Organization said it and the United Arab Emirates shipped some $444,000 worth of urgent medical supplies Friday into Sudan at Port Sudan International Airport. The WHO said that a shipment brought in just before the start of the fighting was \"exhausted after a few days given the number of injured.\"Later Saturday, envoys from the Sudanese military and the Rapid Support Forces, started negotiations in Saudi Arabia, in the city of Jeddah, across the Red Sea from Port Sudan, according to a joint Saudi-American statement.___Follow Lujain Jo on Twitter at www.twitter.com/lujainjo."
    ]
}