{
    "articleURL": "/tvshowbiz/article-12040981/Karen-Gillan-Pom-Klementieff-stun-Guardians-Galaxy-Vol-3-screening-Florida.html",
    "content": [
        "Karen Gillan looked nothing short of sensational in a black silk cut out gown on Tuesday as she attended the Guardians Of The Galaxy Vol. 3 screening in Florida. ",
        "The actress, 35, showed off her amazing figure in a plunging draped crop top while posing for photos at the AMC Sunset Place. She put on a leggy display through a daring thigh high split and added inches to her frame in a pair of towering open toe heels. The Scottish star turned up the heat by adding a pair of coordinated long gloves to the ensemble and accessorised with a pair of dazzling silver drop earrings. The beauty, who plays character Nebula in the latest Marvel Cinematic Universe, styled her long auburn tresses in luxurious waves as they cascaded down past her bust from a side parting.  ",
        "She was joined at the event for her latest film by co-star Pom Klementieff, 37, who looked stunning in a black and white spotted skater dress. Her garment boasted thin black straps and cinched her in at the waist with a coordinated material belt. She added a pop of colour to the outfit with a pair of pink satin pointed toe shoes which had a large jewel on top. Pom applied a flawless palette of makeup including a swipe of bright pink lipstick and styled her short blonde locks poker straight to frame her face. The first Guardians Of The Galaxy movie was released in 2014, and received critical acclaim. The film raked in a whopping $773.3 million in the global box office, and also received two Oscar nominations.",
        "The sequel, simply titled Guardians Of The Galaxy Vol. 2, was released three years later in 2017, and garnered even higher box office numbers with $863.8 million in global sales.Guardians Of The Galaxy Vol. 3 has also had its fair share of drama over the years. Back in 2018, James Gunn was fired from the production due to a slew of controversial and offensive tweets.However, the following year, it was revealed that the filmmaker had been hired back onto the project.",
        "Karen weighed in to Rolling Stone about the ups and downs that the production has faced. 'When it looked like we weren't going to make the movie without James, it just didn't feel right at all.''The only thing I ever wanted was that James would direct it,' Chris added. 'That's all I hoped for. It's a difficult landing to stick, and seeing that we had the blueprint and the right leader to get us there was a real relief.'The final instalment to end the Guardians trilogy is slated to hit theaters early next month on May 5."
    ]
}