{
    "articleURL": "/wires/reuters/article-12051231/Lyft-rattles-Wall-Street-margins-suffer-race-Uber.html",
    "content": [
        "By Aditya Soni",
        "May 5 (Reuters) - Lyft Inc shares tumbled about 19% on Friday as the ride-hailing company's strategy to claw back market share from rival Uber with lower fares stoked concerns of a hit to its profit margins.At least 16 analysts slashed their price targets on a stock that has widely underperformed the market this year.The company's market capitalization declined by nearly $800 million to about $3.3 billion, a far cry from the more than $24 billion valuation it commanded in its 2019 stock market listing. Uber has a valuation of more than $75 billion.Lyft gave a disappointing adjusted core earnings forecast for the second quarter on Thursday as efforts to add more riders with price cuts take a toll on profitability, underscoring the hurdles new CEO David Risher faces in turning around the company.\"Given how dynamic pricing is, Lyft's report highlights how little it controls the destiny of its own profit and loss statement in the event Uber wanted to cause more damage,\" said RBC Capital Markets analyst Brad Erickson.Uber CEO Dara Khosrowshahi this week indicated the company would not start a price war with Lyft, saying \"the days of paying for share and essentially using shareholder money to buy share temporarily .. are over\".That has allowed Lyft, which has aggressively matched prices since the beginning of the year, to increase its U.S. market share to about 30% from mid-to-high 20% at the start of 2023.",
        "The company plans to offset the lower prices with annual cost savings of about $330 million from decisions such as laying off more than 1,000 employees, or 26% of its staff, in April.But Wall Street remains skeptical about how long those gains can hold up.\"It is still very unclear as to whether any recovery can be maintained given significant advantages of Uber,\" Atlantic Equities analysts said.The 72% quarterly surge in Uber's ride-share business had outperformed Lyft's 14% growth, underscoring benefits of the company's presence in key international markets. Uber also has a sprawling food-delivery operation that gives it an edge.\"This looks like an Everest-like uphill battle ahead for Lyft in our opinion,\" said Dan Ives of Wedbush Securities.(Reporting by Aditya Soni in Bengaluru; Editing by Saumyadeb Chakrabarty and Devika Syamnath)"
    ]
}