{
    "articleURL": "/wires/ap/article-12046131/Serbia-police-urge-people-lock-guns-school-shooting.html",
    "content": [
        "BELGRADE, Serbia (AP) - A shooter killed at least eight people and wounded 13 in a drive-by attack near a town close to Belgrade late Thursday, the second such mass killing in Serbia in two days, state television reported.",
        "The attacker shot randomly at people near the town of Mladenovac, some 50 kilometers (30 miles) south of the capital, the RTS report said early Friday. Police were looking for a 21-year-old suspect who fled after the attack, the report said.The shooting came a day after a 13-year-old boy used his father´s guns in a rampage at a school in Belgrade that killed eight of his fellow students and a school guard.The bloodshed sent shockwaves through a Balkan nation unused to mass murders.Though Serbia is awash with weapons left over from the wars of the 1990s, mass shootings are extremely rare. Wednesday's school shooting was the first in the country's modern history. The last mass shooting before this week was in 2013, when a war veteran killed 13 people in a central Serbian village.Serbian Interior Minister Bratislav Gasic called Thursday's shooting \"a terrorist act,\" state media reported.",
        "Special police and helicopter units have been sent to the region as well as ambulances, it added.No other details were immediately available, and police had not issued any statements.Earlier Thursday, Serbian students, many wearing black and carrying flowers, filled streets around the school in central Belgrade as they paid silent homage to peers killed a day earlier. Thousands lined up to lay flowers, light candles and leave toys to commemorate the nine people who were killed on Wednesday morning.",
        "The tragedy also sparked a debate about the general state of the nation following decades of crises and conflicts whose aftermath have created a state of permanent insecurity and instability, along with deep political divisions.Authorities on Thursday moved to boost gun control, as police urged citizens to lock up their guns and keep them away from children.Police have said that the teen used his father´s guns to carry out the attack. He had planned it for a month, drawing sketches of classrooms and making lists of the children he planned to kill, police said on Wednesday.The boy, who had visited shooting ranges with his father and apparently had the code to his father´s safe, took two guns from the safe where they were stored together with bullets, police said on Wednesday.The shooting on Wednesday morning in Vladislav Ribnikar primary school also left seven people hospitalized - six children and a teacher. One girl who was shot in the head remains in a life-threatening condition, and a boy is in serious condition with spinal injuries, doctors said on Thursday morning.To help people deal with the tragedy, authorities announced they were setting up a helpline. Hundreds answered a call to donate blood for the wounded victims. A three-day mourning period will begin Friday morning.",
        "Serbian teachers´ unions announced protests and strikes to warn about a crisis in the school system and demand changes. Authorities shrugged off responsibility, with some officials blaming Western influence.The shooter, whom the police identified as Kosta Kecmanovic, has not given any motive for his actions.Upon entering his school, Kecmanovic first killed the guard and three students in the hallway. He then went to the history classroom where he shot a teacher before turning his gun on the students.Kecmanovic then unloaded the gun in the school yard and called the police himself, although they had already received an alert from a school official. When he called, Kecmanovic told duty officers he was a \"psychopath who needs to calm down,\" police said.The children killed Wednesday were seven girls and one boy. One of the girls was a French citizen, France´s foreign ministry said.Authorities have said that Kecmanovic is too young to be charged and tried. He has been placed in a mental institution, while his father has been detained on suspicion of endangering public security because his son got hold of the guns.\"I think we are all guilty. I think each one of us has some responsibility, that we allowed some things we should not allow,\" said Zoran Sefik, a Belgrade resident, during Wednesday evening´s vigil near the school.",
        "Jovan Lazovic, another Belgrade resident, said he was not surprised: \"It was a matter of days when something like this could happen, having in mind what is happening in the world and here,\" he said.Gun culture is widespread in Serbia and elsewhere in the Balkans: The region has among the highest numbers of guns per capita in Europe. Guns are often fired into the air at celebrations and the cult of the warrior is part of national identities.Experts have repeatedly warned of the danger posed by the number of weapons in a highly divided country like Serbia, where convicted war criminals are glorified and violence against minority groups often goes unpunished. They also note that decades of instability stemming from the conflicts of the 1990s, as well as ongoing economic hardship, could trigger such outbursts.\"We have had too much violence for too long,\" psychologist Zarko Trebjesanin told N1 television. \"Children copy models. We need to eliminate negative models ... and create a different system of values.\""
    ]
}