{
    "articleURL": "/wires/pa/article-12047007/Former-boss-Javi-Gracia-no-bitterness-Leeds-despite-sacking.html",
    "content": [
        "Former boss Javier Gracia says he and his children will be cheering Leeds on from Spain as they watch Saturday’s game at Manchester City on television.",
        "Gracia has returned home to Malaga after being sacked on Wednesday, just 10 weeks and 11 Premier League games after succeeding Jesse Marsch as head coach.Director of football Victor Orta departed Elland Road by mutual consent on the same day.In a desperate late bid to retain top-flight status, Leeds have appointed Sam Allardyce with just four fixtures remaining.Gracia told The Athletic he will be watching the former England boss’s first game in charge at the Etihad Stadium.“I will be with my children, who will have their Leeds jerseys on and chanting ‘Up the Whites’,” Gracia said.",
        "The 53-year-old said he had been informed of Leeds’ decision on Monday – his birthday – via a phone call from chairman Andrea Radrizzani.“It was a call to explain the situation. It was all handled correctly by the club. I have to accept the decision from the club’s owner and that’s it,” Gracia said.“I can honestly say my time at Leeds has been an enriching experience, and the human qualities of Victor Orta have been an authentic pleasure to be around.“It was one of the places in my career where they have made me feel good and comfortable in myself.“It’s been a very intense period. It hurt me a lot to lose my job, but I have to say Victor’s exit is just as difficult for me, if not more.”",
        "Gracia had collected 10 points from his first six games in charge before a second-half collapse in a 5-1 home defeat to Crystal Palace sent them on a vicious downward spiral.A 6-1 loss to Liverpool at Elland Road followed in their next match, while in five defeats from their last seven matches in April they conceded 23 goals, a top-flight record for a calendar month.Leeds fans will point to their side’s collapse against Palace as the beginning of the end for Gracia.“It was incredible to me that we went in at half-time drawing,” he said. “We were balanced in our play. Then the situation that followed was hard to understand. The second half was very tough to take.”The former Watford boss cited injuries to players Tyler Adams, Luis Sinisterra and Max Wober as key factors in Leeds’ loss of form and that being on the wrong end of “fine margins” also contributed.“I had the feeling that the players felt a little like a boxer who had been hit, who is down for a few moments and wants to get up but he is not able to,” he added.“A player can enter subconsciously into the vicious circle from which they cannot escape.“And we did not have that moment go our way with the fine margins. In the last minute against Leicester, Patrick (Bamford) had a chance just wide and Marc Roca came close to scoring a winner.”"
    ]
}