{
    "articleURL": "/wires/reuters/article-12050045/Euro-zone-yields-rise-investors-assess-ECB-policy-path.html",
    "content": [
        "By Stefano Rebaudo",
        "May 5 (Reuters) - Euro zone government bond yields rose on Friday as investors slightly downgraded their forecasts on future rate hikes after the European Central Bank slowed its tightening path.All ECB policymakers but one, Austria's Robert Holzmann, backed the 25-basis-point increase in the ECB's main deposit rate to 3.25%, which follows an unprecedented series of 75 and 50 basis point increases since last July.Money markets are currently pricing in less than two 25 basis points (bps) rate hikes by autumn as investors reckoned the ECB might pause with the deposit facility rate at 3.5% if May inflation data surprised on the downside.Meanwhile, the euro area economy showed more signs of weakness, with German industrial orders falling significantly more than expected in March.Germany's 10-year government bond yield, the euro area benchmark, rose 5 bps to 2.249%, after dropping 5.5 bps the day before. It was still more than 50 bps below the 2.77% it hit in early March, its highest level since July 2011.The September ECB euro short-term rate forward was at 3.56%, implying expectations for a depo rate at 3.66% by fall. The June forward was at 3.35%, not fully pricing a 25 bps rate hike.Money markets were pricing a depo rate peak at around 3.75% before he ECB policy meeting.",
        "Citi analysts recalled in a research note that the ECB is not ready to pause and plans multiple further hikes, adding \"the risk-reward of paying July ECB ESTR looks attractive.\"ECB policymaker Francois Villeroy de Galhau said on Friday, \"the essence of the effort (in terms of rate hiking) has been done\" and that the change in rate increase rhythm is an important signal.FED RATE CUT?Yields in long-dated U.S. Treasuries rose in early London trade after dropping the day before as investors bet that the Federal Reserve will cut interest rates this year after raising them by 25 bps on Wednesday.A plunge in the shares of several regional banks triggered fresh worries about the economic fallout of a banking crisis supporting bids for safe-haven assets in the U.S.The ECB announced it would stop reinvesting cash from maturing bonds bought under its 3.2 trillion Asset Purchase Programme (APP) starting in July. Still, it would continue applying flexibility in reinvesting redemptions coming due in the Pandemic Emergency Purchase Programme (PEPP) portfolio.Analysts estimated the ECB balance sheet to contract by around 25 billion per month on average.However, \"the full stop means that the ECB cannot smooth reinvestments any longer. In July, the run-off amounts to more than 30 billion and in October to more than 50 billion,\" said Christoph Rieger, head of rates research at Commerzbank.",
        "\"While the ECB could still use flexible PEPP reinvestments to support the periphery, tensions would first have to creep up, which means markets could get nervous,\" he added.Italy's 10-year government bond yield rose 4 bps to 4.166%, with the spread between Italian and German 10-year yields -- a gauge of investor sentiment towards the euro zone's more indebted countries - at 190.5 bps.Some analysts said the impact of the ECB stop in bond reinvestments should be limited as the euro area´s issuers already sold a big chunk of the net bond supply expected for this year. (Reporting by Stefano Rebaudo, editing by Conor Humphries)"
    ]
}