{
    "articleURL": "/news/article-12049161/Tyrell-Edwards-accused-Buxton-smash-killed-Picton-High-students-bail-conditions-eased.html",
    "content": [
        "Tyrell Edwards accused of killing five studentsBail conditions eased to help his parents Bail conditions have been softened to help the parents of Tyrell Edwards accused of driving a ute at high speed into two trees, killing five school students.",
        "Bail requirements for a teen driver accused of killing five school students in a high-speed car crash have been eased after his parents found them too difficult to comply with.Tyrell Edwards, 19, was behind the wheel of a silver Nissan Navara that crashed into two trees southwest of Sydney in September last year, killing five Picton High School students aged between 14 and 16 who were crammed into the vehicle.He was previously forced to make daily visits to a police station 45 kilometres from his home in Bargo under bail conditions that meant he was only allowed outside accompanied by his parents.However, a magistrate on Friday altered these conditions after hearing the daily drive was too onerous because his parents were looking after six other children and his mother Renee Edwards had recently received a part-time night job as a carer.",
        "Magistrate David Degnan noted Edwards had complied with strict requirements including being 'virtually under house arrest' since he was granted bail by the NSW Supreme Court in October last year.'I am satisfied after this lengthy period of time that it is reasonable to reduce the obligation to report daily to three days a week,' he told Picton Local Court.Other bail conditions preventing the teen from driving a motor vehicle, drinking alcohol, taking illegal drugs or going within 500 metres of any port or airport in the country remain in place.",
        "A $100,000 bond has also been paid by his father Henry Edwards to be forfeited if his son does not appear in court.Edwards personally appeared at the court on Friday, entering and leaving the building surrounded by family members who hid his face with umbrellas.Crown prosecutors have officially filed upgraded charges of aggravated driving occasioning death for driving more than 45khm/h over the speed limit. These upgraded charges were previously flagged in February.When he was first arrested on September 7, a day after the Buxton crash, he faced less serious charges of dangerous driving occasioning death.",
        "Mr Degnan also set down a case conference between prosecutors and Edwards' defence lawyers in which negotiations and possible guilty pleas could be hashed out before the matter returns to court on June 30.If Edwards was to plead guilty to any of the charges, it would be best for this to be done as soon as possible, Mr Degnan said.'If you do plead guilty, you're entitled to a larger discount then if you wait until you're in the District Court,' he told Edwards.Lily Van De Putte and Gabby McLennan, both 14, Summer Williams and Tyrese Bechard, both 15, and Antonio Desisto, 16, all died in the crash.Edwards suffered minor injuries.",
        "The teenager has no criminal history, but has accumulated two speeding offences and had his provisional licence suspended in 2022 before the crash."
    ]
}