{
    "articleURL": "/wires/reuters/article-12058515/China-says-imperative-stabilise-Sino-US-relations.html",
    "content": [
        "BEIJING, May 8 (Reuters) - China's Foreign Minister Qin Gang said on Monday it is imperative to stabilise Sino-U.S. relations after a series of \"erroneous words and deeds\" threw ties back into a deep freeze.",
        "Qin, in a meeting in Beijing with U.S. ambassador Nicholas Burns, stressed in particular that Washington must correct its handling of the Taiwan issue and stop the hollowing out of the \"one China\" principle, according to China's foreign ministry.Asked about Qin's remarks, U.S. State Department spokesperson Vedant Patel said Burns had \"conveyed privately\" that there had been no change in U.S. policy towards China and in particular its one-China policy, under which Washington officially recognizes Beijing diplomatically, not Taipei.Patel told a regular briefing Burns had spoken about areas where the countries could cooperate, including climate change, global health and food security.\"We want to and intend to keep lines of communication open,\" Patel said, while adding that Washington would \"continue standing with our friends and allies across the Indo-Pacific to advance our shared prosperity and security and values.\"\"We do not intend to change the status quo - that has not been the approach that the United States has attempted to take,\" he said.Relations between the world's two biggest economies sank to a low last year when then U.S. House speaker Nancy Pelosi visited democratically governed Taiwan which claims the island as its territory.In response, Beijing severed several formal communications channels with the United States including one between their militaries.",
        "\"The top priority is to stabilise Sino-U.S. relations, avoid a downward spiral and prevent any accidents between China and the United States,\" Qin told Burns, the Chinese foreign ministry said.Tensions eased in November when U.S. and Chinese leaders Joe Biden and Xi Jinping met at a G20 summit in Indonesia and pledged more frequent dialogue.But they flared again in February when a Chinese high-altitude balloon appeared in U.S. airspace and U.S. Secretary of State Antony Blinken cancelled a Beijing in response.Qin said that \"a series of erroneous words and deeds by the United States\" since the Biden-Xi meeting had \"undermined the hard-won positive momentum of Sino-U.S. relations.\"\"The agenda of dialogue and cooperation agreed by the two sides has been disrupted, and the relationship between the two countries has once again encountered cold ice.\"In a Twitter post Burns also spoke of the need to bring stability to the relationship.\"We discussed challenges in the U.S.-China relationship and the necessity of stabilising ties and expanding high-level communication,\" he said.Patel said Blinken wanted to visit China and \"will intend and work to do so when conditions allow.\" (Reporting by Ryan Woo in Beijing and Humeyra Pamuk and David Brunnstrom in Washington; Editing by Sonali Paul, Robert Birsel)"
    ]
}