{
    "articleURL": "/news/article-12050855/US-hiring-accelerated-April-employers-added-253-000-new-jobs.html",
    "content": [
        "Employment in the US surged by 253,000 jobs in April in a surprise increaseUnemployment rate ticked down to 3.5%, matching a six-decade lowLabor market has defied inflation, rate hikes, and economic uncertaintyJob creation in the US accelerated last month, in a sign that the labor market remains surprisingly resilient in the face of rising interest rates, chronic inflation, multiple bank failures and mounting economic uncertainty.  ",
        "Despite those headwinds, total employment rose by a surging 253,000 jobs in April. That was far above what economists had projected, and an increase from the brisk 236,000 new jobs created in March. The unemployment rate ticked back down to 3.4 percent, matching a six-decade low, from 3.5 percent the month before, according to the Labor Department's employment situation report on Friday.The unemployment rate for black workers dropped to 4.7 percent, the lowest figure on records dating back to 1972. Unemployment rates for whites (3.1 percent) Asians (2.8 percent) and Hispanics (4.4 percent) were all near historic lows, but did not set new records.Wall Street's major stock indexes jumped higher following the report, with the Dow Jones Industrial Average gaining more than 300 points soon after the opening bell. ",
        "Labor force participation, a key measure of how many eligible workers are either employed or seeking work, was unchanged from March at 62.6 percent.It matched the highest level of participation in the workforce since the early days of the pandemic in March 2020, but remained below the pre-pandemic average of 63.1 percent seen in 2019. The job market has so far withstood the Federal Reserve's aggressive drive to stamp out high inflation, which last year hit a four-decade high and remains well above the Fed's 2 percent target. ",
        "On Wednesday, the Fed raised its benchmark rate for the 10th consecutive time since March 2022, further driving up borrowing costs for businesses and consumers - and yet employers keep hiring.Fed Chair Jerome Powell himself sounded somewhat mystified this week by the job market's durability in the face of rising interest rates.'We've raised rates by 5 percentage points in 14 months,' Powell said at a news conference Wednesday. 'And unemployment is 3.5 percent - pretty much where it was, even lower than where it was, when we started.'The unemployment rate has ranged from 3.4 percent to 3.7 percent since the rate hikes began in March 2022, a historically low level that indicates the tightness of the labor market.'It’s a “jack-in-the-box” labor market: it keeps cranking until eventually a surprise pops up,' Dave Gilbertson, vice president at payroll management firm UKG, told DailyMail.com.'New job creation swelled in April, defying consensus expectations for a cooling job market,' he added. 'In particular, we’re seeing a healthy frontline working economy, with a workforce that remains in high demand and empowered.' ",
        "Although a strong job market is good for workers, it could complicated the Fed's inflation battle by continuing to put upward pressure on wages, which eventually translate to higher prices for consumers as businesses pass on the higher costs.",
        "April's jobs report showed average hourly earnings gained 0.5 percent on the month after advancing 0.3 percent in March. Wages increased 4.4 percent in April from a year ago, after climbing 4.3 percent in March. In April, employment continued to trend up in professional and business services, health care, leisure and hospitality, and social assistance, according to the new data.Professional and business services, a category that includes technical, management, and administrative roles, added a robust 43,000 jobs for the month.Health care added 40,000 new jobs while leisure and hospitality grew by 31,000 jobs, most of them in restaurants and bars. April's growth in total employment flew in the face of rising layoffs in the technology and financial sectors, suggesting that laid off employees are still finding new work with relative ease.",
        "Separate Labor Department data on Tuesday showed that layoffs rose to 1.8 million in March, the highest level since December 2020. The report also showed the number of job openings in the country is declining, albeit slowly, in a sign that the red-hot job market is losing momentum. Employers posted 9.6 million vacancies in March, down from nearly 10 million in February and lowest since April 2021. Still, that number of job openings means that there are 1.68 open positions for every unemployed person seeking work in the country. "
    ]
}