{
    "articleURL": "/tvshowbiz/article-12061309/U-S-rapper-Azealia-Banks-says-no-music-talent-Australia.html",
    "content": [
        "An American hip-hop star has lashed out at the Australian music industry, saying all our musical exports 'suck' with only a few notable exceptions.",
        "Azealia Banks has made no secret of her disdain for Australia, its people and its culture over the years, but it appears her hatred has reached new levels.The 212 hit-maker unleashed on Instagram on Monday about the supposed dearth of talent Down Under, slamming the industry as 'unimportant' on the global stage.She blamed Australia's 'whiteness' for its lack of relevance and talent, adding that international artists shouldn't even bother trying to appeal to the Aussie market.'Australia's media/music/entertainment industry isn't exactly heralded by the heads of government or anyone in the world as a coveted cultural export,' said Banks, 31.",
        "'I don't think they realise how unimportant they are as far as music culture goes because they're deluded with the idea that their whiteness makes Australia an A market when it's truly a C-D market.' Banks went on to say Brazil was a 'much more important market for music than Australia'.She said the only 'internationally appetising' artists to come from Australia are Kylie Minogue, INXS and AC/DC.'Tame Impala is just cheesy to me, and Wolfmother is excellent - but clearly an American rock tribute band,' she added.  ",
        "Banks went on to share a column published in The Guardian which detailed the hurdles faced by up-and-coming Australian artists who struggle to find an audience in their own country due to a lack of appetite for local music.",
        "She added: 'Australians don't even want to hear Australian music.' Banks went on to say Australia only has itself to blame for its shallow talent pool because its colonial history 'stomped all the blackness out'.",
        "'Y'all stomped all the blackness out of Australia – which is why your music exports suck. [It's] one of the most culturally stale white nations on the planet,' she said. It comes after the New York artist announced she was launching a 'full-on' lawsuit following her disastrous Australia tour in December.Banks held a nationwide tour Down Under which took a turn after planned gigs in Melbourne and Sydney were postponed due to 'visa issues', while she also cancelled her Brisbane show at the last minute.At the time, the rapper lashed out and accused her Australian touring agents, Bizarro and Point Productions, of being 'scams' and trying to get out of paying her - claims the promoters denied.Banks took the matter to Instagram saying: 'Looking for a very very powerful lawyer in OZ to take care of that situation in December.'"
    ]
}