{
    "articleURL": "/wires/reuters/article-12059625/POLL-Egyptian-inflation-seen-inching-lower-April.html",
    "content": [
        "Egypt inflation poll data: reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/econ-polls?RIC=EGCPY%3DECI",
        "(Corrects final paragraph to April, not February)CAIRO, May 8 (Reuters) - Egypt's headline inflation rate is likely to edge down in April from a five and a half year high the month before, a Reuters poll showed on Monday, helped by a favourable base effect, a steady currency and weaker commodity prices.The median forecast of 13 analysts polled showed annual urban consumer inflation slipping to 31.0% in April from 32.7% in March.Capital Economics said a steady exchange rate since January, weaker global commodity prices and favourable base effects indicated that inflation had eased in April.\"We expect that April's consumer price data will show that Egypt's headline inflation rate slowed a touch, to 31.4%, year on year,\" said Capital Economics.\"But it will pick back up in the coming months and the lingering pressure presents a major upside risk,\" it added, especially if a further devaluation of the pound pushes prices higher.Egypt has devalued its currency by half since March 2022 after fallout from Russia's invasion of Ukraine exposed its economic vulnerabilities. The government secured a $3 billion financial support package from the International Monetary Fund (IMF) in December.The previous inflation record of 32.952% was reached in July 2017, eight months after Egypt devalued its currency by half as part of an earlier $12 billion IMF support package.",
        "The high inflation puts pressure on the central bank to increase its overnight interest rate when its Monetary Policy Committee (MPC) next meets on May 18.The MPC hiked rates by 200 basis points (bps) at its last meeting on March 30, bringing the deposit rate to 18.25%, to help tame inflation. This brought its total hikes since March 2022 to 1,000 bps.The state statistics agency CAPMAS is scheduled to release April inflation data on Wednesday morning. (Writing by Patrick Werr; Polling by Anant Chandak and Madhumita Gokhale; Editing by MarkPotter)"
    ]
}