{
    "articleURL": "/news/article-12060271/Mother-claims-newborn-decapitated-C-section-says-Brazil-medics-stitched-girls-neck.html",
    "content": [
        "A couple is accusing a Brazilian hospital of malpractice after a doctor 'ripped off' their newborn daughter's head during a C-section delivery Ranielly Santos went into induced labor May 1 when one of the doctors reportedly climbed on top of her body and decapitated her daughter Santos says she was 'treated like an animal' and has not been able to sleep sinceA mother who claims her newborn was decapitated in an emergency C-section in Brazil has said medics tried sewing up the girl's lacerated neck. ",
        "Ranielly Santos, 34, and her husband, Victor da Silva, said their baby's heart was beating before the physician, whose name has not been released, removed their daughter from the womb during the May 1 procedure.'I was treated like an animal,' Santos told Brazilian news outlet R7.Doctors attempted to stop Santos' mother removing a cover over Emanuelly's tiny body before she discovered that her neck had multiple stitches and marks. 'My mother saw the whole procedure. She opened the outfit, but they tried to stop my mother from opening the outfit, that's when we saw that her neck was sewn, full of marks.' ",
        "Santos, who was seven months pregnant, was admitted to Hospital das Clinicas in Belo Horizonte on April 24 due to high blood pressure and went into induced labor a week later.Da Silva recalled seeing his daughter, Emanuelly, blinking her eyes just moments before he watched how the doctor decapitated her.'By the time they pulled her, out she blinked, she was moving,' he said. 'Her little heart, before leaving, was beating.'Da Silva said the doctors were pulling Emanuelly's head and instructed Santos to push.'But she had no more strength,' he said. 'At the last moment they did that, a bunch of people came on top of her, held, held me. (They placed) a general anesthesia on her, she fainted, the child left (died), she was already fainting.'",
        "According to the family, the doctor reportedly climbed on Santos' body before they 'ripped off the child's head.'Santos, who has a nine-year-old daughter, revealed that Emanuelly was at-risk of surviving the birth because of a lung malformation that was caused by cysts that were discovered during a test.",
        "'I am devastated. Every day, I cry. I cannot sleep,' she said. 'Every day I think about my daughter. I wanted her anyway. I knew she had little chance of life, but I wanted her.'The couple confirmed that the hospital apologized for the botched delivery and offered to cover the funeral expenses.They alleged that hospital also offered to provide a report from the medical examiner, but they chose to go to the police.Family attorney Jennifer Valente said she is hopeful that the police investigation will show that the doctor made several mistakes while delivering the baby.'She (Santos) said she was in a lot of pain,' Valente said. 'The doctor, in desperation, told her 'can I cut you?'. She took the instrument and cut her on both sides, without anesthesia, without anything. She has more than 60 stitches.'The hospital issued a statement indicating it was looking into the incident.'The Hospital das Clínicas (HC) da UFMG, administered by the Empresa Brasileira de Serviços Hospitalares (EBSERH), deeply regrets the fact and sympathizes with the family at this time of mourning,' the statement read. 'HC and EBSERH are making every effort to for fact-finding and analysis of the case and support for the family.'"
    ]
}