{
    "articleURL": "/wires/ap/article-12041253/Pope-greets-Russian-Orthodox-envoy-amid-peace-mission-talk.html",
    "content": [
        "VATICAN CITY (AP) - The Holy See's No. 2 official confirmed Wednesday the existence of a Vatican peace \"mission\" to try to end Russia's war in Ukraine, days after Pope Francis raised eyebrows with an offhand revelation of a secret operation that was already underway.",
        "Cardinal Pietro Parolin, the Vatican secretary of state, expressed surprise that officials in both Russia and Ukraine claimed ignorance of the Vatican initiative when they were asked about Francis' comments. Speaking on the sidelines of a book launch Wednesday, Parolin said that both capitals had been informed, Vatican News reported.\"Based on my knowledge, they know, but you know how it is, in bureaucracies it could be that communications that are supposed to arrive don´t arrive,\" Parolin was quoted as saying. \"These are just my interpretations, but I know that both parties were informed.\"Francis revealed the existence of a Vatican \"mission\" on Sunday night during a news conference en route home from a weekend visit to Hungary. During his three days in Budapest, Francis held private meetings with Hungarian Prime Minister Viktor Orbán, who has maintained relations with Moscow, as well as with the former foreign envoy of the Russian Orthodox Church, which has strongly supported the war.Francis was asked during the news conference if either Orbán or Metropolitan Hilarion of the Russian Orthodox Church could help facilitate Vatican mediation to try to end the war.\"You can imagine that in this meeting we didn´t only talk about Little Red Riding Hood, right?\" Francis replied.",
        "He repeated his willingness to do whatever it takes to end the war. \"Also, there is a mission going on now, but it is not public yet. Let´s see how ... When it is public I will talk about it,\" he said.",
        "Parolin confirmed Francis' comments, though he spoke of a \"mission\" in the future tense, not of one already underway.Parolin's comments came as Francis on Wednesday greeted the current foreign envoy of the Russian Orthodox Church, Metropolitan Anthony, at the end of his weekly general audience in St. Peter's Square. Parolin stressed that Anthony was in the Vatican as part of regular contacts between the two churches and that his presence was unrelated to the peace mission.The Vatican has a tradition of diplomatic neutrality and working behind the scenes to end conflicts, and Francis has tried to not antagonize Moscow in his repeated expressions of solidarity with the Ukrainian people. Last week, before Francis went to Hungary, Ukraine's prime minister called on the pontiff and asked his help in particular to help facilitate the return of Ukrainian children taken to Russia."
    ]
}