{
    "articleURL": "/money/markets/article-12041125/Haleon-profits-miss-forecasts-GSK-spinoffs-margins-squeezed.html",
    "content": [
        "Earnings per share of 4.2p on revenues of around £3bn is just shy of forecastsMargins squeezed by 90bps to 23.1% it says because of high cost inflation   Haleon profits fell just short of analyst expectations in the first quarter as the consumer healthcare giant's margins were squeezed by higher costs.",
        "The GSK spinoff - behind brands such as Sensodyne toothpaste and Panadol paracetamol - posted earnings per share of 4.2p on revenues of about £3billion for the three months to 31 March.Haleon pinned the performance, which compares to analyst forecasts of 5.24p per share on sales of £2.9billion, on 'cost inflation and incremental standalone costs'.The effect was to see first quarter adjusted operating profit margins squeezed by 90 basis points compared to the same time last year to 23.1 per cent, which Haleon also blamed on 'adverse transactional foreign exchange'.",
        "Victoria Scholar, of Interactive Investor, says Haleon has been hiking prices to offset inflation, but this has been 'insufficient to prevent a bottom line miss'.However, Haleon's reported revenues soared 13.7 per cent during the period, with the firm boasting solid growth across all categories with the exception of its vitamins, minerals and supplements business.This translated into strong performance across all regions, with Europe, the Middle East and Africa, Latin America, and Asia Pacific posting double digit growth.As a result, reported operating profit was up 34.5 per cent to £627million, 'reflecting a large reduction in separation and admission costs', Haleon said.Brian McNamara, Haleon chief executive, said: 'The new year has started well, and I am particularly pleased that we delivered a healthy balance of positive volume mix and price in the first quarter; demonstrating the strength of the brand portfolio combined with exceptional execution across our markets.",
        "'Our strategy is delivering strong growth and our Q1 performance reinforces my confidence in our ability to deliver. Strong innovation and a continued focus on cost discipline underpins this confidence.'Haleon reaffirmed guidance of full-year revenue 'towards the upper end' of its 4 to 6 per cent target range. Haleon shares fell nearly 4 per cent to 338.9p in early trading, making them the biggest faller on the FTSE 100. They remain up 5.4 per cent since the start of 2023.Scholar added: 'Since the spin-off last summer, shares got off to a difficult start, reaching a trough in September last year but the stock has been progressing nicely in recent months, rallying almost 30 per cent over the past six months.''But the disappointing earnings are weighing on shares today.Also weighing on shares, market analyst at City Index Joshua Warner noted that pharma giant Pfizer plans to start offloading its 32 per cent in Haleon in efforts to 'raise cash to pay down debt and boost shareholder returns'.He added: 'Pfizer chief finance officer Dave Denton told the Financial Times that it will start a 'slow and methodical' sale of Haleon shares within months in order to ensure it doesn't undermine the company's valuation.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}