{
    "articleURL": "/money/markets/article-12054113/Energy-bills-set-drop-2-000-ease-pain-families.html",
    "content": [
        "Average household energy bills could fall to below £2,000 a year this summer after a slump in gas prices, analysts predict.",
        "Annual gas and electricity charges may dip to £1,900 for the typical household by July as 'normality' returns to the energy market.The current energy price cap – set in April – is £3,280 a year.Figures show that the gas price has returned to where it was 15 months ago, before Russia's invasion of Ukraine sent shockwaves through the energy sector.Experts have said falling gas prices will bring huge relief to families burdened by eye-watering energy costs.",
        "Rising prices resulted in the collapse of about 30 energy suppliers in the UK from 2021 on, and led to the Government paying billions of pounds in taxpayer support.A surge in the price of wholesale gas was also a key driver in the cost-of-living crisis, helping push inflation into double digits.Tony Jordan at energy consultancy Auxilione said 'fear is coming out of the markets.' He added: 'The gas price is about 80p a therm. Back in August, it was £7. We were forecasting some scary numbers, but the price has really come down. It is heading in the right direction.'Energy regulator Ofgem will set the next price cap at the end of this month to cover the period from July to September.Customers have typically been paying less than Ofgem's level as the Government's separate Energy Price Guarantee capped the typical household bill at £2,500 a year.",
        "Jordan said lower wholesale gas prices would start filtering through to people's bills by the summer, which is when the Energy Price Guarantee ends.Simon Cran-McGreehin, head of analysis at the Energy and Climate Intelligence Unit, said gas prices have plunged thanks to Europe weaning itself off Russian supplies. He said the 'remarkable' drop in energy usage across the Continent and UK also eased pressure on prices. Government data shows that energy demand fell to levels not seen in 50 years throughout winter as millions tried to minimise the energy they used at home.But Cran-McGreehin warned that the price of wholesale gas could remain up to three times higher than before the crisis if countries keep avoiding energy from Russia. An Ofgem spokesman said: 'Right now, we anticipate the next price cap will be lower, but future levels remain uncertain.'The regulator said lower prices were good news for competition returning to the market as suppliers will be able to offer customers cheaper deals.Cran-McGreehin added: 'Competition was one of the many casualties of the energy crisis because all customers ended up on the price cap. Now that prices have fallen, there is more leeway for suppliers to offer different tariffs.'Jonathan Brearley, Ofgem boss, said last month it is 'unlikely prices will return to those seen before 2021.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}