{
    "articleURL": "/wires/pa/article-12056811/Six-best--Celtic-s-key-games-en-route-winning-cinch-Premiership-title.html",
    "content": [
        "Celtic have sealed their 11th title success in 12 years.",
        "Ange Postecoglou’s side topped the table when they beat Aberdeen 2-0 on the opening weekend of the season in July and have never dropped down at any stage.Here we look back at six key games in the title race.Ross County 1 Celtic 3 (August 6)Postecoglou’s side came through a difficult situation in their second game at a ground where Celtic have experienced some troubles in recent years.Alex Iacovitti cancelled out Kyogo Furuhashi’s opener with County’s first effort on target in the 58th minute but Moritz Jenz headed a debut goal six minutes from time and Liel Abada curled home in stoppage time.Postecoglou hailed his side’s “outstanding” response to County’s goal and added: “We stuck to our task, played our football, scored another good goal and even then there was no thought of stopping there, we got our third and I’m really pleased with every aspect of our game.”Celtic 4 Rangers 0 (September 3)The Bhoys moved five points clear with a convincing victory after sweeping their city rivals aside in the first half thanks to Abada’s double and a Jota goal. David Turnbull accepted a late gift to round off another thumping win six days after Celtic recorded a record 9-0 away win over Dundee United.Postecoglou said: “The league table isn’t important right now. What’s important is how we play. If we continue to play like that, absolutely, we’re going to be hard to stop.”",
        "St Johnstone 1 Celtic 2 (October 8)Celtic looked set to drop points for the second successive away match following defeat by St Mirren, when St Johnstone defender Alex Mitchell scored a stoppage-time equaliser to wipe out a first-half own goal. But Giorgos Giakoumakis turned home Alexandro Bernabei’s cross in the fifth minute of time added on.“You can win a game of football many ways but winning it this way also provides some confidence in the fact that we still have that character and resilience in the group,” Postecoglou said.Aberdeen 0 Celtic 1 (December 17)The long mid-season break threatened to disrupt the flow of every in-form team and Celtic faced a challenge in their first game back as then Aberdeen boss Jim Goodwin parked the bus at Pittodrie.Celtic had 33 efforts at goal compared to Aberdeen’s two, both of which were off target, and enjoyed 80 per cent possession, but did not make it count until Callum McGregor netted from 20 yards in the 87th minute in his comeback from a knee injury.Postecoglou said of his captain: “We did awfully well to cover his absence but it doesn’t take away from the fact he is a fantastic footballer and he makes our team even better.”Rangers 2 Celtic 2 (January 2)",
        "Celtic took a nine-point lead to Ibrox against a Rangers side who had won their first four matches under Michael Beale. Daizen Maeda gave Celtic an early lead but their dominance was affected by an injury to Greg Taylor and goals from Ryan Kent and James Tavernier turned the game on its head just after the break.",
        "However, Furuhashi netted a poacher’s goal from 12 yards in the 87th minute to protect Celtic’s advantage at the top of the table.Postecoglou said: “There isn’t anything like a lost cause. You go till the final whistle and nothing changes. For that to be effective, you have to do it on a weekly basis. And we do.”Celtic 3 Rangers 2 (April 8)",
        "Both teams kept on winning until their next meeting, which was do or die for Rangers. The visitors had an early Alfredo Morelos goal ruled out before a double from Furuhashi and another Jota goal saw Celtic open up a 12-point lead despite Tavernier’s double.Postecoglou branded his Japanese striker a “winner” and added: “He wants that responsibility to rise to the occasion. He wants to be the person who delivers and he did it again today.”"
    ]
}