{
    "articleURL": "/wires/ap/article-12047383/Trump-calls-accuser-nut-job-recording-played-jury.html",
    "content": [
        "NEW YORK (AP) - Donald Trump hinted Thursday that he might show up soon at the New York City trial where a jury is hearing allegations that he raped a woman in the mid-1990s.",
        "The former president's lawyers insist that he won't attend the proceedings or testify. Now the judge is offering him one last chance to change his mind.After writer E. Jean Carroll´s lawyers rested their case, U.S. District Judge Lewis Kaplan was reluctant to let Trump´s lawyers rest their case without calling any witnesses.He said he would give Trump until 5 p.m. Sunday to provide his final answer about testifying in his own defense in response to Carroll's allegations that he sexually assaulted her at a posh Manhattan department store in spring 1996.\"If he has second thoughts, I´ll at least consider it,\" Kaplan said in court after the jury had been sent home for the day, adding that if Trump misses the deadline, \"That ship will be irrevocably sailed.\"Hours earlier, Trump suggested to reporters while golfing in Ireland that he would \"probably attend\" the trial, but lawyer Joseph Tacopina said there were no plans for him to do so.",
        "Barring a Trump appearance, Kaplan said, lawyers will make closing arguments Monday.Trump, visiting his golf course in Doonbeg, Ireland, also repeated his claim that the case is a political \"scam.\" He knocked Kaplan, a Bill Clinton appointee, as an \"extremely hostile\" and \"rough judge\" who \"doesn´t like me very much.\"",
        "Kaplan, who was irked at the the trial´s outset when Trump criticized the case on social media, did not address his latest remarks.In lieu of Trump's live testimony, jurors saw more of a video deposition Trump gave last October, including portions in which he blasted Carroll as a \"nut job\" and \"mentally sick.\"A transcript of Trump's testimony emerged in pretrial court filings, but the excerpts played in court allowed jurors to hear him speak about the case in his own voice.Carroll's lawyers rested their case after playing the remaining deposition excerpts and calling three witnesses. They included a friend who said Carroll told her about the alleged rape soon after it happened and an expert hired by Carroll´s lawyers who estimated that public denials by Trump caused millions of dollars in damage to the accuser´s reputation.The testimony shown Thursday also included Trump standing by his prior comments that Carroll was not his \"type\" and defending as \"locker room talk\" his notorious boasts in a 2005 \"Access Hollywood\" recording about grabbing women's genitals.Later, Northwestern University sociologist Ashlee Humphreys testified that a statement Trump made in October 2022 reiterating prior denials had caused between $368,000 and $2.76 million in harm to Carroll´s reputation.Trump's statement, posted on his Truth Social platform just days before he sat for the deposition, was seen by an estimated 13.8 million to 18 million people, Humphreys testified. She cited social science modeling she performed on behalf of Carroll's lawyers.",
        "Trump's earlier denials caused even more reputational harm, Humphreys said, as when Trump claimed that he had never met Carroll and when he said she was \"totally lying\" just after she went public in June 2019.Those estimates could be a factor if the jury finds that Trump defamed Carroll and must weigh monetary damages. She is seeking an unspecified amount of money and a retraction of Trump statements that she alleges were defamatory.Carroll, a 79-year-old former magazine advice columnist, has said that she and Trump ran into each other at the store, got into lighthearted banter about trying on lingerie and went jokingly into the fitting room, where he slammed the door and suddenly became violent.Not until 2019 did she make the accusations public and take legal action, but two of her friends have testified that she described the attack to them shortly after Carroll said it occurred.\"I believed it then, and I believe it today,\" one of those friends, former television news anchor Carol Martin, said Thursday on the witness stand.Trump, 76, says that Carroll fabricated the entire encounter and that he has never met her, except for a brief exchange of pleasantries at a 1987 social event.\"I think she's sick, mentally sick,\" Trump said calmly during the deposition. He added: \"She said that I did something to her that never took place. There was no anything. I know nothing about this nut job.\"",
        "The Associated Press typically does not name people who say they have been sexually assaulted unless they come forward publicly, as Carroll has done.___On Twitter, follow Jennifer Peltz at twitter.com/jennpeltz and Michael Sisak at twitter.com/mikesisak and send confidential tips by visiting https://www.ap.org/tips/."
    ]
}