{
    "articleURL": "/wires/afp/article-12038013/UN-leader-slams-Taliban-womens-rights-amid-stability-fears.html",
    "content": [
        "UN chief Antonio Guterres made a new attack on the Taliban government's \"unprecedented\" curbs on Afghan women's rights Tuesday as he highlighted international fears over stability in the crisis-stricken state.",
        "The United Nations is reviewing its Afghan operations after the Taliban authorities banned women working for aid agencies, but Guterres said leading powers at a two-day meeting in Doha wanted new efforts to try to change its policies.The review will only be completed on Friday and the UN has said it faces an \"appalling choice\" over whether to stay in Afghanistan.But Guterres told a press conference: \"Throughout the past decades, we stayed, and we delivered. And we are determined to seek the necessary conditions to keep delivering.\"He added: \"To achieve our objectives we cannot disengage and many (in the meeting) called for engagement to be more effective.\"The UN secretary general called the talks to seek new ways to pressure the Taliban government after it banned Afghan women from working for UN agencies and NGOs.That added to international outrage after they were also barred from almost all secondary and university education and most government jobs.The talks involved envoys from the United States, Russia, China and 20 other countries and organisations, including major European donors and neighbours such as Pakistan.Taliban authorities were not invited however and Guterres said he was not ready to meet them \"today\", though he did not discount a future meeting.- Taliban rejection -",
        "The head of the Taliban representative office in Doha, Suhail Shaheen, said that excluding a representative at the meeting could prove \"counter-productive\".\"Putting pressure doesn't help in solution of issues,\" Shaheen told AFP in a written statement.\"The world should listen to us. By denying our legitimate rights and not inviting us to meetings about Afghanistan or not listening to us, they neither can change the reality which is IEA (the Islamic Emirate of Afghanistan) nor can find a palatable solution which is a need.\"The UN secretary general said countries at the talks had raised fears over rights, \"the persistent presence of terrorist organisations\" and drug trafficking.\"The participants are worried about the stability of Afghanistan and expressed those serious concerns.\"Guterres said the \"unacceptable\" ban on women taking part in aid agency work \"puts lives in jeopardy\" because of their vital role.\"We will never be silent in the face of unprecedented and systemic attacks on women and girls' rights,\" said Guterres.\"Millions of women and girls are being silenced and erased from sight,\" he added. The ban was a violation of Afghanistan's \"obligations under international law.\"- 'One step from famine' -The Taliban government has firmly rejected criticism of the curbs on women, calling them an \"internal social issue\".",
        "No country has established formal ties with the Taliban government since it returned to power in August 2021.One envoy who attended the Doha talks said \"no country present indicated that it was ready to form any kind of ties.\"The meeting of the 23 countries and international institutions was held amid mounting problems for the country of 38 million people suffering worsening shortages because international supplies have slowed.\"It is difficult to overestimate the gravity of the situation in Afghanistan today,\" said Guterres.Six million people are \"one step away from famine-like conditions\" and funding has \"evaporated\", he added. A UN appeal for $4.6 billion for its relief operation has raised only $294 million.Meanwhile, Afghan Foreign Minister Amir Khan Muttaqi will go to Islamabad at the end of the week for talks with Pakistani and Chinese officials, his ministry said.Muttaqi is subject to a UN travel ban, but has previously been given exemptions for official visits to the neighbouring country."
    ]
}