{
    "articleURL": "/sport/othersports/article-12041119/AEW-tickets-dates-watch-London-summer.html",
    "content": [
        "All Elite Wrestling will make its UK debut later this summer with All In LondonAnthony Ogogo, Jamie Hayter and Saraya are all set to feature at the eventWembley Stadium will host a wrestling event for the first time since 1992All Elite Wrestling will make its UK debut later this summer, with the organisation set to host All In London at Wembley Stadium. ",
        "It will be the first time in over 30 years that a professional wrestling event has taken place at Wembley.AEW: All In London will feature British stars such as AEW Women’s World Champion Jamie Hayter, Saraya, Nigel McGuinness, Pac and former Olympic boxer Anthony Ogogo. Ogogo signed with WWE's rivals in 2019 a few months after retiring from boxing.Pre-sale tickets for the event have already been released, with more set to go on sale later this week. But when is All In London? And how can you buy tickets? Mail Sport provides all the answers below. ",
        "When is All In London?AEW: All In London is set to take place on Sunday, August 27, at Wembley Stadium. The event will get underway at around 6pm.It will be the first professional wrestling match to be held at the iconic stadium since WWE SummerSlam in 1992.On that night, it was recorded as the WWE's highest-attended show of all time with over 80,000 fans in attendance.How to buy ticketsPre-sale tickets for the event went on sale yesterday at 11am for fans who pre-registered.More tickets will go out on sale tomorrow on Live Nations and Ticketmaster from 9am until 8am the next day.However, should you miss out on the pre-sale tickets, fans will have the chance to try their luck at general sale.",
        "General sale tickets will go live at 9am on Friday through the official Ticketmaster website. In total, over 90,000 are set to make the trip to London on the August bank holiday weekend.",
        "What's been said?Tony Khan, who owns Premier League side Fulham, is also the president and CEO of AEW.Khan revealed that he is hoping that AEW's debut in London will be 'epic in scale'. 'The UK is one of the most important markets in professional wrestling, and AEW is coming in hot as the number one wrestling company in the UK on television', said Khan. 'We want our debut in London to be epic in scale, and there's no better venue than Wembley Stadium to deliver what I know will be one of the greatest events in AEW's history. 'This April also marks 100 years of Warner Bros. and 100 years of Wembley Stadium – it's a fitting time to come together for AEW: All In London at Wembley Stadium.' "
    ]
}