{
    "articleURL": "/wires/aap/article-12049379/Cox-Pendlebury-boost-high-flying-Magpies.html",
    "content": [
        "Jack Ginnivan has been squeezed out of the Collingwood side as Mason Cox and Scott Pendlebury get the green light to return from injuries in the AFL clash with Sydney.",
        "Former captain Pendlebury has overcome an eye issue that kept him out of last week's thrilling one-point triumph over Adelaide, which put the Magpies one win clear on top of the ladder.Ginnivan was held goalless from just 10 touches against the Crows and has managed just three majors in as many outings since returning from suspension over his summer drugs scandal.That form has cost the 20-year-old livewire his spot, with Nathan Kreuger (ribs) also going out of the side.In a huge relief for coach Craig McRae, particularly with Kreuger unavailable again, Cox is back after five weeks out with a spleen injury to bolster the Magpies' depleted tall stocks.Cox will lead the ruck against Sydney duo Peter Ladhams and Hayden McLean at the MCG on Sunday with Darcy Cameron (knee), Aiden Begg (back), Dan McStay (finger) and Kreuger all out of action.Cox's return will mean Billy Frampton returns to the back-line - where Swans superstar Lance Franklin lies in wait - while also allowing Ash Johnson to spend more time focused on forward-line duties.\"It's good to have someone tall back in the team but also it allows some other things to fall into place,\" McRae told reporters on Friday.\"We've had some moving parts of our team, everyone sees that, but hopefully now we get some stability in that part of our game.",
        "\"Billy Frampton's been enormous for us and he's been able to hold down that (ruck) position for a number of weeks now.\"But there's a cost elsewhere to our game and it will be nice to have that one little chess piece back in position.\"Cox completed his only full-contact training load since sustaining his injury as Collingwood were put through a relatively light session at the AIA Centre on Friday.McRae is adamant the American-born 211cm target, who has played 96 AFL games to date, is fit to play.\"That was the concern, has he done enough work, but I back in our high performance team,\" McRae said.\"He's up for selection and we'll go for it.\"I wanted him to show us that he is ready (on Friday) because he hasn't done any physical contact until today but I think he made a statement.\"Pendlebury also got through Friday's training session and is set to play against Sydney, who ended the Magpies' premiership dream last year in a preliminary final.\"He's not quite there yet but he got through training and he's just improving every day,\" McRae said.\"We'll pick him and he'll be available.\"Sydney have recalled Robbie Fox and Justin McInerney with Aaron Francis, Angus Sheldrick and Dylan Stephens all omitted after last week's derby defeat to GWS."
    ]
}