{
    "articleURL": "/news/article-12061093/Millions-Brits-join-Big-Help-tribute-Kings-decades-public-service.html",
    "content": [
        "Millions of volunteers took part in the Big Help Out to celebrate the CoronationMillions of volunteers took part in yesterday’s Big Help Out as the nation lent a hand in tribute to the King’s decades of public service.",
        "Many helped to plant more than 3,000 native wild flowers in Green Park, central London, in the same spot where the public laid floral tributes for the late Queen last September.Armed with their dibbers and waterproofs, almost 200 volunteers, including eight-year-old Fidela Campana, planted trays of seedlings to mark where the River Tyburn once flowed.Elsewhere, the public spruced up the capital’s red telephone boxes.And the Duchess of Edinburgh too lent a hand yesterday as she helped run a puppy class. Sophie, 58, and her husband, the Duke of Edinburgh, 59, joined volunteers and canines Lucy, Hollie, Luker, Nyla and Sunny at Guide Dogs for the Blind Association’s training centre in Reading.",
        "The site was transformed into a pop-up cafe designed to teach the animals the skills to become guide dogs as well as raise awareness about volunteering. Fran Tayor, 75, from Theale, Berkshire, who has fostered 17 puppies over the past 20 years, said of the couple: ‘They’ve both got dogs themselves and they were brilliant with them, but the duchess was better.’Meanwhile, the public mucked in at a stables in Wales and helped to paint walls, fix fences and raise money.Lluest Horse Pony Trust, near Llandeilo, Carmarthenshire, hoped to increase its funds to continue its work in rescuing, rehabilitation and re-homing animals.",
        "And in Chichester, West Sussex, several got stuck in with litter-picking near the harbour. Elsewhere, locals helped to clean the ornate regalia in the city’s 940-year-old Cathedral.Residents including Peter de Buisseret helped to shine the brass lectern. Others – many of them first-time volunteers – dusted its chapels and deep-cleaned the choir stalls.",
        "The cathedral has more than 400 regular volunteers, including flower arrangers, stewards, and bell ringers.Back in Green Park, the Harrison family from Orpington, south-east London, including primary school teacher Debbie, 42, husband Steve, a 41-year-old art director, children Lila, 11, Dylan, 13, and their grandmother Ann Miller, 68, helped out with planting.Asked why they volunteered, Mrs Harrison told the Daily Mail: ‘It’s a nice end to the Coronation weekend and to be part of something which we could do together as a family, and outside too!’The project, run by the Royal Parks, was devised to create a lasting tribute to the late Queen while also creating a food source for foraging insects and bees."
    ]
}