{
    "articleURL": "/wires/reuters/article-12052721/Fire-floods-western-Canada-force-evacuations.html",
    "content": [
        "By Nia Williams",
        "May 5 (Reuters) - A week of record hot weather in western Canada has forced thousands of people to evacuate their homes, as wildfires rage in parts of Alberta and rapid snow melt triggers flooding across interior British Columbia.By Friday, more than 13,000 people were under evacuation orders in Alberta, as 78 fires burned. Among the worst-hit areas was the territory of the Little Red River Cree Nation, which comprises three communities in the north of the province, where the 1,458-hectare (3609-acre) Fox Lake fire consumed 20 homes and the police station.The entire 7,000-strong population of Drayton Valley, 140 km (87 miles) west of the provincial capital Edmonton, was also ordered to evacuate late on Thursday night.Pembina Pipeline Corp, which operates oil-gathering pipelines in the region, said it has activated emergency response and incident management processes and is \"evaluating any current or anticipated operational impacts\".There were no reported impacts on oil and gas producers.There have been 348 wildfires in Alberta this year and more than 25,000 hectares burned, said Christie Tucker, an information unit manager for Alberta Wildfire.\"This is significantly more wildfire activity for this time of year than we have seen any time in the recent past,\" Tucker told a press conference, adding fires were expected to intensify on Friday.",
        "\"It's going to get hotter, it's going to get windier and we are expecting some extreme wildfire behaviour. Firefighters are at the ready today for what could be an extremely challenging day,\" she said.In British Columbia, rivers burst their banks, washing through homes and forcing highway closures in numerous communities across the province's interior, including Cache Creek and Grand Forks.Until last week western Canada had been enduring a cold spring but the rapid onset of unseasonably high temperatures, in places 10-15 C above the average for early May, is causing both fires and flooding.With heavy rain in the forecast, the British Columbia government urged communities to be prepared for more flooding over the weekend.\"Warm temperatures in the Interior have accelerated snowmelt and caused increased pressure on rivers and creeks,\" the Ministry of Emergency Management said in a statement.\"The situation is expected to worsen as rainfall and thundershowers are forecast for Friday, May 5, and Saturday, May 6, which increases the likelihood of flooding.\" (Reporting by Nia Williams in British Columbia; Editing by Mark Porter, Alistair Bell and Sandra Maler)"
    ]
}