{
    "articleURL": "/femail/article-12057139/Cheering-Mum-Camillas-children-Tom-Parker-Bowles-Laura-Lopes-Coronation-concert.html",
    "content": [
        "Camilla's daughter Laura Lopes, 44, and her son Tom Parker-Bowles attended Windsor Coronation concert  READ MORE: For all the latest Royal news, pictures and video click here Cameras caught the very sweet moment Queen Camilla spotted her grandchildren in the crowd at tonight's concert. ",
        "The King's wife, 75, could be seen waving from the royal box at her children and grandchildren who were sat a few seats below ahead of tonight's Coronation Concert at Windsor Castle. Gus, Freddy, Louis, Eliza and Lola and their parents, Laura Hopes and her brother Tom Parker-Bowles were all invited to attend tonight's star-studded concert, but were not sat in the royal box, which was full. It comes as eagle-eyed royal fans noticed that Camilla had also paid a subtle tribute to her loved ones on her show-stopping gown for the Coronation at Westminster Abbey yesterday.She had the names of her children and grandchildren discreetly embroidered near the bottom of her skirt. ",
        "Sharing close up snaps of the gown on Twitter royal expert Victoria Howard spotted that the bespoke dress appeared to reveal the names of her two children, Tom and Laura, along with those of her grandchildren. People also noticed two gold terrier pups embroidered onto the gown to represent Charles and Camilla's rescue dogs Beth and Bluebell.The royals rescued the pooches from Battersea Dogs' and Cats' Home in 2017. The two adorable dogs have even made Buckingham Palace their new home.Meanwhile her grandsons were pages of honour during the ceremony and her granddaughter was present on the day.",
        "The son of food writer Tom Parker Bowles, Freddy, 13, was a page of honour during the ceremony. While Camilla's daughter Laura Lopes, children Louis Lopes, 12, and the twin brother of Gus also had a role to play and were seen on Buckingham Palace balcony after the coronation ceremony. Take That, Katy Perry, Lionel Richie and others took to the stage in Windsor for a musical extravaganza following the King's coronation yesterday.And in a second rare public appearance in a matter of days, Camilla's children Tom and Laura were amongst the VIP guests to cheer on their mother and stepfather Charles, the new King.",
        "The two siblings have long been supportive of their mother's relationship with the King and enjoy close relations with the royal family. Laura's daughter Eliza was a flower girl to William and Kate when they wed in 2011.  Camilla was married to her two children's father, Andrew Parker Bowles from 1973 to 1995. Despite their mother's elevation to Queen Consort, her two children will now receive any new royal privileges, nor become part of the line of succession.  Tom recently defended his mother in public, hitting back at Prince Harry for suggesting Her Majesty was 'dangerous' and a 'villain' who 'played the long game' to get her hands on the crown.",
        "He lambasted the controversial Prince for the comments aimed at his mother.Although Harry's ghostwritten mudslinging memoir Spare has flown off the shelves, it has courted a number of scandals since publication.",
        "Parker Bowles told The News Agents podcast: 'I don't care what anyone says — this wasn't any sort of end game. She married the person she loved and this is what happened.'In a rare interview, he also said that it was understandable if his mother felt anxious in the run up to being crowned alongside King Charles on May 6.However the food writer added that Camilla had always been the 'uncomplaining' type.He said: 'I think anyone would be anxious on an occasion of this sort of importance in terms of the historical.'And yes, I think I'd be terrified if I had to sort of walk out wearing ancient robes... She's 75, but you know, it's tough to do it. But she's never complained. You just do it. Get on with it.'Tom, who writes a column for the Mail on Sunday newspaper, rarely speaks about his mother publicly.",
        "But he revealed that it wasn't 'weird' to think of his mother as the Queen, saying: 'She's still my mother... I think change happens, but I don't care what anyone says.",
        "'This wasn't any sort of end game, she married the person she loved, and this is what happened.'The writer, whose father is Camilla's first husband, Andrew Parker Bowles, added that it wouldn't change their lives at all and that it would be 'appalling' if he was to become a Duke.He said: 'You're not going to find us with great estates and being called the Duke of Whatever. No, that would be appalling.''I become nothing. There would be a revolution if they start handing them out to people like me. No. Why would I expect one?'He added of his mother and step-father: 'I think they're doing amazingly. I think King Charles is a good, kind, intelligent man who cares deeply about his roles wherever they may be, Prince of Wales, the King.'He's been way ahead of his time on issues like sustainability, food security, farming, pollution, all these things. But people were calling him sort of mad and eccentric 20 years ago.'Everything that he's talked about are now things that have hit the mainstream and now we're really worrying about. He uses his position, as far as I'm concerned, to do good.'He also said his son, Freddy, was unaware of quite how big his star role as a Page of Honour to the King and Queen would be.",
        "'I don't think he has a sense of the occasion. He's a 13-year-old boy who loves football, a Spurs supporter... So, his worries are about the Spurs manager and losing when we're up and that sort of stuff,' he said.'There's no reason for our children to be in the Press at all and so we've purposely kept them well away from anything to do with that...'I think there are a lot of rehearsals are going to happen before and he's doing it with his cousins, his two best mates, and my first cousin's son so they will know each other.'It comes after Buckingham Palace said the King and Queen were 'deeply touched' by the nation's celebration of their coronation.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September.The concert came after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.",
        "The King, Queen and royal family joined around 20,000 members of the public at the musical extravaganza.Heir to the throne William took to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, saw Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones appear via video message.The series of pre-recorded sketches revealed little-known facts about the monarch and included moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.There was also performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood - whose grandson Arthur Eliot was one of Camilla's pages of honour - and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang performed too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.Meanwhile, Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles' favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said."
    ]
}