{
    "articleURL": "/tvshowbiz/article-12052317/Anna-Nicole-Smiths-ex-Larry-Birkhead-reveals-never-shared-details-relationship.html",
    "content": [
        "Anna Nicole died at age 39 in 2007 - six months after giving birth to Dannielynn, 16, whom she shared with photographer Larry, 50 Larry tells DailyMail.com exclusively that he moved in Anna three months after meeting - and lived with her until she was five months pregnant The acclaimed photographer is attending the Kentucky Derby this weekend with Dannielynn - 20 years after meeting her mom at the same eventAnna Nicole Smith's ex Larry Birkhead is getting set to make his annual appearance at the the Barnstable-Brown Kentucky Derby this weekend with daughter Dannielynn - 20 years after fell for the iconic supermodel at the same event in what he calls, a 'magical' encounter. ",
        "Larry, 50, spoke exclusively to DailyMail.com about their rollercoaster four-year relationship leading up to Anna's tragic death - and gave shocking and intimate details that have never been shared before. Larry first met Anna 20 years ago in 2003. 'She blew me kisses and I was intrigued by her, nothing came out of it. The second year I saw her at the Kentucky Derby gala, however, was magical,' he says.Three months after their fateful encounter at the derby, Anna asked Larry to leave his home in Kentucky to move in with her at her home in Los Angeles. He agreed and the couple lived together for two-and-a-half years - until she moved to the Bahamas at five months pregnant with their daughter, Dannielynn. ",
        "In his own words, Larry tells DailyMail.com, 'I met Anna first in 2003 and she blew me kisses. I was intrigued by her but we didn't have too much interaction.''She came back the next year and she had totally transformed.  I always thought she was so beautiful. She has a unique look. But when she returned to the Derby in 2004 she was in her tip top shape.'Looking back, Larry says,  'I think when she came back in 2004 to the party that her confidence had changed. And she was a totally different person. The second year when she came back that is when the magic happened.'",
        "'She was blowing me kisses, but I thought she was doing that for everyone. Being flirtatious for the camera. I never thought that she would want some guy like me from Kentucky when she could have any guys who wants.'The infamous photo of the two of them - with Anna on the left wearing a pink feather hat - was taken during their 2004 encounter. After the event, however, Larry - who worked as a photographer at the time - assumed that would be it - until he received a call from her management team. 'Anna had her people call me and ask if I wanted to come out and photograph her for a charity event that she was doing for a children's camp, Camp Kindle. So I flew out there and the sparks were there again.''Anna gave me her number after the charity event, but I was sure she gave me the wrong number. So when I called her for the first time, I was surprised that she answered. But we hit it off again on the phone.'After chatting back-and-forth for a few weeks, it was evident that there was something there - enough for Anna to make a proposition to Larry that he could not refuse.",
        "'I got a call from Anna and she said that she wanted me to move in with her in L.A. and be her personal photographer,' he recalls.'This was three months after we ran into each other at the Kentucky Derby.''Of course I said yes. When I first went there, I looked around her house and I asked her, 'where am I going to stay?' She laughed and responded, 'In here with me,' pointing to her bedroom. From that point, I lived with Anna for two-and-a-half years. Nobody knows this so a lot of people speculate.''We lived together in her house until Anna was five or six months pregnant with our daughter.'At the time, Anna was involved in a legal battle for $30 million, which she claimed was promised to her by her ex-husband, billionaire J. Howard Marshall. Anna wed him in 1994 when she was 26 years old and he was 89.He died 14 months after marrying the Guess pinup, leaving behind a whopping $1.6 billion fortune. A court battle ensued, which Larry says led to their separation. 'We were living together and doing baby planning. We were picking out names for our baby,' Larry says, adding, 'Despite what anyone says, Anna knew I was the father.'",
        "'They took her to the Bahamas because she was in a lawsuit for all that money, and they thought that I was going to try and take it from her, so they saw me as a threat and Anna believed it.'     'It was a game I had to play and go through the motions. But we stayed in contact until the time when she passed away,' he tells DailyMail.com.    Anna Nicole gave birth to Dannielynn in the Bahamas in September 2006. Three days after her birth, Anna Nicole's only son, Daniel, died of a drug overdose Anna died six months later, in February 2007. Anna and Larry's relationship was further complicated after Dannielynn's birth - with the model insisting that her lawyer Howard K. Stern may be the father of Dannielynn.In an attempt to solidify this, Anna wed Howard in a shotgun ceremony on a houseboat in the Bahamas just a few weeks after giving birth.  Anna put Howard's name on Dannielynn's birth certificate - and Larry found himself embroiled in a bitter custody battle that went on for months after the model's death.On April 10, 2007 a judge ruled Larry as Dannielynn's biological father after it was determined by a DNA test. ",
        "Larry immediately amended the birth certificate, transferring the parental rights from Howard to him.   ",
        "He also moved Dannielynn to his home in Kentucky, where they still live today. When asked if there was anything that Dannielynn does that reminds him of Anna, he laughed. 'Yeah she can spend my money like her mom. And she loves to do that.' 'After nearly 17 years of raising my daughter on my own, people see that's a resume that speaks for itself. I don’t care what people say about anything else,' Larry says about the criticism he sometimes gets. 'Some people get mad because they can't get the access to me or Dannielynn. So, they try to cling on for whatever reason, publicity or whatever, so you must build up a wall. That is what I have done forever,' Larry adds.Regarding his daughter, who never got a chance to know her iconic mom, Larry tells DailyMail.com, 'I've created such a foundation for that I've given the tools to say, look, this. Life is normal now.''I'm very picky and selective. She's very grounded and very humble. She is not one of these entitled celebrity kids. She's gone to a public school all her life. That's what she chose. She said I want to go to public school and not to private.''Dannielynn is on the honor roll and she makes great grades. She is taking college level classes.  Anna would be very, very proud of her. I know I am.' "
    ]
}