{
    "articleURL": "/tvshowbiz/article-12040999/Jesy-Nelson-poses-bikini-boyfriend-Zion-Foster.html",
    "content": [
        "Jesy Nelson shared a series of sweet recent snaps on Tuesday night as she posed in a bikini and spent time with her new beau. ",
        "The singer, 31, took to Instagram to post the photo dump of herself enjoying days out with her boyfriend Zion Foster and pals.The musician sported a bikini top and leather jacket with a pair of tracksuit bottoms in one picture taken while she was having a meal out. Jesy smiled from ear-to-ear as she posed with her boyfriend by a sign which read: 'Being with you makes my heart smile'.In another shot, she played Zion at basketball and a separate picture showed her smiling as she enjoyed an outdoor market. ",
        "It comes after Jesy suffered a huge blow to her solo career, as it was revealed her new single Bad Thing has completely failed to chart.The former Little Mix singer independently released her second track on Friday April 14, as the follow-up to her debut song, Boyz, in October 2021.But despite much promotion on her social media, her latest attempt at cracking the music industry by herself has caused her a major setback.It emerged that Bad Thing had not been included in the Official Singles Chart Top 100.While Boyz racked up an impressive 25 million views on YouTube, Jesy's latest music video had only reached 417k at the time of publication, as well as 426k streams on Spotify.Lewis Capaldi's Wish You The Best had a viewer count of 2.8 million on the video sharing platform at the time of publication and shot straight to number one in the Top 40.",
        "Her new track couldn't be further away from her divisive first solo R&amp;B single Boyz, which also featured Nicki Minaj and was released through Polydor.Going in a very different direction for her second single, Jesy showed off her vocal range as she sang about a toxic ex-boyfriend in the powerful song, accompanied by a 1970s-inspired video. ",
        "She is now set to release her third solo single Cried Out after parting ways with Polydor in July last year due to 'creative differences'. It follows claims that Jesy is about to sign a major new deal with Warner Records.She is said to be in advanced talks with the label and they will be keeping a close eye on her and fan reaction to the song before offering a deal, according to reports. Jesy shot to fame with Leigh-Anne Pinnock, Perrie Edwards and Jade Thirlwall as part of The X Factor-winning girl group Little Mix in 2011 but quit the band in 2020.Little Mix then continued as a trio and released the hit album Confetti together before going on hiatus in 2022.Jesy was the first to make the move into solo music with Boyz before Leigh-Anne, 31, signed a solo deal with Warner Records in March 2022.Jade, 30, has also been in the studio working on her album with help from her Rizzle Kicks star partner Jordan Stephens.",
        "Meanwhile, Perrie, 29, has also been working on solo music but said she does not have a 'set timeline' and has been enjoying being able to discover her own sound.Jesy has been spending weeks teasing her upcoming album but the release date is yet to be announced. She went public with Zion in January after growing close to him in 2022. "
    ]
}