{
    "articleURL": "/wires/ap/article-12043797/NHL-playoffs-Kraken-Panthers-seek-2-0-leads-road.html",
    "content": [
        "The Seattle Kraken and Florida Panthers both had to quickly go from Game 7 victories on the road to starting their second rounds as visitors again just two days later.",
        "The supposed underdogs carried momentum from those series clinchers into Game 1 wins against teams that had some extra rest. The Kraken and Panthers have the opportunity Thursday night to to grab 2-0 series leads before finally going home.\"A quick turnaround, there´s a disadvantage in terms of the amount of energy, right. You don´t have the rest, you don´t have the luxury of a little bit of practice time, but you are in a rhythm,\" said Kraken coach Dave Hakstol, whose team eliminated defending Stanley Cup champion Colorado in seven games.The second-year Kraken opened the Western Conference semifinals with a 5-4 overtime win in Dallas, even after blowing a two-goal lead in the third period while 38-year-old Joe Pavelski scored all four goals for the Stars in his first game back since going into concussion protocol two weeks earlier.Dallas also dropped its first-round opener at home, in double overtime, but recovered to beat Minnesota in six games.After overcoming a 3-1 series deficit and ending top-seeded Boston's record-setting season with a Game 7 win, Florida, like Seattle, squandered a two-goal lead in the second-round opener before winning 4-2 in Toronto, which had not played since Saturday.",
        "\"It´s a really focused group. I think it is training,\" Panthers coach Paul Maurice said. \"We played pretty damn hard and pretty well.\"",
        "Florida was 16-18-4 after a 5-3 loss to the New York Rangers on New Year's Day and stood 13th in the 16-team Eastern Conference standings. The Panthers went 26-14-4 the rest of the way to finish one point ahead of Pittsburgh for the East's final playoff spot before dispatching the 65-win Bruins.Game 1 winners have gone on to win 68% of best-of-seven series in the NHL playoffs, though that hasn't applied to this postseason so far. Carolina and Seattle were the only teams among eight Game 1 winners in the first round to advance.\"Any win is big in the playoffs, especially on the road,\" said Justin Schultz, one of five different Seattle goal scorers in Game 1 against Dallas. \"It´s nice to get the 1-0 lead but there´s a lot of work left to do. We know they´re going to be better next game.\"PANTHERS at MAPLE LEAFS, Florida leads 1-0 (7 p.m., TNT)Brandon Montour has goals in each of Florida's last three games, and has scored six overall this postseason. Only two NHL defensemen - Bobby Orr and Paul Coffey - have had more goals through the first eight games in a single NHL postseason.\"He is an incredibly fit man. ... He came out of the gate very strong,\" Maurice said, adding that his partner Marc Staal has been fantastic for him.",
        "\"Marc is so incredibly consistent, experienced, knows the game, and talks the game,\" the coach said. \"Those two guys have just built a fantastic chemistry.\"Toronto, like Dallas, also lost first-round opener at home but rallied to eliminate Tampa Bay in six games.KRAKEN at STARS, Seattle leads 1-0 (9:30 p.m., TNT)The 38-year-old Pavelski was the best skater for either team in the series opener, becoming the oldest player with a four-goal game in the long history of the NHL playoffs.Pavelski scored twice in the game's first 12 1/2 minutes, then twice in the third period to force overtime and then the Kraken got their third consecutive road victory this postseason. They were physical, outhitting Dallas 47-19, and had an 11-4 edge in takeaways.\"We're fast. We can play pretty physical and I think that´s part of our game our identity, and we´re a really deep team and I think we´re starting to gain some recognition for that,\" Kraken center Morgan Geekie said. \"All four lines can play the same way.\"While the Kraken are only in their second season, they have seven players who have won the Stanley Cup. That includes Yanni Gourde, who had their OT goal Tuesday night.\"We´re a pretty poised group in that locker room. We´re pretty confident group,\" said Gourde, part of Tampa Bay's back-to-back Stanley Cup championships in 2020 and 2021.",
        "The Stanley Cup winner for the Stars is Tyler Seguin, whose title was as a 19-year-old rookie with Boston in 2011.___AP Hockey Writer Stephen Whyno and AP Sports Writer Tim Booth contributed to this report.___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}