{
    "articleURL": "/femail/article-12056599/The-standout-balcony-stars-giving-Louis-run-money.html",
    "content": [
        "Prince George and his pals looked thick as thieves on the balcony yesterdayREAD MORE: Prince George, 9, thrived in the most important role of his life The crowning of King Charles III and Queen Camilla yesterday was a spectacle filled with solemnity, symbolism and majesty.",
        "But the significance of the occasion did not seem to weigh down on the Pages of Honour, the most notable being Prince George, who made for a cheeky bunch as they lined up on the balcony of Buckingham Palace at the end of the day. The young Pages of Honour, hand-picked by the King and Queen, looked resplendent in their traditional uniforms first seen at the Coronation of King Edward VII in 1902.And as they larked about on the balcony of Buckingham Palace to watch the flypast, Prince William even directed their attention to the Red Arrows as they were too busy having fun to be watching the proceedings. As they joined in with the procession into Westminster Abbey, holding the new monarch's historic robes, the pages became part of history. ",
        "And as they larked about on the balcony of Buckingham Palace to watch the flypast, Prince William even directed their attention to the Red Arrows as they were too busy having fun to be watching the proceedings.Expert lip reader Jacqui Press revealed to MailOnline that William said: 'Look guys, please.'She then added one of George's pals told him: 'It's loud!' before the Prince laughed and replied: 'Yes!' Rubbing shoulders with the most senior royals, they seemed to enjoy the easing of pressure after the ceremony was over, enjoying larks on the balcony as the crowds looked on.",
        "But who are Prince George's new pals? Here FEMAIL looks at the young pages who made a statement at yesterday's Coronation...Lord Oliver Cholmondeley ",
        "Lord Oliver Cholmondeley, 13, attended the coronation with his father, David, the Marquess of Cholmondeley, and his mother Rose.His father was recently appointed to be the King’s Lord-in-Waiting – a significant royal role in which he will be invited to attend important state and royal occasions.In 1974, the Marquess of Cholmondeley, as Earl of Rocksavage, was Page of Honour to the late Queen, before becoming Lord Great Chamberlain from 1990 to 2022.Meanwhile, the Marchioness of Cholmondeley's maternal grandmother, the late Lady Elizabeth Lambart, was one of the late Queen's bridesmaids at her 1947 wedding.They have three children - Lord Oliver's twin brother, Alexander, Earl of Rocksavage, and his younger sister, Lady Iris, who is seven-years-old. However, they did not play a role in the Coronation.  Rose, 39, married David, the 7th marquess, in 2009 at Chelsea Town Hall after announcing their engagement a day before getting married. Rose's grandmother was also bridesmaid at Queen Elizabeth's wedding to Prince Philip in 1947.Lady Elizabeth Lambert was one of the eight bridesmaids at the magical ceremony at Westminster Abbey.Ralph Tollemache",
        "Ralph Tollemache, 12, is the son of British banker and aristocrat The Honourable Edward Tollemache and Sophie Tollemache.",
        "Ralph's parents attended the coronation yesterday and proudly watched their son perform his duty as a Page of Honour.Edward, the heir apparent of the 5th Baron Tollemache, is a godson of the King and was a page of Honour to Queen Elizabeth. Ralph has a brother, Theo James Tollemache, and a sister, Stella Isabel Dinah Tollemache. They live at Helmingham Hall in Suffolk, which has belonged to the family for 500 years.Ralph's grandparents, Lord were close to the late Queen and Prince Philip, as they used to visit Helmingham Hall regularly. When Queen Elizabeth died, Edward's father, Lord Tollemache paid tribute to her at St Edmundsbury Cathedral in Suffolk.King Charles, then Prince of Wales, attended Edward and Sophie's wedding on 3 February 2007 at St Columba’s Church in Knightsbridge.Lord and Lady Tollemache also went Kate and William's wedding in 2011 and are friends with Charles and Camilla.Nicholas Barclay ",
        "Nicholas Barclay, 13, is the grandson of Sarah Troughton, who is one of the Queen’s six companions (a role which replaced the former lady-in-waiting position) and oldest friends.Sarah, the Lord-Lieutenant of Wiltshire, is a second cousin of King Charles via her maternal grandfather, who was a brother of the Queen Mother, reported Tatler. She served as a lady-in-waiting to the Duchess of Kent from 1990-2000 and was made a Commander of the Order of St John by the Queen in 2013, before being raised to Dame of the order in 2021.",
        "Nicholas is the only son of Sarah's daughter Rose (nee Troughton) and solicitor Piers Barclay. Rose is one of the King's goddaughters and is linked to the Colman mustard dynasty via her grandfather Sir Timothy Colman, former Lord Lieutenant of Norfolk.Nicholas is one of Rose and Peter's three children, along with Beatrice and Aurelia."
    ]
}