{
    "articleURL": "/wires/aap/article-12060429/Tedesco-backs-Trbojevic-firing-NSW-Origin.html",
    "content": [
        "James Tedesco has backed Tom Trbojevic to rise to the occasion of State of Origin football, claiming there should be no doubt over his ability to perform for NSW.",
        "Trbojevic has endured a difficult start to 2023, to the point where questions have now been raised over his selection for Origin I in Adelaide on May 31.The 26-year-old has battled hip and groin injuries already this season, after a summer stint in the USA working to overcome persistent hamstring injuries.There have also been question marks on whether he is playing within himself, only breaking into full flight on a few occasions through the opening 10 rounds.Manly coach Anthony Seibold has been adamant questions over Trbojevic's form are unfair, stating it is wrong to expect him to live up to his dizzying heights of 2021.Trbojevic missed last year's series with his season-ending shoulder injury, but was the Blues' best in 2021 and claimed the Wally Lewis Medal for player of the series.The Manly No.1 played right centre in that year for the Blues, but faces competition from Campbell Graham this year.The wing could be an option, however Josh Addo-Carr is nearing a return from a syndesmosis injury and is pushing to partner Brian To'o if fit.Regardless, NSW captain Tedesco said he fully believed that Trbojevic would have no issue rising back to the level of Origin and backed the Sea Eagles star to be picked.",
        "\"I think everyone's seen how well he plays at Origin level no matter if he's coming off injuries or not playing many games,\" Tedesco said.\"He still comes in and kills it. There'd be no doubts over Tommy in the Origin arena.\"Tedesco is close with Trbojevic and while he has not spoken to him on a weekly basis about his fitness, he said the Manly star had remained positive throughout.Tedesco has also been more concerned with his Roosters' plight.The club had made a point to try and fix their slow starts to seasons this year by running out the majority of their first-grade stars in pre-season trial matches.Yet they remain in eighth on the NRL ladder, with Sunday's loss to North Queensland their fourth loss in nine games this year.The Roosters will have a tricky Origin period ahead, with Tedesco and Angus Crichton both likely to be in and out of the team.\"In previous years since I have come here, we have previously started slow and usually build towards the end of the year,\" Tedesco said.\"But we're getting pretty far into the year now and we need to score points.\"Our defence is there, it's going to keep getting better and better. But our attack, and what our spine is doing ... the connectivity, it's not there.\""
    ]
}