{
    "articleURL": "/wires/ap/article-12047003/BMW-Dont-drive-older-models-Takata-air-bag-inflators.html",
    "content": [
        "DETROIT (AP) - BMW is warning the owners of about 90,000 older vehicles in the U.S. not to drive them due to an increasing threat that the air bags might explode in a crash.",
        "The warning covers vehicles from the 2000 through 2006 model years that previously had been recalled to replace faulty and dangerous air bag inflators made by Takata.The company used volatile ammonium nitrate to inflate the air bags in a crash. But the chemical can deteriorate over time when exposed to heat and humidity and blow apart a metal canister, hurling shrapnel that can injure or kill drivers and passengers.The National Highway Traffic Safety Administration says drivers should park their vehicles and contact BMW for more information. Repairs are available at no cost to owners, as well as mobile repair and free towing.\"These vehicles are 17 to 22 years old, and the risk to vehicle occupants is dire,\" the agency said in a statement Thursday. \"These are some of the oldest Takata air bags under recall and have an extremely high probability of failure during a crash.\"NHTSA says if the inflators blow apart, metal fragments could be hurled toward the driver's face and could kill them or cause \"devastating, life-altering injuries.\"",
        "Since 2009, the exploding air bags made by Takata have killed at least 33 people worldwide, including 24 in the United States. Most of the deaths and about 400 injuries have happened in U.S., but they also have occurred in Australia and Malaysia.",
        "Models involved in the BMW recall include the 2000 through 2006 3 Series, the 2000 through 2003 5 Series and the 2000 through 2004 X5. All have driver's front air bag inflators made by Takata.Owners can go to BMW's website to check if their vehicle is affected or call BMW customer relations at (866) 835-8615. NHTSA also has a recall lookup tool on its website.Owners of some older Honda, Ford and Stellantis vehicles with Takata inflators have previously been told not to drive them.\"These inflators are two decades old now, and they pose a 50% chance of rupturing in even a minor crash,\" NHTSA Acting Administrator Ann Carlson said in a statement. \"Don´t gamble with your life or the life of someone you love - schedule your free repair today before it´s too late.\"Takata used ammonium nitrate to create a small explosion to inflate air bags in a crash. But the chemical can become more volatile over time when exposed to moisture in the air and repeated high temperatures. The explosion can rupture a metal canister and hurl shrapnel into the passenger compartment.Since 2009, the exploding air bags have killed at least 33 people worldwide, including 24 in the United States.Most of the deaths and about 400 injuries have happened in U.S., but they also have occurred in Australia and Malaysia.",
        "Potential for the dangerous malfunction led to the largest series of auto recalls in U.S. history, with at least 67 million Takata inflators recalled. The U.S. government says that many have not been repaired. About 100 million inflators have been recalled worldwide. The exploding air bags sent Takata Corp. of Japan into bankruptcy."
    ]
}