{
    "articleURL": "/wires/aap/article-12045053/Samu-Ikitau-return-bolster-Brumbies-against-Rebels.html",
    "content": [
        "Wallabies duo Pete Samu and Len Ikitau will return from injury as the ACT Brumbies name their strongest line-up of the season for the trip to Melbourne to take on the Rebels.",
        "Neither player made the trip to New Zealand for last weekend's 32-27 loss to the Hurricanes but are back in the mix as the second-placed Brumbies look for a return to winning ways at AAMI Park on Sunday.Such is their depth they boast a bench front row of Wallaby Billy Pollard and current national team training squad members Blake Schoupp and Rhys van Nek, with potential bolter lock Tom Hooper poised to come on for his first game of the year after a foot injury.Lock Cadeyrn Neville is the only top-line star missing, with the eight-cap Wallaby rested for the Rebels clash.Wallabies fever was in the Canberra air this week, with national coach Eddie Jones in town watching training, something Brumbies mentor Stephen Larkham said raised the passion levels through the roof.\"We had Eddie down presenting his vision for the World Cup, and that lifted the intensity of training,\" Larkham said.\"They had a really good focus coming out on the field and then there was a little bit of added spice.\"There were a couple of fights, which you want to see, nothing too serious ... the boys have been training really hard.\"The Brumbies (7-2) head to Melbourne looking to maintain their perfect record against Australian teams this Super Rugby Pacific season.",
        "They will not leave Australia again before finals, with attention turning towards their preparation for the post-season.Larkham acknowledged things had not gone well in last weekend's narrow loss - only the Brumbies' second of the campaign - but saw value in experiencing the setback.\"I don't think it's ever a good time to have a loss ... (but) we've certainly come in with a good focus,\" he said.\"From that perspective it's probably sharpened us up a little bit.\"We weren't at our best. We were coming off a bye and I don't think we were on the same page as a team. We got some of our strategy wrong going into the game.\"As coaches, we've identified our kicking game wasn't where it needed to be, and our set piece wasn't quite where it needed to be.\"If you look at the first eight rounds, they have been strengths of our game.\"The fundamentals of our game let us down.\""
    ]
}