{
    "articleURL": "/news/article-12043491/Britains-famous-duck-Long-Boi-vanished-sparking-mystery-leaving-fans-fearing-worst.html",
    "content": [
        "Long Boi last seen in mid-March - longest time out of sight since arrived in 201970cm tall runner duck - who lives at the University of York - gained fame in 2021Appeared on James Corden Late Late Show and with Greg James on BBC Radio 1Britain's most famous duck has gone missing - as his panicked fans have not seen him for weeks and fear the worst.",
        "Long Boi - who lived at the University of York - gained fame in 2021, with appearances on the James Corden Late Late Show and with Greg James on BBC Radio 1.A fan account for the striking duck, which has racked up more than 56,000 followers, bid an emotional goodbye to the 70cm tall bird in a post this afternoon.He was last seen in mid-March and it is the longest students have gone without saying hello to their feathered friend since he arrived in 2019.Zoe Duffin, who runs the account, said: 'As many of you will be aware from the recent news, Long Boi has not been seen on campus for a number of weeks. ",
        "'This is very worrying and not like Long Boi, who can almost always be found in his favourite spot by the lake on campus West.'Long Boi's age is unknown and he has never gone missing like this before. Very sadly, this disappearance suggests a strong possibility that Long Boi may have passed away. 'It is unclear how or exactly when this may have happened, and we can only hope that if Long Boi really is gone, his passing was peaceful.'Long Boi’s rise to fame has also introduced us to new duck-loving friends, not just in York, but all around the world, brought together by our love for one incredibly unique duck - Long Boi will always be remembered by those who knew and loved him.' ",
        "An Indian Runner Duck, his age was never known and little is known about his origins.His fans even included 6 foot 7 England football star Peter Crouch, who posted a photo of the lanky bird with the caption: 'my type of duck'.  A member of the campus' Ground and Estates team said that cases of bird flu had been affecting the historic city's ducks, while rumours are swirling among students of a fox attack, student newspaper Nouse reported. University of York officials say they are still hoping the bird will reappear and did not confirm whether they suspect foul play.",
        "A spokesperson said: 'Long Boi is a much-loved character on campus and whilst we haven't seen him around over the past few weeks, we continue to keep a lookout for him and hope to see him again, safe and well, soon.' At first, the famous duck was pitied for being lonely - because he didn't fit in with the other, shorter ducks.But over time he won the hearts of students and waterfowl alike - with the university also naming his close pals.He became an unofficial mascot for the university, with a society named after him, his image stitched onto merchandise and a petition even circulating to give him an honorary doctorate.",
        "A smaller male Indian runner duck, which they called Chonky Boi, died with the Grounds team 'by his side' after an injury from a fox in May 2021 according to student newspaper York Vision.Distraught followers flocked to social media to air their grief for Long Boi's disappearance.One, called Connor, said: 'Rest in peace to a legend (potentially) gone but never forgotten.'Another student sighed: 'Rest In Pond old buddy, I'm officially calling for a campus-wide funeral at this point.'A third, called Emily, added: 'I'm dropping out.'And an international fan - called Ash - said: 'Heartbroken. I live in the States and was saving up to see him. 'He made me smile through some tough times. Thank you for sharing his life, I absolutely adored him.'"
    ]
}