{
    "articleURL": "/femail/article-12041173/Curse-lottery-FEMAIL-reveals-winners-regret-hitting-jackpot.html",
    "content": [
        "Former builder Steve Thompson, 46, won the £105 million EuroMillions in 2019 READ MORE: Builder who scooped jackpot goes back to work to finish jobs A former builder who won £105 million in the EuroMillions lottery is said to be missing his old life and the banter on a building site, according to his old friends.",
        "Self-employed Steve Thompson, 46, from Selsey, West Sussex, won the massive jackpot back in 2019 after playing the lottery for 25 years.The modest builder and his shop-assistant wife Lenka, 44, from Slovakia, packed up their £150,000 three-bedroom terraced house and moved to a £4.5million sprawling estate in Kent.But his pals told The Sun this week that Mr Thompson longs for his former life. And he's not the only winner who seemingly regrets their supposed good luck, with several believing it changed their lives for the worse. Here, FEMAIL reveals the winners who apparently believe they lost out in the end. ",
        "BUILDER 'PINING FOR OLD LIFE BACK ON CONSTRUCTION SITE AND MISSES 'BANTER' WITH HIS WORK COLLEAGUES Self-employed builder Steve Thompson, 46, from Selsey, West Sussex, won £105 million back in 2019 after playing the lottery for 25 years. But his pals say Mr Thompson longs for his former life. One said: 'Steve obviously feels really lucky to be in the position he's in. 'But nothing could've prepared him for the change in his life after he won the EuroMillions. He's a very modest, humble bloke and loved his life as a builder.'Steve misses the job and all that comes with it, like the great lads he worked with and the brilliant banter they had together on site', the nameless friend told The Sun.",
        "The couple decided to stay in their three-bedroom home with their two sons and daughter for a year before moving to a different county.When he first bought the six-bedroom home, hidden away in 14.5 acres of land and kitted out with a swimming pool and tennis court, the winner said: 'The kids have finally got their own bedrooms.'When he won, the dedicated builder vowed to finish the jobs he was in the middle of working on.He told customers: 'Don't worry, I'll hold to it and get all my jobs done' as well as promising to give back to the local community.",
        "The builder gave £50,000 to the school his children attended, £50,000 to a medical centre and £100,000 to his beloved cricket club.At the time his then 10-year-old son begged their father for a Tesla car, while his then eight-year-old daughter asked for a pink iPhone.Speaking at the time, Mr Thomson said he only realised he had won as he waited to be picked up for work three days after the draw was made.He said: 'I am not sure I even looked at the first two lines, the third one just jumped out and I could instantly tell they all matched. I started shaking a lot. I knew it was a really big win but didn't know what to do.",
        "'I went out to my van, walked back in, thought about knocking on a neighbour's door, went back to the van - I think I was on the verge of having a heart attack.'He said his parents refused to believe he had scooped the jackpot, telling him: 'We'll believe it when we see it.' Mr Thomson said: 'Now they believe it.'STALKERS, DEATH THREATS AND NEARLY DIED AFTER SPENDING THOUSANDS ON PLASTIC SURGERY      ",
        "Britain's youngest EuroMillions winner revealed how her win didn't bring her happiness, saying in January this year that she wouldn't 'wish it on anyone'.Appearing on an episode of the US TV show Dr Phil, Jane Park, 27, discussed the downsides of her £1million EuroMillions windfall in 2013 when she was 17-years- old.In the episode, titled 'The Curse of the Lottery,' Jane, from Edinburgh, was joined on the CBS show by experts discussing the odds of lotteries and the reasons people enter.Jane said she was too young to cope with stalkers, death threats, and negative media attention, after previously saying the windfall had 'ruined' her life.On Dr Phil Jane explained she was 'encouraged' to go public because of how young she was and that it was almost 'unheard'.The host asked her how she handled the money at a young age, and Jane replied: 'I splashed out a bit because I never knew the value of a million pounds, I'd never seen that kind of money.",
        "'I never knew anyone with that kind of money, so I kind of splashed out on stuff that I've always wanted.'Dr Phil then mentioned the abuse that Jane has received in the past ten years.",
        "He said: 'You had stalkers, death threats, people hiding in the bushes and commenting on everything you were doing, which when you're 17 that kind of gets under your skin.'She replied: 'I wish I'd never won it, I wouldn't wish it on anyone.' Jane described herself as a 'young, naïve 17-year-old.'Dr Phil explained how Jane had spent some of her winnings on cosmetic surgery, including a boob job and Brazilian bum lift, which she never would have if she hadn't have won the money.Jane explained: 'I had a procedure done in a different country and when I flew back I ended up with sepsis.'In 2018 Jane said she 'nearly died' after undergoing the 'bum lift' procedure following the death of Leah Cambridge during a similar surgery in Turkey.She suffered three heart attacks at the Elite Aftercare clinic in Izmir, Turkey, where several reality stars have also undergone the surgery.In 2019, she revealed she was making money by selling racy topless pictures of herself on subscription site OnlyFans. MARRIAGE FELL APART AFTER AFFAIR   ",
        "Gareth and Catherine Bull, from Nottinghamshire, landed a staggering £40.6 million EuroMillions jackpot in 2012.But Catherine, 40, was pictured in 2017 without her wedding ring which led to rumours of a divorce.It turns out Gareth had embarked on a nine-month relationship with a new woman Donna Desporte on a lads' holiday in Tenerife, where she runs a bar, while he was still married to Catherine.  It had previously been revealed that Catherine was made aware of the relationship after spotting the pair during TV coverage of an Anthony Joshua fight in 2017.The couple subsequently divorced in October that year.Mother-of-four Donna, from Bournemouth, wrote a book about her time with ex-bricklayer Gareth called Google Me, No Lies.In 2017, Donna told the Sunday Mirror of her nine-month romance with the lottery winner, revealing how he had splashed out on ­expensive trips and VIP events, including a night at the BAFTAs.",
        "She said he had wanted to keep their relationship a secret to avoid giving his wife ammunition if they were to split.The book, whose title was a reference to the alleged conversation that played out between them when they first met, had been the subject of previous court hearings. Last year Gareth was granted an extended civil restraint order banning Donna from bringing court actions against him following a High Court battle.  ",
        "The permanent injunction restrains publication of 36 passages from the book and four photographs taken by Gareth 'privately during their relationship'.Donna argued that she had a right to give her side of the story and refute allegations she was a 'w**** and a gold digger', but the judge ruled there was no legal public interest in her writing about their sexual relationship.SPLASHED THE CASH ON DRUG-FUELLED PARTIES",
        "Callie Rogers, from Cumbria, was Britain's youngest ever lottery winner when she scooped £1.8million in 2003. She won the jackpot when she was just 16 earning £3.60 an hour as a checkout girl at the Co-op. At the time, she was living with her foster parents in Cockermouth.Within weeks she met Nicky Lawson, father of her eldest two children, and moved into a £180,000 bungalow. But five years later, her relationship fell apart, leading to Rogers attempting suicide.At a particular low point, her children were taken away from her, and she splashed £17,000 on a boob job to help with her confidence.She lavished herself with three breast enhancement surgeries, drug-fuelled parties and £300,000 worth of designer clothes.Callie also gave around half a million pounds to friends and family - and was brutally assaulted after gaining notoriety in her local area.   She said she was targeted by people who pretended to be her friends only to siphon her money away.In 2018, she revealed how she thought she was going to die after being assaulted by two women on a night out.",
        "She was knocked unconscious, had her teeth smashed, ribs broken and suffered permanent damage to her sight. Marie Hinde, then 38, and Jade Quayle, then 27, were jailed.Last year she was also recently hit with a driving ban after her 4x4 crashed into a hedge whilst she was high on cocaine, The Sun reported.  It was reported that the lottery winner was claiming Universal Credit despite her win.The revelation came in court while the judge handed her a 22-month driving ban after she crashed her 4x4 while high on cocaine.Rogers had to be pepper sprayed when police detained her after she veered off a country lane while being chased by police in Cumbria.  She has previously told how her lottery win sent her on a downward trajectory and has called for more protections for young winners.  Rogers told Closer magazine in 2013: 'It was too much money for someone so young.  Even if you say your life won't change, it does – and often not for the better. It nearly broke me but thankfully, I'm now stronger.'  FILED FOR BANKRUPTCY",
        " Thomas Markle won $750,000 on the California state lottery in 1990 when Meghan Markle was just nine. The father of the now Duchess of Sussex used her birth date for one of the numbers in the winning ticket. Markle sent a friend to pick up his lottery winnings from Chicago, according to The Times. Author Andrew Morton, claimed in his book Meghan: A Hollywood Princess that the win paid for Meghan's private school fees, setting her on a path to acting success and ultimately to meeting Prince Harry – who she married in May 2018.",
        "After sending Meghan to private school, Thomas also used his winnings to help his son Thomas Jnr to set up a flower shop and he bought daughter Samantha Markle a car.In the build-up to the royal wedding, her brother Thomas Jnr told The Mail on Sunday: 'If Meg marries Harry she'll have won the lottery of life - but dad winning the lottery helped us all.'That money allowed Meg to go to the best schools and get the best training. Meg is someone who has always had laser focus.  She knows what she wants and she doesn't stop until she gets it.'She was always the family's princess but now she's going to be a real princess and I couldn't be more proud.'Tom also said that his dad lost a huge chunk of the money after investing in a jewellery business that failed and Thomas ended up filing for bankruptcy in 2016.BLEW £10 MILLION FORTUNE BEFORE RETURNING TO JOB AS BIN MAN",
        "Part-time bin man Michael Carroll, 39, from Norfolk, scooped £9,736,131 on the National Lottery in November 2002 when he was just 19. Michael, who was dubbed the Lotto Lout and the King of Chavs, was wearing an electronic tag when he bought his winning ticket.  The lottery winner admitted to becoming a 'full-blown alcoholic', and said he would go on extravagant holidays to the Costa del Sol.  He did give £4 million to friends and family, including his aunt and uncle who raised him following his father's death when he was only 10 years old.The rest of the money, however, funded an extreme lifestyle, including a mansion in Swaffham, Norfolk, two other homes, and racing cars.  The decadent and mischievous antics brought a swift end to his marriage to wife Sandra Aitken after she accused him of sleeping with sex workers. She had been seven months pregnant with their daughter before he won the lottery.Michael has made no secret of his womanising, and claims to have bedded some 4,000 women.Michael continued to live in extravagance, and appeared in court over 30 times, mostly arriving in sports cars and drinking booze.   He was handed an ASBO for terrorising his neighbours and was jailed for five months in 2004 after failing to comply with a drug treatment order imposed as part of a sentence for cocaine possession.His accountant warned him in 2005 that he was down to his last million, and in February 2006 he was jailed for nine months for affray.By February 2013, he was declared bankrupt and found himself back on Jobseeker's Allowance. At his lowest point he moved into a hotel for homeless people for three months while he struggled to find work due to his reputation.He then worked at the Walkers biscuit factory in Aberlour, before getting a licence to work in an abattoir.In 2019, it was revealed Michael had moved to Scotland and was working seven days a week as a coal miner.  'I don't look back with any regrets that's for sure. It was ten years of fun for a pound, you can't go wrong with that,' Mickey told The Mirror. 'I wouldn't want to turn the clock back. But I live a good, free lifestyle now and I'm happier because I've got my life back.'He still occasional plays the lottery and said if he won again, 'he'd be down the yard at six every morning just to keep out of trouble'.In 2021 it was revealed he had remarried his ex-wife, and the two are now reportedly living a quiet life in Belfast.  A source told the Daily Record: 'Mickey's calmed down a lot and has been living quite a nice wee life and working hard. Him and Sandra buried the hatchet and got back together and it has all worked out well for them.'It happened very quickly in the last few months but they fell right back in love and are really happy together now. What's in the past has been forgotten about.'LOST HIS WINNINGS AFTER BAD INVESTMENTS",
        "John McGuinness, from Scotland, was working as a hospital porter when he won £10million back in 1997.At the time, he was earning just £150 a week and was living with his parents in their council house.    He lavished more than £ 3million on close members of his family and gave £750,000 to his ex-wife Hazel.He swapped his battered old Vauxhall Astra for a £140,000 Ferrari Modena Spyder. Other cars followed and at one point he had six in the drive, including a Bentley, Mercedes, Jaguars and BMWs.He snapped up a £500,000 seafront apartment in Majorca, went on Caribbean cruises, five-star ski trips and holidays around the world.He bought a luxury £1.3million mansion in Bothwell, which has an incredible view overlooking the River Clyde.   He moved his wife, Sandra, and his family into the Lanarkshire manor after his big win.In 2004, John moved from one luxury mansion to another just 20ft away - so he could have room for a snooker table in his games room.But it was his lifelong passion for Livingston Football Club that eventually ruined him as John used his riches as a guarantee against the club's loans, meaning he was liable for all the debt.",
        "John ploughed £4million into the club, which then went into administration.   He stayed silent since then but decided to speak out in 2012 after the failed former soccer boss Dominic Keane was cleared of a £2million bank fraud.John lost millions in the doomed venture to buy Livingston with ex-Celtic director Keane.Keane was accused in court of tricking the lotto millionaire into signing an extension to a £2million loan, but he walked free after a jury took 40 minutes to find him not guilty.Speaking to the Daily Record, John said: 'I know in the eyes of the law nobody is to blame for me losing my money...but I know who I blame. I gave my money to Dominic Keane and now it's all gone and I've got nothing. 'Someone must have taken it. If I had never met him, I'd still be sitting with about £5million in the bank and I would have been quite happy enjoying a brilliant life.'MYSTERIOUSLY DISAPPEARED AND WAS LATER FOUND DEAD   ",
        "In 2006, Florida man Abraham Shakespeare, 42, won $30million, and received $17million, after buying two lottery tickets at a local convenience store.He shared his generosity by purchasing homes for his cousins and paying off a business loan worth £72,000 ($87,000) for a friend.  However, less than two years after striking it rich, Abraham was not only down to his last £1.2 million ($2 million) but he also mysteriously disappeared.  Police later discovered that he was murdered by DeeDee Moore, a woman who had targeted him for the money-. He hadbeen shot twice with a .38-caliber pistol.  Prosecutors said the 49-year-old Moore befriended Shakespeare, who was illiterate, in late 2008, claiming she was writing a book about how people were taking advantage of him.They claim Moore later became his financial adviser, eventually controlling every asset he had left after his death, including an expensive home, the debt owed to him and a $1.5million annuity.'She got every bit of his money,' said Assistant State Attorney Jay Pruner in closing arguments. 'He found out about it and threatened to kill her. She killed him first.'Moore also insisted that she had known Shakespeare for only four months prior to his death, which would not have given her enough time to plot his murder.   DeeDee had managed to take almost £1.2 million ($2million) from Shakespeare by the time she orchestrated his killing.She and her boyfriend buried him beneath a concrete slab in a wooded area afterwards.",
        "Moore led police to the burial site after a sting operation, during which an undercover officer recorded her admitting that she knew the location of Shakespeare's body. He was missing for several months before she eventually admitted where his body was, she is now doing a life sentence for his murder in prison. Moore has maintained her innocence and has repeatedly appealed her conviction, which was upheld twice - in 2015 and 2019. Moore wrote in a letter to the court in 2019 that she regretted not being truthful during her trial, but she continued to maintain that she did not shoot Shakespeare. 'I really did not kill him,' she wrote.   This year it emerged that Moore is an unlikely supporter of a new bill that would keep the names of jackpot winners a secret for 90 days in the US.In a telephone interview from behind bars, Dee Dee argued that publicly identifying winners and sharing details about their windfall 'puts a target on them.'Florida lawmakers say giving winners three months should afford them sufficient time to hire security, tell their loved ones about the win, and seek investment advice in peace.  In her latest interview from Lowell Correctional Institution, Moore said keeping lottery winners' names secret even for 90 days wasn't long enough. She said details about whether a winner chose a lump-sum payout or payments over time also should not be disclosed.'I don't feel that's enough time,' she said. 'You've got to understand, this person has to change their whole life around.'She said a lottery winner would need at least six months of privacy. 'Ninety days is nothing, you see how quick time flies,' said Moore, who has been in a state prison for nearly 3,400 days.ROBBED A DOZEN TIMES AND FAMILY MEMBERS DIED    ",
        "West Virginia businessman Jack Whittaker won a whopping £261 million ($315million) in 2002, which was then the largest lottery jackpot won by a single ticket in the United States.  He chose to receive more than $113million in cash, but soon used it up and said he had been robbed a dozen times, CNN reported.Less than a year after his win, £451, 000 ($545,000) of cash was taken from his car, which he parked at a strip club. Five months later, $200,000 was taken from the same car in the same parking lot.Then again in 2018, $100,000 was heisted out of his vehicle while it was parked in front of his house.   According to the Washington Post, while boozing it up at a local bar, he loudly offered one female bartender money for sex. He later proffered $10,000 to another bartender if she would pose for him in her underwear.",
        "In 2004, a friend of Whittaker's granddaughter Brandi, was found lifeless from a drug overdose in Whittaker's house.   In 2005, Brandi, who he planned to leave his money to, was found dead, wrapped in plastic with drugs in her system but the official cause of her death is not known.Two years later, her mother - Whittaker's daughter Ginger - died of a drug overdose.By the time of her death, he said his bank accounts were empty. He blamed his relatives deaths' on the winning ticket, assuming that they bought the drugs which killed them with his money.'My granddaughter is dead because of the money. She was the shining star of my life, and she was what it was all about for me.'You know, my wife said she wished that she had torn the ticket up. Well, I wish that we tore the ticket up too,' he told ABC's 20/20.In 2016, his Bland County, Virginia, house burnt down in a fire which had started in the kitchen.   The fire was reported at 7am on Friday, and firefighters from five different departments arrived. The house sustained extensive damage and was eventually declared a total loss.Whittaker's wife was inside the home at the time, but she emerged safely.  Jack Whittaker died of natural causes on June 27 2020 at the age of 72. "
    ]
}