{
    "articleURL": "/news/article-12043929/Boost-Rishi-Sunak-Conservatives-lose-far-fewer-seats-feared-pollsters-say.html",
    "content": [
        "The Conservatives may only lose 338 seats, much less than the 1,000 predicted They lost 1,330 the last time the same councils were fought over in 2019The Conservatives could lose far fewer seats in today’s local elections than had been feared, according to pollsters.",
        "It had been predicted that they could haemorrhage around 1,000, but amid growing signs of a late Tory surge, that figure could be as little as 338.The projections, if accurate, are a blow to Labour leader Sir Keir Starmer’s hopes of inflicting a Tory ‘bloodbath’ and come after his latest flip-flopping over tuition fees and taxes. Losing hundreds of council seats would still be uncomfortable for the Conservatives. But they are expected to make gains in some areas and losing 338 seats would be well below previous predictions. They lost 1,330 the last time the same councils were fought over in 2019.",
        "It points to a major turn-around in the party’s ratings under Prime Minister Rishi Sunak. Those ratings after Liz Truss’s disastrous premiership would have meant the loss of up to 2,000 seats.At Prime Minister’s Questions yesterday, a buoyant Mr Sunak said voters had a clear choice. He added: ‘When they go to that ballot box, they can see a party that stands for higher council tax, higher crime and a litany of broken promises.‘Meanwhile, we’re getting on with delivering what we say with lower council tax, lower crime and fewer potholes. The choice is clear – vote Conservative.’Later on, the PM appeared to play down the Tories’ chances. During a visit in Buckinghamshire, he said: ‘We’ve always said these are going to be a tough set of elections.'",
        "The projections by respected forecaster Electoral Calculus for the Daily Mail and based on the latest polling, found that Labour will gain 395 councillors. This figure would be likely to disappoint the party.It would also leave the Conservatives with more seats than Labour out of the 8,057 being contested – 2,963 versus Labour’s 2,474.Labour is projected to take control of nine more councils, only two of which are currently fully Conservative controlled. The Tories will gain two more councils but lose 16, according to the Electoral Calculus study.ANALYSIS: Numbers that could point to a Rishi revival   Rishi Sunak faces his first major test with voters in today’s local elections, with around 27.6million people eligible to cast ballots across 230 councils.So, with 8,057 council seats up for grabs, what would a good or bad night look like for the major parties?TORIESGood night: Losing fewer than 500 seats overall would leave them feeling relatively unscathed and be considered a success, given how low they plummeted in the polls after Liz Truss’s premiership. Even at 500 to 750 net losses, they could say that Labour is not performing as well at the ballot box as the polls suggest and that it is all to play for at the next general election.",
        "Either of these results would be considerably below previous predictions that they could haemorrhage 1,000 seats. A narrowing in the polls suggests it is achievable.Following Ms Truss’s premiership, the party plummeted so low in the polls that they faced losing up to 2,000 seats – meaning it would also point to a major turn-around by Mr Sunak.Bad night: Losing 1,000 or more seats would be difficult to spin as anything other than a bad defeat. It would suggest that the party is far off where it needs to be to win the next general election, expected to be in autumn 2024.The tally would also be close to the more than 1,300 seats the Tories lost the last time today’s councils were fought over in 2019, when Theresa May was PM.LABOUR",
        "Good night: Gaining 700 seats or more as it would be the party’s best local election performance for at least ten years. It would suggest it is on course to win the keys to Downing Street, even if short of an outright majority. Gains of 450 seats or more would also be a little better than last year and could be spun as a decent result.Bad night: Gaining just 250 seats or fewer. This would not reflect their lead in the polls and suggest that they will struggle to win back Red Wall voters at the next general election. Fewer than 150 would effectively be a step backwards.",
        "LIBERAL DEMOCRATSGood night: Gaining 150 or more seats, particularly in Conservative vs Lib Dem battlegrounds. This would suggest they could steal constituencies from the Tories at the general election in middle class shires.Fifty to 100 would represent modest progress.Bad night: Fewer than 50 would suggest voters have put trust back in the Tories."
    ]
}