{
    "articleURL": "/wires/reuters/article-12046717/Paramount-Global-disappoints-slow-subscriber-growth-weak-ad-market.html",
    "content": [
        "By Tiyashi Datta and Helen Coster",
        "May 4 (Reuters) - Paramount Global Inc missed first-quarter revenue estimates on Thursday amid a weak advertising market in its TV business and cut its dividend.The company incurred a $1.7 billion charge in connection with its plan to integrate Showtime into its Paramount+ streaming service and remove certain programming.Shares of the New York-based company, formerly known as ViacomCBS, fell about 21% in early trading. They have gained more than 35% so far this year.Chief Executive Officer Bob Bakish in a call with investors said the company is \"navigating a challenging and uncertain macroeconomic environment, and you see the impact of that on our financials, as the combination of peak streaming investment intersects with cyclical ad softness.\"The company is seeing signs of stabilization in the ad market, Bakish said.Paramount Global said its dividend cut to 5 cents per share will result in approximately $500 million in annualized cash savings.\"The company´s 79% dividend cut is not encouraging, but it was necessary,\" said Huber Research analyst Craig Huber. \"They should have done it years ago, but better late than never.\"Paramount invested in original content to try to attract subscribers to its streaming platform but is up against competition from established players such as Netflix and Walt Disney Co's Disney+.",
        "Paramount+, the company's flagship streaming platform, added 4.1 million subscribers during the quarter, compared with 9.9 million in the preceding quarter. It did beat the Wall Street estimate of 3.1 million new subscribers, according to data from Visible Alpha.Sales for its TV media segment declined by 8% from a year earlier and advertising revenue fell by 11%.Several factors, including higher prices, lower consumer demand across products and services, and weak markets have forced companies to reduce advertising spending.Revenue at the company was $7.27 billion in the first quarter ended March 31 compared with analysts' average estimate of $7.42 billion, according to Refinitiv IBES data.Revenue in the company's direct-to-consumer unit, which includes streaming platforms Paramount+ and PlutoTV, grew 39% in the first quarter. Revenue from its filmed entertainment business fell 6%.The operating loss was $1.23 billion for the quarter compared with an operating income of $775 million a year earlier.The company earned 9 cents per share on an adjusted basis, below Wall Street's estimate of 17 cents per share, Refinitiv IBES data showed. (Reporting by Tiyashi Datta in Bengaluru and Helen Coster in New York; Editing by Savio D'Souza, Dhanya Ann Thoppil, Anil D'Silva, Barbara Lewis and Mark Porter)"
    ]
}