{
    "articleURL": "/wires/pa/article-12041529/Summer-travel-chaos-warning-airport-workers-balloted-strike-action.html",
    "content": [
        "Passengers could face a summer of travel chaos if workers vote to take strike action in a dispute over pay, a union has warned.",
        "Unite said it will ballot around 275 workers at Edinburgh Airport on walkouts, including members employed in security, terminal operations and search areas.The union claimed members’ pay has been cut by around 10% in real terms over the last seven years, and it said workers are “prepared to fight for a better deal”.Unite said its members at Edinburgh Airport have rejected an inferior pay offer to one made to staff at Gatwick, where it said a 12% increase plus a £1,500 one-off cash payment has been accepted by the workforce.Edinburgh Airport said it had offered an 11% pay rise along with a £1,000 cost-of-living payment, which it described as “fair and competitive”.",
        "Unite general secretary Sharon Graham said: “Unite’s members at Edinburgh Airport made huge sacrifices during the Covid pandemic. They agreed to reductions in pay and conditions. The workers did all this while working around the clock to keep the airport safe and running.“The situation is entirely different now with passenger figures hitting over 11 million last year, and inflation stands at a 40-year high.“Pay needs to keep up with the cost of living – simple. Edinburgh Airport bosses need to make a realistic pay offer to the staff if they are to avoid a summer of travel chaos.”",
        "The Unite ballot opens on Friday and closes on May 23.An Edinburgh Airport spokesman said: “It’s disappointing that we are in this situation despite meeting the request of our unions – an 11% pay rise along with a £1,000 cost-of-living payment.“We believe this is a fair and competitive offer and one that was asked for by both of our recognised unions through our collective bargaining arrangement. Both said they would recommend the offer to members.",
        "“One union saw overwhelming support for the agreed offer and we cannot understand why Unite campaigned against and rejected the very offer they asked us for.“We have sought clarity on Unite’s membership numbers given the tight nature of the result, where the vote against was carried by less than 1% of the membership, and we have raised serious concerns about the integrity of the ballot and the number of members that voted.“We hope to resolve these issues at our scheduled Acas meeting to allow us to deliver the wage rise and cost-of-living payment that we want to pay our team.”On the comparison to Gatwick, he said: “We appreciate that the offer being made at Gatwick is a good one, but if we really want to compare this to the offer being made at Edinburgh then it must be taken in context.",
        "“Despite the challenges of Covid this will be the third pay rise given to the team at Edinburgh Airport since 2020. This is the first offer made by Gatwick in the same timeframe.“This means that the Edinburgh team would have received an overall pay increase of 19.6% over the same time.”"
    ]
}