{
    "articleURL": "/tvshowbiz/article-12041395/Megan-McKenna-shares-series-loved-snaps-boyfriend-Oliver-Burke-exotic-holiday.html",
    "content": [
        "Megan McKenna packed on the PDA with her boyfriend Oliver Burke in a series of loved-up snaps shared to Instagram on Tuesday.",
        "The former TOWIE star, 30, and her man appeared closer than ever as they enjoyed a an exotic trip away - after revealing the pair have been 'inseparable' since they started dating.In one snap, the couple can be seen passionately kissing as they show off their sun-kissed tans.Posing by the pool, Megan looked glamorous as ever in white trousers, a black blouse and white Prada sandals.Her beau, cosying up to her, looked dapper in a satin grey set.",
        "In another photo, the pair gaze into the camera as they pose for a selfie.The pair look happier than ever as the stand side-by-side before heading for dinner. Making the most of their holiday, Megan also showed off their poolside outfits, with Megan opting for a relaxed white linen look.She showed off her enviable figure in the summer number, which she teamed with a leopard print bikini and Prada beach bag.Meanwhile Oliver looked extremely suave in a cream linen set and brown sliders.Protecting themselves from the sun, the pair both threw on a pair of sunglasses and hats as they posed in the idyllic location.In another snap shared to her social media, Megan can be seen grinning from ear-to-ear as she clutches a bouquet of flowers.",
        "The star, covered in a towelling robe, appeared happier than ever as she beamed at the camera. ",
        "Sharing the special moments with her 2.5million followers, she gushed: 'When I thought he couldn’t get anymore romantic…'Oliver plays as a right winter for EFL Championship club Millwall, where he is currently on loan from Bundesliga club Werder Bremen. The pair went Instagram official with their romance last month during a romantic trip to Paris together.Megan recently discussed the couple's romance with new magazine, saying the pair have been 'inseparable' since they started dating.She said: 'We have mutual friends and our first date was just so lovely - we've been inseparable ever since. We literally do everything together and I'm so happy.'He's such a lovely person and I'm really positive about everything - my life and my relationship.'Back in February, the new couple were spotted leaving the Corinthia hotel in London after a romantic Valentine's Day mini break.While they didn't share pictures together, Megan did post one of herself in the mirror - where rose petals could be seen spread on the bed in the background.Megan also sparked speculation of a romance in her life as she spoke about there being 'someone for everyone' as she sung in a video beside a bouquet of pink roses.",
        "Oliver and Megan appear to have been spending time together in recent weeks as they both posted pictures getting tattoos in London.Posting a black and white snap of her looking on at her tattooist focusing intently on inking two of her fingers, Megan captioned the post: 'Cowgirls first ink.'Showing a close-up of the tiny tats, her ring finger had the word 'yeehaw' in a typewriter font, and a small red line heart on her little finger.Oliver tagged the same tattoo artist as he too posted black-and-white snaps of the inking session on the same day, revealing he got 'karma' inked across his forearm.Elsewhere during her interview, Megan spoke about being trolled for her slim figure by trolls.The star has previously been open about her health issues including having irritable bowel syndrome and coeliac disease. She said: 'People need to realise I'm not one of those yo-yo dieters or starve myself. I've just had issues with my stomach and I naturally have a fast metabolism.'"
    ]
}