{
    "articleURL": "/wires/reuters/article-12044063/UN-aid-chief-wants-meetings-Sudans-warring-factions-days.html",
    "content": [
        "By Aidan Lewis",
        "CAIRO, May 3 (Reuters) - The United Nations aid chief said on Wednesday he hoped to have face-to-face meetings with Sudan's warring parties within two to three days to secure public guarantees from them for the safe passage of humanitarian assistance.The meeting could take place in the Sudanese capital Khartoum or another location, Martin Griffiths told Reuters in a phone interview from Jeddah, Saudi Arabia, following a visit to Port Sudan intended to plan a large-scale relief operation.The U.N. has warned that fighting between the army and the paramilitary Rapid Support Forces (RSF) risks causing a humanitarian catastrophe that could spill over into other countries.Several U.N. staff have been killed in the violence, which erupted on April 15.Though some aid has been shipped to Port Sudan, aid agencies are seeking detailed guarantees of safe passage to be able to distribute to Khartoum, Darfur and other areas.Griffiths said he spoke by phone to army leader Abdel Fattah al-Burhan and RSF commander Mohamed Hamdan Dagalo, commonly known as Hemedti, from Port Sudan on Wednesday, to tell them that specific aid corridors and airlift operations were required.\"We are very clear now in our operational requirements as to what we need in terms of commitments from them,\" he said, adding that one route could pass through Wad Madani southeast of Khartoum and another from Chad into Darfur.",
        "About one third of Sudan's population of 46 million was already in need of humanitarian assistance before the current conflict began.The fighting has displaced hundreds of thousands internally, mainly from Darfur in western Sudan, and more than 100,000 have fled across Sudan's borders.In Khartoum, millions are still trying to shelter from open warfare between an army using air strikes and heavy artillery and the RSF forces embedded in residential neighbourhoods.Most hospitals are out of service and many areas have been left without power and water as supplies of food and fuel dwindle. Repeated declarations of ceasefires have not stopped the fighting.Griffiths said he hoped to meet Burhan and Hemedti, or \"an empowered delegate who can sign off on these specific charters that we will put in front of them\" to guarantee delivery of aid.\"It's important to me that we meet physically, face-to-face to discuss this, because we need it to be a public, accountable moment,\" he said, adding: \"We are now in the process of dealing specifically with them on a date and place.\"Asked when such meetings could happen, he said he hoped within \"two or three days\". (Reporting by Aidan Lewis; editing by Grant McCool)"
    ]
}