{
    "articleURL": "/tvshowbiz/article-12038567/Fluer-East-puts-leggy-display-star-studded-Audio-Radio-Industry-Awards.html",
    "content": [
        "Audio and Radio Industry Awards co-hosts Fleur East and Rylan led the stars at the star-studded ceremony at Theatre Royal Drury Lane in London on Monday.",
        "Former Strictly star Fleur, 35, put on a very leggy display as she slipped into a pink sequinned blazer mini-dress for the occasion.She completed the double-breasted and oversized outfit with sparkly silver heels and white ankle socks. The stunner accessorised with pearls and swept her brunette tresses high as she toted her essentials in a quirky bamboo bag. Meanwhile TV star Rylan, 34, was suited and booted in his signature all black as he posed up a storm on the red carpet. ",
        "The Audio &amp; Radio Industry Awards recognise UK audio and radio talent who excel at their craft and produce the very best work in the world.As well it's regular categories, the evening will also honour iconic DJ Tony Blackburn for his 60 years on the airwaves. Last month it was revealed Tony, 80, had been forced to take more time out from work as he recovers from a nasty chest infection.He gave fans a health update on Friday, telling his Twitter followers he would be needing more treatment before he is back to his usual self.Announcing he would be standing down from his BBC Radio 2 show until he is better and postponing his live Sounds of the 60s gigs. He explained: 'I wanted to give a little update on my health and let you know that I won't be on the radio or in theatres for a little while yet.",
        "'The infection I have is requiring more treatment than initially thought and it means I am having to reschedule the Sounds of the 60s Tour for the moment in order to recover fully.'All tickets booked will be automatically transferred to the new dates and you will be notified of this change by your ticket provider. I am sorry for the disruption and I really am looking forward to getting back on the road with the band. ",
        "'I hope to be back on the radio as soon as possible but it might be a few weeks before I am able to get back in the studio. 'As you know, I am passionate about my radio shows and I will be back as quickly as I safely can. 'I want to thank all of the listeners who have sent their well-wishes and messages of support. I do read them all and it really means a lot.Tony added: 'Finally, to all the nurses, Dr's and support staff at Barnet General hospital who I spent a few days with over the last week, thank you for looking after me. You are brilliant!'The star's fans were quick to respond with some well wishes, with one person writing: 'Sorry to hear you’re still not great Tony. It’s only right to take the time you need to get yourself 100% again. We’re all willing you to feel completely well before returning to the radio.'",
        "Someone else shared: 'Hi Tony, sorry to hear you're still not well. Take the time you need so you can get back to doing what you love doing and to what we love you you doing Look forward to hearing back on the radio and coming to see the show. Take care and get well soon.'",
        "While another person wrote: 'Get well soon Tony, you are still the best DJ on the radio, I listen to all your shows, the music and your chat is just such a great tonic, great jokes, well sometimes, hoping you make a full recovery and it won’t be long before your back on the radio entertaining us all.'And another person posted: 'Wishing you well Tony and a speedy recovery - we need you back on the airwaves when you're fully recovered! You are THE sound of the 60's, while another fan posted: 'Get well soon Tony. Its not the same without u xx.'One other fan wrote: 'et well soon Tony your health must come first. Take care and look after yourself. I'm 62 now and I still have my 1st signed photo of you when I was about 10 . I was in your fan club . Lots of love Isabell xx.'Tony was previously forced to pull out of his BBC Radio 2 show again  and postpone gigs on doctors orders amid an ongoing health issue.",
        "He was replaced by stand-in Johnnie Walker on his Saturday show, Sounds Of The Sixties, for the second time.He later shared an update on Twitter, to inform his fans that he needed 'some time off to recover' from a nasty chest infection.",
        "Tony explained that he would be off air for the next few weeks and would have to reschedule his live shows that were set to take place in Swindon and Redhill. The broadcaster explained: 'Hello folks. Just to let you all know, I've had a little recurrence of the chest infection I had a few weeks ago.'My Dr has told me off for not taking some time to recover properly so I am having a break from the radio this weekend and, sadly, I have had to postpone the Sounds of the 60s shows at Swindon and Redhill next week too.'New dates are already in the diary though and I really do hope to be back with you soon.'Just want to thank you all for your kind words, I am listening to the doctors and this time I will recover properly, which I didn’t do before.'To those of you who have booked to see the show next week I’m so sorry but we are arranging new dates and your tickets will be OK xx.'",
        "Johnnie, 78, took over last Saturday, announcing: 'It's my pleasure to be with you the next couple of hours, so let's start the normal way.'"
    ]
}