{
    "articleURL": "/sport/nfl/article-12052571/49ers-GM-John-Lynch-says-Brock-Purdy-start-lobbing-football-weeks.html",
    "content": [
        "Brock Purdy is on a timeline to start throwing footballs in June, as planned The team is unsure if Purdy will be fully recovered to start in Week 1 this season DailyMail.com provides all the latest international sports news San Francisco 49ers quarterback Brock Purdy seems set to return to full strength following his elbow surgery to repair a torn UCL from the NFC Championship game. ",
        "Niners general manager John Lynch said that Purdy is on track to begin throwing in early June - part of the timeline the team set going into the offseason. 'I just got a report from the trainers,' Lynch said on the Murph &amp; Mac show. 'So Week 12, that's where he can actually go out, start lobbing a football.   'And according to the surgeon, you start getting a little better read on exactly where he's at right about then.'I think that's just kind of an indicator of where he's at. And then obviously you have to work up your strength, your stamina, you have to increase reps, distance, all those things. ",
        "'But that's going to be well thought out, and he's doing well. I think you just take it day by day. It's cliché, but it's the best thing you can do, and he's done a great job of doing that.'Purdy, the 'Mr. Irrelevant' who became the savior of San Francisco's season following injuries to two other quarterbacks, is projected to be the Niners' starter if healthy.However, no one is completely sure when Purdy will be back to 100 percent. Head coach Kyle Shanahan noted that he could be out until Week 4.If he isn't ready for the start of the season, San Francisco will likely turn to Trey Lance - the former third overall pick.",
        "But Lynch says that Purdy has been going to the team's facilities for offseason workouts - doing as much as possible while rehabbing his ailments.'He's not out there throwing yet,' Lynch said. 'That's going to happen around Week 12 (12 weeks after surgery), [which] is kind of the next inflection point. 'But he's doing really good, doing everything that he can do. As you know, that's just Brock's personality, and it's great to see him out here every day.'"
    ]
}