{
    "articleURL": "/tvshowbiz/article-12040995/MAFS-AU-Olivia-Frazer-showcases-peachy-derri-moving-house.html",
    "content": [
        "Olivia Frazer has showcased her peachy derrière while moving house. ",
        "The Married At First Sight star, 29, took to Instagram stories to share a clip of herself in a pair of booty-hugging tight pants. Olivia looked to be in good spirits as she showcased her figure, writing: 'Moving house but these pants are doing things for my [peach].' The star later revealed plans to move to the United Kingdom in July. 'World's slowest move is now underway, basically my lease is up in this house in August, but I'm going for June/July. I'm moving to the UK,' she said. ",
        "'I don't want to rush to move out and my mum has just brought a three-bedroom apartment. Literally a thirty second walk away.' Olivia added she was moving in to her family's apartment on the Central Coast.  'She's not really moving in so she'll only be there every other weekend. So I may as well live in my mum's gorgeous, empty new apartment,' she added. It comes after Olivia gave a confusing update on her lovelife after an Instagram Q&amp;A, amid rumours she is dating Seb Guilhaus. ",
        "The reality star declared she was 'still single but not available' during a Q&amp;A on her Instagram story when asked by a fan if she was currently seeing anyone. The bizarre answer comes after Olivia and Seb were spotted out for dinner together.",
        "Shortly after the rendezvous, Olivia shut down rumours of a romance on Instagram, confirming she and Seb were nothing more than new friends.In response to a fan who asked if they were an item, the reality star said: 'No. We had a nice dinner the other week... yeah, hung out a bit. He is lovely and that's all there is to it.'",
        "While she didn't open up anymore about her dating life, Olivia did talk about wanting to spend more time in the UK, where her ex-boyfriend is based.She has spent a lot of time in Scotland over the past year and said she would love to move there. 'I'm meant to say until about mid-July but I think I'm going to stay back a little bit longer,' Olivia said on Instagram.'Maybe like send my girlfriends home and that way I can sort of catch up with my British friends a bit better because I didn't get to see everybody this last trip.",
        "'I'll spend some more time in the highlands I think for an extra week or two and then come home.'Olivia previously spent time in the UK to visit her then-boyfriend British filmmaker Will Mitchell.Last December, the influencer told her followers that they decided to end things and she made a vow to herself to stay single until she is 30 years old.",
        "She said: 'I'm up for dating for fun for the next few months though. Not dating for a relationship anytime soon.'"
    ]
}