{
    "articleURL": "/wires/ap/article-12042235/Swiss-lower-house-approves-closer-ties-Taiwan-legislature.html",
    "content": [
        "GENEVA (AP) - Switzerland's lower house of parliament has voted to tighten ties with the legislature in Taiwan, a move that could further rankle China after recent visits by Western lawmakers to the island.",
        "The Swiss National Council voted 97-87 with eight abstentions late Tuesday to instruct parliamentary offices to \"strengthen\" relations with Taiwan's Yuan legislature, as a way to help strengthen democracy, peace and stability, and deepen economic, political, scientific and cultural exchanges between Switzerland and Taiwan.Left-leaning parties generally supported the measure, while the main right-wing and free-market parties opposed it. The measure only relates to the lower house; the upper house - the Council of States - doesn't necessarily have to line up for it to take effect, according to the Swiss parliament's press office.The issue now heads to a foreign affairs committee to explore how to put the measure to work.If carried out, the Swiss gesture would be a new tactic by foreign lawmakers to support the self-ruled island democracy in the face of intimidation by the mainland´s ruling Communist Party, which claims Taiwan as part of its territory and has threatened to invade.The measure has been championed by Socialist lawmaker Fabian Molina, who led a parliamentary delegation to Taiwan in February that met with President Tsai Ing-wen.",
        "In a phone interview, Molina said the vote demonstrated Swiss sovereignty - even with a power like China.\"Switzerland has very close political relations with China - I would say sometimes too close - because it hinders us to also speak up against certain human rights violations or against certain problems,\" Molina said. But he acknowledged the vote \"does not mean that we make a complete U-turn in our relations with China\" either.",
        "Lawmakers from other countries, including Germany and the United States, have taken part in similar delegations. All come from countries whose governments have diplomatic relations with Beijing rather than with Taiwan, which the mainland claims as part of its territory.The Swiss Foreign Ministry, in an email, said Switzerland is sticking to its \"One China\" policy, which \"excludes formal diplomatic relations with the authorities in Taiwan; however, exchange on a technical level is possible and desirable.\"Liu Yuyin, a spokesman for China's diplomatic mission in Geneva, said the \"One China\" principle was the \"prevailing consensus\" in the international community and the \"foundation\" of China's diplomatic ties with other countries.Recently, China has stepped up its campaign to isolate Taiwan by peeling away some of the island´s few remaining foreign diplomatic partners, most of them poor and in Africa and Latin America.In March, Honduras became the latest government to break ties with Taiwan and switch official recognition to Beijing."
    ]
}