{
    "articleURL": "/wires/reuters/article-12046087/Guardians-Vol-3-bittersweet-goodbye-eclectic-space-crew.html",
    "content": [
        "By Rollo Ross and Danielle Broadway",
        "LOS ANGELES, May 4 (Reuters) - Actor Chris Pratt, whose movie career took off with the first \"Guardians of the Galaxy\" in 2014, decided that he wouldn´t watch the third and final installment of the film franchise, until the world premiere in Los Angeles.Pratt had seen one or two short unfinished sequences of \"Guardians of the Galaxy Vol. 3,\" but at the premiere he took the time to savor the entirety of the swan song in Marvel´s \"Guardians\" trilogy.\"I wanted to be swept away on the journey alongside my friends, my family, all of the fans in the audience, the cast and crew. I'm so grateful because it was great,\" Pratt told Reuters.Volume 3, which opens on Friday, follows Star-Lord, portrayed by Pratt, and his team of alien misfits as they work together to save their raccoon friend Rocket, voiced by Bradley Cooper.Their quest pits them against the wannabe god called the High Evolutionary, played by Chukwudi Iwuji.Other cast members include Zoe Saldana as Star-Lord's love interest, Gamora; Karen Gillan as her cyborg sister Nebula, Vin Diesel as tree-being Groot; and Pom Klementieff as the insectoid Mantis.\"Guardians\" director James Gunn, who is also co-chairman of DC Studios, wanted to make the most of the third installment and the last time with his lineup of cast members. This meant sharing a special moment with Pratt before the movie premiered last Thursday.",
        "We kissed,\" Pratt joked.While that wasn´t the actual moment that Pratt and Gunn had, the two recalled feeling the emotional weight of saying goodbye to the \"Guardians\" movies together.While the characters were already established in previous \"Guardians\" movies and cameos in other Marvel films, for Gunn, creating a third installment of the Disney flick wasn´t an easy task.\"It took a lot more work because I needed to really tell an ending for every character and have that ending work for them and be respectful of the characters themselves and the actors who play them,; it was harder,\" Gunn said. \"I took a year to write the script and the other ones were not like that.\"Gunn gets a thrill when he sees fans inspired by the \"Guardians\" projects, including someone he met in Seoul wearing the Mantis antennae and crying because they were so thrilled to see the third movie. (Reporting by Danielle Broadway; Editing by Mary Milliken and Jonathan Oatis)"
    ]
}