{
    "articleURL": "/sport/nrl/article-12046115/Phil-Gould-NOT-silenced-NRL-Bulldogs-boss-slammed-Newcastle-Knights.html",
    "content": [
        "The NRL has insisted it will not silence Phil Gould The footy boss publicly criticised the Knights But the league says it will not act against Gould The NRL has relayed concerns to the Canterbury Bulldogs regarding Phil Gould's media responsibilities potentially benefitting the club he runs, but have insisted they will not silence the powerbroker. ",
        "Footy boss Andrew Abdo received complaints from NRL clubs after Gould - director of football at the Bulldogs - criticised the Knights' mid-season trip to Bali earlier this week.Newcastle counterpart Peter Parr said 'people at other clubs should worry about their own club' and the NRL has heard concerns over the possibility of a conflict of interest between Gould's position at the Bulldogs and his influential role on the Nine network, while some have suggested the NRL are reluctant to take him on. Abdo told News Corp that he met Bulldogs bosses last week to discuss the subject, but stressed that there would be no demand to silence Gould by the NRL.'This is definitely not about silencing anyone in the media,' Abdo said.",
        "'It's important for everyone to have their opinions. You guys (the media) do a great job for us, telling the stories to the fans. This is not about not wanting criticism, this is just about the rules that the NRL has for everyone accredited in the game.'There's a reason why club officials aren't able to comment when a matter is live because we don't want the perception of that influencing the decision-makers.'Clearly my conversation with the Bulldogs was just around registered club officials not breaching the rules.",
        "'If there's a matter that's live, for example either a matter that relates to the match review or the judiciary or an integrity matter, the rules don't permit players or officials accredited under those rules to talk openly about it.'That's what the conversation was about.'When pressed as to whether he would talk with Gould about his roles with the Bulldogs and media, Abdo added: 'I chat to Gus from time to time and I'm always open to meeting with him. At this stage that's not necessary although we do have an open dialogue and we'll continue to do that.'",
        "Some Knights players opted to take a holiday to Bali despite being thumped by Parramatta last week, a decision which left Gould fuming.'It wouldn't happen in my day,' Gould said on Six Tackles with Gus. 'I'd always use the bye round... for me that was always a time to go back and refresh, to look at some things that maybe we're not doing as well as we would have liked, or maybe there's some things we can add to our game, or maybe we need a refresher course.'For me the benefit of the bye was not getting busted on the weekend, was not going out. It gave you two weeks to get ready for your next game instead of one week.",
        "'It just wouldn't have happened in my day. For me, it was two weeks to get ready for your next game, and you shouldn't lose if you had the two weeks to get ready.'"
    ]
}