{
    "articleURL": "/sciencetech/article-12047679/Experiment-shows-wipe-baby-changing-stations-public-restrooms.html",
    "content": [
        " A TikToker found public baby changing stations are covered in bacteriaThe bacteria could be from a previous baby or water droplets from toilet sprayREAD MORE: Experiment reveals why you should NEVER use a hand dryerA new experiment will make parents think twice before using a public baby changing station.",
        "TikToker 'howdirtyis' conducted a swab test on a plastic table in a public restroom, finding the wall installation was riddled with bacteria.Incubated samples grew two different microbes, likely from microscopic water droplets spraying from flushing toilets.While the video does not specify what bacteria were found on the station, previous work has found fecal matter, salmonella, listeria and norovirus, all of which can make a child very ill.However, parents can avoid the germs by spraying the station with sanitary wipes and placing a disposable changing pad on the plastic table before laying their baby down.",
        "The 'expert' swapped the entire station tray and swabbed two Petri dishes with the samples - one of which was to isolate any bacteria.The dishes were then placed in an incubator, but for how long is unknown.The video has more than 1,300 comments. Many are parents sharing how they tackle the publicly used stations.One user said they carry Lysol wipes in their diaper bag and wipe down the changing table before using it.Others mention they use a changing pad, but experts warn reusable pads carry your child's fecal matter and bacteria from the tray home with you and suggest using only disposable options.",
        "Spray from flushing toilets can travel a radius of 20 feet in every direction and changing tables are typically inside one of the stalls.",
        "The bacteria is not just from a toilet; it could be left behind from the last baby laid on the table.Some people believe germs are key for a baby's immune system development, but diaper changing stations have led to multiple outbreaks - a 2007 outbreak in Florida left 46 children sick.And in 2013, a norovirus outbreak in Oregon was linked to baby changing stations. The TikToker's account is full of bacteria experiments at the request of their followers.And one had asked for them to swab a baby changing station. ",
        "The incident happened at a car dealership where 12 out of all 16 employees fell ill.",
        "The small device consists of paper that has been pre-treated with sodium chloride, better known as salt, and has an outline of a circuit board on it. ",
        "An investigation led to a sick baby leaving bacteria behind on a changing station at the dealership.However, an employee attempted to clean the mess but did not wear gloves.Kimberly Repp, the epidemiologist at Washington County, swabbed the station and found it was contaminated with norovirus. Along with bacteria, experts have also found traces of narcotics on the plastic tables.A test from 2011 of more than 100 units - including facilities in public toilets, shopping centers, police stations, courts and churches - found that 92 percent of them carried traces of cocaine. ",
        "In 2018, a mother revealed the shocking truth behind the black marks left on a baby's changing table in a public parents' room.Jessica Wayman, 24, who is from Indiana, took to social media to share a seemingly innocent picture showing the children's changing area.The table has what appears to be everyday scuff marks on its surface - but, as Wayman revealed, the reason behind them is far more harrowing than you think.'Before putting your babies anywhere near these things, always wipe them down first. Even if you are in a hurry, even if you have a blanket to lay down,' Wayman warned.'See the black marks? Those are from burnt spoons. [Drug] addicts use these as tables while they shoot up.'There could be residue from heroin or meth whatever, and other harmful bodily fluids. If someone doesn't care about themselves, I can promise you, they aren't thinking about your kids. Be cautious.'Wayman is also a recovering addict and hopes to warn parents around the world about the possible dangers of not cleaning the area properly before using. "
    ]
}