{
    "articleURL": "/wires/reuters/article-12038971/76ers-Joel-Embiid-knee-assumed-doubtful-Game-2.html",
    "content": [
        "Philadelphia 76ers coach Doc Rivers said Tuesday that there's \"no change\" to the status of Joel Embiid, adding that he's \"assuming\" the team's star center will be doubtful for Game 2 of the Eastern Conference semifinals.",
        "Embiid was able to put in some work during Tuesday's practice, and how his injured knee responds will be a determining factor for Wednesday night's game in Boston against the Celtics.\"There's no change in his status,\" Rivers told reporters Tuesday. \"I'm assuming it's doubtful -- I don't know what the words are, but they haven't changed if I'm being honest, but he's working out. He's over there with some of our guys right now and I'll get the report when he gets back. The fact that he's doing that is a step forward for sure.\"But the fact that the Sixers took Game 1 Monday night in Boston will not factor into playing Embiid or not.\"It's just health-based,\" Rivers said. \"If he can play, he plays. If he can't, he can't. If it's 50/50, we would probably err on the other side because we've done that all year. We're not gonna take any chances.\"The 76ers' James Harden scored 45 points in Game 1 against the Celtics for a 1-0 lead in the best-of-seven series. The Sixers have yet to lose (5-0) this postseason.Embiid missed his second consecutive playoff game Monday with what is widely reported to be a Grade 1 LCL knee sprain.However, Fox Sports reported Monday afternoon that Embiid actually has a small tear in the right knee that will require a procedure at some point.",
        "The Athletic also reported Monday that Embiid underwent a platelet-rich plasma treatment on the knee last week.Embiid hasn't practiced since injuring the knee in Game 3 of the previous series against Brooklyn.Embiid dealt with knee soreness in Game 3 of Philadelphia's first-round series versus the sixth-seeded Nets. He then sat out Game 4, although the third-seeded 76ers were able to complete the sweep of the best-of-seven set with a 96-88 victory on April 22.Embiid averaged 20.0 points, 11.3 rebounds and 2.3 blocks in three games against the Nets. He led the NBA in scoring during the regular season at 33.1 points per game and is a finalist for MVP honors.Embiid, 29, played in 66 games during the regular season, two shy of his career high set during the 2021-22 season.--Field Level Media"
    ]
}