{
    "articleURL": "/wires/reuters/article-12047651/Alabama-fires-coach-Brad-Bohannon-amid-betting-probe.html",
    "content": [
        "Alabama fired baseball coach Brad Bohannon on Thursday in the midst of a betting investigation that resulted in three states shuttering bets placed on Crimson Tide games.",
        "Jason Jackson will serve as interim head coach.\"Alabama director of athletics Greg Byrne announced he has initiated the termination process for head baseball coach Brad Bohannon for, among other things, violating the standards, duties and responsibilities expected of university employees,\" Alabama said in a statement. \"There will be no further comment at this time pending on ongoing review.\"The NCAA started a probe into betting irregularities earlier this week after suspicious sports wagering activity was detected in Ohio in connection with a recent baseball game between Alabama and LSU.Ohio gambling regulators had asked the state's licensed sportsbooks to stop taking wagers specifically on Alabama games. An independent monitoring group had detected wagering irregularities, with a betting location at Great American Ball Park in Cincinnati that had come into question.Pennsylvania and New Jersey have since followed suit in halting betting on Tide ballgames.One questionable wager was a parlay that included LSU defeating Alabama. Another was a large single-game wager on LSU defeating Alabama. LSU earned an 8-6 victory Friday during the game in question after it led 8-1 through seven innings.The SEC is also investigating.Bohannon was also named in a lawsuit in March. Left-handed pitcher Johnny Blake Bennett and his father, Jon, are suing Bohannon, pitching coach Jackson and athletic trainer Sean Stryker, according to court documents filed in Tuscaloosa County Circuit Court on March 10.",
        "According to the complaint, Bennett unknowingly broke a rib during strength training on campus in 2019. When he started throwing 60 feet on flat ground a few weeks later, he began to feel numbness and couldn't control his throws. He was ultimately diagnosed with thoracic outlet syndrome (TOC), a disorder that occurs when certain blood vessels or nerves are compressed.The civil suit alleges the three coaches mismanaged Bennett's recovery, including identifying his issues as \"the yips\" -- a shorthand term for when an experienced athlete has a mental blockage that stops them from executing routine skills.The suit also alleges that on May 12, 2022, Bennett was \"unexpectedly\" dismissed from the team without explanation.Bohannon finishes with a 166-124 record since becoming Alabama's coach in June 2017. The Crimson Tide are 30-15 on the season.--Field Level Media"
    ]
}