{
    "articleURL": "/tvshowbiz/article-12052645/EDEN-CONFIDENTIAL-Lady-Amelia-swaps-royal-court-Crown-Court.html",
    "content": [
        "She is one of the younger royals who has been shunted away from the Coronation, thereby ensuring there is room in Westminster Abbey for Ant &amp; Dec and other figures from stage and screen.",
        "But not only is Lady Amelia Windsor far above taking offence at any unintended slight, she has been making royal history in her own understated way.I can reveal that Lady Amelia, 27, the Duke and Duchess of Kent’s granddaughter, has just become the first member of the Royal Family to undertake jury service.The fact that she was even eligible to do so only became possible when centuries of tradition were abandoned with a change in the law in 2003. Until then, all royals were exempt from a civic duty that might well have seen them consign a fellow citizen to a custodial sentence at His Majesty’s Pleasure.Model Lady Amelia scrupulously avoids discussing the case — or cases — she heard. But she does say that she did her courtroom stint in Cambridge, where she grew up and where her parents, the Earl and Countess of St Andrews, still live. That’s intriguing. The most serious cases — including murder — are now tried at Cambridge Crown Court.",
        "It seems improbable that Lady Amelia’s fellow jurors recognised her. ‘On my lunch break, I wandered around. I’ve never lived anywhere else, but I walked down streets I’ve never been on,’ she reflected. ‘I’ve never actually gone out in Cambridge.‘I walk around and see people my age and think, “Oh, I wish!” I just don’t really have any friends here, sadly.’",
        "Amelia has the consolation that, as I disclosed, she was recently pictured in Soho, West London, walking hand in hand with a tall, dark-haired companion.Wedding goes off with a Chitty Chitty Bang Bang How about this for a Truly Scrumptious way to surprise your bridegroom?Opera singer Melinda Hughes arrived at her wedding at Chelsea Old Town Hall yesterday in the car used in Chitty Chitty Bang Bang, the 1968 film directed by her late father, Ken Hughes. ‘Arriving in the car has such meaning for me, as I feel he will be there in spirit,’ she tells me. Melinda, 50, exchanged vows with Denis Mirlesse, 60, a clinical psychologist.",
        "Fiennes girl is picture-perfect for Diana ‘doc’ She's definitely got the look — and the latest actress to play Princess Diana also has a claim to the necessary talent.She’s Shanti Fiennes, 25-year-old niece of silver screen stars Ralph and Joseph Fiennes. Shanti’s chance to establish herself alongside them as box office royalty comes in Diana In Love, a fictional re-imagining of Diana on a road trip to California to view a £20 million beachside pad in Malibu where she and Dodi Fayed will set up home.‘The documentary style of the filming is incredibly freeing,’ Shanti, whose father is composer Magnus Fiennes, tells me. ‘We filmed on a beautiful yacht in Marina del Rey [and] we’ll be filming in California all summer.’",
        "Very Diana. But writer-director Brent Roske was inspired by a rather darker cinematic landscape —Quentin Tarantino’s Inglourious Basterds.‘My friend Omar Doom got to kill Hitler [in that movie],’ he tells me. ‘I figured if Quentin could rewrite history to make a crowd-pleaser, I could do the same.’",
        "MP Crispin’s £1.5k Sam Smith freebie While some Tory MPs mock Sam Smith for the singer’s gender-neutral pronouns and outlandish outfits, at least one was happy to attend the pop star’s concert.Crispin Blunt, notorious for his liberal views on drugs, accepted a freebie from insurance giant Aviva to watch Smith at the O2 in London.According to the Register of Members’ Financial Interests, the uncle of Mary Poppins star Emily Blunt received two hospitality tickets worth a combined total of £1,512.Smith, 30, who said in 2019 that after years of ‘being at war with my gender’ they wanted to be referred to as ‘them’ or ‘they’, was criticised for ‘their’ sexualised music videos.Blunt told the House of Commons in 2016 that he would be ‘directly affected’ by a ban on legal highs, as he regularly used ‘poppers’.He tells me: ‘It may have taken a while to attend my first major popular music event, but I thoroughly enjoyed the evening and am grateful to, if unobliged [sic] to Aviva for their hospitality.’",
        "First Dates star Fred Sirieix must be the world’s best-paid maitre d’.I can disclose that the Frenchman, 51, who came to prominence on the hit Channel 4 dating show, paid himself a whopping £2.3 million last year. Newly released accounts for The Art Of Service Ltd, the company used to channel his earnings, show that Sirieix paid himself the huge dividend in the year to last July.The former general manager of Galvin at Windows at the London Hilton on Park Lane does have his fingers in a few pies. In addition to his television work, he has published books, released a board game and is the ‘face’ of a French biscuit brand.",
        "Coronation whispers Madeleine TO soothe Royal nervesViolin virtuoso Madeleine Easton will play at the Coronation after His Majesty said he listened to her music to ‘stay sane’.The Australian, who will play her 1682 Giovanni Grancino instrument as the King and Queen walk into Westminster Abbey, says, ‘I know King Charles. He is a very kind and passionate man.‘He told me several years ago that he needs music to stay sane.‘When the pressures of his life become too much, he has said, he listens to me play and music transports him to a deeper level.’",
        "The year 1953 feels like yesterday for Radio 4 Brain Of Britain presenter Russell Davies. ‘A BBC TV reporter this morning said, “Very few people are now alive who remember the Queen’s Coronation”. I think rather a lot of my friends, relations and contemporaries must have been surprised, not to say affronted, to hear that,’ the 77-year-old harrumphs. ‘It wasn’t Dunkirk, you know.’ ",
        "Will you spy Dame Judy?  Screen royalty will be at the Coronation. I can disclose that Dame Judi Dench, who won an Oscar for her performance as Queen Elizabeth I in Shakespeare In Love, has been invited.Last year, the actress, 88, condemned Netflix hit The Crown for its ‘cruelly unjust’ depictions of the Royal Family. As former spy chief ‘M’ in the James Bond films, perhaps Dame Judi can help Special Branch keep an eye on another national treasure due to be at Westminster Abbey — Rowan Atkinson.The Mr Bean star, 68, once sabotaged a coronation, snatching the crown in spoof spy film Johnny English.",
        "It turns out that to get an invitation to the Coronation, all you had to do was ask.Lady Anne Glenconner, Princess Margaret’s great friend who will be at the Abbey, is said to have secured hers after being seated next to King Charles at a private dinner party.‘She asked him if she could have an invitation,’ a friend tells me. ‘What could he say? He’s so polite, never likes to upset anyone, so he mumbled that, of course, he was sure it could be arranged.’If anyone deserves an invitation it’s earl’s daughter Lady Anne, 90, after putting up with her ghastly husband, Lord Glenconner, for more than 50 years."
    ]
}