{
    "articleURL": "/news/article-12061091/Mr-Beast-buys-quiet-North-Carolina-neighborhood-family-employees.html",
    "content": [
        "Mr. Beast, a popular YouTuber with 151 million subscribers, has been gradually purchasing properties in a serene North Carolina neighborhoodThe YouTuber has gained fame for his philanthropic endeavors and captivating content with his videos amassing more than 40 billion views Real name, Jimmy Donaldson, has now acquired a total of five modest homes situated on a cul-de-sac close to his childhood home to host family and workersPopular influencer MrBeast, who has more than 151 million subscribers on YouTube, has been slowly buying up properties in a leafy neighborhood in the southeastern suburbs of Greenville, North Carolina. ",
        "MrBeast, 25, whose real name is Jimmy Donaldson, has become known for his philanthropic work and addictive YouTube videos.His videos have pulled in more than 40 billion views making him a multi-millionaire in the process with some estimates putting his wealth at $105 million. His YouTube channel ranks as the fourth most-subscribed on the platform. But despite being a millionaire many times over, Beast has purchased five modest homes on a cul-de-sac that is by no means millionaire's row. The house is close to the area where he grew up, with the first property he bought costing $318,000. ",
        "He plans to house his employees and family in each of the homes when he is not at his studio, where his online content in created.The first home Beast bought was for $318,000 in 2018. The home was built in 2001 but he had already been living in the property.The four bedroom, four bathroom two-story house spans about 3,000 square feet and came complete with granite countertops, a breakfast bar, a family room with a gas log fireplace, and a master suite with an ensuite bath equipped with a double vanity, whirlpool tub, and shower. The second level comprises three additional bedrooms, a laundry room, and a spare room. The property also includes a screened-in rear porch, patio, basketball court, and a separate building for storage.",
        "Following his initial purchase, Beast has been gradually acquiring the remaining neighboring homes for his family and employees, each time paying above market value for each property.Beast is believed to live in the home he bought with girlfriend Thea Booysen. Thea, a writer and Twitch streamer, recently opened up about the immense amount of scrutiny that she has gotten due to the romance during a recent appearance on the Wide Awake podcast, and she admitted that many of her boyfriend's supporters have accused her of being a 'gold digger' and worry that she's going to hurt him in the end.The couple met last year, after the two were introduced by a mutual friend during a trip to South Africa. The homes Beast snapped up were not listed and bought off-market but he is believed to have acquired a further three homes at a cost of $1.45 million.One home is still a holdout with the owners staying put due to their children attending school in a highly thought of local school district. 'My understanding is the folks who are holding out is similar to any reason why would anyone would have held out — its the best school districts in the area, and they have kids in school,' Aaron Bowden, who sold his home to Beast last year, told the New York Post. ",
        "'I wouldn't know anything for a fact because I don't walk in their shoes, but they may change their minds when their kids are out of high school and off to college,' he suggested. ",
        "Bowden revealed how when he sold his some to Beast, it involved direct negotiations with him. Other neighbors who sold their home included some who had recently moved into the area - but each had their own unique reasons for selling up.Beast has been combining doing good with humor since he started making YouTube videos a decade ago. He features videos of volunteers cleaning beaches or oceans alongside ones that investigate whether 50,000 magnets can catch a cannonball (spoiler alert: no) or recreate a non-lethal 'Squid Game.' His main audience is in the 14-20 demographic and they are learning how to have fun while helping. Beast's rise to become one of the top YouTube personalities has been fueled by his decision to invest in himself. At the beginning, he described himself as 'this awkward guy with a bunch of acne that no one cared about. I didn´t have any money, but I just kept going.'A decade ago, users had to pull thousands of views a month to get monetized on YouTube and Beast spent years rejected by the platform, until he was about 16. Then, he says, it was 'game over.'",
        "'From literally the time I started making money at 16 until now, I just reinvested everything I made. One dollar a day turned into two and then three. And then eventually I was making $10,000 a month then a $100,000 a month, then $1 million a month,' he says.'I just want to make the best YouTube videos possible. I don´t really care about living in a mansion or driving a Lamborghini,' he adds. 'I live to create content and I want to entertain people.'He's developed some rules along the way for success. 'When it comes to going viral, the ultimate key is to give people something they can't find anywhere else,' he says.'There are crazy things you can do that take effort, but don't require a lot of money. Everyone can put in effort. You just do something that hasn't been done and you go all out.'He and his team rely on a revenue system that rewards views. YouTube puts ads on videos on its platform and it shares half the revenue with the creators. Beast says his videos average between 40 million to 100 million views and a 15-minute MrBeast video might mean three or four ads embedded in each. Ad revenue might not be much on each view, but at such volume it adds up. The money generated is then plowed back into his operation."
    ]
}