{
    "articleURL": "/wires/reuters/article-12048493/TikTok-advertisers-stick-app-amid-threat-U-S-ban.html",
    "content": [
        "By Sheila Dang",
        "May 4 (Reuters) - Advertisers are committed to continue spending on TikTok due to its immense popularity with users despite threats of a potential ban in the U.S. over national security concerns, ad experts said.The steadfastness comes as TikTok, which is owned by Chinese tech firm ByteDance, is fighting to prevent a ban in the U.S. after lawmakers introduced a bill that would grant President Joe Biden's administration authority to ban apps that pose security risks. The short-form video app has already been banned from government-issued phones in multiple countries.TikTok is set to host a presentation for advertisers on Thursday evening in New York as part of NewFronts, an annual week of events where social media and streaming video platforms reveal new content and features for marketers.Despite the concerns about its Chinese ownership, TikTok's ad business is poised to grow 36% to $6.83 billion this year, according to research firm Insider Intelligence.Ryan Detert, chief executive of Influential, an influencer marketing company, said that of the firm's clients \"none are saying 'don't spend money on TikTok,'\" he said.\"There's no contagion that we're seeing,\" he added. Influential has worked with brands including Pepsi and the NFL.Two media buyers at two different major ad agencies told Reuters that Washington's scrutiny over the app had yet to impact their clients' plans on TikTok. The two buyers spoke on condition of anonymity to discuss relationships with TikTok.",
        "At its presentation on Thursday, TikTok will announce a new ad format that will let brands place ads next to content from publishers like BuzzFeed, Dotdash Meredith and NBCUniversal, and will give a 50% cut of the ad revenue to those publishers.\"TikTok is irreplaceable unless and until (advertisers) have to replace it,\" said Mark DiMassimo, founder of creative agency DiMassimo Goldstein, which has worked with brands such as Hello Fresh and Samsung.Still, several media buyers acknowledged the threat of a U.S. ban would be the \"elephant in the room\" during the advertiser presentation.On Tuesday, TikTok said its head of U.S. trust and safety would depart the company next week, leaving the app without a key executive who oversaw content moderation and the development of safety tools for the division that housed U.S. user data.\"There's a lot of uncertainty combined with uncertainty in general about the economic situation,\" said Stephani Estes, chief media officer at digital marketing agency Goodway Group. \"You have to consider the what-ifs.\"TikTok said it is addressing advertiser concerns \"head on in an open, fact-based and ongoing dialogue.\"(Reporting by Sheila Dang in New York; Editing by Daniel Wallis)"
    ]
}