{
    "articleURL": "/wires/reuters/article-12040745/Taiwan-seeking-US-cooperation-make-generation-fighters.html",
    "content": [
        "TAIPEI, May 3 (Reuters) - Taiwan is seeking U.S. cooperation to make the island's next domestically developed fighter jet, the head of Taiwanese defence contractor Aerospace Industrial Development Corp (AIDC) said on Wednesday.",
        "Taiwan's air force scrambles daily to see off incursions by Chinese jets into the airspace around the island as Beijing steps up its pressure to try and force Taiwan to accept China's sovereignty.While the mainstay of Taiwan's air force is Lockheed Martin Corp's F-16s and French-build Mirages it also uses AIDC's F-CK-1 Ching-kuo Indigenous Defence Fighter, or IDF.Taiwan IDF fleet was rolled out more than three decades ago but has been upgraded.Speaking at a Taiwan-U.S. defence industry forum in Taipei, AIDC Chairman Hu Kai-hung said the company wanted to raise its technical prowess to help with the development of Taiwan's next generation fighter.\"When it comes to the development of the next generation fighter, we hope the United States supports Taiwan to develop it itself, including the engine, avionics, control systems, environmental controls and so on, which are all an opportunity for Taiwan-U.S. cooperation,\" he said.Taiwan in 2017 announced the next generation fighter programme, to include stealth capabilities, but has given few details since.Most countries will not sell weapons to Taiwan for fear of angering China.Even the United States has been unwilling to provide Taiwan its most advanced fighters like the F-22 or F-35, and Taiwan has no direct answer to China's new J-20 stealth fighter.",
        "This has driven Taiwan to develop a new home-built fighter as part of an overall strategy to make more weaponry itself, like submarines.\"Domestically-made aircraft is the road we have to travel,\" he said.AIDC in 2020 test flew a new jet trainer, the AT-5 Brave Eagle, Taiwan's first jet made domestically since the IDF, and the company is also upgrading the F-16 fleet to the more advanced F-16V version and operates an F-16 maintenance facility. (Reporting by Ben Blanchard; Editing by Lincoln Feast)"
    ]
}