{
    "articleURL": "/femail/food/article-12038947/Great-British-Menu-winners-majestic-chicken-pie-crowned-winner-Coronation-Dish-competition.html",
    "content": [
        "The winning chicken pie contains cheese, cream, leeks and mushrooms Read More: Fit for a King? As Charles chooses quiche as his Coronation dish, FEMAIL puts the eggy broad bean recipe to the testHe was a finalist in Masterchef: The Professionals and won the Great British Menu earlier this year - but now Adam Handling has yet another feather to add to his bow.",
        "The British chef was announced as the winner of The One Show's Coronation Dish competition on tonight's episode.Ahead of King Charles' Coronation on 6 May, five chefs - who have all appeared on Masterchef or Great British Menu - were challenged to come up with a dish that could be served at The Big Lunch street parties up and down the country.Adam's winning creamy chicken pie recipe - which contains mushrooms, leeks and cheddar cheese - was voted for by the public and can be enjoyed either hot or cold.Discussing what inspired him to develop the recipe, Adam explained: 'I read that King Charles, if he could, would eat a pheasant pie everyday as it's one of his favourite things. So I wanted to play on that.'",
        "After tasting it for the first time, special guest host Mary Berry said: 'You've cracked it. It's wonderful.'Everybody is going to enjoy that and I hope our King and Queen [do too].'Adam's pie was up against a fried chicken sandwich, oyster mushroom filo tart, a cauliflower and spinach dome and some pork and prawn dumplings.The programme first invited viewers to test out the recipes two weeks ago and then vote for their favourite - with the winner being unveiled this evening.",
        "In the lead-up to the announcement, Adam told host Jermaine Jenas: 'Who doesn't love a chicken pie? It's going to be great.'But looking at all these tables and the food looks completely delicious so I have no idea where it's going to go.'After Mary Berry announced the winner live on the show, Adam was visibly shocked by the accolade. He said: 'Thank you, who would have guessed it? ",
        "For the pie case1 tbsp butter1 tbsp plain flour2 sheets ready rolled puff pastry (320g/11½oz each)1 free-range egg, beatenFor the filling6 chicken thighs, skinless and boneless1 tbsp plain flour1 tbsp vegetable oil2 onions, quartered and sliced1 leek, cut in half lengthways and sliced250g/9oz chestnut mushrooms, cut into quarters75g/2½oz unsalted butter75g/2½oz plain flour220g/8oz cheddar, grated225ml/8fl oz chicken stock250ml/9oz single cream2 tsp salt1 tsp black pepperVisit the BBC Good Food website for the full recipe ",
        "'I’m super proud. I’m a massive royalist and this is an incredible part of history so it’s great to be a part of it.'Adam's pie will be the official dish of the Big Lunch 2023 - with organisers urging people to serve it alongside King Charles' Coronation quiche. Last month, Buckingham Palace announced that the monarch has chosen the eggy dish - which features spinach, broad beans and tarragon - to mark his Coronation.",
        "The tart was developed in close conjunction with the King and Queen Consort by the Royal Chef Mark Flanagan, at Buckingham Palace. Mr Flanagan has been in charge of royal meals since 2002. It is hoped people will be inspired to make the quiche and serve it up at the 'Big Lunches' being held in communities up and down the country over the Coronation weekend of May 6-8.Quiche was chosen because it is considered a good 'sharing' dish to take to a street party and can be served hot or cold. It also suits a wide variety of dietary requirements and preferences and is considered to be 'not too complicated to make or require costly or hard-to-source ingredients'.The savoury flan can also be easily adapted to suit individual tastes and diets by adding or substituting ingredients, Buckingham Palace said.'We look forward to collaborating with chefs and amateur cooks for suggestions on that front,' a spokesman said, adding: 'Above all, it's delicious!'Former Buckingham Palace chef Darren McGrady said the King's choice came as no surprise because Charles loves any food containing eggs and cheese.Mr McGrady, who worked for the late Queen for 15 years, said he had made quiche for Charles many times.'It's no surprise that the King Charles III has shared Coronation quiche to celebrate his Coronation,' he wrote on Twitter.",
        "'His mother, The Queen loved chocolate, but The King loves anything with eggs and cheese.'Made this for him many times... especially with salmon he'd caught in the river Dee.'"
    ]
}