{
    "articleURL": "/news/article-12044555/Dee-Snider-axed-LGBT-festival-liking-Kiss-star-Paul-Stanleys-tweet-trans-kids.html",
    "content": [
        "1980s rock legend Dee Snider has been cut from San Francisco's Pride festival after he liked a tweet from Kiss's Paul StanleyIn a controversial message, Stanley waded in to the polarizing debate around gender-affirming careSnider has responded to those who have been criticizing him on Twitter by pointing to his long record of supporting LGBT causes San Francisco Pride has cut Twister Sister front man Dee Snider from their line-up next month after the legendary rocker endorsed a tweet slamming sex changes for kids. ",
        "Snider's 1984 hit We're Not Gonna Take It had been slated to be the 2023 theme song of the event. The singer was also expected to perform. However, after Snider retweeted and liked a message from Kiss star Paul Stanley, plans have changed. On May 1, Stanley tweeted a post titled 'My Thoughts On What I'm Seeing.''There is a BIG difference between teaching acceptance and normalizing and even encouraging participation in a lifestyle that confuses young children into questioning their sexual identification as though some sort of game and then parents in some cases allow it,' Stanley wrote. Shortly after the Kiss co-founder posted the tweet, Snider, 68, replied: 'You know what? There was a time where I \"felt pretty\" too. Glad my parents didn't jump to any rash conclusions! Well said, @PaulStanleyLive.'",
        "Stanley said that while 'there ARE individuals who as adults may decide reassignment is their needed choice,' he criticized 'turning this into a game or parents normalizing it as some sort of natural alternative'.He also warned against '[...] Believing that because a little boy likes to play dress up in his sister's clothes or a girl in her brother's, we should lead them steps further down a path that's far from the innocence of what they are doing.'",
        "'With many children who have no real sense of sexuality or sexual experiences caught up in the 'fun' of using pronouns and saying what they identify as, some adults mistakenly confuse teaching acceptance with normalizing and encouraging a situation that has been a struggle for those truly affected and have turned it into a sad and dangerous fad,' he concluded.Snider responded to criticism of his tweet telling one user: 'Parents need to be less reactionary; Right and Left. No need to steer the child in either direction. Let the kid figure it out for themselves knowing their family is supportive.'When one person tweeted to Snider: 'Absolutely disappointed in you.' He responded: 'In two days...you will eat your words. Stand by for big announcement!,' without elaborating. On Wednesday, SF Pride said that they and Snider had mutually agreed to to part ways. The executive director of the festival, Suzanne Ford, who is trans, said in a statement that their organization was 'heartbroken and angry' when it learned of Snider's endorsement. In statement, Ford said that Snider has acknowledged that the tweet represented a 'teachable moment.' 'With transphobia proliferating and becoming more and more enshrined in law throughout the country — we have to stand up for the most impacted among us,' Ford told the San Francisco Chronicle in an interview.  ",
        "The festival is scheduled to take place on June 23. In April, Snider tweeted his support for drag queens in the wake of various states passing laws restricting performances. 'I get a lot of respect from the LGBTQ community. Being a straight guy and getting in fights all the time for dressing up gave me a lot of insight into what others go through. I couldn't let them stop be from looking how I wanted to look...and I didn't,' Snider said. While in a 2014 interview with the Windy City Times, Snider described himself as neither liberal or conservative and said that he was a supporter of LGBT rights and of the second amendment.  'I try to do what is right and judge each situation individually on party lines. I am both hailed and reviled by the conservatives and the liberals.'In the same piece, Snider said that he was 'super pro-gay rights' and pro-choice.  In the midst of the criticism over his response to Stanley's tweet, Snider retweeted a message that was critical of Florida Governor Ron DeSantis.  Stanley's post to the social media platform comes as debates about the controversial topic have raged across the US, with several states weighing up laws that will either restrict or protect rights of transgender people.",
        "Supporters of Stanley's statement applauded him for posting it, with several people replying to his post thanking him for joining the debate and taking a stance.Critics, however, pointed out that the musician and his bandmates made their career wearing flamboyant makeup and clothing - relevant on account of much of the debate around Trans rights also including drag performances.Others referred to Stanley and Kiss performing songs about sexualizing underage girls - such as the 1977 song 'Christine Sixteen.'It was not clear what prompted Stanley's post. Reporting on his statement, Rolling Stone magazine wrote what was clear from his statement was that he had incorrectly conflated sexuality and gender identity.The music magazine pointed out that that these develop independently, and shared guidance outlined by the Mayo Clinic - a nonprofit American academic medical center.'People communicate their gender to others through gender expression. This may be done through mannerisms, clothing and hairstyles,' the clinic explains on its website.'Gender identity develops separately from sexual orientation. People's sexual orientation is related to whom they're attracted to on a physical, emotional and romantic basis.'"
    ]
}