{
    "articleURL": "/tvshowbiz/article-12043583/Emmerdales-Mary-swears-REVENGE-conwoman-Faye-attacked-scammed.html",
    "content": [
        "Emmerdale's Mary Goskirk flew into a furious rage and swore revenge on conwoman Faye after being attacked and scammed.",
        "On Tuesday's episode, the former journalist uncovered the shocking truth that her girlfriend was nothing but a liar who can conned her out of thousands of pounds with a ruse about needing money for her women's shelter in Ecuador.She confronted Faye after finally cottoning on thanks to Suzy's concerns, but Mary (Louise Jameson) was left unconscious after Faye (Jane Gurnett) attacked her and fled with her cash and camera.A heartbroken and humiliated Mary refused to call the police after the attack and vowed to pay back the other scammed villagers' money with her own funds as she blamed herself for what happened.But in Wednesday's instalment, her daughter Rhona (Zoe Henry) took things into her own hands and called the police on her mother's behalf, prompting Mary to finally release her anger and vow to bring her ex to justice.",
        "After speaking with the police and being advised to seek help from 'victim support', Mary lashed out in a furious rant as she told her daughter that she refused to be a victim.The angry mum declared that Faye would not take away her self-esteem and promised to pay back all the victims who had been duped by Faye's lies.Violently throwing out the items in her suitcase that Faye persuaded her to buy for their fake trip to Ecuador, Mary told how she would throw the village 'the biggest party' when Faye was finally arrested.",
        "She also made a threat against the scammer, seething: 'I only hope the police find her before I do!' Viewers watching the dramatic scenes unfold were quick to express their joy that Mary was finally fighting back, after initially believing nothing should be done.Taking to Twitter, one viewer shared: 'Go Mary. Use that anger but save a massive smile for when you see Faye in court.'While another said: 'Glad Mary finally got her fight back and wants to get miss con woman arrested!!! Was worried just let it go and give wrong impression it's ok to con people! Hope they catch miss dodgy very soon!!!!!''Mary turned into a roaring lion' commented a third watcher.",
        "'Oh go on Mary! Brilliant stuff! Seeing her kick off like that' enthused a fourth fan.With another adding: 'Mary has went off the deep end. Cannae say a blame her.'Tuesday's show saw Mary found unconscious on the floor my Rhona's ex-husband Gus, who proceeded to call the ambulance.While being treated for her injuries by a paramedic, Mary recalled the horrifying incident to a concerned Suzy, who'd called in after spotting the ambulance, prompting the paramedic to ask if they should involve the police.To which Mary insisted: 'No police. It's my fault, it's all my fault!'",
        "Later as her daughter Rhona rushed home after getting a message from Suzy, a gutted Mary broke down as he lamented how silly she'd been.The former journalist sobbed that she feels like 'a joke' and 'vulnerable' as she struggled to comprehend how she fell for all of Faye's lies.Emmerdale airs weekdays at 7:30pm on ITV1 and ITVX. "
    ]
}