{
    "articleURL": "/tvshowbiz/article-12055747/Khloe-Kardashian-shows-famous-curves-grabs-lunch-Il-Fornaio-Woodland-Hills.html",
    "content": [
        "Khloe Kardashian showed off her curves as she joined her friend Malika Haqq for lunch at Il Fornaio in Woodland Hills on Saturday.",
        "The 38-year-old reality star - whose son's name was revealed on Thursday - looked sensational in a $550 Maisie Wilen Orbit City mini dress with thigh-high cream boots.The entrepreneur wore oversized gold flat-top sunglasses and styled her long blonde tresses down in waves.The Good American founder carried a small grey handbag and accessorized with long red nails, hoop earrings, a chunky gold watch, and multiple rings on each hand.Malika flashed her abs in a low-cut black crop top under a leather jacket with distressed stonewashed jeans and open-toed heels.",
        "Khloe has been friends with Malika and her twin sister Khadijah since 1999.In March, Khloe celebrated the twins' birthday with an Instagram post featuring a carousel of images spanning their long-standing friendship. Dubbing it a 'privilege and honour' to be friends with the duo, the Kardashian wrote: 'I want to thank you for choosing me over and over again to be your bestie. For allowing me to be apart of your life, Your journey on this planet. Thank you for trusting me with all that you do.'Thank you for holding my hand while we go through life. It’s a privilege and an honor to have a friendship as long as we have had and I cherish the years we have spent together. Ohhhhh the memories we have,' wrote Khloe. ",
        "Khloe's lunch outing comes after she shared several posts from her nephew Psalm's birthday party earlier in the day where several of the 4-year-old's friends and family were gifted with custom-made firefighter costumes.One of the images showed Khloe's five-year-old daughter True wearing a vintage-inspired t-shirt bearing her aunt Kim Kardashian's face.She also added a text graphic to the bottom of her video that partially read: 'How cool is this!' Kardashian shares True, as well as her eight-month baby son, reportedly named Tatum Robert, with her former partner, Tristan Thompson.",
        "Before she became involved with the 32-year-old professional basketball player, the reality television mainstay was previously married to Lamar Odom from 2009 until 2016.The influencer and her former partner initially sparked relationship rumors in 2016 and they were confirmed to have been dating in September of that year.The pair revealed that they were planning on starting a family in 2017, although the Los Angeles Lakers member was caught in a cheating scandal that emerged the following April.Kardashian gave birth to True that same month, and the couple reconciled not long afterward.The reality television personality and her former partner maintained an on-off relationship that continued until 2021, when the two split for good.However, it emerged that Thompson and Kardashian were expecting to welcome a second child via surrogate last July, and their baby boy arrived in August.",
        "The US version of The Sun recently reported that the social media figure's son was named Tatum Robert, although this has not been confirmed by the family. "
    ]
}