{
    "articleURL": "/tvshowbiz/article-12040807/Kyly-Clarke-flaunts-impressive-bust-skintight-ex-Michaels-house.html",
    "content": [
        "Kyly Clarke sported a noticeably perkier bust on Monday as she was seen popping around to her ex-husband Michael Clarke's Sydney home.",
        "The former Channel Seven host, who shares daughter Kelsey Lee with the retired cricketer, flaunted her eye-popping curves in a skintight off-the-shoulder grey top.The leggy brunette finished the look with a pair of skinny leg jeans, black heels and designer sunglasses.Kyly, who hasn't spoken of undergoing a breast augmentation, was seen picking up a number of Kelsey's items from her ex's house in the eastern suburbs.She carried a musical instrument to her car along with tennis rackets and a number of other items in tote bags.",
        "The former WAG is believed to be single following a break-up with James Courtney. Kyly and Michael's relationship spanned a decade with the long-time friends getting together just months after he split from Australia's 'It girl' Lara Bingle.  They married two years later, in May 2012, and welcomed daughter Kelsey in 2015.",
        "The Clarkes went on to divorce in February 2020 after a decade together.According to The Daily Telegraph last month, Michael has been spending time with Rique Miroshnik, the ex-wife of plastic surgeon Dr Michael Miroshnik. Michael's last relationship with interior designer Jade Yarbrough ended in flames.Extraordinary footage emerged in January of a heated exchange between the pair while they were on holiday in Noosa.In the video, which was filmed by an onlooker and sold to the press for $10,000, Jade accused Michael of cheating on her with his ex, fashion designer Pip Edwards, on December 17.",
        "All hell broke loose after Michael, Today show host Karl Stefanovic and his wife Jasmine - the sister of Jade - were having dinner at a beachside restaurant in Noosa with accountant Anthony Bell. ",
        "The video begins with Jade screaming at Michael before slapping him in the face and pushing him away after the cricketer insists he didn't cheated on her.'I'm wrong? I'm f**king wrong! You're a f***ing liar. I can see everything. You called her,' she screams, apparently referring to messages between Michael and Pip.Michael then tries to reassure Jade he didn't sleep with Pip on December 17, saying he was with his mate Anthony that night.'Baby, you're wrong, you're wrong,' he pleads. 'Baby, baby, Belly was at the house. I swear on my life, I swear on my life... That's not true, it's not true.'",
        "He then swears on his daughter Kelsey Lee's life he did not cheat on her.But Jade refuses to believe these desperate protests and claims she spoke to Pip.'You're f**king lying to me. You are a piece of s**t. I just spoke to her. What is wrong with you?' she says. Michael again denies sleeping with Pip and replies: 'No I didn't. You can hit me. That's not true, that's not true.'",
        "He appeared to have injured his hamstring in the melee as he was seen hobbling across the public park.Stefanovic's wife Jasmine eventually steps in and grabs her distressed sister by the arm and drags her away.A remorseful Michael later took full responsibility for what happened.'I'm absolutely gutted I've put people I hold in the highest regard in this position. My actions in the lead-up to this altercation were nothing short of shameful and regrettable,' he told The Daily Telegraph.'I am shattered that because of my actions I've drawn women of class and integrity, and my mates, into this situation.'"
    ]
}