{
    "articleURL": "/health/article-12051777/Scientists-toxic-metals-60-common-beverages.html",
    "content": [
        "Toxic metals are lingering in every store bought drink researchers testedFive products had higher levels than regulators would allow in drinking water READ MORE: Gender-bending chemicals are found in every day productsSodas, fruit juices and plant-based milk at your local grocery store may be packed with toxic metals, a study suggests.",
        "Researchers at Tulane University in New Orleans, Louisiana, found toxic metals such as arsenic and cadmium in all 60 store-bought drinks they tested. Five had 'dangerous levels' of the chemicals, with the worst offenders being juices, plant-based milks, teas and sodas.The scientists behind the study are warning parents to limit their children's consumption of store-bought drinks due to concerns the metals can disrupt their brain and organ development.",
        "'It was surprising that there aren't a lot of studies out there concerning toxic and essential elements in soft drinks in the United States,' Dr Tewodros Godebo, the study's lead author and environmental health scientist at Tulane, said. 'This creates awareness that there needs to be more study.'He continued: 'People should avoid giving infants and young children mixed-fruit juices or plant-based milks at high volume.'Arsenic, lead and cadmium are known carcinogens and well established to cause internal organ damage and cognitive harm in children, especially during early brain development.' Increased attention has been placed on contaminants in everyday goods in recent years. Mounting research shows that microplastics, metal toxins and other chemicals are all over everyday food and drink - usually due to contamination during the manufacturing process.Scientists fear that virtually every single person has been exposed and that there will be severe long-term health consequences.",
        "Tulane researchers, who published their findings in the Journal of Food Composition and Analysis, investigated dozens of goods that could be purchased at any grocery store.",
        "BPA is a chemical used in plastics and aluminum and present in a wide range of consumer products.",
        "Among the 60 products, 21 were either a soda or another artificial drink. Mixed fruit juices made up 19 of the drinks. There were also six natural fruit juices, 10 plant-based milks and four tea products.Researchers did not identify which brands they purchased for their studies.Samples of each drink were tested in a lab to identify the prevalence of 25 metals, including lead, potassium and uranium, among others.Each of the 60 drinks contained at least traces of some toxic metal. However, researchers say that these quantities were mostly safe.'These metals are naturally occurring so it's hard to get rid of completely,' Dr Godebo explained.Five drinks were identified as dangerous, though. These had levels of the metals found to be higher than what Government regulators would allow for drinking water.These included: one fruit juice; one mixed juice; one plant-based milk; one soda; and one tea.The fruit juice and mixed juice products contained elevated levels of boron, cadmium, strontium, arsenic and selenium.",
        "The milk had elevated levels of nickel, boron, cadmium, strontium and arsenic.In the soda, there were elevated levels of nickel, cadmium, strontium, arsenic and selenium.Finally, the tea was high in all seven of the chemicals: nickel, boron, cadmium, strontium, arsenic and selenium.While single exposure to these chemicals in one drink will now cause significant harm, each chemical comes with risks after long-term exposure.Arsenic is linked to damage of the eyes, skin, liver, kidneys and lungs. Over time it can lead to cancer in any of the organs or a loss of eyesight.Strontium is a radioactive chemical linked to blood cancers such as leukemia after significant exposure.The lungs, kidneys and skeleton are harmed by cadmium, which is liked to cancer, organ failure and brittle bones.Boron, manganese and nickel are each tied to damage to the liver, kidney and other organs. 'I don't think there needs to be fear,' Hannah Stoner, a Tulane student who contributed to the study, said. 'In toxicity, it's the dosage that often makes the difference so everything in moderation. But this creates awareness that there needs to be more study.' Researchers warn that it can be especially dangerous to younger people.The American Academy of Pediatrics warns that exposure to these metals at a young age is linked to 'problems with learning, cognition and behavior'."
    ]
}