{
    "articleURL": "/wires/ap/article-12060387/K-State-close-44-million-new-deal-Klieman.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - Kansas State and Chris Klieman are finalizing a new contract that would give the football coach a substantial pay raise while keeping him tied to the program for the next eight seasons, a person familiar with the deal told The Associated Press on Monday.",
        "The contract will have a total value of $44 million, making Klieman one of the better-paid coaches in the Big 12, according to the person, who spoke on condition of anonymity because signatures were still needed on paperwork to make it official. The agreement was first reported by ESPN.Klieman´s previous contract ended after the 2026 season, so the new deal adds four years to it. His average pay will go from $4 million annually to $5.5 million per year, or slightly more than Texas is paying coach Steve Sarkisian.The 55-year-old Klieman led the Wildcats to a Big 12 championship last season, beating TCU in the title game before the Horned Frogs went on to play in the College Football Playoff. It was the first conference title for K-State since 2012, when Hall of Fame coach Bill Snyder was in his second tenure in Manhattan, and a big breakthrough for the Wildcats.Klieman went 8-5 in his first season before slipping to 4-6 during the pandemic-shortened 2020 season. The Wildcats went 8-5 again the following year, winning the Texas Bowl, before going 10-4 last season with a Sugar Bowl loss to Alabama.Kansas State athletic director Gene Taylor has been aggressively pushed the school forward in its biggest revenue-producing sports. Along with hiring Klieman, Taylor also hired men's basketball coach Jerome Tang, and negotiations have begun on a new contract for him after leading the Wildcats to the Elite Eight of the NCAA Tournament during his first season.",
        "Kansas State has also invested heavily in the football program itself. It recently opened a new indoor training facility, and new artificial turf is currently being installed at Bill Snyder Family Stadium.The Wildcats lost All-American running back Deuce Vaughn and defensive player of the year Felix Anudike-Uzomah to the NFL from last year's team, but they return all five offensive linemen along with quarterback Will Howard. Their Big 12 title run last year has led to a solid recruiting class of both freshmen and transfers to fill the biggest holes on the roster.Kansas State opens the season Sept. 2 against Southeast Missouri State.___AP college football: https://apnews.com/hub/college-football and https://twitter.com/ap_top25."
    ]
}