{
    "articleURL": "/tvshowbiz/article-12055909/Kim-Kardashian-casual-cool-Adele-enjoys-date-night-Rich-Paul-2023-NBA-playoff-game.html",
    "content": [
        "Kim Kardashian showcased her casual sense of style as she joined celebrities such as Adele and her boyfriend, Rich Paul, at the Crypto Arena in Los Angeles amid the 2023 NBA playoffs on Saturday. ",
        "The SKIMS founder, 42, who reunited with  her 'gentleman' ex, Pete Davidson, at the MET Gala earlier on Monday, was spotted sitting court side to watch the LA Lakers vs. Golden State Warriors compete during round two, game three of the semi-finals. Grammy winner, Adele, 35, was seen sharing a laugh while enjoying date night with her partner and sports agent, Rich, whom she has been dating since 2021. The TV personality was spotted wearing a white, cropped tank top along with a pair of loose-fitting, light blue denim jeans with a hem that brushed the floor. The mother of four later added a semi-sheer, white raincoat for an edgy flare to her overall look for the anticipated game. ",
        "Kim slipped into a pair of closed-toed, light blue heels that coincided with the color scheme of her pants. Her dark brunette locks were parted in the middle, and slicked back into a chic up do to prevent any loose strands from falling onto her face. The media personality's makeup was glammed up for the big event, and comprised of a layer of mascara to her long lashes along with a bronze shadow around her eyes. A warm contour was added to better accentuate her cheekbones while a nude-colored, satin tint was worn on her lips, and bordered by a darker lipliner. ",
        "The Kardashians star accessorized her ensemble by wearing a silver-chained necklace but chose to not add any other pieces of jewelry. A silver handbag was placed on the floor near her feet to hold a few items she needed during the evening. As she sat court side, the beauty was seen holding a bag of Skittles and later conversing with a pal who sat next to her. Kim was seen earlier last month in April treating her seven-year-old son, Saint, to a front row seat at a star-studded 2023 NBA playoff game together.Her outing on Saturday comes shortly after the beauty attended the MET Gala in NYC earlier this week, where she reunited with her ex, Pete Davidson. ",
        "Despite splitting last year in August, a source informed Entertainment Tonight the two stars 'enjoyed' crossing paths. 'They both really respect each other and there are zero hard feelings.'The insider further revealed, 'He knows Kim was looking to have fun when they dated, and he was totally fine with it. He also enjoyed their time together.' Other celebrities were also in attendance to watch the NBA playoff game on Saturday, which resulted in the Los Angeles Lakers beating the Golden State Warriors with a winning score of 127 to 91. Adele put on a fashionable display wearing a pair of tan-colored, loose-fitting trousers along with a matching button up that was left partially unfastened at the collar. ",
        "The Grammy winner slipped into a pair of black, open-toed heels for a bit of color contrast to her monochromatic ensemble. Her locks were parted in the middle and effortlessly flowed down naturally past her shoulders. The British-born singer accessorized her look with gold-hooped earrings along with an assortment of bracelets on each of her wrists and silver and gold-chained necklaces. The Rolling In The Deep hitmaker happily sat next to her boyfriend, Rich Paul, who also represents pro NBA player of the LA Lakers, LeBron James. The two lovebirds were previously spotted at a playoff game earlier last week together. ",
        "The sports agent opted for casual comfort wearing a black tracksuit that contained a green outline. He also added a plain white shirt underneath the outfit. He slipped into a pair of colorful sneakers and added a blue watch on his left wrist to complete his look for the game. The couple posed for a cute photo at the event and were also seen cheering during the festivities. The songstress was previously married to Simon Konecki, and shares son, Angelo, 10, with her ex-husband. Sitting next to the Set Fire To The Rain singer was actress, Nia Long, who is known for roles in projects such as Big Momma's House and most recently, You People. ",
        "She opted for a pair of comfy, white trousers and tucked in a white shirt into the waist of the pants. The star layered the outfit with a denim jacket and slipped into  pair of fuzzy, open-toed heels. The trio were spotted conversing together and having a blast as they sat front row at the big game. Leonardo DiCaprio was also spotted in the crowd, and kept a low profile sporting an all-black ensemble that consisted of black jeans along with a plain, black T-shirt and a jacket layered on top. The Titanic actor, who recently attended the same MET Gala after party as Gigi Hadid amid romance rumors, added a black Lakers cap to show his support for the LA-based team. ",
        "He added a black face mask which he kept on once he was seated inside the arena. Filmmaker and singer, Rob Zombie, was seen seated among the sports fans and wore a black puffer jacket along with a cap that had the words, 'Sad World,' printed on the front. The Halloween director threw on a pair of see-through, brown shades to complete his look for the game. Kevin Hart, who revealed earlier this week that close friend, Jamie Foxx, was 'getting better' after suffering a medical emergency in April, was seen cheerfully sitting next to his wife, Eniko. ",
        "The comedian donned a pair of black pants and a dark navy flannel while his wife, whom he tied the knot with in 2016, put on a stylish display wearing a denim, Prada cropped top and fashionable black pants. Creed actor, Michael B. Jordan, appeared to be having a blast sporting gray-striped pants and a short-sleeved, printed shirt. The star slipped into a pair of black and white, Air Jordan sneakers and added silver-chained necklaces along with gold and silver bracelets around his wrists. Wheel Of Fortune host, Pat Sajak, was seen also enjoying court side seats wearing a striped button up and dark-gray pants. He added a blue and tan-colored jacket to layer his look and also slipped into a pair of brown leather loafers. ",
        "Hollywood actors, Andy Garcia and Don Cheadle, were seen catching up and paused for a memorable photo together inside the arena. The Untouchables actor wore a pair of classic blue jeans along with a tan-colored button up and dark brown jacket. He threw on a scarf that was loosely wrapped around his neck. The Iron Man star opted for a monochromatic look that comprised of dark trousers along with a black hoodie and jacket. Woody Harrelson excitedly viewed the game from the audience wearing a tan-colored jacket and a black cap that covered his locks. ",
        "Before the playoff match commenced, a number of celebrities were seen arriving to the Crypto Arena in the heart of Downtown Los Angeles on Saturday. Oscar winner, Dustin Hoffman, was seen strolling towards the venue wearing black pants along with a white shirt and puffer jacket to stay warm in the cooler weather. Leonardo was also spotted making his way inside and kept his head low as he walked through the crowds. At one point, he was seen taking a quick call once he was inside the lobby of the arena.  ",
        "Michael Keaton was seen also arriving to the playoff game on Saturday wearing a pair of cream-colored trousers along with a white T-shirt and a dark navy cardigan with a white and gold trim. He was seen holding hands with possibly his grandson, who sported a Lakers shirt, and guided him through the crowds. Blurred Lines singer, Robin Thicke, was seen strolling next to his partner of nearly ten years, April Love Geary. The two lovebirds, who have been romantically linked since 2014 and share three children, both opted for all-black ensembles to attend the game. Outer Banks actress, Madelyn Cline, cut a casual figure in a pair of denim blue jeans along with a white shirt and a long-sleeved, brown sweater to keep her warm in case she grew chilly. ",
        "Lead vocalist of Red Hot Chili Peppers, Anthony Keidis, acknowledged fans while sporting Los Angeles Lakers gear, such as a cap, shirt and jacket with Woody Harrelson following close behind. The Zombieland actor was seen holding the tan-colored jacket that he opted to wear inside the arena in his hand, showing off a white button up with floral details on the fabric. Kevin Hart and his wife, Eniko, were also spotted walking towards the venue, and the actor laid his hand gently on her back as he lovingly guided her through the crowd. Michael B. Jordan held a smile on his face while carrying his smartphone in his right hand before entering the arena to watch the Lakers vs. Warriors game on Saturday.  "
    ]
}