{
    "articleURL": "/news/article-12054265/Biden-80-mocked-saying-hes-best-2024-candidate-hes-experienced-candidate-EVER.html",
    "content": [
        "President Joe Biden has been mercilessly mocked for claiming he's the best candidate for 2024 because he has the most experience 'I have acquired a hell of a lot of wisdom and know more than the vast majority of people,' he told MSNBC’s Stephanie Ruhle on Friday He also praised his VP Kamala Harris, called Speaker Kevin McCarthy an 'honest man,' and slammed Donald Trump for 'ballooned the debt'  Joe Biden has been mocked for trying to turn his advancing years into a positive by claiming he's the most experienced presidential candidate ever.",
        "Biden - who at 80 is the oldest man ever to occupy the White House - says he is worthy of a second term in office because he 'knows more than the vast majority of people.' The president gave liberal network MSNBC a very rare interview Friday, and when asked why he should be re-elected when a Fortune 500 company would never hire an 82 year-old CEO, said: 'Because I've acquired a hell of a lot of wisdom'.'I'm more experienced than anybody's ever run through the office,' he told the outlet. 'I think I've proven myself to be honorable as well as also effective.' He also praised his VP Kamala Harris - whose polls continue to crater - and claimed she hasn't 'gotten the credit she deserves.'Ruhle pointed out that Biden's toughest critics are speculating that he's 'elevating her because they think you wouldn’t serve a full term.' Harris is seen as a particularly weak link of the Biden administration, and the prospect of her taking over from the president if he is unable to complete a second term is likely to be exploited by GOP rivals. ",
        "Ruhle, however, wasn't done questioning Biden about his push to keep Kamala's image at the front of his campaign, as he showed her 10 times in his bid announcement video. She commented: 'When Obama was in that position, he didn’t mention you, sir.' ",
        "Once again, Biden blew it off, simply stating at he and Obama were 'good friends' and they have 'slightly different style of how we do things.' Twitter was quick to alight with Republicans and critics' comments on Biden's claim, with one writing: 'Heard Joe say he knows more than the vast majority of people' with 21 laughing emoji faces. One man just posted nine laughing emojis as a response.  Another called the president an 'egomaniac-out of control/crook not qualified to do anything in government. Not even dogcatcher.' 'If the last 2 years are the result of acquired wisdom, then the word no longer has any meaning,' one man wrote. Another accused of acquiring a 'lot of power.' 'What fantasy world are you living in? Trump is a hell of a lot better. President Joe Biden ever be he’s more competent. He knows what the hell he’s saying and what he’s doing. Donald Trump is the is the true president of this country,' William Lane wrote. ",
        "'Lies lies and more lies, and now doctored data from Joe Biden and his pathetic Administration. Roll on President Trump being back in office to fix the mess Joe Biden has done in the past 2 years. God knows what mess it’s gonna in another 2 years of Pedo Joe Bidens management,' Stanley Youngson wrote on the popular social media platform. ",
        "Biden also defended his administration after he was accused of not wanting to 'play ball' like Trump. Trump has also announced plans to run again in 2024, and is currently hammering likely Republican rival Ron DeSantis in the polls.  'Played ball, what?' he said outraged. '[Trump] ballooned the debt he created...When I came to office, we had an incredibly high unemployment rate, we're in a situation where we were had very little movement on anything going on, and look at the employment rate right now. Just today 250,000 new jobs, highest participation in 75 years of women in the job market, lowest unemployment rate for African Americans. 'Things are moving,' he said. He also claimed he cut the national debt by 1.7trillion dollars.'[That's] more than anyone's ever done in history,' he told Ruhle. The president also called House Speaker Kevin McCarthy an 'honest man.' ",
        "'I think he's in a position though he had to make a deal,' he said. 'Fifteen votes, that where he just about sold away everything.'There's a Republican party and there's the MAGA Republicans and the MAGA Republicans really have put him in a position where in order to stay speaker he has to agree - he's agreed to things that maybe he believed but are just extreme.' However, Biden does believe he can get things done in his second term, despite the MAGA lawmakers. ",
        "Biden announced his campaign on April 25 with the slogan: 'Let's Finish the Job.' He formally announced his re-election bid in a three-minute video that incorporated footage from January 6 and abortion protests, attacked 'MAGA Republicans,' and highlighted his time in the White House as he appealed to voters to 'finish this job.'The 80-year-old has thrown his hat into the ring despite mounting questions about his age - which will be 86 at the end of his second term - dire polls, and concern from his own party over whether he is the best candidate.The Democrat confirmed Kamala Harris will be by his side again as his running mate and attacked 'MAGA Extremists' for wanting to take 'bedrock freedoms away', cut Social Security and to give tax cuts to the wealthy.",
        "He also took aim at Marjorie Taylor Greene and Republicans for wanting to ban books, dictate 'health care decisions women can make' and tell 'people who they can love'.He did not mention his Republican rivals by name. But, as he spoke, footage of Rep. Greene appeared on screen as did images of Donald Trump and Ron DeSantis with their arms around each other. The two men are considered the top two contenders for the Republican nomination.Trump currently leads in the polls and that sets up a potential rematch between him and Biden. The president echoed many of his 2020 campaign themes in his announcement video - including a focus on the 'battle for democracy' - in a sign Biden and his team think Trump may be their competition in the general election.",
        "'Every generation has a moment where they have had to stand up for democracy. To stand up for their fundamental freedoms. I believe this is ours,' Biden said the video that was posted on his social media channels on Tuesday morning.'That's why I'm running for reelection as President of the United States. Join us. Let's finish the job,' he said. "
    ]
}