{
    "articleURL": "/wires/reuters/article-12044027/Tennis-Alcaraz-downs-Khachanov-reach-Madrid-semis-flawless-Swiatek-through.html",
    "content": [
        "By Fernando Kallas",
        "MADRID, May 3 (Reuters) - World number two Carlos Alcaraz stayed on course for his fourth title of 2023 by powering into the semi-finals of the Madrid Open with a 6-4 7-5 win over Russian Karen Khachanov on Wednesday.Defending his title from last year, Alcaraz will be looking to celebrate his 20th birthday on Friday with a win against either Croatian Borna Coric or surprise German qualifier Daniel Altmaier in his sixth Masters 1000 event semi-final.Alcaraz managed to break the Russian's serve in the seventh game, closing the first set 6-4.However, the Spaniard began the second set a little distracted and allowed Khachanov to open up a 4-1 lead before he woke up to fight back and win the match in under two hours.\"Winning this match gives me a lot of confidence,\" Alcaraz said.\"Karen had been playing at a high level and took me to the limit, it was decided by small details.\"I will train for Friday, but with a lot of tranquillity and calm, I will not be overwhelmed and I have to be fresh.\"Alcaraz has reached 18 consecutive wins in Spanish clay-court tournaments since losing to Rafael Nadal in Madrid two years ago.His winning percentage overall on clay is already the third best since 2010 (82.3%), behind only Nadal and Novak Djokovic.",
        "SWIATEK THRASHES MARTICIn the women's singles, world number one Iga Swiatek showed her clay-court dominance after she beat Petra Martic 6-0 6-3 later on Wednesday.Swiatek will face Veronika Kudermetova for a place in the final after the Russian beat American Jessica Pegula 6-4 0-6 6-4 and reach the Madrid Open semis earlier.\"I think it was a pretty solid and clean performance,\" Swiatek told a news conference.\"I'm pretty happy with the way I focused. I was pretty consistent with my tactics and I think it paid off.\" (Reporting by Rohith Nair in Bengaluru; Editing by Hugh Lawson and Christian Radnedge)"
    ]
}