{
    "articleURL": "/news/article-12047305/Is-Aldi-open-coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        "Aldi opening times on coronation day and bank holiday Monday revealed Ahead of King Charles' coronation, popular low-cost supermarket Aldi has revealed its opening hours for the upcoming Bank Holiday. ",
        "Different opening hours may be in place at your closest Aldi branch, depending upon its size and location. It is the second Bank Holiday to fall in May 2023, after the traditional early May Bank Holiday for Labour Day on 1 May. So, will Aldi be open on coronation day? Will hours change due to the occurrence of another Bank Holiday? Read on below for everything you need to know about Aldi opening times over the coronation weekend. ",
        "Will Aldi be open on coronation day? The supermarket chain will operate regular opening hours on Saturday, 6 May, when King Charles will be officially crowned as the reigning monarch of the United Kingdom. Stores will open at 8am and close at 10pm.  With more than 990 stores, the German chain is one of the most popular supermarkets in the UK. Ahead of the coronation, Aldi has asked shoppers to double check before heading to their local Aldi as the opening times for some stores may vary. Click here to view the Aldi store finder. Is Aldi open on bank holiday? On Monday, 8 May, Aldi's stores will be open between the hours of 8am and 8pm.Opening hours may vary depending on store location. The low-cost supermarket advises customers to head to its store finder to check local store opening times.Indeed, recent data shows that Aldi has focused on opening new stores in more affluent areas of the country. ",
        "In 2017 more than half (54 per cent) of Aldi and Lidl's new store openings were in areas classed as 'below average affluence' according to econcomic census data. ",
        "Figures released in April 2023 showed that, for the first time ever, Aldi now has more than 10 per cent of the grocery market making it one of the 'Big Four', replacing Morrisons. Maximise UK CEO David Haywood said shifting towards middle-class areas would make it harder to find new sites as they encroached on the catchments of traditional supermarkets.'The tables clearly show how both are moving away from the traditional discount catchments.'The issue associated is that you face higher levels of competition and higher branch development costs. This will place pressure on the discount model and branch opening opportunity."
    ]
}