{
    "articleURL": "/wires/aap/article-12054803/Petroleum-tax-changes-help-Australia-track.html",
    "content": [
        "The treasurer has called for the parliament to support the overhaul of the petroleum resource rent tax that he says will make a meaningful contribution to the budget.",
        "Jim Chalmers on Saturday announced changes to the contentious tax settings for oil and gas producers, including a cap on deductions from July 1 to give Australians a \"fairer return\" from LNG projects.The cap will limit the proportion of petroleum resource rent tax-assessable income that can be offset by deductions to 90 per cent.\"It's been clear for some time that the (petroleum resource rent tax) isn't up to scratch,\" Dr Chalmers said in a statement.\"These changes will make a meaningful contribution to the budget that we hand down on Tuesday night, helping to support our efforts to get the nation's finances back on track, fund vital services and provide responsible cost-of-living relief.\"The changes are slated to increase tax receipts by $2.4 billion over the forward estimates, the government said.Dr Chalmers said the government aimed to strike a balance between getting a better deal for Australian resources and protecting investment, supply and international relationships.The peak body for oil and gas producers agreed the government had considered both the sustainability of the budget and the need to support the gas sector.\"The announcement today will provide greater certainty for our industry to consider the future investment required to maintain both domestic and regional gas supply security for our customers,\" Australian Petroleum Production &amp; Exploration Association chief executive Samantha McCulloch said.",
        "Asked if the Greens and other crossbenchers needed to pass the tax changes through parliament were likely to approve the $2.4b revenue lift given the scale of profits earned by the gas industry, Dr Chalmers said he hoped the parliament would support it.\"My message to the Greens in the Senate is, if they vote against this, they're voting for lower taxes from these projects,\" he told ABC News.The opposition has not ruled out their support but has raised concerns about Labor's track record on amendments to the tax.Shadow treasurer Angus Taylor said the \"devil would be in the detail\" and Labor had a concerning track record when it came to changing tax settings on the resources sector.\"I'm not going to comment until we've seen the detail,\" he told ABC Insiders.Dr Chalmers said the coalition would be \"dealing the Greens in\" by voting against the changes.\"And that's not what the industry wants.\"The treasurer also said the changes would not push up electricity or gas prices for households.\"We have gone through a lot of consultation, we have considered this,\" he said.Independent economist Chris Richardson, of Rich Insight, said the changes were welcome but modest.Mr Richardson took to Twitter to explain the policy tweaks were not focused on reforming how the mechanism captures rents, which are the extra profits companies make from selling a nation's natural resources.",
        "\"Rather, they've limited the deductions available under this tax ... the way to think of this reform is that the government has adopted a type of minimum tax,\" he said.\"Bottom line? A welcome policy change, even if more modest than I'd have liked to see,\" he concluded.The federal government also announced an extra $4b to help pay the wages bill for government and community organisations.The changes will see the five-year averaging of the wage component of indexation removed so funding better reflects changes in economic conditions."
    ]
}