{
    "articleURL": "/wires/ap/article-12043997/Senate-vote-solar-tariffs-prairie-bird-protections.html",
    "content": [
        "WASHINGTON (AP) - The Senate approved a measure Wednesday that would reinstate tariffs on solar panel imports from several Southeast Asian countries after President Joe Biden paused them in a bid to boost solar installations in the U.S.",
        "Lawmakers also approved a separate plan to undo federal protections for the lesser prairie chicken, a rare grouse that´s found in parts of the Midwest and Southwest, including one of the country´s most prolific oil and gas fields.The two measures are part of efforts by newly empowered Republicans to rebuke the Democratic president and block some of his administration's initiatives, particularly on the environment. Republicans control the House and have strong sway in the closely divided Senate, where California Democratic Sen. Dianne Feinstein remains out for health reasons and conservatives such as Sen. Joe Manchin, D-W.Va., often side with the GOP.Congress voted earlier this year to block a clean water rule imposed by the Environmental Protection Agency and a separate Labor Department measure that allows retirement plan managers to consider the effects of climate change in their investment plans. Biden vetoed both legislative measures.The solar tariffs measure was approved, 56-41, and now goes to the White House, where Biden has vowed to veto it. Nine Democrats, including Manchin, supported the measure, while Kentucky Sen. Rand Paul was the only Republican who opposed it.The measure to undo the bird protections was approved 50-48 and now goes to the Republican-controlled House, where there is strong support for the plan. Manchin was the only Democrat to back the repeal of protections for the threatened bird.",
        "The Senate action follows a House vote last week to reinstate fees on solar panels imported from Asia. Lawmakers from both parties have expressed concerns about what many call unfair competition from China.Some U.S. manufacturers contend that China has essentially moved operations to four Southeast Asian countries - Thailand, Vietnam, Malaysia and Cambodia - to skirt strict anti-dumping rules that limit imports from China.Biden paused the tariffs last year amid complaints from the solar industry that the threat of up to $1 billion in retroactive tariffs and higher fees had led to delays or cancellations of hundreds of solar projects across the United States. Solar installations are a key part of Biden's agenda to fight climate change and achieve 100% clean electricity by 2035.The White House said Biden´s action was \"necessary to satisfy the demand for reliable and clean energy\" while providing \"certainty for jobs and investments in the solar supply chain and the solar installation market.´´A Commerce Department inquiry last year found likely trade violations involving Chinese products and recommended steep penalties. Biden halted tariffs for two years before the Commerce investigation was completed. The White House has said Biden will not extend the tariff suspension when it expires in June 2024.The U.S. industry argues that solar panel imports are crucial as solar installations ramp up to meet increased demand for renewable energy. Less than 30% of solar panels and cells installed in the U.S. are produced here, although that number is increasing as U.S. manufacturers take advantage of tax credits included in the landmark climate law adopted last year.",
        "But Sen. Rick Scott, R-Fla., said tariffs were needed to hold China accountable while protecting U.S. jobs and workers.\"It´s disgusting that Biden´s actions would shield Chinese solar companies - many of which are using child and slave labor - and allow them to circumvent U.S. trade laws,'' Scott said in a statement. \"We need to be taking every step possible to hold Communist China and these companies accountable for breaking U.S. law.''Sen. Roger Marshall, R-Kan., sponsored a separate measure repealing federal protections for a rare prairie bird that´s found in parts of the Midwest and Southwest, including one of the country´s most prolific oil and gas fields.The lesser prairie chicken´s range covers a portion of the oil-rich Permian Basin along the New Mexico-Texas state line and extends into parts of Colorado, Oklahoma and Kansas. The habitat of the bird, a type of grouse, has diminished across about 90% of its historical range, officials said.The crow-size, terrestrial birds are known for spring courtship rituals that include flamboyant dances by the males as they make a cacophony of clucking, cackling and booming sounds. They were once thought to number in the millions, but now hover around 30,000, according to the U.S. Fish and Wildlife Service.Environmentalists have long sought stronger federal protections for the bird, which they consider severely at risk due to oil and gas development, livestock grazing and farming, along with roads and power lines.",
        "Marshall and other Republicans say greater protections aren´t needed and that the government instead should rely on voluntary conservation efforts already in place.\"Farmers, ranchers, and others in Kansas and the region have been instrumental in the recovery of the species to this point, while the climate activists demanding (federal protections under the Endangered Species Act) have no understanding of the threat it poses to Kansas´s economy, especially the energy and ag industries,'' Marshall said in a statement.Lew Carpenter, director of conservation partnerships with the National Wildlife Federation, said voluntary efforts are not enough.\"We hope partisan politics will not put a halt to federal efforts to recover one of our region´s iconic birds. And recovery means recovery of the habitat, too,'' said Carpenter, who also serves as vice president of the North American Grouse Partnership, a Colorado-based conservation group.The League of Conservation Voters said the Senate vote \"sets a disastrous precedent\" that could put the prairie bird and other endangered species \"at risk of disappearing forever.''Sen. Jacky Rosen, D-Nev., said reinstating solar tariffs would jeopardize 30,000 jobs nationwide, including thousands in Nevada, which has the nation's most solar jobs per capita.\"Enacting retroactive tariffs on imported solar panels and cells will absolutely kill the American solar industry, and it will kill any chance we have to meet our climate goals, and it will kill the current American solar jobs,\" Rosen said."
    ]
}