{
    "articleURL": "/wires/pa/article-12047371/Former-Proud-Boys-leader-Enrique-Tarrio-guilty-role-Capitol-riots.html",
    "content": [
        "Former Proud Boys leader Enrique Tarrio was convicted on Thursday of orchestrating a plot for members of his far-right extremist group to attack the US Capitol in a bid to keep Donald Trump in power after the Republican lost the 2020 presidential election.",
        "A jury in Washington DC found Tarrio guilty of seditious conspiracy after hearing from dozens of witnesses over more than three months in one of the most serious cases brought in the stunning attack that unfolded on January 6 2021, as the world watched on live TV.It is a significant milestone for the Justice Department, which has now secured seditious conspiracy convictions against the leaders of two major extremist groups that prosecutors said were intent on keeping Democrat Joe Biden out of the White House at all costs. The charge carries a prison sentence of up to 20 years.Tarrio was a top target of what has become the largest Justice Department investigation in American history. He led the neo-fascist group – known for street fights with left-wing activists – when Trump infamously told the Proud Boys to “stand back and stand by” during his first debate with Biden.Tarrio was not in Washington on January 6 because he had been arrested two days earlier in a separate case and ordered out of the capital city. But prosecutors said he organised and directed the attack by Proud Boys who stormed the Capitol that day.Prosecutors told jurors the group viewed itself as Trump’s army and was prepared for “all-out war” to stop Biden from becoming president.",
        "The Proud Boys were “lined up behind Donald Trump and willing to commit violence on his behalf”, prosecutor Conor Mulroe said in his closing argument.The backbone of the government’s case was hundreds of messages exchanged by Proud Boys in the days leading up to January 6 that show the far-right extremist group peddling Mr Trump’s false claims of a stolen election and trading fears over what would happen when Biden took office.As Proud Boys swarmed the Capitol, Tarrio cheered them on from afar, writing on social media: “Do what must be done.”In a Proud Boys encrypted group chat later that day, someone asked what they should do next. Tarrio responded: “Do it again.”“Make no mistake,” Tarrio wrote in another message. “We did this.”Defence lawyers denied there was any plot to attack the Capitol or stop Congress’ certification of Biden’s win. A lawyer for Tarrio sought to push the blame onto Trump, arguing the former president incited the pro-Trump mob’s attack when he urged the crowd near the White House to “fight like hell.”“It was Donald Trump’s words. It was his motivation. It was his anger that caused what occurred on January 6 in your beautiful and amazing city,” attorney Nayib Hassan said in his final appeal to jurors.",
        "“It was not Enrique Tarrio. They want to use Enrique Tarrio as a scapegoat for Donald J Trump and those in power.”In addition to Tarrio, a Miami resident, three other Proud Boys were convicted of seditious conspiracy: Ethan Nordean, Joseph Biggs and Zachary Rehl.Jurors have not yet reached a unanimous verdict on the sedition charge for fifth defendant: Dominic Pezzola. The judge told them to keep deliberating.Nordean, of Auburn, Washington, was a Proud Boys chapter leader. Rehl led a group chapter in Philadelphia. Biggs, of Ormond Beach, Florida, was a self-described Proud Boys organizer. Pezzola was a group member from Rochester, New York.The Justice Department had not tried a seditious conspiracy case in a decade before a jury convicted another extremist group leader, Oath Keepers founder Stewart Rhodes, of the Civil War-era charge last year.Over the course of two Oath Keepers trials, Rhodes and five other members were convicted of seditious conspiracy for what prosecutors said was a separate plot to forcibly halt the transfer of presidential power from Trump to Biden.Three defendants were acquitted of the sedition charge, but convicted of obstructing Congress’ certification of Biden’s electoral victory.The Justice Department has yet to disclose how much prison time it will seek when the Oath Keepers are sentenced next month."
    ]
}