{
    "articleURL": "/sport/football/article-12055127/Rafa-Benitezs-warning-Pep-Guardiolas-ahead-semi-final-against-Real-Madrid.html",
    "content": [
        "Manchester City face Real Madrid in the Champions League on Tuesday nightBenitez views City's chief vulnerabilities as set pieces and quick counter attacksHe says Vinicius, Benzema and Kroos will pass the ball around City and pressIn the UEFA conference rooms at Nyon, where the modernist, architecturally-striking confederation headquarters overlook Lake Geneva and the spectacular panorama of the Chablais Alps, Carlo Ancelotti and Rafa Benitez often share a moment. It is a setting as serene as the Atakturk Stadium, Istanbul was wild, passionate and unhinged on a May night eighteen years ago.",
        "Benitez says such moments are for small talk, chat about the game in general. The pair meet at UEFA coaches' conventions but have never actually fully dissected what occurred in perhaps the greatest Champions League final of all, the victory of Benitez's Liverpool over Ancelotti's AC Milan on penalties, after Liverpool recovered from 3-0 down at half-time.Ancelotti can joke about the game now — he had his revenge, his AC Milan beating Benitez's Liverpool in the 2007 final in Athens — but when the pair talk, the game only comes up in passing.'We agree on one thing: they were better in Istanbul and we were better in Athens!' Such is the perversity of football.Ancelotti and Benitez share that bond forever and in the week in which Pep Guardiola's Manchester City go up against Ancelotti's Real Madrid, in what feels like European football's match of the season, it seems a good time to revisit old stories. After all, Benitez had a decent Premier League record at Newcastle against Guardiola's City: W1 D1 L3.",
        "And his duels with Ancelotti were among the greatest. The half-time team talk in Istanbul should, judging by the second-half performance, have been the greatest display of oratory since Winston Churchill declared Britain would never surrender. And yet truth is never as prosaic as legend.",
        "Benitez was more worried about his English at the time — he had only been in the country a year — and was busy making notes to ensure he communicated the correct message after seeing his side go 2-0 down on 39 minutes. 'I was writing my notes — 'Stay calm! Fight for it! Believe! — and then we conceded the third goal!' he recalls.He subbed Djimi Traore, who endured a wretched first half, for Dietmar Hamann but then had to send an assistant to retrieve Traore from the shower when he realised Steve Finnan was injured and couldn't carry on.He also wanted also to bring on Djibril Cisse until reminded that would leave him with no more subs, Harry Kewell having come off injured. His team talk ended up with 10 names on the whiteboard, having inadvertently left off Luis Garcia in the confusion.But for all that, the players have since noted just how calm Benitez was that night. 'If you are nervous and anxious, you can see the manager doesn't believe what he is saying. And I have to believe. The main thing was to stay calm, to change the shape of the team. We had started the game more attacking, the idea was not to play short and gradually grow in confidence. But we conceded a goal in the first minute… Then I was thinking, 'Maybe we will need Plan B!' Then three goals… 'Maybe Plan C!'",
        "All this is said with the earnest understatement of a professional coach rather than a raconteur looking for laughs. Benitez's ability to be deadpan amidst chaos — to keep his head when all about him were losing theirs — is his super power.Other than the bond forged that night, Ancelotti and Benitez are coaching twins of a kind, a difference that will be evident at the Bernabeu on Tuesday night.",
        "The most influential figures in modern European football are Arrigo Sacchi, the great AC Milan coach, winner of the 1989 and 1990 European Cups, and Johan Cruyff, the celebrated player and coach of Barcelona and winner of the 1992 European Cup.Ancelotti was Sacchi's key midfielder in that great Milan side, while Guardiola was Cruyff's pivot in the team that was playing an entirely different style but would become as revered and influential.Benitez, meanwhile, was a youth team coach at Real Madrid, his own playing career curtailed by injury. And as Madrid man, it was to Sacchi's ground-breaking team he looked to rather than Catalan rivals in La Liga.'Sacchi changed everything with the way AC Milan played with intensity, pressing, aggression,' says Benitez. He recalls the 1989 European Cup semi-final, watching Ancelotti fly through the Real Madrid midfield and score in a 5-0 win.",
        "'They were so much better than Real and we were the top team in Spain. But AC Milan controlled everything. I was watching 20 AC Milan games, taking notes of every detail I could find. Later I would go to AC Milan when Fabio Capello was there. I would see Sacchi when he was in charge of the Italy national team.'Meanwhile, a very different revolution was ongoing at Barcelona, Cruyff instilling the ideas of his 1970s Dutch team and Total Football, with Guardiola at its helm, giving much more latitude to players to improvise and play with more width.'At the time, Camp Nou was 72metres wide and Cruyff had Michael Laudrup and Hristo Stoichkov in the wide areas and Romario in the middle, so it was very difficult to defend against,' says Benitez. 'In defence, they had Ronald Koeman in the middle and Albert Ferrer right and Juan Carlos left. The two full backs were going man to man and Koeman was doing zonal.'From these two revolutions in style emerged the game we watch today, with Ancelotti and Guardiola being its most visible heirs. From Cruyff we have inherited 4-3-3, playing out from the back and the use of wide players as attackers; from Sacchi, the back four and zonal marking all over the pitch. On Tuesday night, inflections of those two great teams will be evident.",
        "'Normally Manchester City will have possession because they have this style of football. And when you play against a team with much possession, you have to defend well and play on the counter attack,' says Benitez.Certainly this has been the Ancelotti way against Guardiola, over whom he has a great record in the Champions League. It isn't just last year's stunning semi-final victory over Manchester City, where Madrid were 5-3 down on aggregate going into the 90th minute of the second leg and ended up winning 6-5. There is also Ancelotti unpicking Guardiola's Bayern Munich in the 2014 semi-final, winning the first leg at home 1-0 with 28 per cent possession and then killing the tie with three goals in the first 34 minutes in Munich, eventually winning 4-0 there.Benitez views City's chief vulnerabilities as set pieces and quick counter attacks, exploiting the space behind the defenders that a Guardiola team on the offensive can often leave.'A team that has plenty of possession normally won't have four or five big lads. What they have is dynamic players, good on the ball. City players are good in the air but are not very big, so if you have two or three big lads, you have a chance. 'But when you are Real Madrid you also have quality to keep the ball as well as playing counter attack. You can alternate. With Vinicius, Karim Benzema and Toni Kroos you can pass the ball and also press. And if you can find Benzema in between the lines or Vinicius behind defenders, you can play counter attack.'",
        "Of course, Guardiola now has a weapon that wasn't previously in his armoury: Erling Haaland. 'With Haaland he has someone who is capable to link play but is more dangerous when he has space in behind and can use the counter attack. Now they have a striker who can run behind defenders and head the ball, so they can be threat in both ways,' he says.Yet for all that, here is one stat that towers above the rest: Real Madrid 14 European Cups and Champions League trophies against Manchester City's zero. When it matters, they find the big performances.'When I was coach at Real Madrid in 2015, one of the players said to me: 'We will give our best in February [when the Champions League starts again],' says Benitez. 'They know in the domestic league they will win the majority of games but when they have to compete for the big trophies, they have to give everything. Ever since I was a kid at Real in youth teams, finishing second was a disaster. That mentality goes through all the teams.'"
    ]
}