{
    "articleURL": "/sport/football/article-12060991/Cristiano-Ronaldo-pushes-member-Al-Khaleej-backroom-staff-tried-selfie-him.html",
    "content": [
        "Cristiano Ronaldo appeared to push a member of staff who tried to take a selfie It was a disappointing day for Ronaldo, who had a goal ruled out for offside Cristiano Ronaldo pushed a member of the opposition's backroom staff away after they tried to take a selfie with him following Al-Nassr's 1-1 draw with Al-Khaleej.",
        "After the game Ronaldo was inundated with requests from Al-Khaleej players and staff for his shirt and the Portuguese star ended up giving it to one player.However, he didn't react so kindly when a member of the Al-Khaleej backroom staff attempted to take a selfie with him and ended up pushing the individual away.It was a frustrating day for Ronaldo, with the result denting Al-Nassr's hopes of winning the Saudi Pro League title.Ronaldo had a goal ruled out for offside during the game and his team find themselves five points adrift of leaders Al-Ittihad.",
        "Fabio Martins had put relegation-threatened Al Khaleej in the lead after just four minutes before Alvaro Gonzalez equalised for Al-Nassr in the 17th minute. The next game for Ronaldo's side sees them take on Al-Ta'ee away from home on May 16.Since his move to Al-Nassr Ronaldo has scored 12 goals in 13 league appearances, although reports suggest that the five-time Ballon d'Or winner is looking to leave his new club. However, it now seems Real Madrid are willing to offer Ronaldo a non-playing role as an ambassador, according to El Nacional.The Spanish outlet said: 'Florentino Perez has guaranteed that [Ronaldo] will not lack work at the Santiago Bernabeu.'But, obviously, he wouldn't do it to be a player, because he considers that it is a cycle that should be considered closed.'",
        "Ronaldo's partner Georgina Rodriguez is also said to be yearning for a return to the Spanish capital where the couple met.Ronaldo is a club legend at Real Madrid, having scored 451 goals in 438 appearances during his time at the Bernabeu. ",
        "Should the Portugal star remain in Saudi Arabia, he could find himself lining up against his long-term rival Lionel Messi, with the Argentina international considering a £320million-a-year offer from Al-Hilal.Messi is set to leave Paris Saint-Germain this summer and could be joined at Al-Hilal by his former Barcelona team-mates Sergio Busquets and Jordi Alba. It as confirmed earlier in May that the Argentine would be leaving the French giants at the end of the campaign, before he took an authorised trip to Saudi Arabia. The World Cup winning captain had already signed a £25m-a-year ambassadorial agreement with the county. "
    ]
}