{
    "articleURL": "/sport/football/article-12059741/Erik-ten-Hag-gives-Manchester-United-stars-TWO-days-training-following-West-Ham-defeat.html",
    "content": [
        "Erik ten Hag has reportedly given his Man United players two days to restUnited produced a poor showing as they were beaten by West Ham on SundayPlayers will be given time to recharge ahead of upcoming clash with Wolves Erik ten Hag is reportedly giving his fatigued Manchester United stars two days off for rest and recovery following their hectic schedule of matches over the last few months.",
        "United looked tired in Sunday's away defeat to West Ham that saw David de Gea's error gift Said Benrahma the game's only goal as the Hammers moved seven points clear of the relegation zone.Ten Hag has previously punished underperforming players with gruelling running drills in training as he did following Brentford's 4-0 battering earlier in the season that saw the team hauled into Carrington to make up the ground they failed to cover in the defeat.However, the Dutchman has adopted a more restful approach following a second consecutive Premier League defeat and is allowing his team to have 48 hours away from work to recharge their batteries, according to The Athletic.United's fixture-packed schedule saw them play nine games throughout April as Ten Hag sought to navigate his squad through Premier League, FA Cup and Europa League clashes.",
        "Performances have dipped in-line with an increased physical load, with United struggling in front of goal having scored just three times from open play in their last six matches across all competitions.Ten Hag will look to use this week's break to focus on masterminding a game-plan to get past Wolverhampton at Old Trafford on Saturday where United will need to pick up three points or face dropping out of the top four.",
        "The 53-year-old admitted after defeat at the London stadium that he wants his players to 'get the energy back' before they embark on their final four remaining league games of the season'It's the first time since Christmas that those players have a full week. We have to reset, reload, get the energy back and keep going.'But tiredness is in your head. If you want, if you have the willingness, you can take it. ",
        "'It's now up to the players, me and the coaching staff to be together, get the willingness in and the belief that we can take it and this team has it.'You can't feel sorry for yourself, as a team stick together, as an individual take responsibility, make sure you have the energy, you have the focus, then play as a team and you get a result because we have proof of that all season.One player that might benefit from some downtime more than others is United's number one De Gea. The goalkeeper has come under fire for recent costly errors and there are reported concerns over his place in Ten Hag's starting squad.The Spaniard is currently negotiating a new deal with the club but sections of supporters want him replaced in the summer after growing tired over uninspiring performances. "
    ]
}