{
    "articleURL": "/health/article-12038715/Low-carb-diets-INCREASE-risk-early-death.html",
    "content": [
        "Eating a low fat diet can reduce your risk of early death up to 34 percentMeanwhile, a diet low in carbs can raise mortality risk by around 38 percentREAD MORE: Cardiologists grade 10 popular diets to see which is best for heartsIt's a debate that has raged on for years in health circles — what's worse, fat or sugar?",
        "In the late 20th century and early 2000s, fat was vilified after routinely being linked to heart disease and high cholesterol.But more recent research has pointed to sugar as the enemy, with high-fat diets like keto earning praise from the scientific community.A new study claims to have put the debate to the ultimate test — by studying which one kills you faster, a high fat or high carbohydrate diet.",
        "Researchers found that adopting a low fat diet could slash risk of death each year by up to 34 percent. Meanwhile, low carb diets increased mortality risk up to 38 percent.'Our results support the importance of maintaining a healthy LFD with less saturated fat in preventing all-cause and cause-specific mortality among middle-aged and older people,' researchers wrote. 'In this study, all [low fat diet] scores were associated with lower total mortality, indicating remarkable health benefits of dietary fat reduction for regaining health.'Our results were similar to those from several previous large-scale prospective cohort studies and randomized controlled trials, which also suggested reductions in dietary saturated fat.' In their research, published Wednesday in the Journal of Internal Medicine, researchers from Harvard University, in Cambridge, Massachusetts, and Tulane University, in New Orleans, Louisiana, teamed up with Chinese scientists.They gathered data dating back to the 1990s on 371,159 Americans, who were aged 50 to 71 at the start of the study.",
        "Using the NIH-AARP Diet and Health Study, a survey started in 1995 to gauge the links between diet and chronic disease in older people, they searched for links between diet and length of life.In the survey, participants were questioned on how often they ate 124 different foods.Using the information, researchers calculated how often a person ate carbs and fat.",
        "Use our guide to work out which of the seven most popular is right for you!",
        "Participants were split into groups, with the 20 percent who ate the least carbs put into a control group and compared to the 20 percent whose diets had the most carbs.Going further, they categorized people as eating a 'healthy' or 'unhealthy' low fat or low carb diet based on whether they got foods from 'high' or 'low' quality sources.For example, a person on a low fat diet who ate a lot of lean meat and vegetables would be on a 'healthy' diet, while someone who eats refined sugars and processed foods was considered to be on an 'unhealthy' diet.They found that people who ate a low fat diet, whether healthy or not, significantly reduced their likelihood of an early death — compared to people on high fat diets.The risk of dying from any cause each year was down 21 percent for people on any type of low fat diet. If it was a healthy diet, then death risk fell 34 percent. ",
        "Those with an unhealthy low fat diet were still dropping their mortality risk eight percent compared to peers with an unhealthy, high fat, diet.Meanwhile, eating a low-carb diet was a path to an early death. People on keto-like diets were 28 percent more likely to die from any cause when compared to their high-carb peers. Participants on an unhealthy low carb diet increased their mortality risk 38 percent every year.Low fat diets have long been a favorite of people attempting to lose weight and boost their overall health.These diets will focus on eating fruits, vegetables and lean meats while cutting out fatty oils.Saturated and trans fats have been marked in particular as best to avoid. The former is often found in red meat, butter, cheese and whole milk. The latter is common in processed and fried foods. There are some healthy fats, though. Monounsaturated and polyunsaturated fats found in olive oil, fish and nuts are known to help maintain cholesterol levels and boost brain health.Fat can also be used as an energy source for the body, with some claiming that it is healthier to train the body to use it as a main energy source.This led to the rise of ketogenic diets — also known as 'keto'. ",
        "The first to rise to prominence was the Atkins diet, developed by cardiologist Robert Atkins in the 1960s.These diets severely limit the number of carbs a person consumes and instead eats high amounts of protein and fat.People on keto will drop sugars, bread, and starchy vegetables such as potatoes and broccoli, and other high-carb foods.Instead, their diet will consist of meat, eggs, dairy and leafy green vegetables.While keto has earned some high-profile endorsers, such as NBA star LeBron James and beauty mogul Kim Kardashian, it has also had many skeptics."
    ]
}