{
    "articleURL": "/tvshowbiz/article-12043829/Olivia-Wilde-glows-Booksmart-sweatshirt-navy-leggings-appearance-Met-Gala.html",
    "content": [
        "Olivia Wilde looked in good spirits as she headed to a workout in Los Angeles on Wednesday.",
        "The 39-year-old Don't Worry Darling director - who posed in bed makeup-free on Tuesday - gave a nod to her directorial debut Booksmart as she donned a white sweatshirt with the film's logo printed on it.She teamed it with a pair of skintight navy blue leggings that showed off her toned stems. The mother-of-two smiled while heading to Tracy Anderson fitness studio, where she regularly exercises.It comes after Olivia donned a showstopping white Chloé gown to Monday's annual Met Gala.",
        "Wilde slung a yellow and gray tote bag over her shoulder and she carried a pink and blue jug of water.Her cute gym outfit was punctuated by a pair of white Adidas sneakers.The actress wore her freshly colored hair loose as she arrived to the gym, and later reemerged with the locks in a ponytail.She went makeup-free underneath her black Ray Ban Wayfarer sunglasses.The location is notably the same place her ex-boyfriend Harry Styles chooses to exercise.One day earlier Olivia dropped in on Instagram to share a morning-after selfie following fashion's biggest night.The star wore a plush white robe as she held the camera overhead and squinted her eyes.She playfully wrote across the snapshot, 'Oh good morningftrnoon.'",
        "Wilde and Vogue China editor-in-chief Margaret Zhang donned versions of the same Karl Lagerfeld-designed dress to the star-studded gala.",
        "And on Tuesday she and 29-year-old fashion journalist took to social media to make light of the occurrence.Olivia appeared on Instagram to share a post featuring three images - one of her, one of Margaret, and one of a model wearing the original design from the 80s.Showing she was not upset by what some considered a faux pas, she noted, 'Great minds,' with an emoji wearing sunglasses.Remaining cool, calm, and collected, she added, 'If you're gonna twin with anyone, make it @margaretzhang.'And Margaret, who began her career as a blogger, reshared the post and added a clever response of her own.Referencing the violin-inspired gowns, she wrote, 'Cue the strings,' along with bicep and instrument emojis.The reactions didn't end there - Olivia took it one step further as she reposted a meme in her Instagram Stories.",
        "A fan account shared a photo of each woman and next to Olivia's picture wrote, '1:1 with my boss.'Then, next to Margaret's snapshot, 'Zoomies with my fave coworker.'The mother-of-two, who shares kids with ex Jason Sudeikis, added a crying laughing emoji, displaying her sense of humor about the whole thing.Although the women arrived to fashion's biggest night in the same look, they each brought their own sense of style to it.",
        "The actress wore a white variety with longer sleeves and patterned gold cuffs on her forearms."
    ]
}