{
    "articleURL": "/news/article-12061271/Severe-weather-warnings-NSW-icy-blast-grips-east-coast-drives-huge-waves.html",
    "content": [
        "East coast is in the grip of an icy spell Low-pressure cell drives huge wavesWinds are creating airport chaos Severe weather warnings are in place across New South Wales as a polar blast plunges temperatures on the east coast to record lows.",
        "A major low-pressure front sitting to Australia's south-east is driving huge swells with 14-metre high waves seen from the NSW coast on Monday.The Bureau of Meteorology has warned heavy surf could lead to damage and coastal erosion between Seal Rocks and Broken Bay in northern NSW. There are also warning of dangerous surf for the Byron coast, Coffs coast, Macquarie coast, Hunter coast, Sydney coast, Illawarra coast and Batemans coast. 'Waves this large are seldom seen near Sydney at any time of year,' Weatherzone meteorologist Ben Domensino told Channel Nine. ",
        "High winds felled trees and tore off roofs across a large swathe of NSW from Newcastle to Nowra on Monday with the state's SES receiving more than 100 calls for assistance.The winds also caused havoc at as Sydney Airport with dozens of flights delayed of cancelled.The wintry mix of rain, snow, hail and blustery winds and large waves extended to the sourthern parts of Queensland and down to Tasmania and Victoria with the mercury plunging to new lows for the time of year in some areas.The Bureau of Meteorology on Tuesday warned damaging winds could affect wide swathes of South Australia, Tasmania, Victoria, NSW and Queensland.Widespread snow blanketed the alpine regions of NSW and Victoria including Kosciuszko National Park and Victoria's Falls Creek, with up to 20cm in some areas, senior meteorologist Dean Narramore said",
        "Snow was also falling across central western NSW in the Mudgee region and just outside Orange as well as Windeyer, Bocoble, Hargraves, Ilford, Oberon, Blayney, Carcoar and Lithgow.By the afternoon, a wintry white hue was blanketing the hills in Canberra with the suburbs only a few degrees above zero, according to ACT Weather Watch.The nearby town of Cooma notched up its coldest May day on record, he said.In Sydney, temperatures dropped to 11C on Monday with winds averaging 60 to 70km/h, with peak gusts around 90km/h over the Illawarra and southern Sydney metropolitan coast.Melbourne also had a brisk start to the day with temperatures registering just 8.5 degrees.\"Much colder southwesterly winds brought temperatures well below average for much of southeastern Australia,\" Mr Narramore said.On the NSW south coast, a 113km/h wind gust was recorded at Barunguba on Montague Island and a 98km/h gust at Green Cape lighthouse near Eden early in the morning.Marine Rescue NSW advised boaters to stay off the water in areas where warnings were issued.The NSW State Emergency Service said they have responded to 100 incidents over the past 24 hours, mainly concerning roofs blown off or trees downed on roads and properties across the state's southeast, spokesman Andrew Edmunds told AAP.",
        "NSW sheep graziers were warned that frosty temperatures and southwesterly winds could affect livestock inland.\"There is a risk of losses of lambs and sheep exposed to these conditions,\" the BOM said.The cold air is expected to linger for the rest of the day and into Tuesday, though heavy rains and snow had subsided in most regions by Monday afternoon.Strahan Aerodrome in Tasmania dropped to -0.6C on Sunday night, making it the coldest May night in 22 years.Canberra also recorded its lowest maximum temperature in 23 years on Monday recording just 7.8C around lunchtime with large parts of the capital covered in a blanket of ice and snow during the morning.",
        "While the east coast shivers the rest of Australia will also being seeing signs of an early winter. Another cold front is expected to impact Western Australia on Wednesday, bringing with it rain, storms and strong winds.It's expected to bring wet and cold weather to Adelaide on Thursday, before weakening and moving into Victoria and Tasmania.For the eastern states there should some reprieve from the chilly weather with warmer conditions expected by the end of the week."
    ]
}