{
    "articleURL": "/wires/reuters/article-12061491/Japan-March-real-wages-mark-year-decline-inflation.html",
    "content": [
        "TOKYO, May 9 (Reuters) - Japan's real wages fell in March for a twelfth month, government data showed on Tuesday, as consumer inflation outpaced nominal pay growth for a full year despite policymakers' pleas for higher employee compensation. Large firms concluded three-decade-high wage hikes at their March labour talks, and whether the trend spreads to smaller businesses is key to the outlook for the Bank of Japan's monetary policy normalisation under the new governor Kazuo Ueda. Inflation-adjusted real wages, a barometer of households' purchasing power, decreased by 2.9% in March from a year earlier, following the same pace of decline in February. Total cash earnings, or nominal wages, grew 0.8% year-on-year in March, also following the same rate of growth in February. Yet the nominal pay growth fell short of the 3.8% consumer inflation rate used to calculate real wages, which includes fresh food but excludes owners' equivalent rent. Overtime pay, a gauge of business activity, rose 1.1% in March from a year earlier, after a revised 1.2% growth in the previous month. Special payments advanced 4.6% in March, faster than a revised 2.2% gain in the previous month. The indicator tends to be volatile in months outside the twice-a-year bonus seasons of November to January and June to August. The table below shows preliminary data for monthly incomes and number of workers in March: ---------------------------------------------------------------- Payments (amount) (yr/yr % change) Total cash earnings 291,081 yen ($2,156) +0.8 -Monthly wage 269,007 yen +0.5 -Regular pay 249,686 yen +0.5 -Overtime pay 19,321 yen +1.1 -Special payments 22,074 yen +4.6 ---------------------------------------------------------------- Number of workers (million) (yr/yr % change) Overall 51.435 +1.8 -General employees 35.048 +1.0 -Part-time employees 16.387 +3.6 ---------------------------------------------------------------- The labour ministry defines \"workers\" as 1) those employed for more than one month at a company that employed more than five people, or 2) those employed on a daily basis or had less than a one-month contract but had worked more than 18 days during the two months before the survey was conducted, at a company that employs more than five people. To view the full tables, see the labour ministry's website at: http://www.mhlw.go.jp/english/database/db-l/index.html ($1 = 134.9900 yen) (Reporting by Kantaro Komiya; Editing by Sharon Singleton)"
    ]
}