{
    "articleURL": "/news/article-12045269/Protesters-Coronation-warned-mistaken-terrorists.html",
    "content": [
        "For all the latest Royal news, pictures and video click here Protesters planning to disrupt the Coronation could be shot by police if they run out towards a carriage just in case they are carrying a bomb, an ex-royal protection officer warned.",
        "A record 11,500 police officers - a large number of them armed - will guard London this weekend in what is set to be the biggest security operation in British history.While HMS Diamond, a Type 45 destroyer capable of tracking drones from 250 miles away, will also stand guard on the Thames over the King's Coronation weekend.The warship will be docked at Greenwich to 'celebrate the Coronation' and host VIP cocktail parties and performances by the Royal Marines band.However, Naval sources told The Sun it would just take a 'flick of a switch' to trigger its air defence systems - which includes up to 48 Sea Viper missiles.Anti-monarchist activists with anti-Charles banners will be permitted to peacefully protest against the Coronation along the procession route, with more than 1,000 gathering in Trafalgar Square on Saturday.But after an armed man was arrested at Buckingham Palace on Tuesday night, and another protester held for shouting 'who elected him?' during a proclamation ceremony, security experts have warned the public that they will be in the middle of the biggest armed policing operation the UK has ever known.",
        "Former royal protection officer Simon Morgan, now director of operations at security firm Trojan Consultancy, said: 'It's an armed policing operation because of the threat that the UK faces, the threat that the royal family faces, dignitaries that are attending. So we have to be very careful.",
        "'Somebody that's going to run out in front of the carriage, fiddling with something in their rucksack, who's to say that's not an IED rather than a banner that's just going to be unfolded. These demonstrators have to be very careful as to the environment that they're going into, the police are acutely aware of it.'The most serious risk factors that police chiefs have to plan for include terror attacks and the threat from fixated individuals who are obsessed with certain people in the public eye, he said.  The procession route will be lined by thousands of police officers watching the crowd, with plain clothes colleagues also mixing with members of the public.Facial recognition technology will also be deployed to flag to police any individuals on watch lists or who have outstanding warrants.Mr Morgan, who also has experience in public order policing and firearms, said measures could be taken to avoid vehicle attacks or bomb attacks as seen in London and Manchester in 2017.Road closures and vehicle barriers would reduce the risk of a Westminster Bridge-style attack, while searching anyone with a big bag or in unseasonal clothing could help stop a bomber.'If you look at something like the Manchester arena bomb attack, then you've got to have your search regime.",
        "'You've got to look at people that are coming into your footprint with large rucksacks, or with heavy winter clothing - bear in mind, it's spring at the moment and you know, the weather is kind of quite nice.'You do have to look to identify people that could cause you harm.'International events also need to be taken into consideration, and MI5 and MI6 will have been monitoring 'chatter' to disrupt any potential plots, Mr Morgan said.",
        "'All that information is being analysed, seeing what the chitter chatter is.'Who's doing what, who says they're going to do what, who has gone silent?'You have a local and a national intelligence picture as well, which is obviously the work of MI5 here in the UK.'And then you get to the international picture and what the UK is also involved in at the moment globally, because that plays part of your risk assessment as well.'At the moment, we're still involved in the war on terror, that hasn't gone away.'We have the war in Ukraine as well. We're involved in that, so too are a lot of our strategic allies, some of whose heads of state will be at the event as well.'There's lots of things to consider, both from what's happening on your doorstep all the way to things that are thousands of miles away.'",
        "Other details which emerged from the vast security operation, codenamed Operation Golden Orb, include: Facial recognition technology will be deployed to flag to police any individuals on watch lists or who have outstanding warrants;There will be more 'VVIPs' at the Coronation than at the late Queen's funeral, meaning more close protection officers will be required;The operation will be led by Karen Findlay, who was silver commander for last year's state funeral;Under the new Public Order Act, protesters who block roads at the event will face up to 12 months behind bars;A total of 29,000 officer shifts will be used during the days around the Coronation; In addition to the 11,500 officers deployed on Saturday, there will be 10,000 military personnel taking part in the ceremony;There will be a 'no-fly zone' over the capital for the weekend.Close protection expert Richard Aitch, who is director of operations at security services company Mobius International, said: 'You will have covert operatives mingling with the crowd.'You've got one of the world's leading countries covered in CCTV everywhere.'There'll be eyes everywhere and the chance of anything untoward occurring of a serious nature is extremely low.'Police and security chiefs will have learned lessons from running operations around the Platinum Jubilee and the Queen's funeral, he said.'The actual security effort is a mammoth tasking of epic proportions. But don't forget the police are and security services are very finely tuned and professional in their delivery of countering threats.'They've had much practice in the lead up to this coronation through the Jubilee and also the late Queen's funeral, it's a similar scale.'They would have learned some lessons in those two previous occasions and finely tuned from that.'",
        "As well as the huge operation to make sure that central London is safe for the coronation, there will be expert armed squads waiting ready in case something serious happens.",
        "Mr Aitch, a former soldier and bodyguard who has written a book on close protection said: 'What you see on TV in the huge presence of uniformed police, this is the proactive element to ensure that the areas used by the procession are as sterile as possible.",
        "'And then on top of that, you would have a reactive effort, and that reactive effort is probably in a way more important because you will need an immediate response to reports of a lone wolf attack in a crowd, a vehicle-borne attack, or for a full-on scaled terrorist incident.'You will have specialist police counter terrorist firearms officers, Special Forces, they'll be holed up somewhere in barracks, local stations, areas strategically situated around London, ready to respond in the right manner.'Scotland Yard bosses have already warned that protesters who try to disrupt the event can expect 'very swift action' from police who will have an 'extremely low' threshold when dealing with them.It comes as King Charles hosted the Prime Minister of New Zealand at Buckingham Palace today, hours after a 'knifeman' sparked a security scare. The man was arrested by police on Tuesday evening after allegedly throwing shotgun cartridges over the gates of the palace, and warned officers his rucksack should be 'handled carefully'.This sparked security forces to put a cordon outside the front gates and experts then carried out a controlled explosion which could be heard on a live broadcast of GB News.The man, understood to be 60-year-old David Huber, from Cumbria, was detained within seconds and the Metropolitan Police says it isn't treating the incident as terror-related. ",
        "Although the King and Queen were not in residence at the time, Charles returned to the palace today to hold an audience with New Zealand PM Chris Hipkins.The pair were photographed shaking hands as His Majesty received Mr Hipkins, who only two days ago said he was in favour of his country ditching the monarchy to become a republic.It's expected 500 more officers will be deployed to the streets of London on Saturday than there were for the funeral of Queen Elizabeth II last September.Commander Findlay, who has spent more than three decades at the Metropolitan Police, said: 'It is an absolutely historic, unprecedented mobilisation for us in terms of scale, but most importantly the nature and specialness of this event to the public, to the service, and all our communities in London and actually the whole of the United Kingdom and globally. 'It's such an event of constitutional, spiritual importance for us all to be involved in.' ",
        "Metropolitan Police Deputy Assistant Commissioner Ade Adelekan said the force will not tolerate any criminal activity camouflaged as protest during the event. Specialist teams have begun scouring the area of central London where events will unfold and will continue monitoring crowds to spot signs of suspicious behaviour. The policing plan has been re-examined after a security incident outside Buckingham Palace on Tuesday evening when a man who allegedly had a knife threw shotgun cartridges over the palace gates. Mr Adelekan said: 'We've debriefed our plans after that incident just to make sure there are no gaps and we're absolutely confident that we've got a plan that will deliver the Coronation in such a manner that everyone will come to London and celebrate and there will be no issues whatsoever.' Asked about how officers will deal with protesters, he said: 'Our priority is around safety and security for everyone that's going to come to this event, and we want to make sure that everyone enjoys it. 'We have an extremely low threshold for anybody or anything that will disrupt this event and what you will see is very swift action from us.' New laws to curb protests came into force on Wednesday ahead of Saturday's ceremony but security minister Tom Tugendhat said the celebrations will 'showcase our liberty and our democracy'.Under the new Public Order Act, protesters who block roads will face up to 12 months behind bars. An official letter warning of the new powers was sent to anti-monarchy group Republic, which said its campaign around the Coronation will proceed as planned. Republic boss Graham Smith said it was 'very odd' the letter came from the Home Office and described it as 'intimidatory'. He added: 'We've been liaising closely with the police about the protest for weeks. We've had meetings with them. 'They've said very clearly that they have no problems with our plans. I just can't understand why the Home Office thinks it's appropriate to send a letter like that, which was anonymous in terms of [having] no person's name on it.'"
    ]
}