{
    "articleURL": "/sciencetech/article-12059281/NASAs-James-Webb-Space-Telescope-snaps-incredible-images-star-25-light-years-away.html",
    "content": [
        "Star called Fomalhaut is 25 light years away and 15 times as bright as our sunNewly-discovered belts around the star could suggest the existence of planetsWhat was once thought to be a planet was later deemed remains of a collisionIncredible new images from NASA's James Webb Space Telescope (JWST) reveal a solar system in greater detail than ever before. ",
        "Fomalhaut is a star approximately 25 light years from Earth with a striking surrounding belt of dust that stretches out 14 billion miles. Scientists have revealed that two innermost belts also surround the star, as well as a 'Great Dust Cloud', thanks to new data from the $10 billion telescope. Researchers previously thought they found a planet around Fomalhaut, although it was later deemed to be remains of a cosmic collision.However, detection of these new belts around Fomalhaut could be the strongest indication yet that it does have planets – possibly with alien life. ",
        "A study describing the findings, led by András Gáspár at the University of Arizona, has been published today in Nature Astronomy. ",
        "Distance from Earth: 25 light yearsMass: 1.92 x that of our sun Age: 440 million years Known planets: 0 Constellation: Piscis AustrinusThere are three belts around Fomalhaut: Two inner ones previously unknown and one outer, previously knownTogether these belts form a debris disk",
        "'Fomalhaut appears to be the site of a complex and possibly dynamically active planetary system,' they say.The 440-million-year-old star has a mass around 1.92 times that of our sun and is located in the constellation of Piscis Austrinus, approximately 25 light years away.Fomalhaut is one of the brightest stars in the night's sky – 15 times as bright as our sun – and it is blazing through hydrogen at such a furious rate that it will burn out in just one billion years. ",
        "We now know that there are three belts around Fomalhaut: two inner ones that were previously unknown and one outer, previously known. The outermost one extends out to 14 billion miles (23 billion kilometers) from the star – around 150 times the distance of Earth from our sun. Fomalhaut's three belts together all form a prominent 'debris disk' – a surrounding cluster of cosmic dust, pebbles and other remnants from rocky collisions of the past. For their study, the experts analysed images taken of the debris system around Fomalhaut using JWST's Mid-InfraRed Instrument (MIRI), which sees light in the mid-infrared region of the electromagnetic spectrum. ",
        "The images show the previously known outer ring in finer detail, which is considered 'analogous' or similar to our own solar system's Kuiper belt.",
        "This doughnut-shaped ring of icy objects extends just beyond the orbit of Neptune and a 'region of leftovers from the solar system's early history' NASA says. But Fomalhaut's two newly discovered inner belts were also revealed by Webb in infrared light for the first time. This is exciting for astronomers because it hints at the possibility that Fomalhaut is analogous to our solar system, and that it may have planets like ours. 'The belts around Fomalhaut are kind of a mystery novel – where are the planets?' said study author George Rieke, US science lead for Webb's MIRI instrument. ",
        "'I think it's not a very big leap to say there's probably a really interesting planetary system around the star.' The 'narrow' belt in the middle may be shepherded by the gravitational influence of unseen planets, suggesting the presence of a world in the gap between belts. The newly discovered intermediate belt is also 'misaligned' compared with the outer belt and may have been the origin of a previously known dust cloud generated by a collision.The images also reveal a large dust cloud within the outer ring, which the authors name the 'Great Dust Cloud'.",
        "The Great Dust Cloud may be evidence for a collision occurring in the outer ring between two 'protoplanets' – large bodies of matter in orbit thought to be developing into a planet. So either there are planets that have been in development around Fomalhaut, or others that have already existed for millions of years. Either way, Fomalhaut and our own system have notable similarities, according to the experts. 'I would describe Fomalhaut as the archetype of debris disks found elsewhere in our galaxy, because it has components similar to those we have in our own planetary system,' said Gáspár. 'By looking at the patterns in these rings, we can actually start to make a little sketch of what a planetary system ought to look like – if we could actually take a deep enough picture to see the suspected planets.' ",
        "Gáspár said Webb does have the capability to finally reveal planets around Fomalhaut thanks to its NIRCam, another one of its instruments. NIRCam captures light from the edge of the visible through the near infrared range of the electromagnetic spectrum. 'We have NIRCam data as well ... those are to be published soon. That's all I am going to say,' he told MailOnline.  JWST has proved a booming success and a huge step in the advancement in astronomical knowledge since it launched from Earth on Christmas Day 2021.It revealed its first set of images in July 2022, including a dying star cloaked by dust and a 'cosmic dance' between a group of galaxies. Other astonishing images released last year include the 'Pillars of Creation', Neptune's rings, a 'cartwheel galaxy' and a stellar nursery known as the Tarantula Nebula. ",
        "The James Webb telescope has been described as a 'time machine' that could help unravel the secrets of our universe.The telescope will be used to look back to the first galaxies born in the early universe more than 13.5 billion years ago, and observe the sources of stars, exoplanets, and even the moons and planets of our solar system.",
        "The James Webb Telescope and most of its instruments have an operating temperature of roughly 40 Kelvin – about minus 387 Fahrenheit (minus 233 Celsius).It is the world's biggest and most powerful orbital space telescope, capable of peering back 100-200 million years after the Big Bang.The orbiting infrared observatory is designed to be about 100 times more powerful than its predecessor, the Hubble Space Telescope.NASA likes to think of James Webb as a successor to Hubble rather than a replacement, as the two will work in tandem for a while. The Hubble telescope was launched on April 24, 1990, via the space shuttle Discovery from Kennedy Space Centre in Florida.It circles the Earth at a speed of about 17,000mph (27,300kph) in low Earth orbit at about 340 miles in altitude. "
    ]
}