{
    "articleURL": "/sport/nrl/article-12056115/Boss-major-Warriors-sponsors-accuses-NRL-referees-CHEATING-furious-Twitter-rant.html",
    "content": [
        "Jason Paris claimed on Twitter referees are biased against the WarriorsWarriors had two players sin-binned in 18-6 loss to Penrith on SaturdayWarriors CEO Cameron George said the club will speak to the NRL The chief executive of the Warriors' major sponsor has accused NRL referees of 'cheating of the highest order' in an extraordinary rant on social media.",
        "Jason Paris, the CEO of One New Zealand, took to Twitter on Saturday night to blast match referees and officials in the Bunker and accused them of deliberating ruling against the Warriors at every opportunity.'Are you kidding me? How biased are the @NRL bunker and referees against the @NZWarriors?,' he wrote. 'Have they got money on them to lose? It’s like we are permanently against 14 on the field and they want us to play with 12.'It’s absolutely outrageous and so incredibly frustrating. Imagine how the team feel - three games in 11 days and then this rubbish. Cheating of the highest order.'",
        "The Warriors lost 18-6 to Penrith in Brisbane on Saturday night in Magic Round and two players sin-binned. Jackson Ford was shown a yellow card for a hip-drop tackle, while Demitric Sifakula received his marching orders for striking Nathan Cleary as a scuffle broke out on the field. While Ford has since been charged with a grade one dangerous contact, Sifakula has escaped further punishment.  A spokesman for the NRL said the league was aware of Paris' comments and 'will  be reviewing them closely'.Warriors CEO Cameron George told News Corp that Paris was entitled to his opinion, but noted he did not speak for the club.",
        "'Jason is entitled to say that as a fan of the sport and a big supporter of our club,' he said.'That’s his call. It’s not a club comment.' George added the Warriors will be seeking a response from the NRL over a number of refereeing decisions over the past few weeks.",
        "'We have a significant amount of evidence from games over the last month that we want to raise with the NRL,' he said.'We’ll take it up with the appropriate people at the NRL. We want explanations to understand their decision making process.'Speaking after the loss to the Panthers, Warriors coach Andrew Webster was far from impressed with referee Todd Smith.'I’m going to take a hat around and get you guys to pay for my fine,' he said in his press conference.",
        "'If you all want to chip in, I’ll give you whatever you want. 'The Demitric one, I just feel like his hand's open. I feel like he's pushing him in the face. 'You can see Nathan's [Cleary] face move [...] then next thing he's in the bin.'The hip-drop, whatever it is, they're tough at the moment. I need to look at that one again.' "
    ]
}