{
    "articleURL": "/wires/afp/article-12061075/Eyeing-White-House-bid-DeSantis-targets-Chinese-influence.html",
    "content": [
        "Florida Governor and likely presidential candidate Ron DeSantis signed multiple bills Monday aimed at curbing Beijing's growing sway -- restricting real estate purchases in the southern US state by Chinese nationals and tightening access to video-sharing app TikTok.",
        "The measures were part of a package of legislation that also outlaws the storage of sensitive data on servers linked to the regime of President Xi Jinping and takes aim at Chinese influence in public education.\"Florida is taking action to stand against the United States' greatest geopolitical threat -- the Chinese Communist Party (CCP),\" said DeSantis, who is weighing a run for the 2024 Republican presidential nomination.The 44-year-old governor signed measures targeting seven foreign \"countries of concern\" --- China, Cuba, Iran, North Korea, Russia, Syria and Venezuela -- as he seeks to build his credibility as a global statesman.Investors who live in China are now barred from owning property of any kind, including homes, anywhere in Florida unless they are a US citizen or permanent resident.Foreigners from the other six nations cannot buy farmland anywhere in the Sunshine State or property within 20 miles of a military base or critical infrastructure, such as airports or power stations.China owned 352,140 acres (142,506 hectares) of US land in 2020, according to the Department of Agriculture, just under one percent of the total held from abroad. Canadian investors had about 12.4 million acres.A second bill banning Chinese-owned TikTok from government-issued devices expands on an executive order signed last September creating a list of prohibited social-media applications considered security risks.",
        "And DeSantis signed a third bill prohibiting public colleges and universities from accepting gifts from or entering into agreements with colleges based in \"foreign countries of concern,\" including China.The governor will be hoping the legislation improves his standing among Republicans worried about Beijing's growing influence as he attempts to close a double-digit gap on frontrunner Donald Trump in the 2024 primary, with his official launch expected in the coming weeks.\"China and other hostile foreign nations control hundreds of thousands of acres of critical agricultural lands in the US, leaving our food supply and our national security interests at risk,\" said Florida's agriculture commissioner Wilton Simpson.But Chinese-American groups and Democrats in Florida's House of Representatives have voiced fears that measures could lead to increased discrimination."
    ]
}