{
    "articleURL": "/wires/reuters/article-12042787/US-crude-stockpiles-fall-gasoline-builds-demand-weakens-EIA.html",
    "content": [
        "By Laura Sanicola",
        "May 3 (Reuters) - U.S. crude oil inventories fell for a third week in a row, while gasoline stockpiles unexpectedly rose last week as demand weakened, the Energy Information Administration said on Wednesday.Crude inventories fell by 1.3 million barrels in the week ending April 28 to 459.6 million barrels, compared with analysts' expectations in a Reuters poll for a 1.1 million-barrel drop.Crude in the Strategic Petroleum Reserve declined 2 million to 364.9 million barrels, its lowest since October 1983. Levels dropped for the third week in a row as part of a congressionally mandated sale of 26 million barrels.\"Overall that hydrocarbon inventories are declining at the same time that the U.S. continues with its Strategic Petroleum Reserve release,\" said Andrew Lipow, president of Lipow Oil Associates in Houston.Gasoline stocks rose by 1.7 million barrels to 222.9 million barrels, the EIA said, compared with forecasts for a 1.2 million-barrel drop.Demand for the motor fuel ahead of the peak summer driving season fell significantly, down 9.4% to 8.6 million barrels per day.\"That's a negative for the market because gasoline was starting to look like the bright spot for the complex,\" said John Kilduff, a partner at investment advisory Again Capital LLC in New York.Crude prices extended their losses after the data showed weakness in the fuel sector.",
        "U.S. crude oil futures fell $2.93, or 4.1%, to $68.73 a barrel by 11:00 a.m. ET (1600 GMT). Brent crude fell $2.70, or 3.6%, to $72.64.Distillate stockpiles, which include diesel and heating oil, also fell by 1.2 million barrels to 110.3 million barrels, versus expectations for a 1.1 million-barrel drop, the EIA data showed.Refinery crude runs fell by 98,000 bpd, while refinery utilization rates fell by 0.6 percentage point to 90.7% of total capacity.Crude stocks at the Cushing, Oklahoma, delivery hub rose by 541,000 barrels in the week, the EIA said.(Reporting by Laura Sanicola Editing by Marguerita Choy)"
    ]
}