{
    "articleURL": "/sciencetech/article-12052339/Uber-Lyfts-fare-prices-mapped-state-major-city-app-cheaper.html",
    "content": [
        "A company looked at the average price of four separate six-mile trips to find if Uber or Lyft is cheaperThis determined that Uber is the cheapest compared to Lyft in two out of three statesREAD MORE: Uber and Lyft shares rise after California court rules against driversLook no further if you're out of town and looking to save a few bucks on a taxi.",
        "A new report has pitted America's two most popular taxi apps, Lyft and Uber, against each other regarding fare prices in every state and major city.Consumer finance company CashNetUSA analyzed the average price of four separate journeys of six miles, each starting at the city's center.",
        "Uber was found to be the cheapest overall but charges nearly $4 more than Lyft in New York City.CashNetUSA also determined that Uber prices were the cheapest in Utah, costing about $14.42 on average. For Lyft, they found that Oklahoma had the most affordable rides, averaging about $14.51 per trip. Using fare estimators from Uber and Lyft's calculators, the company compiled the price differences between the two services in every state. They also tested Uber and Lyft's performance in 150 big cities across the United States. The company's analysis found that Uber fares were typically cheaper, offering lower rates in two out of three states.Across the top ten states where the price differences between Uber and Lyft were the most severe, Uber's fares were often considerably cheaper.Uber rides were, on average, $4.71 cheaper in Wisconsin, $4.22 cheaper in Minnesota, and $4.05 less in Pennsylvania. Lyft rides were the cheapest compared to Uber fares in New York state, costing $3.33 less on average than New York Uber rides. ",
        "Among the 150 US cities the group studied and mapped, New Orleans had the most significant disparity between Uber and Lyft fares: Lyft rides were a whopping $12.20 more expensive than their Uber rivals in the Big Easy.  All told, there were only three cities where Uber and Lyft prices were identical, and all three of them were in California: San Diego ($20.45 per fair on both apps), San Jose ($22.76 per fare each), and Los Angeles ($24.78 per fare).",
        "CashNetUSA, which produced the maps, is a company that provides short-term and mid-term cash advance loans to individuals based on paychecks. The consumer finance company has over 200 unresolved complaints with the Better Business Bureau at this date, but nevertheless, it does seem to understand that the average American is cash-strapped.'The rideshare business model has been controversial as the popularity of Lyft and Uber have snowballed over the past decade,' according to CashNetUSA. 'And unfortunately, the services are unlikely to get cheaper.'However, mapping the apps' price difference for consumers is a good start to saving the public money. ",
        "'Nobody likes to think too hard about Uber and Lyft,' according to CashNetUSA. 'But a moment of extra thought might just save you a few bucks.' "
    ]
}