{
    "articleURL": "/wires/ap/article-12053209/Santander-grand-slam-2-homers-Orioles-beat-Braves-9-4.html",
    "content": [
        "ATLANTA (AP) - Anthony Santander is heating up, which is another good sign for the streaking Baltimore Orioles.",
        "Santander homered from both sides of the plate, including a grand slam, and Cedric Mullins also went deep as the Orioles won for the 14th time in 17 games, 9-4 over the Atlanta Braves on Friday night.Dean Kremer allowed one run in six strong innings for Baltimore, which became the first team this season to reach the seats against Braves ace Max Fried.\"Sweet!\" Mullins exclaimed, unaware that Fried had not allowed a homer. \"It was bound to happen.\"Santander homered from the right side against Fried in the fourth to put Baltimore ahead to stay. Then, batting lefty in the seventh against Joe Jimenez, he delivered his first career grand slam to turn what had been a tight game into a rout.Santander came into the night hitting .241 with three homers. But he's now homered in two straight games, and has four multi-hit outings in a row.",
        "Suddenly, he looks like the guy who hit 33 homers a year ago, tying a big league record by going deep from both sides of the plate in four games.\"Just staying positive,\" he said. \"It's a long season.\"Fried (2-1) had allowed only one earned run over his first four starts and came in with an 18-inning scoreless streak. But the long ball and two throwing errors by the Braves ace led to his worst outing of the season.",
        "\"I´m not going to forget what happened tonight,\" Fried said. \"I need to make sure that what happened tonight doesn´t happen again.\"The Orioles took care of Fried's scoreless streak with an unearned run in the third, taking advantage of the pitcher's errant pickoff throw.Baltimore blew it open with a seven-run seventh. Mullins ignited the outburst with a 390-foot shot down the right-field line that nearly reached the Chop House restaurant.After Fried's second throwing error of the game handed the Orioles a 4-1 lead, Jimenez took over with the bases loaded. Santander cleared them with a 397-foot shot into the right-field seats.Fried was charged with seven runs, five earned. His ERA climbed from 0.45 to 2.08.Hot-hitting Sean Murphy drove in all four Atlanta runs, three of them on an eighth-inning homer.In paper, at least, it looked like a pitching mismatch. Kremer (3-1) had a 6.67 ERA after surrendering at least four earned runs in all but one of his starts.But the right-hander navigated a Braves lineup that had scored 26 runs in a three-game sweep at Miami, surrendering six hits, walking two and striking out three.\"He gave up some hard contact, but he competed well,\" manager Brandon Hyde said, \"He pitched with a ton of confidence.\"",
        "Baltimore improved to 22-10, surpassing the Braves (22-11) for the second-best record in the big leagues. Only AL East rival Tampa Bay is ahead of the Orioles at 27-6.\"If it hasn't been said already, the AL East is pretty strong,\" Kremer said. \"We're here to make a name for ourselves.\"WIN FIRSTThe Orioles improved to 11-0 in series openers, the longest streak to begin a season since the 1973 San Francisco Giants also started their first 11 series with victories.This is the fourth time in team history that the Orioles have won 11 straight series openers at any point in a season. They most recently accomplished the feat in May and June of 1980.MARAUDING MURPHMurphy is making quite an impression in his first season with the Braves.He's got three homers and 12 RBIs over his last seven games, pushing his major league-leading OPS to 1.092.NEWEST ORIOLEBaltimore activated C Luis Torrens, who was acquired from the Chicago Cubs for cash on Tuesday. The Orioles cleared a spot on the roster by optioning 1B Ryan O´Hearn to Triple-A Norfolk.WELCOME TO THE SHOWBraden Shewmake, who impressed in spring training while battling for the Braves' shortstop job, got the start in his major league debut after being called up from Triple-A Gwinnett. He went hitless in four at-bats from the nine-hole.",
        "TRAINER'S ROOMThe Braves made a flurry of moves before the game. RHP Raisel Iglesias was activated from a rehab assignment and will presumably work toward taking over the closer role that was his until he was shut down in the final week of spring training with shoulder inflammation. ... Shewmake was recalled after IF Ehire Adrianza went on the 10-day injured list, retroactive to Tuesday, with right elbow inflammation. ... OF Michael Harris missed his second straight game with a jammed knee. ... C Travis d'Arnaud, who has been out nearly a month with a concussion, began a rehab assignment at Gwinnett.UP NEXTRHP Kyle Bradish (1-1, 6.14 ERA) goes for the Orioles on Saturday against Atlanta RHP Spencer Strider (4-0, 2.57).___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}