{
    "articleURL": "/wires/reuters/article-12047085/Colombian-leader-says-Spain-study-removing-ELN-EUs-terrorism-list.html",
    "content": [
        "MADRID, May 4 (Reuters) - Colombian President Gustavo Petro said on Thursday Spain will look at removing the left-wing Colombian guerrilla group known as the National Liberation Army (ELN) from the European Union's list of designated terrorist organisations during the upcoming Spanish presidency of the EU Council.",
        "At a joint press conference with Spanish Prime Minister Pedro Sanchez in Madrid, Petro said Spain would \"study the possibility\" of removing the ELN from the list to make progress towards a truce or ceasefire in Colombia's six-decade conflict with rebels and crime gangs.Sanchez, however, did not fully commit to the move.\"Depending on the progress of this negotiation and dialogue process, we are at the disposal of the president and the Colombian government to talk to the other European partners and effectively implement their requests,\" Sanchez said.\"It is too early to say what Spain's position will be because it will be very much conditioned by what the Colombian government tells us,\" he added.The list establishes sanctions for groups on it.The ELN is Colombia's oldest remaining rebel group, and the talks are the cornerstone of efforts by Petro - himself once a member of the now-demobilized M-19 insurgents - to bring \"total peace\" to Colombia.He restarted peace talks with the ELN last year, but those negotiations were thrown into disarray in March after the ELN killed nine Colombian soldiers near the border with Venezuela. They restarted in Havana on Tuesday.The ELN, founded in 1964 by radical Catholic priests and rebels trained in Cuba, has around 5,850 members - including 2,900 combatants - and is accused of financing itself through drug trafficking, illegal mining and kidnapping. (Reporting by Belén Carreño and Emma Pinedo; Writing by David Latona; Editing by Aislinn Laing and Emelia Sithole-Matarise)"
    ]
}