{
    "articleURL": "/wires/reuters/article-12056721/Israel-publishes-tenders-new-West-Bank-settlement-units.html",
    "content": [
        "JERUSALEM, May 7 (Reuters) - Israel has published tenders for more than 1,000 new housing units in settlements in the occupied West Bank, despite a commitment it made in U.S.-backed talks in February that discussion of new settlement units would be halted for the next four months.",
        "Since the meeting in Jordan, attended by U.S., Egyptian, Jordanian, Palestinian and Israeli officials, the Israel Land Authority has published on its website separate tenders for 1,248 new housing units in West Bank settlements.The settlements include Beitar Illit, Efrat, Kiryat Arba, Ma'ale Efraim and Karnei Shomron in addition to 89 units in the East Jerusalem settlement of Gilo.\"All the tenders that were published are in line with the rules and have received the required permissions, including from the defence minister,\" Israel's housing ministry said. There was no comment from the defence ministry.The expansion of settlements in the West Bank has been among the most contentious issues between Israel and the Palestinians and the international community for decades. It has continued despite repeated calls for construction to stop from allies including the United States.According to a report by the United Nations Human Rights Committee, just under 700,000 settlers live in 279 settlements across the West Bank and East Jerusalem, up from 520,000 in 2012.The Palestinians say the expansion of Jewish settlements on occupied land undermines their bid for a viable state and most countries deem such construction as illegal under international law. Israel disputes that and cites biblical, historical and political ties to the West Bank, as well as security interests.",
        "Prime Minister Benjamin Netanyahu's nationalist religious coalition, which includes prominent ministers from the settler movement, has pressed ahead with settlement expansion plans since coming to office in January.In February, the committee charged with overseeing settlement plans approved the promotion of more than 7,000 housing units, most deep inside the West Bank, according to Peace Now, an anti-settlement group that observed the hearings.In March, parliament cleared the way for settlers to return to four settlements in the West Bank, amending a law which ordered their evacuation in 2005.Although peace talks between Israel and the Palestinians have been stalled since 2014, the United States helped organise meetings in Jordan and Egypt this year to try to calm a surge of violence that has lasted for months.As part of measures agreed following the meeting in Jordan in February, Israel said it would halt discussion of new settlements for four months.\"By expanding settlements, Israel's extremist government is trying to make impossible the establishment of an independent Palestinian state,\" said Wasel Abu Yousef, member of the Palestine Liberation Organisation's Executive Committee.The Palestinians aim to establish an independent state in the West Bank and Gaza with East Jerusalem as its capital, territories Israel captured in the 1967 Middle East war.More than 3 million Palestinians live in the West Bank, excluding East Jerusalem, and have endured decades of military rule that Palestinians and some rights groups say amounts to apartheid.",
        "Israel denies it maintains an apartheid policy against Palestinians. (Reporting by Henriette Chacar; Additional reporting by Ali Sawafta; Editing by James Mackenzie and Angus MacSwan)"
    ]
}