{
    "articleURL": "/news/article-12043117/Atlanta-PD-investigate-active-shooter-near-hospital-center-city-reports-gunfire.html",
    "content": [
        "Deion Patterson, 24, who served in the Coast Guard for five years, was attending a hospital appointment with his mother on Wednesday when he opened firePatterson shot and killed a 39-year-old woman and injured four other women, shooting them in the abdomen, face and armHe hijacked a car and went on the run: his vehicle was spotted on Wednesday evening in the Truist Park area, 11 miles from the hospital Atlanta police are believed to be closing in on a gunman who opened fire inside a hospital, killing one woman and injuring four others before hijacking a car and fleeing.",
        "Deion Patterson, 24, who served in the Coast Guard for five years, was attending an appointment to get anxiety medicine with his mother on Wednesday morning when he became 'enraged' in the lobby and opened fire.A 39-year-old woman was killed in the shooting in the hospital waiting room on the 11th floor, with four other women - aged 71, 56, 39 and 26 - all injured. The hijacked vehicle Patterson escaped in was seen near Truist Park and The Battery in Cobb County, CNN reported on Wednesday evening. He has been described by cops as 'armed and dangerous'. Hospital officials confirmed that three of the injured people underwent surgery - one was shot in the arm, one in the face, and a third in the abdomen.The fourth patient is still in the trauma unit.The shooter's mother Minyone Patterson, told The Daily Beast: 'The damn VA gave him some messed up medication. And all he wanted was an Ativan (pill for anxiety).'She declined to comment when contacted by DailyMail.com, but authorities confirmed that she was cooperating with them.  ",
        "It was initially reported that she was harmed during the shooting but police have since confirmed she was uninjured.The Coast Guard has confirmed that Patterson was enlisted with them in 2018, before being discharged from active duty in January 2023. ",
        "In a statement they said: 'Our deepest sympathies are with the victims and their families. The Coast Guard Investigative Service is working closely with the Atlanta Police Department and local authorities in the investigation. 'Mr. Patterson entered the Coast Guard in July 2018 and last served as an Electrician's Mate Second Class.'Police were called to Northside Medical Hospital Midtown, on West Peachtree Street, after reports of an active shooter inside a building at 12.08pm. Patterson is believed to have carjacked a vehicle and fled the scene shortly before law enforcement arrived.  Four victims were transported to Grady Memorial Hospital for treatment while another was pronounced dead on the scene. The three that underwent surgery were described by the hospital's Chief Medical Officer Dr. Robert Jansen as having 'particularly serious' injuries. One critical patient was shot in the face and required an interventional radiology procedure, which is used to stop bleeding by using catheters inserted directly into blood vessels.  ",
        "At a press conference Atlanta Police Chief Darin Schierbaum confirmed that officers were confident that Patterson had left the scene, and added they were still searching for the weapon used. Officials in Cobb County confirmed that they had been asked to search for Patterson in the Vinings, Cumberland and Truist Park areas.",
        "On Wednesday afternoon, the police cordoned off parts of the Atlanta Braves' stadium, Truist Park, as officers swarmed the area and helicopters buzzed overhead. Court documents seen by DailyMail.com show that Patterson was fined $266.50 for an excessive noise complaint in 2020.He was also given a traffic fine of $200 for being stopped in a prohibited area in May 2020. Patterson was also reportedly arrested for drunk driving in 2017, but ultimately the charges were dropped. Images of the alleged gunman have been released by authorities, with the suspect still on the loose.Surveillance footage stills show a man wearing a face mask and a bag on the front of his body, pointing a gun in what appears to be a reception area. Another image shows him in a dark-colored hoodie, without a mask and his hood up in an elevator. ",
        "In a statement, Atlanta Police Department said: 'We are working an active shooter situation inside a building on West Peachtree St, between 12th St and 13th St. 'We are aware of multiple people injured. No suspect is in custody. There have been no additional shots fired since the initial incident unfolded.'Anyone in the area is asked to secure their building and shelter in place. Anyone not in the area is asked to stay away.'",
        "Staff in the building say the incident took place in the lobby of the 11th floor, with one spotting blood in the elevator after hearing gunshots.  Dr Robert Janson, who is treating the patients at Grady Memorial Hospital said: 'We have three people in critical condition, one is in the emergency room and two are being operated on.'He confirmed that there was no longer a mass casualty call in place, and victims' families had already made it to the hospital though their identities have not yet been confirmed.",
        "Raphael Warnock, a senator for Georgia and pastor of the Ebenezer Baptist Church, spoke on at the Capitol on Wednesday and condemned the easy access to guns. 'If we refuse to act while our children are dying and in a moment when no one is safe, then shame on us. Shame on us if we allow this to happen and we do absolutely nothing,' Warnock said.'My own two children were on lockdown this afternoon. They are there, I'm here, hoping and praying that they are safe – but the truth is none of us is safe.'Warnock said that 'thoughts and prayers are not enough,' calling for immediate action on gun legislation, and criticized the gun lobby.'Those who want to convince us that common-sense gun reform is somehow a call to take everybody's guns, this is not the cost of freedom … it is the cost of greed,' Warnock added.",
        "Hundreds of heavily-armed SWAT officers were on the scene, with witnesses seeing several people being taken out of the building on stretchers. In a statement Northside Hospital said: 'We are cooperating with law enforcement following the shooting at our midtown Atlanta location earlier this afternoon. 'We urge people in the area to shelter in place and follow instructions from law enforcement on the scene. 'This tragedy is affecting all of us, and we ask for patience and prayers at this time.Multiple agencies, including Atlanta police, Atlanta fire, MARTA police, Georgia Tech police, and the Georgia State Patrol responded to the situation. Atlanta Mayor Andrew Dickens said in a statement that he is in close contact with the police force, adding that those in the area should shelter in place. ",
        "Medical staff appeared to accompany patients along the sidewalk as law enforcement evacuated the building.Crime Stoppers has increased their reward to up to $10,000 in this case.Information can be submitted anonymously to the Crime Stoppers Atlanta tip line at 404-577-TIPS (8477) or online at www.StopCrimeAtl.org . Persons do not have to give their name or any identifying information to be eligible for the reward of up to $10,000 for the arrest and indictment of the suspect.Including the shooting at the Atlanta medical facility, there have been at least 190 mass shootings in the United States this year. ",
        "It is the second mass shooting in the area in less than a year, with two people killed in August of 2022 when a woman opened fire in a condo building on West Peachtree. That shooting appeared to be motivated by a dispute with the condo's board."
    ]
}