{
    "articleURL": "/wires/reuters/article-12048511/North-Carolina-legislature-passes-12-week-abortion-ban.html",
    "content": [
        "By Julia Harte and Joseph Ax",
        "May 4 (Reuters) - North Carolina's Republican-controlled legislature passed a bill on Thursday that limits the window for most abortions to 12 weeks, down from 20, which could sharply reduce access to the procedure for millions of women across the U.S. south.The measure now heads to Democratic Governor Roy Cooper, who has vowed to veto it, following the Senate's 29-20 approval along party lines, a day after the state House of Representatives passed it in a similar party-line vote.Protesters in the Senate chamber chanted, \"Abortion rights now!\" after the vote on Thursday, prompting the Senate president to order the gallery cleared.Republicans have a supermajority in both chambers, thanks to a formerly Democratic lawmaker who recently switched parties, and can override Cooper's veto if all Republicans support it. The governor has 10 days to act on the bill.If it becomes law, the measure would hinder women who have been traveling to North Carolina for abortions from nearby conservative southern states that banned or strictly limited the procedure after the U.S. Supreme Court overturned last year the 1973 Roe v. Wade ruling establishing federal abortion rights.It would require doctors to be present when abortion medication is given and those seeking medical abortions to have an in-person consultation with a doctor 72 hours before the procedure.",
        "That would make it more difficult for out-of-state abortion seekers to obtain the service in North Carolina.In a video posted to Twitter after the vote, Cooper criticized Republican lawmakers who had previously made campaign promises to protect women's reproductive health and urged their constituents to demand that they not support the veto override.Democrats and abortion rights supporters slammed the bill's Republican backers for bringing it to a vote in the House less than 24 hours after it was introduced late on Tuesday.That step precluded the lengthier analysis and debate that would usually happen around such legislation.Republicans, however, defended it as \"common-sense legislation\" that represented a compromise between the two sides on a polarizing issue, saying it included funding for foster and child care as well as paid parental leave.\"The focus of this legislation is the health and the safety of women and children,\" said state Senator Lisa Barnes, a Republican.Mary Wills Bode, a Democratic senator, called the bill \"devastatingly cruel\" and warned that women would be forced into seeking illegal abortions.\"Limiting access to care will not stop abortions from happening,\" she said. \"They will just stop safe abortions from happening.\"The North Carolina measure would ban elective abortions after the first trimester, except in cases of rape, incest, life-limiting fetal anomalies and medical emergencies.",
        "Key to the North Carolina Republicans' veto-proof majority is former Democratic state Representative Tricia Cotham, who switched to the Republicans in April.Cotham voted on Wednesday for the 12-week abortion ban, a dramatic change in her stance from just a year ago, when she promised on Twitter to \"continue my strong record of defending the right to choose.\"Near-total abortion bans have taken effect in 14 states since the Supreme Court revoked federal abortion rights in June 2022, according to the Guttmacher Institute, an abortion rights advocacy research group.Abortions in North Carolina rose by 37%, more than any other state, in the first two months after the ruling, according to a study by the Society of Family Planning, a nonprofit that promotes abortion rights and research.In the six months afterwards, North Carolina saw an average of 3,978 abortions a month, up 788 from the figure of two months prior, the society said.Last week, a coalition of Republican, Democratic and independent lawmakers - all women - successfully filibustered a proposed abortion ban in conservative South Carolina.The same day, Nebraska's legislature narrowly voted down a ban on most abortions after six weeks. (Reporting by Julia Harte and Joseph Ax; additional reporting by Jyoti Narayan; Editing by Colleen Jenkins, Stephen Coates and Clarence Fernandez)"
    ]
}