{
    "articleURL": "/wires/afp/article-12049749/Rohingya-team-visits-Myanmar-refugee-return-scheme.html",
    "content": [
        "A Rohingya refugee delegation arrived in Myanmar on Friday to tour new facilities built for the revival of a long-stalled plan to return the persecuted minority to their homeland.",
        "Bangladesh is home to about a million Rohingya, most of whom fled a 2017 military crackdown in neighbouring Myanmar that is now subject to a UN genocide investigation.Both countries signed an agreement to return them later that year, but little progress has been made since, and the United Nations has repeatedly warned conditions were not right for their repatriation.Bangladesh officials said Friday that 20 Rohingya and seven officials including a border guard officer were visiting two model villages erected for the pilot return project.\"We departed from Teknaf jetty with 20 Rohingya members, including three women,\" Bangladesh's deputy refugee commissioner Mohammed Khalid Hossain told AFP\"They will see the various facilities created for the purpose of repatriation to Myanmar,\" he said as their boat left the river port for neighbouring Maungdaw township.",
        "Bangladesh refugee commissioner Mizanur Rahman told AFP the new facilities include a market, hospital and reception centre for returning refugees.Officials have told AFP they expect repatriations to begin later this month, before the annual monsoon season.Rohingya refugees, who have spent nearly six years living in overcrowded and squalid camps in Bangladesh, have been consistently sceptical of the scheme since it became public knowledge in March.They say that none of their queries about security or recognition of their right to citizenship in Myanmar has been answered.",
        "\"Why will we be sent to Myanmar without citizenship?\" a refugee who said they were also part of Friday's delegation told AFP earlier this week, speaking on condition of anonymity.The Rohingya are widely viewed in Myanmar as interlopers from Bangladesh, despite roots in the country stretching back centuries.- 'Must be voluntary' -",
        "The UN refugee agency said it was aware of the trip, which was taking place \"under a bilateral arrangement between Bangladesh and Myanmar\".\"UNHCR is not involved in arranging this visit. However, we reiterate that every refugee has an inalienable right to return to their home country,\" agency spokesperson Regina De La Portilla told AFP.\"Refugee returns must be voluntary, in safety and dignity,\" she added. \"No refugee should be forced to do so.\"Myanmar junta chief Min Aung Hlaing, who has dismissed the Rohingya identity as \"imaginary\", was head of the armed forces during the 2017 crackdown.The International Court of Justice is probing allegations of rape, murder and arson against entire Rohingya villages by Myanmar's security forces during that year's violence.The repatriation plan agreed to in 2017 failed to make any significant headway in the years since, partly over concerns the Rohingya would not be safe if they returned."
    ]
}