{
    "articleURL": "/wires/aap/article-12046039/Monkeypox-case-Sydney-6-months.html",
    "content": [
        "Health officials are urging men who have sex with other men to be aware of symptoms for Mpox, also known as monkeypox, with the first NSW case in six months detected in Sydney.",
        "South Eastern Sydney Public Health Unit Director Dr Vicky Sheppeard says while the state's vaccination program against the infectious disease has been very successful, the virus will continue to show up in Australia while it circulates overseas.All cases of Mpox in NSW have occurred in men who have sex with men and most were caught when travelling in other countries.The man found to be infected with the virus this month had no associations with overseas travel, leading to concerns there could be local transmission.There were 56 Mpox cases found between May and November 2022 in NSW.Dr Sheppeard said there has been a strong uptake in Mpox vaccination and urged anyone who had not yet received the jab to get it if in an at-risk group.\"While our vaccination program against Mpox, combined with people at risk monitoring for symptoms, has been very successful in controlling the spread in NSW, as long as cases continue in other countries there is a risk of new cases here,\" Dr Sheppeard said.She urged anyone experiencing symptoms to see their GP or sexual health clinic.Symptoms of the virus, usually endemic to a few African countries, include mild fever, headache, fatigue or swollen lymph nodes.The most obvious symptom is the presence of small pimple-like skin lesions, which spread and develop pus then crust over.",
        "Since May 2022 there has been a global outbreak of Mpox with over 87,000 cases reported, mainly affecting gay or bisexual men.While overseas there have been some deaths associated with it, all cases in NSW have recovered and very few have required hospitalisation.Cases nationally stabilised in late September, with an outbreak in Victoria declared as having \"turned around\" that month.Federal Health Minister Mark Butler said then the country had seen about 135 infections in total since the virus arrived.The government signed an agreement last August for almost half a million doses of monkeypox vaccine with biotech company Bavarian Nordic."
    ]
}