{
    "articleURL": "/news/article-12054091/Boy-16-stabbed-death-three-older-boys-leaves-school-senseless-attack.html",
    "content": [
        "Schoolboy died on Friday afternoon outside Kelmscott School in WalthamstowThe boy bled to death in the street as other pupils watchedA 16-year-old schoolboy bled to death in the street after being ambushed outside his school in a 'senseless knife attack'. ",
        "The student at Kelmscott School in Walthamstow, east London, died after being stabbed by three 'older kids' who chased him into a nearby tyre shop. He tried to run from his attackers, who were 'waiting for him' as he left school on Friday afternoon, but died just a short distance away, as other pupils watched.Emergency workers were unable to save the year 11 pupil, who died in the street on on Friday at 4.39pm, after being stabbed in the stomach three times.The attack, which comes as the second killing of a 16-year-old in Walthamstow within the past five years, has shocked those who witnessed it. ",
        "One witness to the scene said he saw one of the assailants get out of a white Hyundai shortly before the attack. Another local business owner said: 'He was a Year 11 kid. There were three other kids older than him. They were waiting for him.'They chased him. He ran and when he got to the tyre shop they stabbed him three times in the stomach and he bled to death.'Head teacher Sam Jones said the attack marked the 'darkest of days' for the Kelmscott School community.'A Kelmscott student was tragically killed in a senseless knife attack,' the headteacher said. 'Kelmscott is a large and tight-knit family and this loss will be felt for a long time to come.",
        "'Hold those that you love close this evening. I know we will come together as a community and support one another through this.'Chief Superintendent Simon Crick, who leads North East Command at the Metropolitan Police, said he was 'totally devastated by the loss of a young man's life'.No arrests have been made and road closures and cordons remain in place around the scene.The local business owner said that gang-related violence had become a common occurrence in Walthamstow, claiming it had gone from 'bad to worse'.The victim is the second 16-year-old killed in the area in recent years. Amaan Shakoor was shot in the head near Kelmscott school in April 2018.The family of Mr Shakoor, whose killer has never been found, offered a £50,000 reward for any information in January 2023.There were 45,000 knife crimes in England and Wales in the year ending March 2022 - 9% higher than the previous year and 34% higher than in 2010 to 2011, figures from the Office for National Statistics show."
    ]
}