{
    "articleURL": "/sport/football/article-12059021/Thierry-Henry-reveals-Xavi-place-arrival-Barcelona.html",
    "content": [
        "Thierry Henry played three seasons for Barcelona after leaving Arsenal in 2007The Frenchman has revealed being humbled by Xavi after arriving at the clubIt came after he made fun of Barcelona's famous 'more than a club' mottoThierry Henry has revealed being put in his place by Xavi after signing for Barcelona in 2007.",
        "The Frenchman moved to the Nou Camp for £21 million in 2007 after scoring 226 goals and winning the Premier League twice with Arsenal.His impressive reputation does not appear to have protected him from an early humbling at his new club, though.'When I arrived at Barça, I laughed at the 'More than a club' registered in the gallery,' Henry told Amazon Prime.'Xavi put me back on track, he told me you haven't won anything here… When you've won, you can talk'\"'",
        "The midfielder, who went on to play 767 games for Barca, was two years younger than the incoming striker but already a senior player at the club.At 27, he had won three La Liga titles and the Champions League. Xavi spent another eight seasons at the club and won 27 major trophies in his career, including the World Cup.He returned to the Nou Camp as manager in 2021 and has now taken the Catalan club to the brink of another league title. Henry told the anecdote to explain how rules should be enforced within a dressing room, as he explained:  'In general, it is the elders who give you the rules when you arrive at the club. 'When I arrived at Arsenal, it was impossible to do what I wanted to do. You were fined if you ever overstepped a bit in your role.' ",
        "The discussion started as Henry considered Paris Saint-Germain fined and suspended Lionel Messi after undertaking a promotional visit to Saudi Arabia without permission.The issue has highlighted an apparent souring of the relationship between the World Cup-winner and PSG, with reports since emerging that he is set to leave the club in the summer.Henry admitted Messi was wrong to miss training, and added that the trip may have hurt the club's 'pride'. The French giants performed well in the Argentine captain's absence on Sunday, as they beat Troyes 3-1 to move within three wins of the Ligue 1 title."
    ]
}