{
    "articleURL": "/wires/reuters/article-12045681/Copper-rises-dollar-slides-soft-China-demand-weighs.html",
    "content": [
        "May 4 (Reuters) - Copper prices rose on Thursday, as a weaker dollar made greenback-priced metals less expensive to holders of other currencies, but a weaker-than-expected demand recovery in top consumer China prevented a stronger rally.",
        "Three-month copper on the London Metal Exchange advanced 1.2% to $8,568 a tonne by 0738 GMT, while the most-traded June copper contract on the Shanghai Futures Exchange closed almost flat at 66,920 yuan ($9,678.91) a tonne.The dollar slipped against most major currencies after the U.S. Federal Reserve opened the door to a pause in its aggressive tightening cycle.However, metals prices were still under pressure due to weaker-than-expected demand in top consumer China.China's factory activity unexpectedly contracted in April as orders fell and poor domestic demand dragged on the sprawling manufacturing sector, which uses a vast amount of metals.\"The market has become increasingly frustrated with the slow rebound in economic activity in China. This has seen investors reduce their net bullish positions on LME copper to a six-week low,\" said ANZ analysts in a note.Citi analysts said they were bearish on copper and downgraded the 0-3-month price forecast to $8,000 a tonne, from $8,500 a tonne previously.\"Weak global demand and high finished goods inventories, together with improving copper supply (scrap sector de-bottlenecking, mine supply debottlenecking, strong China refined supply), mean that a copper stock out is extremely unlikely in 2023 in our view,\" they said in a note.LME aluminium was almost unchanged at $2,322 a tonne, nickel increased 0.6% to $24,895 a tonne, lead was up 0.4% at $2,138.50 a tonne while while zinc fell 0.1% to $2,627.50 a tonne and tin declined 2.8% to $26,020 a tonne.",
        "SHFE nickel jumped 2.9% to 187,280 yuan a tonne, tin leaped 0.8% to 211,000 yuan a tonne, lead was up 0.8% at 15,370 yuan a tonne while zinc fell 0.5% to 21,100 yuan a tonne and aluminium dipped 0.1% to 18,415 yuan a tonne.Nickel inventories in SHFE warehouses &amp;lt;NI-STX-SGH&gt; fell to a record low of 1,426 tonnes on Friday, supporting prices.For the top stories in metals and other news, click or ($1 = 6.9140 yuan) (Reporting by Mai Nguyen in Hanoi; editing by Uttaresh Venkateshwaran and Nivedita Bhattacharjee)"
    ]
}