{
    "articleURL": "/sciencetech/article-12047259/AI-Meet-couples-using-artificial-intelligence-WEDDINGS.html",
    "content": [
        "Lynnzee Highland used ChatGPT to write wedding vows ahead of her big dayMeanwhile, Justin Fineberg wrote a speech for his friend's wedding using the botWedding planners are now also recommending ChatGPT for wedding supportWriting speeches, sending out invites and finding the perfect dress are among the numerous things to juggle when planning a wedding.",
        "But now, many couples are saying 'AI do' to ChatGPT, as they rely on artificial intelligence to pull together their big day. One surprised bride-to-be admitted the bot's ability to write touching wedding vows was better than her own when tested in the lead up to her wedding.In a TikTok, Lynnzee Highland from Seattle prompted ChatGPT to write words that were 'funny and romantic', adding: 'My fiance really knows how to make me laugh. We love running together even though I can hardly keep up. 'We also love hiking and travel. I'm so proud of everything he's accomplished and excited for everything we will accomplish together.'",
        "At first, the bot produced some cheesy results, drawing to chat-up lines such as 'you're the Robin to my Batman' or 'the peanut butter to my jelly'.But when Lynnzee refined her request, the results were shockingly personal with a touch of romance.Her vows read: 'As we stand here on this special day, I can't help but feel overwhelmed with happiness and love. From the moment I met you, you've made me laugh like no one else can.'Even though I can hardly keep up with you when we're running, I always feel like we're in perfect sync when we're together. And when we're hiking or travelling, I know that no matter where we go, it's the journey with you that makes it truly unforgettable.",
        "'I'm so proud of everything you've accomplished and I can't wait to see what we'll accomplish together. As your partner, I vow to support you through all of life's ups and downs. To be your rock when you need me and celebrate our successes along the way.'As we start this chapter of our lives, I promise to love you unconditionally, to be honest with you always and to never take for granted the beautiful life we're building together.'Meanwhile, AI strategist Justin Fineberg also used the bot to write a speech for his friend's wedding.In a TikTok he said: 'The pressure is totally on because I am not a good speech writer. So I'm putting \"write me a wedding speech for my best friend\".'",
        "Justin referred to several past memories in his prompt, including the time he 'lost his keys in Italy' and how 'his wife is a much better cook'.The bot touched on these moments in its speech, writing: 'One of my favourite memories with [name] was when we took a trip to Italy together. He is the most organised person I know, but somehow he managed to lose his car keys on the first day of our trip.'Instead of panicking, [name] just laughed it off and found a solution. Of course, that solution involved hotwiring a scooter and driving it through the winding streets of Rome.'",
        "It then continued: '[Name] may be a great filmmaker, but he will never be able to hold a candle to Haley's cooking skills. In fact, I think we should all just be grateful that she agreed to marry [name] despite his complete lack of culinary ability.' These TikToks come at a time when even wedding planners are recommending ChatGPT for those intending to tie the knot.Agency Getting Married in Denmark praised the bot's ability to give 24-hour support - sharing guidance when a human planner isn't around.Picking the perfect vendors, venue and creating a 'wedding vision' were among numerous tasks the bot could take care of, if asked.ChatGPT can also provide dress recommendations and even help you draft invitations. ",
        "Director and co-owner, Rasmus Sørensen, told MailOnline: 'ChatGPT can help you plan your dream wedding in Denmark by giving you personalised advice and guidance based on what you want and love. 'It can find you the perfect venue, match you with the right vendors, and take care of the paperwork and legalities for you. You can chat with it anytime you need support or have questions about your wedding. It will save you time and stress by giving you instant responses and guidance.'The firm has not yet responded to questions surrounding what toll this may take on the business-side of wedding planning in future. ",
        "However, its director did say: 'You can relax and enjoy your engagement and wedding day while it handles everything for you. 'AI seems to be the ultimate assistant for wedding planning and I encourage you to give it a try and see how it can make your wedding planning experience stress-free and unforgettable.'Despite its usefulness, some have raised concerns over the impacts of using ChatGPT in relationships.One Twitter user said: 'What are the most morally corrupt things you could use ChatGPT for? I'll start: wedding vows.'Another added: 'Holy smokes! Is nothing sacred?! Newlyweds are using #ChatGPT to write vows, toasts, etc.' ",
        "Meanwhile, relationship psychologist Linzi Kavanagh also added that vows produced by a robot could seem 'cold, impersonal and meaningless'.  She told MailOnline: 'Whilst some people may have been planning for their wedding since they were a child and relish the idea of finally getting to do it for real, not everyone who has to plan a wedding has the skills, knowledge or even the want to organise such an event. 'ChatGPT can lessen the stress of this, make it a bit more fun and enjoyable and possibly even reduce the arguments between couples in the run-up to the big day.'But what about using ChatGPT to write your vows and speeches? Some people's immediate reaction to that is often a hard \"no\". Vows written essentially by a robot could be viewed as cold, impersonal and meaningless. ",
        "'If there has been no big effort to write from the heart how can those words be spoken from the heart? However is there a difference between googling \"romantic wedding vows\" and copying out what you find online? Or buying some slushy Hallmark cards and merging together what you find inside those?'As a result, Ms Kavanagh advises that both partners need to be on board with using the bot before it is put to the test in a wedding scenario.She added: 'If it comes out down the line in their marriage that whilst one of them sat for hours, listening to their heart and pouring out what was coming from it down onto paper, them rewriting several drafts to get it just perfect and the other spent precisely 2.5 seconds printing something from ChatGPT, the efforts may feel unmatched. 'So honesty is the best policy here. If one party is really struggling and wants to use the help of ChatGPT, it should be discussed together openly and honestly.'",
        "Artificially intelligent chatbots have become so powerful they can influence how users make life or death decisions, a study has claimed.Researchers found people's opinion on whether they would sacrifice one person to save five was swayed by answers given by ChatGPT.They have called for future bots to be banned from giving advice on ethical issues, warning the current software 'threatens to corrupt' people's moral judgement and may prove dangerous to 'naïve' users.The findings – published in journal Scientific Reports - come after the grieving widow of a Belgian man claimed he had been encouraged to take his own life by an AI chatbot.Others have told how the software, which is designed to talk like a human, can show signs of jealousy - even telling people to leave their marriage."
    ]
}