{
    "articleURL": "/news/article-12050973/British-teenager-19-collapses-shower-dies-Paris-holiday-telling-aunt-Im-fine.html",
    "content": [
        "Rhea Hourigan, 19, suffered a mystery cardiac arrest while on holiday in ParisDurham University student had no known conditions and had been out all dayA British teenager collapsed in the shower and died while she was visiting her aunt in Paris - moments after she said she was 'fine'.",
        "Rhea Hourigan, 19, suffered a mystery cardiac arrest, the cause of which remains unknown, as she was getting ready for bed.A Durham University student, Rhea had been 'thriving' before her sudden death and had decided to travel to Paris after a few days at home in Birmingham over the Easter holidays.The apparently healthy teenager had been out all day seeing the sights in the French capital on an electric bike before tragedy struck, with her heartbroken mother saying her only comfort was that her daughter 'didn't suffer'.Paramedics raced to the scene where, despite their best efforts, Rhea's life couldn't be saved. She was pronounced dead in the early hours of April 29, according to a GoFundMe page started to support her family.",
        "The cause of the teenager's cardiac arrest is still not clear a week later, with reports saying she was not known to have suffered from any conditions and that there was no history of heart failure in her family.Rhea's mother Jo paid tribute to her daughter on Facebook, saying: 'She had so many plans, dreams and aspirations she was our bright shining star. 'She hadn't even finished her first year of uni which she absolutely loved up in Durham and had made so many good friends. ",
        "'Our only comfort is that she was so happy and had such a brilliant day seeing the sights of Paris, she wouldn't have known what had happened and didn't suffer.'Polly Townhill, a close friend of Jo, told The Mirror that Rhea's aunt had been worried after her niece had been in the bathroom for a long time.'Her auntie knocked to say \"Is everything all right you coming out?\" She answered her, Rhea said: \"Yeah, yeah, I'm on my way out.\" Then she heard a bang...' Polly said Rhea had full travel insurance but it hasn't covered what the family will need, with costs being pushed up by necessities like an interpreter.'There's so much red tape over there and they have to treat her death as mitigating circumstances,' said Polly.",
        "'It would still be a tragedy without this, but her parents cannot see their child. They are desperate to bring her home.''Those are the two main things I know and it means that they haven't been able to have an autopsy. Jo has just faced brick wall after brick wall.'Rhea's family travelled to France after hearing of her death and have since returned, with her body remaining there ahead of an autopsy next week, according to a family friend.",
        "It is hoped Rhea's body will be repatriated shortly after the autopsy is complete. ",
        "To help with costs incurred during the ordeal, friends and family have raised a staggering £23,000 within just one day of a GoFundMe page being set up for Rhea's parents Jo and Dom.Dawn Buchanan, who started the page, said that Rhea's death has left her parents Jo and Dom, grandparents, aunts, uncles and brother Joel, devastated. Tributes have poured in for the teenager, who had a job as a cashier at a Nando's branch near her home in the West Midlands.Lauren Cutts, a friend of Rhea's, shared on social media: 'Last Friday we lost Rhea Hourigan who was beautiful, kind, ambitious so much more. Please take a moment to read about her and donate if possible. Rest in peace Rhea.'Friends of Rhea's parents shared their personal heartbreak at the news on Facebook, and urged people to support the 'devastated' family.'I hope everyone can contribute,' one said of the fund, describing Rhea as a 'beautiful and kind young lady with the world at her feet.'"
    ]
}