{
    "articleURL": "/sport/formulaone/article-12044779/Aussie-billionaire-reveals-plan-launch-Formula-One-team-female-driver-decades.html",
    "content": [
        " Aussie billionaire wants to launch new F1 team David Dicker wants female F1 driver to race Dicker says Jamie Chadwick could fit the bill An Aussie tech billionaire has revealed his extraordinary plan to launch his own Formula One team out of a remote location in New Zealand with the sport's first female driver in decades.",
        "David Dicker, the head of Dicker Data Australia, has founded Rodin Cars - a passion project which manufactures small boutique race cars out of Christchurch on the country's South Island.The wealthy tech guru has recently bought into well-known racing team Carlin, which runs in Formula 2, Formula 3 and Formula 4.Dicker has also funded W Series champion Jamie Chadwick during her career - and has stated that he'd be happy to put her in his F1 car.He wants to expand Formula 1's presence away from the mainly Europe-based teams, stating he has more than $465million in resources to fund the bid.",
        "'We'll make the whole car here and we guarantee to put a woman in one of the seats,' Dicker told Motor Sport Magazine.'We'd be the only team that's got a full junior program. We've been covering the entire spectrum from F4 all the way up to F2 and no one else is even close to doing it.'A lot of people would be really interested in getting a team that was based in New Zealand into the F1 program. It'd do a lot for Formula 1.'To obtain a FIA Super License needed to compete in F1, a minimum of 40 points is required over three previous racing seasons.",
        "Chadwick, who was won the W series three times, is the only female driver who currently qualifies. The deadline for an expression of interest from Dicker has reportedly been extended from April 30 to May 15.Two new teams could enter Formula 1 as early as 2025, although options are available for 2026 and 2027.'It's obviously a crazy scheme and I can't imagine that we'd be successful,' said Dicker.",
        "'But if you look at it, if you look at our actual resources, we actually have a very compelling offering.'I've been thinking about it for a couple of months to be honest. Just sort of oscillated back and forth about whether to apply or not.'We actually have a very compelling offering because we'll be making our own power unit'I'm sure none of the other guys that are pitching in for now I'm going to make their own power unit.'We've already got a pretty sophisticated facility. We've got a tonne of gear. So, you know, we've got pretty much all the equipment we already need now to build the car.'"
    ]
}