{
    "articleURL": "/sport/football/article-12050791/Former-Real-Madrid-Deportivo-La-Coruna-manager-Arsenio-Iglesias-dies-aged-92.html",
    "content": [
        "Arsenio Iglesias is a legend of Spanish football having managed several clubsHe is best known for his four separate spells in charge of Deportivo La CorunaIt was announced on Friday that Iglesias had passed away at the age of 92 Former Real Madrid and Deportivo La Coruna manager Arsenio Iglesias has passed away at the age of 92.",
        "The legendary and popular coach took charge of several Spanish clubs during a managerial career that lasted for 41 years from 1967-2008.He is most well-known for his time with Deportivo where he had four separate spells in charge and won the Copa del Rey in 1995. After being born in Galicia in 1930, he leaves a legacy of being one of the greatest Spanish managers of all-time.During his playing days, Iglesias represented clubs including Deportivo, Sevilla and Granada as a forward, before he retired in 1966.",
        "He moved into management the following year, taking charge of Deportivo's B team - Deportivo Fabril.He then moved up into the senior role in 1971 - which was one of four different stints he had in charge of the club.",
        "1967–1970: Deportivo Fabril1971–1973:  Deportivo La Coruna1973–1977:  Hercules1977–1978: Real Zaragoza1978–1979: Burgos1979–1980: Elche1980: Almería1982–1985: Deportivo La Coruna1986–1987: Compostela1988–1991: Deportivo La Coruna1992–1995: Deportivo La Coruna1996: Real Madrid2005–2008: Galicia",
        "In a statement on their website paying tribute, Deportivo said: 'Arsenio Iglesias, the person with the greatest direct influence in the 116 years of history of RC Deportivo, has died May 5 at the age of 92.'Arsenio is one of the most notable characters in the centenary deportivist history, linked to the club in different stages during a quarter of a century.'",
        "Iglesias had a major part to play in transforming Deportivo from a second tier side to LaLiga title challengers, ultimately laying the foundations for their historic Spanish title in 1999-2000 after he had moved on.He also had a short spell in charge of Real Madrid when he was parachuted into to save their season in 1995-96 while Los Blancos were enduring a torrid time.After news of his passing, Real also said in a statement: 'Real Madrid C. F., its President and its Board of Directors deeply regret the death of Arsenio Iglesias, a legendary player and coach of Spanish football who coached Real Madrid in the 1995-1996 season.'Real Madrid would like to express its condolences and affection to his family, his teammates, his clubs and all his loved ones.'Arsenio Iglesias, who has died at the age of 92, is a RC Deportivo legend, a club with which he won the Copa del Rey as coach in 1995. May he rest in peace.'In total, he had 10 different managerial roles in his career, with his only other honour coming in 1977-78 when he won the Segunda title with Real Zaragoza. Real was his last club job, but he returned to management for a three-year period from 2005 to 2008 when he took charge of Galicia - an autonomous community of Spain - and where he hailed from.",
        "Its national team are not officially recognised by FIFA or UEFA, meaning Iglesias only oversaw friendly matches."
    ]
}