{
    "articleURL": "/wires/pa/article-12052713/Couple-getting-married-coronation-day-seven-year-engagement.html",
    "content": [
        "After postponing their wedding twice, a West Midlands couple are now sharing their special day with the King’s coronation following a seven-year-long engagement.",
        "Groom Bryan Russell, 57, and bride Wendy McEnery, 56, have been forced to cancel their wedding on two occasions due to the Covid-19 pandemic and Mr Russell losing his job.The Halesowen couple had set the date for their big day for the third time when the date of the coronation for the King was announced.Mr Russell said that upon learning the date of the coronation: “My words were, ‘He can move his coronation before I move our wedding day’.”",
        "Mr Russell said it would be a “shame” that the couple will not be able to watch the historic event as “we are royalists at the end of the day”.He added: “We watched the Jubilee celebrations. We watched the Queen’s funeral. We’ve watched the royal weddings, but I’m not cancelling the third time.”He said some guests may watch the coronation on television during the day, and the wedding venue has hung Union Jack bunting to celebrate the coronation – but the royal event “will be at the back of our minds”.Both the bride and groom have been married before and wanted to celebrate their union at Haden Hill House with a “very relaxed wedding”.Mr Russell said: “It’s about meeting families, two families coming together and then friends on the night.”",
        "The couple met on an internet dating site, with Mr Russell saying: “We’d been chatting for several months and we decided to meet.”The groom said Ms McEnery “never thought I was going to ask her to marry because I said I’ll never get married again, so it was a shock to everybody”.He ultimately decided to pop the question because she is the “right one for me”.On the eve of the wedding, Mr Russell said that his significant other was “panicking” while he was feeling “relaxed” about the day.“I’m looking forward to it,” he said."
    ]
}