{
    "articleURL": "/wires/reuters/article-12061539/No-ships-inspected-Sunday-Monday-Black-Sea-grain-deal--UN.html",
    "content": [
        "By Michelle Nichols",
        "UNITED NATIONS, May 8 (Reuters) - The United Nations said no ships were inspected on Sunday or Monday under a deal allowing the safe Black Sea export of Ukraine grain, which Moscow has threatened to quit on May 18 over obstacles to its own grain and fertilizer exports.The U.N. and Turkey brokered the Black Sea export agreement in July last year to help tackle a global food crisis that has been worsened by Moscow's war in Ukraine. Officials from Russia, Ukraine, Turkey and the U.N. make up a Joint Coordination Centre (JCC) in Istanbul, which implements the deal.The United Nations said on Monday that so far nearly 30 million metric tonnes of grain and foodstuffs had been exported from Ukraine under the Black Sea deal, including nearly 600,000 metric tonnes of grain in World Food Programme vessels for aid operations in Afghanistan, Ethiopia, Kenya, Somalia, and Yemen.\"In 2022, Ukraine supplied more than half of WFP's global wheat grain procurement, as it was the case in 2021,\" the U.N. said in a statement.Ukraine had been putting forward daily a list of ships to be authorized by the JCC. Once approved, ships are inspected by JCC officials near Turkey before traveling to a Ukrainian Black Sea port via a maritime humanitarian corridor to collect their cargo and return to Turkish waters for a final inspection.",
        "\"The JCC conducted no inspections yesterday and today,\" the U.N. said on Monday, adding that the U.N. and Turkey were \"working closely with all sides with the aim to facilitate movements and inspections of inbound and outbound vessels ... while discussions for the future of the Initiative continue.\"SHIPS WAITINGSenior officials from the four parties are due to meet in Istanbul later this week for talks. Russia has said it will not extend the pact beyond May 18 unless a list of demands is met to remove obstacles to its own grain and fertilizer exports. To help convince Russia to allow Ukraine to resume Black Sea grain exports, a three-year pact was also struck in July 2022 in which the U.N. agreed to help Moscow facilitate those shipments.While those Russian exports are not subject to Western sanctions imposed following the February 2022 invasion of Ukraine, Moscow says restrictions on payments, logistics and insurance are a barrier to shipments.In an excerpt of a letter seen by Reuters last month, Russia told its JCC counterparts it will not approve any new vessels to take part in the Black Sea deal unless the transits will be done by May 18 - \"the expected date of ... closure.\"Ukraine has said that 62 vessels are waiting to travel to its ports, of which eight have been put forward for JCC authorization, the U.N. said on Monday. The JCC has not agreed to any new authorizations for the past several days.",
        "When it comes to inspections of already authorized ships, the U.N. said there were currently 26 outbound vessels loaded with more than 1.1 million metric tonnes of grain and foodstuffs waiting in Turkish waters.There were 14 vessels in the Ukrainian ports loading some 600,000 metric tonnes of grain and foodstuffs, the U.N. said, while another three ships - two outbound and one inbound - were in transit. Those 17 ships would also need to be inspected when they returned to Turkish waters.The Black Sea export deal also provided for the export of fertilizer, including ammonia, but there had been no such exports so far, the United Nations said. (Reporting by Michlle Nichols; editing by Richard Chang and Stephen Coates)"
    ]
}