{
    "articleURL": "/wires/reuters/article-12059299/India-says-African-cheetahs-two-deaths.html",
    "content": [
        "NEW DELHI, May 8 (Reuters) - Two of 20 cheetahs brought from southern Africa to India to re-establish the species in the country have died this year but the rest are well, the government said on Monday, although it said the unprecedented project had its challenges.",
        "The cheetahs were moved to central India's Kuno National Park in September and February in the initial phase of a plan to revive the species that disappeared from the country 70 years ago.The deaths raised concerns about the effort that Prime Minister Narendra Modi has championed, but that some conservationists have called a \"vanity project\" that overlooks the fact the African cheetah is not native to South Asia.The sub-species is similar to but distinct from the critically endangered Asiatic cheetah now only found in Iran.The government said a six-year-old female cheetah from Namibia became ill in late January and died in March, after suffering from chronic renal insufficiency.An adult male of unknown age from South Africa developed acute neuromuscular symptoms in late April and died, just over a week after he was released from his quarantine camp into a larger acclimatisation camp.\"The other cheetahs have been closely monitored and none of them has shown any similar symptoms,\" the Ministry of Environment, Forest and Climate Change said in a statement.\"They all appear to be perfectly healthy, are hunting for themselves and displaying other natural behaviours.\"The ministry said a team of experts from South Africa and India visited the park in Madhya Pradesh state on April 30 and submitted a report to it on the way ahead.",
        "\"It is not surprising that a project of this magnitude and complexity would face many challenges,\" the ministry said. \"This is the first intercontinental re-introduction of a wild, large carnivore species and therefore there is no comparable historical precedent.\" (Reporting by Krishna N. Das; editing by Barbara Lewis)"
    ]
}