{
    "articleURL": "/wires/reuters/article-12053007/LATAM-POLITICS-TODAY-Paraguay-candidate-Cubas-arrested-post-election-protests.html",
    "content": [
        "Lula calls for summit in Brasilia to revive UNASUR",
        "Paraguay president-elect to 'strengthen' ties with TaiwanMigrant flows won't increase after Title 42 ends, Mexico saysMay 5 (Reuters) -The latest in Latin American politics on Friday:Paraguay presidential candidate Cubas arrested after post-election protestsASUNCION - Paraguayo Cubas, who placed third in Paraguay's presidential elections,has been arrestedfollowing post-election protests, authorities said.Cubas led protests to dispute Sunday's election results and call for a recount, though international organizations said there was no reason to doubt the integrity of the vote.Cubas has been charged with \"disrupting the peace\" and other crimes, according to an arrest warrant issued by the attorney general's office.Lula calls South American summit in Brasilia to revive UNASURBRASILIA - Brazilian President Luiz Inacio Lula da Silva invited South America's presidents to a summit in the country's capital, Brasilia, on May 30 to discuss the re-launching of the Union of South American Nations (UNASUR).Founded in 2008 to counter U.S. sway in the region, the regional bloc became defunct in recent years when several of the region's governments moved to the right. Argentina, Brazil's southern neighbor, said in March it would return to the bloc.\"The idea is to relaunch (UNASUR),\" a source in Brazil's foreign ministry told Reuters. \"Brazil's idea initially is to assess the other countries' positions on the way forward.\"",
        "Colombia's Petro acting like a dictator, says top prosecutorBOGOTA - Colombian Attorney General Francisco Barbosa accused President Gustavo Petro of disrespecting the judiciary and assuming the role of a \"dictator,\" in the latest clash between the two.The accusation followed comments by Petro to journalists asserting that he is Barbosa's \"boss,\" amid a dispute over how to prosecute criminal gangs accused of drug trafficking.Colombia's three branches of government are independent and autonomous, according to the country's constitution.\"(Petro) changes his democrat's suit and begins to put on a dictator's suit, an autocrat's suit,\" Barbosa said.Paraguay president-elect commits to strengthen ties with TaiwanASUNCION - Paraguay's president-elect, Santiago Pena, said he would continue to strengthen his country's \"historic ties\" with Taiwan following a call with the Asian country's leader after winning Sunday's election.The countries' diplomatic relations of more than six decades had been in the spotlight before the election, with opposition candidate Efrain Alegre telling Reuters he planned to move his country closer to China to boost agricultural ties if he won.Migrant flows won't increase after Title 42 ends, Mexico saysMEXICO CITY - Mexican President Andres Manuel Lopez Obrador said migration flows would not increase once U.S. border restrictions imposed during the COVID-19 pandemic are lifted next week.",
        "The so-called Title 42 restrictions, which allow U.S. authorities to rapidly expel non-Mexican migrants to Mexico without the chance to seek asylum, are due to expire on May 11. (Compiled by Brendan O'Boyle and Steven Grattan; Editing by Alistair Bell)"
    ]
}