{
    "articleURL": "/wires/ap/article-12052097/Kansas-looses-legal-fight-voting-law-passed-2021.html",
    "content": [
        "MISSION, Kan. (AP) - Kansas has lost a legal fight over one of the voting laws that its Republican-led Legislature passed in the wake of the 2020 election.",
        "U.S. District Judge Kathryn Vratil ruled Thursday that it was unconstitutional to make it a crime for groups to include voter´s name, address and other information on advance ballot applications.Two national nonprofit groups, VoteAmerica and the Voter Participation Center, sued after two voting laws were passed in 2021 over the veto of Democratic Gov. Laura Kelly. One of them included the restriction on prefilling ballots, even if the voter provided the information and requested an advance mail ballot application.The groups, whose mission is to promote voting among traditionally underserved groups, including young and minority voters, argued that there is a higher response rate when the group prefills the applications. Nearly 70,000 Kansas voters submitted an advance mail voting application provided by the Voter Participation Center to their county election official in the 2020 general election, the lawsuit said.But the state countered that the groups´ mailing efforts led to a flood of duplicate applications during the 2020 presidential election. Election officials testified that the flood of applications led to confusion, with many voters repeatedly requesting mail-in ballots.Vratil acknowledged in the ruling that some election officials likely felt \"overburdened\" as the pandemic sent mail-in votes soaring. More than three times as many Kansans voted by mail in 2020 compared to 2018.",
        "\"Because of the highly contested nature of the election, in addition to the pandemic, many voters were concerned that their mail ballots would not be received and counted, and requested duplicate ballots for peace of mind,\" Vratil said.She said that in that environment, the surge in duplicate ballots couldn't be solely blamed on the prefilled ballots that voting groups mailed out to try and spurn turnout.In fact, she wrote, having the ballots prefilled might even prove \"more helpful than harmful to overburdened elections officials\" and found that the restriction infringed on the group's First Amendment free speech rights.Whitney Tempel, a spokeswoman for Secretary of State Scott Schwab, said the office didn't immediately have a comment.Another law passed in 2021 also is being challenged in court. In March, the Kansas Court of Appeals reinstated the suit filed by Loud Light, the League of Women Voters of Kansas, the Topeka Independent Living Resource Center and the Kansas Appleseed Center for Law and Justice.They challenged provisions of a law that limit how many advance mail ballots individuals can collect and require election officials to match the signatures on an advance ballot to a person´s voter registration record. A Shawnee County judge originally dismissed it after finding the restrictions were reasonable."
    ]
}