{
    "articleURL": "/wires/ap/article-12040013/Former-CEOs-failed-banks-testify-Senate-panel.html",
    "content": [
        "WASHINGTON (AP) - The former top executives of two failed banks will testify before Congress this month as lawmakers dig into what caused a series of collapses at mid-sized financial institutions.",
        "The Senate Banking Committee indicated Tuesday that it will hold a hearing May 16 with Silicon Valley Bank´s former CEO, Gregory Becker, as well as Signature Bank´s former chairman and co-founder, Scott Shay, and its former president, Eric Howell.The committee, which is chaired by Sen. Sherrod Brown, an Ohio Democrat, will also hold two other hearings this month on the collapse of the banks. Several industry experts will testify at a hearing on Thursday. Then on May 18, Michael Barr, the Federal Reserve's chief regulator, and Martin Gruenberg, chairman of the Federal Deposit Insurance Corp., will testify.The Fed board was the primary regulator for Silicon Valley Bank in California, while the FDIC was the primary federal regulator for Signature Bank in New York.Barr issued a report last month that blamed Silicon Valley Bank´s collapse on poor management, watered-down regulations and lax oversight by Fed staffers. It called for the industry to do a better job policing on multiple fronts to prevent future bank failures.A separate report from the FDIC said the failure of Signature Bank was likely fallout from the collapse of Silicon Valley Bank, but also found regulatory deficiencies at FDIC, notably insufficient staffing to adequately supervise the bank.",
        "Senators have directed plenty of ire at the banking industry, regulators and a roll-back of financial stress tests in 2018. But between Democrats and Republicans in a closely divided Congress, there is little agreement on whether any legislation is needed.",
        "Brown, alongside the Senate Banking Committee's top Republican, Sen. Tim Scott, sent a letter in March to executives at Silicon Valley Bank and Signature Bank telling them that they would be expected to testify and warning \"you must answer for the bank´s downfall.\""
    ]
}