{
    "articleURL": "/news/article-12052651/Was-Sue-Gray-undercover-British-spy-ran-pub-heart-IRA-bandit-country.html",
    "content": [
        "Sue Gray ran Northern Ireland pub in a violent area during Troubles due to IRAQuestions raised over whether she was a spy for the British government At the height of the Troubles, those with a cut-glass English accent would have done well to survive a night at the Cove Bar with both kneecaps intact.",
        "The single-storey roadside pub was in Northern Ireland, just ten minutes from the border with the Irish Republic in a part of rural County Down that had become so violent it was widely known as 'bandit country'.Peppered with roadblocks and watchtowers, the militarised zone was a hotbed of sectarian violence. Catholic extremists would murder farmers' sons in an effort to cleanse villages of Protestants. Loyalist gangs would carry out savage revenge attacks.To this day, local police stations are still protected by razor wire and mesh fences, a legacy of the 1985 IRA mortar attack that killed nine RUC officers and injured 40 others.Yet there was one well-spoken young Englishwoman who didn't just cross the threshold of the Cove Bar, she actually ran it.",
        "The landlady's name was Sue. She pulled pints while her husband, Bill Conlon, the lead singer of a country and western band called Emerald, was in charge of entertainment.Fast-forward 40 years, and Sue Conlon is now far better known by her maiden name, Sue Gray. Arguably the most famous civil servant in Britain, she presided over the 'Partygate' inquiry into the reports of lockdown parties held in 10 Downing Street.But 65-year-old Gray recently became the most controversial, too — after agreeing to become Keir Starmer's chief-of-staff in circumstances that have sparked two investigations and this week culminated in an explosive political row.",
        "More on that later. But first, back to the Cove. It closed down roughly a decade ago and is now a children's nursery called Kidz Universe. Its pebble-dashed walls are painted a garish shade of yellow and windows have been jollified with images of Disney characters.Gray has occasionally recalled with affection her time in charge of the Cove Bar during the mid-1980s. When she came to Ulster in 2018, to take up a senior role in the devolved Stormont administration, she told an interviewer: 'I loved it at the time, [but] I'd never do it again.'Asked how she had found being a landlady, she said: 'It's a very sociable occupation, very hard work. But I loved meeting people.'I think it was in a relatively country area, so a mix of farmers, business people, a great mix of characters, and I got to know them really well and I threw myself into that.'That's one way of putting it. But in the febrile era when she was serving pints at the Cove, some altogether darker currents were bubbling under the surface.Back then, the awkward questions about Gray weren't being aired in Westminster. Instead, they were circulating in her smoke-filled bar.Specifically, the grizzled locals found themselves pondering two matters which, in certain circumstances, could involve life and death.",
        "First, was the fresh-faced Londoner who'd come to 'bandit country' actually some sort of undercover British spy? And if so, what should they do about it?Gray's CV certainly gave cause for suspicion. The daughter of working-class Irish emigrants from Belfast, she'd grown up in London, joining the Civil Service straight after leaving her Catholic state school, when the sudden death of her father from a heart attack had left the family short of cash and put paid to any notion of Sue going to university.She'd then devoted the thick end of a decade to building her career in Whitehall, only to decide, aged 27, to chuck in the desk job and move to Ulster with Conlon, a professional joiner and part-time musician.Outwardly it was a strange move, since the couple had no direct experience of the pub trade beyond the fact that Gray's mother Anastasia, known as 'Cissy', had worked as a barmaid in Tottenham.Why, then, did they decide — after marrying in March 1985 at Newtownards register office near Belfast — to pour their savings into a pub?The Cove was no ordinary boozer. Indeed, it was an establishment in a tough corner of Northern Ireland which was famously hostile to British incomers.Neither Gray nor Conlon, who grew up in the fishing village of Portaferry, an hour and one ferry ride away, had any obvious local connections to the area. What, then, had brought them here? And why did Gray then end up running the gossip-filled pub for a such curiously short period of time — perhaps little more than a year — before suddenly disappearing back to London, where she had a couple of children before resuming her journey towards the higher echelons of the Civil Service?",
        "Was it merely a blip in her career path? Or the behaviour of someone in intelligence?As it happens, Gray quite recently addressed the spy rumours.In 2021, she marked her departure from Stormont with an interview in which the BBC's Ulster correspondent Gareth Gordon remarked: 'Someone put it to me that you were once a spy.'She told Gordon: 'I know you've had that put to you, um, and, er, I think if I was a spy I'd be a pretty poor spy!'If people are talking about me being a spy, um, I think people here have put a lot of trust in me and they've put a lot of faith in me, and, um, er, you know we've worked really well together and I didn't think I'd be working externally in the way I am.'Her tone was light-hearted. But eagle-eyed readers will note that this response falls some way short of an outright denial. Read into that what you will.Importantly, however, the same interview did see Gray offer an explanation for the relatively short-lived nature of her time at the Cove.She said that, like many a couple who dream of taking over a pub, she and her husband had quickly discovered that the reality of the job didn't quite live up to expectations. Particularly for Conlon, who soon upped sticks and left.",
        "'He [Bill] hated the pub and actually most of the customers didn't like him either because he was quite miserable there.'So after six to eight weeks it was making him a bit fed up, so I sent him back to London and I carried on running the bar on my own,' she said.",
        "This is a version of events that happens to dovetail with that offered by a long-standing family friend with whom the Mail spoke this week. The friend said Bill, who was divorced when he met Sue, thought that running the venue could provide a springboard into a full-time music career.However, it soon became apparent that London's pub circuit was, in fact, a far more lively environment for an up-and-coming musician seeking to make a name for himself. And running a quite large pub was hard work.'In all honesty, the whole episode was something of a disaster,' the friend said.'People think running a pub is easy, but it's a very tough job, and it soon became apparent that the music thing wasn't going to work out for Bill. So essentially they realised very quickly that getting into the trade was a mistake.'Bill went back to London and Sue followed pretty much as soon as they could find someone to take the place off their hands. It was a matter of months in total.'",
        "The family friend continued: 'The idea that they were spying is, in my view, for the birds.'The truth is that they were just young and in love, and probably a little naive, and this was a big adventure that didn't pan out and ended relatively quickly.'Given the passage of time, few locals can today recall very much about Gray's short stewardship of the Cove, aside from Adrian Fegan, who drank there when she was landlady and later became the Cove's licensee himself. He once described her as 'a good landlady' who was 'well thought of in the community'.However he also remarked that she'd never told locals about having worked for the British government and 'would have known not to open her mouth about that'.We do know, though, that Gray's English provenance came close to landing her in a tricky situation on at least one occasion during her time at the Cove.This was when she was confronted by Republican paramilitaries while driving alone at night on a nearby country road.A friend told reporters last year how Gray was forced to stop her car at a 'checkpoint' which was run by balaclava-clad terrorists. 'One night she had a very heavy cold and one of her staff wanted to get off early, and she closed the bar,' said the friend.'She drove the person home and was returning from South Armagh. She came across a light in the middle of the road and was ordered to stop.'She thought initially it was the Army and didn't realise the guy was a paramilitary. He said to her: \"We want the car, get out.\"'And she just bluntly refused and said: \"No.\"'Taken aback, he said: \"What?\" And then he said to her: \"Oh, you're f***ing English as well?\"'Just as the situation looked set to escalate, a voice came out of the darkness and said: \"That's Sue from the Cove, let her go on.\"'Two or three nights later, she was working in the Cove and a well-dressed man was at the bottom of the bar talking with people, before nodding at her and saying: \"Sue, did you get home all right the other night?\" 'Another local who claims to have crossed Gray's path at the time was Patrick Kielty, the Northern Ireland-born comedian and television personality.He told an audience last year that he found the Partygate inquisitor's role enforcing Whitehall ethics somewhat ironic, given that she'd acquired a reputation as a landlady who failed to adhere properly to licensing rules.'Let me tell you about Sue Gray! She used to own the Cove Bar in Mayobridge, Co Down, ten miles from where I grew up on the other side of the mountain,' said Kielty.'When she was working for the Northern Ireland Civil Service, she bought the bar. She married a country and western singer from Portaferry.'And this bar was meant to be officially shut most Friday nights at half eleven . . . and was flat to the mat with Willie Nelson at 20 to f****ng two!'Today, allegations of presiding over a pub lock-in are, of course, chicken feed compared with the scandal engulfing sleaze-buster extraordinaire Gray, who stands accused of driving a coach and horses through the Civil Service rules she's supposed to enforce.The principal charge has been making headlines all week. In brief, Gray is accused of failing to inform superiors that she was having meetings with the Labour Party leader and his office between October and March, when news of her imminent appointment as Sir Keir Starmer's chief-of-staff finally leaked.During this period, she chose to carry on with the day job, which, among other things, required her to offer impartial advice to a Parliamentary committee that was investigating Boris Johnson's role in Partygate.It's a terrible mess, and the ensuing scandal is not only damaging what remains of the Civil Service's reputation, but also making Gray look distinctly hypocritical: it emerged this week that she is refusing to cooperate with a Cabinet Office inquiry into her own ethical conduct.For a woman who has, for much of her recent career, been in charge of running ethics inquiries from the Cabinet Office, that could be described as a punchy call.Yet, as former regulars at the Cove might attest, Sue Gray isn't afraid of punchy calls.More to the point, this isn't the first time her unorthodox behaviour has been placed under the microscope.The big question is whether the latest scandal will force the former landlady to call time on her Civil Service career."
    ]
}