{
    "articleURL": "/news/article-12051599/Drake-lists-final-property-88m-Beverly-Hills-estate-quits-America-Toronto.html",
    "content": [
        "Singer had bought home off British star Robbie Williams for $75million last yearMove comes after he sold of a trio of properties in LA for a total of $26million He had previously unveiled his custom-built Toronto mansion in magazine shoot Drake is selling his final US property - an $88million Beverly Hills behemoth - as he prepares to leave America for his hometown of Toronto.",
        "The singer - whose hits include 'Hold On, We're Going Home' and 'Fair Trade' - has recently sold off a string of US properties for $26million and he is not looking to replace them, it has been reported.In 2020, he opened the doors to his mammoth Toronto mansion - a custom-built 50,000 square foot property featuring an NBA-regulation size indoor basketball court.He bought his Beverly Hills property only a year ago from British pop star Robbie Williams for a reported $75million. Williams paid $33million for it in 2015.The property, a sprawling 10-bedroom estate spread across three acres of land in Beverly Hills, was sold to the hip hop star in an off-market deal.",
        "The Tuscan style property includes a main house measuring some 25,000 square feet containing ten bedrooms and no less than twenty-two bathrooms.Other amenities include an eleven car garage, a wine cellar, a gym, a game room, a professional screening room, an elevator, a tennis court, a mosaic tiled pool and an outdoor kitchen.Branden and Rayni Williams of The Beverly Hills Estates jointly hold the listing with Marc Bretter of Maywood Property Group.Drake recently offloaded his Los Angeles compound - a trio of properties in Hidden Hills for $22million.He sold two of three properties to LA Rams quarterback Matthew Stafford for $11million - and the third and largest to Makan Delrahim, a former US assistant attorney general, for $14.8million.",
        "The main property features an impressive 12,500 square feet - and together the three properties amount to 6.7 acres.The home has a classic English Tudor style, which contrasts with the over-the-top exterior, including a pool decorated with statues of nude women.Drake has no plans of buying another US property in the near future, a source told The New York Post.",
        "He unveiled his Toronto passion project, dubbed The Embassy, in a 2020 interview with Architectural Digest, telling the magazine he wanted it ‘to have a monumental scale and feel’.‘Because I was building it in my hometown, I wanted the structure to stand firm for 100 years…It will be one of the things I leave behind, so it had to be timeless and strong.'Other notable features in the house include a recording studio, the singer’s awards room and his hall of sports jerseys."
    ]
}