{
    "articleURL": "/sport/mlb/article-12057363/The-MLB-set-host-two-opening-games-2024-season-South-Korea.html",
    "content": [
        "Padres' Ha-seong Kim is the only South Korean player on both teams combinedThe MLB has organized two pairs of games in Mexico City and London this year DailyMail.com provides all the latest international sports news The L.A. Dodgers and San Diego Padres are set to face off in South Korea to open the 2024 season, according to ESPN, as the MLB looks to grow its presence outside of the U.S.",
        "Both California baseball clubs will play a pair of games to mark the eight time since 1999 that the league's started its first regular-season games outside North America.ESPN's Alden Gonzalez added that the two teams will be penciled in to play early enough in time to return back to the U.S. before all other 28 teams will start their seasons. There's only one South Korean player on both teams' rosters combined -- infielder Ha-seong Kim. In previous years, MLB's organized season openers in other countries where baseball is popular, such as Monterrey, Mexico (1999); Tokyo, Japan (2000, 2004, 2008, 2012, 2019); and Sydney, Australia (2014).",
        "This season, four regular-season games will be played outside of the U.S. The Padres came out on top against the San Francisco Giants in Mexico City in April, while the St. Louis Cardinals and Chicago Cubs will face off in London twice in June. San Diego and L.A. are battling it out to see who'll claim the last matchup of a three-game series on Sunday. ",
        "The NL West rivals split the first two games, with all three contests taking place at Petco Park in San Diego.Game 3 will be broadcasted on ESPN at 7 ET on Sunday.   The Padres have a 18-16 record overall and a 10-10 record in home games. They also have a 14-2 record in games when they scored five or more runs.",
        "The Dodgers, on the other hand, hold an 8-8 record on the road and a 20-14 record overall. L.A. has the second-ranked team slugging percentage in the NL at .449."
    ]
}