{
    "articleURL": "/news/article-12054061/Our-new-Queen-Camilla-Queen-anointed-crowned-Archbishop-Canterbury.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's CoronationCamilla is crowned in Westminster Abbey and acknowledged as QueenHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukQueen Camilla made history today as she was crowned alongside her husband Charles in a poignant ceremony which saw them become 'united in their joint vocation before God'.",
        "The Queen was presented with Queen Mary's Crown by the Archbishop of Canterbury in Westminster Abbey, before Buckingham Palace officially updated her title.There were touching scenes in the abbey as the new Queen was anointed in front of her children and grandchildren, who watched on proudly from the pews. And in a heartwarming moment, the monarch and his wife smiled warmly to the congregation as they walked through the church for a Christian ceremony - which comes almost exactly 18 years after their own wedding.  Archbishop of Canterbury Justin Welby placed the 112-year-old crown on Queen Camilla's head following the crowning of her husband. As he did so, he recited an open prayer: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues. Reign in her heart, oh king of love. That being certain of thy protection, she may be crowned with thy gracious favour. Through Jesus Christ our Lord.'The Queen was then handed the royal sceptre as the archbishop completed his proclamation.",
        "After she was crowned, Buckingham Palace updated Camilla's biography on its website, with her new title 'The Queen'.Before she died, the late Queen Elizabeth II had suggested Camilla would be known as Queen Consort - paving the way for the title.",
        "As Charles' wife, Camilla automatically became Queen when her husband acceded to the throne on September 8 last year, upon the death of his mother - but many speculated whether she would be referred to as such.The Queen's pages of honour all came from her family. They include her grandsons Gus and Louis Lopes, 13, and Freddy Parker Bowles, 13. Her great-nephew, Arthur Elliot, 10, was her fourth page.The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen'.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. Minutes later Camilla was crowned.The monarch had been heir to the throne since the age of three, and was ready to finally embrace his day of destiny with the woman he loves by his side. ",
        "As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.",
        "The Queen's role in the coronation represents a remarkable turnaround in public acceptance few would have thought possible some years ago.But she has since come to be recognised as someone on whom the new king heavily relies, and as the nation's Queen Camilla.'She is his sort of soul mate,' said Robert Hardman, a long-time royal correspondent and author of 'Queen of our Times', pointing out she had been married to Charles longer than Diana.'They're a team. And you've got to be a team.'Born Camilla Shand in 1947 into an affluent family - her father was an army major and wine merchant who married an aristocrat - she moved in social circles that brought her into contact with Charles, who she met on a windswept polo field in the early 1970s.The pair dated for a time and Charles had contemplated marriage, but felt too young to take such a major step.As he dedicated himself to his naval career, Camilla went on to marry a cavalry officer, Brigadier Andrew Parker Bowles. The couple had two children, Tom and Laura. They divorced in 1995.",
        "In his memoir, Charles's younger son Prince Harry accused his step mother of leaking stories about him to the press to enhance her own reputation, and that he and his brother had asked their father not to marry her. ",
        "The wife of a king automatically becomes a queen and only a change in legislation would have prevented Camilla from being so.'Queen Camilla' appeared officially for the first time on the coronation invitations, with Buckingham Palace saying the May 6 ceremony was the appropriate time to start using the title in an official capacity.Camilla has gradually taken on a more prominent position within the royal family, including riding next to the Queen in her Diamond Jubilee carriage procession.She also began to attend the State Opening of Parliament.Through charity work championing literacy, and highlighting the problem of domestic abuse and sexual violence, Camilla has carved out her own royal role.When the new King and Queen returned to Buckingham Palace shortly after Elizabeth II's death they were greeted with cheers, applause - even kisses for Charles - from well-wishers."
    ]
}