{
    "articleURL": "/wires/pa/article-12055417/Butterflies-named-Lord-Of-The-Rings-villain-Sauron.html",
    "content": [
        "A new group of butterflies has been named after Lord Of The Rings villain Sauron.",
        "The black rings on the vivid orange wings of the flying insects are reminiscent of the all-seeing eye described in JRR Tolkien’s books, and depicted in the movie series.Scientists, including Dr Blanca Huertas, senior curator of butterflies at the Natural History Museum, have given the new genus the name Saurona.While there are currently only two members of this new group – Saurona triangula and Saurona aurigera – many more as-yet-undescribed species are thought to exist. Giving these butterflies an unusual name helps to draw attention to this underappreciated group  Dr Blanca Huertas, Natural History Museum  Saurona is one of several new butterfly groups described by an international team of researchers in a new paper, and one of two named by Dr Huertas.Dr Huertas and a fellow researcher named the second genus Argenteria, which translates into English as silver mine, on account of the silver scales on the wings.",
        "Dr Huertas said: “Naming a genus is not something that happens very often, and it’s even more rare to be able to name two at once.“It was a great privilege to do so, and now means that we can start describing new species that we have uncovered as a result of this research.”She added: “Giving these butterflies an unusual name helps to draw attention to this underappreciated group.",
        "“It shows that, even among a group of very similar-looking species, you can find beauty among the dullness.”Experts suggest this interest can in turn yield research with important findings, including whether species are endemic to an area, or vulnerable to extinction.The wider research was a culmination of a decade’s worth of work to study the butterfly subtribe Euptychiina, carried out by a team of 30 scientists collaborating across the globe, including researchers from Natural History Museum London, Harvard University, Florida Museum of Natural History, and Zoological Research Museum Alexander Koenig.More than 400 different species were analysed, with the Natural History Museum’s butterfly collections of more than 5.5 million specimens contributing significantly.Researchers were able to use advances in DNA sequencing to identify similar-looking species not only by their appearance but also by their genetics.While Saurona triangula and Saurona aurigera are the first butterflies named after Sauron, a dung beetle, a frog and even a dinosaur have been named after the villain, also in reference to the eye.The findings are published in the journal Systematic Entomology."
    ]
}