{
    "articleURL": "/tvshowbiz/article-12044397/Influencer-reveals-quick-recipe-prawn-linguine-shocks-one-detail.html",
    "content": [
        "An Australian TV star has shocked fans by sharing his unconventional recipe for a four-ingredient weeknight pasta dish.",
        "Timm Hanly, famous for appearing on The Bachelorette and Bachelor in Paradise, shared a video on Instagram explaining how he whips up prawn linguine in just ten minutes using only a handful of ingredients.The dish comprises dried linguine pasta, fresh prawns, parmesan cheese and garlic, with a splash of olive oil for frying in the pan.While these components are fairly uncontroversial, the sheer amount of garlic Hanly included in the dish left his followers baffled.Despite saying the recipe only needs four cloves of garlic, the accompanying video showed him using more than thirty.",
        "He also didn't chop, slice, smash or crush to garlic, instead using whole cloves.Hanly's fans on Instagram were shocked by the unusual recipe and questioned what the finished dish would even taste like.'I wonder if you can die from garlic overdose?' one commented.'How much garlic? I'm pretty sure you put four heads in, not cloves. Keep the vampires away for weeks!' another added.",
        "'Looks delicious. Bit too much garlic for me though,' one follower chimed in, while another wrote: 'Whoa, the garlic cloves!'Hanly announced in April he was expecting his first child with fiancée Briana De La Motte.The couple shared the news on Instagram, posting a gallery of loved-up photos with De La Motte's burgeoning bump on display. ",
        "One image showed the father-to-be rubbing his partner's stomach, while another displayed a sign with the words 'Baby Hanly' surrounded by white balloons.The baby news came after the couple became engaged in April last year.Hanly and De La Motte went public with their romance soon after his appearance on Bachelor in Paradise Australia in 2020."
    ]
}