{
    "articleURL": "/tvshowbiz/article-12053547/Australian-model-Ellie-Gonsalves-receives-backlash-naked-wedding-dress.html",
    "content": [
        "An Australian model with over a million followers on Instagram has received backlash for her 'naked' wedding dress. ",
        "Ellie Gonsalves, 33, didn't spare any expense for her luxurious Gold Coast wedding, as she had three different white gowns for her big day. Her main dress for the ceremony to her partner Ross Scutts featured long sleeves, an illusion neckline and a dramatic train. However, it was the influencer's third dress that received an abundance of negative comments, as many said it was inappropriate for a wedding. Ellie posted a video to Instagram of her walking out to her bridal party in the barely-there dress. ",
        "She captioned the clip: 'My husbands face when he saw me in this dress reveal at our wedding.'The bride paired the corset-style 'naked' wedding dress with a pair of silver strappy heels.Some of her followers said the revealing mini-dress was more akin to lingerie, as it featured see-through tulle and a very high thigh split.",
        "One person wrote: 'What you're sharing with everyone is supposed to be only for your husband.'While another commented: 'Soon, people will be going to weddings in their bikinis. More skin on show that way, right?'And a third said: 'I'm sorry but this is not a good dress for the wedding. Dress modestly!' However, many of Ellie's loyal followers defended her dress choice, and the bride herself later hit back at her haters. ",
        "One person commented that she looked 'fast and loose' on her wedding day and Ellie hit back, writing: 'The only thing that’s fast and loose was your mum’s hands when she dropped ya on your head as a child.'",
        "The bride then shared a screenshot of this comment to her Instagram, and added: 'What’s that phrase? If you dish it out, be prepared to take it? I can’t believe people are getting so offended by a wedding dress.'Responding to another troll, Ellie wrote: 'FFs lighten up girl. It’s a dress at a wedding of someone you don’t know. Don’t like it, change the channel. Simple as that.'According to Vogue Australia, the influencer worked with designer Sam Oglialoro and stylist Paul Versace for her three wedding dresses.  Ellie told the publication: 'We got married the way we started, just him and me. Celebrating our love in the most special way we could think of.' "
    ]
}