{
    "articleURL": "/news/article-12046415/Dog-seriously-injures-seven-year-old-boy-vicious-beer-garden-attack-owners-flee.html",
    "content": [
        "Dorset Police have launched an investigation and are appealing for witnessesA seven-year-old boy was seriously injured in a dog attack in a pub garden - before the owners allegedly fled the scene. ",
        "The child was bitten on the head by the large dog as he played in the garden of the Crows Nest Inn in Swanage, Dorset.After getting the animal back under control, the owners - a man and a woman - are thought to have left the pub without leaving their details before the emergency services arrived.An air ambulance landed in a nearby field and the boy was airlifted to hospital. He had surgery for injuries, although they were not life threatening or life changing.Dorset Police have begun an investigation and are appealing for witnesses to help track down the owners of the dog, which is believed to be either a German Wirehaired Pointer or an Italian Spinone with a shaggy brown and white coat.A photo of a man and woman restraining the dog moments after the attack has been released as part of the appeal.",
        "The man has short cropped grey hair and is wearing black-rimmed glasses.The woman has shoulder-length brown hair and was wearing a dark blue or black jacket and blue and white shorts.The couple are believed to be in their 40s or early 50s.PC Alistair James, of Purbeck police, said: 'This was understandably a distressing incident for the young boy involved and his family and we hope he makes a full recovery from his injury.",
        "'We are conducting enquiries into this matter and have obtained an image of a man and woman with the dog that was believed to be involved.'We are keen to speak to these people so we can take their account of what happened.'I would urge anyone with information relating to their identity to please come forward. I would also ask the man and woman pictured to please do the right thing and come forward.'I would also like to hear from any witnesses to the incident who have not already spoken to police.'"
    ]
}