{
    "articleURL": "/wires/aap/article-12040853/Vape-detector-trial-stop-scourge-WA-schools.html",
    "content": [
        "Western Australia's education department will trial vape detectors in school toilets in a bid to stop students inhaling from electronic cigarettes.",
        "Minister for Education Tony Buti says the detectors will initially be installed at 10 public schools to combat \"this problem that is impacting many of our school students\".\"We will look at whether detectors are an efficient way to detect students who are vaping and, of course, that will be used to try and eliminate the use of vapes in schools,\" he told reporters on Wednesday.\"It is a scourge on our society.\"Dr Buti said parents, teachers and principals had told him nicotine vaping was a \"major problem\" and six public and some private schools had already installed vaping detectors.\"This is tobacco companies next way of trying to induce or encourage another generation of smokers,\" he said.\"The idea is to start young kids on vaping and I believe they hope they will then move to tobacco.\"Dr Buti said the department would also investigate if suspending students caught vaping was the most effective way to discourage the behaviour.\"This whole issue of vaping is a challenge, particularly for our young, and any measures we put in place we will have to look at the consequences and possible ramifications of that,\" he said.\"(But) expelling students is not something we would want to do.\"Dr Buti also said more should be done to stop vapes being imported into the country and sold, and that he would work with other governments to reduce supply and bolster enforcement measures.",
        "WA schools currently educates students during health lessons about the dangers of inhaling vaporised nicotine liquid from an electronic cigarette.It comes a day after the federal government announced a ban on recreational vaping and new controls for the importation and packaging of e-cigarettes.The government said it would also work with the states and territories to shut down the sale of vapes in retail and convenience stores.The NSW education department is considering installing 40,000 vape detection devices in public schools by July 2024."
    ]
}