{
    "articleURL": "/news/article-12045425/Blue-groper-killed-spearfisherman-posed-protected-fish-Hungry-Point-south-Sydney.html",
    "content": [
        "Spearfisherman pictured with killed blue groper Catching the protected fish can lead to a $22,000 fineA spearfisherman has sparked uproar after killing a protected species and fleeing the scene when he realised he could be fined.",
        "The man was pictured proudly posing while holding a blue groper he had just caught off the coast of Hungry Point, at the entrance of Port Hacking in Sydney's south.Upon finding out that he could be fined $22,000 for spearing the iconic animal, the man took off.The blue grouper has stood as the state's official fish since 1996, carrying a protective status and laws stating the creature cannot be caught commercially or by spear.The fish is known to be non-aggressive and inquisitive, making them an attraction for scuba divers and snorkelers as they regularly approach people without attacking.",
        "The photo of the spearfisherman was taken by a local resident who was with her son who was also fishing.'I took a photo, not realising at the time what he had killed,' she told The Leader.The resident then went on to claim he 'took off pretty fast' once she informed him of the potential $22,000 fine for killing the fish.'Maybe there should be signs at Hungry Point for spearfisherman who don't know, or need reminding what they are lawfully entitled to kill and not kill.'Tragically, it would be too late for this gentle giant.'It's a shame there were no fisheries licensing officers around.'One irate social media user commented on the topic, saying: 'Jerks like him make me sick, find him and fine him. See how smug he looks then'.",
        "'Imagine proudly posing with something you could grab with your bare hands,' a second wrote.'Never spearfished a day in my life and I know it's illegal to shoot a blue grouper ... It's like shooting a plank of wood. They don't move,' a third wrote.One user rebutted, writing: 'yes your... not allowed to spear them but get a grip people there are millions of Grouper in the water [they're] totally out of control'.'I fish for them all the time because there are plague proportions,' the person admitted.",
        "Gropers can not be fished commercially or by spear, and 'can only legally be taken by line in NSW,' a spokeswoman for NSW Department of Primary Industries said.'For recreational fishers, a minimum size limit of 30cm and a bag limit of two (with only one fish over 60cm) applies.'Penalties may include a $500 on-the-spot fine per offence for taking a groper by any method other than a line or handline, possession of prohibited size or exceeding the bag limit.'Maximum penalties by way of court prosecution for an individual are $22,000 and or six months imprisonment for a first offence relating to size and bag limits, and $11,000 for taking groper by an unlawful method.' According to the Australian Marine Conservation Society, 'Threats to blue gropers are mostly from fishing and harvesting aquatic resources'.",
        "'Blue gropers are an important species for maintaining the balance in their ecosystem by controlling the numbers of other animals such as crabs and sea urchins,' the website reads.'In the past, the eastern blue groper was taken in large numbers by spearfishers.'As a result, the species was protected with spearfishing banned in New South Wales waters in 1969. Following concern over the large catches by commercial fishers eastern blue groper was banned from sale in 1980.'"
    ]
}