{
    "articleURL": "/tvshowbiz/article-12042461/Stanley-Tucci-62-reveals-weight-lost-cancer-battle.html",
    "content": [
        "Stanley Tucci lost a lot of weight when he battled cancer several years ago.",
        "The star - who is promoting his new series Citadel - was noticeably thinner when he hosted his CNN food show Searching For Italy which made fans wonder if he had gone on a new diet. But he had just secretly battled cancer.Now the 62-year-old star has shared exactly how much weight he lost as he had to live on a feeding tube for six months. 'I lost 35 pounds,' he said. 'I couldn’t eat. I had a feeding tube for six months and everything tasted like you know what and smelled like you know what.'And it took months and months and months for me to finally be able to eat again and then taste properly again.'He is now cancer free. ",
        "The star also called his cancer battle 'terrifying.'The Devil Wears Prada actor was diagnosed with oral cancer in 2017.And he described how he was able to overcome the affliction with the help of his wife Felicity.She is the sister of his Devil Wears Prada co-star Emily Blunt. Tragically, Tucci lost his first wife Kate to cancer in 2009 and was 'completely shocked' when he learned he would also be battling the disease.  Speaking with Willie Geist on Sunday Sitdown, Tucci remembered the fear he faced when he received the diagnosis.",
        "And he also touched on how he was unable to eat without the help of a feeding tube for six months. 'My late wife and I, we traveled all over the world trying to find a cure for her. So when I got it, I was completely shocked,' he explained.'And luckily it hadn't metastasized.' ",
        "'I was terrified, absolutely terrified.'He described how the 'brutal' and 'awful' treatments impacted his diet:Tucci said he had to be dragged 'kicking and screaming' to treatments but acknowledges that is what saved his life.'I was so afraid,' he said. 'But Felicity was very insistent. I mean, they had to drag me kicking and screaming. But now I wouldn't be around if I hadn't done that.''She was incredible. Still is incredible,' he said of his wife, whom he shares two children with. He also has three children with his late wife Kate. Stanley previously described how he received the diagnosis after an initial scan failed to detect the cancer. ",
        "'I had a scan, but the scan missed it. And of course, when you think that there might be something wrong, you're also afraid that there is something wrong,' he told People last year. Eventually, after visits with multiple doctors, Tucci was diagnosed with a three-centimeter tumor on his tongue.",
        "'They couldn't do surgery because the tumor was so big,' he said. 'It's a miracle that it didn't metastasize. It had been in me so long.'Tucci was unable to eat and dependent on a feeding tube during the treatments, which also ravaged his sense of taste and smell.",
        "Several months after his treatments ended in 2018, Tucci built up the strength to eat again.He said his wife's incredible support was what got him through the health battle.  Tucci said: 'Felicity's undying attention, affection and encouragement got me through it.'The Captain America star said he was still suffering a few lingering side effects from the treatment, but has mostly gained back his sense of taste and smell."
    ]
}