{
    "articleURL": "/news/article-12057877/Ultra-liberal-Manhattan-church-holds-gay-friendly-mass-slammed-God-Trans-exhibit.html",
    "content": [
        "'God is Trans: A Queer Spiritual Journey' is hosted at Church of St. Paul the ApostleThe church is known for progressive beliefs including a 'gay-friendly' mass Some parishioners thought the gender-based display was inappropriateA notoriously liberal Catholic church in Manhattan is dividing parishioners with a 'God is Trans' art exhibit, leaving one member of the faithful to suggest they were having an agenda forced on them. ",
        "The Church of St. Paul the Apostle in Manhattan is promoting a display called 'God is Trans: A Queer Spiritual Journey.'The church is noted for its embrace of the LGBTQ+ community and has promoted a 'gay-friendly' 5 p.m. mass on Sunday in the past, according to the New York Times. Some who regularly go to the church told the New York Post that including gender ideology in an exhibit was a step too far.  'The church should not be promoting this,' said one parishioner. 'I understand there are transgender people. I pray for all people but enough is enough.'",
        "The churchgoer added that a priest refused to provide an explanation to someone questioning the display. 'It seems like they are trying to force the agenda on others,' they said. 'You can't put this out on the altar and then hide. That's what gets the church in trouble.'Artist Adah Unachukwu created the exhibit which attempts to show how faith and gender identity intersect. 'God is Trans maps the queer spiritual journey by three significant points: Sacrifice, Identity and Communion,' the piece begins. In sacrifice, parishioners are asked to 'shed an old life and personhood in order to be able to focus on your spiritual need. There is no devil, just past selves.'",
        "'Identity is the most impactful part of the exhibition,' the display states. 'What does holiness look like? What does your god look like? Are those two portrayals that can be merged?'It ends with Communion which 'rounds out the spiritual journey, by placing God and the mortal on the same plane to speak to one another. This part of the installation is about a spiritual home and the ways we can achieve this home in our everyday lives.' The paintings are somewhat abstract but appear to show off where the personal meet the spiritual, as people young and old are portrayed as meshing with traditional holy imagery.  ",
        "The Roman Catholic Church opposes gender ideology but leaves room for each parish to have its own opinion of the transgender community. The parish has, in the past, clashed with Cardinal Dolan of the Archdiocese of New York when go against Vatican teachings on the LGBTQ+ community.The Archdiocese of New York and Unachukwu have not responded to requests for comment. While one churchgoer was against the display, Cherri Ghosh, 80, had a completely different view of the exhibit.  'I don't understand the art, but this church is very liberal, which is why I love this church,' she told the Post. 'They are really in the present when others are not.'"
    ]
}