{
    "articleURL": "/sport/nfl/article-12044439/NFL-GM-accuses-Patriots-trading-Steelers-just-f-archrival-New-York-Jets.html",
    "content": [
        "Multiple reports have stated the Jets would not have picked Jones regardless NY took edge rusher Will McDonald IV and reportedly had eyes on Jahmyr GibbsDailyMail.com provides all the latest international sports news An unnamed NFL general manager recently claimed that the New England Patriots and head coach Bill Belichick traded back with the Pittsburgh Steelers to intentionally screw over their archrivals the New York Jets.",
        "During the first-round of last week's NFL Draft which featured multiple unexpected trades, New England traded back from pick No .14 to pick No .17, allowing the Steelers to come up and pick a spot ahead of the Jets and only required Pittsburgh to give up a fourth-round pick which was No. 120. 'They should have had to give up a [third-round pick] and not a four to move up there,' one NFL general manager said anonymously to The Washington Post.'Belichick did it just to f*** the Jets. He sold low because he knew the Steelers were going to take the kid the Jets wanted to take.' Leading up to the draft New York did not hide the fact that they were looking to take an offensive tackle before even acquiring Aaron Rodgers. ",
        "And, the trade allowed Pittsburgh to take the last one of the four tackles deemed worthy of being picked at that point in the round in Broderick Jones out of Georgia. Three of the consensus top-four tackles, Ohio State’s Paris Johnson Jr., Tennessee’s Darnell Wright, and Northwestern’s Peter Skoronski, were also all off the board by the 11th pick in the draft. 'Bill will try to screw them over any chance he gets,' a different NFL personnel executive told The Washington Post. 'He knew exactly what he was doing.' ",
        "The Jets then ran down most of the click as they appeared to scramble before settling for edge rusher Will McDonald IV out of Iowa State. ",
        "However, despite the unnamed GM's statements, many draft experts have noted that even if the trade had not taken place and Jones was still on the board when New York made their selection that he would not have been the pick regardless.New York ended up selecting McDonald IV , and post draft a large amount of rumors have also noted that the Jets were very interested in Alabama running back Jahmyr Gibbs who was selected No. 12 by the Detroit Lions.Gibbs being selected that high was arguably the biggest surprise of the first-round but teams were said to be interested much higher on him due to the versatility he showed making plays on both the running and passing game in similar manner to San Francisco 49ers wide receiver Deebo Samuel.Who the Jets actually would have selected had Jones been available would have made for an interesting decision, if he was indeed not favored by general manager Joe Douglas and the rest of the Jets front office."
    ]
}