{
    "articleURL": "/news/article-12056505/Bridgerton-star-Adjoa-Andoh-says-didnt-mean-upset-balcony-comment.html",
    "content": [
        "Andoh said the day had gone from 'rich diversity' to a 'terribly white balcony' LIVE: Follow all the latest royal news and updates on Coronation events hereBridgerton Star Adjoa Andoh has insisted that she 'didn't mean to upset anyone' after sparking backlash by calling the Buckingham Palace balcony 'terribly white' on Coronation Day.",
        "As millions tuned in to watch the newly crowned King and Queen wave down to crowds on The Mall with the rest of the Royal Family, Andoh left her ITV co-stars stunned with her comments which have been described by some as 'appalling'.The star, whose father was of Ghanaian origin, was commentating for ITV on their live Coronation coverage hosted by Tom Bradby and Julie Etchingham when she said of the event: 'We have gone from the rich diversity of the Abbey to a terribly white balcony.'I am very struck by that.'I am also looking at those younger generations and thinking: 'What are the nuances that they will inhabit when they grow?'",
        "Andoh, 60, who plays Lady Danbury in Bridgerton, left fellow pundit Myleene Klass – who was sitting next to her – appearing bewildered as she made her comments. ",
        "In a rush to quickly extinguish any backlash, Andoh, who was speaking on BBC Radio 4's Sunday morning show with Paddy O'Connell, said: 'I think I upset a few people yesterday. 'I was talking about the day and how marvellous it was and then looking at the balcony at the end and suddenly going: \"Oh it's so white!\" because the day had been so mixed and I didn't mean to upset anybody.'",
        "Andoh, who played Dr Isaacs in the psychological thriller Fractured, as well as DI Nina Rosen in BBC's Silent Witness, has enjoyed a successful career in TV, film and on the stage. She made her Hollywood debut in 2009 in Clint Eastwood's hit-film Invictus alongside Morgan Freeman and Matt Damon.Ten years later, she co-directed, and played Richard II at Shakespeare's Globe Theatre, in the UK's first all women-of-colour production.But yesterday, social media erupted into a frenzy over the 2023 Booker Prize judge's comments with one user saying: 'Why is it OK to dismiss a white family for being white?' Meanwhile another added: 'I'm disappointed in Adjoa Andoh. The #Coronation focused on promoting positive race relations &amp; representing modern Britain. 'There were many people from diverse backgrounds who had prominent positions yesterday, and yet Adjoa chose to discriminate with her divisive comment.'And a third said: 'Why make such an appalling #whitebalcony comment?! Appalling.'",
        "But rushing to the star's defence, O'Connell interjected on this morning's radio show by saying: 'You haven't upset anyone.'The Radio 4 host then quickly moved the conversation on, turning to another guest, Simon Heffer, to quiz him on Penny Mordaunt's role at the crowning of King Charles and Queen Camilla at Westminster Abbey.The Leader of the House of Commons presented the King with the 17th century Sword of State as Lord President of the Privy Council, a role she has undertaken since September last year.",
        "It was the first time in history that the Jewelled Sword of Offering has been carried and presented to the monarch by a woman. Andoh's comments come after TV historian Professor David Olusoga - who discussed Brexit and racism in Harry and Meghan's bombshell Netflix series - warned that the future of the monarchy was 'open to discussion' and that it could be a struggle to modernise.Being given a platform on the BBC, the University of Manchester professor told the broadcaster: 'Now a new reign formally begins, lots of questions about the monarchy and his role are up for discussion as they always are and always have been.'I think it's more difficult with a thousand-year-old ceremony to reflect the fact that we are one of the most secular nations in the world.",
        "'There's only so much you can modernise a thousand-year-old ceremony without it stopping being that ceremony.'He added: 'I'd like to think that he'll find ways of modernising the royal family but I do think it's a challenge.' Today, The King, Queen and royal family will join around 20,000 members of the public at the coronation concert to see performances by Take That, Katy Perry and Lionel Richie.William and Kate have already appearance ahead of the concert at Windsor Castle at 8pm tonight - and the Prince of Wales was even handed a can of Coronation ale during a walkabout with the Princess of Wales."
    ]
}