{
    "articleURL": "/tvshowbiz/article-12039679/Marvels-Guardians-Galaxy-Vol-3-eyeing-110M-domestic-box-office-debut-250M-worldwide.html",
    "content": [
        "Marvel Studios will usher in the summer movie season once again with its highly-anticipated sequel Guardians of the Galaxy Vol. 3, the final installment of director James Gunn's Guardians of the Galaxy trilogy.",
        "While we wait for the threequel starring Chris Pratt - who recently opened up about auditioning for ALL the other Marvel movies - new box office projections from Deadline have put the opening weekend at $110 million domestic and $250 million worldwide.Both the domestic and worldwide projections are slightly ahead of the numbers for the last Marvel Cinematic Universe adventure - Ant-Man and the Wasp: Quantumania, which earned $105.5 million domestic and $121.3 million in foreign markets for $226.8 million worldwide debut.Still, the projections mark a slight decline domestically and a huge drop in foreign markets from 2017's Guardians of the Galaxy Vol. 2.The Marvel franchise kicked off in 2014, with many in the press claiming that the first Guardians of the Galaxy would be the MCU's first flop.",
        "Star Chris Pratt even admitted in an April interview that he has, 'several press clippings saved from the first movie when everyone predicted that ‘Guardians of the Galaxy’ was going to be Marvel’s first flop.'The first Guardians of the Galaxy was not, in fact, a flop, debuting with a surprising $94.3 million domestic en route to $333.7 million domestic and $773.3 million worldwide from a $170 million budget.The 2017 sequel debuted with $146.5 million domestic leading to a $389.8 million domestic haul and $863.7 million worldwide from a massive $200 million budget.",
        "Guardians 3 will seemingly have a sizeable drop-off from its predecessor, particularly overseas, where Guardians 2 took in $173 million, including $49 million alone from China.While Guardians 3 will debut Friday in China, there are also several strong local films in release that day as well.Aside from the global sensation Avatar: The Way of Water, few have managed to post huge grosses in the Middle Kingdom, compared to years past. Advanced ticket sales for Guardians 3 is currently at $26 million, less than half of the $60 million in pre-sales for last year's Doctor Strange and the Multiverse of Madness.That Marvel sequel would end up with an opening weekend of $187.4 million, the second-highest post-pandemic opening weekend behind Marvel and Sony's Spider-Man: No Way Home ($260.1 million). ",
        "The projected $110 million debut would rank 17th in Marvel's 32 films, between 2017's Spider-Man: Homecoming ($117 million) and Ant-Man and the Wasp: Quantumania.The film is slated for release in roughly 4,400 theaters, which includes 400 Imax auditoriums, 960 Premium Large Format screens, 2,900 3D locations, 285 D-Box/4D motion screens, and 85 ScreenX locations.Chris Pratt returns as Star-Lord alongside Zoe Saldana's Gamora, Dave Bautista's Drax the Destroyer, Bradley Cooper's Rocket Raccoon and Vin Diesel's Groot.Will Poulter will make his MCU debut as the highly-anticipated Adam Warlock, with Chukwudi Iwuji also portraying The High Evolutionary."
    ]
}