{
    "articleURL": "/news/article-12045617/Inventor-created-fastest-shed-unveils-latest-creation-motorised-wheelie-bin.html",
    "content": [
        "Kevin Nicks, 58, a multiple world-record holder, has revealed his latest inventionIt is the only wheelie bin in the world that is taxed and fully road worthyA man who built the longest-ever mobility scooter and the fastest shed has now revealed his latest creation - a smiling motorised wheelie bin.",
        "Kevin Nicks, 58, who is a multiple world-record holder, has converted a blue refuse container into a whacky mode of transport.In fact, the bin is fully road worthy, but Mr Nicks says that he is not quite 'sure what the police would make of it'.And, it is the only bin in the world that is taxed.The 58-year-old says that this invention is the latest in his list of quirky builds that includes not only a record-holding shed, but also the world's fastest wheelbarrow - that travels up to speeds of just under 45mph.",
        "The self-employed designer and builder has also made the world's fastest motorised BMX bike, and the world's longest mobility scooter - which measures six metres, or 22 feet.But despite his latest design - the motorised domestic blue road-legal wheelie bin - being legal to drive on the road, Mr Nicks has not yet ventured out on it.Speaking out about the design, the 58-year-old, from Great Rollright, Oxfordshire, says: 'It's based on a mobility scooter but at the moment it's the only wheelie bin in the world that's taxed. It's got an electric motor because I'm very green even though it's blue.'I can go on the road but I'm not sure what the police would make of it. Mostly I take it on a trailer.",
        "'It's just a bit of fun. It makes people smile.'Mr Nicks started a mobility scooter repair business doing sales and repairs but his interest in engineering started many years ago with Lego.He added: 'I've always built things.'Have I got a piece of paper saying I'm an engineer, no. But have I built things no one else has ever done before, yes I have.'The 58-year-old revealed that he likes to cruise around on his world's longest scooter - with its 'Long Vehicle' sticker at the back - and takes the shed to cheer people up in care homes and schools.However, the creator has admitted that people don't always see the funny side of his inventions.",
        "He said: 'What is fascinating though is that when you post something on social media the negative people come out of the woodwork.'I have a big following and I try to reply to them all but those people I shower them with kindness. I'm often asked what I do it for - it's for fun.'I like doing things that are different, I have the shed, the wheelie bin and the wheelbarrow which is just insane.'But he added that he is always trying to do something different, explaining: 'Rather than doing the same thing, I am trying to build different machines.",
        "'I did the worlds longest mobility scooter which is a bit of fun.'Mr Nicks hit the headlines last year when he revealed the world's longest-ever mobility scooter-  which measured six metres (22feet) - was as long as an elephant.Opening up about why he chose to create such a long scooter, he said: 'I just thought I would take a look at mobility scooter records and discovered the last one was 10ft four inches long.'I thought, 'oh, I could so beat that!''If you've got to beat a record, you've got to smash it - so made it as long as I possibly could'.And this is not the first time Kevin has gotten creative with making unusual things motorised. ",
        "He turned a wheelbarrow into a mode of transport during lockdown, and set a speed record of 44,632mph for the world's fastest recorded time on a wheelbarrow. After lockdown he set the world's speed record on the 'Barrow of Speed' at a Straightliners event at Elvington Airfield, North Yorkshire.He is also the creator of the £13,000 Fastest Shed, which he first tested on Pendine Sands in Carmarthenshire in 2017 - reaching an impressive 80mph. The Fastest Shed is fitted with a trick hydraulic system which makes the car 'go up and down', along with air conditioning, electric windows and remote central locking. ",
        "When asked why he built the mobile shed Mr Nicks said he wanted to: 'Do something different. A lot of people are just doing the same, the humdrum, day after day, working so that when they retire they can have a life.'The life is now. It's not when you get to 60 and look back and think \"oh bloody hell, my life's behind me\", you know?'"
    ]
}