{
    "articleURL": "/news/article-12052669/Family-homeless-schizophrenic-killed-chokehold-NYC-subway-demand-Marines-arrest.html",
    "content": [
        "Jordan Neely, 30, was killed on Monday after a marine veteran, Daniel Penny, put him in a chokehold on the subwayNeely, who was homeless and schizophrenic and had autism, died later in hospital: on Wednesday the coroner ruled that Neely was murderedPenny was questioned on Monday and released: on Friday, a lawyer for the Neely family called for Penny to be arrested The family of a homeless schizophrenic man who died on Monday after he was put in a fatal chokehold on the New York City subway has called for the Marine veteran who restrained him to be arrested.",
        "Jordan Neely, 30, died after Daniel Penny restrained him amid a mental breakdown. Neely was reportedly throwing garbage at other passengers and ranting.On Wednesday, Neely's death was ruled a homicide by New York City coroners, and the Manhattan district attorney is weighing bringing charges.Neely's family on Friday called for Penny to be arrested, saying they 'want to see him behind bars'.'The family is outraged at what happened,' said Lennon Edwards, one of their attorneys.",
        "He told TMZ: 'The family feels like the justice system is failing them at this moment.'It took too long really for there to be a determination that this was homicide. It was clear from the beginning. You look at the video, it tells you that.'The coroner's office came back and said death by compression on the neck. That's clear - you see that chokehold.' Edwards said the video was extremely distressing for the family to watch.'You look at this video, and the family has looked at this video and they are in tears. Every conversation we have with them - there is not a dry eye.'And literally, they want justice.'Edwards added: 'They want to see Jordan's killer prosecuted. They want to see him in jail, behind bars.' Penny was questioned by the NYPD on Monday but was released without charge. ",
        "The investigation is ongoing and it is likely that a grand jury will be impaneled to determined whether or not charges should be brought. Penny's attorney tells DailyMail.com they have contacted the DA's Office and the NYPD to cooperate. ABC cites law enforcement sources who say the DA's office have spoken with six witnesses, but are seeking at least another four. Neely had been arrested 42 times in the past, including for punching a 67-year-old woman in the face. But New York congresswoman Alexandria Ocasio-Cortez spoke for many when she said his criminal history was irrelevant.'Leaders want to raise his record as if that warrants a public execution on the subway?' she tweeted. 'What have we come to?' ",
        "Edwards agreed that his prior history should not matter, and nor should his ranting on the subway.'You don't kill someone because you feel uneasy,' he said. 'You feel uneasy when you talk to your boss: you feel uneasy when you talk to lots of people in the course of your day.'If we stick to what happened here, we have someone who began with - and sequence is important here - the first statement that we've heard out of his mouth, from witnesses, is that he said: 'I'm hungry.''That's the problem.'",
        "Edwards noted that Neely was wearing a short-sleeved t-shirt, giving 'clear visibility as to whether someone is armed or not'.Neely was not armed.'He was approached from behind, and put into a chokehold immediately. This is not a reasonable response to anything that took place before.'Some have used the word unhinged - well, who's really unhinged when you look at this incident? It's the man who killed him - that's who everyone should have been afraid of.'Edwards said that Penny was acting as a vigilante.'This is clearly the mentality of someone who says I am taking the law into my own hands. I am taking this situation into my own hands.'And I think it became less about protecting the people on the train, and more about how he felt about the person he had his arms wrapped around.' ",
        "Initial footage showed Penny holding Neely in a chokehold while two other men restrained his arms, but it did not show the moment Penny released him. Witnesses say Neely, who was schizophrenic, was behaving erratically, throwing garbage and screaming that he wanted to 'die' or 'go to jail' because he was fed up about having no food. A longer video that emerged on Friday shows the three minutes and 52 seconds after the train pulled into Broadway Lafayette station on Monday at 2.30pm. ",
        "The footage begins with Penny already restraining Neely in the chokehold. For two minutes and five seconds, Neely struggled on the floor, flailing his feet. He went limp after two minutes and six seconds, by which point a by-passer had stepped onto the train.The man - who can be heard but is not seen - warned Penny that Neely had defecated, which he feared was a sign that he was dying.'He's defecated on himself... you're going to kill him now,' he said. Another man who was helping Penny restrain Neely replied that it was an old stain on Neely's trousers, and that Penny was no longer 'squeezing'. 'He's not squeezing? All right. Because after he's defecated himself that's it. You've got to let him go,' he replied. He then warned of a 'murder charge'.  The second man turned to Neely and said: 'Hey can you hear me?'. Met with silence, the man told Penny to stand up. Penny does not speak, but releases Neely and springs to his feet. The unidentified by-stander can be heard saying: 'That was one hell of a chokehold, man.' Over the next several seconds, Penny and the other man who had been helping him attempt to put Neely in the recovery position. After three minutes and 50 seconds, Neely appears to convulse or take a deep breath. ",
        "The video cuts out at three minutes and 52 seconds. It is unclear whether he moved again.",
        "The NYC Medical Examiner who on Wednesday ruled Neely's death a homicide has not confirmed the exact time of death. Police arrived at the scene but Neely did not regain consciousness. He was pronounced dead at Lenox Hill hospital later in the afternoon. Manhattan DA Alvin Bragg must now weigh whether or not to bring charges. He and the NYPD are appealing to the public for information about the incident. There were no surveillance cameras on-board the train in question. In a statement on Thursday, a spokesman for the DA's office said: 'This is a solemn and serious matter that ended in the tragic loss of Jordan Neely’s life. 'As part of our rigorous ongoing investigation, we will review the Medical Examiner’s report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records. 'This investigation is being handled by senior, experienced prosecutors and we will provide an update when there is additional public information to share. 'The Manhattan D.A.’s Office encourages anyone who witnessed or has information about this incident to call 212-335-9040.'"
    ]
}