{
    "articleURL": "/news/article-12054053/Royal-fans-UK-gather-large-screens-watch-monarchs-historic-coronation.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today Thousands of royal fans across the four corners of the UK today braved the rain to celebrate King Charles III's historic Coronation.",
        "Huge crowds draped themselves in reds, whites and blues as they gathered around big screens and street parties in London, Cardiff, Edinburgh and Belfast to commemorate the moment the monarch was crowned in an ancient ceremony stretching back a thousand years.As the Archbishop of Canterbury Justin Welby placed St Edward's Crown on Charles' head, there was a deafening cry of 'God Save the King' in Hyde Park followed by applause and cheers as thousands of royal fans were overcome with emotion.Michelle Roycroft, from London, was one of the first people to make it to the railings in front of Buckingham Palace ahead of the balcony appearance from the royal family. She had been waiting since 7am and said standing in the rain was fine. Speaking about her experience of watching the balcony moment and the flypast, she said: 'I'm absolutely blown away... made my day. The most memorable, magical day.'However, those who headed to Glasgow Cathedral to watch King Charles III being crowed were left gutted when TV screens cut out. Just seconds before the crown was placed on Charles’ head, there was a huge technical blunder and screens went blank. ",
        "People had travelled from across the Central Belt of Scotland to take shelter from the rain and when the screen went blank those inside frantically grabbed mobiles phones out of their pockets and bags as they desperately tried to tune-in to watch the historic moment online.",
        "Glasgow City Council, who organised the viewing event, apologised and added that it was out of their control.Speaking to the Daily Record, Ellen Gandrud, 21, who is from Minnesota in the States but is now a student at the University of Glasgow, says she was left gutted at missing the most important part of the event.She added: 'It couldn't have happened at a worse time, right at the crowning. At the most important part of the whole thing it started to glitch.'I couldn't tell if it was the internet here or streaming everywhere - and then I went on my phone and it was perfect. A lot of those in the crowd were very disappointed.'On the lawn of Rochester Castle in Kent there were no such problems. A funfair, face painting stall and stilt walkers could be seen, as families enjoyed picnics under umbrellas.In Birmingham's Centenary Square, the drizzle also failed to dampen anyone's enthusiasm, with a local named Angel remarking: 'It's amazing to see; especially to have something here in the city as people want to watch and not everyone can get to London. I've come dressed up for it. I bought what I'm wearing from New Look - I'm a big Royalist.'Meanwhile in Cardiff, a crowd of 500 fans gathered at the castle to watch the coronation on a huge TV screen before a 21-gun salute rang out from the walls. One mother, Rhiannon Rees, told MailOnline: 'People's spirits were high - it's what the country needs after the last few years.' ",
        "Bride-to-be Eloise Downer, 26, is having her hen night in Cardiff. Eloise, from Portsmouth, left the city's bars to head for Cardiff Castle where they watched a live screening of the coronation. Eloise, who is marrying police office Dougie Young in July said: 'I'll always remember my hen party - there was a brilliant atmosphere in the castle.' ",
        "Martin Viney flew from Australia with his wife to watch the coronation and arrived on the Mall at 5am. He said: 'Historical things like this only happen once in a while. As soon as my wife and I heard the coronation was happening we booked flights. It's an eye-opening event. It's so different to any other event.'People in a grandstand in front of Buckingham Palace erupted into cheers after an announcement that 'coronation day is here', at about 8.30am. The stand has about 3,800 seats for veterans, NHS staff, social care workers and representatives of charitable organisations with links to the royal family. Crowds standing on either side of the Mall burst into chants of 'hip hip hooray, and campers had been singing and chanting since Friday. A Mexican wave started half way down the road, and Charles-themed £1 million notes were handed out to the crowd. Linda Old came to look at Buckingham Palace after watching the coronation in Hyde Park. She said that the ceremony brought back memories of other royal events, most recently the Queen's funeral when she camped overnight to see the late Queen lying in state. ",
        "Ms Old, from Islington, north London, said: 'It has been very well organised. I was emotional watching it. I've come with my family. Just being here with everybody is special. We all stood up for God Save the King. It's special, there's a lot of memories.'In Trafalgar Square, artist Gideon Summerfield, 28, was sketching the procession route. He was one of three alumni of the Royal Drawing School tasked with recording the event. Mr Summerfield, drawing with chalk and pastels, said his fellow artists were stationed at Buckingham Palace and Westminster Abbey. He said: 'It is such a massive honour. 'It's incredibly lucky to be able to capture such an historic moment. It's great for a young artist to be able to capture it. I'm totally indebted to the Royal Drawing School for the opportunity.' He said the King had helped to establish the school about 20 years ago. But the wet weather started to take its toll on well-wishers, with flocks of people leaving before Queen Consort Camilla was crowned.In the stillness of the abbey, Mr Welby held St Edward's Crown high above Charles and, placing it on his head, said 'God save the King' - words repeated by the congregation.A fanfare was played and the abbey's bells rang for two minutes after the crowning, with gun salutes fired from nearby Horse Guards Parade, the Tower of London and saluting stations across the nation and from warships at sea.",
        "In a change, the controversial 'Homage of the People' element of the service has been toned down after there was widespread criticism of the new element.Among around 500 people who gathered in Birmingham's Centenary Square to watch the ceremony on a big screen was a 69-year-old woman who was born in the late Queen's coronation year.Mrs Arthur added: 'It's a piece of history. We just thought to would be lovely for Alicia to remember and look back on the photos.'Radha Patel, 36, had brought her two-year-old daughter Marissa and husband Krunal to watch on a giant screen in Manchester. The dentist said: 'It's a momentous day. We wanted to watch as it's history in the making. It's very exciting 'Petra Hirte, 56, had travelled with friends from Berlin in Germany for a music festival in Manchester. And they arrived in Piccadilly Gardens to watch the Coronation with hats and flags. Petra said: 'We don't have anything like this in Germany so it's fascinating. It's amazing for to watch all this. We are all royal fans.'This is a great weekend for us with the music festival and all this. It was a surprise for us as when we booked it, the Queen was still alive.'Fans soon started to get beers from a specially set up bar in the cordoned off area of the city centre. Builder Mark Harris, 34, said: 'I've come to toast the King and soak up the atmosphere of the day. I won't see this very often. I'm pleased for Charles and think he'll be good for the country but he's got a tough act to follow.'",
        "It turned into a traditional British occasion as well-wishers travelled to Windsor from around the world - to be met by persistent downpours throughout the day.Hardy revellers refused to allow the weather to dampen their spirits as they celebrated the Coronation of King Charles III in the historic Royal town.Many braved the elements to stand out for hours in the Long Walk leading to Windsor Castle as the heavens opened while the ceremony was broadcast on big screens.They included one five-year-old boy called Tim - who was sporting face paint with a Union Flag and a crown on top.",
        "Fact-box text",
        "His mother Charlotte, who works at a university, told how the youngster insisted on heading out to join the celebrationsCharlotte said: ‘We weren’t going to come because it was raining so much. It is the first Coronation for both of us. We came to the Queen’s funeral and despite the weather Tim said “Can we go?” So here we are.”‘It has lived up to expectations and we’re glad we came.’Hundreds more huddled into pubs and cafes and watched in awe at the pomp and pageantry of the happy and glorious day.Staff at the King and Castle pub reported a roaring trade as customers rushed to buy pints of golden Coronation Ale.Just yards from the castle, business was booming at the Prince Harry pub, formerly the Three Tuns.The 500-year-old inn unveiled its new name before Prince Harry’s wedding to Meghan Markle and has doggedly stuck with it ever since.And they opted to stick with the popular Windsor Knot pale ale which was first brewed for the couple’s 2018 wedding instead of a new organic one brewed locally to celebrate the King’s lifetime of service to the country and his passionate support of the environment.One barman said of the Return of the King coronation ale: ‘We had heard it wasn’t that great. The Windsor knot is very popular so we decided to stick with that.‘It might not have been Harry’s day but I suppose that's one small victory for him.’Meanwhile customers at a local doughnut outlet were snapping up creations with a golden crown in the middle at £4.75 a time.American tourist Scott Johnson, 63, said: ‘We certainly ended up spending more time in your pubs and food outlets but coronations don’t come round too often and we feel it is a great privilege to be here for this historic occasion.’Scott, from Chicago, who was visiting Britain with his wife Joan, added: ‘We booked this trip last year and never thought anything like this would be happening while we were here.’",
        "Things almost went pear-shaped at Sandringham House, after a 30 metre square mobile screen that was supposed to be switched on from 8.30am failed to start up. A problem with the hydraulics meant it could not be raised into position in the parkland and there were hours of worry for fans. The crowd of around 3,000 people cheered with relief as problem was finally fixed at 10.55am when the erected screen flickered into life showing King Charles walking into Westminster Abbey.",
        "Back at The Mall, cries of God Save the King rang out from the thousands gathered there who, despite being soaked by a downpour, were as enthusiastic as ever. Those unable to see over the heads of spectators in prime front row positions held up smart phones above their head to try and capture the hold carriage containing King Charles and Queen Camilla.The sheer spectacle of so many military band marching bands left many of those in the crowd awestruck.'It makes you proud to be British' said Stephen Kennedy. 'This is what this country does best and no one can match us'American tourist Debbie Brady said' We all envy this country having the royal family. It's why so many people come.' Canadian visitor Lorraine Wright was thrilled to see four Mounties in the celebratory procession to Buckingham Palace.Gun salutes at Edinburgh and Stirling castles marked the moment the King was crowned.The ceremonies were two of the events taking place around Scotland to mark the coronation, at the same time as protests against the monarchy.At Edinburgh Castle, a 21-round royal salute was fired a minute after midday as the King was crowned.Members of 105 Regiment Royal Artillery fired the salute, with members of the 3rd Battalion, The Royal Regiment of Scotland (3 SCOTS) taking up position as castle guard musicians from Reserve Bands of The Royal Regiment of Scotland and adult instructors with the Army Cadet Force performed.They played God Save The King after the gun salute.The coronation ceremony was beamed from Westminster Abbey on to a big screen in Edinburgh's West Princes Street Gardens, and Glasgow Cathedral also showed proceedings live.Community events took place around the country.At Balmoral, where Queen Elizabeth II died last year, well-wishers arrived at the royal estate from across the globe to take in the atmosphere.Hundreds watched the coronation live on screens across the estate, and cheered the Ballater Pipe Band as they played throughout the day.Among the royal fans was Louise Gibson-Ellis, from Nebraska in the US, who is spending her honeymoon in the Royal Deeside region.The 52-year-old brought her new mother-in-law, Gwen Smith, 85, from London.",
        "The pensioner, who shares a birthday with the late Queen, has fond memories of the coronation in 1953.She recalled: 'It was absolutely wonderful. There were so many of us in the room sat round looking at the nine-inch television.'It was a double celebration at the Royal Deeside estate for Bjorg Jonsdottir, from Iceland, whose first grandson, as yet unnamed, was born in the early hours of the morning.A special range of memorabilia and photographs relating to the royal's Scottish visits was also exhibited in the castle's ballroom.Among the scores of people at Glasgow Cathedral to watch the ceremony on screens around the historic building was US tourist Kathy Kowalski.The 74-year-old, from St Mary's County, Maryland, said: \"We're on a tour of Scotland and Ireland so we decided to come here to see the cathedral and it so happened they were showing the coronation.\"I like watching it but being an American it's like 'couldn't you have spent that money helping someone else, helping the poor? But that's just me'.\"The rain held off as a crowd of 500 gathered at Cardiff Castle to see the King crowned on a huge TV screen.There was clapping and cheering and a 21 gun salute rang out from the castle walls as history was being made.Children in wellies splashed in muddy puddles after heavy overnight rain threatened to ruin the Cardiff event.Mum Rhiannon Rees, said: 'It's a pity because I think Wales is right behind Charles and Camilla.'There would have been thousands here but for the rain.'But people's spirits were high - it's what the country needs after the last few years.'Meanwhile thousands of people gathered at events across Northern Ireland this morning to celebrate the coronation.They included a 'Coronation Garden' - designed by award-winning gardener Diarmuid Gavin.There were also big screens erected in major cities and towns across the province, including at Belfast City Hall, Antrim Castle Gardens, Coleraine Town Hall and Jordanstown Loughshore Park, Market Square, Lisburn, People's Park in Ballymena, Town Park in Larne and Marine Gardens in Carrickfergus.A 21-gun salute rang out from Hillsborough Castle in Co Down to mark the coronation of the King.The official ceremony took place in the village of Royal Hillsborough, the home of the royal residence in Northern Ireland.Under grey skies, the rain held off as 2,000 people gathered in the grounds of the castle to watch the coronation service live on a large screen.At the moment Charles was crowned at Westminster Abbey in London, the cannons were sounded by reservists from the 206 (Ulster) Battery of the 105th Regiment of the Royal Artillery.",
        "Assistant Commander Matt Wills, the most senior Army reservist officer in Northern Ireland, said it was a privilege to take part in the ceremony.'Today is a fantastic day, it is the coronation of our new King and we are here celebrating it at Hillsborough Castle. What a day to celebrate and what a venue to be at,' he told.'It is a hugely important day and in particular for the Army reserve in Northern Ireland. The guns that were firing today at the royal gun salute are provided by the Army reserve from 206 (Ulster) Battery based in Newtownards and Coleraine.'It is an absolute privilege to be here and a privilege for the Army reserve to play such an important role on a day like today.'He added: 'There are more than 2,000 people here. I wasn't expecting that, I thought it would just be us, but they have all enjoyed the royal gun salute.\"Adrian, a captain from 206 (Ulster) battery, described his pride at taking part in the gun salute.He said: 'All of our reservists have gathered here today, they have all volunteered to take part in the coronation of his majesty the King and Queen Camilla.'The reservists take great pride in the job that they do. We sounded the gun salute following the death of the Queen - this is the closing of the loop with the coronation of his majesty.'This is now a chance for us to celebrate, rather than sound the gun salute on a sombre occasion.'A sea of umbrellas popped up as onlookers tried to gain a good vantage spot to see the return procession from The Mall.Charles and Camilla both smiled as they left and then entered the Gold State Coach, drawn by horses to take them past 2million in the streets and 7,000 servicemen and women marching through the capital with them.Princess Anne followed their carriage on horseback with senior royals following in other state carriages. A smiling Prince Harry left in a luxury car, as did a much more sombre Prince Andrew.Many royal fans climbed on each others shoulders and stood on stalls to try and see over the umbrellas.The royal couple arrived back at Buckingham Palace where they will wave to crowds from the balcony with working royals before a planned 60-aircraft RAF flypast, which has been scaled back to just just helicopters and the Red Arrows because of terrible weather."
    ]
}