{
    "articleURL": "/sport/football/article-12056415/Eden-Hazard-reveals-not-leave-Real-Madrid-despite-making-just-ONE-league-start-season.html",
    "content": [
        "Eden Hazard has revealed he will remain at Real Madrid until his contract endsHazard signed a £400,000-per-week deal when he joined from Chelsea in 2019The Belgian has struggled in Madrid and has played just 337 minutes this season Eden Hazard has revealed he will see out his contract at Real Madrid and will not be departing the club this summer.",
        "The Belgian became the most expensive signing in Los Blancos' history when he joined the club for £130million in 2019, signing a five-year deal worth £400,000 per week.However, since joining the Spanish giants Hazard has failed to replicate the scintillating performances that made him so revered at Stamford Bridge prior to his departure.The 31-year-old was an unused substitute as Los Blancos claimed their first Copa del Rey in nearly a decade, but revealed after the game that he will hopes to see out his contract at the club.'It's been a difficult year, but with a very big team,' Hazard told Cadena SER.",
        "'I have a good relationship with the club and with the players too. I want to play, but I know it's very difficult. I have to work and hope I can play more.'Hazard has registered just four league goals in as many seasons since making the move to the Bernabeu, and has found himself rarely utilised since Carlo Ancelotti returned to the club in 2021.The former Premier League Player of the Season has played a total of 331 minutes across all competitions for his club this season.However, arguably the nadir of Hazard's time in the Spanish capital came during his only league start of the season against Mallorca in September.",
        "Registering just one shot despite being deployed as centre forward, Hazard was replaced by Luka Modric before the hour mark with the game level at 1-1. Madrid ultimately triumphed 4-1 but Hazard would be forced to wait until April before making another league appearance for the club."
    ]
}