{
    "articleURL": "/wires/ap/article-12054221/How-Mexico-Citys-mural-movement-transformed-walls-art.html",
    "content": [
        "MEXICO CITY (AP) - Across the main entrance of a former Jesuit college in the heart of Mexico City, a bright-colored mural depicting Our Lady of Guadalupe represents both the Indigenous religiosity and the Christianity that shaped the culture of post-colonial Mexico.",
        "The mural was created by Mexican artist Fermín Revueltas between 1922 and 1923, when the walls of Antiguo Colegio de San Ildefonso became the canvases for the country´s emerging muralist movement.To honor the art of Revueltas, Diego Rivera and José Clemente Orozco, who among others led the artistic movement a century ago, the baroque building that currently serves as a museum hosts an exhibition that reflects on the significance of their monumental art.The exhibit, which is regularly updated, recently welcomed a contemporary mural created by Mexican craftsmen who were inspired by the old masters and will run through June 12. That mural, called \"La Muerte de las Culturas\" (\"The Death of Cultures\"), depicts how Mexicans of African descent struggled for freedom and equality, and how the community´s identity was forged from that.Jonatan Chávez, historian of San Ildefonso, said that muralism arose in a highly politicized context.Many of the wall paintings criticize political leaders, inequality or the Catholic Church because the young muralists were influenced by revolutionary nationalism and academic scholarship that transformed their ideas about the Indigenous population.",
        "Some artists expressed their social and political views by painting divine figures or religious references.A 1924 fresco that José Clemente Orozco titled \"La Alcancía\" (\"The Piggy Bank\") shows two slender hands depositing coins into a box that is open at the bottom and drops the money into another hand that looks more powerful and represents the Catholic Church.",
        "For a few other muralists - such as Revueltas and Fernando Leal - the goal was to find new ways to portray what the military and spiritual conquest led by the Spaniards meant.\"San Ildefonso has that reminiscence where the religious is present because it is part of the cultural identity of the people,\" Chávez said.It is no coincidence that muralism was born in this place. Hundreds of years before 1923, when the earliest murals were finished, this was the place where the Jesuits led their educational work.The Jesuits arrived in the capital half a century after the Spanish conquest, in 1572, and a few years later they founded San Ildefonso, a school for seminarians and missionaries.Their objective was to educate the descendants of Spaniards - the \"criollo\" - who were born in the colony, Chávez said.Before they were expelled from the Spanish Empire in 1767, the Jesuits travelled extensively. According to Chávez, these priests visited remote towns and sought to understand the worldview of the \"criollo\" people,whose Indigenous spiritual practices intertwined with new Christian customs and beliefs.\"They went beyond these branches of spiritual identity or the diffusion of faith,\" Chávez said.This dynamic allowed the Jesuits to teach the \"criollo\" arts and crafts, but it also strengthened the concept of \"criollo\" identity throughout the territory, a theme that muralists portrayed in the 20th century.",
        "\"Alegoría de la Virgen de Guadalupe\" (\"Allegory of the Virgin of Guadalupe\") is an example. In the mural created by Revueltas, the Catholic image of Virgin Mary is in the top center and her children - men and women with different skin tones - pray around her.The painting is not meant to inspire devotion, Chávez said, but to portray how Our Lady of Guadalupe unifies people of different races and origins.A few steps away, two murals are in dialogue with each other and share a common theme.On the right side of the main stairs of San Ildefonso, a piece by Jean Charlot illustrates the massacre that the Spaniards led in the most sacred site of the Aztec empire - Templo Mayor - in 1521. On the opposite wall, Leal portrays what came after the conquest and the imported Christianity of the Spanish: religious festivities where sacred and profane symbols blend.In a recent article published in a digital magazine from the Universidad Nacional Autónoma de México, art historians Rita Eder and Renato González explain that these murals praise the country´s ancient cultures while strongly rejecting the violence brought by the Spanish conquest.Artists like Charlot, the article says, \"identify the Conquest as the most significant process in the history of Mexico, and its characterization as a struggle between civilization and barbarism (the latter, of course, represented by the armored attackers).\"",
        "According to Chávez, these murals will never lose relevance because they are a way to understand how history triggers a constant redefinition of spaces.\"Our past is important because it speaks of our present,\" he said. \"These murals tell a lot about who we are and what we are made of.\"Associated Press religion coverage receives support through the AP´s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content."
    ]
}