{
    "articleURL": "/sport/football/article-12057615/John-Terry-faces-toughest-task-Chelsea-legend-tries-fix-Leicesters-leaky-defence.html",
    "content": [
        "Leicester have not kept a clean sheet in the Premier League since November John Terry spoke with the defence and quickly backed Caglar Soyuncu for recall The Foxes travel to Fulham on Monday night seeking to earn a crucial victory John Terry spent most of his career trying to ensure Chelsea finished first rather than second but he now finds himself facing a task even tougher than winning major trophies.",
        "The former England captain is attempting to tighten one of the leakiest defences in the Premier League and, in doing so, keep Leicester in the top flight. The Foxes have four games to save themselves, starting at Fulham on Monday.Though Leicester’s form has improved since boss Dean Smith, Terry and Craig Shakespeare joined in April, they cannot keep the back door shut. They have let in 59 goals this term and have not kept a clean sheet since November.Terry has held individual discussions with all the defenders and quickly backed Caglar Soyuncu — effectively cast aside by former manager Brendan Rodgers — for an immediate recall.‘If we keep four clean sheets until the end of the season, we’re safe,’ said Smith. ‘I fully believe we’ve got players that can score goals, so we would win some of those games.",
        "‘We’ve got to make sure that we don’t keep giving away mistakes for goals. We’ve spoken about it — it is a concern.’Whether they stay up or go down, Leicester are at the end of an era, with eight players out of contract this summer‘I’ve felt from the players that they care for the club and understand the need to keep it in the Premier League,’ insisted Smith. ‘It’s very important and it’s been reflected in the performances, too.’",
        "Leicester (probable, 4-2-3-1): Iversen; Castagne, Faes, Soyuncu, Kristensen; Ndidi, Soumare; Maddison, Tielemans, Barnes; Vardy."
    ]
}