{
    "articleURL": "/wires/reuters/article-12058345/Chinese-premier-urges-IOC-oppose-politicisation-sports.html",
    "content": [
        "HONG KONG, May 8 (Reuters) - China wants to work with the International Olympic Committee (IOC) to oppose the politicisation of sports, Premier Li Qiang said, after protests over human rights and the playing of a Hong Kong protest-linked song at some events angered Beijing.",
        "Premier Li made the comments at a meeting with IOC head Thomas Bach in Beijing over the weekend, according to the state-run Xinhua news agency.Li's comments come after countries including Canada, the United States and Britain held a diplomatic boycott of the Winter Olympic games in Beijing last year over concerns about China's human rights. China at the time called the boycotts \"political posturing\" and a smear campaign.\"Li said that China is willing to work together with the IOC to oppose the politicisation of sports and to make greater contribution to the Olympic movement,\" Xinhua reported.Bach said China plays an important role in maintaining world peace and promoting mutual development and IOC is willing to strengthen cooperation with China to promote the development of the Olympic movement.Beijing has repeatedly said it opposes any attempts to politicise sporting events.After a match between Hong Kong and Iran at the World Ice Hockey championships in Bosnia in February, a song linked to Hong Kong's anti-government protests in 2019 was played instead of China's March of the Volunteers anthem, resulting in condemnation from government authorities and an investigation.A similar occurrence happened during a match between Hong Kong and South Korea at the Asian Rugby Seven series tournament in Incheon last November when the protest song was played.",
        "Hong Kong's government said it deplored the playing of the incorrect song and has since issued a set of guidelines to sports teams in the city to ensure the right anthem is played. (Reporting by Farah Master; Editing by Lincoln Feast.)"
    ]
}