{
    "articleURL": "/wires/ap/article-12053377/Drua-shocks-Hurricanes-Julian-Sava-tops-try-scoring-list.html",
    "content": [
        "WELLINGTON, New Zealand (AP) - Former All Blacks winger Julian Savea scored two tries in a losing cause to join Israel Folau as the all-time top try-scorer in Super Rugby as the Wellington-based Hurricanes were beaten 27-24 by the Fijian Drua in an 11th-round match in Suva on Saturday.",
        "The Drua managed to almost exactly repeat their giant-killing 25-24 win over the defending champion Crusaders in Lautoka in round three to emphasize how difficult they are to beat in Fiji.Once again replacement Kemu Valetini kicked the winning points for the Drua, just as he did against the Crusaders. He first leveled the scores with a penalty in the 76th minute, then put the Drua ahead a minute before fulltime.The Auckland-based Blues needed a penalty try after the fulltime siren to avoid an even greater upset. The contentious decision at a scrum gave the Blues a 31-30 win over Moana Pasifika who have yet to win a match this season.Moana Pasifika led 30-24 when the siren sounded after taking the lead with a 68th-minute try to Fine Inisi. The Blues called a scrum from a penalty in the 83rd minute, the scrum collapsed and the referee signaled a penalty try to bring a thrilling match to a sad end.The Drua at least were able to celebrate.\"It´s good to be back in the winner´s circle,\" Drua captain Tevita Ikanivere said. \"We´re fighting for a place in the quarterfinals and we have to make the best of these home games.\"Savea took his tally of tries to 60 in 150 matches, drawing equal at that tally with Folau who now plays in Japan. With a try in each half, Savea tried to lift the Hurricanes who were under pressure throughout the match and produced a tepid performance in hot conditions.",
        "\"We always knew it was going to be tough and we just weren´t good enough,\" Hurricanes captain Ardie Savea said. \"The Drua came out and played for the whole 80 and put us under a lot of pressure. They capitalized on their chances and it was hard to defend.\"The first half was fast-paced but low scoring and the Drua mostly had the upper hand. From the first breakdown, Drua scrumhalf Frank Lomani shaped to kick, then passed the ball and sent Taniela Rakuro away at a gallop down the left touch.That set the tone of the match. Lomani was a massive figure, marshaling the Drua attack and should have scored himself just before halftime but lost the ball as he stretched to place it over the goalline.In spite of the enterprise, points came slowly. Lomani missed an early penalty but the Drua set the local crowd alight in the 18th minute when Rakuro crossed on the blindside from a Lomani pass.The Hurricanes finally got some possession and go forward in the 30th minute and quick hands made a try for Julian Savea in the right corner. That took Savea to 59 tries and put him briefly in equal second place on the all-time try-scoring list with another former All Blacks winger Doug Howlett.",
        "The Drua led 7-5 at halftime. The Hurricanes took the lead for the first time with Savea´s second try three minutes into the second half.Rakuro won back the lead with his second try before the Hurricanes´ forwards took some control and created tries to prop Xavier Numia and flanker DuPlessis Kirifi. The Hurricanes enjoyed their first comfortable lead at 24-14 but it was reduced it to three points when Meli Derenalagi scored in the 59th minute.Valetini then decided the match with his two late penalties.The defending champion Crusaders later overtook the Hurricanes for second place on the Super Rugby table with a 48-13 bonus point win over the Western Force at Christchurch.Hooker Brodie McAlister scored three tries and wingers Leicester Fainga'anuku and Macca Springer two each for the Crusaders who over-ran the Perth, Western Australia-based Force by eight tries to one.In the last of four matches Saturday, the New South Wales Waratahs scored two second-half tries and held on for a 32-24 win over the Queensland Reds at Brisbane.The 11th round ends Sunday with another all-Australian matchup between the ACT Brumbies and Rebels at Melbourne.___More AP rugby: https://apnews.com/hub/rugby and https://twitter.com/AP_Sports"
    ]
}