{
    "articleURL": "/wires/pa/article-12045719/Jurgen-Klopp-Darwin-Nunez-like-racehorse-win-Fulham.html",
    "content": [
        "Mohamed Salah may be the man for consistency but fellow forward Darwin Nunez is the player who injects the element of unpredictability which is part of the evolution of Liverpool’s forward line.",
        "Salah became the first player to score in eight successive home matches for the club with his penalty enough to secure a 1-0 victory over Fulham, making it five wins in a row and 12 goals in his last 16 games.He was starting alongside Nunez and Luis Diaz, which at the start of the season was the expected first-choice forward line until the latter sustained a serious knee injury which sidelined him for six months.As a result, the Fulham game was only the fifth time they had all begun a game together, but it was Nunez’s return to the starting line-up for the first time in half-a-dozen games which produced the key moment in the first half.",
        "Having lost control 30 yards from goal, he set about regaining possession and nicked it back off Issa Diop inside the penalty area only for the defender to bring him down.Manager Jurgen Klopp felt the spell among the substitutes helped reignite the Uruguay international, who was played through the middle as opposed to his more regular position out on the left in his maiden season.“Darwin was like a racehorse, really motivated, really on fire,” said Klopp, who was particularly pleased with how the 23-year-old adapted to the vital counter-pressing role through the middle which has been performed so well by fellow new signing Cody Gakpo recently.",
        "“Absolutely. I think for us it’s super-important. You could see in the beginning, defending the centre against Fulham is really important because Palhinha is there and that is their connector.“We were a bit too early out there from Darwin, we tried to fix that, but he was like a racehorse – go, go, go, go for everybody.“We opened up and that’s where we struggle slightly. We could sort that and apart from that he played a really good game, he was always a proper option for us and we needed that.”But with only a slender lead to protect it was goalkeeper Alisson Becker who, not for the first time in this up and down season for the team, came up with the key moments to keep his first clean sheet in six matches with a good save from Carlos Vinicius.The Brazil international has now made 100 saves in the current campaign, the first time he has reached triple figures in a single season since joining Liverpool.“He is is for sure the most consistent player we have this season,” added Klopp.“That’s actually not bad news, it’s good news, because if we are not in a great shape and the level of the goalie drops as well then we would have been completely lost. So, that’s fine.”"
    ]
}