{
    "articleURL": "/wires/reuters/article-12041461/Second-oil-tanker-week-seized-Iran-Gulf--U-S-Navy.html",
    "content": [
        "DUBAI, May 3 (Reuters) - Iran seized a second oil tanker in a week on Wednesday in Gulf waters, and the U.S. State Department called for its release, in the latest escalation in a series of seizures or attacks on commercial vessels in Gulf waters since 2019.",
        "The Bahrain-based Fifth Fleet of the U.S. Navy said the Panama-flagged oil tanker Niovi was seized by Iran's Islamic Revolutionary Guard Corps Navy (IRGCN) at 6:20 a.m. (0220 GMT) while passing through the Strait of Hormuz.In Iran's first response, Tehran's prosecutor announced the oil tanker was seized on a judicial order following a complaint by a plaintiff, the judiciary's Mizan news agency said. No further details were provided.The incident comes after Iran on Thursday seized a Marshall Islands-flagged oil tanker in the Gulf of Oman called the Advantage Sweet. That tanker is being held by Iranian authorities in Bandar Abbas, the Marshall Islands flag registry said on Tuesday.Maritime security firm Ambrey has said it believed the Advantage Sweet's seizure was in response to a recent seizure via a court order by the United States of an oil cargo aboard the Marshall Islands tanker Suez Rajan.The Niovi oil tanker seized on Wednesday had been travelling from Dubai toward the UAE's Fujairah port when it was forced by IRGCN boats to change course towards Iranian territorial waters, the Navy said.The Niovi last reported its position at 0231 GMT on Wednesday off the coast of Oman in the Strait of Hormuz with Fujairah as its destination, Refinitiv ship tracking data showed.",
        "According to the International Maritime Organization shipping database,, the Niovi's owner is Grand Financing Co, and the ship is managed by Greece-based Smart Tankers, which did not immediately respond to a request for comment.Vedant Patel, a deputy spokesperson at the U.S. State Department, told reporters the Biden administration and the \"international community\" call on Iran and its Navy to release the ships and their crews. \"Iran's harassment of vessels and interference with navigational rights in regional and international waters are contrary to international law and disruptive to regional stability and security,\" Patel said.About a fifth of the world's crude oil and oil products passes through the Strait of Hormuz, a choke point between Iran and Oman, according to data from analytics firm Vortexa.\"Heightened military activity and geopolitical tensions in these regions continue to pose serious threats to commercial vessels,\" the Marshall Islands flag registry said in an advisory on Tuesday.\"Associated with these threats is the potential for miscalculation or misidentification, which could lead to aggressive actions.\"Since 2019, there have been a series of attacks on shipping in the strategic Gulf waters at times of tension between the United States and Iran.Indirect talks between Tehran and Washington to revive Iran's 2015 nuclear pact with world powers have stalled since September over a range of issues, including the Islamic Republic's violent crackdown on popular protests, Tehran's sale of drones to Russia and acceleration of its nuclear program. (Reporting by Jonathan Saul, Nadine Awadalla, Ahmed Elimam, Parisa Hafezi and Humeyra Pamuk and Timothy Gardner; Writing by Lisa Barrington, Editing by Louise Heavens, Alexandra Hudson, Bernadette Baum and Daniel Wallis)"
    ]
}