{
    "articleURL": "/wires/aap/article-12040441/Hodgson-happy-sharing-Eels-duties-targets-improvement.html",
    "content": [
        "Parramatta veteran Josh Hodgson is content to continue sharing hooker duties with rookie Brendan Hands, conceding his own form has been below standard since joining the NRL club.",
        "The Eels signed the English 33-year-old this season with the hopes he could fill the hole left by Canterbury-bound Reed Mahoney and recapture the form produced in Canberra's run to the 2019 grand final.But by his own admission Hodgson has not lived up to his billing on return from the ACL injury that sidelined him for the majority of last season.Hodgson began the season playing 80 minutes but has not done so since round three and in his last two matches has averaged less than a half of game-time.He has at times struggled to contain his rivals in the middle and has looked reluctant to run the football.\"I'm my own biggest critic. I'm not where I'd like to be,\" Hodgson told AAP.\"But it's not about me, it's about the team and making sure I'm doing my job.\"There have been weeks when I've done that and weeks where I've not.\"You know when you're good and you know when you're not. It's not too hard to figure out.\"Coach Brad Arthur conceded early in the season that Hodgson could take some time to acclimatise post-injury but Hodgson insisted he felt fit enough to play 80 minutes and remains calm 10 rounds into his two-year deal.\"Things take time,\" Hodgson said.",
        "\"Sometimes you've got to take a breath as well and not try and force things to happen because that can make things a hell of a lot worse too.\"The rise of Hands has been an unexpected positive to come from Hodgson's slow start to 2023.Unwanted by Penrith, the 23-year-old parlayed a train-and-trial deal with Parramatta into a full-time contract for 2022 and extended with the Eels shortly after making his NRL debut in round four.\"He's a really good kid,\" Hodgson said of his co-pilot.\"He's always practising, doing all his extras, which is the sign of a good player. You're going to be around for a long time if you're doing that.\"Hodgson has been starting games at hooker before coming off to allow Hands some time at dummy-half.Penrith's Mitch Kenny and Api Koroisau had a similar arrangement in the run to the premiership last year, while Harry Grant and Brandon Smith shared the hooker slot at Melbourne before the latter moved to the Sydney Roosters this season.Hodgson said there was no shame in spending time on the bench.\"It's not about egos, it's about the team. If the team's getting the result and I'm playing 40 minutes, it makes no difference to me,\" he said.",
        "\"If I'm playing 80 minutes or 40 minutes, as long as we're getting the result.\"If it's best for us to have two hands then that's what we'll do.\""
    ]
}