{
    "articleURL": "/wires/ap/article-12052369/19-horses-tangle-wide-open-149th-Kentucky-Derby.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - The cast of characters for the 149th Kentucky Derby was rewritten in the days before the race. What didn't change: Forte is the early 3-1 favorite on Saturday in a seemingly wide-open field of 19 horses.",
        "Four horses were scratched - Practical Move, Lord Miles, Continuar and Skinner - and three horses waiting on the also-eligible list moved into the field. They are Cyclone Mischief, Mandarin Hero and King Russell.Last year's Derby was a stunner: 80-1 shot Rich Strike weaved his way through traffic and came rushing up the rail to win. NBC Sports' overhead replay of the race was viewed more than 36 million times.A crowd of about 150,000 is expected to jam Churchill Downs to wager and watch the 1 1/4-mile Derby. Post time is 6:57 p.m. EDT.Forte breaks from the No. 15 post, which has produced six winners. The dark brown colt is trained by two-time Derby winner Todd Pletcher, who also has the second favorite in Tapit Trice, at 5-1.The Todd Squad includes Kingsbarns, and it´s an impressive trio.",
        "Forte was last year´s 2-year-old champion and has six wins in seven career starts, including five in a row. Tapit Trice is 4 for 5 and Kingsbarns is 3 for 3.\"You could say it´s the deepest squad we´ve brought so far,\" Pletcher said.Louisville-born Brad Cox won his first Derby belatedly when Mandaloun was elevated to first place after Medina Spirit's disqualification nine months after the 2021 race.\"There´s no thrill of winning the Derby through a phone call,\" he said. \"There's no celebration, there's no winning picture.\"",
        "Cox has a leading four chances to make the winner´s circle in person this year: early 8-1 third choice Angel of Empire; Hit Show; Verifying; and Jace's Road.\"I´m sure it would be a feeling like no other,\" he said.Gary and Mary West, who own Hit Show, are seeking retribution of their own.Their horse, Maximum Security, crossed the Derby finish line first in 2019, but was disqualified for interference after a 22-minute delay while stewards reviewed video. Country House was awarded the garland of red roses. The Wests sued unsuccessfully to have the stewards' decision reversed.\"They would like to cross the wire first and stay up,\" Cox said. \"They got a really live crack. This colt is really doing well.\"A couple of jockeys are looking for similar satisfaction.Luis Saez rode Maximum Security in 2019 and received a 15-day suspension for interfering with others; he's seeking his first Derby win aboard Tapit Trice. Florent Geroux, who was on Mandaloun, is on Jace's Road.For the second straight year, the Derby is without Bob Baffert. The Hall of Fame trainer with a record-tying six victories is soon to complete a two-year ban by Churchill Downs Inc. He was punished after Medina Spirit flunked a post-race drug test.Baffert´s shadow still looms large over the Twin Spires. A colt previously trained by him, Reincarnate, will be in the starting gate.",
        "Trainer Saffie Joseph Jr. found himself on the sideline after being indefinitely suspended Thursday by Churchill Downs Inc. His Derby entry, Lord Miles, was scratched. Two of Joseph's horses died after races at the track in the days leading up to the Derby. No cause of death has yet been found.New antidoping and medication rules to be enforced by the sport's new central governing body won't take effect until May 22, after the Derby and the Preakness.Japan is represented by Derma Sotogake and Mandarin Hero, giving the nation two chances to win the Derby for the first time.Derma Sotogake and Two Phil's are the most experienced runners in the field, having made eight career starts.\"He has a lot of experience and it has made him tougher and tougher,\" said Christophe Lemaire, who will ride Derma Sotogake. \"It is important to have that experience with 18 other horses in a high-level race.\"Confidence Game, a 20-1 shot, will try to win coming off an unheard of 10-week layoff.Saturday´s forecast calls for partly sunny skies and a high of 77 degrees (25 Celsius).___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}