{
    "articleURL": "/tvshowbiz/article-12058493/Emily-Ratajkowski-jokes-shes-picking-husband-F1-Miami-Grand-Prix-new-TikTok-clip.html",
    "content": [
        "Emily Ratajkowski joked about 'picking out a husband' at the Formula 1 Miami Grand Prix in Florida - amid her steamy new romance with Harry Styles.",
        "On Sunday, the 31-year-old model shared a TikTok video of herself lip-syncing and dancing as she walked down a line of billboards plastered with the faces of Formula 1 racers.The former actress — who introduced her son Sylvester, two, to her on/off beau DJ Orazio Rispo and enjoyed an outing together about two weeks earlier — showed that she is still keen on keeping her options open.A little over a month ago, the High Low with EmRata podcast host was first romantically linked to Styles when they were spotted making out passionately on the streets of Tokyo, Japan.Nearly a year ago, the mother-of-one filed for divorce from her ex-husband, Sebastian Bear-McClard, after he allegedly cheated on her.",
        "In good humor, the My Body author joked that she was still on the hunt for a compatible new partner with her latest social media update.While on her way to the autodrome, she filmed a video of herself doing a runway walk alongside the handsome faces racing in the Miami Grand Prix.'[On my way] to F1', she wrote in the text placed over the clip. And she captioned the video: 'Picking out a husband at #F1 #miami'.In the TikTok clip, Ratajkowski was seen lip-syncing and dancing to the tune of a remix of Beyoncé's voice crooning: 'I am on my way to see my husband. I'm happy.'",
        "For the star-studded event, she put on a stylish display in a bright red corset top and tan balloon pants from Cotton On.The Gone Girl alum donned a pair of nude sandals and carried a black, leather purse on her shoulder.She modeled a pair of chunky gold hoop earrings and wore no other accessories besides a VIP badge on her neck.",
        "The iCarly vet threw up her dark brunette tresses into a casual, messy updo and left her eyebrow-grazing bangs down to frame her face.For makeup, she looked sultry in a glamorous cat-eye makeup look paired with a mauve pink, glossy lip.Many A-listers, like Ratajkowski herself, flocked to Florida for the Miami Grand Prix this weekend.The Formula One Grand Prix was held for the first time during the season last year at the Miami International Autodrome."
    ]
}