{
    "articleURL": "/tvshowbiz/article-12060467/James-Ola-Jordan-impressive-strength-recreate-TikTok-stunt-new-video.html",
    "content": [
        "James Jordan and Ola Jordan have demonstrated their impressive strength in a new TikTok video.",
        "The former Strictly Come Dancing professional dancers took part in a new trend that saw James, 44, try to lift Ola, 40, against a wall.They discussed how to go about the difficult stunt first before James accidentally lifted Ola too high risking hitting her head.When she complained, he jokingly snapped at her: 'Do you want to try and lift me and put me on the f***ing wall?!'Eventually they managed to get Ola balanced against the wall with James holding her up in an amazing show of strength as Ola encouraged: 'Hold it!'",
        "The married couple then successfully got Ola down to the floor and fell apart in giggles. James captioned the funny video: 'It’s almost as if Ola edited this making it look like I’m bossing her around when really what happened was her continually telling me I’m doing it wrong and I’m not as strong as I used to be'. It comes after the Strictly stars embarked on a weight loss journey, with both completing dance shred workouts and tweaking their diets over a period of five months.The couple said their daughter Ella, three, was who 'inspired us' and was the 'main reason we both wanted to be healthier and fitter'.Ola said: 'Ella is the main reason we both wanted to be healthier and fitter. We didn't want to be struggling to keep up with her running round the playground. Or even just lifting her up!'",
        "The couple said alongside their new fitness regime they also stopped eating unhealthily after admitting to ordering 2-3 takeaways a week at their biggest.Ola has dropped from a size 14 to an eight in just four months as she and James show off their stunning weight loss – after shedding a combined 6.5 stone. The dancer admits she yearned for her former dancer body and doubted if she would ever have a flat stomach again after becoming a mum for the first time in 2020 and gaining weight during the pandemic.Her self-esteem was so low that Ola would refuse to leave the house and she felt a shadow of her former self compared to the confident pro who would compete on Strictly every Saturday night in glitzy, revealing dresses.",
        "In January, the mum also gushed about her husband James' progress.Ola took to Instagram to praise her fellow dancer, sharing before and after pictures of him.She quipped that she could finally stop asking him when the baby is due, referring to his previous larger tummy, after he shed three stoneShe captioned her post: 'Have to admit James has smashed it - and I can finally stop making jokes about when his baby is due! "
    ]
}