{
    "articleURL": "/tvshowbiz/article-12060893/Ricky-Tomlinson-moves-Eurovision-fans-tears-impassioned-poem.html",
    "content": [
        "Viewers of the National Lottery's Big Eurovision Welcome event were moved to tears as they watched Ricky Tomlinson perform and impassioned poetry reading on Monday. ",
        "The actor, 83, took to the stage in in the Song Contest's host city of Liverpool on Sunday, with highlights being aired on BBC One the following day.The Royle Family star read some words by screenwriter Frank Cottrell-Boyce, 63, who is from Merseyside, with the poem being made up of lyrics from songs that have a connection to Liverpool.Ricky put on an animated display during his reading, raising his arms in the air as he bellowed: 'Love is all you need!', at the end, a reference to the Beatles 1967 single.Viewers of the highlights of the concert took to Twitter on Monday to praise Ricky for his performance, with one person saying it was 'hard not to cry'.",
        "'Beautiful &amp; emotional #RickyTomlinson delivers powerfully evocative poem - hard not to cry Congratulations #RickyTomlinson &amp; #Eurovision2023 #CulturalHeritage #Liverpool #allyouneedislove,' they wrote.'@frankcottrell_b you could not have chosen a better voice and man to speak your beautiful use of words #RickyTomlinson,' wrote another user of the social media platform.While someone else shared: 'Jesus, Ricky Tomlinson on the #Eurovision show. WOW!! GOOSEBUMPS!!!! Incredible!!'Someone else wrote: 'Just watched @RickyTomlinson_ giving a masterclass in passion and the Liverpool signing choir signing All you need is love. What an amazing production #Eurovision2023.'Another person tweeted: '#RickyTomlinson Nations treasure #legend #icon delivers truly emotional poem Superb &amp; evocative #Beatles powerful cultural heritage #Liverpool #Eurovision2023 #allyouneedislove.'",
        "'What a brilliant and impassioned reading from #LoveIsAllYouNeed #Eurovision2023,' remarked someone else.One other person wrote: 'I didn’t cry at the Coronation but I just cried at Ricky Tomlinson doing a rousing speech on Eurovision Welcomes the World.'While another person wrote: 'I love this piece being read by Ricky Tomlinson #Eurovision #EurovisionWelcomestheWorld.'",
        "Someone else commented: 'I just fell a little more in love with Ricky Tomlinson #Eurovision.'A number of stars took to the stage in Liverpool on Sunday evening, including the 2014 winner of the Eurovision Song Contest Conchita Wurst.Austrian singer Conchita, real name Thomas Neuwirth, 34, won the Eurovision Song Contest in 2014 with her song Rise Like a Phoenix.She returned to the stage on Sunday for the welcome concert in Liverpool ahead of Saturday's competition final, with her performance of her winning song airing on BBC One on Monday.And music fans were so impressed with her vocals that they took to Twitter to say they'd been left with 'goosebumps', with some branding her performance 'spectacular' while calling for her to compete once again in the future.One person wrote: 'Conchita Wurst still performs terrifically, surely her #Eurovision return is near?', while another person posted: 'I think if Conchita Wurst was in every Eurovision since she won then she would have won every year.'",
        "Someone else shared: 'Goosebumps every time I hear Conchita Wurst sing Rise Like a Phoenix. Stunning.'Another person posted: 'Conchita Wurst is the undisputed Queen of Eurovision. Just saying.''Conchita Wurst = just glorious. #Eurovision2023,' remarked another viewer, while one other fan tweeted: 'Conchita Wurst is the moment.''Top marks to Conchita Wurst on a spectacular performance,' shared someone else.Someone else commented: 'Phenomenal performance by @ConchitaWurst, and the sky drones lighting up #eurovisionwelcomeparty #Eurovision #IStandWithUkraine.'While another person wrote: 'Well @ConchitaWurst absolutely nailed that. What a performance to kick off this week of weeks. @bbceurovision #eurovisionwelcomeparty.'One other Twitter user shared: 'Conchita Wurst - Rise Like a Phoenix. What a banger.'In addition to Conchita, Ukraine's Jamala, who competed in 2016, was also amongst the line-up for the gig, presented by AJ Odudu and Joel Dommett.",
        "Other acts with a Liverpool connection on the line-up included girl group Atomic Kitten, funk band The Real Thing, and The Lightning Seeds - singers of the football anthem Three Lions.Elsewhere, band Frankie Goes to Hollywood reunited after their split in 1987 to perform in front of the crowd of almost 30,000.This year's Eurovision acts were welcomed to Liverpool with an opening ceremony earlier in the day on Sunday.The Turquoise Carpet ceremony opened in the city, which is preparing to host the song contest final on Saturday on behalf of last year's winners Ukraine.",
        "Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, the ceremony saw all 37 acts take to the carpet for a welcome to the city.Eurovision fans lined one side of the carpet, waving flags and scarves to support their countries.",
        "Norwegian act Alessandra was first to arrive on the carpet, where entrants had their photos taken and were interviewed.She said: 'I feel so blessed. I feel so nice here. I'm the first one out and that's an honour.'Conor O'Donohoe, from Irish band Wild Youth, said: 'It's all starting to feel very real. Everyone's getting here now, all the press are here and family are starting to fly in, so it's all starting to kind of really settle in.'The contestants wore their finest for the occasion, with Croatian group Let 3 taking to the carpet in bustled gowns accessorised with military-style peaked hats and facial hair.In scenes reminiscent of 1981 UK Eurovision entry Bucks Fizz, the group whipped off their gowns while having their photos taken to reveal white petticoats and vests.",
        "Latvian group Sudden Lights paid homage to Liverpool's most famous music act the Beatles by recreating the outfits worn on the Abbey Road album cover.Eurovision preparations are in full swing in Liverpool, which is hosting the contest instead of Ukraine because of the Russian invasion.",
        "The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday."
    ]
}