{
    "articleURL": "/wires/pa/article-12053733/Israeli-army-kills-two-Palestinians-West-Bank-raid.html",
    "content": [
        "Israeli forces have shot dead two Palestinians during a military raid in the occupied West Bank, the Palestinian Health Ministry said.",
        "The raid in the Nur Shams refugee camp near the city of Tulkarem was the latest in Israeli-Palestinian violence that has surged since last year.The ministry and Tulkarem’s branch of Al Aqsa Martyrs Brigades, a militant group with connections to President Mahmoud Abbas’s Fatah party, identified the pair as Samer El Shafei and Hamza Kharyoush, both aged 22.The Israeli military said the two were suspected of carrying out a shooting at a nearby Israeli settlement earlier this week.An Israeli civilian was injured and vehicles were damaged during the attack at the Avnei Hefetz Jewish settlement.Videos on social media purportedly shows the bodies of the two gunmen lying on a tin roof as two Israeli soldiers search them.Palestinian media, citing witnesses, said soldiers left after ensuring the two were dead.The deaths raised to 104 the number of Palestinians killed by Israeli forces in the West Bank and east Jerusalem since the start of the year.Israel has been staging near-nightly arrest raids in West Bank villages, towns and cities for more than a year in an operation prompted by a wave of Palestinian attacks against Israelis last year.Israel says the raids are meant to dismantle militant networks and thwart future attacks. The Palestinians see the attacks as further entrenchment of Israel’s 56-year, open-ended occupation of lands they seek for a future independent state.",
        "Some 250 Palestinians have been killed by Israeli fire since the raids were launched. Israel says most have been militants, but stone-throwing youth and people not involved in the confrontations have also been killed.During that time, nearly 50 people have been killed in Palestinian attacks against Israelis."
    ]
}