{
    "articleURL": "/wires/aap/article-12044473/Victorian-Liberal-leader-denies-bullying-reports.html",
    "content": [
        "Victorian Opposition Leader John Pesutto has denied anonymous bullying claims from his Liberal Party colleagues, as allies swing to his defence.",
        "Several MPs have accused the Victorian Liberal leader of presiding over a culture of bullying and intimidation, resulting in upper house MP Renee Health leaving a party room meeting on Tuesday in tears.The allegations in the Herald Sun newspaper claim Mr Pesutto accused Ms Heath of tampering with minutes from a meeting in March to expel outspoken MP Moira Deeming.Mr Pesutto told ABC Radio he had not bullied Ms Heath at the meeting and he did not know why she left in tears.\"If there were any truth in what the unnamed sources have told the Herald Sun, I think you would have detected that over the years,\" he said.\"I lead an inclusive party that I'm trying to build after the third election loss that we suffered. My style has always been professional and collaborative.\"Opposition equality spokesman James Newbury said a group of three or four \"terrorists\" cared more about \"blowing up the Liberal Party\" than defeating Premier Daniel Andrews.\"They're holding the Liberal Party hostage,\" he told reporters at state parliament.\"They need to work out whether they're Liberals or whether they want to sit on the crossbench.\"Everybody's had enough. They need to do the right thing by the Liberal party room, by Liberals and by Victorians more broadly.\"",
        "Mr Pesutto won a tussle for the leadership of the parliamentary Liberal Party over Berwick MP Brad Battin by one vote after the coalition was resoundingly defeated at the November state election.His predecessor Matthew Guy also described the anonymous Liberal MPs as \"terrorists\" and said they should speak on the record if they have allegations to air.\"The vast majority of us back John Pesutto and continue to back John Pesutto because he's a very good leader,\" he said.\"We're not going to allow John Pesutto to be attacked in this way by a very small few who need to sit with us or not.\"One of the Liberal MPs is reportedly considering lodging a formal complaint to the Department of Parliamentary Services on behalf of a colleague, but Mr Andrews suggested trying another avenue.\"If the Liberal Party care about occupational health and safety, they would have dobbed their leader into WorkCover for some of his conduct,\" he said."
    ]
}