{
    "articleURL": "/wires/aap/article-12055661/Rudan-adamant-Wanderers-build-strong-ALM-form.html",
    "content": [
        "Marko Rudan has vowed Western Sydney's return to the A-League Men finals won't be a flash in the pan, declaring the Wanderers are all set to build on their best campaign in years.",
        "Rudan guided his side to a top-four finish and their first finals game in six seasons but they fell at the first hurdle, losing 2-1 in Saturday's elimination final defeat to Sydney FC.The Wanderers have evolved over the season to become one of the competition's most entertaining sides but collapsed in the second half at CommBank Stadium to hand the Sky Blues victory.\"We under-achieved,\" Rudan said.\"I haven't properly reflected on it because my mindset was that we would get past this game and move on to the next one.\"I'm very proud of the players and staff for finishing fourth and playing finals football for the first time in a long time.\"We've had a really good season, you can't deny that. We built into the team that I wanted us to be, we played some really good football and we're going to continue that path next year.\"My promise is that we will be better next year and you'll see a different type of team right from the outset, not one that was a bit more rigid (to start with).\"We've built something the last few months and we want to continue that.\"Rudan would not confirm whether January loan signings Amor Layouni and Morgan Schneiderlin would remain at the club for next season.",
        "If the Wanderers are to be a more substantial threat next year, they will need to iron out their second-half form.Western Sydney led 1-0 against their arch rivals on Saturday before conceding two avoidable goals after halftime.It is a trend which has worried the Wanderers boss at the back end of the season.\"We looked lethargic (in the second half),\" Rudan said.\"We've tried all these different techniques at halftime to get ourselves going again.\"I'd love to put my finger on it ... when you've seen it happen and happen again, it's disappointing.\""
    ]
}