{
    "articleURL": "/wires/ap/article-12042365/Fossils-not-Nations-split-meet-climate-goals.html",
    "content": [
        "BERLIN (AP) - Senior officials from dozens of nations meeting in Berlin remained divided Wednesday on how to meet international climate goals, with some pushing for a phaseout of fossil fuels and others insisting that oil and gas can continue to play a role in the future - provided their emissions are somehow contained.",
        "The two-day Petersberg Climate Dialogue hosted by Germany heard calls for a new target on ramping up renewable energy to be negotiated and agreed on at this year's U.N. climate summit in December.German Chancellor Olaf Scholz suggested that the goal could be a tripling of newly installed solar, wind power by 2030, echoing a target proposed recently by the International Renewable Energy Agency.\"This would send a clear signal to the real economy and to finance about where the journey is going,\" he told delegates from about 40 countries.German Foreign Minister Annalena Baerbock insisted this proposal shouldn't detract from the need to drastically cut fossil fuel use, a position shared by other European nations and vulnerable island states present at the Berlin talks.\"This course correction needs to include an accelerated global expansion of renewables, greater energy efficiency and the phaseout of fossil fuels,\" she said.",
        "The United Arab Emirates, which will host the U.N. talks in Dubai, backed the idea of significantly boosting wind and solar power, but made clear that it wants to keep fossil fuels as an option for the foreseeable future.Sultan al-Jaber, the UAE official who will chair COP28 climate talks in Dubai, said his oil-rich country wants \"a comprehensive, holistic approach to an energy transition that included all sources of energy.\"",
        "\"We know that fossil fuel will continue to play a role in the foreseeable future, helping meet global requirements so our aim should be a focus on ensuring that we phase out emissions from all sectors whether it´s oil and gas or high emitting industries,\" he said. \"In parallel we should assert all effort and all investments in renewable energy and clean technology space.\"Al-Jaber acknowledged that time is running out to keep alive the agreed on target of limiting global warming to 1.5 degrees Celsius (2.7 Fahrenheit). Doing so would require global emissions to halve by 2030, sharply bending down the current upward curve of greenhouse gases in the atmosphere.Climate campaigners and scientists have expressed concern that technologies proposed for capturing fossil fuel emissions aren't tested at scale yet, and that such solutions could divert attention and resources away from effective alternatives such as renewable energy.John M. Silk, the Marshall Islands' minister for natural resource and commerce, raised similar concerns.\"We have to actually phase out fossil fuels now,\" said Silk, whose low-lying Pacific atoll is threatened by rising sea levels. He called for governments at the Berlin meeting to \"move beyond commitments into actual action.\"\"That means halting oil and gas expansion,\" he said. \"It means investing in renewables. That is the best way for countries to develop in a way that is fairer and more just.\"",
        "More than 80 countries backed efforts to put oil and gas, not just coal, on notice at the last U.N. climate summit in Egypt. Denmark's climate minister, Dan Jørgensen, said that the proposal is on the table again this year.\"Objections against this are primarily from countries that are today mainly producers or extremely dependent on fossil fuels,\" he told The Associated Press.Jørgensen said that carbon capture and storage of the kind his country is testing in the North Sea should be confined to sectors where cutting emissions is hardest, such as the cement industry.Scholz used the meeting to announce that his country will provide an additional 2 billion euros to the Green Climate Fund for adaptation measures in developing countries. He appealed to other \"traditional and possible new donors\" to also increase their funding. The United States recently said it would commit $1 billion, while major emitters such as China aren't contributing.Germany itself has come under criticism for failing to drive down emissions fast enough to meet its goal of becoming carbon neutral by 2045.Scholz expressed regret that his country recently increased coal use because of a shortfall in gas from Russia, but said that Germany remains committed to producing 80% of its electricity from renewables by 2030.",
        "___Follow AP's coverage of the climate and environment at https://apnews.com/hub/climate-and-environment"
    ]
}