{
    "articleURL": "/wires/ap/article-12047793/EXPLAINER-Sedition-charge-Proud-Boys-Jan-6-case.html",
    "content": [
        "WASHINGTON (AP) - The convictions on historically rare seditious conspiracy charges against leaders of the Proud Boys extremist group mark another major victory for the Justice Department in its massive prosecution of the attack on the U.S. Capitol.",
        "Jurors on Thursday found former Proud Boys national chairman Enrique Tarrio and three lieutenants guilty of the rarely used Civil War-era charge.It was the third seditious conspiracy trial stemming from the Jan. 6, 2021, riot that forced Congress to adjourn as lawmakers and staff hid from a violent mob. The founder of the Oath Keepers extremist group and several members have also been convicted of the charge.Here´s a look at the charge of seditious conspiracy and its history:___WHAT HAPPENED AT THE LATEST TRIAL?",
        "Prosecutors sought to prove Tarrio and four co-defendants plotted for weeks to use force to keep then-President Donald Trump in power. Tarrio wasn't in Washington on Jan. 6 - he was arrested in a separate case two days earlier - but authorities say he helped put the violence into motion and cheered on the riot from afar as it unfolded.Defense attorneys told jurors there was no plot to storm the Capitol or block Congress' certification of President Joe Biden's victory. They contended that the actions of the Proud Boys who joined the pro-Trump mob were spontaneous rather than the culmination of a premeditated plot.Tarrio, from Miami, stood trial with Ethan Nordean of Auburn, Washington, who was a Proud Boys chapter president; Joseph Biggs of Ormond Beach, Florida, a self-described Proud Boys organizer; Zachary Rehl, president of the Proud Boys chapter in Philadelphia; and Dominic Pezzola, a Proud Boys member from Rochester, New York. Prosecutors said Pezzola allowed the first rioters to enter the Capitol by using a police riot shield to shatter a window.",
        "Nordean, Biggs and Rehl were also convicted Thursday of seditious conspiracy. Jurors cleared Pezzola of the sedition charge, though he was convicted of other serious felonies.WHAT IS SEDITIOUS CONSPIRACY?The seditious conspiracy law was enacted after the Civil War to arrest Southerners who might keep fighting the U.S. government. Sedition cases have been rare in recent history. The charge can be difficult to prove, especially in cases when an alleged plot is unsuccessful.In order to win a seditious conspiracy case, prosecutors have to prove that two or more people conspired to \"overthrow, put down or to destroy by force\" the U.S. government or bring war against it, or that they plotted to use force to oppose the authority of the government or to block the execution of a law.Tarrio and his co-defendants were accused of conspiring to block the transfer of power from Trump to Biden. The indictment alleged that they conspired to forcibly oppose the authority of the federal government and to use force to prevent the execution of laws having to do with the transfer of power.To prevail at trial, it´s not enough to merely show defendants advocated the use of force - prosecutors must show they conspired to use force. Conviction calls for up 20 years in prison.",
        "WHO HAS FACED SIMILAR CHARGES IN THE JAN. 6 ATTACK?The Justice Department in November won seditious conspiracy convictions against Oath Keepers leader Stewart Rhodes and Florida Chapter leader Kelly Meggs after a two-month trial in the same federal court in Washington.Three other Oath Keepers associates were acquitted of the charge but were convicted of other felonies that carry significant prison time. Four other Oath Keepers were convicted of seditious conspiracy at a second trial.Jeremy Joseph Bertino, a former Proud Boys leader from North Carolina, was the first member of that extremist group to plead guilty to seditious conspiracy in October.A statement of offense filed in court said that Bertino understood the Proud Boys´ goal in traveling to Washington was to stop the certification of Biden and that the group was prepared to use force and violence.WHAT ABOUT PAST CASES?The convictions of Oath Keepers Rhodes and Meggs were the first seditious conspiracy guilty verdicts in decades.Before that trial, the last time the Justice Department tried such a case was in 2010 in an alleged Michigan plot by members of the Hutaree militia to incite an uprising against the government.A judge ordered acquittals of the sedition conspiracy charges at a 2012 trial, saying prosecutors relied too much on hateful diatribes protected by the First Amendment and didn´t, as required, prove the accused ever had detailed plans for a rebellion.",
        "Lawyer William Swor, who represented Hutaree militia leader David Stone, has said that prosecutors in the case failed to prove that group members were \"more than just talking\" and were \"actively planning to oppose the government.\"The judge said Stone´s \"diatribes evince nothing more than his own hatred for - perhaps even desire to fight or kill - law enforcement; this is not the same as seditious conspiracy.\"Before the Oath keepers case, the last successful prosecution in a seditious conspiracy trial was in 1995, when Egyptian cleric Sheikh Omar Abdel-Rahman and nine followers were convicted in a plot to blow up the United Nations, an FBI building, and two tunnels and a bridge linking New York and New Jersey.Abdel-Rahman, known as the \"Blind Sheikh,\" argued on appeal that he was never involved in planning actual attacks and his hostile rhetoric was protected free speech. He died in federal prison in 2017.Prosecutors also secured seditious conspiracy convictions in another, now largely forgotten storming of the Capitol building in 1954. Four pro-independence Puerto Rican activists rushed the building and opened fire on the House floor, wounding several representatives.More recently, Oscar Lopez Rivera, a former leader of a Puerto Rican independence group that orchestrated a bombing campaign that left dozens of people dead or maimed in New York, Chicago, Washington and Puerto Rico in the 1970s and early 1980s, spent 35 years in prison for seditious conspiracy before President Barack Obama commuted his sentence in 2017.",
        "In 1988, jurors in Fort Smith, Arkansas, acquitted white supremacists charged with seditious conspiracy. The defendants were accused of plotting to overthrow the federal government and establish an all-white nation in the Pacific Northwest, and conspiring to kill a federal judge and FBI agent.____Richer reported from Boston.____Follow AP´s coverage of the Capitol riot at: https://apnews.com/hub/capitol-siege."
    ]
}