{
    "articleURL": "/news/article-12041035/The-murder-Sarah-Groves-Devastated-parents-waiting-justice-10-years-on.html",
    "content": [
        "The British backpacker was savagely murdered in Kashmir, India, in April 2013But the only suspect in Sarah's case is yet to stand trial more than a decade laterMailOnline recaps the dark case and a grieving family's ongoing battle for justiceOn April 6, 2013, British backpacker Sarah Groves was brutally stabbed to death in the idyllic Kashmir valley of India as she slept aboard a houseboat.",
        "The 24-year-old former public schoolgirl from Guernsey was found in bloodied sheets, covered in puncture wounds and slashes indicative of a violent attack.  Her suspected killer - a towering 7ft-tall Dutchman named Richard De Wit - was tracked down by authorities hours later. He said the Devil compelled him to conduct the heinous act and even confessed to the murder - only to later retract his statement and declare himself innocent.Yet despite the overwhelming evidence against him, the lying Dutchman has managed to evade justice as Sarah's case descended into farce. A total of 225 scheduled court dates have come and gone. Witnesses have died or disappeared. And all the while, the now 53-year-old De Wit has embraced the role of the villainous, unhinged criminal.",
        "Doctors claim he's likely a paranoid schizophrenic who refuses to take his medication, has fired five lawyers and believes the entire case against him has been fabricated by nefarious elements of the Dutch government. But he has also toyed with the emotions of Sarah's grieving family, cruelly telling her father Vic that he had a 'secret' to share about his daughter's murder but never actually doing so. Now ten years on and with no murder trial in sight, Sarah's ageing parents are frustrated and fearful that they may never see justice for their daughter's murder.",
        "Vic Groves, Sarah's father, told MailOnline: 'We are not confident that it will ever conclude.'The worst aspect of the last decade is that we are no longer a complete family. There is a massive gap in our lives that can never be filled - Sarah was one in a million, a wonderful person in every way who always considered others ahead of herself.'Mr Groves, 80, and mother Kate, 76, added: 'She is sorely missed by very many people – family, friends, acquaintances and even people who never really knew her.'Here, MailOnline remembers the horrific circumstances surrounding Sarah's death, delves into the dark mind games employed by De Wit, and tells of the Groves family's enduring fight for justice. Sarah's murderSarah Groves had travelled to India in February 2013 to meet her boyfriend, Indian national Saeed Ahmad Shoda.Described by her family as 'a joy from the moment she was born', free-spirited and optimistic Sarah loved to travel. Her journey to the picturesque Kashmir valley promised to be yet another exciting adventure. But parents Vic and Kate could not shake the feeling that their daughter's trip was a bad idea. They had begged Sarah not to travel to Kashmir - which lies in territory disputed by India and Pakistan and as such is prone to unrest - and had even booked a trip to Nepal where they were planning to meet Sarah and persuade her to leave Kashmir. ",
        "But their chance to talk Sarah out of her travels never came. Sarah was found dead inside her room in the New Beauty houseboat in Dal Lake in Kashmir's Srinagar city on April 6, 2013. She had been stabbed 45 times. Mum Kate told ITV last month that even ten years on, she still blames herself for not convincing Sarah to leave Kashmir sooner.'I have to live with that now... anyone I tell says you can't blame yourself... but I just said I was her best friend and I wasn't there,' Kate said through tears. Sarah's bloodied, savaged corpse was discovered by her boyfriend's brother Irfan and father Abdul. They said she was clutching a mobile phone, as if attempting to call for help. ",
        "Dr Farida Noor, head of forensics at Srinagar's General Medical College, said the former public school girl exhibited a series of defensive wounds and had likely woken up to find her killer towering over her. Dr Noor said: 'Two of the wounds were fatal, one on her neck and the other pierced her lung.'The cause of death was haemorrhage, but all the rest of the injuries were defence wounds. She tried to save herself... I think she would have fought bravely.'Hours later, Indian police arrested De Wit, of Ridderkerk in the Netherlands, some 50 miles away from the scene of the crime.",
        "He was found shoeless and soaking wet, carrying nothing but a passport and £2,000. Investigators quickly learned he had been staying in the room adjacent to that of Sarah on the New Beauty houseboat, and had stolen a rowing boat to escape after the murder. The vessel capsized, forcing him to swim to shore before he paid a taxi driver to whisk him to a neighbouring city. He was charged with murder in June 2013. But almost ten years later, the Dutchman is yet to stand trial.Richard De Wit: Paranoid politician turned killerRichard De Wit did not have a history of crime and murder. But details of his past paint a picture of a man whose paranoia led him down a dark path and turned him into a ruthless killer with no remorse for his actions.As a young man, De Wit had been a member of a nationalist, anti-immigration political party in the Netherlands, the Central Democrats, and served as a councillor for three years before being pressured by family members to leave the party which was disbanded in the early 2000s. But the Dutchman's exit from politics saw the giant become increasingly mistrustful. He believed the Dutch government was monitoring his activities and wanted him to work as an agent to reveal insider secrets about the Central Democrats, and told family and friends that the Dutch government had tapped his phone and monitored him through his computer's camera. ",
        "Another of his wild theories suggested he had been visited by intelligence agents who believed he was a far-Right republican posing a threat to Queen Beatrix of the Netherlands. His wife, Thai national Uma Rupanya, told MailOnline that her husband had become increasingly insecure, bordering on psychotic, and had stopped taking prescribed medication before abandoning her and their two children six months before Sarah's murder to go travelling. In the months after leaving Rupanya, De Wit went to Kenya, Dubai and Nepal, before eventually settling in Kashmir - the scene of Sarah's grisly murder.  In the years since his arrest, De Wit's behaviour while in custody has been highly unpredictable, and doctors who have evaluated him believe his erratic behaviour and inconsistent recollection of events is indicative of paranoid schizophrenia.He has refused to take medication, took off his clothes even in the cold winter months, and has been known to lock himself in the bathroom to avoid attending hearings via video-link.",
        "But despite De Wit's apparent struggles with mental health, he has exhibited a complete lack of remorse for his actions, and has even sought to torment Sarah's father Vic. When questioned about the killing, the Dutchman told authorities that 'the Devil took hold of my body' and allegedly told Sarah's boyfriend: 'There is no reason (why I killed her) - I just killed her.' ",
        "In 2017, he mysteriously told a court that he had a 'secret' to share about Sarah's murder, despite claiming innocence. 'I am not guilty. I want to meet Sarah's parents and reveal some things about the case,' he said.'I won't say anything in the court but will only meet and tell Mr and Mrs Groves.'These words have only served to increase the torment for Sarah's family, whom De Wit has kept on tenterhooks with cryptic messages and false hope. And he has fired a string of lawyers, further complicating the tumultuous legal process and preventing his case from moving forward. A family's fight for justiceVic and Kate Groves have spent countless hours campaigning for Sarah's killer to face justice.But they have been thwarted at every turn by De Wit's antics, a laborious Indian legal system and apparent refusal on behalf of the British government to aid in the expedition of their daughter's case. Upon his arrest, De Wit told authorities he had consumed cannabis and heroin during his time in Kashmir.Doctors who examined him then reported his apparent schizophrenic tendencies and concluded he had a 'well systematised delusional belief' that he was being pursued by the Dutch government.Police say De Wit once confessed to having committed the murder, but later retracted the confession, claiming that he was under pressure from the officers. The act of retracting his statement meant authorities could no longer proceed to sentencing and were forced to initiate a trial. In one 2017 hearing, the Dutchman declared that he had converted to Islam in an attempt to ingratiate himself with locals in the Muslim majority state of Kashmir. 'I am trying my best to cope up with the case. I converted to Islam long ago to make myself comfortable with the people around,' he said.'I am looking for a lawyer who could defend my case but there is no one.' But De Wit's complaints that he had no legal representation were unfounded. He in fact worked with five different lawyers willing to take his case - only to fire each and every one of them, accusing them of incompetence or being in cahoots with the Dutch government. Already four years into a constant and ultimately futile struggle with Indian authorities to speed along proceedings, Vic told MailOnline in 2017: 'I am beyond frustrated and now have little confidence in the system. The problem is Mr De Wit has no representation and until the court imposes that on him this will not change.",
        "'Due to his mental health he can't represent himself and he keeps getting rid of his lawyers as he is so paranoid.'We have written to the judge and asked him to appoint a defender for De Wit, as he has the power to do. Why he hasn't done it, I have no idea.'Law experts say that the local police have failed to build a watertight case against De Wit and even failed to present witnesses in court. Some of the witnesses named in initial proceedings have died, such is the length of the case, while others have been deemed 'untraceable'. Meanwhile, flooding in Kashmir has wiped away evidence of the murder and two judges expected to hear the case have since stepped down.With each passing day, the chances of Sarah's family seeing justice become yet more slim, and 80-year-old Vic this week slammed Indian authorities for not taking his daughter's murder 'seriously'.He told MailOnline: 'It's frustrating because the authorities in Kashmir have never treated the trial of the Dutchman accused of Sarah's murder seriously.'There were more than 225 scheduled hearings over the first eight years of which only a small percentage actually took place. The trial was suspended some two years ago because the accused was deemed unfit to stand trial. This is the on-going situation as we understand matters.'But despite his anguish, Mr Groves hinted that the family might receive some kind of closure in the near future.He said: 'There are some developments, and we are hopeful that there will be a conclusion that offers some level of closure. No further comment on this at this stage.'Following her death, Sarah's family and friends set up the Sarah Groves Foundation to help keep her memory alive.Mr Groves revealed that its aim is to support art, fitness and adventure in young people's lives, areas that were 'close to Sarah's heart.'Last month, Vic told ITV on the ten-year anniversary of his daughter's murder that he has all but given up hope that Sarah's killer will be brought to trial and slammed the British government for their lack of involvement.'De Wit has supposedly been having treatment but we don't know where or how effective, so the trial itself has all but petered out.'We are unavoidably wrapped up in international politics and we have a British government who haven't stood by us.'Nothing has worked out in our favour as the political situation between federal India and Kashmir is at an all time low.'In other remarks to the BBC, Vic concluded: 'I haven't got too many more ten-year gaps to lose.'An FCDO spokesperson told MailOnline: 'We are providing consular assistance to the family of Sarah Groves and are in regular contact with the authorities in Kashmir.'"
    ]
}