{
    "articleURL": "/femail/article-12059747/Prince-William-reveals-George-Charlotte-Louis-tired-Coronation.html",
    "content": [
        "Prince William, 41, has revealed his children are 'so tired' after busy weekendRead more: Louis steals the show AGAIN during day out volunteering  Prince William has revealed Princes George and Louis and Princess Charlotte are exhausted after a busy Coronation weekend.",
        "The Prince of Wales, 41, made the confession while he and his family took part in a day of volunteering for 'The Big Help Out' to mark the final day of King Charles' Coronation.William told one helper that his children were ‘so tired’ after the coronation weekend and he was worried that he would have trouble getting them up for school tomorrow. It's been a busy weekend for all three of the little royals, with Prince George, nine, Princess Charlotte, eight, and Prince Louis, five, playing a starring role in a number of the events.    It's no secret that Princess Charlotte and her brother, Prince Louis, wowed viewers during their grandfather, King Charles's historic Coronation ceremony.",
        "The junior royals, aged 8, and 5, were photographed working very hard at the crowning at Westminster Abbey on May 6.The young Princess played the big sister role, by making sure to walk hand-in-hand with her brother as they arrived and departed the coronation service at the Abbey. Throughout the ceremony, Charlotte appeared to watch over her brother and even kept him entertained as she chatted up a storm with Louis, who left the service early to get some much needed rest. Their older brother, George, nine, and second in line to the thrown, had his own starring role as he played the role of one of King Charles's pages of honour.",
        "It's perhaps the reason why the young princess, who celebrated her birthday last week, was noticeably absent when her parents took a surprise stroll at Windsor Castle.Crowds gathered to meet the Prince and Princess of Wales who arrived on the Long Walk in Windsor, Berkshire, just before 2pm on Sunday afternoon. The doting father told Royal fans that his only daughter was exhausted after playing such an important role at her grandfather's Coronation. According to Hello Magazine he said: 'She's very tired after yesterday.'She's having a quiet day at home. It was making sure her little brother behaved himself.'",
        "However Princess Charlotte joined her brother Prince George and her parents for the Coronation concert yesterday.The little royal appeared in high spirits and could be seen singing along to music by Katy Perry during the event.Meanwhile Prince George was also excited to be attending the event, and could be seen playfully messing around with his father at the concert.Royal fans were left disappointed after Prince Louis didn't make an appearance at the Coronation concert at Windsor Castle yesterday evening - with many saying he was the only reason they tuned in. It seems the Coronation celebrations may have continued too late for the cheeky royal - as it was reported yesterday that it was past his bedtime.",
        "However the trio of siblings were out in full force again today, as they joined their parents for a day of volunteering in Slough.The Prince and Princess of Wales released new behind-the-scenes footage of their young children mucking in to help renovate a Scout hut as they led the nation in a day of volunteering.As the long Coronation weekend came to an end, thousands of people up and down the country gave gave back to their local community as part of the Big Help Out event, created to mark the official crowning of King Charles. Amongst those hard at work were Prince William and Kate who helped renovate the 3rd Upton Scouts Hut in Slough, Berkshire today, with the help of their three young children, Prince George, 9, Princess Charlotte, 8, and Prince Louis, 5.The video compilation showed the three youngsters eagerly taking part, with Prince Louis spotted driving a JCB digger with the help of his father, pushing a rather large wheelbarrow and shovelling soil.The beaming Princess of Wales was also captured toasting marshmallows on an open fire, helping out her own children and scouts at the event. ",
        "The two elder children were seen painting the park bench and playing archery. Eager to try everything from shovelling sand to painting a planter base and wheeling a barrow, the five-year-old royal ended the day splashed with paint but got his reward - a marshmallow-and-chocolate biscuit sandwich. ",
        "When William took control of a digger and dumped a bucket full of earth onto a spoil heap, Louis was sat in his father's lap after seeing nine-year-old George have a go and telling mum Kate 'I want to go in with him'.Louis was given his chance to take charge and asked 'What does this one do?' as he pulled a lever, but was not phased when the digger lurched back slightly and was encouraged by his father, who said 'Keep going Louis, that's it'.Later, the five-year-old prince was given the task of filling a wheelbarrow with builders' sand and he focused on the job, diligently shovelling the material before wheeling the barrow himself. "
    ]
}