{
    "articleURL": "/femail/article-12053561/Three-coronations-one-lifetime.html",
    "content": [
        "Lady Pamela saw coronation of late Queen in 1953 and King George VI in 1937She was not invited to King Charles' big day at Westminster Abbey on SaturdayRead more: Dawn breaks on a new era for the Royal Family How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk A bridesmaid of the late Queen and Prince Philip was today reminiscing with her daughter India after not being invited to the King's coronation - which will take place today.     ",
        "Lady Pamela Hicks, whose father, the 1st Earl Mountbatten of Burma was Prince Philip's uncle, is one of only two surviving bridesmaids from Queen Elizabeth and Prince Philip's wedding in 1947. However last month she received a telephone call from a secretary at Buckingham Palace, informing her that she had not been invited to the Coronation, to be held at Westminster Abbey today. It has been suggested that her father may be to blame for this decision, as Daily Mail columnist Sarah Vine said, it was Earl Mountbatten who 'convinced the Queen not to let Charles marry Camilla.'",
        "Speaking on Palace Confidential, she said: 'I don't think Charles has forgotten.'Today, Lady Pamela's daughter India Hicks posted a snippet of her conversations with her 94-year-old mother on Instagram, noting that she has witnessed three coronations in one lifetime.She said: 'As we sit on the sofa together my mother talks about the little green cape she wore to Buckingham Palace in 1937 to sandwiches hidden in coronets in 1953. Today she will watch a new reign unfold with great interest.'She reminds me that she grew up curtsying to her royal grandmother.'As small children my sister and I were made to practice our curtsey. Deep, deep curtseys for the Queen, knee nearly on the ground. We were so practiced in the art of the curtsey that when my father's secretary came over to the house one day, my sister went into a curtsey, she had slightly muddled Mrs. King, my father's secretary, with The Queen.'",
        "Lady Pamela was alive to witness the coronation of the late Queen in 1953, and that of King George VI in 1937 - but she was not invited to welcome in a new royal era today.She was also a bridesmaid at the wedding of Queen Elizabeth and Prince Philip, and served as one of the late Queen's ladies in waiting. Her daughter, India, was a bridesmaid at the wedding of King Charles and Princess Diana.India has also posted a number of keepsakes from these occasions to Instagram today. It emerged weeks ago that Lady Pamela hadn't been invited to the King's coronation, with her daughter India explaining they had received a call from the palace to tell them the news.",
        "She said: 'One of the King's personal secretaries was passing on a message from the King.'The King was sending his great love and apologies, he was offending many family and friends with the reduced [guest] list.'The palace official 'explained that this Coronation was to be very different to the Queen's' in 1953, when thousands more squeezed into Westminster Abbey.'Eight thousand guests would be whittled down to 1,000, alleviating the burden on the state.'India, who is a goddaughter of King Charles, insists: 'My mother was not offended at all.",
        "''How very, very sensible,' she said. Invitations based on meritocracy not aristocracy. 'I am going to follow with great interest the events of this new reign'.'"
    ]
}