{
    "articleURL": "/sport/nrl/article-12059699/NRL-Yes-campaign-ahead-vote-Indigenous-Voice-parliament.html",
    "content": [
        "The NRL is expected to formally back the Yes campaign on TuesdayReferendum on a vote to set up an Indigenous Voice will take place this yearAFL, Rugby Australia and Football Australia are also expected to back the vote The NRL is set to become the first major football code to throw its weight behind the Yes campaign ahead of the Voice to Parliament referendum.",
        "According to News Corp, the NRL will announce the decision on Tuesday, two weeks ahead of this season's Indigenous Round. Players are expected to be briefed ahead of the announcement.Tennis Australia and the Australian Olympic Committee have both publicly already come out in support of the Yes campaign and the major footy codes are expected to follow suit, along with Cricket Australia. Four years on since a representative body of Indigenous leaders issued the Uluru Statement from the Heart calling for a Voice to parliament, a referendum has been pencilled in for October. The NRL backed the Uluru Statement from the Heart and supported the Yes campaign ahead of the vote on same-sex marriage in 2017.",
        "The Voice would give Aboriginal and Torres Strait Islanders the chance to provide advice on laws and policies that directly affect them by operating as an advisory body to the parliament. Prime Minister Anthony Albanese has personally moved to secure the support of Australia's biggest sporting bodies.Along with Cricket Australia, the AFL, NRL, Rugby Australia, Netball Australia, Football Australia and Tennis Australia are all expected to back the Yes campaign.'I know from speaking to a number of NRL and AFL players, both past and present, that they will be active in putting their views in support of constitutional recognition,' Albanese said last month.",
        "'They've all been very supportive of Indigenous recognition for a long period of time.'Even before then, we will have the Indigenous rounds in both of the sports which will be a celebration of Indigenous Australians and their contribution to those sports.'And I expect that not just them but Tennis Australia have been supportive. Cricket Australia, all of the sporting codes.' NRL great Jonathan Thurston is among the supporters of the 'yes' campaign, along with former AFL star Eddie Betts and Olympic medalist Cathy Freeman.  ",
        "Last month, the AFL invited its 18 clubs to publicly disclose whether they would support the Yes campaign ahead of the referendum.'We invite and encourage you to advise us if your club will be taking a position to support the referendum yes campaign,' AFL Inclusion and Social Policy general manager Tanya Hosch said in the memo sent to the clubs.'As the AFL will be considering this in the coming weeks, your advice on this will be gratefully received.'Collingwood and West Coast are the only teams to have so far confirmed their support for an Indigenous Voice to Parliament."
    ]
}