{
    "articleURL": "/tvshowbiz/article-12047423/Emily-Ratajkowski-goes-TOPLESS-eye-popping-new-fashion-shoot-Homme-Girls.html",
    "content": [
        "Emily Ratajkowski went topless in her latest jaw-dropping shoot for Volume 9 of Homme Girls this week.",
        "The supermodel, 31, who wowed at the Met Gala on Monday, showed off her ample cleavage as she cradled her bust in her hands and struck a sultry pose.The black and white image also displayed her toned waist as she closed her eyes to show off her smoky eye make-up.The beauty wore a pair of jeans and her hair slicked back in a sleek ponytail.A further eyepopping snap saw the star show off her peachy posterior in a skimpy thong bikini paired with a green sports jacket.",
        "Emily showed off her rebellious side by flipping the middle finger as she posed in an artfully ripped New York Mets top, which was complemented by graphic blue shadow. The star also donned a khaki green gold jacket adorned with gold studs as she posed for the cover image.EmRata teamed this with a green plaid skirt and floral overlay, teamed with lavender fishnet tights. Further snaps also saw the star flash her midriff in a Prada crop-top teamed with belted underwear, as she struck a sizzling pose with her long locks slicked back form her visage.The star also flashed her bare bust in a tiny black top, teamed with red pants and platform white heels. This comes after Emily's current beau Harry Styles 'avoided' the Met Gala 'like the bubonic plague' in order to save himself from the risk of having an 'awkward run-in' with both his ex-girlfriend Olivia Wilde and Emily.",
        "According to a friend of the 29-year-old pop sensation - who was the first man to ever land a solo cover of American Vogue - Harry was extended an invitation to Anna Wintour's prestigious event but graciously declined after learning that Olivia, 39, and Emily were both attending. 'Harry was invited to the Met Gala, but knowing that both of them were definitely going, he avoided it like it was the bubonic plague,' the insider told DailyMail.com. ",
        "'He was told by his team that they would take all necessary steps to ensure that there was no awkward run in with Olivia, but he was not trying to risk it at all.' 'Harry has no desire to have a face-to-face encounter with Olivia at this time,' the insider adds. DailyMail.com has contacted Harry's spokesperson for comment.  The Met Gala marked the first time that Olivia and Emily have crossed paths since the model was caught on camera enjoying a very public kiss with Harry on the streets of Tokyo. But while Emily and Harry's incredibly public display is said to have left Olivia feeling 'betrayed', neither woman showed any signs of tension last night when they were both seen attending the Met Gala - before heading to the same after party at New York City hotspot Zero Bond. ",
        "Still, Harry - who was in a relationship with Don't Worry Darling director Olivia for two years until their November 2022 split - was not willing to take any risks when it came to potential run-ins with the two women.'Running into Olivia at an event with Emily would just be way too intense,' the source adds.  And for good reason. Four months after splitting with Olivia, Harry shocked the world when DailyMail.com published exclusive photos of him and Emily locking lips in a parking lot in Japan. At the time, a source told DailyMail.com that Olivia felt 'betrayed' by Emily's fling with her former partner, which happened just weeks after the two ladies were seen mingling at the Vanity Fair Oscars Party. "
    ]
}