{
    "articleURL": "/news/article-12046141/King-Charles-drives-Mall-ahead-Coronation.html",
    "content": [
        "King is seen being driven past royal fans just 48 hours ahead of his ceremonyCharles, 74, is seen outside Buckingham Palace and also Westminster Abbey King Charles III was today seen being driven past royal fans gathering on The Mall outside Buckingham Palace ahead of his Coronation in just 48 hours' time.",
        "The 74-year-old monarch was spotted by Reuters photographer Henry Nicholls as he sat in the back of a royal car dressed in a suit and looked out at the crowds.He was also photographed by the Daily Mail's Bradley Page today, who captured him talking to an aide as they were driven away from Westminster Abbey. ",
        "Charles and Camilla will be anointed and crowned at the Abbey in a ceremony on Saturday from 11am in front of 2,300 guests and a global audience of millions.It comes after the King and his wife Queen Consort Camilla yesterday joined the Prince and Princess of Wales and their children for a rehearsal at the royal church.There was also a rehearsal in the early hours of yesterday for the procession, revealing the first glimpses of the grandeur that will be witnessed on Saturday.Hundreds of soldiers, many on horseback, marched from the Palace past Trafalgar Square and Downing Street to the Abbey shortly after midnight yesterday.",
        "The Diamond Jubilee State Coach and Gold State Coach travelled down The Mall as part of the dry-run, with the parade making a return trip three hours later.Crowds ran through St James' Park to find the best spots near the palace, with many trying to spot relatives in their military outfits.",
        "Lambeth Palace later confirmed the Right Reverend Graham Usher, Bishop of Norwich, and the Bishop of Hereford, the Right Reverend Richard Jackson, will serve as Bishops Assistant to Camilla during the coronation service at Westminster Abbey.Already announced are Charles' Bishops Assistant - the Bishop of Durham, the Right Reverend Paul Butler, and the Bishop of Bath and Wells, the Right Reverend Michael Beasley."
    ]
}