{
    "articleURL": "/tvshowbiz/article-12049187/Chrissy-Teigen-shares-cute-video-daughter-Esti-husband-John-Legend-comes-defense.html",
    "content": [
        "Cravings CEO Chrissy Teigen shared a cute video on Thursday of her chilling on the couch of her $17.5M six-bedroom Beverly Hills mansion with her youngest child, daughter Esti Maxine Stephens.",
        "In the Instastory, the 37-year-old mother-of-three held her precious infant on her hip, and a drink between her legs, as the TV blared in the background.Little Esti - turning four months on May 13 - looked adorable in her pink gingham romper with a yellow houndstooth neckerchief.The child is technically Chrissy and her husband John Legend's fourth after aborting their son Jack, at 20 weeks gestation, in 2020 when their doctor informed them that she and the baby would not survive otherwise.The married couple of nine years will celebrate the fifth birthday of their son Miles Theodore Stephens on May 16, and they're also parents of seven-year-old daughter Luna Simone Stephens.",
        "On Thursday, the 44-year-old EGOT champ came to the defense of Teigen after Megyn Kelly blasted 'the absurdity, the elitism, the self-importance' of her appearance at the White House Correspondents' Association Dinner in Washington, DC last Saturday.'She showed up there like she was literally going to the coronation,' the 52-year-old SiriusXM podcaster scoffed on Monday's The Megyn Kelly Show.'She has, by my count, three minions following her holding the train of her non-existent dress. I can see underwear, okay? I see London, I see France, I see Chrissy Teigen's underpants. 'Nobody shows underpants at the Correspondents Dinner! Okay Chrissy, they just don't do it. And nobody shows up with serfs to carry their train.'",
        "John admitted it's not exactly normal behavior to have three people help carry his wife's Georges Hobeika SS/22 couture gown, but hiring a stylist like Alana Van Deraa is a normal part of being a famous woman.'[Chrissy] is very kind, very loving, very down to Earth, absolutely,' Legend (born Stephens) told TMZ outside MÍRAME in Beverly Hills.'Megyn, you know, likes attention. She needs it after she got fired from Fox, you know. She has to do what she can do to get attention. She pi**ed all the conservatives off when she asked Trump a tough question.'So now she's trying to figure out a way to win him back. That's her attempt. She's desperate. She can just shut up.'",
        "This, after Chrissy - who boasts 54.8M social media followers - took to Instastory on Wednesday to declare: 'The best revenge is living well.'The Wonder Woman singer is next scheduled to perform at Faena Art's 'Sonnet 18 Fundraising Spring Dinner' happening next Tuesday at Faena Hotel in Miami Beach, and tickets cost $2,500.Teigen will next voice Miss America Lucy Suwan in Robert Carlock and Sam Means' 20-episode, post-apocalyptic adult animated sitcom Mulligan, which premieres May 12 on Netflix.Mulligan also features the voice talent of Nat Faxon, Tina Fey, Daniel Radcliffe, Dana Carvey, Ronny Chieng, Sam RIchardson, Phil LaMarr,",
        "The half-Thai Utah native - a reformed cyber-bully - also keeps busy running her two-year-old lifestyle brand, which originated with her 2016 cookbook Cravings."
    ]
}