{
    "articleURL": "/news/article-12053279/Vietnam-angry-commemorative-coin-marking-50th-anniversary-Australian-troops-withdrawing.html",
    "content": [
        "Vietnam requests stop to commemorative coinCoin marks 50 years since end of Vietnam WarThe Vietnam government is reportedly furious about the release of an Australian commemorative war coin as they say it shows the flag of the toppled South Vietnamese regime, a claim the Australian government disputes.",
        "In April, the Royal Australian Mint issued 85,000 sets of gold and silver $2 coins in memory of the 50th anniversary of Aussie troops withdrawing from southern Vietnam.Vietnam Ministry of Foreign Affairs deputy spokeswoman Pham Thu Hang released a statement on Thursday asking the Australian government to immediately halt the production of the coin as it showed a banned regime flag.The South Vietnam yellow and red flag was banned by the Vietnamese government after the regime was overthrown.'We regret and strongly protest the Royal Australian Mint and Australia Post for issuing items with the image of the yellow flag — the flag of a regime that no longer exists,' the spokeswoman said.Australia and Vietnam stated their intention to move from a bilateral relationship to a comprehensive strategic partnership during National Assembly in Canberra last November, when chairman Vuong Dinh Hue's visited the Australian capital.'This is completely inconsistent with the good development trend (of those efforts),' Ms Hang said.",
        "However, the Royal Australian Mint defended the coins on Friday, stating it is a misunderstanding.'The design of the coin reflects the colours of the ribbons of the service medals awarded to Australians who served in Vietnam, including the Vietnam Service medal, introduced in 1968,' the mint said in a statement to AFP.",
        "'The Australian Government does not recognise the flag of the former Republic of Vietnam.'The Vietnam War was the war of Australia's longest involvement in the 20th century and became increasingly unpopular as thousands protested against the country's role in the conflict in the early 1970s.The Australian war memorial website states more than 60,000 Australian soldiers served in the Vietnam War with 523 losing their life and almost 2,400 wounded in battle.Australian troops withdrew from Vietnam in 1973 and in 1975 communists from the north stormed Saigon and unified the country."
    ]
}