{
    "articleURL": "/wires/reuters/article-12053677/QUOTES-Quotes-coronation-crowds-London.html",
    "content": [
        "LONDON, May 6 (Reuters) - People from across Britain and the world gathered on Saturday in central London for the coronation of King Charles III.",
        "Here is a selection of quotes from those in the crowd:Katie Mitchell, 25, on the balcony appearance by King Charles and the royal family:\"It was a brilliant way to end what was already a brilliant day. It was amazing to see them all there in real life, just like you'd see in a postcard.\"Sarah Alms, housewife:\"It has just been the most wonderful occasion despite the weather. I wouldn't have missed it for the world. We have had a monarchy for hundreds of years and it is our connection with the past. Where else would you get these crowds? It has just been the most marvellous sense of occasion.\"Maite Visinand, 27 Swiss tourist:\"The coronation is really a moment in history and it's incredible to be here, I feel really lucky. The last time was seventy years ago and I think the next time won't be for another ten or twenty years, so it's a really rare opportunity. I'm really lucky to have found very friendly people who've welcomed me up here and I have a great view from here.\"Michelle Fawcett, 52, a barrister, on watching King Charles and Queen Camilla pass in the Diamond Jubilee State Coach:\"It was a moment in history and pretty spectacular. I wouldn't have missed it for the world. No one else in the world does the pomp and ceremony like us.\"",
        "Peggy Jane Lavery, 79, retired teacher from United States:\"I'm excited that I can be a part of a coronation. When I was a young girl, I was able to watch Queen Elizabeth on television in Hartford, Connecticut, at a friend's house because we had no TV. So I'm thrilled to be here at the coronation in person and to hear all the vibes in person.\"Mark Strasshine, 36, from London:\"It's great to be able to get a glimpse even if it's a very, very busy event, a very wet, a very traditional British spring weather.\"On glimpsing Charles: \"It gives you a bit of confidence, it makes you feel the heart of the nation in you a little bit and stirs you a little bit inside. He looks ready for the day, it's obviously a big day for him.\"Abbie Dew, 9, from Crystal Palace in London:\"They [the King and Queen] looked very proud. It was exciting.\"Ben Nash, 34, business manager from Cornwall:\"Charles has big shoes to fill but he's done well so far. The Royal family is part of our heritage, it's what we do well as a country.\"Andy Mitchell, 63, a teacher from Farnham, Surrey:\"When you see everyone dressed up and taking part it is just fantastic. It makes you so proud. It is just incredible to be of part of this,\" he said.",
        "\"My big concern is that younger people are losing interest in all of this and it won't be the same in the future.\"Louise Fellows, 50, from Worcestershire:\"We came to [Queen Elizabeth's] funeral and we had such an amazing time we thought we'd come again. And I love dressing up and I loved the monarchy and it's just such a fantastic atmosphere. It's so much fun. It's brilliant.\"Joy Davenport, 62, from Devon:\"This is a new era. I´m a green supporter and I´m very interested to see how he´s going to encourage green issues.\"Anna Reynolds, 26, a teacher, from Twickenham, London on Charles:\"We don´t love him, we don´t hate him, there is just no great affection,\" she said. \"I think if we had a choice, we would just skip a generation.\"Sam Mindenhall, 27, cafe worker from Bristol:\"I think a lot of the issues that he [King Charles] cares about are quite important. I think he´s trying to not democratise the monarchy but trying to do his best to sort of balance such a tradition with modern Britain and the modern world.\" (Reporting by UK bureau Editing by Alexandra Hudson and Angus MacSwan)"
    ]
}