{
    "articleURL": "/news/article-12039821/Aussie-Home-Loans-founder-John-Symond-surprised-Reserve-Bank-Australias-rate-rise-3-85.html",
    "content": [
        "Aussie founder John Symond surprised at rate riseReserve Bank cash rate at 11-year high of 3.85 per cent Aussie Home Loans founder John Symond has admitted he was surprised by the Reserve Bank's decision to raise interest rates with inflation easing.",
        "The RBA cash rate on Tuesday rose by a quarter of a percentage point to an 11-year high of 3.85 per cent.'All I can say is I'm surprised,' he told Daily Mail Australia on Wednesday.More than two-thirds of mortgages are variable rates which react immediately to Reserve Bank rate increases.Mr Symond said this meant the RBA could afford to wait before raising interest rates again. 'My belief is interest rates in Australia are so much more centred on the average worker because we've got a high percentage of housing ownership which means our mortgages get hit pretty well straight away with these increases,' he said.",
        "Inflation in the year to March moderated to 7 per cent, down from the 32-year high pace of 7.8 per cent in December. 'I'm surprised they went the extra quarter,' Mr Symond said.'I thought they would have waited for three or four months.'Treasurer Jim Chalmers also admitted to being surprised at the latest rate rise.'I try not to get in the practice of guessing decisions taken by the independent Reserve Bank but certainly the market was surprised by it,' he told ABC News Breakfast.'The market typically has a reasonable handle on this and they were surprised yesterday.'The money markets had priced in a May rate rise as a 12 per cent chance while the 30-day interbank futures market predicted a 3.6 per cent RBA cash rate peak.",
        "Of the Big Four banks, only the Commonwealth Bank expected an increase in May, with inflation still well above the RBA's 2 to 3 per cent target.",
        "May's rate rise was the 11th in a just a year, marking the most severe pace of monetary policy tightening since 1989, before the RBA embarked on a target cash rate. This followed a pause in April after 10 consecutive rate rises from May 2022 to March 2023.Despite that, median house prices last month rose in Sydney, Melbourne, Adelaide, Perth and Hobart, CoreLogic data showed.Mr Symond said an under-supply of housing as immigration surged was likely to underpin a recovery in property prices, following the interest rate rise-induced downturn.'It's supply and demand, there's a huge shortage of housing for Australia and migration is increasing,' he said.'I think long-term, we need population.' ",
        "$500,000: Up $79 to $2,963 from $2,884$600,000: Up $95 to $3,555 from $3,460$700,000: Up $111 to $4,148 from $4,037$800,000: Up $127 to $4,740 from $4,613$900,000: Up $143 to $5,333 from $5,190$1,000,000: Up $158 to $5,925 from $5,767Monthly repayment figures for a 30-year loan based on a Commonwealth Bank variable rate rising to 5.89 per cent from 5.64 per cent to reflect the Reserve Bank cash rate increasing by 25 basis points  to 3.85 per cent, up from 3.6 per cent ",
        "Sydney, Australia's most interest rate sensitive market, saw its house values last month climb by another 1.3 per cent to $1,253,759.But this is also coinciding with federal government expectations of 400,000 migrants arriving in Australia in 2022-23, a level significantly higher than the October Budget forecast of 235,000.That surge in net overseas migration, driven by more international students, was expected to underpin a housing market recovery.Reserve Bank Governor Philip Lowe argued another rate rise was needed so inflation expectations didn't become entrenched, but admitted it was difficult for many borrowers.'I want to acknowledge that the combination of higher interest rates and other cost-of-living pressures is squeezing many people’s budgets and that it is a difficult time for many families,' he told a Perth dinner on Tuesday night.'Real wages have fallen and those with high debt have experienced a very large rise in their mortgage payments. 'I want to assure you that the board is very focused on understanding these pressures and we are taking them into account in our decisions.'Employees in the year to March saw their living costs surge by 9.6 per cent, a level well above inflation, following a 78.9 per cent soaring in mortgage costs, new Australian Bureau of Statistics data released on Wednesday showed.",
        "The latest rate rise means a borrower with an average, $600,000 loan will see their monthly repayment climb by $95 to $3,555, up from $3,460.That's based on a Commonwealth Bank variable rate rising to 5.89 per cent, up from 5.64 per cent, for a borrower with a 20 per cent deposit and a 30-year loan term. A year ago, someone with the same mortgage was paying $2,306 a month, when variable rates were at 2.29 per cent. Variable rate borrowers have seen their monthly repayments climb by 54 per cent.But those on fixed rates face an abrupt 65 per cent increase when their ultra-low 2 per cent fixed rates expire in 2023, and they are pushed on to much higher 'revert' variable rates tied to the latest 3.85 per cent RBA cash rate.In another sign of Australia's inflation challenge, spending in cafes, restaurants and on takeaway food rose by 1.5 per cent in March as food retailing went up to 1 per cent.Ben Dorber, the head of retail data at the Australian Bureau of Statistics, said this was 'largely driven by high food inflation' as food retailing rose for a 13th straight month despite the rate rises."
    ]
}