{
    "articleURL": "/tvshowbiz/article-12049493/Doja-Cat-gets-bat-skeleton-tattooed-ENTIRE-back.html",
    "content": [
        "Less than a month after getting a demonic monster tattooed on her left forearm, Grammy winner Doja Cat unveiled brand new ink covering her entire back.",
        "The skeleton of a bat has been permanently branded on to the controversial 27-year-old, who only had this to say: '\"Don't explain yourself\" is so corny.'Doja (born Amala Ratna Zandile Dlamini) also highlighted a passage reading: 'Bats often represent death in the sense of letting go of the old, and bringing in the new. They are symbols of transition, of initiation, and the start of a new beginning.'The Kill Bill rapper enlisted Bang Bang Tattoo artist Mr. K (born Sanghyuk Ko), who Instastoried a snap of their feet at the Manhattan studio.The Korean 42-year-old's celebrity clientele includes Matt Damon, Rita Ora, Michael J. Fox, David Beckham, Liam Hemsworth, Eiza González, Justin and Hailey Bieber, as well as Joe Jonas and his wife Sophie Turner.",
        "Bang Bang Tattoo - where appointments start at $500 - is owned by Keith McCurdy, who famously charged Justin Bieber more than $60K between 2013-2018 for doing his extensive body art, according to the New York Times.On April 15, Doja revealed her monster tattoo based on a Giovanni Battista Bissoni illustration from Italian philosopher Fortunio Liceti's 1634 book De Monstruorum Causis, Natura et Differentiis (On the Reasons, Nature, and Differences of Monsters).The Central LA Area New High School drop-out flaunted her tattooed sleeves while emulating the late Karl Lagerfeld's $13M Birman cat Choupette at Monday's Met Gala with help from prosthetic artist Malina Stearns.",
        "Doja wore a hand-beaded Oscar de La Renta gown and cat-eared hood with a million-dollar Messika diamond on her forehead thanks to the creative direction of her stylist Brett Alan Nelson.But it might be the I Don't Do Drugs star's first and last time attending the $50K/ticket Costume Institute benefit as curators Anna Wintour and Andrew Bolton told CBS Mornings' Gayle King that 'smoking' is the best way to never be invited back.Doja - who spends much of her time as a 'recluse' in her $2.2M Beverly Hills home - was spotted puffing away on her vape pipe as she waited to be interviewed by Vogue correspondent Emma Chamberlain.",
        "For her song on the Elvis soundtrack, the Vegas hitmaker will next compete for the best song trophy at the fan-voted 2023 MTV Movie &amp; TV Awards, which air this Sunday.Doja faces heavy competition against Demi Lovato, Lady Gaga, OneRepublic, Rihanna, and Taylor Swift at the host-less ceremony going on despite the WGA writers strike.The Get Into It (Yuh) singer - who nearly quit the music industry a year ago - has been putting the finishing touches on her fourth studio album tentatively titled Hellmouth, which RCA/Kemosabe Records will release later this year.On April 11, Doja tweeted that she kept 'changing my mind' about the album's title and when Twitter user @andeizar suggested 'attention seeking' she replied: 'I have a song about that on there!'"
    ]
}