{
    "articleURL": "/wires/reuters/article-12045103/MORNING-BID-EUROPE-Next-ECB-Will-hawkish-25-dovish-50.html",
    "content": [
        "A look at the day ahead in European and global markets from Vidya Ranganathan.",
        "The spotlight moves swiftly from the Fed's \"possible pause or pivot\" message overnight to the European Central Bank, where the direction of rates is not in question.It will be a seventh rate rise for the ECB, the central bank for a 20-country zone whose headline inflation is 7%, and it has so far dismissed the ongoing banking crisis as U.S.-specific.Will the ECB go for a heavier 50 basis-point hike and signal a possible pause, allowing President Christine Lagarde to echo Fed Chair Jerome Powell's \"credit tightening\" excuse? The odds are for a smaller rise.The Fed on Wednesday delivered what markets are convinced will be the last rate hike of the cycle. It signalled it may pause further increases, giving officials time to assess the fallout from the bank failures, wait on a political resolution to the U.S. debt ceiling, and monitor inflation.Another bank soon reported trouble. PacWest Bancorp fell nearly 60% after announcing it is exploring strategic options, including a potential sale or capital raise. A liquidity boost it announced in March failed to inspire confidence in its ailing share price.Those worries left Asian markets pricing in not just a possible peak in U.S. rates but even a fall. Fed Funds futures imply a 52% chance of a rate cut in July.",
        "The focus will move back to the tech sector later in post-market hours in the United States when the world's most valuable company, Apple Inc, may report a more than 4% drop in revenue, its second straight quarterly decline, weighed down by consumers shunning non-essential purchases such as iPhones and Mac computers and slowing growth at its services business.Key developments that could influence markets on Thursday:- Economic events: ECB rate decision, Eurozone March PPI, Germany trade balance, U.S. initial jobless claims- Earnings: Apple, Shell, Shopify, ArcelorMittal, Shell(Reporting by Vidya Ranganathan; Editing by Edmund Klamann)"
    ]
}