{
    "articleURL": "/wires/ap/article-12039337/Arsenal-beats-Chelsea-3-1-takes-league-lead-now.html",
    "content": [
        "Associated Press (AP) - Arsenal kept the Premier League title fight alive by beating up on a Chelsea team that seems to be in need of life support under Frank Lampard.",
        "Arsenal returned to the top of the standings - for a day at least - by dismantling Chelsea 3-1 at the Emirates Stadium on Tuesday to end a four-game winless run that saw its control of the title race slip away.The Gunners channeled their disappointment over last week´s 4-1 loss to rival Manchester City into a dominant first-half display, going 3-0 up inside 34 minutes as Chelsea slumped to a sixth straight loss in all competitions under Lampard.Martin Odegaard scored two nearly identical goals and Gabriel Jesus added the third minutes later. The visitors offered little in response until Chukwunonso Madueke pulled one back in the 65th but never came close to staging a comeback as the hosts saw out the game.\"We came out with a different spirit, a different team to last time (against City),\" Odegaard told Sky Sports. \"It hurt after the (City) game and we used this anger and the disappointment in this game to bounce back.\"The win puts Arsenal two points above Manchester City atop the standings, but given that Pep Guardiola's team has two games in hand - including at home against West Ham on Wednesday - it may not stay there for long.",
        "Arsenal was coming off the loss to City and a run of three straight draws before that. But Mikel Arteta's team couldn't have asked for much easier opposition as it tried to get back on track.",
        "\"If we want to have any chance to win the league, we had to win today,\" Arteta said.Granit Xhaka created the two opening goals in similar fashion, sending a low cross into the box from the left to pick out Odegaard, who beat goalkeeper Kepa Arrizabalaga with his left foot both times.That took any remaining air out of a Chelsea team that has nothing to play for and is languishing in 12th place under its third manager of the season in Lampard, who is set to leave at the end of the campaign.Jesus slotted in the third just three minutes after Odegaard's second following a rebound.Lampard gave former Arsenal striker Pierre-Emerick Aubameyang a rare start, but the Gunners' early domination meant that four of the forward's first seven touches in the game were kickoffs. He was taken off at halftime.\"First-half performance wasn´t good enough. In every way,\" Lampard said. \"We were nice to play against, in every way. ... If you play like that, you get what you get.\"Arsenal missed two good chances to extend the lead after the break as Thiago Silva cleared a header from fellow center back Gabriel off the line in the 50th and Kepa saved a low shot from Xhaka three minutes later.",
        "Madueke gave Chelsea a bit of hope as he got behind Oleksandr Zinchenko to meet a ball over the top and beat Aaron Ramsdale from close range.While Chelsea's intensity increased after that, Ramsdale didn't have another save to make until Kai Havertz tried a shot from a difficult angle in injury time. ___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}