{
    "articleURL": "/tvshowbiz/article-12055925/Amber-Rose-shows-sleeve-tattoos-cleavage-tank-sweatpants-walk-LA.html",
    "content": [
        "As a model and television personality, Amber Rose knows a thing or two about fashion and the glitz and glamour of the entertainment industry.",
        "But on Saturday the mother of two, 39, showed off her stripped down side when she headed out on a casual walk, where at one point she appeared to get into a deep conversation on the phone.The School Dance star opted to go makeup free as she made her way along the suburban streets of Los Angeles dressed in black sweatpants and a matching tank top that helped showcase her ample cleavage and array of tattoos up and down her armsShe also had her trademark dyed blonde locks closely cropped, which helps give a clear view of her tattoo on her forehead that reads, 'Bash Slash,' which is a reference to her two children, as reported by E! News.Rose's walk also comes just days after her ex-partner Alexander 'A.E' Edwards, 35, ended his romance with Cher, 76.",
        "Seemingly in the need for a little alone time, the Philadelphia native made her way along the sidewalk wearing a pair of green slides, as she carried a pack of cigarettes and a lighter in the hand that wasn't holding up her phone to her ear.The walk comes just days before the premiere of season two of College Hill: Celebrity Edition, which is a revival of the BET reality series College Hill.",
        "This go around a group of celebrities are enrolled at the HBCU, Alabama State University for some higher education, while also living together and soaking in the campus life.Rose is among the cast that also includes Ray J, Joseline Hernandez, Tiffany 'New York' Pollard, Parker McKenna Posey, Iman Shumpert, Kwaylon 'BlameItOnKway' Rogers, and O’Ryan, according to Entertainment Tonight.Over the past weeks, she has taken to her Instagram page to promote the new season that premieres on BET+ on Thursday, May 11, ET.'One of the best experiences of my life! Check out @collegehillseries on @betplus May 11th,' the reality star shared in the caption of a promotional video she posted on April 26.Meanwhile earlier this week news broke that her ex Alexander called it quits on his relationship with hitmaker Cher. TMZ is reporting that the former couple ended the relationship about two weeks ago, although it's still unclear what led up to the split and who actually took the initiative to end it.A source made a point of revealing that the pair were never engaged, to be married, despite a massive diamond ring she was gifted around the Christmas holidays.",
        "However, sources now contend that they were never actually engaged and decided to, 'play into the speculation it was an engagement ring.'",
        "Cher hasn't commented publicly on the split, and hasn't been active on Twitter or Instagram since March. Cher and Edwards were first linked back in November when they were photographed holding hands during a night out in West Hollywood. Later that month, she admitted their relationship, 'looks strange on paper' though she added, 'love doesn't know math.'When a fan asked on social media what Edwards' best qualities were, she said, 'He's kind, smart, hilarious... &amp; we kiss like teenagers.' Rose dated the music executive from 2018 to 2021, and is the father of their two-and-a-half year-old son Slash.During their romance, which began in September 2018, Edwards served as stepfather to her 10-year-old son Sebastian, whom she shares with ex-husband and rapper Wiz Khalifa.After ending the relationship last summer Rose went public with her grievances with Edwards, a Def Jam music executive, in a series of Instagram posts, where she accused him of being a serial cheater.",
        "'I’m tired of getting cheated on and being embarrassed behind the scenes,' she wrote at the time, adding, 'All 12 of y'all bums (the ones that I know of there's probably more) can have him.' But soon afterwards, in statement to ET, Edwards backtracked and shared, 'I am truly sorry for the hurt and humiliation I have caused Amber. I am sorry that my decisions have broke our family. Amber is an amazing woman, an amazing mother. She deserves to be loved how she wants to be loved. I was a bad boyfriend. But I'm a good man and a great father.'",
        "Rose and Khalifa (born Cameron Jibril Thomaz), 35, announced their separation in September 2014 after just over a year of marriage, and finalized the divorce in 2016.She has also previously dated rappers 21 Savage and Kanye West, NBA star James Harden and rapper-rocker Machine Gun Kelly, among others."
    ]
}