{
    "articleURL": "/sport/football/article-12042527/Where-Frank-Lampards-seven-match-losing-streak-puts-Premier-League-history.html",
    "content": [
        "Frank Lampard has over seen seven straight defeats in the Premier LeagueBut his disappointing number pales in comparison to Daniel Farke's at Norwich 13 coaches have eight back-to-back losses since the inauguration of the league Chelsea's abysmal 3-1 defeat at the hands of Arsenal on Wednesday evening marked Frank Lampard's fourth consecutive Premier League defeat since the start of his second doomed stint in charge of the west London outfit. ",
        "Coupled with losses against Real Madrid in both legs of the Blues' Champions League quarter-final, Lampard's ignominious return to Stamford Bridge gives him the dubious distinction of making the worst start by a manager at the club in its 105-year history. But Lampard's final weeks at Everton earlier this season were no more successful. Ahead of being handed his marching orders by the club's hierarchy in January, the former England international oversaw a woeful run of ten games across all competitions without a win. Lampard is now in the midst of a seven-match losing streak in the Premier League including stints at both clubs. ",
        "On the bright side, the Blues legend has a long way to go before matching the Premier League manager with the highest number of consecutive losses in the English top-flight. In September 2021, Daniel Farke made history with Norwich recording his 16th consecutive defeat after a lacklustre start to the season. The figure is made all the more remarkable by the fact that almost a year and a half had passed between Farke's Canaries beating Leicester 1-0 at Carrow Road and losing to Everton on the road. Norwich were relegated at the end of the 2019-20 season and promoted from the Championship less than a year later, with the German manager's losing streak bookending a year spent away from the top-flight. ",
        "Farke was sacked with ironic timing, just hours after the team recorded their first victory of the 2021-22 season, which saw Norwich nab an away 2-1 win against Brentford. Norwich would only win four more times that season before being banished back to the division below. Nipping at his heels in second place is Mick McCarthy, who oversaw 15 defeats on the trot during his spell at Sunderland in 2003, only to oversee another disappointing run with the Black Cats two years later. From January 2003 until the season's end in May, McCarthy's side only scored six times, but miraculously, he kept his job at the Stadium of Light. The second run, which came two years later, saw the drought come between October and December, finishing with a limp 0-0 draw against Bolton Wanderers on Boxing Day in 2005. But the turnaround did not lead to an upswing in form, and McCarthy was sacked in March 2006. ",
        "In the list of the 18 managers who have recorded over eight consecutive losses, British managers far outweigh their foreign counterparts, with only four on the list managing overseas. One of the more high profile names, Roberto Martinez, was at the helm of Wigan when the Latics recorded eight straight defeats. The Spanish manager's ill-fated 2011-12 campaign saw Wigan win only four matches between August and February, but an incredible fightback in the spring saved the side from relegation and steadied Martinez's footing at the club. ",
        "Chris Wilder also recorded eight straight defeats, with Sheffield United between October and December 2020, during which time the Blades also set the record for the worst-ever start to a Premier League season not including points deductions, as did Alan Pardew, who was sacked in April 2018 amidst a 10-game winless run. ",
        "ManagerDaniel FarkeMick McCarthy Mick McCarthy Chris Wilder Jan Siewert John Carver Roberto Martinez Paul Hart Steve Coppell Paul Jewell Peter Taylor Egil Roger Olsen Alan Curbishley Bryan Robson Alan Ball George Burley  No of defeats16 15 9 8 8 8 8 8 8 8 8 8 8 8 8 8 Club and seasonNorwich 19/20, 21/22Sunderland 02/03Sunderland 05/06 Sheffield United 20/21Huddersfield 19/20 Newcastle 17/18 Wigan 2011/12 Portsmouth 09/10 Reading 07/08 Derby County 07/08Leicester 00/01 Wimbledon 99/00West Ham 99/00 Middlesbrough 95/96Manchester City 95/96 Ipswich Town 94/95  *Data courtesy of Stats Perform"
    ]
}