{
    "articleURL": "/news/article-12040723/Guardian-editor-apologises-ex-BBC-chairman-Richard-Sharp-cartoon.html",
    "content": [
        "Katharine Viner has been facing calls to resign over the offensive cartoonIt depicted Richard Sharp, who is Jewish, with 'outsized grotesque features'The editor of the Guardian has written to apologise to the ex-BBC chairman at the centre of an anti-Semitism row over a 'sickening' cartoon in the newspaper.",
        "Katharine Viner has been facing calls to resign over the offensive image which depicted Richard Sharp, who is Jewish, with 'outsized grotesque features'.She has also agreed to speak to the UK's leading Jewish community body to 'discuss their concerns'.",
        "The Board of Deputies of British Jews said yesterday they would also raise 'other examples of questionable output'.Drawn by cartoonist Martin Rowson, it showed the ex-Goldman Sachs banker carrying a box from the bank stuffed with a squid, Rishi Sunak's head, and what appeared to be gold coins. Dave Rich, of Jewish charity the Community Security Trust, told the Jewish Chronicle the cartoon 'falls squarely into an anti-Semitic tradition of depicting Jews with outsized grotesque features, often in conjunction with money and power'.In a 1,000-word statement Mr Rowson, 64, said he felt 'enormous regret, idiocy and deep shame.'He explained he knew Sharp was Jewish because they both attended the fee-paying Merchant Taylors' school in North London, but insisted that Sharp's Jewishness 'never crossed my mind as I drew him'.'I was trying to draw him looking silently furious, by implication with Johnson, in the standard caricatural way common to all political cartoons of exaggerating various of his features.'I thought at the time it was a fairly mild caricature compared with how I'd draw Johnson.' ",
        "A Guardian spokesman said the meeting with the Board of Deputies would go ahead, adding Ms Viner had personally written to Mr Sharp to apologise for the cartoon. ",
        "Discussing The Guardian's cartoon of the former BBC chairman, Stephen Pollard, former editor of the Jewish Chronicle, described it as 'unambiguously antisemitic', adding: 'It takes a lot to shock me. But I still find it genuinely shocking that not a single person looked at this and said, 'No, we can't run this.' Boris Johnson suggested those responsible at The Guardian for publishing the image should resign. 'Frankly whoever commissioned and printed this has made a far worse mistake than Richard Sharp,' he said. 'They should take his lead.'Writing on Twitter, award-winning screenwriter Lee Kern also said: 'The Guardian is antisemitic. If a paper can be institutionally racist, it's them.'Critics also highlighted that the cartoon appeared to feature a bloodied pig's head and Rishi Sunak portrayed as a puppet. Alex Hearn, co-director of Labour Against Antisemitism, said: 'It is extraordinary that so many classic anti-Jewish motifs were squeezed into one cartoon, without The Guardian editors objecting.'Mr Sharp resigned from his BBC role last week after a report found he broke rules by failing to declare involvement in a £800,000 loan guarantee for Boris Johnson.",
        "The publication of a review by Adam Heppinstall KC found Mr Sharp, who was acting as an adviser in No10, had told Mr Johnson he wanted to be BBC chair before formally applying in November 2020.The review found both matters amounted to a breach of the Governance Code, but did not challenge Mr Sharp's insistence that mistakes were 'inadvertent'. "
    ]
}