{
    "articleURL": "/wires/ap/article-12048743/Correa-Buxton-lift-Twins-White-Sox-12-innings.html",
    "content": [
        "CHICAGO (AP) - Carlos Correa drove in a run during Minnesota´s five-run 12th inning, and he and Byron Buxton homered to lift the Twins over the Chicago White Sox 7-3 Thursday and avoid a three-game sweep.",
        "The AL Central-leading Twins had lost three of four. Correa spurred Minnesota to victory hours after downplaying remarks from Chicago reliever Keynan Middleton, who called Correa \"a cheater\" in reference to his time with the Houston Astros.Eloy Jiménez homered for the White Sox, who ended a three-game winning streak.\"These games are good because a lot of people have to do a lot of good things in order to win,\" Twins manager Rocco Baldelli said. \"Everyone kept their cool and kept playing well and lasted long enough for the late-inning explosion.\"Chicago shortstop Elvis Andrus misplayed Jose Miranda´s leadoff grounder in the 12th and Trevor Larnach scooted in from second to give Minnesota the lead for good. Nick Gordon and Correa added RBIs later in the inning and Jorge Polanco broke the game open with a two-run double.Emilio Pagán (2-0) worked the 11th to get the win.",
        "Alex Colomé (0-1), the fifth Chicago reliever, took the loss. The White Sox had just one hit in the final six innings while stranding nine runners.\"It´s probably the best we´ve been since I´ve been here,\" Pagán said of his bullpen mates, who issued five intentional walks in the final five innings while allowing just one hit.\"It´s cool for (Baldelli) to show confidence in us to get into the zone when we need to.\"",
        "Jiménez singled in the first to extend his hitting streak to seven games, then smacked Pablo López´s pitch into the left-center stands in the third to give the White Sox a 2-0 lead.Correa hit a solo shot in the sixth off Lucas Giolito before Buxton added an eighth-inning blast off Reynaldo López to tie it.\"We were 1 for 16 with runners in scoring position,\" Chicago manager Pedro Grifol said. \"We had some good hitters at the plate. ... Just one of those days, man.\"Middleton struck out Correa to end Wednesday´s Chicago victory, then called him a cheater. Middleton played his first five seasons in the AL West, overlapping with Houston's tainted 2017 title run.\"I´ve heard worse,\" Correa told reporters before Thursday´s series finale. \"I´m just glad he´s doing good and he´s playing good and he can take care of his family.Correa´s shot ended Giolito´s run of 13 straight outs. The Chicago starter allowed just two hits and struck out seven with three walks in the first seven.Pablo López allowed six hits and a walk while striking out eight in the first seven innings.SHORT ORDERChicago´s Billy Hamilton, a pinch-runner after Andrew Vaughn walked to open the eighth, stole second and got to third on Jhoan Duran´s wild pitch with no outs. He stayed there, however, after Duran induced three grounders to short to escape.",
        "TRAINER´S ROOMChicago: INF Jake Burger was placed on the 10-day injured list before the game with a strained left oblique. Burger, who´s hit a team-best seven homers so far, left after the fourth inning Wednesday night with soreness. The club recalled Lenyn Sosa from Triple-A Charlotte and started him at second base.UP NEXTThe Twins travel to Cleveland on Friday, where they´ll send RHP Bailey Ober (1-0, 1.59) against likely starter RHP Peyton Battenfield (0-2, 4.67).The White Sox begin a three-game series the same night in Cincinnati, where Lance Lynn (0-4, 7.16) faces fellow RHP Hunter Greene (0-1, 2.89).___More AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}