{
    "articleURL": "/sport/boxing/article-12058843/Jake-Paul-insists-Tommy-Fury-rematch-going-happen-claiming-Brit-fight-again.html",
    "content": [
        "Jake Paul says that a rematch against Tommy Fury 'is going to happen, for sure' Their initial fight was one of the most-watched bouts in the last few years He also said that some fighters were 'not willing to risk their undefeated records' Jake Paul insists that a rematch between him and Tommy Fury 'is going to happen' following the massive interest that their initial fight attracted. ",
        "The 26-year-old was defeated by the former Love Island star back in February via a split decision, the only blemish on his six-fight career, in front of a capacity crowd in Saudi Arabia.It was one of the most anticipated fights of the year, with the American claiming that the fight attracted over 500,000 pay-per-view buys around the world, with Mail Sport reporting that Paul made over £25million from the fight even after losing.To put that into perspective, it took Floyd Mayweather 38 fights to earn a similar total, with Paul taking the lion's share of the PPV sales, which were set at £39.54 ($49.99).After his defeat, the YouTube boxing announced that he'll take on MMA fighter Nate Diaz next on August 5, but is confident that he would have a rematch against Fury sometime in the future.",
        "'It's going to happen, it's going to happen for sure,' Paul said to Sky Sports at this weekend's Miami Grand Prix.'I think it was a great fight, it was entertaining, it was the biggest pay-per-view buys in boxing for the last two years so I think we have to run it back.'Tommy is down and I'm excited for that.' Their initial meeting was one of the most talked about fights in the sport. Fans had to wait nearly two years for the fight to materialise, with Fury first pulling out of their 2021 bout with a broken rib and a chest infection, before a visa issue prevented him from going to the US to promote the rescheduled fight in 2022.",
        "Ultimately, it was the British fighter who would reign victorious, with the judges calling the fight 76-73, 76-73, 74-75 in his favour, but Paul challenged him throughout, knocking him down in the final round. It means Fury's fight record now stands at 9-0, while it's not clear who Fury will be taking on next, he has confirmed he will play in this summer's charity Soccer Aid match. Paul, meanwhile, is no stranger to taking on big opponents having beaten the likes of Ben Askren, Tyron Woodley and Anderson Silva, all big names in the fight sports world. ",
        "But he also admitted that some of the biggest names in boxing are not willing to put their unbeaten records on the line and should instead start squaring off against other champions.  'It's annoying, I think in boxing fighters are not willing to risk their undefeated record and put it all on the line,' he added.'Their legacy and being undefeated is more important to them, because Floyd Mayweather set that example for the sport so if you lose you're 'swept under the rug' in boxing.'But more champions should go and fight other big names, and that's why I respect Ryan Garcia for even taking the Tank fight. Even though he lost he did what a lot of other fighters aren't doing and making big fights happen.'"
    ]
}