{
    "articleURL": "/sport/mma/article-12041623/Could-Leon-Edwards-new-challenger-UFC-288-Gilbert-Burns-Belal-Muhammad-action.html",
    "content": [
        "Gilbert Burns just defeated Jorge Masvidal and is jumping straight back in He takes on Belal Muhammad and the winner has a great claim for a title shot Britain's Leon Edwards is the champion and will be watching with great interest Leon Edwards might be the most interested observer of UFC 288 on Saturday night. ",
        "The co-main event between Gilbert Burns and Belal Muhammad could well - if he has his way - provide the next challenger to his welterweight title. 'Rocky' initially flatly refused to take on Colby Covington in his next fight, insisting 'Chaos' does not deserve the opportunity despite Dana White declaring that the controversial American is next. White was booed by fans (and Burns and Masvidal) at a press conference in Miami when asked about Covington being at the front of the queue.And the tide may be turning enough to persuade the UFC that Edwards will have another legitimate contender after this weekend's New Jersey event. ",
        "Covington cut weight as the replacement for Edwards' defence against Kamaru Usman in March and expects to be rewarded. He's also a pay-per-view draw, with as many tuning in to support him as those who want to see him lose. But it will put the UFC in a tricky situation on Saturday night if one of Muhammad or Burns completely steal the show. White chose his words extremely carefully when speaking about the fight. 'What I love about this is that they both wanted it to be five rounds,' the UFC president said. 'Two of the best guys in the division, and both think they deserve a title shot after this.'",
        "It was hardly a denial and teased that it might be something the UFC contemplate, although it would be one hell of a U-turn given his old comments. White had previously said: 'Colby Covington deserves this shot at the title. When you become the champ, everybody's coming after you.'All the straight killers are coming after you for the next three times a f***ing year, you're faced with nothing but the baddest dudes in the world in your division.",
        "'If you look at Usman and what he did, Usman ran through that division twice. Usman's one of the greatest of all time. Leon just beat him twice. You're the man, Leon. You're the guy. And everyone's coming after you, and it's going to be Colby next.'If Usman doesn't exist Colby's been the champ now for a while.'He's been there forever. He cut the weight. He showed up to fill in for that fight and a million other reasons why he deserves that fight.'But Covington has lost two of his last four, both title fights with Usman, and beat Masvidal last year in a decision. By contrast, Muhammad has won eight of his last nine with the only other result being his 'no contest' against Edwards in 2021, stopped for a horrendous eye poke. ",
        "If he was to add Burns to his recent hit list of Sean Brady, Vicente Luque, Stephen Thompson and Demian Maia, it would be very difficult to argue that he doesn't deserve his chance. Burns, meanwhile, has beaten Neil Magny and Masvidal since losing his last title shot against Usman so another big victory would also give him a compelling case. Edwards has said he won't be fighting in July on the London card, meaning neither would need a tight turnaround, and is targeting the October card in Abu Dhabi. ",
        "As it stands, he is still odds on to face Covington and appears to have softened his stance, telling Sky Sports last month: 'I think Colby Covington is like a Btech Usman, there's nothing there. If that's what they want I'll give them that, the opponent doesn't bother me, it's more the date.'I remember when I was going through the pandemic he was like \"who's Leon Edwards?\" and now look, he's like begging me for the title shot.'How times have changed, now I'm king of the hill and I'll sit back and let him beg some more. I've earned it.'If it is Colby it's Colby, they are all similar fights anyway. There's nothing fearful about Colby.' Perhaps Edwards realises he is fighting a losing battle with the UFC by refusing Covington, or maybe he sees very little threat to his crown in the American, who is not known as a finisher. ",
        "But nothing has been announced and uncertainty will grow if Muhammad or Burns can make a statement this Saturday. Muhammad even thinks his detractors have warmed towards him as a by-product of the general fan sentiment that Covington would be lucky to be next. 'Them giving the shot to Colby, I think it, like, worked out better for me because that’s when the fans started being like, \"All right, well, bro, that doesn’t make any sense at all,\"' he told Thicc Boy. 'This guy’s on an eight-fight winning streak. He has history with Leon. What else does he need to do?’ ",
        "'Even the haters, I was getting so many messages, like, \"I hate you, but you deserve the title fight.\"'Burns has pledged to be the back-up fighter for Edwards vs Covington, if the fight comes to fruition and White accepted his offer. As it stands, the Brazilian is a marginal favourite to win on Saturday night but faces a hungry and relentless competitor. It will be fascinating to see who comes out on top, and how loud they plead their case to heap pressure on the UFC and make the promotion waver in their position to reward Covington. "
    ]
}