{
    "articleURL": "/wires/ap/article-12048393/Indiana-governor-signs-bills-targeting-LGBTQ-students.html",
    "content": [
        "INDIANAPOLIS (AP) - Indiana's governor on Thursday signed a bill that will require schools to notify a parent if a student requests a name or pronoun change at school, one of the final bills approved in a legislative session that had targeted LGBTQ+ people in the state, especially students.",
        "Critics worry the law could out transgender children to their families and erode trust between students and teachers while supporters have contested the legislation keeps parents empowered and informed about their children when at school.Republican Gov. Eric Holcomb's approval of the legislation comes in a year when GOP-led legislatures around the country are seeking to curb LGBTQ+ rights, specifically targeting trans people's participation in sports, workplaces and schools, as well as their access to health care.Recently, Florida Republicans on Wednesday also approved a bill that would prevent students and teachers from being required to use pronouns that don´t correspond to someone´s sex, a bill Republican Gov. Ron DeSantis is expected to sign into law. Meanwhile, at least 16 states, including Indiana,have banned or restricted access to gender-affirming care such as hormones, puberty blockers, and surgeries.Indiana's name and pronouns law, which goes into effect July 1, will require school officials to provide written notification to a child´s parent or guardian within five business days of the child asking to be called a different \"pronoun, title, or word,\" according to the bill. It also prohibits, from prekindergarten through third grade, instruction on \"human sexuality,\" something that is not defined in the bill.\"I believe in parental rights,\" Holcomb said in a statement Thursday. \"I also just believe its commonsense that sex education should not be taught in prekindergarten through third grade.\"",
        "GOP bill author Rep. Michelle Davis said the law will \"ensure Hoosier parents are in the driver´s seat when it comes to introducing sensitive topics to their kids.\"\"I continue to hear from constituents who are concerned about what their kids are being taught in the classroom, and that they´re being left out of important discussions with their children,\" she said in a statement. \"This new law will also increase transparency by requiring that parents be notified if their child is struggling with their gender identity at school.\"Holcomb also signed into law on Thursday a bill that could make it easier to ban books from public school libraries, staff at which would be required by July 1 to publicly post a list of books they offer and provide a complaints process for community members.Schools and librarians could also no longer argue, as a legal defense, that the texts in their libraries have \"educational\" value. The law would still allow them to argue the text has literary, artistic, political or scientific value.Those who supported the legislation expressed concern that sexually inappropriate or \"pornographic\" materials are available to children in school libraries. Critics, however, said the legislation could open the door to banning books or criminal prosecutions of librarians simply because some people don´t like the topics of the texts, particularly those with LGBTQ+ themes.",
        "Holcomb said he was \"happy that these decisions will continue to take place at the local level.\"The American Civil Liberties Union of Indiana said, however, laws like these only serve to \"control what youth can and cannot read, what they can and cannot learn, and - most troublingly - who they can and cannot be.\"\"Trans youth thrive when they are affirmed in their gender identity, which includes being called by a name and pronouns that reflect who they are,\" said Katie Blair, ACLU of Indiana advocacy and public policy director.___Arleigh Rodgers is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow her on Twitter at https://twitter.com/arleighrodgers."
    ]
}