{
    "articleURL": "/wires/afp/article-12051539/Mali-junta-hold-vote-new-constitution-June.html",
    "content": [
        "Mali's military junta announced Friday a referendum on a new constitution to be held on June 18 in a delayed step towards a return to civilian rule in the insurgency-wracked west African nation.",
        "The referendum had been scheduled for March 19 but was postponed indefinitely as the impoverished Sahel state battles jihadist and separatist insurgencies that broke out in the north in 2012.Government spokesman colonel Abdoulaye Maiga read out a decree on state television saying the country would be called upon \"to decide on the constitution\" in June.The new constitution is the first major step in plans the military has invoked to justify continuing to govern until 2024, following the ouster of former president Ibrahim Boubacar Keita in August 2020.Elections are due in February 2024 to restore a civilian government in Bamako.\"Voters will have to respond by a 'yes' or a 'no' to the following question,\" on the referendum, the spokesman said. \"Do you approve of the draft constitution?\"Members of the security forces will vote early on June 11, white ballots for yes, red for no.The spokesman, who had stated that 2024 remained the electoral \"deadline\" when he announced the delay, said Friday the government had \"kept its word\".- 'Satisfaction' -The delay had fed fears the elections would be delayed, while the junta said it needed more time to promote the new draft and to organise the staging of the referendum across the vast country.Mali came under pressure from the regional bloc ECOWAS to stick to the calendar to hand over power.",
        "The Economic Community of West African States slapped sanctions on Bamako in January 2022 when the junta considered staying in government for five years to tackle the security and economic crisis.The sanctions were lifted in July the same year on the landlocked nation of 20 million.ECOWAS expressed its \"satisfaction\" after Friday's announcement.This decision \"marks an important step\" in the implementation of the timetable for the return of civilians to power, the bloc said in a statement.The draft would significantly strengthen the power of the president.It says the head of state, and not the government as before, \"determines the policy of the nation\", appoints the prime minister and ministers and has the right to terminate their functions.The junta ended a long-standing alliance with France and other Western partners and has turned to Russia's Wagner mercenaries for help in the fight against jihadism.The military enjoys strong popular support according to an opinion poll of 2,295 Malians by Germany's Friedrich-Ebert-Stiftung foundation in February.More than nine out of 10 people said they were satisfied with the authorities. Three out of five declared that keeping to the deadline to restore civilian rule was not important.The June 18 referendum will be the first national vote since 2020.- Multiple challenges -",
        "Constitutional change has long been debated in Mali. A referendum set for 2017 did not take place.A brief government, set up by army colonels, announced in April 2021 that a referendum would be held that October.Within weeks that government was swept aside and senior officers took over, declaring Colonel Assimi Goita the transitional president.Multiple challenges await the holding of the referendum, from attacks on voting stations to logistical problems and the registration of voters.At the same time armed opposition groups in the north, a section of civil society and some Muslim religious figures do not support a secular state.Goita has issued \"very firm instructions\" for the referendum to have all the necessary logistical, financial and security support, the junta spokesman said.The referendum campaign will run from June 2-16."
    ]
}