{
    "articleURL": "/wires/ap/article-12038943/US-Turkey-sanction-2-al-Qaida-linked-militants-Mideast.html",
    "content": [
        "BEIRUT (AP) - The United States and Turkey on Tuesday slapped sanctions on two al-Qaida-linked militants believed to have raised money for two militant groups operating in Syria, the U.S. Treasury said.",
        "The announcement followed another joint move by Washington and Ankara four months ago, when they sanctioned a network of people and companies accusing of helping deliver funds to the extremist Islamic State group.One of the two sanctioned on Tuesday was a Syria-based militant, identified as Omar al-Sheak. He is suspected of assisting in the financing of Hayat Tahrir al-Sham, a key al-Qaida-linked group in Syria's rebel-held northwestern Idlib province.The other militant, said to be based in Turkey and identified as Kubilay Sari, is said to have helped finance Katibat al-Tawhid wa al-Jihad, which the U.S. described as \"predominantly Uzbek\" jihadi group that also operates in Idlib.The U.S. and the United Nations have designated both groups as terrorist organizations.\"As terrorist groups continue to seek access to the international financial system, collaboration with our partners increases our ability to more effectively disrupt these facilitation networks,\" Under Secretary of the Treasury for Terrorism and Financial Intelligence Brian E. Nelson said in the statement.Nelson added that Washington will continue working with Turkey and other countries in the region to \"disrupt the flow of funds to terrorist groups and to degrade their capacity to operate\".The Treasury said al-Sheak, also known as Abu Ahmed Zakour, had held various posts in the Hayat Tahrir al-Sham militant group, as well as its predecessor, the Nusra Front.",
        "The other sanctioned militant, Sari was said to have funneled money to militant groups through his bank account in Turkey since 2018.The Uzbek militant group has been active outside of Syria and was accused in the 2017 bombing of the Saint Petersburg metro in Russia and a suicide car bomb attack at the Chinese Embassy in Kyrgyzstan in 2016."
    ]
}