{
    "articleURL": "/tvshowbiz/article-12053095/Stars-Mars-Hollywood-celebrities-Aussie-outback-new-reality-show.html",
    "content": [
        "South Australia's Coober Pedy has just increased its 2,000 strong population by a few hundred as international celebrities flock to the outback for filming. ",
        "The likes of Lance Armstrong, Tom Schwartz, Ariel Winter and Ronda Rousey will test their mettle against the arid landscape in new reality show Stars on Mars.Footage captured by Seven News on Tuesday showed a small group of large white domes linked together by a living facility in the desert of the opal-mining town.Construction and camera crews could be seen milling about the construction as they prepared for filming to commence at the end of May ahead of a June premiere.Meant to simulate the harsh 'realities' of surviving on the red planet, the last celebrity standing in the Coober Pedy set will be dubbed 'the celebronaut'. ",
        "While Stars on Mars will be the biggest production shot in SA, it is by no means the first with some of Hollywood's cult classic films having been shot there. Mad Max Beyond Thunderdome, Pitch Black and The Adventures of Priscilla: Queen of the Desert all had sets based in Coober Pedy. Commissioned by Fox Entertainment and made by Fremantle's Eureka Productions, the star-studded reality television show will bring huge benefits to SA residents.  ",
        "According to the state government, the TV project will bring traffic to 150 businesses in the area and create approximately 250 screen industry jobs. 'Stars on Mars might be set on another planet but this production will have real-world impacts for the Australian screen industry, supporting local jobs and expertise,' Arts Minister Tony Burke said. ",
        "The South Australian Film Corporation and government location incentives have helped get the project off the ground in Coober Pedy. With international celebrities already on set, including Star Trek actor William Shatner, filming will commence in just a few weeks with the launch set for June 5. The 12 celebrities will participate in competitions to colonize and conquer a simulation of Mars in a quest to be named \"the brightest star in the galaxy,\"' People reported.",
        "Vanderpump Rules star Tom Schwartz will be joined on the show by fellow reality star Porsha Williams of Real Housewives of Atlanta, musical artist Tinashe, Modern Family alum Ariel Winter, Superbad actor Christopher Mintz-Plasse, actress Natasha Leggero, and fashion entrepreneur Tallulah Willis. Other notable names from the world of sports to compete include Olympic figure skater Adam Rippon, NFL icons Marshawn Lynch and Richard Sherman, cyclist Lance Armstrong and WWE star Ronda Rousey.'To any celebrities out there, don't try this at home,' said Shatner, who in October of 2021 was a passenger on Jeff Bezos's Blue Origin space shuttle during a flight to space.The reality show comes a year after Fox took another innovative stab at the genre with the series Special Forces: World's Toughest Test, which The Bachelorette's Hannah Brown won competing against notable names such as Mel B, Kate Gosselin and Kenya Moore."
    ]
}