{
    "articleURL": "/news/article-12060043/TSA-worker-suspended-pending-investigation-video-yanking-drug-detection-dog-neck.html",
    "content": [
        "A TSA worker has been suspended after footage showed him dragging his explosives detection dog by the neck prompts backlashUnidentified employee has been removed from dog handling duties and his status is pending the outcome of an investigation Agency says the official's conduct was 'unacceptable' and they have referred the dog to the vet A Detroit Transportation Security Administration (TSA) worker has been suspended pending an investigation over a video of him dragging his explosives detection dog by the neck.",
        "The unidentified official appears to be walking his canine partner on a tight leash across Detroit Metropolitan Airport in Wayne County before harshly pulling the dog in U-turns and retracing his steps. His four-legged helper struggles to maintain its balance on the floor as it is aggressively pulled by its neck. The tall, bearded man has now been suspended after an online backlash to a video of the incident erupted.TSA said the employee has been removed from dog handling duties and his status is pending until an investigation into his conduct is completed. ",
        "In a statement posted to Twitter on Monday morning the agency said: 'Video showing a TSA explosive detection canine handler aggressively pulling a dog working in a Detroit Metropolitan Airport (DTW) terminal was shared with local leadership this morning.'The behavior displayed by this handler is unacceptable and not within the high standards we hold our officers to.''TSA officials at DTW have removed the employee from handling duties pending completion of an investigation, and directed that the canine be taken immediately to a veterinarian for a wellness exam.'A spokesperson for the agency told Mail Online that the dog went to the vet on Monday morning and is healthy and uninjured.  The video appears to have been shot by a member of the public from the Delta Sky Club lounge at the airport before being uploaded to the online site Reddit. ",
        "The poster, using the online username ProfessionalEye3568, wrote on the site that they shot the footage on Sunday morning at the McNamara Terminal. ",
        "Alongside the video the passenger added, 'I was shocked at how this airport handler is dragging this poor pup around.  'There’s no reason anyone should be flipping a working dog around by it’s harness like this?! 'I have a high energy dog so at first I assumed it was a mistake or that the puppy was a bit over energetic but looks like the handler is just being unnecessarily rough with it.' The brown and white German Shorthair Pointer, a breed commonly used in explosive and drug detection work, continued to sniff at passing travelers' luggage after being pulled around each time. ",
        "One reddit user commented under the video: 'This is abuse and it's hard to watch.' Another wrote, 'If he's willing to treat the dog like that in public, I can only imagine what it's like behind the scenes.'Other users said they found the clip so disturbing that they reported the footage to the TSA and The American Society for the Prevention of Cruelty to Animals (ASPCA)."
    ]
}