{
    "articleURL": "/sport/othersports/article-12042415/Tori-Bowie-Shelly-Ann-Fraser-Pryce-Noah-Lyles-lead-tributes-great-competitor.html",
    "content": [
        "A statement from her management company revealed she had passed away Track stars from around the world offered condolences and tributes to her DailyMail.com provides all the latest international sports news Tributes poured in for Tori Bowie, the American track and field star who has died at the age of 32.",
        "US Track and Field confirmed her death in a statement to DailyMail.com, saying, 'USATF is deeply saddened by the passing of Tori Bowie, a three-time Olympic medalist and two-time world champion. 'A talented athlete, her impact on the sport is immeasurable, and she will be greatly missed.' Tributes to Bowie began pouring in within moments of her death being announced by her management company, ICON Management. Top track athletes like Shelly-Ann Fraser-Pryce, Noah Lyles, and Sha'Carri Richardson all mourned the loss of Bowie in posts on social media. ",
        "Lyles, a US record holder and three-time world champion led the reactions to Bowie's passing - responding to her management agency's statement on Twitter, saying: 'I can't believe this. I had just heard word of her going to be with her sister back home and now this. This breaks my heart to hear and I will keep the family in my prayers.' One of Bowie's competitors, Jamaican Olympic champion Fraser-Pryce also paid tribute, tweeting, 'My heart breaks for the family of Tori Bowie. A great competitor and source of light. Your energy and smile will always be with me. Rest in peace.'Multiple American track and field athletes also offered condolences as they woke up to the news early Wednesday. Sha'Carri Richardson, the woman that won the 100m sprint but was disqualified after a failed drug test, posted on her Instagram story, 'People never know what you're going through. Rise up Queen, you deserve peace.' ",
        "Tianna Bartoletta, a teammate of Bowie's on the winning 4x100m relay team in Rio tweeted out a heartbreak emoji and a picture of her running to hug Bowie after their gold medal victory.American long jumper Brittney Reese said, 'I'm so heartbroken over this...You have made a lot of us proud thank you for representing our state of Mississippi like you did... RIP!'Ashley Spencer, who won Bronze in Rio in the 400m hurdles said, 'Tori was such a wonderful woman. Every time I saw her I could always count on a laugh, a smile and light. This is devastating.' Carmelita Jeter, who won three medals in London's 2012 Olympics - including gold in the 4x100m relay - tweeted, 'Gone To [sic] Soon ... Rest In Peace'Francena McCorory, who won back-to-back golds in 2012 and 2016 on the 4x400m relay team said, 'I am heartbroken she was such a sweet soul!' Kenyan Olympian javelin thrower Julius Yego tweeted, 'So devastating and shocking to learn of the passing on of Tori Bowie. The world of athletics have lost a great champion and patriot of the sport, rest in peace Tori. Condolences to the greater family of Tori Bowie, together in prayers.'Great Britain sprinter Richard Kilty, quote tweeted her management's statement saying, 'Rest in Peace Champ'.",
        "Another British Olympian, Jade Johnson tweeted out a heartfelt message saying, 'I'm completely IN SHOCK right now! Tori Bowie, one of the most talented athletes in the world has passed away at the age of only 32 years old!'",
        "'I know that people die...BUT this just doesn't feel right!?! She was SO young with SO much ahead of her?! Heartbreaking!' Bowie was found dead in her home in Winter Garden on Tuesday. Her cause of death is yet to become public.The Orange County Sheriff's Office said she was found at 1pm after someone called to request a welfare check at her home.No foul play is suspected, but her cause of death remains unconfirmed."
    ]
}