{
    "articleURL": "/femail/article-12053045/Cook-Coronation-crown-fit-King.html",
    "content": [
        "Follow MailOnline's new Royals channel for all the latest news and updates Whether you’re stringing out bunting for a street party, planning a picnic with friends or hosting the family for a Bank Holiday lunch, there’s nothing like a Coronation to get everyone cooking up a celebratory feast.",
        "Food has always played a part in the crowning of a new monarch — especially when that monarch, like King Charles, is such a staunch supporter of British farming and produce.We’ll be hosting more than 100,000 Coronation Big Lunches — part of a community project of which Camilla is patron — and in excess of 50,000 street parties across the UK over the weekend.As such, scones, clotted cream, cucumbers, shortbread, sausage rolls and ingredients for Victoria sponge cakes are all flying off supermarket shelves as millions of us stock up for the big day.If you’re one of the many millions ringing in the celebrations, there’s one dish that’s guaranteed to impress — and make a stunning centrepiece for your Coronation table: an edible crown.",
        "The ultimate royal recipe, there are numerous variations for you to try: Mary Berry makes hers out of scones; Bake Off winner Nadiya Hussain’s is filled with ham and cheese; Jamie Oliver uses suet and root vegetables. Last week, Cadbury even created one entirely out of chocolate.But one edible crown truly has the royal seal of approval — and it looks uncannily similar to the 360-year-old St Edward’s Crown that will be placed on Charles’ head on Saturday.Made by cheesemakers at Long Clawson Dairy in Melton Mowbray, Leicestershire, the recipe comprises a 2kg wheel of their award-winning 1912 stilton, a bunch of grapes (in place of purple ermine), puff pastry artifice and pomegranate and pecan ‘jewels’.",
        "‘The recipe came about because the King is a big supporter of stilton and British cheese, and stilton is often referred to as the “King of Cheeses”,’ explains master cheesemaker Kim Kettle.Indeed, when Charles visited the dairy in 1985 and 2012 he was fascinated by the cheesemaking process, and let slip that he’s a huge fan of stilton, so it’s likely to be on the menu at the Palace this weekend, too.Here’s your guide to making your own Coronation cheese crown — as well as a host of other recipes worthy of a royal feast to remember . . .",
        "How to make your own cheese crownThe ultimate Coronation centrepiece, this is a showstopping cheeseboard with a regal twist.IngredientsOne large wheel of stilton / other British blue cheese (about 2kg), plus 1 small wedge to grateTwo rolls puff pastry One egg Bunch red grapesOne packet pecan nutsOne pomegranateMethodGrate the smaller wedge of stilton.Unroll the puff pastry and sprinkle one half with half the grated cheese. Fold it over lengthways so that the cheese is inside and press down tightly.Use a sharp knife to cut the pastry lengthways into four strips. Repeat with the other roll.Rotate each strip of pastry between your fingers at either end until it forms a twist.Line a baking tray with greaseproof paper. Place a large, ovenproof bowl (with a diameter at least as wide as your wheel of stilton) on top.Place two pastry twists around the base of the bowl, joined at the ends to make a circle. Repeat with another two twists on top.",
        "Use the other four twists to make a cross on top of the bowl, cutting off any excess, and press together tightly to join at the top and base.Use any extra bits of pastry to make adornments for your crown: jewels, crosses and an orb for the top. Space these well apart on the baking tray.Whisk the egg in a small bowl and brush the pastry all over.Put in an oven preheated to 180c/fan 160/gas 4) and bake for 30 minutes or until all the pastry is puffed and golden.Leave everything to cool completely before assembling your crown.Place the stilton in the centre of a serving platter, topped with a bunch of grapes. Carefully transfer the pastry crown on top, using cocktail sticks to secure any gaps or stick on any pastry adornments.Top with pomegranate seed jewels, pecan nuts around the base and any other edible décor (from silver n balls to gold lustre spray) you want. Share and enjoy!To find out more about the Coronation Big Lunch, visit CoronationBigLunch.com.Bake Off’s Briony May Williams’ peanut butter and chocolate celebration cookies Rustle up these Coronation cookies to be the most popular guest at your Coronation Big Lunch this weekend!A twist on the classic crowd-pleaser, my cookies are a whizz to make and the perfect moreish treat to enjoy with a cup of tea and a chat with the neighbours.",
        "Makes 16 cookies",
        "Ingredients 125g unsalted butter, softened  250g crunchy peanut butter 125g golden caster sugar 175g light soft brown sugar One large egg One tbsp milk 300g plain flour One tsp bicarbonate of soda One and a half tsp baking powder One tsp salt One to two tsp crushed fennel seeds 250g dark chocolate chips Method Preheat the oven to 180c/ 160c fan/gas 4. Line two baking trays with parchment. Place the butter, peanut butter, and sugars in a stand mixer with paddle attachment. Beat until well combined. Place the egg and milk in a mug and beat with a fork until mixed well. Tip into the butter mixture and mix until combined.Put the flour, bicarb, baking powder, salt and fennel seeds in a bowl then whisk to combine thoroughly.Tip the flour mixture into the butter, egg, and milk mixture and stir gently until combined. Add the chocolate chips and mix until just coming together.For each cookie, break off a Brussels sprout-sized piece of the dough and roll into a ball. Place on parchment and press down to flatten.Bake for 8-10 minutes until the cookies are just hardening.Put on wire rack to cool fully.@brionymaybakesOllie Dabbous' garden cupcakes  These are absolutely delicious: buttery and rich, but balanced by the acidity of the cooked raspberries within. The topping is by no means a regular frosting, which is usually just made by whipping butter and sugar and invariably tastes overly sweet. This version is based on mascarpone and yoghurt and is only lightly sweetened, creating something far more refined. The orange blossom, along with the orange zest, give a delicious fragrance. The herbs and flowers you use to decorate the cakes are completely up to you and obviously dependent on what (unsprayed, untreated) herbs and edible flowers you can get your hands on. You can just keep adding these; restraint goes out of the window in this instance. More is more. ",
        "Makes eight ",
        "Ingredients Cakes:200g salted butter, plus more, melted, for the cake cases 220g icing sugar 80g plain flour Two tsps baking powder 150g ground almonds 200g egg whites 24 raspberriesFor the frosting: 250g mascarpone 120g strained Greek yoghurt 80g extra-thick or regular double cream, whipped to firm peaks 50g icing sugar, sifted Finely grated zest of ½ orange One tsp orange blossom water To assemble: Icing sugarMixed herbs, edible blossoms and petals MethodFirst, make the cakes. Heat the butter in a saucepan over a medium heat. Wait for it to stop foaming, stirring regularly until the pan is filled with flecks of a hazelnut colour and the butter smells nutty. This is beurre noisette: brown butter.Once it is a nice deep golden colour, pour it into a bowl, including the sediment, to cool to room temperature.Sift the icing sugar, flour and baking powder into the bowl of a food mixer, then stir in the almonds.Gradually whisk in the brown butter, then gradually add the egg whites. Chill for 1 hour.Preheat the oven to 190c/170c fan/gas 5. Line a muffin tin with eight paper cases and brush each with butter.Fill each case one-quarter full with the batter, then push three raspberries into the centre of each. Add more batter until each case is three-quarters full.Bake for 15 minutes, then leave to cool for five minutes. Remove the cakes from the trays and paper cases and leave them upside down on a wire rack. This will flatten the tops slightly, which will make the piping easier. For the frosting, lightly whisk everything together, with a folding rather than a beating motion. (Mascarpone and yoghurt become runny if over-whipped and the mix should remain firm.) Transfer to a piping bag fitted with a star-shaped nozzle if you have one. Leave to chill in the refrigerator. T",
        "o assemble, dust the cakes, with icing sugar. Pipe the frosting generously on top, squeezing the bag firmly. Place the herbs and flowers on top, to create height and volume.Taken from Essential, by Ollie Dabbous (Bloomsbury Absolute).Ainsley Harriott’s cheese and greens breakfast muffinsThe smell of savoury breakfast muffins baking in the morning is delightful. These are truly moreish and are actually good for any time of the day. Delicious with soup and perfect for picnics, the muffins are also a great way to get your kids to eat some greens. You can really mix up the greens too — when in season I love to throw in a handful of wild garlic, or a mix of spinach and watercress is nice, as it adds a peppery twist. As a treat, sometimes I swap the seeds on top for a little crispy bacon.Makes 12 muffins",
        "Ingredients150g baby spinach leaves (or a mix of your favourite soft green leaves) One egg, beaten 300ml milk 50g butter, melted One heaped tsp English mustard 350g plain flour Two tsp baking powder Half tsp caster sugar One tsp salt Two tsp finely snipped chives 100g Cheddar or Gruyère, grated One tbsp pumpkin or sunflower seedsMethodPreheat the oven to 200c/180c fan/gas 6. Line a 12-hole muffin tin with paper cases.Put the spinach in a sieve or colander and slowly pour a full kettle of boiling water over it. Refresh under cold water then squeeze out all of the moisture, using your hands.Add to a food processor and blitz until finely chopped.Add the egg, milk, melted butter, and mustard and blend until well combined.Sift the flour and baking powder into a large bowl and stir in the sugar, salt, chives, and three quarters of the grated cheese.Stir the liquid into the dry ingredients, taking care not to over-mix — it should be evenly distributed, but still quite lumpy.Divide the mixture between the muffin cases, scatter over the remaining grated cheese and the seeds and bake for 18-20 minutes until golden, firm and a skewer inserted into the centre comes out clean.Transfer to a wire rack and allow to cool slightly. Delicious when served warm.From Ainsley’s Good Mood Food, by Ainsley Harriott (Ebury Press, £20)."
    ]
}