{
    "articleURL": "/news/article-12059891/Woman-forced-tear-Welsh-cabin-garden-faces-9-000-year-second-home-tax-bill.html",
    "content": [
        "Hazel Cullen, 60, is facing a huge bill for the cabin in Powys, WalesThe bill came after complaints from a neighbour about the lighting in her cabin She believes she will pay up to 300 per cent premium on it by the end of the year A woman may be forced to tear down her Welsh holiday cabin following neighbour complaints about its lights.",
        "Hazel Cullen, 60, believes she could face a £9,000-a-year second home tax bill after transforming a tired-looking garden cabin into a small lodge.This represents a 300 per cent premium on her cabin by the end of this financial year - worth more than three times the bills in her 11-room country home. The fee comes despite no one ever paying council tax on the cabin before she moved into Matt's Farm in Powys, Wales, she claimed. 'It isn't a second home. If I wanted to go on holiday to my second home why would I want to do it in my back garden,' Hazel said.  ",
        "The cabin is said to be no larger than a standard garage, hosting a bathroom, a bedroom and a small lounge.Guests have previously stayed in the cabin, but it has no kitchen, so Hazel has previously cooked for them in her home. The former hairdresser claimed the bill came after a valuation officer from Powys County Council showed up at her house in 2020.She has since spent the last three years arguing that a second home council tax should not be paid on the cabin, with it simply being an extension to her home.",
        "Hazel continued: 'They've said they won't remove the council tax on it unless it becomes derelict so basically I now have to demolish it.",
        "'We love Wales, we love providing tourism in Wales, but this has all made us think: 'Do we want to live over the border instead?' My husband has always lived in Wales and he has said it's got so bad with all of the charges that he would now consider moving to England to do it instead.'Here I could turn every room in this house into bed and breakfast accommodation and they wouldn't charge us a penny extra but I can't have the cabin outside, which was already there when we got here, without being charged this premium. This was my retirement dream but this whole thing has put the kibosh on it.'It would be such a shame [to have to demolish it] because we love it here and we love the area. So many small local businesses are having difficulties and we always recommend local places and places to go and see.'Since 2017 local authorities in Wales have been able to charge a premium of up to 100 per cent of the standard rate of council tax on second homes designed to prevent second home-owners taking over Wales' top visitor spots. ",
        "But under new criteria councils will have the power to increase council tax premiums to 300 per cent. The Valuation Office Agency assesses properties in Wales for council tax based on whether their primary use is considered domestic or non-domestic. ",
        "Supporters of the Wales-only measure say it is crucial to quelling soaring house prices and lack of housing availability, particularly in sought-after coastal locations. But there are many opponents too who say the policy will cripple Wales' tourism economy. Hazel believes it is 'common sense' that a cabin in a garden isn't a second home. She added: '[First Minister Mark] Drakeford has a cabin in the bottom of his garden that he stayed in during Covid, presumably because his cabin has all the amenities needed to live in which our cabin hasn't got. Is Mr Drakeford paying second home tax on that? If not why should I?' Powys council currently charges a 75 per cent premium after councillors unanimously passed the measure in February. A spokesman for Powys County Council said: 'The Valuation Office Agency (VOA) will decide if a property is classified as a commercial property or a domestic property. Their classification will determine whether the owner is liable to pay either business rates or council tax.",
        "'For a self-catering unit to be classified as a commercial property, from April 1, 2023, the property must: in the previous 12 months, prior to the assessment, been available for letting commercially as self-catering accommodation for 252 days or more; and during the previous 12-month period been commercially let for at least 182 days.",
        "'Owners who want to challenge the classification of their property would need to contact the VOA. From April 1, 2023, local authorities are able to charge a council tax premium on periodically occupied properties of up to 300 per cent. Currently Powys County Council charges a 75 per cent premium.'A Welsh Government spokeswoman said: 'It is for each local authority to decide whether to apply council tax premiums to the second homes and long-term empty properties in their area. There are a number of exceptions to the premiums and, following consultation, we have recently extended these. 'Holiday lets captured by one of the exceptions should not be charged a premium. We have also updated our guidance to confirm local authorities have discretionary powers to reduce or remove the requirement to pay a premium or the standard rate of council tax in the event that the new letting thresholds are not met.'",
        "Since 2017 local authorities in Wales have been able to charge a premium of up to 100 per cent of the standard rate of council tax on second homes designed to prevent second home-owners taking over Wales' top visitor spots.But under new criteria councils will have the power to increase council tax premiums to 300 per cent. The Valuation Office Agency assesses properties in Wales for council tax based on whether their primary use is considered domestic or non-domestic. Supporters of the Wales-only measure say it is crucial to quelling soaring house prices and lack of housing availability, particularly in sought-after coastal locations. But there are many opponents too who say the policy will cripple Wales' tourism economy. "
    ]
}