{
    "articleURL": "/news/article-12060979/Boris-Charles-bust-Rwanda-policy-ex-No-10-media-chief-claims.html",
    "content": [
        "Boris Johnson allegedly 'squared up' to King Charles over the Rwanda scheme  Boris Johnson 'squared up' to Charles after he branded the Government's Rwanda scheme 'appalling', it was claimed last night.",
        "In an extraordinary clash last year, the ex-PM allegedly rounded on the then Prince of Wales and warned him against interfering in politics.The 15-minute showdown at a Commonwealth summit in Rwanda in June followed revelations in the Mail that Charles had privately described the plan to deport Channel migrants to the African state as 'appalling'.At the time, No 10 denied there had been a row, with Mr Johnson saying only that the two men had had a 'good old chinwag'. And last night, friends of Mr Johnson said he did not recognise the account and that it was 'inaccurate'.In a bombshell revelation in a new podcast called Unprecedented, for Global Player, No 10's former director of communications Guto Harri says the then PM told him he 'went in quite hard' against the future King over his decision to wade into the highly sensitive political matter. He also reveals that Mr Johnson warned Charles against making a speech expressing regret over slavery, telling him it could open up demands for reparations.",
        "The warning was ignored and the speech went ahead.Writing in the Mail today, the former BBC journalist reveals that the meeting between the then PM and future King at last year's Commonwealth Heads of Government summit was 'less amicable' than it was painted at the time. 'Boris briefed that the two had 'a good old chinwag' and had 'covered a lot of ground',' he writes.",
        "'What actually happened was less amicable. 'I went in quite hard', he told me at the time, essentially squaring up to the prince and confronting him about what he – as unelected royalty – had said about the actions of a democratically elected government.'Prince Charles was busted. He had obviously expressed some criticism, and though he tried to play it down, Boris pointed out the obvious, [saying]: 'If you didn't say it we both know your people could ring the newspapers and kill the story. The fact they haven't done that says it all'.'Mr Harri suggests the two men had struggled to get on for years, with Charles never forgiving Mr Johnson for being late for a meeting when he was London mayor.He says the bust-up in Rwanda was the final straw, adding: 'Relations never fully recovered and Charles will be relieved that Boris had left No 10 before he ascended to the throne.'The revelations threaten to reopen controversy about the extent to which the new King will interfere with politics. As Prince of Wales, Charles was accused of meddling in government affairs – such as with his 'black spider' letters to ministers and other officials, which were eventually made public under Freedom of Information laws.",
        "Five years ago, he pledged to stop interfering when he became monarch. When asked if he planned to reign as King in the same interventionist way, he replied: 'I'm not that stupid. I do realise that it is a separate exercise being sovereign. So, of course, I understand entirely how that should operate.'His intervention on Rwanda last year infuriated ministers, coming at a time when the Government was facing fierce criticism from Labour and human rights lawyers. Clarence House did not dispute that Charles had criticised the plan in private.Ministers insist the plan to send Channel migrants to Rwanda to have their asylum claims processed is the only way to break the business model of the criminal gangs who profit from the trade in human misery.But the policy has not yet come into force, following legal action and an intervention by the European Court of Human Rights.Last night, sources close to Mr Johnson said: 'This account is simply inaccurate and does not reflect the conversation that took place. Boris Johnson has had nothing to do with this podcast, had no knowledge of it and deplores any attempt to report such conversations in public.'Friends of Mr Johnson added that he deeply disapproved of the leaking of conversations with the heir to the throne and would never do so himself. Buckingham Palace declined to comment last night. But a royal source said the King was 'extremely mindful' of his new constitutional role.",
        "Global Player's new political memoir podcast series, Unprecedented, gives an exclusive first-hand account of Mr Harri's time as director of communications in Downing Street. Each episode is available exclusively on Global Player every Thursday and on other platforms every Friday."
    ]
}