{
    "articleURL": "/wires/aap/article-12049505/Family-speaks-mental-health-issues-shooting.html",
    "content": [
        "The family of a South Australian man shot dead during a violent confrontation with police has alluded to his mental health issues as they offered their thoughts and prayers for the two injured officers.",
        "In a statement, the family of Sean Ferris said their thoughts were also with the Crystal Brook and police communities.\"Our hearts are broken by the significant harm that occurred,\" they said.\"Mental health is an insidious disease and has the potential to create a devastating impact on families and our community.\"\"At this time, our family requests some privacy as we try to process this tragedy and the loss of a loved family member.\"In the incident on Wednesday, sergeants Ian Todd and Jordan Allely had gone to the property on Symons Street to follow up on a minor incident at the local supermarket the day before.That was believed to involve a complaint about the dead man's dog.In what followed both men suffered stab wounds while Mr Ferris was shot and killed.Sgt Todd, 53, remains in Royal Adelaide Hospital after life-saving surgery on wounds to his neck, arms and hands.Sgt Allely, 32, was also taken to hospital with less serious injuries and has since been discharged.In a statement the family of Sgt Todd thanked police, ambulance officers, doctors, nurses and other first responders, who had helped him and his colleague.\"In particular, we would like to thank the member of the public who came to the scene and rendered assistance to them both,\" the family said.",
        "\"We are grateful for the courage that they displayed during such a confronting incident.\"Police Commissioner Grant Stevens said it was hoped both officers would be able to return to work, but that would depend on their individual circumstances.\"This is something that we will work through with each of the officers,\" he said.\"Dealing with an event like this is not just about recovering from physical injuries but it's about taking into account what they've had to do as police officers and the impact that will have on them going forward.\"My hope is that we can work with them to restore them to full duties but we'll do whatever we can to make sure that they come out of this as best as possible.\"Mr Stevens has declined to elaborate further on the circumstances surrounding the incident, with an internal inquiry, major crime and coronial investigations under way.He said he did not intend to interfere with those investigations.\"There will be a point in time when we can disclose more details about what actually transpired,\" he said.\"We do need to let the investigation take its course.\"Lifeline 13 11 14beyondblue 1300 22 4636"
    ]
}