{
    "articleURL": "/news/article-12054709/Schoolboy-written-teachers-entrepreneurial-giant-company-worth-75-million.html",
    "content": [
        "Jamie Fraser's first job was on a market stall selling bargain basement clothing The 28-year-old became the founder and CEO of award-winning InterExA schoolboy written off by his teacher has gone on to become an entrepreneurial giant with a company worth £75 million.",
        "After struggling at school, Jamie Fraser's first job was working on a market stall selling bargain basement women's clothing.But the 28-year-old became the founder and CEO of award-winning InterEx, a staffing agency specialising in tech, cloud, cyber security and project delivery sectors, with offices in London, New York and Miami.Jamie was a directionless teenager who developed a stutter and, after leaving school with just four GCSEs, was sucked into trouble that almost landed him in jail.A turbulent childhood and a lack of opportunity at school were propelling him towards an empty life until he gained an opportunity with a recruitment firm that triggered a career path to success.",
        "The former street stall trader, who worked in the markets where Lord Alan Sugar started his business life, now wants to create platforms and pathways to make it easier for youngsters to get into business and build careers.'I wasn't academic so school offered me very little and there are thousands of children like me who just fall by the wayside because they don't fit in and that is a tragic waste,' Jamie said.'I wasn't a trouble-maker, but I was always the one who would do something. I was a daredevil and I didn't care because there didn't seem to be a future for me. It could have all gone horribly wrong, as it does for so many kids who aren't given a chance. I want to change that.'",
        "Jamie has set up a fund to support budding young entrepreneurs, which will give them the finances to propel their ideas, as well as the mentorship he craved as a youngster.InterEx has been on the expansion trail since 2018, with new offices opening in the Netherlands and France. The company opened a new branch in Miami last year as business continued to boom.But Jamie's early years in east London were clouded by turmoil after his parents split up when he was two years old.",
        "He spent his formative years as a shy child with a fractured family life.'My childhood was rocky and my mum didn't have much and it was very tough,' he said.'We were on the move a lot and my Dad was terrible with money so we never had any.'He added: 'Then as a teenager my personality suddenly exploded with all the anger in me. If we were out as a group, it would always be me who did the crazy thing because I didn't care. I still have that daredevil streak but it is controlled and directed now; it is a positive energy.'Jamie, whose mum moved the family to the Essex outskirts of London, had several run-ins with the police and was expelled from school, leaving with only four GCSEs and bleak prospects. ",
        "The only work he could get was on market stalls selling women's clothing before doing 4am shifts at Billingsgate Fish Market. He spent time in Spain with his father to escape escalating trouble at home and on his return was offered an internship in banking recruitment. It failed to ignite his passion, but he found a talent for the industry and commitment to hard work. ",
        "His rapid progress was recognised by other firms and he was poached by a rival company for a permanent role.'Someone recognised something in me and took a chance on me. They had faith in me and that was crucial,' he said. 'That is the sort of intervention I want to make in other people's lives – to show them that they can achieve and give them direction to make it, providing they are prepared to work hard.'Jamie added: 'I had interviewed at about 30 places and was horrible at it. I got nervous and stuttered and never got a look in but he saw something in me and gave me a shot. 'I was never going to let him down for that so I was never late and felt awkward if I got something wrong. It instilled a discipline in me to work hard and if you do that consistently, it separates from others.'",
        "Jamie built a successful profile with leading sales figures and the rewards started flowing in. It was a natural move for him to branch out on his own and InterEx was founded in a tiny office in Loughton, Essex, in 2016, when he was 22 years old.But, again, trouble lurked around the corner and a public row involving a girlfriend and a group of men lead to an affray, which landed him with a community service and curfew.",
        "This meant that he had to take time away from his fledgling business to work on gardening projects in public parks.'I hated doing it because I just wanted to focus on my business but it was my mistake and I had to accept that and get on with it,' Jamie said. 'If you have done something wrong in life or work, you have to own it, deal with it and move on.'He added: 'My first office was just me, a telephone and four walls you could touch without moving. I also had a tag for the curfew so not a promising start. But I knew the business and I was relentless. I lived five minutes from the office and worked all the hours I could.'My mum's partner leant me the money to get started and I was so focused that I soon repaid that and moved to a bigger office. I was always moving forward and the business grew and grew. I now have a lovely lifestyle and can afford virtually anything I want.",
        "'My goal is to keep growing the business to the point I can sell it when I'm 32 and not have to worry about anything. That will just show what a kid who was written off at school can achieve. I love being a success and I want others to follow me.'The problem is that UK schools are doing nothing to help children get into business or become entrepreneurs. There is nothing that connects with them at a young age to show how they can be successful which is so frustrating as it is a waste of the nation's talent.'He continued: 'We've doubled the business in the last two years and are one of the fastest growing recruitment companies in the industry because I set myself and my staff ambitious goals.'I believe strongly that we can instill ambition into schoolkids and inspire them to succeed and, as I am proving, you don't always need masses of qualifications. You really need someone to believe in you, show you some practical steps and have be prepared to work hard.'Anyone who says the younger generation is lazy is short-sighted. Plenty of them just need a chance it's my mission to awaken a sleeping giant of talent and success in Britain. I want to help shape the youth of today. There isn't enough real world support for them.'"
    ]
}