{
    "articleURL": "/tvshowbiz/article-12058093/Doja-Cat-UNVEILS-new-ink-including-skull-key-revealing-SHOCKING-bat-skeleton-tattoo.html",
    "content": [
        "Doja Cat has continued to add to her ink collection, and unveiled new tattoos on her left arm, including a key and skull, in new Instagram photos uploaded on Sunday. ",
        "The Say So hitmaker, 27, who donned a unique ensemble that paid tribute to the late Karl Lagerfeld's cat at the MET Gala, also got a massive bat skeleton tattooed on her entire back just three days earlier. The performer shared a black and white photo of herself on her Instagram stories while sitting in a chair as tattoo artist, Oscar Akermo, went to work. She could be seen sitting calmly in a long, sleeveless dress inside what appeared to be a studio. A phrase from Gretel And Hansel was also added above the latest tattoos, which states, 'So, children, please, be aware of gifts. Beware of those that offer them. And beware of those who are only too happy to take them.' She additionally uploaded a few behind-the-scenes papers and sketches that were also in black and white. ",
        "Oscar also shared photos on his own Instagram page, including close-up snaps of her left arm to better showcase the finished look. In the caption of the post, he simply added a bat, key, and skull emoji in reference to the ink she had gotten. Doja, whose real name is, Amala Ratna Zandile Dlamini, recently shocked social media users earlier Thursday when she revealed a new bat skeleton tattoo that nearly covered her entire back. ",
        "She had taken a mirror selfie to show off the new addition to her growing tattoo collection along with other pictures, and simply added a bat emoji to caption the Instagram carousel. The star, who has sparked controversy in the past due to 'demonic' ink, posted the positive meaning behind the bat skeleton, which was done by Bang Bang Tattoo artist named, Mr. K.A highlighted phrase in one of the slides read, 'Bats often represent death in the sense of letting go of the old, and bringing in the new. They are symbols of transition, of initiation, and the start of a new beginning.'Although an explanation was given, fans and followers still flocked to the comment section, with one writing, 'i just know the illuminati conspiracy theories are gonna run wild with this.' One fan came to the defense of Doja by typing, 'the fact she had to put the meaning behind it so y'all wouldn't scream \"sHe SolD HeR SoUl.\" ",
        "Last month in April, the Streets rapper had gotten a 'demonic' symbol of the mythological figure, Licenti, also tattooed on her left arm, and received mixed reactions. At the time, some fans claimed in the comment section that she had 'sold her soul' while others defended the ink, with one penning, 'everybody acting like the tattoo gonna jump off her skin and chase them.' ",
        "However, shortly afterwards, Doja uploaded a separate post with slides that explained the tattoo was in reference to Fortunio Liceti's artwork which aimed to find the beauty in imperfections and deformities. The rapper showed off the controversial ink as she made a head-turning arrival at the 2023 MET Gala earlier this week on Monday. She had donned a hand-beaded, figure-hugging Oscar de La Renta gown that flowed down into a train that contained white, feathered embellishments. The dress also contained a beaded hood that was connected to the gown and had cat ears at the very top.The star also had prosthetics added to have similar features to a cat, in tribute to the late Karl Lagerfeld's own cat, Choupette. ",
        "The performer has also been working hard on her fourth studio album, which currently has the working title of Hellmouth. While talking to Interview Magazine last month in April, she revealed, 'I am working on my album right now,' and also added, 'It’s done. It’s basically done.' She later gushed, 'It really is basically finished. And so I’m really excited about that because it’s something very different than what I’ve been doing forever.' A set release date has yet to be announced to anticipated fans. Aside from her upcoming album and attending her first MET Gala earlier this month, Doja Cat received a Best Song nomination at the MTV Movie &amp; TV Awards for her track, Vegas, from Baz Luhrmann's Elvis biopic.  "
    ]
}