{
    "articleURL": "/sport/football/article-12041933/Raphael-Varane-return-end-season-hints-Erik-ten-Hag-huge-boost-United.html",
    "content": [
        "Both Lisandro Martinez and Raphael Varane were injured playing against SevillaThe former French international's prognosis is better than Scott McTominay'sFollow Mail Sport's LIVE blog for all the latest updated from Manchester United Raphael Varane is on course to play for Manchester United again this season and return in time for the FA Cup final against Manchester City.",
        "The Frenchman has missed the last five games after he went off in the Europa League tie against Sevilla last month amid fears he could be out for the season.Manager Erik ten Hag confirmed that Varane will miss the next two matches away to Brighton on Thursday and West Ham on Sunday, but is ahead of Scott McTominay in his recovery.‘Rapha is closer than Scott in this moment but still for the coming two games they are not available,’ said Ten Hag, who added that the Brighton game will come too soon for Alejandro Garnacho to return from an ankle injury.‘We have one training but I think it's too soon to be available, he's short. He needs some training, then he will be available.’",
        "United face Brighton 11 days after beating the Seagulls in the FA Cup semi-final as Ten Hag’s side look to take a step closer to a top-four place and Champions League qualification.Ten Hag is braced for a backlash, saying: ‘It's a normal reaction. I think everyone involved in top sport, if you get beaten you want to have revenge. They have a huge motivation to beat us but we have to match that and do more: show more hunger than them to win this game and willingness is the word for tomorrow.",
        "‘We have six games to go and every game we want to win. Therefore you need full focus, full energy, full preparation and tomorrow is definitely going to be a fight. We have to be ready for that fight and the points.‘It’s clear we want to be in the Champions League. That is the competition we are now fighting for and that is the only thing in this moment to focus on. The FA Cup final is after the season.’"
    ]
}