{
    "articleURL": "/wires/aap/article-12049425/Essendon-fans-urged-not-boo-young-Port-midfielder.html",
    "content": [
        "Essendon coach Brad Scott has urged fans to show sportsmanship and refrain from booing young Port Adelaide midfielder Jason Horne-Francis during their AFL clash.",
        "Horne-Francis had been subjected to jeering from opposition fans this season after the former No.1 draft pick forced a trade to the Power, having spent only one year at North Melbourne.Scott implored his side's fans to practice restraint at Adelaide Oval on Sunday, characterising the actions as not the \"right thing to do\".\"The reasons behind it to me are irrelevant. We just don't want our fans to do that,\" Scott said.\"We want to win. We want to be competitive. We want to be combative.\"But we want to do it in the right manner, and sportsmanship is a big part of the way that we want to go about it.\"We want to be really humble when we win, but we want to be gracious in defeat as well.\"If we approach it that way then booing individual players is not the way we want to go about it.\"St Kilda coach Ross Lyon was the latest figure to denounce the actions from his club's supporters after Saints fans booed Horne-Francis during teenager's best-afield display in round seven.Power coach Ken Hinkley has regularly defended Horne-Francis this season, declaring the booing unfair.Scott heaped praise on the 19-year-old, saying he's shown the same talent in the top tier as he did in the juniors.",
        "\"He hasn't surprised me at all,\" Scott said.\"He's one of those players that's got tough power and explosiveness, and it wasn't going to be long before he started doing it in the AFL level what he was doing as a junior.\"The Bombers' clash with an in-form Power side will require Scott's side to bolster its defences after conceding a season-high 132 points in the loss Geelong last week.Tall defender Zach Reid has been named in the extended squad, with Scott eager to see the 21-year-old return from a back injury.\"Zach's done a power of work,\" Scott said.\"We've been really conservative with his recovery from his injuries.\"He's done a really good training block before we even brought him back to play VFL footy.\"But we won't compromise just because it's better off on paper potentially with a bit more height in defence.\"We won't compromise if we don't think he's absolutely ready to go.\""
    ]
}