{
    "articleURL": "/money/markets/article-12054123/Dunelm-boss-One-persons-tackiness-persons-style.html",
    "content": [
        "We have barely walked two aisles into the store when Dunelm boss Nick Wilkinson says we are passing one of his favourite products. Nestled among rows of camping equipment and outdoor lighting is a somewhat gaudily coloured statue of a pheasant, selling for £20.",
        "'I have one of these. It attracts real pheasants,' the 56-year-old says.'At certain times of the year, they come into the garden and try to fight it. It's also a great gift rather than a bottle of wine.' He darts round a corner, explaining that Dunelm is becoming more confident about selling quirky items, pointing to a 1.3 metre-tall statue of a heron, presumably aimed at those in the market for an even bigger bird than a pheasant.'No one comes in here with a heron on their list,' he grins. 'But some will leave with one.'",
        "This seems to sum up Dunelm's approach.The company started life in 1979 as a curtain-selling market stall in Leicester, run by Bill and Jean Adderley.It is now the biggest homeware retailer in the UK and listed on the stock market.Known for years as a textiles specialist, it has branched out to sell other goods, such as lamps and furniture. But an average shopper looking for curtains or bedding might still not know it does pots and pans, or laundry baskets, let alone an entire aviary of artificial birds.'Dunelm probably doesn't have a very high profile,' Wilkinson admits, adding: 'We've grown by word of mouth.'Wilkinson hadn't heard of Dunelm until he and his wife moved to Hemel Hempstead, Hertfordshire, several years ago and a neighbour suggested the store as a good place for curtains.",
        "Competition for customers in this sector is fierce. Rivals include everyone from Amazon and Zara to Marks &amp; Spencer and John Lewis.Wilkinson insists one of the reasons Dunelm is performing well – with sales in the last six months of 2022 43 per cent higher than before Covid – is because it is not just selling cheap and cheerful goods, but seeks to appeal to a wide range of customers, with different budgets.The cost of a double fitted sheet, for example, runs from £5 to £70.It is even a Royal Warrant holder through its Dorma bedding range, which it bought in 2008. But Wilkinson fully embraces the low-priced side of the business. When asked what he would say if somebody described Dunelm's stock as 'tacky', he lights up.'I would ask them why they thought that,' he says.'But one person's tackiness is another person's style!'As we walk past rugs, he points to a plain, mustard-coloured rectangle, saying that it is likely to sell better than the intricate, multi-coloured creations hanging alongside it. But he says he is 'absolutely delighted' with customers' choices, adding, 'we're not going to judge you'.  One person's tackiness is another person's style  He seems to have taken inspiration from the former high street stalwart Woolworths.",
        "'My wife and I always had a view that unless you lived somewhere with a Woolworths, it wasn't a real town,' he says.When Woolworths went into administration in 2009, Dunelm scooped up some of its staff.Wilkinson adds: 'We have a lot of managers from Woolworths managing our stores, and they are some of the best retailers I've met in my career.'If Dunelm has a rapidly growing profile among ordinary Britons, in the City, it has also been a slow-burning – but increasingly credible – success story.It joined the stock market in 2006 and is now a member of the FTSE 250, worth £2.3billion.The Adderley family is still the largest shareholder with more than 40 per cent of the stock, but it also has a slew of big-name investors such as Abrdn, M&amp;G, JP Morgan and Schroders.Wilkinson joined in February 2018, and under his tenure, shares have doubled in value – despite the disruption at the height of the Covid pandemic. ",
        "He says he always heads straight to the soft furnishings section of any store when he is out shopping, and if he had to choose an alternative career, he would have been a textile designer.His favourite pieces of furniture are, however, not from Dunelm, but a collection of authentic Afghan and Persian rugs he and his wife built up when living in Dubai in the early 1990s. He says: 'We still have them. Some on the floor, some on the walls.'",
        "Despite this underlying interest in design, Wilkinson studied history at St John's College, Cambridge. When he was young, his early jobs included a stint in retail at a map store in London and a summer as a vegetable chef in Scotland, where he spent his downtime mountaineering – still his favourite hobby to this day. But once he graduated, he joined the corporate world with a place on Unilever's graduate trainee scheme, where he and his wife met.After several years at the consumer goods group, he moved to consulting firm McKinsey, and later to Dixons Group (now Currys) and Evans Cycles.He is well paid at Dunelm, taking home £2.7million last year, though this was a steep drop on the £3.8million he made in 2021 when he received a chunky long-term bonus. In 2020, he voluntarily cut the majority of his pay while the company steered its way through the pandemic. His strategy for the company includes opening more stores in the UK  Wilkinson keeps a low profile – this is his first-ever newspaper interview – but is relaxed and enthusiastic. He is keen to keep his name tag on, getting jittery that it might be rude to the other staff if they don't know who he is.'I don't want to be an undercover boss,' he says, looking around.",
        "His strategy for the company includes opening more stores in the UK, where there are already 177 with 11,000 workers.Wilkinson is not interested in expanding overseas or in growing through takeovers. He says: 'We would never say never to mergers and acquisitions. But it's not on our list.'The company is 44 years old, but to Wilkinson, it still feels like an early-stage business. 'We feel like we're still being discovered in most regions, especially the South East and London,' he says. 'Even in areas like the Midlands where we've been present for a generation, we're still getting new customers.' But what about fears that people are counting the pennies and spending less on their homes?For homeware retailers this is less of a concern than for, say, DIY shops, according to Wilkinson.In a recent trading update, he said the winter had been a 'challenging' time for customers and says that even though it looks like the economy might improve later this year, it is still difficult for ordinary people. With this in mind, the company is slashing prices on about 1,000 items – not in a sale, but permanently – because freight costs have dropped. At one point we pass more animal-themed items – lamps in the form of rabbits and brightly coloured tigers. He says: 'Fundamentally, when people have got difficult circumstances, they want a bit of joy. And they want some value.",
        "'They want a tiger lamp and the smile the lamp gives them when their friends go, where did you buy that? How much did it cost?'Failing that, they could always buy a pheasant.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}