{
    "articleURL": "/wires/reuters/article-12054543/Cycling-Evenepoel-powers-victory-Giro-stage-one-time-trial.html",
    "content": [
        "May 6 (Reuters) - Remco Evenepoel underlined his credentials as a favourite for the Giro d'Italia as he stormed to victory in Saturday's stage one, an individual time trial along the Adriatic coast, to take the leader's maglia rosa jersey.",
        "The 19.6-kilometre route from Fossacesia Marina to Ortona is the longest opening individual time trial at the Giro yet, with most of the route flat until the last few kilometres which involves a climb through the urban region of Ortona.Evenepoel has been in fine form this season, with the Soudal-Quick-Step rider claiming back-to-back wins in the Liege-Bastogne-Liege one-day race last month and he was 21 seconds faster than anyone at the halfway mark.The Belgian finished with a time of 21 minutes and 18 seconds, a full 22 seconds ahead of Italian Filippo Ganna with Joao Almeida third a further seven seconds behind.\"I'm super happy, I think it's the best result we can get on the first day. We went fast enough today,\" Evenepoel said.\"I felt from the start I had a good rhythm, always the same gear, same cadence. I'm just super happy with what I could do,\" adding that he was not focused on how his rival Primoz Roglic was getting on.Roglic, one of the favourites to challenge Evenepoel, was only sixth fastest for Jumbo-Visma, 43 seconds behind.After the lead changed hands several times early on, Ineos Grenadiers rider Geoghegan Hart became the first rider to finish inside 22 minutes with a time of 21 minutes and 58 seconds",
        "His team mate Geraint Thomas, a former Tour de France winner, was 15 seconds slower.Hart's lead did not last long, however, as UAE-Team Emirates' Almeida was a man on a mission, catching up with two riders near the finish to go 11 seconds faster.But Almeida's joy was short-lived and he could only watch on with a wry smile as Evenepoel obliterated his mark and went nearly half a minute faster despite losing time on the climb, with the Portuguese giving him a thumbs-up as he crossed the line.Ganna was the last man who looked capable of dislodging Evenepoel at the top but he lost time on the climb to finish second. (Reporting by Rohith Nair in Bengaluru, editing by Ed Osmond)"
    ]
}