{
    "articleURL": "/femail/article-12046887/Fed-looking-like-tourist-Europe-Elegance-coach-shares-tips.html",
    "content": [
        "Swedish elegance coach Anna Bey shared her tips in a new YouTube video READ MORE: Why you DON'T need to ask your in-laws' permission to propose! Etiquette bible Debrett's shares rules on the modern way to pop the questionWhen some Britons journey abroad - especially elsewhere in Europe - it's easy to tell that they're tourists, an elegance coach has suggested. ",
        "From sandals with socks to running shoes and colourful leggings, Anna Bey has claimed these are all fashion mistakes that prove you're not a local.But the Swedish elegance coach, who splits her time between London and Geneva, says she's got the ultimate tips for those wanting to reap the benefits of blending in - such as 'avoiding being charged more'.The well-known lifestyle guru, who 'helps other women improve themselves so they can live their best lives', offered the advice in her latest video on YouTube, where she has 1.66million subscribers.She said the 'typical tourist tends to dress very sporty' because they 'love dressing comfortably' - however, Anna insisted that opting for comfort doesn't mean wearing items that aren't 'classy' or 'elegant'.",
        "She said: 'If you are a tourist you're going to be sightseeing all day long, you want to be able to walk, to feel comfortable and at ease. I am not against comfort. 'But one can look good, dress well and adhere to dress codes and respect cultures while still be comfortable,' insisted Anna.She then offered a list of garments that 'typically tourists tend to wear', including  flip-flops, running shoes, backpacks, baseball caps, t-shirts, leggings, sports shorts, jeans hot pants and dad sandals with socks.''So basically, if you don't want to look like a tourist, you do not wear any of those things,' said the elegance coach. ",
        "Instead 'pack shoes that you can walk in all day' but 'replace the running shoes with a nice pair of attractive sneakers... 'Classy footwear is definitely a must for your trip to Europe.'Anna also suggested holiday-goers should stick to a colour theme for their wardrobe according to the season they're travelling in.She said: 'If you come in fall and winter you can definitely wear more fall type of colours, whereas if you come in spring or summer you wear more pastels and lighter colours. 'But overall I would say Europeans are very much into neutrals, and very much into a \"less is more type of mentality\". Certainly a little bit of pop of colour is normal to see here and there but we're not necessarily the most colourful and flamboyant type of culture.'",
        "She also said that for women looking to be 'elegant' in comfortable clothing, they should stick to 'dresses and skirts'. 'I think that they're the most flexible because they will not be sitting tightly somewhere, meaning that you don't have to use the leggings, you don't have to use the t-shirts, surely if you really want to wear trousers, maybe you can have wider trousers.'I think the main point to think about is what is it that makes clothes comfortable? And I would personally say it's always about the right size, make sure that your clothes are not too small. ",
        "'Second of all the fabric of the material and how it handles the weather conditions that you're in. If you are in winter and fall make sure that it warms you or protects you for the weather if it's cold or raining.'Or if it's spring, summer, make sure that the clothes can breathe, that you're not being overheated in your outfit.'Discussing why it is 'so important to blend in', she said: 'To some degree of course, you can be yourself, you can have your style personality, and you can have your unique sense of dressing, if you want. 'But it is important to always take other cultures into account. But there is also a big advantage to blending in, and not standing out like a sore thumb.'Because... if everybody sees that you are tourists and you're not local, you might have to pay higher prices in shops, people might take advantage of you.'"
    ]
}