{
    "articleURL": "/news/article-12047851/Police-questioning-person-stabbing-spree-left-quiet-California-town-edge.html",
    "content": [
        "Carlos Dominguez, 21, was arrested by Davis police on Wednesday eveningHe matched the description of a person witnessed by multiple peopleTwo men were stabbed fatally and a third woman was left with critical injuries Police have arrested a suspect in relation to three recent stabbings in a California university town that left two men dead and one woman seriously wounded.",
        "Former UC Davis student, 21-year-old Carlos Dominguez, was taken in by police soon after 5pm on Wednesday, just a block from where a student was killed on Saturday night.At 1pm on Thursday afternoon he was charged with two counts of murder and one count of attempted murder and booked into Yolo County Jail, police confirmed.'The behavior was quite unusual in a circumstance like this. He was compliant during the entire process,' said Davis Police Chief Darren Pytel. 'He was reserved and spoke for a long time.'The murderer is off the streets and our families can sleep easier,' said Davis Mayor Will Arnold during a press conference on Thursday. The first 'particularly brazen attack' was on April 27 when 50-year-old David Breaux, a beloved homeless man known locally as 'Compassion Guy', was found on a bench near the University of California in Davis campus at 11.20am and 'stabbed many times'.On April 29, UC Davis senior Karim Abou Najm, 20, was on his way home from an undergraduate awards ceremony at around 9.15pm when he was fatally stabbed.Then on the morning of May 1, a 64-year-old woman was stabbed through a tent at a homeless encampment at around 11.46pm. She remains in a critical condition.",
        "Police confirmed that Dominguez was stopped by several patrol officers on Wednesday evening and that he spoke with them and agreed to come back to the station.",
        "In his backpack they found a 'large hunting-style knife' that was consistent with witness accounts of the attacks and with the weapon police were looking for.Michael Shearer, who has lived in Davis since 1998, told the Sacramento Bee he saw police apprehend Dominguez while walking his dog on Wednesday evening.'There was a guy walking along and a whole bunch of police cars came down Pine Street and they stopped a guy who fit the description, carrying a backpack,' he told the newspaper.He said the person arrested matched the description provided by witnesses of some of the stabbings - a person with dark, shoulder-length hair and wearing black Adidas track pants.'There wasn't any altercation, but they talked to him for five or 10 minutes and then they put him in the police car and they drove away,' he added.The suspect was first spotted by somebody who was walking through the park at around 3.30pm and saw someone matching the attacker's description sitting alone in the children's playground. 'He made eye contact with me and came toward me rather briskly,' the man, who asked to remain anonymous, told the Davis Enterprise.'He was walking around sort of aimlessly, which I thought was odd,' said the witness, who 'kept an eye on him' as he wandered through the park and through the neighborhood to the east.",
        "Shearer said that if the person is the culprit, he was surprised that he would have come back to the scene.'I wouldn't be back here if I were him. That makes no sense. So he must have a mental illness or some problem,' he told the Bee.Shearer said the spate of stabbings had frightened the entire community. 'Everybody's terrified,' he added. 'Really, I mean, this isn't normal, and it's so arbitrary. You just don't know.'Pytel said police were called to the most recent stabbing where an unidentified 64-year-old woman 'was able to provide a description of the assailant and she was able to tell us what happened'.Isaac Chessman and Christine Berrios, a couple in a neighboring tent, told KCRA they heard the woman screaming for help. Chessman added that he believed he encountered the suspect earlier that day.'So we're sitting in front of the tent, and I said, \"Babe, this isn't feeling right,\" and I see a dude run across the way and started running, but he would stop along every tree to blend in with the tree because it's dark. I noticed that because that's something you would do if you're scoping something out,' he said.'I said, \"Hey bro,\" and he starts walking normal, and then I said, \"You look like the dude they've been describing that's been stabbing people.\" He takes off and I started to take off after him and my wife is like, \"Don't leave me here\",' Chessman said.",
        "On Saturday, UC Davis senior Karim Abou Najm, a 20-year-old computer science major, was on his way home when he was killed at Davis' Sycamore Park around 9.15pm, according to police. A resident heard the disturbance and went outside to try and help and had a brief interaction with the suspect, who then fled. He found Abou Najm with multiple stab wounds. The suspect of that attack was described as being 'a light-skinned male, possibly Hispanic, 5-foot-6 to 5-foot-9 tall, 19 to 23 years of age, with long curly loose hair.' He was last seen wearing a white hat, a light-colored T-shirt, and a button-up shirt over it, and riding a men's bike with straight handlebars, police said.'Karim was a wonder of energy, a free spirit, someone who just wants to see goodness around him,' his father, Majdi Abou Najm, told local station ABC10.'This path that he took in his last journey home is the same path that we do every day. I walk to my office at UC Davis, and he bikes to classes at UC Davis,' said Majdi. Abou Najm was set to graduate in just six weeks, his father told ABC10. He already had two jobs lined up for after graduation.'We moved from Lebanon in 2018 when the situation in Lebanon was a little bit starting to go in not the right direction,' Abou Najm said. 'We came here hoping for safety.'",
        "'I want this to be his memory: a bundle of energy, a bundle of positivity,' Majdi Abou Najm said of his son.'Someone who was full of ambition, proud of his roots, who just wanted to make this world a better place.'",
        "The wave of attacks began with the fatal stabbing of 50-year-old David Breaux, known as the 'Compassion Guy' who was killed in Central Park on the bench where he often slept.Davis police said it was a 'particularly brazen attack' and there were no eyewitnesses. Breaux, who was a fixture in the community for over the past decade, was 'instrumental' in the addition of a 'Compassion Bench' at the corner of 3rd and C Streets in 2013.'The death of David Breaux is utterly and completely devastating,' Davis Mayor Will Arnold said. 'Many of us knew David. We talked with him. We shared in his vision for a kinder world. We connected on what it means to be human and humane.' The bench is where he would ask people their definition of the word 'compassion.' He later published his notes as a collection of anonymous writings.'Like so many of you, I am grieving the death of David Henry Breaux, known as the \"Compassion Guy.\" ... David led a life with real purpose, to connecting humanity for the greater good, something we should all aspire to do,' the UC Davis chancellor said in a statement. "
    ]
}