{
    "articleURL": "/wires/aap/article-12043271/Australian-stinging-tree-injects-promise-pain-relief.html",
    "content": [
        "A toxic Queensland tree with a sting so painful that legend says it can drive a victim mad with suffering could be the answer to the new non-opioid pain relief.",
        "The gympie-gympie tree is an innocuous-looking plant with a large heart-shaped leaf that grows in the rainforests of Australia and Malaysia.But looks can be deceiving - folklore says one early settler who mistakenly used the leaves for toilet purposes shot himself to end the agony.Part of the nettle family, Dendrocnide moroides, commonly known as the stinging tree, stinging bush, Queensland Stinger or the gympie-gympie, is notorious for an extremely painful sting which may leave victims suffering for weeks - or even months.The plant produces a neurotoxin similar to that of a spider or cone snail and is reputed to be the most poisonous plant in Australia, if not the world, by touch.Researchers from the University of Queensland studying the toxins in the plant believe it could lead to the development of new pain treatments.The toxins - named gympietides in earlier work by the team - interact with nerves after being injected by fine needle-like hairs on the leaves.\"The gympietide toxin in the stinging tree ... causes pain in a way we've never seen before,\" Professor Irina Vetter said.Many toxins cause pain by binding directly to sodium channels in sensory nerve cells, but the gympietide toxin needs assistance to bind.\"It requires a partner protein called TMEM233 to function and in the absence of TMEM233 the toxin has no effect,\" Prof Vetter said.",
        "\"This was an unexpected finding and the first time we've seen a toxin that requires a partner to impact sodium channels.\"The research will explore if switching off this pain mechanism might lead to the development of new painkillers.\"The persistent pain the stinging tree toxins cause gives us hope that we can convert these compounds into new painkillers or anaesthetics which have long-lasting effects,\" Prof Vetter said.\"We are excited to uncover a new pain pathway that has the potential for us to develop new pain treatments without the side effects or dependency issues associated with conventional pain relief.\""
    ]
}