{
    "articleURL": "/tvshowbiz/article-12044715/Today-weather-presenter-blinded-parrot-live-TV.html",
    "content": [
        "Today show weather presenter Tim Davies had the fright of his life on Thursday.",
        "The 39-year-old roving reporter almost lost an eye when a parrot named Miko tried to kiss him during a live cross from the Sunshine Coast.A bird handler was forced to step in and carefully move the animal away when Davies was unable to shake it off.The bizarre moment happened while Davies was trying to read the day's weather forecast with Miko perched on his chest.'Good morning. I don't know if Miko is going to let me do the forecast. We might have to scoot him off my face,' he told presenter Alex Cullen back in the studio.",
        "Looking increasingly anxious as the parrot inched towards his eyes, the professional handler stepped in before it could do any damage.Davies later admitted the experience had been terrifying.'I'm so relieved. I thought my eyes were gone,' he said.Footage of the perilous moment was later shared to the Today show's Instagram account.'Oh my gosh, poor Tim,' one fan wrote, while another added: 'I'd be in therapy.'",
        "Davies has had his fair share of funny on-air encounters presenting the weather.Last year, Today viewers watched surreal scenes of a man running away from him to avoid being interviewed on camera.Davies was giving away free fuel vouchers at a petrol station in Sydney when he tried to offer one to a driver waiting in the queue at the servo.",
        "But the bearded man bolted out the door as soon as Davies approached him, leaving Today hosts Karl Stefanovic and Allison Langdon in stitches.'Excuse me, sir. Do you want $200 worth of free fuel?' Davies asked the man, who brushed him off and made a swift exit.'I'm not from A Current Affair!' he said as Stefanovic and Langdon burst into laughter.Before finding fame on the Today show, Davies worked in radio as the news presenter for The Kyle and Jackie O Show."
    ]
}