{
    "articleURL": "/tvshowbiz/good-morning-britain/article-12050287/He-careful-kind-man-Kate-Garraway-discusses-meeting-King-Charles-Lorraine.html",
    "content": [
        "Kate Garraway lauded King Charles on Good Morning Britain on Friday, as she detailed the letter he sent her covid-ridden husband Derek Draper in 2020. ",
        "Ahead of the Coronation on Saturday, the broadcaster, 56, spoke kindly about the monarch and how he supported her husband, who has been left with life-altering after effects from his lengthy battle with the virus. She said: 'I think he is a very careful kind man. He put: \"I really hope that you'll get the chance to read this to Derek\". And I have had the chance to read that to him.'The interaction came after the start of the pandemic in 2020, saw Kate voice her fears about catching the virus after meeting King Charles just days before he tested positive for coronavirus.At the time, she spoke about the meeting live on Good Morning Britain, revealing that the pair had got 'relatively close' at the Prince's Trust Awards on March 11. Derek was diagnosed with the virus soon after the exchange.",
        "In October 2021, Kate confirmed the identity of the mystery Royal who helped support her during Derek's Covid battle.She spoke to Charles about his kindness - which she referenced in her memoir The Power Of Hope - saying: 'And you might not remember but you were very kind to me because my husband got very sick with Covid after the last Prince's Trust awards... 'You wrote to me and gave me help, so thank you very much… and he did improve.'",
        "On Friday, following on from her words about his kindness, Kate also shared a hilarious anecdote of her second meeting with the King. She said: 'It was the Princes Trust again and I got very wet on the way there, I was dashing from one event to another, and I found myself face to face with the now king and I had that odour of a wet dog.",
        "'I apologised for smelling like a wet dog and as I went to shake his hand a massive thunder clap sounded and he said 'Never mind dogs, have you got contacted with Thor?'The English MBE recalled the hilarious moment with joy as she praised him for the commitment to his new role.'He's had a very long time to think about it and carve out his role, i think he is very spiritual as well,' she said.'People who know him a lot better than me have said that he will take a moment tonight to think about it.'Speaking about her role tomorrow for the King's Coronation, she said:  'I'm at Buckingham palace so I'm going to call ITV and say he's left!'It comes after a professional impersonator of King Charles joined Kate and Ben Shephard on Good Morning Britain to speak about life impersonating his Royal Highness.",
        "Guy Ingle, 63, an entertainer from Ampthill, Bedfordshire, revealed that not only does he pose as the monarch, but also his younger brother Prince Edward.Guy, who was sat next to Camilla impersonator Wendy Ellis, admitted that while he's busier than ever in the run up to the coronation, he's previously starring as Edward.He said: 'Years ago I was on This Morning on a Thursday as Prince Edward, and on the Tuesday as Prince Charles.'Elsewhere, Guy, who has been mimicking Charles, 74, since the nineties, revealed Charles sent a security guard over to him with a message at a polo match years ago.The impersonator revealed His Majesty wished him 'good luck' when they first crossed paths.He said: 'Some years ago, I actually turned up at a polo event when he did play polo and had to do a speech, and he played polo with his sons against the Argentinian polo team.'And what happened afterwards was I actually watched him play and then the awards, and a security man came over and said, 'Prince Charles has got a message for you. He said, 'good luck to you. You've got to earn a living.'",
        "However he admitted that the impersonator business wasn't always as lucrative and he had to pick up other jobs to get by.",
        "He said: 'But I have to do other things as well to make a living, like during Covid, we have to do whatever, in between jobs I've worked in a café, I've done bar work, I've done everything.'While in the run up to the Coronation, he has seen his workload quadruple.Guy previously said: 'Work has never been so busy since the Queen's death as Charles is now king. Meaning I no longer play a second-fiddle character to the Queen.'The workload has quadrupled, but I never let myself get dragged into any inappropriate gigs as I've got far too much respect for the royal family to do so.'I've always been a huge fan of the royals, my family were always huge supporters of them.'We were all hugely saddened by the news of the Queen's death, and I think the stress with Harry and Andrew must not have helped her I feel in her later years.'Guy - who says he doesn't use the tube because of the stares he gets from the public - has also revealed how he operates in his unusual role.He said: 'I have the same approach for majority of my gigs as King Charles.'I get my agents to give me info on the person who's booked me and what the event is so I can tailor the routine.",
        "'I learn the script and get my costume ready, I practice my lines whilst in getting the make-up done and then arrive at the venue in plenty of time.'But I rarely use the tube to avoid stares and questions from the public as I often get stopped by them.'Guy added that the best work he has ever done was in Los Angeles.He said, 'The best experience I've ever had was when I was working in Los Angeles, on the set of the Superhero Movie in 2008 with the late, great Leslie Nielsen.'I was treated like a star out there, limo trips and a five-star hotel to then be moved to an apartment in Beverley Hills.'But achieving success has not come easy to Guy.He said, 'The reason I got into this line of work was because I knew I could do better than most impersonators or lookalike.'But he added that he had many rejections.He said: 'I had constant rejection in the nineties until I finally started getting jobs with other impersonators such as Diana and the Queen.'He also lost much work in the pandemic, so his revenue increase has come as a boost."
    ]
}