{
    "articleURL": "/femail/article-12043551/TikTokers-accuse-HGTV-renovation-shows-Fixer-Upper-Renovation-Impossible-shoddy-work.html",
    "content": [
        "TikTok creators have accused HGTV shows of doing 'shoddy work' to homesOne video claimed Fixer Upper show 'bragged' one house had a marble island But the clip alleges the marble 'was just plywood and contact paper over it'TikTok creators have accused HGTV shows of doing 'shoddy work' to featured houses and warned people against doing home renovation shows.",
        "One recent video posted by interior designer Erin, who is known as @niftynest on the video-sharing platform, revealed she had stayed at a home that had appeared on Fixer Upper during a 'work-related trip.'In the video, Erin begins with: 'Not everything is as it seems.'She continued: 'HGTV bragged about these beautiful marble countertops when in fact it was just plywood and contact paper over it.'",
        "Fixer Upper, which ran from 2013 to 2018, was hosted by Chip and Joanna Gaines, who helped owners turn their fixer uppers into their dream homes in Waco.In the comments section under Erin's video, people shared their experiences with HGTV shows.'I was on HGTV House Hunters - I had already bought my home before we even started filming,' one person claimed.Another added: 'I was on an hgtv show called my first place. They had my friends sewing curtains and the room was basically put together with tape and a prayer.''I was on HGTV and it is true,' a third person said, with Erin sympathizing: 'Uuugh. I am so sorry!!!!''I follow two people here living a nightmare with what they were left with. Not just shoddy but outright dangerous.'But another person disputed Erin's claim about the countertops, saying: I've stayed in that house and the countertops were definitely stone.'",
        "But Erin later clarified: 'The island is absolutely not stone. I definitely should have specified that.'",
        "Someone else who claimed to have sold the home to the original owners who appeared on the episode added: 'The countertop on the island was not stone! It was actually reclaimed wood!'Others defended the network, with one person saying: 'I was on HGTV years ago Save my Bath. Had great experience. All high end fixtures and materials were used.'Another TikTok creator Ron Onyon, who goes by @oldmanwithasmartphone on the platform, detailed allegations of 'shoddy work' done to his home after filming for Renovation Impossible, which was produced by Lionsgate's Pilgrim Media Group. He claims to have lost $150,000 during the process. Renovation Impossible was hosted by Russell J. Holmes and first aired in 2022.In his videos, which have been viewed millions of times collectively, Ron shares photos and clips of his 'nightmare' home.One TikTok shows a photo of the sliding door that Ron says was installed at his home during the show, and 'it was not bolted into any studs and... only held in by the trim.''It would just take a little wind, pulling on it too hard or bumping into it, and it would fall right over on top of somebody,' he continued.",
        "Another video shows the shower jets spraying water into the drywall and an electric fireplace in the bathroom, with Ron claiming it creates a 'fire hazard.'The homeowner also claims there's poor tile work and a door with a broken latch was installed, among other allegations.In a February update about the situation, Ron said: 'I released a majority of what my house is like after the reveal. I still can't release a lot of behind the scenes and the during at this time. 'There's some legal things we have to deal with which is still in the process, it's a long slow process.'Previously Renovation Impossible host Russell responded to allegations about the poor work done on the show, claiming: 'The episode and house that is making all the noise was designed and built by contractors employed by the homeowner not by me or anyone on my team. 'I was only the on camera personality there to help smooth over issues that I was made aware of and help get extra value for the homeowners' money.'DailyMail.com has contacted HGTV, Lionsgate and Russell for comment. "
    ]
}