{
    "articleURL": "/wires/ap/article-12044189/Why-nationalities-matter-US-braces-migration-surge.html",
    "content": [
        "SAN DIEGO (AP) - A decade ago, it was a safe bet that anyone stopped by U.S. authorities at the southern border was probably Mexican. That´s no longer the case, complicating Biden administration efforts to prevent a swell of migration when it lifts pandemic-related asylum limits next week.",
        "Now, people come from dozens of countries, with large showings from Peru, Venezuela, Haiti, India, Russia and elsewhere. Only about a third are from Mexico - down from 85% in 2011.With the expiration on May 11 of Title 42 - which suspended migrants' rights to asylum to prevent the spread of COVID-19 - more people are expected to arrive.Illegal crossings tumbled after President Joe Biden announced asylum restrictions in January, but they have risen since mid-April. Brandon Judd, president of the National Border Patrol Council, said they have been hovering around 7,200 daily, up from about 5,200 in March.The administration plans to rapidly screen migrants and quickly send home those who don´t qualify. But people will be treated differently depending on their nationality.A look at how the plans vary depending on where the migrants are from:",
        "CHNVNot a catchy acronym, it stands for Cubans, Haitians, Nicaraguans and Venezuelans. In December, these four nationalities accounted for 40% of all people stopped at the border. By March, they made up only 3%.Biden announced Jan. 5 that up to 30,000 people from the four countries could enter on parole every month if they applied online and had a financial backer. Mexico agreed to take back the same number from those countries who entered the U.S. illegally. Texas and other Republican-led states have challenged such broad use of parole authority; a trial is scheduled June 15 in Victoria, Texas.",
        "Mexico said late Tuesday that it would continue taking back people from the four countries who were expelled from the United States. Combined with parole for those who apply outside the United States, it is a carrot-and-stick approach that was first applied to Ukrainians after Russia's invasion.Cubans, Nicaraguans and Venezuelans have benefitted from their governments' refusal to accept deportation flights, though Cuba accepted its first since December 2020 on Monday and has pledged to accept more. Haiti is wracked by gang-fueled violence, making flights there a major challenge.CENTRAL AMERICA'S NORTHERN TRIANGLEFamilies and unaccompanied children from Guatemala, Honduras and El Salvador largely drove migration to the U.S. border throughout the last decade. Then came Title 42.Mexico agreed to take back people from what are known as Northern Triangle countries from the start of Title 42 in March 2020. Many have been waiting months, or years, for it to end.The U.S. has long, deep relationships with governments in the region, which, while expensive and time-consuming, makes it relatively easy to fly people home. Guatemala and Honduras accepted half of all U.S. removal flights last year - 727 combined - according to Witness at the Border, a group that tracks flights.On Tuesday, the U.S. said it would admit 100,000 people from Guatemala, Honduras and El Salvador who are coming for family reunification.",
        "MEXICANSIn some ways, a shared land border that stretches from San Diego to Brownsville, Texas, makes Mexicans the easiest to remove because it is only a short drive to the nearest official border crossing.Also, unaccompanied children from Mexico and Canada are not covered by a 2008 anti-trafficking law that grants special legal protection to children traveling alone from other countries. They are quickly sent home.But Mexicans have also been protected from some of the most restrictive policies. A virtual asylum ban on those who travel though another country to the U.S. border wouldn't apply to Mexicans. A final version of that measure is expected before May 11 and to be quickly challenged in court.EVERYONE ELSEMexicans and people from Central America's Northern Triangle countries accounted for barely half of all people stopped for crossing the Mexican border illegally in March, representing a major change in just the past few years.Explanations for the others who make up the other half vary by nationality. Russians, for reasons that are unclear, have been among the top winners of 740 slots made available at U.S. border crossings with Mexico under CBPOne, a mobile app that was introduced for asylum-seekers in January. U.S. officials say they are the top nationality on the app, along with Haitians and Venezuelans.",
        "Migrants from Venezuela, Haiti and elsewhere go through the dangerous Darien Gap connecting Colombia and Panama. Last year, 250,000 made the inhospitable jungle crossing, according to the Panamanian government, many of them children.The U.S., Colombia and Panama announced a joint effort to stem migration through the Darien Gap, but details are unclear.THE UNKNOWNThe Biden administration said last week it would open processing centers soon in Guatemala and Colombia, allowing people seeking refuge to avoid the treacherous journey over land. It said it was looking to open others but didn't name locations.___=Associated Press writer Rebecca Santana in McAllen, Texas, contributed."
    ]
}