{
    "articleURL": "/wires/pa/article-12054081/Camilla-crowned-Queen-historic-day.html",
    "content": [
        "Queen Camilla has been crowned beside the King – a symbolic moment setting the seal on a relationship that has enthralled the nation.",
        "After the coronation of Charles, Camilla was the focus of the ceremony and the Archbishop of Canterbury, Justin Welby, performed the ancient ritual of anointing and crowning, then called on the Queen to be filled with “princely virtues”.The Queen’s journey from romantic involvement, to mistress and finally wife of the King has been played out over more than five decades, and ended with her formally becoming the nation’s Queen.",
        "Mr Welby placed Queen Mary’s Crown on the Queen’s head and said: “May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues; reign in her heart, O King of love, that, being certain of thy protection, she may be crowned with thy gracious favour, through Jesus Christ our Lord. Amen.”The crown was made for Charles’ great-grandmother, Queen Mary, for George V’s coronation in 1911.Camilla’s decision to use Queen Mary’s Crown is the first time a consort’s crown has been recycled for a coronation rather than a new one created.It has been altered, with four of the eight detachable arches removed to create a different impression and could be renamed Queen Camilla’s Crown in the future.",
        "It used to feature the controversial Koh-i-Noor diamond but the gem was not used and the crown was adapted to include the Cullinan III, IV and V diamonds – from the late Queen’s personal jewellery collection.",
        "Camilla’s public image has been transformed after she was cast as the third person in the marriage of the then Prince and Princess of Wales, into a campaigning member of the royal family prepared to serve the nation.Underneath she was the down-to-earth Sussex girl who grew up with a love of horses and happened to fall in love with Charles.",
        "During the years she has been married to the King, the Queen has grown into the role and is now an assured host at Buckingham Palace receptions or supporting the King during official overseas visits.Camilla is patron or supporter of a number of literacy charities, speaks out in support of victims of domestic violence and champions several animal welfare organisations.But her most significant role is likely to be in supporting the King and being the comforting presence that enables him to fulfil his role as head of state."
    ]
}