{
    "articleURL": "/wires/afp/article-12051537/India-gives-frosty-reception-Pakistan-envoy-rare-visit.html",
    "content": [
        "India gave a frosty reception Friday to Pakistan's foreign minister during the first official visit by a senior official from its arch-rival neighbour since 2016.",
        "The South Asian neighbours have fought three full-fledged wars since they were created at the partition of the Indian subcontinent in 1947.Relations between the nuclear-armed countries have remained tense in recent years with both sides trading barbs over the disputed territory of Kashmir, with Friday no exception.Pakistan's top diplomat Bilawal Bhutto Zardari was in the Indian coastal resort state of Goa, for a Shanghai Cooperation Organisation (SCO) meeting of foreign ministers.His address to the gathering urged members to refrain from \"weaponising terrorism for diplomatic point scoring\", drawing a rebuke from his Indian counterpart S. Jaishankar.\"Pakistan's credibility is depleting faster than its foreign reserves,\" Jaishankar told reporters after the conference ended, in a jab at the country's ongoing economic crisis.Bhutto's address \"reveals the mindset of that country\", he added. \"His position was found out and called out.\"India regularly accuses Pakistan of supporting insurgents in Indian-administered Kashmir -- allegations Islamabad denies.Pakistan suspended trade and diplomatic ties with India in 2019 when New Delhi imposed direct rule on the part of Muslim-majority Kashmir it controls and enforced a heavy security lockdown.Both countries withdrew their top diplomats and several consular staff were expelled or withdrawn in tit-for-tat measures.The most recent visit to India by a high-ranking Pakistan diplomat was in 2016 by Sartaj Aziz, then the senior foreign affairs adviser to the prime minister.",
        "India currently holds the rotating presidency of the SCO, a forum established in 2001 that also includes China and Russia, rivalling Western institutions.Jaishankar did not hold a one-on-one meeting with Bhutto but on Thursday met with his Chinese and Russian counterparts, Qin Gang and Sergei Lavrov."
    ]
}