{
    "articleURL": "/tvshowbiz/article-12053071/Shawn-Mendes-greets-Dr-Jocelyne-Miranda-hug.html",
    "content": [
        "Two days after Shawn Mendes and Camila Cabello showed their romance may very well be back on by going on a flirty date night, the Canadian pop star was back meeting up with Dr. Jocelyne Miranda.",
        "Mendes, 24, and his longtime chiropractor, 51, had been rumored to be an item when they were seen spending a lot more time together following his spilt with Cabello.This, however, was deemed not to be true when it was confirmed that they were just friends. Mendes and the doctor shared an embrace before he helped Dr. Miranda bring her chiropractic equipment inside for their session.",
        "After seemingly sharing brief pleasantries Mendes grabbed ahold of the largest of her work items, a massage table, and started making his way back into his home, all while flashing a big smile.Obviously casually dressed for his chiropractic session, the Pickering, Ontario, Canada native wore navy blue sweatpants with a gray hoodie and flip flops.He also had his dark brown hair styled short and off his face, like he has done in recent months since getting ride of his slightly longer locks.Dr. Miranda was following close behind her patient carrying a bag in each hand dressed in black sweatpants and a matching sweatshirt with E.T. The Extra-Terrestrial on the front of it.She also wore a pair of two-tone blue sneakers and pulled her long dark tresses back off her face and into a ponytail.The pair, who had spent a lot of social time together going on hikes and out to lunch in recent months, eventually made the short walk into the front door of the singer's house.",
        "Not long after meeting up for Mendes's session, Cabello took to her Instagram page and shared a selfie snap of herself striking a fun pose while flaunting her midriff in a Brasil crop top. The Worth It singer wrote 'hot girls have undiagnosed IBS' in the caption of the post, which sounds like she's referencing irritable bowel syndrome.The Havana, Cuban native was also wearing light blue jeans and had her dark brown tresses pulled into a ponytail when she took the photo while sitting on the side of a bed.",
        "After Mendes and Dr. Miranda were deemed to just be good friends outside of their working relationship, the Treat You Better star was seen reuniting with Cabello at the recent Coachella Festival in April, where they shared a passionate kiss or two. Not long later an insider revealed to DailyMail.com that the duo had been secretly seeing each other for weeks, after 'playing the field' during their 18-month split.'They have hung out several times with friends and alone in recent weeks. They are seeing where things go,' the source told DailyMail.com. Then this past Wednesday, the on-again couple were spotted sharing a romantic embrace during their date night at the Hollywood Improv, a comedy club on Melrose Avenue.And as these latest images show, the duo definitely seemed to be happy out together.",
        "The songstress could not stop smiling as they enjoyed some time at the comedy club before making their way to the iconic Sunset Tower Hotel in West Hollywood. Their romance started back in in the summer of 2019, which they made Instagram official shortly after the release of their second smash hit, Senorita.Formally an item, the couple moved into a home in Los Angeles together at the height of the COVID-19 pandemic,  and then got a dog they named Tarzan.  The couple called it quits in November 2021, which they made official by releasing a joint statement on Instagram.'So here is the thing. They never really stopped talking since their breakup,' a source told DailyMail.com. 'Because they share a dog together, which Camila takes care of, they have been in communication. Any one who has gone through a breakup with pets understands this.'"
    ]
}