{
    "articleURL": "/health/article-12054651/DR-ELLIE-CANNON-fear-prostate-cancer-spread-just-rely-check-ups.html",
    "content": [
        "After being diagnosed with prostate cancer I expected to be thrown into treatment, but my urologist has told me I’ll just have check-ups every four months. My fear is that the cancer will spread to my lymph nodes or bones in that time. Shall I pay to have a prostatectomy to put my mind at ease? I am 72.",
        "When people find out they have cancer in a part of their body, they often want that section removed. It is only natural and totally understandable.But, with prostate cancer, there are two important reasons why doctors don’t always do this.First, while removing the prostate – known as a prostatectomy – gets riSd of the tumour, it can cause other problems that affect quality of life, including issues with sexual function, going to the toilet and bowel troubles. Sometimes a man who has undergone a prostatectomy may say these problems meant the treatment was not worth it.Secondly, prostate cancers are slow growing. Sometimes specialists refer to it as a ‘mild’ disease. This might sound odd – given that it’s cancer – but many men live for a very long time with the disease and die from other causes.",
        "A doctor’s decision about whether to treat prostate cancer can depend on a lot of factors, including how likely it is to spread. This is measured using something called a Gleason score. Generally, anything below a score of seven is not considered high risk.For a low-scoring tumour, it isn’t worth putting a patient through the risks of surgery and its side effects. Blood tests and scans every four months are enough to catch changes quickly for slow-growing cancers.",
        "But living with cancer is not easy. It is worth speaking to Prostate Cancer UK or your GP for support.I've recently noticed a slight change of colour in my armpits. It isn’t painful but it’s a bit odd that this has appeared suddenly. Do you have any idea what might be causing this? I don’t have any underlying health conditions.It isn’t normal for the skin in the armpit to change colour. When it does, it is usually due to a yeast or fungal skin infection, which can thrive in the armpits because they are warm and moist from sweating.A yeast infection would cause redness or itchiness, and fungal skin infections can make the skin darken in someone with white skin, or lighten in someone with brown or darker skin.It is worth trying an over-the-counter anti-fungal cream for a week or two and seeing if there is any improvement. There are no risks involved and you’d soon find out if that was the problem.Erythrasma is another possibility. This is a bacterial skin infection that causes scaly pink or brown patches and often affects the armpits. A doctor can prescribe antibiotic cream or washes to get rid of it. You can also prevent it from developing by using antibacterial soap.",
        "Skin conditions like eczema and dermatitis can also cause the skin to change colour, as can irritation from cosmetics such as deodorant. Or sometimes skin can darken in response to a rash or itchy skin. This is because the skin develops more pigment and can thicken, so it looks darker.It is particularly a problem for darker skin, and some, such as anti-malaria tablets or antibiotics, can make it worse.",
        "If both armpits get darker, a condition called acanthosis nigricans may be at play. It is more common in people with polycystic ovarian syndrome, obesity or type 2 diabetes, and medications such as steroids and the contraceptive pill can increase the risk of developing it.For people with darker skin, acanthosis nigricans sometimes appears for no obvious reason. Get it checked by your GP as it can be due to an underlying condition, but it sometimes won’t need medical treatment.For about a month I’ve suffered bouts of pins and needles in my left arm which travel all the way to my hand. My doctor couldn’t find anything wrong with me. Any ideas what it could be?Pins and needles might seem like a non-serious problem, but it should be checked if persistent. Normally it is an indication that something is wrong with a nerve. This is why the sensation comes on if you lean on your arm for too long – because there’s too much pressure on the nerve.",
        "Do you have a question for Dr Ellie Cannon? Email DrEllie@mailonsunday.co.ukDr Cannon cannot enter into personal correspondence and her replies should be taken in a general context.",
        "Any health problem or injury that affects the nerves can cause pins and needles, including a slipped disc in the neck, a sprain in the arm or a trapped nerve.Diabetes, multiple sclerosis and Vitamin B12 deficiency can trigger it, as can some medications. It is also common in people who drink a lot of alcohol.An investigation by the GP is vital to find out if the cause is minor or more serious. They may carry out blood tests for B12 and iron deficiency, as well as signs of inflammation and diabetes. They will also check the pulse in your arm and whether parts of the nerve work properly.There are other symptoms associated with nerve problems, such as numbness, weakness and being sensitive to hot or cold temperatures. If any of these ring true, tell your GP.One common cause of pins and needles in the hands is carpal tunnel syndrome – where a nerve gets squashed.In this case, the sensation usually begins in the fingers and sometimes travels up the arm.'Skinny jab' is not a fast-fix dietA few weeks ago I wrote of my scepticism about the new ‘skinny jabs’ – injections of the drug semaglutide given on the NHS to people with obesity.",
        "They have been hailed as a magic bullet for obesity and its related diseases. But I wasn’t convinced – all treatments come with side effects and we still don’t know what happens when patients stop taking this drug.Now we’ve learned that I was right to have my doubts.Reports have told of patients developing unwanted, saggy skin around their necks. This is a consequence of losing fat quickly – it also disappears from areas where you actually want it, such as the face.Semaglutide injections are great for people with obesity who suffer health problems such as type 2 diabetes. But if you’re looking for a quick fix for a bikini diet, I’d steer well clear.Measles can be deadly - so protect your children NOWI'm growing concerned about how many children are catching measles. Government figures show there have been 49 cases so far this year, compared with 54 for the whole of 2022.It’s a problem that’s been brewing for a while, with more parents deciding not to vaccinate their children against this deadly disease thanks to scare stories they read online.Now it’s worse than ever, mostly because of missed jabs during lockdowns. Uptake of both doses of the MMR jab, which protects against measles, mumps and rubella, is at 85 per cent of the population – far less than the 95 per cent target that’s needed to eliminate the disease.",
        "It’s vital to get children up to date with their jabs before the summer begins. As children travel for holidays, the risk of an outbreak increases. All under-18s can have a free catch-up jab if they’ve missed out – simply ask your GP.Don’t take the risk and leave your children unprotected. Trust me when I say it’s not worth it."
    ]
}