{
    "articleURL": "/femail/article-12053999/Royal-fans-claim-spot-Grim-Reaper-King-Charles-Coronation.html",
    "content": [
        "A video of a hooded figure at the Coronation has gone viral on TwitterCORONATION LIVEBLOG: Click here to follow live updates throughout today Every big party attracts some uninvited guests, but royal fans joked that they'd spotted the angel of death himself at Westminster Abbey today as Prince Charles was crowned.  ",
        "Onlookers were convinced they spotted the Grim Reaper at Westminster Abbey this morning during the historic ceremony. In the middle of the aisle, a hooded figure in all black can be seen waltzing across  in full view of the camera, before eerily disappearing again.The exact moment was captured by Twitter user @realjoegreeeen who took to the social media platform to reveal his shock.He tweeted: Anyone else just notice the Grim Reaper at Westminster Abbey #Coronation ",
        "The video has since been seen almost half a million times - with other viewers tweeting about the sighting.One person wrote: 'the grim reaper has appeared''It's like that scene in Exorcist 3' tweeted another.'Is that for real?' questioned another.And noticing something else, another added: 'I've seen this clip a few times now and can’t get over the musical accompaniment of the reaper’s appearance.'Today's events mark the first coronation since 1953 when the late Queen Elizabeth was crowned at Westminster Abbey and went on to reign for more than 70 years. King Charles, 74, ascended the throne in September 2022 when his mother died at the age of 96.",
        "The Coronation is set to showcase up to 15 working members of the Royal Family, including the Prince and Princess of Wales, as they ascend to the palace balcony for the day's events.",
        "And on the streets of London, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.",
        "Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain."
    ]
}