{
    "articleURL": "/wires/reuters/article-12052007/U-S-electric-vehicle-startups-set-quarter-steep-cash-burn.html",
    "content": [
        "By Akash Sriram",
        "May 5 (Reuters) - U.S. electric-vehicle startups are expected to report another quarter of dwindling cash reserves next week, piling pressure on a group of companies that are struggling to ramp up production and have few options for funding in a turbulent economy.Having gone public with hopes of shaking up the automobile industry, these companies have seen their market valuations evaporate in the past few months as EV demand slows and market leader Tesla Inc cuts prices to stoke orders.Lucid Group kicks off first-quarter earnings for the group on Monday, with the company expected to report a 36% sequential slide in cash reserves, according to Visible Alpha.Rivian Automotive, meanwhile, will likely report on Tuesday that its cash balance fell by 6.8% to $10.78 billion from the preceding quarter, per a Visible Alpha estimate.The Amazon.com Inc-backed firm, whose shares have declined by nearly a quarter this year, is also expected to report a larger loss of $1.75 billion as both deliveries and production fell in the period. It posted a $1.59 billion loss a year ago.Fisker Inc and Nikola, both of which report earnings on Tuesday, are expected to see their cash reserves decline by 5% and 15%, respectively, according to Visible Alpha.\"Any company that's losing money with a low valuation is toast and EVs are no exception. I think it is just a slow bleed. Maybe they'll get lucky and some of their technologies maybe bought by bigger players,\" said Thomas Hayes, chairman of hedge fund Great Hill Capital.",
        "A drop in valuations of companies has rendered selling equity for precious cash more ineffective and investors are becoming increasingly unhappy with their stake being diluted as several startups are yet to recognize revenue from operations.British EV startup Arrival SA and Nikola have issued going-concern warnings in the past few months, with the former set to merge with blank-check firm Kensington Capital Acquisition Corp in a bid to raise cash.Lordstown Motors said this week it could be forced to file for bankruptcy due to uncertainty over a funding deal with major shareholder Foxconn. Its earnings in an unscheduled release on Thursday showed Lordstown's cash balance fell 11% sequentially.Some of the companies including Lucid and Rivian have also said they would not provide data on reservation numbers going forward, sparking some concern among investors.It is a \"disturbing development,\" CFRA Research analyst Garrett Nelson said. \"What we've seen is a trend of less transparency in the reservation count, but overall competition is a big problem,\" he added.(Reporting by Akash Sriram in Bengaluru; Editing by Aditya Soni and Maju Samuel)"
    ]
}