{
    "articleURL": "/femail/article-12043707/Queen-Letizia-Spain-stuns-elegant-ballgown-hosts-gala-King-Felipe-Madrid.html",
    "content": [
        "Letizia, 50, looked stunning as greeted Gustavo Petro, Colombia's president, and Verónica Alcocer at the PalaceREAD MORE: Queen Letizia of Spain dazzles in a recycled satin numberQueen Letizia pulled out all the style stops as she hosted a gala dinner with King Felipe at the Royal Palace in Madrid this evening. ",
        "The royal, 50, oozed elegance as greeted Colombian President Gustavo Petro and his wife Verónica Alcocer.The mother-of-two opted for a stunning red gown with peplum detailing around the waist and slightly flared short sleeves.The show-stopping gown skimmed Letizia's slim figure and even had a small train incorporated into the design. Queen Letizia paired her frock with a glitzy floral tiara and simple diamond stud earrings.",
        "She styled her sleek shoulder-length brown hair straight and opted for a full face of glam makeup - including smoky eyeshadow, bronzer, highlighter and a touch of lip gloss.Meanwhile, King Felipe VI looked dapper in a black suit with a white bow-tie and his ceremonial medals proudly on display.First lady, Verónica Alcocer, looked graceful in her sapphire-blue caped ballgown, which featured a V-neckline. What's more, her husband matched perfectly in a navy blue suit and a burgundy tie. The group also welcomed Spain's Prime Minister Pedro Sanchez - who smiled and laughed as he shook hands with royals. President Petro gave a speech at the dinner table with a red velvet podium, as Letizia and Prime Minister Sanchez listened intently.The Colombian politician has made the trip to Spain to urge more action against climate change.Earlier today, Letizia wore a white lace dress by Sfera as she greeted her guests on the steps of Zarzuela Palace in the Spanish capital - with  Veronica Alcocer similarly attired in a flamboyant white dress.",
        "The presidential couple arrived in Spain yesterday and will stay until Friday. After the Colombian president's visit, Queen Letizia and King Felipe will join other crowned heads and 203 international heads of state in attending King Charles' Coronation in London on Saturday. It has been reported that some 2,200 people will witness the historical event at Westminster Abbey this weekend.A number of recognisable figures, such as the Archbishop of Canterbury and the Duke of Westminster, will have key roles to play during the coronation ceremony.In a break from previous plans, Camilla will be crowned as Queen, having initially been set to use the title of Queen Consort."
    ]
}