{
    "articleURL": "/wires/pa/article-12050545/Coronation-draw-long-rich-history-Crown-Jewels--historian.html",
    "content": [
        "The crowning of the King and Queen Consort will “draw on the long and rich history” of the Crown Jewels and coronations but it will also do away with some traditions, a royal historian has said.",
        "On Saturday, the eyes of the world will be on Westminster Abbey as Charles and Camilla take part in the coronation ceremony, which will feature a number of the nation’s most precious treasures, including St Edward’s Crown, the Robe Royal and the Sovereign’s Orb.The sacred, priceless objects are part of the Crown Jewels – the nation’s most precious treasures – which are held in trust by the King for the country and kept under armed guard in the Tower of London.",
        "Charles Farris, a public historian and expert on the Crown Jewels and the history of coronations, told Sky News that the coronation regalia will play a “very central role” in the ceremony.“Regalia just means objects symbolic of kingship, and the coronation regalia are those objects used in the coronation itself,” he said.“More famously, you have objects like crowns and orbs and sceptres which are part of the investiture regalia, these will be given to the monarch symbolic of their royal powers and responsibilities.“But there’ll be a number of other important objects as well and these form the heart of the Crown Jewels collection.”",
        "However, Mr Farris noted that some past coronation traditions are no longer performed, including the monarch processing through the streets of London from the Tower of London to Westminster the day before the ceremony.",
        "He recalled that King Charles II was the last monarch to do so in 1661 but that it had been part of the spectacle for hundreds of years before this.Despite its omission, Mr Farris noted the coronation will still be “steeped in pageantry” and “draw on the long and rich history of not only the Crown Jewels but also coronations and British history as well”.“Coronations look to the traditions of the past and they use the regalia which have been used for hundreds of years,” he added.Mr Farris also explained that the earlier medieval coronation regalia were destroyed at the Tower of London in 1649 and new ones had to be made after the restoration for the coronation of King Charles II.He revealed that a few items still remain and that these will form part of the coronation procession and ceremony."
    ]
}