{
    "articleURL": "/femail/article-12038651/What-6th-2023-bring-star-sign-Oscar-Cainer-tells-all.html",
    "content": [
        "As Venus enters home-loving Cancer, values of wealth and beauty are on the agenda; perfect for the Coronation weekend. The legacy of the Lunar Eclipse suggests we can all push beyond our normal limitations whilst having fun. ",
        "Read more horoscopes from MailOnline. ARIES March 21 - April 20We spend years in an education system that’s meant to prepare us for adulthood. As we gain life experience, we often realise that we need to unlearn some of what we were taught! We never stop learning and discovering. You’re wondering whether you’re prepared enough to deal with your situation. You’re worried you’ll ‘get it wrong’. But the only person judging you is… you! Why are you being so hard on yourself? This week, a problem only matters if you think it matters. Investigate more before making a decision. The Coronation Eclipse brings positive potential! For great news, call 0906 751 5601. TAURUSApril 21- May 21 We’re not always as nice to each other as we could and should be. We complain and criticise, coax and cajole. Then wonder why our relationships aren’t as healthy and fulfilling as we’d like them to be! Or why we’re surrounded by tension and angst. One of the reasons we treat others badly is because we’re too harsh on ourselves. This week, as your ruler changes signs, inspiring events come along. As you get more comfy with your own abilities, your connections with others will grow sweeter and happier. It’s Coronation Eclipse week! Be guided to the future you dream of. For great news, call 0906 751 5602.",
        "GEMINIMay 22 - June 22Power comes hand-in-hand with responsibility. And responsibility brings pressure. And pressure reduces our ability to focus. And when we’re distracted we lose power. Which is perfect! Otherwise, we’d achieve what we want once and forever. And then what would we do? We’d be so bored. Be thankful that you’re not all-powerful. And don’t be sparing with the power you have. Not only do you have less responsibility (in a tricky situation) than you imagine; you’ve got less of a problem than you think. How will the Coronation Eclipse transform your life? There’s inspiration in your forecast. Call 0906 751 5603. CANCERJune 23 - July 23In order to vastly improve your life you don’t have to take dramatic action. You just have to do something that’s almost too simple. You need to accept a change you’re trying to oppose. Or let go of a dream you don’t really believe in. As Venus moves into your sign, a decisive development is about to take place. It will liberate you from a state of doubt and expedite much-needed progress. Your task is to accept what seems to be rolling in so fast – and let go of whatever is keen to roll out of your life. You’ll like what happens next! ",
        "Let the power of the Coronation Eclipse inspire you. Call your four-minute forecast on 0906 751 5604. LEOJuly 24 - August 23  It’s frustrating when things you want to stabilise refuse to stay still (particularly when the things you want to change are refusing to budge). Aargh! Yet this week, as your ruler, the Sun, converges with quirky Uranus, change is on the cards. Expect events that boost your self-esteem and enable you to see that your ideas are supported. The cosmos brings surprises your way. As long as you keep focused on your positive aspirations, and remain open to creative ideas, you’ll see signs of the changes you wish to see.Maximise the energy available to you. The Coronation Eclipse can transform your world. Call 0906 751 5605.VIRGOAugust 24 - September 23You’re expected to be a reliable and kind-hearted character who shares perception and insight when other folk are feeling bewildered and overwhelmed. Yet this week, your ability to rise above conflict and fear won’t be as consistent as usual. It’s likely that you will feel under pressure and frazzled. Although your strength will be tested, you’ll find it easy to pass this test. By demonstrating patience and forgiveness (with yourself as well as others) you’ll open the way for other people to offer you the support you so freely give. Hooray! ",
        "Use the energy of the Coronation Eclipse to change your life. For your key to the future, call 0906 751 5606. LIBRA September 24 - October 23   Every now and then everything goes pear-shaped and we end up racing round and round getting nowhere. In these moments, we get so caught up in the cycle that we forget life can sometimes be straightforward, with a clear, obstacle-free path ahead. We almost expect disappointments. If you’ve been feeling this way recently, you’re in for a welcome change. As your ruler, Venus, changes signs, it brings a glow of warmth to your relationships and fresh hope to your finances. You’ll begin to see signs of change this week. The Coronation Eclipse can change your life for the better. There’s valuable news when you call 0906 751 5607.",
        "SCORPIOOctober 24 - November 22Sometimes life seems short and sometimes it feels long. Some moments are over in the blink of an eye, while others seem to take an eternity. Our perception of the passage of time is subjective. So is our view of what’s important. Despite the pressure you feel subject to, the doubts you’re experiencing and the frustration you are starting to feel, this week brings tangible proof of why exactly the right amount of time is being taken, and the right result is about to be attained. Here comes an outcome you’ve been striving for. This is an exceptional week. ",
        "The Coronation Eclipse brings potential for transformation. For good news, call 0906 751 5608.SAGITTARIUSNovember 23 - December 21Those fairytales we heard as kids (and watch on Disney films) have a lot to answer for. Princes and princesses. Gleaming castles. Magical forests. Ogres, giants and wish-granting genies. We’re subjected to so many of these stories that we start to believe in them. But they can’t be true… can they? This certainly isn’t going to be a happy-ever-after week. But I’d like to predict a ‘much-happier-than-you-have-been’ time. It will come about through a series of unlikely events. And the impact will last longer than you might think. Give yourself the best Coronation Eclipse present ever: four minutes of priceless insight and support. Call 0906 751 5609. CAPRICORNDecember 22 - January 20Nothing changes when you walk into a dark room and switch the light on. It’s just that you can see what you could only imagine. Shadows are replaced by colours. It’s astonishing how much our perception can be altered by a little information. Even though it can reveal faults that were indiscernible, knowledge is always valuable. This week, as your ruler, Saturn, links to Mercury and Venus, your understanding of a difficult situation improves. It brings you closer to making a life-changing decision.",
        "Wonderful opportunities arise as the Coronation Eclipse energises your life. For great news, call 0906 751 5610. AQUARIUSJanuary 21 -  February 19Things only ever fall apart for one of two reasons: so we can experience the excitement of their reconstruction, or so we can create a better alternative. You don’t believe me? You’re worried you’re witnessing the end of something that deserves to last longer? Then you need to be prepared to psychologically fight for it! Just be sure it’s what you really want to do. It might be much easier to gracefully accept the change (and it might be perfect). If you’re determined to take the harder route, you’ll make progress. The Coronation Eclipse brings powerful positive change! There’s great news in your forecast. Call 0906 751 5611. PISCES February 20 - March 20   You don’t want everyone to know what’s hidden in your heart. Yet you’re a treasure-trove of emotions: you wear your heart on your sleeve. Does that mean you’ve got two hearts (one you show and one you keep hidden away)? No! But you do often have two minds. At one moment, you feel one way. The next, you’re sure you think something else. Yet that’s a sign of intelligence and strength. We live in a world where nothing stays the same for long. You don’t need to disguise your feelings. Be honest. Capture the transforming energy of the powerful Coronation Eclipse. Call your in-depth forecast on 0906 751 5612. Calls cost 80p per minute plus your phone company's access charge. To report a phone line problem, call 0800 138 9789. Go to cainer.com and join the 5 Star Service for personalised messages, audio, video, discounts on full readings, and more! "
    ]
}