{
    "articleURL": "/tvshowbiz/article-12047293/Katie-Price-showcases-biggest-boob-job-skimpy-pink-bikini-Spain-getaway.html",
    "content": [
        "Katie Price sent pulses racing as she flaunted her 'biggest boob job ever' while enjoying a sun-soaked getaway in Spain on Thursday.",
        "The former glamour model, 44, recently had her 16th breast augmentation in a bid to have the largest in Britain and did not shy away from flaunting the results.She wowed onlookers in a skimpy pink bikini featuring gingerbread man prints as she topped up her tan.Katie kept her brunette tresses back with a coordinating bandana and exhibited her impressive collection of body art.Katie looked ready for some sunshine as she arrived at an airport in London to jet off with her fiancé Carl Woods on Wednesday.",
        "The TV personality sported her foot fracture walking boots as she strolled through the terminal alongside her on-off beau, 34.Carl was seen carrying the couple's luggage for their trip while Katie clutched a pillow in one hand and a cream bag in the other.The trip comes just days after Katie and Carl returned from Ireland where she made a public appearance at Switch nightclub in County Monaghan. The reality star cut a casual figure for her latest trip, arriving at the airport in an orange hoodie and matching tracksuit bottoms.Styling her brunette locks into a ponytail, Katie completed her look with a light palette of makeup.",
        "Former Love Island star Carl sported a white hoodie and matching tracksuit bottoms along with a pair of white trainers.",
        "Katie and Carl have had a tumultuous relationship since 2020, including a series of very public bust-ups. They split once again in January but since the start of the month their romance has appeared to be sailing smoothly. Earlier this month, Katie again slipped back on her engagement ring as it appeared to be clear that the couple were together.While more hints over recent weeks came in the form of re-following one another on social media, and Carl supporting his estranged partner as she appeared on TV show Jeremy Vine.Since beginning their relationship in 2020 and getting engaged a year later, the tumultuous couple have had a slew of public bust-ups - with their most recent split at the beginning of the year. Sharing an Instagram Story with her 2.6M followers at the start of the month, Katie snapped a picture of her left hand resting on her inked leg, once again sporting her engagement rock.Holding a glass of wine while appearing to soak up the sun, the TV personality wrote: 'Vibes' over the shot. ",
        "Claiming that they are officially together and enjoying an Easter break, a source told The Sun: 'Katie and Carl are officially back together and they're off on holiday tomorrow - they're taking Harvey and want to get away and relax.",
        "'A lot of Katie's friends are worried about how on and off their relationship is, and how many rows they have but Katie doesn't want to hear it and just wants to go on holiday.' MailOnline contacted Katie's representatives for comment at the time. There have been many hints that Carl and Katie have rekindled their romance over recent weeks, with the most recent one coming from the latter's son Harvey.Earlier this week, she shared an image of herself and Harvey to Instagram, on which he had scrawled an adorable message. Appearing to confirm that his mum was 'on' with Carl, he wrote over the picture: 'To the best family, mummy and Carl Woods.' Posting the image on Instagram, Katie explained: 'Harvey just sent this he is so adorable I love him so much only two more sleeps until he comes home for Easter.'While before that, the former glamour model and her on-off fiancé followed each other on Instagram again.Katie and Carl got engaged after a whirlwind 10-month romance with car salesman Carl asking her mother Amy, her father and son Junior for their permission.Speaking to OK! Magazine about their engagement at the time, Katie said: 'It's refreshing to be with a man that if I decided I never wanted to work again, he'd look after me, I just love him.'",
        "But the pair have split a number of times since Carl popped the question to Katie, who has been married three times prior. As well as being mother to Harvey, whose father is Dwight Yorke, Katie shares son Junior and eldest daughter Princess with ex Peter Andre. While she is mum to Jett and Bunny, from her relationship with Kieran Hayler."
    ]
}