{
    "articleURL": "/news/article-12054715/JACI-STEPHENs-hilarious-verdict-wore-crown-coronation-pundits.html",
    "content": [
        "Rule Britannia! Especially if you live in the USA.",
        "All of American television - from the network giants to the dueling cable news combatants - were transfixed by the dazzling pomp and spell-binding finery of King Charles III's coronation.It's the stuff of which fairytales are made - even down to the villains lurking just off-screen.Solo Harry was shoved into the third row, obscured by a vast feathery hat, his wife Meghan back in Montecito blowing up balloons for a 4-year-old's birthday party.Joe Biden was a no-show - and Dr. Jill was marooned behind the representatives from Serbia, Slovakia, and Macedonia.When King Charles was presented with his bracelets of wisdom and golden robe of righteousness, what a silly joy it all could have been! If only there were also socks of silence to be stuffed into the mouths of some of these tedious, droning TV hosts - though even a drawer full of undergarments couldn't have shut up ABC News' Michael Strahan and Deborah Roberts.When the glittering sovereign's orb was handed to King Charles, there was only one place it deserved to go. In Strahan's mouth. If only there had been two orbs in the studio.",
        "They continually reminded us how moving it all was, but the only thing moving at my place were my hands, reaching for the mute button every time they opened their mouths.",
        "It was like Amazon's Alexa, chipping in when you're listening to a Beethoven symphony, with a pointless interruption of, 'I'm sorry, I didn't understand that.'Michael intoned that the swords had special significance, one being for 'the defense of the defenseless'. You mean like defenseless viewers, trying to protect themselves against this barrage of verbal diarrhea?The pair even ruined the anointing. Do you know how hard it is to do that? Only if you accidentally used the King's oil, flown in from Jerusalem (a first, apparently) to fry your eggs that morning.The oil would be applied to the King's forehead, wrists and chest, said Deb, adding what a 'sacred' moment it was. Not when somebody talks all over it, it isn't.The first time we would see Charles sitting in the special chair after being crowned, Dumb and Dumber told us about a black cat that was found sitting in that very seat during the Queen's Coronation.How they laughed. And laughed. In fact, they laughed so much at inappropriate moments, you could be forgiven for thinking you were at a pantomime. Had they yelled 'He's behind you!' in unison, it wouldn't have seemed out of place.Where was a decent producer in all this, barking just one instruction: SHUT IT, PEOPLE!",
        "CNN's anchor and royal correspondent Max Foster was his usual statesmanlike self, but network star Anderson Cooper, always so reliable on all matters American, appeared to be winging his way through it.Cooper didn't even know that Prince George was in attendance, despite the lad being a page boy and standing right behind the King.Thankfully, for the most part, CNN managed to stay quiet throughout the ceremony, but jeez, could they talk during the preamble.They had trouble identifying pop star Katy Perry, though, who appeared to have been consumed by a cotton candy monster that she mistook for a hat.",
        "Anxiously searching for her seat, Perry looked as if she had stolen the crown jewels and was desperate for a quick getaway.CNN tried to cover up her confusion by drawing attention to 'that wonderful pink hat.' Really? She looked as if Miss Piggy had landed on her head.There was also an utterly bizarre interview with British TV presenter Trisha Goddard, who for some reason decided that this was the moment to draw attention to mental health.'Exciting' as the occasion was, she felt she had to warn us about 'People with mental health issues', who might appear distressed. It wasn't clear if she meant in the Abbey (of which there were probably many), or in general.",
        "Utterly weird moment.There were reminiscences aplenty – including one about 1953, when the Queen was 'coronated.'Yes, really! And this from a Brit, too.One cannot be 'coronated.' Just crowned. One demerit!British journalist Sharon Carpenter spoke of the Americans' love for Harry and Meghan (have you been living in a bunker, woman?)Max informed us that the royal coach had air conditioning.With the 'loyal' subjects standing in the pouring rain and barely able to pay their electric bills at home, it served more as a reminder of the real Us and Them that lies at the heart of British society and not, as CBS's royal commentator Wesley Kerr called, a 'diverse, modern Britain.'The broadcast was also not helped by the disruptive ads – most notably a cut away to a pregnancy testing kit commercial just as the royal pair were emerging from the gold carriage at the Abbey. Is there something we should be told?Maybe CBS over-compensated for their having missed the key moment, because there was considerable stress over Camilla struggling with her long train.You're telling me. Not since Aladdin whisked Jasmine away on the Magic Carpet has so much negotiation with a bit of material been required.Fox went down the great royal sacrifice path, with Piers Morgan talking about how much the young Queen and the four-year-old Charles had given for their country instead of themselves.",
        "There was high praise for Camilla and a rather unnecessary mention of the late Princess Diana, who would have been 'seething' at seeing Camilla ascend the throne.All in all, Fox's coverage felt like a groveling tribute to the royals rather than an informative broadcast.",
        "And just when you thought the rainy London weather had put the worst dampener on the proceedings, spare a thought for viewers of NBC, leading up to their 5am start. Showing a repeat of a program, it was all about the death of Prince Philip and the Queen.'Good evening, the Queen is dead!' said a chirpy presenter, before showing clips of sobbing Brits (in a downpour, of course).When it came to the main event, NBC seemed behind everyone else, still lurking in an empty Abbey backwater while the other stations were showing the arrival of Prince Harry.All in all, it was a win for CNN and the (normally!) reliable Anderson Cooper (my TV crush. Yes, I know. I know. I won't be ordering a crown anytime soon).During an informative and reverential, without being sycophantically so, broadcast, Christiane Amanpour concluded, at the end of the service, that, 'No other country does this kind of ceremony.'That's true.Yet only our self-important TV magpies could make such a mess of it."
    ]
}