{
    "articleURL": "/wires/aap/article-12057561/Womens-summit-headlines-week-voice-events.html",
    "content": [
        "The Wiyi Yani U Thangani, or women's voices, national summit headlines more than 50 events being staged across Australia this week supporting the Indigenous voice to parliament 'yes' case.",
        "More than 800 Aboriginal and Torres Strait Islander women will meet in Canberra for the gathering between Tuesday and Thursday.The summit, which has a theme of \"We are the change\", aims to provide Indigenous women and girls an opportunity to get together and discuss the matters affecting them.Building on previous work by the Human Rights Commission under the broader Wiyi Yani U Thangani Project, its key outcome will be the development of a landmark National Framework for Action and an Institute for First Nations Gender Justice and Equality.Elsewhere, Australians are being invited to connect with the 'yes' campaign through dozens of guest and community events around the country.The case will have a campaign presence at Darwin's Seabreeze art festival, hold briefings with Indigenous elders in Tasmania, host a town hall meeting with Waverley Council in Sydney's eastern suburbs and conduct training sessions for volunteers in the Blue Mountains.Indigenous constitutional recognition leader Thomas Mayo will also deliver the keynote address a national stevedores conference in Sydney.Yes Campaign Alliance director Dean Parkin says staff have also been appointed to run field teams Australia-wide supported by some 5000 volunteers in readiness for managing the sustained national campaign that will continue until the voice referendum expected to be held sometime between October and December.",
        "\"Engaging directly with Australians at the community level, and having a conversation with them about why constitutional recognition is important will be critical to the success of this campaign,\" he said.\"All around the country - whether it be Hobart, Darwin, Nowra or Aldinga - there are more and more opportunities every week for people to get informed and involved.\"The week's activities follow the Australian Olympic Committee executive's decision to throw its support behind the 'yes' vote.The referendum would be Australia's first since 1999 and the first for about 6.4 million Australians."
    ]
}