{
    "articleURL": "/sport/rugbyunion/article-12055211/London-Irish-17-14-Exeter-Exiles-field-problems-aside-claim-scrappy-win.html",
    "content": [
        "Premiership clash had been in doubt due to London Irish's financial problemsTwo tries from Martin Gonzalez helped the Exiles secure a scrappy victoryExeter gave their youngsters a chance but they lacked the finishing touchLondon Irish coach Declan Kidney assured supporters that the club’s financial future will be resolved after ending the season on a winning note.",
        "Saturday’s match against Exeter was at risk of being called off after players were not paid on time amidst an ongoing takeover bid.Kidney’s squad put the clubs’s problems to one side as two tries from Juan Martin Gonzalez secured a scrappy victory.‘You see the measure of people in adversity,’ said Kidney. ‘The players have been brilliant, but so have coaches and the off-field team because it affected everybody.‘There’s a rich future for this club on the pitch and I’m sure the people off the pitch will do the business, they just need a bit of time.",
        "‘We entrust in them to be able to manage something between them. It’s outside our remit but if you see that out there today, I imagine there would be a queue of people.’Braving the rain, one child stood on the sidelines holding a ‘save our club’ banner. And things looked bleak when Exeter took the lead via Jacques Vermeulen, capitalising on Stu Townsend’s box kicking. Irish had to defend their line as the visitors dominated the first half.With the likes of Jack Nowell and Stuart Hogg stepping down, Exeter gave their youngsters a chance but they lacked the finishing touch.",
        "Having made 20 metres through a huge driving maul, the London Irish fans finally had something to cheer about when Gonzalez pumped his legs through contact to level the score.",
        "The second-half was littered with errors. Both teams lost lineouts and missed kicks to touch, and Exeter’s inaccuracy came back to haunt them when flanker Tom Pearson snatched the lead for the hosts from a lineout.Pouncing on a loose ball, Tom Hendrickson briefly moved Exeter back in front but they lacked the experience to see out the game.Paddy Jackson missed a penalty but his blushes were spared when Gonzalez scored late to seal the victory for Irish."
    ]
}