{
    "articleURL": "/tvshowbiz/article-12044257/Drag-queen-Courtney-Act-stuns-JACKED-gym-body.html",
    "content": [
        "Australian drag queen Courtney Act showed off her incredibly buff physique in a racy workout video on Wednesday.",
        "Courtney, whose real name is Shane Jenek, worked up a sweat while sporting a full face of makeup, a pink wig, a plunging neon top and skimpy denim cut-offs.The RuPaul's Drag Race alum, 41, looked absolutely ripped in the Instagram clip, which was aptly set to her 201 song Body Parts.'Vida works out,' she captioned the post.Courtney's followers were stunned by her bodybuilder physique, with one describing her as a 'butch queen' in the comments section.",
        "'Courtney rack,' another fan commented.'It's giving Britney workout vids. I'm obsessed,' another said.Even Blue Wiggle Anthony Field chimed in: 'Senslaytional!'",
        "In the video, Courtney performed a series of weight exercises and pull-ups. The performer has been hitting the gym in recent weeks and documenting her progress on Instagram.'Here are some things to look at,' one shirtless post was captioned.",
        "Courtney is best known for appearing on RuPaul's Drag Race, Celebrity Big Brother, Australian Idol and Dancing with the Stars. She recently spoke to Daily Mail Australia during Sydney WorldPride about inclusivity and the one thing she wishes people knew about the queer community.'If you're not in the queer community I wish that people knew that the people from the queer community are just like them,' she said.'We love, we eat, we go to work, we play, we just think about things a little differently sometimes, and sometimes quite the same. I think the more we share and hear each other's stories the more we realise that our similarities are greater than our differences,' she added.",
        "Courtney grew up in Brisbane and experienced severe bullying for being gay.Ever the comedian, the star joked that if she were able to go back in time, she'd tell her younger self to 'start a YouTube Channel earlier and go to the gym', before addressing a more serious message about self-acceptance.'I would tell my younger self that the world may not understand who you are right now, and you may not understand who you are right now, but who you are is valid and keep being true to you,' she said.'Eventually the world will evolve and who you are will become more understood and you will understand yourself more.'"
    ]
}