{
    "articleURL": "/wires/reuters/article-12044375/Hong-Kong-c-bank-raises-rates-Fed-hike.html",
    "content": [
        "HONG KONG, May 4 (Reuters) - The Hong Kong Monetary Authority (HKMA) on Thursday raised its base rate charged through the overnight discount window by 25 basis points to 5.50%, its highest since January 2008, hours after the U.S. Federal Reserve delivered its latest rate hike.",
        "Hong Kong's monetary policy moves in lock-step with the United States as the city's currency is pegged to the greenback in a tight range of 7.75-7.85 per dollar.\"Rate hikes in the U.S. will not affect the financial and monetary stability of Hong Kong,\" Eddie Yue, Chief Executive of the HKMA, told reporters.\"The market has continued to operate in a smooth and orderly manner and the total deposits in the banking system in Hong Kong have also remained stable.\"The Fed raised interest rates by a quarter of a percentage point on Wednesday and signalled it may pause further increases, giving officials time to assess the fallout from recent bank failures and monitor the course of inflation.HKMA said Hong Kong interbank rates, which have been climbing over the past few months, will likely rise further with the Fed latest rate hike.The public should carefully assess the interest rate risk when taking out mortgages or making other borrowing decisions, it said.HSBC said it would raise its best lending rate in Hong Kong by 12.5 basis points to 5.75%. Bank of China Hong Kong and Standard Chartered also lift their rates by 12.5 basis points.\"Amid an uncertain global environment, rate expectations will remain uncertain,\" said Luanne Lim, chief executive of Hong Kong HSBC. \"We will continue to monitor the external environment and be prepared to adjust our rates if needed.\"",
        "One month Hong Kong interbank offer rate (Hibor) , the benchmark referenced for residential mortgages, rose 7.5 basis point to 3.62857%, highest since Jan. 4. Three-month Hibor rose 9.5 bps to 3.99423%, the highest since mid-March.Commenting on the impact of the rate hike on the city's property market, already one of the most unaffordable in the world, Yue said the market is not affected by interest rates alone.\"After China and Hong Kong markets have returned to normalcy post COVID-19, investment sentiment in the real estate market has improved, consumption power has risen. The Hong Kong property market has rebounded by 5-6% year-to-date,\" Yue said, adding other economic factors also play a part.Private home prices in the financial hub rebounded 5% in the first quarter after a 15% drop in 2022.(Reporting by Donny Kwok and Georgina Lee; Editing by Jacqueline Wong, Lincoln Feast and Kim Coghill)"
    ]
}