{
    "articleURL": "/health/article-12058879/Blood-test-spot-extreme-drowsiness-wheel-ready-two-years.html",
    "content": [
        "The research was funded by the Australian Government Office of Road SafetyBetween 10 to 20 per cent of all crashes in the UK are caused by driver fatigue Drivers could soon face on-the-spot tests which check whether they are too tired to be be on the road. ",
        "Researchers think such tech — similar to breathalyzers used to catch drink-drivers — might be just five years away. Blood tests could be ready even quicker, raising the prospect of drivers who've been taken to hospital after a crash being tested for sleep deprivation at the same time as booze and drugs. Experts say now is the time to crackdown on drowsy-driving, with fatigue blamed for thousands of accidents ever year.Getting behind the wheel after less than five hours of sleep can be just as dangerous as driving while intoxicated or high on drugs, research suggests.",
        "Ministers aren't currently considering adopting the state-of-the-art technology in the UK.However, Department for Transport (DfT) bosses insisted that it will 'always note new ideas to make our roads safer'. Tests to spot drowsy-driving — once proven accurate — could help to finally legislate against tired drivers who have caused crashes.  No laws currently exist in Britain to ban drowsy-driving. But a tired driver who kills someone can be charged with death by dangerous driving or death by careless driving.",
        "Key to securing a prosecution would be agreeing a threshold to indicate tiredness or the minimum sleep that a motorist requires to drive safely.This would be similar to the 0.05 per cent blood mark for alcohol in many countries including Australia and Scotland and 0.08 per cent for the rest of the UK.  ",
        "Work on the tests is being funded by the Office of Road Safety, Australia's equivalent to DfT.Professor Clare Anderson, an associate professor of psychology from Monash University, who is working on the tests, told The Guardian: 'When you look at the major killers on the road, alcohol is one of them, speeding is another, and fatigue is one of them. 'But even though the solution to fatigue is quite simple, which is to get more sleep, our capacity to manage it is impaired.'This is 'because we don't have tools to be able to monitor it like we do with alcohol', she added.Her team has found five biomarkers in blood that can detect whether somebody has been awake for 24 hours or longer.Preliminary tests show this method can be up to 90 per cent accurate in real-world settings. Yet more research is needed to validate and improve the tech before it gets rolled out.For instance, it is not yet able to quantify how much sleep someone has truly had.  However, basic blood tests could still be ready within two years, Professor Anderson claimed. Portable roadside tests will take longer because sensors and devices to detect the biomarkers still need to be developed.Fellow researcher Professor Shantha Rajaratnam, also of Monash University, told the Guardian that 'with the right investment to be able to scale this, I reckon that within five years we will be able to implement these biomarker-based tests'.",
        "In the UK, up to a fifth of all crashes are estimated to be caused by driver fatigue. But charities say the true total could be much higher. According to UK road safety charity, Break, one in eight drivers have also admitted to falling asleep at the wheel. ",
        "A tired driver who kills someone can be charged with death by dangerous driving or death by careless driving.Professional drivers of goods must maintain logbooks and record hours of work and rest in the UK. Many commercial fleets also use event data recorders, which police can study in the event of a crash.It comes after research last month suggested that five hours of sleep would be the 'line in the sand', in terms of a threshold.Researchers found that drivers who had less than this were twice as likely to be involved in an accident as well-rested individuals.The risk shrunk with more sleep, according to the study published in the journal Nature and Science of Sleep.Meanwhile, the number of road crashes caused by alcohol has decreased in recent decades because of the introduction and enforcement of blood alcohol concentration limits for driving, scientists said. Sonya Hurt, chief executive of the Road Safety Trust, said: 'Driver fatigue is a significant and serious issue. ",
        "'Government statistics show in 2021, 467 people were either killed or seriously injured in collisions where fatigue was noted as a contributory factor.'Therefore, any work to reduce the impact of sleep deprivation is welcome as we strive to improve road safety and save lives."
    ]
}