{
    "articleURL": "/news/article-12052849/Blacktown-Sydney-Search-continues-missing-mother-abandoned-newborn-baby-backyard.html",
    "content": [
        "Cops appeal for help to identify mystery mumA baby was abandoned in Blacktown on FridayPolice said community has the answersDetectives believe local residents hold the key to finding the mystery mum who abandoned her newborn baby in a stranger's backyard. ",
        "NSW police said solving the puzzle over the mother's identity lies with those who live around Blacktown and Doonside in Sydney's west to come forward with any relevant information.The naked baby girl - barely an hour old - was discovered alone on a wicker chair next to a children's playset at a Blacktown residence on Friday, April 21. She was covered in birth fluids with the umbilical cord still attached to her as she lay on a cushion. The infant has spent the last two weeks recovering in Blacktown hospital after becoming unwell - but is set to go into foster care soon.",
        "Detective Inspector Jason Pietruszka said police did not have any leads on who the mum of the baby is - but are pressing for answers. 'We want to know what has occurred, what's the back story behind it,' he told The Saturday Telegraph.'It's sure to be quite sad, tragic, but that's why we are police officers, to find the truth so we can help.'We don't have the answers at the moment and that is frustrating, but we are appealing at a grassroots level for people in this proud community to come forward.'He urged residents in the area to report anything unusual they have seen where someone looked like they were in trouble or acting out of the ordinary. ",
        "Inspector Pietruszka said police were also scouring DNA records in their system to see if there are any similar matches to the little baby. He added he was confident officers would find some sort of match.  But he stopped short of speculating on the infant's ethnicity due to her features not being fully developed. Detectives are also searching through hours of CCTV footage from the area. Inspector Pietruszka said if the mother does not come forward the baby will be available for adoption - adding the infant was 'doing well'. He urged the mum to not panic or feel pressured but to come forward so authorities can help her. Meanwhile, Ann Carlos who lives at the Girra Road residence where the infant was found said her sister Lara discovered the baby when she went out to hang washing on the clothesline.The family wrapped the chilly newborn in a towel before ringing triple-0 as paramedics instructed them over the phone how to clamp the umbilical cord.'I couldn't find anything in the kitchen, so I grabbed a shoelace and used that…then [paramedics] talked me through how to do it,' Ms Carlos told The Daily Telegraph. ",
        "'We knew she had been born very recently, like only hours earlier, because she still had the white stuff [vernix] on her head.'",
        "She said she thinks the newborn was cleaned up before being dumped in their backyard as there wasn't much blood on her.Ms Carlos recalled hearing the side gate slam loudly shut around 2pm, thinking at the time it was her brother-in-law.'But now we realise that must have been the mum or whoever left the baby here, and they closed it loudly so we would go out and find her. You don't bang a gate closed if you don't want to be heard,' she said.Anyone with information is urged to contact Crime Stoppers on 1800 333 000. "
    ]
}