{
    "articleURL": "/columnists/article-12044109/STEPHEN-GLOVER-abide-entitled-Tory-know-alls-like-George-Osborne.html",
    "content": [
        "The moment I began to have suspicions about David Cameron is etched on my mind. It was in January 2006, a month after he had been elected Tory leader, and he laid into chocolate oranges.Mr Cameron complained that anyone trying to buy a newspaper at a train station was 'surrounded by cut-price offers for giant chocolate bars'. He castigated W.H. Smith for promoting 'half-price chocolate oranges at its checkouts instead of real oranges'.Several things struck me about his comments. One was that if one were to draw up a list of dangerous substances, chocolate oranges don't rank very high, and certainly below crack cocaine, too much whisky, cigarettes, and a lot of school food.That led to another reflection — that David Cameron wasn't perfectly placed to lay down the law on chocolate oranges, given that he was himself quite well padded. I believe his figure attracted some teasing at Eton.My last thought was that a politician who thinks it worthwhile to censure people for eating a certain type of confectionery should probably not be taken very seriously.",
        "George Osborne, who was Mr Cameron's political comrade-in-arms and remains his friend, has just cast his net in similar waters. Only, in unburdening himself to the Times newspaper, he has gone even further.Mr Osborne says he would like to ban smoking outright. He also calls for the sugar tax on soft drinks, which he introduced in 2016, to be extended to fruit juice, milkshakes, biscuits and cakes.The former Chancellor didn't mention chocolate oranges but presumably he would like to tax them too, and perhaps ban them altogether. Those of us who enjoy an occasional segment may have to go underground.Both Osborne and Cameron epitomise a species of modern paternalistic Tories who think they know what is best for the rest of us. They tend to be privileged and entitled, and exude a somewhat superior air.When I was young, I had a romantic attachment to the notion of Tory paternalism — as it existed in the 19th century. It seems anachronistic in a democratic nation of independent, grown-up people.In fact, Mr Osborne's proposed outlawing of smoking is not so much paternalistic as fascistic. Smoking is already banned in public indoor spaces. An average packet of cigarettes costs nearly £13.So those who want to smoke face considerable obstacles, and live with the knowledge that the habit could kill them. It's hardly surprising the proportion of adults who smoke has dwindled to less than 14 per cent.Nonetheless, Mr Osborne — who was himself photographed smoking as recently as 2021 — would like to criminalise them. This is not only illiberal. It is also deeply silly. The police, who are unlikely to catch the culprits if your house is burgled, your car stolen or your bank account scammed, would turn their attention to smokers.They might enjoy it, since it would be easier and less dangerous to nab a smoker behind a hedge than apprehend a real criminal. The abysmal clear-up rate of many crimes would fall still further, while smokers would be hunted down.Oh, Mr Osborne, which planet do you inhabit? And by what right, since you call yourself a Tory and Tories are supposed to cherish freedom, do you propose to slap a tax on cakes and orange juice which, eaten or drunk in moderation, are among the small joys of life?In Shakespeare's Twelfth Night Sir Toby Belch asks the puritanical Malvolio: 'Dost thou think that because thou art virtuous, there shall be no more cakes and ale?' The question should now be put to George Osborne.Although, to be fair, he wasn't always so austere. Many years ago, the Sunday Mirror published a photograph of a 22-year-old George Osborne with an arm affectionately wrapped around a self-confessed dominatrix. A line of white powder was allegedly visible on a table, although Osborne has always strenuously denied any allegation that he took cocaine. The young Osborne was very properly wearing a tie.No one doubts that obesity is an increasing scourge in Britain, as in many advanced countries. Being very fat is bad for one's health. It can lead to all sorts of nasty illnesses that could land us in hospital. Obese people have a shorter life expectancy.So I'm in favour of the Government reminding us of the dangers of eating too much of the wrong things, so long as this isn't done in a way that is calculated to terrify and depress us.",
        "The media also have an important role to play. The Mail has recently run pieces about the perils of processed food. Dr Chris van Tulleken embarked on a month-long experiment, getting 80 per cent of his diet from ultra-processed food. He was left aching, tired and angry, and felt he had aged ten years.Education and enlightenment are desirable, but we should beware of the 'nanny state' stepping into our lives and directing us what to do. Unsurprisingly, in his remarks to the Times Mr Osborne asserts with characteristic hauteur that 'anti-nanny state Conservatives' are 'not worth listening to'. He's wrong.The nanny state infantilises us. It doesn't merely seek to curtail our freedoms. It also diminishes our self-reliance. The nanny state wants us to become vassals of the State rather than free-thinking people capable of making our own choices.When he was Chancellor of the Exchequer Mr Osborne became too fat. He was eating and, for all I know, drinking too much. Then, in 2014, he went on a strict diet and lost two stone. Good for him.He did this of his own volition, not because the nanny state had intervened. As far as I know, he isn't endowed with super-human willpower. He just made up his mind. Most people who are too fat can lose weight — if they choose to.If the nanny state blunders about in our lives, telling us what we can and can't do, it is apt to deprive us of our autonomy. We will look to the State to make more and more decisions on our behalf.Can anyone deny that we are already a long way down the road? The role of the State used to be to prevent us from doing harm to one another. Increasingly it is fixated on stopping us from doing harm to ourselves, even when this entails the curtailment of very modest pleasures.So it is that one privileged individual, David Cameron, gets on his high horse over chocolate oranges, while his equally privileged friend, George Osborne, wants to tax cake and orange juice, potentially putting such delights beyond the reach of people a lot less rich than he is.Does it matter what George Osborne thinks, since he makes millions as a banker and is no longer in politics? There is a character called George Osborne in Thackeray's novel Vanity Fair, who is suitably cosseted and supercilious. Perhaps the real George Osborne is as irrelevant to our lives as the fictitious one.He's only 51, though, and could return. Even if he doesn't, there are others coming up behind him, a whole tribe of entitled know-alls who yearn to boss us around while not stinting themselves.Scratch a paternalist Tory who is certain what's best for you, and it's likely you'll find a socialist."
    ]
}