{
    "articleURL": "/wires/reuters/article-12060785/Facing-Real-revenge-mind-huge-mistake--Guardiola.html",
    "content": [
        "By Fernando Kallas",
        "MADRID, May 8 (Reuters) - Manchester City manager Pep Guardiola said his players must avoid falling into the trap of trying to avenge last year's Champions League semi-final defeat to Real Madrid when the teams meet on Tuesday at same stage of tournament.City will play the first leg of their last-four clash against Real in Madrid.Guardiola was visibly upset with a comment by his midfielder Rodri earlier in their press conference at Santiago Bernabeu on Monday, after he said he was looking forward to \"a chance for revenge\" against Real.\"It would be a huge mistake to think we are here for revenge, we are not! We must face it as another opportunity (to reach the final),\" Guardiola told a news conference.\"We are here to get a good result because everything will be decided in Manchester, not here.\"What happened last season happened, period. This is another opportunity, nothing more. We come with the mentality of trying again, knowing that to achieve it, we have to be better.\"The best lesson we can take from last season is that we are not coming here for revenge, but for a good result. And to have the final open for Manchester.\"Real Madrid manager Carlo Ancelotti spoke earlier on Monday about the importance of going into the second leg with a mental edge.",
        "Asked about the comments, Guardiola was once again uneasy, disagreeing with his opposite number.\"Last year we got here with a huge mental edge after winning well the first leg and look what happened,\" Guardiola said.\"Ferland Mendy saved a ball off the goalline and what happened, happened. Those are the details that take you to a final or not.\"There is a cross that maybe we should have made another pass, maybe we should have took better care of the possession; I don't know.\"We have to put in a great performance in both matches, otherwise it will be very difficult.\"After beating Real Madrid 4-3 in a thriller in the first-leg last year in Manchester, City saw the Spanish giants fight back from the brink of elimination to beat them 3-1 after extra time and get to the final.\"When I arrived at Manchester City I thought I would win the Champions League in the first year, then in the next one... and the one after that. And the last one, the same thing. That's my mentality. And here we are, we are here to try again,\" Guardiola said.\"What I wouldn't like is a team that wins the Champions League once and then falls behind in the league or spends ten years falling.",
        "\"No, we have to be stable. We are looking for something like Madrid, Barcelona or Liverpool, to always be there. That is a healthy club. I'm a Barça fan and it took Barça a long time to reach a final. Everything is a process and the importance is stability.\" (Reporting by Fernando Kallas Editing by Toby Davis)"
    ]
}