{
    "articleURL": "/sport/football/article-12046555/Jude-Bellingham-shows-Real-Madrids-shift-signing-Galacticos-Golden-Boy-nominees.html",
    "content": [
        "England star Jude Bellingham is closing on a sensational move to Real MadridIt marks a shift in their transfer policy under Florentino Perez in recent years Instead of signing Galacticos, they are now focused on adding the next big thing Real Madrid's makeover from Ballon d'Or collectors to Golden Boy discoverers has been one of the most remarkable seen in football this century.",
        "There was a time when the closest thing the club had to a chief scout was president Florentino Perez flicking through television channels to see who was playing. The process of identifying the next acquisition often centered on Perez watching the World Cup or the Ballon d'Or ceremony and signing the winners – usually breaking the transfer fee record in the process.Real Madrid's transformation into the club most likely to be ahead of the rest in the pursuit of the next best thing has one principal architect – Juni Calafat.Calafat was raised in Mostoles, Iker Casillas' home town just outside of Madrid. He was a decent six-a-side player but he was far better at spotting talent in others, and not just seeing who was good, but who would keep getting better and make it all the way to the top.He was at the club with a limited South American brief when Madrid missed out on Neymar and was charged with making sure it never happened again.",
        "Neymar had a medical to join Madrid in 2013 but the Santos star ended up at Barcelona because they better navigated a way through the tangled trail of commissions to land the player.President, Perez was peeved and sought revenge by ensuring the next Brazilian boy wonders all ended up at Madrid. Calafat became Real Madrid's head of international football and that was his mission.",
        "Vinicius arrived for 60m with 45m from Flamengo and Calafat also played a big part in the club signing Rodrygo Goes for a similar fee.They were big fees for kids, and Rodrygo had only played 11 games for Santos albeit scoring 10 goals, but it was operation 'don't let the next Neymar slip away' and it has worked.There was another motivation behind the change to transfer policy. The financial crisis had left Madrid struggling to compete with the clubs powered by petrol state wealth. They weren't getting any richer so they had to get smarter.Fede Valverde came through at Peñarol in Uruguay after having stood out in the country's legendary 'baby football' starter matches from 6-years of age. He was spotted by Calafat when he was 19 and he was persuaded to move to a Spanish-speaking country as opposed to England where various big clubs were promising him a fast-track route to the first team.",
        "Not all the deals for youth have worked out. Brazil U-23 international Reinier Jesus is currently out on loan at Girona and not having much more success than he had on loan at Borussia Dortmund. Martin Odegaard and Take Kubo have thrived but they had to leave to do so. But for the rest it's almost a 100 per cent success rate.",
        "This year Madrid signed Felipe Endrick from Palmerias for 60m euros. The 16-year-old will stay in Brazil for the rest of the season. And Calafat's influence has now gone beyond the borders of South America.Every deal Madrid want to close depends to some extent on his ability to win over the player and his family.He has been the man who has maintained lines of communication with Mark Bellingham, the England player's father, and if the deal is closed this summer then his prints will once more be on the triumph.Back in 2005 Bellingham would have been ill-advised to go, as a 19-year-old, to Real Madrid. The club was awash with record breaking signings but couldn't get past the quarter-final stage of the Champions League and was a no-go zone for young talents wanting game time.Things have changed and the 14-times Champions League winners have a young side to take them into the next decade. If Bellingham joins he will be alongside Eduardo Camavinga, Aurelien Tchouameni plus Valverde, Rodrygo and Vinicius. All under 25 and all brought to the club by Calafat, and a revolution in the way Real Madrid sign players."
    ]
}