{
    "articleURL": "/wires/pa/article-12039569/Donald-Trump-molested-40-zillion-hands--woman-tells-civil-trial.html",
    "content": [
        "A woman has told a court that Donald Trump molested her with what seemed like “40 zillion hands” on an airline flight in the late 1970s — years before writer E Jean Carroll says the former president sexually assaulted her at a Manhattan department store.",
        "Jessica Leeds, 81, of Asheville, North Carolina, told jurors at a civil trial arising from Ms Carroll’s lawsuit that Mr Trump grabbed her chest and ran his hand up her skirt as they sat side by side in first class on a New York City-bound jet.After a few seconds, she said, she wriggled free of Mr Trump, told him “I don’t need this”, and stormed to the back of the plane.“There was no conversation. It was like out of the blue. It was like a tussle,” she told the court. “He was trying to kiss me, trying to pull me towards him. He was grabbing my breasts. It was like he had 40 zillion hands. It was like a tussling match between the two of us.”Ms Carroll’s lawyers called Ms Leeds to give evidence in an attempt to show that Mr Trump has a history of assaulting women and that Ms Carroll’s claims were part of a pattern, not a one-off incident. Another woman is also expected to say she was victimised by Mr Trump.His lawyer said the former president has decided against giving evidence, answering the biggest outstanding question about the closely watched case. Mr Trump has given sworn deposition evidence, and excerpts could be played for the jury.",
        "He has repeatedly denied the women’s claims. He contends the allegations are politically motivated attempts to smear his reputation and deny him the White House. He has said Ms Carroll lied to sell books and that she is not his “type”.Mr Trump used similar language in denying Ms Leeds’ allegations, telling supporters at a 2016 rally, “Believe me, she would not be my first choice”.She first went public with her account of the alleged assault in the final weeks of Mr Trump’s 2016 campaign, telling jurors she decided to do so because she was “furious” about his claim at a debate that he had never touched women against their will.Ms Carroll, a former magazine advice columnist, publicly aired her allegations against him in 2019 when she published a memoir. She testified over three days that Mr Trump raped her in the dressing room of Bergdorf Goodman, a luxury department store.Lisa Birnbach, a longtime friend, told the court that an emotional and hyperventilating Ms Carroll telephoned her minutes after her encounter with Mr Trump to report what occurred. She said she told Ms Carroll that she had been raped and urged her to go to the police, but Ms Carroll refused, leading them to argue before Ms Birnbach agreed never to speak of it again.",
        "Ms Leeds said she was in her late 30s, working in sales and sitting on a Braniff Airways flight from Dallas or Atlanta to New York’s LaGuardia Airport, likely in 1979, when a flight attendant invited her to sit in the only empty aisle seat in the first-class cabin, next to Mr Trump.He introduced himself, Ms Leeds said, but she did not know who he was at the time. Working then as a property developer, he had not yet achieved the height of his fame and was still a few years from opening Trump Tower in Manhattan.Ms Leeds said she sat with him for several hours and ate a first-class meal, but that their conversation was otherwise forgettable. Then, she said, “all of a sudden Trump decided to kiss me and grope me”.She said she fought back as he seemed to get more aggressive, pressing his weight into her, jostling her seat and pinning her in it. No passengers intervened, and no employees from the now-defunct airline came to her rescue, she said.“It was when he started putting his hand up my skirt that gave me strength. I managed to wriggle out of my seat and storm back to my seat in coach. I don’t think there was a word or a sound made by either one of us,” she recalled. She said the encounter “seemed like forever, but it probably was just a few seconds”.",
        "After landing in New York, Ms Leeds said she stayed on the plane until everyone else had left to avoid running into Mr Trump again. She said she kept the incident to herself, regarding it as one of the “rigours of travel”.She did not report it to the airline, the police or her boss because, she said, it was an era when “women didn’t complain about things in the workplace”.A few years later, Ms Leeds said she saw Mr Trump at a Manhattan gala with his first wife Ivana, who was pregnant, but did not say anything. Instead, she told jurors it was Mr Trump who piped up and used a crass word in recognising her as the woman “from the airplane”."
    ]
}