{
    "articleURL": "/wires/reuters/article-12040201/Stocks-slide-Fed-mode-shorts-stalk-banks.html",
    "content": [
        "By Tom Westbrook",
        "SINGAPORE, May 3 (Reuters) - Asian stocks fell for a second session in a row on Wednesday, as global investors contended with signs of a softening U.S. economy, and were in full flight from U.S. regional lenders, ahead of an expected U.S. interest rate hike later in the day.Trade was thinned by holidays in China and Japan, though markets in Hong Kong were open and MSCI's broadest index of Asia-Pacific shares outside Japan dropped 0.7%.Overnight, tumbling regional bank stocks dragged the S&amp;amp;P 500 down 1.2% and oil dived more than 5% on fears that shaky bank confidence and signs of weakness in the U.S. job market were harbingers of a looming broader slowdown.Bonds rallied as investors reckoned the Federal Reserve, which sets policy later on Wednesday, will soon be switching from rate hikes to cuts. The dollar, which fell a little, was caught in the crosswinds of falling yields and rising nerves.Gold jumped nearly 2% to a three-week high above $2,000 an ounce.Among banks, PacWest Bancorp, down 27.8%, Western Alliance Bancorp, down 15.1%, and Comerica Inc down 12.4%, were the biggest losers.\"Short sellers, it seems, have gone to town, and as any equity trader will attest, when you know there is a wall of sellers out there, you stand aside,\" said Chris Weston, head of research at brokerage Pepperstone in Melbourne.",
        "After the failures of Silicon Valley Bank and Signature Bank in March, the collapse of First Republic over the weekend has confidence in smaller lenders flagging and investors more broadly bracing for banks to tighten up lending in response.In Europe, where the crisis of confidence forced Credit Suisse into the arms of larger rival UBS six weeks ago, banks are sharply turning off the credit taps, data on Tuesday showed, perhaps making a case for a smaller rate hike this week.\"This reinforces the idea of 25bps from the ECB this week rather than 50bps,\" said NatWest Markets' rates strategist Jan Nevruzi. \"And also plants the seed in our mind that if that is what happened in Europe, it could be much worse here in the U.S.\"EYES ON THE FEDMarkets are all but certain the Federal Reserve will announce a 25 bp hike at 1800 GMT. If that happens, focus will be on whether or how hard Fed Chair Jerome Powell pushes back on investors' expectations for rate cuts by year's end.\"The hike will be a contemplative one that acknowledges heightened two-way risks and narrower path to a soft-landing,\" said Vishnu Varathan, head of economics at Mizuho Bank in Singapore.Currency markets were steady and awaiting direction from the Fed, save for the New Zealand dollar which rose about 0.6% to a three-week high of $0.6242 after strong jobs data fuelled expectations of another rate hike later this month.",
        "The Australian dollar has given back some of the ground gained on Tuesday, following a surprise rate hike from the central bank, and sat at $0.6670.The euro nudged 0.2% higher to $1.1023, while the yen took a breather as Japan entered its 'Golden Week' holiday season, and rose about 0.4% to 136.02 per dollar. Brent crude , which dropped 5% overnight, sat at $75.29 a barrel.Treasuries went untraded owing to the holiday in Tokyo, leaving two-year yields down 16 bps overnight to 3.9737% and 10-year yields at 3.4352%.Investors have a wary eye on the looming U.S. debt ceiling, with lawmakers squabbling and Treasury Secretary Janet Yellen warning the government might run out of money as soon as June 1.\"Either this game is over within a few weeks or we are going to see a suspension of the debt limit until later this year,\" said Rabobank strategist Philip Marey.\"In both cases, we are not likely to see any solution until financial markets start to panic.\"(Editing by Lincoln Feast)"
    ]
}