{
    "articleURL": "/news/article-12038799/Bidens-deployment-U-S-troops-southern-border-facilitate-demise-homeland-security.html",
    "content": [
        "The Biden administration announced it will send 1,500 troops to the southern border as Title 42 is set to expire on May 11 House Homeland Security Committee chair Mark Green blasted the move The military will not be engaged in active 'law enforcement' work during the 90-day deploymentThe chairman of the House Homeland Security Committee is blasting the Biden administration's decision to send 1,500 active duty U.S. service members to the southern border, saying it will not stop the influx of illegal migrants.",
        "The Pentagon confirmed Tuesday that at the request of the Department of Homeland Security, the agency will 'provide a temporary increase of an additional 1,500 military personnel, for 90 days, to supplement CBP efforts at the border.'The Defense Department will deploy the troops for about three months to help out U.S. Custom and Border Patrol agents, but will not be engaged in active 'law enforcement' work.Mark Green, who leads the committee, took issue with the administration sending 1,500 troops to the border to simply conduct 'administrative work.' 'By having our men and women in uniform do administrative work to help move illegal aliens into the interior of the country quicker, President Biden is now using our troops to facilitate the demise of our homeland security, instead of securing our borders,' Green told DailyMail.com Tuesday following the announcement.",
        "'On January 20, 2021, the number of Border Patrol agents didn't change and the CBP-enacted budget has remained the same. What changed was the removal of key policies that promoted law and order and ensured the security of the U.S. homeland,' he continued.'Don't be fooled, Secretary Mayorkas and President Biden deliberately and intentionally created this historic crisis. It is amazing the lengths they will go to avoid implementing the last administration's successful border security policies.'",
        "'The real question remains: why would President Biden be sending the military somewhere that isn't in 'crisis' mode?' questioned Green.The Pentagon said troops will arrive at the southern border 'as soon' as May 10 and will come from a variety of active duty Army units.'DoD personnel will be performing non-law enforcement duties such as ground based detection and monitoring, data entry, and warehouse support. DoD personnel have never, and will not, perform law enforcement activities or interact with migrants or other individuals in DHS custody,' the Department of Homeland Security said in a statement.'This support will free up DHS law enforcement personnel to perform their critical law enforcement missions.'",
        "The administration is preparing for an expected surge of migrants at the border on May 11, the date that Title 42 ends.Title 42 is the COVID-19 pandemic-era policy that helped law enforcement quickly remove illegal migrants at the border.There is a rapidly forming migrant caravan in Mexico, and some have estimated that there are as many as 35,000 asylum seekers waiting to cross over into the interior of the U.S. after May 11. The number of migrants apprehended at the border in March jumped 25 percent over the previous month to 162,000.New data from April reveals that there were 210,000 illegal migrant encounters. The total over the 2023 fiscal year so far is at 1.4 million. ",
        "The administration has said it is preparing to encounter nearly 400,000 migrants each month after Title 42 ends, a huge figure that makes it difficult for border patrol to contain the surge into the interior of the country.Green teamed up with his fellow Republicans last week to unveil what they call the 'strongest immigration bill ever.'We put together the strongest immigration enforcement legislation ever. It deals with [unaccompanied children], it deals with the Flores situation, asylum, E-verify, and of course, the Remain in Mexico policy, as well as visa overstay issues,' House Judiciary Chairman Jim Jordan said last week."
    ]
}