{
    "articleURL": "/tvshowbiz/article-12039419/Ashley-Graham-showcases-curves-cut-ord.html",
    "content": [
        "Ashley Graham wowed in a cut-out co-ord as she stepped out with her husband Justin Ervin in New York City on Tuesday.",
        "The 35-year-old model and her spouse held hands as they crossed one of the city's busy streets, before hunky Justin put on a cheeky display by placing his hand on her derriere.The television personality, who turned heads while wearing a form-hugging dress at the recently-held TIME 100 Gala, wore a black long-sleeve top that featured several cut-out portions across the décolletage. The beauty also donned a matching pair of pants with cut-outs as well as a pair of pattered shoes.",
        "The model accessorized with a stylish blue purse and a pair of jet-black sunglasses, and her gorgeous brunette hair was pulled back into a tight bun.Ervin opted for a light green hoodie and a matching pair of cargo pants that were contrasted with beige high-top boots and a cream-colored beanie.Graham started off her Met Gala videos by showing off her eye-catching outfit, a dual-tone pink-and-black dress, that she wore during the event.The presenter also accessorized with several pieces of jewelry that gave her look a bit of extra shine.The influencer's hair had been cut into a long bob and many locks had been styled into small curls. Her outfit had to be adjusted as she left her hotel, and she was helped by a pair of assistants in one of her clips.",
        "Graham went on to take several videos inside of the event's main area, and she showed off her sparkling earrings in her first clip.The model also included a video of Doja Cat lapping up water from a glass in a very feline-like manner.",
        "The Say So singer later struck a pose alongside Bad Bunny and Cardi B in another clip.Graham then posted a video of Lizzo striking a high note and entertaining the evening's guests.The model finished off her set of clips by spending time with Nigerian singer Tems.She also shared several photos of her that had been taken during the star-studded function."
    ]
}