{
    "articleURL": "/wires/aap/article-12058357/Reds-aim-buck-history-cement-Super-finals-spot.html",
    "content": [
        "The Queensland Reds will likely need to end their horrific New Zealand record to sneak into the Super Rugby Pacific finals after another costly loss exposed their tough run home.",
        "The Reds surrendered sixth spot to rivals NSW Waratahs in a 32-24 loss in Townsville on Saturday.It dropped them to seventh with a 4-6 record, just one win (four points) clear of ninth-placed Melbourne in what's shaping as a five-horse race for the last three finals spots.The Reds play the unbeaten Chiefs in Taranaki on Friday before hosting the Blues at Suncorp Stadium and finishing the regular season with trips to the Highlanders and Fijian Drua.The Reds have never won in New Zealand since Brad Thorn took over in 2018, with just two victories in total against their Kiwi rivals in that time.The Drua have also proved a lethal team on home soil, beating the Crusaders and Hurricanes already this season.Thorn won't coach on next season and has long coveted success in his native country.The drought has continued this year in two home losses to New Zealand sides.But the Reds have also lost to Australian rivals the Brumbies, Melbourne Rebels and Waratahs in somewhat of a fall from grace for the 2021 Super Rugby AU champions.\"We've put ourselves in a tricky position; it's going to be a tough road,\" Reds lock Angus Blyth said.\"We want to make him (Thorn) proud and get some good wins; the season hasn't gone how we wanted it when we all sat down at the start of the season.\"",
        "Scores were locked 17-17 at halftime against the Waratahs but the Reds' only second-half points came once the final siren had sounded, despite them creating numerous opportunities.\"We left a lot of points out there; I think it was 11 22-metre entries and we converted three of them,\" Blyth said.\"If we get that right it goes a long way to winning\"We get a bit too excited, maybe need to take a tackle, get around and play the next phase.\"Try to be more patient and know we can get the points in the next phase, or the one after that.\"Piloted by Damian McKenzie, the Chiefs have won all 10 games and collected five bonus points to sit nine points clear of the Brumbies on top of table.REDS' RUN HOMEv Chiefs (10-0) awayv Blues (7-3) homev Highlanders (3-7) awayv Drua (4-6) away"
    ]
}