{
    "articleURL": "/news/article-12041693/Tory-MP-launches-bid-ministers-power-overturn-Sadiq-Khans-hated-ULEZ-expansion.html",
    "content": [
        "The ex-Cabinet minister introduces a Ten-Minute Rule Bill to the CommonsFormer Cabinet minister Theresa Villiers today launched a bid to hand the Government new powers to scrap London mayor Sadiq Khan's 'anti-car policies'.",
        "The Chipping Barnet MP introduced a Ten-Minute Rule Bill to the House of Commons this afternoon seeking to give ministers the ability to overturn the expansion of the capital's Ultra Low Emission Zone (ULEZ).Mr Khan's proposal to expand ULEZ to the whole of the London from late August - which will see a £12.50 daily fee for vehicles not meeting minimum requirements - has been met with widespread opposition.Ms Villiers' Bill looks to amend the 1999 Greater London Authority Act so Transport Secretary Mark Harper can review and overturn decisions made by the capital's mayor relating to transport and air quality, such as ULEZ.The proposed legislation would also allow Mr Harper to review other controversial policies being pursued in London, such as the growth of Low Traffic Neighbourhoods (LTNs) and 20mph speed limits on main roads.",
        "The former Environment Secretary told the Commons: 'In my 18 years as MP for Chipping Barnet, almost nothing has provoked such strong opposition as the Mayor of London's plan to expand ULEZ.'It comes up on almost every doorstep and at almost every meeting. People stop me in the street to tell me how strongly they feel about this.'That is why I am bringing forward a Bill to give the Government power to overrule Mayor Khan and stop ULEZ expansion.",
        "'Of course, we need to continue to improve air quality in London but this is the wrong scheme at the wrong time.'Ms Villiers warned the ULEZ expansion - which she dubbed a 'paywall' around the capital - would 'devastate' local town centres in outer London.She also told MPs it could be a 'stepping stone' to pay per mile road charging in the capital.  There has been outrage at Mr Khan for pushing ahead with the ULEZ expansion to London's outer boroughs during the cost-of-living crisis.Fears have been expressed about the financial hit for emergency workers - such as nurses driving to hospitals for night shifts - as well tradespeople who need to take vans into the capital. 'The ULEZ has been tolerated in inner London because it has one of the most extensive public transport systems in the world. That is just not the case in the suburbs,' Ms Villiers said.'The reality is that ULEZ expansion to the Greater London boundary leaves my constituents facing the cost of buying a new vehicle which many cannot afford, or paying an annual bill of as much as £4,500 per year just to get around their own neighbourhood.'Ten-Minute Rule Bills are often put forward by backbench MPs to highlight a concern or issue, with Ms Villiers' Bill unlikely to become law in its current form.",
        "Mr Khan's spokeswoman said it was 'disappointing that some backbench MPs are wasting parliamentary time playing politics'.'The mayor has been clear that the decision to expand the ultra low emission zone London-wide was not an easy one, but necessary to tackle toxic air pollution and the climate crisis,' she said.'It is disappointing that some backbench MPs are wasting parliamentary time playing politics. Both No10 and the Transport Secretary have been clear this is a matter for the elected mayor.'With around 4,000 Londoners dying prematurely each year due to air pollution, there is no time for inaction and it's people in outer London, particularly the poorest households, who suffer the most from the damaging health effects.'Nine out of 10 cars in outer London are already ULEZ compliant. For those with the most polluting vehicles the mayor has launched his £110 million vehicle scrappage scheme.'"
    ]
}