{
    "articleURL": "/wires/aap/article-12052719/Bets-value-investing-fashion.html",
    "content": [
        "Amid a volatile share market dogged by high inflation and interest rates, one boutique investment firm is counting on the return of value investments - and is particularly bullish on the controversial energy sector.",
        "Sydney-based investment manager Maple-Brown Abbott believes value investing will take over growth investing after a 15-year-long stint in its shadow.\"The environment we've known for the last 15 to 20 years of ever-declining interest rates and increasing asset prices is over and done,\" chief investment officer Garth Rossler told reporters in Sydney this week.As an investment strategy, value investing involves buying stocks that appear to be trading for less and are underestimated by the market.Long-term investment in a business is favoured by value investors who believe the market overreacts to good and bad news.\"We would much prefer to buy an out-of-favour business that's a quality business,\" Mr Rossler said.Growth investment on the other hand typically involves buying stocks in small companies whose earnings are expected to increase at an above-average rate.Mr Rossler says good performances during the COVID-19 pandemic in the value investment space have put the strategy on the front foot, especially in the energy sector at a time when Australia is pushing to decarbonise.Dougal Maple-Brown, head of value equities at the firm, says the price of oil will be crucial for value investments.Australian energy stocks have underperformed the global energy stocks, which have underperformed the price of oil.\"There's not going to be another coal mine built or another oil field drilled in Australia so supply is going to fall,\" he said.",
        "\"A sector which is supply constrained, with no new investments, won't be there in 50 years, no doubt about it, but it doesn't mean you can't have a couple of good decades.\"While environmental, social and governance principles guide the firm, excluding companies based on carbon targets isn't an effective method of measuring the value of stocks, Maple-Brown Abbott portfolio manager Emma Pringle said.\"It's true that some companies will not set a target but typically they've got a net-zero ambition ... there's just no technology pathway to do it,\" she said.\"They are very clear that they won't hit their target depending on how they can get there, and that to me is much more believable and I'm happy to work with them.\"Ms Pringle pointed to AGL Energy, saying while it's labelled Australia's top carbon emitter the company is also working on becoming the biggest generator of privately owned renewable energy.\"If you just walk away from AGL, it can't be part of that transition,\" she said.\"And it's going to be hard to transition this industry that most needs it.\"On the other hand, some financial analysts believe now is the time for more growth investment.\"If anything, there's been a great rotation back to growth,\" Betashares analyst David Bassanese told AAP.",
        "The influence of central banks on increasing bond yields may have affected growth investment in the last month, but Mr Bassanese is certainly the trend has been to see a bounce back in growth.Regardless, Mr Rossler says there are limits to growth investment in an economy predicted to get difficult.\"Apple is trading at 30 times its earnings - those are extraordinary numbers but where do you go from there?\" he said.\"The only investment life the average manager has is that interest rates are declining and tech stocks go up but we're all looking at an economy where we think there's gonna be tough times ahead.\"In many ways, it looks like we're back to the races again.\""
    ]
}