{
    "articleURL": "/wires/afp/article-12043377/Chennai-Lucknow-clash-washed-Dhoni-teasing-fans-IPL-swansong.html",
    "content": [
        "Former Indian skipper M.S. Dhoni on Wednesday teased fans about whether this IPL would be his last, before the T20 tournament witnessed its first washout of the season with the match between Chennai Super Kings and Lucknow Super Giants called off.",
        "Hosts Lucknow were 125-7 in 19.2 overs when rain interrupted play in the north Indian city. After an hour and 40 minutes of waiting, the officials decided the points would be shared between the teams, abandoning the game.Earlier, Dhoni, 41, got the crowd going when he gave the television presenter a tongue-in-cheek answer regarding whether he was retiring from the tournament.The ongoing season is expected to be Dhoni's last as a player, but when cricketer-turned-commentator Danny Morrison asked the India legend whether he was enjoying his \"swansong tour\", Dhoni replied: \"Well, you have decided it's my last.\"The reply made the fans roar and Morrison said: \"I love it, he is going to come back. He is coming back to play next year.\"The Indian wicketkeeper-batsman, who has led Chennai to four IPL titles, is getting a rousing reception at every venue this year, with fans turning up in Chennai's yellow to cheer him on.Dhoni had last month thanked the packed crowd at Kolkata's Eden Gardens, saying: \"They are trying to give me a farewell.\"Dhoni, who flourished in the role of an innings finisher at his peak, led India to two World Cup titles, including T20's inaugural showpiece event in 2007.He carried his batting form and acumen for leadership to the IPL, enjoying a fan base of millions, who fondly call him \"Thala\", or \"leader\" in the Tamil language.",
        "In Lucknow, Ayush Badoni was unbeaten on 59 after he lifted the hosts from a precarious 44-5 in the absence of regular skipper K.L. Rahul, who was injured in the previous match.Chennai spinner Moeen Ali returned impressive figures of 2-13 from his four overs."
    ]
}