{
    "articleURL": "/news/article-12060229/PICTURED-Inside-God-Trans-exhibit-ultra-woke-Manhattan-church-sparked-fury.html",
    "content": [
        "It features paintings and video based on Sacrifice, Identity and CommunionThe exhibit is hosted at Church of St. Paul the Apostle in Manhattan, New YorkThe church is known for progressive beliefs including a 'gay-friendly' massA notoriously liberal Catholic church in New York has sparked a backlash with a 'God is Trans' art exhibit.",
        "The Church of St. Paul the Apostle in Manhattan is displaying a show called 'God is Trans: A Queer Spiritual Journey.'The exhibit has raised some eyebrows among its Roman Catholic parishioners, with some balking at the words 'there is no devil; just past selves.' It is the creation of artist Adah Unachukwu, which attempts to show how faith and gender identity intersect.It features somewhat abstract colorful paintings which appear to show where the personal meet the spiritual, with videos of the artist among more traditional holy imagery. ",
        "'God is Trans maps the queer spiritual journey by three significant points: Sacrifice, Identity and Communion,' the piece begins.'The painting Sacrifice and its complementary act in the film speak to the need to shed an old life and personhood in order to be able to focus on your spiritual need. There is no devil, just past selves.''Identity is the most impactful part of the exhibition,' the display states. 'What does holiness look like? What does your god look like? Are those two portrayals that can be merged?'The final section of the exhibit is Communion which 'rounds out the spiritual journey, by placing God and the mortal on the same plane to speak to one another. This part of the installation is about a spiritual home and the ways we can achieve this home in our everyday lives.'",
        "The display has reportedly divided church-goers, with some of the congregation claiming they were having an 'agenda' forced on them. 'The church should not be promoting this,' one parishioner told the New York Post. 'I understand there are transgender people. I pray for all people but enough is enough.' The churchgoer told the outlet that a priest refused to provide an explanation to someone questioning the display. 'It seems like they are trying to force the agenda on others,' they added. 'You can't put this out on the altar and then hide. That's what gets the church in trouble.' ",
        "The Catholic Church in the United States numbers over 70 million members, and is organized in 33 Provinces, each led by an archbishop. The Provinces are then further divided into 195 dioceses, each led by a bishop. This means that the actual experience of LGBTQ+ parishioners can vary widely depending on the parish. There is no official policy regarding transgender individuals in the Catechism of the Catholic Church, though doctrinal teachings clearly equate birth anatomy with gender. In 2019, the Vatican said in an official document that the 'right to choose one's gender' is in 'direct contradiction of the model of marriage as being between one man and one woman.' The Church of St. Paul the Apostle is well known for its embrace of the LGBTQ+ community in the city. ",
        "According to the New York Times, it is one of the city's many outwardly gay-friendly parishes, with worshippers traveling 'from all corners of the city to attend what it markets as its gay-friendly 5pm Mass.'",
        "One churchgoer said he thinks it is 'wonderful' having the exhibit in the church. Bill O’Connor, 79, told the Post: 'The queer community has been accepted here for a long time now. It’s wonderful having this here and a wonderful church. This is a place of welcome. It’s also a place to question one’s own path.'Fellow worshipper Cherri Ghosh, 80, said: 'I don't understand the art, but this church is very liberal, which is why I love this church. They are really in the present when others are not.'The Archdiocese of New York and Unachukwu have not yet responded to requests for comment. "
    ]
}