{
    "articleURL": "/wires/aap/article-12043279/Why-electric-trucks-cut-pollution-cars.html",
    "content": [
        "Putting more electric trucks on the road would cut transport pollution faster than electric cars could and governments should introduce grants and \"zero-emission zones\" to accelerate their adoption, according to a new report.",
        "The study, from logistics firm Adiona Tech, also found replacing 10 delivery trucks with electric models would have the same impact as putting 56 electric cars on the road.The findings come as freight and industry transport bodies called on the federal government to develop a dedicated policy to support electric trucks after its National Electric Vehicle Strategy failed to address larger modes of transport.Adiona Tech chief executive Richard Savoie said electrifying the largest vehicles on Australian roads should be considered \"low-hanging fruit\" by the government as swapping diesel trucks with electric models would significantly cut pollution.\"Australia is already behind every other developed nation on electric vehicles and while we're playing catch-up we can't forget the biggest emitters on the road: freight and transport vehicles,\" he said.\"Australia must prioritise the electrification of these vehicles that are on the road most, travel the longest distances and are the least fuel-efficient.\"The Connected Thinking report found 200 lithium batteries could cut more emissions when used to power light commercial vehicles, such as vans, than passenger cars, and just 10 electric delivery trucks would have the impact of 56 electric cars based on distance travelled, fuel efficiency and emissions.Large, articulated trucks also created 15 per cent of transport emissions even though they made up one per cent of the vehicle fleet, it found, as they travelled six times as far as passenger cars, used 40 times more fuel, and produced 50 times more pollution.",
        "The report called for new government grants to help businesses electrify truck fleets and for the introduction of \"low or zero-emissions zones\" where petrol and diesel vehicles would face restrictions or charges.\"The national EV strategy is a start but we need low-emissions zones yesterday,\" Mr Savoie said.The report was released on the same day the Electric Vehicle Council, Australian Trucking Association, Heavy Vehicle Industry Association and Australian Hydrogen Council joined a call for the development of a \"national zero-emission truck strategy\".The group said a policy should address regulatory barriers to electric trucks, including width and axle mass limits, invest in electric and hydrogen refuelling stations, and include upskilling plans for the transport workforce.Australian Trucking Association future transport manager Samuel Marks said financial incentives in the US had seen electric trucks approach price parity with diesel trucks and Australia needed to follow its lead.\"Australia has a legislated net zero-emissions target but needs a strategy for zero emissions trucks,\" he said.\"We need to move from one-off pilot projects to a strategy that enables all trucking operators to plan with certainty for low and zero-emissions transport.\"Electric truck projects include a $20 million Hume Hydrogen Highway initiative between the Victoria and NSW governments and a $20 million federal government investment in an electric truck hub in Team Global Express' Sydney depot."
    ]
}