{
    "articleURL": "/sport/football/article-12053753/Peter-Schmeichel-savages-Man-Uniteds-Antony-petulant-clash-Brightons-Lewis-Dunk.html",
    "content": [
        "Peter Schmeichel has told Antony he has to 'behave himself' following clashHe made a rash tackle on Alexis Mac Allister, and was confronted by Lewis Dunk The former Man United goalkeeper said Erik ten Hag would be 'disappointed' Peter Schmeichel has hit out at Antony for his rash tackle against Brighton on Thursday night, and his involvement in the subsequent brawl with Lewis Dunk.",
        "Alexis Mac Allister struck a last-gasp penalty to give the hosts a 1-0 win over Manchester United on Thursday night, to dent Erik ten Hag's side in their pursuit of a strong finish to their domestic season. Brazilian Antony was shown a yellow card for kicking out at Mac Allister with 20 minutes remaining at the AmEx, and the incident caused a brawl which also saw Dunk booked for confronting the striker.At the time of the incident, pundit Alan Smith said the tackle was 'silly' and that Antony only avoided being sent off because it was not higher on the Argentinian.And former Man United goalkeeper Schmeichel also hit out at Antony post-match when talking to Premier League Productions.",
        "The Dane said: ‘We had the incident with Antony where he went absolutely berserk and got a yellow card when he stood up to Lewis Dunk.‘That was a clear foul on him, and it wasn’t given because it was the line we were playing to today, and that’s fair enough.‘It’s a foul and the linesman is only 10 yards away.‘But I don’t like the reaction, this is crazy and he is a lucky, lucky boy staying on the pitch because that’s a red card, there’s no doubt about it.",
        "‘You cannot do that. And then he reacts like this. You cannot do that as a Man Utd player, you have to behave yourself. This is revenge, you don’t do that, you cannot do that in a game of football.‘Ten Hag is very very disappointed, and even more so than the game being lost with one of his players reacting like that.’Speaking to reporters after the game, ten Hag said he was advising Antony to 'stay focused on your game', rather than being distracted by opponents. ",
        "But the Dutchman also defended the Brazilian's mentality, declaring: ‘Passion is a strength.'You need passion and desire to win your battles in the game.'After Thursday night's late drama, in which the Seagulls avenged their FA Cup semi-final defeat, Man United have a quick turnaround before Sunday evening's trip to West Ham. Hammers boss David Moyes - a former Man United manager - is hoping to welcome back three key players - Declan Rice, Tomas Soucek and Nayef Aguerd - for the clash at the London Stadium. "
    ]
}