{
    "articleURL": "/sport/football/article-12054523/Man-Citys-Nathan-Ake-injured-just-three-days-Real-Madrid-clash.html",
    "content": [
        "Nathan Ake went down off the ball in the early stages of the second half After receiving treatment he was taken off and replaced by Kyle WalkerAke's injury comes just three days before City travel to play Real Madrid Nathan Ake handed Manchester City an injury scare just three days before their Champions League semi-final showdown with Real Madrid as he limped off in the second half of their league clash with Leeds.",
        "After an ideal first half for City that saw Ilkay Gundogan score twice to put them into a commanding lead, Ake went down off the ball in the 54th minute and needed treatment.The Dutch defender looked to be holding his left calf and could not continue, with Kyle Walker coming on to replace him.Ake's setback will be a concern for Pep Guardiola, who has been heavily reliant on the versatile defender in the second half of the season.Following the departure of Joao Cancelo on loan to Bayern Munich in January, Ake has stepped up to prove his class as a full back, while also being able to slot into central defence.",
        "He has established himself in Guardiola's first team after being largely overlooked in previous seasons, and would have been expected to start in Madrid on Tuesday night.However, the Spanish coach may now be forced into a rethink as it looked to be a muscle injury for Ake, and there is a very quick turnaround in between games.The 28-year-old only returned from a hamstring injury in midweek against West Ham, having missed three games with the issue.City won all three of the games Ake was unavailable for, including their crucial top-of-the-table clash with Arsenal and their FA Cup semi-final against Sheffield United.",
        "A lengthy absence for Ake would be a significant blow, though, with Guardiola's men still chasing a historic treble and facing a daunting fixture list over the coming weeks. "
    ]
}