{
    "articleURL": "/sport/football/article-12056941/Erik-ten-Hag-heaps-praise-Man-United-players-dealing-fixture-congestion-really-well.html",
    "content": [
        "Erik ten Hag says Manchester United have been at a disadvantage this seasonThe Red Devils played their 57th match this season against West Ham on SundayThey lost to the Hammers at the London Stadium after a mistake by David De GeaErik ten Hag insisted his Manchester United players remain 'physically and mentally very strong' amid a hectic fixture schedule - before watching them lose 1-0 at West Ham. ",
        "The clash at the London Stadium was United's 57th match of a hugely draining and demanding campaign and Ten Hag insisted his team have done 'really well' despite being at a 'big disadvantage'. Unfortunately, United then turned in a poor performance at the London Stadium as goalkeeper David de Gea fumbled in a Said Benrahma shot to split the teams. It was United's second defeat of the week after they went down 1-0 at Brighton on Thursday night.'It has already had an impact on the whole season and we are doing quite well in the schedule – not quite well, but really well,' the Dutchman said speaking to the club's official website.",
        "'We have a big disadvantage against others. West Ham United is a team that, I think, has a worse schedule than we [do] but we showed all season already that we can deal with that. 'We are physically and mentally very strong.'A whirlwind season has seen United win their first trophy in six years after beating Newcastle in the Carabao Cup final in February. But Ten Hag's side were dumped out of the Europa League in the quarter-final stage after a 3-0 second-leg defeat to Sevilla last month. They still, however, stand a chance of winning a second domestic trophy when they take on rivals Manchester City in the FA Cup final in June. ",
        "The result at West Ham keeps Liverpool in with a shout of pinching United's Champions League place for next season.Jurgen Klopp's side, who beat Brentford on Saturday, are just a point behind, though United do retain a game in hand.  "
    ]
}