{
    "articleURL": "/wires/pa/article-12047385/Six-year-old-stands-Charles-King-s-former-school-holds-mock-coronation.html",
    "content": [
        "The King’s former school is staging its own version of the coronation a day before the real thing, with a six-year-old playing the part of Charles.",
        "Pupils at Gordonstoun in Moray are holding a mock ceremony to help pupils learn more about the coronation.Hamish Montgomery is standing in for Charles while Jessica Cook, seven, will play the part of the Queen Consort.",
        "They will travel by pony and trap down the school’s silent walk to its historic Michael’s Kirk, where the King worshipped while at school.Asked if he had any advice for Charles ahead of the coronation, Hamish said: “Have a bath,” while Jessica added: “And porridge for breakfast.”The stars of the show, who will be kitted out with velvet gowns and crowns, said they are very excited about the performance.",
        "Gordonstoun principal Lisa Kerr said: “Our junior school coronation is the first of many special activities at Gordonstoun to mark the coronation of King Charles III.“There is an air of excitement around the campus, our students are inspired by the example our King sets and they can see in him, many of the qualities being nurtured in themselves, via our broad curriculum.“Experiencing a mini-coronation, with the horse and cart, flag waving and ceremony, is a wonderful way for our youngest pupils to gain an understanding of this weekend’s historic event.“King Charles was a keen actor during his time at Gordonstoun, taking lead roles in many school performances, and I think the enactment is a really lovely way to acknowledge that.”",
        "Charles spent five years boarding at the school, which his father, Prince Philip, the late Duke of Edinburgh, and brothers Andrew and Edward also attended.He has said the school instilled in him self-discipline and a sense of responsibility.Gordonstoun said that during his school days, Charles was a member of the coastguard and was a talented musician and actor, who played the trumpet, cello and sang in the choir.",
        "He also regularly won the lead part in school plays, playing Macbeth and the Pirate King in Pirates Of Penzance.He was a school guardian (head boy) in his final year as well as being a colour bearer (prefect) and head of his boarding house.The Princess Royal’s two children, Zara and Peter, were also students at the independent school."
    ]
}