{
    "articleURL": "/wires/reuters/article-12052003/EXPLAINER-Title-42-ending-U-S-Mexico-border-What-happens-now.html",
    "content": [
        "By Ted Hesson",
        "WASHINGTON, May 5 (Reuters) - The United States is getting ready to lift COVID-19 restrictions that have blocked migrants caught at the U.S.-Mexico border from seeking asylum since 2020, a major policy shift with humanitarian and political implications.WHAT IS TITLE 42?The COVID restrictions, known as Title 42, were first implemented under Republican then-President Donald Trump in March 2020 at the beginning of the pandemic. At the time, the U.S. Centers for Disease Control and Prevention (CDC) said the order was needed to stem the spread of the coronavirus in crowded detention settings.Title 42 allowed border agents to rapidly expel many migrants to Mexico, but some public health experts, Democrats and advocates criticized its health justification, saying it was part of Trump's goal of curbing legal and illegal immigration.President Joe Biden, a Democrat, took office in 2021 vowing to reverse Trump's restrictive approach, but kept Title 42 in place and expanded it as his administration grappled with record migrant arrests at the U.S.-Mexico border.Since its inception, migrants have been expelled more than 2.7 million times under Title 42, although the total includes many repeat crossers and Mexico has generally only accepted certain nationalities.WHAT IS HAPPENING THIS MONTH?The Biden administration intends to lift Title 42 next Thursday when the U.S. COVID public health emergency ends.",
        "Migrants caught crossing the border will again be able to request asylum, a process that can take years to resolve.U.S. border officials are preparing for a possible increase in illegal crossings, the result of pent-up demand and the perception among migrants that they will be allowed in.The numbers are already climbing. In April, the U.S. Border Patrol apprehended some 183,000 migrants, according to preliminary data provided by Brandon Judd, president of the National Border Patrol Council, a 13 percent increase from March.More than 19,000 migrants are currently being held in U.S. Customs and Border Protection facilities, exceeding capacity by 200 percent, according to Judd.WHAT IS THE PLAN ONCE TITLE 42 IS GONE?To deter would-be migrants after the order is lifted, the Biden administration plans to issue a new regulation. It would deny asylum to most migrants caught crossing if they passed through another country en route to the U.S. without seeking protection or failed to use other legal pathways, which Biden has expanded.U.S. authorities aim to process migrants in days and swiftly deport them if they fail an initial asylum screening.Nearly 500 U.S. Citizenship and Immigration Services (USCIS) personnel will temporarily be assigned to help with the interviews and the Pentagon will send 1,500 troops to support the Border Patrol on a temporary basis.",
        "The new Biden regulation toughening access to asylum is expected to face legal challenges. The administration may also struggle to hold migrants at the border and quickly deport them without additional funds from Congress.COULD U.S. COURTS OR CONGRESS KEEP TITLE 42 IN PLACE?The CDC tried in April 2022 to end Title 42, saying it was no longer needed to limit the spread of COVID-19 in light of vaccines and other medical advances.But a federal judge in Louisiana blocked the termination after a challenge brought by two dozen U.S. states with Republican attorneys general, who argued increased migration would saddle their states with costs.The U.S. Supreme Court removed a different Title 42 case from their argument calendar in February after the administration told them the order would end along with the COVID emergency. It is unknown whether legal battles could resume after May 11.Separately, a bipartisan group of U.S. senators are trying to pass a bill that would grant immigration authorities the power to expel migrants back to Mexico for another two years, though its prospects for passage are unclear.HOW ARE U.S. CITIES RESPONDING?U.S. border cities are bracing for a possible rise in migrants when Title 42 ends.Migrant apprehensions in Texas' Rio Grande Valley have increased in recent weeks as more Venezuelans are crossing illegally there, according to the U.S. Border Patrol, and the spike in arrivals is straining shelters.",
        "The Texas cities of Brownsville, El Paso and Laredo have issued emergency declarations.Texas Governor Greg Abbott this week resumed a campaign to bus migrants to Democratic-led cities. The Republican governor blames Biden for the rise in crossings and seeks to lessen the burden on border cities.New York City Mayor Eric Adams, a Democrat whose city has received thousands of migrants on buses from Texas, has called on the federal government to provide more funding for cities welcoming migrants and to expedite migrant work permits. (Reporting by Ted Hesson in Washington; Additional reporting by Jorge Garcia in Brownsville, Texas; Editing by Mica Rosenberg and Jonathan Oatis)"
    ]
}