{
    "articleURL": "/sport/football/article-12056127/Tottenham-chief-Daniel-Levy-prepared-pay-Xabi-Alonsos-release-clause-Bayer-Leverkusen.html",
    "content": [
        "Tottenham reportedly identified Xabi Alonso as their No 1 managerial targetBut the club will need to pay compensation to secure the Spaniard's servicesAlonso has led Bayer Leverkusen to the Europa League semi-finals this season Tottenham have moved one step closer to making Bayer Leverkusen boss Xabi Alonso their next permanent manager.",
        "The former Liverpool star has been reported as a leading contender to take over as the the club's next permanent head coach since the departure of Antonio Conte in March.But according to a report from the Mirror, Spurs have earmarked the 41-year-old as their top target and are prepared to pay for the Spaniard's release from the Bundesliga club.The report also suggests that the package required would be the value of one year of Alonso's salary at Leverkusen.However, despite the wheels to appoint Alonso seemingly being in motion, the Champions League-winning former midfielder has remained tight-lipped when discussing a potential return to the Premier League.",
        "When asked about taking over at the Tottenham Hotspur Stadium earlier this month, Alonso appeared to commit his future at Die Werkself.'I've been in football for many years, rumours are normal but we still have a lot to achieve,' Alonso said.'That's why my head is 100 per cent here for the last few months. And my head is also 100 per cent here for next season.'After hanging up his boots in 2017 following three years with Bayern Munich, Alonso got his first start in management with Real Sociedad's reserve team, the same side he began his playing career with.Alonso took over at Leverkusen in October, with the club sitting in the relegation zone after winning just one of their first eight league fixtures.",
        "Since then the Spaniard has presided over a remarkable turnaround at the club, with Leverkusen currently sitting sixth in German top flight, with qualification to next season's Europa Conference League secured if they can maintain their position with three games remaining.Leverkusen are also in the semi-finals of the Europa League, with a trip to Jose Mourinho's Roma in the first leg awaiting them on Thursday. "
    ]
}