{
    "articleURL": "/news/article-12041261/George-Osborne-calls-ban-smoking-taxes-orange-juice-boost-Brits-health.html",
    "content": [
        "The ex-Chancellor is suggesting new health measures to cut obesity and cancer Rishi Sunak today rejected George Osborne's call for a ban on smoking and taxes on orange juice in a bid to boost Britons' health.",
        "The former Chancellor urged new action to cut obesity and cancer by suggesting Britain should look at 'the long-term legality of smoking'.He proposed the UK should copy New Zealand in gradually raising the legal age for purchasing tobacco.Mr Osborne also outlined how the sugar tax on soft drinks should be expanded to include fruit juices.But Downing Street said there were 'no plans' to follow Mr Osborne's advice and pointed to how the inclusion of fruit juices under the sugar tax had been rejected when the levy was first introduced.",
        "'That issue was considered as part of the levy, there was a consultation document that set out further detail on why we're not looking to take that forward,' the Prime Minister's official spokesman said.No10 also dismissed the prospect of a complete ban on smoking and said such a move would represent 'major departure from the policy pursued over recent decades, which has emphasised personal responsibility'.'It's worth emphasising smoking rates in England are at an all-time low - currently 13 per cent, down from 20 per cent in 2010,' the spokesman added.No10 said the Government remained committed to England becoming 'smoke free' - defined as less than 5% of the adult population smoking - by 2030.The PM's press secretary revealed Mr Sunak himself had never smoked.",
        "It came after Mr Osborne had claimed Tory critics of fresh Government intervention over public health matters were 'not worth listening to'.The ex-Chancellor offered his support to Britain copying New Zealand's phased-in smoking ban - an annually rising legal smoking age that will eventually introduce a complete ban on smoking. Mr Osborne told The Times: 'You basically phase it out. Of course you're going to have lots of problems with illegal smoking, but you have lots of problems with other illegal activities.'It doesn't mean you shouldn't try and ban them and police them and make it less readily available. I thought that was a compelling public health intervention.'In his final Budget as Chancellor in March 2016, Mr Osborne announced the introduction of the sugar tax on soft drinks.He said it should now be expanded to cover fruit juice and milkshakes, as well as biscuits and cakes.Mr Osborne admitted such a move would have been 'too controversial' while he was in charge of the Treasury because 'most people think a glass of orange juice every day is a good thing'.The sugar tax was fiercely opposed by some Tory MPs as an example of 'nanny statism at its worst'.But Mr Osborne insisted that 'anti-nanny state Conservatives' are 'not worth listening to'.",
        "He compared possible new health measures to the smoking ban in pubs and laws on wearing seatbelts introduced by past governments.'They’ve all been opposed at the time by vociferous lobbies,' the former Chancellor added.'It’s taken quite a lot of political courage by the different administrations to get them done.'But no one now would reintroduce smoking in pubs and no one now would say you shouldn’t wear a seatbelt.'Former minister Lord Bethell said he agreed with Mr Osborne that it was 'time to phase out smoking in the UK'.The Tory peer criticised the Government for not implementing the recommendations of an independent review by Dr Javed Khan.His report warned, without further action, England will miss the Government's smoke free 2030 target by at least seven years, and the poorest areas in society will not meet it until 2044.'What a shame the Govt hasn’t introduced the Khan Review recommendations,' Lord Bethell posted on Twitter.'It should be doubling down instead of backing off.'"
    ]
}