{
    "articleURL": "/wires/afp/article-12045785/Russia-Ukraine-report-drone-attacks-Zelensky-visits-ICC.html",
    "content": [
        "Moscow on Thursday accused the US of masterminding a drone attack on the Kremlin, a charge denied by Washington, and said Ukrainian sabotage on Russian territory had reached \"unprecedented momentum\".",
        "Moscow said President Vladimir Putin was working from the Kremlin the day after the attack, which it said was a Ukrainian attempt to kill him.\"Decisions on such attacks are not made in Kyiv, but in Washington,\" Kremlin spokesman Dmitry Peskov said.\"Kyiv only does what it is told to do... Washington should understand clearly that we know this,\" he said.",
        "Ukraine has denied responsibility, with President Volodymyr Zelensky saying \"We do not attack Moscow or Putin.\"The United States has denied any involvement.\"Peskov is just lying there, pure and simple,\" John Kirby, spokesman for the White House National Security Council, said on MSNBC.Throughout its more than year-long offensive in Ukraine, Moscow has maintained that Kyiv is taking orders from the United States -- accusing the West of leading a war against Russia by proxy.Another Ukraine ally, EU foreign policy chief Josep Borrell, warned Moscow \"not to use this alleged attack as an excuse\" to escalate the conflict.- 'Unprecedented' sabotage -The Kremlin attack came as Russia prepares to mark one of its main holidays on May 9 -- celebrating the Soviet victory over the Nazis in World War II -- with a traditional military parade in Red Square.It came after five days of apparent sabotage attacks, including trains derailed by explosions and massive fires in annexed Crimea.",
        "On Thursday, Russia's southern Krasnodar and Rostov regions, both near Ukraine, reported drone strikes that caused fires.And early Thursday evening, Russia-installed authorities in Crimea, a peninsula annexed by Russia in 2014, said their forces had downed a drone near an airbase in the region.The Kremlin has insisted Moscow's May 9 parade will go ahead despite the attacks in border regions and in the heart of Russian power, but under \"strengthened\" security.Russian television on Thursday showed Putin in the Kremlin for the first time since the drone attack.The Russian leader does not plan \"any address on this topic\", said his spokesman.",
        "Moscow did however acknowledge that the country was facing an \"unprecedented\" wave of sabotage.Russia has opened a terrorism probe into the Moscow attack.It has not released official images of the attack. Unverified social media images showed a drone hitting the Kremlin Senate building.Peskov said \"two copper sheets\" on the dome of the 18th-century building had been damaged by fire.\"They have been or will be replaced, everything will be like new. There is no other damage.\"- 'Criminal actions' -As Moscow accused the United States of planning the Kremlin attack, Ukraine's Zelensky arrived on a surprise visit to The Hague.He visited the International Criminal Court, which in March issued an arrest warrant for Putin over the alleged illegal deportation of Ukrainian children.",
        "\"We all want to see a different Vladimir here,\" Zelensky said, referring to the Russian president, whom he believes \"deserves to be sanctioned for his criminal actions here, in the capital of international law\".",
        "A special tribunal should be created to hold Russia to account for its \"crime of aggression\", he said.A mission of three experts, established under the Organization for Security and Cooperation in Europe (OSCE), also said Thursday that hundreds of thousands of Ukrainian children may have been transferred to Russia since 2015 after Moscow annexed Crimea.\"It seems there is a plan to assimilate them (children) on a massive scale,\" one of the experts, Veronika Bilkova, told reporters.The Netherlands has pledged both financial and military support to Ukraine since Russia launched its offensive in February 2022.Zelensky, who also met Dutch Prime Minister Mark Rutte, said Ukraine was \"realistic\" that it would not be able to join NATO while still fighting Russia.\"But we want a very clear message that we will be in NATO after the war,\" he said.Putin has used Ukraine's wish to join the alliance to justify launching his offensive.- Intense strikes -",
        "After the Kremlin accused Kyiv of attempting to kill Putin, Ukrainian authorities said they faced a new wave of strikes overnight.",
        "The Ukrainian air force said Thursday that Russia had fired 24 attack drones overnight, 18 of which were downed. Authorities said there were no casualties.Sergiy Popko, the head of Kyiv's military administration, said the city \"has not experienced such intensity of strikes since the beginning of this year\".Later Thursday, the Ukrainian air force said it downed its own drone that had lost control over Kyiv at around 8:00 pm (1700 GMT). AFP journalists had heard explosions in the city for about 15 to 20 minutes and saw a drone that air defence attempted to shoot down.Kyiv mayor Vitali Klitschko said firefighters had contained a fire that broke out in a four-storey building."
    ]
}