{
    "articleURL": "/femail/article-12046729/I-left-kids-coach-wife-sat-class-flight.html",
    "content": [
        "Samuel Leeds left the web bitterly divided by revealing he left his kids in coachThe 32-year-old realtor, from London, said he sat in first class with his wifeHe brought the conversation surrounding airplane etiquette to a fever pitchA father and real estate mogul has sparked furious debate after he revealed he left his children in coach while he lounged in first class on a recent flight - while urging other wealthy people to avoid 'spoiling your kids.' ",
        "London-based realtor Samuel Leeds, 32, frequently shares investing tips on his social media account to teach his more than 242,000 followers how to get rich. Most recently, the dad-of-two gave viewers some controversial advice in a clip posted to his TikTok and brought the conversation surrounding airplane etiquette to a fever pitch just one week after a travel influencer caused a stir online by sharing the rules you should follow while jet-setting. He recommended ditching your children in coach so you could sit in first class without any distractions and avoid spoiling them. ",
        "At the beginning of the video, he showed his two young children sitting in coach. He waved goodbye to them and walked to his lavish seat. 'Rich people don't spoil your kids, walking past business class because I earned it,' he shared.The real estate agent then boasted about his luxury first class seat, where both he and his wife, Amanda, were sitting. Samuel gave viewers a peek at the dinner service in first class. 'My dinner is ready,' he said before shifting the camera to his wife who was sipping on a glass of wine. 'My wife who helps build the business with me,' he added.At the end of the video, he asked if viewers agreed or disagreed with his advice. ",
        "Samuel appeared to spark a fiery debate as many viewers branded his tip 'odd' and 'savage.' ",
        "One user wrote: 'No way, I understand the lesson but no way am I being that far away from my girls.' Another person added: 'I fail to see what lesson this will teach them.' 'This one's a bit odd,' one user commented. 'Haha no this is savage,' someone else added. Another person said: 'Big no.' 'Bad mind you should want all you have plus so much more for your children. I don't agree with this one,' one comment read. Someone else added: 'I agree with you to an extent… but I don't think leaving your young daughter on a plane where you're that far away from her is a good idea.' Many viewers were furious Samuel would leave his children alone, however, the realtor was quick to reveal they were sitting beside their nanny.And while the majority of people slammed the father, others praised him for teaching his children 'respect.' One person said: 'Fair play.' Another user wrote: 'Lol I don't see anything wrong with this. He had a nanny sit with them. He's literally taking them on holiday. Broke people problems.' 'I agree, children need to learn respect,' someone else said.Another user joked: 'I wouldn't be teaching them a lesson I'd be doing it for a peaceful flight.'",
        "'Respect, they will be in first class one day and feel that they earned it,' one person wrote. ",
        "Samuel's confession comes after travel expert Ben Keenan, from Seattle, took to TikTok to reveal the dos and don'ts for all passengers on board a flight.The 30-year-old's guidelines included always greeting cabin crew, ensuring you have headphones, and deciding what type of flier you are ahead of time.Similarly to Samuel's video, Ben's clip left social media users bitterly divided. In the past, the topic of seat etiquette has been furiously debated, with DailyMail.com columnist Jaci Stephen revealing her take on switching seats. Jaci confessed she 'absolutely refuses' to swap seats, no matter how angry the passenger requesting to switch may get.She explained she traveled a lot and carefully selected her seat way in advance, she noted she even chose which direction she wanted to face when traveling. Jaci added that in the past, she's had many passengers yell at her, and glare at her in annoyance, but she didn't mind as she noted it was her 'right to refuse.'"
    ]
}