{
    "articleURL": "/sport/football/article-12056345/Ilkay-Gundogan-holds-hands-penalty-miss-Man-Citys-narrow-win-Leeds.html",
    "content": [
        "Ilkay Gundogan accepted his share of the blame for late drama on SaturdayThe German midfielder missed a penalty in Man City's 2-1 win over Leeds UnitedGundogan wants his side to continue to set a high bar ahead of Real Madrid Ilkay Gundogan accepted his share of the blame after Premier League leaders Manchester City failed to beat relegation-threatened Leeds by a convincing scoreline on Saturday.",
        "The German midfielder scored both of City's goals as they maintained their title charge with a 2-1 victory at the Etihad Stadium but his late missed penalty opened the door for a potential Leeds fightback.Regular penalty-taker and top scorer Erling Haaland passed up the chance to score from the spot to allow club captain Gundogan a shot at a first career hat-trick, but things almost went badly wrong.Gundogan's effort in the 84th minute smacked the post and Leeds scored just moments later through Rodrigo.Suddenly, a game City had completely dominated until that point ended in a frantic finish but the hosts held on.",
        "Manager Pep Guardiola was far from impressed by the episode and Gundogan held his hands up.'It was a good performance,' said Gundogan. 'Unfortunately, we weren't able to transmit that performance into the result.'It feels like this game should have been won by at least three goals' difference.'We had a lot of possession, we were able to create a lot of chances. The negative is that we were not able to score a third one.'The game could have been over in the first half and, of course, also in the second. We had plenty of chances - myself included, unfortunately - to score a third one.",
        "'Conceding quite an easy goal made the last five to 10 minutes a little bit nervous for us, which should not have happened. It's another experience that we take on board.'That incident aside, Gundogan was outstanding, putting his side in command by sweeping home from Riyad Mahrez passes on the edge of the area in the 19th and 27th minutes.City could have increased their lead several times over with Haaland going close on a number of occasions, including hitting the woodwork twice himself.",
        "Gundogan feels it is important City, who now face Real Madrid in the Champions League semi-finals on Tuesday, continue to set high standards as they chase the treble.He said: 'Some people say it's more important to win than play well, which might be true, but I think that's just not our standard.'Of course we want to win games but also we want to keep playing the way we have done here.'There's just a few games left until the season is over and every game is like a final right now.'Until their late flurry, Leeds offered little in Sam Allardyce's first match in charge and they remain in deep trouble at the bottom of the table.Allardyce has just three games - tough fixtures against Newcastle, West Ham and Tottenham - to steer them to safety.",
        "It looks a daunting task but the 68-year-old is determined to get the best out of his players.He said: 'Even though my position is head coach I am a manager, and my biggest strength is making people feel better, making people do better.'Since Monday with (assistants) Karl Robinson and Robbie Keane and the staff already here, we're working diligently to make the team better.'We haven't stopped talking for the last four days, and not just daytime. We've been together all night, every night, plotting, talking and trying to find the right formula.'"
    ]
}