{
    "articleURL": "/news/article-12039859/Scarlet-Pages-exhibition-Soundgarden-Nick-Cave-Foo-Fighter-Silverchair-David-Bowie.html",
    "content": [
        "Chance picture at Big Day Out set Scarlet Page's career in motionKnown for photos of Australians such as Nick Cave and Silverchair Her exhibition in Paddington, Sydney includes a two-hour talk Rock music photographer Scarlet Page may have been born and raised in Britain, but a part of her with always be in Sydney.  ",
        "That's because at Sydney's Big Day Out in 1994 she was lucky enough to capture a picture that would propel her to career that's seen her travel the world capturing rock's biggest stars at their best.The photo, of Soundgarden singer Chris Cornell, was used on the cover of seminal rock magazine Raw - and started Page on a career that's still going strong just shy of 30 years later. Anyone who has followed music through magazines such as Rolling Stone, Mojo, Q, Uncut and a host of others has seen her pictures. From a 'deep and serious' Nick Cave, to Silverchair in their heyday and The Vines. Music fans will also have seen her portraits of names such as David Bowie, the Foo Fighters, The Smashing Pumpkins, Beastie Boys, Bjork and the The Rolling Stones.And that's just scratching the surface.  And for a limited time, those who want to either recapture that special time or experience it for the first time, Page's work is on show at the 'Captures' exhibition opens in Sydney from Thursday. ",
        "Page's big break came almost by chance. Fresh out of university, she was at Big Day Out 1994 to work as another photographer's assistant, but was also given some spare time to take her own pictures. ",
        "Back in London after her Australian venture, she approached a syndicating agency, who sent some of her photos around to various publications. Raw magazine wanted the Chris Cornell one and Page's career suddenly kicked up a gear, all thanks to a photo she doesn't even rate that much. 'It's not the best live shot by any means,' Page modestly told Daily Mail Australia. Maybe so, but it opened doors that have remained ever since.  ",
        "Among Page's most memorable tours was capturing some very early Silverchair gigs 'in scuzzy little venues' all over England.'We didn't know much about them at that time, but we heard that there was this huge kind of buzz about them (in Australia) and all I knew was that they were really young and they were very much that sort of Nirvana, grungy-esque kind of vibe.'The members of Newcastle band  - Daniel Johns, Ben Gillies and Chris Joannou - were so young, they had parents and chaperones with them on tour.They were 'like Labrador puppies, like excited young boys, you know, really just loving every second of it,' Page remembers. When she went back to pick photos for the Sydney exhibition she found 'some really lovely pictures, especially of Daniel just looking like a beautiful child, like a beautiful boy'.",
        "She found Johns 'quite shy' and 'enigmatic' but the band were so young that even though she was in her early 20s she 'felt quite old around them'. Page found that Nick Cave lived up to his reputation and 'was quite deep and serious' and said The Vines' singer Craig Nicholls 'just seemed like an oddball'.It later turned out that the behaviour Nicholls became known for in the early 2000s was due to his then undiagnosed Asperger's syndrome. 'Having now worked with, and photographed, people on the spectrum more it's quite nice to reflect and think, 'Wow, I see this in a completely different light now to what I did at the time,' because he's grimacing a lot,' she said looking back on the shoot with The Vines frontman.",
        "Among the other Australians Page had photographed are Brisbane legends Powderfinger and Melbourne-born punk rocker Brody Dalle. She said putting her Sydney exhibition together 'made me think more on the sort of Aussie side because it's so hard to curate a collection from 30 years of work.'But I thought, well, I'm going to think of all my favorites, but also think of the Aussie bands and anything that I shot in Australia and include that because it would seem more relevant.' ",
        "With so many of those she has photographed - Chris Cornell, David Bowie, Amy Winehouse and many more - having died, the pictures start to mean more to her.'Especially as time passes, the photos become more nostalgic and more precious somehow, and they evoke such great memories,' she said. ",
        "Page grew up around rock stars - her father is one of the most famous guitarists who ever lived, Led Zeppelin's Jimmy Page - and she believes this helped her get over any nerves.'I guess it's a familiar playground, in some way. So maybe the way I go in is not in a sort of star-struck way, maybe,' she said. But mostly the people she is photographing don't make the connection to her dad, and sometimes, despite growing up in the music world, she can still be in awe of her subjects.That was the case with David Bowie, who was impressed with the work she had done for the Welsh band Placebo, and specifically asked for her.He wanted her to photograph the rehearsals for his 50th birthday show in 1997.'So that was quite scary. What unnerved me more than anything was what a gentleman and how respectful he was of me,' she said. ",
        "Though the deaths of Bowie, Cornell and Winehouse made her treasure the fact that she had photographed them, the musical death that hit her hardest was that of Fleetwood Mac founder Peter Green, who died in 2020.",
        "'I just feel, you know, I'm really grateful that I got a chance to connect with him.'To reach him ... to find him because he's quite reclusive. But it was really important to me to try my hardest to get (a picture of him).'And then when he did agree to be part of the project, that was like a massive honor. I was really pleased with what I managed to get off him. I felt like it was the right kind of portrait.'And so when he passed away, obviously it's sad, but I was really grateful that I'd had that chance to meet him and capture him.'",
        "Page understands and empathises when some musicians are reluctant to have their picture taken. 'The important part about what I do is trying to be quite human as well on the other side (of the camera).'And as someone who hates having their photograph taken, it's about kind of almost reassuring them in a way that it's going to be all right ... it's like phototherapy sometimes.'Scarlet Page's Captures exhibition opens on Thursday May 5 at Behind The Gallery 205 Oxford Street, Darlinghurst, in Sydney.She will discuss her work at the gallery on Saturday, May 6 from 11am to 1pm. "
    ]
}