{
    "articleURL": "/wires/reuters/article-12058011/GRAINS-Wheat-rises-fourth-session-hopes-Black-Sea-deal-fade.html",
    "content": [
        "SINGAPORE, May 8 (Reuters) - Chicago wheat gained more ground on Monday to trade near a two-week high as slowing grain exports from Ukraine amid uncertainty over the extension of the Black Sea export deal underpinned prices.",
        "Corn and soybeans firmed.FUNDAMENTALS* The most-active wheat contract on the Chicago Board of Trade (CBOT) was up 0.1% at $6.61 a bushel, not far from a two-week high of $6.64 a bushel scaled in the previous session.* Corn added 0.2% to $5.97-1/2 a bushel and soybeans gained 0.1% to 14.37-3/4 a bushel.* Russia is still not satisfied with how the issue of Russian agricultural exports as part of the Black Sea grain deal is being resolved, TASS news agency quoted Deputy Foreign Minister Sergei Vershinin as saying on Saturday after the latest talks with a top U.N. official.* The pace of shipments from Ukraine under a U.N.-backed initiative has slowed as concerns grow over ships getting stuck if a deal is not renewed later this month, according to sources and data.* Russia, which is one of the key parties involved, said it will keep talking although Moscow has threatened to quit on May 18, which has created more uncertainty for traders and shipping companies trying to plan ahead.* The agricultural markets were looking ahead to a U.S. crop condition report on due on Monday and a monthly U.S. crop production report on May 12.* Large speculators increased their net short position in Chicago Board of Trade corn futures in the week ended May 2, regulatory data released on Friday showed.",
        "* The Commodity Futures Trading Commission's weekly commitments of traders report also showed that non-commercial traders, a category that includes hedge funds, increased their net short position in CBOT wheat and cut their net long position in soybeans.MARKET NEWS* A global gauge of stocks rallied and U.S. Treasuries and gold sold off on Friday as strong U.S. jobs data brightened the economic outlook and traders pared expectations of Federal Reserve easing after a long spate of rate hikes.DATA/EVENTS (GMT) 0600 Germany Industrial Output MM March 0600 Germany Industrial Production YY SA March (Reporting by Naveen Thukral; Editing by Sherry Jacob-Phillips)"
    ]
}