{
    "articleURL": "/tvshowbiz/article-12042747/Jennifer-Lopez-53-bravely-shares-MAKEUP-FREE-video-uses-8-lashes.html",
    "content": [
        "Jennifer Lopez took to her JLOBeauty Instagram page on Tuesday.",
        "The 53-year-old movie and TV star was giving her tips on how she got glammed for the Met Gala in NYC on Monday, which she attended with her voice coach.The wife of Ben Affleck bravely went makeup free as she told fans that she needed to 'hydrate' before getting the makeup on.In the video she also shared that she never sunbathes but uses plenty of fake tanning cream and bronzer.And another interesting tell is that she uses fake eye lashes from KISS that can be bought at a regular drug store for $8.",
        "The star was inside her New York City condo with flowers in the entrance way and the glam team spread out in her living room. The Shotgun Wedding actress was in a silky light beige robe that said JLO Beauty on front as she chatted away. 'Get ready for the #MetGala with @JLo @Allure Jennifer prepped her skin with none other than #JLoBeauty,' the caption read.She then listed off what she used: 'That JLo Glow™ Serum, That Big Screen® Broad Spectrum SPF 30 Moisturizer, That Star Filter® Complexion Booster.'Also seen was her makeup artist Ash Kholm.Hair was by Lorenzo Martin and nails by Tom Bachik.She was styled by Rob Zangardi and Mariel Haenn as she wore Ralph Lauren.",
        "Meanwhile, she did not take her husband Affleck to the Met Gala. Instead, the Hustlers actress brought her vocal coach Stevie Mackey.DailyMail.com has learned exclusively that Ben did not attend the Met Gala with his new wife because he had 'work commitments he could not get out of' in Los Angeles.Jennifer's plus one at Stella McCartney and Baz Luhrmann’s Met After Party with Casamigos was her 51-year-old sister Lynda Lopez. Lynda posted a photo with her famous Jenny From The Block sibling as they hit the soiree. '#Aboutlastnight Stayed up late wayyyy too many nights this week... #mamasnightout ❤️,' she added in her caption.The Shotgun Wedding actress was also seen bonding with Kate Hudson and Gigi Hadid as well as fashion designer Stella McCartney at the swanky event.",
        "Lynda is Jennifer's younger sister. In 2022 JLo posted a flashback photo with both her sisters to celebrate International Women's Day.She was seen with Lynda and older sister Leslie Lopez.Lynda is an American journalist and author based in New York City.  She has written AOC: The Fearless Rise of Alexandria Ocasio-Cortez and What It Means for America.Leslie-Ann Lopez keeps a quieter profile. She works as a teacher. On her Instagram account, which is private, she says, 'Musician, LMT, mother to Brendon Scholl of Draw With Me.'",
        "The siblings grew up in The Bronx with parents Guadalupe and David. In her caption, JLo wrote: 'Happy #InternationalWomensDay!!! ✨'Each and every day I am inspired by so many talented, incredible and amazing women. 'We truly make the world go ‘round. From my inspirations in life to my beautiful family and friends … today and every day is your day... we celebrate and honor you ✨❤️,' added the star.Her hashtags included links to her sisters' Instagram accounts, @lyndalopez08 @leslieann3626."
    ]
}