{
    "articleURL": "/wires/ap/article-12056039/Ukraine-farmers-risk-losing-lives-livelihoods.html",
    "content": [
        "POTIOMKYNE, Ukraine (AP) - A grassy lane rutted with tire tracks leads to Volodymyr Zaiets´ farm in southern Ukraine. He is careful, driving only within those shallow grooves - veering away might cost him his life in the field dotted with explosive mines.",
        "Weeds grow tall where rows of sunflowers once bloomed. Zaiets´ land hasn't been touched since the fall of 2021, when it was last seeded with wheat. Now, it's a minefield left by retreating Russian forces.Zaiets eschewed official warnings and demined this patch of land himself, determined not to lose the year´s harvest. He expects that 15% of his 1,600 hectares (4,000 acres) of farmland was salvaged.Workers like Victor Kostiuk still spot mines, but he's ready to start the tractor.\"We have to do it,\" he says, \"Why be afraid?\"Across Ukraine, the war has forced grain growers into a vicious dilemma. Farmers in areas now free from Russian occupation must decide if it's worth risking their lives to strip land of explosives before the critical spring planting season.",
        "They have soaring production and transportation costs caused by Russia´s blockade of many Black Sea ports, and several neighboring European countries imposed import restrictions on Ukrainian grain to prevent a glut.The dual crisis is causing many farmers to cut back on sowing crops. Bottlenecks in shipping grain by land and sea are creating losses, with expectations of a 20% to 30% reduction in grain output, poorer quality crops and potentially thousands of bankruptcies next year, according to industry insiders, Ukrainian government officials and international organizations.",
        "The \"drastic reduction\" of grain crops potentially threatens global food security, said Pierre Vauthier, head of the U.N. Food and Agriculture Organization in Ukraine. \"That is the main thing everybody eats. So that´s why it is a big concern.\"More than a year since Russia's invasion, the Ukrainian agriculture industry is starting to see the full impact of what's been dubbed \" the breadbasket of the world,\" whose affordable supplies of wheat, barley and sunflower oil are crucial to Africa, the Middle East and parts of Asia where people are going hungry.The FAO says 90% of agricultural businesses lost revenue and 12% reported lands contaminated with mines. Land planted with grain dropped last year to 11.6 million hectares (28.6 million acres) from 16 million hectares (around 40 million acres) in 2021. That's expected to fall to 10.2 million hectares (25.2 million acres) this year.In the southern Kherson province, between the threat of missiles from the sky and mines on the ground, farmers make the same, often tragic, calculation: Take the risk and plant or lose their livelihoods.The region is among the highest wheat-producing areas in Ukraine and the most heavily mined. Demining services are overstretched, with infrastructure and civilian homes prioritized over farms.But growers can´t wait: April and May are key planting months for corn, the autumn months for wheat. Many are switching to planting oil seeds that are less costly.",
        "\"We have nearly 40 big farmers in our area, and nearly everyone is unable to access their lands except two,\" said Hanna Shostak-Kuchmiak, head of the Vysokopillya administration that includes several villages in northern Kherson.Zaiets is one, and Valerii Shkuropat from the nearby village of Ivanivka is the other.\"Our heroes,\" said Shostak-Kuchmiak, \"who were driving their cars around picking up mines and bringing them to our deminers.\"Neither farmer felt they had the choice. Both knew that without a harvest this year, they will be insolvent by next.Everyone understands the risks, said Shkuropat, who´s vast 2,500 hectares (more than 6,000 acres) of land once grew peas, barley, millet and sunflowers. He estimates that half can be planted.Last month, one of his workers was killed and another was wounded while picking up metal missile remnants.\"If we sow, if we grow crops, people will have jobs, salaries and they will have a means to feed their families,\" Shkuropat said. \"But if we don´t do anything, we will have nothing.\"Russia´s blockade of Ukraine´s Black Sea ports stripped the country of the advantage it once enjoyed over other grain-exporting countries. Transit costs, now four to six times higher than prewar levels, have rendered grain production prohibitively expensive.High costs of fuel, fertilizer and quality seeds only add to farmers' woes. Most must sell their grain at a loss.",
        "Farmers are responding by seeding less, said Andrii Vadaturskyi, CEO of Nibulon, a top Ukrainian grain shipping company.\"No one is paying attention to the fact that already 40% less wheat has been seeded (this year), and we expect 50% less corn will be seeded in Ukraine,\" he said, drawing on data from 3,000 farmers.Nibulon once paid an average of $12 to ship a ton of grain from the southern port city of Odesa. Now it pays $80-$100 per ton, Vadaturskyi said,HarvEast CEO Dmytro Skornyakov said that his agricultural company pays almost $110 in logistics costs to export every ton of corn.\"It covers our expenses, but doesn´t give us any profit,\" he said.Negotiations are underway on renewing the U.N.-brokered agreement that allows Ukrainian grain to safely leave three Black Sea ports. Shippers say the deal isn't working efficiently.Russian inspections are causing long wait times for vessels, piling on fees and making the sea route expensive and unreliable, Ukrainian grain shippers say. Russia denies slowing inspections.\"We had some vessels which were waiting close to 80 days in the queue simply to be loaded,\" said Vadaturskyi of Nibulon. \"Someone has to lose that money, either the buyer, owner of the vessel or trader.\"Transit routes through Europe are open even as Poland, Romania, Slovakia, Bulgaria and Hungary temporarily banned Ukrainian wheat, corn and some other products over concerns about their own farmers' profits.",
        "But those routes are slow and costly. Shipping by sea accounted for 75% of Ukrainian grain exports at the start of the year.Meanwhile, some farmers won't risk planting their fields.Oleh Uskhalo´s land in Potiomkyne is awash with ammunition, the vast wheat farms reduced to a graveyard of scorched equipment.Inside a bombed-out grain shed lies piles of wheat grain - Ushkalo´s entire prewar harvest - rotting under the sun.\"We can go on for another year,\" he said. After that, he doesn´t know. He hopes for government compensation.\"I cannot send (my workers) to a field where I know mines and bombs are,\" Uskhalo said. \"To send a person to blow themselves up? I can´t do that.\"He faces resistance from his employees, eager to earn wages.\"The tractor drivers, they say, `We can go, we can sign a document stating that we take full responsibility,´\" Uskhalo said.It´s too risky, he told them.In the distance, he can see a tractor equipped with disk tillers, a type of plow. \"I wonder if it´s Volodymyr Mykolaiovych,\" he said, referring to Zaiets.\"All it takes is for one of those disks to hit a mine and that´s it.\"That´s what happened to Mykola Ozarianskyi.In April, the farmer took a chance: He hopped on his tractor in his village of Borozenske, in Kherson, to head to a friend´s sunflower field to cut stalks.",
        "He swerved to turn down a side farm road. He remembers the explosion, then waking up in a hospital bed with a collapsed lung and broken ribs.Every day, he thinks of his 16 hectares (around 40 acres) of land, still unseeded.\"I will do it,\" he said, straining to speak while a tube drains blood from his chest. \"For a farmer, not planting means death.\"___Follow AP´s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine and food crisis at https://apnews.com/hub/food-crisis."
    ]
}