{
    "articleURL": "/wires/pa/article-12038855/Aberdeen-chief-Alan-Burrows-issues-warning-against-signing-club-s-best-players.html",
    "content": [
        "Chief executive Alan Burrows has warned that Aberdeen “will be a very difficult club to deal with” if any interested parties attempt to sign their best players.",
        "Strikers Luis “Duk” Lopes and Bojan Miovski have notched 18 goals apiece in their maiden seasons at Pittodrie and have been the subject of interest from elsewhere.“Both Duk and Miovski are in the first year of long-term contracts,” said Burrows. “The club is under no pressure to sell them and the club don’t want to sell them.“If anybody wants to take our best assets away from us, particularly ones who have long contracts, we’re going to be a very difficult club to deal with.“We have to marry up a model that says we develop young players through the academy and players we bring in to develop and sell, but at the same time you’ve got to balance that by building a squad rather than consistently chipping away at it, so in order to do that you’ve got to retain the best value for these players.“People have got to know that Aberdeen Football Club will do that. The board have done that in the past, they’ve knocked back big offers for players and I sense from the ownership group and the board that they’re more than prepared to do that again.",
        "“We want to build a strong team and retain the best players whilst also understanding that there is a model that requires us to continually look to trade on players to continue the health of the football club and invest in the team.",
        "“It won’t be easy for anybody who wants to take any of our best players, that’s for sure.”Burrows was speaking at a press conference on Tuesday, a day after interim boss Barry Robson – who was initially in situ only until the end of this season – was handed a contract for the next two years.The recently-recruited CEO explained why former under-18s coach Robson, who has won eight of his 10 games in charge, emerged as the favoured choice following an “extensive” recruitment process that explored “a number of key candidates”.“I had never met Barry before I came to the club but I’d heard a lot about him. I was really taken aback by how highly regarded he was by the senior people at Pittodrie and then after my first meeting with him at Cormack Park,” said Burrows, who joined Aberdeen at the end of February, a month after Robson took the reins from the sacked Jim Goodwin.“That hour-and-a-half I could really sense what type of character he is and I really liked him from the get-go. I thought ‘this guy’s really got the materials to be doing it’.“In terms of the stuff he’s been doing away from the pitch, Barry’s been developing a bit of a DNA about what it means to be an Aberdeen player, right through from the youngest academy players, to the development age groups, to the first team, and really trying to home in on what it means to play for this club and be successful.",
        "“And now that he’s the manager, we’re really excited about him being able to drive that forward from the top down.“It’s almost that utopia of what football clubs want, that connectivity between the three different areas of player development and we think Barry now is the flagship, most senior person within the football department and he can really drive that forward and connect up those departments.“First and foremost it’s about winning matches – and he’s doing that. Developing players and giving them confidence and a structure, and he’s done that.“And the third thing is to connect up all the various departments and the various age groups to create a real synergy between the very youngest player and the most senior player.“Those were the three key reasons about (appointing) Barry and also we’ve got a big job to do this summer and that was part of the reason for expediting the process slightly from what we’d said about six weeks ago.”"
    ]
}