{
    "articleURL": "/wires/ap/article-12056857/Russians-return-judo-worlds-Ukraine-boycotts.html",
    "content": [
        "DOHA, Qatar (AP) - Russians returned to international judo competition on Sunday for the first time in nearly a year at the world championships as Ukraine boycotted the key Olympic qualifier.",
        "Competing under the name of \"Individual Neutral Athletes,\" the Russians had a slow start in Doha as their first competitor, Sabina Giliazova, lost her opening contest to France's Blandine Pont. Three more Russians are due to compete Monday.Seventeen judokas from Russia and two from its ally Belarus were listed as competing at the world championships despite several of them having apparent ties with the Russian military. Ukraine removed its team from the event last week in protest.The International Olympic Committee favors allowing Russians and Belarusians to compete as neutral athletes without national symbols as qualifying ramps up for next year´s Paris Olympics. The IOC - which last year recommended excluding Russian competitors on security grounds but now argues that would be discriminatory - has left the final decision to the governing bodies in each sport.Some sports like track and field have kept an exclusion in place on Russians and Belarusians in international events. Several more Olympic sports have said they are preparing to readmit Russians and Belarusians, but haven't yet done so, some citing a need for extra time to decide on a process or vet athletes. The International Judo Federation has moved comparatively fast.The IJF allowed a Russian team without national symbols at the first Olympic qualifying event in June 2022 in Mongolia, which Ukraine boycotted, but then backtracked and excluded Russia and Belarus for the rest of 2022. The world championships were the first time that either Russia or Belarus entered a team since then for a major international judo event.",
        "The IJF published the Russian and Belarusian entries for the world championships on April 30, just before the deadline. Ukraine´s government has a policy of boycotting national-team sports events which allow Russians or Belarusians, a policy backed by Ukrainian judo world champion Daria Bilodid, who is staying away from the championships as part of the boycott.The IOC has recommended that sports do not admit Russian or Belarusian competitors who are contracted to the military or security forces. Some of those competing in Qatar have previously been listed in statements by the Russian Defense Ministry or the Central Sports Club of the Army, known as CSKA, as holding military ranks.They include Olympic bronze medalist Madina Taimazova, who was listed as a staff sergeant in the Russian army in Russian Defense Ministry and CSKA statements from June 2022. Inal Tasoev and Mikhail Igolnikov have won gold medals for Russia at the Military World Games, a sports event for soldiers. CSKA listed Tasoev as a staff sergeant when congratulating him on his birthday in February, and Igolnikov as a lieutenant in a similar statement in October.The IJF has not published its full criteria for deciding which athletes can compete and which are refused, especially regarding military athletes. The IJF has said that there were independent checks of athletes' \"place of employment,\" that all of those competing in Qatar were employees of a Russian state sports training center, and that their social media accounts were checked for \"interactions regarding pro-war propaganda\". The IJF said it rejected eight unnamed people from the Russian or Belarusian delegations.",
        "Despite its advocacy for Russians and Belarusians to return to competition in Olympic qualifiers, the IOC has not made a final decision about the Paris Olympics, and hasn't set a date to do so.___More AP coverage of the Paris Olympics: https://apnews.com/hub/2024-paris-olympic-games and https://twitter.com/AP_Sports"
    ]
}