{
    "articleURL": "/wires/reuters/article-12053313/As-score-big-hold-Royals-comeback-bid.html",
    "content": [
        "Brent Rooker homered and drove in three as the Oakland Athletics held off a furious rally by the host Kansas City Royals for a 12-8 win on Friday night.",
        "The Athletics plated an unearned run in the first as Esteury Ruiz and Ryan Noda reached on soft singles, then Ruiz stole third and scored on a throwing error.Back-to-back home runs by Rooker - a two-run shot for his 10th of the season -- and Ramon Laureano boosted the A's lead to 4-0 in the third. Laureano's third of the season traveled an estimated 440 feet to left-center.Rooker added an RBI double in the fourth for a 5-0 advantage.Tony Kemp's third hit, an RBI double, drove Brad Keller (2-3) from the mound as Oakland took a 9-2 lead in the fifth.Keller allowed multiple baserunners in each inning and labored through 4 1/3 innings, surrendering seven runs on 11 hits -- both season highs.Noda, a rookie, and Shea Langeliers broke 0-for-12 slides with hits in their first at-bats while the Athletics pounded out season-highs in runs and hits (17). Noda and Kemp each delivered a pair of doubles as Oakland collected eight extra-base hits.Kyle Muller (1-2) shut out Kansas City until Nick Pratto's two-out, two-run homer in the fourth, his first of the year.The Royals scored a run in the fifth and two more in the sixth to drive Muller from the game after 5 1/3 innings. He surrendered five runs on eight hits and three walks.",
        "In the seventh, Athletics reliever Shintaro Fujinami walked the bases full. All three scored, cutting the lead to 9-8 when Hunter Dozier slashed a two-run triple that was misplayed by centerfielder Ruiz. Dozier and Pratto each finished with two RBIs.For the second straight day, Kansas City scored in four consecutive innings to attempt a comeback from a seven-run deficit but could get no closer on Friday against three additional Oakland relievers.The A's added a combined three insurance runs in the eighth and ninth innings. In the ninth, Ruiz doubled and again stole third. He has a seven-game hitting streak and is tied for the major league lead with 15 steals.--- Field Level Media"
    ]
}