{
    "articleURL": "/sport/football/article-12044053/Alan-Shearer-leads-congratulations-Erling-Haaland-forward-breaks-record.html",
    "content": [
        "Erling Haaland netted City's second goal against West Ham to break the recordThe forward has 35 goals in 31 games, beating Alan Shearer and Andy ColeShearer led the congratulations for Haaland but joked 'it only took 28 years' Alan Shearer led the praise for Erling Haaland after the forward broke his record for the most goals scored in a Premier League season.",
        "The Norwegian netted his 35th goal of the league campaign in his 31st game as Manchester City beat West Ham 3-0 at the Etihad on Wednesday, overtaking Shearer and Andy Cole as the outright leader in the record books.In doing so, he also bagged his 51st goal of the season in all competitions in his first season since joining City from Borussia Dortmund in the summer.City still have five games remaining in the league, and the forward could run away with the goals record in the league, with a potential of four more games to play in the Champions League and FA Cup.Former record holder Shearer congratulated Haaland on Twitter after the game, singing the 22-year-old's praises.",
        "'Couldn’t have wanted it to go to a nicer guy,' said the former striker on Twitter. 'It’s only taken 28 years!!!! He’s the best.'Shearer was responding to Gary Lineker, who posted: 'A Premier League record for Erling Haaland. 35 goals. That’s nuts. Thoughts are with Alan Shearer at this difficult time.'The Match of the Day presenter later added: 'Wait until he adapts to Premier League football.' Shearer scored 34 goals in the 1994-95 Premier League season when he played for Blackburn, a year before he won the league title.",
        "Cole, however, achieved the feat the following year with Newcastle, before he left to join Manchester United.",
        "Before leaving the pitch at the end of the game, Haaland was given a standing ovation by the entire Etihad crowd before his team-mates lined up to give him a guard of honour.The scenes further evidenced Haaland's popularity among his team-mates, with the Norwegian said to be a humble and crucial member of Pep Guardiola's imperious squad.His team-mates slapped him on the back of the head and back as he headed off with an enormous grin etched across his face. When he reached the end, he could be seen rubbing his back as if to wish away the pain, though the grin remained.City are now a point clear of Arsenal at the top of the Premier League, and still have a game in hand on the Gunners in second. "
    ]
}