{
    "articleURL": "/wires/afp/article-12043027/US-pick-Ajay-Banga-confirmed-new-World-Bank-president.html",
    "content": [
        "The World Bank confirmed Wednesday that Ajay Banga will be its next president, handing him the reins at a pivotal time as it looks to reshape its role to better address climate change.",
        "\"The Board looks forward to working with Mr. Banga on the World Bank Group Evolution process,\" the development lender wrote in a statement published shortly after executives voted to approve his leadership for a five-year term.The bank said it looked forward to working with Banga on its \"ambitions and efforts aimed at tackling the toughest development challenges facing developing countries.\"Banga, the US candidate who was the sole nominee for the top job, will begin his new role on June 2, taking over from David Malpass who is stepping down early amid criticism over his stance on climate issues.President Joe Biden said in a statement that Banga \"will help steer the institution as it evolves and expands to address global challenges that directly affect its core mission of poverty reduction -- including climate change.\"- More private sector participation -Under an unwritten arrangement, a US citizen has historically held the presidency of the Washington-based development lender, while the International Monetary Fund has been run by a European.Despite growing public unease over America's continued grip on the bank's presidency from developing and emerging economies, the trend continues with Banga, 63, who was born into a Sikh family in India and is a naturalized US citizen.Banga previously ran the payments company Mastercard for more than a decade between 2010 and 2021. He has also served on the boards of the American Red Cross, Kraft Foods and Dow Inc.",
        "He told reporters that during his candidacy, he wanted to see greater private sector funding to help tackle financing for global problems.\"There is not enough money without the private sector,\" he said, adding that an organization like the World Bank should set up a system that could share risk or mobilize private funds to achieve its goals.\"These are all tools in the toolkit and I'm going to try and figure it out,\" he said.Treasury Secretary Janet Yellen said Wednesday that \"ambitious goals\" for the bank would not be met overnight, adding that Washington remains committed to \"a staged adoption of reforms over the course of the year.\"Banga's track record of \"forging partnerships between the public sector, private sector, and non-profits uniquely equips him to help mobilize private capital and press for the reforms needed,\" she said.- Climate concerns -Banga will enter his new role at a difficult time for the world economy, with slowing global growth and high interest rates in many major economies.Low-income countries are expected to suffer a double shock from higher borrowing costs and a decline in demand for their exports due to the tough economic conditions, IMF chief Kristalina Georgieva said last month, adding that this could fuel poverty and hunger.",
        "Banga will take control of the bank shortly after member countries endorsed measures to allow it a $50 billion lending boost over the next decade -- a key objective of outgoing president Malpass.The move is part of an ongoing evolution of the development lender amid pushes for it to meet global challenges like climate change.The bank estimates that developing countries will need $2.4 trillion every year for the next seven years just to address the costs of climate change, conflict and the pandemic.While plans to reform the bank have been broadly welcomed, there has been concern by some countries that new objectives could relegate the pressing economic development needs of members in developing economies.\"We want to make sure that the development agenda is not diluted in the climate agenda,\" Abdoul Salam Bello, a member of the bank's executive board representing 23 African countries, told AFP last month.\"Climate is important, but we don't want to have a trade-off where we have an agenda that will be climate versus development,\" he said."
    ]
}