{
    "articleURL": "/wires/pa/article-12047549/Finding-players-thing-Brian-McDermott-relishing-new-role-Hibernian.html",
    "content": [
        "New director of football Brian McDermott is relishing the chance to unearth quality players for Hibernian after being appointed to a role that will revolve heavily around recruitment.",
        "The 62-year-old is best known for a managerial career that incorporated two spells at Reading either side of a stint at Leeds, but he was chief scout at the Madejski Stadium for nine years prior to becoming a boss and has worked predominantly in scouting roles since being sacked by the Royals in 2016.McDermott feels player recruitment is his speciality and believes that will stand him in good stead for a role he learned a lot about while working under the “fantastic” Nick Hammond at Reading.“I relish that, I love finding players,” he said. “I was head scout at Reading for nine years and I wasn’t looking to become the manager because I loved finding players.“We found so many really good players, that’s my thing. I did the same at Arsenal (between 2016 and 2020) and really relished that.“I became the Reading manager by default and did OK and then I ended up at Leeds and whatever, but I think finding players is my thing.",
        "“I get a buzz out of recruitment. I’ve recruited well as a manager and I’ve recruited not so well, and when you don’t recruit well you don’t do so well. It is so important.”McDermott insists he had not planned on becoming a director of football but he feels the Hibs role – which will require him to work closely with manager Lee Johnson and also revolves around scouting, analysis, sports science and the academy – suited him at this stage in his life.",
        "“I never really make conscious decisions,” said McDermott, who did some scouting for cinch Premiership side Celtic after leaving Arsenal. “This opportunity came along and I thought ‘yeah, that’s something I really want to do’.“Job titles to me are not important. I like to be involved with people and doing the best I can with people. It’s not about the job title or me or whatever, it’s always about the football club.“I kind of did this job between 2000 and 2009 but without having the title of director of football. Nick Hammond was the director of football but I involved myself in every part of the football club because I wanted to. I was doing mad hours but I loved it.“Nick was a fantastic director of football to work under so I know how the role works and it’s something I’m really looking forward to.”"
    ]
}