{
    "articleURL": "/wires/pa/article-12051885/Rory-McKenzie-using-past-relegation-motivation-stay-Kilmarnock.html",
    "content": [
        "Kilmarnock midfielder Rory McKenzie admits the painful memories of relegation are spurring him on to avoid the same fate two years on.",
        "McKenzie is one of the few survivors of the team that lost to Dundee in the play-offs before coming straight back up as cinch Championship title winners.Derek McInnes and his squad occupy 11th place in the Premiership which would consign them to another play-off but there are five matches left to save their top-flight status, starting with Saturday’s trip to Motherwell.McKenzie said: “I would much rather be playing in the top six but I’m relishing the game in terms of how big a game it is for the club.“You want to play in big games and for a club like Kilmarnock, having been in this position, I know how bad it feels to be relegated and it just makes it a whole lot bigger. In that sense it’s a great occasion and a good game to go out and win.”The 29-year-old is using past pain as motivation.",
        "“Definitely, I have been thinking about it the last few weeks,” he said. “It’s a horrible, horrible feeling and I do not want to feel that again.“I have let the boys know that and we are going to do what we can to not have any sort of feeling like that again.”McKenzie was raised in Troon and his association with Killie goes back many years through his formative spell in the club’s academy but he does not feel his affection for the club should make him any more determined than his team-mates to help the cause.",
        "“I don’t think it should,” he said. “It might come across as that because I am from here and I know the club better than most, but if you are a professional it’s not something you want to have on your CV.“Yes, I am from here but it should mean the exact same for everyone in the squad whether you are here full-time or on loan. You don’t want to go back to your parent club on the back of a relegated season.“Everyone has their reasons why and it should mean the same to everyone.”Killie are looking to follow up on their first league away win of the season last time out against St Mirren.McKenzie: “It was huge because it became a thing. For one reason or other we weren’t starting games well. We were conceding early and there was no real belief we could get back in the game.“Last week we performed well. It was a big game for St Mirren and it was a good crowd and to come out on top against a good side was a big confidence boost.”The attacking midfielder admits preparing for an away game on the back of a win feels different.“I would say so, especially when your next game is away from home,” he said.",
        "“It’s a huge confidence boost because I would be sitting here answering the same questions if we hadn’t won two weeks ago. So that’s quite pleasing.“You are asked why the away form was so poor and we didn’t know, or we don’t know. It’s a frustrating one because last week just shows if we do everything right and it goes to plan, it’s sometimes quite straightforward.”Killie have Joe Wright, Fraser Murray and Liam Polworth back from illness and injury and Kyle Vassell is set to feature despite suffering a hamstring issue in Paisley.“He is still not perfect but he has always been a quick healer,” manager Derek McInnes said.“We got him scanned and we got him moving again. We feel Kyle is a key player for us so we would much rather have him out there.”"
    ]
}