{
    "articleURL": "/tvshowbiz/article-12049541/Natalie-Portman-dazzles-black-boucle-blazer-shorts-premiere-docuseries-Angel-City.html",
    "content": [
        "Natalie Portman looked stunning at the premiere of Angel City in Los Angeles on Thursday.",
        "The 41-year-old award-winning actress put on an elegant display in a black boucle set featuring a blazer and matching shorts as she posed on the red carpet for the HBO documentary series. The Black Swan star was one of the executive producers for the show about the Los Angeles-based professional women's soccer team, Angel City Football Club (ACFC).The two-time Golden Globe winner — who was seen wearing a T-shirt from her alma mater, Harvard University, on Monday — paired the ensemble with black peep toe heels.The day before the highly-anticipated premiere, the official trailer for Angel City was released.",
        "The V for Vendetta alum looked dazzling in the set adorned with bright gold buttons.She opted out of any accessories for an effortlessly stylish look and rocked a bold, red manicure.Portman styled her collarbone-length, brunette tresses in silky, beach waves. For makeup, she looked radiant in a brown smoky eyeshadow look and just enough coral blush swept across her cheeks for a naturally flushed appearance.Finally, she finished off the look with a glossy, medium pink lip. According to the synopsis, the three-part docuseries follows the team behind the scenes and onto the pitch. ACFC was co-founded in September 2020 by Portman as well as venture capitalist Kara Nortman and gaming entrepreneur Julie Uhrman.",
        "Just last year, the National Women's Soccer League expansion team began playing in 2022.",
        "The team is the largest majority female ownership group in professional sports and includes 14 former U.S. Women's National Team players as investors. In the teaser released on Wednesday, Portman said, 'I never imagined that I'd be a co-owner, co-founder of a professional soccer team.'During an interview on the pitch in a later clip, she added, 'Once you sort of open yourself up to new adventures, they can lead you to a place like this.'There's no playbook,' she could be heard saying at the end of the trailer. 'We have to write our own.' "
    ]
}