{
    "articleURL": "/news/article-12048739/Murder-investigation-launched-woman-54-attacked-North-Staffordshire-dies.html",
    "content": [
        "Suzanne Henry, 54, died on Wednesday night after being found in Staffordshire A man has been charged with murder after a woman found with serious facial injuries died. ",
        "Suzanne Henry, 54, died on Wednesday night after being found inside a house near Newcastle Road, Madeley, Staffordshire, at around 10pm on Monday.Finn Henry, 20, of Newcastle-under-Lyme, was charged with her murder on Thursday afternoon. He will appear before magistrates at North Staffordshire Justice Centre on Friday.In a Facebook post, Suzanne's partner Charlie said: 'We are still processing losing Suzanne.'Police were called following reports of a man acting suspiciously on May 1, Staffordshire Police said, and a 20-year-old man was arrested on suspicion of attempted murder.",
        "Mr Henry was then further arrested for murder while in custody following Ms Henry's death.Detective Inspector Adrian Webb, from the force's Major Investigations Department, said: 'My thoughts and condolences are with Suzanne's family at this deeply traumatic time.'I understand the state of shock, both in the family and the wider community, that such a tragic event has happened in the town of Madeley.'We are solely focused on securing justice for Suzanne's family and making sure we do everything possible to support them through this incredibly difficult time.'I'd like to thank all of those who have already been in touch with information and for the patience which has been shown around the cordon on Newcastle Road.'There could still be people with valuable information that haven't come forward yet and we'd urge them to get in touch with us as soon as they can.'",
        "Police have reiterated their appeal for anyone in the area between 5pm and 10.15pm on Monday to come forward online.Rev Tim Watson, of village church All Saints Madeley, said: 'As a community we are all shocked by the news from the village this week. 'Following the announcement from Staffordshire Police about the sudden death of Suzanne Henry we recognise that as the nation celebrates the coronation this weekend, there will be many locally who are struggling and deeply disturbed by news from the village.'"
    ]
}