{
    "articleURL": "/wires/reuters/article-12044323/Violent-response-Peru-protesters-massacre-says-rights-group.html",
    "content": [
        "LIMA, May 3 (Reuters) - Peru's security forces committed alarming human rights violations during anti-government protests last December, a regional human rights body said on Wednesday, adding that the response to demonstrators could be classified as a massacre.",
        "More than 60 people died in clashes with police and soldiers in protests that broke out following the ouster of then-President Pedro Castillo.\"There were grave episodes of use of excessive force,\" the Inter-American Commission on Human Rights (IACHR) concluded in a report.The government has denied it committed abuses during the protests and said it is collaborating with investigations.President Dina Boluarte, who replaced Castillo, later on Wednesday dismissed the group's conclusions.\"We reject the supposed findings of extrajudicial killings and the 'massacre' description,\" she said at a press conference.IACHR said a large number of people were killed and injured by gunfire, mainly in the Andean regions of Ayacucho and Puno, where people demanded new elections and Boluarte's resignation.The violence \"might also amount to a massacre,\" the report asserted.\"There were serious human rights violations that must be investigated with due diligence and an ethno-racial approach,\" said Margarette May Macaulay, head of the IACHR, which is the human rights arm of the Washington-based Organization of American States. \"The deaths could constitute extrajudicial executions.\"Bolaurte played down the wording of the IACHR's report, saying it did not \"confirm\" the occurrence of human rights violations, but that they \"could have happened.\"The report affirmed that rights violations took place.The commission visited Peru from Jan. 11-13, and met with relatives of victims, government officials and civil society representatives.",
        "The commission's report follows a Human Rights Watch publication, which concluded that Peru's security forces were responsible for protest deaths.In January, Peru's attorney general opened an investigation against Boluarte, along with three of her ministers, on charges of genocide, homicide and serious injuries. (Reporting by Marco Aquino; Writing by Valentine Hilaire; Editing by Bill Berkrot and Grant McCool)"
    ]
}