{
    "articleURL": "/property/article-12047561/Indoor-outdoor-living-look-garden.html",
    "content": [
        "Revamping your garden often requires new purchases to be madeBut bringing indoor items outside can both save money AND look good We explain how to make the trend work in YOUR home The weather is slowly cheering up, which means many of us are looking at our outdoor spaces. ",
        "But transforming a garden into a stylish oasis often requires new purchases. Think seating, lighting and accessories — and that's just for starters.The good news is that with careful selection, you can double up and reuse outdoor items indoors, which makes it much more economical — and sustainable.",
        "Flexible, multiple-use outdoor products are in high demand, according to Camilla Rowe, head of home accessories at John Lewis.'The trend for indoor-outdoor living is growing,' she said. 'We're seeing customers buying products that have a dual use and look just as good inside the home as they do out.'If you want to be part of this movement and create that outdoor living space, here's our guide.Flexible footstoolsPouffes make a comfy footrest or an extra seat for when you have more guests than chairs. Outdoor versions tend to be more robust compared to regular models.Look for pouffes made from braided yarn or faux jute. Try a chunky knit or salsa stripe design (from £65, John Lewis), or one from Cane-line which specialises in weatherproof garden gear. Designs are modern and sleek with a chunky durable weave, and filled with QuickDry foam in taupe or grey (from £345, Barker and Stonehouse).Weatherproof cushions As well as bringing much-needed comfort to your garden seating, the addition of cushions allows you to enhance the luxurious feel of your outdoor space.",
        "Outdoor cushions come with water-resistant coating and filling that is less absorbent, so if they get caught in a shower they dry faster.",
        "At design house Andrew Martin, outdoor cushions are filled with hollowfibre lightweight pads which act much more like feathers, which also means you can plump them or give them a chop without them springing back.The beauty is that they can be used indoors, too, if you choose a design that complements your colour scheme. Try the range at Furn if you're feeling wild enough to inject a jungle theme and bold colours (from £13).For a classic look you might like the Lille yellow stripe from Laura Ashley (£35, Next). Alternatively, splash out on modern geometric designs at Jonathan Adler (from £78) or Andrew Martin with colours such as lava orange and tropic pink to match your garden cocktails.The new Courtyard collection is inspired by an antique textile featuring a mosaic of floral petals. They are finished with washable velvet piping (from £58.50).Adaptable fairy lights For atmosphere, hang outdoor fairy lights from a pergola or following the shape of a tree. Outdoor pendant lights can be suspended over a dining table, while exterior table lamps make outdoor seating areas cosy and intimate.Fairy lights for the garden can always double up as Christmas lights so they won't go to waste during the winter. ",
        "You can also super-size using festoon lights which are larger, such as the selection from Garden Trading (from £35). A new class of cordless lamps would do well in the garden — a rechargeable table light that you can place anywhere. The designs by Matthew Williamson are reminiscent of those in chic, intimate members bars, cabaret clubs or hotel dining tables from eras gone by.The Phileas lamp is a hi-tech cordless one that lasts up to ten hours and is dimmable, so you can adjust the lighting level to suit the mood. The base is finished in antique brass and there's a choice of shades in vibrant colours (from £140, Pooky). The designs will impress inside and out.Recycled rugsA floor covering will take your home and garden to the next level. Indoor/outdoor rugs are increasingly made from 100 per cent recycled plastic so you can feel even better about your purchase. Crucially for those with pets and children (or messy guests) these rugs are durable, stain-resistant, weather-proof and washable.Style and practicality are in designs at John Lewis, from block colours to busy Aztec patterns (from £55).You'll find new boho designs this summer at Weaver Green in shimmering blues, pinks and saffron golds (from £155). They're made from recycled plastic bottles, which makes much more valuable use of the resources that go into making the bottles in the first place, such as oil and water.",
        "Call to the barMake room on your patio or decking for a bar trolley to house drinks and snacks. It's the ideal accessory for styling canapés and drinks for a garden party, or inside the house for a dinner party — or simply using as an extra storage solution in the kitchen or dining area.Choose from a sleek metallic design or rattan to blend into your garden. Finding one on wheels means you can easily transport it from inside to out. The Moreton kubu rattan trolley comes with a shelf and side caddy to store place mats on the side (£425, The White Company). The glitzy Kara circular drinks trolley will add a touch of glamour with its brassy gold finish (£375, Graham and Green).You could also try a freestanding shelving system from String for bespoke storage — you design yourself. The galvanised panels are weatherproof; the metal will age but won't corrode. When entertaining outside is no longer an option later in the year, it can double up inside as a helpful unit in the kitchen, pantry or utility room (from £148)."
    ]
}