{
    "articleURL": "/tvshowbiz/article-12055303/Sam-Smith-puts-glitzy-display-gold-ensemble-perform-Oslo.html",
    "content": [
        "Sam Smith put on a glitzy display as they took to the stage at the Oslo Spektrum in Norway on Saturday after recently cancelling a string of shows on their Gloria tour.",
        "The singer, 30, postponed an array of shows as they battled a mystery illness but looked back in fighting form as they put on an energetic performance in Oslo. Sam, who is non-binary and goes by they/them pronouns, appeared to be in jovial spirts as they flashed a huge smile while performing and talking to the audience. The Unholy hitmaker sported a very extravagant costume made up of gold trousers and a white shirt, worn underneath an intricate metallic corset.They also sported a gold hat and were joined on stage by an array of glamorous backing singers as they showed off their moves.",
        "Sam appeared to be fully recovered as they danced across the stage and belted out their best-known hits while standing on a huge gold sculpture.The star also appeared to be in their element as they sang to the large crowd while adorning a massive grin throughout the entire performance. Their latest show comes after they cancelled two gigs last week after being struck down by a mystery illness.Last Monday, Sam had taken to their Instagram Stories to tell fans they would not be able to perform at the Resorts World Arena in Birmingham the next day as they were well not well enough, postponing the show until next month.",
        "Just days earlier, Sam had pulled out of performing at the OVO Hydro Arena in the Scottish city of Glasgow on Saturday.Sam announced: 'Sailors, I am so sorry to let you know that my team and I are still really not well, so unfortunately we need to reschedule our Birmingham show to the 27th of May 2023.'It's so important to me that we give you the very best version of Gloria. I don't want you to experience it at anything less. 'Thank you so much for understanding, I know how excited everyone is to see the show, and I feel the same about seeing all of you. ",
        "'All previous tickets are still valid for the new date. For more information, go to my website www.samsmithworld.com. All my love, Sam X.'Sam also posted a picture of themselves dressed in flowing white robes while sitting on a white block in front of a gold background, with the information of the new date for the show.The star reassured fans that all tickets would be valid for the new date of Saturday 27 May.Sam had earlier pulled out of their gig in Glasgow on Saturday after they were originally struck down by the mystery virus.Announcing the news on Instagram, Sam shared that they would not be able to perform at the OVO Hydro Arena in the Scottish city at the weekend as they were not well enough.",
        "Sam explained how they and their team were feeling 'really unwell' but they would be rescheduling the gig for next month.Sam wrote on Instagram: 'Sailors, I'm so sorry to say but we have to reschedule the Glasgow show to 25th May 2023.'Myself and a lot of my team have been hit with a virus, that's made us really unwell.'I want to give you the best version of Gloria the Tour and at the moment that's not possible.'It was also really important to me that we had another date to move this to straight away.",
        "'We will celebrate Gloria together!! All previous tickets are still valid for the new date. For any more information go to my website www.samsmithworld.com. All my love, Sam.'The pop star has recently found themselves at the centre of some harsh criticism from online trolls for their choice of on-stage attire.Some branded the recording artist 'satanic', after the star previously revealing they were shockingly spat at in the street after announcing they were non-binary.However, Sam has continued to brush off any negative reaction and taunts as they remain confident in their performance art and strong public image."
    ]
}