{
    "articleURL": "/news/article-12057665/Lionel-Richie-fans-disappointed-awful-performance-King-Charles-Coronation-concert.html",
    "content": [
        "TV viewers have slammed Lionel Ritchie's 'awful' performance at King Charles' coronation concert by comparing it to 'karaoke in the pub'.  ",
        "Concert watchers accused the Motown legend of 'butchering' his own songs, as they asked what had happened to the 73-year-old's voice. Millions watched as the singer performed a set alongside pop icons including Katie Perry and Take That. The concert was attended by the 20,000 spectators including the Royal Family and prime minister Rishi Sunak. However, viewers seemed baffled by the singer's 'ropey' performance at the Windsor Castle show, where he sung the Commodores' classic 'Easy' and his 1983 chartbuster 'All Night Long'.",
        "People on social media were quick to pile in on the Alabama born musician, as some even said they wish they hadn't bothered tuning in. ",
        "Disappointed onlookers also mocked the music icon's voice, with one even comparing Lionel Ritchie's singing to that of Kermit the Frog's.Watchers of the show were more direct as they suggested Lionel Ritchie's performance at the coronation show simply 'wasn't very good'. Lionel Ritchie fans also took to the internet to say they wouldn't be seeing him live in the future, and that they were glad they hadn't bought tickets to his concerts. One fan even said he planned to cancel his tickets to see the singer after watching his performance at the Windsor Castle show.Viewers said Lionel Ritchie sounded like a 'club singer'  as they accused him of ruining his own classic songs. ",
        "Nonetheless, some viewers took a more sympathetic approach, as they suggested it should be obvious Lionel Ritchie doesn't sound the same as he did 40 years ago. Others praised the singer for actually singing live instead of miming his songs, as they suggested it was impressive the R&amp;B star was still performing in person. The concert at Windsor Castle was held to mark the coronation of King Charles III on Saturday at Westminster Abbey. Lionel Ritchie was born in Tuskegee, Alabama in 1949 before rising to fame in the 1970s as the lead singer of Motown group the Commodores. The singer later took up a solo career in the 1980s, before releasing hit songs including 'All night long'. ",
        "The criticism of Lionel Ritchie's performance came after viewers gave scathing reviews of King Charles' coronation concert.Those watching it on TV also hit out at the quality of the concert's sound systems. Audience members seeing the show live at Windsor Castle did not seem to be affected by any sound issues. However, those on social media blamed a faulty microphone for making some of the performances sound 'awful'.Some questioned whether there was a 'problem' with the sound systems that was affecting the quality for at-home viewers. One viewer said: 'The sound of the main microphone is awful for all those who used it.' Another said: 'This is a cruise ship concert. It's absolutely shocking.' "
    ]
}