{
    "articleURL": "/wires/aap/article-12052437/Some-online-games-fuel-nightmares-anxiety-kids.html",
    "content": [
        "Children as young as four are being exposed to nightmare fuel that could set them up for a lifetime of anxiety.",
        "Animated online games such as Rainbow Friends, and video clips of people playing them, might seem innocuous but their benign names often hide more sinister content.Rainbow Friends is a Roblox horror experience that turns a seemingly welcoming environment into a terrifying nightmare.It's similar to content such as Piggy, Five Nights at Freddy's, Poppy Playtime, or the more well-known Huggy Wuggy.The gamer poses as an unnamed child who has been kidnapped during a school trip to an amusement park called Odd World.Some videos of Rainbow Friends animations on Youtube have had as many as four million views while the game itself - which is played on Xbox, mobile devices and PCs - has had more than one billion visits.Despite being PG-rated for mild violence - its creators claim it's suitable for children over nine years old - children aged much younger are being exposed.While there is no substantial research on the issue, anecdotal evidence from a number of child educators suggests children accessing such content are more prone to act out, sometimes violently, or display anxious behaviour.A kindergarten teacher in Melbourne's eastern suburbs, who declined to be named to protect the identity of her students, said last year several boys in a class for four-year-olds had seen Rainbow Friends.",
        "\"My colleagues and I were seeing them play and talking about some characters. We had never heard of it before so did some research and it really shocked us that they knew so much about it,\" she told AAP.The main concern was that four- and five-year-olds were being exposed to age-inappropriate content, although it was noted that they often had older siblings which made it easier to access.Child psychologist Deirdre Brandner said stories of children as young as four accessing similar content were concerning because their developmental age meant the line between pretend and reality can be blurred.\"It starts with something quite benign and engaging and it's actually the shift from that to the darkness that is the most distressing for children,\" she told AAP.\"By then, they have developed trust in that character and then it turns out to be something they are not expecting.\"She said characters in these kinds of online content force kids to lose trust and brings a cautiousness that develops across everything they do.This could include being scared while watching a Disney show or even Bluey, she said.\"That's when we see increases in anxiety and, you know, there is a correlation between what children are being exposed to, and anxiety and the fact that particularly for this age group - it's a very, very vulnerable place that these children find themselves in,\" Ms Bradner said.",
        "\"It is important to talk to your kids, and other parents, about what they are watching or what their friends are watching.\"Cybersafety expert Susan McLean says it's paramount that parents take control of what their children are exposed to online.\"If we applied the same rules to parenting in the real world - if we let our three-year-old aimlessly wander the streets and hope for the best, you know that wouldn't work,\" she said.\"So why do parents think that the internet is different? It is not. It is far more dangerous than the real world for little young people.\"She said unsupervised children using devices often stumbled upon content not meant for their eyes.An example of this is Shrek the Rapist, which comes up when searching for videos of the G-rated Shrek movie.It is also important to have tough conversations in the playground with other parents about what their kids are watching - because often what one parent thinks is appropriate, isn't necessarily appropriate for another child.Roblox is a user-generated content platform, which means the games and virtual experiences on the platform are not built by Roblox but by a community of more than 12 million creators and developers.Roblox told AAP in a statement that it encouraged parents to determine what experiences were appropriate for their children by providing a suite of Parental Control features.",
        "Those controls can be used to restrict what games and experiences kids can access, as well as who they can interact with and how much they can spend.\"Parents can set restrictions based on the age recommendation assigned to individual games and experiences on Roblox, with three age categories to choose from: content recommended for \"All Ages\", content for users \"9+\", or content for users \"13+\",\" it said.\"In the case of Rainbow Friends, the game is not playable for accounts that have been age-restricted to either the \"All Ages\" or \"9+\" categories.\""
    ]
}