{
    "articleURL": "/wires/reuters/article-12057239/Warburg-Advent-lead-acquire-Baxters-biopharma-unit-sources.html",
    "content": [
        "By David Carnevali and Anirban Sen",
        "NEW YORK, May 7 (Reuters) - A private equity consortium comprising Warburg Pincus and Advent International is in advanced talks to acquire medical device maker Baxter International Inc's biopharma solutions business in a deal that could reach or exceed $4 billion, people familiar with the matter said on Sunday.Warburg Pincus and Advent have submitted the most attractive offer to Baxter in an auction that attracted interest from other private equity firms as well as major players in the biomedical sector such as Thermo Fischer Scientific Inc, the sources said.The buyout consortium has turned to other private equity firms to help fund the deal as direct lenders, one of the sources added.There is no certainty that Warburg Pincus and Advent will successfully complete negotiations to acquire the unit and Baxter may still opt to sell to another bidder or keep the business, according to the sources. They requested anonymity because details of the sale process are confidential.Baxter, Warburg, Advent and Thermo Fisher did not immediately respond to requests for comment.Baxter's biopharma solutions unit supports drugmakers in the formulation, development and commercialization of drugs typically given by infusion or injection, such as biologics and vaccines.Baxter, which has a market value of $23 billion, said in January it would explore a sale of the unit to \"enhance focus and improve capital structure\", a reference to its push to shed non-core businesses and pay down debt its $16.4 billion debt pile.",
        "Baxter also plans to spin off its renal care and acute therapies units. The company said dialysis operations, which are a part of Baxter's renal care unit, had become a drag on its margin.Medtronic Plc, another medical device maker, unveiled a plan in October to spin off its patient monitoring and respiratory interventions businesses, which have since attracted interest from potential buyers. (Reporting by David Carnevali and Anirban Sen in New York; editing by Diane Craft)"
    ]
}