{
    "articleURL": "/tvshowbiz/article-12039641/Zara-McDermott-puts-eye-popping-display-busty-rainbow-bikini-Marbella.html",
    "content": [
        "Zara McDermott put on an eye-popping display in a busty rainbow bikini as she enjoyed a family holiday to Spain. ",
        "The former Love Island star, 26, posted a slew of snaps from her latest getaway, where she is staying at the Puente Romano beach resort in Marbella. Taking to Instagram on Tuesday evening, Zara showed off her natural sun-kissed complexion from a few days of basking in the heat. She looked sensational as she showed off her ample assets in a rainbow bikini, which she later revealed to her eager fans was from the F&amp;F range at Tesco. The stylish two-piece was tied in a bow at the centre of the bust and by the waist, drawing attention to her figure.  ",
        "The star relaxed on some sun loungers as she posed for the sexy snaps, displaying her very toned stomach and incredible legs. She opted for no make-up for a relaxed day by the pool, pulling her ombré tresses away from her face with a pair of much-needed sunglasses.  Captioning her post, Zara wrote 'some Marbella snaps', accompanied by cloud, sparkle and heart emojis. In another saucy pic, Zara ate a chocolate brownie while donning a red and white onesie from Next - again showcasing her enviable figure.  Her holiday comes after boyfriend Sam Thompson revealed it was his desire to become a dad that finally pushed him to get help for his ADHD.",
        "The former Made In Chelsea star, 30, who was recently diagnosed with attention deficit hyperactivity disorder (ADHD), opened up about his struggles on Sunday.The TV personality admitted he 'does really want kids' one day but felt like he couldn't 'even look after himself' and need to find a way to deal with it.He told OK! magazine: 'A big thing for me was kids, I do want kids and I want to know I can look after a child. I want to know I'm the provider and I'm the carer and that I can be the security that child needs to grow up.",
        "'I was like, \"I don't feel like I can even look after myself a lot of the time.\" The older I was getting, the more I was thinking about that.'The couple have had a busy time of late, after a romantic getaway in the Maldives.But they sparked speculation among fans as they continued to share insights into their trip. The Made In Chelsea stars enjoyed a host of once-in-a-lifetime activities during their trip to paradise, including a turn of swimming with sharks, snorkeling in the Indian Ocean and parasailing.Yet one of their new pictures left their fans scratching their heads, as a snap taken at nighttime, showing Zara with her hand placed on Sam's chest - with ring finger concealed - while they locked lips, leading to confusion about their marital status. ",
        "The comments section underneath the shot - shared by Sam - was flooded with curious well-wishers enquiring over whether he had popped the question. The image particularly threw his Made In Chelsea co-star and pal Josh Patterson, who penned: 'Genuinely thought this was a proposal photo, was about to start a wish list for the stag!' - joining a legion of fans in the confusion. Fellow followers wrote: 'I really thought it was an engagement [photo] too... let us all down here not proposing... me too, I thought about time and what a perfect place to have proposed!... it’s got to happen soon!... ",
        "'We all thought this... Ask her to marry you already!!!!... thought the same!... I have never wanted a couple I don't know to get engaged more than you two!'Zara's ring finger was left pointedly masked in the image. Neglecting to provide any mention of marriage in the caption, Sam wrote under the picture: ‘Sam the sunsets out get the tripod we need to do a kissing picture!'...'Jokes aside what a 2 weeks we’ve had. Travelling seeing the most beautiful sights with my best friend and soulmate. I’m so lucky. Love you so much goose. Memories I’ll never forget'."
    ]
}