{
    "articleURL": "/wires/ap/article-12056775/Yellen-No-good-options-Congress-fails-act-debt.html",
    "content": [
        "WASHINGTON (AP) - Treasury Secretary Janet Yellen said Sunday that there are \"no good options\" for the United States to avoid an economic \"calamity\" if Congress fails to raise the nation's borrowing limit of $31.381 trillion in the coming weeks. She did not rule out President Joe Biden bypassing lawmakers and acting on his own to try to avert a first-ever federal default.",
        "Her comments added even more urgency to a high-stakes meeting Tuesday between Biden and congressional leaders from both parties.Democrats and Republicans are at loggerheads over whether the debt limit should even be the subject of negotiation. GOP lawmakers, led by House Speaker Kevin McCarthy of California, are demanding spending cuts in return for raising the borrowing limit, while Biden has said the threat of default shouldn't be used as leverage in budget talks.Yellen, interviewed on ABC's \"This Week,\" painted a dire picture of what might happen if the borrowing limit is not increased before the Treasury Department runs out of what it calls \"extraordinary measures\" to operate under the current cap. That time, she said, is expected to come in early June, perhaps as soon as June 1.\"Whether it´s defaulting on interest payments that are due on the debt or payments due for Social Security recipients or to Medicare providers, we would simply not have enough cash to meet all of our obligations,\" she said. \"And it´s widely agreed that financial and economic chaos would ensue.\"An increase in the debt limit would not authorize new federal spending. It would only allow borrowing to pay for what Congress has already approved.",
        "Biden's White House meeting with McCarthy, House Minority Leader Hakeem Jeffries, D-N.Y., Senate Majority Leader Chuck Schumer, D-N.Y., and Senate Minority Leader Mitch McConnell, R-Ky., will be the first substantive talks between Biden and McCarthy in months.",
        "House Republicans on April 26 passed a bill that would raise the debt limit but impose significant federal spending cuts. But those cuts are unlikely to win the support of all Republicans in the Democratic-controlled Senate, and Biden has said he will only negotiate about government spending once Congress takes the risk of default off the table.Arizona Sen. Kyrsten Sinema, an independent who left the Democratic Party in December, encouraged Biden and McCarthy to meet each other half way.\"There´s not going to be just a simple clean debt limit - the votes don´t exist for that,\" she told CBS´s \"Face the Nation.\" \"So the sooner these two guys get in the room and listen to what the other one needs, the more likely they are to solve this challenge and protect the full faith and credit of the United States of America.\"Yellen was asked on ABC whether Biden could bypass Congress by citing the Constitution´s 14th Amendment that the \"validity\" of U.S. debt \"shall not be questioned.\" Yellen did not answer definitively, but said it should not be considered a valid solution.\"We should not get to the point where we need to consider whether the president can go on issuing debt. This would be a constitutional crisis,\" she said.",
        "\"What to do if Congress fails to meet its responsibility? There are simply no good options,\" she added.Sen. James Lankford, R-Okla., agreed about the risks of invoking the 14th Amendment, He told ABC that the Constitution is \"very clear that spending -- all those details around spending and money actually has to come through Congress.\"He criticized Biden for not being willing to negotiate on spending cuts, arguing the debt limit exists to force a broader conversation on government outlays. \"It´s about not just debt that´s incurred,\" the senator said. \"But it´s also raising the limit of what we can continue to be able to add on this.\"The 14th Amendment question was studied by Obama administration lawyers during the 2011 debt limit showdown, which informed Biden´s refusal to negotiate now with Republicans on raising the debt limit. At the time, Justice Department lawyers said they did not believe the president had the unilateral power to issue new debt.Biden, in an interview with MSNBC on Friday, was asked about the 14th Amendment proposal, saying, \"I´ve not gotten there yet.\"Republican Rep. Mike Turner of Ohio, chairman of the House Intelligence Committee, and the committee's top Democrat, Connecticut Rep. Jim Himes, told CNN's \"State of the Union\" that the debt limit debate posed a national security threat.",
        "\"The Russians and the Chinese would seek to exploit it,\" Himes said. \"The United States has never really come close defaulting on its debt before. So it´s hard for us to imagine what that might look like.\"Turner argued that Biden would bear the brunt of the responsibility. \"I think if the president fails to negotiate with Congress and has continued out-of-control spending that threatens our economy, that it is a national security threat,\" he said."
    ]
}