{
    "articleURL": "/wires/pa/article-12051409/Volunteer-1953-coronation-says-King-hard-act-follow.html",
    "content": [
        "An 89-year-old St John Ambulance volunteer who was on duty for the late Queen’s coronation said he remembers her crowning ceremony as “joyful” as he predicts she will be a “hard act to follow” for Charles.",
        "Derek Williams has met Elizabeth several times over the past 70 years through his volunteering work and being made an MBE, as well as attending garden parties at Buckingham Palace with the service.In 1952 he joined the St John Ambulance service, aged just 18, when he was invited by a friend, and for the Queen’s big day in 1953 he was stationed near Selfridges on Oxford Street.Mr Williams, who will be watching Charles’ coronation from home in Betchworth, Surrey, said: “It was an honour to be part of the coronation and to provide service to the public.“People were very, very joyful. Some had camped overnight, as they are doing now, there was no animosity or anything like that. They were joyful, friendly, and pleased to be there, I think.”On his meetings with Elizabeth over the years, Mr Williams said: “At the garden parties, before the general public was let in, the Queen would come out to thank everybody.“She thanked the catering staff, and other people involved.“Obviously she had the Master of the House with her and several of her corgis.“I don’t think I would have touched them though!”",
        "He added: “She was a very friendly lady. There’s no barriers between her. She always asked how people are.",
        "“You don’t ask questions to her, but she was always interested in people, interested in what people do.”For his volunteering work Mr Williams was made an MBE in 1993, and was given the honour by the Queen.He said: “When she presented me with my MBE she asked where I do my volunteering, and I told her London, she remarked, ‘a very busy place’.“I said, Yes Ma’am!’”",
        "On how Charles will fare as King, Mr Williams said: “I think Charles will be a good king.“I think he has got some waves to surf over before, to try to smooth his reign, but I think he will be a good king.“Mainly because of his upbringing, he has learned to intermix with people, he is not frightened to ask questions.“He has a background of going to various schools, a military background.“I think he has been shaped for the role with the help of his mother.“I think she will be a very hard act to follow.“If I could say anything to the King, I would thank him for everything he’s done for our country so far and wish him all the best for a long and prosperous reign.”"
    ]
}