{
    "articleURL": "/wires/reuters/article-12057707/Balk-scores-game-winning-run-Marlins-beat-Cubs-14.html",
    "content": [
        "The Miami Marlins scored the tiebreaking run on a 14th-inning balk -- overcoming Sandy Alcantara blowing a two-run lead in the ninth -- to snap a five-game losing streak with Sunday's 5-4 road win over the Chicago Cubs.",
        "Each team scored a run in the 10th and 13th innings. Then, with Garrett Hampson on third base in the 14th, Chicago's Adbert Alzolay (1-2) was called for a balk by home-plate umpire Alan Porter to bring the eventual winning run home. Andrew Nardi kept the Cubs scoreless in the bottom of the 14th, and Miami won its first game in May to improve to 11-0 in one-run contests.Chicago was down 2-0 entering the ninth against reigning NL Cy Young Award winner Alcantara, who was looking for his second complete game of the season. However, Ian Happ (two hits) singled with one out and scored on Cody Bellinger's double into the left-field gap. Bellinger (two hits) then scored on Eric Hosmer's RBI single off Alcantara, who exited after allowing nine hits while striking out nine without a walk on 113 pitches.Chicago got a third straight strong effort from starter Hayden Wesneski, who allowed only five hits, including Yuli Gurriel's fifth-inning solo homer, and fanned six without a walk through six innings. Miami added a run in the eighth on an RBI single from ex-Cub Jorge Soler.However, Marlins manager Skip Schumacher opted to stay with Alcantara, who tossed a three-hit complete game during a 1-0 victory over Minnesota on April 4, but he was unable to keep the Cubs down one last time.",
        "Joey Wendle, activated off the injured list earlier in the day, hit an RBI triple for Miami in the top of the 10th. The Cubs responded with Nico Hoerner's RBI single. Jazz Chisholm Jr. hit a sacrifice fly to put the Marlins up 4-3 in the 13th but Happ drove in Hoerner to tie it again.Steven Okert (1-0) allowed that run in the 13th but picked up the win for Miami.Rookie Matt Mervis and Nick Madrigal also had two hits for the Cubs, who took two out of three in the series following a 1-6 road trip to Miami and Washington.In terms of innings, this is the longest major league game played thus far in 2023.--Field Level Media"
    ]
}