{
    "articleURL": "/property/article-12046507/Stunning-Grade-listed-12-bedroom-mansion-goes-market-32million.html",
    "content": [
        "The sprawling estate includes a Grade I 12-bedroom house and a cricket pitch The estate near Maidstone, Kent, is said to be a 'jewel in the heart of England'A stunning 440-acre 'quintessential' English estate has gone on the market for a whopping £32m.",
        "For the hefty price tag, Linton Park includes a Grade I Listed 12-bedroom house, parkland, a lake and a cricket pitch as well as a portfolio of 16 other properties.Estate agents Strutt &amp; Parker, who are selling the estate near Maidstone, Kent, say it is a 'jewel in the heart of England'.The current owners bought the property in 1985, a UK company called Camellia Group PLC, and embarked on a long-term project to restore the neglected estate to its former glory.The main house has been used as their office headquarters but planning has been granted for it to return to use as a single residential dwelling.",
        "The site dates back to the 14th century, but the first part of the present house was built in 1730.The estate passed through several distinguished families before it was split in the 1970s.The Camellia Group bought it 38 years ago and then had the opportunity to recreate the original estate when 350 acres of parkland and some estate houses and cottages were put up for sale in 2015.The estate can be split into lots, with lot 1 containing the main house, which has six reception rooms and 12 bedroom suites, a Grade II Listed lodge cottage, coach house with a flat above, a detached cottage and the Grade II Listed parkland with lake and cricket pitch.",
        "That lot is available for offers in excess of £17.5m.The residential portfolio of 13 houses and cottages is £13.5m and a 96-acre parcel of arable land and woodland is £1m.Mark McAndrew, from Strutt &amp; Parker, said: 'The Linton Park Estate is one of the most valuable and well-kept estates to be put on the open market in recent years.'The principle Grade I listed building and wider residential portfolio are in superb condition and offer a considerable revenue stream. It's not uncommon for estates of this size to be split up over the years, as was indeed the case for Linton Park.'The present opportunity for purchase of such a historic estate in its original form is extremely rare.",
        "'The current owners not only pieced the estate back together but also took on the main house and gardens in very poor repair and painstakingly restored them to their former glory.'Estates of this size and quality are jewels in the crown of this nation's landscape, and their preservation is testament to the craftsmanship, design, and considerate land use that has taken place over the centuries.'I'm sure Linton Park will attract interest from across the globe given its location, importance and history, in a market where estates of this quality are rarely available.",
        "'Linton Park has in recent years been in office use, however planning has been granted for conversion into a single residential dwelling. The sale provides the opportunity for a purchaser to own a quintessential English estate.'It is so rare to find such an elegant Grade I listed house set in the heart of its picturesque park approached by a magnificent long drive flanked by a wide avenue of trees. It is everything an English estate should be.'"
    ]
}