{
    "articleURL": "/tvshowbiz/article-12048019/Jessica-Chastain-smiles-ear-ear-leads-arrivals-Tony-Awards-nominees-event.html",
    "content": [
        "This year's Tony Awards nominations were announced earlier this week with Some Like It Hot, &amp; Juliet, Shucked and more leading the nominations.",
        "Jessica Chastain, Audra McDonald, Sara Bareilles, Josh Groban, Ben Platt and more attended the Meet the Nominees Press Day at the Sofitel Hotel in New York City. Chastain, 46, is nominated for Best Performance by an Actress in a Leading Role in a Play for A Doll's House.The Help actress looked glam in a chic taupe double-breasted suit from the Fall/Winter 2023 Michael Kors Collection.She layered the tailored jacket over a mélange cashmere tank, also by the designer, and oozed effortless elegant as she took to the red carpet.",
        "She pushed the sleeves of the suit up for an on trend look and wore her striking red hair down and straight. The Eyes of Tammy Faye actress kept her makeup a bit more understated than Tammy Faye.She had  smoky eyes in shades of brown, rosy cheeks and bright red lipstick. Audra McDonald, 52, is also nominated for Best Performance by an Actress in a Leading Role in a Play for her role in Ohio State Murders. The Private Practice alum put on a timeless look in black dress pants and a long-sleeved white blouse. Josh Groban, who is nominated for Best Performance by an Actor in a Leading Role in a Musical for Sweeney Todd: The Demon Barber of Fleet Street was spotted at the event.",
        "He was with his co-star Annaleigh Ashford, who is nominated for Best Actress in a Leading Role in a Musical",
        "Groban, 42, wore a tan suit with a white shirt and white trainers. Ashford wore a cream-colored shirt dress and matching pumps. Groban faces stiff competition in his category including Ben Platt, 29, who is nominated for his role in Parade.Platt won the Tony for Best Actor in a Musical for his role in Dear Evan Hansen when he was 23. On Thursday, he looked cool in a blue suit featuring an asymmetrical blazer and pants with slits in the front at the hem.",
        "Singer Sara Bareilles, 43, is competing with Ashford for the Best Performance by an Actress in a Leading Role in a Musical for her role in Into the Woods. The Brave singer followed the day's trend of wearing both suits and monochromatic looks.  She wore a fawn-colored suit featuring an over-sized blazer, vest and wide-legged pants which she paired with black pointy-toed pumps.The 76th Annual Tony Awards take place on June 11. "
    ]
}