{
    "articleURL": "/wires/reuters/article-12053367/Iran-hangs-Swedish-Iranian-linked-attack-killed-25-people.html",
    "content": [
        "DUBAI, May 6 (Reuters) - Iran on Saturday executed a Swedish-Iranian dissident convicted of leading an Arab separatist group accused of attacks including one on a military parade in 2018 that killed 25 people, the Iranian judiciary said.",
        "The Swedish foreign ministry said it had summoned Iran's deputy ambassador to protest the execution of Habib Farajollah Chaab, which it confirmed took place earlier in the day.Chaab had been sentenced to death for being \"corrupt on earth\", a capital offence under Iran's strict Islamic laws.Iran brought him to trial in 2022 on charges of leading the Arab Struggle Movement for the Liberation of Ahwaz, which seeks a separate state in the oil-rich Khuzestan province in southwestern Iran, and plotting and carrying out \"numerous bombings and terrorist operations\".In a statement announcing the execution, the judiciary accused the security agencies of Sweden, Israel and regional countries of backing Chaab and his group, which it said had killed or injured 450 Iranians over several years.Swedish Foreign Minister Tobias Billstrom reacted with \"dismay\" to Chaab's execution, saying Sweden had pleaded with Iran not to carry it out.\"The death penalty is an inhuman and irreversible punishment and Sweden, together with the rest of the EU, condemns its application under all circumstances,\" he said.Iran said in 2020 that its security forces detained Chaab in neighbouring Turkey and took him to Tehran, without giving details of his capture.Sweden had voiced concern over Chaab's case, and ties with Iran had also been soured over a Swedish court's life-time prison sentence for a former Iranian official for involvement in the mass execution of political prisoners in 1988 in the Islamic Republic.",
        "Iran has had tense relations with its ethnic minorities, which include Arabs, Kurds, Azeris and Baluch, and has accused them of aligning with neighbouring countries.Arabs and other minorities have long complained of facing discrimination in Iran, an accusation Tehran denies. (Reporting by Dubai newsroom; Additional reporting by Anna Ringstrom in Stockholm; Editing by Stephen Coates, Frances Kerry and Mike Harrison)"
    ]
}