{
    "articleURL": "/news/article-12039131/AOC-says-Dianne-Feinstein-89-retire-says-stance-not-anti-feminist.html",
    "content": [
        "AOC calls again for 89-year-old Dianne Feinstein to quit the Senate'I think criticisms of that stance as \"anti-feminist\" are a farce,' she wroteAnd she set out how Feinstein's absence was actually harming women New York progressive Rep. Alexandria Ocasio-Cortez said Monday that it was time for 89-year-old Democratic Senator Dianne Feinstein to retire, amid a lengthy absence from Congress due to ill health which has disrupted Democrats' efforts to confirm liberal judges.",
        "AOC is the latest member of Feinstein's own party to call for her to go, and she shrugged off complaints that such messages were sexist.'I think criticisms of that stance as \"anti-feminist\" are a farce,' she wrote on the new social media platform Bluesky.Democrats including former House speaker Nancy Pelosi and the New York senator Kirsten Gillibrand have dismissed such calls as sexist because they say men of the same age would not face the same demands. But there is no getting away from it. Feinstein is a member of the Senate Judiciary Committee and her absence as she recovers from shingles has made it difficult for Democrats to work their way through judicial nominees. ",
        "'Her refusal to either retire or show up is causing great harm to the judiciary - precisely where repro rights are getting stripped,' wrote AOC, as she made the case that Feinstein was hurting women's rights. 'That failure means now in this precious window Dems can only pass GOP- approved nominees.'It follows similar comments she made in April, after weeks of speculation about Feinstein's frailty.'I think what we're seeing is really concerning, and I think whenever a member's health and ability to serve us brought into the spotlight, it's very unfortunate, it's very sad,' she told CNN.",
        "'But I do think that what is happening right now, and the impact that the continued ability to serve is having on our ability to fill the courts, the impact that this is having on people's access to abortion care, I think this is something that is — it is unfortunately something that I think it is appropriate to consider.'It follows a ruling in Texas that threatened access to mifepristone, a common abortion pill, handed down by a conservative judge appointed under Donald Trump.The Senate's oldest member has been absent since February, and her office has given no date for her return. Democrats asked that she be allowed to appoint a temporary replacement on the judicial committee but were blocked by Republicans last month. ",
        "'Let's be clear,' said Senate Minority Leader Mitch McConnell in remarks on the Senate floor, 'Senate Republicans will not take part in sidelining a temporarily absent colleague off a committee just so Democrats can force through their very worst nominees.' In the meantime, allies in her own party have helped fend off calls that she should go.'Senator Feinstein has been a champion for California for 20 years,' former House Speaker and fellow octogenarian Pelosi told CBS News. 'She deserves that respect to get well and be back on duty.'",
        "Men would not face the same calls, she added. 'It's interesting to me. I don't know what political agendas are at work that are going after Senator Feinstein in that way. I've never seen them go after a man who was sick in the Senate in that way,' she added.But her absence comes at a critical time with Democrats' holding the slimmest of Senate majorities. The Senate is due to hold a hearing Thursday on raising the debt ceiling, after the House passed a Republican bill last week that would increase the borrowing limit but only if it came with big spending cuts.Any bill needs 60 votes to get through the Senate, and Feinstein's absence reduces Democrats' leverage by one vote. "
    ]
}