{
    "articleURL": "/tvshowbiz/article-12042717/Gillian-McKeiths-daughter-Afton-23-claims-fling-Brooklyn-Beckham.html",
    "content": [
        "Gillian McKeith's daughter Afton has claimed that she once had a fling with Brooklyn Beckham. ",
        "The 23-year-old claimed she dated the famous son of Victoria and David, 24,  when she was younger - but added she no longer 'keeps up' with what he's doing.She also told how she recently had an awkward run in with Brooklyn and his wife Nicola Peltz at an LA supermarket.  She told The Sun: 'I didn't watch any of his wedding. I actually don't keep up with what he does.'But I actually bumped into him not so long ago in Los Angeles at my local supermarket - Erewhon - and her as well. It was extremely awkward.",
        "'You know, they seem good. I wish them the best. I hope they have a really long and happy marriage.'Afton has previously told how Brooklyn blocked her on Instagram.Their fling was reportedly in between Brooklyn's relationships with Madison Beer and Chloe Grace Moretz. A source told The Star at the time: 'The romance didn't last too long but Afton definitely grew feelings for Brooklyn.'Reps for Brooklyn have been contacted by MailOnline for comment. Back in 2018, Brooklyn denied dated Scottish singer Tallia Storm, finally broke his silence in an Instagram story after she claimed they had been together.His words spurred the Celebs Go Dating star on to launch a seething attack him in an interview with MailOnline.",
        "The songstress confessed it felt like the eldest son of David and Victoria had dumped her again but this time in front his 10,800,000 Instagram followers.'We dislike each other,' she divulged to MailOnline at the time. 'I couldn't be more angry. It's like he's dumped me again! You dump me once, three years ago, and now you dump me again! ",
        "'Why does he feel the need to do it again three years later? Why is he bringing it back up again. It's exhausting!' Tallia was left fuming when she watched Brooklyn's very public denial with the rest of his followers.She explained: 'I saw the video last night – you can tell he’s so bothered. So yeah, he was cooler than me back then. Now that I’m finally doing well, it’s an exciting time for me as I’m on television and I’m looking for love again, and he is bitter about it.'I feel like he knows my weakness because he knows all the songs I wrote were about him. It was my mistake to speak so openly about my heartache.' In an Instagram Live video back then, the son of Victoria and David Beckham addressed fans' questions about his relationship with Tallia.Tallia had claimed they had a romance starting in 2014, when the pair were both 15 and Brooklyn said it's not true.",
        "She had gushed: 'We dated, it was puppy like. We kept our love all very private. We were only spotted together once.She gushed: 'We dated, it was puppy like. We kept our love all very private. We were only spotted together once. 'He came to see me perform. We kept it very private. It was real. We spent a lot of time together.'His dad used to drop him off at my house and I'd go to his. I have nothing but respect for his mum and dad.'Discussing the end of their romance, she added: 'It came to an end when I saw him in the papers with another girl. I was like, 'Oh my goodness'.Tallia channelled her heartbreak into songwriting, and revealed hat her single, Still In Love, is all about her 'puppy love' with Brooklyn.Meanwhile, last week Afton revealed she does not go out with English men because they know her mother from You Are What You Eat.The nutritionist's role on the show involved studying other people's poo and saw her labelled the 'Poo Lady'.Afton told the Mirror: 'I get nervous dating men from England as they know my mum from TV. I stopped going out with them because it was too weird.' Meanwhile, her elder sister Skylar, 28, revealed she was bullied at school because of her mother's role on the show.",
        "She said: 'I was at secondary school in London and I had people shouting down the hallway, \"Skylar, I saw your mum sniffing poo on TV last night.\" They were horrible and made fun of me. I really struggled.'She continued: 'One day, a boy pushed me against a wall and held a lighter to my face. I was like, 'I'm done', and was homeschooled for a bit.'Both sisters spoke to the publication after their mother and Shaun Ryder lost their trial and left I'm A Celebrity.They also revealed that they think their mother is 'misunderstood' and 'not irritating' and gushed about her.Afton studied musical theatre at The Italia Conti Academy of Theatre Arts in London which was attended by famous alumni including Sharon Osbourne, Naomi Campbell and Russell Brand.She now lives in Texas, and regularly shares modelling snaps to her 42k Instagram followers.Meanwhile, Skylar lives in South Dakota with her husband Aaron and their son Landon, two.Last year, Afton won Miss USA Spokesmodel and looked sensational as she posed up a storm competing in the glamour event. The red headed dancer told MailOnline that she 'worked really hard' preparing for the pageant - entering as the Sioux Falls contestant.",
        "Speaking exclusively to MailOnline, Afton shared: 'I am really proud to win because I worked hard preparing for the pageant. I got to also showcase my acting skills which was a major factor in my win and a passion of mine.",
        "'The platform is a great way to bring awareness to the importance of health and fitness which was my main focus as there was a also fitness portion in the competition.'Gillian also shared her pride for daughter Afton, explaining she was 'absolutely delighted' with the win.The Scottish TV personality detailed: 'I am absolutely delighted that Afton won the competition. I am so proud of all her achievements!",
        "Chloe MoretzChloe, now 26, was Brooklyn's first major public relationship after they met at a fitness class.  Brooklyn dated the actress for four years on and off between 2014 and 2018 until he was spotted kissing Playboy model Lexi Wood in New York, when they parted ways for good.They first called it quits in 2016 but reignited their romance again in 2017 after leaving flirty comments on each other's Instagrams.  ",
        "Sonia Ben Ammar French actress and model Sonia, 24, was in Brooklyn's life between 2015 and 2016 - while he and Chloe were in one of their 'off' stages. They reportedly dated for around five months.  Hana Cross Brooklyn dated model Hana for nine months between 2018 and 2019. But Hana was not popular with his famous parents David and Victoria as their relationship was 'turbulent' and filled with furious arguments. After their break-up, a source told The Sun that the footballer and former spice girl were 'delighted'. Hana then wrote a song about Brooklyn, calling him 'mean' after she believed they were 'meant to be'.  ",
        "Nicola PeltzThe son of Victoria and David, 23, and the actress, 27, enjoyed a whirlwind romance after first going public with their budding relationship in November 2019 when pictures emerged of them hugging before getting engaged in July 2020, just eight months later.While their relationship officially began in 2019, they actually first met in 2017 – with Brooklyn revealing during an Instagram Q&amp;A with followers that they were originally introduced at the Coachella music festival in California.They married in a lavish ceremony in April 2022. Brooklyn denied a young fling with Scottish singer Tallia Storm in 2014, and has also been linked to the likes of Madison Beer and Sofia Richie. "
    ]
}