{
    "articleURL": "/wires/reuters/article-12058475/Chinese-state-tabloid-criticises-protest-letter-South-Korean-embassy.html",
    "content": [
        "By Laurie Chen",
        "BEIJING, May 8 (Reuters) - The Global Times, a hawkish Chinese state media tabloid, on Monday criticised a letter of protest sent to it by South Korea's embassy in China, the latest public spat amid worsening ties between the Asian neighbours.The South Korean embassy \"expressed strong regret over a series of unreasonable slanderous articles\" from the Global Times, in a letter of protest published Friday on its website.The articles \"use sensational, provocative and inappropriate vocabulary to denigrate not only our leader but also the Korean government's foreign policy,\" the letter said.In its editorial, the Global Times slammed the embassy's \"brutal interference in (its) independent reporting\".Coming a day after Japanese Prime Minister Fumio Kishida made a landmark visit to Seoul, the editorial warned South Korea's recent diplomatic push towards Japan and the U.S. will \"induce and aggravate the ... collapse of the situation in Northeast Asia\".It is rare for foreign embassies stationed in China to publicly criticise the reporting of Chinese state media outlets.South Korea's embassy in China did not immediately respond to a request for comment.The Global Times, known for its nationalist rhetoric, has repeatedly attacked South Korean President Yoon Suk Yeol for \"blindly following the U.S.\" after his visit there late last month, and accused Seoul of bringing further tension to the Korean Peninsula due to its growing security ties with Japan and the U.S.",
        "Sunday's visit by Kishida, the first by a Japanese leader to Seoul in 12 years, is a sign of warming relations between South Korea and Japan as both U.S. allies have sought to close a chapter on the historical disputes that have dogged the relationship for decades.In a similar incident last December, China's ambassador in South Korea criticised Korean media for stoking anti-China sentiment. (Reporting by Laurie Chen in Beijing; Editing by)"
    ]
}