{
    "articleURL": "/wires/aap/article-12047829/NSW-ex-homicide-boss-grilled-gay-hate-inquiry.html",
    "content": [
        "The commissioner leading a gay hate crimes inquiry has cautioned lawyers after it was delayed because of a document scuffle.",
        "\"No more surprises,\" Commissioner John Sackar told lawyers on Friday, after counsel requested more time to review documents that police had sought to redact.Former homicide squad boss Michael Willing was to face a grilling on Friday about whether his officers failed to properly investigate the suspected historical murders of several gay men.With documents still being sought and hearings expected to run into June, Justice Sackar was this week granted a two-month extension to deliver his findings by August 30.\"I've got an extension formally but there's a fair bit to do, I don't want to delay this unduly,\" he said.Police submitted their application for redactions at 5pm on Thursday, Justice Sackar was told.The commission's lawyers were given two weeks to sort through document redactions with NSW Police.Mr Willing is set to return to the stand on May 15.The former top cop last took the stand in the royal commission-style inquiry in February, where he was questioned over two days about Strike Force Neiwand's examination of more than 50 suspects involved in the murders of three gay men in the 1980s.Mr Willing will be quizzed about the death of slain American mathematician Scott Johnson, whose 1988 death was initially ruled a suicide before the case was reopened in 2012 following pressure from his family.",
        "A coroner in 2017 determined the matter involved human intervention and in February Scott White pleaded guilty to Mr Johnson's manslaughter in the NSW Supreme Court.Mr Willing's team's responsibility to properly investigate Mr Johnson's death, including whether police turned a blind eye to several suspects, will also be raised.The inquiry will explore former detective Pamela Young's controversial interview on ABC Lateline in 2015, where she told the program Mr Johnson likely took his own life, while investigations were ongoing.Former NSW police officer Duncan McNab says the inquiry's work is imperative and important.\"These inquiries stimulate the memories of people who might just know that little bit and who finally grow a spine after being too scared to come forward,\" he told AAP.\"But it's a bit like musical chairs at this stage, no one wants to take responsibility for what was actually a complete screw-up.\"Lifeline 13 11 14beyondblue 1300 22 4636"
    ]
}