{
    "articleURL": "/wires/ap/article-12051999/Will-gambling-case-Alabama-ripple-college-sports.html",
    "content": [
        "Alabama fired its baseball coach this week amid an investigation into suspicious bets involving a Crimson Tide game at LSU.",
        "The school did not give details about why Brad Bohannon was let go, saying only that he violated \"the standards, duties, and responsibilities expected of university employees.\"This appears to be the first major gambling scandal in college sports since a Supreme Court decision five years ago paved the way for states to legalize wagering on sporting events.How were potential improprieties spotted? And what have schools and conferences been doing to safeguard competition since legal sports betting has become widespread in the United States?RED FLAGAlabama lost 8-6 at top-ranked LSU on April 28 in a game in which the Crimson Tide's top starting pitcher was a late scratch with an injury.A Louisiana gambling official who received a report from an sports integrity monitor said two bets were placed in Ohio at a sportsbook located in the Cincinnati Reds stadium, Great American Ball Park.Matthew Holt, the president of U.S. Integrity, said the operators of the sportsbook alerted his company to \"abnormal activity.\" U.S. Integrity alerted state gambling and gaming associations. After collecting information from other states, U.S. Integrity reported back to Ohio regulators, who opened an investigation.Sporting events all over the world are monitored for potential issues. Holt said U.S. Integrity sends out about 15 alerts per month to sportsbook operators, sports leagues and organizing bodies it has as clients. Its client list includes the Southeastern Conference, home to both Alabama and LSU.",
        "WHY DID OTHER STATES SUSPEND WAGERING ON ALABAMA BASEBALL?New Jersey, Pennsylvania and Indiana also pulled Alabama baseball off their boards.\"You have to remember this is really new in a lot of these states and they´re still figuring out how they want to handle it,\" Holt said. \"You know, not surprisingly, the more experienced states New Jersey and Pennsylvania, they know that the safest bet when there´s a potential issue is to take that event off the board.\"HOW IS SPORTS WAGERING MONITORED?U.S. Integrity, for example, analyzes data that includes real-time odds and wagering at sportsbooks to try to spot irregular activity. The company also monitors online chatter on social media and other websites.\"All kinds of information, some of which human beings are looking through, some of which the machines are identifying using algorithms,\" he said. \"The second way alerts are catalyzed, which is what happened in this instance, is operators identify some type of abnormal, nefarious, suspicious activity.\"In most states, sportsbooks are required to work with independent monitors.SCANDALSCollege sports has had its share of gambling-related scandals through the years, including point-shaving in basketball and football where the final scores of games were improperly impacted.Initial indications are what happened with Alabama baseball was not point-shaving.",
        "A person familiar with the investigation told The Associated Press on Thursday that no evidence indicates athletes were involved. The person spoke on condition of anonymity because of an ongoing investigation by the school.The NFL recently suspended five players for violating the league's gambling rules. Holt said the Alabama case is different.\"What we´re not used to is it involving a coach,\" Holt said. \"I think the coach is supposed to be the mentor, the role model. And that´s the difference here.\"ESPN reported that sportsbook surveillance video indicated the person who made the suspicious bets in Cincinnati on Alabama´s game was communicating with Bohannon at the time.\"The natural comparison a lot of people are going to draw is Pete Rose,\" said sports gambling expert John Holden, an associate professor in the Oklahoma State School of Business. Rose was banned from Major League Baseball for betting on games while manager of the Cincinnati Reds.OVERSIGHTThe NCAA, the largest governing body for college sports in the country, p rohibits athletes and athletic department employees from gambling - even legally. And conferences partnered with integrity monitors even before legalized wagering on sporting events became pervasive.But college sports leaders have looked for both increased protections and ways to tap into the gambling revenue streams over the last five years. The Mid-American Conference was the first to jump in, licensing the rights to its data and statistics to a company called Genius Sports, which will in turn sell it to sportsbooks under a five-year deal announced in 2022.",
        "\"Now institutions and conferences are even owning their own data (from sporting events). There's only one reason to own the data and that's because it can be managed and sold to gambling interests,\" former Big 12 Commissioner Bob Bowlsby said. \"It's a constantly changing environment, but I wouldn't say that I feel confident that, with the prevalence of gambling, that there aren't people who are seeking to affect the integrity or outcome of games.\"GOOD SIGN?Holt said said the Alabama case is actually an example of the benefits of legalized wagering.\"It proves that regulated sports betting and transparency into the marketplace that we have now, it works,\" he said. \"When people do nefarious things, we catch them.\"___AP Sports Writers John Zenor and Eric Olson contributed.___AP college sports: https://apnews.com/hub/college-sport and https://twitter.com/AP_Top25 and https://apnews.com/hub/sports-betting"
    ]
}