{
    "articleURL": "/femail/article-12050221/King-Charles-Coronation-viewers-bewildered-spotted-two-spare-Camillas.html",
    "content": [
        "Annabel Elliot and Lady Lansdowne were dubbed the 'two spare Camillas'CORONATION LIVEBLOG: Click here to follow live updates throughout the dayMillions of royal fans watched the historical moment the King and Queen were crowned at Westminster Abbey this morning.",
        "However, as King Charles entered the Abbey, some people joked that there were two other women who, with their short blonde locks and their lengthy white gowns - appeared to be doubles of the Queen. The two women in question were, in fact, Queen Camilla's Coronation companions, her sister Annabel Elliot and close friend The Marchioness of Lansdowne.Broadcaster Nicola Thorpe went viral on social media after tweeting: 'Nice to see they brought two spare Camillas just incase'. The post also showed a photo from the ceremony of the two women who were donning white dresses that looked like the one worn by the Queen along with similar blonde bouffant hairstyles.  ",
        "The hilarious post went viral, being viewed over 712,000 times and racking up an impressive 20.5k likes, and other social media users were quick to chime in agreement.One user replied: 'I said this - they've got the Camilla look.'While another said: 'Hahaha I was like \"who are the lookalikes\"? Are they her ladies in waiting?'A third person commented: 'I thought the one on the right was actually Camilla.'Later in the day, another joked: 'Why are there two spare Camillas on the balcony?'The royal axed the centuries-old tradition of having ladies-in-waiting as part of her retinue last September - instead opting for a smaller number of 'Queen's companions'.",
        "Fiona Clare created two long, ivory dresses for Her Majesty's Companions, designed to complement each other whilst retaining individual touches in terms of the embroidery and choice of fabric.Silver edging features on The Marchioness's, whilst Annabel's has a standing collar and hand-embroidered detail.",
        "Camilla has today been crowned with Queen Mary’s Crown by the Archbishop of Canterbury in Westminster Abbey, as Buckingham Palace officially confirmed her title.Archbishop of Canterbury Justin Welby placed the 112-year-old crown on her head following the anointment of her husband.As he did so, he recited an open prayer: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues.'Reign in her heart, oh king of love. That being certain of thy protection, she may be crowned with thy gracious favour. Through Jesus Christ our Lord.'The Queen was then handed the royal sceptre as the archbishop completed his proclamation.The monarch and his wife smiled to the congregation as they walked through the church for a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.The royal had her two confidantes by her side throughout the festive ceremony.",
        "The late Queen had around seven devoted ladies-in-waiting – affectionately dubbed the head girls – at the time of her death, some of whom had been by her side for more than 60 years.",
        "They dealt with everything from public and personal correspondence and organising the royal diary to accompanying the monarch on engagements, collecting flowers and arranging private family events.They were also loyal companions to the monarch and operated as her eyes and ears in the Palace.The roles were unpaid and holders were almost always picked from the upper echelons of the aristocracy as there are few wealthy enough to be able to afford to take on such a demanding position simply out of loyalty to the Crown.But with most of the existing holders of the roles, due to retire, Camilla has decided to organise things 'a little differently'."
    ]
}