{
    "articleURL": "/sport/cricket/article-12043791/PAUL-NEWMAN-Smirking-Smith-got-one-England-unveiled-Sussex-colours.html",
    "content": [
        "Smith will warm-up for Ashes by playing three County Championship matchesBroad was right to dismiss last Ashes because of suffocating Covid restrictionsTest swansong would have been fitting for 41-year-old bowler Tim MurtaghYes, I get the counter-argument. I can understand that the presence of Steve Smith and other leading Aussies in this year’s County Championship can improve standards, help the development of English players and provide great entertainment for spectators.",
        "Certainly, Sussex coach Paul Farbrace talks compellingly of the influence Smith, in particular, will have in his brief spell at Hove as he tries to instil a winning mentality in a talented group of young players who have barely known what it is like to taste victory.But to be at Hove on Tuesday to see a smiling Smith unveiled in Sussex colours was a reminder of the very different preparation he will have to leading English players for the cricket that still matters more than anything — the Ashes.While Smith, Marnus Labuschagne, Marcus Harris — and others who could be called up by Australia for the third Test onwards, such as Michael Neser, Peter Handscomb and Sean Abbott — will have the perfect warm-up, England’s Ben Stokes, Joe Root, Harry Brook and Jofra Archer could not be preparing more differently.They are all at the IPL — thankfully Mark Wood is coming home early to be at the birth of his second child — and will almost certainly have no red-ball match practice ahead of the Ashes other than the four-day Test against Ireland at the start of June.",
        "And in the cases of Stokes and Root, they are barely playing in India anyway and could be back home practising properly with a red ball and playing in the two or three Championship matches our counties are instead granting to our biggest rivals.",
        "I have long since conceded defeat in hoping the IPL could be held at bay by international cricket — Sisyphus has more chance of pushing his boulder to the top of the hill — but it would have been nice if our leading players had turned down the Indian riches for one year to concentrate on winning back the Ashes.It can only be hoped they come back in one piece and quickly get up to speed so that the smiling assassin Smith does not have the last laugh.Broad right to dismiss last AshesIt seemed an innocuous enough comment within a wide-ranging and fascinating interview. When Stuart Broad told Mail Sport the last Ashes was a ‘void series’ because of the suffocating Covid restrictions, it made perfect sense. But it seemed to offend Australian sensibilities, culminating in Steve Smith calling the comments ‘a bit odd’. Broad, of course, is right. That series became a damaging exercise for all involved with none of the joy and atmosphere of the biggest Test series of them all. Still, if Broad’s comments wind up the Aussies, then all well and good, and we look forward to him being dismissed as a ‘36-year-old medium-pacer’ by the Brisbane Courier-Mail on his way to another Ashes-defining spell.",
        "Test swansong would have been fitting",
        "What a feat by the 41-year-old Tim Murtagh to take his 1,000th wicket for Middlesex 16 years after his move from Surrey. And all after he admitted throwing a ‘bit of a hissy fit’ after being left out of Middlesex’s two previous matches. It is just a shame we won’t see him in the one-off Test next month at Lord’s, where his Ireland career ended four years ago with five for 13 as England were dismissed for 85.The granting of full member status to Ireland meant their best players had to choose between international cricket and county careers as non-overseas players.Murtagh says this is probably his last season. We should enjoy him while we can. "
    ]
}