{
    "articleURL": "/sport/mma/article-12046213/Henry-Cejudos-coach-talks-clash-Alexander-Volkanovski-UFC-288.html",
    "content": [
        "Henry Cejudo takes on Aljamain Sterling in the main event of UFC 288 His long-term aim in coming out of retirement is to face Alexander VolkanovskiCejudo would be the first triple-weight UFC champ in history if he won  Henry Cejudo's coach wants a drawn-out build-up to what would be a mega-fight between CCC and Alexander Volkanovski. ",
        "Cejudo is coming out of retirement to fight bantamweight champion Aljamain Sterling at UFC 288 this weekend but has grand plans beyond that contest. He wants to become the first three-weight champion in UFC history, having already claimed the flyweight and bantamweight belts. Cejudo was also a gold medal-winning wrestler in the Olympics, hence the CCC moniker. And his coach, Eric Albarracin wants to let Cejudo build the hype up before forcing the UFC's hand in setting up a clash with the Australian, who faces Jair Rodriguez in his next defence. ",
        "Albarracin told the MMA Hour: 'Alexander, pound-for-pound, this guy's been competing. I'd like to see Henry really build up to this fight, not only physically, but more getting into a rhythm. 'But even more so, as Henry gets into his YouTube career, you have to always think twice as he becomes a businessman. 'I could see him beating Volkanovski, and then what's left? You don't go back down.'So this kind of builds it up. So now everything builds, from his YouTube channel, from his mental mindset, from his physical mindset. 'He gets into his rhythm, he gets the crowd, he's getting pay-per-views, everybody wants to see him. Now he's made a name for himself again. 'Now they can't deny him. Now let's make the pound-for-pound versus the greatest combat athlete of all-time. Can Henry become C4? Or can Alexander Volkanovski take out the greatest combat athlete of all-time.'",
        "Volkanovski is no longer pound-for-pound No 1, having lost his lightweight outing to Islam Makhachev, though many feel he should have kept his status given how close the battle was.",
        "Cejudo would be a brilliant cross-division contest but CCC would be foolish to look beyond Sterling this Saturday night in New Jersey. The champion is a dangerous and unpredictable opponent - although Albarracin thinks his man will win inside three rounds. He said: 'Triple C’ takes him in three. I think it’s going to be a submission. Henry might be saying something else, but I think it’s going to be a submission.'They want to say wrestling [is equal]. The fact that you say wrestling cancels out wrestling — Division III cancels out Olympic champion wrestling? Are you guys out of your mind? ",
        "'I think you remember back in 2019 when [T.J. Dillashaw's coach] Duane 'Bang' Ludwig said that on the show, go back and watch it, and watch how heated I get when you guys bring that up. 'No, there is no [comparison between] their wrestling. We're going to show you why Long Island is called Strong Island, because I was born on Long Island and we're going to show you why world-class wrestling is king on Saturday night.'Bet the house if you're so confident in what's going happen, that [Sterling's] grappling [is better],' Albarracin continued. 'How's he going to take [Cejudo's] back? This is going to be played out where Henry decides.'"
    ]
}