{
    "articleURL": "/news/article-12037981/Black-woman-sues-wellness-retreat-clip-shown-comedian-calling-Irish-n-s-Europe.html",
    "content": [
        "Nicole Evans, who stayed at the Esalen Institute, claims instructor Lorin Roche showed a video of a black comedian which included racist slurs Roche allegedly played the clip twice during a meditation class, which Evans said was 'one of the most humiliating and traumatizing experiences of her life'She has filed a $1m lawsuit which claims her civil rights were violatedA black woman has sued the iconic Esalen Institute in Big Sur after an instructor at the new age retreat allegedly played a video with racist slurs during a meditation class.",
        "Nicole Evans, from Los Angeles, claims instructor Lorin Roche showed a video of a black comedian who joked that 'Irish people were the n*****s of Europe'.Evans is seeking at least $1 million in damages over the alleged incident, which is described in the lawsuit as 'one of the most humiliating and traumatizing experiences of her life'. She claims the California retreat and its employees violated her civil rights.The Esalen Institute is a popular escape for the rich and famous and bills itself as a 'holistic retreat and educational institute'. Accommodation ranges from a 'sleeping bag space', which costs $900 for four nights, to private suites which cost $8,000.Evans took a medication class led by Roche on September 7 2022, midway through her four-night stay. He allegedly played a YouTube video of the comedy routine which attendees initially found funny, but 'the room became deafeningly silent' when the n-word was used in a joke about Irish people.",
        "Roche, who the suit calls 'a faculty member with decades of tenure at the institute', and some other attendees looked directly at Evans, the only black person present, when the clip was shown.The instructor then rewound the clip and replayed the joke, causing some people to walk out of the class and leaving Evans 'completely confounded, shocked and overwhelmed with emotion', it is claimed.",
        "The clip was believed to be of Reginald D Hunter, an American stand up comedian from Georgia who is based in the UK. A video from one of Hunter's stand-up shows, uploaded to YouTube in 2011, shows he made the same joke during a routine about time he spent in Ireland.Evans' suit, reported by the LA Times, says that after the incident, 'she felt paralyzed and did not know what to do. She felt like a fish in a fishbowl with everyone glaring at her, which in turn made her feel unsafe.'She chose to remain at the retreat but word spread about the incident and she was asked about it by other attendees, which made her feel uncomfortable.Evans was supposed to attend another class with Roche the following day but chose not to. Roche's wife, Camille Maurine, who also works at the Esalen Institute, then urged Evans to attend the class to talk about the issue with him.Roche acted like 'nothing was happening' and did not apologize, the suit claims.He also told another person from the retreat who confronted him about it: 'I'm sorry that you regular people do not understand the brilliance of the video.'Evans left the class 'humiliated and enraged'. ",
        "Roche only offered a 'forced' apology later that day after his wife invited Evans to a meeting with a director at the institute. Evans claims the director said 'he was sorry that this had happened to her'.",
        "The suit said: 'As a result of defendants' actions, plaintiff has suffered and will continue to suffer general and special damages, including severe and profound pain and emotional distress, anxiety, depression, headaches, tension and other physical ailments, as well as medical expenses, and expenses for psychological counseling and treatment.'The suit was filed in December and a trial was scheduled to begin on Tuesday, May 2 2023. The Esalen Institute was approached for comment.It claims the institute didn't take proper disciplinary action against Roche and accuses him of a history of 'discriminatory and bigoted conduct'.The Esalen Institute was founded in 1962 and established itself as a leader in the New Age movement. The institute offers a range of classes and workshops covering activities from mindfulness and yoga to writing and dance.The retreat inspired the final scenes of the hit show Mad Men, whose troubled anti-hero Don Draper joined a hippie commune overlooking the Pacific Ocean."
    ]
}