{
    "articleURL": "/news/article-12046847/How-Donald-Trumps-support-nice-Meghan-soured-brands-disrespectful.html",
    "content": [
        "Donald Trump laid into Meghan Markle ahead of King Charles III's Coronation His recent criticism is latest in a string of attacks on the Duchess of SussexREAD MORE: Donald Trump blasts Meghan Markle for 'disrespecting' the Queen Donald Trump launched his latest attack on Meghan Markle in an interview ahead of the King's Coronation, raging that the Duchess of Sussex was 'very disrespectful' to Queen Elizabeth II.",
        "The former president also said he was 'surprised' Prince Harry was invited to the ceremony this weekend after the public falling out between the Sussexes and the rest of the Royal family.Speaking on GB News as he visited the UK, Trump revealed he had high hopes for Saturday's Coronation and gave King Charles his full backing saying the monarch 'loves the country'. While he has made no secret of his love for the British monarchy, even going so far to describe himself as a 'friend and admirer of the Queen', Trump's latest criticism of Meghan is one of a long string of attacks on the former Suits actress.Before she married into the Firm, Meghan voiced her own criticism of Trump, branding him a divisive misogynist and saying she 'might just stay in Canada' if he won the 2016 Presidential race.",
        "The famously outspoken former president labelled Meghan 'nasty' when told about the comments in 2019, but later said he wanted to clarify that he didn't think she was, instead describing her as 'very nice'.Around the time of her wedding to Prince Harry, Trump described the pair as a 'lovely couple' and said she would be a 'very good' American princess.By 2020 however, Trump's opinion of the royal couple seemed to shift dramatically, as they announced they were leaving behind their royal duties and moving to the US.",
        "He described 'Megxit' as 'sad', and has since criticised the Sussex's relationship, called for them to pay for their own security, and claimed the Duchess 'disrespected the Queen' in a string of scathing rants.Here MailOnline looks at how Trump's attitude towards the Duchess turned sour. Royal wedding 2018 - 'They look like a really lovely couple'",
        "Half-way through his presidency, Donald Trump gave a wide-ranging interview to Piers Morgan on ITV's Good Morning Britain in January 2018.Ahead of the royal wedding between Prince Harry and Meghan, Morgan pressed Trump on whether he had received an invite.'Not that I know of,' he replied, adding his good wishes to the betrothed.'I want them to be happy. I really want them to be happy. They look like a lovely couple.' When Morgan told the then-President that Meghan had called him 'divisive' and a 'misogynist', Trump responded: 'Well, I still hope they're happy.' June 2019 - 'Nasty' or 'nice'In an interview ahead of a trip to the UK, Trump was confronted with a comment made by Meghan in 2016, in which she said she would move to Canada if he became America's president. The Sun's political editor said of Meghan: 'She said she'd move to Canada if you got elected, it turned out she moved to Britain.'Trump said he was unaware she had made the comment and can be heard on an audio tape saying: 'I didn't know that she was nasty.'",
        "The comment sparked fresh backlash over the way Trump talks about women, and he came out to deny making it, despite the evidence that he had.'I wasn't referring to she's nasty. I said she was nasty about me. And essentially I didn't know she was nasty about me,' Trump told ITV.However, asked if it was nice to have an American princess, he added: 'It is nice, and I am sure she will do excellently. She will be very good. I hope she does.''She's doing a good job. I hope she enjoys her life... I think she's very nice,' Trump said.'She was nasty to me. And that's OK for her to be nasty. It's not good for me to be nasty to her and I wasn't.'After meeting Harry at Buckingham Palace, he said: 'I think he's a terrific guy. The royal family is really nice... He couldn't have been nicer.' January 2020 - 'Megxit' was 'sad'",
        "After Harry and Meghan announced on January 8 2020 that they would step back from their roles as senior members of the Royal family, Donald Trump decided to weigh in.When asked if he had any advice for how to deal with the 'rogue royals', Trump told Fox News: 'I think it's sad. I do. I think it's sad. She's a great woman,' he said, appearing to reference Queen Elizabeth. ",
        "'She's never made a mistake if you look. I mean, she's had like a flawless time.' When asked if he believed Meghan and Harry should return to Buckingham Palace, Trump insisted he didn't 'want to get into the whole thing', but said: 'I just have such respect for the Queen, I don't think this should be happening to her.' March 2020 - 'They must pay!'",
        "Trump made his feelings on who should pay for the Sussexes' protection after they left their royal duties and the UK behind very clear.Taking to Twitter, he wrote: 'It was reported that Harry and Meghan, who left the Kingdom, would reside permanently in Canada.'Now they have left Canada for the U.S. however, the U.S. will not pay for their security protection. They must pay!'The Sussexes decided to move their lives to Montecito, California, buying a home there in July 2020. ",
        "September 2020 - 'I'm not a fan'In the run up to the 2020 presidential elections, Meghan spoke of the importance of voting and of achieving the change 'we all need and deserve' in a Michelle Obama video message backed by not for profit When We All Vote.She later called on people to 'honor' those 'leading the fight against Covid-19' and those who 'stand for what is right', in what many read as a slight to GOP candidate Trump.",
        "Breaking with convention, Harry also spoke out, saying 'it's vital that we reject hate speech' ahead of vote.Those comments led a journalist at the White House press briefing to suggest to Trump that Meghan had urged voters to back Joe Biden.He replied: 'I'm not a fan of hers. I would say this — and she has probably has heard that — I wish a lot of luck to Harry because he's going to need it.'June 2021 - 'Harry's been used'",
        "The twice-impeached former President has accused Meghan of 'disrespecting' the Royal family before, making the same comment to Farage in 2021. Speaking about Meghan, Trump said: 'I'm not a fan of hers. I wasn't from day one. I think Harry has been used horribly and I think some day he will regret it.'According to GB News, he added: 'I think Harry's been used and been used terribly. I think it's ruined his relationship with his family, and it hurts the Queen.''She is trying do things that I think are very inappropriate.''I think she's very disrespectful to the royal family and most importantly to the Queen.'April 2022 - 'Strip their titles' Ahead of the Platinum Jubilee last year, Trump said he was 'not a fan' of Meghan Markle and hasn't been 'right from the beginning'.He called for Sussexes to be stripped of their titles.",
        "'I think poor Harry is being led around by his nose,' Trump said in an interview with Piers Morgan, adding he was 'whipped like no person I think I've ever seen'",
        "He said he wanted to know what would happen if Harry and Meghan separated, speculating whether the Prince would go 'back on his hands and knees to the beautiful city of London.'Yesterday's comments - 'Very disrespectful'On GB News last night, Trump described Meghan as having been 'very disrespectful' to the late Queen.He also added that he was 'surprised' Prince Harry was invited to his father's Coronation after the Royal family's public falling out.He said: 'I think she [Meghan] has been very disrespectful to the Queen. How can you be so disrespectful to the Queen?'She [the Queen] was incredible, for decades and decades she never made a mistake. I cannot think of a mistake she made, she was never controversial.'He added: 'You cannot be disrespectful to her and I think Meghan was very disrespectful to her, very disrespectful.'",
        "In a clip released ahead of the interview, Trump also said he had high hopes for the Coronation itself and the reign of King Charles. He said: 'I think it's going to be a great day, I think they will do a great job and he [Charles] loves the country. I got to know him [Charles] quite well and he loves the country, really loves the country and he loved his mother. 'That's why I thought she was treated so disrespectfully by Meghan and [there was] just no reason to do that. 'I was actually surprised that Harry was invited, to be honest.'",
        "The Duchess of Sussex appeared on Larry Wilmore's Nightly Show in 2016, two years before she wed Prince Harry.During her appearance, the future royal spoke of the Presidential race between Trump and Hilary Clinton.'Yes of course Trump is divisive, think about just female voters alone, right? I think it was in 2012 the Republican Party lost the female vote by 12 points.'That's a huge number and, with as misogynistic as Trump is, and so vocal about it, that's a huge chunk of it.'You're not just voting for a woman, if it's Hillary, just because it's a woman but certainly because it has made it easy to see you don't really want that kind of world.'Meghan, who is best known for playing office vamp Rachel Zane in Suits, even claimed that she would leave America for Canada because she was so worried about Trump's candidacy.'It's really the moment I go, we film Suits in Toronto and I might just stay in Canada,' she said.'If that is really the reality we are talking about then that is a game changer in terms of how we move in the world here.'"
    ]
}