{
    "articleURL": "/wires/ap/article-12046223/Clash-styles-Allardyces-Leeds-plays-Guardiolas-City.html",
    "content": [
        "Sam Allardyce has swept back into English soccer with a big smile and some even bigger assertions.",
        "Now it´s time for \"Big Sam\" - as he is widely known - to back up the talk and save Leeds from relegation in the Premier League.The four-game mission in his ninth top-flight job starts with perhaps the toughest assignment possible in English soccer - a trip to defending champion and league leader Manchester City on Saturday.That means going head-to-head with Pep Guardiola, the City manager who has previously called Allardyce a \"genius\" for his ability to save clubs from relegation.Guardiola has welcomed the return of Allardyce to the Premier League and agreed with the 68-year-old former England coach's bold claim that there is \"nobody ahead of me in football terms.\"\"With this type of old manager,\" Guardiola said, also referencing Roy Hodgson after his recent return to Crystal Palace at the age of 75, \"people say, `They are old´ or whatever. And people who are 35, 40 (say) we invent football, we create football. No, football is already created.",
        "\"These guys belong to this league and helped us to do it ... you don´t have to be young to be a good manager.\"Allardyce is regarded as something of a pioneer, at least in the English game, for introducing sports science and data analysis to top-level soccer from his days at Bolton around the turn of the century and even before that.",
        "It was at Bolton where he did his best work, defying his long-held image as a pragmatic, long-ball manager by getting a team containing exciting talents like Jay-Jay Okocha and Youri Djorkaeff into a domestic cup final and later into the now-defunct UEFA Cup following a sixth-place finish in the Premier League.After leaving Bolton in 2007, he had tough spells at Newcastle, West Ham and Everton, where he was never popular with supporters, but excelled at Blackburn, Sunderland and Crystal Palace.Allardyce certainly divides opinion but there's no doubt he retains a high opinion of himself, using his presentation as Leeds manager to name-check Guardiola, Liverpool manager Jurgen Klopp and Arsenal manager Mikel Arteta as coaches he believes he is as good as.Being away from soccer for almost two years is a concern, though, as is the form of the team Allardyce has taken over.Leeds is a mess defensively - conceding 23 goals in April, a Premier-League record for a single month - and has lost five of its last seven games to sit outside the relegation zone only on goal difference.Allardyce's priority will be to make Leeds harder to break down, and the game at City - a clash of styles if there ever was one - promises to require an extreme backs-to-the-wall effort.",
        "There's nothing he would like more than to get one over a high-profile manager in his first game back, which would revive memories of his glee at his West Ham team securing a 0-0 draw at Jose Mourinho's Chelsea in 2014 and then coming out with this memorable line: \"(Mourinho) can´t take it because we´ve out-tacticked him, outwitted him.\"It's a tall order, though. City is on a tear and chasing a Premier League-Champions League-FA Cup treble, having won 14 of its last 15 games and drawn the other at Bayern Munich.A victory would push City four points clear of Arsenal, which would then have to respond by winning at third-place Newcastle on Sunday to realistically stay in a title race that suddenly has an ominous feel to it.If City wins and Arsenal fails to win, which is a more-than-plausible scenario, City would only need to two victories from its last four games to retain the title.Allardyce, then, is looking to do Arsenal a favor as well as successfully launch his latest rescue operation and show he is still relevant in the modern game.\"I´ve had a lot of responses from many people who I know sending their congratulations,\" Allardyce said. \"A few others said I must be mad.",
        "\"But I enjoy the game so much and to try and be able to save this club and keep it in the Premier League is a big responsibility and a big challenge. But one I´m prepared to take because of who Leeds are.\"___Steve Douglas is at https://twitter.com/sdouglas80___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}