{
    "articleURL": "/sport/football/article-12042161/Newcastle-make-60million-verbal-offer-Barcelona-star-Raphinha.html",
    "content": [
        "Newcastle have made the first move to sign Barcelona winger RaphinhaRaphinha could return to the Premier League just a year after leaving LeedsNewcastle United have reportedly made a verbal offer for Barcelona star Raphinha ahead of the summer transfer window.",
        "The Brazilian arrived at the Camp Nou last summer as Barcelona beat both Chelsea and Arsenal his signing from Leeds United.However, it appears he could be on his way out after just a season in Spain as transfer insider Gerard Romero claims Newcaslte have made a 'verbal proposal' for the 26-year-old.Barcelona are said to be 'grappling with Financial Fair Play issues' and could be forced to sell several of their stars this summer.Raphinha has struggled this season despite making 31 appearances for Barcelona in the league, netting seven times.",
        "Arsenal are reportedly in the race for Raphinha also, but Newcastle hold an advantage as he would likely start, rather than facing a battle with Bukayo Saka for the right-wing spot at the Emirates.Raphinha's reported price tag is around £60million, slightly higher than the £56million fee that Barcelona paid to bring the 26-year-old to the Camp Nou last summer. It was previously reported that the two Premier League sides were monitoring developments with Raphinha, but it appears that Newcastle have now made the first move by making a verbal proposal to the winger.Newcastle have a growing Brazilian contingent at St James' Park, with Joelinton and Bruno Guimaraes making up the midfield.Raphinha could arrive at the Toon in the summer, with Howe's side looking likely to qualify for the Champions League next season.",
        "There will no doubts be reinforcements in the summer transfer window to bolster Howe's squad, and it remains to be seen as to whether Raphinha will be one of these after the verbal offer has been made. "
    ]
}