{
    "articleURL": "/news/article-12040397/South-Australian-man-pleads-guilty-sexually-abusing-daughter-3-year.html",
    "content": [
        "South Australian man pleaded guilty to sexual abuseThe man bragged about abusing daughter, 3, online Child was in his care after mum deemed 'unstable' A father who sexually abused his three-year-old daughter after she was placed in his care by Child Protection, filmed and shared the vile acts online, a court has heard. ",
        "The man faced South Australia's District Court on Wednesday pleading guilty to  maintaining an unlawful relationship with his child and multiple counts producing, disseminating and possessing child exploitation material.Prosecution told the court the southern suburbs man, who is not named to protect his daughter's identity, bragged about abusing his little girl in online chat groups.",
        "A court file detailing the abuse was sealed with only a select number of people exposed to its content, The Advertiser reported. District Court Judge Anthony Allen said the man showed 'enthusiasm' in the videos and claimed the abuse was among the most serious he has seen. The man's lawyer Emma Shaw described her client's acts as 'abhorrent' but told the court there was hope for him to be rehabilitated. 'He hates what he has done,' Ms Shaw said. Ms Shaw said her client acknowledged he was a paedophile and wrote a two page letter apologising for abusing his daughter and for exposing court staff, police and prosecutors to images of the abuse. She explained her client rated 'extremely high' on an autism spectrum disorder test but had been undiagnosed throughout his life.The court heard the man moved between 10 different schools and suffered 'debilitating social anxiety' due to being bullied.    The court also heard the man could not hold a conversation or keep a relationship.",
        "The man managed to hold a three-year relationship with a woman which led to the birth of his daughter - a relationship he described as the 'worst three years of his life'.When the pair separated, the Department of Child Protection placed the little girl in the care of her father after determining her mother was 'unstable'. ",
        "Court documents outlined the mother used large amounts of cannabis and posed too much of a risk to the child's welfare.Judge Allen slammed the decision made by child services as an 'opportunity lost with catastrophic consequences'.The young girl was aged three years and four months when the offending begun, with her father abusing her for more than a year. The little girl's foster mum detailed the impact of the abuse in a victim impact statement she read out in court. The foster mum said the child, who is a 'smart, joyful and courageous' treasured member of her family suffers from night terrors and behavioural issues linked to trauma.  The man will face court for sentencing later this month.  "
    ]
}