{
    "articleURL": "/wires/pa/article-12044311/Trump-calls-rape-claim-ridiculous-video-deposition.html",
    "content": [
        "Donald Trump called a writer’s claims that he raped her at a Manhattan department store “the most ridiculous, disgusting story”, testifying in a deposition shown in court that the allegations were “made up” and that the assault never happened.",
        "Lawyers for accuser E Jean Carroll played about 30 minutes of excerpts from the former president’s deposition, including his emphatic denial of the longtime advice columnist’s accusation that he attacked her in the mid-1990s in a Bergdorf Goodman dressing room.“If it did happen, it would have been reported within minutes,” Mr Trump said, contending that shoppers and personnel at the “very busy store” would have heard a commotion and alerted authorities.“It’s the most ridiculous, disgusting story. It’s just made up,” Mr Trump said in the video deposition taken in October.In other developments on Wednesday, Mr Trump’s lawyers said they would not call any witnesses, raising the possibility that the closely watched trial will move to closing arguments and deliberations next week.Lawyers for Mr Trump, who has not attended the trial, said he will not testify, giving more weight to the deposition.Jurors in federal court in Manhattan are expected to hear more of Mr Trump’s deposition on Thursday, followed by three more witnesses being called to the stand by Ms Carroll’s lawyers.Mr Trump has denied ever knowing Ms Carroll, saying once that “she’s not my type” and arguing that her claims are politically motivated attempts to smear his reputation and deny him the White House.Mr Trump’s deposition denials punctuated an emotional day in court that saw more allegations of inappropriate behavior with women and the playing of the infamous “Access Hollywood” video in which Mr Trump bragged about grabbing women’s genitals without asking permission.",
        "Natasha Stoynoff, a former writer for People magazine, testified through tears that Mr Trump forcibly kissed her against her will while showing her around his Mar-a-Lago estate just after Christmas in 2005 for an article about his and wife Melania’s first wedding anniversary.Before the trial, Mr Trump’s lawyers were unsuccessful in trying to block jurors from seeing the “Access Hollywood” video and hearing from Ms Stoynoff, who said she told only a few people about the alleged incident at the time, but decided to go public after seeing the tape and Mr Trump’s subsequent denials at a 2016 debate.“The horrifying part to me was that I worried, because I didn’t say anything at the time, other women were hurt by him so I had to regret,” Ms Stoynoff said.Ms Stoynoff started to cry when asked about her trip to interview the Trumps in Palm Beach, Florida, reaching for tissues and pausing between questions.She testified that Mr Trump drew her away from staff and a photography crew with a ruse of wanting to show her a “really great room” at the estate, before cornering her and kissing her.Ms Stoynoff, from Canada, recalled the door shutting behind her and that Mr Trump soon “had his hands on my shoulders, pushed me against the wall and started kissing me”. The encounter lasted several minutes, she said.",
        "“I tried to push him away,” Ms Stoynoff said, explaining how Mr Trump came at her again and how she again tried shoving him away. She was “so shocked and flustered” she was unable to speak and did not scream, she said.“No words came out of me,” Ms Stoynoff told jurors.Mr Trump showed no signs of stopping, but suddenly pulled away when a butler came into the room to report that Melania was ready for the next phase of the interview, Ms Stoynoff said.As they walked to a patio area, Ms Stoynoff said, Mr Trump told her “you know we’re going to have an affair,” and reminded her that his second wife, Marla Maples, had once bragged to a tabloid that sex with Mr Trump was the best she ever had.Mr Trump has denied that he ever tried to kiss Ms Stoynoff. Mr Trump’s lawyer, Joseph Tacopina, suggested she had no relevance to Ms Carroll’s case, ending his cross-examination after asking her a single question: Was she involved in any litigation against Mr Trump? She isn’t.Ms Stoynoff’s testimony came two days after another woman, former stockbroker Jessica Leeds, testified that Mr Trump grabbed her breasts and tried to put his hand up her skirt when they were seated next to each other on a late-1970s airline flight.",
        "Ms Carroll kept her claims against Mr Trump secret for 17 years, telling just two close friends before going public with the allegations in a 2019 memoir.In the book, she described how a sometimes flirtatious chance encounter with Mr Trump at the department store in spring 1996 ended with violence when Mr Trump cornered her in a dressing room after they challenged each other to try on a piece of lingerie.Mr Trump’s lawyers attacked Ms Carroll’s credibility through exhaustive cross-examination, questioning why she did not scream out for help during the alleged attack and why she never went to police.A psychologist testifying on Ms Carroll’s behalf said Wednesday that it is common for rape victims to fall silent and blame themselves.Judge Lewis A Kaplan said closing arguments were likely to happen on Monday, and the jury would get the case on Tuesday."
    ]
}