{
    "articleURL": "/news/article-12039429/Angelina-Cando-not-fit-trial-West-Village-pride-flag-burning.html",
    "content": [
        "The woman accused of burning a Pride flag outside of Manhattan restaurant in February will not stand trialOn Tuesday, a judge found Angelina Cando, 30, mentally unstable, she had been charged with hate crimes as well as arson and reckless endangermentIn February, Cando broke down during a court appearance while yelling: 'He is king!' A New York woman accused of setting fire to a Pride flag that that included the message Make America Gay Again has been deemed mentally unfit to stand trial. ",
        "Angelina Cando, 30, appeared briefly in court in Manhattan Tuesday when the ruling was made. She will appear again on May 9 while the district attorney's office review the decision. The incident occurred outside of the Little Prince NYC resident in the trendy Soho section of New York City.  In February, Cando was charged with arson as a hate crime and reckless endangerment as a hate crime, in an earlier incident, Cando was accused of scrawling 'Jesus is King' on two police cars. During her first appearance in court shortly after her arrest, Cando had 'outbursts' in front of the judge which referenced her sister and stepfather where she insisted she was innocent. ",
        "When prosecutors brought up a January incident in which Cando was accused of cutting a man after throwing something at him, she said: 'False accusation. False accusation. They're all fake.... Let me free! He is king!' Also in February, Cando was accused of threatening employees of a pizza shop with a knife. Her lawyer said in February that Cando was suffering from 'some kind of psychotic breakdown.' 'All I did was write with a pen, please let me free, don't pin me down,' Cando said following that hearing, reported the New York Post at the time.  Cando was also charged with criminal mischief for scrawling 'Jesus is King' on the back of two NYPD squad cars. ",
        "The suspect has been arrested in the past for menacing, though details of those crimes are not clear. Officials earlier said that prior to the flag burning, Cando wrote the words 'Jesus,' 'J&amp;A' and 'Suck D**k' at the Canal Street subway station. The fire caused by Cando's actions broke the windows of the restaurant and broke a flower display as well damaging the doors in addition to spreading to an apartment above, prosecutors said.  ",
        "The incident sparked outrage among Little Prince's trendy downtown clientele. 'Can't imagine someone would have that much hate to do something like this. Especially not knowing if it could physically hurt someone as well,' a regular told ABC New York.   The French hotspot is in the heart of SoHo and has been the target of homophobic attacks before. A worker previously revealed that someone once tried to steal the Pride flag, which hangs proudly among an exterior flower wall. The NYPD listed Cando as having a downtown Manhattan address not far from the restaurant, but no other details of her life have yet become public. The superintendent of the building Cando lived with her boyfriend along Mott Street until earlier this year said that she was known for her homophobic behavior.''She wasn’t a tenant, just the crazy girlfriend of a tenant,' Love Texidor told the New York Daily News.  ",
        "'She knocked on my door a couple of weeks ago when she was freaking out. Everybody in that building knows her,' a neighbor told the newspaper.  ",
        "Following the incident, local councilmember Erik Bottcher contributed to helping the restaurant hang a larger pride flag. 'What we saw in the video was a hate crime. Someone who intended to strike fear into our entire community,' Bottcher said.  'Our resolve is only strengthened when acts like this happen. We are standing up in the face of this hate and reasserting our pride in ourselves and our community. That's why we hung the flag again,' he added. The French restaurant has been the target of vandals before, with one worker recalling a separate incident where a person tried to steal it.An unidentified employee told ABC New York they were 'hurt' to witness the hate crime in the city where they live and work.'To be a part of it, and to witness it, and to work here and to have that happen, like this is my job. This is where I make money and this is also where I have a home,' the employee told ABC 7.'So to have that taken away, I'm confused and I'm hurt, and I don't know how to feel about it.'",
        "A resident living above The Prince Restaurant was also astonished to learn why he had to evacuate in the early morning.'I can't believe something like that that happened last night, so I just think we've started to go the wrong way,' Stu Matz told the news outlet.'This is a really usually nice neighborhood where everybody respects each other and that's not something that should ever happen around here.''Hate exists unfortunately so I don't know what to say, it's heartbreaking,' Asli Fevzi added."
    ]
}