{
    "articleURL": "/wires/reuters/article-12050105/Russias-Wagner-chief-Prigozhin-says-forces-leave-Bakhmut-May-10.html",
    "content": [
        "Wagner will pull out of Bakhmut on May 10, Prigozhin says",
        "Blames lack of ammunition, says army will have to step inVideo shows Prigozhin with corpses he says are his men(Adds defence ministry, new Prigozhin comments, Putin speech writer, U.S. and Russian analysts)By Felix Light, Caleb Davis and Andrew OsbornMay 5 (Reuters) - Yevgeny Prigozhin, leader of Russia's Wagner Group mercenary force, said in a dramatic announcement on Friday that his forces would pull out of the Ukrainian city of Bakhmut that they have been trying to capture since last summer.Prigozhin said they would withdraw on May 10 - ending their involvement in the longest and bloodiest battle of the war - because of heavy losses and inadequate ammunition supplies. He asked defence chiefs to insert regular army troops in their place.\"I declare on behalf of the Wagner fighters, on behalf of the Wagner command, that on May 10, 2023, we are obliged to transfer positions in the settlement of Bakhmut to units of the defence ministry and withdraw the remains of Wagner to logistics camps to lick our wounds,\" Prigozhin said in a statement.\"I'm pulling Wagner units out of Bakhmut because in the absence of ammunition they're doomed to perish senselessly.\"The Kremlin declined to comment and there was no immediate reaction from the defence ministry, which said the offensive on Bakhmut continued with paratroopers supporting assault units as a Ukrainian official said Russia was bringing Wagner fighters from elsewhere to fight in Bakhmut.",
        "Bakhmut, a city of 70,000 people before the start of the war, has taken on huge symbolic importance for both sides because of the sheer intensity and duration of the fighting there.Wagner has been spearheading Russia's attempt to capture it and Prigozhin said his men had taken all but 2.5 square kilometres of the city which he said was 45 square kilometres in total.It was not clear if his latest statement could be taken at face value, as he has frequently posted impulsive comments in the past. Only last week he withdrew one statement he said he had made as a \"joke\".Earlier on Friday he appeared in a video surrounded by dozens of corpses he said were Wagner fighters, and was shown yelling and swearing at Defence Minister Sergei Shoigu and Chief of the General Staff Valery Gerasimov with whom he has a long-running feud.\"We have a 70% shortage of ammunition. Shoigu! Gerasimov! Where is the ******* ammunition?\" he shouted into the camera.In another video issued later, he accused Shoigu and Gerasimov of being responsible for \"tens of thousands of Wagner dead and injured\" and said he would hold them to account.Vladimir Pastukhov, a political analyst, said Prigozhin's behaviour looked like an attempt to pin the blame for Russia's setbacks and losses in Ukraine on Shoigu.",
        "\"He and Shoigu are playing a zero-sum game in which there cannot be two winners,\" Pastukhov wrote on the Telegram messaging service. \"Someone will have to answer for the mountain of corpses. And that moment is approaching.\"KEY MOMENT IN THE WARHis announcement comes at a key juncture in the war, with Ukraine expected to launch a long-anticipated counter-offensive imminently.It was the second dramatic development in the space of three days, after Moscow accused Ukraine of sending drones to the Kremlin in the early hours of Wednesday in an attempt to kill President Vladimir Putin. Kyiv denied it, and the United States dismissed Kremlin claims it was behind the incident as \"lies\".Abbas Gallyamov, a former Putin speech writer designated \"a foreign agent\" by Russia, said he thought that Putin would have to intervene in the Prigozhin standoff to show he was decisive as such episodes could become destabilising.Prigozhin's written statement - addressed to the head of the General Staff, the defence ministry, and Putin as supreme commander - was accompanied by a video in which Prigozhin appeared in full combat gear in front of dozens of his fighters, an automatic rifle dangling from his shoulder.\"If, because of your petty jealousy, you do not want to give the Russian people the victory of taking Bakhmut, that's your problem.\"",
        "Rob Lee, a U.S. military expert on Russia, said he thought the Russian defence ministry may have decided to ration ammunition ahead of Ukraine's counter-offensive as it had to ensure the entire front was defended while Prigozhin \"only cares about taking Bakhmut.\"The stated withdrawal date of May 10 gives defence chiefs just five days to fill the gap a Wagner pullout would create.One Telegram channel regarded as close to the defence ministry said the May 10 withdrawal date had long been decided and that Prigozhin was now using it as \"a nice pretext\" to blame what it called his failures and heavy losses on a lack of ammo.The same channel said the despatch of regular paratroopers and tank units to Bakhmut had \"almost been agreed\" and that it was not a certainty that Wagner's forces would fall back.Reuters could not verify those assertions.Prigozhin's outburst threatens to overshadow national celebrations on May 9, when Russia commemorates victory over Nazi Germany in World War Two and Putin is due to address the nation from Red Square. (Writing by Mark Trevelyan/Andrew Osborn; editing by Philippa Fletcher and Conor Humphries)"
    ]
}