{
    "articleURL": "/news/article-12043819/Killer-drink-drivers-car-pieces-victims-BRIDAL-GOWN-embedded-bumper.html",
    "content": [
        "Parts of Samantha Miller's wedding gown remain embedded in the bumper of Jamie Lee Komoroski's red sedan following a deadly crash last FridayMiller, 34, died at the scene of the crash and her husband, Aric, 36, is in critical conditionKomoroski, 25, is being held on driving under the influence, greater bodily injury and death by reckless homicide chargesParts of a dead bride's wedding gown remain embedded in the bumper of a killer drunk driver's car after she struck the victim at 65mph hours after her nuptials.",
        "Samantha Miller died after being struck at high speed by Jamie Lee Komoroski's red sedan, with a macabre reminder of Friday's horrific tragedy in Folly Beach, South Carolina, still visible Wednesday, ABC4 reported.The TV station also shared a shocking image of the shattered low-speed vehicle Samantha, 34, was traveling on the back of with her new husband Aric Hutchinson 36. It could be seen with its seats detached and the axel connecting the two back wheels nearly broken.The newlyweds were sitting on the back of the vehicle when Komoroski, 25, slammed into them while doing more than twice the 25-30mph local speed limit. Komoroski is now being held in jail in South Carolina on three felony DUIs resulting in great bodily injury or death and one count of reckless homicide.",
        "Miller and her new husband were leaving the scene of their wedding at Folly Beach last Friday and were heading to their rented Airbnb when the fatal crash occurred.It was supposed to be 'a quick journey from the venue to their Airbnb for their wedding night,' Mandi Jenkins, Miller's sister, told ABC4.But when Komoroski's rented Toyota Camry slammed into their low-speed vehicle — which authorities say was equipped with headlights, brake lights, turn signals seat belts, an advanced braking system and reflectors — the vehicle rolled over several times.",
        "Miller was pronounced dead on the scene, while Hutchinson was transported to a hospital in critical condition. By the time the first officer arrived, he described in a sworn affidavit how there was 'a large crash scene with a golf cart on its side' and several victims laying among the wreckage.'He said his priority was treating the new bride, but when his efforts failed, he also rendered aid to Hutchinson and another member of their bridal party, Garrett Hutchinson.Another officer said he was unsure if the groom would 'make it through the night' following the crash. ",
        "Once the first officer was done triaging the injured parties, the officer said he then turned his attention to Komoroski, who was not injured in the collision.The officer said the 25-year-old Logistics Account Executive smelled of alcohol, and was unsteady on her feet. She even had trouble standing, the responding officer described, and when asked to rate her impairment on a scale of one to 10, she replied that she was at a level eight.But, the officer said, Komoroski told cops at the scene that all she had to drink was one beer and one tequila about an hour before.And when asked to perform a field sobriety test, the officer wrote 'she strongly refused and became uncooperative.' ",
        "By the time police arrested Komoroski, they wrote in an affidavit that she told hospital staff that she 'wanted to kill herself', before she was put into Charleston County Jail.Komoroski is now said to be on suicide watch, and is due back in court in June.She could face up to 25 years in prison for the death of the bride, as well of a fine of up to $25,100, and an additional 15 years and $10,100 for the serious injury caused to the men in the buggy.For the reckless homicide she could be handed a sentence of 10 years in prison, and a fine of up to $5,000 – as well as having her license revoked for five years on her release.",
        "She had previously been charged with speeding on May 31, 2018 in Horry County, South Carolina - home of Myrtle Beach and Coastal Carolina University, where Komoroski attended school.The 25-year-old was accused of speeding less than 10 miles per hour over the speed limit, to which she pleaded guilty and paid a $76.50 fine.Later that year, Komoroski pleaded guilty to a count of driving a vehicle at a speed that is unreasonable road conditions. She was arrested in November during a rare freeze warning in the popular tourist area.",
        "In 2019, Komoroski was again charged with speeding 10mph or less over the speed limit, to which she again pleaded guilty and paid another $76.50.More recently, she was cited for failure to use a turn signal or stop signal, to which she pleaded guilty on April 5, 2023, and paid a $25 fine.",
        "A review of Komoroski's social media also found that she once proudly posted a note she was given for parking in an 'inconsiderate and rude' way.She received the letter after bragging about 'battling for a parking spot', and was branded an 'entitled b****' after the incident in 2017.Posting the angry note online with the caption 'this b*** got p*ssed', the author of the message said: 'I'm sorry your mother didn't raise you to be a considerate person.'Hope you made it to whatever was so important to cause you to be that rude, hopefully you're not always like that. Have a wonderful day you entitle b***h.'Other pictures posted on her social media show her asking for 'plan B' with the hashtag 'getting that d***'.And another shows what appears to be marijuana in 2017. The drug is illegal in both New Jersey, where she grew up, and South Carolina, where she attended school. Komoroski could also be seen in social media posts pouring alcohol into her friend's mouth before swigging it herself when she was underage.",
        "Another post appeared to show her making a joke about crashing her white jeep on the beach, captioned 'I almost veered off into the ocean #oops'.It comes after DailyMail.com revealed images of the alleged drunk driver dressed as a bottle of Bud Light in 2018 – when she was underage.She had Bud Light logos strapped to her wrists and legs and the word 'year' scrawled on her T-Shirt.The outfit appears to have been a boozy Halloween pun on Toy Story character Buzz Lightyear, with Komoroski also wearing a makeshift pair of wings, similar to those seen on the toy spaceman.That snap is one of many on Komoroski's Instagram that refer to alcohol, or show her enjoying a drink.Her most recent photo - uploaded to Instagram last Tuesday - show her posing on a beach in a white bikini, with the caption 'Did someone say tequila?'Another uploaded on May 22 shows her clutching a can with the caption 'Chin up, butter cup!'.And in October 2018, Komoroski was snapped holding up a bottle of what appeared to be sparkling wine to her mouth, with the caption 'Tailgate Queens.'Hauntingly, Komoroski uploaded a photograph of herself on Folly Beach on March 28 - the same spot where her victims held their nuptials before Friday's tragic crash.",
        "Meanwhile, Hutchinson and one of his friends are continuing to recover at a local hospital.'He's laid up with gravel stuck in his head, stuck in his legs, stuck in his arms,' Jenkins told ABC4. 'He's going to be recovering too. And he said to me today they were having so much fun on my [LSV].'And Miller's family is also preparing for her funeral.'If she's cremated, we're going to bring her to Folly Beach,' her mother, Lisa, said. 'That's where she wants to be.' "
    ]
}