{
    "articleURL": "/wires/pa/article-12047035/Sean-Dyche-confident-fire-defender-Michael-Keane.html",
    "content": [
        "Everton manager Sean Dyche has given his backing to Michael Keane amid criticism of the defender’s performances.",
        "Keane, 30, has displaced Conor Coady to become a regular again in Everton’s back four since Dyche – his former manager at Burnley – arrived at Goodison Park, but fans have not necessarily been happy with the result as the relegation-battling Toffees have shipped 20 goals in the 10 games Keane has started.But Dyche said he retains full faith in a player capped 12 times by England.“I have faith in all the players,” he said. “I can only pick 11 so I have faith in all of them. At the end of the day, it’s the ups and downs of a footballer, the ups and downs of teams, the ups and down of careers – it all goes into the melting pot.“These are things the players have to work through, how to handle the goods, bads and indifferents.“A lot of noise grew in the Newcastle game (a 4-1 defeat on April 27). I thought (Keane) was our best player until the second goal – that’s how it can change very quickly.",
        "“He is a very good player amongst many good players here. Sorting the best 11 at any time, form related at any time, that’s the key to it.”Coady, a loan signing from Wolves last summer, was a regular alongside James Tarkowski in the first half of the season, but has not featured since February 25, while fellow defender Yerry Mina is available again after injury but has not played since January.",
        "“All the players need to keep doing what they are doing until we pick them, you can only pick 11,” Dyche said. “I make that clear to the players, you can question it and I am happy to speak about it, but you can only pick 11 players.“Everyone has to stay fit, sharp and committed to the cause and that is what we are looking to do for when the team has to change or does change.”Monday’s draw left Everton still 19th in the table, albeit only one point behind the three teams above them.On another night they might have comfortably won at the King Power Stadium having taken 23 shots at goal, but they were equally indebted to Jordan Pickford saving James Maddison’s penalty late in the first half to avoid going 3-1 down.Dyche said the performance gave his side confidence and reason to believe in what they were doing, saying “it reaffirms to them that we are on the right track”.But with a trip to Europe-chasing Brighton on Monday to be followed by the visit of reigning champions and title favourites Manchester City, Everton cannot afford to play so openly.“There’s a risk and reward,” Dyche said. “Defending correctly, attacking correctly, you have to find a balance somewhere. Some games just pan out like that.",
        "“Palace (a 0-0 draw at Selhurst Park on April 22) was the complete opposite, that was a slow, methodical game.“Maybe the intensity of it, the feel of it, the fact it was a big game, sometimes that can bring an openness to a game and sometimes it stays tight but you can’t define a game until it starts and you see it in front of your eyes.“You want to control performances but Leicester wanted to win the game and we wanted to win the game. You have to balance it, I think we did that but we didn’t get the result we were looking for.”"
    ]
}