{
    "articleURL": "/news/article-12041275/SNP-FINALLY-new-auditors-amid-financial-meltdown.html",
    "content": [
        "The SNP has finally secured new auditors as it scrambles to get hold of £1.3million in taxpayer funding.",
        "The Scottish nationalists have signed a contract to scrutinise its books after six months without any arrangements in place.Sources boasted that leader Humza Yousaf had 'put in some shift' to fix the financial chaos inherited from Nicola Sturgeon - which has seen her husband Peter Murrell, the party's former chief executive, arrested.Mr Yousaf had previously admitted that the party was struggling to find auditors, while Westminster leader Stephen Flynn had warned that it could miss out on more than a million pounds of 'short money' unless accounts were filed by May 31. Mr Yousaf said today: 'I am pleased to confirm that we have secured the services of auditors to take forward our accounts. 'We take our statutory obligations extremely seriously, so it is welcome news that AMS Accountants Group will complete the accounts for both the party and the SNP Westminster group. 'There is hard work ahead, but it is really encouraging to have them on board as we work towards challenging deadlines.' A party source told the BBC: 'Humza Yousaf, Stephen Flynn and their teams have had to put in some shift to fix the situation they inherited but they've managed to turn things around in a matter of weeks and both the party and the Westminster group now have auditors in place.' ",
        "The Scottish Tories will renew their push today for Mr Yousaf to make a statement to Holyrood on the turmoil engulfing the SNP.In the past month, both Mr Murrell and former treasurer Colin Beattie were arrested in connection with a police probe into the party's finances.Both Mr Murrell and Mr Beattie were released without charge pending further investigation.Allocations of so-called 'short money' slipped out by the House of Commons this week confirmed that the amounts have been increased in line with soaring inflation. Labour is entitled to nearly £7.7million this year, up from just under £7million in 2022-23. The Lib Dems are also eligible for £1.3million - up £100,000.The SNP has been allocated £1.3million, up from 1.2million.The boost comes as wages for Brits fail to keep up with rampant inflation, with the Bank of England urging people to recognise that the country is fundamentally poorer after the hits from Covid and the Ukraine war. "
    ]
}