{
    "articleURL": "/sport/football/article-12040607/Nemanja-Matic-backs-Mauricio-Pochettino-Chelsea-warns-young-players.html",
    "content": [
        "Nemanja Matic played more than 100 games for Chelsea over four seasons Former Premier League winner spoke about the mess at his old club Now at Roma, Matic says incoming Mauricio Pochettino will have problem  Nemanja Matic has issued a warning to Mauricio Pochettino about a problem he will have with the Blues next season, if he takes over at Chelsea. ",
        "The defensive midfielder, who played more than 100 times for the club between 2014-17, had his say on his old side's current plight. Chelsea lost 3-1 away at Arsenal on Tuesday night and are 12th in the Premier League table, losing every game under interim boss Frank Lampard following Graham Potter's sacking. They appear to be closing in on a deal to make Pochettino the next permanent boss but Matic thinks the Argentine will need time to fix the issues he'll be presented with.‘I think so (Pochettino will need time), he told Sky Sports.",
        "‘I have to say Chelsea did a great job signing so many talented players, but in the future, next season, they’ll need to make some balance between experience and young players.‘When you sign six, seven or eight young top talented players they all expect to play and that is a problem.He also pointed out that not all of those young stars, the likes of Enzo Fernandez, Mykhaylo Mudryk and Noni Madueke - who were all part of new owner Todd Boehly's £600m-plus spending spree since taking over - will develop at the same rate.‘Some will need time to adapt to the Premier League,' the 34-year-old went on. 'They will need six more months or one season to adapt, but during that transition the experienced players can help them.",
        "‘I think at the end of the season they’ll understand what the problem was and they will try to change. 'Next season I expect Chelsea to be much better, but it is going to be very difficult.’On Pochettino, the Roma midfield added: ‘He’s a great manager. He showed at Spurs and PSG that he can play some great football.",
        "‘He has experience and I know he’s very professional and a very honest person, so why can't he succeed?’Matic originally signed for Chelsea in 2009 before a loan away and stint at Benfica. He then rejoined in 2014 for £21m, where he went on to win the Premier League twice.He then followed Jose Mourinho to Manchester United for five seasons before again joining up with the Portuguese boss in Rome, where he has been a mainstay of the side this term.  "
    ]
}