{
    "articleURL": "/news/article-12054727/Were-William-Kate-late-Coronation-Prince-Princess-Wales-arrived-King-Queen.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today William and Kate may have arrived late to the coronation, prompting a change to the planned order of service before the King even stepped out of his carriage.",
        "The Prince and Princess of Wales were supposed to arrive and be seated before Charles and Camilla, the official order of service showed.Instead, they arrived after the monarch, meaning Charles first had to wait in his carriage before he finally walked into Westminster Abbey ahead of his eldest son. Meanwhile, 2,300 guests took their seats inside church before the ceremony began.The monarch appeared to admit he was 'worried about the time' following a wait inside the carriage, saying: 'I mean it's been longer this time'.The official order of service said: 'Their Royal Highnesses The Prince and Princess of Wales, Princess Charlotte of Wales and Prince Louis of Wales arrive at the Great West Door and are conducted to their seats in the Lantern. All remain seated. Their Majesties The King and The Queen arrive at the West Gate. A fanfare is sounded. All stand.'Instead, William and Kate stood behind the King and took their seats as he was already walking into the church.Yet although the Waleses seemed a tad subdued when they arrived for the grand and joyous occasion, the family came together and celebrated with glee as King Charles III was majestically crowned. The royals then made their way back to Buckingham Palace, waving to the millions who gathered along the route for a glimpse of the historic occasion.",
        "Even Prince Louis stole the show again - in part - as his adorable antics were once more caught on camera for the world to see. ",
        "Even so, the alleged minor blunder was spotted by keen royal fans, who took to social media to share their shock and disbelief. One said there was 'major ''fight in the car'' energy from all four of them.'Another said: 'I thought it was rude they arrived late.'A third added: 'They were late and Charles was not amused.'  Aside from the potential latecomers, the coronation seemed to go ahead without a hitch.King Charles III and Queen Camilla were cheered uproariously by up to  two million people on the streets of a rainy London today after the historic first coronation in Britain since 1953.The royal couple have arrived back at Buckingham Palace where they will wave to crowds from the balcony with working royals before a planned 60-aircraft RAF flypast, which has been scaled back to just helicopters and the Red Arrows because of terrible weather.",
        "The King and his wife were crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. The historic two hour service was marked by several poignant moments including Prince William kissing his father with his estranged brother Harry yards away.",
        "The 2,300-strong congregation bowed as the monarch, the 62nd in history, and his wife processed out of the Abbey. Charles and Camilla both smiled as they left and then entered the Gold State Coach, drawn by horses to take them past two million in the streets and 7,000 servicemen and women marching through the capital with them.",
        "Princess Anne followed their carriage on horseback with senior royals following in other state carriages. A smiling Prince Harry left in a luxury car, as did a much more sombre Prince Andrew.  Amid rumours Harry planned to be in and out of Britain in 24 hours, his car was seen leaving London, not going to Buckingham Palace.Queen Elizabeth II's eldest son was crowned King having prayed to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain and around the globe.Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. ",
        "The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.",
        "The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The monarch and his wife Queen Camilla had smiled at each other and to the congregation as they walked through the church.Mr Welby placed Queen Mary's Crown on the Queen's head and said: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues; reign in her heart, O King of love, that, being certain of thy protection, she may be crowned with thy gracious favour, through Jesus Christ our Lord. Amen.'",
        "The crown was made for Charles'S great-grandmother, Queen Mary, for George V's coronation in 1911.The Bishop of Dover then presented the Queen with the Rod with Dove, and the Sceptre with Cross by Lord Chartres.Queen Camilla acknowledged the rod and sceptre by touching them in turn, rather than holding them as Queen Elizabeth the Queen Mother did in 1937.The Archbishop of Canterbury then said: 'Receive the Royal Sceptre and the Rod of equity and mercy.",
        "'May the Spirit guide you in wisdom and grace, that by your service and ministry justice and mercy may be seen in all the earth.'The service then moved on to the Holy Communion, in which gifts of bread and wine were brought before the King for him to acknowledge.The Archbishop of Canterbury delivered a prayer over the bread and wine and then the Eucharistic Prayer.The Lord's Prayer was then said before Holy Communion was received by the King and Queen.",
        "The monarch had been heir to the throne since the age of three, and was ready to finally embrace his day of destiny with the woman he loves by his side. Before his crowning moment the King was anointed with holy oil away from public view. He was dressed in a white linen garment called Colobium Sindonis, a golden coat called the Supertunica and has had the coronation girdle placed around his waist.After being sanctified at his anointing, the King was presented with the coronation regalia. Minutes earlier Charles swore on the Bible and kissed it, having taken the oath: 'I, Charles, do solemnly and sincerely in the presence of God profess, testify, and declare that I am a faithful Protestant, and that I will, according to the true intent of the enactments which secure the Protestant succession to the throne, uphold and maintain the said enactments to the best of my powers according to law.'",
        "His family were sat closest to him in a 2,300-strong congregation, although Prince Harry was sat in the third row, away from Prince William, his wife and children, and other working royals.The Duke of Sussex was seen in the television footage watching intently as the archbishop raised St Edward's Crown above his father's head before crowning him.And when a few minutes later the congregation paid homage to the new monarch, Harry was seen, along with the other royals around him, speaking the words: 'God save King Charles. Long live King Charles. May the King live forever.'",
        "The two-hour service, pared back from his mother's in 1953, is a pivotal moment in the history of the Royal Family will balance ancient tradition and a future in the 21st century. In it Charles became the first monarch to pray publicly at a coronation - praying for grace to be 'a blessing to all... of every faith and belief', and to serve after the pattern of Christ.A special personal prayer was written for the King to reflect the 'loving service' theme of the service, and the words were inspired in part by the popular hymn I Vow To Thee My Country.He said: 'God of compassion and mercy whose son was sent not to be served but to serve, give grace that I may find in thy service perfect freedom and in that freedom knowledge of thy truth. Grant that I may be a blessing to all thy children, of every faith and belief, that together we may discover the ways of gentleness and be led into the paths of peace; through Jesus Christ our lord. Amen.'Prime Minister Rishi Sunak read The Epistle - Colossians 1: 9-17 to the congregation.Lambeth Palace said that although Mr Sunak is a Hindu, he is reading as Prime Minister so there is no issue over his personal faith during the Anglican service.",
        "Prince George and the other pages of honour were sitting behind the King in Westminster Abbey as Charles swore the coronation Oath.George's gaze could be seen flitting about the church from his seat behind his grandfather.The prince and his fellow pages then stood behind the kneeling Charles, holding the corners of his trailing robe, as he prayed.The King then signed copies of the Oaths, presented by the Lord Chamberlain, while the choir sang.At the beginning of the coronation service, a Welsh language piece was sung with the choir, together with Sir Bryn Terfel, singing Kyrie Eleison.As the bells of Westminster Abbey rang out, the King and Queen left the carriage. Camilla got out first followed by Charles after a short pause outside the church.The King waved and spoke to his grandson Prince George, a future king, who was among the pages of honour. His parents the Prince and Princess of Wales entered the abbey last before the royal couple arrived.As he arrived for the two-hour service, the Abbey's bells peeled as crowds stood in the rain cheering the arrival of the King and his wife. The entered the Abbey to state trumpeters, with the congregation standing as the royal couple entered.",
        "Prince George was carrying a corner of his grandfather, the King's, trailing robes as the royal party made its way into Westminster Abbey.His siblings Princess Charlotte and Prince Louis were earlier seen peering out of a car window as they arrived outside the church.As his father was cheered through the capital, royals including Prince Harry arrived at the service. The Duke of Sussex walked up the aisle alone, smiling at people as he walked to the front of the church. He grinned at people in the congregation before he took his seat.Stars in the Abbey included Katy Perry, Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement. First lady Jill Biden was among the last to enter before the service, sitting with First Lady of Ukraine Olena Zelenska. President Joe Biden has stayed at home. The Diamond Jubilee State Coach, drawn by six Windsor grey horses, arrived at Buckingham Palace for the King and Queen at 10am. Members of the Mounted Division of the Household Cavalry have lined up at the entrance to The Mall ahead of the King's Procession to Westminster Abbey.A mile away from the Palace, Westminster Abbey was rammed with the great and good from Britain and around the world as Charles III's day of destiny finally arrived and he will be crowned King today.More than 100 million people around the world watched the historic first coronation of a British monarch in 70 years - with an estimated two million people on the streets of London to watch history unfold. ",
        "Charles and Camilla waved to thousands of spectators lining the street as leading figures began to join members of the congregation in Westminster Abbey.The Prince and Princess of Wales chatted to each other as they waited to walk into the abbey, behind their eldest son Prince George who was one of the King's pages of honour.The couple appeared composed as they walked behind William's father, followed by their daughter Princess Charlotte and their younger son, Prince Louis.Well-wishers near Buckingham Palace were not put off by the rain as the Diamond Jubilee State Coach passed down the Mall.A group of royal fans dressed in Union Jacks sang 'Singing in the Rain' while the service at Westminster Abbey appeared on large screens.Songs from the service were played out over the crowds.People put picnic blankets on the wet floor and sat on steps as they watched cannons being carried along the Mall."
    ]
}