{
    "articleURL": "/wires/reuters/article-12039445/LIVESTOCK-CME-live-cattle-hit-five-week-low-technical-selling-economic-worries.html",
    "content": [
        "By Tom Polansek",
        "CHICAGO, May 2 (Reuters) - Chicago Mercantile Exchange live cattle futures dropped to their lowest level in more than five weeks on Tuesday as technical selling and concerns about the U.S. economy weighed on prices, analysts said.Economic worries increased after the failure over the weekend of First Republic Bank. Wall Street stock indexes sagged ahead of the Federal Reserve's interest rate decision on Wednesday and as investors worried the government could run out of cash after June 1 without a debt ceiling hike.Front-month live cattle futures touched their lowest price since March 24, after tightening supplies drove prices to an all-time high of 177.70 cents per pound on April 13. The most-active June contract on Tuesday ended down 1.975 cents at 162.90 cents per pound.\"Behind everything, there's still tightening cattle supplies,\" said Doug Houghton, analyst for Brock Associates. \"The market is probably going to be volatile, and it may correct more than it should based on the fundamentals.\"Lower prices in the cash market helped pressure futures, Houghton said, noting that some light trading of $172 per hundredweight in the southern Plains and Kansas was down $1 from last week.\"The cash market seems to have probably topped out here seasonally,\" Houghton said. \"Normally we're going to get some weakness from late spring in to summer.\"",
        "CME August feeder cattle sank 3.925 cents to end at 226.175 cents per pound.Boxed beef prices were also weaker, with choice cuts slipping by 78 cents to $309.24 per hundredweight and select cuts dropping by $2.34 to $288.66 per hundredweight, U.S. Department of Agriculture (USDA) data showed.Meatpackers slaughtered an estimated 127,000 cattle, down from 128,000 cattle a week ago but up from 126,000 cattle a year ago, the USDA said separately. Packers reduced the number of swine slaughtered for meat to 459,000 hogs from 470,000 hogs a week ago and 481,000 hogs a year ago.CME June lean hogs rose 0.250 cent to 89.950 cents per pound. (Reporting by Tom Polansek; Editing by Shailesh Kuber)"
    ]
}