{
    "articleURL": "/femail/article-12038903/What-fires-Mad-Lizzie-passion-helping-disadvantaged-children.html",
    "content": [
        "As well as volunteering at school, she runs a dance class in the local church hallREAD MORE: The Body Coach Joe Wicks adds £20million to the bottom line at his fitness empire in just one yearFor the benefit of anyone under the age of 40 reading this, Mad Lizzie was essentially the 1980s version of Joe Wicks. ",
        "There was the same zeal for getting the nation off the sofa and working out in front of the TV. The same relentless enthusiasm for squats and press-ups. The same hair.Drinking Earl Grey in the National Theatre’s café, Lizzie Webb is delighted with the comparison. ‘Unfortunately, after the Green Goddess, myself and Mr Motivator, it went absolutely quiet – there was no one doing [TV fitness]. So to have Joe Wicks doing that in lockdown was brilliant,’ she beams, her cut-glass, commanding voice instantly recognisable from her daily workouts on ITV’s breakfast show Good Morning Britain, produced by TV-am.Despite being absent from our screens for 30 years – in 1993 TV-am lost its franchise to GMTV, who brought in new presenters – Webb, 74, is still frequently recognised on the street. ",
        "The odd joker will approach her and start doing star jumps. ‘Then I’ll get flash, kick my leg up high and say, “Do that, then!”’ she says, blue eyes twinkling. A dance teacher, she can still do the splits, although that’s just ‘an occasional party trick’. Then there are the passers-by who ask if she’s the Green Goddess. ‘I have a stock answer: “No, I’m the other one”.’ That was Diana Moran, now 83, the BBC’s Breakfast Time fitness guru, against whom Webb was hired to compete in 1983. ‘",
        "She was this stunning, statuesque woman in a green leotard and TV-am must’ve thought, “We need someone completely different”,’ she says. She got the gig because the PA of channel boss Greg Dyke was a regular at one of her classes at the Dance Centre in London’s Covent Garden (where Arlene Phillips and Bruno Tonioli were also teaching). She recommended Webb, enthusing about her ‘mad’ instructor’s wisecracking, high-energy style. The nickname stuck and Webb has always embraced it, although she wonders whether it’d be quite as acceptable these days. Was Moran her mortal enemy? ‘No! We’ve only met on a couple of occasions. I don’t know how she viewed me, but I am grateful to her. I wouldn’t have had my job without her.’The nickname may not have aged well, but Webb has – the trademark curls are intact and she’s immaculately groomed, with scarlet lipstick and lots of gold jewellery. In her chic Ted Baker sweatshirt, jeans and trainers, she doesn’t walk across the café as much as bounce.‘I had a pneumonia jab last week and the nurse looked at my notes and said, “You’re not on any medication – do you know how unusual you are?” I’ve been very lucky to have had good health,’ she says. ",
        "She’s lived by the sea near Worthing for the past two years with her second husband, Douglas Cameron, 68, who was a technician for TV-am: ‘The papers called him my toyboy back then, for heaven’s sake!’",
        "She has just written a memoir, Mad About The Boys, which is far more than a heap of fluffy 80s TV anecdotes. Webb qualified as an English, drama and dance teacher in 1970 and the titular ‘boys’ refers to the hundreds of pupils she’s helped over the past half century. She has a particular passion for working with children from disadvantaged backgrounds and has really got stuck in – she spent so much time at Huntercombe Prison in Oxfordshire teaching young offenders she was given her own set of keys. She’s set up numerous education initiatives over the decades, spending 17 years running the charity Creativity in Sport. She’s worked across subject disciplines – concocting ways to teach children literacy and multiplication through movement, for example.For her first job, she asked to be sent to the worst school in London, landing in a boys’ comprehensive in Clapham, where some teenagers in her class couldn’t read. There she set up a lunchtime drama and dance club – one of the alumni of which is now an Emmy-winning TV producer, another the first black dancer in the English National Ballet and a third a West End theatre director. ",
        "Fifty-three years on, she’s about to start a new gig as a volunteer in her local primary school.She wrote the book, she says, to inspire teachers, share innovative ways of educating and tell the stories of the kind of children who don’t usually get a voice. It’s deeply inspiring – not least because Webb sold so many exercise videos in the 80s that she could’ve easily downed tools when TV-am folded.",
        "She is also more than happy to oblige with TV anecdotes. She chose and choreographed the music for her segments, so had the power to catapult tracks up the Top 40. Pop stars started joining her to work out. She helped break Take That in 1992, inviting them on the show three times. ‘Poor Gary, he’s not a natural mover,’ she recalls. ‘But Jason and Howard were a gift. And dear little Mark! Robbie was just naughty. He kept treading on my toes – he’s got quite big feet.’Simply Red’s Mick Hucknall, meanwhile, was a little ungallant. ‘I didn’t like to show guests up, so when we did press-ups, I did them on my knees the easy way. When I glanced at Mick, he was going like the clappers, doing full press-ups and telling me to keep up.’",
        "She was thrilled when Biba founder Barbara Hulanicki offered to dress her for TV. ‘What an honour! As a student, the most I could afford to buy at Biba was a pair of earrings. She’d noticed I wore normal clothes rather than aerobics gear because it was important to me that everyone felt they could join in.’ Hulanicki made her stretchy trousers and tops in vivid blues and pinks and viewers sent her garish jumpers they’d knitted. Webb still has a few, and wheels them out for TV appearances.It wasn’t all fun times. TV-am’s viewing figures were dire at first, the presenters (among them Anne Diamond and Nick Owen) had to pester the accounts department to get paid and there was a lot of job insecurity. ‘No one was actively hostile but I wouldn’t say I came away with great friends. People were vying for position,’ she says. Owen is the only one with whom she remains in contact. It can’t have helped that Webb, with her quick, light-hearted slots, became the most popular presenter, although no one told her until David Frost stopped her on the stairs one day to congratulate her.Nor were things easy at home. She was a single mother until she met Douglas, having split with Andy Webb, her first husband and a teaching colleague, in the late 70s. She talks about ‘mother’s guilt’ – having never got to do the morning school run with her son Ben, now 46, thanks to her 3am alarm calls. ",
        "‘He was five or six when I started the job so it was a formative chunk of his childhood. I had a very good au pair but there are still times when you feel you are missing out. I used to phone him every morning from my dressing room and play him Stevie Wonder’s ‘I Just Called to Say I Love You’. I still choke up when I hear that song.’Her own childhood was a mixed bag, growing up in Barnet, North London, with three sisters. Her loving mother, a secretary in the House of Commons, scrimped to send Webb to theatre, violin and ballet lessons. Her father, a Second World War veteran and computer programmer, was a tyrant by the sound of it. The four girls ‘and even the dog’ would fear the moment he walked through the door each evening. ‘He was so controlling,’ she says. ‘We were thrashed.’ Decades later she was asked by an educational psychologist why she was drawn to working with troubled children. The answer that came out of her mouth was not the one she had carefully planned. ‘I shocked myself. I simply said, “I wish I’d had someone like me to talk to when I was a child.”’ She doesn’t want to dwell on her father’s behaviour, and it’s mentioned only in passing in the book.‘I want people to be aware of the tremendously difficult lives these children have. Mine was nothing in comparison.’ She pauses, before adding quietly, ‘Although it’s all relative to you as a child at the time.’Today, as well as volunteering at the school, she runs a dance class in the local church hall, following a request from villagers of a certain age who were excited to clock Mad Lizzie in their midst. She’s meeting a group of nine college principals next week to talk about her experiences in education. She worries about the impact of lockdowns on the current generation of children. She clearly doesn’t need to do any of this – who would blame her for  embracing retirement? ‘I never twiddle my thumbs,’ she says. It’s not altruism, she insists. She does it because she draws huge satisfaction from seeing others achieve things – it shows her that she’s taught them well. Watch and learn, Joe Wicks!Mad About The Boys by Lizzie Webb is published by Coles, £20*"
    ]
}