{
    "articleURL": "/debate/article-12061105/ROBERT-HARDMAN-Images-majesty-history.html",
    "content": [
        "It is an image which will soon be framed on a British ambassador's desk or a high commissioner's grand piano. ",
        "Together with the other Coronation photographs released by Buckingham Palace yesterday afternoon, it will eventually hang in public buildings from the top of Canada to the South Pole.Here, in the official portrait of the Sovereign, we see an anointed monarch invested with the three most important pieces of the regalia: The Sovereign's Orb, representing the world, the Sceptre with Cross, representing good governance, and the ultimate symbol of kingly authority, the Imperial State Crown.They also show a man looking forward to shedding the lot. This image was taken at around 3pm on Saturday in the Throne Room at Buckingham Palace.By then, the King had processed out of the Abbey with the Queen, had ridden back to the Palace in the Gold State Coach, had received the Royal Salute from the Armed Forces in the garden and had made his appearances on the Palace balcony.",
        "The official portrait with photographer Hugo Burnand was his one last duty before the King could remove almost two and a half pounds of bejewelled gold off his head, lose the robes, park the regalia and enjoy a drink.  There was a lively atmosphere, just as there was in 1953 So, we see a man on the home stretch, proud and mightily relieved.",
        "Even on this grandest of royal occasions, however, there is an unvarnished quality to this scene.In 1953, Cecil Beaton performed the same task after the coronation of Elizabeth II, photographing the new Queen in Buckingham Palace's Green Drawing Room.Instead of using the Palace decor as his backdrop, Beaton placed the Queen in front of a printed image of Westminster Abbey, in much the same way that television stations sometimes insert an image of Big Ben or the White House behind a presenter sitting miles away in an airless studio.No one was pretending that Elizabeth II really was sitting in the Abbey. However, such artifice was acceptable in those days, as was Beaton's use of a naked 1,000-watt lamp, placed behind the Queen to 'burn out' the background and enhance the apparition of a divine light radiating around the sitter.The irony is that her son could not get away with that today. We may have seen giant advances in photography since then but a 21st century audience is so wary of doctored images and 'photoshopped' scenes that it spots them at once.",
        "That is why this image of Charles III is so authentic. We can even see a corner of his shirt which has not been tucked into his Royal Navy trousers (the monarch, incidentally, is the first King to have been crowned in trousers rather than stockings and breeches).",
        "I gather that there was a lively atmosphere going on in the background at the time, just as there was in 1953.On that occasion, two maids of honour had to stop a four-year-old Prince Charles from grabbing the Imperial State Crown off a table while one of Beaton's assistants just managed – in the nick of time – to stop Charles lunging for one of the bulbs in the 1,000-watt back light. Seventy years on, all eyes were peeled for Prince Louis.With the exception of Prince Harry, who was already on his way to Heathrow airport for a flight back to Los Angeles even before the King's balcony appearance, everyone else in Saturday's royal party at the Abbey had been invited back to the Palace to watch the flypast (from the garden side) and to enjoy a light, informal buffet lunch.Guests were then plucked from their tables to pose in a number of pre-planned groupings – shots with page boys, with grandchildren, with immediate family (including the Duke of York) and so on. Four photographs have been made public and we may see one or two more in the days ahead.For royal Kremlinologists, the most noteworthy sight will be that of the group photograph featuring the 'working' family, namely all those members who undertake official engagements 'in support of the monarchy'.",
        "Here is the King standing between the Queen and his sister (who had chosen to ride back from the Abbey in a protective role, as Colonel of the Blues &amp; Royals and Gold Stick, rather than in a carriage).Rewind to the conclusion of the late Queen's great Diamond and Platinum Jubilee celebrations in 2012 and 2022.Back then, the Princess Royal was not even on the Palace balcony. Judging by Saturday's Coronation photograph, she is now the King's right hand woman."
    ]
}