{
    "articleURL": "/wires/reuters/article-12057417/Soccer-De-Gea-error-gifts-West-Ham-1-0-win-Manchester-United.html",
    "content": [
        "LONDON, May 7 (Reuters) - A howler by Manchester United goalkeeper David De Gea gifted West Ham United three vital points in their battle against relegation as the hosts secured a 1-0 Premier League win at the London Stadium on Sunday.",
        "United are fourth on 63 points after 34 games, one ahead of Liverpool and with a game in hand over the Merseysiders, while West Ham are 15th on 37 points, seven above the drop zone.Visiting forwards Marcus Rashford and Antony hit the post in the first half but De Gea's error will capture the headlines as it reopened the chase for Champions League places.Said Benrahma's bouncing shot from distance looked to be no real threat but although Spaniard De Gea dived and got a hand to it he failed to keep the ball out as West Ham took the lead.\"It´s part of football. You have a lot in your head but football is a game of mistakes,\" United boss Erik ten Hag told the BBC.\"There's a team, you have to bounce back and deal with the effect. You can also say in front of goal we weren't clinical enough.\"The goal knocked the wind out of United's sails and they were lucky not to concede a penalty when Victor Lindelof moved his arm into the path of a ball from Benrahma, with VAR deciding not to recommend a spot kick as the first half came to a close.De Gea redeemed himself somewhat early in the second half with a superb reaction save to deny Tomas Soucek but he looked shaky again as Soucek found the net with a header in the 73rd minute, only to see the effort chalked off for offside.",
        "ANOTHER DEFEATWith United striker Wout Weghorst ineffective, Anthony Martial added a much-needed focal point for their attack when he came off the bench in the 57th minute.Rashford forced a quick reaction stop from Lukasz Fabianski and Martial also had an effort saved as United increased the pressure, with Martial also flashing a stoppage-time header across the face of the goal.Despite 10 minutes of stoppage time, United could not score and they slumped to a second league defeat in a row after losing at Brighton &amp;amp; Hove Albion by the same scoreline on Thursday.West Ham captain Declan Rice was well aware of the significance of the result in terms of his side's battle to stay in the Premier League.\"The points it puts us on now put a nice gap between us and the teams at the bottom. There's still three (games) to go but the significance of the three points is massive,\" he told BT Sport.\"I think that´s our best performance at home this season. Front foot, aggressive one against one, on the ball, everything today was a real positive performance,\" he added.Hammers boss David Moyes praised his side's \"huge character\" but cautioned that they were not out of the woods just yet.\"The number isn't confirmed that it keeps you in the Premier League, so we have to look forward to the next game and try and pick up more points,\" he told BT Sport. (Reporting by Philip O'Connor; editing by Clare Fallon and Ken Ferris)"
    ]
}