{
    "articleURL": "/wires/ap/article-12048265/US-didnt-screen-workers-migrant-centers-Watchdog.html",
    "content": [
        "SAN DIEGO (AP) - The federal Health and Human Services Department often failed to perform required background checks on workers at emergency holding centers for migrant children who crossed the U.S.-Mexico border alone during a surge in 2021, the agency's internal watchdog has found.",
        "The inspector general's report released Thursday raises questions about how better prepared authorities will be for the next emergency, especially with coronavirus pandemic-related asylum restrictions scheduled to end this coming week and expected to result in more arrivals.The report, based on a sampling, found that 200 workers did not have background checks for child abuse or neglect and only 29 did, though 20 of those were not done in a \"timely manner.\"Investigators found 174 did not have FBI fingerprint background checks while 55 did, but 25 of those were not done in a \"timely manner.\" Checks against the Justice Department's sex offender registry, which were required less often, were not done on 42 workers and were performed on 36, though 11 were not in a \"timely manner.\"Criminal background checks based on publicly available records were done more often, but still on far less than half of new hires.Also Thursday, the federal Department of Homeland Security's internal watchdog released a results of interviews and survey responses from more than 9,300 employees that found border flows - both illegal crossings and legal trade and travel - are \"unsustainable\" without more staffing. The department's efforts to address the growing workload with temporary transfers and overtime were determined to be insufficient.",
        "The workload, particularly since 2019, has \"negatively impacted the health and morale of law enforcement personnel, who feel overworked and unable to perform their primary law enforcement duties,\" the Homeland Security inspector general wrote.The Health and Human Services review of unaccompanied children focused on 10 of 14 contracted \"emergency intake sites,\" including convention centers in San Diego and Long Beach, California, a county fairgrounds near Los Angeles and two military bases in Texas. It included a department-run overflow site in Carrizo Springs, Texas, which also often failed to perform required checks.HHS expanded holding capacity to 13,500 beds by the spring of 2021 but was unprepared for increased flows that occurred shortly after President Joe Biden took office, forcing authorities to ask the military and local governments for help opening emergency shelters for up to six months.The department's Office of Refugee Resettlement \"must address the shortcomings we identified to ensure that similar issues do not recur during future influxes.\" the report concluded. \"Effective oversight of facility operations and clearly communicating background check requirements are critical to ensuring the safety of children.\"HHS agreed with the watchdog's seven recommendations. January Contreras, assistant secretary for children and families, said the report covered \"one of the most challenging periods\" in its history of caring for migrant children and noted that the surge occurred amid the pandemic.",
        "Under federal law, HHS takes custody of children who cross the border alone - generally within 72 hours of arrest - and places them with family or other sponsors while their cases wind through immigration courts.The department received more than 122,000 children in the 2021 budget year, compared with about 19,000 the previous year, Contreras said.The Border Patrol held children for days, even weeks, in 2021 until the health agency was prepared to take custody. The Border Patrol once held more than 4,000 people, largely unaccompanied children, at a facility in Donna, Texas, that was designed for 250 with COVID-19 restrictions.In a response to the inspector general, Contreras wrote that HHS \"continues to search for more efficient ways to reduce barriers to the timeliness of background check adjudication, has made progress, and is working in real time to improve its processes.\"U.S. authorities recorded the highest number of crossings by children traveling on along on record in March 2021, when nearly 19,000 were taken into custody. For this past March, the latest publicly available data, about 12,500 were taken into custody."
    ]
}