{
    "articleURL": "/news/article-12045063/California-student-calls-school-board-putting-women-jeopardy.html",
    "content": [
        "Megan Simpkins denounced the Riverside Unified School District board for allowing a trans student to use the girls' locker room and bathroomHer remarks came after a viral video showed a transgender female student pushing and punching two smaller girls at the schoolParents and students said the student had a history of showing her genitals in the bathrooms and locker roomsAn 18-year-old California student called out her school district for 'putting women in jeopardy' after a video emerged of a trans female student assaulting two girls following an apparent locker room encounter.",
        "Megan Simpkins, a senior at Martin Luther King High School, denounced the Riverside Unified School District board at its recent meeting for allowing the transgender student - who was born a biological boy - to use the girls' locker room and bathroom.She asked the board why the female students 'don't ever get a say in whether or not we are comfortable with this.' Simpkins suggested the school board needs to make changes to ensure the safety of its students in the aftermath of the video, which showed a trans girl pushing and punching two smaller girls at the school.The fight came as students said the transgender female had a history of showing her genitals in the bathrooms and locker rooms.",
        "In the viral video, a short girl could be seen confronting the trans student, who lifts her and pushes her into a table.The girl then pushes her back, at which point the trans student hovers directly over the girl and pushes her back again.When the girl recovers, she and one of her friends try to fight back the trans student, seen wearing a gray hoodie and dark jeans.In response, the unnamed transgender student starts punching them and beating them to the ground. After the video went viral, parents and students told FOX 11 the transgender pupil has a history of 'erratic and uncomfortable behavior.'",
        "'He spit on my friends that are girls, females,' student Aiden Vermier said. 'He shows his genitals in the locker room.'The Riverside Police claimed it was not the first time the trans student had been involved in an altercation at the school. In the aftermath, the school district released a statement reaffirming its commitment to safety.'Since the incident occurred, district staff has been working to ensure the safety and rights of all students are considered and promptly responded to,' the school board said in the statement posted to Twitter on April 27.'We are able to verify that the student involved will no longer be attending King High School,' it added.",
        "But that statement did not seem to do enough to assuage Simpkins, who took the microphone at the district's board meeting later that night.'Good evening ladies and gentlemen, and only ladies and gentlemen it is and always shall be,' she began her remarks before starting to discuss the video.'There was an incident within our district that occurred recently regarding a transgender woman, who really is a biological man, having an altercation with a young woman at MLK high school,' she continued, noting that the video 'infuriated' her.'But what was detrimental to this is the fact that this man is and has been using the women's restroom and locker room.",
        "'Firstly, the question we must address is why are we affirming the mental confusion of this boy and putting the safety of women in jeopardy by allowing mentally confused men to use women's spaces?' Simpkins asked in her rant.'Of course any male who claims he is a woman will accept it, but what about the women? What about the true girls like myself who are females down to our DNA? Why don't we ever get a say in whether or not we are comfortable with this?'The truth is we aren't, the majority of us aren't,' she said, 'and yet nothing has been done to protect the safety of these women.'I will conclude with this,' Simpkins told the school board. 'It all starts with you. You are in charge of the safety of us women.' It is the latest row to break out over the use of high school bathrooms and locker rooms by transgender students.Just last month, a law group demanded 'actions and answers' from a Wisconsin high school after a transgender student allegedly 'exposed their male genitalia' to four freshmen girls in the locker room showers after a swim class."
    ]
}