{
    "articleURL": "/femail/article-12042687/Im-horse-racing-expert-heres-win-money-Kentucky-Derby-bets.html",
    "content": [
        "Sports expert and betting TV host Cam Rogers has revealed his insights His TikTok clip has been watched over 52,000 times in the run up to the eventThe expert outlines six things to take into account when placing a bet How do you fancy your chances of galloping home with a barnful of winnings at this year's Kentucky Derby?",
        "Well in a bid to boost your luck on May 6, sports expert and betting TV host Cam Rogers has revealed his insights around what makes a winning horse. In a TikTok clip - which has been watched more than 52,000 times - the Washington, D.C. based anchor outlines six things to take into account when placing a bet. He then reveals the four horses out of the 20 thoroughbreds he will be punting on, given the way they fit with with his trends. Canter down to get your fill of Kentucky Derby insider tips. ",
        "Tactical speed mattersCam says that tactical speed 'matters more than ever before.' He reveals that from 2014 through 2021, seven out of eight Kentucky Derby winners 'set or tracked the pace from no farther back than third place.' This means it is worth watching the prep races before the main event, to see how the horses measure up. Finishing fast 'Finishing fast is key,' Cam says. According to the sports pro, 19 of the last 25 Kentucky Derby winners 'successfully shaded the 38 second mark in their final prep.'This means the horses sprinted the final three-eighths of a mile in 38 seconds or less and the final eighth of a mile in 13 seconds or less. ",
        "Come from California The sports expert reveals that if the horse is California based 'that seems to be an advantage' and seven of the last 11 champions hailed from the west coast. He notes that of the entrants this year, Practical Move, Reincarnate, and Skinner fit into the California category. ",
        "Avoid post one or two horses The 'post position' is the position at the starting gate a horse will start at in a race. Cam says this can have big implications and instructs viewers: 'Do not bet on posts one or post two horses this week.'He notes that the last champion for post one came through in 1986, while the last post two champion scored a victory in 1978. This year's post one position horse is Hit Show, while Verifying is on post two.Form mattersCam highlights that 'momentum and form matters' and nine of the last 12 Derby winners were coming off a victory. For this reason, it might be worth researching which of the competitors recently won races and hedging your bets with them. Unraced as juveniles 'Beware horses who went unraced as juveniles,' Cam says. In the comment section he goes on to reveal that only one horse - the 2018 Triple Crown winner Justify - ever won the Kentucky Derby without racing as a two-year-old.",
        "This year, Cam points out that Kingsbarns and Mage never raced as juniors.Cam's final verdict...   The sports betting aficionado says based off of his trends 'and more' he likes these four horses: Forte, Practical Move, Angel of Empire and Skinner.However, in the comments section he reveals that his 'official pick' is Practical Move.",
        "Hit Show, trained by Brad H Cox. Jockey: Manuel FrancoVerifying, trained by Brad H Cox. Jockey: Tyler GaffalioneTwo Phil's, trained by Larry Rivelli. Jockey: Jareth LoveberryConfidence Game, trained by Keith Desormeaux. Jockey: James GrahamTapit Trice, trained by Todd Pletcher. Jockey: Luis SaezKingsbarns, trained by Todd Pletcher. Jockey: Jose L OrtizReincarnate, trained by Tim Yakteen. Jockey: John R Velazquez Mage, trained by Gustavo Delgado. Jockey: Javier CastellanoSkinner, trained by John Shirreffs. Jockey: Juan J HernandezPractical Move, trained by Tim Yakteen. Jockey: Ramon A VazquezDisarm, trained by Steven Asmussen. Jockey: Joel Rosario (TBC)Jace's Road, trained by Brad H Cox. Jockey: Florent GerouxSun Thunder, trained by Kenneth McPeek. Jockey: Brian Joseph Hernandez Jr.Angel Of Empire, trained by Brad H Cox. Jockey: Flavien PratForte, trained by Todd Pletcher. Jockey: Irad Ortiz Jr.Raise Cain, trained by Ben Colebrook. Jockey: Gerardo CorralesDerma Sotogake, trained by Hidetaka Otonashi. Jockey: Christophe-Patrice LemaireRocket Can, trained by William Mott. Jockey: Junior AlvaradoLord Miles, trained by Saffie A Joseph Jr. Jockey: Paco LopezContinuar, trained by Yoshito Yahagi. Jockey: Ryusei SakaiRESERVES: Cyclone Mischief, trained by Dale Romans. Jockey: Joel Rosario (TBC) Mandarin Hero, trained by Terunobu Fujita. Jockey: Kazushi KimuraKing Russell, trained by Ronald Moquett. Jockey: Rafael Bejarano HOW TO WATCH NBC will be broadcasting live coverage of the Kentucky Derby with the horse racing event streamed on Peacock, starting at 12pm ET on Saturday. The Kentucky Oaks will also be shown on the same platforms on Friday, May 5, starting at 1pm ET."
    ]
}