{
    "articleURL": "/news/article-12050899/Scott-Morrison-takes-new-role-adviser-American-security-think-tank-CNAS.html",
    "content": [
        "Scott Morrison accepts US think-tank jobHe is expected to quit politics this year  Scott Morrison has taken up an advisory position at a Washington-based think tank, amid speculation the former prime minister will quit politics by the end of the year. ",
        "Mr Morrison will now be on the board of advisors for the Center for a New American Security (CNAS), an independent think tank focusing on national security and defence policies.He joins Rupert Murdoch's son James on the board.",
        "CNAS chief executive Richard Fontaine praised Mr Morrison's time as PM and described his leadership during Covid as one of the most successful in the world.Mr Morrison's role in the AUKUS agreement between Australia, the United Kingdom and the United States was also praised during the announcement. 'As Prime Minister, Scott Morrison spearheaded the landmark AUKUS defense agreement and led his country's efforts to deal with an increasingly aggressive China,' he said.'As the newest member of the CNAS Board of Advisors, his insights and expertise will strengthen the Center's research and work. We look forward to his contributions.'CNAS was set up in 2007 by Kurt Campbell, who is now the Biden administration's National Security Council Co-ordinator for the Indo-Pacific.The centre describes itself as being 'an independent, bipartisan, nonprofit organisation that develops strong, pragmatic, and principled national security and defense policies'. ",
        "It comes after reports circulated earlier this week that Mr Morrison was considering taking a job in the UK's defence sector.Two sources close to him said he is considering the potential job offer, the Sydney Morning Herald reported. ",
        "Mr Morrison is widely expected to quit frontline politics at some point after the May 9 budget and before the end of the year. The job offer is yet to be finalised but if it is made – and Mr Morrison accepts – it would require the former prime minister to commute to the UK about once a month, with his family remaining in Sydney.Mr Morrison did not deny the claims when contacted for comment.'I'm very engaged with things in my local electorate and enjoying being back in my local community,' he told the publication.Mr Morrison's exit would trigger a by-election in the seat of Cook, south of Sydney, which he held with a two-party preferred margin of 12.4 per cent at the 2022 federal election. On Tuesday, Liberal leader Peter Dutton was asked if Mr Morrison had told him he will be resigning from parliament soon.'No, he hasn't. I had dinner with Scott the other night,' Mr Dutton responded.'He's obviously a distinguished former prime minister of our country and in relation to his own future, that's a question for him'."
    ]
}