{
    "articleURL": "/tvshowbiz/article-12038227/Kate-Hudson-Gigi-Hadid-bond-post-Met-Gala-Casamigos-party.html",
    "content": [
        "Kate Hudson, 44, and Gigi Hadid, 28, bonded at Stella McCartney and Baz Luhrmann’s Met After Party with Casamigos that took place after the Met Gala on Monday night. ",
        "The actress and the model got close as they partied the night away after fashion's biggest night of the year. Kate looked sizzling in a black gown with a plunging neckline and leg slit that showed off her toned and sculpted legs. Gigi wore a sheer black slip dress that featured lace at the bodice and showed off her tiny black panties and paired it with sheer black gloves.The How to Lose a Guy in 10 Days star and catwalk veteran looked like they could be sisters in the photo they snapped with designer Stella McCartney. ",
        "The party was hosted by McCartney and director Baz Luhrmann with Casamigos Tequila.Other celebs in attendance included Karlie Kloss, 30, and her husband John Kushner, Jennifer Lopez, Aubrey Plaza, Madelyn Cline, Jared Leto. Chris Rock, Penelope Cruz, Irina Shayk, Gigi Hadid, Leonardo DiCaprio,  Gisele Bündchen, Cara Delevigne and Olivia Wilde.Earlier in the night, Gigi walked the red carpet at the Met Gala at New York City's Metropolitan Museum of Art.This year, the ball's theme is Karl Lagerfeld: A Line of Beauty. The late German designer, who died in 2019 at 85, was Chanel's long-time creative director. She wore a striking black bustier from Givenchy Haute Couture that showcased her curves.The bodice of the dress featured lines of sequins that looked like zippers.",
        "The rest of the gown feature sheer black fabric draped strategically around the model's body.A double strand of pearls and a diamond necklace encircled her throat.",
        "Celebrities have ascended the majestic staircase into the exclusive party since 1948.The event is always held on the first Monday of May and the annual extravaganza kicked off at 6:30PM EST on May 1.Kate skipped the Met Ball this year, but hit the after party with her fiancé, Danny Fujikawa.She accessorized her sexy black dress with a pair of clear and black heels and dramatic, sparkling chandelier earrings."
    ]
}