{
    "articleURL": "/tvshowbiz/article-12040707/Jessica-Alba-cheers-Knicks-sitting-courtside-basketball-game.html",
    "content": [
        "Jessica Alba was spotted at the New York Knicks versus Miami Heat game at Madison Square Garden in New York City on Tuesday.",
        "The 42-year-old actress dressed up to join the trio of iconic comedians — Chris Rock, 58, Dave Chappelle, 49, and Tracy Morgan, 54 — as they all sat courtside to watch the basketball game.The Dark Angel star — who celebrated her birthday last Friday — sported an oversized, double-breasted jacket with a snake print design and denim jeans.The Golden Globe nominee sported knee-high, leather boots and an orange shoulder bag to represent her team's colors.During the game, the four were spotted taking group photos together and seen cheering on the Knicks. ",
        "The mother-of-three attended the game with her pal Lizzy Mathis.The entrepreneur opted for minimal makeup to showcase her radiant beauty and styled her medium brunette tresses in voluminous curls.Peeking out from behind her hair was a pair of large hoop earrings. She also donned dainty gold rings as well as an eye-catching gold necklace with large chain links. During a pause in the middle of the game, Alba was seen posing for a quick snap with Rock — who attended the star-studded Met Gala afterparty with model Irina Shayk the day before.The stand-up comedian opted for a casual all-black outfit that he wore underneath a bright blue and orange bomber jacket.The Everybody Hates Chris alum dressed for comfort in a pair of white sneakers.",
        "Morgan was also represented the team colors as he was photographed in a similar blue and orange bomber jacket.",
        "Underneath, he opted for a classic white T-shirt and accessorized with a flashy gold chain. Chappelle opted for a simple black T-shirt and matching denim jeans paired with crisp, white sneakers. The three renowned comedians also took a group photo together as they watched the Knicks make their comeback during the second game of the semifinals.With the lucky charms in attendance, the Knicks ended up beating the Heat with a score of 111-105 to tie up the series."
    ]
}