{
    "articleURL": "/wires/ap/article-12060527/Editorial-Roundup-United-States.html",
    "content": [
        "Excerpts from recent editorials in the United States and abroad:",
        "May 3The Washington Post on court costs that trap the poor.Nearly a decade ago, a federal investigation into the Ferguson, Missouri, police department drew widespread attention to how many municipalities rely on funding from hefty court fees and fines, often resulting from minor automobile-related violations. This encourages aggressive enforcement and leads to modern-day debtor prisons, in which poor people are incarcerated not for any underlying criminal conduct - only for lacking money to afford escalating penalties.The Obama Justice Department issued guidance aimed at limiting this pervasive and predatory practice. But the Trump administration, under Attorney General Jeff Sessions, rescinded it in 2017. Last month, the Biden Justice Department released a more robust version of the Obama-era memo that lays the groundwork for legal challenges to excessive court fees.Associate Attorney General Vanita Gupta argued that overly burdensome fees and fines violate several constitutional rights: The Eighth Amendment bans cruel and unusual punishment, prohibiting costs that are grossly disproportionate to the severity of the offense; the Sixth Amendment requires due process protections, such as access to counsel, when unpaid fines might lead to jailtime; and the 14th Amendment prohibits incarceration for not paying fees without establishing that failing to do so was willful and considering alternative punishments, she argued.",
        "Unfortunately, the federal government is limited in restricting outrageous fees and fines at the state and local levels. But the Justice Department can use the bully pulpit. The federal government can also condition federal grants on municipalities improving their practices, and the department can support legal challenges by defendants trapped in a spiral of fines and fees. Fortunately, despite the Trump administration´s rollback of the previous guidance, 24 states and D.C. have ended or amended policies that suspend driver´s licenses for unpaid fines and fees since 2016.This effort is impressively bipartisan. Texas, Louisiana and Oklahoma have eliminated some or all fees charged to youths in the juvenile system. California has eliminated 40 fees and discharged $16.5 billion in court debt over the past three years. Delaware passed a law prohibiting courts from issuing arrest warrants only for unpaid court debt. Oregon forgave nearly $2 million in uncollected traffic fines to allow 7,000 residents to reapply for driver´s licenses they had lost for not paying. The Fines and Fees Justice Center, working with the American Civil Liberties Union on the left and Americans for Prosperity on the right, launched a national campaign last year called End Justice Fees.But the problem persists. A county in Kentucky with just over 100,000 people reportedly jailed six people in a single week last November for \"non-payment of court costs, fees, or fines.\" Hundreds of people get sentenced to \"restitution centers\" every year in Mississippi. There´s a systemic racial element: A Nevada study found that African Americans constitute 13% of Clark County´s population but are the targets of 44% of arrest warrants issued for failing to pay a traffic ticket.",
        "As attorney general, Mr. Sessions also shuttered the Office for Access to Justice, which the Obama administration created to help people with low incomes navigate the legal system. Attorney General Merrick Garland reopened the office. It´s now working on a best-practices guide to highlight jurisdictions thoughtfully tailoring fines and fees. The new guidelines emphasize the importance of studying a defendant´s ability to pay, considering alternatives to fines and fees and ensuring due process protections so people can challenge unfair costs.Fines and fees cannot be totally eliminated. A fine is often a good substitute for jailtime. It´s also essential for traffic safety that there be consequences, short of incarceration, for speeding, reckless driving, parking in unauthorized places, cracked windshields, broken taillights, and so forth. And it´s fair to compel citizens who use the justice system to cover some share of its operating costs, especially when they are found guilty or at fault.But state and local governments cross the line when, first, they fail to consider someone´s ability to pay and, second, they rely on fees to fund extraneous projects and programs unrelated to the court´s functioning. The Justice Department´s 2015 report said policing practices in Ferguson were \"shaped by the city´s focus on revenue rather than by public safety needs.\" That should never be the case.",
        "ONLINE: https://www.washingtonpost.com/opinions/2023/05/03/doj-court-fees-cruel-punishment/___May 4The New York Times on overhauling the U.S. power grid.To tap the potential of renewable energy, the United States needs to dramatically expand the electric grid between places with abundant wind and sunshine and places where people live and work. And it needs to happen fast. The government and the private sector are investing heavily in a historic shift to electric-powered vehicles, heating systems and factories, including hundreds of billions of dollars in federal spending approved last year as part of the Inflation Reduction Act. But without new power lines, much of that electricity will continue to be generated by burning carbon. Unless the United States rapidly accelerates the construction of power lines, researchers at Princeton University estimate that 80% of the potential environmental benefits of electrification will be squandered.The United States needs 47,300 gigawatt-miles of new power lines by 2035, which would expand the current grid by 57%, the Energy Department reported in February. A 2021 report by the National Academies of Sciences, Engineering and Medicine arrived at a similar figure. To hit that target, the United States needs to double the pace of power line construction.The current power grid was constructed over more than a century. Building what amounts to a new power grid on a similar scale in a small fraction of that time is a daunting challenge. It will require tens of billions of dollars in financing, vast quantities of steel and aluminum and thousands of specialized workers. But building is the easy part. What makes the target virtually impossible to hit is the byzantine approval process that typically includes separate reviews by every municipality and state through which a power line will pass, as well as a host of federal agencies.",
        "In 2005, for instance, the largest power company in Arizona proposed to build a transmission line to carry electricity to its customers from a new wind farm in Wyoming. Last month, after 18 years of legal battles and hearings and revisions, the TransWest Express project was finally approved. It still won´t be completed until 2028 at the earliest, though.The most important change necessary to overhaul the permitting process is to put a single federal agency in charge of major transmission projects. Congress has empowered the Federal Energy Regulatory Commission to approve major natural gas pipelines, which helped to expedite construction during the fracking boom. It ought to be at least as easy to build renewable energy projects.To achieve that goal, Senator Sheldon Whitehouse, Democrat of Rhode Island, and Representative Mike Quigley, Democrat of Illinois, have proposed legislation that would endow the F.E.R.C. with the power to approve the routes of major electric transmission lines that pass through multiple states, replicating the power the agency already has over pipelines. Streamlining regulation to accelerate renewable energy development is a plan that both parties can embrace.This federal pre-emption of state and local authorities would only apply to major projects of national importance, like the Grain Belt Express, a proposed power line stretching from Kansas to Indiana that has been pursuing state approvals for more than a decade, or the SunZia project between New Mexico and Arizona, which has been on the drawing board since 2006. Under the proposed legislation, state and local governments still would retain oversight of the small projects that make up more than 90% of all transmission projects.",
        "The current approval process - or more accurately, the current jumble of approval processes - is a mess created by decades of well-intentioned efforts to prevent corporations from running roughshod over the interests of individuals, communities and the environment. Safeguarding those interests is important, but granting a veto to every community through which power lines may pass comes at the expense of other communities, and it causes other kinds of environmental damage.Shifting decision-making from state and local governments to the federal government would create a single, national forum in which policymakers can weigh the costs and benefits of power projects. The federal government - the mechanism Americans have created to act in the interest of people in America as a whole - is where those decisions should be made.The nation´s environmental laws, especially the National Environmental Policy Act, arose from a sensible desire to ensure that big projects didn´t cause big environmental problems. But members of both parties agree that over time the requirements imposed by the law, which requires careful examination of the impact of major projects, have become unnecessarily cumbersome. One recent analysis calculated that it takes the government a median period of 3.5 years to review renewable energy projects.The competing environmental priorities of developing renewable energy and protecting existing ecosystems can be better balanced by imposing strict time limits on environmental reviews while also increasing funding to ensure regulators have the capacity to meet those deadlines. Congress also could expedite consideration of inevitable legal challenges by adopting a proposal recently highlighted by the Brookings Institution to send challenges to the Court of Appeals for the D.C. Circuit.Instead of waiting for companies to propose projects, the Energy Department also can accelerate construction - and focus private investment - by identifying where power lines should go and beginning the approval process before companies apply. The Inflation Reduction Act strengthened the federal government´s authority to engage in this kind of planning, but states have resisted federal encroachment on their authority and the Biden administration has declined to force the issue, emphasizing its desire to work with states.In January, the administration celebrated a small victory, sending Vice President Kamala Harris to Arizona for the groundbreaking on the Ten West Link power line project between Arizona and California, which was first proposed in 2015. But far too many projects remain in limbo, in part because states and communities along power line routes have little incentive to quickly approve projects intended to deliver electricity somewhere else.The nation´s transmission lines also are broken up into regional grids that operate like jealous petty potentates, resisting stronger links that would allow renewable energy to flow across regional boundaries. In the Midwest, where the Energy Department says the need for new power lines is greatest, the list of projects in limbo includes the SOO Green Line, proposed in 2012, which would carry electricity from Iowa to the outskirts of Chicago underground, alongside railroad tracks. The line would connect a grid called MISO, which covers part of the Plains region, with a grid called PJM, which serves parts of the Midwest and the Mid-Atlantic and has opposed the project.This Balkanization of the electric grid keeps costs unnecessarily high and makes it harder for utilities to meet surges in demand. In February 2021, more than 100 people froze to death in Texas, in part because the local grid operator, the Electric Reliability Organization of Texas, had limited capacity to draw power from neighboring grids. Congress can encourage a greater spirit of cooperation and help to combat climate change by mandating a minimum transfer capacity for each grid.Congress and the Biden administration have taken a series of promising steps toward ending the nation´s dependence on carbon. But the absence of a plan to build a new electric grid is a critical hole in that emerging strategy. Without decisive action, they will waste a precious chance to limit climate change.ONLINE: https://www.nytimes.com/2023/05/04/opinion/nepa-permitting-reform.html___May 4The Wall Street Journal on President Joe Biden and the banks.Regional banks took another market drubbing on Thursday, as the financial panic rolls on despite regulatory assurances that all is well. The turmoil wasn´t helped Thursday when midsize TD Bank and First Horizon Bank called off their merger, blaming regulatory impediments.The merger cancellation followed the Biden Administration´s decision on Monday to give JPMorgan a sweetheart deal to acquire failed First Republic Bank. It´s good to be a really, really big bank these days.Memphis-based First Horizon and TD announced their $13.4 billion tie-up in February 2022, long before turmoil rocked midsize banks. The goal was to diversify their deposits and better compete with the giants. Combined they´d have $466 billion in assets, which would make the new bank the ninth largest in the U.S. TD is currently the tenth.TD and First Horizon appear far healthier than other regional banks such as PacWest and Western Alliance. They haven´t experienced large deposit outflows and are carrying fewer unrealized losses on their books, which are what took down First Republic, Signature and Silicon Valley Bank. Nonetheless, the deal ran into the Biden Administration´s political and regulatory buzzsaw.Last March, Federal Deposit Insurance Corp. Chair Martin Gruenberg and his left-hand man Rohit Chopra, who heads the Consumer Financial Protection Bureau, solicited public comment on whether mergers that result in banks holding more than $100 billion in assets should be summarily rejected on grounds they´d present a systemic risk.The FDIC hasn´t published new merger rules, but it appears to have pocket vetoed the TD-First Horizon deal. \"TD does not have a timetable for regulatory approvals to be obtained for reasons unrelated to First Horizon,\" TD said. Thus, \"the parties mutually agreed to terminate the merger agreement.\" First Horizon´s stock fell 33% on Thursday.This means Biden regulators won´t let two ostensibly sound regional banks combine to compete with the giants. Yet the FDIC helped the nation´s largest bank, JPMorgan, purchase an ailing bank with $50 billion in financing and an agreement to cover 80% of its losses on residential real-estate and commercial loans.An additional policy contradiction is that the Dodd-Frank Act expressly prohibits bank mergers if more than 10% of U.S. deposits would be concentrated at any bank. This would have barred JPMorgan from purchasing First Republic had the latter not failed. But by putting First Republic into receivership, the FDIC let JPMorgan CEO Jamie Dimon sweep in and scoop up its wealthy depositors.The FDIC also did Mr. Dimon a solid by placing nonbanks at an unfair disadvantage in the auction for First Republic. Nonbanks weren´t offered government financing or loss-share agreements. Asset managers backed a bid by regional bank PNC, which might have been more competitive had the FDIC offered them the same terms as banks.Biden regulators are shielding the biggest banks from more competition while entrenching the policy of too-big-to-fail. Federal Reserve Vice Chair for Supervision Michael Barr last week proposed extending too-big-to-fail regulations to banks with more than $100 billion in assets. This would give the FDIC the apparent pretext it wants to block other midsize bank mergers.Keep this episode in mind the next time some Democrat gripes that banks are too big. It´s hard not to conclude that regulators prefer a system dominated by a handful of big banks that they can politically control.ONLINE: https://www.wsj.com/articles/td-bank-first-horizon-merger-jpmorgan-jamie-dimon-first-republic-biden-administration-regulators-a2c3cc87___May 3The Los Angeles Times on the U.S. Supreme Court and ethics reform.Thanks to recent reports about financial and personal dealings by members of the Supreme Court - including lavish trips bestowed upon Justice Clarence Thomas by a friend and prominent Republican donor - the public has become aware of a troubling fact: Unlike other federal judges, justices aren´t bound by the Code of Conduct for United States Judges. But if that loophole is to be closed by Congress, bipartisan support will be necessary.That will be difficult because, as a hearing Tuesday by the Senate Judiciary Committee demonstrated, the campaign to tighten ethics for the high court is ensnarled by partisan divisions in Congress. The leading proponents of ethics reform are Democrats, while Republicans are reflexively defending the court. Sen. Lindsey Graham of South Carolina, the panel´s ranking Republican, railed against an \"unseemly effort\" to undermine the high court´s legitimacy.Reform of the court shouldn´t be a partisan issue. Fortunately, there is now an effort co-sponsored by a Republican senator, Lisa Murkowski of Alaska, and an independent senator, Angus King of Maine, who caucuses with Democrats. It could be refined, but its introduction is a milestone.Though less ambitious than other proposals, the Supreme Court Code of Conduct Act comprises important reforms: a code of conduct for the justices, which the court itself would issue, and a mechanism for the investigation of whether a justice engaged in conduct prejudicial to the administration of justice or in violation of federal law or codes of conduct. The bill also would require the court to designate an individual to process complaints against justices.Under existing law, complaints can be filed alleging that lower-court federal judges engaged in \"conduct prejudicial to the effective and expeditious administration of the business of the courts\" or are \"unable to discharge their duties by reason of mental or physical disability.\"There ought to be a similar process for filing complaints about ethical lapses by Supreme Court justices, though because of their prominence justices might be targets of frivolous or politically motivated complaints. Ideally, justices - and other federal judges - also should be required to seek approval in advance before accepting gifts or travel and lodging.So far the justices´ attitude to criticism seems to be \"nothing to see here.\" In declining a request to testify before the Senate Judiciary Committee, Chief Justice John G. Roberts Jr. cited a statement agreed to by all current members of the court. The statement noted that in 1991 justices voluntarily adopted a resolution to follow the substance of the regulations of the Judicial Conference of the United States. Since then, it added, \"justices have followed the financial disclosure requirements and limitations on gifts, outside earned income, outside employment, and honoraria. They file the same annual financial disclosure reports as other federal judges.\"That may sound reassuring, but the justices still aren´t bound by the code of conduct applicable to other federal judges. Thomas didn´t reveal the lavish hospitality he received from real estate developer Harlan Crow in his voluntarily disclosures. After Pro Publica reported on that generosity, Thomas said that he had received advice from colleagues and others in the judiciary that \"personal hospitality from close personal friends, who did not have business before the court, was not reportable.\"Thomas added that he would comply with new and more stringent disclosure guidance promulgated earlier this year by the Judicial Conference. (Of course, sometimes disclosure won´t be enough to inspire public confidence. Justices should decline generous gifts from political actors, even if they are friends.)Even if the Supreme Court were to adopt a code of conduct, it wouldn´t rectify all of the court´s credibility problems. The justices have lost public confidence not wholly, or even primarily, because of perceived ethical lapses. The court´s image also suffers because of the perception that the justices are predictable partisans in politically charged cases and the successful effort by Republicans to cement a conservative majority on the court by blocking a superbly qualified nominee, Merrick Garland, who was nominated by then-President Obama in 2016. The culmination of that strategy was last year´s disastrous decision overruling Roe vs. Wade and extinguishing a federal constitutional right to abortion.But ethics reform is still important. In an injudicious interview published in the Wall Street Journal, Justice Samuel A. Alito Jr. - the author of the majority opinion overruling Roe - said that it wasn´t surprising that the court´s approval rating was sagging with critics saying \"day in and day out, `They´re illegitimate. They´re engaging in all sorts of unethical conduct.´ \" A binding code of conduct for the court is one way to address such criticism.ONLINE: https://www.latimes.com/opinion/story/2023-05-03/editorial-the-supreme-court-needs-ethics-reform-that-shouldnt-be-a-partisan-issue___May 3The Guardian on Saudi Arabia's rehabilitation.The journalist Jamal Khashoggi was murdered and dismembered in the Saudi Arabian consulate in Istanbul in October 2018. The CIA subsequently concluded that this was ordered by the kingdom´s crown prince and de facto ruler, Mohammed bin Salman, though he denies it. The murder was so high-profile, and the details so horrifying, that concern about optics prevailed even where moral qualms were not a priority. Prominent business figures dropped out of a glitzy investment conference dubbed \"Davos in the desert\". Joe Biden, then running to be the Democrats´ presidential candidate, said he would make the country a \"pariah\".But that was then, and this is now ... While most of the world is tightening its belt, Riyadh has billions to lavish on everything from PR executives to aid its rebranding to big-name architects to build the crown prince´s \"city of the future\" in the desert, Neom. So though some still keep their distance, the rehabilitation of the kingdom - and its ruler - are proceeding at pace. At a Miami conference hosted by Saudi Arabia in March, the tech entrepreneur Ben Horowitz enthused: \"He´s creating a new culture, he´s creating a new vision for the country, he´s got a very exciting plan to execute, and the people in the country are fired up to do it.\"The path for business people and sports stars has been smoothed by international leaders, who never stopped supplying arms, and sought to warm ties last year as oil prices soared following Russia´s invasion of Ukraine. Mr Biden fist-bumped the crown prince; in November, the administration told a US court that he should be granted immunity in a civil lawsuit over Mr Khashoggi´s death. Emmanuel Macron welcomed him to dinner at the Elysée Palace. Even Ankara, which heavily publicised the details of the murder, has sought a rapprochement.The shocking and extreme case of Mr Khashoggi took place in the context of increased repression and persecution of not only dissidents but anyone standing in the way of Riyadh´s plans. Executions have almost doubled under the crown prince. While the kingdom invests heavily in social media and other Silicon Valley ventures, it has handed out decades-long sentences and even threatened the death penalty for sharing criticism on Twitter and WhatsApp. UN experts on Wednesday warned of the imminent execution of three members of the Howeitat tribe, noting that, despite being charged with terrorism, they were reportedly arrested for resisting forced evictions in the name of the Neom project. Unlike Saudi nationals, foreigners are free to challenge the kingdom - yet instead many use their voices to laud it. Why then should the country pause, when the price of its actions is so low?ONLINE: https://www.theguardian.com/commentisfree/2023/may/03/the-guardian-view-on-saudi-arabias-rehabilitation-following-the-money"
    ]
}