{
    "articleURL": "/sport/football/article-12054067/Luka-Modric-Real-Madrid-reach-total-agreement-contract-renewal-sign-2024.html",
    "content": [
        "Luka Modric has reached 'total agreement' with Real Madrid over a new contract Reports suggest the Croatian will sign a contract renewal 'in the coming days' The new deal is expected to keep the 37-year-old at the Bernabeu until 2024 Luka Modric has reportedly reached a 'total agreement' with Real Madrid over his contract renewal, with the midfielder 'set to remain at the club until 2024.'",
        "According to Relevo, 'the terms have been agreed and the contracts have been drawn up and approved by both parties', with the 37-year-old set to 'stay in the club's second salary scale, only behind Karim Benzema and Eden Hazard.'While the extension is yet to be formalised, the Croatian, who's current deal will expire in June, is expected to sign the paperwork 'in the coming days'.Modric remains a doubt for Real Madrid's Champions League semi-final match against Manchester City on Tuesday, after picking up a thigh injury late last month, but according to the Spanish outlet, could execute the deal in the days before the match.It comes as Modric had previously dispelled rumours that he could join former teammate Cristiano Ronaldo playing in Saudi Arabia, making his intention to stay at the club clear back in March, saying: 'I hope and believe I will stay at Real Madrid.' ",
        "Revelo reports that he had held talks with Florentino Perez last month, 'who assured him the club would offer him a new contract.' But those meetings were 'very fast' as Modric, who had previously penned a one-year contract renewal last year, reportedly expressed his desire to continue playing for Los Blancos. He will now join Toni Kroos who also seems to have agreed terms to extend his contract at the Bernabeu for another 12 months.   ",
        "But this is no coincidence, as Mail Sport understands Carlo Ancelotti is hoping to use Modric and Kroos to help aid the transition of potential newcomer Jude Bellingham. The England midfielder, should he sign for the Galacticos, will become the heir apparent to the Croatian's position in midfield. But it seems the LaLiga champions are now the front runners to secure the signature of the Borussia Dortmund midfielder. The 19-year-old will no doubt be able to develop under the mentorship of two players that have a combined 889 appearances and several Champions League winners medals between them. ",
        "Modric, who joined the club from Tottenham in 2012 for £33 million has gone on to become one of the greatest midfielders of his generation, winning the Ballon d'Or in 2018. Returning 37 goals and 77 assists for Los Blancos across 480 appearances in all competitions, the Croatian's experience, having also claimed five Champions League medals and three LaLiga titles would make him a fantastic mentor for Bellingham. While Madrid have labelled the midfielder their top-target this summer, they will be forced to pay a hefty price for him. And it seems the 2022 Champions League winners may have put a limit on how much they will spend to bring him to the football club, with reports suggesting that they will not go over a fee of £105m fee. "
    ]
}