{
    "articleURL": "/wires/reuters/article-12049199/Chinas-services-activity-expands-consumers-return--Caixin-PMI.html",
    "content": [
        "BEIJING, May 5 (Reuters) - China's service activity grew for a fourth straight month in April, a private-sector survey showed on Friday, as businesses continued to benefit from a return toward pre-pandemic levels of demand and output, although expansion slowed slightly.",
        "The Caixin/S&amp;amp;P Global services purchasing managers' index (PMI) fell to 56.4 in April from 57.8 the month prior, above the 50-point mark that separates expansion and contraction in activity on a monthly basis.The figure echoed the official PMI released on Sunday, which showed a slightly slower pace of growth.China's economy grew at a faster-than-expected pace in the first quarter, as businesses and consumers shook off the chill of strict COVID curbs that were lifted in December.The world's second-biggest economy is facing an uneven recovery and some persistent headwinds, with strong activity in services and a contraction in manufacturing.China's tourism rebounded to pre-COVID levels in the five-day May Day holidays as domestic travel rose by more than two-thirds from a year earlier, government data showed.\"It remains to be seen if the economic rebound is sustainable after a short-term release of pent-up demand, with a number of indicators flagging that the recovery has yet to find a stable footing,\" said Wang Zhe, senior economist at Caixin Insight Group.Surveyed services firms' production activity and new orders including new export order expanded for the fourth consecutive month in April.Caixin group attributed the rise in activity to the return to more normal operating conditions as the impact of COVID-19 continued to fade.",
        "Services companies' operating expenses rose to a 12-month-high, driven by higher staffing costs and greater prices for raw materials. However, efforts to attract new orders have limited companies' ability to pass on rising costs to customers.\"In the future, relevant policies should focus on expanding domestic demand, stabilising employment and improving expectations, as well as improving the monetary transmission mechanism and creating a virtuous circle of economic development,\" said Wang.China will maintain support for the economy, focusing on domestic demand, which remains inadequate, the Politburo, a top decision-making body of the ruling Communist Party, said last week.Caixin/S&amp;amp;P's composite PMI, which includes both manufacturing and services activity, fell to 53.6 from 54.5 in March, marking the fourth straight month expansion. (Reporting by Liangping Gao and Ryan Woo; Editing by Sam Holmes)"
    ]
}