{
    "articleURL": "/femail/article-12041179/mrs-hinch-makeup-brush-cleaning-mat-hack.html",
    "content": [
        " SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information.   Mrs Hinch (the glamorous cleaning influencer) has revealed the genius product she uses to help clean her makeup brushes, and it costs just £2.99. ",
        "She's taken to her Instagram stories to share a video of herself using makeup cleaning mats to clean her makeup brushes. Thankfully, the handy cleaning mats are still available on Amazon and have been reduced from £4.19 to just £2.99.   Makeup Brush Cleaning Mat (2 Pack) Dirty makeup brushes can wreak havoc on our looks and health. Luckily, Mrs Hinch has shared an easy and affordable way to clean them. These cleaning mats have recently been reduced from £4.19 to £2.99. They have 'screw thread designs' that help you really clean the brushes. What's more, these mats maintain 'the shape of the brushes without damage to the bristles' while also extending the 'lifespan of your brush'. This means you can have long-lasting, clean brushes to do your makeup!   £2.99 (save £1.20) Shop",
        "Washing makeup brushes is something that can be easily forgotten about, but it's super important. As The America Academy of Dermatology says, 'Dirty makeup brushes can wreak havoc on the skin' and can cause dreaded 'acne breakouts and rashes'. Many of us use all sorts of pricy nighttime retinol complex serums, LED masks, chemical exfoliating toners and all that high-tech stuff to achieve a flawless complexion. The last thing we want to do is to pull the plug on it all because we've used dirty makeup brushes. As well as potentially wreaking havoc on our looks, dirty brushes can cause health problems. The America Academy of Dermatology says: 'Dirty makeup brushes can cause an infection, such as a fungal infection, E. coli, or a staph infection, which can be very serious.'",
        "E.coli? Fungal infections? No thanks! We'd rather just take a Mrs Hinch approach and give our brushes a good scrub. With these mats. you just 'wet your brush and pour some cleaning solution on the pad', then get scrubbing and finish by giving the brush a good rinse. ",
        "The mat has some rather funky patterns on them, and as well as looking cool, these 'screw thread designs' help you get a real thorough cleanse to your brushes. You can use them to get right into the depths of the brush and pick up all that old blusher and bronzer. The cleaning mat could be a permanent addition to your washbag, making sure that your brushes are always in top-notch condition. They're durable, lightweight and compact, so they are great for bringing on summer holidays.The mats have racked up a load of five-star reviews on Amazon. Some shoppers have said that their brushes are now 'perfectly clean', while others loved the fact that you get two packs included. 'Fantastic,' wrote one happy shopper. 'This is single handily the best product I have ever bought on Amazon. I was shampooing my makeup brushes as usual and I could still see makeup residue on them. ",
        "'I used this product and I was scraping off so much makeup. It’s truly the best product by far. My brushes now feel perfectly clean.'",
        " 'Works!' a second agreed. 'Does what it says on the tin. Cleans my brushes so well and very quickly! After a minute or so they were all nice and white again! Two pack is a bonus!'A third penned: 'My wife absolutely loves these. It's so much easier to clean her make-up brushes and gives a much deeper clean. Highly recommended.'So, if you want to avoid any potential health and skin conditions and take a leaf from Mrs Hinch's book, then shop these cleaning mats on Amazon for £2.99. "
    ]
}