{
    "articleURL": "/wires/pa/article-12052233/Labour-firing-cylinders-despite-not-winning-Derby-majority-leader-says.html",
    "content": [
        "The leader of the Labour group in Derby has said that he is “absolutely delighted” with the local election results which he says shows the party is “firing on all cylinders”.",
        "The city council remains under no overall control but Labour gained eight seats to take its total to 23, putting it in a prime position to organise a minority leadership before the council AGM on May 24.The biggest losers of the day were the Liberal Democrats, who were wiped out by Labour in Blagreaves ward and suffered losses elsewhere to end up with just half of the eight seats that they had at the start of Friday. People are seeing that we're ready for this change now, locally and nationally, the party is functioning and firing on cylinders, and so bring on the general election and let's have change for the country as well as Derby.  Baggy Shanker  Lib Dem losses meant that the Conservatives also lost ground on Labour, with the Tories taking 15 seats and looking set to lose their minority leadership.Reform Derby took six seats in Alvaston North and Alvaston South, while the three seats in Chellaston &amp; Shelton Lock went to independents.Baggy Shanker, leader of the Labour group at the council, said he was “absolutely delighted”.",
        "He said: “Residents in Derby have given the Labour group and Labour party a clear mandate to govern and to bring our manifesto ideas and our vision forward and get that implemented as soon as we can.",
        "“I’m absolutely delighted with the result. A hell of a lot of work has gone into this, not just by our excellent candidates that were fielded, but the support networks and the local party and the regional party, and indeed nationally.“People are seeing that we’re ready for this change now, locally and nationally, the party is functioning and firing on cylinders, and so bring on the general election and let’s have change for the country as well as Derby.”The city has become known for its political division in recent years, being described as “quirky” by one Labour councillor.Chris Poulter, who despite being re-elected in Spondon ward looks set to lose his position as leader of the council, said at the start of the day that this division meant he expected the city to “buck the trend” of Conservative losses nationally. I think it's a success, I honestly do. I didn't anticipate making serious gains, and I really didn't expect to lose ground on seats.  Chris Poulter  Speaking after the results were declared, he said that he saw the day as a success.He said: “I think it’s a success, I honestly do. I didn’t anticipate making serious gains, and I really didn’t expect to lose ground on seats.",
        "“We’ve run a good campaign, we’ve been a great administration, we’ve done remarkable things to help Derby make steps going forwards, and we’ve laid the ground for anybody to make a success and bring back Derby to where it needs to be.”Elsewhere in Derbyshire, Labour took North East Derbyshire District Council from no overall control and Erewash Borough Council from the Conservatives and held Chesterfield Borough Council.Derbyshire Dales District Council remains in no overall control, but the Lib Dems overtook the Conservatives in becoming the largest party, with 12 seats, while the Tories lost nine."
    ]
}