{
    "articleURL": "/news/article-12042261/Man-gets-fright-life-discovering-TARANTUALA-jeans-returning-Mexico.html",
    "content": [
        "James Mugridge discovered the 12cm-long Mexican red rump spiderWhilst unpacking he was shocked to discover the terrifying tarantula stowawayA British traveler had the fright of his life when he returned home from a trip to Mexico, after discovering a hairy tarantula made its way into his jeans.",
        "James Mugridge, 31, discovered the 12cm-long creature after spending two weeks in a jungle hotel.The beast is thought to be a Mexican red rump, a burrowing spiders that is distinctive by the red hairs on its abdomen. However, the spider - also known as a Tliltocatl vagans - is known to be docile and its bite is not considered overly dangerous to people. But Mr Mugridge did not know this, and says that he was left 'absolutely terrified' after spotting the creature as it was the 'last thing' he was expecting to come out of his suitcase after flying back from Cancun in April.",
        "In fact, he says he shouted and let out a big yelp when he saw the furry legs emerging from his jeans.However, after peeling back the fold with chopsticks, he discovered the tarantula was already dead - which he believes must have frozen in the plane's hold.Mr Mugridge, from Exeter, Devon, said: 'For a split second I thought it was alive - I let out a yelp!'The business consultant flew to Cancun on April 15 for a two-week holiday with his girlfriend Emma Forrester, 27.The couple hired a car and drove down the coast to Tulum, staying in jungle-style hotels.They saw several tarantulas along the way, including the Mexican red rump.",
        "But it seems that there was one that decided to hitch a ride back to much colder climates and make a home in the UK.Speaking out about his discovery, Mr Mugridge said: 'I think it was in [the jeans] for a couple days at least.'We're lucky because the bag was supposed to come in the cabin. But there was not enough space, so they put it in the hold.'Subsequently, the tarantula froze to death, but in the cabin I fear it would have been alive and kicking.'",
        "He added that despite the fact that the animal does not prove to be fatal to humans, he was still 'terrified.' Mr Mugridge said: 'The sting on it is said to be worse than a bee sting, but its not fatal.'That being said, I was absolutely terrified when I saw the little thing had made its way into my jeans. It really was the last thing I was expecting.'Although Mexican red rump's are docile, they have a strong feeding response when they detect movement in their enclosure Normally they are very slow moving, but can move very fast in short bursts and mine are prone to mood swings.If they do feel threatened, they may flick their hairs or bite. "
    ]
}