{
    "articleURL": "/tvshowbiz/article-12050691/Nadia-Sawalha-shows-curves-bikini-drunkenly-frolics-sea.html",
    "content": [
        "Nadia Sawalha showcased her curves in a bikini as she drunkenly frolicked in the ocean at night in a hilarious video shared to Instagram on Friday. ",
        "The Loose Women panellist, 58, was seen standing in the water in a blue and beige two piece as a wave came up behind her and swept her off her feet. She was next seen lying in the shallow sea water rolling around as the waves broke over her head. The clip then transitioned to the ITV star sitting in the back of a car laughing with her head rested on the seat in front. Nadia revealed her children had been 'secretly filming' her during their family getaway last year but she was happy to share it all the same. ",
        "She admitted in the caption she had had a glass of 'Ouzo', a traditional Greek alcoholic beverage, in the video.Nadia wrote: 'Maybe I had had an accidental glass of Ouzo!! My kids secretly filming me on holiday... last year.'The former EastEnders star shares two daughters Maddie, 20, and Kiki-Bee, 15, with husband Mark Adderley. Nadia's latest video came after she turned her attention to mocking Nigella Lawson by mimicking the TV chef's notoriously sultry presenting style.Nadia slipped into sexy lingerie to film a jokey mashed potato tutorial as she acted out Nigella's flirty narration.Putting on a very busty display in a lace slip and red bra the actress gazed seductively into the camera as she prepared the dish.",
        "Nadia - grasping her kitchen implement suggestively - began her video saying: 'And I'm ready to set to with my electric masher'.She went on to press the masher into the spuds leaving very little to the imagination in her very sexy ensemble.",
        "Adding milk to the dish she poked fun at 63-year-old Nigella's infamous pronunciation of microwave. The former EastEnders star captioned the clip: 'Nagella / Nigella … no difference … #MICROWAVEEEE'. Before teasing her husband writing: 'Camera - a very hot under the collar @mark_adderley'.Last year Nadia again poked fun at Nigella as she made a crisp sandwich for her Instagram followers - once again in sultry lingerie.It comes after the star squashed the Loose Women 'feud' rumours earlier this year as she admitted there is no bad blood between her fellow co-stars once the cameras stop.She revealed they all 'get on so well' despite having heated debates on the ITV show and being known for clashing over topics.The long-term panellist insisted there is no tension between the stars and they even have a laugh backstage together and in the ad breaks."
    ]
}