{
    "articleURL": "/sport/nba/article-12043937/NBA-playoffs-James-Harden-gifts-Joel-Embiid-golden-Rolex-congratulate-MVP-season.html",
    "content": [
        "Harden's gesture came a day after the seven-footer won his first MVP awardEmbiid edged Nikola Jokic and Giannis Antetokounmpo in votes on Tuesday DailyMail.com provides all the latest international sports newsJames Harden proved that Philadelphia does in fact live up to its nickname - the City of Brotherly of Love - as he congratulated his 76ers teammate Joel Embiid by gifting him a golden Rolex for his MVP season. ",
        "Just hours prior to Game 2 of their semifinals Eastern Conference matchup against the Boston Celtics on Thursday, Embiid and Harden gathered to a cherish a moment that the center will never forget as he received the expensive watch from The Beard.Embiid was clearly touched by the gesture, thanking his teammate, who dropped 45 points at TD Garden in Philly's 119-115 away win on Monday while he was out injured. The duo hugged in front of reporters, showing off their bromance.Embiid finished first in overall voting to win the most prestigious award of the regular season on Tuesday, edging frontrunners Nikola Jokic and Giannis Antetokounmpo, two former MVP winners. What's more is that the 29-year-old, seven-footer couldn't make the watch fit on his giant hand though Harden assured his teammate that he'll add links to the timepiece soon. ",
        "The Rolex also had an extra feature to it, with '23 MVP' engraved on the back of its case. Embiid later revealed that it was his first Rolex and watch ever, while showing off the lavish accessory to the press, as he put up a wide smile in front of cameras. The Cameroonian would like to thank Harden by joining him on the court for Game 2 against the C's on Wednesday night. ",
        "'It's a possibility, just like it was a possibility in the first game,' Embiid told reporters after doing some light shooting at the new Boston Garden. 'Obviously, I want to play.' ",
        "Embiid added that he will need to see how his sprained right knee feels before a game-time decision is to be made. The Sixers are trying to take a 2-0 lead over the Celtics.The oft-injured Embiid led the NBA in scoring for the second straight season, playing in 66 games - the second-most in his career. He averaged 33.1 points in the regular season and 20 points in the playoffs before missing the last game of Philadelphia's first-round sweep of the Brooklyn Nets. "
    ]
}