{
    "articleURL": "/wires/ap/article-12038255/Djokovic-return-US-Open-vaccine-mandate-ends-May-11.html",
    "content": [
        "Novak Djokovic can return to the U.S. Open this year after missing the tournament in 2022, because the federal government's COVID-19 vaccination mandate for foreign air travelers ends next week.",
        "\"Novak Djokovic is a great champion, a fan favorite, and now that the federal government has lifted its vaccine requirements for international travelers, we look forward to welcoming him back to New York for the 2023 U.S. Open,\" U.S. Tennis Association spokesman Chris Widmaier wrote in an email to The Associated Press on Tuesday.The White House announced Monday most of the last remaining federal COVID-19 vaccine requirements will disappear May 11, when the national public health emergency for the coronavirus ends.The U.S. Open, the season's final Grand Slam tournament, begins in New York in August.Djokovic, a 35-year-old from Serbia, has missed several key events - including the 2022 U.S. Open - because he decided not to get inoculated against the coronavirus.Back in April 2020, Djokovic said he was opposed to needing to be vaccinated to travel. He later said he would not get the shots even if it meant he would not be allowed to participate in some of his sport´s most important tournaments. Unable to travel to the United States, he missed the Masters 1000 tournaments at Indian Wells, California, and Miami both last year and this year.",
        "Most famously, Djokovic was deported from Australia in January 2022 ahead of the Australian Open after a legal saga that resulted in the revocation of his visa to travel there.",
        "Djokovic was able to go to that country this January after its pandemic-era restrictions were eased. There, he won the Australian Open for his 22nd Grand Slam title, pulling even with rival Rafael Nadal for the most by a man in tennis history.Djokovic is sitting out the Madrid Open this week because of a lingering issue with his surgically repaired right elbow. The next major tennis championship is the French Open, which begins in Paris on May 28.___ AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}