{
    "articleURL": "/tvshowbiz/article-12057369/Coronation-concert-viewers-baffled-Im-Celebs-Jordan-Banjo-appears-left-jungle.html",
    "content": [
        "A star-studded concert in honour of King Charles and Queen Camilla's Coronation took place in Windsor Castle on Sunday.",
        "However viewers tuning into the coverage on BBC were left baffled to see I'm A Celeb's Jordan Banjo hosting. Many took to Twitter confused, believing he had in fact travelled all the way from the South African camp just for the concert.However the latest series of the ITV competition, featuring returning campmates, was actually pre-recorded last summer. ",
        "Taking to Twitter one wrote: 'Isn't Jordan Banjo meant to still be in South Africa?'.While a another added: 'Bloody hell Jordan Banjo?? Has he left the I'm a Celeb camp this weekend to host the Coronation Concert'.And a third said: 'It's Jordan Banjo and I'm A Celeb isn't live'. While another joked that the BBC had spoiled the most recent I'm A Celeb cliffhanger by proving it was the Diversity dancer that was sent packing. They said: 'Lol nice job with the cliff hanger, Jordan Banjo is at the Coronation Concert. I take it he got evicted then'. Jordan later interviewed Olly Murs who showed off his muscly arms as he prepared to perform on stage to the crowd of 20,000 people.But the singer 38, was happy to display his toned physique backstage, he insisted earlier in the day that he would not be whipping off his top during his performance. On being invited to perform, he said on BBC Radio 2: 'It's a bit surreal but I am so honoured. I am on tour at the moment so only yesterday I saw the stage. It's the biggest thing of my career.",
        "'It has the eyes of the world on it. This is something people will remember. It is really special. It's crazy. We just got an email asking me to do it!'When host Dermot O'Leary joked he looked muscly, Olly replied: 'I won't be taking my top off I have to be professional.'Sunday's show in Windsor was hosted by Downton Abbey and Paddington star Hugh Bonneville.Buckingham Palace has promised 'global music icons and contemporary stars' for the big concert.It is certainly set to be the highlight of the second day of coronation celebrations.",
        "Around 20,000 members of the public are expected to attend and there has been a great deal of speculation around who will be performing.Musicians including Lionel Richie, Paloma Faith, Olly Murs, rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls will entertain the royal family and members of the public.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video."
    ]
}