{
    "articleURL": "/news/article-12043063/Oprah-reveals-makes-coveted-book-club-picks.html",
    "content": [
        "Oprah Winfrey revealed her latest pick for her book club is The Covenant of Water by Abraham Verghese She told DailyMail.com that she knew it was making her coveted list after reading just the first three pagesThe former talk show host, 69, said, 'I usually go through like 10-12 books before I get to the real thing'Oprah Winfrey has revealed her process for selecting novels for her coveted book club list. ",
        "'I usually go through like 10-12 books before I get to the real thing. I read like 50 pages, 50 pages, sometimes I don't get to 50 pages. I used to do 100,' she told street journalist Adam Glyn, reporting for DailyMail.com, who  caught up with Oprah on Tuesday in Manhattan.She revealed her latest pick – The Covenant of Water – on Tuesday, calling the 715-page novel by Abraham Verghese 'an offering of the world.''You know, for this most recent book I knew three pages in,' Oprah said.",
        "Oprah is famous for her many favorite things and she told DailyMail.com about the best dinner she's ever attended.'The most incredible dinner I've ever been to is one I had for all the legends in 2005,' she said. ",
        "'There will never be another dinner like that. Because there's Diana Ross, there's Coretta Scott King, there's Maya Angelou, there's Sidney Poitier.'There will never be another dinner like that.'Her Legends Ball was a three-day celebration that honored black women in art, entertainment and civil rights, including Tina Tuner, Aretha Franklin, Rosa Parks and more. On Tuesday she appeared alongside best friend Gayle King on CBS This Morning and sang The Covenant of Water's praises. Gayle said that the length of the book – 715 pages – was overwhelming at first, but Oprah persuaded her to press on and said it was worth it in the end. ",
        "'This is one of the top five books I´ve read in my lifetime. And I've been reading since I was three,' Oprah said in a statement. 'It's epic. It's transportive. Many moments during the read I had to stop and remember to breathe. I couldn't put the book down until the very last page – it was unputdownable!'",
        "The Covenant of Water is a sweeping epic that follows multiple generations of a family in set in southern India. The New York Times described it as focusing 'almost entirely on good people to whom many terrible things happen'.Verghese said that receiving the call from Oprah that he made her book club felt like a 'miracle.''My thoughts were racing back through the decade-plus of writing The Covenant of Water, during which time my mother died, and Covid had descended on us,' he said. 'After we hung up I realized that I'd reflexively risen to my feet and stayed that way throughout our long chat.'Verghese, 67, is an Ethiopian-born physician and has written two memoirs. He received a National Humanities Medal from President Barack Obama in 2015, and was praised during the White House ceremony for a 'range of proficiency' that extends from 'his efforts to emphasize empathy in medicine, to his imaginative renderings of the human drama.'",
        "When asked what's left for Oprah – who has already accomplished so much in her life – she replied: 'What I really wanna do is live well. Live well, be strong.' "
    ]
}