{
    "articleURL": "/femail/article-12042531/Princess-Anne-Colonel-Royal-Household-King-Charles.html",
    "content": [
        "The Princess Royal, 72, was given the title after Queen Elizabeth's deathREAD MORE:  Princess Anne holds bombshell interview on eve of King Charles' coronationPrincess Anne has been appointed the Senior Colonel of the Household Division by her brother King Charles - and she has already got to work.",
        "The Princess Royal, 72, visited Wellington Barracks near Buckingham Palace today where she chatted to officers and senior non-commissioned officers of the Household Division.As the royal family gears up for King Charles's coronation on Saturday, his younger sister got acquainted with the officers, who will take part in processions escorting the King to and from Westminster Abbey on Saturday.Her day at the Barracks comes days after a bombshell interview with CBC News in which she said the idea of a slimmed-down monarchy didn't sound like a 'good idea'.Anne, who is often regarded as the 'hardest working royal', was given the role by King Charles after Her late Majesty Queen Elizabeth died and the new monarch became Colonel in Chief of the Household Division's regiments. ",
        "The Princess Royal is already Colonel of the Household Cavalry's Blues and Royals. Her new position was confirmed by Buckingham Palace after her visit to the barracks to thank the military members who have been working through the night to ensure smooth proceedings on Saturday. When the coronation procession is staged after Charles is crowned, Anne will travel on horseback behind the gold state coach carrying the King and his wife.In her role as Senior Colonel, the princess will host a traditional dinner for her fellow Household Division Colonels - who include the Princess of Wales, the Colonel of the Irish Guards - on the eve of the Trooping the Colour ceremony.",
        "At the event it is decided which regiment will be given the honour of trooping their colour the following year.",
        "With last-minute preparations for Saturday's coronation ramping up, early morning rehearsals were staged in the capital, revealing the first glimpses of the grandeur of the planned processions.Hundreds of soldiers, many on horseback, marched from Buckingham Palace past Trafalgar Square and Downing Street to Westminster Abbey shortly after midnight on Wednesday.The diamond jubilee state coach and gold state coach travelled down The Mall as part of the dry-run for the full event.Royal fans waited for more than three hours for the parade to make a return trip.The Palace has confirmed Princess Anne's new role just days after she gave a bombshell interview to CBC Canada in which she was asked about reports King Charles's vision for a 'slimmed-down monarchy'.She said: 'I think that \"slimmed down\" was said in a day when there were a few more people to make that seem like a justifiable comment'. When it was put to her that the world changes, Anne said: 'It changes a bit. I mean, it doesn't sound like a good idea from where I'm standing, I have to say. I'm not quite sure what else, you know, we can do.' ",
        "In the extraordinary interview with Canada's CBC News, released just five days before the Coronation, Anne also distanced the Windsors from the slave trade amid calls for Britain and the royals to pay compensation.Charles recently agreed to support a study into historical links between the monarchy and slavery. Describing her own view as 'slightly different, maybe more realistic', Anne said: 'Come on... don't be too focused on time scales and periods. History isn't like that.'The Princess Royal also spoke with sadness about the defining image of her mother alone in grief at Prince Philip's funeral. Asked if this was a 'thievery', she said: 'Yes, you're quite right. In some ways I'm glad we didn't see that, at that moment. When you see the photograph it's much worse somehow'. "
    ]
}