{
    "articleURL": "/sport/football/article-12052215/Tottenham-legend-Ricky-Villa-insists-former-club-look-reappoint-Mauricio-Pochettino.html",
    "content": [
        "Pochettino is in advanced talks to join the Blues as their new manager soonHe left the again-managerless Tottenham in 2019 after five years in chargeRicky Villa, who spent five years at Tottenham, wants Pochettino back at SpursTottenham legend Ricky Villa has urged Mauricio Pochettino to reject the Chelsea managerial job and return to Spurs.",
        "Pochettino is in advanced talks to take over the reigns at Stamford Bridge, with the Blues in free fall and looking for a permanent manager following the sacking of Graham Potter.The Argentinian seems set to take his first job since leaving PSG in June last year, though several Tottenham fans have called for his return with the north London side also without a manager.Pochettino left Tottenham in 2019 after five years in charge of the club, though Spurs' fortunes have worsened since his departure with the club at what many have assessed as their lowest point of the last decade.Villa, meanwhile, who is a good friend of the 51-year-old, told talkSPORT that his former side 'need' Pochettino to return to the club as he urged his compatriot to return to Tottenham.",
        "'It's a difficult moment for the club,' Villa said. 'The club is very strong and i think it will recover very soon.'Come back Pochettino, we need Pochettino back into the team.'When it was put to him that his friend may be on his way to Chelsea, Villa replied: 'Yes. Spurs have not called him. He has another offer, he has to make a decision.'I have a little chance to bring him to Spurs again. It's not my decision, it is the decision of the chairman. I am meeting him next week and we will see what happens. If he is going to Chelsea, or waiting for the club (Tottenham).'",
        "Villa joined Tottenham in 1978 and was loved by fans after helping them win the FA Cup in 1981, before he departed for America two years later.Pochettino, meanwhile, built the club up after taking over from Tim Sherwood, narrowly missing out on the Premier League title to Leicester in 2016.He also took the side to the Champions League final in 2019, where they lost to Liverpool in Madrid.The two Argentinians have become good friends over the years and Villa is set to make a last-ditch attempt to try and convince Pochettino to reject Chelsea's approaches in favour of Spurs."
    ]
}