{
    "articleURL": "/wires/afp/article-12061543/US-therapist-pleads-guilty-Okagbare-Olympic-doping-case.html",
    "content": [
        "A Texas therapist faces up to 10 years in prison after pleading guilty on Monday to supplying performance-enhancing drugs to Olympic athletes including banned Nigerian sprinter Blessing Okagbare, US authorities said.",
        "Eric Lira, a \"naturopathic\" therapist based in the city of El Paso, is the first individual to be convicted under a new US law introduced in the wake of Russia's state-backed Olympic doping scandals, the Department of Justice said in a statement.The 2020 law, named after Russian whistleblower Grigory Rodchenkov, enables US authorities to prosecute individuals involved in international doping fraud conspiracies.Lira was found to have supplied drugs to Okagbare in the build-up to the pandemic-delayed Tokyo Olympics in 2021.Okagbare, who was subsequently banned from the sport for 10 years, was expelled from the Tokyo Olympics just before the women's 100m semi-finals after it emerged she had tested positive for human growth hormone in an out-of-competition test in Slovakia before the games.US Attorney Damian Williams said Monday after Lira pleaded guilty in a federal court in Manhattan that the case was a \"watershed moment for international sport.\"\"Lira provided banned performance-enhancing substances to Olympic athletes who wanted to corruptly gain a competitive edge,\" Williams said.\"Such craven efforts to undermine the integrity of sport subverts the purpose of the Olympic games: to showcase athletic excellence through a level playing field.\"Lira's efforts to pervert that goal will not go unpunished.\"The maximum sentence for violating the Rodchenkov Anti-Doping Act is 10 years in prison. Lira's sentence will be determined by a judge at a later date, the Justice Department statement said.",
        "US anti-doping officials welcomed Lira's conviction, noting that it was only made possible by the recently enacted law.\"Without this law, Lira, who held himself out as a doctor to athletes, likely would have escaped consequence for his distribution of dangerous performance-enhancing drugs and his conspiracy to defraud the 2020 Tokyo Olympic Games because he did not fall under any sport anti-doping rules,\" said Travis Tygart, the chief executive of the United States Anti-Doping Agency, a nonprofit."
    ]
}