{
    "articleURL": "/wires/ap/article-12060573/Opening-statements-begin-fatal-NY-limo-crash-trial.html",
    "content": [
        "SCHOHARIE, N.Y. (AP) - A limousine company operator on trial for a crash that killed 20 people in upstate New York was portrayed by a prosecutor Monday as directly responsible for the deaths, while a defense lawyer argued he was simply in the dark about mechanical problems likely to blame for the wreck.",
        "Nauman Hussain, operator of Prestige Limousine, is charged with criminally negligent homicide and second-degree manslaughter in connection with the 2018 crash in Schoharie, a village west of Albany.During opening statements Monday, special prosecutor Frederick Rench said Hussain intentionally failed to follow regulations for maintaining the 2001 Ford Excursion stretch SUV, which was loaded with friends on an outing when it spun out of control on a hill and crashed into a parked car, trees and an embankment.Hussain did not have the authority to operate his limo business, which was placed out of service multiple times before the tragedy, Rench said. The vehicle's aging brakes, he said, had not been replaced.\"Nauman Hussain never followed any regulations,\" Rench said, pointing to Hussain who was looking down at a table in front of him. \"Nauman Hussain was completely aware of the unjustifiable risk that he alone had created and that he alone consciously disregarded.\"Defense lawyer Lee Kindlon told the jury Hussain was not to blame.",
        "Hussain, then in his 20s, was inexperienced in running a business and relied on professionals to make sure things were done properly, Kindlon said.He blamed the problems with the vehicle on the shop Hussain used for repair work, Mavis Discount Tires.\"The accident was caused by the fraud and failure of Mavis to fix the breaks, and the incompetence of the state of New York to uncover their misconduct,\" Kindlon told the jury. \"Finding a scapegoat condemning the least powerful person involved and declaring victory is not justice.\"",
        "Lawyers for Mavis Discount Tires, which is not on trial but is being sued by the families of the victims, have denied that the repair shop is at fault.The group that rented the limo were en route to a brewery Oct. 6, 2018, for birthday celebrations when the limo´s brakes failed to stop the SUV on a downhill stretch of road in Schoharie. The vehicle blew through an intersection and crashed outside a small country store. The group, which consisted of friends and family ranging in age from 24 to 34, were killed in the crash, as well as the driver and two bystanders.The trial, which is expected to last as long as six weeks, comes after a judge rejected a plea deal last fall that would have spared Hussain prison time.___Maysoon Khan is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Maysoon Khan on Twitter."
    ]
}