{
    "articleURL": "/wires/reuters/article-12046089/Amid-US-debt-ceiling-standoff-Senate-Democrats-dissect-Republican-plan.html",
    "content": [
        "By Andy Sullivan",
        "WASHINGTON, May 4 (Reuters) - A Republican plan to cut federal spending in exchange for lifting the federal government's debt ceiling will come under the microscope Thursday in the U.S. Senate, where President Joe Biden's Democrats are expected to frame it as a damaging to the economy.The Senate Budget Committee hearing is the first of several planned by Democrats, who say legislation that passed the Republican-controlled House of Representatives last week on a party-line vote would undercut child care, education and other government programs.The United States could run out of money to pay its bills as soon as June 1 if Congress does not raise its self-imposed $31.4 trillion debt ceiling, according to Treasury Secretary Janet Yellen.Republicans say any increase needs to be paired with measures to slow the growth of the U.S. debt, which has jumped sharply as Washington spent trillions on COVID-19 relief.Biden insists that Congress should raise the limit without conditions. He is due to meet House Speaker Kevin McCarthy and other top lawmakers at the White House next Tuesday. The standoff is worrying investors, who have pushed yields on as much as $650 billion of Treasury securities maturing in the first half of June to record highs after Yellen's announcement.The Senate so far has not played a role in the standoff. Republicans have lined up behind the House proposal. Democrats say they might try to pass a \"clean\" debt ceiling hike, but that would be unlikely to win enough Republican votes for passage.",
        "Still, the hearings will provide the sort of legislative scrutiny that did not take place in the House, where the package was quickly passed after being assembled by its leadership behind closed doors.The centerpiece of the House Republican plan would scale back a wide swath of annual government spending to last year's levels, a cut of about 8%, and cap its growth by 1% each year after that.The Republican plan does not specify how individual programs would fare. Democrats have argued that domestic spending would take the biggest hit, as Republicans would try to protect military and veterans programs.The panel will hear from Mark Zandi, chief economist at Moody's Analytics, who warned that the House Republicans' cuts could contribute to the U.S. economy falling into a recession next year, potentially pushing unemployment to 6%, from its current historically low 3.5%.The head of an environmental group and a solar-industry trade association are also scheduled to testify, along with Brian Riedl, a fellow at the conservative Manhattan Institute who has advocated spending restraint.(Reporting by Andy Sullivan; Editing by Scott Malone)"
    ]
}