{
    "articleURL": "/sport/football/article-12059835/Met-Police-FA-concerned-fan-safety-West-Ham-Europa-Conference-League-final.html",
    "content": [
        "The FA and Met Police have concerns over the Europa Conference League finalThere are fears of a public order risk if West Ham qualify for the showpiece  David Moyes' side face AZ Alkmaar in the first leg of the semi-final on Thursday The FA and Metropolitan Police are concerned that the Europa Conference League final could present a public order risk if West Ham qualify for the showpiece occasion at the 20,800-capacity Fortuna Arena amidst fears of thousands of ticketless supporters descending on Prague. ",
        "Around 10,000 West Ham fans without tickets attended last season’s Europa League semi-final defeat to Eintracht Frankfurt, which led to violent scenes in the city with travelling supporters attacked by Eintracht Ultras.UEFA insist they cannot change the venue at this stage as the match was given to Prague last year following a 12-month bidding process, but would be willing to give more tickets to West Ham fans if they qualify. David Moyes’ side will face AZ Alkmaar in the first leg of the semi-final on Thursday in buoyant mood after effectively securing Premier League status with Sunday's 1-0 win over Manchester United, while Fiorentina meet Basel in the other last-four clash.The finalists have initially been allocated just 4,000 tickets, with 8,500 set aside for the public and 4,300 reserved for sponsors and national associations, but a few thousand of the general sale tickets could be handed over to both clubs if West Ham make it through.",
        "West Ham have not reached a major European final since the 1976 European Cup Winners Cup so their fans are expected to travel in large numbers, particularly given the ready availability of cheap flights to Prague and the city’s popularity amongst tourists and stag groups.The FA are aware of the situation and will demand assurances from UEFA that the event can be run safely if the Hammers qualify, particularly given the crowd chaos that marred Liverpool’s Champions League final defeat to Real Madrid in Paris last season, which an independent report deemed was “the primary responsibility” for UEFA. ",
        "The Met would be responsible for maintaining order amongst the travelling fans rather than the Football Policing Unit, who take charge of England’s away games, as West Ham are a London club. To compound matters there are less than three weeks between the semi-final second legs and the final so preparation time is limited.UEFA have recognised their error in taking the Europa Conference League final to such a small stadium and have raised the minimum capacity for clubs hoping to stage next year’s final to 30,000. The Conference League was designed as a new competition primarily for clubs from smaller European countries, but those from the bigger leagues are already dominating the latter stages, with Jose Mourinho’s Roma winning last year’s inaugural played at the Arena Kombetare in Tirana, Albania."
    ]
}