{
    "articleURL": "/wires/reuters/article-12051411/Guardiola-wary-threat-Leeds-pose-new-manager-Allardyce.html",
    "content": [
        "By Lori Ewing",
        "MANCHESTER, England, May 5 (Reuters) - Manchester City manager Pep Guardiola believes Leeds United will be dangerous opponents under interim manager Sam Allardyce given the injection of motivation change often brings.City can go four points clear of Arsenal atop the Premier League with a victory over the Yorkshire club on Saturday at the Etihad Stadium but face a team desperate to avoid the drop.Allardyce was parachuted in on Wednesday in a last-ditch attempt to help Leeds, who are only outside the relegation places on goal difference, remain in the top flight.\"Always the impact of your manager on the players in the first one or two games ... of course every team is playing for important things but for Leeds to stay (up), the impact is huge,\" Guardiola said on Friday.\"I don't know the system he is going to play, we don't have any info, we can imagine what he is trying to do with us. And again, it is a massive, massive important game for us.\"Told that Allardyce gave no hints about tactics in his own press conference earlier on Friday, Guardiola said: \"When you don't have info about the opponent ... don't focus much on them. Think about your team, analyse the West Ham game to help us know what to do for the next game, and that's all.\"",
        "Treble-chasing City beat the Hammers 3-0 on Wednesday to stretch their unbeaten run to 19 matches in all competitions.As well as chasing the league championship, they visit Real Madrid in the Champions League semi-final, first leg on Tuesday and face Manchester United in next month's FA Cup final.Guardiola said he was proud of how his players were managing the pressure of fighting for three titles.\"The fact that we play many, many games during the season we are used to, so it's not new, and what we have done, being here until the end, we have done in the past, so there's no surprise, but I admire my players for the fact that again and again they are doing it,\" the Spaniard said.City's Erling Haaland could extend his record for most goals in a Premier League season on Saturday against a Leeds defence which is the worst in the top flight. The 22-year-old Norwegian netted his 35th goal against West Ham to set the new mark.Asked about Tuesday's Champions League clash with Madrid, Guardiola said City's sole focus was on the Leeds game.\"There's a lot of games with a lot of tension. We practised today, yesterday, so the team is really tired. We have to see how the players recover again,\" he added.",
        "\"We'll be focusing on how they are, physical and mental ... Premier League is so nice, it's so important tomorrow to go four points in front of Arsenal and it is really, really important, and so the whole focus is on the game tomorrow.\" (Reporting by Lori Ewing; Editing by Ken Ferris)"
    ]
}