{
    "articleURL": "/wires/afp/article-12044437/US-envoy-sees-common-ground-Brazil-racism-fight.html",
    "content": [
        "The United States and Brazil pledged Wednesday to do more together to combat racism, with the Americas' most populous countries saying they again saw common cause after the exit of leaders who championed white grievances.",
        "Linda Thomas-Greenfield, the US ambassador to the United Nations, signed a statement promising cooperation on racial equality with Brazil on a visit to the Atlantic coastal city of Salvador, the historic heart of Brazil's African diaspora, the largest outside of Africa.Thomas-Greenfield, a member of President Joe Biden's cabinet, spontaneously picked up a mallet to join a troupe of Afro-Brazilian drummers performing on the cobblestone streets and later toured a square where white enforcers once publicly whipped African-descended slaves.The ambassador on her three-day visit to Brazil has described how she grew up in segregated Louisiana with an illiterate father and credited affirmative action in university admissions -- a longstanding point of controversy in both the United States and Brazil -- with providing her with opportunities.\"Like so many, I have been subjected to racism all my life -- every single place I've been, all around the world,\" the 70-year-old told a news conference in Salvador.\"I have been called racial slurs and I face discrimination in all kinds of contexts and yet, despite the prevalence and pitfalls of racism, I made it through. I've risen to the highest ranks of the United States government in a country that once enslaved my ancestors,\" she said.\"President Biden chose me to be the face of the United States at the United Nations -- our representative to the world. That shows how much progress our country has made.\"",
        "For the Biden administration, the fights against both racism and climate change mark bright points in the relationship with Brazilian President Luiz Inacio Lula da Silva, who returned in January after defeating right-wing populist Jair Bolsonaro, a close ally of former US president Donald Trump.Lula has irritated the United States by accusing the West of aggravating the war in Ukraine through its arms shipments -- an issue raised by Thomas-Greenfield a day earlier in Brasilia.- 'International respect' -",
        "In Salvador, Thomas-Greenfield met Anielle Franco, appointed by Lula as Brazil's first minister for racial equality, to sign a statement that will set up a dialogue between the two countries on increasing access to health and education and combatting violence against racial minorities.The statement also renewed an exchange program between historically Black US colleges and universities and Brazilian institutions, and promised continued US financial support for civil society groups in Brazil as well as Colombia, which also has a significant population of African descent.The statement marked a repeat of pledges made on a 2008 visit to Salvador by then-US secretary of state Condoleezza Rice, a Republican. Trump shifted the tone of the Republican Party by promising to give a voice to white resentment, particularly against immigrants.The US Supreme Court, now dominated by conservatives, is expected in the coming months to restrict the use of race in university admissions.",
        "Brazil acted later than the United States, in 2012 starting a quota system for public universities. Lula went further in March by promising that 30 percent of federal government jobs will go to people of color.Franco -- whose sister, a Rio de Janeiro councilwoman, was assassinated in 2018 -- said that Brazil was \"reacquiring international respect\" after an election that pitted against each other \"barbarism and democracy.\"\"Brazil is back, so we can find our place internationally again, so we can promote more equality,\" she said.Alluding to Bolsonaro, she said that Brazil no longer \"has a president who affirms that he would rather than his son be dead than date a Black woman.\"Black people face persistent inequality in both the United States and Brazil, which abolished slavery in 1865 and 1888, respectively.In the United States, the average Black family's net wealth is around 13 times less than of an average non-Hispanic white family, according to Census figures."
    ]
}