{
    "articleURL": "/sport/football/article-12059947/Preston-0-3-Sunderland-Sunderland-secure-place-Championship-Play-offs.html",
    "content": [
        "Sunderland seal Championship play-off spot after 3-0 victory over PrestonOn-loan Man Utd star Amad Diallo opened the scoring for Tony Mowbray's menRe-live the action from the Championship's final day as Sunderland make top six Six thousand Sunderland fans stood jubilantly singing in the rain as their side clinched a dramatic and unexpected play-off spot.",
        "Tony Mowbray’s side needed a three-goal swing at half-time with their game still goalless and rivals Millwall winning 3-1. But as the manager’s former club Blackburn produced a comeback in south London, his current players took care of business with excellent strikes in a near-monsoon by Amad Diallo, Alex Pritchard and Jack Clarke.Momentum will now be on The Black Cats side when they face Luton in the first leg on Saturday with a nine-game unbeaten run behind them and experience of winning the League One play-offs last season.For Mowbray, appointed in August, yesterday was vindication for pinning his belief in attacking talent.",
        "‘I came to this club because I could feel the talent here,’ he said.‘Patrick (Roberts) is a genius with the ball. He has Premier League talent even if there are other parts of the game he can’t do.‘We haven’t taught Diallo anything. He is a Manchester United player – they paid a fortune for him.‘My job is to take the pressure off these lads, let them express themselves. I want them to be on the ball, not demanding they run all the way back. I was a defender who won promotion(for Middlesbrough) because Bernie Slaven scored 30 goals for us, even though he was a lazy sod!’",
        "Sunderland haven't been in the Premier League since 2017 and have spent most of the season as long shots to finish in the top six because of their injury list.Even at Deepdale, there was little hint of the excitement to come as Sunderland, who started the day seventh, failed to break the deadlock in the opening 45 minutes.Mowbray played an ambitious 4-2-4 with goals on his mind and tried to ignore scores from other games but Joe Gelhardt had his close-range effort smothered by Andy Woodman while at the other end Liam Delap missed for Preston when put clean through.The Sunderland boss introduced the craft of Pritchard at half-time it paid dividends.",
        "Preston (3-1-4-2): Woodman, Storey, Bauer, Lindsay, McCann, Potts, Fernandez, Parrott (Onomah 56), Ledson, Delap (Woodburn 69), Cannon Subs: Cornell, Slater, Leigh, Mawene, Kamara Booked: Storey, Ledson Manager: Ryan Lowe Sunderland:  (4-2-3-1): Patterson, Gooch (Anderson 66), Hume, O'Nien, Curkin (Pritchard 46), Neil, Ekwah (Lihadji 86), Clarke, Diallo (Ba 86), Roberts, Gelhardt (Michut 72) Subs: Bass, Taylor, Scorers: Diallo 54, Pritchard 61, Clarke 64 Manager: Tony Mowbray ",
        "Dan Neil went close after 48 minutes and then Pierre Ekwah hit Woodman from eight yards when a composed finish either side would have done the job.But after 54 minutes, the Sunderland pressure final forced the Preston dam to burst.",
        "Manchester United loanee Diallo underlined his quality by wrapping his left foot around the ball and firing into the top corner from just outside the box.It was the 20-year-old winger’s 13th goal of the season and the Sunderland fans packed in behind that goal chanted his name in unison.Anthony Patterson saved from point-blank range from Pat Bauer to keep the lead intact and after 61 minutes, the transformative Pritchard added a brilliant second.The midfielder gave Woodman the eyes before hooking his shot just inside the right-hand post to leave the ‘keeper wrongfooted. With news that Millwall had surrendered a 3-1 lead, the BlackCats were now in a play-off position and to keep the party going Jack Clarke then fired in a brilliant third after 65 minutes, cutting into from the left before burying a low finish past Woodman.For the rest of the afternoon, everyone connected with red-and-white had half an eye on events at Millwall and there was a huge outpouring of relief and celebration at the final whistle when it was confirmed Sunderland’s win had been enough.Mowbray has a reputation for keeping a level head and he’s not under-estimating Luton even though Sunderland are clearly the bigger club.‘It’ll be a tough game. It’s not fluke that Luton have finished third and we’ll need more moments of magic from Diallo and Roberts, and Jack. I have to mention him because I did scream at him today to be focussed, and then he scores a great goal.’",
        "Pritchard was a key influence with his arrival coinciding with the visitors becoming more penetrative.‘We knew we had to score,’ said the midfielder. ‘There were thousands of our fans here which was fantastic – they have been like this all season.’Diallo was finally persuaded to collect his man-of-the-match trophy on television. ‘He’s a shy boy,’ said Mowbray about his loanee. ‘And he’s going to be hard to replace.’If he going back to Old Trafford, he could give Sunderland the perfect parting gift of Premier League football. "
    ]
}