{
    "articleURL": "/wires/ap/article-12048949/McIlroy-shoots-68-return-Fleetwood-leads-Quail-Hollow.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - A little time away from golf paid off for birthday boy Rory McIlroy.",
        "The world´s third-ranked player shot a 3-under 68 at the Wells Fargo Championship on Thursday in his first tournament since missing the cut at the Masters, leaving him three shots behind first-round leader Tommy Fleetwood.Fleetwood´s 6-under 65 was one stroke better than Xander Schauffele, Kevin Streelman, Taylor Moore, K.H. Lee and Ryan Palmer, who are tied for second after opening 66s.Patrick Cantlay, with Tiger Woods´ former caddie Joe LaCava on his bag, shot 67.McIlroy withdrew from the HBC Heritage following a disappointing second round 77 at Augusta National, a controversial decision that cost him a $3 million bonus for failing to meet the playing requirements for the PGA Tour's new Player Impact Program.The Northern Irishman said earlier in the week he didn't touch his clubs for more than two weeks, adding that he needed a \"reset\" to gain some perspective because golf had begun to consume his life.",
        "He looked fresh on Thursday.\"It was just really nice to be out there again,\" McIlroy said.It's no surprise McIlroy is off to a strong start at Quail Hollow, a course that fits his game. He has won the Wells Fargo Championship three times and finished in the top 10 nine times in 11 starts.It's also the site of his first PGA Tour victory in 2010 and where he set a tournament scoring record at 21-under 267 in a dominating seven-stroke win in 2015. He won again in 2021, making him the tournament's only three-time champion.",
        "\"I feel relaxed here,\" McIlroy said. \"I think if you come back to the site of your first win on tour, and I´ve gotten to know (Quail Hollow president Johnny) Harris really well and it´s just a level of comfort at this golf course and at this club that I probably don´t have at any other venue on tour.\"McIlroy sent his opening tee shot on No. 10 down the fairway and a fan yelled \"Happy birthday, Rory.\" He went on shoot 34-34, some fitting numbers for his 34th birthday.McIlroy's only hiccup came on No. 7, when he sent his tee shot way right and out of bounds, forcing him to hit a provisional. McIlroy took advantage of his second opportunity, hammering a 366-yard drive down the fairway. He wound up missing a 22-foot par putt to finish with his only bogey.He recovered on the closing ninth hole, spinning his approach shot to within 11 feet to set up a birdie.\"I didn´t want to spend my birthday afternoon grinding on the range, so it was nice to play OK,\" McIlroy said with a laugh.Fleetwood, who has won six times on the European Tour but never on the PGA Tour, finished a bogey-free round with birdies at Nos. 17 and 18 at Quail Hollow's difficult three-hole closing stretch dubbed the \"Green Mile.\"",
        "\"I just have to keep going and wait for those really big results and hopefully start contending again up at the top of the leaderboard and we´ll see what we can do from there,\" Fleetwood said.Schauffele appeared ready to take control of the tournament early after racing to 7 under after 15 holes. But he bogeyed two of the three final holes to surrender the lead.\"I really had it going there. The ball was on a string for a bit and I did everything really well,\" Schauffele said. \"It´s a championship-style golf course, so played really well through 15 holes and then had a little hiccup there coming in, so it is what it is.\"Cantlay seemed to mesh well with LaCava, who was on the bag for 12 of Woods' tournament wins, including the 2019 Masters.Cantlay, who has played without a yardage book in his pocket since turning pro, placed immediate trust in LaCava, who helped him read a tricky uphill birdie putt on No. 8.LaCava had worked once before with Cantlay, at the Genesis Invitational in 2021 when Woods was injured, and came highly recommended by Fred Couples.\"He´s just a great dude,\" Cantlay said. \"I trust Fred a lot, he´s a good friend of mine. I´ve gotten pretty close to him over the years, so when he says something like that, I know he means it.\"",
        "Defending champion and two-time winner Max Homa shot 70.The ever-improving Tony Finau, who has won four of the last 18 tournaments he has entered - including last week's Mexico Open - rallied to shoot 71 after birdieing two of his final three holes.Jordan Spieth had a 72 in his first appearance at the tournament since 2013.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}