{
    "articleURL": "/wires/ap/article-12047531/West-Virginia-settles-Kroger-opioid-money-tops-1B.html",
    "content": [
        "CHARLESTON, W.Va. (AP) - West Virginia has settled with Kroger for $68 million over its role in distributing highly addictive prescription painkillers into the U.S. state that has lost more lives to opioid overdoses per capita than any other.",
        "That brings West Virginia's total opioid litigation dollars up to more than $1 billion, more than any other state per capita, Attorney General Patrick Morrisey said at a press conference at the state Capitol in Charleston.\"Let this be a warning to others: We fight hard for those affected the most by the opioid epidemic and will stop at nothing in getting justice for them,\" he said.Kroger was the last remaining defendant in a lawsuit involving Walgreens, Walmart, CVS and Rite Aid. The state had been scheduled to go to trial with the pharmacy chain in June.The settlement with Kroger resolves the lawsuit that alleged the pharmacy chain failed to maintain effective controls as an opioid distributer in the state, contributing to oversupply that helped fuel a crisis that has claimed the lives of thousands of residents.The money won't bring back the lives that have been lost from \"the opioid menace,\" Morrisey said. \"Our hope is that the money would provide significant help to those affected the most by this crisis in the state.\"",
        "Over the past four years, drug manufacturers, distribution companies, pharmacies and other companies with roles in the opioid business have reached settlements totaling more than $50 billion with governments.While the biggest amounts are in nationwide settlements, West Virginia - perhaps the state hardest hit by the prescription drug overdose crisis - has been aggressive in bringing its own lawsuits and reaching more than a dozen settlements.",
        "Last year, Kroger settled an opioid claim brought by New Mexico for $58.5 million.The nation´s overdose crisis has come in waves, first with powerful prescription opioids, then heroin and now fentanyl and other illicit lab-produced drugs.The U.S. Centers for Disease Control and Prevention estimate that overdoses have been killing more than 100,000 people a year in the country. That´s a record level of deaths, with most connected to opioids.Kroger has agreed to pay $34 million upfront per the settlement agreement, then $12 million on June 30, 2024, another $12 million on June 30, 2025, and then lower additional payments over the next seven years to reach the $68 million total.Morrisey said the deal won't prevent West Virginia from also receiving dollars from any future national settlement with the chain.Walgreens settled in January for $83 million. Walmart and CVS settled with the state last September: Walmart agreed to a settlement of $65,070,000; CVS for $82.5 million.Last August, Rite Aid settled for up to $30 million to resolve similar litigation. The lawsuits allege the pharmacies´ contribution to the oversupply of prescription opioids in the state have caused \"significant losses through their past and ongoing medical treatment costs, including for minors born addicted to opioids, rehabilitation costs, naloxone costs, medical examiner expenses, self-funded state insurance costs and other forms of losses to address opioid-related afflictions and loss of lives.\" The money from opioid settlements will be distributed throughout the state to programs and projects helping to abate the drug crisis through the West Virginia First Foundation, a private nonprofit group.",
        "The group will receive 72.5% of each settlement or judgment, 24.5% of settlement and judgment dollars will be allocated to local governments and 3% will be held in escrow by the state. In March, Republican Gov. Jim Justice signed a bill recognizing the Foundation and authorizing the governor to make appointments to its board of directors with consent of the state Senate.___This version corrects the spelling of Morrisey's last name on second reference."
    ]
}