{
    "articleURL": "/wires/reuters/article-12051747/German-artist-nearing-100-000-cobblestones-mark-victims-Nazis.html",
    "content": [
        "By Tilman Blasshofer",
        "COLOGNE, Germany, May 5 (Reuters) - A German artist who is preparing to lay the 100,000th cobblestone commemorating a person who was deported and killed by the Nazis has no intention of giving up making the brass-capped blocks, saying demand is higher than ever.By placing Stolpersteine (\"stumble stones\") outside the victims' last known address, 75-year-old Gunter Demnig aims to draw attention to the fate of individuals in the Holocaust.The project started about three decades ago when Demnig laid the first stones in Berlin and Cologne.Nearly 100,000 cobblestones later, they can be found in 30 countries across Europe, from Finland to Italy, Hungary, Russia and Ukraine.\"I never dreamed of this,\" Demnig said, saying he had expected a few hundred or maybe 1,000 stones.\"I was naive enough to believe that it would have to decrease at some point ... but it's the other way around: interest is getting greater and greater.\"He expects to lay his 100,000th stone this year.In his workshop, Demnig embosses the name and date of birth and circumstances of death by hand. He lays most of the stones, which can be requested by anyone, himself, with the costs paid by donations and sponsorship from private individuals as well as companies or institutions.\"People ask why I don't have it done in a factory? I say Auschwitz was a murder factory. That's why it's important to me that the writing is hammered into the plaques by hand,\" he said.",
        "Inspired by the Talmud - a compendium of Jewish thought and commentary - which says a person is only forgotten when his or her name is forgotten, the stones in front of the buildings revive the memory of the people who lived there.They commemorate all groups of the Nazis' victims, including Jews, Sinti and Roma, political opponents, gay people and \"antisocial elements\", or criminals.They have become an integral part of cities across Germany, especially Berlin, where locals and tourists stop to inspect the stones, which shine on grey pavements and sometimes have flowers strewn across them.\"Here we have a mother who has been stigmatised for 'antisocial'. The child was placed in a children's home. Both were murdered,\" said Demnig as prepares to lay two stones outside the house in Cologne where they lived.While determined to continue his work, Demnig is resigned to eventually delegating to colleagues. \"As long as my knees are still okay, I'll keep going,\" he said. (Reporting by Tilman Blasshofer; Writing by Madeline Chambers; Editing by Alison Williams)"
    ]
}