{
    "articleURL": "/femail/article-12050281/Im-food-delivery-driver-accept-expensive-orders-wealthy-neighborhoods.html",
    "content": [
        "Jay, 22, has revealed he only delivers orders in wealthy neighborhoodsThe delivery driver accepts orders in rich areas to get more tips  He declines 75 per cent of orders because they don't offer up-front tips A food delivery driver has admitted he only accepts orders in wealthy neighborhoods so he can rake in the cash from tips. ",
        "22-year-old Jay - who keeps his last name and face hidden for privacy reasons - frequently shares his high-paying orders with his over 148,000 followers on TikTok. Most recently, the Philadelphia driver - who delivers food primarily for DoorDash and Ubereats - revealed he passes on 75 per cent of orders because they don't guarantee large tips. Because delivering food is his 'weekend side hustle', Jay only takes on the orders  with the biggest up-front tip in the richest areas of town. ",
        "Jay often shares footage from his high-paying deliveries on his TikTok channel, however, he never shows his face.In many of his videos, the 22-year-old said he 'doesn't play that game', referring to accepting deliveries that have a long wait time. Speaking to Insider, he shared that he waits around on his bike in the neighborhoods that belong to the upper class to get paid more. According to DoorDash's website, the company states that base pay ranges from $2 to $10, depending on the 'estimated duration, distance, and desirability of the order.' UberEats doesn't disclose its base pay range, however, just like DoorDash, drivers will receive a base pay. Customers are given the choice to either tip the driver before or after they receive their food. According to Insider, Jay's average base pay is anywhere from $2 to $4.50. ",
        "On his TikTok account, he reveals he only accepts orders with up-front tips, making his total earnings between $10 to $40 on one order. On his social media, Jay revealed he aims to receive $40 an hour. ",
        "He told the outlet: 'I'm not doing this to gamble. I'm doing this to make money. 'So I'm not really interested in playing the game of, \"Oh, maybe I'll do this person's delivery for a guaranteed $2.50. Maybe it might be more.\" I don't play that game. 'And most people don't like to play that game. That's what results and their order's not getting picked up, or it takes a while for them to get their food.' He explained that most times, people in wealthier neighborhoods tip more and pay before their food is delivered. And Jay isn't the only driver searching for larger tips. The New York Times reported that delivery drivers appreciated the higher tips that they received during the COVID-19 pandemic, however, in the past year, many customers have drastically cut back their tips.  And while drivers are pushing for money, customers are fighting against tipping, noting that they shouldn't be responsible for providing workers with a living wage. The conversation surrounding tipping etiquette has reached a fever pitch, with Jay's confession coming after DailyMail.com revealed that many people are fed up.",
        "In February, DailyMail.com took to the streets to canvas real opinion on the matter.Many stated that tipping was out of control, especially due to rampant inflation sending prices of everyday items soaring.While tipping has long been a custom in restaurants, the noticeable price rise in recent years led one commenter to brand the tradition 'ridiculous'.'They are always demanding tips for everything,' they continued.They added: 'It used to be that tips were optional and 10 per cent but only if the service was good. European countries do not demand tips in this militant sort of way like they do here.'It's been abused and misused for much too long and we need to put an end to it. No more tips.' But with the cost of living soaring across the country, drivers are begging for more tips. Although inflation has decreased in the past few months, it still remains high and sits at 7.1 per cent.According to consumer data firm Dunnhumby, one-third of households are skipping meals or reducing their portion sizes to save money. ",
        "Researchers found that 18 per cent of survey's 2,000 participants noted they weren't getting enough food to eat. Furthermore, 31 per cent of households have reduced their portion sizes due to empty pantries as a result of rising grocery store prices.",
        "In addition to food costs, millions of people across the country lack a financial safety net. According to researchers, 64 per cent of participants admitted they wouldn't be able to raise $400 in an emergency. Many have suffered due to inflation, which has caused the prices of basic goods to skyrocket - including the prices of meat and poultry up by 10.4 per cent, cereal up 15.1 per cent, and fruits and vegetables up 8.1 per cent.Gas prices are another point of pressure for many people around the country, up nearly 60 per cent over the past year, with the cost of airfares up more than 34 per cent and the price of used cars up more than 7 per cent.Apparel costs are up by 5.2 per cent, overall shelter costs went up 5.5 per cent and delivery services have gone up 14.4 per cent. "
    ]
}