{
    "articleURL": "/femail/article-12048087/Queen-M-xima-elegant-black-coat-dress-attends-Remembrance-Service-Amsterdam.html",
    "content": [
        "The royal, 51, opted for a statement velvet headband for the annual engagementRead More:  It's a family affair! Queen Máxima of the Netherlands is a vision in green as her lookalike daughters join her to celebrate King's Day in RotterdamQueen Máxima of the Netherlands looked effortlessly elegant as she attended a Remembrance service in Amsterdam with King Willem-Alexander this evening.",
        "The European monarch, 51, donned a knee-length black coat dress for the poignant engagement at Dam Square.The mother-of-three swept her blonde hair into a chic up-do and wore a statement black velvet headband with embroidery on one side.The royal also donned a sheer pair of tights and finished off her ensemble with some black velvet heels with a leather toe. Although her outfit was understated for the occasion, Máxima pulled her look together with some statement jewellery. ",
        "The stylish royal wore a diamond-and-pearl brooch on her coat dress - which perfectly matched her stud earrings.On her wrists, the Queen donned some chunky silver chained bracelets which were studded with diamonds.Meanwhile, King Willem-Alexander, 56, was suitably smart in a grey suit with a white pocket square.As they arrived for the ceremony at the historic square, the Queen happily waved to the crowds.This evening, the royals are attending the annual Remembrance Day ceremony - which honours soldiers who have died in combat since the Second World War.The service began with Máxima and Willem-Alexander walking through a guard of honour - which is made up of members of the military and war veterans.This evening's service included a two-minute silence at 8pm.After this, the attendants sung the first verse of the national anthem before listening to a memorial poem.",
        "Survivors of the war are then invited to lay five wreaths at the square's memorial, which represent different groups who sacrificed their lives.The annual service ends with schoolchildren - representing the number of years the country has lived in peace - laying flowers on the memorial.The royal couple have attended the Remembrance Service every year since 2013.Tomorrow, Máxima and Willem-Alexander will attend the annual Remembrance concert - which commemorates the end of the Nazi rule over The Netherlands."
    ]
}