{
    "articleURL": "/wires/ap/article-12051529/Yellowstone-end-November-sequel-starts-December.html",
    "content": [
        "NEW YORK (AP) - The popular television western \"Yellowstone\" with Kevin Costner will end this fall and be replaced almost immediately by a sequel. But like any good drama, there's some mystery involved.",
        "The sequel, still untitled, will premiere December on the Paramount cable network, which also televises \"Yellowstone,\" Paramount said on Friday.Behind Costner, who plays Montana rancher John Dutton, series creator Taylor Sheridan launched a phenomenon. The opening of its fifth season last November was seen by 12.1 million viewers on the night of its debut, more people than any other scripted series last fall - a remarkable feat for a show not on a broadcast network.\"We've been able to create a show that didn't start out being popular but did it on its own terms,\" Costner told The Associated Press last fall.\"Yellowstone\" will wrap up with new episodes airing in November; how many was not announced on Friday. Those episodes haven't been filmed yet, and it's not clear whether Costner will participate following reports that he may want out of the series.Paramount would not comment on that Friday, with a spokesperson saying only, \"Kevin Costner is a big part of `Yellowstone´ and we hope that's the case for a long time to come.\"",
        "David Glasser, CEO of 101 Studios, which produces \"Yellowstone\" with MTV Entertainment, said the new series \"will be picking up where `Yellowstone´ leaves off in another epic tale.\" While the series hasn't been named, the word \"Yellowstone\" will be part of the title - an important distinction because that wasn't the case for spinoffs like \"1883\" or \"1923.\"",
        "Paramount has denied published reports that actor Matthew McConaughey is signed to star in the sequel. But a spokesperson said Friday that McConaughey \"is a phenomenal talent with whom we'd love to partner.\"Following its debut on the cable network, the sequel will also air on the Paramount+ streaming network.That's a hugely important distinction for the company. \"Yellowstone\" streams on NBC Universal's Peacock service, owned by Comcast, meaning a big chunk of revenue created by the popular drama has been going elsewhere."
    ]
}