{
    "articleURL": "/sport/football/article-12038201/Barcelona-consider-playing-ASIAN-Champions-League-banned-Europe.html",
    "content": [
        "The Blaugrana have been mired in scandal since the 'Caso Negreira' revelationsUEFA will not be banning Barca from the CL whilst their investigation rolls onJoan Laporta met with UEFA head Ceferin last week to discuss club's prospects Barcelona will explore other competitions, likely in Asia, should they receive a ban from UEFA that stops them from competing in the Champions League, according to reports. ",
        "UEFA is currently spearheading an investigation into allegations that the club made payments to the then-vice president of the Spanish referee's committee between 2001 and 2018. An estimated £6.5million (€7.3) was paid by Barcelona to DASNIL and NILSAT, two companies owned by Jose Maria Enriquez Negreira. The European governing body started its own investigation in alleged match interference following charges brought against the club by Spain's public prosecutor.  At present, UEFA has assured the Blaugrana that they will be allowed to compete in next season's competition, which the LaLiga champions-in-waiting are already set to qualify for.   ",
        "But as per Catalan television programme Onze, via Sport, the club has begun preparing for the worst and conducted a study into where else the side might play should they find their entryway to UEFA competition temporarily barred. Television share, ticketing, and potential prize money from European competitions are all revenue streams that the club would be loath to miss out on as they seek to rebuild their squad and safeguard their financial future. Competitions in Asia have been studied the most closely, including the Asian Champions League.Club president Joan Laporta – who is serving his second stint at the helm of the Catalan giants after previously holding the role between 2003 and 2010 – has been persistent in his quest to ensure Barcelona still has access to Europe's most prestigious club competition. ",
        "Last week, Laporta met with UEFA head Aleksandr Ceferin in his native Slovenia in a bid to clear the air between the two organisations.    ",
        "The governing body's Champions League regulations, which have been in effect since 2007, allow the organisation to ban teams from the competition for one season if they are found to be involved in match fixing.Barcelona continues to deny any wrongdoing or conflict of interest, saying the club paid for technical reports on referees but never tried to influence their decisions in games. Although the meeting between the two presidents is believed to have gone well, Laporta is no closer to learning the organisation's decision on the matter. UEFA are not likely to present the findings of their investigation until next summer. "
    ]
}