{
    "articleURL": "/sport/nfl/article-12059605/Sauce-Gardner-hails-great-guy-Aaron-Rodgers-new-Jets-quarterback-promises-help-out.html",
    "content": [
        "The sophomore corner and future HOFer were at MSG for Knicks-Heat last weekRodgers has given the Jets team an immeasurable boost ahead of this seasonDailyMail.com provides all the latest international sports news New York Jets star cornerback Sauce Gardner has explained how Aaron Rodgers will elevate his game further after an historic rookie season. ",
        "Gardner and Rodgers were courtside at Madison Square Garden for Game 2 of the Eastern Conference semifinals playoff series Tuesday, engaging in deep conversation during their time spent together, according to ESPN's Rich Cimini. Prior to the game, the talented pair dined in Greenwich Village speaking both about football and living in the Big Apple during a seven-hour hang. 'He was telling me he's going to be able to help me out, tell me how teams are going to attack me, tell me the things I can work on as a cornerback,' Gardner said, via ESPN. 'He was telling me he's got the secret gems that he can just give me.'Rather than merely facing Rodgers in practice, witnessing how greatness can occur at the quarterback position. Iron sharpening iron, if you will. Though, Rodgers wants to be more hands on with the sophomore who became the most recent first-team All-Pro rookie since 1981.",
        "'That's not what I was thinking, though, when I said he was going to make me better. Just hearing that from him made me respect him even more. Yeah, man, he's a great guy. I wasn't expecting that.'I'm looking forward to being able to just sit down and watch film and tell him what we're trying to do and he can tell us what they're trying to do on offense.' ",
        "Gardner and Rodgers naturally discussed matters extending beyond the gridiron. His 39-year-old quarterback has been enjoying some of New York's sports offerings, attending the Garden for a Rangers-Devils meeting, in addition to several Knicks games.'There's no pressure when it comes to playing in New York,' Gardner continued. 'You've got to tell yourself, 'I'm built for this.' Me and Aaron, we caught ourselves, telling each other like, \"I'm built for this.\"... We had that one-on-one moment when we were eating dinner.' Rodgers was officially acquired in a trade with Green Bay amid much fanfare on April 26, starring in his opening press conference with the resurgent franchise.Gardner had long been campaigning for Rodgers to link up with him at One Jets Drive, even burning his cheesehead, which he acquired in the Jets' win at Lambeau Field, in the weeks leading up to the move.He made headlines last week for not knowing who actress Jessica Alba was, whom he met alongside Rodgers at Game 2 of the Knicks-Heat series.  "
    ]
}