{
    "articleURL": "/wires/reuters/article-12053483/Henry-hopes-NZ-avoid-whitewash-v-World-No-1-Pakistan.html",
    "content": [
        "KARACHI, Pakistan, May 6 (Reuters) - Bowler Matt Henry is hopeful New Zealand can avoid a series whitewash in Pakistan by producing an improved display in Sunday's fifth and final one-day international against the world number one side.",
        "New Zealand landed in Pakistan without regular skipper Kane Williamson, who is likely to miss this year's World Cup with a knee injury, while several frontline players are busy honouring franchise commitments in the Indian Premier League.The team under Tom Latham managed to draw the preceding T20 series 2-2 but Pakistan have taken an unassailable 4-0 lead in the one-day series.In the fourth ODI on Friday, skipper Babar Azam smashed 107 to help Pakistan post a commanding 334-6 at the National Stadium in Karachi.In reply, New Zealand were all out for 232 in the 44th over to succumb to a 102-run defeat.\"It's a shame we really haven't had the success that we wanted to ... \" Henry told reporters after the loss.\"Even though it's not nice not to have won, we're definitely taking some positives out of this tour so far.\"We've still got one game to go and hopefully we can put that performance together.\"The tourists are hoping the experience of playing nine limited-overs matches in subcontinent conditions would stand them in good stead at the ODI World Cup in India later this year.Henry had no hesitations admitting Pakistan had outplayed his team in home conditions.\"First and foremost, our focus has been on this tour. We're coming here to Pakistan to challenge ourselves and compete the best we can,\" said the 31-year-old who has been New Zealand's best bowler on this tour.",
        "\"Obviously it's frustrating to be four-nil but sometimes you've got to give kudos to the way that Pakistan have been playing their cricket.\"They are obviously number one in the world at the moment and playing in their home conditions.\"They've been able to really adapt to these conditions and put the squeeze on key moments.\" (Reporting by Amlan Chakraborty in New Delhi; editing by Stephen Coates)"
    ]
}