{
    "articleURL": "/wires/reuters/article-12041145/FOREX-Dollar-defensive-jobs-data-spotlight-Fed.html",
    "content": [
        "By Amanda Cooper",
        "LONDON, May 3 (Reuters) - The dollar fell on Wednesday, ahead of an expected rise in U.S. interest rates, and as gloomy jobs data, a standoff over the U.S. debt ceiling and nervousness following banking collapses clouded the investment outlook.U.S. job openings fell for a third straight month in March and layoffs increased to the highest in more than two years, data showed on Tuesday, offering hope a weaker labour market could aid the Fed's fight against inflation.The dollar index, which measures the U.S. currency against six others, fell by 0.25% to 101.61, dropping for a second day in a row.The Fed is widely expected to raise interest rates by 25 basis points when it concludes a two-day meeting on Wednesday and investor focus will be on what policymakers signal they might do next.Right now, the derivatives market shows traders believe this will be the last hike before the Fed switches to rate-cut mode. The central bank has said its actions will depend on incoming data, much of which has shown the economy is slowing and price pressures are easing, but not by enough to warrant an abrupt shift in policy.\"Let´s be clear: a pause is not a pivot. And this is a key highlight worth reiterating. A pivot implies a move to cuts later in the year. We aren´t so sure of that,\" Jack Janasiewicz, who is lead portfolio strategist at Natixis Investment Management, said.",
        "U.S financial markets are reeling from the weekend failure of San Francisco-based First Republic Bank as well as worries that the government could run out of cash by June if lawmakers do not strike a deal to raise the borrowing limit, known as the debt ceiling.Yields on very short-term Treasury bills have soared in the last couple of weeks, as investors have sold any bonds likely to mature around the time of the deadline.\"What traders really want to know if it is `one and done´- or that concerns surrounding the U.S. debt ceiling could at least see the Fed pause in June,\" City Index strategist Matt Simpson said.\"In reality, I suspect that Jerome Powell will maintain his hawkish mantra as not to undo the plethora of hawkish comments leading into the blackout period. They could always hold rates steady in June without feeling the need to signal it today, for example,\" he said.Later on Wednesday, the market will get a look at private-sector payrolls growth, which could offer a flavour of what to expect from Friday's employment report, which is expected to show the U.S. economy created 179,000 jobs in April.The euro was last up 0.3% at $1.1032, ahead of Thursday's regular policy meeting by the European Central Bank.",
        "Money markets show a roughly 85% chance the ECB will raise rates by 25 bps and a 15% chance of 50 bps.Elsewhere, the Australian dollar fell 0.1%, paring some of the previous day's 0.5% gain after the Reserve Bank of Australia delivered a surprise rate rise.Sterling was up 0.3% at $1.2509 and was flat against the euro at 88.20 pence.The Japanese yen rose 0.5% to 135.83 per dollar, clawing back some of its losses from last week when the Bank of Japan stuck to its ultra-loose monetary policy.(Additional reporting by Ankur Banerjee in Singapore; Editing by Jacqueline Wong, Simon Cameron-Moore and Barbara Lewis)"
    ]
}