{
    "articleURL": "/news/article-12053435/Coronation-Zara-Mike-Tindall-head-home-2am-night-Mayfair.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Zara and Mike Tindall enjoyed a big night out before the King's Coronation, partying at private members venue The Arts Club until 2am following a royal dinner.",
        "The couple left Mayfair club Oswald's at 11pm after eating with other members of the Royal Family including Prince Andrew, Prince Edward and Princess Anne.The Tindalls then continued their evening at The Arts Club where they left at around 2am and were photographed walking in the street looking for a taxi home.They were out just nine hours before the Coronation begins at 11am at Westminster Abbey following the procession from Buckingham Palace which starts at 10.20am.One witness told MailOnline: 'After leaving Oswald's they carried on their evening partying at nearby the Arts Club where they left at approximately 2am.'",
        "The witness added that the Tindalls were then seen 'stumbling in the street while taking in all the Coronation bunting before getting into a taxi home'.It comes after the Royals united at a huge family dinner at Oswald's.The Tindalls attended along with Andrew and children Beatrice and Eugenie and their husband, Anne and her husband, the Kents and the Duke and Duchess of Edinburgh.Oswald's is owned by British entrepreneur Robin Birley, who also owns and runs 5 Hertford Street, which is where Prince Harry and Meghan Markle had their first date.Oswald's is the most exclusive of London's private members' clubs, with the Queen Consort and Boris Johnson and his wife Carrie among those who frequent the venue.",
        "Named after owner Birley's grandfather, it is a club for both men and women - with a focus on wine.",
        "The private members' club is thought to be the best for wine connoisseurs, where guests can either cellar their own wine, or buy in house, before enjoying them in the ground floor restaurant or on the small rear terrace.Zara, 41, who arrived at Oswald's alongside her husband Mike, 44, opted for a striking navy blazer and trouser combo, paired with a light blue shirt.Her cousin, Princess Eugenie, 33, who is expecting her second child with husband Jack Brooksbank, who was also in attendance at the family occasion, seemingly took inspiration from Zara and donned an Asceno Velvet Athens Robe, costing £575.They were joined alongside Princess Beatrice , 34, dressed in Louis Vuitton's £2,900 chain print asymmetrical long-sleeved frock.Today, they will join King Charles, Queen Camilla and the Prince and Princess of Wales at the coronation in Westminster Abbey. The King, Kate and William attended a Buckingham Palace reception yesterday with foreign royals and world leaders.Eugenie, who already shares two-year-old August with her husband Jack, paired her glamorous red robe with black heels and a matching bag.Coordinating with his wife, Jack opted for a smart suit, white crisp shirt and a red patterned tie.",
        "Beatrice, meanwhile, teamed her designer dress with black heels and a matching blazer. She added a touch of glitz to her look with dazzling earrings.Her husband, Edoardo Mapelli Mozzi, 39, who she shares one-year-old daughter Sienna with, looked equally sophisticated in a navy suit and a light blue tie.Meanwhile, Zara - arriving alongside her husband Mike - teamed her look with court heels and dazzling diamond earrings.Elsewhere, Sophie, 58, and Prince Edward, 59, were joined by their children, James, Earl of Wessex, 15, and Lady Louise Windsor, 19.Oswald's attracts the likes of Dame Joan Collins, Priti Patel, David Beckham, the Earl of Snowdon, and is where Amber Heard was seen partying during the High Court in Johnny Depp's libel suit against a newspaper last year.Prince William, who was seen enjoying a night with friends at the club in November, is also said to be a member of 61-year-old Etonian Birley's secretive members only club 5 Hertford Street.",
        "Joining costs £1,800 a year and members - rumoured to include Harry Styles, Margot Robbie, Mick Jagger and numerous royals - need to be recommended by a proposer and a seconder.In the summer of 2020 following lockdown, Mr Birley, who is known as the 'king of clubs' spent millions of his own money to lure members back to his fashionable Mayfair nightspots.",
        "The mogul gifted every member of 5 Hertford Street and Oswald's a free meal up to the value of £500 - an offer which lasted until Christmas, with members allowed to bring as many guests as they like.There are understood to be at least 3,000 members of the two clubs so it could have set Birley back more than £1.5million.Birley, the son of Lady Annabel Goldsmith and late club owner Mark Birley, opened 5 Hertford Street in 2012 and it soon became London's most exclusive watering hole.Based in a labyrinthine townhouse, it is decorated like a bohemian stately home and members are charged fees of about £2,500 a year.Birley bears facial scars left by a tiger that attacked him at a family friends' private zoo when he was just 12.And the businessman made headlines in 2019 after it was claimed that he helped to fund Boris Johnson's campaign to become prime minister."
    ]
}