{
    "articleURL": "/health/article-12038081/Regularly-using-internet-LOWERS-risk-dementia-50-middle-age-study-claims.html",
    "content": [
        "Researchers at New York University tracked 18,000 adults for eight yearsResults showed those who were online often had half the risk of dementiaREAD MORE: The twelve factors which raise your risk of dementia REVEALED We're often told of the dangers of too much screen time, but a study suggests regularly using the internet may slash the risk of dementia.",
        "Researchers at New York University tracked 18,000 adults aged between 50 and 65 for about eight years.They were asked at the start of the study and then again every two years if they 'regularly' used the web to send emails, shop, browse or book vacations.Those who answered 'yes' most of the time had a 50 percent lower risk of being diagnosed with all forms of dementia compared to those who normally said 'no' by the end of the research.Scientists suggested the 'digital divide' could be because the internet stimulates the brain to protect against deterioration.",
        "Historically, older people have shied away from using the internet as much as their younger counterparts.But the rise of smartphones has meant that now even more people in their senior years are accessing the web.In the latest study, researchers surveyed participants between 2002 and 2018 on their internet usage.Each was asked: 'Do you regularly use the World Wide Web, or the Internet, for sending and receiving e-mail or for any other purpose, such as making purchases, searching for information, or making travel reservations?'",
        "Regular hearing checks, seven hours of sleep a night and more exercise are among 12 lifestyle factors that could slash a person's chances of dementia by up to 40 per cent. ",
        "Those who answered 'yes' were considered regular users, while those who said no were considered non-regular users.Participants were then surveyed every other year until 2018 and results were analyzed.No participants had dementia at the start of the study, but by the end it had been diagnosed in 1,183 people — or nearly five percent of those involved.In the internet-savvy group, 224 out of 10,333 participants were diagnosed with dementia (1.5 percent of the total).In the other group, 959 out of 7,821 participants (10.45 percent) developed the disease.Scientists adjusted for other risk factors including education, ethnic group, sex, generation and signs of cognitive decline.But they still found that those who used the internet regularly had a 50 percent lower risk of dementia.They did not adjust for other factors like smoking, drinking and obesity, which are all known to raise the risk of dementia.  Previous research has also suggested that internet use can stave off dementia by stimulating people to learn new skills and reducing feelings of loneliness.In a second experiment, the NYU team also found that two hours of internet use a day appeared to be optimal for staving off cognitive decline in older adults.But the relationship had a 'U-shape', with people who used the internet rarely or a lot having a much higher risk of dementia.",
        "In this part of the study, they looked at a subset of 4,000 participants in 2013 who were asked how often they used the internet.Results showed those who used it up to two hours a day had the lowest risk, while those online for more than eight hours had more than double the risk.At the other end of the scale, those who were online for virtually no time had a 67 percent higher dementia risk.Limitations of the study include that it was observational, meaning it could not prove that internet use was linked to a higher risk of dementia.It also relied on users self-reporting their internet use, which may vary widely between participants. "
    ]
}