{
    "articleURL": "/wires/ap/article-12052553/UN-seeks-reassure-Afghans-deliver-aid.html",
    "content": [
        "UNITED NATIONS (AP) - The United Nations sought to reassure the Afghan people yet again Friday that it won´t abandon them, though it left in question how it was going deliver desperately needed aid following the Taliban ban on Afghan women working for the world organization.",
        "U.N. Secretary-General Antonio Guterres has called the ban an unacceptable violation of the Afghan women's human rights.The U.N. announced on April 11 that the head of its political mission in Afghanistan, Roza Otunbayeva, would carry out an \"operational review\" of its activities in the country until May 5.The mission, known as UNAMA, put out a statement in Kabul on Friday, reiterating its commitment \"to stay and deliver on behalf of the men, women and children of Afghanistan\" and appealing to donors to keep funding humanitarian assistance, U.N. deputy spokesman Farhan Haq said.\"For now, we can only say that U.N. entities on the ground in Afghanistan continue to discuss appropriate working modalities,\" Haq told reporters at the U.N. headquarters in New York. \"Meanwhile, humanitarian operations continue to be undertaken.\"On April 5, Afghanistan´s Taliban rulers informed the United Nations that Afghan women employed with the U.N. mission could no longer report for work. It was the latest in sweeping restrictions imposed by the Taliban since they seized power in Afghanistan in August 2021 as U.S. and NATO troops were withdrawing from the country after 20 years of war.The Taliban previously banned girls from going to school beyond the sixth grade and women from most public life and work. In December, they banned Afghan women from working at local and non-governmental groups - a measure that at the time did not extend to U.N. offices.",
        "The U.N. said it could not accept the decision, calling it an unparalleled violation of women´s rights. The 3,300 Afghans employed by the U.N. - 2,700 men and 600 women - were ordered to stay home but continue to work and are being paid, The U.N.´s 600-strong international staff, including 200 women, is not affected by the Taliban ban.The U.N. mission statement reiterated that lifting restrictions on the U.N., national and international nongovernmental groups involved in delivering humanitarian aid and other programs supporting the Afghan people \"is essential.\"It said the U.N. continues to engage with the Taliban to obtain a reversal of the ban and ensure the safety of its staff. It quoted Guterres saying at a closed-door meeting in Qatar in early May that \"we must remain focused on our objective to support the people of Afghanistan.\"\"We cannot disengage despite the challenges,\" the U.N. chief said and also urged funding for aid operations, saying the ban was exacerbating already low levels of funding.Guterres plans to hold another meeting aimed at unifying the positions of key players on the issues of human rights, governance, counterterrorism and anti-drug efforts related to Afghanistan.Haq, the deputy U.N. spokesman, was pressed on the outcome of the U.N. review but said he had \"no actual change in our posture on the ground to report.\"",
        "\"We´re working to come to a decision on appropriate working modalities,\" he said.\"The needs of the Afghan people are immense, and we intend to fulfill those needs, but at the same time, our operations are clearly impeded ... and our position on the need to allow all of staff, men and women, to work in communities un Afghanistan remains unchanged,\" Haq said.U.N. staff in Afghanistan are still working from home \"aside from critical functions,\" and \"humanitarian operations continue to be undertaken,\" he said.The Taliban have agreed to some \"carve-outs\" for Afghan women, including in the health sector, \"and we will use those,\" he added.___Associated Press writer Rahim Faiez in Islamabad contributed to this report."
    ]
}