{
    "articleURL": "/wires/reuters/article-12059641/TABLE-Turkey-May-14-elections-Latest-poll-puts-oppositions-Kilicdaroglu-critical-50-threshold.html",
    "content": [
        "May 8 (Reuters) - Turks vote on May 14 in elections seen as among the most consequential in Turkey's modern history, with President Tayyip Erdogan facing the biggest political challenge of his two-decade rule. Surveys carried out since devastating earthquakes on Feb. 6 show Erdogan's main challenger for the presidency, Kemal Kilicdaroglu, ahead of him in the first round of voting. If no candidate secures more than half the votes in the first round, a May 28 runoff will be held between the two leading candidates. Most polls for the parliamentary elections show the main opposition alliance ahead of the People's Alliance, which includes Erdogan's Islamist-rooted AK Party, the nationalist MHP, the right-wing Great Unity Party and the New Welfare Party. The opposition Nation Alliance includes Kilicdaroglu's main opposition CHP, the centre-right IYI Party, the Islamist Felicity Party, the Democrat Party and two parties founded by former Erdogan allies, the Deva and Future parties. Parliament's third-largest party, the pro-Kurdish Peoples' Democratic Party (HDP), will run for parliament under the Green Left Party banner to circumvent its potential closure. It has formed the Labour and Freedom Alliance with several other left-wing parties. With votes already being cast at polling stations outside of the country, alliances or parties that run alone must secure at least 7% of the total votes cast to win seats in parliament. Below are tables of opinion polls for both races: PRESIDENTIAL ELECTIONS Date Source Tayyip Erdogan Kemal Kilicdaroglu Muharrem Ince Sinan Ogan Undecided March 7 ORC 43.2% 56.8% - - - March 9 Alf 44.9% 55.1% - - - March 10 Piar 42.9% 57.1% - - - March 11 Aksoy 44.4% 55.6% - - - March 17 ORC 42.3% 53.1% 3.1% 1.5% - March 22 MAK 42.4% 46.5% - - 7.7% March 24 Metropoll 42% 44.6% - - 5.1% April 6 Yoneylem 39.2% 43.8% 8.6% 2.7% 2.8% April 8 Metropoll 41.1% 42.6% 5.0% 2.2% 4.4% April 12 ORC 41.5% 48.9% 7.2% 2.4% - April 12 Gezici 43.2% 53.4% 2.1% 1.3% - April 15 Alf 43.9% 47.4% 6.5% 2.2% - April 17 MAK 43.7% 47.8% 3.4% 1.1% 4.0% April 18 Aksoy 38.4% 47.9% 9.0% 4.8% - April 21 Yoneylem 39.0% 44.1% 5.1% 2.5% 6.5% April 24 ORC 42.4% 49.3% 6.1% 2.2% - April 29 Piar 47.1% 49.4% 1.2% 2.3% - May 1 Aksoy 41.9% 47.3% 5.8% 5.0% - May 2 Gezici 44.6% 48.7% 4.7% 2.0% - May 3 ORC 44.6% 48.0% 4.3% 3.1% - May 4 Yoneylem 42.5% 48.6% 3.7% 5.2% - May 7 MAK 45.4% 50.9% 1.7% 2.0% - PARLIAMENTARY ELECTIONS* Date Source People's Alliance Nation Alliance Labor and Freedom Undecided (Government bloc) (Main opposition) Alliance (Pro-Kurdish left bloc) March Metropoll 43.5% 37.6% 13.4% - March 9 Alf 39.4% 43.5% 11.3% - March 10 Piar 37.9% 46.4% 11.6% - March 11 Aksoy 38.2% 44.1% 11.4% - March 17 ORC 37.2% 44.5% 10.8% - March 22 Yoneylem 37.5% 32.6% 11.2% 10.1% March 22 MAK 42.0% 45.0% - 4.0% April 12 ORC 39.4% 42.8% 10.8% - April 14 Alf 39.7% 43.4% 10.1% - April 15 Metropoll 40.1% 31.7% 12.1% 6.4% April 17 MAK 44.0% 40.0% 10.3% 4.0% April 18 Aksoy 38.6% 32.0% 13.0% - April 19 Yoneylem 37.2% 33.6% 10.7% 11.6% April 24 ORC 40.3% 43.7% 10.7% - May 1 Aksoy 41.5% 41.1% 11.5% - May 3 ORC 41.8% 43.5% 11.6% - May 7 MAK 43.7% 41.4% 10.5% 3.2% *Alliances' vote shares may be a sum of member parties, or aggregate numbers depending on the pollster. (Reporting by Canan Sevgili and Azra Ceylan Editing by Louise Heavens and Lisa Shumaker)"
    ]
}