{
    "articleURL": "/news/article-12051815/Diner-yells-child-crawling-underneath-table-pizza-joint-wrong.html",
    "content": [
        "An unidentified diner took their frustrations to Reddit after they and their friend Jack tried to decompress from a stressful week and was disturbed by rowdy kids 'The kids are running around the restaurant being loud while the adults are drinking wine and eating their pizza,' the frustrated diner wrote last weekAfter one of the children crawled under their table and touched the diner's leg, they scolded the child, but the kid's mother was certain the diner was 'cranky'A fed up diner in a pizza joint has taken to social media to survey whether they were in the wrong for scolding a stranger's child who crawled underneath their table during dinner. ",
        "The unidentifed diner took their frustrations to Reddit's famous Am I The A**hole thread after being interrupted by loud children while they were unwinding from a stressful week with a friend. The poster acknowledged that the joint was nowhere close to 'fine dining' - the joint had 'booths and tables of people sitting', including the culprit: A large family  with little kids, aged between four and eight. 'The kids are running around the restaurant being loud while the adults are drinking wine and eating their pizza,' the frustrated diner wrote last week. The disgruntled diner ignored the 'commotion' for around 20 minutes, but  when a 'sudden' hand landed on their leg from underneath the table they couldn't take it anymore. 'I wasn't thinking and snapped at the kid, and said: \"Get away from our table!\" and the kid ran away and burst into tears,' they wrote on Reddit. ",
        "The simple frightened reaction landed the stressed restaurant-goer in hot water with the child's mother, who came to the table and 'started tearing into me.' The mother accused the person of being 'cranky and mean' and 'how dare I yell at her kid who was just playing.' 'Meanwhile, she and the other middle-aged-forty-something parents are letting their kids run amok and be loud and obnoxious while my friend and I are trying to enjoy a night.' ",
        "When they asked the famous question: 'Am I the a**hole?' commenters were quick to establish that they weren't and they were simply doing what the parents should have done in the first place. 'NTA [Not the a**hole],' user SatisfactoryLoaf wrote. 'Her exhaustion / boundaries / parental philosophy create no obligations for you. Your personal space was invaded, you reacted to repair that.' Narkareth agreed, writing: 'You are not a jungle gym, and your table is not a play place.' A user who goes by Lovebeingadad54321, wrote: 'Look at my username, now, I am going to say you are NTA. People should not let their kids be crawling around on the floor under their OWN table, nonetheless someone else’s!!!' Another wrote: 'NTA. Someone needs to yell at the little brat, and the parents obviously weren't going to do it.' KingdomKey10 wrote: 'NTA. People who don't scold their kids shouldn't be surprised when their kids get scolded by strangers, especially if they are just letting their kids go around and invade people's personal space. you didn't do anything wrong and the mom and all the rest of those parents are all major AHs [a**holes].' Others commented on the traditional saying that it 'takes a village to raise a child,' but many parents are too accustomed to people taking charge. ",
        "Another user, who simply goes by [deleted], wrote: 'Funny how the same people who say \"it takes a village\" when they want a free babysitter, don't like it when the 'village' actually starts parenting their kids. NTA.' ",
        "Former restaurant workers also chimed into the debate, with many saying they were happy the diner said something and even detailed their own horror stories. 'LOVE this. I waited tables in college and was appalled by how parents allowed their children to behave (definitely a nicer place too!),' a former restaurant worker wrote. 'OP you are NTA even a little bit. 'I once had a kid crawl into my stall while I was putting in a freaking tampon. I clamped my knees shut and said he had to get out of my stall NOW while I leaned forward to unlock the door so he could walk out. 'When I exited the stall after several minutes (hoping I wouldn’t have to deal with seeing the easily four years old kid and whomever was with him), I was stunned to encounter his mother and grandmother glaring at me. 'They didn’t say a word. I washed my hands and exited while they continued staring me down. I think some people just can’t cope with their kids being corrected when they themselves have failed as parents to teach them reasonable boundaries.' ",
        "Another former restaurant worker, who username is PewPewBiscuits, wrote: 'On behalf of all restaurant workers everywhere, thank you for yelling at the mom. (It’s been years since I worked in a restaurant, but the rage from watching people let their kids run around unsupervised never really goes away.).' "
    ]
}