{
    "articleURL": "/wires/afp/article-12045435/Kenyan-pastor-faces-court-cult-massacre.html",
    "content": [
        "A prominent Kenyan pastor faces a court hearing on Thursday in connection with the horrific discovery last month of dozens of bodies in mass graves.",
        "Ezekiel Odero, a wealthy televangelist who boasts a huge following, is being investigated on a raft of charges including murder, aiding suicide, abduction, radicalisation, crimes against humanity, child cruelty, fraud and money laundering.Prosecutors accuse Odero of links to cult leader Paul Nthenge Mackenzie, who is in custody facing terrorism charges over the deaths of more than 100 people, many of them children.Mackenzie, the head of the Good News International Church, is alleged to have incited his followers to starve to death in order to \"meet Jesus\" in a case that has deeply shocked Kenyans.Odero arrived in court in the Indian Ocean port city of Mombasa ahead of the hearing, as about 50 supporters gathered outside, some dressed in all white, some in red, and praying with bibles in hand.Kenyan police had arrested Odero last Thursday over the \"mass killing of his followers\" and closed his New Life Prayer Centre and Church that lies south of the coastal town of Malindi.A total of 109 people have so far been confirmed dead in what has been dubbed the \"Shakahola forest massacre\".Autopsies carried out so far on 40 of the bodies unearthed in the forest inland from Malindi found that while starvation appeared to be the main cause of death, some of the victims were strangled, beaten or suffocated.",
        "Prosecutors say they have credible information linking the corpses exhumed at Shakahola to the deaths of several of Odero's \"innocent and vulnerable followers\".Prosecutors have said in court documents that Odero and Mackenzie share a \"history of business investments\" including a television station used to pass \"radicalised messages\" to followers.In a court filing earlier this week, Odero said he wanted to \"strongly disassociate\" himself from Mackenzie and disagreed with his teachings.Cliff Ombeta, one of Odero's lawyers, had told reporters at Tuesday's court hearing that there was no evidence connecting the pastor to the Shakahola discoveries.\"Evidence must be brought. It is a case where you must prove,\" he said.The deeply religious Christian-majority country has been stunned by the case and President William Ruto has pledged to take action against unscrupulous churches and cults that have dabbled in criminality."
    ]
}