{
    "articleURL": "/columnists/article-12053043/From-eating-dairy-spicy-food-doing-squats-simple-steps-speed-metabolism.html",
    "content": [
        "People often tell me that, despite eating healthily, they continue to put on weight — and they wonder if this could be because their metabolism has slowed down.",
        "Though I’ve long been sceptical about this, a remarkable new study published in the journal Nature suggests there really is something in that claim.Using a precise way of measuring metabolic rate, researchers from the University of Aberdeen and Chinese Academy of Sciences in Beijing, have shown that over the past 40 years, average metabolic rates in the UK and elsewhere have slowed right down.In fact, according to the researchers’ calculations, men are burning about 220 calories less a day and women 122 calories less, compared with what people the same size and shape would have done in the 1980s.That is a huge drop, large enough to explain most of the weight gain that has happened over those decades. But why have average metabolic rates slowed so dramatically?",
        "Your metabolic rate is a measure of the amount of calories you burn daily to keep you going. There are two parts to it: your basal metabolic rate (BMR), the amount of calories you need to power vital functions such as breathing and driving blood around your body. This accounts for about 70 per cent of the calories we burn each day.Then there is total energy expenditure (TEE), which is the energy you expend doing physical activity — such as running, vacuuming, walking the dog, or just fidgeting — added to your BMR.",
        "It depends. Research suggests that while a quick, 20-minute nap is a great way to recharge, dozing for longer may make it harder to get to sleep that night and might have a negative impact on your health.A new study in the journal Obesity, based on more than 2,000 people, found that the optimal nap duration was less than 30 minutes: those who napped for longer, or not at all, had higher blood pressure.So if you fancy a nap do it before 3pm (any later can interfere with night-time sleep), find a quiet spot — and set an alarm for 20 minutes.",
        "Scientists measure TEE using the ‘doubly labelled water’ method. You start by asking people to drink a special type of water, where the hydrogen and oxygen molecules have been replaced with naturally occurring ‘heavy’ forms.You then collect urine samples and, with the help of some sophisticated maths, it is possible to estimate how many calories that person is burning during a normal day.For the latest study in the journal Nature, the British and Chinese scientists looked at data that has been collected using this method on more than 4,000 people across the UK, U.S. and Europe, since the 1980s. And they had some remarkable findings. For starters, there is a widely held belief that the rise in obesity over the past four decades is, at least partly, caused by us becoming lazier, spending more time in front of screens and, therefore, burning fewer calories.",
        "Yet this study found the exact opposite — if anything, people have become more active and burn more calories than in the 1980s.To the scientists’ great surprise they discovered, instead, that basal metabolic rates (i.e. the calories we spend just staying alive) had dropped, which explains the big fall in total energy expenditure.They believe one reason for this is the major change in what we eat, with a drop in consumption of meat and dairy (which are rich in saturated fats) and a rise in ultra-processed foods high in sugary carbs. For years we were urged to reduce consumption of saturated fats because this was supposed to cut our risk of heart disease, though the evidence for this has never been that strong.As the researchers point out, one unintended side-effect of following this advice may have been a fall in average metabolic rates.Studies in rats have shown that when you reduce levels of saturated fat in their diets, their metabolic rates slow down.Similarly, there is evidence in humans that switching to a ketogenic diet, which is higher in fat and low in carbs, leads to a smaller fall in your metabolic rate than switching to a low-fat diet.In a 2012 study in the New England Journal of Medicine, 21 adults who were overweight or obese were allocated to follow a ketogenic diet for a month, followed by a low-fat diet, or vice versa. Although they experienced a drop in metabolic rates whichever diet they followed (as you’d expect, because they lost weight and people carrying less weight have a slower metabolic rate), this was significantly greater when they were on the low-fat diet.",
        "On the ketogenic diet, the amount of calories they burned only dropped by 95 a day, compared to 423 calories a day on the low-fat diet (a reason, I think, why keto can be a more effective way to lose weight and keep it off).Another possible reason why our basal metabolic rates have fallen is because we now heat our houses more. Before the days of central heating, our houses were much colder in the winter months and so we would have to burn a lot of calories trying to keep our core body temperature in a healthy range.On the plus side of this, one of the adaptations that naturally occurs when you are living in a chillier house is your body produces more brown fat — this type of fat is packed with mitochondria, tiny structures inside your cells that act like mini power stations, turning food into energy. The more brown fat you have, the higher your metabolic rate.So is there anything you can do to speed up your metabolic rate?Apart from eating more saturated fat and turning the thermostat down a few more degrees, as I’ve got older I have been doing more resistance exercises, such as press-ups and squats, as muscles burn energy even when you are sleeping.",
        "I’ve also been eating more spicy foods and drinking green tea, which have both been shown to help metabolism.Eating more protein, which is advisable as you get older because it helps maintain muscles and bones, will also boost your metabolic rate, as your body uses more energy digesting and absorbing protein than foods that are high in carbs.And finally, drinking plenty of water and caffeine will also give your metabolism a little boost.New gene test for post-op painSome years ago, I decided to test the power of hypnosis to curb pain by getting myself hypnotised, then trying to drive a needle through the fleshy part of my hand.",
        "This wasn’t a success because I wasn’t able to push the needle in very far before the pain meant I had to stop.So I was surprised to see that hypnotism is increasingly being used in hospitals, before and after surgery, to reduce pain.This suggests that either the hypnotist I was using wasn’t any good, or that I am one of those who doesn’t respond to this approach.Now a team at Stanford University in the U.S. has developed a genetic test to identify the patients most likely to benefit from hypnosis.The genes this test looks for include those that control the release of dopamine, a feel-good brain chemical.",
        "The idea is that having a simple blood test could help determine whether being hypnotised before your operation is worthwhile or not.Beware the burning rays of the UK sunI don't normally take much interest in the lives of celebrities, but I was struck by a recent photo of Khloe Kardashian’s face after she’d had an early melanoma removed.",
        "This is a dangerous form of skin cancer and it’s the second that Khloe, 38, has had cut out. Presumably she has some genetic predisposition or is just unlucky. I applaud the fact that she is getting out there and warning her young fans of the dangers of too much exposure to ultraviolet light from the sun.In the UK there has been a huge rise in the incidence of melanoma and other types of skin cancer. This is almost entirely down to too much sun exposure. Although we don’t get as much sun in the UK as people in California, for example, you can get burnt here.Having fair skin is a major risk factor, which could explain why my wife, Clare, recently discovered a skin cancer, a basal cell carcinoma (BCC), just beneath her lip.BCC usually appears as a small, shiny pink or pearly white lump, or a red, scaly patch (Clare had it removed — you can find pictures on her Instagram page, @drclarebailey).Do bear in mind that, while getting some sun to boost your vitamin D levels is vital, it’s equally important to avoid getting burnt."
    ]
}