{
    "articleURL": "/sport/football/article-12059243/Barcelona-set-ask-Jong-pay-cut-Man-United-receives-transfer-boost.html",
    "content": [
        "De Jong will reportedly be asked to take a pay cut this summer at BarcelonaThe club need to comply with LaLiga's financial rules in order to make signingsManchester United were previously linked with a move for the Dutch star Barcelona are set to ask midfielder Frenkie de Jong to take another pay cut this summer, according to reports in Spain.",
        "The Dutch international has been heavily linked with a move away from the Camp Nou in the past, with the club struggling to meet Financial Fair Play rules.It has now been revealed by Mundo Deportivo that De Jong is set to be asked to reduce his wages to comply with the financial rules.The report states that Barcelona will put forward a proposal to Marc ter Stegen and De Jong to see them net two or three-year extensions.However, this would see their salary lowered at the start of each year, but ensure that the longer contract would mean more money for the duo. ",
        "While there has already been some contact, Barcelona are awaiting La Liga's sentencing to address the situation with their players.They are also set to renegotiate the contract of Ousmane Dembele, whose deal is set to expire in 2024.It was previously reported that Barcelona must raise £178million in order to comply with Financial Fair Play rules, and that sales could happen this summer. Ferran Torres and Raphinha have been linked with departures, and with De Jong being a long-term target for Manchester United, the latest news could hand Erik ten Hag's side a boost.However, the Dutch midfield maestro was previously named as one of Barcelona's three 'untouchable' players for the summer transfer window.",
        "It remains to be seen as to whether the latest news would change this. De Jong previously rejected claims that he took a 'three-year pay-cut' to remain at Barcelona, with it unclear as to whether he would take one in the summer. United will no doubt look to add to their midfield numbers, and could turn to De Jong if they are given any encouragement for a bid. "
    ]
}