{
    "articleURL": "/wires/aap/article-12058219/Electric-vehicle-ad-campaign-claps-ex-PMs-jibe.html",
    "content": [
        "The push for one million electric vehicles on Australian roads by 2027 has received a boost from a tongue-in-cheek advertising campaign poking fun at comments by the former prime minister.",
        "The Electric Vehicle Council launched its campaign on television and online on Monday, showcasing a range of zero-emission vehicles, including the country's first electric ute.The advertisement also mocks comments by former prime minister Scott Morrison in 2019 that electric vehicles would \"end the weekend\".The new ads come at a pivotal time for electric vehicle policy in Australia, with less than four weeks left to debate a fuel-efficiency standard that could encourage car makers to bring more low and zero-emission cars into the country.The campaign also launches a week after an executive from Australia's most popular car brand, Toyota, told AAP it was \"too early\" for some Australian drivers to transition to electric vehicles.Electric Vehicle Council chief executive Behyad Jafari said the campaign was designed to promote the benefits of driving an electric car, including better air quality, lower energy costs, and reduced pollution.\"The ads call on Australians to get behind the push to have a million EVs on Australian roads by 2027, which coincides with the federal government's plan to introduce strong fuel-efficiency standards,\" he said.\"We need to incentivise car makers to make their best range of EVs available to Australians so that Australian consumers have the same choice as drivers in the United States or Europe.\"",
        "The \"My next car will\" video shows some of the high-powered electric vehicles available in Australia from brands including Tesla, Hyundai, Porsche and LDV, along with a promise the vehicles will \"transform the weekend\".The video also shows two couples camping, with a morose woman commenting to her partner, \"Hey Scotty, I thought you said these EVs were going to ruin the weekend\".Her comment alludes to a statement from former prime minister Scott Morrison in April 2019, who said electric vehicles would not tow trailers, boats or \"get you out to your favourite camping spot\".\"Bill Shorten wants to end the weekend when it comes to his policy on electric vehicles where you've got Australians who love being out there in their four-wheel drives,\" Mr Morrison said during the election campaign.Despite his comments, and a comparatively slow adoption of the technology in Australia, electric vehicles made up eight per cent of new car sales in April, up from 3.8 per cent last year.Two electric cars from Tesla, the Model Y and Model 3, also ranked among the top 10 most popular vehicles during the month.The federal government launched its National Electric Vehicle Strategy on April 19, including a commitment to introduce a fuel-efficiency standard to put a limit on carbon emissions from car maker's fleets to encourage them to import more low-emission vehicles.",
        "Public consultation on the standard will remain open until May 31, with a draft of the law expected before the end of the year."
    ]
}