{
    "articleURL": "/tvshowbiz/article-12046913/Jessica-Goicoechea-shows-rock-hard-abs-khaki-bikini.html",
    "content": [
        "She recently showcased her jaw-dropping figure while holidaying in Andorra.",
        "And Jessica Goicoechea put her sizzling frame on display once again in her latest drop of Instagram snaps, which she shared to her page on Thursday.The model, 26, who is currently dating Spanish footballer Marc Bartra, 32, sent temperatures soaring as she lay in a dandelion-covered meadow.The WAG was showing off her washboard abs in a tiny khaki bikini, which she styled with camouflage print trousers, Nike trainers and sunglasses.Clearly appreciative of her new photos, Barca commented: 'Preciousness.' ",
        "Jessica wore her bright blonde locks slicked back into a sleek ponytail and completed the look with a pair of earrings and a chain necklace.She later slipped out of the cargo pants to reveal her peachy behind in a matching thong-style bikini, while making her way towards a river.Other snaps included in Jessica's dump were of her enjoying an editing session on some campaign pictures, as she looked over the photos with a photographer. It comes days after Jessica barely contained her ample cleavage in a skimpy green bikini while relaxing in Andorra.She showed off her toned physique in a series of Instagram snaps, which she posted on Monday.Jessica proudly displayed her slim frame and washboard abs in the two-piece swimwear set, as she sipped on coffee.The blonde beauty was make-up free for her time in the sunshine and tied her tresses up away from her flawless visage. ",
        "Jessica wore an eye-catching gold belly chain, which drew attention to her thin waist, while she further accessorised with delicate gold hoop earrings and chunky statement ringsHer latest Instagram post comes after Jessica posed topless in a thong bikini during her Maldives holiday.The WAG took to Instagram where she uploaded a slew of sexy photos of herself, with her former Barcelona ace boyfriend leaving a cheeky comment.Model Jessica looked sensational in the sizzling snaps, parading her washboard abs and ample cleavage as she relaxed in the sunshine.",
        "Footballer Marc couldn't resist writing beneath the revealing social media post, suggesting he could be a glamour photographer after taking the shots.He tagged a glamour photographer and offered his services as he wrote: '@pepeherreros @goi need someone to help you with the next @joan6six6shoot ?? I'm in.'Jessica jokingly added: 'We urgently need your help.'Marc is a Spanish footballer who now plays as a centre-back for Trabzonspor and the Catalonia national team.He was signed to Barcelona FC from 2010-2016 before spells with Borussia Dortmund and then Real Betis.",
        "He was previously married to journalist Melissa Jimenez from 2017 to 2022, after they first started dating in 2014.Melissa made a name for herself covering motorbike racing for Sky Italia.",
        "The exes share three young children: Gala, seven, April, four, and Max, three.The footballer went public with his new girlfriend Jessica in November 2021, months after his split from ex-wife Melissa."
    ]
}