{
    "articleURL": "/wires/reuters/article-12060365/Home-teams-hold-serve-76ers-Celtics-return-Boston.html",
    "content": [
        "The Boston Celtics will look to regain control of their Eastern Conference semifinal playoff series when they face the visiting Philadelphia 76ers in a pivotal Game 5 on Tuesday night.",
        "The 76ers evened the series 2-2 with a 116-115 victory in overtime on Sunday in Philadelphia. James Harden scored a game-high 42 points, including a go-ahead 3-pointer with 19.0 seconds left in overtime. He also made a jump shot that tied the game with 16.1 seconds left in the fourth quarter.In addition to leading his team in scoring, Harden had eight rebounds and nine assists.Third-seeded Philadelphia won despite trailing by five points following a Malcom Brogdon 3-pointer with 2:04 remaining in regulation.\"Quite frankly, today was a do-or-die for us,\" Harden said. \"We found a way to win, and that's all that matters in the postseason.\"Harden poured in 45 points during Philadelphia's 119-115 victory in Game 1 -- when a sprained knee prevented Joel Embiid from playing -- but shot a combined 5-for-28 from the field in Games 2 and 3.\"That's what (Harden) needs to do every night,\" said Embiid, who finished Game 4 with 34 points, 13 rebounds and four assists in 46 minutes. \"It's not about taking a lot of shots. It's just about being aggressive, attacking the rim, finding guys and he was fantastic tonight.\"Boston allowed 92 points in the first three quarters of Sunday's loss but limited Philadelphia to 15 points in the fourth, when the 76ers shot 31.6 percent from the field. That helped the second-seeded Celtics erase a 16-point, third-quarter deficit.",
        "Despite the loss, Boston's Al Horford took a glass half-full approach after the game.\"Just the way we responded in that fourth quarter I thought was great,\" Horford said. \"Our focus. Our will. I know that everybody's feeling down (because) we lost the game and things like that (but) I'm pretty encouraged by our group. I saw something. I saw some growth in our group. Things we haven't been able to do all year and be able to do them tonight on this type of stage.\"Jayson Tatum had 24 points, six assists, four blocks and a playoff career-high 18 rebounds to lead the Celtics. Jaylen Brown finished with 23 points but was limited to three field goal attempts in the fourth quarter, as was Tatum.\"I guess I've got to demand the ball a little bit more,\" Brown said. \"I thought good things happened when I had it in my hands. I thought our offense was OK. We chipped away, we made big-time shots, we got great looks all game long. We just came up short in the end.\"Game 6 will be played Thursday in Philadelphia, and, if needed, Game 7 will be in Boston on Sunday. The team that advances will play either the Miami Heat or the New York Knicks in the Eastern Conference final.",
        "\"Our goal is to go to Boston and win,\" Embiid said. \"I'll be better. We just got to go out and find a win and come back here up 3-2.\"--Field Level Media"
    ]
}