{
    "articleURL": "/femail/article-12051459/Nip-Fab-acne-banishing-retinol-treatment.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information.   ",
        "Ninety-six per cent of shoppers agree that the new Nip+Fab Retinol Fix Blemish Treatment is the best blemish product they have ever used, raving about how it improves active blemishes and helps to fade old acne scars. The £14.95 clinically proven blemish treatment has delivered remarkable before and after's thanks to the 10 per cent time-release retinol complex that helps deliver serious results. And it works in just four weeks.  Nip+Fab Retinol Fix Blemish Treatment  Struggling with spots or can't shift the post-red scarring from old spots?Nip + Fab have harnessed the power of a 10% time-release retinol complex with 0.1% encapsulated pure retinol, to bring you a clinically-proven spot treatment gel which deeply penetrates skin overnight and targets blemishes, dark spots and pore size.  £14.95 (save £5) Shop",
        "Post-inflammatory hyperpigmentation marks (the red or brown marks that are left behind after a spot) can often be as frustrating as spots themselves, taking a frustratingly long time to fade. Using a product that's loaded with cell-communicating ingredients can help increase the cell turnover, helping to improve uneven skin tone and red marks.Enter the Retinol Fix Blemish Gel; a revolutionary spot treatment gel that has a 10 per cent time-release retinol complex to deeply penetrate skin overnight and target blemishes, dark spots and pore size.Delivering noticeable results in just four weeks, the Nip + Fab Retinol Fix Blemish Gel is a real confidence booster for those struggling with their skin. ",
        "Used in the evenings straight after cleansing and applied directly to blemish-prone areas, the gel is a proven way to target blemishes and dark spots. The fast-acting gel is formulated with salicylic acid and tranexamic acid to help improve the appearance of active blemishes, fade dark spots for an overall more even-toned complexion.The Blemish Gel is also made with niacinamide to help reduce the appearance of pores and a 0.1 per cent encapsulated pure retinol for a controlled and deeper release. ",
        "When used daily in the evenings over a period of four weeks, users of the Nip + Fab Retinol Fix Blemish Gel noticed noticeable improvements in the look of their skin. The clinical trials showed that 90 per cent of blemishes had completely healed, 100 per cent of users agreed that skin looked less congested while 96 per cent agreed any remaining scarring from previous blemishes appears reduced.Currently on sale for £14.95 (was £19.95), it's a brilliant time to try the blemish solution for yourself and reap the results in four short weeks. "
    ]
}