{
    "articleURL": "/wires/pa/article-12046353/Trump-cutting-Ireland-trip-short-confront-accuser-New-York-case.html",
    "content": [
        "Former US president Donald Trump said he cut his trip to Ireland short so he could return to “confront” his accuser in a New York civil rape case, which he described as a “political attack”.",
        "Mr Trump departed Shannon Airport at approximately 5.30pm on Thursday after arriving in Ireland one day earlier.He said he would “probably attend” the civil hearing as he spoke to reporters while golfing at his resort outside the village of Doonbeg, Co Clare.His visit to Scotland and Ireland coincided with the second week of a civil trial in Manhattan over accusations, denied by Mr Trump, that he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.",
        "Speaking to reporters before departure, Mr Trump said he had been “falsely accused”.“I’m going back to New York. I was falsely accused by this woman, I have no idea who she is – it’s ridiculous,” he said.He said he was cutting his trip to Ireland short because of the trial.“I’ll be going back early because a woman made a claim that is totally false, it’s fake.”He said his accuser is a Democrat and the judge is a “rough judge”.",
        "“He doesn’t like me very much, he was appointed by Bill Clinton,” he said.He added: “It’s a disgrace but we have to do it, it’s a part of life.“It’s a fake claim like all the other claims, just like ‘Russia Russia Russia’.”He said it is a “political scam”.",
        "“Because of that, I have to leave Ireland and I have to leave Scotland where I have great properties, I have to leave early.“I don’t have to but I choose to.” It's called false accusations against a rich guy. Or in my case, against a famous, rich and political person that is leading the polls by 40 points  Former US president Donald Trump  He added: “It’s a disgrace that this is allowed to happen.“It’s called false accusations against a rich guy. Or in my case, against a famous, rich and political person that is leading the polls by 40 points.“I have to go back for a woman that made a false accusation about me and I have a judge that is extremely hostile.”Mr Trump said he is going to “go back and confront this woman”.He said the rape accusations against him are politically motivated.“This is a political attack. This is the only way they think they can win the election because (Joe) Biden is losing,” he said.“He’s down by 11 – and my republican opponent is down by 45 – he’s disappeared.”"
    ]
}