{
    "articleURL": "/tvshowbiz/article-12061501/Amy-Hart-terrifying-hospital-dash-boyfriend-Sam-Rason-involved-horrific-accident.html",
    "content": [
        "Amy Hart took to her Instagram Stories to reveal boyfriend Sam Rason had been rushed to hopsital on Monday.",
        "The Love Island star, 30, who welcomed son Stanley with her beau in March, said he had 'sliced his head open' after hitting it on a gate. Amy explained she had been enjoying the Bank Holiday before the couple were forced to find a babysitter and race off to seek treated at Worthing Hospital.Penning: 'I was halfway through cooking a bank holiday tapas extravaganza for us...Stanley was asleep, Sam was sorting some stuff for the tip...'When he came in and said he'd sliced his head open on the gate.",
        "'My parents are still away so luckily my auntie sprung into action and to come and sit with Stanley, so we're here for the next however many hours.'She then shared an update with her fans as she filmed a short video from the waiting room. Make-up free with her hair scraped back she said: 'When we had to leave I was in my pyjamas with a mask on my hair, so I look horrendous.'We got moved from A&amp;E to the urgent treatment centre - I think Sam is just about to go into see someone.'He's good, he's just got a massive gash on his head basically, I've enjoyed moving it around.'Luckily Sam was treated and sent home with Amy later sharing a snap of him cuddling up with their son on the sofa.",
        "Captioning the picture: 'Home now with a glued head.' It comes after Amy showcased her incredible post-baby figure on Friday, just two months after giving birth.",
        "She looked full of confidence as she slipped into a flattering black swimsuit as she tried on a number of outfits ahead of jetting off on holiday.The reality star took to her Instagram stories where she filmed herself in the mirror while packing a number of clothes for her trip.Her blonde locks were piled atop her head with a pair of sunglasses while she stood in her kitchen.Speaking to the camera, she said: 'I’m just packing so I thought I’d try this on to show... This is the black swimming costume and I got a size 14, so I think it’s the right size for me.'It’s a bit booby so it’s still a little bit sexy. I like it.'She added: 'It's actually stretchier than the bikini so I think if you're in between sizes you can  go for your normal size rather than sizing up.'",
        "It comes after Amy was praised last month for her candid approach to post-baby dressing after sharing an outfit try-on Instagram post. The reality star took to Instagram in April to share an insight into her postpartum wardrobe choices - with incredible candour about less flattering options. ",
        "One outfit in particularly drew both laughs and praise from fans as Amy tried on a white playsuit which she struggled to button up - yet still shared a clip of the undone one-piece with the buttons straining across her torso. In the caption on the shot, Amy penned: 'First one back clearly not as confident as I was but it’s a work in progress! Sam will not be able to resist me in outfit 3. links and explanations on stories! #zara #zarahaul #keepordelete #zarafashion #springfashion.'Fans wrote underneath: 'Thank you for including number 3 and keeping it real! Love number 2 on you... You look amazing Amy! I love that you included the 3rd one. We all have those moments! The second dress is so lovely x... "
    ]
}