{
    "articleURL": "/money/markets/article-12046019/Virgin-Money-profit-falls-25-lender-sets-aside-cash-bad-loans.html",
    "content": [
        "Pre-tax profit fell 25% to £236m; bad loans provisions jumped six-fold to £144mRevenues up 10% to £933m thanks to higher interest rates Overall customer deposits rose 2.6% to £67bn; net interest margins also higherVirgin Money's half year profits fell by a quarter after the lender set aside significantly more cash to cover potential losses from customers defaulting on loans.",
        "The challenger bank said that, although the number of customers in financial distress remained 'low', it expected the number of borrowers falling behind with credit card and mortgage repayments to increase in the coming months. It reported a 25 per cent fall in pre-tax profit to £236million for the six months to the end of March, despite revenues rising 10 per cent to £933million thanks to higher interest rates.",
        "Provisions for loans that may never be repaid jumped six-fold to £144million, from £21million in the same period a year ago, with the lender flagging a 'modest' increase in arrears in credit cards during the six months.'Recent rate rises and ongoing inflationary impacts have seen affordability tighten for many UK businesses and individuals', chief executive David Duffy said.'Pleasingly for now, the number of customers in financial distress remains low, but we continue to expect arrears numbers to increase as the credit cycle normalises.'Virgin Money shares tumbled 4 per cent to 147p in late trade on Thursday. They have lost almost a fifth of their value over the last 12 months, having been hit by fears of contagion across the banking system after the collapse of Silicon Valley Bank and the emergency rescue of Credit Suisse by UBS.As Britons are faced with a cost of living squeeze amid higher mortgage rates and sky-high inflation, banks are preparing for potential loan defaults. ",
        "However, lenders are also benefiting from higher interest rates, as they are profiting on the gap between what they charge on lending and pay out on deposits.Virgin Money's net interest margins increased to 1.9 per cent, from 1.8 per cent last year, helping net interest income rise 9 per cent to £855million.Unlike NatWest, which reported a jump in customers withdrawing money last week, Virgin Money said that overall deposits increased 2.6 per cent to £67billion.'More people are choosing to bank with Virgin Money,' Duffy said.'While the past six months have seen turbulence in the economy and in the financial system, we have continued to focus on our target areas, growing customer numbers and deposits thanks to our new and existing digital products.'As the UK economy stabilises in the months ahead, we have a high degree of confidence in our long-term plans.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}