{
    "articleURL": "/news/article-12056063/Map-reveals-location-3-200-Big-Lunches-thrown-today-honour-King-Charles-Coronation.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today  An interactive map has revealed the location of more than 3,200 lunch parties taking place today in celebration of King Charles's Coronation. ",
        "Thousands of people across the country will come together to honour Charles's crowning in their communities. The most northerly events are taking place in the Shetland Islands, whilst the most southerly are on the Isles of Scilly. The gatherings are overseen by the Eden Project, which is an educational charity and visitor attraction based in Cornwall. A map on the Eden Project's website shows there are 3,203 lunches planned today in the UK, whilst others are taking place in Germany, Canada, the United States, Australia, New Zealand and South Africa. Click here to use the Eden Project tool to find a Coronation Big Lunch near you ",
        "A palace spokeswoman said big lunches will take place until Monday 'in a nationwide act of celebration and friendship'.Members of the public and organisers from a number of charities have expressed enthusiasm ahead of the official Coronation Big Lunch.  Members of the public and organisers from a number of charities have expressed their enthusiasm ahead of the event.Lucinda Spelman-Ives, from Wilstock, who raised over £1 million to fund a community hub, hopes the Big Lunch will 'unify and bring everyone together being part of history, making amazing memories, laughing and meeting lots of people who have never met before'.'Everyone is bursting with pride after yesterday's ceremony,' she told the PA news agency.",
        "'This will be a very special memory for us all.'Long live the Big Lunches and long live the King.'Kate Welch, chairwoman of Acumen Community Buildings at The Old Rectory in Sunderland, and part of one of the biggest parties in the North East said: 'The coronation badge is shining from our building, we've made lots of red, white, and blue chains with bunting and flags out in force.'We expect 4,000 people to join us tomorrow for Houghton-le-Spring's Coronation Big Lunch and the whole town is buzzing with excitement.'Emily Connally, who leads the Cherwell Collective in Oxford, an organisation inspiring people to live more sustainably, is 'thrilled' to be part of the Big Lunch.Ms Connally and her team, who are 'buzzing with excitement' will serve dishes using locally sourced ingredients.",
        "'We're especially thrilled because of [Charles's] climate legacy, as our work tries to set an example of sustainable celebration,' she said.'We've laid tables using only surplus decorations including cut flowers.'We're cooking food for an expected 500 people using only surplus and food we grow within one mile.'We're even doing our take on the official Big Lunch dish.'Big Lunches take place across the UK every year with more than one million held since 2009. Last year the events raised more than £22million for local charities.",
        "On Sunday, the Duke and Duchess of Edinburgh will attend a big lunch in Cranleigh, the Princess Royal and Vice Admiral Sir Tim Laurence will visit a community street party in Swindon, and Princess Beatrice and Princess Eugenie will join a big lunch in Windsor.Buckingham Palace said the Big Help Out on Monday will 'highlight the positive impact volunteering has on communities across the nation'.A palace spokesperson said: 'In tribute to the King's public service, it will encourage people to try volunteering, and join the work being undertaken to support their local areas.'The aim of Big Help Out is to create a lasting volunteering legacy from the coronation weekend.'The palace spokesperson said that, according to the latest polling, an estimated 6.5 million people say they are planning to take part in the Big Help Out, ranging from community litter picks to signing up to longer-term volunteering opportunities with a wide range of charities.The palace said that while 'wholly supportive' of the Big Help Out initiatives on Monday, Charles and Camilla will not be attending any of the events in person.",
        "Many people at the big lunches will be enjoying the special 'Coronation Quiche' using a recipe released last month by the King and Queen. It features spinach, broad beans and tarragon.",
        "For the late Queen Elizabeth II's coronation in 1953, Coronation Chicken – cold chicken in a curry cream sauce with a well-seasoned dressed salad of rice, green peas and mixed herbs – was invented to feed the foreign guests who were entertained at Buckingham Palace after the ceremony.The new recipe is by royal head chef Mark Flanagan and was chosen by Charles and Camilla in collaboration with him.Former Buckingham Palace chef Darren McGrady said the King's choice came as no surprise because Charles loves anything with eggs and cheese.Buckingham Palace said the quiche was chosen because it worked as a sharing dish, can be served hot or cold, suits a wide variety of dietary requirements and can be easily adapted to suit different tastes.",
        "The Palace also said it tasted delicious and had the benefit of not being too complicated and not requiring costly or hard-to-source ingredients.Quiche is known as a classic French dish, but is said have actually originated in Germany in the Middle Ages with the word quiche from the German kuchen, meaning cake.A statement on the Eden Project website said: 'As events go, they don't come much bigger than the crowning of a new monarch.'We're excited to be part of the official celebrations and we'd love for people across the UK (and the world!) to hold a Coronation Big Lunch to celebrate.'"
    ]
}