{
    "articleURL": "/wires/ap/article-12055593/British-star-Ainslie-makes-bid-SailGPs-1M-Grand-Final.html",
    "content": [
        "British sailing star Sir Ben Ainslie strengthened his chances of reaching the $1 million, winner-take-all Grand Final of SailGP's third season with finishes of second, first and second in the San Francisco regatta on Saturday.",
        "Ainslie's Emirates Great Britain team came into the regatta in fourth place in the season standings, one point behind France's Quentin Delapierre, who was constantly outmaneuvered by the British skipper and had finishes of sixth, eighth and sixth in the nine-boat fleet of foiling 50-foot catamarans.The top three crews after Sunday's final two fleet races will advance to the Grand Final of tech tycoon Larry Ellison's global league.Two-time defending champion Tom Slingsby of Team Australia is the only skipper who has qualified for the Grand Final based on season standings. Peter Burling and Team New Zealand are in good shape in second place.Slingsby, looking to both win the San Francisco regatta and build confidence for his third straight Grand Final, took the lead with 28 points. He had finishes of first, third and first while steering his Flying Roo - nicknamed for the giant yellow kangaroo on the wingsail - up and down along the cityfront between the Golden Gate Bridge and Alcatraz Island.Ainslie is second, also with 28 points, and Burling third with 19 points after finishes of fourth, seventh and third. Burling, the two-time reigning America's Cup champion helmsman, needs to finish no lower than fifth in the San Francisco regatta to claim a spot in the Grand Final.",
        "France sits in eighth with 13 points.\"We were not on a good level today,\" Delapierre said.Ainslie, a master at comebacks during his brilliant career, relentlessly put pressure on the French crew by blocking it during pre-starts and forcing their catamaran to fall off its foils.\"That was a scenario we were expecting,\" Delapierre said.\"The team is working hard on executing the maneuvers,\" Ainslie said. \"We had a wobble in the first race, a cleaner one in the second so we´ve just got to keep trying to do that and put pressure on the French.\"Ainslie is the most-decorated sailor in Olympic history, having won four gold medals and one silver. He also was crewmates with Slingsby aboard the Ellison-owned Oracle Team USA, which successfully defended the America's Cup in 2013 with a comeback against Emirates Team New Zealand on San Francisco Bay. Ainslie's SailGP strategist, Hannah Mills, is the most successful woman Olympic sailor of all time with two golds and a silver.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}