{
    "articleURL": "/wires/pa/article-12039207/A-complete-surprise--Bear-scares-principal-jumping-bin-US-school.html",
    "content": [
        "The principal at a primary school in West Virginia was given a shock when a bear leapt out of the bin he was unlocking.",
        "James Marsh, 58, head of Zela Elementary School, ran for his life when a sizeable bear emerged from the bin he was standing by at around 7.15am on Monday.",
        "Mr Marsh can be seen in the video unlocking the bin before a bear pokes its head out from under the lid, with the principal running one way while the bear leaps out and scarpers in the opposite direction.“It was not how I planned to start my week at all!” Mr Marsh told the PA news agency.“Apparently he came in over the weekend and unknown to me had climbed in there.",
        "“I was unlocking the bar so we could put trash in the dumpster for the day and I just never dreamed that there would be anything inside it, especially with it locked.“So, as you can tell, it was a complete surprise. It was amazing that I never heard anything, there was no noise inside, I had several staff members that had come to work that morning and walked right beside the dumpster on the way into the building.“All of a sudden it let out a big growl and came out of there, and it scared me!”Mr Marsh said a bear had visited in the night around a week before, prompting the school to install a lock bar on the bin to protect it.",
        "The bear was undeterred though. Having checked surveillance video after his ursine encounter, Mr Marsh confirmed it had bent the metal bar enough to squeeze in and out several times over the weekend.West Virginia Department of Natural Resources has since modified the lid to make it more secure.“I showed (the video) to my students at lunchtime, we put it on the big television and they watched it and they just laughed and laughed and laughed,” said Mr Marsh.“I love wildlife, I love animals, but I would rather they not be that close.”"
    ]
}