{
    "articleURL": "/wires/pa/article-12038325/Carlos-Alcaraz-eases-past-Alexander-Zverev-Madrid-Open.html",
    "content": [
        "Carlos Alcaraz cruised to victory over Alexander Zverev in a rematch of last year’s Madrid Open final.",
        "Zverev is still trying to rediscover his best form after suffering a serious ankle injury at the French Open last summer and this time he was no match for the young Spaniard, who claimed a 6-1 6-2 victory to reach the quarter-finals at the Caja Magica.Alcaraz, bidding for back-to-back titles after winning in Barcelona last week, dominated from the start and Zverev could find no answers, with his forehand particularly wayward.Alcaraz, who turns 20 on Friday, said in an on-court interview: “For me it’s amazing to play the level that I played today.“It’s been a question mark for me – this result isn’t normal. I played great, I feel really good right now and this match gives me a lot of confidence.”There were two shocks in all-Russian contests, with Daniil Medvedev losing to Aslan Karatsev and Karen Khachanov beating Andrey Rublev.Second seed Medvedev complained about the lack of space behind the baseline on the Arantxa Sanchez Stadium during a 7-6 (1) 6-4 loss to qualifier Karatsev, who plummeted down the rankings last year after his remarkable 2021 breakthrough, where he reached the Australian Open semi-finals.This was a brilliant display of power hitting from Karatsev, who will return to the top 100 next week.Fifth seed Rublev has been enjoying an excellent season, winning his first Masters 1000 tournament in Monte-Carlo last month, but he was edged out 7-6 (8) 6-4 by doubles partner Khachanov.",
        "“I hope he will play with me tomorrow,” said Khachanov, who now faces Alcaraz in singles. “This match is over, we need to have some time maybe to absorb it, for him.“It was the same in Monte-Carlo, he beat me. Life goes on, he’s doing well this year, I’m doing well.”Zhang Zhizhen made history by becoming the first Chinese player to reach an ATP Masters 1000 quarter-final.The 26-year-old saved three match points to beat eighth seed Taylor Fritz 3-6 7-6 (5) 7-6 (8) to set up a last-eight meeting with Karatsev."
    ]
}