{
    "articleURL": "/news/article-12040909/Paracetamol-changes-Australia-max-number-Panadol-Panamax-pills-lowered.html",
    "content": [
        "Maximum pills in paracetamol packs to be loweredNon-chemist packages dropping from 20 to 16 pills Customers may be limited to one or two per personAustralians will not be allowed to buy as many paracetamol pills in one go under sweeping new changes. ",
        "The Therapeutic Goods Administration announced on Wednesday that they will lower the maximum amount of pills within a package of paracetamol-based medicines such a Panadol, Panamax or Chemists' Own. For over-the-counter boxes of paracetamol, the maximum amount of pills will be dropped from 20 to 16.For packs of paracetamol that are bought in a pharmacist, the maximum amount will be brought down from 100 to 50, any more will need to be purchased under a chemist's supervision.",
        "Individual paracetamol packages in liquid and powder form will also be reduced.'Access to liquid, modified-release and Schedule 4 (Prescription Only) paracetamol is not affected by this decision,' a release from the TGA reads.The decision came after consultation from February to March to change the scheduling of paracetamol in the Poisons Standard.'The final decision carefully considered the feedback and balances the need for some restrictions to pack sizes while ensuring continued access to larger packs for those people who need regular pain relief,' the statement reads. The changes will come into effect from February 1, 2025, in an attempt to curb paracetamol overdose across the nation.",
        "'Each year in Australia around 225 people are hospitalised and 50 Australians die from paracetamol overdose,' the media release reads.'Rates of intentional overdose highest among adolescents and young adults.  ",
        "'To further minimise the harm from paracetamol overdose, the TGA is encouraging retailers such as supermarkets to restrict sales to a single pack at a time.'They also advised households not to stockpile paracetamol products to help reduce the risk of overdoses.For confidential support call the Lifeline 24-hour crisis support on 13 11 14. "
    ]
}