{
    "articleURL": "/wires/reuters/article-12043019/Brazil-forest-bill-aims-unlock-carbon-credit-market.html",
    "content": [
        "Forest concessions allowed to generate carbon credits",
        "Bill seen as step to regulate voluntary carbon marketAmazon carbon projects face scrutiny over land rightsBy Fabio Teixeira and Andre Cabette FabioRIO DE JANEIRO, May 3 (Thomson Reuters Foundation) - C ompanies with Brazilian forest concessions would be allowed to generate carbon credits under a bill passed by Congress this week that marks a \"first step\" in regulating the country's voluntary carbon market.Private firms have shown little interest in a government program that leases publicly owned forests for sustainable logging, but the legislation could boost the concessions' appeal with investors by generating an additional revenue stream.\"This is an economic activity that will boost others that can be done in forestry concessions,\" said Jacqueline Ferreira, a portfolio manager at Instituto Escolhas, a environmental nonprofit involved in consultations on the bill.President Luiz Inacio Lula da Silva, who now must sign or veto parts or all of the bill within 15 days, has made reining in deforestation a priority as he seeks to reverse the policies of his right-wing predecessor, Jair Bolsonaro.Forest leased to private firms in Brazil can only be used for logging under a sustainable system that allows the land to regenerate.Set up in 2006, the leasing program has had limited success, data shows, with only about 1 million hectares of Brazil's 43 million hectares of eligible public forest currently leased.",
        "REVENUE BOOSTStudying a typical concession in the Amazon state of Rondonia, Escolhas estimated that carbon credit sales could boost its revenue by 43%.A wider study by the nonprofit of 37 areas that could be leased in the Amazon region estimated that they could generate about $24 million per year from carbon credits in total.\"This was very conservative math, based on carbon credit prices below the (current) market price,\" Ferreira said. She noted that further regulation would be needed to detail the mechanism for generating carbon credits.She said it would likely take at least a year for the first concessions to be leased that include the ability to issue carbon credits.The current number of carbon credit projects in Brazil are \"small in comparison to the unique potential of the country's forested area\", said Daniel Vargas, coordinator of the Bioeconomy Observatory within Brazil's FGV university.The bill, however, comes as carbon credits generated by forestry projects in the Amazon region and elsewhere face scrutiny due to land rights issues and a lack of benefits for local communities.\"A growing body of research indicates that no real additional protection is being offered by many of the (carbon credit) projects,\" said Eugenio Pantoja, a director at IPAM, a nonprofit that works on sustainability in the Amazon.",
        "The voluntary carbon credit market in Brazil is still unregulated, and while the new bill is a step in that direction, broader legislation will be needed, Pantoja said.The bill should make concessions more profitable, but a major hurdle for legal logging is stiff competition from illegal, deforested timber, said Suely Araujo, senior expert in public policy at Brazil's Climate Observatory.\"What is truly hindering (forest concessions) is their difficulty in competing with crime,\" Araujo said. (Reporting by Fabio Teixeira @ffctt; Editing by Helen Popper. The Thomson Reuters Foundation is the charitable arm of Thomson Reuters. Visit https://www.context.news/)"
    ]
}