{
    "articleURL": "/tvshowbiz/article-12049931/Coronation-Street-star-Sue-Cleavers-stars-marvel-EPIC-weight-loss.html",
    "content": [
        "Coronation Street star Sue Cleaver's co-stars have been left in shock at her incredible weight loss as they commented on a slew of her stunning snaps. ",
        "On Wednesday, Sue, 59, who has appeared on the ITV soap for 23 years, showcased her svelte frame in a stylish new snap in which she wore a chic pink suit leaving fans gushing that she looked '20 years younger'.Alongside a number of her 143k Instagram followers, fellow actors including Ryan Thomas, Catherine Tyldesley and Jane Danson gushed over her new look. In recent months, she has been posting images showing off her newly-slimmed down frame and all her posts have been met with adoring responses. Brooke Vincent, who played Sophie Webster in the show, penned: 'SUE YOU LOOK AMAZING'. She posted on a later snap writing: 'SUEEEE' with heart eye emojis.",
        "Ryan Thomas meanwhile, who starred as her on-screen son Jason Grimshaw, simply penned a heart emoji under the snap. Tony Maudsley, who plays George Shuttleworth in the soap, wrote: 'George's pink lady'.Jane Danson, who stars as Leanne Battersby penned: 'you look fabulous Sue !', while Sally Carman, who plays Abi Franklin, wrote: 'You look [series of flame emojis]'.Catherine Tyldesley, who plays Eva Price, wrote: 'You look incredible'.In the image posted on Wednesday, she paired her stylish pink suit with a black top and some white trainers, while she wore her blonde tresses in a stylish pixie cut. Her Instagram followers were loving the snap as one even commented: 'I'm currently watching you on episodes of Corrie from 20 years ago... you look younger now!'",
        "Another said: 'Looking fabulous darling! X', while a third wrote: 'The weight loss you look amazing!'It comes after back in February Sue insisted she's 'not obsessed over diets' as she reflected on the unfair expectations placed on women as she covered March's Prima.The actress displayed her slimmed-down figure in a glamorous shoot to accompany the interview as she declared she would never promote any weight-related products as women have 'enough difficulties as it is'.It came after the week before the star - who admitted to shedding pounds in the I'm A Celeb jungle - showcased her jaw-dropping weight loss in an Instagram snap. ",
        "On not being embroiled in diet culture she told the publication: 'I lost some weight in the jungle, but I'm not obsessing over diets: life is hard enough! 'There's always going to be outside pressure and unfair expectations placed on women, but I refuse to get pulled into it. 'That's why I'll never promote anything weight-related, and it's why I'd always rather compliment somebody on their smile or their outfit, rather than their weight.'She continued: 'Let's just let women be women – we have enough difficulties and struggles as it is.'During the chat she also opened up about her stage of life as she nears her 60th birthday."
    ]
}