{
    "articleURL": "/sport/nba/article-12053171/Boston-Celtics-regain-home-court-win-Philadelphia-76ers.html",
    "content": [
        "Game 4 is once again in South Philadelphia, taking place Sunday at 3:30pm ET Joel Embiid cried tears of joy during his MVP ceremony alongside his young sonDailyMail.com provides all the latest international sports newsThe Boston Celtics played spoilers following Joel Embiid's MVP ceremony to take back home court with a 114-102 win in Game 3 of the Eastern Conference semifinals series.",
        "Boston silenced the Wells Fargo Center crowd with a well-balanced performance from its starters. Jayson Tatum headlined for the C's with 27 points, nine rebounds and five assists. Al Horford rubber-stamped his pregame proclamation of being an 'elite shooter' with five three-pointers (5-7) in a 17-point performance. Best of all, Boston's Grant Williams appeared to be fine after the 280-pound Embiid accidentally stepped on his head as the Celtics forward was diving for a loose ball. Not only did Williams return to the game, but he and the reigning NBA MVP exchanged pleasantries shortly afterwards, ensuring there were no hard feelings. Embiid led all 76ers with 30 points and 13 rebounds as James Harden largely struggled. Embiid was playing in just his second game since returning from injury – a sprained LCL in his right knee. Harden scored 16 points, going 3-14 FG and 2-7 from three-point range - in a drastic change to his Game 1 heroics without his 7-foot partner in crime. ",
        "Friday night was Embiid's first performance in front of Sixers fans since winning the NBA's MVP award on Wednesday. The native Cameroonian thanked fans during a pre-game address, which featured a cameo by his son, Arthur.Arthur Elijah De Paula Embiid adorably ran on to the floor before he was picked up by the six-time All-Star, after he had already began to cry. ",
        "The lovable pair were greeted with strong cheers with the noise only increasing once fans inside the Wells Fargo Center were given a close-up look at the Embiids. Chants of MVP also rung around the South Philadelphia arena. The Sixers managed to split the first two games in Boston, but were coming off a disastrous 121-87 Game 2 loss, in which the returning Embiid managed only 15 points and three rebounds in 27 minutes of action.Philadelphia made just 6 of 30 3-pointers for the game, while Boston made 20 of 51 from deep.It was a complete departure from Game 1, which the Sixers won, 119-115, without the injured Embiid. Not only did Philadelphia make 17 of 38 3-point attempts, including 7 of 14 by Harden, but the Sixers forced 16 turnovers while yielding only six.",
        "Friday night was a largely positive one for the Celtics however, who have now won back-to-back games to take a 2-1 lead in the series. Williams was tended to by team doctors after having his head accidentally stepped on by Embiid while fighting for a loose ball, but returned to the game and appeared to be fine. The Cameroonian made sure to check on his opponent with the two sharing a moment of sterling sportsmanship amid the battle for a spot in the Eastern Conference Finals. ",
        "Sunday's Game 4 presents Philadelphia with an opportunity to tie the series up at 2-2 before Game 5 in Boston on Tuesday. "
    ]
}