{
    "articleURL": "/wires/ap/article-12055699/Mays-watches-Cobb-Giants-beat-Brewers-92nd-birthday.html",
    "content": [
        "SAN FRANCISCO (AP) - Willie Mays was on hand as his 92nd birthday was celebrated, and Alex Cobb led the San Francisco Giants to a 4-1 victory on Saturday that stretched the Milwaukee Brewers´ losing streak to six.",
        "Thairo Estrada homered and rookie infielder Brett Wisely also connected for his first big league home run. Joey Bart added an RBI double.\"Thairo´s an animal,\" Cobb said. \"When I got here last year I didn´t really know too many guys and everybody would just rave about him. He´s definitely the heart and soul of the lineup right now.\"Milwaukee is on its longest losing streak since an eight-game skid from last June 3-11.Mays, who played for the Giants from 1951-72, briefly attended the game.Oracle Park public address announcer Renel Brooks-Moon led a rendition of \"Happy Birthday\" to the Hall of Famer in what has become an annual tradition.",
        "Mays left before the game ended.Cobb (2-1) allowed five hits in seven innings, struck out five and walked two, lowering his ERA to 2.01 in his first win over the Brewers since 2014.\"The only thing that kept him from being one of those top 10 pitchers in baseball (in 2022) was a few injuries,\" Giants manager Gabe Kapler said. \"He´s got a full arsenal that he can get in the zone with anytime. I find Alex to be as entertaining to watch as any pitcher around baseball because of his level of competitiveness.\"San Francisco has won four in a row as part of its roller-coaster start. The Giants won a season-high five straight from April 22-26 and lost its next four before the current winning run.",
        "Milwaukee loaded the bases with two outs in the fourth before Cobb got Owen Miller to ground out. Miller later drove in Milwaukee´s only run with an RBI single against John Brebbia in the ninth.Camilo Doval got two outs for his seventh save in eight chances.Colin Rea (0-3), seeking his first big league win since Aug. 30, 2020, allowed three runs and four hits in six innings and is winless in five starts this season.Estrada, who has been getting more playing time at shortstop in place of injured three-time All-Star Brandon Crawford, homered in the third. That added to an already impressive resume this season for the 27-year-old Estrada, who entered the day among the top 10 in the majors for hits, average and stolen bases.\"Just being patient, looking for good pitches and taking advantage when a pitcher makes a mistake,\" Estrada said through translator Erwin Higueros.Michael Conforto drew a two-out walk in the second and scored with a headfirst slide into home following Bart´s double down the third-base line. That snapped a 5-for-27 skid for the Giants catcher. LaMonte Wade Jr. singled in the third and scored on Estrada´s drive into the left-field stands.EJECTEDBrewers manager Craig Counsell was ejected in the sixth inning for arguing. Willy Adames singled leading off the inning and was initially awarded second base following a pickoff attempt by Cobb. Umpires conferred and Adames was sent back to first when Counsell came out of the dugout. The argument lasted for several moments before Counsell was tossed, and the Milwaukee skipper continued to protest after his ejection.",
        "\"They had two different numbers on the field. We were going on two disengagements, and a balk was called, and they changed the call,\" Counsell said. \"Their ruling was they took away the (first) disengagement because at some point after the disengagement they did a mound visit. In my eyes, it wasn´t related, and the first-base umpire didn´t see it that way. Apparently one of the umpires did, and that was enough to overturn the disengagement.\"HONORING MAYSAs part of Mays´ birthday, the Giants honored the next class of Willie Mays Scholars, a local program created to give additional educational opportunities for Black students in San Francisco. Three members of the first graduating class of Willie Mays scholars were also honored.TRAINER´S ROOMGiants: OF Bryce Johnson (concussion) is set to begin a rehab assignment with Triple-A Sacramento in the next few days, according to Kapler. Johnson has been on the injured list since April 13.UP NEXTGiants RHP Ross Stripling (0-1, 6.10 ERA) starts the series final Sunday at Oracle Park. Stripling has one win in three previous starts against Milwaukee.__ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}