{
    "articleURL": "/tvshowbiz/article-12050043/A-look-TV-cancelled-coverage-Kings-Coronation-weekend.html",
    "content": [
        "King Charles' Coronation is set to dominate the TV coverage this bank holiday weekend as our new monarch is officially crowned.",
        "Various channels will be doing live broadcasts of the proceedings while other special programmes will disrupt normal shows.The BBC will have most of its normal shows taken over by the Coronation - starting with BBC Breakfast.The popular morning show will only air from 6am until 7.30am on BBC One rather than instead of 6am-9am which is the normal running time. Special programme The Coronation of HM The King: The Preparation will then air from 7.30am with Kirsty Young at the helm.",
        "It will be followed by coverage of The Coronation of HM The King: The Coronation from 10.15am. The Coronation of HM The King: The Celebration will air from 1pm. It means Saturday Kitchen Live, Mary Berry: Love to Cook and Football Focus have all been cut this Saturday. Moving on to the evening Blankety Blank and Pointless Celebrities will be cut as another special programme The Coronation: A Day to Remember will air. BBC Two will air the exact same coverage as BBC One up until 3pm replacing it's normal line up of shows. In terms of ITV Good Morning Britain will air from 6am until 8.30am before the Coronation coverage begins.It means Oti Mabuse's Breakfast Show and James Martins Saturday Morning have been cut.The network's Coronation coverage continues until 3pm and the evening programmes will continue as normal.",
        "King Charles lll will officially be crowned as the the monarch on May 6 in an historic ceremony which will be broadcast around the world.It will be the first coronation since 1953 when the late Queen Elizabeth was crowned at Westminster Abbey and went on to reign for more than 70 years. King Charles, 74, ascended the throne in September 2022 when his mother died at the age of 96.The Coronation is set to showcase up to 15 working members of the Royal Family, including the Prince and Princess of Wales, as they ascend to the palace balcony for the day's events.And Britons up and down the country will no doubt be getting into the party spirit on the bank holiday weekend as they prepare to celebrate the reign of King Charles.The Coronation ceremony kicks off at 11am on May 6, with Their Majesties travelling roughly 1.3 miles in procession from Buckingham Palace to Westminster Abbey and back again.You can catch the Coronation in person from 6am at viewing areas along the procession, which are on both sides of The Mall and Whitehall - as well as at allocated screening sites."
    ]
}