{
    "articleURL": "/property/article-12047879/EPC-rating-lottery-Backlash-grows-new-rules-landlords.html",
    "content": [
        "Landlords face ban on letting homes with EPC ratings below C from 2028They are being threatened with fines of £30,000 if they ignore the rulesBut some say they have made 'improvements' which brought their rating DOWNWhat a straightforward idea: a piece of paper with coloured bars telling you how energy-efficient your home is, and suggesting ways in which you could improve it.",
        "Indeed, the Government has such faith in Energy Performance Certificates (EPCs) that it has proposed, in its latest Net Zero strategy, that landlords will be forbidden from letting properties from 2028 unless they achieve at least a C rating (there is an exemption if you can prove that it would cost more than £10,000 to bring a property up to C standard). Landlords have been threatened with fines of £30,000 if they ignore the rules. It is already illegal to let a property in the lowest two bands — F and G.We all want a warm home, and to do what we can to cut carbon emissions. So why are internet forums buzzing with so many landlords protesting at the Government's plans?",
        "There's Gary from Dorset who complains that his 1980s-built flat has only been given a D when other, identical flats in the same block have been given a C rating.Then there's Phil, who was told in his EPC to install cavity wall insulation in order to raise his property from a D to a C. But when he sought a quote, he was told by an insulation company that it couldn't be done — his house was too far from the road for the hose to stretch in order to pump in the foam.",
        "There are tales, too, of property owners who have spent a fortune on energy improvements only to find that their energy rating had gone down.David Simms, a landlord from Clapham, spent £10,000 on one property, installing insulation and replacing the gas boiler with electrical heating — surely something which ought to please the Government as it seeks to achieve net zero carbon emissions by 2050.&gt; Energy assessors speak out against the Government's 'unrealistic' eco requirements for landlords But the result? His property went down from a B to a D, meaning that from 2028 it can't be let.'Energy Performance Certificates are sound in principle,' says Ben Beadle, CEO of the National Residential Landlords' Association (NRLA).'But at the moment, they are not giving an accurate picture. A total of 65 per cent of rental properties are grade D or below, and a quarter of their owners say they will exit the market.  It is one thing spending £10,000 bringing a property up to standard if it is in Central London where property values are high. But if you own a  house in the North-East that is worth £60,000, you are going to be seriously asking if it is worth it 'The Government keeps saying that the private rented sector is an important part of the housing sector, but it is hard to marry that with the changes that it has made in legislation.'",
        "There is already a shortage of rental property, he adds, and that will become far more acute if landlords are forced to dispose of such properties.'It is one thing spending £10,000 bringing a property up to standard if it is in Central London where property values are high. 'But if you own a terraced house in the North-East that is worth only £60,000, you are going to be seriously asking if it is worth it. That is why we have suggested a lower threshold of £5,000 for parts of the country where property prices are low.'In other words, landlords would only be expected to spend £5,000 bringing a house up to grade C standard. If the necessary work looked like costing more than this, a landlord could apply for an exemption certificate and let the property anyway.I can sympathise with the landlords. In the early days of EPCs, I had two done on my house, a year apart. The first gave me an E. The second gave me an F — in spite of the fact I had beefed up the loft insulation in the intervening period.Can EPC ratings be relied upon?  Few in the property industry seem to have faith in EPCs. Three years ago the Government held a consultation into them. Of 145 respondents, just five believed that the reliability of EPCs was good. ",
        "The Department for Levelling Up, Housing and Communities says it is still working on ways to improve reliability of EPCs, but it won't reveal how. It says it will consult on changes but won't give a date.Among those sceptical of the accuracy of EPCs is UK Finance, which represents mortgage lenders — who as a group are been pressured to improve the average EPC rating of the properties in their lending portfolios.EPCs, says the body are 'not fit for purpose' in their current form, not least, it believes, because they 'fail to take account of emerging heat technologies'.An EPC is supposed to be a measure of how much it costs to heat and light a property rather than of its carbon emissions, and the reason that homes with electric heat pumps fall down is because the methodology assumed gas is a cheaper way to heat a home than electricity.",
        "Get in touch: editor@thisismoney.co.uk",
        "The problem is that an EPC doesn't really measure how much energy your home uses. Rather, an energy assessor takes some measurements and feeds them into a computer model which estimates energy usage. What the assessor gets out of it depends on what is fed in — and that can be little more than guesswork.",
        "Two years ago, I looked at a couple of flats in a converted Victorian monastery. One had a B rating, the other D.The difference? The EPC of the first one stated 'solid walls, insulated (assumed)', and the latter stated 'solid walls, uninsulated (assumed)'.The benefits of an energy-efficient home have never been more apparent than over the past winter, with sky-high energy prices. But if EPCs can't tell you how much you are going to spend keeping your home warm, they are worse than useless. A better way, says Ben Beadle, would be for every home to come with a logbook showing how much previous owners have spent keeping them warm.That might not make any difference to people like me, who wear a thermal vest and set the thermostat at 17c, but it is better than guesswork."
    ]
}