{
    "articleURL": "/money/mortgageshome/article-12061571/Lenders-poised-bring-100-cent-mortgages-time-financial-crash.html",
    "content": [
        "Lenders are poised to start offering 100 per cent mortgages for the first time since the global financial crisis in 2008.",
        "Skipton Building Society is planning to launch a loan for first-time buyers who do not have a deposit in a drive to get more people on to the property ladder.Chief executive Stuart Haire said the society wanted the new mortgage to 'help those trapped in rents'. The exact details of the loan are still secret but borrowers will need to demonstrate a history of paying rent at a similar level to a mortgage repayment for up to two years.The deal will be fixed for two years in order to protect them from falling into negative equity – where a property is worth less than the value of the mortgage taken out to buy it.",
        "Mr Haire did not confirm if the mortgage would be up to 100 per cent of the value of a property, but told The Times that Skipton was trying to find a way around the roadblock faced by first-time buyers who regularly paid rent but cannot get a mortgage due to being unable to save up for a 5 per cent deposit.But some analysts have warned the return of a 100 per cent mortgage will leave borrowers at greater risk of negative equity if the value of their home declines by as little as 3.7 per cent over two years.",
        "Prior to the 2008 financial crash, all large lenders including Lloyds and HSBC offered no-deposit mortgages. These loans were banished from the market following the crisis amid a crackdown on risky lending. But the lack of affordable mortgage options for first-time buyers has increased their appeal amid panic in the Government that its plans to increase homeownership are at risk.In an effort to boost purchasing power the Government might be considering a revival of the Help to Buy scheme, which offered first-time buyers loans for newly-built homes.The push to make mortgages more affordable comes amid expectations the Bank of England will raise interest rates again this week, piling more pressure on borrowers as repayment costs increase.The Bank is predicted to raise rates by 0.25 percentage points to 4.5 per cent, their highest level since October 2008. And their are fears rates could hit 5 per cent by December.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}