{
    "articleURL": "/wires/reuters/article-12040743/MLB-roundup-AJ-Pollocks-HR-ends-no-no-Mariners-edge-As.html",
    "content": [
        "AJ Pollock homered to break up a no-hit bid in the eighth inning and the Seattle Mariners defeated the host Oakland Athletics 2-1 on Tuesday night.",
        "Pollock lined a solo shot to left field off A's reliever Richard Lovelady (0-1) with one out in the eighth, and Jose Caballero followed with a double to left. Jarred Kelenic later doubled home the go-ahead run later in the inning off Jeurys Familia.Five Mariners pitchers combined on a three-hitter with 16 strikeouts. Reliever Gabe Speier (1-0) earned his first major league victory and Paul Sewald worked the ninth for his eighth save of the season.The game featured a pitching duel between a pair of rookie right-handers. A's starter Mason Miller left after seven no-hit innings. Mariners starter Bryce Miller, in his major league debut, gave up a run on two hits and no walks with 10 strikeouts.Reds 2, Padres 1 (10 innings)Jonathan India singled home automatic runner Matt Reynolds from second base leading off the top of the 10th inning to give visiting Cincinnati a win over San Diego.The Reds snapped a run of seven straight losses to the Padres and a streak of nine straight losses in San Diego.Derek Law (1-4) pitched a scoreless ninth to win his first game of the season. Alexis Diaz earned his fifth save. Luis Garcia (1-3) took the loss.Rangers 6, Diamondbacks 4Ezequiel Duran belted a go-ahead home run in the sixth inning, three relievers combined for 3 2/3 scoreless innings and Texas held on to beat Arizona in Arlington, Texas.",
        "Duran finished 3-for-4 and Marcus Semien had two hits for Texas, which has won four games in a row. Jon Gray allowed four runs on eight hits with one walk and two strikeouts over 5 1/3 innings.The Diamondbacks took their second loss in a row despite a homer and two hits apiece from Ketel Marte and Christian Walker. Arizona starter Zac Gallen saw his four-game winning streak and 28-inning scoreless-innings streak end. The right-hander lasted five innings, allowing three runs on seven hits with no walks and six strikeouts.Red Sox 7, Blue Jays 6Connor Wong went 4-for-4 with two home runs and a double as Boston edged past visiting Toronto.After Toronto took the lead in a six-run fifth inning, Wong broke a 6-6 tie with a leadoff solo homer into the Green Monster seats off Jays reliever Erik Swanson (0-1) in the eighth. Christian Arroyo and Masataka Yoshida also homered while Alex Verdugo hit two doubles for Boston, which banged out 14 hits and won its second straight to begin the four-game series.Daulton Varsho hit a three-run homer during Toronto's big inning. Varsho, Vladimir Guerrero Jr. and Kevin Kiermaier all finished 2-for-4.Rays 4, Pirates 1Harold Ramirez drove in two runs with a home run and a single as Tampa Bay downed visiting Pittsburgh in a clash of the top two teams in the major leagues in St. Petersburg, Fla.",
        "Wander Franco added an RBI single and Jose Siri stole home for the Rays, who have won four of five. Javy Guerra pitched two-thirds of an inning as the opener. Josh Fleming gave up one run and two hits before he left in the fifth after taking a comebacker off his left foot. Colin Poche (3-0) pitched one scoreless inning. Jason Adam pitched the ninth for his first save.Carlos Santana's sacrifice fly produced the only run for the Pirates, who had won 11 of 13 entering the series. Roansy Contreras (3-2) gave up four runs and six hits in 5 1/3 innings.Braves 6, Marlins 0Bryce Elder pitched seven scoreless innings in his longest and best start of the season, leading Atlanta past host Miami and reigning Cy Young Award winner Sandy Alcantara.Elder (3-0) lowered his ERA to 1.75. He allowed just three hits -- all singles -- and picked up six strikeouts without issuing a walk. The Marlins did not advance a runner past second base against Elder or relievers Kirby Yates and Joe Jimenez.The Braves got a solo home run from Ozzie Albies, who has gone deep three times in five games against the Marlins this year. He has eight homers overall this season. Alcantara (1-3) took the loss after allowing six hits, three walks and three runs in five innings. His ERA sits at 5.09, which is more than double last year's 2.28 mark.",
        "Giants 2, Astros 0Anthony DeSclafani logged eight shutout innings and San Francisco snapped a four-game skid by shutting out host Houston.In his longest outing of the year, DeSclafani (3-1) tossed a season-high 109 pitches. He tallied only three strikeouts but kept the Astros off-balance with an effective three-pitch mix to generate weak contact.DeSclafani was sharp from the start, retiring the first seven batters he faced and 19 of the first 20. The Giants didn't provide much run support, but it proved sufficient. Joc Pederson flipped an opposite-field single to left with one out in the top of the first that drove home Thairo Estrada, who singled and stole second base off Astros rookie right-hander Hunter Brown (3-1).Yankees 4, Guardians 2Willie Calhoun's first home run as a member of New York snapped a seventh-inning tie and lifted the slumping Yankees to a win over visiting Cleveland.Rookie Anthony Volpe homered with one out in the sixth to begin the comeback from a 2-0 deficit, as the Yankees snapped a four-game losing streak. Anthony Rizzo had an RBI single later in the sixth before Calhoun, playing his 14th game with the Yankees after signing with the team this past winter, homered with one out in the seventh off James Karinchak (0-4).",
        "Josh Naylor (double) and Andres Gimenez (groundout) each had RBIs in the third for the Guardians, who have lost seven of 11. Jose Ramirez finished with two hits. Wandy Peralta (2-0), the third of four Yankees pitchers, allowed one hit while recording two outs spanning the seventh and eighth before Michael King struck out three over 1 2/3 hitless innings to earn his second save.Nationals 4, Cubs 1Trevor Williams pitched 5 1/3 shutout innings and Washington's bullpen did its job in shutting down the visiting Cubs for the Nationals' second win in their last six games.CJ Abrams went 3-for-3 with an RBI and two runs Alex Call had the game's big hit -- a two-run double in a three-run seventh inning for Washington. Patrick Wisdom homered for Chicago's lone run.Hunter Harvey (1-0) got the win with 1 1/3 shutout innings as five Nationals pitchers combined to surrender eight hits. Chicago starter Hayden Wesneski worked six innings, giving up one run. Keegan Thompson (1-2) was charged with three runs on four hits in one-third of an inning to take the loss.White Sox 3, Twins 2 (10 innings)Andrew Benintendi delivered a walk-off single with two outs in the 10th inning to Chicago past visiting Minnesota, the White Sox's second straight walk-off win after a 10-game losing streak.",
        "The White Sox's Elvis Andrus sacrificed automatic runner Hanser Alberto to third base to start the inning before Tim Anderson grounded out to shortstop. That set the stage for Benintendi, who won the battle against Caleb Thielbar (0-1).Jimmy Lambert (2-1) earned the victory, striking out two in a perfect 10th inning. White Sox pitching limited Minnesota to three hits.Orioles 11, Royals 7Ryan Mountcastle homered twice and drove in five to lead Baltimore to a come-from-behind win over host Kansas City.After the Royals jumped on Tyler Wells (2-1) for three first-inning runs, the Orioles sent 10 batters to the plate in the fourth, scoring five runs. In the fifth, Mountcastle followed with another two-run home run, his eighth, expanding the Orioles' lead to 7-3. It was Mountcastle's eighth career multi-homer game and second of the season.Bobby Witt Jr. broke an 0-for-13 slump with his fifth homer to left center leading off the Royals' first. One out later, MJ Melendez followed with a two-run shot to right center, his third, making it 3-0 Royals. Yarbrough surrendered five runs on five hits and three walks -- all in the fourth inning -- while striking out five in 3 2/3 innings.Angels 5, Cardinals 1Taylor Ward hit a three-run homer to power visiting Los Angeles past St. Louis, the Angels' fifth win in seven games and the Cardinals' fourth straight loss.Angels starting pitcher Patrick Sandoval (3-1) allowed one run on three hits in five innings. He struck out four and walked three. Chris Devenski pitched two innings of scoreless relief for Los Angeles. Matt Moore and Carlos Estevez closed out the game with an inning each.Starting pitcher Steven Matz (0-4) allowed four runs on six hits and two walks in five innings for the Cardinals, who have also lost seven of their last eight.Rockies 3, Brewers 2Elias Diaz homered and drove in two runs, Ezequiel Tovar also went deep and Colorado beat Milwaukee in Denver, ending a seven-game losing streak at Coors Field.Justin Lawrence (1-1) pitched one inning for the win and Pierce Johnson got the final three outs for his fourth save for Colorado. Jesse Winker, Rowdy Tellez and Brice Turang had two hits each for Milwaukee.With the game tied at 2-2, C.J. Cron led off the bottom of the eighth with a double off reliever Peter Strzelecki (2-1). Diaz followed with a single to drive in Yonathan Daza, who was pinch-running for Cron.Dodgers 13, Phillies 1Julio Urias rebounded from a pair of subpar road starts to give up one hit over seven innings and Los Angeles rolled to a victory over visiting Philadelphia to extend its winning streak to a season-best five games.Mookie Betts drove in three runs with three hits, rookie Miguel Vargas had three doubles among his four hits, and Freddie Freeman hit a home run as the Dodgers moved one victory away from a perfect 6-0 homestand. Urias (4-3) had a season-best 10 strikeouts and just one walk.Bryce Harper made his season debut for the Phillies 160 days after undergoing Tommy John surgery and went 0-for-4 with three strikeouts as the designated hitter. Former Dodger Trea Turner hit a home run for the only Phillies hit against Urias.--Field Level Media"
    ]
}