{
    "articleURL": "/news/article-12042491/6-000-armed-forces-staff-marched-Waterloo-station-creating-replica-1948-painting.html",
    "content": [
        "Scenes at Waterloo station were described as 'genuinely extraordinary'A railway historian compared the scenes to Helen Mckie's famous paintingA picture shows the incredible moment 6,000 armed forces staff marched through Waterloo station ahead of the Coronation and created an exact replica of the iconic 'War and Peace' painting from 1948.",
        "Commuters heading home from London Waterloo last night were treated to an extraordinary sight as some 6,000 soldiers marched through the railway station.Members of the Armed Forces arrived on trains from stations including Aldershot, near the Hampshire town's garrison, ahead of the overnight Coronation rehearsal.Observers described the scenes as 'genuinely extraordinary' with one comparing them to Helen Mckie's famous 'Waterloo Station War and Peace' paintings in 1948.Railway historian Tim Dunn said: 'I'm at London Waterloo to observe genuinely extraordinary scenes tonight as 6,000 armed forces staff arrive for Coronation rehearsal.",
        "'Scenes not seen for a generation and EXACTLY reflect Helen Mckie's 1948 famous 'War &amp; Peace' paintings pair. Some kind of glorious coincidence?'He added: 'Don't ever tell me that railway history isn't interesting. It's the history of us all, and those twin strips of steel still guide the events of now.'The posters by McKie were commissioned by Southern Railway for Waterloo's 100th anniversary, and represent the station in a bustling form during wartime.They have the tagline: 'Waterloo Station - A Century of Uninterrupted Service During Peace And War'One of the posters depicting war shows Guardsmen wearing khaki and a group in military uniform marching through the station.The other shows peacetime when soldiers are in their red dress uniforms where the Guardsmen stood, and a group of girls dressed for school can be seen in the place of military figures. The blackout across the station's roof is also gone.",
        "In both pictures, the station can be seen bustling with trains at their platforms, providing the narrative that the railways continued their vital work during wartime."
    ]
}