{
    "articleURL": "/sciencetech/article-12050101/Google-launching-foldable-smartphone-Watch-sneak-peek-new-Pixel-Fold.html",
    "content": [
        "Google has released a video of its first ever foldable smartphone - the Pixel FoldSpec and price will be released during the Google I/O conference on May 10It is rumoured to have a 7.6-inch screen and cost upwards of $1,700 (£1,350)Google has released an official video of its first ever foldable smartphone - the Pixel Fold.",
        "A video shows the sleek, silver device which opens up like a book with a vertical hinge, and has a camera array on the back that is similar to other Pixel devices.The tech giant has yet to release any technical details or price, as the full announcement will come on May 10 during its developer conference, Google I/O.This comes just a week after footage was leaked on Twitter of an alleged Pixel Fold prototype, which looks very similar to the one in the official video.The smartphone will see Google join Samsung, Huawei and many more of its rivals in offering a foldable device.",
        "Tech fans have been flooding social media with their thoughts on Google's latest offering.",
        "SamsungGalaxy Z Flip, Galaxy Z Fold Motorola Motorola Razr 2022Huawei P50 Pocket, Mate X2  OppoFind N2 FlipXiaomi Mix Fold 2 ",
        "On the YouTube announcement video, excited users wrote: 'Can't wait to see what colours this comes in!' and 'Finally, I was waiting for it for so long'.Another added: 'As long as there's no visible and tangible crease, I'm there. Otherwise, still holding off on all smart foldables.'Videos of some foldable smartphones have shown an unsightly crease down the centre of the screen, putting off some consumers.  Citing internal documents, CNBC said Pixel Fold will have the 'most durable hinge on a foldable phone' and will cost $1,700 (£1,350) and upwards.",
        "In comparison, Samsung's latest flagship foldable phone, the Galaxy Z Fold 4, starts from $1,800 in the US or £1,649 in the UK.Pixel Fold will open like a book to reveal a small tablet-sized 7.6-inch screen, according to CNBC, while the smaller exterior screen will measure 5.8 inches across. From the video, the front appears to have a full-size screen that reaches the edges of the device, like on non-folding smartphones, but the interior screen has a thin bezel around the outside. But some social media users are not impressed by the bezel, and the chunky unit that holds the camera lenses.'Why does google phone's always have so much bezel! I dont understand!' commented one YouTube user. Another wrote: 'Baby got back, dat camera bump...' ",
        "When the Pixel Fold is opened up, viewers can see that the typical Google apps and widgets appear to have been optimised for the larger screen. The Android home screen features a Google search bar, clock, weather widget and app shortcuts along the bottom. According to the CNBC leaker, the Pixel Fold will boast a larger battery and will therefore be heavier than Samsung's Galaxy Fold (283g compared with 276g). It will also reportedly be packed with Google's Tensor G2 processor, which powers the latest Google Pixel 7 family of smartphones, released last October.",
        "Official details about the upcoming device are scarce, although the dedicated webpage for Google I/O includes an intriguing image that appears to depict two foldables facing each other.The company is rumoured to ship the Pixel Fold a month after the conference, which takes place in Mountain View, California, USA. ",
        "Google is also expected to unveil its new Pixel Tablet and Pixel Watch, all of which may include some AI-related features.Back in March, the firm launched its own AI chatbot, Bard, to rival ChatGPT, which had taken the world by storm.Google execs are said to have declared a 'code red' – an emergency situation – over fears ChatGPT could now end Google's $150-billion-a-year search business monopoly. After entering the smartphone market in 2010 with the Nexus brand, Google kicked off the Pixel line in 2016, but none of these phones have been foldable as yet. Interestingly, the biggest Asian smartphone makers – Samsung, Huawei, Oppo, Xiaomi and Vivo – have all released foldable phones, while the two US giants – Apple and Google – have not. However, some enthusiasts previously created a prototype of what a foldable iPhone might look like. ",
        "But while the stage is set for Google's first foldable phone, Apple seems to be holding out for longer.  According to one report, the bulky design of current folding phones does not align with Apple's design philosophy, although the firm is rumoured to be working on one.",
        "Apple appears to have registered patents for a foldable phone, similar to a flip phone, with a horizontal hinge through the middle. Other smartphone makers to release a foldable phone include Motorola, a US company based in Illinois.The firm released its second-generation Motorola Razr last autumn – an updated version of its original 'clamshell' Razr flip phones released in the noughties. ",
        "It can be hard to remember a time before we had mobile phones, now they have replaced maps, watches, calendars, cameras and so many more devices and tools.But the first ever wireless handset made its first call 50 years ago today – the Motorola DynaTAC 8000X, which weighed a whopping 1.75lb (784g).Since then, the device has shrunk down significantly, lost its buttons and external aerial, but gained a touchscreen and professional quality camera lens - and even a foldable mechanism. To celebrate the milestone, MailOnline looks back at its evolution over the last five decades.Read more "
    ]
}