{
    "articleURL": "/sport/football/article-12041391/Vanarama-National-League-Bromley-hilariously-troll-Cristiano-Ronaldo-REJECT-signing.html",
    "content": [
        "Bromley have rejected a light-hearted idea of signing Cristiano RonaldoThe 38-year-old reportedly 'wants to leave Al-Nassr' just months since joiningA Vanarama National League side have taken to social media to troll Cristiano Ronaldo, stating that they do not wish to sign the Portugal international.",
        "This comes after reports that Ronaldo wants to leave Al-Nassr just months after making the move to Saudi Arabia, and could return to Real Madrid.If he is to return to England, one thing is for sure, as he will not be joining National League side Bromley following their Twitter antics.Vanarama wrote: 'It's not too late if you want to play in white next season, Cristiano', with a picture of the 38-year-old in a Bromley kit. However, the Ravens acted quick to distance themselves from a move, replying: 'Nah, you're alright.'",
        "Reports surrounding Ronaldo's future emerged from Spain, with it believed that the 38-year-old could be offered a role at Real Madrid in the near future.'Florentino Perez has guaranteed that [Ronaldo] will not lack work at the Santiago Bernabeu,' it was claimed.'But, obviously, he wouldn't do it to be a player, because he considers that it is a cycle that should be considered closed.'While his partner Georgina Rodriguez is said to be yearning for a return to the Spanish capital, Ronaldo could look to make a move back to Madrid.The Real Madrid legend scored after just four minutes as Al-Nassr secured a 3-0 victory at home to Al-Raed on Friday, and his future remains unclear.One thing is for sure, however, and he will not be making a move to Bromley to play his football in the National League.",
        "The Ravens are seeking promotion to the Football League and if they are to do so, they must do it via the playoffs as they face Woking tonight.Ronaldo would no doubt have relished the opportunity to add another trophy to his collection, but he must do so at Al-Nassr rather than in London."
    ]
}