{
    "articleURL": "/wires/pa/article-12039659/Mikel-Arteta-wants-Arsenal-players-enjoy-table.html",
    "content": [
        "Mikel Arteta watched his Arsenal team return to the top of the Premier League table with victory over Chelsea before insisting he would not let his players’ heads drop.",
        "The Gunners were eight points clear last month but had fallen behind Manchester City following a run of four winless game – a streak that ended with a comfortable 3-1 win over the beleaguered Blues.Captain Martin Odegaard scored twice before Gabriel Jesus wrapped up the win before half-time as Noni Madueke’s first league goal proved a mere consolation for Frank Lampard’s visitors.Despite their recent run, Arteta had refused to rule Arsenal out of the title race and this win took them two points clear – although they have played two more games than City.The Spaniard admitted he did not want to see morale fall after a galling loss at City last week saw their lead all but dashed.“It is four games to go, we are at the top right now,” he said. We have to enjoy it and embrace it, maximise the opportunity that we have because we don't know what is going to happen  Mikel Arteta  “We cannot do that (let heads drop), to be where we are after 10 months against the team we are fighting against, being there and having the possibility to be top – we have to enjoy it and embrace it, maximise the opportunity that we have because we don’t know what is going to happen.",
        "“We wanted to have a very different approach to the game, and we did it right from the beginning.“The team is back to its best. We wanted to prove we had that fire in the belly. I could see that in the last few days, and we prepared (for) the game well.",
        "“Mentally we arrived in the right mood and with the right level of energy. Everything went for us as well, which is important.“We’ve had a couple of difficult weeks with very different games, with a lot of emotions involved. We’re back to the top of the league – let’s see what happens.”While it was a night to remember for skipper Odegaard, it was one his predecessor will want to forget in a hurry. Pierre-Emerick Aubameyang started for Chelsea for the first time since facing the Gunners on November 6 but lasted just 45 minutes before being substituted, having had nine touches – four of which were kick-offs.",
        "Arteta was full of praise for Odegaard and the example set by the Norway international.“He has 14 goals this season, his contribution to the team, his leadership skills, I’m really pleased with him,” he added.“He has been exceptional for us, his contribution every single day. I think he has done that (set the tone) on many occasions. What Martin has done this season deserves a lot of credit.”",
        "Chelsea have now lost all six games under interim head coach Frank Lampard, who believes his players are “too nice” as they remain in the bottom half of the table. We can't change things overnight but we had better get there quickly  Frank Lampard  “We weren’t good enough,” he conceded.“We were too nice to play against, too passive. In possession we weren’t playing balls over their press, or winning second balls.“Chelsea have been a big success for 20 years domestically and in the Champions League, at the moment we’re not in that position.“But from the moment I’ve been here it’s been evident we’re too nice as a team.“We can’t change things overnight but we had better get there quickly because we have another game at the weekend and games to come.”"
    ]
}