{
    "articleURL": "/wires/reuters/article-12058497/Buttler-regains-form-Hyderabad-clinch-ball-thriller.html",
    "content": [
        "NEW DELHI, May 8 (Reuters) - Rajasthan Royals opener Jos Buttler roared back to form but Abdul Samad's last-over heroics ensured Sunrisers Hyderabad had the last laugh in Sunday night's dramatic Indian Premier League (IPL) contest.",
        "England limited-overs captain Buttler started the season well but went into the match without a fifty in his previous six knocks that included a couple of ducks.The T20 stalwart was in his element against Hyderabad as he smashed 95 off 59 balls to help Rajasthan rack up 214-2, with skipper Sanju Samson contributing an unbeaten 66 off 38 balls.The 2008 champions had the upper hand for most of Hyderabad's chase, restricting them to 174-5 with two overs to go.But with Hyderabad needing 41 runs off the last two overs, Glenn Phillips, who made 25 off just seven balls, turned the match on its head.The big-hitting New Zealander smashed Kuldip Yadav for three consecutive sixes followed by a four before offering a skyer to Shimron Hetmyer.Defending 17 runs in the final over, Rajasthan's Sandeep Sharma conceded 12 runs in his first five balls and had Samad caught at long-off with the next delivery.Sandeep and his team mates were celebrating when the siren sounded to confirm the seamer had overstepped, which resulted in a free-hit.Samad smacked the final delivery over the bowler's head for a flat six to secure Hyderabad's fourth win in 10 matches.\"I was just waiting for the ball to get in the slot eventually and luckily I got a no-ball as well. I got lucky,\" Samad told the broadcasters.",
        "Rajasthan captain Samson defended picking Sandeep to bowl the final over.\"Matches like these, that's what makes IPL so special,\" he said.\"I was very confident with Sandeep. He has won us a game with almost a similar situation. He did it again today but that no-ball actually ruined our result ... Almost everyone was celebrating.\"Champions Gujarat Titans beat Lucknow Super Giants by 56 runs in Sunday's other match to cement their position at the top of the points table and inch closer to a playoff berth. (Reporting by Amlan Chakraborty in New Delhi; editing by Peter Rutherford)"
    ]
}