{
    "articleURL": "/tvshowbiz/article-12046807/Cindy-Crawford-worked-pal-Courtney-Sixx-Mothers-Day-bouquets.html",
    "content": [
        "Cindy Crawford has a new project this month.",
        "The Vogue supermodel has created a Mother's Day Bouquet Box - a 'box that is all about love' - with her close friend Courtney Sixx, the wife of Motley Crue rocker Nikki Sixx.The box is basically a DIY kit that includes roses, a reusable vase, a criss-cross lid, clippers and a measuring stick. The kit is a fun way to create your own arrangements at home. DailyMail.com caught up with Courtney at the Sherwood Country Club in Thousand Oaks, California on Wednesday where she talked about working with the runway icon.'A lot of people don't know this but Cindy is very creative,' Courtney told DailyMail.com. 'Everyone just thinks of how pretty she is and what a success she is as a model but there is another side to her: she is a creative wiz who loves do-it-yourself projects. That and she has a contagious laugh!'",
        "The two became friends several years ago and earlier this talked a collaboration for Courtney's Bouquet Box, which can be purchased online.'I asked Cindy to collaborate with me and to my surprise she said sure,' added Courtney, who looked stunning at the event in a floral print top as she mingled with Tommy Lee's wife Brittany Furlan.Courtney and Cindy got to work on what would be a good fit for Cindy for the Courtney x Meaningful Beauty box. Meaningful Beauty is Cindy's skincare line.",
        "The Cindy/Courtney box is called Meaningful Bloom. 'Purple is Cindy's favorite color so we used purple roses,' explained Courtney. 'And purple is the color she used in Meaningful Beauty so it all tied together.'And Cindy opened her doors to Courtney for a photo shoot.'I told Cindy we needed to do a shoot together and she said come to my house in Malibu it's easier. How could I say no to that? She has a beautiful estate in Malibu,' said Courtney.'When I got there Cindy was very hands on and helpful she was way more than the talent. ",
        "'She helped decorate the set and gave advice on how to best shoot the flowers. 'Because, of course, she has so much experience with photo shoots, so that was helpful.'She just jumped right in and made it all so much better.'When asked what Cindy is really like behind closed doors, Courtney said that she is much more 'down to earth' than anyone would expect.'For all her fame and success, it's amazing how girl next door she is,' said the former model.",
        "'She is just so normal and easy going, it's surprising how unaffected she is. She is the real deal. She is a great mom, a wonderful wife, she cooks at home, she takes time with her friends, I can't say enough good things about her.'",
        "And when pressed to reveal something most people would not know about Cindy, Courtney offered, 'She loves to make pies.'Cindy has said on Instagram of the box: 'I’m so excited that @meaningfulbeauty is partnering with @bouquetbox for a Mother’s Day collab this year. I’ve always been inspired by my friend @how2girl eye for flower arranging and her way of making it easy for anyone to do…. So you can order one for your mom now (link in bio) - in our signature #MBLAVENDER.'Order by May 14 for delivery before May 25. On Instagram the tag line for the boxes is: 'Designed by us. Arranged by you. Bouquets and Subscriptions now Available.By Courtney Sixx with Mark’s Garden.'Courtney grew up in Los Angeles. At 17 she began modeling with Wilhelmina Models. Soon after Courtney moved to Europe to pursue her career as a high fashion model. After a successful career modeling, film production caught Courtney's eye. She has starred in InAPPropriate Comedy and Shoot'er.She married Nikki in 2014 and together they have daughter Ruby Sixx."
    ]
}