{
    "articleURL": "/tvshowbiz/article-12051967/Britains-Got-Talent-share-sweet-spoiler-clip-tomorrow-nights-show.html",
    "content": [
        "Bruno Tonioli surprised a children's dance group at Madame Tussauds in London and invited them to audition for the show, spoilers for Saturday's episode have shown. ",
        "The teaser clip, which was shared on the talent show's official YouTube, showed Bruno, 67, entering into Madame Tussauds in a diamante embellished white suit.First-look pictures from the show also showed the dance group dressed up in suits and gold dresses as they showed off their talents after accepting the offer.In the video, Bruno took a seat next to his Madame Tussauds sign before posing as a realistic wax figure in a bid to surprise the group.The children's dance act, called United 2 Dance, then entered the museum, unaware of Bruno's presence.",
        "They then spotted Bruno's very realistic 'wax figure' and one of the girl's did an impression of the star as she said: 'Ohhh fabulous darling.' As the kids walked towards him and got close up, Bruno then jumped up screaming 'Surpriseeee', which made all the kids jump and scream in disbelief.One of the children then proceeded to say 'are you real' to which Bruno responded with 'I am real, you can touch me I'm really real'.Bruno then proceeded to tell the children why he was there and what the surprise was all for - to invite them to audition for Britain's Got Talent after a mother of one of the children Olena got in touch with the show.",
        "He said: 'You know why I'm here, because Olena got in touch with me to tell me how wonderful you have been to her and her son Nazari and how wonderful you have been to them since they came from Ukraine.'He continued: 'Helping them getting you a chance to dance and a chance to shine. Olena can you tell me all about it my darling'.And Olena, who appeared overwhelmed with emotion said: 'I can't thank United students enough for everything that they done for my family and for my son.'",
        "She continued 'Since we arrived here they support us, they sponsored Nazari, they present him clauses for dance'.Bruno then replied with 'So it's like welcoming a new family?'.Olena said: 'No words will ever be enough to say how we are grateful to United 2 Dance, they changed our life.'After Olena explains what the dance act has done for her and her family Bruno then proceeded to rub his hands together and said 'Okay now here comes the surprise'.'Olena has nominated you to come and audition today for Britain's Got Talent,' with the children appearing delighted.The surprise teaser clip comes after Bruno was in the hot seat recently with Britain's Got Talent viewers as they raged over Bruno allowing his vote for an act to be swayed by the audience.",
        "The former Strictly Come Dancing panellist, who joined the ITV talent competition for the first time this series, was tasked with calling on his professional dance knowledge for the first auditionees of the evening.Twinkle-toed hopefuls Romeo and Icy took to the stage to show off their slick moves after telling how they'd met at a party and decided to create their entertaining act.However, despite their energetic display, the panel was split, with Simon Cowell and Amanda Holden deciding to put them through to the next stage, while Bruno and Alesha Dixon thought they weren't up to scratch.Things soon changed when the crowd became hostile towards Bruno as he cast his vote, booing and jeering him in a bid to get him to change his mind.Fortunately for the audience at the audition, Bruno caved in and decided to change his vote to a 'yes', ensuring Romeo and Icy went through to the next stage of the competition.However, the situation did not sit well with viewers at home, with many taking to Twitter to voice their frustration.One person wrote: 'What’s the point of judges if the crowd will change the result for an average dance duo. A poor Twist and Pulse imo.'While someone else asked: 'Since when did the crowd have a say?!'",
        "Another person wrote: 'What c**p, the audience were just humouring them and being daft and Bruno changed his mind this show makes me cringe when they treat silly acts that like they’re something special.'While another viewer tweeted: '#bgt Grow a pair Bruno, instead of changing your opinion because the audience were told to sound angry.''I agree with Bruno. They were good, but not good enough. Audience reaction is ridiculous. Bruno is a dancer and choreographer. His opinion is worth 10 times Amanda's opinion,' wrote someone else.While another person shared: 'If the entire audience has a vote then what's the point of the judging panel? Just get a clap-o-meter in.'And one other person posted: 'Seriously!!! Bruno bowing to the crowds and changing his vote for the boys dancing. Literally just turned it on and now off!!!! #BGT gone WOKE!!!! Won’t be watching any of it now.'"
    ]
}