{
    "articleURL": "/femail/article-12056977/DR-MAX-PEMBERTON-marriage-alive-partner-workaholic.html",
    "content": [
        "Dr Max Pemberton shares his advice on maintaining marriage and work balanceREAD MORE: Inside Kevin Costner's colorful love life: As the actor's second wife files for divorceBeing married to Kevin Costner has been a fantasy for many women over the years, I'm sure. You can imagine them looking at their husband sprawled on the sofa — an empty pizza box and half-eaten bag of crisps at his side as he belches and asks them to pass another beer — and tip-toeing off to another room to watch Dances With Wolves.",
        "But maybe being married to the heart-throb isn't quite as perfect as they imagine. The 68-year-old is said to have been 'blindsided' after Christine Baumgartner, his wife of 18 years, filed for divorce last week.Some have blamed the 'friction' caused by the gruelling filming schedule the actor keeps for hit TV show Yellowstone, with his wife reportedly fed up with his work commitments.I suspect many people reading this know what it feels like to have a partner who seems more wedded to work than them. Of course, sometimes people's work really is relentless, but it's telling that not everyone with a demanding job lets it take over.I know many doctors — myself included — who work long, stressful hours while maintaining happy, healthy relationships. Being married to a busy person is one thing, but living with a workaholic is different.",
        "There is a sense they are choosing to prioritise work over you. It's hard not to take it to heart.Why some people struggle to balance work and life is a complex question. Sometimes, it comes out of a need for approval of others, and a desire to provide. It can also be a tactic to avoid intimacy, or as a distraction from problems.Whatever the underlying cause, I've seen many couples cite this as a reason for marital conflict.",
        "The first thing I do is encourage the workaholic to pause and reflect on why things are so out of kilter and perhaps seek help to explore the underlying issues. But the other person in the relationship can also take steps to help them cope with living with a partner who can't find a healthy work-life balance.Here's what I recommend:Tell them how you feelI've often seen couples where one partner is deeply upset that the other works all the time only for it to transpire they've never told their spouse how they feel. The workaholic is often shocked, thinking they were on the same page when it came to putting in the hours to provide for their family. Explain calmly how you feel. Avoid accusations or inflammatory language as this risks pushing the person further away.Say what you wantThink about what expectations you have of your partner. Should they be there each night to put the children to bed? No emails after 9pm? Try to negotiate some rules over working times and commitments. Be realistic about their work schedule.Put a date in the diary to check in with each other in a few weeks to see if the new routine is working. If they aren't sticking to the rules, don't react in the moment; discuss it in the check-in time.",
        "Meet their colleaguesIt's easier to gauge what's going on and how much of your partner's working time is really necessary if you know the people they work with. You'll also get an idea of whether their boss has unreasonable expectations.Make home enjoyableBy making them enjoy the time they do spend at home, they're more likely to look forward to it and see it as a place to relax.Compare diariesDoing this means you can predict when they will and won't be free, and will avoid nasty surprises — and you can also plan to spend time together.Set aside time togetherAsk them to agree to a routine so you know there is time that is sacrosanct for you both, or you as a family, in the week. Make it clear this is a special time and working during it isn't acceptable. Start small — say Sunday brunch as a family with a walk after — then take it from there.. . . And make it specialensure that the time you do spend together is fun — find interests or hobbies to share.",
        "Avoid comparisonsComparing yourself with other couples is unhelpful. It's unlikely you know everything about their relationship, and this may make your partner feel inadequate. You then run the risk of your partner finding reasons to justify their behaviour — and this escalating into a row.",
        "Don't stop the guiltIt is tempting to make things easier for a workaholic. But don't downplay it when your partner misses important events. If you do, you're just waving a green-flag for this behaviour.Ask for helpIf this doesn't work and their workaholism is entrenched, consider marriage guidance — a calm, neutral space to explore your feelings and allow them to talk openly, too. Ultimately you have to decide what you really want from a relationship — and if they are able to provide that. If your partner can't find time to attend, I'd suggest going on your own to find what's best for you.AI CAN'T BEAT US DOCS YETThe recent explosion of AI has made many people question what jobs, if any, are safe from its seemingly unstoppable march. I confess to having felt rather smug about this — doctors could never be replaced by a machine, could they?Certainly, I can see how AI might be able to interpret scans or blood tests but, my thinking went, it’d never be able to replace the five senses. Maybe I spoke too soon.New research conducted at the University of California found AI-assisted messaging systems were more empathetic and gave better advice than medics.However, I would suggest AI isn’t about to take over from doctors just yet. Much of medicine is about appreciating the subtle cues people give you, understanding what their illness means to them and how it’s impacting their lives.",
        "It’s about knowing when they need a shoulder to cry on. It’s often about a kind gesture, and making people feel understood.Medicine isn’t just a science — it’s an art that relies on a deep understanding of the human condition, and we’re a long way from computers being able to master this.Good news about treating Alzheimer’s. A new drug, donanemab, has been shown to delay symptoms worsening by up to 35 per cent. Great progress — but the NHS will need to think carefully how to ensure patients get treatment without overwhelming services and draining dementia budgets In the lead-up to the Coronation there were, of course, many articles about the King and Queen giving details about their lives. One thing particularly stood out for me, though: Queen Camilla writes about 2,000 letters each year. This isn’t, it was explained, because she can’t cope with email, but because ‘she gets the power of something dropping on the doormat with her name and stationery’ and the fact she’s spent time on it. A woman after my own heart!There is something magical about receiving a letter. Putting pen to paper makes people feel special in a way email and texts don’t.DR MAX PRESCRIBES...BOOK VENDING MACHINE ",
        "A vending machine in Exeter St David’s train station dispenses not the usual junk food but . . . books. It was installed by publisher Penguin Random House and has a wide variety of literature. Money raised will support independent bookshop Bookbag and Exeter City of Literature, which promotes literacy. It’s been such a success there are plans for more. I love the idea of vending machines providing food for the mind. "
    ]
}