{
    "articleURL": "/wires/reuters/article-12058875/Toyota-suspends-sales-Yaris-model-safety-test-problem.html",
    "content": [
        "By Chayut Setboonsarng and Daniel Leussink",
        "BANGKOK/TOKYO, May 8 (Reuters) - Japanese carmaker Toyota Motor Corp has stopped sales and deliveries of its Yaris Ativ in Thailand, senior officials said on Monday, after its affiliate Daihatsu rigged part of the door in side-collision safety tests.The problem may have occurred due to pressure on Daihatsu to shorten the development time of the Ativ, Masahiko Maeda, Toyota's CEO for the Asia region, said at a press conference in Bangkok. The vehicles customers were currently using were safe, he added.Toyota was working with the Thai government to resume sales of the model, which has been produced in Toyota's Gateway plant in Chachoengsao province, and further investigation was underway.\"If development had been carried out under appropriate conditions, this kind of problem would of course not have happened,\" Maeda said.\"I think the fact that it still happened, means there was some kind of pressure at the development site,\" he said, adding that the vehicle's relatively large size may have posed a challenge to Daihatsu, which specialises in the production of small cars.Toyota and Daihatsu disclosed last month they were investigating how part of the door in side-collision safety tests carried out for some 88,000 small cars had been changed for the purpose of side-on crash safety testing.",
        "Daihatsu has said that some 76,000 of those vehicles were Yaris Ativs mainly bound for Thailand, Mexico and the Gulf Cooperation Council. The Gulf Cooperation Council comprises Saudi Arabia, the United Arab Emirates, Kuwait, Qatar, Bahrain and Oman.Toyota Chairman Akio Toyoda said he had visited the Gateway plant for the first time in a decade to assure workers, also saying he had come to the Southeast Asian nation because he loved it.Toyoda has a personal attachment to Thailand, calling it his \"home away from home\" at an event to celebrate Toyota's 60th anniversary of operations in the country late last year.He has said that late Thai King Bhumibol Adulyadej was the only global leader who expressed his confidence in the company after a string of massive recalls prompted U.S. investigations and forced him to testify before Congress in 2010.Toyota President Koji Sato, who took over the top job from Toyoda on April 1, was not at the press conference.For Daihatsu, which became a wholly owned Toyota subsidiary in 2016 when Toyoda was president, Southeast Asia is an important market, with production facilities in Indonesia and Malaysia.(Reporting by Chayut Setboonsarng in Bangkok and Daniel Leussink in Tokyo; Editing by Martin Petty and Louise Heavens)"
    ]
}