{
    "articleURL": "/tvshowbiz/article-12049685/Candice-Warner-Christian-Dior-Chanel-worth-17-200-lunch-outing.html",
    "content": [
        "Candice Warner was a vision of beauty on Friday as she stepped out in Christian Dior and Chanel during a lunch outing with her friend, Daily Mail's Jana Hocking. ",
        "The former Ironwoman, 38, who has just finished up a publicity blitz for her memoir Running Strong, was all smiles as she met up with her friend for a catch-up.Dressed to the nines in a gorgeous black frock with a sheer skirt, she accessorised with a classic black Chanel handbag worth a shocking $15,710. As if that wasn't enough, she hid her eyes behind a set of dark designer glasses before slipping into luxe sling-back Dior shoes worth $1,490. With some staple silver jewellery pieces to polish off the expensive look, Candice greeted her columnist friend with an affectionate kiss on the cheek. ",
        "The 38-year-old radio announcer looked angelic in white as she donned a short skort and matching coat with decorative gold buttons along the lapel and waist. She elevated the look with dangling pearl earrings and ankle high black heeled boots before curling her golden tresses. It comes after Candice finally took back her power after sixteen years of being publicly shamed for her 'toilet tryst' with Sonny Bill Williams. ",
        "The mother-of-three told her own story, on her own terms, in her new book Running Strong: Falling, Rising, Breathing, on sale now.In it, she detailed the depression she suffered after she was caught in a bathroom stall with rugby star Sonny during a night out at the Clovelly Hotel in 2007.",
        "Aged just 22 and trying to navigate life in the public eye as an athlete and model, Candice found it hard to deal with the humiliation and subsequent fall from grace, and she even contemplated suicide.Now happily married to Australian cricketer David Warner, with whom she shares three daughters, Candice is no longer scared to talk candidly about her past, and hopes other women who read her book can see that when they reach rock bottom, the only way is up."
    ]
}