{
    "articleURL": "/news/article-12058213/Karl-Stefanovic-breaks-tears-Queensland-youth-crime-wave-interview.html",
    "content": [
        "Karl Stefanovic broke downHe spoke to victims of crime Karl Stefanovic has broken down during an emotional interview about youth crime, speaking to victims of violence at the hands of young people and their bereaved families.",
        "Speaking to victims, frontline officers and politicians, during the segment on the Today show on Monday, Stefanovic sought to uncover answers as to what could be done to fix the country's growing 'youth crime crisis'.Former Queensland police superintendent Jim Keogh told Stefanovic that the crisis was the worst it had ever been during his 38-year career.'There's always been elements of problems... now you're besieged with youth crime,' he said.Mr Keogh added that the removal of bail laws is 'one of the catalysts' for the problem.",
        "Stefanovic spoke with 'victims all robbed of a loved one', recounting some of the most horrifying recent incidents involving youth perpetrators that have made headlines across the country.They discussed personal stories of the ongoing grief and trauma inflicted by carjackings, home invasions, fatal collisions and violent public attacks all at the hands of young people.One such family was Ann and Russell Field who lost their son Matthew in January 2021 after his vehicle collided with a stolen car being driven by a teenager.Matthew's wife Kate and their son Miles also died in the incident, while it was later revealed that the teen behind the wheel of the stolen vehicle was under the influence of drugs and alcohol at the time.",
        "'Since then, there's been multiple cars ... probably thousands of cars, that have been stolen and multiple deaths,' Mr Field said.'Hopefully no more (mums need to go through this),' Ms Field added.'But there will be more.'Mr Field agreed that he and his wife wouldn't be 'the last' to be affected by such crimes.'We're not the first and we're not the last,' he said.'It'll continue on until something concrete is done.'Stefanovic later choked back tears as he talked through possible solutions with Bill Potts, former director of the Australian Law Council.",
        "'Raising penalties and jailing our way out of trouble is not going to work', Mr Potts said.Stefanovic attempted to cover his face as he fought back tears during his response.'I'm a parent, and if I saw it ... and it happened to my kid ... I'd want that, whoever it was, locked up forever, at best,' Stefanovic said.'At best.'Stefanovic's 'special report' comes nearly one month after the Queensland government pledged a funding package worth more than $3m to fight the scourge of youth offending."
    ]
}