{
    "articleURL": "/tvshowbiz/article-12049429/Guardians-Galaxy-Vol-3-review-roundup-Critics-praise-sequels-heart.html",
    "content": [
        "With fans starting to head to theaters for the first Thursday night preview screenings, the reviews are in for Guardians of the Galaxy Vol. 3, and they're mostly positive.",
        "The highly-anticipated sequel has amassed a solid 79% 'Fresh' score from the critics on Rotten Tomatoes, from 217 reviews.While the reviews are quite strong... it's still the lowest score in the trilogy, far behind the 92% score for 2014's Guardians of the Galaxy and the 85% for 2017's Guardians of the Galaxy Vol. 2.Dailymail.com's own critic Brian Viner gave the superhero sequel four stars out of five, declaring it 'marvelously bonkers.'While Viner and other critics praised Guardians 3 for its heart, others bashed the 150-minute movie (by far the longest in the trilogy) for being 'bloated' and 'aimless.'",
        "Viner added that the film has its humor but isn't to be taken too seriously, though there were moments where tears were shed.'Needless to add, it’s not meant to be taken remotely seriously, although at times it tries a little too hard to be funny. Come to think of it, the forced humour of all three Guardians films could make another academic thesis,' Viner said.Variety's Peter DeBurge noted, like Viner, that Bradley Cooper's character Rocket Raccoon's backstory is revealed, adding this movie makes the Guardians, 'Marvel's top heroes.''At a jam-packed, planet-hopping 150 minutes, it also feels less like a conventional moviegoing experience than the endorphin rush that comes from waiting years for the next season of your favorite TV series, then binge-watching all the new episodes in a single sitting,' DeBurge added.",
        "DeBurge admitted, 'The story might not always make sense,' though he added, 'it keeps things moving.'He added that director James Gunn, 'keeps the surprises coming, so audiences are actively engaged throughout, trying to manage multiple storylines and the ever-changing loyalties between characters.'The Hollywood Reporter critic Frank Scheck also offered a positive review of Guardians 3, though he admitted Gunn's writing left something to be desired.'Gunn doesn’t fully succeed in tying all these threads together into a coherent whole. And the storyline is too complicated by far, with so many things going on at so many different times and places that multiple viewings are practically necessary to keep it all straight (not that Disney has a problem with that),' Scheck said.",
        "Despite the story issues, he added, 'this edition largely succeeds like the other ones, thanks to the chemistry of the main ensemble, who have grown into their characters with relaxed ease.'He also praised Will Poulter's performance as the new villain Adam Warlock, stating he, 'plays the role with an enjoyable mixture of physical menace and baby-like befuddlement, but he ultimately fails to make a lasting impression.'One of the many negative reviews was from Wall Street Journal critic Kyle Smith, who called the sequel a, 'blahbuster.'He adds the sequel, 'jogs along from one visually extravagant, strenuously jokey set piece to another without offering much in the way of either dramatic engagement or actually funny ideas.'",
        "Vanity Fair critic Richard Lawson called the sequel an, 'odd, lumbering patchwork of a film, occasionally fascinating but otherwise bloated and aimless.'Johnny Oleksinski from the New York Post added, 'The misfit team’s constant punchlines and I’m-just-busting-your-chops dynamic have grown exhausting. They’ve become the guy at the party who thinks he’s hilarious but is actually just drunk.'Much like Guardians of the Galaxy 3's Rotten Tomatoes score is the lowest of the trilogy, the box office returns are also seemingly in decline, with $110M domestic and $250M worldwide projected, far below the debut of 2017's Guardians of the Galaxy Vol. 2. "
    ]
}