{
    "articleURL": "/tvshowbiz/article-12043703/Kylie-Minogue-release-lead-single-new-album-weeks.html",
    "content": [
        "Kylie Minogue is reportedly set to make a comeback later this month as she unveils the lead single from her 15th studio album.",
        "It is claimed the singer, 54, will release the new track ahead of her 55th birthday after teaming up with top producer Lost Boy who has worked with the likes of Ellie Goulding, Becky Hill and Mimi Webb.The album will follow later this year while a major arena tour is being planned for 2024, her first in six years, according to The Sun. An insider told the publication: 'Kylie has finally finished the album and is now raring to go with her return to music.'It is being kept under lock and key and hardly anyone at her label has even heard it.",
        "'The first single will be revealed later this month. It's classic Kylie and is sure to go down well with her fans.'MailOnline has contacted a representative for Kylie for comment.It comes after MailOnline exclusively revealed Kylie was set to pour her heart out on her next record after laying down an emotional break-up track.The pop superstar, who recently split from her boyfriend of five years, Paul Solomons, 47, teamed up with producer Sky Adams, who she previously worked with on numerous tracks including her 2018 hits Dancing and Stop Me From Falling, and 2020's Supernova, among others.She has recorded some moving dance music and a single has been earmarked which details the importance of communication in a successful relationship.",
        "A source told MailOnline: 'Kylie has partnered with the producer Sky Adams to produce emotional dance music for her next record and will detail the breakdown of some of her past relationships with the record. 'The pair have spent weeks writing new songs for her album and have found a single which addresses the need for people to communicate clearly in a relationship.'Elsewhere, Kylie recently split from her magazine executive boyfriend Paul Solomons after five years together.",
        "The hitmaker is said to have parted ways with the former British GQ Creative Director after they struggled to make a long distance relationship work.Australian native Kylie returned to her home in Melbourne's eastern suburbs after decades of living in the UK, while her Welsh ex remains in the British capital.And as they appeared to struggle with the 11 hour time difference, a source told The Sun: 'Kylie and Paul really tried to make things work but ultimately the time difference was a killer.'They continued: 'Paul couldn't exactly nip to Melbourne for a long weekend whenever things got strained.'Kylie initially wanted to keep the split quiet though as she really does not want the narrative to be 'poor, unlucky-in-love-Kylie's heartbreak's again'.'Concluding that the star won't be 'moping around' over the heartbreak, the source added that Kylie will be putting 100% into her career.",
        "The duo are said to be remaining friends following their break-up.",
        "Kylie and Paul met in February 2018 after being introduced by mutual friends, going public with their romance months later.The pair were thought to have even become engaged in 2021, with family appearing to have let the news slip.Paul's step-mother Gloria said at the time: 'She's very nice, I'm thrilled they're engaged. It's very exciting.'But, I'm sorry, I cannot tell you any more because I've been told not to. I respect my son and I respect Kylie too much to say any more.'"
    ]
}