{
    "articleURL": "/wires/reuters/article-12042325/US-private-payrolls-increase-solidly-wage-growth-cools.html",
    "content": [
        "Services PMI rises to 51.9 in April from 51.2 in March",
        "Prices paid measure little changed at higher levelsPrivate payrolls increase by 296,000 in AprilBy Lucia MutikaniWASHINGTON, May 3 (Reuters) - The U.S. services sector maintained a steady pace of growth in April as new orders increased amid a surge in exports, but businesses continued to face higher prices for inputs, indicating that inflation could remain elevated.Despite darkening clouds gathering over the economy as the lagged effects of higher interest rates start to have an impact, services businesses in the Institute for Supply Management (ISM) survey on Wednesday were fairly upbeat.That bolsters economists' expectations that any recession this year will likely be mild and short.\"The majority of respondents are mostly positive about business conditions,\" said Anthony Nieves, Chair of the ISM Services Business Survey Committee. \"However, some respondents are wary of potential headwinds associated with inflation and an economic slowdown.\"The ISM's non-manufacturing PMI edged up to a reading of 51.9 last month from 51.2 in March. A reading above 50 indicates growth in the services industry, which accounts for more than two-thirds of the economy. Economists polled by Reuters had forecast the non-manufacturing PMI ticking up to 51.8.The PMI remains above the 49.9 level, which the ISM says over time indicates growth in the overall economy.",
        "Fourteen services industries reported growth, including accommodation and food services, utilities, public administration as well as transportation and warehousing. The three industries reporting a contraction were mining, agriculture, forestry, fishing and hunting, and wholesale trade.Finance and insurance companies described business conditions as \"steady,\" adding that they were \"preparing for planned expansion in the third quarter.\"Businesses in the professional, scientific and technical services industry reported that they were \"well on track to still see significant growth in production through calendar year 2023, as well as 2024 and 2025.\"Retailers described business trends as \"stable year to date,\" noting that \"inventory levels are coming more in line to match the new lower demand trends.\"Businesses running down inventories contributed to curbing economic growth in the first quarter. Economists believe that businesses facing a recession with lean stocks put them in a better position to rebuild inventories should the need arise.The Federal Reserve raised its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range on Wednesday, and signaled it might pause the U.S. central bank's fastest monetary policy tightening campaign since the 1980s.Stocks on Wall Street were trading higher. The dollar fell against a basket of currencies. U.S. Treasury prices rose.TIGHTER CREDIT CONDITIONSIn addition to higher borrowing costs, banks have tightened lending, which could make credit inaccessible to households and small businesses. A standoff to raise the federal government's $31.4 trillion borrowing cap also poses a grave risk to the economy. Treasury Secretary Janet Yellen warned on Monday that the government could run out of money within a month.",
        "The services sector is being supported by consumers shifting spending from goods, which are typically bought on credit.The ISM reported on Monday that its measure of national manufacturing contracted for a sixth straight month in April, though at a slower pace.A gauge of new orders received by services businesses increased to 56.1 from 52.2 in March. Comments from companies included \"demand outpacing forecasts\" to \"new requests for services from customers.\" A measure of export orders jumped to 60.9 from 43.7 in March.With demand solid, services inflation persisted. A measure of prices paid by services businesses for inputs nudged up to 59.6 from 59.5 in March. Services prices tend to be stickier and less responsive to rate hikes.Some economists view the ISM services prices paid gauge as a good predictor of personal consumption expenditures (PCE) inflation. The Fed, which has a 2% inflation target, tracks the PCE price indexes for monetary policy.But services sector employment growth slowed further, more evidence that the labor market was softening. The government reported on Tuesday that there were 9.6 million job openings at the end of March, the lowest level since May 2021.The labor market is, however, not slowing fast enough to tame inflation. The ADP National Employment Report showed on Wednesday that private payrolls increased by 296,000 jobs in April after rising 142,000 in March. The surge was driven by a 154,000 increase in leisure and hospitality employment.",
        "The government's closely watched employment report on Friday is likely to show nonfarm payrolls increased by 180,000 jobs in April after rising 236,000 in March, according to a Reuters survey of economists. The unemployment rate is seen climbing to 3.6% from 3.5% in March.\"We expect payrolls to remain positive for now,\" saidRubeela Farooqi, chief U.S. economist at High Frequency Economics in White Plains, New York. \"But the pace should moderate as the lagged and cumulative effects of monetary policy spread more broadly through the economy.\" (Reporting by Lucia Mutikani; Editing by Chizu Nomiyama and Paul Simao)"
    ]
}