{
    "articleURL": "/wires/reuters/article-12057249/Churchill-Downs-carnage-Seven-horse-deaths-10-days.html",
    "content": [
        "The Kentucky Derby is now over but the carnage continued on the famous race day with the deaths of horses Chloe's Dream and Freezing Point on Saturday.",
        "That brought the total horse deaths to seven during a 10-day span at Churchill Downs in Louisville, Ky.Both horses were injured during undercard races. Chloe's Dream was euthanized after injuring a knee during the second race and Freezing Point was put down after injuring an ankle in the eighth race.Another horse, Here Mi Song, departed in an equine ambulance after the 10th race but X-rays reportedly came back negative.The advocacy group People for the Ethical Treatment of Animals (PETA) sharply criticized the track after Saturday's second death.\"Churchill Downs is a killing field,\" PETA senior vice president Kathy Guillermo said in a statement. \"Freezing Point is the latest casualty. He's the second horse to die today at the track, making it an appalling seven deaths in advance of the Kentucky Derby. They should play `Taps' at the Derby instead of `My Old Kentucky Home.'\"Guillermo said PETA had called for the closure of Churchill Downs \"so stronger protocols could be put in place.\"\"Churchill Downs should have listened,\" she said.The other horses that died during the 10-day period are Take Charge Briana, Code of Kings, Parents Pride, Chasing Artie and Wild On Ice.In the Kentucky Derby, Mage roared down the strength for the victory. Shortly afterward, Churchill Downs released a statement.",
        "\"It is with the utmost sadness that we report these tragic fatal injuries,\" the statement began. \"Churchill Downs is unwavering in our commitment to the health and well-being of equine safety. The equine fatalities leading to this year's Kentucky Derby are a sobering reminder of the urgent need to mobilize our industry in order to explore every avenue possible and effectively minimize any avoidable risk in the sport.\"Despite our determination to continually improve upon the highest industry standards, there is more to be done and we will rigorously work to understand what caused these incidents and build upon our existing data, programs and practices to better understand what has been incredibly difficult for us to witness and accept this week.\"Kentucky Derby entrant Wild On Ice sustained a leg injury during training on April 27 and was euthanized.Trainer Saffie Joseph Jr. was suspended indefinitely by Churchill Downs on Thursday after two of his horses died -- Parents Pride on April 29 and Chasing Artie on Tuesday. Churchill Downs termed the deaths as \"highly unusual\" in a news release.Another Joseph horse, Lord Miles, was scratched from the Kentucky Derby on Thursday.Also on April 29, Code of Kings died after flipping and breaking his neck in the paddock prior to a race.",
        "Take Charge Briana was injured during a race on Tuesday and euthanized.There were no major issues in the highlight race, the Kentucky Derby, on Saturday. Five horses were scratched from the Derby in the days leading up to the Triple Crown race, including the favorite, Forte, on the day of the race due to a bruised foot.Joining Forte and Lord Miles as scratches were Practical Move, Continuar and Skinner.The second leg of the Triple Crown is the Preakness Stakes, scheduled for May 20 at Pimlico Race Course in Baltimore.--Field Level Media"
    ]
}