{
    "articleURL": "/wires/pa/article-12052019/EFL-clubs-agree-new-935million-broadcast-deal-Sky-Sports.html",
    "content": [
        "EFL clubs have unanimously voted to accept a record £935million deal with Sky Sports that will see more than 1,000 matches broadcast a season, but which keeps the Saturday blackout in place.",
        "The five-year domestic deal, made up of guaranteed payments of £895m and £40m in marketing rights, will begin in 2024-25 and run to the end of the 2028-29 season.It represents a 50 per cent increase on the league’s current deal with Sky which expires at the end of next season.Altogether 1,059 league, EFL Cup and EFL Trophy matches will be shown live either on a Sky main channel or via a Sky streaming platform, replacing the iFollow service for domestic viewers.Streaming platform DAZN had been keen to acquire the rights to screen all EFL matches and bring an end to the Saturday blackout period between 2.45pm and 5.15pm.The blackout stays in place in the Sky deal, but more matches are available to stream, with six games across the Championship, League One and League Two now set to kick off at 12.30pm each Saturday.The deal means 26 out of 36 matches will still kick off at Saturday 3pm – seven Championship matches plus 19 across Leagues One and Two.",
        "The percentage increase in guaranteed income from the new deal for Championship clubs.",
        "The EFL acknowledges the changes in kick-off times can make planning difficult for matchday fans, and has committed to placing all live matches up to the FA Cup third round before the start of each season.",
        "It is understood that based on the EFL’s distribution formula, Championship clubs will earn 46 per cent more in guaranteed broadcast income and clubs in Leagues One and Two will be 25 per cent better off.EFL had announced Sky as its preferred bidder in early April, following the issue of invitations to tender earlier in the year.The deal means 10 league matches will be shown live each weekend, including six in the 12.30pm Saturday slot.Every match in the EFL Cup will be shown live, plus every game in the EFL Trophy.The PA news agency understands Sky has bought the EFL Cup rights ‘as is’ , despite the possibility of the competition having a significantly different look from 2024-25, with domestic calendar issues under discussion as part of the ‘New Deal For Football’ talks.",
        "The EFL declined to comment on whether the deal included a rebate clause to Sky in the event that the format of the competition did substantially change.All opening round and final day matches will be shown live, as will all games played on Bank Holidays including Easter, Boxing Day and New Year’s Day alongside the matches played in Sky Bet League One and Two during international breaks.The deal also promises greater parity in the number of times clubs are selected for TV coverage is also guaranteed.",
        "EFL chief executive Trevor Birch said: “This is a landmark broadcast deal for EFL clubs, establishing the league as a premium partner with a world-renowned broadcaster in Sky Sports.“The EFL is an iconic sports property and one of the biggest and best attended leagues in European football.“This increased investment and coverage from Sky Sports will showcase much more of our compelling match action to fans, while delivering record rights values as we seek to make our clubs sustainable at all levels.”Clubs will gain an additional fee when selected for broadcast, but a debate on how these will be allocated will take place among the clubs later in the year.No bid convinced the EFL to remove the blackout. The EFL estimated that removing it would cost £37m in matchday attendance revenue, and that had to be factored into any offer which sought to remove it."
    ]
}