{
    "articleURL": "/wires/ap/article-12059799/Former-UNDP-chief-Turkish-minister-dies-74.html",
    "content": [
        "ISTANBUL (AP) - Turkish economist, politician and former head of the United Nations Development Program Kemal Dervis died Monday at the age of 74, Turkish news outlets reported.",
        "He was being treated for an unspecified illness in Washington D.C., state-run Anadolu Agency reported, as did BBC Turkish and t24, which first reported the news.In early 2001, amid the worst economic crisis in Turkey's modern history, Dervis left his job at the World Bank, where he had worked for more than two decades, and joined the government at the invitation of then-Prime Minister Bulent Ecevit. Inflation was soaring and the stock market had crashed.As minister of economic affairs, Dervis was largely responsible for the successful three-year economic recovery plan launched that year, which included major structural changes and bank reforms.He also negotiated loans from the International Monetary Fund, a highly unpopular move as deep spending cuts were required. However, they would lead to rapid economic growth resuming in 2002 and a significant reduction of inflation by 2003.He resigned his ministerial position in August 2002, and was elected as an MP for the main opposition Republican People´s Party, known as CHP, in the general elections which took place later that year.",
        "In 2005 the United Nations General Assembly unanimously confirmed Kemal Dervis as the administrator of the United Nations Development Program. The post is the third highest in the U.N. following the Secretary-General and Deputy Secretary-General. He did not seek a second term in 2009 when his four-year term expired. \"I learned of Kemal Dervis´ passing with great sadness,\" tweeted academic and Sabanci University finance chair Ozgur Demirtas. \"He is a very important economist and minister. He was the architect behind the recovery from the 2001 crisis. If the reforms Kemal Dervis had wanted not been implemented, Turkey would have been stuck in the 2001 crisis. Condolences.\"",
        "\"I am very saddened by the loss of our esteemed minister Kemal Dervis, whose work I valued deeply and who represented our country successfully on the world stage,\" tweeted former minister and current opposition politician Ali Babacan.Born January 10, 1949, Dervis received his bachelors and masters degrees from the London School of Economics in 1968 and 1970 respectively, and his PhD from Princeton University in 1973. He authored and co-authored a number of books on economics, including \"Inequality in America: Facts, Trends and International Perspectives\", in 2012, and \"Recovery from the Crisis and Contemporary Social Democracy\", in 2006."
    ]
}