{
    "articleURL": "/sport/football/article-12054471/Sam-Allardyce-slams-Leeds-wasting-free-kick-return-dugout-vs-Man-City.html",
    "content": [
        "Sam Allardyce slammed his side after they wasted a free-kick against Man City llkay Gundogan scored twice to give the Citizens a 2-1 win against Leeds  The Peacocks rallied to score a late goal thanks to Rodrigo's pinpoint accuracy   Sam Allardyce slammed his Leeds players after they wasted a free-kick opportunity during their 2-1 defeat by Manchester City at the Etihad on Saturday. ",
        "It was a frustrating return to the dug out for the Englishman who was appointed as the new manager of the relegation threatened side after Javi Gracia was sacked last week.  Ilkay Gundogan scored a stunning brace of goals to give Pep Guardiola's side a 2-0 lead after 27 minutes, with Riyad Mahrez continuing his excellent form this season to tee the German up on both occasions. But Allardyce seemed infuriated with his team, as referee Andy Madley awarded Leeds a free kick on the half-way line, giving them an opportunity to put some pressure on Man City just before half-time. Much to the manager's frustration, the free-kick was wasted, with the ball sailing far too long over the City backline before going out for a goal kick.  Sky Sports cameras then cut to Allardyce on the touchline who looked livid, and was seen mouthing the words 'what a f****** waste.' ",
        "Guardiola, meanwhile, was also incensed with his players, after Gundogan failed to convert a penalty in the second half. The City boss raised his arms on the touchline and seemed furious with his star-striker Erling Haaland, after he decided to give the penalty to his German team-mate - perhaps in a show of kindness to give him the chance to net his hat-trick. ",
        "But the Spaniard did not approve of the decision and was seen venting his frustrations on the sideline, shouting to Haaland:  'No, you have to take it. You have to take it.'The Norwegian had also failed to convert several chances in the run up to the penalty decision, testing Joel Robles in the Leeds net after the break, before hitting the post soon after. And Guardiola looked even more annoyed with his players as he sank deep into his chair in the dug out after Rodrigo pulled one back for Leeds with six minutes left to play, capitalising on some poor defending at the back from the home sideWith the scores at 2-1, Leeds would grew in confidence towards the end of the match but were unable to cut the deficit again, with City holding out to extend their lead at the top of the Premier League standings, with their chasers, Arsenal, set to play Newcastle on Sunday at St James' Park. ",
        "Before the match, Allardyce was seen on Sky Sports' coverage walking out of the tunnel, before drinking in the atmosphere around the ground. He was also overheard saying: 'Here we go again.' Having now held coaching positions at 14 domestic teams in England and Ireland, Saturday marked his return to the touchline after he departed West Brom in 2021. ",
        "And it's been a busy week for the 68-year-old, whose side sit joint on points with Nottingham Forest in 17th place, but only escape the relegation zone because of their goal difference. Following the game Allardyce was asked if his side could leave the Etihad with a lot of hope following their performance. 'A lot of hope yes,' he told Sky Sports after the match. 'We talked at half-time in the dressing room about, obviously we only have had a few days but we were trying to give the players some guidance. 'Unfortunately, it can be a little acceptable for them at the minute given what's happened and that they're playing against Man City. But our execution and passing wasn't of the sort-of quality that we needed to cause any threat to Man City. ",
        "'Hence, it just became a constant defensive battle against one of the best teams who can break down eleven behind the ball - which is the quality of their players of course all over the pitch.' On the second half, he said: 'We stuck to the game plan better and executed our possession better, and grew in confidence with the fact that we started getting behind the midfield and up the pitch a little bit more and our quality balls were getting a little bit better.   ",
        "'Eventually we scored a very very good goal. But the really annoying thing for me was that we gave a stupid penalty away.' Leeds now have three games left against Newcastle, West Ham and Tottenham before the season finishes on May 28th."
    ]
}