{
    "articleURL": "/wires/ap/article-12051917/Sign-times-History-marker-communist-draws-anger.html",
    "content": [
        "CONCORD, N.H. (AP) - A historical marker dedicated to a New Hampshire labor activist who championed women´s rights and was a founder of the American Civil Liberties Union - but who also joined the Communist Party and was sent to prison - has draw objections from Republican officials and scrutiny from the governor.",
        "Known as \"The Rebel Girl\" for her fiery speeches, Elizabeth Gurley Flynn was born in Concord in 1890. A green and white Historical Highway Marker dedicated to her, one of 278 across the state, was unveiled Monday near her birthplace.In addition to her rights activism, the marker also says she joined the Communist Party in 1936 and was sent to prison in 1951. She was one of many party members prosecuted \"under the notorious Smith Act,\" the marker says, which forbade any attempts to advocate, abet or teach the violent destruction of the U.S. government.Flynn later chaired the Communist Party of the United States and she died in Moscow during a visit in 1964, at age 74. She was cremated, and her ashes were taken on a \"flower-decked bier\" to Red Square during a funeral tribute, according to Associated Press accounts at the time.Republican Gov. Chris Sununu is calling for a review of the state´s historical marker program.\"This is a devout communist,\" said Joseph Kenney, a Republican member of the Executive Council, at a regular meeting Wednesday. \"We are the `Live Free or Die´ state. How can we possibly promote her propaganda, which still exists now through this sign in downtown Concord?\"",
        "David Wheeler, a Republican who´s also on the five-member Executive Council, which votes on state contracts and Sununu´s department appointees, said he wants the council to have more oversight of the historical marker process.",
        "Sarah Stewart, the commissioner for the Department of Natural and Cultural Resources, said at the meeting that the marker program is very popular \"because it´s initiated at the local level. There is no state top-down effort to populate the state with historical highway markers.\"There are \"many potentially controversial\" markers, Stewart said. \"The purpose of them is not to commemorate heroes. The purpose is to provide a snapshot that the local community feels is of historic value.\"Any person, municipality or agency can suggest a marker as long as they get 20 signatures from New Hampshire residents. Supporters must draft the marker's text and provide footnotes and copies of supporting documentation, according to the state Division of Historical Resources. The division and a historical resources advisory group evaluate the criteria.The sign was approved last year by the Concord City Council following a recommendation from the marker program, which is jointly administered by the Historical Resources Division and the Transportation Department. It currently stands at the edge of a parking lot near the county courthouse.Concord Mayor Jim Bouley said Friday that the council's approval was limited to the location of the sign for safety purposes. He said he was puzzled by a letter Stewart sent him Thursday saying the city can reevaluate its approval of the marker.",
        "\"We don´t approve content,\" the mayor said.Plus, Bouley said the sign is on state, not city, property. \"They can do whatever they want on their own property. Why would the city care?\"Historical markers run the gamut, telling stories about the last living Revolutionary War soldier, poets and painters who lived nearby, long-lost villages and contemporary sports figures.Flynn is \"one of the most significant radical leaders of the twentieth century,\" the marker´s supporters said in a letter to City Council last year. The sign also notes Flynn´s support for women´s voting rights and for access to birth control.\"We're going to review the whole process,\" Sununu said at Wednesday's meeting.\"I completely agree with the sentiment here,\" the governor said, adding, \"It's the state marker. You can't say we don't have any responsibility in terms of what it says and where it goes.\"One marker from 2011 that was brought up during Wednesday's meeting celebrates the 50th anniversary of the \"Betty and Barney Hill incident,\" during which the couple reported a close encounter with a UFO. Their experience was described in a best-selling book, a television movie, and numerous speaking engagements.\"The UFO one I´m gonna live with,\" said Kenney, the Executive Council member. \"That's a funny story.\"___",
        "Associated Press researcher Rhonda Shafner in New York contributed to this story."
    ]
}