{
    "articleURL": "/news/article-12038683/Moment-college-student-SMILED-sobriety-test-just-minutes-KILLING-TWO-DUI-crash.html",
    "content": [
        "Stephanie Melgoza, 24, of Farmington, was sentenced to 14 years in prison on Thursday for the deaths of Andrea Rosewicz, 43, and Paul Prowant, 55She struck and killed the two on April 10, 2022, while she was out bar hopping four weeks before her Bradley University graduation She blew a 0.264 - more than three times the legal limit - and claimed the victims 'came out of nowhere'  This is the shocking moment a college student smiled during a DUI test after she killed two victims in an Illinois drunk driving crash. ",
        "Stephanie Melgoza, 24, of Farmington, was sentenced to 14 years in prison on Thursday for the deaths of Andrea Rosewicz, 43, of Avon, Ohio, and Paul Prowant, 55, of Seattle. She pleaded guilty to four felonies for aggravated DUI and aggravated reckless driving in February. Four lesser chargers were dismissed earlier this year in exchange for a guilty plea, the Pekins Daily Times reported. Melgoza struck and killed them in a DUI crash on April 10, 2022, while they were crossing the street near Full Throttle bar in East Peoria. Megoza. The then-Bradley University student was three times over the legal limit and failed every field sobriety test. She admitted to officers that she had three vodka and waters and had cannabis in her purse. In bodycam footage, released on Saturday, Melgoza can be seen manically smiling at the police officer as she giggles her way through a light test. ",
        "After being asked to 'touch the tip of my pen' to indicate she understood the assignment, the young woman proceeded to move her head back and forth, rather than just her eyes. 'Just your eyes,' the officer reminded her. 'It's really hard, it's really hard,' Melgoza laughed before grabbing her own face to steady her moving head. Despite bracing herself, she continuously failed to stay still, all while doing so with a wide smile on her face. ",
        "Earlier in the evening, she told police officers after they examined her busted-up car, that she 'called as soon as this s**t happened.' The 24-year-old seems more shocked that the event happened to her at all, telling the officer: 'I go to Bradley, why would this happen to me?' Bradley University is a private school located in East Peoria and costs roughly $36,000 a year. It was roughly 15 minutes away from where the accident occurred. She was four weeks out from graduating at the time of the incident, she told officers. In court on Thursday, the former college student told the jury: 'I have not drunk since that day. I do not plan on drinking ever again. I want to try to do something positive to make a difference, speak out about this and warn others about the dangers that come with drinking.'I'm so sorry for everything, and I will never, ever commit anything like that again.' ",
        "After police arrived on scene in April 2022, bodycam footage showed her red Dodge Dot's hood with a large dent in the center and she admitted to police that she was 'just getting her night started,' despite already being three times over the limit. She started her night at Tavern 41 and was heading to Full Throttle when the accident happened.  ",
        "After placing her purse on the hood of the squad car, she admitted to having marijuana on her, but said she had not yet smoked any that night. She also had a vape tucked in the bag. While recalling the events, Melgoza said one of the victims 'walked out in front of me' while she was driving toward Full Throttle and said her 'car got hit.' 'Someone said: \"Oh, someone else is hit.\" And I said: \"Oh my God, how did that happen?\"' she said. 'They came out of nowhere, because I'm a safe driver.' She estimated she was 'going at least 40[mph]' when she hit Rosewicz and Prowant. She also told officers that she 'think I would pass' if given a field sobriety test. 'Don't test me,' she quickly corrected. 'But I think I would pass.' She admitted that she had her last drink 40 minutes ago at Tavern 41. During her sobriety test, she blew an 0.264. She was immediately arrested afterward. ",
        "After being placed in cuffs and put in the back of the cop car, she denied hitting both people, telling officers: 'I did not.' 'However you want to word it to yourself, that's fine,' the officer told her. 'But I'm just telling you, there's two people struck by your vehicle and both are dead.' ",
        "Police took her to the emergency room to attend to her bruises from the windshield cracking. While in the ER, she happily told police that someone was going to 'take her to Vegas' and that she was 'going to spend at least $500 and I'm going to start off with two Long Islands.''You haven't had enough of drinking already?' the officer questioned. She also told the officer while he was on his phone: 'I swear to God if you're Snapchatting right now and I'm not, I'm going to be so mad.' Melgoza also sang for the officer when it 'got too quiet.' When she asked the officer when she'd be able to go back to school, he harshly explained to her that she had killed two people and would not be seeing school anytime soon. '[Your] being completely careless about killing two people tonight,' he told her. 'You could care less, that's sad, apathetic, and horrible all at the same time.' Shortly after the crash, students held a memorial for the two victims and held a protest, angered by the fact that Melgoza was allowed to attend her graduation ceremony, despite the charges she faced. "
    ]
}