{
    "articleURL": "/news/article-12050517/US-teenage-royal-super-fan-17-says-America-not-fit-monarchy.html",
    "content": [
        "17-year-old Braden Miller claims that America could never have a monarchy  A 17-year-old royal super fan who has camped out on The Mall twice in the past year has claimed to be 'America's youngest ever royal expert'.",
        "Braden Miller has joined hundreds of people camping out near Buckingham Palace ahead of King Charles' coronation tomorrow and told MailOnline he considers himself an 'American royalist.' Braden became introduced to the British monarchy two years ago when he began watching the Netflix show The Crown during lockdown back home in California. Since then, he says, he's been hooked. He said: 'I watched The Crown two years ago and started to do more research on it as a lot of it didn't seem very accurate. ",
        "'I like the history aspect of The Crown show - but we obviously don't know what the Queen said behind closed doors.' And rather than rest on his laurels, the super fan decided to be proactive and set up his very own royal watcher Instagram account where tracks and debunks popular theories about The Crown. He explained: 'I got really into it and then started a Royal Family Instagram account. 'Over the week of the Queen's funeral it just blew up - I have over 180,000 followers now.' And intriguingly for a man from a country that gave the royal family the boot in 1776, Braden considers himself a royalist. He explained: 'I consider myself an American royalist. In the US we have our president, but like it or don't like it, people just deal with it because monarchy isn't really a thing. ",
        "'It's two different atmospheres and I like to appreciate both. 'I don't think I'd like America having a royal family, I don't think the US is fit for a monarchy. 'There's too many different people there with different opinions. The closest thing we have to a monarchy is the Kardashians and they got famous for doing nothing.' And when asked how people in the states viewed Harry and Meghan in the wake of their controversial talk show and media appearances since they exited the firm in 2020, the young monarchist pulled no punches. He said: 'A lot of Americans are on Harry and Meghan's side, just because they know no background to what happened. 'They only watch what's fed to them like Oprah and Netflix. 'They don't look at factual evidence, if you do a tiny bit of research you'll find most of the things aren't true.' "
    ]
}