{
    "articleURL": "/tvshowbiz/article-12045489/How-Holly-Willoughby-Robbied-Margots-style.html",
    "content": [
        "Holly Willoughby is known for her sensational style and blonde locks. ",
        "And while the assets have become her trademark, a scratch beneath the surface appears to prove the This Morning host's look is not totally her own. It seems Holly, 42, takes huge inspiration from A-lister Margot Robbie, with a slew of her past styles stolen from the star, 32, as well as her fancy dress costumes ripped directly from two of Margot's movies. On Saturday night, while attending Keith Lemon's star-studded fancy dress 50th birthday, Holly's costume of choice was a take on one of Margot's outfits from the new Greta Gerwig-directed Barbie movie, which is due for release in July. In 2016 meanwhile, Holly dressed as Margot's character Harley Quinn from super villain movie Suicide Squad, which was released the same year. In 2019, she sported a different take on the Harley, in another costume. Far from only replicating her characters' ensembles, Holly has also donned matching gowns to the star, red carpet styles akin to Margot's and even styled her hair in a near identical shoulder tickling bob with sweeping side parting. So how has Holly Robbied Margot's look? ",
        "FANCY DRESS  The upcoming Barbie movie has fans of both Margot and the iconic doll in uproar - with Holly seemingly joining in the excitement. Back in July, Margot was spotted on-set in Los Angeles shooting scenes opposite Ryan Gosling - who plays Ken - and sporting a cowgirl look. ",
        "The ensemble comprised a pink waistcoat, high-waisted trousers with a star-adorned frill below the knee and a white cowboy hat. For her former Celebrity Juice colleague Keith Lemon's birthday, Holly near-replicated the ensemble yet opted for a jumpsuit instead of a two-piece. ",
        "Her Suicide Squad aspirations meanwhile came twofold. In 2016, Holly joined many in donning the Joker's villainous girlfriend Harley Quinn's trademark style - with pulses racing at the sexy look. She slipped into a Daddy's Little Monster torn tee, wore her hair in blonde, pink and blue bunches and paired the look with metallic hotpants and brandished a bat. Holly then returned to her Harley look in 2019, in the wake of the Suicide Squad sequel, The Suicide Squad. She sported Harley's later brightly coloured look.  ",
        "RED CARPETA slew of Holly's red carpet looks appear to be taken straight from Margot's style book - including elegant gowns and a slick suit. In 2017, the British star wore a near-identical plunging black look to the ITV Pallooza, a year after Margot sported the dress at the Whiskey Tango Foxtrot premiere. Again, after Margot wore a stunning one-shouldered dress to The Wolf Of Wall Street premiere in 2013, Holly stole the look on Dancing on Ice in 2018.",
        "DAY TIME DESIGNS ",
        "In March, Holly sported an LK Bennett dress which was near-identical to the yellow dress Margot was rocking at the G'Day USA Los Angeles Black Tie Gala at InterContinental Los Angeles Downtown on 2018. When sporting the similar look, she also donned Margot's sweeping hairstyle. "
    ]
}