{
    "articleURL": "/wires/pa/article-12055353/Woman-seriously-injured-held-hostage-home.html",
    "content": [
        "A woman has been taken to hospital with serious injuries after being held hostage at her Kent home, witnesses have said.",
        "Locals described hearing gunshots after armed police smashed into a terraced house in Dartford.Police said officers went to a house in Priory Road at 12.40pm on Saturday with a trained negotiator following reports of a “disturbance”.Witnesses described how police cordoned off the road and ordered people to stay inside their homes, before officers smashed through the front door of the property and went inside.After an hour long stand-off, “pandemonium” broke out and neighbours heard what they described as sounding like two rounds of gunshots.",
        "Kent Police confirmed a man and a woman were taken to a London hospital with serious injuries.The house remained cordoned off and forensics teams could be seen entering the property late on Saturday evening.A spokesperson for the force said: “Kent Police was called to a report of a disturbance at a property in Priory Road, Dartford at 12.40pm on Saturday.“Officers, along with a trained police negotiator, attended and attempted to engage with a man inside the address.“A man and a woman were later taken to a London hospital with serious injuries.“Officers remain at the scene and enquiries are ongoing to determine the circumstances surrounding the incident.”Witnesses who lived nearby said the woman had been “held hostage” by a man at the back of the property.",
        "One woman, who wished not to be named, described the scene as “chilling”.She said: “I was in the house and my husband and two girls were out – they couldn’t get back home.“I went out and was told ‘get back – you must stay indoors’.“I went to the garden where I could see more.”About an hour after police entered the property, she said she heard gunshots before a person was carried out on a stretcher.“It was pandemonium”, she said. “I heard five gunshots – a pause and then another five.”"
    ]
}