{
    "articleURL": "/wires/reuters/article-12053545/Rays-focus-beating-Yankees-not-avenging-HBPs.html",
    "content": [
        "The way the Tampa Bay Rays are rolling, manager Kevin Cash is focused on playing, not retaliating.",
        "Cash stated as much after his star outfielder Randy Arozarena was struck twice by pitches Friday night after his first-inning home run in the Rays' 5-4 win over the New York Yankees in St. Petersburg, Fla.Cash was ejected after warnings were issued in the fifth inning following Arozarena's second hit-by-pitch.\"Randy's really a pro,\" Cash said postgame. \"He does a lot. Entertains the fans, but when it's time to handle things, he seems to handle them very well.\"Will there be any carryover?\"I hope not,\" Cash said. \"I'll speak for our club. Just go play baseball. I certainly hope not.\"Cash also didn't think the Yankees intentionally threw at Arozarena.Tampa Bay, the American League East leaders, are now 10 games ahead of the last-place Yankees.On Saturday, the Yankees will look to even the weekend series. They will turn to right-hander Domingo German (2-2, 4.46 ERA), who is coming off an outstanding outing against the Cleveland Guardians.German worked 8 1/3 innings of one-run ball on Monday, but the 30-year-old was lifted after throwing 88 pitches and the Yankees eventually lost 3-2.In his career, German is 3-2 with a 5.64 ERA against Tampa Bay in 11 appearances (nine starts).With 69 homers as a team, Tampa Bay paces the majors by a wide margin over the Atlanta Braves, who are second with 55 long balls. Cash attributes the power surge to players making better swing decisions.",
        "\"Basically, getting pitches you can handle,\" Cash told the Yankees pregame radio show on Friday. \"Everybody wants to hit the ball hard, hit the ball in the air and hit it far. But you can't do that with every pitch. There were times last year that maybe we got humbled, that we were swinging a little bit too much on pitches we couldn't do damage with.\"One of the reasons for the Rays' early success is their ability to score first. They are 22-0 in such games.Tampa Bay will give the ball to right-hander Drew Rasmussen (3-2, 3.66 ERA) on Friday.Rasmussen has made two career appearances (one start) against the Yankees and has gone 1-0 and without allowing a run in 8 1/3 innings. In head-to-head matchups, Rasmussen has fanned 13 and not walked a batter.While the Rays have been rolling, the Yankees are aiming to patch up holes on a depleted roster.Aaron Judge is on the injured list with a right hip strain. The hope is the reigning American League Most Valuable Player will return on Monday to oppose the Oakland A's.On Friday, Harrison Bader belted a three-run homer to account for the majority of New York's offense.Yankees manager Aaron Boone tipped his hat to the Rays' success ahead of the start of the series.",
        "\"(They make) really sound moves of when to be able to move on and finding those diamonds in the rough throughout Major League Baseball that they bring in, all while maintaining a top-line farm system that they can always kind of grab people from,\" Boone said. \"I think you got to respect them as one of the more well-run teams certainly in baseball, but in sports. They do a great job.\"--Field Level Media"
    ]
}