{
    "articleURL": "/wires/pa/article-12048875/Lower-tolerance-disruptive-protests-Windsor-coronation--police.html",
    "content": [
        "Disruptive protests in Windsor will be treated with a “lower tolerance level” during the coronation weekend, police have said.",
        "Assistant Chief Constable Christian Bunt, of Thames Valley Police, said “just a bit fewer than 1,000” officers will be deployed as part of their operation during the bank holiday weekend.The officer told reporters no pre-emptive arrests have yet been made, and the force is not expecting to use the new legislation banning serious disruption in Windsor during the coronation celebrations.Despite the Metropolitan Police previously saying they were considering using facial recognition technology on crowds, Mr Bunt said his force is currently “not yet in a position to use it”.He told reporters helicopters would be available as well as a range of armed and unarmed patrols.Mr Bunt, who was in charge of the firearms operation for the late Queen’s funeral last year, is due to lead Thames Valley Police’s deployments over the coronation weekend.",
        "Officers will be stationed at the big screens in front of Windsor Castle on the Long Walk during the coronation’s ceremonial activities on Saturday, the Big Lunch on the Long Walk on Sunday, followed by the concert in the castle grounds, which is due to host 20,000 people.Commenting on potential protests in Windsor, Mr Bunt said: “We’ve not had any protest groups or individuals show an interest in protesting in Windsor up to now.",
        "“But I am alive to the fact that we could get protests in Windsor over the weekend.“My policing operation has planned for this. We will be consistent and fair in our response as we always are, and we have got lots of experience in Thames Valley Police with facilitating protests.“Thames Valley Police respects the rights of those wanting to protest peacefully and legally, and we are experienced in doing so. Our response will be lawful and proportionate.” Due to the nature of this event, I will be adopting a lower tolerance level for any disruption, protest or otherwise  Assistant Chief Constable Christian Bunt  Mr Bunt said the force has been planning the operation for months, which started with uniformed officers being sent to the area on Thursday.He continued: “I would encourage any individuals or groups who are looking to protest in Windsor over the weekend to make contact with us at the earliest opportunity.“We will have a range of specialist officers in place to support our response to protest.“Due to the nature of this event, I will be adopting a lower tolerance level for any disruption, protest or otherwise.“This includes action that undermines the safety of the event or poses a serious risk of disruption to the celebrations.”",
        "The police presence in Windsor is set to increase over the weekend, with the largest number of officers being deployed for the concert on Sunday.Speaking about the resources at his disposal, Mr Bunt told reporters they had drone capability, specialist investigation teams, security screening and barriers to prevent vehicles causing danger to the public.Officers from across Thames Valley Police are set to be deployed to the area, with around 80-90 being sent from other forces. We will not be using facial recognition within the Thames Valley part of the operation in Windsor  Assistant Chief Constable Christian Bunt  “This will include a range of specialist teams such as firearms, road policing, mounted section, intelligence officers, specialist search officers and a large number of officers who are trained in public safety and public order,” Mr Bunt said.Asked if the force had plans to use facial recognition technology alongside a watch list of people that officers believe pose a risk to public safety, he replied: “The easy answer is no.“We will not be using facial recognition within the Thames Valley part of the operation in Windsor.“We’re not yet in a position to use it as a force and I have other tactics available which I can use to provide some of that same effect in Windsor.",
        "“I’ve got intelligence officers, behavioural detection officers and a range of covert officers that will be deployed on the ground that will be providing some of that capability for us.”"
    ]
}