{
    "articleURL": "/travel/article-12052105/I-traveled-five-time-changes-two-weeks-10-tips-beating-jet-lag.html",
    "content": [
        "Collette Reitz from Chicago traveled through five time zones in two weeks Despite her whirlwind itinerary she managed to avoid jetlag Pre-planning an itinerary and exercising after landing are among her tipsEver feel frazzled stepping off a flight, with a new time zone sending your mind and body into a spin?",
        "Well, in a bid to help travelers stave off symptoms of jet lag a globetrotter has share ten of her expert tips. Collette Reitz from Chicago recently traveled through five time zones in two weeks. Between February 23 and March 12 she told Insider that she 'flew from Chicago to Los Angeles (two-hour time difference), to London (eight-hour time difference), back to Chicago (six-hour time difference), and then to New Zealand (17-hour time difference).'Despite her whirlwind itinerary Collette - who works as a journalist - managed to avoid jetlag and 'really enjoy the places I visited.' Fly down to learn about some of her remedial tricks.",
        "1. Try your best to sleep on the planeDuring her biggest time changes, Collette said she tried to sleep on the plane when she knew it was nighttime at her final destinations. For those traveling in business and first class, sleeping is much easier but in economy, the travel pro says it's essential to try and 'snag a fully open row of seats to stretch out, or book the emergency exit row for more legroom.' During her 16-hour flight from Chicago to New Zealand she was lucky to fly business-premier class with. She revealed that this meant she scored 'a surprisingly comfortable fold-out bed, and I slept for about eight hours, on and off.'",
        "On landing at 7am, she was a 'little groggy' but after a quick bathroom refresh, she felt ready to seize the day.  2. Don't sleep when you land - unless it's nighttime Even though you might feel sleepy, Collette says you must push on if you land during the day to increase your chances of sleeping well that night. The frequent flyer suggests booking an activity in, as a way of forcing yourself to stay awake. For instance, when she was in London she booked a Harry Potter walking tour. She explained that this was 'something to look forward to' but also 'a great way to see popular tourist attractions within hours of landing in the city.'3. Create an itinerary before you travelTo keep the momentum going during your trip, Collette suggests creating a detailed itinerary before you travel. She explains: 'Having something to look forward to usually helps me push past drowsiness, and I suggest you pick out some must-see sights for your first couple of days.'In London, for instance, she scheduled in a number of things for her first two days to help fuel her excitement, with the highlights including a proper afternoon tea and a trip to Westminster Abbey. ",
        "4. ... But don't force early morning activities to begin with",
        "Collette says it's best to avoid forcing early morning activities to begin with as it will take your body a couple of days to acclimatize.Even if you are an early riser, the traveler recommends straying from your standard routine. When she flew from Los Angeles to London, she said she 'initially didn't schedule anything before 10am.'She added: 'I needed sleep, and I didn't feel like I missed out on seeing anything I really wanted to.'5. Do some exercise and soak up the daylightIn every city she visits, Collette says she loves going for a run.Not only this a great way of exploring new places but she points out that 'according to the Mayo Clinic, exposing yourself to daylight at certain times can ease your body into the new time zone.'When she landed in New Zealand, Collette fought off the urge to take a nap and opted for a three mile trail run by her hotel instead. After dinner, she said the exercise session also helped her to sleep better.  6. Listen to your bodyWhile it's easy to set rules, Collette says it's more important to listen to your body. She explains that, according to the Mayo Clinic, 'your 'sleep-wake' cycle can go out of sync when you switch time zones... so sometimes you need to give yourself grace.'",
        "For instance, if you get to your hotel room and feel incredibly sleepy, take a 30-minute power nap and set an alarm. That way you are giving your body what it wants without wiping out a day or an evening. ",
        "7. Be flexibleFollowing the same line of thought as 'listening to your body', Collette says it's important to be flexible. Power naps will help revive you so you can enjoy any activities on your agenda rather than feeling groggy.While you might feel like you're missing out by taking some 'shut eye' in the middle of the day, it's always possible to reschedule things and Collette tells travelers: 'Don't let your schedule prevent you from being in the moment.'  Sometimes mixing things up and going with the flow brings you the best experiences.  8. Drink plenty of waterA golden rule among the travel community when it comes to flying is to stay hydrated. Collette said on one of her flights, she drank her entire 32-ounce reusable water bottle and had to ask for a few more bottles. While she had to use the bathroom more than she would have liked, she said the frequent lavatory visits gave her the opportunity to stretch her legs, so it 'felt like a win-win.' ",
        "9. Don't depend on caffeine too muchHaving a cup of coffee at midday to keep you pepped up is 'probably fine,' Collette says, but it's best to avoid caffeine in the evening. Sometimes having caffeine later in the day can effect sleep patterns. Instead of relying on shots of espresso to pull you through, Collette suggests having an early dinner and bedtime. For her, she says this generally helps her to feel more refreshed the next day. 10. Don't plan too much for your returnOn your return, Collette recommends planning as little as possible. She explains: 'It's hard to fully avoid jet lag, but it's easier to adjust if you're not coming home to a packed schedule.'Ideally, she says it good to book in an extra vacation day for when you get home so you can get your energy levels back on track. "
    ]
}