{
    "articleURL": "/femail/article-12051383/Workers-share-best-kept-industry-secrets-field.html",
    "content": [
        "People in US and UK on Reddit have shared details from respective industries READ MORE: Doctor reveals her simple trick to getting rid of garlic breathPeople have shared what goes on behind the scenes of their respective industries in a very enlightening thread. ",
        "Workers have taken to Reddit to share the little-known facts in their field, including lawyers, doctors, zoo keepers and call centre workers who claim the person on the other end can listen in to what you're saying when you're on hold. Hotel workers from the UK revealed the grim realities of working in their establishment, including the fact that bed bugs are more common than people think. Meanwhile, a lawyer in the US revealed that if a solicitor charges you a lot of money upfront, your case might have a low rate of success. And a bartender has admitted that if you ask for a 'strong drink,' at the bar, the person serving you will nod and give you a normal drink. ",
        "One person revealed that a team that's passed drug tests is not the same as a drug-free team, because companies have their ways of bending the rules. 'My dad's company needs a certain amount of “random drug tests” a year so my dad is “randomly” chosen once a month cause they know he’s one of the only ones that will pass haha! Talk about taking one for the team,' another revealed. Meanwhile, a UK hotel worker revealed the reality behind hotel booking issues. 'When a guest is told their room that they booked has had to be taken offline due to a maintenance issue and they have been found a room in another hotel close by means the hotel f***** up and overbooked the hotel or the room has bed bugs,' one said. ",
        "'Or the guests before made a mess and trashed the room worse than the cleaning crew had time to fix,' another added. Another hospitality worker also shared their secrets from behind the reception desk. 'If you want an upgraded room, just give the front desk a nice tip while asking,' they said. 'Keep you door latches shut whenever possible, another guest or staff could walk into your room at anytime. It doesn't matter how high class the hotel it happens all the time,' they added. They also said that people die in hotels all the time and that bed bugs are a common occurrence.   ",
        "A US lawyer working in employment law explained that the higher you are asked to pay upfront, the weaker your case might be.  'The price of a lawyer can be entirely dependent on your case. If you have a very strong case and with a high likelihood that it will be paid out in a significant amount of money, then chances are a lawyer will be willing to take it on at a low retainer or even on a contingency basis (as in they don't get paid until the case is resolved and they only get paid part of the judgment/settlement),' they explained. 'If a lawyer is going to charge you a lot of money upfront or request a high retainer that means the case may either be not as strong as you think it is, or the chances it gets paid out will be somewhat small,' they added. ",
        "'But yeah, if you make a post on Reddit and all the commenters are saying \"You have a strong case, go to a lawyer and get paid.\" And then the lawyer wants to charge you a high fee upfront, take this advice into consideration,' they went on. Meanwhile, someone working in maintenance revealed that thermostats in offices are not meant to actually work. ",
        "'Sometimes thermostats in offices are only there to make the occupants feel good,' they said. 'They appear to change the temperature but on the back end of the system they are locked out or limited to 1 or 2 degrees. 'This placebo keeps people happy because they have some control over their environment. Other times, the unit is just broken,' they added. A bartender revealed that you won't get more alcohol by asking a bartender for a 'strong drink,' even if they agree with your request.  'If you ask a Barkeeper to make you a strong drink they’ll say \"sure thing\" - and make you a standard one,' the hospitality worker revealed, adding: 'Unless you’re a well tipping regular.'However, another bar worker revealed that you can get a strong drink, but it will just have less mixer and not more alcohol. Someone working in movie animation revealed the very strict rules cartoons and shows have to adhere to in the US.  ",
        "An insurance worker revealed that people do indeed listen to the recordings of your phone calls made when you've contacted a company. 'There’s an entire industry surrounding aggregating and analyzing the data from those calls and how they went from a compliance and QC perspective,' they said.'Also found out they can listen to your personal conversations while you are on “hold”. 'Had a friend find this out when he made incriminating remarks about a damaged package claim to his buddy, while the elevator music played,' they added. A nanny in the US revealed that she never tells parents that their babies have actually done something for the first time in front of her so they can enjoy it.'I'm a nanny. And no, your child will never say their first word in front of me without you around. Your child will never take their first step without you around,' she said. 'I will only ever say, \"You should keep an eye out, I think they're going to... for the first time soon!\" 'I always do my best to allow parents to experience that First Time on their time (even if it wasn't actually the first time),' she added. And an intern zoo keeper shared the grim but hilarious reality of looking after animal. ",
        "'Take a deep breath before opening the cathouse door, shovel two shovelfuls of lion dung and catp***-soaked bedding into the wheelbarrow, sprint out the door before you run out of breath, make sure you're 10 feet away from the door, inhale again, run back in, repeat,' they said. 'You puke instantly if you inhale in there,' they added. "
    ]
}