{
    "articleURL": "/tvshowbiz/article-12046311/Joe-Swashs-fake-tan-DISSOLVES-mouth-Im-Celeb.html",
    "content": [
        "I'm A Celebrity viewers were left in stitches during Thursday's episode as Dean Gaffney repeatedly vomited during a gruesome drinking challenge.",
        "I'm A Celebrity South Africa newcomers Joe Swash, 41, and Dean Gaffney, 45, continued to dominate the air time on Wednesday night's show and rightly so. The second half of their devilish drinking trial continued, which had viewers branding the former EastEnders stars 'comedy gold.' Joe's heavy use of fake tan and his thicker hairline was noted during the first half of the trail which aired on Tuesday night.But during part two, his fake tan application came a cropper after he had to down a potent mix of blended eyeballs in order to win treats for camp. ",
        "Joe was left gagging and with an almost luminous ring of white juice around his mouth after drinking the disgusting substance. Dean hilariously told him: 'You've got a little something around your mouth' which was something of an understatement. And the next time the cameras cut to Joe, the white substance was gone - and so was a ring of fake tan around his mouth.Next up was Dean, who after drinking a foul creation, which caused him to projectile vomit and then break wind. But Dean clearly forgot that his microphone would make it sound much louder and he was left red-faced as host Ant McPartlin shouted: 'Did you just fart?'Taking ownership of it, Dean shouted back: 'yes' causing everyone to fall about in heaps of laughter. ",
        "Viewers tweeted: 'Whoever on #ImACeleb made the decision to put Dean Gaffney and Joe Swash on a trial together deserves a raise.. GOLD''Whoever came up with the idea for making Dean Gaffney &amp; Joe Swash do a drinking trial is a genius! This is about to be comedy gold  #ImACelebrity #ImACeleb.'",
        "'Dean Gaffney and Joe Swash are the comedy duo I never knew I needed #ImACeleb.'The night before, Dean got more than he bargained for when he was greeted with a mixture of animal penis and vagina which made him gag before he even took a gulp.Ant Declan The trial - which Dean completed with fellow new arrival Joe - went down a treat with viewers who proclaimed it one of the best Bushtucker Trials ever.One viewer proclaimed: 'That trial with Joe &amp; Dean is hands down the best trial ever. Dean's entry trial when he was first in it was always my fave, but this was better.'Another said: 'That has to be the funniest but most disgusting trial I've ever seen.  Dean Gaffney and Joe Swash too funny together.'A third wrote: 'Watching Dean and Joe do that trial has put me off my tea,' while a fourth added: 'Well done Dean and Joe. Brilliant trial.'A fifth said: 'The highlight of my day [was] watching Dean Gaffney projectile vomit a cow penis smoothie.'",
        "Another added: 'Ant asking Dean if the blended chicken testicles is chickeny so he vomits again is insane television.'  ",
        "Dean and Joe were late arrivals to camp on Wednesday's episode and had to complete the trial to win treats for their fellow campmates. Former I'm A Celebrity winner Joe, 41, was voted champion by the public on his first run on the series in 2008.Dean took part in the 2006 series where he finished in fifth place.It comes after Amir Khan was voted off I'm A Celebrity during Tuesday's show.",
        "The 36-year-old sports star became the third celebrity to leave the ITV show, after being voted off in a secret ballot.Before announcing the latest departure, Dec told the campmates: 'You all know why we’re here this morning - last night we left you with the news that someone would be leaving camp as a result of a secret ballot...'Amir was then announced as the latest celebrity to leave the camp.The former boxer - who retired from the sport in 2022 - insisted appearing on the show has been one of the 'best experiences' of his life.However, Amir also admitted that he felt ready to leave the camp and return home to his family.",
        "He said: 'It was one of the best experiences I’ve ever had. It’s like I got to be with a new family in South Africa.",
        "'I’m always going to compare it with my first time in Australia but this one, for me, was way better. Great camp, the campmates were amazing.'Even though I would have loved to have stayed in a little bit longer, sometimes what can happen is, if you stay longer, you can outstay your welcome.'It was just a great experience and I’m just glad I had the opportunity.'"
    ]
}