{
    "articleURL": "/wires/ap/article-12049239/Democratic-US-Sen-Martin-Heinrich-seeks-3rd-term-NM-seat.html",
    "content": [
        "SANTA FE, N.M. (AP) - U.S. Sen. Martin Heinrich announced Thursday that he will run for a third term next year as he champions causes from gun safety to abortion access to a transition toward cleaner energy in New Mexico, a major oil-producing state.",
        "A win by the state's senior senator would extend Democratic domination of New Mexico´s Congressional delegation. Heinrich won a second term in 2018 in a three-way race against a Republican political newcomer and former Gov. Gary Johnson, who ran as a Libertarian.Heinrich announced his candidacy in an online video that also highlighted federal spending on roads, bridges and wildfire relief.Heinrich's initial campaign pitch to voters touches on his advocacy for expanding early childhood education, as well as 2022 federal legislation toughening background checks for younger gun buyers and keeping firearms from more domestic violence offenders.\"We have to continue the transition to clean energy, and we have to build upon our historic investment in early childhood education,\" Heinrich said.Heinrich is chairman of the Senate's joint economic committee and sits on others overseeing intelligence services and policy on energy and natural resources.Immediate endorsements came from influential state Democrats including newly elected Attorney General Raúl Torrez and House Speaker Javier Martínez of Albuquerque.No candidates have emerged yet to challenge Heinrich.He may have influenced the course of abortion rights in New Mexico with his endorsements in 2020 of Democratic state Senate challengers who ousted incumbents who had voted against overturning a ban on most abortion procedures.The following year New Mexico´s Democratic-controlled Legislature repealed the dormant 1969 statute, ensuring access to abortion after the U.S. Supreme Court overturned Roe v. Wade last year."
    ]
}