{
    "articleURL": "/wires/reuters/article-12053177/Brandon-Nimmos-homer-lifts-Mets-Rockies.html",
    "content": [
        "Brandon Nimmo homered and Kodai Senga tossed six scoreless innings as the New York Mets snapped a three-game losing streak with a 1-0 win over the visiting Colorado Rockies on Friday.",
        "Senga (4-1) allowed two hits with four walks and four strikeouts while throwing a career-high 101 pitches. Drew Smith and David Robertson followed before Adam Ottavino stranded a runner at third base in the ninth for his fourth save.Colorado saw its season-high four-game winning streak come to an end after being held to five hits. Antonio Senzatela (0-1) made his season debut and gave up one run on three hits over five innings. He walked one and struck out three.Nimmo also doubled and reached base three times for New York, which recorded its 111th straight win when leading after eight innings.Senzatela retired the first nine batters he faced in order before Nimmo deposited the first pitch of the bottom of the fourth inning into the right field bleachers. The 399-foot shot was Nimmo's third home run of the season.The Rockies threatened in the ninth against Ottavino when Randal Grichuk hit a leadoff single and stole second base. After Grichuk was sacrificed to third, Mike Moustakas struck out and Charlie Blackmon lined out to right field to end the game.Colorado had runners at the corners with two outs in the eighth when Ryan McMahon's potential game-tying hit struck pinch-runner Brenton Doyle, who was automatically out on the play.",
        "New York held on to win despite going 0-for-6 with runners in scoring position. The Mets have scored a total of two runs in their last three games.Senzatela, who was making his first appearance since tearing the ACL in his left knee last August, escaped an early jam when Elias Diaz lined out with two runners on to end the first inning.The Mets put runners on the corners against Senzatela with two outs in the fifth before Tomas Nido grounded out. New York went on to post its first 1-0 victory since beating the Philadelphia Phillies by the same score on Aug. 13, 2022.--Field Level Media"
    ]
}