{
    "articleURL": "/wires/reuters/article-12050613/CEE-MARKETS-Emerging-European-currencies-flat-low-liquidity.html",
    "content": [
        "WARSAW, May 5 (Reuters) - Central European currencies were broadly flat on Friday, ending a week of holiday-related low liquidity. Markets in the Czech Republic, Hungary and Poland were closed on Monday with the latter also observing a day off on Wednesday, leading many traders to take extra time off. The Polish zloty hovered at 4.5850 per euro at 1001 GMT, broadly flat versus Thursday and just off an 11-month high seen on Tuesday amid thin trading. \"We are still in this atypical period. Perhaps the volatility isn't as high as in the first half of the week, but this is not normal trading yet,\" ING economist Piotr Poplawski said. \"Investors' interest seems to have shifted beyond the region...,\" he added. In Poplawski's opinion, investors have covered their positions against Central European currencies, especially the zloty, and are waiting to see what comes next for the region. \"We are a bit worried that this wave of optimism, probably related mainly to the weakening of the dollar, has run its course for now and there is room for some kind of rebound, i.e. a rise in the EURPLN.\" Elsewhere the Hungarian forint traded at 373.1500 and Czech crown at 23.4200 against the euro, both also broadly flat. CEE SNAPSHOT AT MARKETS 1201 CET CURRENCI ES Latest Previous Daily Change bid close change in 2023 Czech 23.4200 23.4330 +0.06% +3.15% crown Hungary 373.1500 373.0000 -0.04% +7.05% forint Polish 4.5850 4.5840 -0.02% +2.28% zloty Romanian 4.9265 4.9289 +0.05% +0.32% leu Serbian 117.2400 117.3000 +0.05% +0.05% dinar Note: calculated from 1800 CET daily change Latest Previous Daily Change close change in 2023 Prague 1382.38 1385.840 -0.25% +15.03% 0 Budapest 46286.76 46322.50 -0.08% +5.69% Warsaw 1908.50 1884.32 +1.28% +6.50% Bucharest 12188.42 12158.77 +0.24% +4.50% Ljubljana 1227.14 1226.65 +0.04% +17.00% Zagreb 2242.40 2244.68 -0.10% +753.37 % Belgrade &amp;lt;.BELEX15 904.57 904.89 -0.04% +9.70% &gt; Sofia 612.89 613.72 -0.14% +1.90% Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic 2-year &amp;lt;CZ2YT=RR 5.7750 -0.2250 +319bps -28bps &gt; 5-year &amp;lt;CZ5YT=RR 4.9740 -0.1670 +278bps -23bps &gt; 10-year &amp;lt;CZ10YT=R 4.5300 -0.0180 +228bps -8bps R&gt; Poland 2-year &amp;lt;PL2YT=RR 5.7640 0.0030 +318bps -5bps &gt; 5-year &amp;lt;PL5YT=RR 5.7720 0.0140 +358bps -5bps &gt; 10-year &amp;lt;PL10YT=R 5.7940 0.0150 +354bps -4bps R&gt; FORWARD 3x6 6x9 9x12 3M interban k Czech Rep &amp;lt; 7.27 6.83 6.08 7.18 PRIBOR=&gt; Hungary &amp;lt; 14.55 12.81 11.57 16.20 BUBOR=&gt; Poland &amp;lt; 6.70 6.40 5.90 6.90 WIBOR=&gt; Note: FRA are for ask prices quotes ************************************************** ************ (Reporting by Karol Badohal in Warsaw Editing by Mark Potter)"
    ]
}