{
    "articleURL": "/columnists/article-12039259/STEPHEN-GLOVER-Starmer-hide-Sue-Grays-evasions-ever.html",
    "content": [
        "Sir Keir Starmer has made a great deal of his supposed honesty and integrity. This was an easy enough gig while Boris Johnson was prime minister.Everyone knew about Boris's falsehoods before he set foot in No 10, and the Partygate scandal has served to confirm in many minds that he is not to be trusted.The Labour leader, by contrast, has traded on his straightforwardness. He is a former Director of Public Prosecutions, after all, and a senior lawyer. Even critics who found him dull and unimaginative have been inclined to accept that he is trustworthy.True, 'Beergate' — Sir Keir was photographed swigging from a bottle of beer at a time when gatherings were banned during the pandemic — led to the imputation of hypocrisy. But in the end Durham Police decided that he had no case to answer.Meanwhile, some of us had also noted he has changed his mind on more key policies within a short space of time than any other leading British politician in the modern era — a trait that suggests poor judgment or an absence of integrity, or very possibly both.",
        "Last night, the Government produced an 'update' into possibly irregular contacts that former senior civil servant Sue Gray may have had with the Leader of the Opposition. I strongly suspect that buried in this generally nondescript short document is a bomb which will eventually detonate.Ms Gray is the mandarin who wrote a report into lockdown-breaking parties in Downing Street, published last May, which found countless breaches of Covid rules. Two months ago, Sir Keir Starmer made her his chief of staff, a job she can't yet take up, because of her recent role as a civil servant, until given an official all-clear.In the past day or two, there have been leaks to the Press alleging Ms Gray had secret talks with Sir Keir Starmer while she was working for the team advising the Commons Partygate investigation into Boris Johnson. ",
        "There were no such revelations in the written statement issued last night by Deputy Prime Minister Oliver Dowden, which may have been neutered by a timorous Government, overzealous lawyers or civil servants anxious to defend someone once their own.Further updates are promised, which could be embarrassing to either Sir Keir or Ms Gray. Meanwhile, there is one astounding disclosure in the thin gruel we've so far been offered: Sue Gray declined to cooperate with the Cabinet Office inquiry that led to this update.Here is a woman who conducted her own extensive investigation, and expected dozens of people working in Downing Street to submit to her questioning. They did so — including Boris Johnson himself. And yet the same exacting senior mandarin can't bring herself to take part in an official inquiry into her own — and Sir Keir Starmer's — rumoured contacts.Many people will reasonably assume that only a person who has something to hide is likely to be reluctant to assist in such an inquiry. What does the former Second Permanent Secretary in the Cabinet Office — the same department trying to get to the bottom of things now — have to conceal?So the update is bound to lead to more questions about the meetings which Sir Keir or Labour colleagues may have had with Sue Gray, and their timing. If it transpires that she had secret get-togethers with representatives of the Opposition, there will be justifiable outrage.One pertinent question is whether there was any kind of conspiracy between the woman who was in charge of a very important inquiry — one that inevitably centred on Boris Johnson — and the Labour Party, which had a political interest in inflicting as much damage on the then Prime Minister as possible.We can't yet say whether Ms Gray has broken the Civil Service Code, which specifically enjoins impartiality and honesty. If it turns out that she did, there could be no more compelling evidence of the anti-Tory bias in the upper echelons of what is laugh- ably extolled as our neutral Civil Service.Disquieting though Sue Gray's refusal to cooperate with the Cabinet Office inquiry undoubtedly is, she isn't the ultimate focus of this story. That accolade must go to Sir Keir Starmer because he is leader of Her Majesty's Opposition and aspires to be the next Prime Minister of the United Kingdom.Sir Keir maintained on BBC Breakfast yesterday morning: '[The public are] not sitting at their breakfast talking about Sue Gray, they're talking about their bills.' I doubt this is true. People will want to know exactly what happened, and when, between Sir Keir and Sue Gray.It is simply not good enough for Ms Gray on the one hand to refuse to talk to the inquiry, and Sir Keir on the other to bluster about the public not being interested, and the Tories employing distraction tactics. Does this affair throw a revealing light on a senior civil servant who investigated Boris Johnson, as well as on Sir Keir's veracity?What we might call Sir Keir Starmer's moral unreliability was on show yesterday in another way. During an interview on Radio 4's Today programme, he appeared to admit — amid much waffle and attempted evasion — that Labour was abandoning its plan to abolish university tuition fees.A pledge to get rid of fees was included in two party manifestos, and reaffirmed by Sir Keir in his successful leadership campaign is 2020. Yet he disposed of this key policy almost as though it were an afterthought, without giving any clue as to what Labour will do instead to fund university students.There was a similar volte-face over Labour's plan to increase tax for the top five per cent of earners, again without any explanation other than to say that with tax at a 70-year high this is no time to put it up any further. Of course, this is a welcome development. It just seems there is very little clear thought behind it.What does Sir Keir Starmer really believe? There seems to be a moral vacuum at the centre of the man, which suggests a kind of dishonesty. In a remarkably short period of time, he has changed his mind on trans rights, free movement, Brexit and a host of other subjects — not least Jeremy Corbyn.Sir Keir fought alongside Mr Corbyn (whom he once described as a 'friend') in the 2017 and 2019 general elections, before dumping him and depriving him of the Labour whip. Whatever may be thought of Jeremy Corbyn, at least he was consistent and, in his way, principled. You knew where he was coming from. That emphatically can't be said about the present Labour leader.As for Sue Gray, however obstructive she has been, and will presumably continue to be, this update won't be the end of the matter. I hope the Government doesn't misguidedly continue to offer her a form of protection. I'm quite sure the media will not be so indulgent.Her transparency isn't, as I say, the only important issue. Sir Keir Starmer won't be able to hide behind her evasions for ever. In the end we are going to find out just how honest and truthful the Labour Leader really is."
    ]
}