{
    "articleURL": "/property/article-12046993/Return-Commuterville-Brits-fleeing-countryside-homes-commuter-belt-properties.html",
    "content": [
        "Many living in countryside areas are now moving into so-called 'Commuterville'Experts say this comes as more companies call for workers to go into the office**Have you returned to a commuter area? Email mark.duell@mailonline.co.uk** Britons are falling back in love with homes located in commuter zones as more companies call for their workers to go into the office again, a study has revealed.",
        "Property experts said many people living in small towns, villages or the countryside are now moving into so-called 'Commuterville' - but not all the way back into cities.The proportion of people leaving small towns or villages to move to commuter areas has risen to 41 per cent at the start of this year, up from 31 per cent this time in 2022.And data from the estate agents Hamptons also found the percentage of people leaving the countryside for the commuter belt rose to 37 per cent from 28 per cent.They defined 'Commuterville' as areas around larger cities, typically served by faster non-stop commuter trains or that are 30 to 45 minutes' drive from a city centre.",
        "The study shared with MailOnline also found prices in cities rose furthest and fastest between 2009 and 2014, then it was 'Commuterville' from 2015 to 2017, then smaller towns and villages in 2018, and then the countryside between 2019 and 2022.",
        "They said much of this was down to the house price cycle, with southern cities driving the recovery imminently after the 2007 crash, with growth rippling out across the rest of the country a few years later.While countryside prices were picking up just before the pandemic began, growth here was extended and boosted – but Hamptons now thinks it has been 'Commuterville' which has seen the most growth in early 2023.",
        "Some specific areas of 'Commuterville' have seen huge percentage growths in house prices when the last three months of 2022 are compared to the same period in 2021.Top of the list is Saffron Waldon in Essex, a commuter town for Cambridge, where average prices were £460,590 by the end of 2022, up 19.9 per cent in a year.Next is Foxwood near York, where prices rose 19.7 per cent to £346,770; and behind that is Honiton near Exeter, posting a 19.5 per cent rise to £298,180.Also in the top five are Shoreham-by-Sea near Brighton, up 18.9 per cent to £496,200; and Horndean near Portsmouth, up £401,580 to 18.2 per cent.Completing the top ten are East Grinstead near London (£494,490, up 18 per cent); Clacton-on-Sea near Colchester (£276,300, up 17.4 per cent), Witney near Oxford (£373,170, up 17.2 per cent); Eastleigh near Southampton (£338,240, up 16.9 per cent); and Rugby near Coventry (£321,980, 16.6 per cent).",
        "Speaking about the top ten, David Fell, senior analyst at Hamptons, told MailOnline: 'While these price growth figures will undoubtedly come down this year, we still think they're likely to be the areas with the highest growth and smallest falls.",
        "'These areas in particular have benefitted from hybrid working, meaning they can offer a commute which isn't too punishing two or three days a week, alongside the larger home at a more affordable price for the days spent working from the study.'",
        "The turnaround follows a property boom in remote parts of Britain soon after the pandemic began in 2020, when city workers fled for a quieter life to make the most of working from home.But buyers who are now having to spend more days in the office again are looking for quicker and cheaper transport links, which are provided by commuter towns.Others who have moved into the countryside have faced travel misery thanks to the now-regular rail strikes affecting train services – and are said to now be preferring a shorter commute. Speaking to The Times, young professionals Joni and Johan Rasmussen, both in their 30s and with a young son, described how the demands of working from the office meant they had to be 'realistic' with where they looked. During the pandemic they looked at moving to the West Country, but eventually went for a property in Cobham, Surrey, which has direct train services to their jobs in offices in Vauxhall and Waterloo where they had to be for at least some days of the week. Mrs Rasmussen said: 'There was a big beautiful house we looked at in the Cotswolds, but it wasn't even close to a local station and we thought, while the pandemic has changed professional working practices for ever, we have to remain realistic. It was that delicate balance.'",
        "But others who have moved out into the sticks have maintained that just because an area is remote, it is not uncommutable. ",
        "Sue Bailey and her husband Mark Dyson, both in their 60s, bought a six bedroom house in Felliscliffe, North Yorkshire, right in the heart of the Dales and said the area had very good travel links. Ms Bailey told the Times: 'We're in the middle of a beauty spot, but we found that everything was really close. Leeds Bradford Airport is 23 minutes away, and there are four flights per day to Palma de Mallorca. Trains go from Harrogate to Leeds in half an hour, while Manchester takes two hours.' However the couple have now retired and are selling their house for £1.9million with Carter Jonas. Jemma Scott, partner at The Buying Solution buying agency, told MailOnline: 'There is a big focus back on circa 30 minute commutes into London and prices in these areas are reflecting this demand.'She said the main winners were Woking and Weybridge in Surrey, Beaconsfield in Buckinghamshire and Berkhamsted in Hertfordshire.Ms Scott added that they were 'all beautiful towns and a dream commuter wise – at 23 to 31 minutes depending on time of travel' and said they are 'the few home county towns which can claim sub 30-minute commutes into London'.",
        "Research by estate agency Jackson-Stops found 38 minutes is the new 'Golden Hour' commute, with most prospective homebuyers now willing to spend that period commuting into work.",
        "It found over a third commute to their place of work more now than six months ago, and just 3 per cent would be willing to commute for more than two hours.Some 31 per cent of the 500 active house hunters surveyed said they commute five days a week or more to work, with those in London and the South West most likely to commute five days a week or more (45 per cent each).Meanwhile 37 per cent want to live in and commute from a city while 33 per cent preferred a town – a rise from 21 per cent who wanted to live in a town in 2019.Nick Leeming, chairman of Jackson-Stops, said: 'Calls for people to get back to the office more regularly have once again put a manageable commute back on the radar of prospective buyers.'We have much faster train links than we did even five or ten years ago, bringing those peripheral town locations with fantastic transport options back in vogue. 'Urban living remains popular as buyers strike the balance between convenience and commutability.'The study also found residents in Northern Ireland on average favoured the shortest commute at 27.5 minutes, whereas those in the East Midlands would be happy to commute the longest at 47.6 minutes.",
        "Ian Denton, director of the Jackson-Stops branch in Northampton, said: 'Working patterns are certainly dictating where buyers choose to call home.'Until September last year, and the synonymous mini-Budget, the halfway house of two days from home and three in the office had become the accepted norm. A longer commute on a part-time basis became a worthy compromise.'However, a renewed push by employers to get workers back to the office has led some buyers to reconsider their lifestyle altogether. Choosing a place to call home is such a pivotal decision, with our work-life patterns often governing our property wish-lists.'",
        "The quickest and easiest way to save money on home insurance and compare the best buildings and contents policies is to use a comparison site.You will need to know your home's rebuild cost for buildings insurance and  details of previous claims or subsidence. For contents you'll need to know the overall sum to be insured and any high value or special items. Results and prices are likely to be similar across most comparison sites but may differ enough to make it worthwhile checking a couple.  We suggest:Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. MoneySupermarketCompare cheap home insurance from 60 brandsConfused.comGet a quote in less than 8 minutesGoCompareFree £250 excess cover, terms applyUswitchSee what you could save on your home insuranceMail Finance  £15 Amazon voucher with every policy purchased Also check insurers such as Direct Line and Aviva that do not appear on comparison sites."
    ]
}