{
    "articleURL": "/sciencetech/article-12041543/Are-seven-images-videos-evidence-time-travel-real.html",
    "content": [
        "Painting shows a woman 'using an iPhone' in 1860Other artworks seem to show God holding a Sputnik satelliteREAD MORE: Five legendary UFO sightings (and the real explanations) A 19th-century painting that appeared to depict a woman using an iPhone hundreds of years before it was invented ignited the imaginations of social media users who said she may have been a time traveler.",
        "The 1860 work — Ferdinand Georg Waldmüller's 'The Expected One' — is just the latest in a line of evidence of seemingly modern technology cropping up in historical photos and artworks.People are seen with what appears to be satellites and laptops - or with 'modern' clothes such as bulky sunglasses that would not look out of place at a Yeezy fashion show and logo-print T-shirts that didn't become popular until the late 20th century.However, experts told DailyMail.com that this is just a sign of the times. While modern people will see relics of our own time in these devices, those who lived in the time the art was made would easily recognize the maker's intentions.Scroll down to see the seven 'time travelers' for yourself",
        "For example, what we see as a smartphone or a laptop with our modern eyes would be recognized as a prayer book or jewelry box for those who lived centuries ago.Nigel Watson, author of the UFO Investigations Manual, explained to DailyMail.com that these 'tourists of the future' would not be using our current technology if they were realtime travelers'. 'Why would time travelers who come from the future - when time travel is invented - still be using mobile phones?' he explained.'Wouldn't it make more sense if they were using something a little less visible, and had technology we aren't familiar with?'",
        "The Expected OneInternet users pounced on this image as showing a woman 'using an iPhone' - in a painting dating from the 19th century.'The Expected One' is an 1860 painting by Austrian artist Ferdinand Georg Waldmüllerin. It currently resides at the Neue Pinakothek Museum in Munich, Germany.It depicts a distracted young girl walking down a prairie path with a young boy waiting to surprise her with a flower at an upcoming turn.But, the pose and seeming unawareness of what's ahead displayed by the girl seems eerily familiar — it looks like she is looking down at her phone.Gerald Weinpolter, CEO of the art agency Austrian-paintings told MotherBoard, 'The girl in this Waldmüller painting is not playing with her new iPhone X, but is off to church holding a little prayer book in her hands.'Retired Glasgow man Peter Russell told MotherBoard, 'The big change is that in 1850 or 1860, every single viewer would have identified the item that the girl is absorbed in as a hymnal or prayer book.'The time-traveling hipster",
        "In 2011, a photo from 1941 showing a man dressed in modern fashion emerged on the internet.Many referred to the unknown man, wearing sleek sunglasses, with a cardigan over a sweater and an unkempt hairstyle, as the 'time traveling hipster',",
        "Our inability to access the 'now' of someone far away is at the heart of Einstein's theories of space and time.",
        "He looks like a person someone would see today wandering the streets of Manhattan or Los Angeles and stands out among the crowd of time-appropriately dressed people next to him.However, the clothes this fashionable fellow was wearing would make sense for this time.The photograph comes from the Bralorne Pioneer Museum, and captures the re-opening of the South Fork Bridge in Gold Bridge, British Columbia.The sunglasses the man was wearing are wrap-around glasses that first hit markets in the US in the 1920s.His t-shirt also sports the logo of the Montreal Maroons, a professional hockey team that played in the National Hockey League from 1924 to 1938.While his fashion may have been ahead of his time, this man is dressed in clothing that would make sense for 1941.The 'flip phone' at the 1962 World CupBrazil triumphed over Czechoslovakia in the 1962 World Cup final, but it is the device that a photographer is holding that made a picture of captain Mauro Ramos hoisting the trophy infamous.It appears that the person in the media scrum is holding a flip phone, which did not come to the market until 1996 and was not popular until the mid-2000s.",
        "Given that flip phones are now largely out of fashion, it suggests that the time traveler might have come from the year 2007 or thereabouts, when the Motorola Razor ruled the world.The fixation with spotting 21st-century tech highlights how silly such 'time traveler' stories really are, Mr Watson told DailyMail.com.It is likely that this photographer is actually holding a box camera.The time-appropriate device can be controlled with one hand.In this case, it appears to have an attachment fixed atop of it — likely a flashbulb. God, Jesus and a Sputnik satellite",
        "The artwork titled 'Glorification of the Eucharist' by Bonaventura Salimbeni has caught the attention of UFO enthusiasts due to its depiction of what appears to be God and Jesus tinkering with a Sputnik-like satellite.The spherical object in question is a representation of the Celestial Sphere, which symbolizes the universe.Many paintings containing 'UFOs' were highlighted in a book, 'As the Ancient Chronicles Relate' by Roberto Volterri.But art experts dismissed Volterri's claims.Martin Kemp, professor of art history at Oxford University, says 'Many artists used their imaginations to represent celestial or sacred powers.'Ancient Greek statue 'using a laptop with USB ports'",
        "An ancient Greek statue - 'Grave Naiskos of an Enthroned Woman with an Attendant' in The J. Paul Getty Museum in Malibu - seems to show a woman using a laptop.",
        "Or at least that's what internet users believed. But the reality is a little more prosaic.Jeff Hurwit, a professor of art history and classics at the University of Orego said, 'The 'USB ports' are drill holes for the attachment of a bronze object, or perhaps a separate piece of marble.'The 'laptop' is in fact a shallow box or lidded tray from which the woman is about to select a piece of jewelry, as is commonly shown in grave reliefs like this one.'Woman 'using a cellphone' at Charlie Chaplin PremiereConspiracy theorists seized on the fact that a woman seems to be using a cellphone in a DVD extra of Charlie Chaplin's film The Circus.The woman was caught on film at the premiere of Chaplin's movie at Graumann's Chinese Theatre in Los Angeles.The Circus was filmed in 1928: the clip was unearthed by film-maker George Clarke, and became a hot topic of conversation worldwide.But it was debunked - the woman is holding a hearing aid which just happens to be oblong.Speaking to LiveScience, Philip Skroska, an archivist at the Bernard Becker Medical Library of Washington University in St Louis said, 'As you can tell from these, old-fashioned mechanical or resonating hearing aids were not necessarily long and rounded. Short, compact rectangular forms were not unusual.'",
        "Nicolas Cage's 1800's doppelganger",
        "In 2011, an eBay seller attempted to sell an antique Civil War-era portrait for over $1million. The inflated price resulted from the man depicted in the photo bearing a striking resemblance to Hollywood star Nicolas Cage. The unknown man was photographed in 1870 and is believed to have lived in Bristol, Tennessee.After it emerged, many began to speculate that the 'Night at the Museum' star was actually a time traveler or vampire.Jack Mord, the eBay seller who listed the photo for the exorbitant price, even titled it 'Nicolas Cage is a vampire'. Mr Cage addressed the rumors on the David Letterman show, a year later saying, 'Now look I don't drink blood, and last time I looked in the mirror I had a reflection.'So I'm not going with his vampire theory. I'm just not going to do it.'"
    ]
}