{
    "articleURL": "/tvshowbiz/article-12050131/EXC-Eric-Clapton-receives-six-figure-sum-perform-bizarre-restaurant-gig-Lizzie-Cundy.html",
    "content": [
        " The legendary guitarist, 78, who is set to join a slew of A-list stars at Windsor Castle at the weekend, played a number of hits at the champagne soaked soiréeAfter pocketing a hefty sum for the private gig, Eric played for Simon Cowell 's ex Jackie St Clair as she rang in her husband Carl Michaelson's 70th birthday in styleSEE MORE: King Charles III coronation schedule: Full list of events, itinerary and timings for the historic dayHe's a £450million megastar who is ranked as one of the greatest guitarists of all time and even performed at Queen Elizabeth II’s Golden Jubilee. ",
        "But Eric Clapton, 78, chose to play a one hour gig at the river cafe in Fulham for the likes of Lizzie Cundy, Ronan Keating and Gary Lineker on Thursday ahead of his rumoured performance at the King's Coronation.The legendary guitarist, 78, who is set to join a slew of A-list stars at Windsor Castle at the weekend, played a number of hits at the champagne soaked soirée - perhaps the six figure cheque had something to do with it. After pocketing a hefty sum for the private gig, Eric played for Simon Cowell's ex Jackie St Clair as she rang in her husband Carl Michaelson's birthday in style. Glamorous Jackie, 63, who rose to fame as a page 3 pin-up in the mid 1980s, famously dated the Britain's Got Talent judge before marrying businessman Carl. ",
        "Speaking at the event, a source told MailOnline: 'Eric performed for an hour at the bash, where champagne was flowing all night.'Jackie played the perfect host as she greeted every guest to Carl’s 70th party and ushered them inside the venue ahead of the surprise show.'Veteran rocker Eric Clapton was hired in for the evenings entertainment as a surprise to Carl and the guests, none of whom knew that Eric was to be the entertainment for the night. He's received upward of half a million for the event.",
        "'Celebrity guests included Michael Flatley, Gary Lineker , Lizzie Cundy, Bruno Tonioli, plus Ronan and Storm Keating who all partied into the early hours for the lavish 70th party.They added: 'Flatley flew over from Monaco where he now lives and Eric took a break in his tour to perform a 60 min set at the exclusive party.' Greeting the guests, Jackie, 63, looked sensational in a dusky pink tiered dress with flecks of silver twinkling in the light. The former model boosted her height with a pair of towering platform heels and styled her brunette locks into glamorous curls. Birthday boy Carl looked suave in a dark blue suit with a crisp white shirt and a pair of suede shoes. ",
        "Elsewhere, Jackie's best pal Lizzie Cundy stunned in a red mini dress with a feathered trim and a luxe pink fur coat. She showed off her incredible figure in the fitted number and elevated her frame with a pair of matching red heels. Also in attendance was Gary Lineker, Ronan Keating and his wife Storm, and Michael Flatley who all posed for photos outside the venue. Michael looked well after having been released from hospital in January following his cancer diagnosis.The Riverdance icon, 64, recently underwent surgery to deal with an 'aggressive' form of cancer, but is now 'on the mend.'",
        "Erics private gig comes head of his rumoured performance at the King's Coronation on Saturday. There'll be dancing all night long as Lionel Richie has been confirmed as one of the names taking centre stage at the concert.Take That, as well as pop singer Katy Perry and global opera star Andrea Bocelli are also signed up to appear at the event in the grounds of Windsor Castle, according to the BBC.",
        "Other names unveiled by the broadcaster yesterday include Welsh bass-baritone Sir Bryn Terfel, and singer Freya Ridings who will perform a duet with producer and musician Alexis Ffrench.Some 20,000 members of the public will attend the Coronation Concert on Sunday, May 7, which will be aired on BBC1 and Radio 2 along with catch-up services.According to the BBC, the concert will 'celebrate a new chapter in the nation's history' and will have 'themes of love, respect and optimism' while celebrating the 'four nations' and the Commonwealth.It comes less than a year after the concert to mark Queen Elizabeth II's Platinum Jubilee, which included music by Queen, Duran Duran and Diana Ross. Lionel, whose hits include Hello and All Night Long, became The Prince's Trust's first global ambassador in 2019. He said: 'To share the stage with the other performers at the Coronation Concert is a once-in-a-lifetime event and it will be an honour and a celebration.'",
        "The concert will be backed by a 70-piece orchestra and a 'house band' made up of the Massed Bands of the Household Division and the Countess of Wessex's string orchestra. There will also be the support of The Coronation Choir – a diverse group of performers including sea shanty singers, cab drivers, farmers and reggae choirs.Landmarks and locations around the UK will also be lit up with lasers, drone displays and illuminations.Charlotte Moore, BBC chief content officer, said: 'We have a world-class line-up of performers to look forward to for what promises to be a very special night of celebration and entertainment.'"
    ]
}