{
    "articleURL": "/femail/article-12058717/Why-wasnt-Prince-Louis-Coronation-concert.html",
    "content": [
        "It was reported yesterday the Coronation concert was past Prince Louis' bedtimeREAD MORE: Prince Louis is spotted yelling support for his grandfather Royal fans may have been left disappointed after Prince Louis didn't make an appearance at the Coronation concert at Windsor Castle yesterday evening - with many saying he was the only reason they tuned in. ",
        "It seems the Coronation celebrations may have continued too late for the cheeky royal - as it was reported yesterday that it was past his bedtime. Even though Louis attended the Platinum Jubilee Pageant last year, alongside cousin August who hadn't even turned two at the time, the royal parents decided the youngest members of the family should stay at home last night. Princess Beatrice's daughter, Sienna, who is one, and Princess Eugenie son August, two, did not go to the concert, while Zara and Mike Tindall's children, Mia, 9, Lena, four, and Lucas, two were also not seen.Only the King's older grandchildren, Prince George, 9, Princess Charlotte, 8, and great-nieces Savannah Phillips, 12, and Isla Phillips, 11, were in attendance.  ",
        "The fourth-in-line to the throne attended his grandfather's coronation ceremony on Saturday at Westminster Abbey, where he stole the show yet again.He disappeared from the two-hour ceremony for a while, with fans wondering where he had gone and whether he had been told off.However, it was always the plan that the youngster would retire for some parts of the ceremony, which would have been a long time to sit still for the five-year-old.Louis reappeared to sing the National Anthem at the ceremony, before leaving the Abbey to make an appearance on the Buckingham Palace balcony. ",
        "Photos from inside the carriage after the ceremony saw Louis, five, peering out of the window - with some people taking to Twitter to say his style was echoing that of a James Bond villain. The mischievous royal made a whole host of funny hilarious facial expressions from the balcony - including his signature yelling face during the flypast. But it seems that Louis' antics also tired out his sister, Princess Charlotte, as the Princess of Wales said the eight-year-old was 'tired' after making sure her little brother, Louis, five, behaved himself during the Coronation service.But that didn't stop her having a sing along to Katy Perry at the Coronation concert. Prince George was also there, waving his Union Jack flag around while he jammed to the music with his family.Peter Phillips' children, Isla 11, and Savannah, 12, were in attendance yesterday, with Isla speaking to Prime Minister, Rishi Sunak. But it seems that Prince Louis was not the only young royal to be tucked in bed, as Princess Beatrice's daughter, Sienna, who is one, and Princess Eugenie son August, two, did not go to the concert.Zara and Mike Tindall's children, Mia, 9, Lena, four, and Lucas, two were also not seen.",
        "Princess Eugenie and Jack Brooksbank attended the concert, but they too did not bring their son, August, who is two years old.",
        "Prince Louis attended the Platinum Pageant as part of the Jubilee celebrations last year, where he cheekily stuck his tongue out at his mother, Kate, and got told off.His loyal followers took to Twitter to ask where he was during the concert - with some even commenting that they had tuned into the concert only to see him. ",
        "One commented: 'But where is Prince Louis? We tuned in to see him!'Another wrote: 'Where is little Prince Louis? Oh it's not fun without him.'A third penned in capital letters: 'WHERE IS PRINCE LOUIS.'While a fourth said: 'Where is Prince Louis when you need him??' "
    ]
}