{
    "articleURL": "/wires/reuters/article-12045651/India-Russia-suspend-negotiations-settle-trade-rupees-sources.html",
    "content": [
        "By Aftab Ahmed and Swati Bhat",
        "NEW DELHI/MUMBAI, May 4 (Reuters) - India and Russia have suspended efforts to settle bilateral trade in rupees, after months of negotiations failed to convince Moscow to keep rupees in its coffers, two Indian government officials and a source with direct knowledge of the matter said.This would be a major setback for Indian importers of cheap oil and coal from Russia who were awaiting a permanent rupee payment mechanism to help lower currency conversion costs.With a high trade gap in favour of Russia, Moscow believes it will end up with an annual rupee surplus of over $40 billion if such a mechanism is worked out and feels rupee accumulation is 'not desirable', an Indian government official, who did not want to be named, told Reuters.India's finance ministry, the central Reserve Bank of India and Russian authorities did not immediately respond to requests for comment.The rupee is not fully convertible. India's share of global exports of goods also is just about 2% and these factors reduce the necessity for other countries to hold rupees.India started exploring a rupee settlement mechanism with Russia soon the invasion of Ukraine in February last year, but there has been no reported deal done in rupees. Most trade is in dollars but an increasing amount is being carried out in other currencies like the UAE dirham.",
        "The two sides have spoken about facilitating trade in local currencies but the guidelines were not formalised.Russia is not comfortable holding rupees and wants to be paid in Chinese yuan or other currencies, a second Indian government official involved in the discussions said.\"We don't want to push rupee settlement any more, that mechanism is just not working. India has tried everything we could to try and make this work but it hasn't helped,\" a third source who is directly aware of the developments said.Since Russia's invasion of Ukraine on Feb. 24 last year, India's imports from Russia have risen to $51.3 billion until April 5, from $10.6 bln in the same period in the previous year, according to another Indian government official.Discounted oil has constituted a large part of India's imports, surging twelve-fold in the period. Exports from India in the same period fell slightly to $3.43 bln from $3.61 bln in the previous year, the official said.Another official said both countries have started looking for alternatives after the rupee settlement mechanism did not work out but did not give details.TRADE ON TRACKThe sources said trade with Russia has been continuing despite sanctions and payment issues.\"Right now we are making some payments in dirham and a few other currencies but the majority is still in dollars. Settlement is happening in different ways, third party countries are also being used,\" one of the government officials said.",
        "Indian traders are currently also settling some of the trade payments outside Russia, the officials said.\"Third-parties are being used to settle trade with Russia. There is no ban on transacting with other countries over SWIFT. So payments are being made to a third country which route it or offset it for their trade with Russia,\" the other official said.On whether money was also being routed via China, the official said: \"Yes, including China\".(Reporting by Swati Bhat and Aftab Ahmed; Editing by Raju Gopalakrishnan)"
    ]
}