{
    "articleURL": "/wires/reuters/article-12059259/Italy-agriculture-minister-says-slush-lab-food-threatens-quality-products.html",
    "content": [
        "Italy proposes ban on cell-based food, angering supporters",
        "Right-wing govt vows to protect traditional food heritageMulling quality rating for Italian restaurants abroadBy Angelo Amante and Crispian BalmerROME, May 8 (Reuters) - Lab-grown food is potentially dangerous for one's health, Italy's agriculture minister told Reuters, calling it \"slush\" that could never taste like natural meat or fish.In March, Italy's right-wing government proposed a bill to ban the production and import of cultured food and feed, which are not yet available in the European Union.Singapore was the first country to approve lab-grown meat for retail sale in 2020, but progress in the field is being made also in the United States and Israel.\"We reject the idea of standardising products ... making them all the same in laboratories, erasing our culture tied to the land,\" said Francesco Lollobrigida, a senior figure in Prime Minister Giorgia Meloni's nationalist Brothers of Italy party.The Italian ban, which must still be approved by parliament, angered organisations advocating the development of cell-based products, who said producing meat without breeding animals would mitigate climate change and limit greenhouse gas emissions.They also said Italy was curbing options for consumers who are concerned about animal welfare and would appreciate eating a product that does not involve slaughter.Lollobrigida rebuffed such criticism. He said animal breeding was \"sustainable\" in Italy, rejecting comparisons between industrial and agricultural pollution and adding that lab-grown food also required large amounts of energy.",
        "\"Multinationals are investing in this sector, from their point of view this is good business,\" he said, as they would be able to establish factories where energy and labour costs where low to boost their revenues.The government, which renamed the agriculture ministry the \"ministry for agriculture and food sovereignty\", has vowed to protect and promote Italy's famed food heritage.Lollobrigida said he was considering creating a quality rating for Italian restaurants around the world to show they used genuine Italian products and avoid confusion with those serving food \"that has nothing to do with Italy\".Such a rating would be provided on a voluntary basis and would certify the quality of the products being offered and the restaurant's knowledge of Italian culinary culture.\"It is not just about the dish ... there is a way to organise the table, a way to present it, our wine, what is behind it,\" he said.\"The moment we inform people what they are eating, nine times out of 10 they choose our products,\" he said.(Reporting by Angelo Amante and Crispian Balmer, editing by Ed Osmond)"
    ]
}