{
    "articleURL": "/wires/pa/article-12061163/Greg-Taylor-confident-come-Celtic-title-triumph.html",
    "content": [
        "Celtic defender Greg Taylor admits it was an amazing feeling to deliver the title in style but neither he nor his team-mates will sit back and reflect.",
        "Taylor is determined to push on and improve after wrapping up back-to-back cinch Premiership crowns with victory over Hearts on Sunday.A record Scottish top-flight points tally of 107 is in Celtic’s sights if they win their last four games and then they have a shot at the treble when they face Inverness in the Scottish Cup final.Taylor said: “It’s a club that demands trophies, demands success and to deliver it playing a brand of football the way we do is amazing.“We have not rested on what we did last year at all. We knew there was more in us and there is still more to come.“We want to improve going into next season but most importantly we want to finish this season strongly first. We have got four league games and a cup final so we have more to look forward to.",
        "“We are all so driven and keen for success and we believe every last word the gaffer says to us is going to help us and stand us in good stead.“It’s been a really successful season thus far but there is still more to come.”Manager Ange Postecoglou praised his players for their self-motivation after their title triumph and Taylor feels the collective attitude is special.",
        "“It’s something you have got to appreciate because it doesn’t come easy to have that amount of boys that are so keen for success and keen to improve their game,” the 25-year-old said.“They want of course to improve and wherever they end up. But right now, in the here and now for Celtic, every player in that changing room loves it, and long may it continue.“There is such a strong belief. We don’t waste any training session, any game.”The former Kilmarnock left-back has produced his best football this season.“I hope so because I aim to improve as I go along,” he said. “Thus far it’s been my best level but hopefully there’s more to come from myself as well.“It’s just a small part in a collective. The real reason we have been so successful this year is the collective.“Everyone has played their part, 20-25 boys have all contributed throughout the season, so real credit to the whole group.”"
    ]
}