{
    "articleURL": "/news/article-12053049/Daniel-Penny-releases-statement-death-Jordan-Neely-Alvin-Bragg-weighs-charges.html",
    "content": [
        "In a new statement, the former Marine who held Jordan Neely in a chokehold on board an NYC subway on Monday called the incident 'tragic'Daniel Penny called on elected officials to do more to combat the mental health crisis on the streets and on subways in the Big AppleIt comes as numerous reports indicate that a grand jury will be convened imminently to look into the case  The former Marine who put 30-year-old Jordan Neely in a chokehold on a subway in New York prior to his death released a statement in which he said that he acted in self defense and that he 'never intended to harm' the former Michael Jackson impersonator. ",
        "Daniel Penny, 24, has not been charged with a crime in relation to Neely's death. Multiple reports suggest that Manhattan DA Alvin Bragg may convene a grand jury and pursue criminal charges as early as next week. In the statement, Penny's lawyers say that the Long Island-native 'could not have foreseen [Neely's] untimely death.' It also said that Penny was merely trying to restrain Neely, who was accused of being disruptive on board an F train, until the police arrived. Neely's attorneys also took aim at 'elected officials' calling on them to 'address the mental health crisis on our streets on subways.'   Penny's attorney is former Republican Manhattan District Attorney candidate Thomas Kenniff, who unsuccessfully ran against Bragg in 2021. Left wing Democratic Congresswoman Alexandria Ocasio-Cortez called Neely's death a 'murder' earlier this week. ",
        "'Earlier this week Daniel Penny was involved in a tragic incident on the NYC Subway, which ended in the death of Jordan Neely. We would first like to express, on behalf of Daniel Penny, our condolences to those close to Mr. Neely,' the press release begins.'Mr Neely had a documented history of violent and erratic behavior, the apparent result of ongoing and untreated mental illness. When Mr Neely began aggressively threatening Daniel Penny and the other passengers, Daniel, with the help of others, acted to protect themselves, until help arrived. Daniel never intended to harm Mr Neely and could not have foreseen his untimely death.'",
        "'For too long, those suffering from mental illness have been treated with indifference. We hope that out of this awful tragedy will come a new commitment by our elected officials to address the mental health crisis on our streets and subways,' it concluded. The statement was issued through the law firm Raiser and Kenniff on Friday evening. Neely's death occurred on Monday. It is not known when the grand jury would be convened nor what charges District Attorney Alvin Bragg is likely to pursue.According to a separate report from ABC New York, the case is likely to be heard as early as next week. The man who put Neely in the chokehold was earlier named as Penny, 24, of Long Island, New York. The ABC report notes that it is 'typical' for prosecutors to take their time in complex cases before impaneling the jury. Detectives in the case have spoken to around six witnesses who saw the disturbance and are seeking to talk with around four or five more. Penny has been questioned by police and released. According to reports, he said that he did not intend to kill Neely and had been trying to restrain him until the police arrived. Earlier this week, the medical examiner's office ruled Neely's death a 'homicide' but it remains to be scene if a grand jury will see it as a criminal act. ",
        "Friday afternoon marked the third-day-in-row of protests calling for Penny's arrest. Activists gathered in Manhattan's Washington Square Park to hold a demonstration. Demonstrators displayed signs saying 'Justice for Jordan Neely' and 'Being poor is not a crime.' Organizers of local protests called the act a 'lynching' and an example of 'white vigilantism' against victims of color. ",
        "New York Mayor Eric Adams cited mental health issues as having a role in the incident, but said he would refrain from commenting further while the investigation is under way. Also on Friday, Neely's family called for Penny to be arrested, saying they 'want to see him behind bars'.'The family is outraged at what happened,' said Lennon Edwards, one of their attorneys.He told TMZ: 'The family feels like the justice system is failing them at this moment.'It took too long really for there to be a determination that this was homicide. It was clear from the beginning. You look at the video, it tells you that.'The coroner's office came back and said death by compression on the neck. That's clear - you see that chokehold.'Edwards said the video was extremely distressing for the family to watch.'You look at this video, and the family has looked at this video and they are in tears. Every conversation we have with them - there is not a dry eye.",
        "'And literally, they want justice.'Edwards added: 'They want to see Jordan's killer prosecuted. They want to see him in jail, behind bars.'Penny's attorney tells DailyMail.com they have contacted the DA's Office and the NYPD to cooperate. Neely had been arrested 42 times in the past, including for punching a 67-year-old woman in the face. But New York congresswoman Alexandria Ocasio-Cortez spoke for many when she said his criminal history was irrelevant.'Leaders want to raise his record as if that warrants a public execution on the subway?' she tweeted. 'What have we come to?'Edwards agreed that his prior history should not matter, and nor should his ranting on the subway.",
        "'You don't kill someone because you feel uneasy,' he said.'You feel uneasy when you talk to your boss: you feel uneasy when you talk to lots of people in the course of your day.'If we stick to what happened here, we have someone who began with - and sequence is important here - the first statement that we've heard out of his mouth, from witnesses, is that he said: 'I'm hungry.''That's the problem.'Edwards noted that Neely was wearing a short-sleeved t-shirt, giving 'clear visibility as to whether someone is armed or not'.Neely was not armed.",
        "'He was approached from behind, and put into a chokehold immediately. This is not a reasonable response to anything that took place before.'Some have used the word unhinged - well, who's really unhinged when you look at this incident? It's the man who killed him - that's who everyone should have been afraid of.'Edwards said that Penny was acting as a vigilante.'This is clearly the mentality of someone who says I am taking the law into my own hands. I am taking this situation into my own hands.'And I think it became less about protecting the people on the train, and more about how he felt about the person he had his arms wrapped around.'Initial footage showed Penny holding Neely in a chokehold while two other men restrained his arms, but it did not show the moment Penny released him.Witnesses say Neely, who was schizophrenic, was behaving erratically, throwing garbage and screaming that he wanted to 'die' or 'go to jail' because he was fed up about having no food.A longer video that emerged on Friday shows the three minutes and 52 seconds after the train pulled into Broadway Lafayette station on Monday at 2.30pm.The footage begins with Penny already restraining Neely in the chokehold. For two minutes and five seconds, Neely struggled on the floor, flailing his feet.",
        "He went limp after two minutes and six seconds, by which point a by-passer had stepped onto the train.The man - who can be heard but is not seen - warned Penny that Neely had defecated, which he feared was a sign that he was dying.'He's defecated on himself... you're going to kill him now,' he said.Another man who was helping Penny restrain Neely replied that it was an old stain on Neely's trousers, and that Penny was no longer 'squeezing'.'He's not squeezing? All right. Because after he's defecated himself that's it. You've got to let him go,' he replied.He then warned of a 'murder charge'.The second man turned to Neely and said: 'Hey can you hear me?'.Met with silence, the man told Penny to stand up.Penny does not speak, but releases Neely and springs to his feet.The unidentified by-stander can be heard saying: 'That was one hell of a chokehold, man.'Over the next several seconds, Penny and the other man who had been helping him attempt to put Neely in the recovery position.After three minutes and 50 seconds, Neely appears to convulse or take a deep breath.The video cuts out at three minutes and 52 seconds. It is unclear whether he moved again.In a statement on Thursday, a spokesman for the DA's office said: 'This is a solemn and serious matter that ended in the tragic loss of Jordan Neely's life.'As part of our rigorous ongoing investigation, we will review the Medical Examiner's report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records.'This investigation is being handled by senior, experienced prosecutors and we will provide an update when there is additional public information to share.'The Manhattan D.A.'s Office encourages anyone who witnessed or has information about this incident to call 212-335-9040.'"
    ]
}