{
    "articleURL": "/sport/football/article-12055245/JONATHAN-MCEVOY-Self-indulgent-Liverpool-fans-trampled-decency-booing-national-anthem.html",
    "content": [
        "Liverpool fans drowned out the national anthem ahead of their win on SaturdayGod Save the King was played at Anfield to mark the coronation of Charles III Supporters who booed the anthem trampled over decency and courtesy  It is not that anyone was demanding bunting and flag-waving and three cheers from the Kop. It was just that they might have given their protests a rest for one blessed day.",
        "Of course, we knew what was coming. For in recent weeks, the warrior poets of Anfield presaged their rowdy booing of the National Anthem with such ditties as ‘You can stick your Coronation up your a***.’And, anyway, we all know about the long-standing streak of antipathy in Liverpool to British institutions, which on Saturday centred on a 74-year-old man wearing a crown.Historic grievances, taking in Hillsborough and deep-rooted Socialism, are sewn into the story.Now, Anfield regulars, like the rest of His Majesty’s subjects, are entitled to hold and express any views they choose. ",
        "Freedom of speech is indisputably vital to democracies, but it does not necessarily confer an entitlement to trample on basic decency and courtesy, as happened in Saturday’s stadium-wide act of myopic, self-indulgent jeering.Biting your tongue can be a virtue, and this was a time for that on a day of nationwide celebration. And, by the way, what harm has the King ever done to them?You could feel some degree of sympathy towards the club’s hierarchy, left as they were by the Premier League to decide for themselves whether to take up their ‘strong suggestion’ to sing the anthem across the country. This vague advice was an abdication of leadership when they had the power to call off all fixtures for the day. That would have been a proper mark of respect.",
        "But the Premier League’s shortcomings do not excuse the misbehaviour of a mob."
    ]
}