{
    "articleURL": "/wires/reuters/article-12055041/Trinity-Rodman-paces-Spirit-past-Wave.html",
    "content": [
        "Trinity Rodman recorded one goal and one assist to spark the Washington Spirit to a convincing 3-1 victory over the visiting San Diego Wave on Saturday afternoon.",
        "Ashley Sanchez and Paige Metayer also scored goals for the Spirit (3-0-3, 12 points), who notched all their tallies in the second half.Alex Morgan scored a late goal for San Diego (3-3-0, 9 points), which lost its second straight match.Washington dominated, outshooting the Wave 15-4 while halting a three-match winless stretch (0-1-2). The Spirit put 10 shots on target to just three for San Diego.Spirit goalkeeper Aubrey Kingsbury made two saves, while Wave counterpart Kailen Sheridan made seven.Rodman broke a scoreless tie when she scored in the 55th minute. The tally was set up by Sanchez's long pass.San Diego's Christen Westphal missed on her sliding attempt at the ball, leaving Rodman alone with Sheridan. Rodman booted the ball with her right foot and sent it just to the left of Sheridan for her third goal of the campaign.Fifteen minutes later, Rodman made a long run down the left flank and sent a cross toward the middle to a streaking Sanchez, who sent a left-footed shot high into the net to make it 2-0.The Spirit added on in the 79th minute when Sam Staab took a corner kick and sent it into the box. Metayer was positioned right in front of the net and easily headed it in.",
        "San Diego avoided the shutout in the 90th minute. Belle Briede ripped a left-footed shot that Kingsbury blocked but Morgan was right there to knock it in with her left foot.San Diego's first scoring chance of the game occurred in the first minute of the second half when Morgan sent a right-footed, close-range blast on net that Kingsbury knocked away.Washington controlled play in the first half and outshot San Diego 9-2. The Spirit put seven shots on target and Wave had just one.Sanchez had a solid attempt in the 22nd minute after receiving a pass from Rodman. But Sanchez sent her right-footed shot just right of the net.San Diego finally got a shot off in the 35th minute but Sofia Jakobsson's right-footer was saved by Kingsbury.--Field Level Media"
    ]
}