{
    "articleURL": "/wires/pa/article-12048699/Tony-Smith-praises-Hull-FC-battling-gloom-beat-Wigan.html",
    "content": [
        "Tony Smith hailed his Hull FC players for retaining their belief through the bad times after they withstood fierce second-half pressure to beat Wigan and claim a second straight Super League win.",
        "Smith’s men reeled through seven straight defeats earlier this season including a 40-0 derby humbling by neighbours Hull KR, but looked unrecognisable as they surged out to sink the leaders.Early tries from Darnell McIntosh and Jake Clifford – who would score 10 of his side’s points in their eventual 14-10 win – set the tone before a thrilling rearguard action saw Smith’s side over the line.Smith said: “I am so happy for the players. We lost seven straight and you could get down and disgruntled and get a defeatist attitude, and they haven’t.“They’ve been really positive and we kept saying during that time that we wouldn’t be moping around and feeling sorry for ourselves. We just needed to graft through it and get more determined.”The table now makes distinctly brighter reading for Smith’s men, who had stopped the rot with a win over Huddersfield prior to the international break, but they head to rock-bottom Wakefield next week knowing there is much more to do.“We’ve got a lot of improvements still to make in order to get more results,” Smith added. “We were average in the second half, we still made errors but they did not hurt us much as they have in other games.“We’ve got some big matches ahead of us and it’s important that we are in the right frame of mind.”",
        "Wigan head coach Matt Peet admitted his side were second best for long periods of the first half, and were punished by Hull’s energy and determination.“Some of our defence wasn’t where it needed to be in the first half and on the whole we amended that in the second half, but execution is what prevented us getting the win,” said Peet.Wigan looked limp for much of the opening period but Iain Thornley’s try on the stroke of half-time gave them hope, and his second straight after the interval set up a grandstand finish.“Hull were full of energy and they were motivated. They were flying off the line, they were covering each other and they were diving on loose balls,” added Peet.“For us there’ll be a lot of what-ifs and if-onlys. It’s about handling the pressure in those big moments. We’ve got to learn and improve and develop, but I won’t be stressing too much.”Peet reserved particular praise for Thornley, whose double marked his first appearance of the season after a long battle to shake off a knee injury.“I thought he was excellent,” added Peet. “His desire was evident, I loved the way he carried the ball. He worked so hard and I’m so pleased to see him get a performance like that under his belt.”"
    ]
}