{
    "articleURL": "/wires/aap/article-12049067/Brigginshaws-plan-include-NRLW-Magic-Round.html",
    "content": [
        "Brisbane captain Ali Brigginshaw has urged the NRL to consider weaving the women's game into its showpiece event Magic Round, suggesting a nine-a-side pre-season tournament could be a fitting way to kick the weekend off.",
        "The fourth of iteration of Magic Round begins on Friday night and is expected to fill Suncorp Stadium for all three days of festivities.The original edition in 2019 mirrored the NRL's regular schedule, with a game on the Thursday night, two on Friday, three on Saturday and two on Sunday.But the Thursday crowd was significantly smaller, despite featuring locally-based Gold Coast, and the NRL reverted to the current structure of two games on Friday, three on Saturday and three on Sunday in 2020.With Brisbane locked in to host the event for at least another year, Brigginshaw suggested the vacant Thursday night timeslot could be used to include the women's game.Now that the competition has been expanded to ten teams, the NRLW's pre-season begins only two weeks after Magic Round finishes, so the football festival could provide a chance for the women's teams to limber up and give fans a taste of the upcoming campaign.Brigginshaw suggested a condensed tournament similar to the NRL Nines that the league held five times in February between 2014 and 2020.The tournament was held across two days on each occasion, with games of nine-minute halves, but given the NRLW tournament features fewer teams, it could likely be squeezed into one day.",
        "\"That would be cool to have all the teams here and have a nine-a-side comp maybe on the Thursday and then just have a final with the winning teams,\" Brigginshaw told AAP.\"I'm sure the girls would love to be included in such a vibe. Down the track, it probably will be once we get more teams. I reckon a pre-season test of nines.\"A lot of people move to Brisbane but they still support other teams and you can't always fly to watch these games, so it's good to have the Brisbane crowds be able to support their teams.\"Another possibility could be to add a third Women's State of Origin game to the schedule and begin the series on the Thursday before Magic Round.Until this year, Women's Origin had been played as a one-off game but will be expanded this year - albeit to two games rather than three.Women's players have voiced confusion and frustration at the possibility of a stalemate series, but given the first game is set to be played on June 1 this year, a Magic Round series opener would align almost perfectly with the current Origin schedule.\"We need the three-game series so hopefully next year,\" Brigginshaw said.\"That could be a potential to have it the Thursday before. I know we'd get the crowd and everyone loves the Origin.",
        "\"Wherever we have it, I know that people want to see the women's game and the Origin's always one of its best.\""
    ]
}