{
    "articleURL": "/wires/reuters/article-12047587/New-York-judge-Trump-discussing-certain-evidence-hush-money-case.html",
    "content": [
        "By Karen Freifeld and Luc Cohen",
        "May 4 (Reuters) - Lawyers for Donald Trump on Thursday asked the federal court in Manhattan to take over a state criminal case charging him with falsifying business records over a hush money payment to a porn star before his victory in the 2016 presidential election.His lawyers argued that the federal court had jurisdiction because the charges had to do with conduct that took place while he was president. Trump, who lost the 2020 election to Democratic President Joe Biden, is currently the frontrunner for the Republican nomination to the presidency in 2024.Trump pleaded not guilty in Manhattan state court last month to 34 counts of falsifying business records to conceal reimbursements to his then-lawyer Michael Cohen for the $130,000 payment to Stormy Daniels to stay quiet about an alleged sexual liaison, which Trump denies.In a federal court filing on Thursday afternoon, Trump's lawyers said Manhattan District Attorney Alvin Bragg's case was based on checks allegedly written to Cohen by Trump in 2017, while Trump was president. They denied that the checks and related records were false records.\"This case is unprecedented in our nation's history,\" his lawyers wrote. \"Never before has a local elected prosecutor criminally prosecuted a defendant either for conduct that occurred entirely while the defendant was the sitting President of the United States or for conduct that related to federal campaign contribution laws.\"",
        "A spokesperson for the district attorney said the office was reviewing the notice and would respond in court.Prosecutors say Trump falsified records related to reimbursing Cohen in part to cover up the fact that the payment to Daniels exceeded federal campaign contribution limits.Marc Scholl, a former prosecutor in the Manhattan DA's office, said that while Trump had a chance of success, it was more likely that the case would be sent back to state court.\"At the end of the day, New York is not trying to prosecute him for a federal crime or for anything he did in connection with his presidential duties,\" Scholl said. \"But it's certainly a potential delaying tactic.\"'BENDING OVER BACKWARDS'In a hearing in the state case earlier on Thursday, Justice Juan Merchan in Manhattan ruled Trump will not be able to publicly discuss evidence obtained by prosecutors and turned over to Trump to prepare for trial.Prosecutors said the order was needed to reduce the risk of harassment against witnesses and others in the case, given Trump's history of attacks via social media.Defense attorneys argued that the proposed order is too restrictive and that Trump has a right to comment on evidence, both to defend himself and as a presidential candidate. They said prosecutors and witnesses have attacked Trump as well.",
        "Merchan said Trump would be free to speak about most evidence, just not that garnered by the prosecution and turned over to him for his defense in the case.He said the restrictions he would impose do not apply to the vast majority of evidence, which comes from the defense.\"I am bending over backwards,\" the judge said, to see Trump is \"given every opportunity ... to advance his candidacy.\"But, Merchan added, \"His words, especially when used in the form of rhetoric, can have consequences.\"Merchan also asked Trump's lawyers and prosecutors to see if they can agree on a trial date in February or March 2024, which would be in the thick of his campaign for the presidency.Trump's appearance was waived, so he was not in court. He was in Doonbeg, Ireland, playing golf on Thursday.Trump faces a plethora of other legal cases, including a civil case trial centering on accusations of rape and defamation that continued in a federal courtroom on Thursday.(Reporting by Karen Freifeld; Additional reporting by Luc Cohen; Editing by Jonathan Oatis, Lisa Shumaker and Daniel Wallis)"
    ]
}