{
    "articleURL": "/tvshowbiz/article-12053111/MTV-Movie-TV-Awards-WITHOUT-live-audience-Drew-Barrymore-bows-host.html",
    "content": [
        "The MTV Movie &amp; TV Awards reportedly won't have a live studio audience  According to Deadline, the awards show is scrambling to make a pre-taped telecast after Drew Barrymore bowed out as host in support of the WGA Stars have been pulling out of the show en masse and the guild sent out an advisory on Friday that said it was going to picket the event.The MTV Movie &amp; TV Awards reportedly won't have a live studio audience this year after being rocked by the writers strike that has ground Hollywood to a standstill. ",
        "According to Deadline, the awards show is scrambling to make a pre-taped telecast after Drew Barrymore bowed out as host in support of the WGA. Stars have been pulling out of the show en masse and the guild sent out an advisory on Friday that said it was going to picket the event.  The Writers Guild Of America began its strike Tuesday night after its negotiations with the studios fell apart, with sticking points that included residual payments in the evolving climate of streaming, as well as staffing requirements.Bruce Gillmer, an executive producer for the show, said in a statement that MTV is 'pivoting away from a live event that still enables us to produce a memorable night full of exclusive sneak peaks, irreverent categories our audience has come to expect, and countless moments that will both surprise and delight as we honor the best of film and TV over the past year.'",
        "Barrymore dramatically withdrew from her hosting gig in solidarity with the Hollywood writers strike on Thursday.The decision threw the event into chaos just three days before it airs on Sunday, forcing it to fall back on contingency measures such as scrapping its red carpet portion.But Drew has already signed on to host next year's MTV Movie &amp; TV Awards, Variety reports.",
        "'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' said Drew.'Everything we celebrate and honor about movies and television is born out of their creation. And until a solution is reached, I am choosing to wait but I’ll be watching from home and hope you will join me,' she declared.'I thank MTV, who has truly been some of the best partners I have ever worked with. And I can’t wait to be a part of this next year, when I can truly celebrate everything that MTV has created, which is a show that allows fans to choose who the awards go to and is truly inclusive,' her statement concluded.Meanwhile her talk-show, The Drew Barrymore Show, has already finished filming its present season, which as a consequence will presumably be able to air unimpeded, The Hollywood Reporter revealed.Drew's decision was echoed by Oscar Winner Jamie Lee Curtis, who announced that she would not be attending the awards show via Instagram.",
        "Curtis captioned a pair of gorgeous throwback photos that showed her attending the event in years past. Referencing her two skintight gowns, she wrote: 'What THESE OLD THINGS?'I was GOING to wear something like THESE to THIS YEAR'S MTV movie awards but I'm not gonna be able to go and present because the @wgawest needs and deserves my support and I won't cross their picket line.'",
        "Paramount Global executive Bruce Gillmer, who is serving as an executive producer on the MTV Movie &amp; TV Awards, shed further light on its turbulent circumstances.One of Drew's pre-taped clips might be deployed as the opener for the show, he said, but the final decision on how to kick-start the event has yet to be made.Evidently some of the prospective winners have also pre-taped their acceptance speeches, which may in that case be able to be used.'We’re going to be super respectful of the talents’ decisions to either be involved in pre tapes, show up or not show up, whatever they decide. We’ve got backup plans and coverage just in case, so I guess the short answer is, I’m not sure yet…,' he said.'There’s also athletes and celebrity chefs and all kinds of other talent that are not squarely affected,' he noted, teasing: 'We will be looking for some live talent in the room to help tell the story, but not host segments per se. We also have a very charismatic VO artist with us, so stay tuned.'Some of the other celebrities who were originally slated to appear include Tiffany Haddish, Sarah Michelle Gellar and Gal Gadot.",
        "Cindy Crawford's daughter Kaia Gerber, Leonardo DiCaprio's ex Camila Morrone, Robert Pattinson's girlfriend Suki Waterhouse, Elvis Presley's granddaughter Riley Keough and singing star Halle Bailey were also on the initial roster.",
        "Despite Drew's decision to quit this year's show, Bruce had nothing but warm words for her while commenting on the proceedings in public.'Drew, without question, she’s been incredible. It’s hard to imagine that we’ve ever had a better experience with a host. She’s more of a partner really, she’s in it every day, just super passionate and super engaged and creative. She even bought some of her own team along for the journey,' he said.'So when this all reared its head, we started to prepare for what could be. She is not surprisingly, standing in solidarity with the writers, which we have full respect for. She has our full support,' Bruce assured Variety."
    ]
}