{
    "articleURL": "/sport/football/article-12050123/Liverpool-debut-seasons-new-kit-pays-homage-1973-74-team-against-Aston-Villa.html",
    "content": [
        "The 2023-24 season shirt features white accents to the collar and the sleevesA 97 is printed on the collar to honour those from the Hillsborough disasterJurgen Klopp's side will debut it when they take on Villa at Anfield on May 20Liverpool will debut next season's new kit in their final home match against Aston Villa as Darwin Nunez, Luis Diaz and Mo Salah teased the classic strip.",
        "The home kit for the upcoming 2023-24 season features white accents to the collar and the sleeves.It is inspired by the shirt worn by Bill Shankly's legendary 1973-74 squad that lifted the FA Cup after beating Newcastle in the final. A 97 set between two eternal flames is printed on the back of the collar to honour those who lost their lives at the Hillsborough disaster. Jurgen Klopp's side will debut the kit when they take on Villa at Anfield in the Premier League on May 20.",
        "Captain Jordan Henderson said: 'The new home shirt is a classic. Given the inspiration behind the design it feels iconic and a nod to the history of this great club. We're looking forward to wearing it at Anfield for the Villa game.'Women's vice-captain Taylor Hinds added: 'We're always proud to wear the LFC jersey. It's always exciting to see the new design and when it has a link to the history of this club it makes it even more special. We're excited to wear next season.'Henderson features in the campaign video alongside teammates Salah, Nunez, Diaz, Virgil van Dijk and Ibrahima Konate.Trent Alexander-Arnold, Andy Robertson, Harvey Elliott, Fabio Carvalho, Cody Gakpo, Joel Matip and Stefan Bajcetic also don the redesign.Matt Beard's Women's side feature as part of the launch with Missy Bo-Kearns, Fuka Nagano, Hinds, Shanice van de Sanden, Katie Stengel and Leanne Kiernan.",
        "The kit can be pre-ordered now online, in-app and in-store ahead of its general-sale release on May 18.There will be a £5 rise in the price of adult stadium shirts to £74.95 due to 'rising supply chain and operational costs'.Shankly won three league titles, two FA Cups and a UEFA Cup as Liverpool manager."
    ]
}