{
    "articleURL": "/wires/reuters/article-12047139/Tunisia-facing-unprecedented-migration-crisis-bodies-wash-ashore.html",
    "content": [
        "Unprecedented number of migrants leaving Tunisia",
        "Violent confrontations at sea between migrants and CoastguardsHundreds of bodies wash up on shore, filling morguesBy Tarek AmaraSFAX, Tunisia, May 4 (Reuters) - Bodies of drowned migrants wash up most days on Tunisian beaches, lie unclaimed in hospital corridors and fill morgues, evidence of a surge in people seeking to cross the Mediterranean that has been accelerated by a government crackdown.Coastguard patrols return to the port of Sfax crammed with migrants stopped at sea in flimsy, overcrowded boats from making the perilous voyage to what they hope will be a better life in Europe.The number of migrants embarking upon the Mediterranean has risen overall, but the number leaving Tunisia has exploded, with more caught by coastguard patrols than in any previous year, senior National Guard official Houssem Eddine Jebabli said.The Coastguard told Reuters it has stopped 17,000 people at sea in the first four months of 2023, compared to 3,000 in the same period of 2022.The numbers spiked after a crackdown on migrants from Sub-Saharan African countries in February that President Kais Saied announced using language the African Union condemned as racialised. Many migrants reported suffering racist attacks.\"Let us go! Your president expelled us but now you are stopping us leaving,\" shouted a man from the Ivory Coast, who gave his name as Ibrahim, taken aboard a Coastguard ship with his wife and two infant children after they were stopped at sea.",
        "\"We were evicted from our home, people threw stones at our house,\" he said, explaining why they had to leave Tunisia. His comments were echoed by other African migrants Reuters met after their boats were intercepted.CONFRONTATIONS AT SEAWithin minutes of Reuters boarding Coastguard Ship 3505 in Sfax, the captain registered a likely migrant boat on the radar on a course for Italy's Lampedusa island, the main migrant destination.Over the following hours, Reuters watched the Coastguard stop five boats and track four others it did not have time to chase.As the crammed boats emerged in the darkness, some with children on board, some migrants begged to be left to continue their voyage. Others tried to resist or evade capture.On one boat, Reuters saw migrants throwing metal bars at the Coastguard, fighting them with sticks and threatening to throw themselves into the sea. On another, the Coastguard disabled the engine by smashing it with poles.The tactic of smashing engines has been criticised by migrant rights groups who say some boats have been left rudderless at sea, prey to the waves and in danger of sinking.Jebabli, the National Guard official, denied imperilling migrants and said Coastguards were increasingly threatened at sea when stopping migrant boats.Back on the main ship, the captain fired a weapon into the air trying to quell a protest by 200 migrants on board as many angrily demanded to be allowed to go on to Italy.",
        "Some threw confiscated boat engines at the 10 Coastguards on board. Others threatened to set themselves on fire. One man jumped into the sea and was hauled out.BODIES STACKED IN HOSPITAL CORRIDORSThe cost of an illicit voyage is falling as migrants rely less on Tunisian fishing boats and buy their own metal craft made cheaply and meant for only a single journey.Passage to Italy was previously 5,000 dinars ($1,600) but is now only 1,000 dinars, a police official said, with migrants evenly splitting the cost of the boat and engine.It costs only 2,000 dinars to make a metal boat that can be sold for 20,000 and ever more people near the coast are doing so, a resident of Sfax's Jebiniana district said, showing Reuters houses that had recently been used for the purpose.Migrants Reuters interviewed coming off the Coastguard boats said they would try to cross again soon.But on a stretch of Sfax coastline Reuters saw five bodies that had washed up, one a young boy in jeans and a white T-shirt. The Coastguard recovered four others nearby.The main city hospital was storing 200 bodies, most outside the small morgue lying stacked in bags on the corridor floors. Patients complain of the terrible smell. \"We cannot bear it any more,\" said a nurse.",
        "Regional health chief Hatem Cherif said authorities would build a new cemetery for migrants. \"We bury dozens every day,\" he said.(Reporting by Tarek Amara; Writing by Angus McDowall, Editing by William Maclean)"
    ]
}