{
    "articleURL": "/wires/reuters/article-12046859/Man-City-face-Leeds-points-vital-different-reasons.html",
    "content": [
        "By Lori Ewing",
        "MANCHESTER, England, May 4 (Reuters) - Manchester City appear all but unstoppable in their quest for a third consecutive Premier League title but they are taking nothing for granted as they prepare for Saturday's home game against a Leeds United side battling to beat the drop.Pep Guardiola's City reclaimed top spot from Arsenal thanks to a 3-0 win over visiting West Ham United on Wednesday and a victory versus Leeds would stretch their lead to four points before the Londoners' tough trip to Newcastle United on Sunday.Leeds have been in freefall for weeks and, languishing in 17th place on 30 points and only outside the relegation zone on goal difference, have turned to the experienced Sam Allardyce in the hope he can produce another of his miracle escape acts.Allardyce certainly sounds ready for the challenge, saying confidently on Wednesday that he is \"up there\" in managerial talent with anyone in the Premier League, including Guardiola and Liverpool's Juergen Klopp.\"Far too many people think I'm old and antiquated which is so far from the truth,\" said Allardyce, who has replaced the sacked Javi Garcia for the final four games of the season.\"I may be 68 and look old but there's nobody ahead of me in football terms. Not Pep, not Klopp, not (Arsenal's Mikel) Arteta. It's all there with me.\"",
        "The 52-year-old Guardiola, who is on course for possibly the finest season of his career as City chase a treble, agreed and pointed to the success of 74-year-old Neil Warnock with Huddersfield Town and Roy Hodgson, who is 75, at Crystal Palace.The pair were also brought in to try to save their teams from the threat of relegation this season.\"(Allardyce) is right. I want to be honest ... it looks like the young managers with the tactics, (but) they are really good and help us to be what we are.\"It will be tough (versus Leeds). He (Allardyce) has the charisma, will put on the pressure to the players and knows exactly what to do in these relegation battles.\"The match is a departure from the usual rules that ban the TV screening of live games on Saturday afternoon.Watching avidly no doubt will be everyone at Arsenal, hoping Leeds can do them an unlikely favour as the Gunners cling to the fading hope of their first league title since 2004.A loss at third-placed Newcastle coupled with a City win over Leeds would all but end Arsenal's title challenge.That match is also important for Newcastle as they bid for a Champions League berth. They are third with 65 points, six ahead of fifth-placed Liverpool, who have played a game more.",
        "Manchester United on 63 points can climb above Newcastle with a win at Brighton &amp;amp; Hove Albion on Thursday with their game in hand on the Magpies before visiting West Ham on Sunday. (Reporting by Lori Ewing; Editing by Ken Ferris)"
    ]
}