{
    "articleURL": "/wires/pa/article-12044145/Mark-Bonner-disappointed-Cambridge-lose-control-relegation-destiny.html",
    "content": [
        "Cambridge head coach Mark Bonner was frustrated after his side missed the chance to keep their fate in their own hands on the final day of the League One campaign.",
        "The 1-0 defeat to Burton left Bonner’s side needing both MK Dons and Morecambe to drop points on the last day to have any chance of staying up.“We wanted to go into Sunday with it in our control and it isn’t,” Bonner said.“We have to respond and win our game firstly and hope other things go for us. Tonight is disappointing because of the opportunity we had to put it in our own hands.“But if we are being honest six weeks ago we would have taken being in it on the last day.”Burton’s Mark Helm scored the only goal with a deflected effort and Bonner felt his side contributed to their own downfall.",
        "He added: “Their goal came off our own poor play and there are a few teams in the league you don’t want to go behind to and they are certainly one of them.“Burton had a few good chances and will say they should have killed the game off, but they didn’t so we were always in the game.”Striker Sam Smith thought he had equalised late on with a header saved by Burton goalkeeper Jordan Amissah, with Bonner unsure whether the ball had crossed the line.“Either that is the best save I’ve ever seen or the ball has crossed the line,” Bonner said.",
        "“I don’t know which but everyone was celebrating as if it had (crossed the line). Tough to see on the video and the replays but the shape of it looked like it had.”With safety already secured Albion boss Dino Maamria was a happy man as his side reached a season-high 14th spot going into the final game.“I thought it was a very good performance throughout,” Maamria said.“We played some good football and got the balance right. We controlled the middle of the park. We scored one and could easily have got two or three.”Maamria praised goalkeeper Amissah, making his first start since January, but reserved his top praise for match-winner Helm, who is finishing the season in really good form having joined from Burnley in January.He added: “Jordi deserved his start. Although he hasn’t played, he has been a huge part of what we have been doing and getting that clean sheet is testament to him.“John Brayford and Sam Hughes were superb at the back but what about Mark Helm? What a performance that is. He is a top, top player. He showed what he is capable of, and he is getting better and better.“All in all, lots of positives tonight. We are getting better and better all the time.”"
    ]
}