{
    "articleURL": "/sport/football/article-12057479/Ilkay-Gundogan-best-value-signing-Guardiola-era-letting-mistake.html",
    "content": [
        "The Germany international was imperative once again for the side against LeedsIlkay Gundogan's contract with Manchester City expires this coming summerCurrently looks irreplaceable and City could be making a mistake letting him goWhen it comes to Ilkay Gundogan, it is probably best to forget the last 10 minutes and remember the seven years beforehand instead. There is no Pep Guardiola signing that, pound for pound, has provided better value.",
        "It is easy to forget that the German, the first man through the door in the Guardiola era, cost just £20million. His contract is running down, with a presentable offer from Barcelona on the table, and it might be that City have to bid farewell to someone who has gone from tidy midfielder to quiet leader of men.Guardiola was upset at the missed penalty, one that preceded a Leeds United goal and made this victory nervy for a few minutes.The City boss wore a weary look, a disgruntled lover, as Gundogan made his way off, picking the furthest possible point in his technical area and refusing to catch the captain’s glance as he shook the hand of Rodri. Gundogan checked back to see if Guardiola was looking. He was not. An exaggerated tiff that only soul mates could endure. The two of them are next door neighbours so it was likely settled and forgotten on Saturday evening.",
        "But if Guardiola felt let down by Gundogan clipping the post from the spot — Erling Haaland charitably gifting responsibility away — then that will only amplify if he does depart in June once the contract expires. Irreplaceable is a word thrown around with abandon, but the 32-year-old would leave a sizeable hole in this squad if he does prefer Iberia for his wife, Sara, and their new baby.",
        "There are players who get Guardiola but there are few players who are Guardiola. Gundogan is City’s manager on the pitch, a man who understands the plan.He was dropped in as a No 6 against Leeds, which presented no problem whatsoever, and ended up with a couple of goals. He broke the record for the most successful passes in a Premier League game, 170, having held the mark himself from a game against Chelsea in 2018. In recent times, there cannot be many players more under-rated.‘I remember one season when we won, maybe the second Premier League here, that Fernandinho was injured for a long time and he (Gundogan) played as a holding midfielder — in games like Burnley, long balls, second balls — and he played… wow,’ said Guardiola.‘I had the feeling that without him we wouldn’t be able to win the Premier League. He is so intelligent, Gundo, so clever, so competitive.‘Under pressure, he handles it without a problem. He’s one of the best players I’ve ever trained in my career. The whole package. He’s top, top class.’His team-mates appreciate the intricacies of his game as well.‘I think he is the best player I have ever played the possession game with,’ said Manuel Akanji. ‘I feel like he has eyes in the back of his head, really. When you pass him the ball sometimes he does these turns and knows exactly what is happening around him. It looks so easy. He could do it with his eyes closed.’",
        "For pure tactical understanding, only Philipp Lahm at Bayern Munich comes close for Guardiola. It is little wonder that Gundogan is completing his coaching badges, taking sessions with City’s academy teams, because what he has absorbed since leaving Borussia Dortmund in 2016 should prove invaluable for his next chapter.That has not arrived quite yet. Barcelona are offering a contract of two years, decent security, while City are looking at a 12-month deal. There are decisions to make and City could do with knowing the answers fairly quickly because it shapes their transfer business.That is hard to juggle when there are three trophies and a shot at immortality on the line.",
        "Real Madrid are next on Tuesday in the Champions League, in an exercise of resting last year’s ghosts, and there does not feel like an opportune moment to hold a serious discussion about the future. Everything seems on hold while the Treble is real. Guardiola’s focus is steely, with City now 20 games unbeaten.‘I would love to play on Tuesday the way we played against Leeds,’ he said. ‘Everyone was exceptional. So you had the feeling in the last minutes at 2-0 that it’s always open, but before that the game was really good. 'The mindset of the team is there. After beating Arsenal, destiny is in our hands. We have done it at Fulham, we have done it against West Ham, we have done it against Leeds.’ ",
        "There are a few more still to go yet though.Manchester City (3-2-4-1): Ederson 7; Akanji 7, Laporte 7, Ake 7 (Walker 54min, 6); Lewis 7, GUNDOGAN 9 (Rodri 90); Mahrez 8, Alvarez 6 (Silva 88), De Bruyne 7, Foden 7; Haaland 7. Scorer: Gundogan 19, 27. Booked: None. Manager: Pep Guardiola 7.Leeds (4-5-1): Robles 7.5; Ayling 5, Kristensen 5, Wober 5, Firpo 5; Gnonto 5 (Rodrigo 58, 7), McKennie 5, Forshaw 5 (Struijk 80), Roca 6 (Greenwood 58, 6), Harrison 5 (Summerville 65, 6); Bamford 5 (Aaronson 80). Scorer: Rodrigo 85. Booked: McKennie, Gnonto, Rodrigo. Manager: Sam Allardyce 6.Referee: Andy Madley 7. Attendance: 53,406."
    ]
}