{
    "articleURL": "/news/article-12059753/Mall-brawl-Shocking-moment-mass-fight-erupts-outside-upscale-LA-shopping-center-Grove.html",
    "content": [
        "The brawl erupted at the upmarket shopping mall The Grove in Los Angeles over the weekendVideo footage captured at the scene shows a large group of individuals fightingOne woman watching the scene unfold can be heard shouting: 'Where are the police? Where is security?' This is the shocking moment a full scale brawl erupts at an upmarket shopping center in Los Angeles.",
        "The fight erupted at popular shopping mall The Grove in Los Angeles over the weekend and was captured on video. In the video, shared to Citizen, a man can be seen having his short torn off as he tries to get out of the center of the fight.He is then chased by four others who force him to the ground before throwing a barrage of punches and kicks towards him.",
        "One woman watching the scene unfold can be heard saying: 'Oh my god. Where are the police? Where is security?'Just before the short video ends, what looks to be two security guards appear on the scene in an attempt to bring the brawl to an end. The Grove, a 575,000 square-foot open-air retail and entertainment hub, on Fairfax Avenue. The area is ordinarily packed with shoppers, movie-goers and people enjoying the outdoor space.It is one of the United States' most famous malls, widely regarded as one of the classiest - and is also beloved of the many celebrities who live in LA.  The Los Angeles Police Department said that they arrived and escorted all involved parties to their vehicles. ",
        "This shocking video comes after recent figures released by the LAPD show that there was over 2,100 incidents of violent crime last month alone in the city. ",
        "Of that figure, 1415 related to aggravated assaults, 629 where recorded as robberies, with 80 rape incidents and 23 homicides also recorded.Last months number of total violent was up 6 recorded incidents from the month before, with increases seen in assault, rape and robbery. The number of arrests in the city also increased since the month previous, climbing from 4501 in March, to 5497 in April."
    ]
}