{
    "articleURL": "/wires/aap/article-12049469/How-Archibald-winner-stitches-intimate-portraits.html",
    "content": [
        "Everyone has an opinion on the Archibald Prize, but anyone who believes the judges picked youth over experience this year should take a little pause.",
        "Julia Gutman, 29, spends months painstakingly stitching together each of her artworks, which she constructs with donated textiles and embroidery.But her approach is closer to painting than any traditional textile method, the Archibald winner for 2023 told reporters on Friday.\"I lay up fabric in the same way that I would an oil painting, starting with darks and adding in the lights,\" she said.(Lest anyone fear a repeat of the 2004 controversy in which the Archibald winner was challenged in court because the artwork was a drawing, not a painting ... don't worry, Gutman's winning work used oil paint too.)The artwork, Head in the sky, feet on the ground, is a portrait of her friend, the singer-songwriter Montaigne.She is depicted in a pose that mimics a 1917 painting by Austrian artist Egon Schiele, which subverted representations of femininity at the time.Gutman's works are not only rooted in art history, but also grounded in her relationships with those closest to her.\"There is something beautiful about making something monumental from everyday relationships,\" the artist told AAP in a recent interview.She consults her family and friends about how they would like to be represented, and in telling their stories, the artist is stitching together a tale about herself too.",
        "\"We are made of the people who are close to us,\" she said.Gutman originally trained as a painter and turned to textiles in 2016, first making soft sculptures and then moving to sewn pictures about three years ago.It's meant much time at her sewing machines - she spent an extended period working alone during the pandemic, on a domestic machine and an industrial one too.The pieces have begun to come together, with Gutman's first solo show at Sullivan+Strumpf in Sydney in 2022.Just a few months later her biggest work yet, the four-panel Isn't it all just a long conversation? was a standout in the Primavera show at the Museum of Contemporary Art.In an interview for the exhibition last December, guest curator Michael Do told AAP that selection for Primavera often happens at a pivotal point in the careers of young artists.\"Julia is one of the most interesting voices ... her work is a bold proclamation of the future of Australian art,\" he said.When combined with no less than an Archibald win, it now looks less like a pivot point and more like an exciting trajectory."
    ]
}