{
    "articleURL": "/tvshowbiz/article-12038407/Dancing-Stars-moving-ABC-upcoming-32nd-season.html",
    "content": [
        "Dancing With The Stars will return to ABC for its upcoming 32nd season.",
        "The news about the wildly popular dancing competition program was revealed by Vulture on Tuesday.The show was streaming live on the Disney+ last season.The last season of the program, which recently suffered the loss of its longtime judge Len Goodman, concluded in November.It was also reported that Dancing With The Stars' upcoming episodes would be made available the day after airing on both Disney+ and Hulu.Although the news about the program has yet to be confirmed by Disney executives, an official announcement is expected to be released soon.",
        "The upcoming season of the program will be co-hosted by former contestant Alfonso Ribiero and former dancer and judge Julianne Hough.According to Deadline, the Fresh Prince of Bel-Air star will serve as the show's MC while the professional dancer will conduct interviews with contestants. Tyra Banks served as the program's most recent host, although she departed the series following the conclusion of its 31st season.Carrie Ann Inaba, Bruno Tonioli and Julianne's brother Derek are all set to act as the show's judges.The 34-year-old professional dancer previously gave a statement to Variety to speak about how she greatly enjoyed working on the show.'The show holds such a special place in my heart from the many years and different roles I have had the privilege of being a part of, she said.",
        "Julianne went on to express that she was happy to be able to reunite with several of her former collaborators. 'The incredible team that brings the ballroom to life every night has been my family for the past 17 years,' she stated.",
        "Dancing With The Stars' inaugural season initially premiered on ABC in 2005.The most recent run of episodes debuted last September, and figures such as Wayne Brady, Teresa Giudice and Jordin Sparks competed on the program.The mirrored ball was ultimately taken home by social media personality Charli D'Amelio and her dancing partner Mark Ballas.The upcoming 32nd season of the long-running program is expected to premiere this fall."
    ]
}