{
    "articleURL": "/health/article-12042485/Is-Trump-Wegovy-Ex-President-looks-particularly-svelte-UK-trip.html",
    "content": [
        "Trump's slimmer appearance in the UK comes amid many stressful legal battlesDoctors say it is realistic that he would take highly effective Wegovy for obesityREAD MORE: Trump told cops when he was arrested that he weighs 240 pounds He may have the weight of mounting legal woes on his shoulders, but Donald Trump appears to have slimmed down. ",
        "The 76-year-old has looked noticeably more svelte in recent weeks despite facing at least nine lawsuits — including rape allegations — and juggling a 2024 presidential campaign.Dr Stuart Fischer, a New York-based internal medicine specialist, told DailyMail.com the stress could be curbing Trump's appetite and making him move more — perhaps on the golf course.Trump has been active on his Mar-a-Lago green amid his legal troubles and recently traveled to Scotland to oversee the opening of a golf course bearing his mother's name. Other experts have speculated that Mr Trump could have been prescribed obesity medications such as Wegovy or Ozempic. His primary rival heading into the Republican primary, Gov Ron DeSantis is rumored to have used to slim down too. ",
        "Dr Shauna Levy, an obesity expert at Tulane University School of Medicine in New Orleans, Louisiana, told DailyMail.com: 'It is realistic to consider this possibility that he is on anti-obesity medication.'Former President Trump's final White House checkup in 2020 showed that he weighed 244 pounds at a height of 6 feet 3 inches.This puts his body mass index at 30.5, which is considered medically obese. Wegovy injections are meant for adults with a BMI of about 30 and up.  Dr Levy said: 'I think given the fact of the availability and the success of the medicines, I think there is a high likelihood that somebody in this situation, regardless of who they are, may be taking anti-obesity medications. ",
        "'There's no way for me to know whether or not he's taking it just by looking at his face,' she added. 'But again, in the current climate where we have these wonderful anti-obesity medications, and somebody who has the means and the resources to take these medications and pay for them...'Despite being a billionaire, Trump is known for his love of McDonald's.He stopped at the restaurant during a visit to East Palestine, Ohio, in March, telling locals he 'knew the menu better than anyone'.",
        "Former Trump operative Jason Miller said the 45th president has lost between 20 and 25lbs since leaving office, crediting a combination of rest, golf, and 'not having the [White House] kitchen there 24/7.'But the daily rigors of running for president, such as traveling often and hosting energetic campaign events, would be enough without medication to cause some weight loss. Dr Fischer told DailyMail.com that the likely cause of the weight loss is stress attached to his many legal woes 'and also the prospects of what's to come.'",
        " 'If he wants to run again for President, this is also going to take a tremendous physical and mental toll. It's an uphill struggle.",
        "Former President Donald Trump gave his height as 6 feet 2 inches when he was arrested in Manhattan Tuesday, a slightly diminished stature from the data point when he left the White House. His weight was given as 240 lbs. ",
        "'He's got a lot to do physically. He likes to campaign. He likes to entertain. That's his persona.' Donald Trump’s health was often shrouded in mystery during his stint in office. He has repeatedly painted himself as a sort of Energizer Bunny with unlimited stamina, working late and sleeping fewer than five hours per night while trying to make it look easy.Still, he has not historically been forthright with his medical records. Rather than publicize them during his 2016 presidential run, Trump appeared on the daytime show Dr Oz, where he shared documents that purported to be his medical records. In 2015, Trump compelled his personal doctor Harold Bornstein to issue a statement saying he would 'be the healthiest individual ever elected to the presidency.' in a bid to satisfy the public’s need for proof that he was fit for officeHis eating habits have not always been healthy. His diet has consisted largely of unhealthy and fast foods, and his McDonald's order would typically include 'two Big Macs, two Fillet-O-Fish and a chocolate malted [shake]', for a grand total of more than 2,600 calories.DailyMail.com has approached Trump's team for comment. "
    ]
}