{
    "articleURL": "/wires/pa/article-12041665/Keir-Starmer-ask-Sue-Gray-operate-probe-says-minister.html",
    "content": [
        "Sir Keir Starmer has questions to answer over partygate investigator Sue Gray’s refusal to co-operate with a Government probe into her switch to a senior Labour role, a minister has said.",
        "Security minister Tom Tugendhat said he was “surprised” the Labour leader was “not asking the person he nominated to co-operate with the civil service body that’s investigating” the move to become his chief of staff.But shadow chancellor Rachel Reeves described the inquiry as a “political gimmick” launched by the Government to pursue a “vendetta” against the former senior official who looked into allegations of parties being held in Downing Street during pandemic lockdowns.In an update on Ms Gray’s departure from her high-ranking Whitehall position on Tuesday, Cabinet Office minister Oliver Dowden said the Government will “consider next steps” after she “chose not to” speak to the investigation. He's painted himself as a white knight in all this and he's not asking the person he nominated to co-operate with the civil service body that's investigating it  Tom Tugendhat, security minister  He said the Government has submitted a “confidential assessment” to the anti-corruption watchdog, the Advisory Committee on Business Appointments (Acoba), which will recommend a cooling-off period between three months and two years to avoid any conflict of interest.But he stopped short of saying whether the Cabinet Office deemed her to have broken any rules by talking to the opposition about a potential job while she was working in Government, as had been suggested by several reports.",
        "Ms Gray is “fully” co-operating with a separate review by Acoba, an independent body, Ms Reeves insisted on Wednesday.",
        "The Labour frontbencher told Times Radio: “The issue here is that there are two inquiries going on. There’s the usual one – the Acoba process, which Sue Gray is co-operating with fully, and then there’s the political gimmick one set up by Government ministers to pursue this vendetta they’ve got against Sue Gray.”She said Prime Minister Rishi Sunak “was supposed to be moving on from the era of Boris Johnson” but, instead, is “doubling down on this vendetta against Sue Gray because she’s the person who – not the person who had the parties, but the person who revealed the extent of the partygoing and the debauched behaviour at 10 Downing Street”.Dave Penman, leader of the FDA union which represents senior Whitehall staff, tweeted: “It is no surprise that Sue Gray has decided to focus on engaging with the independent, evidence-based Acoba investigation, rather than deal with an investigation that is mired in the politics of the day.”But Mr Tugendhat suggested Sir Keir should have pushed Ms Gray to co-operate with the Government probe.He told LBC Radio: “I think the person I’m most surprised at, frankly, is Keir Starmer.",
        "“I mean, he’s painted himself as a white knight in all this and he’s not co-operating with the civil service or rather, he’s not asking the person he nominated to co-operate with the civil service body that’s investigating it.“So you know, I mean, that’s a decision for him, obviously, but it does raise questions.”Sir Keir has insisted he was “confident” Ms Gray had not broken any rules.The Labour leader said he “had no discussions with her while she was investigating Boris Johnson whatsoever, I don’t think anyone is suggesting that’s the case”."
    ]
}