{
    "articleURL": "/wires/ap/article-12060593/North-Dakota-governor-OKs-law-ignore-transgender-pronouns.html",
    "content": [
        "North Dakota Republican Gov. Doug Burgum has signed a bill that prohibits public schools and government entities from requiring teachers and employees to refer to transgender people by the pronouns they use, the governor's office announced Monday.",
        "The new law also requires teachers to tell a parent or legal guardian if the student identifies as transgender. It prohibits transgender students from using the bathroom of their choice without prior approval from a parent or guardian.It is effective immediately.Burgum said in a statement that the new law \"largely codifies existing practices while reaffirming the First Amendment right to free speech ... balancing the rights and interests of students, parents and teachers.\"Opponents countered that the state's Republican leaders are violating the constitutional rights of students and teachers by compelling the speech of adults and potentially exposing children to dangerous repercussions if an abusive parent doesn't approve.\"Mandatory outing of a student´s trans identity violates their privacy rights at school - particularly for trans youth who cannot be safe at home. And creating a supportive working and learning environment also requires treating people with dignity and respect, including - at a minimum - calling them by the name and pronouns they want to use. These are both unlawful and discriminatory practices,\" said Cody Schuler, advocacy manager of the American Civil Liberties Union of North Dakota.",
        "Supporters have said the measure boosts parental rights and brings peace of mind to teachers. Others said the governor should have done more to limit trans rights.",
        "It's only the latest measure restricting trans rights that Burgum signed after they were passed by North Dakota's House and Senate with veto-proof majorities, part of a larger push by Republican officials nationwide to roll back the rights of their LGBTQ+ constituents.Other new North Dakota laws prohibit transgender girls and women from joining female sports teams, from K-12 through college. They criminalize health care providers who give gender-affirming care to minors. And they limit transgender children and adults in accessing the bathrooms, locker rooms and showers of their choice, from schools to state-run colleges and correctional facilities.At least 21 states have restricted or banned female transgender athletes´ participation in female sports, and at least 14 states have restricted or banned gender-affirming care for minors. Additionally, at least eight states have enacted laws preventing transgender people from using the restrooms associated with their gender identities.___Trisha Ahmed is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Trisha Ahmed on Twitter: @TrishaAhmed15"
    ]
}