{
    "articleURL": "/wires/ap/article-12054217/New-Twitter-rules-expose-election-offices-spoof-accounts.html",
    "content": [
        "NEW YORK (AP) - Tracking down accurate information about Philadelphia's elections on Twitter used to be easy. The account for the city commissioners who run elections, @phillyvotes, was the only one carrying a blue check mark, a sign of authenticity.",
        "But ever since the social media platform overhauled its verification service last month, the check mark has disappeared. That´s made it harder to distinguish @phillyvotes from a list of random accounts not run by the elections office but with very similar names.The election commission applied weeks ago for a gray check mark - Twitter´s new symbol to help users identify official government accounts - but has yet to hear back from the Twitter, commission spokesman Nick Custodio said. It´s unclear whether @phillyvotes is an eligible government account under Twitter´s new rules.That´s troubling, Custodio said, because Pennsylvania has a primary election May 16 and the commission uses its account to share important information with voters in real time. If the account remains unverified, it will be easier to impersonate - and harder for voters to trust - heading into Election Day.Impostor accounts on social media are among many concerns election security experts have heading into next year's presidential election. Experts have warned that foreign adversaries or others may try to influence the election, either through online disinformation campaigns or by hacking into election infrastructure.Election administrators across the country have struggled to figure out the best way to respond after Twitter owner Elon Musk threw the platform´s verification service into disarray, given that Twitter has been among their most effective tools for communicating with the public.",
        "Some are taking other steps allowed by Twitter, such as buying check marks for their profiles or applying for a special label reserved for government entities, but success has been mixed. Election and security experts say the inconsistency of Twitter´s new verification system is a misinformation disaster waiting to happen.\"The lack of clear, at-a-glance verification on Twitter is a ticking time bomb for disinformation,\" said Rachel Tobac, CEO of the cybersecurity company SocialProof Security. \"That will confuse users - especially on important days like election days.\"The blue check marks that Twitter once doled out to notable celebrities, public figures, government entities and journalists began disappearing from the platform in April. To replace them, Musk told users that anyone could pay $8 a month for an individual blue check mark or $1,000 a month for a gold check mark as a \"verified organization.\"The policy change quickly opened the door for pranksters to pose convincingly as celebrities, politicians and government entities, which could no longer be identified as authentic. While some impostor accounts were clear jokes, others created confusion.Fake accounts posing as Chicago Mayor Lori Lightfoot, the city´s Department of Transportation and the Illinois Department of Transportation falsely claimed the city was closing one of its main thoroughfares to private traffic. The fake accounts used the same photos, biographical text and home page links as the real ones. Their posts amassed hundreds of thousands of views before being taken down.",
        "Twitter´s new policy invites government agencies and certain affiliated organizations to apply to be labeled as official with a gray check. But at the state and local level, qualifying agencies are limited to \"main executive office accounts and main agency accounts overseeing crisis response, public safety, law enforcement, and regulatory issues,\" the policy says.The rules do not mention agencies that run elections. So while the main Philadelphia city government account quickly received its gray check mark last month, the local election commission has not heard back.Election offices in four of the country's five most populous counties - Cook County in Illinois, Harris County in Texas, Maricopa County in Arizona and San Diego County - remain unverified, a Twitter search shows. Maricopa, which includes Phoenix, has been targeted repeatedly by election conspiracy theorists as the most populous and consequential county in one of the most closely divided political battleground states.Some counties contacted by The Associated Press said they have minimal concerns about impersonation or plan to apply for a gray check later, but others said they already have applied and have not heard back from Twitter.Even some state election offices are waiting for government labels. Among them is the office of Maine Secretary of State Shenna Bellows.In an April 24 email to Bellows´ communications director reviewed by The Associated Press, a Twitter representative wrote that there was \"nothing to do as we continue to manually process applications from around the world.\" The representative added in a later email that Twitter stands \"ready to swiftly enforce any impersonation, so please don´t hesitate to flag any problematic accounts.\"",
        "An email sent to Twitter's press office and a company safety officer requesting comment was answered only with an auto-reply of a poop emoji.\"Our job is to reinforce public confidence,\" Bellows told the AP. \"Even a minor setback, like no longer being able to ensure that our information on Twitter is verified, contributes to an environment that is less predictable and less safe.\"Some government accounts, including the one representing Pennsylvania´s second-largest county, have purchased blue checks because they were told it was required to continue advertising on the platform.Allegheny County posts ads for elections and jobs on Twitter, so the blue check mark \"was necessary,\" said Amie Downs, the county's communications director.When anyone can buy verification and when government accounts are not consistently labeled, the check mark loses its meaning, Colorado Secretary of State Jena Griswold said.Griswold´s office received a gray check mark to maintain trust with voters, but she told the AP she would not buy verification for her personal Twitter account because \"it doesn´t carry the same weight\" it once did.Custodio, at the Philadelphia elections commission, said his office would not buy verification either, even if it gets denied a gray check.\"The blue or gold check mark just verifies you as a paid subscriber and does not verify identity,\" he said.",
        "Experts and advocates tracking election discourse on social media say Twitter's changes do not just incentivize bad actors to run disinformation campaigns - they also make it harder for well-meaning users to know what´s safe to share.\"Because Twitter is dropping the ball on verification, the burden will fall on voters to double check that the information they are consuming and sharing is legitimate,\" said Jill Greene, voting and elections manager for Common Cause Pennsylvania.That dampens an aspect of Twitter that until now had been seen as one of its strengths - allowing community members to rally together to elevate authoritative information, said Mike Caulfield, a research scientist at the University of Washington´s Center for an Informed Public.\"The first rule of a good online community user interface is to ´help the helpers.' This is the opposite of that,\" Caulfield said. \"It takes a community of people who want to help boost good information, and robs them of the tools to make fast, accurate decisions.\"____ The Associated Pressreceives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP´s democracy initiative here. The AP is solely responsible for all content."
    ]
}