{
    "articleURL": "/tvshowbiz/article-12038199/Diddy-Doja-Cat-host-star-studded-Met-Gala-party-frolicking-scantily-clad-women.html",
    "content": [
        "Diddy and Doja Cat pulled out the stops for a dazzling star-studded afterparty for the Met Gala on the first Monday of May at The Box nightclub in New York City.",
        "Amid the cavalcade of celebrities who flooded into the high-octane event, there was a claque of women in skimpy outfits frolicking around and flaunting their assets, along with a few men in saucy chest-baring ensembles.Two women who were almost totally naked except for pasties, underwear and jewelry could be spotted dancing on an elevated platform, and a third swung from the ceiling between the chandeliers.Meanwhile top-flight names hobnobbed around the fete, from Cardi B who arrived with her husband Offset to Paris Hilton, Emily Ratajkowski, Teyana Taylor and Naomi Campbell.Kendall Jenner could be seen shielding her face from onlookers as she emerged from the blowout bash with her beaming new boyfriend Bad Bunny trailing behind her. ",
        "Doja herself exuded throwback style in a glittering showgirl chic outfit that brought back memories of the 1920s, including with its curtains of rose gold fringe.The ensemble featured a pleated pink skirt with a beguilingly high thigh-slit that allowed her to showcase her shapely legs to full advantage as she slid into a seat.Emily Ratajkowski on the other hand treated the shutterbugs to her mesmerizing supermodel stare, shooting a glance over her shoulder as she made her way around the room in a backless sequined royal purple frock.Teyana Taylor cut an authoritative figure in a striking black leather trouser suit, which she festooned with jewelry including several strings of pearls. ",
        "Busta Rhymes made his presence felt in an eye-popping floral blazer, while Ivy Getty modeled a slinky black number accented with mesh and Mary J. Blige rocked a massive pair of chandelier earrings. Odell Beckham Jr. showed off his sculpted athlete's physique in a clinging black t-shirt that not only enabled him to bare his musclebound arms but also his toned chest via his plunging V-neck.Elena Azzaro slipped her petite frame into a gleaming gold minidress reminiscent of the 1960s, while Kailand Morris swanked about in a sleek white three-piece suit.Cardi turned up at the fete in a skintight metallic gown with a plummeting neckline that barely contained her surgically enhanced assets as she chatted with her husband. ",
        "Diddy, draped in a shimmering black silk top that fell to expose his toned chest, could be spotted stepping up onto a platform drink in hand to rev up the crowd during the rollicking knees-up.Diddy was heard telling friends he is gearing up to attend Miami Grand Prix at the weekend which kicks off with a party at Miami's Club M2 on Thursday night.   Some of his fellow high-profile guests joined him, including French Montana who shared an affectionate embrace with him and A$AP Ferg who seized the chance to whisper something private into Diddy's ear.",
        "Trevor Noah was glimpsed hobnobbing with one of the female guests at the soiree, while Chris Rock could be seen throwing himself into the spirit of the occasion, clinging to the ceiling.Paris Hilton, flashing her cleavage and her chiseled midriff in a black bandeau, snatched a bit of downtime to chat with her sister Nicky Hilton Rothschild as well as Marc Jacobs and his sizzling fiancé Char Defrancesco.Over the course of the evening Paris also indulged in some one-on-one time with Marc, having modeled one of his designs earlier that day during her Met Gala debut.Jared Leto was a reliably scene-stealing presence amongst the partygoers, swanning about while carrying a the massive false cat head he had worn as a mask at the Met Gala.This year's Met Ball was a tribute to the pioneering late designer Karl Lagerfeld, who was famously devoted to his cat Choupette, prompting Jared to dress as the pampered feline at the fashion extravaganza. With his mask off at Diddy and Doja's afterparty, Jared sported glistening silver eye makeup that served as an elegant complement to the swooping epaulettes on his translucent black top. ",
        "Jared could be seen rubbing shoulders with model Emilia Silberg, whose silver dress featured a chain motif that matched her tasseled drop earrings.",
        "Fatima Cuellar, who represented El Salvador at the Miss World competition in 2017, displayed her beauty queen assets in a see-through net dress while spending time with socialite Sergio Farias.Naomi meanwhile could be seen weaving her way through the crowd alongside Edward Enninful, the editor in chief of British Vogue and a fashion figure she has vocally championed.The room was ornately decorated with Karl Lagerfeld  florals which were curated by swanky florist Venus et Fleur. The free flowing booze included D’USSE cognac, champagne Armand De Brignac (Jay Z’s champagne), Ciroc and Deleon. As the party neared the end guests were treated pizza at 3am served by waiters trussed up like the late designer Karl Lagerfeld.  The flesh-flashing women at the party amped up the glitz factor, modeling such outfits as a silver net dress over matching lingerie, a bubblegum frock and a spidery headdress."
    ]
}