{
    "articleURL": "/news/article-12039951/EPHRAIM-HARDCASTLE-Archbishop-Canterbury-gives-billing-King-Charles-Coronation.html",
    "content": [
        "Justin Welby has given himself top billing at the Coronation. The Archbishop of Canterbury will deliver a coronation sermon, the first since Randall Davidson preached at the crowning of George V in 1911. He will also be one of just two people allowed to pay personal homage to King Charles. The other is Prince William. And he has introduced a ritual which sees the King welcomed by a ‘young person’ on entering the Abbey. His Majesty will reply by humbly comparing himself to Jesus. This was a novelty the prelate introduced when he was enthroned ten years ago at Canterbury Cathedral. He was greeted by a ‘young’ member of the congregation, and told her: ‘I am Justin, a servant of Jesus Christ.’ Has he turned the crowning into the Justin Welby Show?",
        "The problem of how to anoint Camilla without messing-up her hairdo has been resolved with a bit of traditional Anglican fudge. At the 1937 anointing of the Queen Mother, the order of service noted ‘the Archbishop shall pour the Holy Oil upon the Crown of her Head’. However, on Saturday, the order of service says that ‘the Queen is anointed on the forehead’.Have the Just Stop Oil boobies been in touch?Historian Kate Williams warns BBC Radio 2 listeners King Charles will depart Westminster Abbey wearing the Imperial State Crown which ‘weighs a ton’. But Kate cautions that Charles will earlier don the even heavier St Edward’s Crown, warning: ‘It weighs nearly five pounds, so it’s really the size of a newborn baby. So you are walking around with a baby on your head!’ Perish the thought!",
        "BBC’S Nick Beake excitedly reports on Radio 4’s Today programme that president Macron was met a by a ‘chorus of whistles’ and forest of red cards at Saturday’s French Cup Final. Quoi? Paris media described the footie protest as a flop, with barely a card or whistle around. The live TV commentator noted at the very 49th minute when the protest was supposed to peak: ‘The game is deemed to be more important.’ Specsavers, Nick?No love lost between Jamie Oliver and restaurant critic Jay Rayner, with the latter raising an eyebrow at Jamie’s plan for a new nosherie at Theatre Royal Drury Lane – four years after the collapse of his restaurant group resulted in the loss of around 1,000 jobs. ‘I can only assume that every single supplier, (including HMRC/ HSBC) who was owed money, has been paid out,’ tweets Rayner, adding waspishly: ‘Of course you’d make sure of that before you opened a new restaurant, wouldn’t you.’",
        "Thin-skinned one-time pop lothario Mick Hucknall is stung by a media report claiming he slept with 1,000 women before marrying. The Simply Red singer, whose past lovers reportedly include Catherine Zeta-Jones, Helena Christensen and Lady Victoria Hervey, now huffs: ‘I have never “claimed” to have slept with a single woman, let alone kept count.’ Maybe you stayed awake, Romeo!"
    ]
}