{
    "articleURL": "/wires/pa/article-12043175/Racist-text-helped-spur-Fox-News-oust-star-host-Tucker-Carlson.html",
    "content": [
        "Text messages that helped lead Fox News to part ways with star host Tucker Carlson included one in which he wrote that Trump supporters beating a protester was “not how white men fight”, according to The New York Times.",
        "The text was one of a trove of messages from Carlson and other Fox News hosts uncovered in a defamation lawsuit filed by Dominion Voting Systems against the network for airing false allegations that the company’s machines were used to steal the 2020 election from former president Donald Trump.The sides settled just as the trial was getting under way, with Fox agreeing to pay Dominion nearly 800 million dollars (£640 million).While some of Carlson’s texts have been publicly released, the one quoted by the Times remains redacted by the court, as do numerous other exhibits.The Times reported that Carlson sent the text to a producer hours after Trump supporters attacked the US Capitol on January 6 2021.He describes a video he had seen a couple of weeks earlier of Trump supporters beating someone he described as “an Antifa kid”.Carlson wrote about his conflicting emotions in watching the fight, which he described as “three against one, at least”.“Jumping a guy like that is dishonorable obviously,” he wrote, according to the Times. “It’s not how white men fight.”He added: “I should remember that somewhere somebody probably loves this kid, and would be crushed if he was killed,” after admitting part of him was rooting for the attackers.",
        "“If I don’t care about those things, if I reduce people to their politics, how am I better than he is?”Before his removal last month, Carlson was Fox’s top-rated host. He drew controversy for supporting theories such as the idea that immigrants are being admitted to the US to “replace” people born there.Critics have called that white supremacy, an accusation he has denied."
    ]
}