{
    "articleURL": "/news/article-12041093/More-100-Ndrangheta-mafia-mobsters-associates-arrested-raids-Europe.html",
    "content": [
        "In Germany, more than 1,000 officers raided dozens of homes, offices and storesIn Italy, officers arrested 108 people believed to be 'Ndrangheta mafia mobstersPolice arrested more than 100 suspected mobsters thought to belong to the notorious 'Ndrangheta mafia across Europe in the early hours of this morning in a huge crackdown on the feared Italian crime syndicate.",
        "Under the cover of darkness, thousands of police officers across Germany, Italy, France, Belgium, Portugal and Spain raided the suspected mobsters' homes as part of an investigation codenamed 'Operation Eureka'.In Germany, more than 1,000 officers descended on their homes and offices across the western state of North Rhine-Westphalia and Rhineland Palatinate to the east, with more than 20 suspected criminals arrested in the raids.And in Italy, 1,400 Carabinieri police officers backed by helicopters arrested 108 suspected 'Ndrangheta mobsters in the major operation which saw huge piles of cash, drugs and firearms seized.The suspects are accused of mafia criminal association; possession, production, and trafficking of drugs and weapons; criminal tax evasion and money laundering.",
        "Italian and Belgian investigators believe that the Calabria-based 'Ndrangheta mobsters smuggled close to 25 tonnes of cocaine between October 2019 and January 2022 and funnelled more than 22 million euros (£19.4 million) from Calabria to Belgium, the Netherlands and South America.The 'Ndrangheta has now surpassed Cosa Nostra as the most powerful mafia group in the country, and one of the largest criminal networks in the world.Italy's Carabinieri police carried out 108 arrests across the country in an investigation based in the southern city of Reggio Calabria, they said in a statement. A further 15 people were detained on the orders of police in the northwestern port of Genoa. ",
        "In Belgium, police raided more than 20 addresses, prosecutors said, adding they would provide more details at a news conference later in the morning. Meanwhile, in Germany the main focus of the operation was in North Rhine-Westphalia and Rhineland-Palatinate, with around 500 officers deployed in each state. A total of 30 suspects were arrested there who had outstanding warrants. In North Rhine-Westphalia, 51 houses, apartments, offices and business premises were searched and 15 suspects were arrested.In Rhineland-Palatinate, police searched 50 premises and arrested 10 suspects. The task forces in Rhineland-Palatinate were supported by special units of the federal government and other states as well as customs and the tax investigation department, German news agency dpa reported.Two suspects who were under investigation in the western state of Saarland, were arrested in Italy. Police did not identify them, but said one was 47 years old and the other 25.A man was arrested in Spain's southern city of Malaga as part of the coordinated investigation, Spanish police said, without giving further details.",
        "State police in Bavaria said the arrests were the result of more than three years of an investigation dubbed 'Operation Eureka'. The state interior minister of Rhineland-Palatinate, Michael Ebling, called the raids an 'effective blow' against organised crime.'Today sends out a very clear signal: There is no place for organized crime in Europe and there is certainly no place for it here with us in Rhineland-Palatinate,' he said, according to dpa.",
        "The suspects are accused of money laundering, gang tax evasion, commercial gang fraud, and narcotics smuggling, a statement from the German state office of criminal investigation in North Rhine-Westphalia said.The raids are part of a wider joint investigation involving Europol and also included simultaneous measures against the group across Europe, the statement said.European authorities have been waging a campaign against 'Ndrangheta, arguably the world's richest organised crime group, in recent years. The group has exploited tens of billions of dollars in cocaine revenues over decades to extend its criminal reach across Europe and into several continents as the Sicilian Mafia lost influence. "
    ]
}