{
    "articleURL": "/wires/reuters/article-12046041/Sudan-conflict-deals-new-blow-stagnant-economy.html",
    "content": [
        "Fighting raging in capital, Sudan's business hub",
        "Imports and exports slowing to a trickleCash crunch as forex market distortedBy Khalid Abdelaziz, Sarah El Safty and Nafisa EltahirKHARTOUM/CAIRO, May 4 (Reuters) - The conflict shaking Sudan has dealt a crippling blow to the heart of the country's economy in the capital Khartoum, as well as disrupting internal trade routes, threatening imports and triggering a cash crunch.Across swathes of the capital factories, banks, shops and markets have been looted or damaged, power and water supplies have been failing, and residents have reported steep price rises and shortages of basic goods.Even before the fighting between military factions broke out on April 15 Sudan's economy had been in deep stagnation following a crisis stretching back to the last years of Omar al-Bashir's rule and turmoil after his overthrow in 2019.Tens of thousands have now fled the violence in Khartoum and its sister cities of Bahri and Omdurman, while millions more have sheltered at home as shelling and air strikes rattle across neighbourhoods.Transport of goods and people has slowed as troops and sometimes gangs roam the streets. Telecom networks have become unreliable and some say they have begun rationing food and water.\"We are afraid, and we are suffering from high prices, shortages, and lack of salaries. This is a war on the citizen,\" said Ismail Elhassan, an employee at one Khartoum business.",
        "Sudan, already an important exporter of gum arabic, sesame, peanuts, and livestock, has the potential to be a major agricultural and livestock exporter and logistics hub.But the economy has been held back by decades of sanctions and international isolation, as well as deep corruption. Most Sudanese have struggled with years of rampant inflation, sharp currency devaluations and sliding living standards. About a third of the 46 million population depends on humanitarian aid.NO DRIVERSThe conflict has hampered trade flows in and out of the East African nation, since banking and customs procedures are centralised in Khartoum. While the country's main port on the Red Sea is operating, at least one big shipping company, Maersk, says it has stopped taking bookings until further notice.Imports of wheat, key to Sudan's food security, are becoming more difficult, said one Khartoum-based trader. Imports of white goods such as refrigerators across the land border with Egypt, where tens of thousands of Sudanese have fled northwards, have also slowed, said Federation of Egyptian Chambers of Commerce secretary-general Alaa Ezz.Michel Sidhom, a supply chain manager at a trading company operating in Egypt and Sudan, said its business in Sudan had \"completely stopped\" as exports of Egyptian fertilizers and flour, typically about 10,000 tonnes per month each, were halted.",
        "Egypt, Sudan's second biggest destination for livestock, a key export, said it is looking to diversify its sources as a result of the unrest.Sidhom says his company's traders in Sudan have left Khartoum, and no drivers are willing to risk transporting their goods to the capital city.\"They shut down and left Khartoum until further notice. Whoever stays in Khartoum stays in a battlefield,\" he said.SCARCITY, HIGH PRICESShortages of items such as flour and vegetables have been reported in Khartoum along with price hikes. Long queues form in front of bakeries and supermarkets in the capital.The price of one kilogram of lamb has jumped nearly 30% to 4,500 pounds ($7.52), according to a Reuters reporter, while the price of a kilogram of tomatoes doubled to 1,000 pounds ($1.67).A supermarket owner in Omdurman blamed the inflation on soaring black market fuel prices. A gallon of scarce fuel can now cost as much as 40,000 pounds ($67), up from 2,000 pounds ($3.34).Even in places where fighting has abated demand is low, said one Omdurman butcher. \"Everyone's left,\" he said.Sudan's pound has lost about 600% against the dollar since 2018, prompting many to save money in dollars.Traders in Khartoum face a cash crunch, and people are increasingly dependent on an electronic wallet app known as Bankak, which often suffers outages, to pay bills.",
        "The black market has become distorted, as relatives abroad seek to sell dollars for Bankak transfers, while those in the country seek dollars for safe keeping.Currency traders offer dollars at rates as high as 700 pounds ($1.17), while buying at as little as 300 pounds ($0.5014), with prices varying widely as transport and communication becomes more difficult.Sudan's central bank on Sunday said banks outside the capital were carrying out withdrawal and deposit transactions. Within Khartoum, the army and RSF have accused each other of looting banks. The head of one Khartoum bank said he was trying to temporarily move the bank's headquarters outside the capital.Another executive said that in years of economic reforms, coups, and protests, \"this is the biggest challenge to face the banking system, and threatens an almost complete shutdown,\" he said.In the city of Atbara, north-east of Khartoum, crowds of people were seen outside of banks, some of which had imposed withdrawal limits.\"My cash has run out because I haven't received my salary and the banking apps don't work,\" said Elhassan, speaking from Khartoum. ($1 = 598.2002 Sudanese pounds)(Reporting by Khalid Abdelaziz in Atbara, Sarah el-Safty and Nafisa Eltahir in Cairo; Editing by Aidan Lewis, William Maclean)"
    ]
}