{
    "articleURL": "/tvshowbiz/article-12051761/Kate-Chastain-40-Deck-fame-welcomes-child-son-named-Sullivan-Cay.html",
    "content": [
        "Below Deck alum Kate Chastain has welcomed her first child.",
        "The 40-year-old reality TV star shared the happy news on Friday via her Instagram page.In the image she can be seen beaming with pride as she holds onto her new bundle of joy who has a full head of dark hair. They are reclined in her hospital bed as she has on black Gucci sunglasses with her hair in a messy top knot as she models an opened white blouse.'Hard Launch: Sullivan Cay,' the blonde TV star - who announced her pregnancy in December - wrote in her caption.She has not yet named who the father is though she has been wearing a diamond ring on her wedding finger lately which suggests she is either engaged or married.",
        "In mid December she broke the news of her pregnancy.Kate shared a selfie in which she wore a blue floral dress that accentuated her burgeoning baby bump.She flashed a diamond ring on her wedding finger as well. 'I’m already planning so many birthday theme parties for you,' she gushed in the caption.The star added a string of alternating red and blue heart emoji.As regards her romantic situation, she spilled onstage at BravoCon in November 2022 that she was 'single,' the network reported. She divulged last year to People that she was due in May.",
        "And she added that her pregnancy announcement was prompted by the fact that fans will see her bump on TV soon.",
        "Although she exited Below Deck a couple of years ago after six seasons, she still features on its retrospective companion show Below Deck Galley Talk.Viewers will also be able to catch Kate on the Peacock reality show The Traitors hosted by Alan Cumming.'This is such a new and special experience, so I'm really being protective of what I share publicly,' Kate said of her pregnancy.'But with new episodes of Below Deck Galley Talk about to air on Bravo after Christmas and The Traitor premiering on Peacock on Jan. 12, 2023, there's just no hiding my baby bump any longer!'",
        "She effervesced: 'I am absolutely thrilled to become a mother. It's something I've always hoped for so this is truly a dream come true!'Kate fell into the yachting business when she took a job on a luxury vessel during her gap year fresh out of college, according to her Bravo bio.The lark eventually turned into a lasting career at sea, which then brought her fame on Below Deck as the chief stewardess of a yacht."
    ]
}