{
    "articleURL": "/news/article-12048157/Polls-close-crunch-local-elections-Rishi-Sunak-warning-Tories-face-hard-night.html",
    "content": [
        " Voters across England have been choosing 8,000 councillors in 230 councilsRishi Sunak dismissed calls for a change in approach today despite the Tories suffering big losses in local elections - and Keir Starmer boasting he is set to win the keys to No10.",
        "The PM insisted he is focused on the 'people's priorities' after grim results that have so far seen the Conservatives lose control of nine councils and shed more than 200 seats. Labour ended 23 years of blue rule to take charge in Medway, while Mr Sunak's grip was prised loose in Brentwood, Tamworth, North West Leicestershire, Hertsmere, East Lindsey, South Kesteven, East Hertfordshire and South Gloucestershire.In another body blow, the Lib Dems have seized Windsor &amp; Maidenhead - in Theresa May's constituency.  Although many more results are to come, polling experts said the Tories could yet face the 'calamity' of losing more than 1,000 seats overall. Worryingly for Mr Sunak the pummelling has been coming in both 'Red Wall' areas and traditional heartlands.Labour celebrated victories in Plymouth, where the Conservatives had been running a minority administration, and Stoke-on-Trent - a key battleground ahead of next year's general election. They were also jubilant about a mayoral win in Middlesbrough.",
        "Medway - Tory LOSS to LabourWindsor - Tory LOSS to Lib Dems Brentwood - Tory LOSS to no overall controlHertsmere - Tory LOSS to no overall controlNorth West Leicestershire - Tory LOSS to no overall controlTamworth - Tory LOSS to no overall controlEast Lindsey - Tory LOSS to no overall controlSouth Kesteven - Tory LOSS to no overall control East Hertfordshire - Tory LOSS to no overall control South Gloucestershire - Tory LOSS to no overall control Plymouth - Labour GAIN from no overall controlStoke-on-Trent - Labour GAIN from no overall controlBoston - Independent GAIN from no overall control *Labour have also won the mayoral contest in Middlesbrough",
        "The party boasted that their performance so far, if replicated at a general election, would be good enough to see Sir Keir become PM. That would require a massive double-digit swing.Angry local leaders blamed a backlash over access to GPs, housing and potholes. Some Tory MPs also renewed calls for immediate tax cuts. In both Tamworth and North West Leicestershire there were signs that recent Westminster sleaze scandals had damaged the Tories as they lost control of both councils.Tamworth's local MP is Chris Pincher, the former Conservative whip who faced groping claims last summer in a scandal that ultimately led to Boris Johnson's downfall as PM.The North West Leicestershire MP is Andrew Bridgen, who was kicked out the Conservative Party last month following his claim that Covid vaccines were 'the biggest crime against humanity since the Holocaust'.As well as their gains in Plymouth and Stoke-on-Trent, Labour held on to councils in Sunderland, Chorley, Halton, Newcastle-upon-Tyne, South Tyneside, Sefton, Exeter, Stevenage, Ipswich, Lincoln, Coventry, Salford, Sandwell, Reading and Bassetlaw.They failed to gain a majority in Hartlepool by just one seat, two years on from suffering a devastating Commons by-election loss in the 'Red Wall' area.The Tories held on to a series of councils across England - including Broxbourne, Harlow, Redditch, Basildon, Havant, Rushmoor, North East Lincolnshire, Thurrock and Dudley - but were braced for more losses as ballots continue to be counted.",
        "Conservative chairman Greg Hands admitted the early evidence was 'disappointing'.But Mr Sunak - who arrived at CCHQ with bags of comfort food this morning - pointed to 'progress' in areas such as Sandwell, and said he was concentrating on 'delivering' issues such as lower inflation and stopping Channel migrants. He said it was 'always disappointing to lose hardworking Conservative councillors' but added: 'I'm not detecting any massive groundswell of movement towards the Labour Party or excitement for their agenda.'Elections guru Professor Sir John Curtice told the BBC that the Tories had lost around one in every three seats declared. 'The initial results declared so far confirm the message of the polls that the Conservatives are in considerable electoral trouble, but that the spoils in these local elections are being secured by both Labour and the Liberal Democrats,' he said.Sir John suggested the 'calamity' of more than 1,000 seat losses for the Conservatives - a bar that was widely seen as Tory expectation management ahead of polling day - could yet become reality.But he suggested that the swing in the national vote might 'not quite' reach the levels needed for an overall Labour majority. ",
        "Labour gloated that they had spoiled Mr Sunak's 'political honeymoon'. Shabana Mahmood, national campaign co-ordinator, said: 'These results show that we are on course for a majority Labour government.",
        "'These results have been a disaster for Rishi Sunak as voters punish him for the Tories' failure.'Labour sources said the results implied they would take Aldershot at a general election - a seat that has been Conservative for a century.The Liberal Democrats held on to Eastleigh, Hull, Cotswold, and Bath and North East Somerset councils.From 7am to 10pm yesterday, voters across England visited polling stations to choose around 8,000 councillors in 230 councils.But interpreting the outcome is not straightforward, as the seats up for grabs were last contested in 2019 - when both the Tories and Labour were in dire positions.   Mr Sunak has already lined up a fightback, with long-awaited proposals to improve access to GPs due to be unveiled next week.Downing Street has drawn up plans for a health-focused mini-relaunch in the coming days to demonstrate that the Prime Minister is focused on delivering on the public's priorities.The package will include the Government's delayed primary care plan which is designed to free up hundreds of thousands of GP appointments by asking pharmacists to issue more prescriptions.The Tory MP in Plymouth, Johnny Mercer, who is the veterans' minister, said it had been a 'really terrible night for us here in Plymouth'.Pointing to a row over tree-felling by the council, he added: 'There's a number of factors at play - locally it's been very difficult, the Conservative group here has been through a very difficult time.'",
        "A senior Tory source said: 'It's always disappointing to lose hardworking local Conservative councillors.'We expected it would be a tough night for the Party. There are still many more results to come with just 25 per cent of seats declaring overnight, there is a long way to go yet.'Labour MP Luke Pollard, whose Plymouth, Sutton and Devonport constituency neighbours Mr Mercer's seat, said Mr Mercer was 'toast' at the next general election.As well as their success in the South West, Labour were also celebrating their candidate Chris Cooke defeating the independent incumbent to become the new mayor of Middlesbrough. A party spokesperson said: 'This is an huge result and beyond our expectations. 'Taking this back from independents who won it with 59 per cent of the vote in 2019 shows exactly the kind of progress we needed to make in Teesside.'With the swing to Labour on the margins of what is needed to generate a majority at a general election, Lib Dem leader Ed Davey dodged on whether he would be willing to prop up Sir Keir in power.He told Sky News: 'I'm focused on beating those Conservative MPs and SNP MPs in Scotland, where I think the Liberal Democrats have a really good chance, and I'm increasingly confident about our ability to beat Conservative MPs at the next general election.",
        "'I don't think the Conservatives can be removed from Government if Liberal Democrats don't beat those Conservative MPs.'Local Tories pinned the blame for poor council election results on a failure to grip issues such as the NHS.Outgoing Medway council leader Alan Jarrett told BBC Radio 4's Today programme the government must 'get their act together on a number of fronts'.He said that included 'being clearer about housing requirements... and a really big issue here is access to GP provision'.Others highlighted the turmoil at Westminster over the past year. 'Nationally and locally we've had a very difficult 12 months and I think the electorate have responded to that and voted as they see fit today,' Jeremy Oates, the Tory leader on Tamworth Council, told the BBC.Chris Mitchell, a former local Tory leader who lost his seat on Worcester Council to the Greens tonight, said: 'The political backdrop of Westminster undoubtedly is a key factor, which we heard on the doorstep.'Virge Richichi, a former chair of North West Leicestershire Council and a current councillor, said: 'We've been dealt a pretty bad hand over the past three or four years from Boris, Liz Truss and now Rishi Sunak.'And hopefully Rishi Sunak will put us on the right track again.'",
        "CiAgICAgIDxkaXYgZGF0YS14cG1vZHVsZS0yMDIzLW1heS1lbGVjdGlvbnMgZGF0YS1zZWxlY3RlZC1tYXAtdGFiPSJlbmdsYW5kIiBkYXRhLW1heS1oaWRlLXRhYnM9InRydWUiID4KICAgICAgICA8ZGl2IGNsYXNzPSJtYXktbWFwLXRhYnNlbGVjdG9ycyI+CiAgICAgICAgICA8ZGl2IGRhdGEtbWFwLXRhYi1zZWxlY3Q9ImVuZ2xhbmQiIGNsYXNzPSJtYXlTZWxlY3RlZCI+RW5nbGFuZDwvZGl2PgogICAgICAgIDwvZGl2PgogICAgICAgIDxkaXYgY2xhc3M9Im1heS1saXZlcmVzdWx0cyI+TElWRSBSRVNVTFRTPC9kaXY+CiAgICAgICAgPGRpdiBjbGFzcz0ibWF5LW1hcC10YWJzIj4KICAgICAgICAgIDxkaXYgZGF0YS1tYXktdGFiPSJlbmdsYW5kIiBjbGFzcz0ibWF5U2VsZWN0ZWQiPgogICAgICAgICAgICA8aW1nIHNyYz0iaHR0cHM6Ly9pLmRhaWx5bWFpbC5jby51ay8xcy9lbGVjdGlvbi8yMDIzLWVuZ2xhbmQuanBnIiBsb2FkaW5nPSJsYXp5IiB3aWR0aD0iMTQwMCIgaGVpZ2h0PSIxMzcyIiBhbHQ9IkVuZ2xpc2ggTG9jYWwgRWxlY3Rpb25zIiAvPgogICAgICAgICAgPC9kaXY+CiAgICAgICAgPC9kaXY+CiAgICAgIDwvZGl2PgogICAg",
        "Prior to polling day, the PM had predicted a 'hard night' and warned that - despite 'good progress' since he entered No10 - Tory councillors could yet be punished for the turbulence of the past 12 months at Westminster.Mr Sunak personally paid for a delivery of 10 large Domino's pizzas at Tory HQ last night ahead of votes being counted across England. The local council seats being decided this year were last contested in 2019, at the nadir of Theresa May's time as PM.Following a poor performance that night, Mrs May went on to suffer humiliation in European Parliament elections just three weeks later, which swiftly led to her resignation.But Labour was also failing to make major inroads at the time with an unpopular leader in Jeremy Corbyn.Polling experts have said that Labour needs to score a victory of more than 10 per cent in the projected national vote share in this year's local elections to show that Sir Keir is on course to be the next PM.Sir Tony Blair had double-digit local election vote share victories in the lead-up to New Labour's landslide in 1997, as did David Cameron's Tories before 2010 when they ended up in coalition with the Liberal Democrats.Labour gaining 700 seats or more would be the party's best local election performance for at least 10 years.And gains above 500 seats would point to Sir Keir being poised to win the keys to Downing Street at the next general election, experts have said.",
        "Thursday's local elections were the first time it has been compulsory for all voters in England to show photo identification at polling stations. There were regional pilots previously.There were reports of confusion at ballot stations over new ID rules, with the Lib Dems complaining that the numbers are 'significant'.Some said they turned up to vote with photo ID only to be told it was the wrong type - while others claimed 'greeters' were asking for identification and turning people away outside, meaning that records would not be kept.The craze for #dogsatpollingstations even got in on the act, with one owner creating an ID for her pet.But the Electoral Commission said their initial assessment was that 'overall, the elections were well run'.People were required to show a form of photo identification, such as a passport, driving licence or blue badge.Other forms of identity that were being accepted include biometric residence permits, defence identity cards, and national identity cards issued by the EU, Norway, Iceland or Liechtenstein.Supporters say it is normal to show ID in much of the rest of the world, and the move protects the integrity of the process. But critics argue it could deter young people and those from poorer communities.There have been questions raised about why bus and travel passes for older and disabled people were accepted as photo IDs, but that young people's travel cards were not."
    ]
}