{
    "articleURL": "/news/article-12052869/UC-Santa-Cruz-students-celebrated-Hitlers-birthday-ate-cakes-adorned-hateful-symbols.html",
    "content": [
        "Students allegedly partied on campus for Adolf Hitler's birthday on April 20 An off-campus incident saw anti-Semitic and anti-LGBTQ+ fliers posted The school has not yet charged anyone for participating but is investigating The University of California at Santa Cruz sent out a letter condemning a pair of recent events that saw students allegedly party for Adolf Hitler's birthday on April 20.",
        "The northern California outpost of the state's university system said that there were multiple anti-semitic and anti-LGBTQ+ incidents reported on or near the campus.  Vice Chancellor for Student Affairs and Success Akirah Bradley-Armstrong said in a statement that students were overheard singing happy birthday to Hitler and eating cakes 'adorned with hateful and horrific symbols.'The party was reported to have taken place on campus April 20.A second incident was reported on the next day in downtown Santa Cruz off campus when a flier 'included despicable and degrading claims about Jewish people and LGBTQIA+ people,' Bradley-Armstrong said. ",
        "'We unequivocally condemn these – and all – anti-Semitic and anti-LGBTQIA+ actions,' Bradley-Armstrong said.The school's student conduct department is currently investigating the party celebrating Hitler's birthday.'White supremacy has no place at UC Santa Cruz. Nor does any action intended to degrade, dehumanize, or intimidate another based on identity. We will not tolerate such vitriol; nor will we abide the fear and terror it intends to inspire,' Bradley-Armstrong said in the statement. 'United by our shared sense of humanity, we must strive to be a welcoming place for all people. Together, we must continue to reject all expressions of hate.' UC Santa Cruz has contacted city officials in an attempt to address the anti-Semitic and anti-LGBTQ+ fliers. ",
        "However, the school has yet to say whether anyone has been suspected or charged with having participated. Bradley-Armstrong reiterated the campus' commitment to fighting hate.  'Whatever the purpose and wherever they take place, we reject any and all acts of antisemitism,' she added.",
        "'Our Jewish community members and our LGBTQIA+ community members are an integral part of our Banana Slug family, and we stand with them against all such acts of hate.'UC Santa Cruz's mascot is the banana slug.  The incident even drew condemnation from California's Democrat Governor Gavin Newsom.'This is absolutely sick. These kinds of disgusting acts have no place in California,' he tweeted in response. The Anti-Defamation League, who tweeted in anger about theincident, said last month that anti-Semitic incidents in the US reached their highest level in the US last year since they began keeping record in 1979. "
    ]
}