{
    "articleURL": "/wires/reuters/article-12039215/Energy-Transfer-acquires-Lotus-Midstream-raises-2023-earnings-outlook.html",
    "content": [
        "By Stephanie Kelly",
        "NEW YORK, May 2 (Reuters) -U.S. midstream company Energy Transfer said on Tuesday it has completed its $1.45 billion acquisition of Lotus Midstream Operations and boosted its earnings expectations higher for the rest of the year.The acquisition of Lotus Midstream Operations adds about 3,000 miles (4,800 km) of crude oil gathering and transportation pipelines, extending from southeast New Mexico across the Permian Basin of West Texas to Cushing, Oklahoma, it said.Energy Transfer is now working to integrate operations and assets, including the construction of a 30-mile pipeline and terminal optimization project to enhance connectivity within the Permian Basin and provide a direct link between Midland and Cushing.Given the acquisition as well as increasing energy demand, Energy Transfer raised its adjusted EBITDA expectations for 2023 to between $13.05 billion and $13.45 billion, versus $12.9 billion to $13.3 billion previously, it said.The company now expects its 2023 growth capital expenditures to be approximately $2 billion.Adjusted EBITDA for the first quarter was $3.43 billion, rising from $3.34 billion in the same quarter in 2022.During the first quarter, Energy Transfer's volumes increased across all segments from the same period last year.Natural gas liquids (NGL) transportation volumes were up 13% to a company record, it said. Midstream gathered volumes also reached a company record, gaining 14%.",
        "Interstate natural gas transportation volumes also rose to a company record, up 11%.Energy Transfer exported record NGL volumes out of the Nederland Terminal and record ethane volumes out of the Marcus Hook Terminal in the first quarter.The company completed during the quarter an optimization project on Oasis Pipeline, adding natural gas takeaway capacity out of the Permian Basin. (Reporting by Stephanie Kelly Editing by Marguerita Choy)"
    ]
}