{
    "articleURL": "/tvshowbiz/article-12044453/Chris-Pratt-looks-dapper-screening-Guardians-Galaxy-Volume-3-New-York-City.html",
    "content": [
        "Chris Pratt was ever the handsome leading man while attending a screening of Marvel Studio's Guardians of the Galaxy Volume 3 in New York City on Wednesday.",
        "The 43-year-old actor - who stars as Peter Quill / Star-Lord in the superhero franchise - looked dapper at the event, wearing a plaid grey blue suit over a navy shirt and tie. The father-of-three completed his look with a pair of black dress shoes and a silver watch. Earlier in the day Pratt appeared on Good Morning America where he promoted the release of the upcoming third installment, after previously revealing he had been initially turned down for a number of other superhero Marvel roles.The Adventure/Sci-fi film - directed by James Gunn - is set to hit theaters on May 5.",
        "Inside the event Pratt was joined by actor Bradley Cooper, 48, who looked casual cool in a navy jacket and pants.Cooper is the voice behind the raccoon Rocket in the films.James Gunn, 56, and his wife Jennifer Holland, 36, made a stylish pair as they hit the red carpet.The director sported a classy forest green suit over a crisp white t-shirt, and rocked his signature glasses.Meanwhile Jennifer - who married Gunn in 2022 - put on a busty display in a sizzling black gown with a thigh-high slit.She paired the ensemble with lime green knee-high boots, and wore her blonde shoulder-length tresses in gentle waves.",
        "Cynthia Nixon opted for a relaxed look, sporting an oversized white t-shirt and pants, along with a matching white denim jacket and sneakers.The Sex and the City star, 57, opted for a natural look, wearing just a touch of mascara for the event.",
        "David Harbour, 48, was accompanied by the step daughters he shares with wife Lily Allen: Marnie and Ethel.The Stranger Things actor rocked his signature bushy beard and was casual cool for the night, sporting a navy zip-up sweater and matching pants.Model Sophie Sumner, 33, was red hot in a fiery asymmetrical leather gown and gold sandal heels.Boardwalk Empire star Steve Buscemi, 65, was accompanied by girlfriend Karen Ho.The actor looked handsome as ever in a navy suit which he paired with a patterned scarf.Author Candace Bushnell, 64, dazzled in a blue velvet dress with crystal details and black knee-high boots. Amber Ruffin, 44, opted for a bright look, wearing a pink and green dress with sparkling silver flats.The comedian accessorized her look with stylish silver hoop earrings.",
        "Alysia Reiner, 52, wowed in a black dress with puffed out sleeves and a zipper in the front.She was joined by Miriam Shor, 51, who went for a daring look, going braless underneath a velvet blazer.",
        "Ashley Haas showed off her trim midriff in a colorful yellow, blue, and red bandeau top, which she paired with black leggings. The TV personality wore her blonde tresses parted in the middle and cascading down her shoulders.Scottish actress Karen Gillan, 35, showed off her style credentials in a trendy black oversized blazer, worn over a shimmering tan and crystal bodysuit.She paired the look with strappy silver heels and wore her fiery auburn tresses straight, gently falling down her shoulders.Brooke Shields' daughter Grier Henchy, 17, opted for a classy black suit and a black Chanel purse. Morena Baccarin, 43, was a bright vision in a vivid pink sweater which she paired with a feminine floral mini skirt and back leggings. The Homeland star finalized the look with black boots.Chukwudi Iwuji, 48, showed off her effortlessly cool style in an olive suit and white sneakers. Alex Lundqvist, 51, and his wife Keytt Lundqvist made a good looking pair as they posed for shutterbugs together.The Swedish model rocked a blue suit, while his wife looked glamorous in a geometric print bodysuit.",
        "The first Guardians of the Galaxy movie was previously released in 2014 and featured performances from Zoe Saldana, Dave Bautista and Bradley Cooper.All of the movie's principal cast members returned for the feature's sequel, which premiered in 2017.",
        "The Guardians went on to make appearances in both Avengers: Infinity War and Avengers: Endgame.Guardians of the Galaxy Volume Three is currently set to be released to the public on Friday."
    ]
}