{
    "articleURL": "/femail/article-12059585/Princess-Charlotte-dons-299-Ralph-Lauren-cashmere-jumper-15-polo-20-trainers-Next.html",
    "content": [
        "Princess Charlotte was dressed in a practical yet pretty outfit this afternoonRead More:  Charlotte the sharp shooter! Princess shows her brothers how it's done as they enjoy a spot of archery during Big Help Out event in SloughKate Middleton is famous for mixing high-end designers with high street bargains - and this afternoon, the mother-of-three opted for this winning formula with Princess Charlotte's outfit. ",
        "The Prince, 40, and Princess of Wales, 41, delighted volunteers this morning when they arrived at a local Scouts headquarters in Slough with their three children Prince George, nine, Princess Charlotte, eight, and Prince Louis, five. Following on from the Coronation concert last night, the family spent hours renovating some Scouts huts for local members to use.For the occasion, Kate dressed her second child in a practical and pretty pink ensemble. As she got stuck into some painting and archery, Princess Charlotte was pictured in a bright pink cable knit by US fashion house Ralph Lauren.",
        "The £299 slim-fitting knit is made of 100 per cent Italian cashmere and has a ribbed hem and cuffs.Along with her designer jumper, Kate dressed Charlotte in a £15 polo by high street giant Next.The perfectly matched light pink top had a pretty ruffled trim to the collar which poked out over the top of the crew-neck cut of Charlotte's knit.For the family day of activities, Kate also picked out some light blue denim shorts with a raw edge for her daughter to wear. What's more, the Princess of Wales also turned to Next for Princess Charlotte's footwear. The royal's £15 trainers have a strip of glitter by the heel and also featured a metallic star which perfectly matched the hue of Charlotte's jumper.",
        "Kate also ensured Charlotte's hair was out of her face by putting it in a half-up, down-down style with two plaits.Last year, the Princess of Wales dressed her daughter in an almost identical outfit for her seventh birthday portrait. ",
        "For that photoshoot, Princess Charlotte wore the light blue version of this £299 Ralph Lauren jumper with a white-and-black polka dot polo top from Next.After helping the team renovate their hut, Charlotte and her brothers were also given a yellow-and-purple Scouts necktie to wear.Prince George wore a practical navy puffa jacket with khaki trousers while Prince Louis was adorable in a blue polo and navy shorts. What's more, Kate was seen pushing a wheelbarrow while her youngest son shoveled in sand as they helped spruce up a Slough scout hut. He then took control, steering it expertly as his mum supported its weight.Charlotte was seen delightedly running to help prepare a new path while George, a future king himself, was spotted learning how to use a power drill. The couple and their three children were out and about again to mark the third day of the King’s Coronation, and Charles III's life of service.",
        "The Princess of Wales has been Joint President of the Scouts since 2020 and the royals joined volunteers resetting a path, digging a new soakaway, sanding and revarnishing the front door, adding planters to the front of the building and adding a mural to create a lasting legacy of the Big Help Out’s work.",
        "William and Kate attended in support of the Big Help Out along with other senior royals including the Duke and Duchess of Edinburgh, the Princess Royal and the Duke and Duchess of Gloucester.The Big Help Out scheme, which aims to inspire a new generation of volunteers by giving people a taster of what they can achieve, has been backed by celebrities across the country. The scheme, which aims to inspire a new generation of volunteers by giving people a taster of what they can achieve, has been backed by celebrities across the country. More than 1,500 charities have signed up. The Big Help Out has been organised by The Together Coalition and leading charities. "
    ]
}