{
    "articleURL": "/wires/reuters/article-12058331/Oil-prices-creep-higher-recession-fears-begin-fade.html",
    "content": [
        "Oil rallies after three straight weekly decline",
        "Energy producers shut in 2% of Canada's oil output amid wildfireGoldman Sachs says demand fears 'overblown'US inflation data and OPEC report in focus this week(Updates with settlement prices, adds market activity)By Stephanie KellyNEW YORK, May 8 (Reuters) - Oil prices rose over 2% on Monday as U.S. recession fears eased and some traders saw crude's three-week slide on demand worries as overdone.Brent crude settled up $1.71, or 2.3%, at $77.01. U.S. West Texas Intermediate (WTI) crude also gained $1.82, or 2.6%, to $73.16.A healthy U.S. jobs report for April helped oil to climb by about 4% on Friday even though labour market strength could compel the Federal Reserve to keep interest rates higher for longer.Brent had finished last week with a decline of about 5.3% while U.S. crude plunged by 7.1% even after Friday's rebound. Both benchmarks were down for three weeks in a row for the first time since November.\"Oil's rebound (on Monday) follows energy stocks' comeback on Wall Street last Friday after the U.S. reported strong job data, which eased concerns about an imminent economic recession,\" said CMC Markets analyst Tina Teng.Banking concerns have plagued the market recently after the collapse of three major U.S. regional banks in recent months. Still, the KBW Regional Banking index posted its best single-day performance in seven weeks on Friday, before falling on Monday.",
        "\"The market is less worried about a banking crisis that could lead to a recession and hurt demand,\" said Phil Flynn, an analyst at Price Futures Group.Also supporting oil prices, Alberta declared a state of emergency over the weekend in response to wildfires that have displaced nearly 30,000 people and prompted energy producers to shut in at least 185,000 barrels of oil equivalent per day (boepd), about 2% of Canada's output.Ole Hansen, head of commodity strategy at Saxo Bank, said oil's recent drop looked excessive.\"An oversold market condition combined with Brent managing to find support ahead of the March low forced recently established short sellers to seek cover, potentially highlighting that the recent sell-off was overdone,\" he said.Goldman Sachs analysts on Saturday said that concerns over near-term demand and elevated supplies were \"overblown.\"A round of voluntary output cuts by some members of the Organization of the Petroleum Exporting Countries and allies, together called OPEC+, begin this month and the group holds its next meeting on June 4.Before then, U.S. consumer price inflation figures for April will be in focus on Wednesday, potentially influencing the Fed's stance on future interest rate decisions.OPEC's latest monthly oil market report is due on Thursday, providing an updated reading on the demand and supply outlook. (Reporting by Stephanie Kelly in New York; additional reporting by Alex Lawler and Sudarshan Varadhand; Editing by David Goodman, Marguerita Choy and Deepa Babington)"
    ]
}