{
    "articleURL": "/wires/reuters/article-12048985/Reuters-Sports-News-Summary.html",
    "content": [
        "Following is a summary of current sports news briefs.",
        "Soccer-Napoli crowned Serie A champions following draw at UdineseNapoli won their third Serie A title, and their first in 33 years, on Thursday after a 1-1 draw at Udinese gave the Naples side an unassailable lead in the standings. Napoli's triumph ended the city's long wait for the Scudetto since Argentine great Diego Maradona led them to two championships in 1986-87 and 1989-90.Soccer-Messi receives offer from Saudi club Al-Hilal - sourceLionel Messi has received a formal offer to join Saudi Arabian club Al-Hilal next season, a source close to Argentina's World Cup-winning captain told Reuters on Thursday. The offer from the Saudi club is the only one Messi has received so far, the source added. Argentine media have reported that the offer is worth around $400 million a year.NHL-Stanley Cup-winning Czech forward Klima dead at 58Petr Klima, the Czech forward who stepped up to score one of the most memorable goals in Edmonton Oilers history during the NHL's 1990 Stanley Cup Final, died on Thursday at the age of 58. A cause of death was not given.Motor racing-Hamilton no fan of Florida Governor DeSantisIt's probably safe to say Florida Governor Ron DeSantis will not be cheering for Lewis Hamilton this weekend at the Miami Grand Prix and the Mercedes seven-times world champion made it clear he is no supporter of the Republican leader. A long-time champion of LGBTQ+ rights, Hamilton will have a Rainbow Flag on his helmet for Sunday's race and said he stands with the gay, lesbian and transgender community that has come under attack by DeSantis.",
        "Tennis-Swiatek sets up Madrid final with Sabalenka, Tsitsipas knocked outTop-ranked Iga Swiatek cruised past Veronika Kudermetova 6-1 6-1 in the late semi-final of the Madrid Open on Thursday to set up a second straight final showdown with world number two Aryna Sabalenka. Swiatek had beaten Sabalenka 6-3 6-4 to win the Stuttgart Open at the end of April, gearing up for her French Open title defense later in May.Horse racing-Kentucky Derby goes on after four horse deaths at facilityA series of horse deaths at Churchill Downs cast a shadow over the 149th running of the Kentucky Derby, which kicks off the prestigious Triple Crown thoroughbred racing series on Saturday. The Louisville racetrack said it was working with regulators to investigate after four horses died at their facility in the lead-up to the 1 1/4-mile race, including one that was entered to run the derby, Wild On Ice.MLB roundup: Dodgers stun Phillies on walk-off slamMax Muncy hit a grand slam on the first pitch he saw from former teammate Craig Kimbrel as the Los Angeles Dodgers rallied past the visiting Philadelphia Phillies for a 10-6 walk-off victory Wednesday afternoon. Muncy's 12th home run of the season reached the seats down the right-field line after Chris Taylor singled to lead off the ninth inning, Freddie Freeman was walked intentionally and Will Smith walked to load the bases.",
        "Motor racing-Lots of sporting buzz in Miami but can F1 deliver?With Formula One drivers facing off at the Miami Grand Prix, the Florida Panthers making a surprising Stanley Cup playoff run and Miami Heat facing the New York Knicks in the NBA - there is no shortage of sporting buzz this week in South Florida. But sport fans may have to look to the Panthers and Heat for some genuine excitement, warned Aston Martin's double world champion Fernando Alonso, with the Miami Grand Prix shaping up as another Red Bull victory parade.NFL investigated by two US states over sex bias, harassment claimsState attorney generals in New York and California on Thursday launched a joint investigation into allegations that female employees of the National Football League (NFL) have been subjected to sex discrimination and harassment. California Attorney General Rob Bonta and New York Attorney General Letitia James, both Democrats, said the investigation will examine the NFL's workplace culture and claims made in several pending lawsuits that the league violated federal and state laws banning sex discrimination, including equal pay laws.Analysis-Soccer-Napoli revive memories of Maradona with Serie A title winNapoli clinched the Serie A title on Thursday with five games to spare as they ended a 33-year drought stretching back to when Diego Maradona led them to the Scudetto in 1990. At the start of the season it would have been difficult to envisage Napoli becoming champions ahead of heavyweights such as Juventus and the two Milan clubs not to mention AS Roma."
    ]
}