{
    "articleURL": "/wires/pa/article-12051057/King-greets-wishers-Mall-eve-coronation.html",
    "content": [
        "The King and the Prince and Princess of Wales have greeted well-wishers on the Mall on the eve of the coronation.",
        "Charles, William and Kate made the surprise appearance to the delight of huge crowds gathered outside Buckingham Palace.",
        "The trio took time to shake hands with members of the public as people cheered, took selfies and sang God Save the King.Charles went to one side of the Mall while William and Kate went to another.",
        "One woman told Charles “Love you Charlie” while others passed on their congratulations.At one point, Kate appeared to join a fan in a video call before also speaking on another fan’s phone then handing it back.Alison Cowburn was among those to shake the King’s hand.The 62-year-old, who had travelled to London from Derby, told the PA news agency: “I said it was very nice to meet him and he said ‘have you been camping?’“I said no we are just down for the day and he said ‘nothing so rash as that then’.”On how she felt after the encounter, she said: “Brilliant, so delighted. Absolutely ecstatic.”The King laughed when asked by a man if he was “nervous for tomorrow” and was was heard joking to some children, “No school? You’ve done very well!”",
        "William told one woman “I love your hair bow”, while Kate told another person that the occasion “is a great moment for celebration”.",
        "Earlier, the King took part a final coronation rehearsal at Westminster Abbey, where a 2,300-strong coronation congregation, and a television audience likely to be in the tens of millions, will watch him being crowned on Saturday.The King has a busy day with a series of diplomatic duties and has been joined by working royals at a special lunch for realm prime ministers and governors general at Buckingham Palace.Charles, who is head of the Commonwealth, will also attend a Commonwealth Heads of Government leaders’ meeting and garden reception at London’s Marlborough House the same day.Also on the eve of the coronation, the King and the royal family will host a glittering reception for foreign royalty and other overseas dignitaries at the Palace.The final preparations come as broadcaster Jonathan Dimbleby, a friend of Charles who wrote his authorised biography, said the monarch would find the Homage of the People “abhorrent”.For the first time, those watching the coronation ceremony will be invited to make their own homage to Charles, replacing the traditional homage of peers, but some commentators have criticised the new element as divisive.",
        "Mr Dimbleby told BBC Radio 4’s Today programme: “I can think of nothing that he would find more abhorrent.“He’s never wanted to be revered, he’s never wanted – so as far as I know – to have anyone pay homage to him except in mock terms as a joke.",
        "“He wants, I think, to feel that people will share in the event and I don’t quite know how this might have happened.”Meanwhile, those travelling across the UK on public transport are being reminded to “mind the gap” by the King.Charles and Camilla have recorded an announcement which is being played between Friday and Monday at every railway station across the UK and all London Underground stations, industry body the Rail Delivery Group said.In the message, the King begins by telling passengers: “My wife and I wish you and your families a wonderful coronation weekend.”Camilla then says: “Wherever you are travelling, we hope you have a safe and pleasant journey.”The message concludes with Charles adding: “And remember, please mind the gap.”It was recorded at Highgrove earlier this year by the audio team from Transport for London."
    ]
}