{
    "articleURL": "/wires/ap/article-12056107/Israel-releases-lawmaker-said-smuggled-guns.html",
    "content": [
        "TEL AVIV, Israel (AP) - Israeli authorities released a Jordanian lawmaker to his home country on Sunday, Israel's domestic security agency said, after he allegedly tried smuggling dozens of rifles and handguns through an Israeli-controlled border crossing.",
        "Legislator Imad Al-Adwan's arrest threatened to further strain ties between Israel and neighboring Jordan, which have had tense relations recently despite a nearly three-decade-old peace treaty. Israel viewed the incident as serious, but Al-Adwan´s release signaled it was hoping to put the potentially combustible affair behind it.Al-Adwan was arrested on Apr. 22 with bags full of more than 200 guns, the Shin Bet agency said in a statement. It said its investigation revealed that Al-Adwan carried out 12 separate smuggling attempts since early 2022, using his diplomatic passport to bring in anything from electronic cigarettes to gold to birds.The Shin Bet said that since the start of the year, he made numerous successful attempts to smuggle in arms. The smuggling was done in exchange for unspecified amounts of money, the Shin Bet said. The agency said he was released for \"further investigation and pursuit of justice\" by Jordanian authorities.Jordan's Foreign Ministry, as well as a brother of Al-Adwan, could not immediately be reached for comment. Jordanian state media reported that authorities were taking steps to bring Al-Adwan to trial based on evidence made available to them. Those steps included lifting his parliamentary immunity and referring his case to judicial officials.The West Bank has seen a surge in violence over the past year. Israel says the area has been flooded with illegal weapons, including guns smuggled from neighboring Jordan.",
        "Since Israel´s hard-line government took office late last year, relations with Jordan have deteriorated over Israeli settlement construction, violence in the West Bank and policies over holy sites in Jerusalem´s Old City.The ties were at a nadir in 2017, when a security guard at the Israeli embassy in Jordan shot and killed two Jordanians, alleging one attacked him with a screw driver. The Israeli guard and Israel´s then-ambassador were given a hero´s welcome by Israeli Prime Minister Benjamin Netanyahu, infuriating Jordan.Jordan controlled the West Bank and east Jerusalem before Israel captured the areas in the 1967 Mideast war, but the kingdom retains custodianship of the Al-Aqsa Mosque and other Muslim holy sites in the Old City.___Associated Press writer Omar Akour contributed to this report from Amman, Jordan."
    ]
}