{
    "articleURL": "/money/experts/article-12054063/TONY-HETHERINGTON-Dont-pay-car-crooks-court.html",
    "content": [
        "Tony Hetherington is Financial Mail on Sunday's ace investigator, fighting readers corners, revealing the truth that lies behind closed doors and winning victories for those who have been left out-of-pocket. Find out how to contact him below. ",
        "S.W. writes: After reading your recent article about Car Rate's valuation scam, I am sending you a copy of an email I received from another scam merchant's website, upvehicle.co.uk. I did not realise any payment was due, and now they are demanding money and adding a fine.Tony Hetherington replies: It is no coincidence that Upvehicle and Car Rate are operating the same scam. This is not some back-bedroom online rip-off. It is an organised international fraud. Car owners are invited to give their vehicle registration number and get a valuation. What they don't see unless they scroll down the website is small print that says they will be charged £99 for this service, which many motoring websites offer for free.The email you have received threatens that if you do not pay, Upvehicle will add penalties and call in debt collectors.My advice: don't pay. Call their bluff. They will never take you to court, because if they do, they will be exposed as crooks. And you can call me as a defence witness.Behind both Car Rate and Upvehicle is just one company, Quotient Int Limited.My enquiries show it was registered in the Republic of Ireland in May last year by a woman who gave her name as Irma Rangkuti and an address in Polegate in East Sussex. The name may be false or a case of impersonation. The address belongs to a company formation agency called I-Support-Business. The company's Nic Carnell told me he does not know Ms Rangkuti, adding: 'All our clients must provide proof of identity before they can use our address.",
        "'Our address is being used without our approval.'Upvehicle's website gives an address above a shop in Lucan, on the outskirts of Dublin, but there is no trace of the business there. Much of the address is occupied by a tattoo parlour called Guns N' Tattoos which has no connection to Upvehicle or its owner Quotient Int.Quotient has also used two addresses in London, but is not at either of them.I have passed The Mail on Sunday's evidence on to the Corporate Enforcement Authority, the Irish government agency which investigates false details provided by anyone setting up or running a company in the Republic.Meanwhile, car owners in Finland have also been ripped off by yet another website. Consumer protection officials in Helsinki say: 'This service, Autoarviointi.fi, is operated by a company called Quotient Int Ltd, which states that it is located in Ireland. Its invoicing details, on the other hand, are in Belgium.'More evidence of international organised crime. So where is Quotient really based? Following the money provides clues pointing towards Lithuania.But wherever the crooks are, nobody should pay them a penny, let alone £99.Unisys pension stallsA.P. writes: I have a pension with Unisys of £119 a month. This is a multi-million pound company which last year announced a profit increase of 77 per cent, but it has refused me even a cost-of-living pension rise for the past ten years. My wife has a pension with Unisys as well, but she gets increases. ",
        "They have given no reason for failing to pay an increase.",
        "Tony Hetherington replies: Unisys is an American-owned multinational technology giant, with about 16,000 employees and annual revenue of almost £2billion. Your pension is administered by a UK company, Mercer, which issued an unhelpful seven-page document aimed at professional financial advisers. This was still better than the response from Unisys itself. It simply refused to comment. When your wife worked for Unisys, the rules were different.According to Mercer, the rules of the pension scheme at the time you worked for Unisys were that increases were only applied at the discretion of the pension fund trustees. And every year for the past decade, Mercer says, the Unisys trustees have decided not to exercise that discretion in favour of you or any other retired employee whose pension falls under the same rules. Current employees might like to check the small print in their own Unisys pension cover.",
        "Two months ago I reported how a reader – Mr M – had been electrocuted while carrying out a simple DIY task in his home, even though he had turned off the power. He later found Scottish Power had sent a contractor to install a smart meter for a neighbour in his block of flats. The contractor had wrongly connected the meter to Mr M's supply, leaving it in 'hot neutral reversed', which meant the supply was live even when switched off.Mr M was lucky to survive. But his flat was without power and he lost two days of work. He even had to pay to have the electricity reconnected. He appealed to Ombudsman Services, the private company which is paid by Scottish Power to referee complaints. It described the whole affair as just a 'shortfall in service', and recommended Scottish Power offer a 'goodwill payment' of £100. Mr M was told that if he expected anything more, he would have to sue the contractor, but Ombudsman Services and Scottish Power could not even name the right firm.Well, the right firm is now known to be Lowri Beck. And when I approached it, Lowri Beck told me neither the Ombudsman nor Scottish Power had been in touch about the affair until just before The Mail on Sunday published its report. The firm says it has installed meters safely all over the country. A spokesman told me: 'Lowri Beck has communicated with the customer and addressed the issues, and the customer has been compensated accordingly.' Mr M has accepted £720 and called on Lowri Beck to review the meters it has installed. He told me without the MoS's pressure, 'I would not have had any semblance of a satisfactory outcome.'",
        "If you believe you are the victim of financial wrongdoing, write to Tony Hetherington at Financial Mail, 9 Derry Street, London W8 5HY or email tony.hetherington@mailonsunday.co.uk. Because of the high volume of enquiries, personal replies cannot be given. Please send only copies of original documents, which we regret cannot be returned. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}