{
    "articleURL": "/wires/ap/article-12061363/Prize-winning-AP-team-served-worlds-eyes-Mariupol.html",
    "content": [
        "NEW YORK (AP) - Instincts about the strategic significance of the Ukrainian port city of Mariupol led a team of Associated Press journalists there just as Russians were about to lay siege. It proved to be a fateful decision.",
        "For nearly three weeks last year, Mstyslav Chernov, Evgeniy Maloletka and Vasilisa Stepanenko were the only journalists in Mariupol, serving as the world's eyes and ears amid the horrors of the Russian onslaught.Together they helped expose the extent of the suffering Ukrainians endured, served as a counterweight to Russian disinformation and contributed to the opening of a humanitarian corridor out of Mariupol. They also had to elude capture by Kremlin forces that were hunting for the team.On Monday, Pulitzer Prize judges cited the work of the three Ukrainian journalists, along with Paris-based Lori Hinnant, in giving The Associated Press the prestigious award for public service.Seven AP photographers, including Maloletka, also won a breaking news Pulitzer for their coverage of the war, including in Mariupol. The AP was also a finalist for a third award for work in Ukraine, this time for photography focused on the war's impact on the elderly.\"This is how the AP should work,\" Chernov said Monday from Ukraine during a staff celebration of the prizes. \"This is how we function. All of these people supporting one another and in the end producing work that is supposed to change the world for the better or at least not make it worse.\"",
        "While the awards are meaningful, it's important to recognize all the suffering and loss at the heart of what the journalists chronicled, said Julie Pace, AP's senior vice president and executive editor.",
        "The reporting, particularly heartbreaking images of civilian bomb victims, had a clear impact. Mariupol officials later credited their work with pressuring Russians to allow an evacuation route, saving thousands of civilian lives.Their resourceful work, called \"courageous\" by the Pulitzer committee, included sneaking out a tiny file of images taken by a Ukrainian medic that was hidden in a tampon.At one point during the siege, as the noose tightened on them, Chernov and his colleagues were reporting from a hospital treating war wounded. They were given scrubs to wear as camouflage. A group of soldiers burst in and profanely demanded to know where the reporters were.They wore blue armbands that indicated they were Ukrainian. But were they actually Russians in disguise?Chernov took a chance, stepped forward and identified himself.The soldiers were indeed Ukrainian. They loaded the journalists in a car, and they escaped the city, passing through 15 Russian checkpoints.It's not an overstatement to say the work was a true public service - telling the world of the war's human toll, dispelling Russian disinformation as well as opening the humanitarian corridor, Pace said.\"It was ambitious from the very beginning because it had to be, because the stakes were so high for us, for AP, for the team in Mariupol and for the people of the city,\" Hinnant said Monday on a staff Zoom call. \"We thought then that lives would depend on it, and that turned out to be true.\"",
        "The AP team that won the prize for breaking news photography in Ukraine included Maloletka, his second Pulitzer of the day. Other winners were Bernat Armangue, Emilio Morenatti, Felipe Dana, Nariman El-Mofty, Rodrigo Abd and Vadim Ghirda.Eight photographers - Maloletka, Armangue, Morenatti, El-Mofty, Girda, David Goldman, Natacha Pisarenko and Petros Giannakouris - were Pulitzer finalists in feature photography for their package on the elderly in Ukraine. Two journalists, Eranga Jayawardena and Rafiq Maqbool, were finalists in breaking news photography for their work covering protests over the economic collapse in Sri Lanka.\"To be there is probably more important and more critical than ever,\" said J. David Ake, AP´s director of photography. \"You can´t make the moment that captures the world if you´re not there, and being there is often dirty and difficult and dangerous.\""
    ]
}