{
    "articleURL": "/wires/reuters/article-12050625/Italian-bank-Intesa-raises-profit-target-beating-forecasts.html",
    "content": [
        "Higher rates to continue driving profit",
        "Not opposed to windfall tax if one-off, helps the poorOn track to \"comfortably\" beat 2025 profit goal(Adds comments from CEO, analysts)By Valentina ZaMILAN, May 5 (Reuters) - Intesa Sanpaolo, Italy's biggest bank, raised its 2023 profit goal on Friday after first-quarter net income nearly doubled thanks to higher interest rates and shrinking loan loss provisions.The lender forecast 7 billion euros ($7.7 billion) in net profit this year, having said in February that it would top last year's result of 5.5 billion euros.\"Looking ahead to 2025, the final year of our business plan, we expect to comfortably exceed our 6.5 billion net income target,\" CEO Carlo Messina told analysts.The upgrade comes after fellow heavyweight UniCredit raised its 2023 profit target this week by more than a fifth.Earnings from lenders across Europe have highlighted ongoing momentum in a sector where investor confidence has been hurt by failures across the Atlantic and the rescue of Credit Suisse.Intesa reported first-quarter net income of 1.96 billion euros, far above a 1.54 billion euro consensus in analyst forecasts compiled by Reuters.Total revenue topped expectations at 6.06 billion euros, up 7% from the previous quarter. Higher interest rates lifted lending income by 66% year on year, helping to offset a 6.6% drop in net fees and commission.",
        "With its business geared towards asset management, as well as insurance, Intesa is more exposed than rival UniCredit to recent market turmoil affecting investment inflows and performance.However, it said the boost from higher rates would continue to drive profit higher and forecast more than 13 billion euros in net interest income this year, raising its guidance.\"Better net interest income is here to stay,\" Santander CIB analysts said.The surge in banks' profits at a time when higher rates are squeezing households' budgets has prompted Italy to consider a windfall tax on lenders, following in Spain's footsteps.Messina said Intesa would support such a measure, provided it was a one-off and aimed at helping people in need.The bank confirmed its 70% payout ratio.Core capital edged up in the quarter to 13.7% of risk-weighted assets (RWAs) after Intesa at the end of last year moved to sharply cut its RWAs to offset the negative impact on capital from revised internal risk models.($1 = 0.9069 euros) (Reporting by Valentina Za Editing by David Goodman, Kirsten Donovan)"
    ]
}