{
    "articleURL": "/tvshowbiz/article-12040905/Emily-Ratajkowski-puts-sultry-display-plunging-minidress-adorned-purple-sequins.html",
    "content": [
        "Emily Ratajkowski looked stunning in a series of photos shared to Instagram on Tuesday.",
        "In the snaps, the 31-year-old model showed off her enviable curves in a daring, plunging minidress decorated with purple sequins — one of her many outfit changes from her Met Gala night.The day before, the My Body author attended the exclusive affair hosted at the Metropolitan Museum of Art in New York City and hit up extravagant after parties following the event.The High Low with EmRata podcast host rocked the same hairstyle that she sported on the red carpet — blunt, straight bangs and voluminous ringlets that were pinned back.In the caption, the former actress used a clever play on the French phrase for 'after party' and wrote: 'Apres Met'.",
        "After making her red carpet appearance in a plunging semi-sheer taupe gown, she did a quick outfit change out of a sheer, black corset dress. In her photos, she documented her third outfit of the night and was seen posing in an elevator. She also modeled while leaning against a wall and showed off various angles of the sexy ensemble. The snaps showed Ratajkowski putting on a sultry display in a halter-style dress with a flared micro skirt. The Gone Girl alum paired the daring outfit with a white, sparkling mini purse and black, pointed-toe stiletto heels.For jewelry, she accessorized with a few dainty bracelets, diamond stud earrings, and silver rings. ",
        "She looked glamorous in a dramatic cut-crease, smokey eyeshadow look paired with a nude lip. The iCarly vet appeared radiant and subtly flushed with a warm wash of coral blush across her cheeks. For her Met Gala red carpet appearance, she donned a semi-sheer taupe gown made out of tulle and delicate black ribbon details. The tight-fitting gown featured a plunging neckline and a dramatic, floor-sweeping train as part of the sheer skirt.",
        "She carried a hard, rose gold clutch and sported a dazzling pair of dangling earrings with teardrop-shaped diamonds. The mother-of-one was also photographed heading to the star-studded after party at Zero Bond sometime during the night in a figure-hugging, entirely sheer midi dress.She paired the show-stopping garment with sheer opera gloves and a clutch adorned with black feathers.Ratajkowski further accessorized the outfit by covering herself with a lavish amount of pearls and silver jewelry — including a belt that read 'EMRATA'. To finish off the cheeky look, she donned a pair of black heels with thin straps."
    ]
}