{
    "articleURL": "/wires/afp/article-12040259/Young-Palestinians-Lebanon-dream-future-abroad.html",
    "content": [
        "In Lebanon's impoverished Palestinian refugee camps, young people say they dream of leaving a struggling country where their families took refuge generations ago and where their futures remain bleak.",
        "Nirmeen Hazineh is a descendant of survivors of what Palestinians call the Nakba -- the \"catastrophe\" -- when more than 760,000 Palestinians fled or were forced from their homes by the 1948 war over Israel's creation.She proudly considers herself from Jaffa -- now south of Tel Aviv -- and talks as if she has lived there all her life, instead of in the ramshackle Shatila refugee camp south of Beirut.\"Emigration has become the main solution for young people,\" said Hazineh, 25.\"Whoever you speak to, they'll tell you 'I want to leave', whether legally or illegally, it doesn't matter.\"Lebanon has been grappling with a devastating economic crisis since late 2019.Most of the population is now in poverty, according to the United Nations, and many Lebanese have quit the country for better prospects abroad.",
        "Hazineh is a sociology graduate but is not allowed to practise in her field, as Lebanon bars Palestinians from working in 39 professions, including as doctors, lawyers and engineers.Instead she helps to raise awareness of the dangers of drugs, which add to the daily misery of Shatila.\"There is a kind of despair among young people in the camp,\" said Hazineh, who despite the difficulties maintains a radiant smile.She said she wanted to live \"in a country that respects me, that gives me a chance, a job\".",
        "- Camp horrors -Tiny Lebanon hosts an estimated 250,000 Palestinian refugees, according to UNRWA, the UN agency for Palestinian refugees, while almost double that number are registered for the organisation's services.",
        "Most Palestinians, including more than 30,000 who fled the war in neighbouring Syria after 2011, live in one of Lebanon's 12 official camps, now bustling but impoverished urban districts.Shatila is a warren of tumbledown homes where tangled electricity cables criss-cross tight alleyways.Once a stronghold of Yasser Arafat's Palestine Liberation Organisation, Shatila became synonymous with horror in September 1982, when Christian militiamen allied with Israel massacred between 800 and 2,000 Palestinians there and in the adjoining Sabra camp.The PLO moved to Tunis that year, and later in the 1980s, pro-Syrian militias waged war on the Palestinian leader's remaining supporters in the camps.Portraits of Arafat still line the streets, along with Palestinian flags and posters of militants killed in violence in the Israeli-occupied West Bank.Walid Othman, 33, says he spends his spare time in political activism with the Popular Front for the Liberation of Palestine, which is banned in Israel.",
        "His grandparents fled the village of Nahf, in the Acre region, 75 years ago. His parents were then driven from Lebanon's Tal al-Zaatar refugee camp, which Christian militiamen razed early in the country's 1975-1990 civil war.",
        "Othman said he would have liked to study political science and dedicate his life to \"defending the Palestinian cause on an international level\".But he had to stop his studies because of \"the difficult economic situation\" and instead became a blacksmith.- 'No prospects' -In Lebanon, Palestinians' \"denied right to own property... further complicates employment and income generation activities\", said Dorothee Klaus, director of UNRWA affairs for Lebanon.",
        "Lebanon says restrictions on Palestinians are justified by their right to return to their country.In neighbouring Syria, some 400,000 Palestinians are registered with UNRWA, where they have access to the job market.In Jordan, more than half of the around 10 million population is of Palestinian origin, while some 2.3 million Palestinians are registered with UNRWA but have the same rights as Jordanians.\"With no prospect of meaningful future\", Palestinian refugees in Lebanon have \"attempted to migrate whenever possible\", Klaus said.But their travel documents \"may not be recognised\", and they may be \"required to file visas related to stateless persons\", she added.Mohammad Abdel Hafiz, whose family also hails from near Acre, lamented that Palestinians in Lebanon \"don't even enjoy the most basic rights\".",
        "\"Everybody is born in a country, while we are born where our heart is,\" said the 29-year-old, who volunteers for the Palestinian civil defence in Shatila.",
        "As he zips through its alleys on his moped, he dreams of leaving, but his chances of getting a visa to a Western country are slim.And he is haunted by the memory of three young camp residents who drowned when a boat carrying would-be migrants sank off the Lebanese coast last year.\"They died because they wanted to have a future,\" Abdel Hafiz said.\"Here, our aim is just to survive.\""
    ]
}