{
    "articleURL": "/wires/reuters/article-12040795/Copper-metals-dip-Fed-policy-action-awaited.html",
    "content": [
        "May 3 (Reuters) - Copper dipped during Asian trading on Wednesday, as investors awaited the U.S. Federal Reserve's decision on interest rates due later in the day and what policymakers might signal on future actions amid looming recession risks.",
        "Three-month copper on the London Metal Exchange (LME) was down 0.3% at $8,487 a tonne, as of 0611 GMT. It touched a one-week high of $8,770.15 on Tuesday.Most other base metals were also down.LME zinc dropped 0.7% to $2,591 a tonne, aluminium lost 0.6% to $2,352.50, nickel fell 0.4% to $24,855, lead shed 0.8% to $2,155.50, while tin gained 0.2% to $26,535.Trading volume, however, remained thin with the Shanghai Futures Exchange shut for a national holiday. The Chinese bourse will resume trading on Thursday.Data on Tuesday showed U.S. job openings fell for a third straight month in March and layoffs increased to the highest level in more than two years, suggesting some softening in the labour market that could aid the Fed's fight against inflation.The Fed's rate decision will be announced at 1800 GMT, with investors mostly expecting a 25 basis point hike and looking for clues on its next steps.\"With risks around growth and the labour market growing, term interest rates and the U.S. dollar are expected to weaken over coming months,\" Westpac analysts said in a note.\"By year-end, it is our expectation that the U.S. will be in recession and inflation will no longer be the pre-eminent concern. Therefore, the first cut is now expected in December, with a further 200 bps of easing to follow in 2024.\"",
        "Worries about a patchy post-COVID economic recovery in top metals consumer China, and U.S. debt ceiling and banking sector risks also weighed on markets.For the top stories in metals and other news, click or (Reporting by Enrico Dela Cruz in Manila; editing by Uttaresh Venkateshwaran and Sohini Goswami)"
    ]
}