{
    "articleURL": "/wires/reuters/article-12041547/Red-Sox-aim-maintain-winning-form-vs-Jays.html",
    "content": [
        "The Red Sox had a season series to forget against the Blue Jays in 2022, but Boston came out swinging in back-to-back games vs. visiting Toronto to begin the week.",
        "After losing 16 of the 19 games between the teams last season, Boston has banged out double-digit hits twice and shown resolve to pick up a pair of one-run wins.Boston will chase a fifth straight win and aim to clinch the four-game series when the American League East foes meet on Wednesday.\"Last year, they had our number,\" Red Sox outfielder Alex Verdugo said. \"It's one of those things, man, we want to play competitive games against these guys. Last year there were a lot of blowouts, a lot of uncompetitive games.\"Verdugo hit a walk-off home run on Monday in a 6-5 Boston win, and catcher Connor Wong was the hero on Tuesday. His 4-for-4 effort included two long balls, the second of which came in the eighth inning to decide a 7-6 ballgame.The Red Sox, who have come from behind in 12 of their 17 wins, tied a season high with four home runs on Tuesday. Christian Arroyo and Masataka Yoshida also went deep.The contributions of Wong and others have brought a new dynamic to the lineup.\"He's been (hitting like) the best catcher in the league,\" Red Sox manager Alex Cora said. \"Defensively, obviously, he's doing what he's doing. It's cool to see all these kids coming in here and getting a chance to play and contributing to this.\"",
        "Nick Pivetta (1-2, 5.11 ERA) will get the start for Boston on Wednesday. The right-hander has pitched at least five innings and recorded at least five strikeouts in four of his first five starts.Pivetta is looking to bounce back from a Friday loss to the Cleveland Guardians in which he allowed four runs on five hits but struck out five in five innings. His lone win came a week earlier in Milwaukee.\"I feel like I've been competitive, making small increases as I go forward, staying healthy, which I'm happy about,\" Pivetta said. \"I feel like I'm close to ... taking a step in the right direction.\"Pivetta is 1-4 with a 5.83 ERA in 11 career starts against Toronto.The Blue Jays have scored at least five runs in seven of their past nine games, but they have allowed six or more in three straight, all losses.A six-run fifth inning, including a three-run homer by Daulton Varsho, was not enough for Toronto on Tuesday.Bo Bichette, who was 7-for-11 with two homers and six RBIs in his previous two games, went 0-for-2 with two walks and a run on Tuesday.\"Competing is when he's taking his skill set along with a really good approach to what the pitchers are doing to him,\" Blue Jays manager John Schneider said.",
        "Bichette leads the major leagues with 43 hits.Alek Manoah (1-1, 4.88), Toronto's scheduled Wednesday starter, has not been victorious since April 5 in Kansas City, though he allowed just two runs total over his past two starts. He struck out seven in five innings of two-run ball during a no-decision against the Seattle Mariners on Friday.Manoah has been outstanding in six career starts against the Red Sox, going 4-0 with a 1.46 ERA and 33 strikeouts over 37 innings.\"I pitch with passion and I love competing,\" Manoah said prior to the series. \"When you are a competitor like that, a lot of teams like to come at you with their best. They lock it in that day or they're extra aggressive that day. They play harder, and that's what I love.\"Three of Manoah's four victories over Boston came last season, including a Sept. 30 start in which he allowed just two hits in six shutout innings.--Field Level Media"
    ]
}