{
    "articleURL": "/tvshowbiz/article-12048991/Kyle-Sandilands-wedding-guest-hints-real-reason-Albo-didnt-DJ-radio-stars-reception.html",
    "content": [
        "Kyle Sandilands has revealed why Prime Minister Anthony Albanese didn't DJ at his wedding, despite the leader's promise.",
        "The KIIS FM radio host, 51, explained on The Kyle and Jackie O Show on Friday morning that he'd previously asked Mr Albanese to spin the decks at the wedding reception, but later told him not to worry and instead attend solely as a guest.Fellow wedding guest Beau Ryan recalled how he managed to have a 'long chat' with Albo and suggested the PM clearly enjoyed himself at the event.The ex-NRL player joked the veteran politician, 60, was a 'bit pissy'.'He has a few early, right? He has a couple of beers early,' Beau explained.",
        "'He was enjoying himself, which was good. Like, he wasn't carrying on. But he was in the zone. He was good.'While chatting with French DJ David Guetta, Sandilands said he should have gotten the Baby Don't Hurt Me mixer to take care of the music on the night.'I asked our prime minister to DJ and he showed up to the wedding... our prime minister showed up to the wedding. I said to him, \"don't worry about DJing. Leave it to the wedding DJ,\"' Sandilands explained.'But you would have been great,' he later said to Guetta, who congratulated the newlywed.",
        "Daily Mail Australia has contacted Prime Minister Anthony Albanese for comment. Sandilands tied the knot with his wife Tegan Kynaston last weekend in a $1million ceremony at the heritage-listed Swifts mansion in Sydney's Darling Point.",
        "The morning of his wedding, the radio shock jock fired back at critics who said the PM should not attend after it was rumoured he'd be DJ'ing.'These are my friends,' he told Daily Mail Australia.",
        "'I've met plenty of people over my life that have promised this and that, then been complete charlatans.'He added: 'These guys are true men of their word and that's why they're my lifelong friends.'During a press conference last Friday, Mr Albanese confirmed he would be attending Sandilands' nuptials to Kynaston on Saturday, noting he wasn't in charge of the invite list, and went on to describe Sandilands as an Australian success story.'A bloke who at one stage was homeless living on the streets of Sydney and has grown into someone who is a significant public figure is part of what is an Australian success story,' he said.",
        "Mr Albanese has publicly committed to DJing at the reception - declaring on Sandilands' radio show last year: 'That's on!... I keep my promises.'Deputy Opposition leader Sussan Ley criticised Mr Albanese's priorities in a statement, saying: 'There is nothing wrong with going to a friend's wedding, but it is curious the prime minister thinks he can take a day off just days before his first real Budget.",
        "'Australians will rightly ask whether the Prime Minister should be spinning decks at a million dollar wedding when people can't afford their rent.' Aussie celebrities in attendance at the wedding included NSW Premier Chris Minns, Today host Karl Stefanovic, and 'King of the Cross' John Ibrahim, among others."
    ]
}