{
    "articleURL": "/tvshowbiz/article-12055383/Avril-Lavigne-commands-attention-stage-performs-sold-concert-Manchester-Apollo.html",
    "content": [
        "Avril Lavigne cut an edgy figure as she commanded attention on stage on Saturday at her sold-out gig at the Manchester Apollo after postponing her UK tour.",
        "The singer, 38, took to the stage for an energetic performance after she pushed back her UK and European tour from 2020 to this year due to the coronavirus pandemic.But the Sk8er Boi hit-maker was back and better than ever as she took to the stage on Saturday evening to perform her best hits in front of a sold-out crowd.The singer appeared to be in high spirits and happy to be back as she put on an energetic performance on a dimly lit stage.She showed off her edgy sense of style in a black cropped hoody with worded graphic prints on the front and a black mini skirt that featured red tassel belts.",
        "To complement the edgy look even more, the pop star also donned a pair of ripped black tights for a dramatic effect.She also opted for wearing a pair of army-style black boots and donned a dramatic smokey eye make-up look.To finish off the striking ensemble, the beauty also styled her bleached blonde locks in a short but straight bob.Avril, who was in her element during the entire performance, danced across the stage and belted out her best-known hits as she sang along with the large audience.Her return to stage comes after Avril was last spotted wearing a jaw-dropping $80,000 diamond chain gifted to her by her rapper boyfriend Tyga.",
        "As she arrived at Manchester Apollo, she was spotted wearing the statement pendant bearing her name by jeweller Eric Mavani.The huge necklace featured a whopping 50 carats of white diamonds, black diamonds and pink sapphires.As well as her name it also featured the letter 'A', skulls and an engraving that said: 'Made for Avril Lavigne' on a tag at the back.",
        "Avril was spotted wearing the chain before her sold-out concert while ensuring to show off her edgy sense of style earlier on as she arrived at the venue in Manchester.The beauty donned a pair of a pair of chunky £1,230 VETEMENTS x New Rock platform boots which she teamed with some £165 sheer black tights by the brand.The hitmaker also donned a black T-shirt dress with an orange logo on the front and her name on the arm in the same colour.And to finish off the look, she wore lashings of make-up, opting for her signature look of some heavy black eyeliner.Avril confirmed in March she had moved on with rapper Tyga, after her split from fiancé Mod Sun.Avril and Mod Sun got engaged during a March 2022 trip to Paris.",
        "Despite the reported issues in their relationship, a representative for Mod Sun described the split as if it came out of the blue, and claimed Avril ended things while he was away after starting his current tour.",
        "'They were together and engaged as of three days ago when he left for tour so if anything has changed that's news to him,' they claimed at the time.Avril was seen on a friendly night out with the rapper Tyga just as the news broke, though they were reported to have been pals for some time.Avril and Tyga then appeared to confirm their romance days later as they shared a kiss at the Mugler x Hunter Schafer Party during Paris Fashion Week.The pair locked lips and cosied up to one another, as he put his arms around her.",
        "The couple looked more loved-up than ever as they posed for photographs together.It came after she arrived at an event days earlier in a blacked-out people carrier and made no attempt of hiding her closeness with Tyga as they climbed out within seconds of each other.Tyga and Avril were surrounded by security as they made their way into the building together, with a video showing their team attempting to stop them from being filmed.It comes before Avril was preparing to perform in Manchester this weekend after pushing back her UK and European tour due to the coronavirus pandemic.The Bite Me star was originally set to play the shows in 2020 and postponed the run to 2021, before moving them again to 2022 due to the COVID-19 pandemic.",
        "Unfortunately for fans, they had a long wait on their hands, as the pop-punk icon has been forced to reschedule the concerts for the third time due to 'travel and venue restrictions from country to country' making it 'impossible' to go ahead as planned.",
        "In a lengthy statement, the Nobody's Home singer wrote: 'To my fans in Europe and the U.K., I have some unfortunate news to share with you all about my U.K. and European dates.'I have to make the difficult decision to postpone this tour until 2023.'Due to the ongoing issues surrounding the pandemic, there are a series of travel and venue restrictions from country to country that have made the tour not possible to happen.'Avril concluded: 'It's not an easy decision, but it's one that will help ensure that we are able to play every single date of the tour, put on the best show possible at full capacity, and operate in a safe environment.'It really breaks my heart to have to do this, but I know it will be worth the wait.'"
    ]
}