{
    "articleURL": "/health/article-12038413/Want-better-nights-sleep-Try-leaving-window-OPEN.html",
    "content": [
        "Fresh air, which better ventilates the room, helps with a good night's sleepResearchers recruited people willing to have their sleep tracked over two weeksOpening a bedroom window at night could lead to better sleep and thinking skills.",
        "Fresh air, which better ventilates the room, helps with a good night's sleep, a study of 40 people suggests.This may explain why people who slept with the window open did better in a test of their mental abilities the next day.Researchers recruited people willing to have their sleep tracked over two weeks.In the first week, they slept normally, and in the second week they were asked to open the window and bedroom door if they normally had them closed, or close them if they were normally open.",
        "When people slept with the window open, they slept significantly longer, wrist-worn sleep trackers showed.They made significantly fewer errors in a three-minute test of their reasoning skills which asked about the relationship between various objects.Dr Pawel Wargocki, senior author of the study from the Technical University of Denmark, said: 'The air quality in the bedroom can affect your cognitive abilities, such as your ability to concentrate, to understand, and to react.'Sleeping in a well-ventilated bedroom benefits your cognitive abilities.'The study, published in the journal Building and Environment, produced results from 29 bedrooms where people opened or closed their doors or windows from one week to the next, and where the indoor air quality significantly changed as a result.",
        "When people slept with their bedroom window open, they reported being less sleepy in the morning and evening.With the window open, 87 per cent of people reported having slept deeply, compared to 70 per cent when the window was closed.For those who don't want a stuffy bedroom, but worry about security, noise or chilliness with the window open, Dr Wargocki said: 'We're studying whether other technologies such as air purifiers can ensure just as clean air in the bedroom as mechanical ventilation or an open window.'The study, conducted between September and December 2020, suggests that simply opening the bedroom door may not improve air quality enough to boost sleep.No effect on sleep duration was seen when people kept their bedroom door ajar.A much larger study is needed to confirm the results of the new research but the results follow a previous small study involving members of the same research team which suggested that opening a bedroom window reduces snoring.",
        "One in three adults in the UK and almost half of US adults suffer with insomnia, with millions more reporting sleepless nights.Long-term sleep deprivation can cause obesity, diabetes and cardiovascular disease. Insomnia can be caused by stress, anxiety, alcohol, caffeine or nicotine, noise, shift work and jet lag. If you regularly have problems sleeping, there are simple ways to improve your sleep hygiene.  Keep regular sleep hours Try going to bed when you feel tired and getting up at the same time each day. Create a restful space Dark, quiet and cool environments generally make it easier to fall asleep and stay asleep. Get movingExercise is good for your physical health and your mind.  It can also help you sleep better. Just don't do vigorous exercise too close to your bedtime.  Don't force it If you find yourself unable to get to sleep, get up and do something relaxing for a bit. Then get back into bed when you feel a bit sleepier. Write down your worriesIf you find your worries keep you up at night, try writing them down before going to bed. Ease off the caffeineAlcohol and caffeine can stop you from falling asleep and having a deep sleep. Cutting down on caffeine close to bedtime and alcoholic drinks could help you dose off. Source NHS "
    ]
}