{
    "articleURL": "/wires/ap/article-12061283/2-set-trial-shooting-FedEx-driver-Mississippi.html",
    "content": [
        "BROOKHAVEN, Miss. (AP) - An August trial has been set for two white men in Mississippi who are accused of chasing and shooting at a Black FedEx driver who had dropped off a package at a home.",
        "Brandon Case and his father, Gregory Charles Case, were indicted in November on charges of attempted first-degree murder, conspiracy and shooting into the vehicle of D´Monterrio Gibson in January 2022.On Monday, Lincoln County Circuit Court Judge David Strong set Aug. 8 as the starting date for their trial, the Daily Leader reported.Gibson, who was 24 at the time, was not injured. But the chase and gunfire sparked social media complaints of racism in Brookhaven, about 55 miles (90 kilometers) south of the state capital, Jackson.During a news conference days after the incident, Gibson said he was wearing a FedEx uniform and was driving an unmarked van that FedEx had rented when he dropped off a package at a house. He said as he was leaving, he noticed a white pickup truck pulling away from another house on the same large lot.Gibson said the pickup driver tried to cut him off as he left the driveway. Gibson said he swerved around the driver and then encountered a second man who had a gun pointed at the van and was motioning for him to stop. Gibson said the man fired as he drove away, damaging the van and packages inside. He said the white pickup chased him to Interstate 55 near Brookhaven before ending the pursuit.",
        "Carlos Moore, an attorney representing Gibson in a civil lawsuit in federal court, compared the incident to the killing of Ahmaud Arbery, a 25-year-old Black man who was running empty-handed through a Georgia subdivision in 2020 when three white strangers chased him down and blasted him with a shotgun.The lawsuit that Moore filed on behalf of Gibson in January 2023 is still pending. It is against FedEx, the city of Brookhaven, Brookhaven Police Chief Kenny Collins, Brandon Case and Gregory Charles Case."
    ]
}