{
    "articleURL": "/wires/aap/article-12052053/ALM-finals-glory-line-biggest-Sydney-derby-ever.html",
    "content": [
        "Sydney FC's Luke Brattan midfielder isn't one for grand statements but when asked to describe the elimination final derby against Western Sydney Wanderers he claimed it was \"the biggest game of our lives\".",
        "\"I've played in some pretty big games,\" Brattan said.\"This has got the feeling that it'll be one of the biggest.\"There have been 34 Sydney derbies but remarkably none have been in a finals setting like this Saturday, where come 10pm (AEST) at CommBank Stadium one side's grand final hopes will be over.For both sides the prospect of losing is unpalatable.After enjoying years of dominance while the Wanderers were in the wilderness, Sydney were thumped 4-0 at home in their most recent meeting.Understandably that loss still stings, and after enjoying life as the city's premier club they don't want to give up that tag without a fight.\"They (the Wanderers) are so desperate to do something special, they're in the finals for the first time in a while,\" Brattan said.\"We've been so successful that anything below success is not where we want to be.\"We want to get back to where we want to be, fighting for trophies.\"The Wanderers have enjoyed a renaissance under Marko Rudan, finishing above Sydney for the first time in eight seasons with some shrewd recruitment from their crosstown rivals helping propel them up the table.The signing of Milos Ninkovic headlined Rudan's raids on the club where he is a hall of famer, but midfielder Calem Nieuwenhof and rising rightback Aidan Simmons have both played key roles this year.",
        "But if one player epitomises the way Rudan wants to play it is his centreback and captain Marcelo.There is a wall of the Wanderers training ground that depicts the heroes of their Asian Champions League victory and the Brazilian defender, who turns 36 next month, wants to return the club to its past glory.\"That wall is my goal and I'm sure that all the other players want to be there as well,\" he said.\"Since I came here people have shown me a lot of love and respect.\"The only thing I want to do is give them happiness and bring the name of this squad back to the top, to a high level.\"That's what I told Mr Rudan when we spoke on the phone for the first time and that's what I'm trying to do here every day.\""
    ]
}