{
    "articleURL": "/wires/reuters/article-12047705/New-Fortress-Energy-install-Fast-LNG-units-onshore-Altamira-Mexico.html",
    "content": [
        "May 4 (Reuters) -",
        "U.S. energy company New Fortress Energy Inc said on Thursday it could install the second and third of its Fast LNG (liquefied natural gas) production units onshore at Altamira in Mexico in the second half of 2024.In itsfirst quarter earnings, New Fortress also reiterated that it planned to move its first roughly $1 billion Fast LNG unit to offshore Altamira in June. Unit 1 was on track to start producingfirst LNGin July.New Fortress stock gained over 7% to around $29.84 in midday trade on Thursday.New Fortress said the second and third Fast LNG units were under construction and deployment and installation were expected in the second half of 2024.The company said it signed a non-binding letter of intent with Mexican power company Comisión Federal de Electricidad (CFE) to explore installing Units 2 and 3 onshore at an underutilized LNG import terminal at Altamira.The second and third Fast LNG units would cost about $900 million each with Unit 2 producing first LNG in August 2024 and Unit 3 in September 2024.Each Fast LNG unit can turn about 0.18 billion cubic feet per day of natural gas into 1.4 million tonnes per annum of LNG.New Fortress has said it was developing five Fast LNG units with two expected to go to Altamira, one to the offshore Lakach gas field in Mexico and two to offshore Louisiana.",
        "Regarding Lakach, New Fortress CFO Christopher Guinta told analysts the company was \"working on the engineering and the permitting side.\"With Louisiana, Guinta said \"We're continuing to work with MARAD...and trying to get a permit as an option for (Fast) LNGs in the future.\"He was referring to the U.S. Department of Transportation's Maritime Administration (MARAD), which has already stopped the clock on the Fast LNG application at least twice - in August and November 2022.(Reporting By Scott DiSavino Editing by Marguerita Choy)"
    ]
}