{
    "articleURL": "/wires/aap/article-12056231/Saints-beat-wayward-Kangaroos-dire-AFL-contest.html",
    "content": [
        "North Melbourne have produced a goalless first half for the first time in almost 44 years as St Kilda prevailed by 30 points in the ugliest game of the AFL season to date.",
        "There were few highlights in what Saints coach Ross Lyon described as a \"frustrating\" contest on Sunday despite perfect conditions under the roof at Marvel Stadium.Captain Jack Steele (20 disposals, nine clearances) and ruckman Rowan Marshall (21, five) helped steer the Saints to a 8.16 (64) to 4.10 (34) triumph, with Dan Butler and Jack Higgins kicking two goals apiece.Marshall finished the match on the bench with ice on his left ankle after Jade Gresham had already been substituted out with knee pain, though Lyon said both would be fit to play against Adelaide in round nine.The result reaffirmed the Saints' (6-2) spot in the top four after losses in two of their previous three matches.\"It was a messy game. Both teams will want to get rid of it pretty quick,\" Lyon said.\"I can't speak for the other team but it was frustrating.\"When we had full opportunities we turned them into half.\"We tried to take the game on and play quick but we just ran into errors.\"The Kangaroos, now on a six-match losing streak, set records for the wrong reasons as they kicked 0.7 from 22 forward entries in the first half.It was the first time they had been goalless at the main break since round 12, 1979.",
        "Nick Larkey eventually broke the drought at the three-minute mark of the third quarter and kicked his second four minutes later, cutting the margin to 10 points.But the Saints steadied with three of the next four goals and fought out a scrappy win.Kangaroos coach Alastair Clarkson joked King Charles' coronation would have been a more exciting watch but was pleased his side was more competitive than in recent weeks.\"Everyone would've seen some opportunities that we had, particularly in the first half, when there were three chances that were nearly walk-in sodas and somehow we found a way to miss them,\" Clarkson said.\"The Saints missed some shots too, so in terms of the quality of the game as a spectacle, it wasn't there on both sides.\"But in terms of the contest ... we were in that game of footy.\"Saints young gun Mattaes Phillipou provided a rare highlight when he soared over teammate Brad Crouch and Darcy Tucker for a huge final-quarter mark.Tucker was also on the receiving end of a huge bump from Jack Sinclair.North Melbourne spearhead Larkey finished with three goals, all in the third quarter, and young star Harry Sheezel gathered 30 disposals in another strong display.Kangaroos veteran Ben Cunnington was substituted out for the second time this season, having managed just seven disposals in three quarters."
    ]
}