{
    "articleURL": "/wires/aap/article-12050943/Lions-secure-commanding-win-disappointing-Blues.html",
    "content": [
        "Brisbane coach Chris Fagan has hailed Josh Dunkley's display against Carlton as one of the greatest games he's ever seen as the star recruit propelled the Lions to a 26-point win.",
        "The Lions shut down Carlton's twin towers of Charlie Curnow and Harry McKay at Marvel Stadium on Friday night and move top of the AFL ladder.Dunkley continued his outstanding start since moving to the Queensland club from the Western Bulldogs, picking up an equal game-high 33 touches and limited the influence of Brownlow medallist Patrick Cripps.After matching Brisbane with five goals in an opening-quarter shootout, the Blues then performed dismally by kicking just one major during the next two terms as the Lions set up a commanding 15.10 (100) to 11.8 (74) victory.\"I just want to say it's one of the great games I've ever seen,\" Fagan said of Dunkley.\"If you weigh it all up - he had 33 touches,13 tackles and kept Cripps to a quiet game.\"I would have settled for Cripps having a quiet game, to be honest with you, but Josh's influence on the contest was exceptional and his leadership since he's been at the club has been outstanding.\"Renowned for their attacking flair, the Lions did it at both ends as Curnow and McKay were restricted to just one goal each.After starting the season 1-2, the Lions have won five-straight matches to put their premiership credentials on display and grab top position on the ladder.",
        "However, Collingwood, Melbourne and St Kilda will all overtake the Lions if they win their respective round-eight matches.Superstar small forward Charlie Cameron booted four goals to make it 23 from his last five games, while the dynamic Zac Bailey joined him with a season-best four majors.Coming off a nine-goal outing against lowly West Coast last week, Curnow was kept to just one by unheralded Lions defender Jack Payne.Dual All-Australian fullback Harris Andrews was one of the most influential players on the ground, limiting McKay's output and patrolling the back-half with command.McKay spent some time off the ground in the second quarter after he was bleeding from his right eye following a collision with Andrews.However, the Lions co-captain would have to be seriously unlucky to be cited by the match review officer for the incident as both players had eyes only for the ball.Last week's 108-point thrashing of the Eagles got critics off the Blues' back but fans will be demanding answers after a largely listless effort led to them losing a third match from their last four.As the siren sounded for three-quarter time, a chorus of boos echoed around the stadium as Carlton trailed by 40 points.The Blues won the final quarter but the final score flattered them in a disappointing outing for coach Michael Voss against his former club.",
        "\"The message was that good teams give you feedback and we got some feedback that we're short in a few area,\" he said.\"What I've also acknowledged to the group is that I can't ask for more effort.\"What was inconsistent was execution, it just fluctuated far too much, some costly turnovers that getting scored against.\"This match was the first of a difficult run for Carlton, with the Western Bulldogs, Collingwood, Sydney and Melbourne to follow in the next month.After falling short of the top-eight in heartbreaking fashion last year, the pressure is on the Blues to play finals for the first time since 2013."
    ]
}