{
    "articleURL": "/news/article-12053579/Now-WONT-called-swear-allegiance-King.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout todayWording of the Homage of the People at today's coronation has been changed How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk The words of the Homage of the People at the King's coronation were toned down at the eleventh hour, it emerged today.",
        "The Homage is the promise of allegiance and faithfulness the King receives from all of his peoples upon his enthronement, led first by the Archbishop of Canterbury.For the first time in history, every citizen of the UK and all the other nations of which the monarch is head of state had been asked to 'make their homage in heart and voice to their undoubted King'. It was to make the ceremony more of a 'People's Coronation', as previously only members of the aristocracy were called upon to make such a pledge. But Charles reportedly approved the last-minute change which came after a string of commentators criticised the new addition as divisive.The Archbishop of Canterbury, Justin Welby, will now 'invite' a show of support from the congregation rather than a 'call' to those in the Abbey and elsewhere to swear allegiance to the King.",
        "Broadcaster Jonathan Dimbleby, a friend of Charles who wrote the King's authorised biography, said the monarch would find the Homage of the People 'abhorrent'. Archbishop Welby followed the longstanding tradition of commissioning new coronation liturgy - the prayers and actions of the coronation service - which has the theme Called To Serve.He chaired an advisory group of theology, constitutional history and inter-faith relationships experts to draft the liturgy, produced in close consultation with the King and the Government.",
        "The Homage of the People replaced the homage of peers, and Lambeth Palace described it as an invitation to the estimated global television audience of tens of millions to make a 'a great cry around the nation and around the world in support for the King'.Archbishop Welby was to say: 'I call upon all persons of goodwill in the United Kingdom of Great Britain and Northern Ireland, and of the other realms and the territories to make their homage, in heart and voice, to their undoubted King, defender of all.'All those interested would be invited to say: 'I swear that I will pay true allegiance to your majesty, and to your heirs and successors according to law. So help me God.'But now he will say: 'I now invite those who wish to offer their support to do so, with a moment of private reflection, by joining in saying God save King Charles at the end or, for those with the words before them, to recite them in full.'Commenting on the changes to the Homage of the People, a Lambeth Palace spokesperson said: 'The Homage of the People was always an invitation rather than expectation.'To provide further clarity as the Order of Service was finalised, it has been mutually agreed by Lambeth Palace and Buckingham Palace that the introductory words will be changed.",
        "'This reflects the collaborative approach that has been taken throughout the coronation planning.'We are looking forward to the service with much joy and expectation.'",
        "The event will bring together around 100 heads of state, kings and queens from across the globe, celebrities, everyday heroes and family and friends of the couple, with Charles' estranged son the Duke of Sussex expected to attend.Invited guests include David and Victoria Beckham, musician Lionel Richie, French President Emmanuel Macron, King Willem-Alexander and Queen Maxima of the Netherlands, Prime Minister Rishi Sunak and US First Lady Jill Biden but her husband President Joe Biden will not be attending.The day will be a display of pomp and pageantry, with the nation's Armed Forces promising a 'spectacular' event when the King and Queen process through the streets of the capital.The event is the military's largest ceremonial operation since Queen Elizabeth II's 1953 coronation, with 9,000 servicemen and women deployed and 7,000 of these performing ceremonial and supporting roles.",
        "Build up to the big day has already begun with workers sweeping sand onto roads, police officers arriving and a rain shelter is being set up outside the Abbey entrance.Metropolitan police and military police officers patrolled the route from Victoria to Westminster from the early hours on Saturday.",
        "Royal fans with Union flags and crowns could be seen on trains and in Tube stations from just after 4.30am.The King will be crowned at Westminster Abbey by the Archbishop of Canterbury during a coronation ceremony dating back centuries.Cries of 'God Save the King' will ring out around the abbey after St Edward's Crown is placed on Charles' head by Mr Welby.The senior cleric said in a statement issued on the eve of the coronation that the ceremony served as 'a powerful reflection and celebration of who we are today, in all our wonderful diversity'.He said people will be struck by the 'majesty and sacred wonder' of the service, but also hoped they would find 'ancient wisdom and new hope'.",
        "Charles III's day of destiny has arrived as the world prepares to watch the historic first coronation of a UK monarch in 70 years at Westminster Abbey where Britain and the Commonwealth will hail its new King today.The monarch had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.",
        "Charles will be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain's place on the world stage in the UK's biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965.His family, including Prince Andrew and Princess Anne, enjoyed a dinner at Mayfair club Oswald's last night. Mike and Zara Tindall were out until 2am. Prince Harry flew in from Los Angeles yesterday for his 24-hour trip. It emerged last night he has been relegated to the third row in the Abbey with other non-working royals.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. ",
        "Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.",
        "The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain."
    ]
}