{
    "articleURL": "/wires/reuters/article-12049523/Chinas-yuan-rangebound-glum-data-clouds-recovery-outlook.html",
    "content": [
        "By Georgina Lee HONG KONG, May 5 (Reuters) - China's yuan firmed within a narrow range on Friday, buoyed by a weaker U.S. dollar, but its strength was capped by the latest data showing a slower pace of economic recovery. The spot yuan opened at 6.9070 per dollar and was changing hands at 6.9101 at midday, 27 pips stronger than the previous late session close and 0.02% stronger than the midpoint. In April, China's service activity grew for a fourth straight month, although at a slower pace than March, the private sector survey Caixin/S&amp;amp;P Global services purchasing managers' index (PMI) shows. The index, which fell to 56.4 from 57.8 in March, was above the 50-point mark separating expansion and contraction in activity. Still, it followed unexpected contraction reported in the manufacturing PMI survey on Thursday, and in Sunday's official PMI figure. Both sets of data indicate China's recovery has yet to find a stable footing, analysts said. \"With the recent PMI data, it has become clearer that the economic rebound has been moderate, given the weakening in manufacturing,\" said Alvin Tan, head of Asia currency strategy at RBC Capital Markets. With little positive news domestically to boost confidence, the yuan's movement was driven largely by moves in the U.S. dollar, he added. The People's Bank of China set the midpoint rate at 6.9114 to the dollar prior to the market open, weaker than the previous fix of 6.9054. The spot rate is allowed to trade in a range 2% above or below the official fixing on any given day. The global dollar index fell to 101.245 from the previous close of 101.399. Yuan performance has been largely \"stagnant\" as \"even Chinese residents are showing little confidence in the yuan at this juncture,\" according to HSBC research published on Friday. While the first quarter saw net FX inflows onshore, these were being saved as foreign currency deposits rather than converted into yuan, as some residents continued to sell the domestic currency and buy dollar, it said. The offshore yuan was trading 0.07% weaker than the onshore spot at 6.915 per dollar. The one-year forward value for the offshore yuan traded at 6.7529 per dollar, indicating a roughly 2.40% appreciation within 12 months. The yuan market at ONSHORE SPOT: Item Current Previous Change PBOC midpoint -0.09% 6.9114 6.9054 Spot yuan 0.04% 6.9101 6.9128 Divergence from midpoint* -0.02% Spot change YTD -0.15% Spot change since 2005 revaluation 19.77% OFFSHORE CNH MARKET Instrument Current Difference from onshore Offshore spot yuan * 6.915 -0.07% Offshore non-deliverable 2.27% forwards 6.7583 ** *Premium for offshore spot over onshore **Figure reflects difference from PBOC's official midpoint, since non-deliverable forwards are settled against the midpoint. . (Reporting by Georgina Lee; Editing by Clarence Fernandez)"
    ]
}