{
    "articleURL": "/wires/reuters/article-12060805/Everton-manager-Dyche-hails-energy-quality-Brighton-win.html",
    "content": [
        "BRIGHTON, England, May 8 (Reuters) - Everton´s energy and tactical discipline were key to their stunning 5-1 Premier League victory at Brighton &amp;amp; Hove Albion on Monday, but manager Sean Dyche has cautioned it is just another step in their battle to avoid relegation this season.",
        "Abdoulaye Doucoure and Dwight McNeil both scored braces to go with an own goal from Brighton goalkeeper Jason Steele as Everton profited from swift and incisive counter-attacks to secure three points that moved them out of the relegation zone.To score five goals with 23 percent of the possession is a reflection of how they allowed Brighton the ball, but were lethal once they won it off their hosts.\"They (Brighton) play a particular way with two boxes in midfield. I said to the lads it is about focus. Our tactical shape has been pretty good since I've come in here. But it's about focus when they change their tune and try and pop it around the corner and play neat and tidy,\" Dyche told BBC.\"But equally it's not just about shadow play, you've got to go and break it up and first half we did that so many times. Second half they had a good spell but we calmed that down and I thought we saw the game through very well.\"Everton drew 2-2 at Leicester City in their previous game when they created more than enough chances to win, and Dyche believes they gained confidence from that result.\"A lot of people thought we were good at Leicester, we were very good and conceded soft goals. Tonight we got paid back for that performance because the energy was there, the tactical performance, but also the quality,\" he said.",
        "Everton are two points clear of the relegation zone with a home game against Manchester City to come on Sunday. After that they travel to Wolverhampton Wanderers and host Bournemouth in their final game of the season.\"This is just another step as I said when we beat Arsenal, it's just one step,\" Dyche said. \"We'll see what happens over the next few games. The players have delivered. They deserve a lot of credit.\"(Reporting by Nick Said Editing by Toby Davis)"
    ]
}