{
    "articleURL": "/femail/article-12043153/As-Liz-Truss-charged-12-000-bathrobes-vanish-Chevening-IMOGEN-EDWARDS-JONES-confesses.html",
    "content": [
        "Imogen Edwards Jones doesn't condemn the 'hospitality lifters' — she questions their sense of imagination READ MORE: Former PM demands 'accurate invoice' after being asked to settle Cabinet Office bill for 'lost items' Be honest — have you ever pinched a pair of fluffy slippers from a hotel room? Surely, the logic goes, they are not going to wash them and shove them back into a plastic bag for the next guest … so why not?",
        "The soaps and shampoos, perhaps, too; even a branded bath hat. They are easily slipped in between the pants and the socks as you’re packing. Although maybe not the towelling gown — that’s a hefty steal that requires effort, fortitude and definitely buttocks on the suitcase.I’ve been reminded of ‘hospitality lifting’, as it’s known, because former PM Liz Truss has recently received a bill for £12,000 for costs incurred at events she hosted at Chevening House when she was Foreign Secretary, reportedly including bathrobes and slippers. She has since agreed to pay for missing items, but even so…",
        "Of course, Chevening, in Kent, is a grace-and-favour country house rather than a hotel. But, to be honest, I am a little puzzled by her guests’ abstemiousness and lack of imagination. Just the slippers and dressing gowns?Only this week, having spent the Bank Holiday in Italy, I returned with two ashtrays, three packets of coffee pods, jam and a nice piece of Murano glass.And it’s not just me. Last week a friend came back from New York with two steak knives, a jar of honey and almond butter, and a pepper pot.The salt cellar had sadly eluded her, but the steak knives were super-sharp and simply irresistible, and would I like to try them out on this piece of cheese?",
        "My grandmother would certainly be shocked by this sort of ‘brazen’ behaviour, but perhaps, in this corporate-heavy society, there’s a little part of us all that wants to ‘stick it to the man’.For some, those hotel slippers are the gateway to more elaborate ‘lifting’. My own habit started with soaps, which is something of a grey area, to be honest. They’re travel-sized and branded. Surely they are ripe for the clearing? And who on earth wants to find a half-used shampoo and conditioner in their complimentary spongebag?I think it was in Indonesia in 1996 that I progressed to the harder stuff, and a very small incense diffuser found its way, accidentally, into my bag. A little bit of brass beauty.",
        "It was wrapped in my sarong, or at least that’s how I found it. It had pride of place in my sitting room for a while. It has long since disappeared, as has the guilt for pinching it.Next there was the glass cotton-wool dispenser from Australia. It was simply too pretty to leave behind. Then there was the trinket tray from Los Angeles. A handy plastic cotton-bud holder from Spain. A dear little bedside mug from Morocco. A tips box (empty) from the Seychelles.Endless salt and pepper pots from Russia, Berlin, Paris, Madrid, Manchester. Writing paper, envelopes — oh, and the postcards (but I think you’re meant to take those, aren’t you?), along with the pads and pens by the phone.",
        "I have a friend who steals the towels. Who on earth knows why? She has plenty of her own back at home. The coat hangers, obviously. But never the Corby trouser press. (It’s far too big, for a start, and they might really miss it.) A guest unscrewed the Victorian lavatory seat  The last thing you want is to incur the wrath of anyone, or an actual bill. The rule of thumb for a five-fingered discount at a hotel is that nothing expensive or of real value ever leaves the room.But there is certainly something strange that happens to many of us when we cross a hotel threshold. It’s almost as if the normal rules of engagement no longer apply.It’s possibly all down to the sudden lack of responsibility — or, more likely, that particular alchemy of alcohol and luxury.When I researched my books, Hotel Babylon, Beach Babylon and Restaurant Babylon — all exposés of the hospitality industries — I realised what a rank amateur I was. For guests will steal anything that is not nailed down, and, in some circumstances, even nails, or indeed screws, are not enough of an obstacle.",
        "One manager of a five-star hotel in London told me about an American guest who’d taken such a shine to a Victorian wooden lavatory seat that he’d unscrewed the whole thing and popped it into his suitcase. ",
        "Naturally he received a bill for the antique item before his plane had even touched down.Once, the same hotel had someone lift up a bed and cut out the carpet from underneath it, then struggle through reception with the fabric in their bag.It wasn’t until housekeeping were vacuuming later that day that anyone noticed. Was he charged? He most certainly was.The hotel has also lost lamps, trays, books, fridges, pillows, duvets and, of course, bottles and bottles of booze. Numerous guests drain the contents of the mini bar and fill the empty bottles of gin and vodka with water to save a few quid. TVs go missing. Sound systems. Speakers.One hotel in Knightsbridge was even targeted by a highly organised gang who removed all the furniture in the lobby — helped by the staff, as they were sporting what looked like official overalls — only for the management to realise a few hours later that no new sofas had been ordered for the hotel reception.My favourite klepto story has to be of the honeymooning couple who were staying in a $15,000-a-night water villa in the Maldives and stripped their suite clean. They packed every little trinket and tray into their luggage, only for their bags to fall into the sea as they left.",
        "The hotel emptied the suitcases, dry-cleaned all their clothes, packaged all the goodies up in tissue paper, and sent everything back to their home in the U.S., without a word. Needless to say, the couple never stayed in that five-star resort again. Teaspoons go missing in their hundreds  However, hotels are beginning to fight back. In the past, they would factor in the price of a few missing bits and bobs — quite possibly including the bathrobes — into the price of the room. Now, though, they are actively selling them.Go into the marble confines of any five-star hotel bathroom these days and you’ll find a little sign suggesting you might want to buy the slipper and bathrobes co-ord from reception. Which, of course, is a passive-aggressive way of saying ‘If you pinch them, we will charge you, whether you packed them “accidentally” or not’.Others, notably the fashionable Soho House group, have opened their own shops.As for the most stolen item from any hotel or restaurant? Teaspoons! When I asked my manager friend from the five-star London hotel why, he simply shrugged.‘They’re small, they’re sweet and eminently nickable, and you don’t need a capacious bag. They slip into any pocket. I have no idea why you’d want to,’ he added. ‘But all I know is, we get through hundreds every week!’",
        "So, from spoons to slippers, could it be there are light-fingered tendencies in us all?Have You Got Anything Stronger? by Imogen Edwards-Jones (£8.99, Welbeck) is out now."
    ]
}