{
    "articleURL": "/wires/reuters/article-12057763/James-Harden-rescues-76ers-OT-thriller-series-vs-Celtics.html",
    "content": [
        "James Harden drained a 3-pointer with 19 seconds remaining in overtime to fuel the host Philadelphia 76ers to a back-and-forth 116-115 victory over the Boston Celtics on Sunday, leveling their Eastern Conference semifinal series at two wins apiece.",
        "Harden collected 42 points, nine assists and eight rebounds while Joel Embiid recorded 34 points and 13 boards for the third-seeded 76ers, who snapped a two-game skid. Game 5 is Tuesday in Boston.Harden made 16 of 23 shots from the floor -- including 6 of 9 from 3-point range -- to bounce back from a pair of disastrous shooting performances in Games 2 and 3. He sank just 5 of 28 shots from the floor and 2 of 13 from beyond the arc in the previous two games.Boston's Jayson Tatum overcame missing his first eight shots from the floor to finish with 24 points, 18 rebounds and six assists. Jaylen Brown had 23 points, Marcus Smart added 21 points and seven assists and Malcolm Brogdon contributed 19 with eight rebounds off the bench for the second-seeded Celtics.Embiid sank a pair of free throws to give Philadelphia a 113-112 lead with 56 second left in overtime before Tatum answered by sinking a 3-pointer with 38 seconds remaining. Harden countered by converting from the corner with 19 seconds left before Smart's 3-pointer was deemed to be released after the buzzer.Smart converted a three-point play to give Boston a 112-109 lead with 3:31 remaining in overtime. Embiid sank a mid-range jumper, however the potential go-ahead basket was negated after he was whistled for a charge against Smart with 1:49 left, which the Sixers unsuccessfully challenged.",
        "Earlier P.J. Tucker converted a three-point play to forge a tie at 105-105 before being whistled for a foul on Smart, who made both free-throw attempts with 51.3 seconds remaining in the fourth quarter. Harden sank a mid-range floater to level the contest with 16.1 seconds to play, and Smart's open 3-point attempt at the buzzer bounced off the front rim.The 76ers led by as much as 16 late in the third quarter, and Embiid converted a slick pass from Harden to give Philadelphia a 96-88 lead with 7:15 remaining in the fourth quarter. Boston made a stand, however, as Smart drained two 3-pointers to highlight his team's 17-4 run before Harden made a basket and Tucker converted a three-point play to forge a tie.--Field Level Media"
    ]
}