{
    "articleURL": "/wires/reuters/article-12039137/Chesapeake-Energy-profit-beats-higher-natural-gas-output.html",
    "content": [
        "By Arshreet Singh",
        "May 2 (Reuters) - U.S. oil and gas company Chesapeake Energy Corp on Tuesday beat estimates for first-quarter profit on higher production of natural gas despite lower prices.The United States has emerged as the world's largest LNG exporter after Western sanctions on major supplier Russia, which has boosted demand for U.S. natural gas and encouraged producers to increase output.\"Chesapeake turned a lot more wells to sale this quarter,\" said Gabriele Sorbara of Siebert Williams Shank &amp;amp; Co, adding that the company put 53 wells to production, higher than the brokerage's estimate of 36 wells, which led to more activity and \"drove the volumes\".The company, however, said in February that it would drop three drilling rigs in the coming months and would reduce gas output by 4% to 6% this year as prices of natural gas futures fell about 37% from last year as higher output collided with weaker heating demand.The move followed that made by Comstock Resources, which earlier disclosed it would take down two rigs in coming months due to weaker prices.Chesapeake expects to drill 35 to 45 wells and place 30 to 35 wells on production in the second quarter.Its net production in the January-March quarter was about 4.1 billion cubic feet equivalent per day, up 9.4% from last year and consisted of about 90% natural gas and 10% total liquids.",
        "Chesapeake, which had announced plans to sell its oil position to focus on production of super cooled fuel, in February said it would sell oil assets in South Texas to chemical maker INEOS for $1.4 billion.Cash proceeds from the asset sales have helped the company \"weather weaker (gas) prices near term,\" said Sorbara.The Oklahoma City-based company reported adjusted earnings of $1.87 per share, while analysts had expected $1.72 per share, according to Refinitiv data. (Reporting by Arshreet Singh; Editing by Shailesh Kuber)"
    ]
}