{
    "articleURL": "/wires/afp/article-12060835/Very-afraid-migrants-race-cross-US-border-rules-shift.html",
    "content": [
        "Dasling Sanchez rests on a piece of cardboard with her two children near a gas station in Brownsville, Texas, a border town where hundreds of migrants have arrived ahead of immigration restrictions ending, which some fear may actually complicate entry.",
        "On Thursday, US President Joe Biden's administration will lift Title 42, the strict protocol implemented by Donald Trump to deny entry to migrants, including asylum seekers, based on the Covid pandemic.Although the looming expiration has raised fears of a deluge of illegal entries along the southern US border, some such as Sanchez believe it could make it more difficult to enter the United States.\"We were very afraid because they say after May 11 they are not going to let you pass through,\" Sanchez, a 28-year-old Venezuelan who had been waiting across the border in Matamoros, Mexico, told AFP as she and her two sons ate pizza from a Catholic charity.With Title 42 lifted, the US administration plans to control and deter undocumented migration using means including a new regulation that would turn away asylum seekers who did not first seek protection in one of the countries they traveled through.And while migrants can still be deported, under Title 42 they were often simply sent back across the border to Mexico, where they could continue attempting to cross.",
        "\"I was a little afraid because when Title 42 runs out, they deport you directly, and you went through all that journey, you sold all your things, and you are left with nothing. I was afraid of that,\" said 28-year-old Venezuelan Leandro Ruiz.",
        "For Sanchez, who like thousands of migrants was waiting at the border in Mexico, the coming changes meant acting quickly.- Long journeys through jungle -For the moment, Customs and Border Protection is bussing hundreds of people daily to Brownsville after they are detained and processed -- they are migrants who one way or another managed not to be expelled.Mayra Paredes, a volunteer with the humanitarian organization Team Brownsville, which supports migrants with clothing and food, said the number of migrants helped by her organization had jumped from an average of 100 per day since the beginning of the year to \"700 to 1,000 people per day\" in the last two weeks.",
        "The migrants -- many of the Venezuelans, but also Colombians, Central Americans and Asians -- walk throughout the city, where most others use cars. Similar scenes play out in other US border towns, such as El Paso.They have been on long journeys, many of them through the Central American jungle, and now find themselves sleeping at places like the city bus station, with shelters full.US Homeland Security Secretary Alejandro Mayorkas who recently traveled to the US border including Brownsville, has admitted the circumstances are difficult.The Biden administration, which Republicans blame for being lax on immigration, is deploying 1,500 more troops to help at the border in preparation for a possible surge in crossings.",
        "Amid the tense situation, eight people were killed and several others injured in Brownsville when an SUV plowed into a group waiting at a bus stop outside a migrant aid center on Sunday.Law enforcement said they were treating the incident as an accident for now, although a witness told AFP the driver had yelled insults at the group before accelerating."
    ]
}