{
    "articleURL": "/wires/reuters/article-12038327/Stocks-sink-Treasury-yields-dollar-fall-Fed-debt-ceiling-focus.html",
    "content": [
        "Oil prices tumble on economic concerns",
        "U.S. Treasury yields fall sharply, U.S. dollar downMajor U.S. stock indexes down more than 1%(New throughout, updates prices, market activity and comments after U.S. market opens; new byline, changes dateline, previous LONDON)By Sinéad CarewNEW YORK, May 2 (Reuters) -Wall Street followed European shares lower on Tuesday, a day ahead of Federal Reserve interest rate decisions, while U.S. Treasury yields fell as investors worried the government could run out of cash June 1 without a debt ceiling hike.The dollar index dipped. The Australian dollar rose early after the country's central bank stunned markets with an interest rate hike, but the currency gave back most gains as the day wore on.Oil prices sank more than 4% to a five-week low on worries about a U.S. bond default, weak economic data and expectations for more rate hikes in the United States and Europe.U.S. President Joe Biden summoned the four top congressional leaders to the White House next week. Late on Monday, the Treasury Department said the United States couldrun out of the cash needed to pay its bills in the next month.Investors widely expect the Fed to announce a quarter of a point interest rate hike on Wednesday and will scrutinize any comments from Fed officials regarding its path after the May meeting.",
        "\"A lot of headwinds have come to the forefront simultaneously this morning ... we're not falling apart but investors are recognizing that there's challenges in the near term,\" said Michael O´Rourke, chief market strategist at JonesTrading in Stamford, Connecticut.Data showed U.S. job openings fell for a third straight month in March even as they remained at levels consistent with a tight labor market, O'Rouke said.The Dow Jones Industrial Average fell 584.46 points, or 1.72%, to 33,467.24, the S&amp;amp;P 500 lost 74.62 points, or 1.79%, to 4,093.25 and the Nasdaq Composite dropped 186.52 points, or 1.53%, to 12,026.08.The pan-European STOXX 600 index lost 1.29% and MSCI's gauge of stocks across the globe shed 1.38%. Emerging market stocks lost 0.34%.U.S. bank stocks tumbled on the second trading day after news of the failure of First Republic Bank and sale of its assets to JPMorgan Chase. Regional banks posted the biggest declines.The dollar fell after the U.S. jobs data for March and a report that showed factory orders below expectations.The dollar index fell 0.117%, with the euro up 0.06% to $1.0982. The Japanese yen strengthened 0.73% versus the greenback at 136.49 per dollar. Sterling was last trading at $1.2455, down 0.33% on the day.Benchmark 10-year Treasury notes were down 13.9 basis points to yield 3.435%, from 3.574% late on Monday. The 30-year bond was last down 9.6 basis points to yield 3.7207% while the 2-year note was down 18.4 basis points to yield 3.9551%.",
        "U.S. credit default swaps - which reflect the cost of insuring against a default - were trading at their highest in years, while yields on one-month Treasury bills neared their highest since 2007.U.S. crude oil recently fell 4.16% to $72.51 per barrel and Brent was at $76.13, down 4.01% on the day.In precious metals, gold extended gains, on track for its biggest daily rise in a month, as investors eyed U.S. economic data and waited for the Fed meeting.Spot gold added 1.4% to $2,010.59 an ounce. U.S. gold futures gained 1.44% to $2,012.00 an ounce.(Additional reporting by Amanda Cooper in London, Tom Westbrook in Singapore Editing by Christina Fincher, Mark Potter and David Gregorio)"
    ]
}