{
    "articleURL": "/tvshowbiz/article-12041415/Lindsey-Vonn-slips-black-bikini-sunbathes-dog-Lucy-laying-back.html",
    "content": [
        "Lindsey Vonn slipped into a black bikini as she was joined by her pet dog Lucy for a tanning session on Tuesday.",
        "The retired skier and Olympic gold medallist, 38, took to Instagram to post snaps of the cute moment. In one image, Lindsey showcased her golden glow as her pooch lay on her back. She was all smiles as she lay on a sun lounger by the pool sporting a pair of black sunglasses while Lucy nuzzled her neck affectionately.Later, Lucy sat on her bottom and looked up at the camera as she had some family time with her owner. ",
        "Lindsey's other dog sat with her in another snap as they relaxed by the pool. It comes after the retired skier opened up about being diagnosed with depression.While appearing as a guest on MSNBC's limited series Deadline: Special Report in October, she spoke with reporter Nicolle Wallace about her mental health journey.'I was diagnosed with depression and given medication and I still resisted therapy because I still thought there was nothing wrong with me. And there is nothing wrong with me!' she emphasized.Vonn initially spoke publicly about her depression while speaking to People back in 2012, but she said the topic needs to be normalized.About her diagnosis, Lindsey told Nicolle: 'I really only went to the doctor because a friend of mine had been diagnosed with depression and had really similar symptoms.",
        "'I went in like, \"I'm just gonna get this done with so I can confirm that I'm fine. Everything's fine. There's nothing wrong with me,\"' she admitted.The Olympic gold medallist noted that there's still stigma surrounding conversations about mental health, particularly in the sports industry.'It's viewed as you can't be a strong athlete if you're depressed. You can't be strong and have weakness,' she detailed.",
        "She acknowledged and praised athletes like Simone Biles and Naomi Osaka for prioritising their mental health.Lindsey also talked about her late mother, Lindy Anne Lund, who recently died following a battle with ALS.She noted her mother's ability to remain positive about life, even as she was dying.'When she was diagnosed with ALS she was very sad, obviously - it's terminal. She cried and then the next day she said, \"Today is another great day.\"'And every day since then she said, \"Today is gonna be a great day.\"'She added, 'She was dying and she was positive. When you think about your own struggles, I'm like, \"How could I not be positive? 'How could I look at the bright side of everything like my mother did?\" Because if she can see it, then I certainly can.'"
    ]
}