{
    "articleURL": "/wires/reuters/article-12051243/Thousands-fleeing-Sudan-stuck-Red-Sea-shore.html",
    "content": [
        "By Khalid Abdelaziz and El Tayeb Siddig",
        "PORT SUDAN, Sudan, May 5 (Reuters) - Hanadi Al-Sir was among thousands who rushed to Port Sudan, hoping to get on a boat or a plane to escape fierce fighting between the army and rival paramilitary forces.Ten days later she is still camped out in the sweltering heat at the Red Sea city with crowds of others waiting in tents and shelters to get their hands on a ticket.\"I sleep on the ground and I don't have money to book a hotel room. There's no services here,\" the 37-year-old said.The city is a shipping hub and, in happier times, a tourist destination. But it has struggled to cope with the crowds of Sudanese, Syrians and Yemenis arriving every day.Rooms are going for as much as $100 a night, too much for many of the refugees who are forced to sleep rough in public parks, under trees and outside government buildings.UN and foreign diplomatic missions have set up bases there, competing for space. Saudi Arabia, which sits across the Red Sea from Port Sudan, says it has evacuated almost 8,000 people.But many complain of a lack of communication and there has been a number of small protests.\"All I get are promises but I don't know when we will be evacuated,\" Sudanese engineer Ahmed Hassan, a Saudi resident, said.",
        "Port Sudan has seen little fighting, but is bracing for the effects of a wider economic crisis.A breakdown in banking and customs procedures has hit shipping activity, the local economy's main employer, a port official said.The wrecked telecoms and banking systems have made it even harder for the refugees to get cash.\"They've made us powerless, we don't have privacy or freedom. I wish we never left Khartoum,\" said Salem, waiting under one of the makeshift tents. \"We moved to find a way out, but there's no way out until now.\"Clinics run by the Sudanese Red Crescent see about 400 cases a day, mainly Syrians and Yemenis, volunteer doctor Rawan Abdelrahman said. They are running short of medicines, supplies, and staff, she added.Many of her patients are people who originally came to Sudan fleeing war in their own countries.Restaurant owner Abu Munir says he is one of 5,000 Syrians waiting to get out.\"I came here nine years ago fleeing war and now war is driving us out in Sudan,\" he said, exhausted after spending more than a week on the street. \"Our only hope is to go back to Syria despite the war at home.\" (Writing by Nafisa Eltahir; Editing by Michael Georgy and Andrew Heavens)"
    ]
}