{
    "articleURL": "/tvshowbiz/article-12041267/Gwyneth-Paltrow-compares-lister-exes-Brad-Pitt-Ben-Affleck-bed.html",
    "content": [
        "Gwyneth Paltrow has compared her two A-lister exes Brad Pitt and Ben Affleck - revealing Affleck was 'technically better in bed but Pitt edges it as the better actor.",
        "The actress, 50, was put on the spot in a podcast interview with Alex Cooper called Call Her Daddy.She dated Brad from 1994 but they broke off their engagement in 1997 because at aged 24, she felt she was too young for marriage. She went on to have a three-year relationship with Ben. Giving a series of frank answers, Gwyneth answered who was best in the bedroom, saying: 'That's really hard.'Because Brad was like the major chemistry love of your life at the time. And then Ben was like technically excellent.",
        "'I can't believe my daughter's listening to this.'Asked who she regarded as the better actor of the two, she said: 'They're both so talented. And Ben is a great writer and director. 'But I guess I would probably have to say acting alone, Brad. Because if you think of all the different roles that he's done.'Gwyneth also spilled the beans to a series of other comparison questions such as who had better style?'Probably Brad,' she said. 'Who was more romantic?''Brad.''Who was more likely to make you laugh?''Ben.''Who are you more likely to get into an argument with?''Ben.''Who was more high maintenance?''I'm not sure I would characterize either of them as high maintenance.'",
        "'Who cared more about their appearance?''I'm not sure. I feel like neither of them were very vain like that. I'm not attracted to guys who are like looking in the mirror the whole time. 'Although Ben did like have like a mirror face that he would throw at the mirror. I think he was joking though.''Who was the better kisser?''They were both good kissers.'The actress recently said she is still in contact with Brad and that they still love one another. ",
        "She told Entertainment Tonight in October: 'When we first broke up, we weren't friends for a while.'And then we sort of found our way back, probably about 18 or 19 years ago, something like that, and then just kind of stayed in touch over the years.'I adore him,' Paltrow said. 'He's an amazing person, and he's a great entrepreneur, and such a creative, and such a good person. I really love him. I'm a big fan.' Gwyneth went onto marry Coldplay frontman Chris Martin, who she was married to for 13 years, before 'consciously uncoupling.' They had children Apple, 18, and Moses, 17 together. Gwyneth is now married to producer Brad Falchuk, who she tied the knot with in the Hamptons back in 2018. ",
        "Ben Affleck and Jennifer Lopez married in November but first dated and got engaged to one another 20 years ago before splitting. And Brad Pitt is happily dating after his marriage to second wife Angelina Jolie ended in 2019 after five years of marriage."
    ]
}