{
    "articleURL": "/wires/reuters/article-12051863/Tennis-Birthday-boy-Alcaraz-beats-Coric-reach-Madrid-final.html",
    "content": [
        "MADRID, May 5 (Reuters) - Defending champion Carlos Alcaraz celebrated his 20th birthday by storming into the Madrid Open final with a 6-4 6-3 victory over Borna Coric on Friday to stay on track for his fourth title of the season.",
        "In Sunday's title clash, the top-seeded Spaniard will face off against lucky loser Jan-Lennard Struff who battled from a set down to beat qualifier Aslan Karatsev 4-6 6-3 6-4 in the other semi-final.\"It means a lot to me, playing a final again here in Madrid. It's such a special place for me. I have great memories since I came here to play Under-12s,\" Alcaraz said.\"Last year it was amazing. I'll enjoy the final and try to make all of Spain happy. I don't think about the pressure here. I just think about playing great matches and getting good results. I enjoy every single second here.\"Alcaraz has enjoyed a spectacular start to his career, becoming the youngest man to top the world rankings after his U.S. Open win last September and has already claimed three Masters 1000 titles as a teenager.He took a big step towards another Masters crown and stamped his credentials as one of the favourites for this month's French Open on a warm afternoon at the Manolo Santana Stadium with six-times Roland Garros champion Bjorn Borg watching on.World number two Alcaraz heaped the pressure on Coric in their first career meeting and faced stiff resistance from the Croatian 17th seed before drawing first blood with a searing forehand in the fifth game of a physical opening set.",
        "After wrapping up the first set, Alcaraz grabbed an early break and despite a wobble on his own serve, raced to a 4-2 lead in the next as he dictated terms against a fading Coric.He swiftly closed out his 28th win in 30 matches this year and celebrated by cutting a massive cake on court.FAIRYTALE RUNStruff lost to Russia's Karatsev 10 days ago in the final round of qualifying but was added to the main draw after a late withdrawal. He has since enjoyed a fine run, ousting world number five Stefanos Tsitsipas in the quarter-final.The German was made to work hard for the win by Karatsev - who struggled with a leg issue late in their semi-final - and will now bid for a first ATP title in his second final.\"It's amazing... I've played one final before in Munich (in 2021) with no crowd because of COVID,\" Struff said.\"Now, here an amazing crowd and I think on Sunday maybe not all will be rooting for me but it's fine. I'm happy to reach the final and happy to win.\"In Saturday's women's final, world number one Iga Swiatek faces Australian Open champion Aryna Sabalenka.(Reporting by Shrivathsa Sridhar in Bengaluru, editing by Pritha Sarkar and Toby Davis)"
    ]
}