{
    "articleURL": "/wires/reuters/article-12055725/Red-Sox-Phillies-8th-straight-win.html",
    "content": [
        "Rafael Devers highlighted his three-hit performance with a two-run double to ignite a five-run fourth inning, lifting the surging Boston Red Sox to a 7-4 victory over the host Philadelphia Phillies on Saturday.",
        "Boston's Rob Refsnyder ripped a two-run double, Christian Arroyo had a two-run single and Reese McGuire added an RBI single for the Red Sox, who have scored 59 runs during their eight-game winning streak.Philadelphia's Bryce Harper and Trea Turner each belted a solo homer to highlight their respective two-hit performances. Alec Bohm and Edmundo Sosa each added an RBI single among their two hits for the reeling Phillies, who have lost six in a row.Bailey Falter (0-6) retired the first nine batters he faced before the bottom fell out in the fourth inning.Falter quickly loaded the bases before Devers' double to center field plated a pair of runs to give the Red Sox a 2-1 lead. Falter retired the next two batters before Arroyo's single to left field scored two more runs and McGuire's RBI single extended Boston's advantage to 5-1.That spelled the end of Falter, who took the loss after yielding five runs on six hits in 3 2/3 innings.Bryson Stott was hit by a pitch by Corey Kluber (2-4) to lead off the second inning and advanced to second base on a wild pitch to move into scoring position. He didn't stay there long, as Bohm's single to center field brought him home to open the scoring.",
        "Sosa capped an 11-pitch at-bat with an RBI single in the fourth inning and Harper deposited a 3-2 sinker from Kluber over the wall in left-center field in the fifth for his first homer of the season.Kluber picked up the win after allowing three runs on seven hits in five innings.Boston pushed its lead to 7-3 in the sixth inning after Refsnyder's double down the left field line plated both McGuire and Arroyo.In the seventh, Turner sent a 1-2 changeup from Brennan Bernardino over the wall in left field for his fourth homer of the season and second in his last four games.Josh Winckowski bridged the gap to Kenley Jansen, who worked around a single in the ninth inning to secure his eighth save of the season.--Field Level Media"
    ]
}