{
    "articleURL": "/wires/reuters/article-12059093/FOCUS-After-weight-loss-Alzheimers-frontier-drugs-like-Ozempic.html",
    "content": [
        "By Natalie Grover",
        "LONDON, May 8 (Reuters) - Diabetes drugs that also promote weight loss such as Novo Nordisk´s Ozempic, becoming a darling of celebrities and investors, are being studied to tackle some of the most difficult-to-treat brain disorders, including Alzheimer´s disease.Diabetes regimens, from Ozempic to old mainstays like insulin and metformin, appear to address several different aspects of the metabolic system implicated in Alzheimer's disease, including a protein called amyloid and inflammation, researchers say.The hope is that improving glucose utilisation and tamping down inflammation in the entire body - including the brain - could slow progression of debilitating diseases like Alzheimer's and Parkinson's.Several scientists interviewed by Reuters pointed to mounting research supporting testing diabetes drugs against neurodegenerative diseases.Results are years away and success uncertain. But interest has been buoyed by recent positive data on Alzheimer's drugs developed by Eisai Co Ltd with partner Biogen and by Eli Lilly and Co demonstrating that removing sticky amyloid plaques accumulated in the brain can slow cognition decline caused by the fatal mind-wasting disease.Those successes followed decades of futility that had left many questioning the validity of the amyloid theory behind most experimental Alzheimer's drugs.Dr. Suzanne Craft, professor of gerontology and geriatric medicine at Wake Forest University School of Medicine, gave a keynote speech at an influential Alzheimer's scientific meeting late last year about the need to test treatments such as diabetes drugs to further reduce the advance of Alzheimer's.",
        "She said she has since been approached by pharmaceutical companies at an increasing pace, and is currently running an Alzheimer´s trial evaluating intranasal insulin in combination with another diabetes drug.Diabetes treatments may amplify the clinical benefit of anti-amyloid drugs, and potentially lead to complete stabilization or even some recovery in Alzheimer's patients, Craft said.\"This is what these agents do, and what insulin does. It plays a role in regeneration. And that's what needs to happen. Given its role in modulating immune function, it may prevent the amyloid from continuing to accumulate,\" Craft surmised.Unlike older off-patent medicines like metformin, there is commercial incentive to test newer treatments such as GLP-1 agonists, a rapidly expanding class now dominated by Ozempic, known chemically as semaglutide, and Lilly's Mounjaro, with other players working on a dozen potential new treatments.Four companies with GLP-1 drugs, including two larger drugmakers, say they are watching for results of trials testing Novo's drug in Alzheimer's.Ivan Koychev, consultant neuropsychiatrist for Oxford University Hospitals NHS Foundation Trust, is running a trial testing semaglutide with the aim of halting the earliest changes in the brains of people at risk of developing Alzheimer's.GLP-1s are his primary focus, he said, because there is \"good epidemiological evidence that they are linked to lower risk for dementia but run much lower risk of serious side-effects relative to the amyloid clearance therapies.\"",
        "Anti-amyloid therapies carry the risk of dangerous brain swelling.Any success could lead to a big payoff. Dementia affects more than 55 million people globally and the market for Alzheimer´s drugs is expected to grow to $9.4 billion by 2028 and for Parkinson´s to $6.6 billion, according to pharmaceutical data provider Citeline.Despite their potential against Alzheimer's, early research has yielded mixed results, cautioned Hannah Churchill, research communications manager at the Alzheimer's Society.\"It's definitely worth pursuing, but it's difficult to know whether this is a front-runner at this stage,\" she said.EYE ON NOVONovo in 2021 began two trials testing semaglutide - also sold for weight loss as Wegovy - in thousands of patients with early Alzheimer´s. Results are expected by 2025 as it takes years to show an effect on the progressive condition.The Danish drugmaker declined to be interviewed for this story.\"Everyone is waiting to see what that might show. Investors want somebody else to first take the risk in Alzheimer´s, like Novo,\" said Ted Dawson, professor of neurology at John Hopkins University and co-founder of Neuraly, which has an experimental GLP-1 drug.Lilly told Reuters it is watching that trial closely. Pfizer , which has experimental GLP-1s, also has its eye on Novo.Smaller companies, including U.S.-based Neuraly and Denmark-based Kariya Pharmaceuticals, said they are evaluating experimental GLP-1 drugs against Parkinson´s and could consider moving onto Alzheimer´s should the Novo trial bear fruit.",
        "Parkinson's trials tend to take less time and may require fewer patients because it's easier to assess the impact on motor function characteristics of the disease to understand whether the treatments benefit the brain.Wassilios Meissner, head of the department of neurology for neurodegenerative diseases at University Hospital Bordeaux, is involved in a mid-stage Parkinson's trial testing Sanofi's GLP-1 lixisenatide.Meissner said postmortem research of the brains of both Alzheimer's and Parkinson's patients shows insulin signalling is impaired.\"That means that these pathways that provide support to the brain are dysfunctional,\" he said. \"So people have started questioning whether there might be an interest for anti-diabetics for the treatment of these disorders.\"(Reporting by Natalie Grover in London; Additional reporting by Mike Erman in New York and Deena Beasley in Los Angeles; Editing by Caroline Humer and Bill Berkrot)"
    ]
}