{
    "articleURL": "/news/article-12046391/Puberty-Blues-author-Gabrielle-Carey-suddenly-dies-aged-64.html",
    "content": [
        "Gabrielle Carey dies suddenly She co-authored Puberty Blues Gabrielle Carey, the writer who co-authored the iconic Australian novel Puberty Blues, has died. ",
        "She was 64, and there are no suspicious circumstances surrounding her death.Carey, along with Kathy Lette, wrote Puberty Blues in 1979 and it was the pair's first published book. The book sparked controversy for its candid descriptions of teenage life in suburban southern Sydney at the time. A film based on the coming-of-age novel was released in 1981 and television series began airing in 2012.",
        "Carey met Kathy Lette at the age of 12 while still at school and they became best friends. Both left school early against the wishes of their families and shared a flat together where they wrote Puberty Blues, which was based on the teenage surfing culture in Sydney's Sutherland Shire.Carey and Lette also wrote a newspaper column called the Salami Sisters in the 1980s and were known for their frank commentary. In recent years, Carey had become a leading expert on the author James Joyce, as well as the host of Bloomsday events, which celebrate Joyce's classic work, Ulysses. She was writing a book about Joyce when she died.Carey, who was born in Sydney, was a regular contributor to The Australian, among other publications.She also wrote recently about the suicide of her father, Alex Carey. In an article in the The Sydney Morning Herald in December, she noted he had died on the day he turned 64 - the same age as her passing. ",
        "'I became terrified of that number,' she wrote. 'If I have inherited my father's disposition for depression, did that mean I would also end up in an early grave?'",
        "In a statement, Lette said: 'I'm deeply saddened by this tragic news. I have such happy memories of our teenage years. They were halcyon, heady days full of love, laughter and adventure.' 'We made some mischief and broke some barriers by writing \"Puberty Blues\" – our raw, earthy take on the brutal treatment of young women in the Australian surfing scene which is sadly, still so relevant. My heartfelt condolences to her family and friends,' she said. The Australian's chief literary critic, Geordie Williamson, said: 'Gabrielle was the very model of a committed writer'.'She could have coasted on the early success of Puberty Blues, which she co-authored with Kathy Lette, but chose to become an expatriate (at least for a time) and to write very different books after her debut,' he said. Carey wrote an autobiographical book, Just Us, detailing her going to Parramatta Jail as a young woman and falling in love with Terry Haley, who was serving 27 years for abduction and rape.She married him in jail and a film version of the book was made in 1986.",
        "She wrote a second memoir, Waiting Room, about her mother, Joan, who died of cancer in 2009.Carey's family memoir Moving Among Strangers was co-winner of the 2014 Prime Minister's Literary Award for non-fiction.Her 2020 book, Only Happiness Here, was shortlisted for the prestigious 2021 Nib Literary Award.She is survived by her two children, Bridgette and Jimmy.  "
    ]
}