{
    "articleURL": "/sport/football/article-12050657/CRAIG-HOPE-Newcastles-Mike-Ashley-gloom-replaced-sail-Champions-League.html",
    "content": [
        "Newcastle are closing in on securing a brilliant return to the Champions League The gloom under Mike Ashley has been replaced by noise, colour and optimism For their fans it is passports and air fares on top of train tickets for them nowIt is like the most ferocious tide, washed in from the Central Station and up the hill to St James’ Park, crashing through the back alleys and sweeping all along with it, sucked from the pubs and clubs, a bulging sea of black and white ferried gleefully on a wave of anticipation.",
        "The only folk leaving town on this sunny Sunday morning are the stags and hens. For the rest, the party has just begun. They flow from the platforms of train and Metro, the out of towners and the locals, united here by destination. The Match.Nineteen months ago, the tide trickled in and trickled out. The volume was the same, the verve less so. There was a stench of sewage, too. That was the football club, Newcastle Dis-United. Now, the river breeze carries only song and a whiff of success.At Greggs, the queue looks like a pantomime zebra, invading Neville Street and splitting the pubs that flank this bastion of Geordie cuisine. The Toon Army march on a full stomach, be that Brown Ale or steak and ale.There is a long row of station cabs, engines boiling over, much like their drivers’ patience. They are redundant on matchday, for the main attraction rests within the city walls. Think Wembley dropped on Trafalgar Square.",
        "Just around the corner, at the Dog &amp; Parrot pub - one of 108 within a half-mile radius of St James’ - a fan, his face flush to the window, rattles his tattooed knuckles on the pane. ‘Any chance of opening up, Malcolm?’. His plea penetrates the glass. Newcastle legend Malcolm Macdonald smiles and shrugs his shoulders. He is here to talk football, not pull pints. They used to have a comedian on, until they stopped showing the former manager’s post-match interviews.",
        "It is 11.50am. Come noon, the punters flood in. ‘You can smell it, feel it, it’s like chalk and cheese,’ says Supermac, comparing then and now. Then, of course, was pre takeover, pre Eddie Howe, pre third position in the Premier League.There is, rightly, debate and dispute about the identity of the new majority owners - Saudi Arabia’s Public Investment Fund - but in the isolation of this city, and the sporting story at the heart of it, division belongs in the past.Outside the Gallowgate End and opposite Shearer’s Bar - where a dad and his lads walk by, the boys draped in flags of Brazil and Paraguay - volunteers from the Newcastle United Fans Food Bank shake their buckets. The notes cushion the clangour of coins.‘The difference between Newcastle United pre and post takeover can be defined by two words - the response,’ says volunteer Bill Corcoran. ‘When the takeover happened, it made everyone feel like someone else had confidence in them as people. We have reaped the benefit and are getting donations just short of double what we did before (£3,500 on this day).‘That is not because people are more generous, but because there is hope, inspired by the club and the team. We are riding a wave. This is a celebration of community, family, solidarity. The difference is night and day.’",
        "Black and white, you might say.Saturday afternoon, 24 hours before kick-off. In the old police cells beneath the Gallowgate, volunteers from Wor Flags are wrestling with a surfer flag, 255 feet in length. They need to move it to the opposite end of the ground. It is heavy.Earlier, they spoke to the Swedish Magpies, a group 50-strong and here for the weekend. They have some smaller flags they’d like to add to the display. But where are they now? Some Nordic muscle would be most welcome. A text message is sent. They are, by chance, 100 yards away in the Newcastle shrine that is The Strawberry, full of beer and no less cheer.",
        "‘To see their faces when they came into the stadium to help us was quite something,’ says Thomas Concannon. ‘They were absolute gents, and we couldn’t have carried that flag without them.’The story of Wor Flags has unfurled just as quickly as that of their Champions League-bound team. They are, together, changing matchday traditions. Come 2.55pm, the clatter of turnstiles fades. Everyone has long taken to their seat. They are not just spectators, they are participants. The pre-match entertainment is self-generated, a sensory overload of noise and colour - flags whipped, lungs emptied, a stadium illuminated. No want for a trashy lights-show here.",
        "While the ritual has become as harmonised as Howe’s side, a labour of love is needed for it to chime. Two days prior to every home game and often amid darkness, Concannon and his fellow volunteers enter St James’ like black ops specialists. They know their job and execute it assiduously, making first for their store cupboard at the Strawberry Corner, a flag-bearer’s survival stash of tape, scissors, sewing machine, poles and printer. Floodlights flicked to on, they buzz like moths between rows and aisles, stairwells and tiers.For all we marvel at the sight and sound of a full stadium, there is nothing more atmospheric than an empty one, especially when the ghosts of yesteryear are still to be laid to rest.",
        "‘I’ve helped to arrange scores of our displays, and I still get the shivers,’ says Concannon. ‘It’s like, “Wow, we’re in here alone”. Often, when we finish, we just sit in the stands and reminisce, goals, games, players, looking out at the empty pitch and all around us. It is an honour, really.’Co-owner Mehrdad Ghodoussi has been particularly supportive and there is a mutual trust that affords access whenever needed. The club recognise the energy that spills from the stands and onto the pitch.On Sunday, against Arsenal, fans have been asked to bring their own scarves. The likes of Alan Shearer know the routine by now, whirl them as fast as you can above your head as the teams emerge. For the players, it will be like staring down a black-and-white kaleidoscope.",
        "‘When it comes to big games like this, we have proved that flags and scarves have a huge impact, it ignites something inside people,’ says Concannon. ‘But we can’t do this without the fans. They support it. They fund it. We want that to continue. Imagine European nights next season… we can show the world what is happening here.’A change of pace. Just off Low Moor Road in Langley Park, County Durham, there is a cemetery. Beneath hills that roll to the landscape’s extreme, its peaceful surrounds are far removed from the beating pulse of St James’. Here forever rests Sir Bobby Robson, in the village in which he was raised.There are few words on his headstone - ‘In Loving Memory of Sir Bobby Robson, 1933-2008. Rest in Peace’ - but in life he spoke many more, and those about his spiritual home are worth revisiting.",
        "Answering his own question - What is a club in any case? - Robson, the boyhood Newcastle fan, wrote: ‘It’s not the buildings or the directors or the people who are paid to represent it. It’s the noise, the passion, the feeling of belonging, the pride in your city. It’s a small boy clambering up stadium steps for the very first time, gripping his father’s hand, gawping at that hallowed stretch of turf beneath him and, without being able to do a thing about it, falling in love.’",
        "Back at St James’ and approaching kick-off, the Swedes have gathered for a picture at the feet of Robson’s statue. When told that compatriot Alexander Isak starts, they high-five one another as well as the natives - Gothenburg meets Gosforth.There are Dutch fans, too. While tourism is central to Newcastle’s growth - not to mention the city’s economy - the club must also protect the child Robson spoke about.Two of those boys, cousins Harry, 12, and Jake, eight, are outside The Strawberry. They are with Rob Nicholson, 36 - Jake’s dad and Harry’s uncle – and their Granddad Stephen, 66. The family are roaring down our camera lens. Confident?‘The boys are,’ says Rob. ‘They think we win every week. I’m conditioned a different way.’By the 21st minute of today’s game versus Tottenham, they would have celebrated five goals. The boys were right. The Match ends 6-1. Now for the Night Out.",
        "Five minutes back down the hill and at the truly vivacious WonderBar - where London Zoo meets The Hacienda - the pantomime zebra is back, and this time it’s dancing on the tables. Mad Mick Edmondson, the DJ, has it on strings. Every Newcastle player has his own song - from Abba’s ‘Gimme, Gimme, Gimme a striker from Sweden’ to Ultrabeat’s ‘You’ll never ever beat Dan Burn’. The latter originated here.Matt Le Tissier called in recently and was sporting enough to jump on stage. ‘You’re just a s*** Alan Shearer’ returned the crowd by way of thanks. It is no surprise takings have soared, as fans fill up on shots and empty their pockets.Mad Mick, 57, says: ‘I’ve done pre-match in this town since 1994, and it’s always been mental, even when we were getting beat every week. But it’s different now. They are queuing three hours before kick-off to get in.‘Matchday here is like nothing else in the world. It’s like a carnival. You have your breakfast and a couple of pints and it builds slowly. The pubs then spill out and everyone is swept towards the ground. We are filled with hope, excitement. We’re not desperate for a trophy, it’s the competing that counts. This is like a dream you never want to end.’As the pumps run dry and a city prepares for sleep, its people finally stream back through the estuaries from which they journeyed. They will need more than train tickets next season. It is passports and air fares for them now."
    ]
}