{
    "articleURL": "/health/article-12060391/Experts-reveal-new-link-gas-stoves-asthma.html",
    "content": [
        " READ MORE: Has Covid created a generation of germaphobesYou’d be hard-pressed to find someone who didn’t know that air pollution is bad for health — as a report by England’s Chief Medical Officer, Chris Whitty, recently pointed out, it kills up to 36,000 Britons every year.",
        "However, once we’re home and have closed the door and windows to this outside harm, we tend to think we can relax and breathe easy, away from these toxic fumes.But not so: there’s plenty of air pollution indoors, and it can also be lethal, with research suggesting even our gas cookers are a health hazard, as a major cause of asthma.If this surprises you — as it did me — how worried should we be about such findings, and should we be trying to switch to electricity?Not so long ago I treated a young man who’d come to A&amp;E with chronic headaches, nausea and feeling weak. He and his GP had put it down to stress and loneliness; stress from his new job and loneliness from working from home.",
        "On the face of it, his self-diagnosis made sense — except for the additional symptoms that sent him to A&amp;E. Over the previous couple of days he had become confused and forgetful. These are not signs of stress.And then he told me about his brother who stayed with him at weekends and who would get a headache each time — only for it to disappear when he went away during the week.This was the clue that gave away the diagnosis in an instant: and indeed, when I checked the patient’s levels of carboxyhaemoglobin, they were raised. He had carbon monoxide poisoning.",
        "The treatment was simple: we immediately gave him oxygen — and crucially, we advised him to get his gas boiler serviced or replaced, and to prevent future problems he needed a carbon monoxide monitor.If this 20-something hadn’t come to us then, he might have died within days. Nor is his an isolated case. A review in last month’s BMJ Best Practice reported this indoor lethal air pollutant claimed the lives of 43 people in the UK in 2021 — many of these deaths preventable with regular boiler checks and a carbon monoxide monitor costing less than £20.Less instantly lethal, but harmful nonetheless, other indoor air polluters include wood burners (even ‘eco-design’ burners produce 450 times more toxic particles than central heating) and candles (perfumed candles release chemicals that can trigger asthma).",
        "Since learning this, I’ve ditched the lime and bay candles we used to burn at home.But indoor air pollution also comes from other sources that we can’t really avoid, such as cooking.A study in 2019 by the University of Colorado in the U.S. found that cooking a Sunday roast can create as much pollution inside the house as is found in the air of the dirtiest of cities around the world.Frying and roasting are particularly bad — they release loads of tiny particles (‘particulate matter’) that can get deep into the blood vessels and lungs.",
        "The fuel we use to cook matters, too. Cooking with gas stoves produces nitrogen dioxide as well as releasing particulate matter, and both can induce asthma attacks — even if the cooker is turned off because of the slow leakage of gas.A study recently published in the International Journal of Environmental Research and Public Health estimated that a surprisingly high number — nearly 13 per cent — of cases of childhood asthma in the U.S. were attributable to the use of gas cookers.The researchers calculated this based on studies that showed higher rates of asthma in households that used gas cookers compared with electric stoves.The data on increased risks came from a meta-analysis — combining a number of studies; these were all observational, where you look at two factors — a potential cause (i.e. having a gas cooker) and a potential impact (i.e. developing asthma).While this means we cannot be 100 per cent sure that the gas cooker is the cause of the increased risk of asthma, it is nevertheless a credible proxy.Because to completely prove that gas is the cause, you would need to do a study where you randomly allocate children to living in houses with gas or electric cookers and then compare asthma rates — and for obvious reasons, this would be unethical.",
        "Observational data is often not thought of as ‘good science’ compared with controlled trials, but that does not mean it should be discounted.For example, the evidence linking smoking to cancer comes from observational studies.In my view, the indoor air pollution study is robust and because of how common asthma is, I’ve decided to change my gas stove to a new induction hub.I’m lucky, though; I can afford it, but many others can’t.Changes to VAT rates to encourage people to buy non-gas cookers would help, as would legislation that meant those who are renting have induction electric cookers in their kitchens as standard.The bigger point is that we need to accept that our home could be a source of indoor pollution and do what we can to reduce it.First, make sure you have a carbon monoxide monitor and if you have a gas boiler, get it serviced every year.And however calming a wood burner might appear, resist the temptation to buy one.Also, avoid burning candles indoors, and when you cook, use an extractor fan — and think about steaming rather than frying or roasting.All this advice is even more important if you suffer from a respiratory condition such as emphysema or asthma.But perhaps the best thing we can all do is to go against what we naturally do: don’t close the windows to keep pollution out — open them and let the fresh air in!",
        "Professor Galloway is on Twitter @drrobgallowayMathematicians at Sussex University have come up with the formula for how to reach sexual climax.They analysed data from different stages of the male arousal cycle in 10,000 people and found that too much psychological arousal early in the process can inhibit the chance of reaching climax.‘Simply put, our findings can be summarised as “don’t overthink it”,’ the researchers said. It could have applications for the treatment of sexual dysfunction.Measles surge is a real worryI read with alarm last week about the surge in measles cases — new data shows that, while in 2022 there was a total of 54 cases of measles over the whole year, in just the first four months of 2023 there were 49.If this rate continues, it would mean there will be 147 cases this year — triple the number of last year. And behind the headlines stands one stark truth: parents believing false information and failing to give their child the MMR jab are squarely to blame.",
        "‘So what?’ many will say: measles just causes a fever, cough, runny nose and watery eyes. That’s true for most children, but many others will be left with significant complications, including blindness.I was a junior doctor in 1998 when Andrew Wakefield published a now discredited article in The Lancet, which concluded utterly incorrectly that the measles, mumps and rubella (MMR) jab was linked to autism.",
        "I saw first-hand the impact of that false research. I was on a night shift when a very young boy was brought in to A&amp;E. He was very ill with measles — his mother had believed Wakefield’s claims and had chosen not to get her son vaccinated with the MMR.The three-year-old was admitted to intensive care, and I will never forget his mum’s face when I told her it was touch and go whether he would survive. He only just did, and was left badly brain damaged.According to the World Health Organization, 142,000 people died worldwide from measles in 2018. What’s so sad is that it’s preventable, yet because of lower immunisation rates, we are at risk of seeing an escalating toll.Currently, only 85 per cent of children in the UK get both MMR jabs, but because measles is so infectious, it needs to be 95 per cent. You need to have enough children immunised to create herd immunity, where the virus cannot spread across the population and so it slowly dies out.Without herd immunity, measles starts to spread and, as well as harming the children whose parents choose not to get them immunised, it affects those who may not be able to have the vaccination. This includes children undergoing chemotherapy and, if a child having cancer treatment gets measles, the impact can be devastating.So why is the MMR vaccine uptake now low? Partly, it’s vaccination fatigue, post-Covid; I suspect the Covid anti-vaxxer movement has also given a fillip to the anti-jab movement generally. But the MMR vaccine is safe and effective, and there are many years of data to prove this.But I also think people just don’t understand what a terrible impact measles can have. So please, to stop your child — as well as children who are suffering from cancer and can’t be vaccinated — coming to harm, ensure your little one has the MMR vaccine."
    ]
}