{
    "articleURL": "/sport/football/article-12046499/Tottenham-confirm-national-anthem-plans-coronation-Liverpool-undecided.html",
    "content": [
        "Tottenham have confirmed how they will mark the coronation of King Charles Liverpool are undecided with concerns fans will boo the national anthemFans have previously booed the anthem including at last year's FA Cup finalTottenham have confirmed their plans ahead of King Charles' coronation, though Liverpool are yet to make an announcement over whether they will play the national anthem. ",
        "The Premier League have asked clubs to play God Save The King before matches this weekend to mark the coronation on Saturday. Tottenham have confirmed they will adhere to the Premier League's request before their 3pm clash with Crystal Palace on Saturday.  However, Liverpool have not yet confirmed whether they will do the same before they host Brentford at 5.30pm later that day. There are fears that Liverpool fans could boo the national anthem, and during their 1-0 win over Fulham on Wednesday, supporters could be heard chanting: 'You can stick the coronation up your a***.'",
        "Sections of Liverpool’s support have booed the anthem in recent years, most notably at Wembley before the FA Cup final last May, when Prince William was guest of honour. However a minute's silence held at Anfield to mark the death of Queen Elizabeth II was generally well observed.This leaves Liverpool officials in a difficult position as should they decide not to play the anthem they risk criticism, although if they do and the booing is repeated then they may also face condemnation.As previously reported, asked if he had an opinion on the subject, Liverpool boss Jurgen Klopp said: ‘No, that’s a club decision. I am the German guy in the club, so what should I say about that?’",
        "'That would be really great. If my opinion would count even, it’s nothing to do with me.'Tottenham on their official website revealed that they will mark the occasion by showing the live televised coronation on a big screen located on Park Lane Square, outside the South Stand, from 11am.",
        "The Square will be open to all fans attending Saturday’s match, including those with seats in other areas of the stadium. Their match programme will also include a feature about the club's participation in the Coronation Cup in Glasgow to mark the throne of Queen Elizabeth II in 1953.  The King’s coronation will take place on Saturday, May 6 between 11am and 1pm, meaning there is no Saturday lunchtime match to avoid a clash.  As Mail Sport exclusively revealed, clubs will also be provided with an official portrait of the King and The Queen Consort and the Coronation Logo to be displayed on big screens while the anthem is sounded. Announcements over the PA system are suggested to be made, while an article in the programme on the Coronation has also been proposed. Images and emblems will be sent to clubs to use on their digital and social channels.It is understood that most will play the anthem, although what happens at Anfield, where large sections of the fanbase have a long-held anti-establishment stance, remains to be seen."
    ]
}