{
    "articleURL": "/wires/ap/article-12058829/Turkeys-opposition-denounces-fairness-vote-Erdogan.html",
    "content": [
        "ISTANBUL (AP) - As Turkey heads for presidential and parliamentary elections at the weekend that are shaping up to be the strongest challenge to President Recep Tayyip Erdogan in his 20 years as leader, complaints are growing about the fairness of the vote.",
        "Turkey´s opposition has long said that the country´s elections are played out on an unequal playing field, claims often backed by international observers.Media coverage stands out as the most obvious example of where Erdogan enjoys an advantage over his opponents, but factors such as the use of state resources while campaigning and the questionable interpretation of electoral law also feature.Some 90% of Turkey´s media is in the hands of the government or its backers, according to Reporters Without Borders, ensuring overwhelming airtime for the president. Only a handful of opposition newspapers remain in print, most having transitioned to online-only editions.During April, Erdogan received nearly 33 hours of airtime on the main state-run TV station, according to opposition members of the broadcasting watchdog. His presidential opponent, Kemal Kilicdaroglu, received 32 minutes.The main opposition party, the Republican People´s Party, or CHP, last month launched legal action against broadcaster TRT for failing to screen its campaign video.",
        "\"Unfortunately, the Turkish Radio and Television Corporation has moved away from being an impartial and objective institution and has turned into the Tayyip Radio and Television Corporation,\" CHP lawmaker Tuncay Ozkan said.The remaining independent media also face increasing restrictions. Last month, broadcasting authority RTUK fined independent channels Fox News, Halk TV and TELE1 over news and commentary deemed a breach of regulations. Ilhan Tasci, an opposition-appointed RTUK member, said in all three cases the stations had been accused of criticizing or questioning the actions of the ruling party.",
        "In a statement following the last presidential and general elections in 2018, observers from the Organization for Security and Cooperation in Europe noted that Erdogan and his ruling Justice and Development Party (AKP) enjoyed \"an undue advantage, including in excessive coverage by government-affiliated public and private media outlets.\"The government´s reach has also been extended over social media, where many opposition voices have retreated.A \"disinformation\" law introduced in October allows a jail sentence of up to three years for spreading false information \"with the sole aim of creating anxiety, fear or panic among the public.\"Sinan Aygul, the only journalist to be prosecuted under the new law, was handed a 10-month prison term in February. He is currently free while appealing the case.\"The real aim is to silence all dissident voices in society,\" said Aygul, chair of the journalists association in Bitlis, southeastern Turkey. It is \"a law that targets anyone who expresses an opinion. It targets not only individuals but also media organs,\" he said.The ill-defined law criminalizes \"basic journalistic activities,\" Aygul said, adding that it could be used during the elections to target groups seeking to protect ballot box security who use social media to highlight abuses.\"If there is going to be fraud in the election, all opposition channels will be silenced by using this law,\" he said.",
        "The imposition of a state of emergency over the 11 provinces hit by February´s earthquake has also raised concerns about how the polls will be conducted in the region. A U.N. report published April 11 said at least 3 million people had relocated from their homes in the quake zone, many of them heading to other parts of Turkey.However, just 133,000 people from the earthquake region have registered to vote outside their home provinces, the head of the Supreme Election Council said last month. Ahmet Yener added that election officials were overseeing preparations, including polling stations at temporary shelters.In 2018, a nationwide state of emergency imposed following a 2016 coup attempt was in place until shortly before the election, which the OSCE said restricted the media and freedoms of assembly and expression.Erdogan has stepped up his public appearances, which are closely followed by most TV channels, and uses these official duties to attack his rivals. At a ceremony on the Friday of Eid al-Fitr last month to mark renovations to Istanbul´s Blue Mosque, he accused the opposition of \"working with terrorist groups.\"The previous evening, the leaders of four political parties allied to the AKP were present for an event to launch the delivery of Black Sea natural gas, despite none holding any government position.",
        "Other large projects that were rolled out ahead of the vote include Turkey´s first nuclear power reactor built by Rosatom, the Russian state nuclear energy company, and several defense developments.Critics also point to the bending of election law to allow government ministers to stand as parliamentary candidates while remaining in office, despite legal requirements to the contrary.The election board, meanwhile, has previously faced criticism for siding with AKP objections during elections.In the 2019 local polls, the victorious opposition mayoral candidate for Istanbul was forced to face a rerun following AKP complaints of ballot irregularities. Results from district and city council votes, which were collected in the same boxes and favored the AKP, were not questioned.Adem Sozuer of Istanbul University´s law faculty told the opposition Cumhuriyet newspaper that voters had lost confidence in the election authorities. \"There is widespread suspicion in a significant part of society that elections will be rigged,\" he said."
    ]
}