{
    "articleURL": "/wires/reuters/article-12053081/Georgia-fake-elector-defendants-accept-immunity-Trump-probe-lawyer.html",
    "content": [
        "May 5 (Reuters) - Prosecutors for Georgia's Fulton County have granted immunity to at least eight people under investigation for conspiring to overturn Georgia's vote in the 2020 presidential election, according to a court filing on Friday.",
        "Fulton County District Attorney Fani Willis is expected to disclose this summer whether former President Donald Trump and others will be charged with crimes related to interfering with the 2020 election.Attorney Kimberly Bourroughs Debrow represented 10 of the 16 suspected fake electors who may have offered to cast electoral college votes for Trump even though Democrat Joe Biden won Georgia and the right to all of the state's 16 electoral college votes.Debrow said in a court filing on Friday that prosecutors \"made actual, written offers of immunity to these eight electors in April 2023 but not to the remaining two.\" That led to the non-immunized clients getting new lawyers, Debrow said in the filing.Also in the filing, Debrow said, \"All eight of the electors who were offered immunity accepted.\"With immunity, those eight would be free to testify against any defendants.A spokesperson for Willis did not immediately respond to a request for comment.Willis' probe began soon after a recorded January 2021 phone call in which Trump asked Georgia's top election official to \"find\" the votes to reverse Biden's victory.Trump, who is seeking the 2024 Republican presidential nomination, has denied wrongdoing and accused Willis, an elected Democrat, of targeting him for political gain.Trump became the first former U.S. president to face criminal charges when New York prosecutors indicted him on March 30 for allegedly falsifying business records related to hush money payments made to a porn star who claimed to have had an affair with him.",
        "He faces other investigations, including a pair of U.S. Justice Department probes into his handling of classified materials after leaving the White House and his efforts to alter 2020 election results. (Reporting by Daniel Trotta; Editing by Leslie Adler)"
    ]
}