{
    "articleURL": "/tvshowbiz/article-12049569/Vanderpump-Rules-reality-star-Lala-Kent-BACKS-MTV-Movie-TV-Awards.html",
    "content": [
        "The film and television writers walking picket lines in Los Angeles and New York have found a new ally in Vanderpump Rules star Lala Kent.",
        "The 32-year-old reality star - who was previously engaged to film producer Randall Emmett - revealed to The Hollywood Reporter on Thursday that she was backing out of attending the 2023 MTV Movie &amp; TV Awards airing on Sunday.Kent's series Vanderpump Rules is nominated for Best Docu-Reality Show and Best Reality On-Screen Team, which she herself is nominated for alongside the show's Ariana Madix, Katie Maloney and Scheana Shay, and Kent was also previously announced as a presenter.The news comes just hours after host Drew Barrymore also bowed out to show support for writers, with the show still moving forward as planned, though sans host.After Barrymore's departure, Kent is the first star to back out of the show, though it remains to be seen how many others will follow.",
        "'I am so honored to be nominated this year and thankful to all my fans who have been voting but I have decided to stay home in support of the many hard working writers who deserve to be compensated fairly,' Kent said in a statement to THR.'Although Vanderpump Rules falls under the unscripted sector of TV, that is not an excuse for me to remain silent and carry on as if there isn’t so much at stake for every writer and their families,' she added.",
        "'We have to protect our creators and I hope you’ll stand with me and many others as we do so until we reach a resolution (hopefully very soon),' Kent concluded.Kent was announced as a presenter alongside her fellow Best Reality On-Scream Team nominees Ariana Madix, Katie Maloney and Scheana Shay, though it's unclear if her co-stars will present without her.Barrymore issued a statement of her own in bowing out of her hosting gig, revealing she plans on returning to host in 2024.'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' Barrymore said. 'Everything we celebrate and honor about movies and television is born out of their creation,' Barrymore added.'And until a solution is reached, I am choosing to wait but I’ll be watching from home and hope you will join me,' she concluded.",
        "Other presenters include Transformers: Rise of the Beasts stars Anthony Ramos and Dominique Fishback, Yellowjackets stars Courtney Eaton, Jasmin Savoy Brown, Liv Hewson, Samantha Hanratty, Sophie Nélisse, and Sophie Thatcher and Joy Ride stars Ashley Park, Sabrina Wu, Sherry Cola, and Stephanie Hsu.They will be joined by Bottoms stars Ayo Edebiri, Havana Rose Liu, Kaia Gerber, and Rachel Sennott, Daisy Jones &amp; The Six stars Camila Morrone, Riley Keough, Sam Claflin, and Suki Waterhouse, The Little Mermaid's Halle Bailey and Jonah Hauer-King, Selling Sunset's Chelsea Lazkani and Chrishell Stause and The Summer I Turned Pretty's Christopher Briney, Gavin Casalegno, and Lola Tung.",
        "Haunted Mansion stars Tiffany Haddish and Jamie Lee Curtis will also present along with Busta Rhymes, Dave Burd, a.k.a. 'Lil Dicky,' Gal Gadot, Nick Viall, and Wolf Pack's Rodrigo Santoro and Sarah Michelle Gellar.The 2023 MTV Movie &amp; TV Awards air live on May 7 at 8 PM ET/PT from Barker Hangar in Santa Monica, California."
    ]
}