{
    "articleURL": "/wires/reuters/article-12043695/No-evidence-Ed-Sheeran-copied-Lets-Get-It-On-jury-told.html",
    "content": [
        "By Brendan Pierson",
        "NEW YORK, May 3 (Reuters) - British singer-songwriter Ed Sheeran's lawyer on Wednesday urged jurors to reject a lawsuit accusing Sheeran of copying Marvin Gaye's classic \"Let's Get it On,\" calling the copyright infringement case involving the hit song \"Thinking Out Loud\" an attempt to claim ownership over basic elements of music.Ilene Farkas, in her closing argument in Manhattan federal court, said there was \"not a single shred of evidence\" to contradict testimony by Sheeran and his co-writer Amy Wadge, who told jurors they wrote \"Thinking Out Loud\" based on their own experiences and drew musical inspiration from singer Van Morrison.\"They independently created 'Thinking Out Loud,'\" Farkas said.Heirs of Gaye's co-writer, Ed Townsend, in 2017 sued Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing, claiming infringement of their copyright interest in the Gaye song.The plaintiffs pointed to similar chord progressions and rhythm in the two songs. Farkas told the jury that these were \"basic musical building blocks\" that no one owns. She said an expert witness for the heirs tried to mislead the jury by arguing that the melodies of the two songs were similar.\"You could hear with your own ears how these melodies sound when played,\" Farkas said. \"They're not remotely similar.\"",
        "A lawyer for the heirs was expected to give a closing argument to the jury later in the afternoon.Gaye, who died in 1984, collaborated with Townsend, who died in 2003, to write \"Let's Get It On,\" which topped the Billboard charts in 1973. \"Thinking Out Loud\" peaked at No. 2 on the Billboard Hot 100 in 2015.Sheeran is also facing claims over \"Thinking Out Loud\" in the same court from a company owned by investment banker David Pullman that holds copyright interests in the Gaye song.Sheeran won a trial in London last year in a separate copyright case over his hit \"Shape of You.\"Gaye's heirs in 2015 won a lawsuit claiming the Robin Thicke and Pharrell Williams song \"Blurred Lines\" copied Gaye's \"Got to Give It Up.\"(Reporting by Brendan Pierson in New York; Editing by Will Dunham and David Bario)"
    ]
}