{
    "articleURL": "/wires/aap/article-12039781/Delays-add-two-years-Snowy-Hydro-2-0-build.html",
    "content": [
        "The head of Snowy Hydro 2.0 admits the energy project will be delayed by up to two years.",
        "Chief executive Dennis Barnes says issues with tunnelling machines, the increasing cost of materials and lingering effects of the COVID-19 pandemic mean work won't be finished until almost the end of the decade.The cost blowout for the multibillion-dollar undertaking is still being worked out.\"A combination of factors have meant it's pretty clear the schedule will go out by between one and two years,\" Mr Barnes told ABC Radio on Wednesday.\"Over the next few months, we'll work through what the cost implications are.\"Snowy Hydro 2.0, which was due to be operational by late 2026, will connect two dams in southern NSW via almost 30km of tunnels and a new underground power station.The project will operate as a natural battery by using excess wind and solar energy to pump water uphill before releasing it during peak periods to provide power to the national electricity grid.It was estimated last year to be as much as $2 billion over budget.Energy Minister Chris Bowen said Snowy Hydro was not alone in encountering construction delays due to COVID-related issues.\"There are supply chain consequences for every construction project across the world at the moment from the overhang from the ... pandemic but I support Snowy being open and transparent with us,\" he said.",
        "\"We have to bring the Australian people with us on this journey and that means being open and transparent about the challenges as well as the opportunities and we'll continue to do that.\"Mr Barnes said the tunnelling machines had only completed one per cent of their work since digging started in November.Delays were caused once they hit softer rock, causing them to be trapped, but they should be running again in \"weeks, not months\".\"We weren't expecting that soft ground. So the effort we've been applying over the last few months is to harden that ground to move the tunnel boring machine forward,\" he said.\"These machines are huge pieces of equipment which we obviously have to be very mindful of safety when we moved them forward.\"Earlier this year, the energy market operator flagged a one-year delay on Snowy Hydro, advising completion would be pushed back until December 2027.Opposition energy spokesman Ted O'Brien said the delays would lead to further issues, warning Snowy Hydro would not be ready to meet gaps in the energy market caused by power station closures.\"The Albanese Labor government has created an energy vacuum in Australia, with baseload power stations being ripped out of the grid without a replacement ready to go,\" he said",
        "\"Australia's energy reliability is under siege with rolling delays and blowouts under Labor including the all-important 660 megawatt Kurri Kurri gas plant which will not provide power for a year later than scheduled in 2024.\"Greens leader Adam Bandt said issues surrounding Snowy Hydro 2.0 needed to be examined.\"We need the government to take the lead in the energy transformation. That includes a big build of not only new renewables generation but also a new transmission,\" he told ABC Radio.\"There's significant problems with some instructions (Snowy Hydro) got from the last government that haven't been fully addressed by this government.\""
    ]
}