{
    "articleURL": "/sport/football/article-12060059/Swansea-3-2-West-Brom-Baggies-miss-play-spot-Joel-Piroe-nets-gasp-winner.html",
    "content": [
        "Albion started the final day in eighth with slims hopes of the play-offs with a winOkay Yokuslu and Semi Ajayi twice gave them the lead in South WalesLuke Cundle and Olivier Ntcham equalised before Joel Piroe's late free-kickFour minutes of play-off euphoria was all West Brom fans were able to savour as their promotion dream died in south Wales.",
        "For a very brief window midway through the first-half, the Baggies moved into sixth place in the table but their own defensive frailties, and the efforts of Millwall and Sunderland, meant the fantasy did not last long.It was finally extinguished for good when Swansea's Dutch striker Joel Piroe struck a magnificent low free-kick into the far corner for the injury time winner.It was Piroe's 20th goal of the season in all competitions and 19th in the Championship.The result meant Swansea ended the campaign in tenth position after an impressive last surge of seven wins and two draws in nine matches.",
        "West Brom were left hanging one place above them in ninth, three points short of sixth place and the play-offs.The odds were always stacked against West Brom, who needed a victory and for both Millwall and Sunderland to stumble.Okay Ykouslu gave the visitors their moment to cherish when he put West Brom ahead after a mistake by Olivier Ntcham - and before Millwall let Blackburn get on level terms at 1-1.But Luke Cundle - Swansea's loaned midfielder from West Brom's bitter rivals Wolves - levelled things up for the Swans before the break.Cundle showed a composed finish after linking with Piroe to steer home the equaliser.",
        "Semi Ajayi gave Carlos Corberan's team renewed hope with a superb half volley just after half-time to make it 2-1 - reacting quickly in a crowded goalmouth after a corner was not cleared.But once again the news from elsewhere was not in West Brom's favour as Sunderland started their goal surge at Preston.",
        "Swansea (4-1-4-1): Fisher; Latibeaudiere, Cabango, Wood, Manning; Grimes; Cullen (Cooper 61'), Cundle, Ntcham, Paterson (Naughton 73'); PiroeSubs: Darling, Whittaker, Söndergaard, Sorinola, CongreveGoals: Cundle 26, Ntcham 66', Piroe 90+3'Booked: CooperManager: Russell Martin West Brom (4-4-2): Palmer; Furlong, Ajayi, Pieters (Bartley 79'), Townsend; Wallace, Yokuslu (Gardner-Hickman 63'), Molumby, Grant; Swift, Thomas-AsanteSubs: Rogic, Livermore, Malcolm, Griffiths, FaalGoals: Yokuslu 13', Ajayi 54'Booked: Gardner-Hickman, Thomas-AsanteManager: Carlos Corberan ",
        "Still, there was no-one else to blame for West Brom when they allowed Swans' Ntcham the space on the edge of the box to fire home his eighth goal of the season.At 2-2, West Brom needed a winner and a miracle comeback from Preston, but neither materialised.Their own hopes of victory perished when Brandon Thomas-Asante set up John Swift late on, but the former Reading wastefully dragged his shot wide from eight yards out.Then, in the third minute of injury time, Piroe curled a low free-kick past Alex Palmer as a timely reminder of why the Welsh club are desperate to hang onto their most prized asset, who has a year left on his contract."
    ]
}