{
    "articleURL": "/wires/ap/article-12053163/Luis-Robert-Jr-homers-White-Sox-beat-Reds-5-4.html",
    "content": [
        "CINCINNATI (AP) - Luis Robert Jr. and Elvis Andrus homered, helping Lance Lynn and the Chicago White Sox beat the Cincinnati Reds 5-4 on Friday night.",
        "Andrus erased a 3-0 deficit with a three-run shot in the fifth. Robert put the White Sox ahead to stay with a two-run drive against Hunter Greene in the sixth.Lynn (1-4) was charged with four runs and eight hits in 6 2/3 innings. He struck out eight and walked none in his first win since Oct. 2.\"It was a big-time performance for him, and for us a big-time game,\" White Sox manager Pedro Grifol said. \"He's been in the game for a long time. I didn't even have to ask him if he could go back out for the seventh.\"Robert finished with three hits in Chicago's fourth win in five games.Jonathan India hit a solo homer for Cincinnati. Greene (0-2) allowed five runs and seven hits in 5 2/3 innings.",
        "TJ Friedl put the Reds in front with an RBI double in the third, but he was thrown out by right fielder Gavin Sheets when he tried for a triple. Replay overturned the initial safe call as Friedl's hand came off the bag during his slide.Friedl also reached over the wall in right-center to rob Andrew Vaughn of a leadoff homer in the sixth.Cincinnati opened a 3-0 lead on RBI singles by Jake Fraley and Nick Senzel in the fourth. But Greene surrendered Andrus' first homer since Oct. 4.",
        "\"It was a weird, frustrating night,\" Greene said. \"My fastball, even though the velocity was there, it didn´t have the same life in the last two innings.\"Andrus wasn't sure if his towering drive to left was going to reach the seats.\"I knew I barreled it, but I was literally praying to go the extra feet,\" Andrus said. \"It's Cincinnati. That's the good thing about (Great American Ball Park), it helps the hitters a little bit.\"The Reds put the potential tying run on base in the ninth, but Fraley strayed too far off first on Henry Ramos' routine fly to center. resulting in a double play on a throw from Robert.\"Fraley just got over aggressive,\" Reds manager David Bell said. \"He thought it was going to fall I guess. It's good to be aggressive, but he didn't recognize it in time.\"Reynaldo López earned his fourth save for the White Sox, who are trying to rebound from a rough start to the season.\"We had an ugly April, no other way to say it,\" Lynn said. \"I feel like we're playing better in May. We just need to keep going in the same direction.\"BIG STEPWhite Sox closer Liam Hendriks, who is coming back from stage 4 non-Hodgkin lymphoma, began a rehab assignment with Triple-A Charlotte. He pitched a perfect seventh with a strikeout.",
        "Hendriks is expected to make four or five appearances in the minors.\"Looking forward to seeing how he felt, and how he feels,\" Grifol said. \"We'll be waiting here with open arms when he's ready to go.\"TRAINERS ROOMWhite Sox: 3B Yoán Moncada (back) began a rehab assignment with Charlotte as the designated hitter. He's expected to play five innings on Saturday, then increase his innings on Sunday. He will be re-evaluated following an off day on Monday.Reds: OF/1B Wil Myers, who has been on the 10-day IL since April 26 with an undisclosed illness, told reporters he tested positive for COVID-19. Myers has been working out at Great American and could return this weekend.UP NEXTReds left-hander Nick Lodolo (2-1, 6.16 ERA) makes his seventh start. He has never faced any of the White Sox batters. Right-hander Mike Clevinger (1-2, 5.56 ERA) starts for Chicago.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}