{
    "articleURL": "/tvshowbiz/article-12056815/Eurovision-comes-Liverpool-Music-acts-Europe-arrive-grand-welcome-party.html",
    "content": [
        "Contestants for the 67th Eurovision song contest have touched down in Liverpool for the grand welcome party, one week before they take to the stage for the grand final. ",
        "The Turquoise Carpet ceremony opened on Sunday afternoon in the city, which is preparing to host the song contest final next Saturday on behalf of last year's winners Ukraine.Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, the ceremony will see all 37 acts take to the carpet for a welcome to the city.Eurovision fans lined one side of the carpet, waving flags and scarves to support their countries.Norwegian act Alessandra was first to arrive on the carpet, where entrants had their photos taken and were interviewed.",
        "She said: 'I feel so blessed. I feel so nice here. I'm the first one out and that's an honour.'",
        "Conor O'Donohoe, from Irish band Wild Youth, said: 'It's all starting to feel very real. Everyone's getting here now, all the press are here and family are starting to fly in, so it's all starting to kind of really settle in.'The contestants wore their finest for the occasion, with Croatian group Let 3 taking to the carpet in bustled gowns accessorised with military-style peaked hats and facial hair.In scenes reminiscent of 1981 UK Eurovision entry Bucks Fizz, the group whipped off their gowns while having their photos taken to reveal white petticoats and vests.Latvian group Sudden Lights paid homage to Liverpool's most famous music act the Beatles by recreating the outfits worn on the Abbey Road album cover.",
        "The ceremony will be followed by The National Lottery's Big Eurovision Welcome outside St George's Hall.Among the artists set to perform for a crowd of almost 30,000 is band Frankie Goes to Hollywood, who will reunite after their split in 1987.Other acts with a Liverpool connection on the line-up include girl group Atomic Kitten, funk band The Real Thing, and The Lightning Seeds - singers of the football anthem Three Lions.",
        "Former Eurovision winners Conchita Wurst, who represented Austria in 2014, and Ukraine's Jamala, who competed in 2016, are also on the line-up for the gig, presented by AJ Odudu and Joel Dommett.Highlights of the concert will be shown on BBC One on Monday.Eurovision preparations are in full swing in Liverpool, which is hosting the contest instead of Ukraine because of the Russian invasion.The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday.Favourites for the contest include the UK's Mae Muller, France's La Zarra and Spain's Blanca Paloma.Muller has said her training for Eurovision has been 'like bootcamp' as she reflected on the challenges of being an up-and-coming artist in the music industry. ",
        "The 25-year-old singer will represent the UK at the song contest in Liverpool in the grand final on May 13 with her track I Wrote A Song, which features tongue-in-cheek lyrics about a cheating ex-boyfriend and a propulsive dance beat. ",
        "In an interview with The Sunday Times, Muller admitted she is keen to do well in the competition but that it has been 'non-stop for two months', describing it as 'like boot camp'. The London-born singer was confirmed as the UK's Eurovision act in early March and has since been at a number of Eurovision events ahead of the big day including meeting the King and Queen. Muller joined the royal couple when they unveiled the contest's spectacular stage in Liverpool, with Charles telling her: 'We will be watching you with great interest - egging you on.' She also has pressure following in the footsteps of Sam Ryder who came in second place last year with his uplifting pop song Space Man, giving the UK its best result for more than 20 years. His success meant the UK was chosen to host this year's competition on behalf of war-torn Ukraine as it continues to face the Russian invasion. Alongside these pressures, Muller also reflected on how the evolution of the music industry towards streaming and viral moments has added extra strain. ",
        "She told the newspaper: 'My label said not to rush. I came just before TikTok was a thing, so I didn't need viral success overnight. 'They wanted to develop me and that is a dying idea because after TikTok took over it's all about how fast you can go. That's sad. 'The whole point of a label is to give you time, but now they don't sign anyone unless they've had a viral hit already.' She added: 'It's no longer: 'My song is on the radio. I've made it.' There are a lot of boxes to tick. 'It depends on what your version of success is, but it is weird. I'm sat at home with seven million monthly listeners and think: 'But how well is it actually going?' It can be jarring.' The singer did experience a viral moment with her 2021 track Better Days which climbed the charts after it became popular on TikTok as part of a challenge, which helped boost its streams to more than a million across all platforms. Despite the challenges, she does feel that things are changing within the industry to allow women to be more vulnerable. 'Music is about what sells and labels are a business. It used to be: Sex sells. Nobody wants to hear about crying and feeling.' ",
        "But it is changing', she said. 'I wanted to be honest about my vulnerability. Women are told, especially in music, that we have to be a good role model. But you don't have to be that all the time.'"
    ]
}