{
    "articleURL": "/wires/afp/article-12044161/One-killed-four-injured-Atlanta-shooting.html",
    "content": [
        "Police have arrested a man suspected of shooting five people -- one of whom died -- at an Atlanta hospital on Wednesday, authorities in the southern US city said.",
        "One person was killed and four were injured when Deion Patterson allegedly opened fire in a hospital waiting room just after midday (1700 GMT). Patterson then allegedly stole a truck that had been left running at a nearby gas station and fled.A manhunt went into the night before Patterson was apprehended outside the city in neighboring Cobb County.\"Law enforcement have taken the suspect into custody,\" Atlanta Mayor Andre Dickens said at a news conference Wednesday evening.\"He will be charged and stand trial for his crimes.\"Patterson was detained \"without incident,\" said Cobb County police chief Stuart VanHoozer.The victims, all women, were aged between 25 and 71, police said at an earlier news conference.The Fulton County Medical Examiner's office later identified the woman shot and killed as Amy St. Pierre, 38, CNN reported.St. Pierre worked for the US Centers for Disease Control and Prevention, the agency told the broadcaster.Three other women were in intensive care and a fourth victim was in stable condition, CNN reported.Police chief Darin Schierbaum said local authorities received assistance in the search for Patterson from multiple agencies, including the FBI and the Secret Service.Patterson had been accompanied in the hospital waiting room by his mother, who was not injured in the shooting, Schierbaum said. CNN reported he became \"enraged\" during a visit before opening fire.",
        "It was too soon to know if any of the victims were targeted specifically, Schierbaum added. The suspect's family cooperated with the investigation, he said.As police were scouring the greater Atlanta area, they published a photo of Patterson, wearing dark pants, a hood over his head and a white surgical mask, wielding a handgun.Television footage showed police and other law enforcement officers deployed at the scene. Multiple ambulances were also present.The shooting sent several schools near the hospital into temporary lockdown.\"Out of an abundance of caution, we have dispatched officers at every school for today's dismissal,\" Atlanta Public Schools announced on its website once the lockdowns were lifted.The White House said President Joe Biden and Vice President Kamala Harris had been briefed on the shooting.Spokeswoman Karine Jean-Pierre said the president's hands were tied on \"more steps to deal with the violence that we're seeing in our communities or schools or churches.\"\"American people should be able to feel free to go into a grocery store, to go to church,\" Jean-Pierre said.There have been more than 190 mass shootings -- defined as four or more people wounded or killed -- so far this year in the United States, according to the Gun Violence Archive.With more firearms than inhabitants, the United States has the highest rate of gun-related deaths of any developed country: 49,000 in 2021, up from 45,000 the year before."
    ]
}