{
    "articleURL": "/wires/pa/article-12042391/It-tough-Europe-big-advantage-Ryder-Cup-course--Luke-Donald.html",
    "content": [
        "Europe captain Luke Donald admits he will find it hard to give his side a significant advantage with the way he sets up this year’s Ryder Cup course.",
        "As the home skipper, Donald is allowed to dictate how Marco Simone Golf Club will play for this year’s contest against the United States as Europe look to bounce back from the record defeat at Whistling Straits in 2021.The former world number one and some of his potential team members also have the opportunity to contest this week’s Italian Open at the venue on the outskirts of Rome, with Scotland’s Robert MacIntyre defending the title he won last year.“Since playing it last year, we looked at a few different fairway lines, bringing in a few fairways a little bit tighter,” Donald told a pre-event press conference.“The template for European golf is to have a slightly narrower golf course, a little bit more rough, not greens that get too fast because that’s obviously what the US guys are always used to.“There’s not a whole lot we have changed but we have added a couple of bunkers to create opportunities for better driving. I feel like Europe has good drivers of the golf ball.“I think it’s a fun golf course in terms of there’s potentially two or three driveable par fours. Statistically, driving is a good part of our games so to have those in there could give us a slight advantage.",
        "“But there’s only so much you can do. The players are very evenly matched when it comes to statistics.“You’re just trying to find little potential differences that you can capitalise on but the standard of play is very close these days. It’s hard to gain a big advantage.”MacIntyre defeated US Open champion Matt Fitzpatrick in a play-off to win his second DP World Tour title last September, the left-hander making a birdie on the first extra hole after he and Fitzpatrick had finished tied on 14 under par, a shot ahead of Victor Perez.Pre-tournament favourite Rory McIlroy, who was within a shot of the lead until hitting his tee shot on the 16th into the water, finished fourth on 12 under.That was just the second qualifying event for the Ryder Cup and although MacIntyre has since fallen outside the automatic places, the world number 91 is trying to play down the potential significance of a successful title defence.“I worried about that for the last Ryder Cup, worried about what could be,” he said. “This year, I’m not worried at all about what could be. What will be will be and I’ll be going out there to play golf because you enjoy it.“This week is not going to define my season. I get it’s on the golf course where the Ryder Cup is going to be. Course set up is pretty similar to last year. I did it on that golf course.",
        "“But, to be honest, I am not worried just about this week and there is so much golf to be played and it’s not going to define the season, good or bad.“We’ll just keep marching on and working hard and hopefully we make it there come September.”"
    ]
}