{
    "articleURL": "/tvshowbiz/demi-rose/article-12058773/Demi-Rose-flashes-underboob-TINY-brown-bikini-poses-sun-soaked-getaway.html",
    "content": [
        "Demi Rose sent temperatures soaring as she took to Instagram on Sunday to share some sizzling snaps.",
        "The model, 28, exposed her ample cleavage in a tiny brown bikini top, teamed with a matching thong and a corset. She accessorised with a cream Sherpa cowboy hat while her brunette locks were styled in loose waves. Demi opted for a flawless bronzed makeup palette which accentuated her natural features, with a swipe of nude lipstick.  It comes after Demi put on an extremely racy display in a sheer black dress as she shared a gallery of snaps from Coachella on Sunday.",
        "The social media star turned heads as she went braless in the mesh maxi number and donned a black thong beneath which flashes her bottom.She added a coordinated tasselled leather waistcoat and rocked a pair of knee high cowboy boots as she walked away from the camera showing off her bottom.Demi styled her long brunette tresses in a fishtail braid leaving strands of her fringe to frame her face.The star toted her belongings in a matching crossbody bag as she posed up a storm for a series of snaps.She seemed in high spirits as she rode on a golf cart around the star-studded festival.Despite her seemingly boundless confidence, Demi has previously faced adversity after becoming victim to bullies in her younger years.She has been modelling for over a decade and credits her career for being a 'blessing' after being subjected to cruelty during her school time.",
        "Speaking to Radio 1 Newsbeat, Demi previously revealed: 'I always wanted to get into modelling and when I eventually got there I classed it as a blessing because I grew up being bullied and didn't have many friends at all.'In 2019, both of Demi's parents died, just seven months apart and the star said going into lockdown straight after their deaths was 'a time of reflection. Having to deal with my parents' house and selling their stuff - it was a really sad place for me...'I wanted to go and travel but I had three months in London, which was a lot of facing what I had been through and was a time of reflection.'Her latest shoot comes after she was seen teasing her OnlyFans page to her Instagram followers, after signing up to the X-rated content-sharing platform.",
        "Demi told fans she was ditching her profile's subscription fee for a limited period.OnlyFans is an online platform, known for its X-rated content, that allows public figure to charge fans a fee to their profile, where they often shares pictures and videos deemed too provocative for other social media sites.Demi previously charged fans for access to her content - with costs ranging from $22.22 (£16) a month or $119.99 (around £86) for six months.",
        "She's not the only famous face who uses the platform, with celebrities including Bella Thorne, Cardi B and Danniella Westbrook signing up to the service."
    ]
}