{
    "articleURL": "/wires/ap/article-12039819/Oilers-star-power-vs-Golden-Knights-balanced-approach.html",
    "content": [
        "LAS VEGAS (AP) - Because the league doesn't use a strict seeding system for the NHL playoffs, the Western Conference Final has come a round early.",
        "And with teams such as Boston, Colorado and the New York Rangers already eliminated, Game 2 of the Edmonton Oilers-Vegas Golden Knights series was moved back a day to Saturday because it is the marquee second-round matchup.The series, which opens Wednesday in Las Vegas, features an Edmonton team with three 100-point scorers led by a household name in Connor McDavid against a Vegas team that posted the West's top record.The winner plays in the actual conference final against Dallas or Seattle. Edmonton is a minus-152 series favorite, according to FanDuel Sportsbook.\"We feel good about our game, we feel good about our people,\" Oilers coach Jay Woodcroft said. \"We understand that the challenge before us is a big one, but we feel that we're up to it.\"Any why wouldn't he with dynamic scorers McDavid, Leon Draisaitl and Ryan Nugent-Hopkins? Each hit the century mark in points, and McDavid led the league with 64 goals and 89 assists - 153 points.",
        "The Knights, who edged out the Oilers by two points for the top spot in the conference, have some star power in Mark Stone and Jack Eichel, but Vegas uses a much more balanced approached.\"I love our depth from forward one through 12 and D one through six,\" Knights coach Bruce Cassidy said. \"I think they can match up against anybody. ... I think we have an ability to win games different ways, so you can't just say, `I´m going to take this player out of the equation or neutralize him.'\"",
        "POTENT POWER PLAYEdmonton scored on 32.4% of power plays during the regular season, the highest mark since the NHL began tracking that statistic in the 1977-78 season.The Oilers were even better against Los Angeles in the first round, scoring at a 56.3% clip. Vegas was in the middle of the pack in killing off 77.4% of power plays, but the Knights committed a league-low 243 penalties in the regular season.\"You've just got to try to stay out of the box more than anything,\" Knights center Chandler Stephenson said.EYES WIDE OPENMcDavid is the favorite, according to FanDuel, to win his second Hart Memorial Trophy in three years and third since 2017.He produced three goals and seven assists in the six-game series victory over Los Angeles, playing against the Kings' 1-3-1 defensive system.\"L.A. plays different than a lot of teams, so it´s definitely going to be a different style (at Vegas),\" McDavid said. \"I would expect it to be maybe a little bit more up and down the rink.\"McDavid certainly will have the Knights' attention, but he isn't the only one.\"You look at the Edmonton-L.A. series, Edmonton had the puck in the L.A. zone for a lot of it,\" Eichel said. \"So we´re going to need to defend well and be good in our own zone. But at the end of day, we have to play to our strengths and what makes our hockey club good.\"",
        "BATTLE OF THE NETMINDERSVegas' Laurent Brossoit played parts of four seasons for Edmonton (2014-18). He began this season in the American Hockey League and battled a late-season injury before securing the job. Brossoit has lost only one game in regulation in the regular season and playoffs.His counterpart, Stuart Skinner, is a rookie who became the starter even after the Oilers signed veteran Jack Campbell to a five-year, $25 million contract last July. Skinner made the All-Star Game and then overcame a Game 4 benching against Los Angeles to close out the series.SCHEDULING CHANGEGame 2 was scheduled for Friday night in Las Vegas, but was switched to 7 p.m. EDT Saturday.That change was more than just an inconvenience for Oilers fans who booked a trip to Las Vegas.\"Miss the game and waste 4 tickets or a hotel on Saturday and new flights Sunday,\" one fan tweeted. \"I have means - a lot of Oilers fans do not.\"___AP Hockey Writer Stephen Whyno contributed to this report.___Follow Aaron Beard on Twitter at http://www.twitter.com/aaronbeardap___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}