{
    "articleURL": "/sport/nrl/article-12040199/Read-incredibly-honest-words-Manly-NRL-star-Brett-Stewart-told-police-caught-cocaine.html",
    "content": [
        "Former NRL star busted with cocaine on March 10Police spotted Brett Stewart briefly hopping into a carLater admitted to police he was carrying drugs A hasty walk and a 20-second meeting in a grey Mazda piqued police suspicions that ex-NRL player Brett Stewart had just bought drugs.",
        "He told them as much when approached shortly afterwards inside a nearby club.'I have a bag of coke,' the 38-year-old former Manly Sea Eagles fullback said.On Wednesday, the former 'face of rugby league' walked out of court with a promise to behave after pleading guilty to one count of possessing a prohibited drug in Manly Local Court.Police spotted him 'walking hastily' up Eustace St at Manly, on Sydney's northern beaches, before he hopped in a grey Mazda 6 sedan for about 20 seconds.Stewart admitted having the bag when local police approached him inside The Manly Club about 7pm on March 10, telling the officers it was behind the cards in his wallet.",
        "Court documents show he had 0.61 grams of the drug.'Taking into account the bag, (it's) likely to be less than 0.5g,' Stewart's barrister AJ Karim said when entering Stewart's guilty plea.'This is not a case of a continuing attitude of disobedience,' he said, noting Stewart's record otherwise included a low-range drink driving offence from 2014, for which he was fined $400.Mr Karim said police had the discretion to fine Stewart for the drug offence.The two-time premiership winner represented Australia internationally and NSW in State of Origin. He played 233 games for Manly between 2003 and 2016 before retiring in 2017.",
        "He was a prominent figure in the sport at his peak.'In 2009, Mr Stewart was the face of rugby league,' Mr Karim said.'I'm aware of that,' magistrate Robert Williams responded.No conviction was recorded.",
        "Mr Williams was asked to consider dismissing the charge but instead he made a conditional release order, essentially placing Stewart on a good behaviour bond requiring him not to commit any further offences for nine months.The magistrate accepted evidence tendered on behalf of a doctor and lawyers.'No doubt persons in the community speak highly of you,' Mr Williams said.However, Stewart's behaviour was noted with concern.'The community is concerned about the drug industry. Just possessing a small amount of a drug does mean that you are a part of that drug industry and overall the community suffers,' Mr Williams said.Stewart maintained his silence as he left the court with his lawyers."
    ]
}