{
    "articleURL": "/wires/reuters/article-12050225/Fighting-rages-Khartoum-civilians-complain-forgotten.html",
    "content": [
        "By Khalid Abdelaziz Nafisa and Nafisa Eltahir",
        "PORT SUDAN, Sudan, May 5 (Reuters) - Heavy gunfire echoed around Khartoum again on Friday and there was no sign of any letup in fighting as civilians trapped in the Sudanese capital said their plight was being ignored by both the army and its rival, the paramilitary Rapid Support Forces (RSF).\"It's been four days without electricity and our situation is difficult... We are the victims of a war that we aren't a part of. No one cares about the citizen,\" said Othman Hassan, 48, a resident of the southern outskirts of Khartoum.Despite multiple ceasefire declarations, the two sides appeared to be battling for control of territory in the capital ahead of proposed talks, though the leaders of both factions have shown little public willingness to negotiate after more than two weeks of fighting.The sudden collapse into warfare has killed hundreds, triggered a humanitarian disaster, sent an exodus of refugees to neighbouring states and risks dragging in outside powers, further destabilising an already restive region.Across swathes of Khartoum, factories, banks and shops have been looted or damaged, power and water supplies have been failing and residents have reported steep price rises and shortages of basic goods.\"Sudan's warring armies are showing reckless disregard for civilian lives by using inaccurate weapons in populated urban areas,\" said Human Rights Watch Sudan researcher Mohamed Osman, in a report by the group documenting damage to hospitals and water treatment plants caused by fighting.",
        "The Sudanese Doctors Union said one of the country's main maternity hospitals, Aldayat in the adjoining city of Omdurman, had been looted and occupied by forces on Thursday.In total, it says 17 hospitals had been damaged by fighting and 20 forcibly evacuated since the start of the violence. Sixty of the 88 hospitals in Khartoum are out of service, it said, with many of the rest only offering partial service.The fighting stems from tensions between two rival factions, the army and RSF, which had shared power after a coup in 2021, derailing an internationally-backed plan to usher in democracy and civilian rule after a 2019 popular uprising that unseated Islamist strongman Omar al-Bashir.The United Nations, meanwhile, pressed the warring factions to guarantee safe passage of aid after six trucks were looted.U.N. aid chief Martin Griffiths said he hoped to have face-to-face meetings with both sides to secure guarantees from them for aid convoys.The World Food Programme (WFP) estimated that $13 million to $14 million worth of food destined to people in need in Sudan had been plundered so far.About 100,000 people have fled Sudan with little food or water to neighbouring countries, the United Nations says. (Writing by Michael Georgy Editing by Gareth Jones)"
    ]
}