{
    "articleURL": "/news/article-12041477/New-Australian-study-prompts-calls-ban-smacking-children.html",
    "content": [
        "Study reveals negative effects of smacking kidsExperts call for it to be outlawed Experts have renewed calls for the smacking of children to be outlawed in Australia, following dozens of other countries which have outlawed the controversial punishment.",
        "A comprehensive new study published in the Australian and New Zealand Journal of Public Health has found children who were smacked by their parents can go on to develop serious mental health disorders.University of Melbourne professor of psychiatry Sophie Havighurst, lead author of the report Corporal Punishment of Children in Australia, said the findings made a case for the practice to be banned.Prof. Havinghurst said the research reviewed 111 countries looking at the long-term effects of smacking and found negative effects present in children in 110 of those countries. The study concluded that smacking had an impact of a child's developing brain and that Australia should not be lagging behind the rest of the world - where the disciplinary practice is not illegal unless excessive force is used. ",
        "'If it's illegal to hit your neighbour, their child or their dog, why is it legal to hit your child?,' she told The Australian.'Why don't children have the same right to protection from violence as adults?'Using physical force on children is currently banned in 65 countries including New Zealand, Germany, Spain and the Netherlands Australian jurisdictions have varying laws when it comes to the divisive parental issue.In NSW, physical punishment should not be painful for more than a brief moment, and children cannot be hit on their heads or necks.",
        "In Victoria there is no legislation surrounding parents applying physical punishment to their kids while in various other states it must be considered 'reasonable under the circumstances'.The latest paper reported that six in 10 people aged between 16 to 24 said they had experienced four or more incidents of corporal punishment.Their findings also coincide with the Australian Child Mal­treatment Study, which showed that 61 per cent of 16 to 24-year-olds who were smacked as kids were nearly twice as likely to develop anxiety and depression later in life.",
        "Professor Daryl Higgins, director of the Australian Catholic University's Institute of Child Protection Studies, said the older generation was more likely to believe smacking was effective.38 per cent of those over 65 considered it necessary, compared with just 15 per cent of 16-24-year-olds agreeing it was appropriate. The paper also found countries such as New Zealand that had changed laws and ran public education campaigns saw decreasing levels of corporal punishment Last year, an Australian Catholic University study of 8,500 people aged between 16 and 24 found that females who were hit as kids were 1.8 times more likely to have a major depressive disorder, and 2.1 times to experience anxiety.Males were also almost nearly twice as likely to experience depression and anxiety if they'd experienced corporal punishment in their younger years."
    ]
}