{
    "articleURL": "/wires/ap/article-12044945/Pasquantino-HRs-Greinke-wins-1st-Royals-Orioles-6-0.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - Vinnie Pasquantino homered and drove in three runs, Zack Greinke won for the first time since last August and the Kansas City Royals snapped a 10-game home losing streak by beating the Baltimore Orioles 6-0 on Wednesday night.",
        "Greinke (1-4) won for the first time in 14 starts, allowing just three singles in five innings and striking out three.\"Everything worked good,\" Greinke said. \"Defense was great, hitting was great, pitching was good. Glad to be getting some outs, not pitching like I did the last couple of times.\"He threw only 44 pitches -- his fewest in a start since tossing 43 for Arizona at Boston on Aug. 14, 2016.\"Just gotta pitch better if you want to pitch more,\" Greinke said.Royals manager Matt Quatraro said the decision to remove Greinke when they did was the result of a few factors.",
        "\"It´s what we had available in the bullpen tonight,\" he said, \"what we thought about how we matched up the rest of the game, as well as being in the middle of a 16-game stretch and trying to manage innings.\"The Royals won their second home game of the season to improve to 2-13 at Kauffman Stadium.\"It was good to double our win total at home,\" Pasquantino said. \"Now we just go to tomorrow and try to have good at-bats again.\"Pasquantino homered into the right-field bullpen to give Kansas City a fourth-inning lead in a game that lasted just 1 hour, 59 minutes. He doubled in another run in the sixth to put the Royals up 2-0.",
        "\"He believes in himself,\" Quatraro said. \"He doesn´t care who´s pitching for the other team. Secondly, he controls the zone. And the third part is amazing: He hits all pitches - fastballs up, fastballs down - which is unusual for somebody to be able to cover as much as he does.\"Pasquantino said he simply tries to lock himself in every night.\"Had a game plan against their pitchers and tried to be successful,\" he said. \"And results-wise, it was a successful night.\"The Royals knocked Kyle Gibson (4-1) out with four runs in the seventh - all with two out - highlighted by Pasquantino´s second RBI double.Gibson allowed six runs and 10 hits over 6 2/3 innings, with no walks or strikeouts - the only start of his career in which he had none in either category.\"I thought he was really good into that seventh inning,\" Orioles manager Brandon Hyde said. \"We were down a couple, he gets an out and then kind of a squibber through the infield and a sac fly, we´re down 3-0.\"Anthony Santander had a pair of singles for the Orioles, who were shut out for the first time since Oct. 1 against the Yankees.\"Bottom line is we didn´t score,\" Hyde said. \"Tough time offensively tonight.\"",
        "TRAINER´S ROOMLHP Kris Bubic, who will undergo Tommy John surgery, was transferred to the 60-day IL.TRANSACTIONSBaltimore designated RHP Joey Krehbiel for assignment and acquired C Luis Torrens from the Chicago Cubs in exchange for cash considerations. ... Royals RHP Jose Cuas was optioned to Triple-A Omaha and LHP Austin Cox was selected from Omaha.UP NEXTRHP Grayson Rodriguez (1-0, 4.07 ERA) will face RHP Jordan Lyles (0-5, 6.11) in the rubber game Thursday. -AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}