{
    "articleURL": "/news/article-12053607/How-AVOID-King-Charles-IIIs-Coronation.html",
    "content": [
        "If you are fed up of wall-to-wall coverage of the coronation, here's some advice  Read more: Police arrest crying 'Not My King' protesters including leader How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk It's all over the internet, the television and the radio, and it might seem like there's no escaping the coronation today. ",
        "Tens of thousands have flocked to the Mall to watch the procession of more than 7,000 servicemen and bunting lines almost every street across the country. Most cheerful monarchists will head out to street parties or to the pub to raise a glass to the monarch and enjoy the warm spring sunshine after watching the carefully crafted procession.  But even if you aren't the biggest fan of the monarchy, there are some easy things you can do to avoid coronation-mania. From turning off the television to leaving the country, here is the complete MailOnline guide to avoiding all mention of King Charles's day of destiny. Turn off the television While TV forms a large part of many people's daily lives - from the six o'clock news to Gavin And Stacey re-runs, one of the key things you need to do to avoid the coronation is to stop watching live coverage. ",
        "The coronation will be splashed across most channels, so if you don't want to hear about the royals, the only way to make absolutely sure you miss the whole thing is to leave the remote alone. If you really can't bid farewell to the screen for the rest of the day (or the weekend, depending on the strength of your aversion) then Channel 4 is showing non-coronation content today. ",
        "This includes the Formula E Monaco Grand Prix and the Wheelchair Rugby European Championship.  And the streaming services of course will still have their usual content, so bedding down for a duvet day remains an option. Draw the curtains to make extra sure you can't see any bunting. Enjoy the countrysideIn the modern world there are often too few opportunities to get out into nature and really appreciate the mild spring weather. ",
        "Pop your phone on flight mode and enjoy a nice long hike, timed carefully to coincide with the ceremony and procession, and chances are you will massively limit the number of times you hear the words 'God Save The King'. If you don't like a long walk, an alternative might be to park yourself on a bench with a nice book, steadfastly refusing to think about the royals. Of course, those living in city centres might struggle to find a green space not overtaken by street parties and coronation picnics, but a bright side is that the trains heading out of busy urban areas are likely to be nearly empty until this afternoon. National Highways is lifting more than 700 miles of roadworks over the weekend and Network Rail will be running as usual. The Countryside Charity has plotted a map of the quietest places in England, including the Fen Drayton Reserve in South Cambridgeshire, Bossington Beach in Somerset and the North York Moors. ",
        "If you're really stuck, a good pair of noise-cancelling headphones and a cup of tea are a viable better-than-nothing option. Avoid central LondonThis might seem obvious, but the biggest of monarchists will of course head straight to Westminster for their chance to catch a glimpse of the newly-crowned sovereign. ",
        "A loud procession is planned for after the ceremony and if cheering hoards aren't really your thing, it might be best to save seeing the London Eye for another day. Stay away from the areas around Buckingham Palace and Westminster Abbey, especially Hyde Park and St James's Park. Roads are closed around Knightsbridge, Waterloo, Leicester Square and Vauxhall Bridge. To make sure you avoid all coronation-goers, steer clear of the tube and public transport in these areas - why not try walking to the next station on the line? Make sure you plan your journey in advance and watch out for pickpockets in busy areas.  Host an alternative party If you are an anti-monarchist in a party mood this weekend, it might be difficult to go to the pub while still avoiding coronation celebrators. ",
        "And if you find people loudly singing God Save The King and Jerusalem terribly obnoxious, then you will probably want to seek alternative venues. Why not put together a group of like-minded friends and acquaintances and host a party at your place? ",
        "Instead of Pimms and Victoria Sponge, your party can feature whatever snacks and drinks you like - just like if it was any other day. If the rain holds off, it might be a good chance to dust off the barbecue, or your could plan an evening of board games and non-royal films. For those who don't want to deal with the clean-up associated with all good parties, The Dog and Partridge Pub in Sheffield is an anti-coronation safe space and The Brewers in Manchester is hosting an alternative Coronation pub quiz. Alternative community parties are being hosted in Newington Green and in Bristol, where The Cube is hosting an anti-street party for republicans with tea and cake.  Leave the country It might seem a little extreme - and expensive - but the nuclear option for those who don't want to be witness to King Charles's coronation is to pack a bag and get on a flight. ",
        "One Twitter user shared an image of an airport departure board and said he was: 'Getting the hell out of this Mickey Mouse country... until the Disney parades are over.'Unfortunately, without prior planning, this option might be incredibly expensive for republicans looking to escape. Booking a Eurostar ticket this morning would set you back at least £189 - and a return journey on Tuesday would be at least £84. ",
        "Last-minute flights are notoriously expensive so it might be simpler just to turn off your television and avoid social media.  And leaving the country is no guarantee of a safe space for anti-monarchists. More than 300million people are expected to tune in across the planet and it will be shown in venues abroad."
    ]
}