{
    "articleURL": "/news/article-12046281/Secret-ingredients-Erling-Haalands-success-Manchester-City.html",
    "content": [
        "Haaland, 22, has broken record for most goals scored in Premier League seasonNorwegian eats 6,000 calories in up to six meals a day to keep him at his peakStanding at 6ft 4in with a muscle mass of 11st 5lbs, Manchester City's striking sensation is a footballing beast - with an extraordinary goalscoring record to match.",
        "And after Erling Haaland broke the record for the most goals scored in a Premier League season last night, MailOnline has looked at the secrets behind his success.Norwegian Haaland - who scored his 35th league goal of the campaign against West Ham yesterday - eats 6,000 calories in up to six meals a day to keep him at his peak.A typical day of food for the 22-year-old includes a ham and cheese omelette for breakfast, a 'magic potion' smoothie of milk, kale and spinach as a snack, and lunch of cows' hearts and calves' liver - before his father's 'Lucky Lasagne' for dinner.He only drinks water through a complicated filter system and has spoken of the importance of getting sunlight in his eyes first thing 'for circadian rhythm'.",
        "Haaland - who joined City last summer from Borussia Dortmund for £51.2million - is also a fan of ice baths and glasses which filter out blue light to improve his sleep.",
        "Age: 22Height: 6ft4inWeight: 14st 8lbsMuscle mass: 11st 5lbsBMI: 20.1Chest: 43 inchWaist: 32 inchBiceps: 14 inchDaily calories: 6,000 calories in up to six meals per day",
        "Erase Steenslid, Haaland's trainer at Dortmund, previously joked how the footballer was 'always the closest to the buffet and his plate was literally a mountain of food'. And Haaland's diet has also been compared to Anthony Hopkins' chilling Hannibal Lecter character in 1991 film The Silence of the Lambs. ",
        "The footballer's daily exercise includes a treadmill workout formed of a five-minute warm-up, 20 minutes at up to 10kph with a 5 per cent incline and then a five-minute cooldown.Haaland also spends 20 minutes on an air bike, and ten minutes on a rowing machine. He also does 12 to 15 100 metre sprints on flat ground, with 30 seconds of rest in between each one.He will also do ten rounds of a zigzag run on sand, formed of 40 seconds on and 20 seconds off.In addition, his workout features eight to ten hill sprints of 50 meters, with 30 seconds rest maximum between each sprint.Furthermore, Halland will do explosive incline push-ups, pull-ups or muscle-ups to maintain his strength and conditioning.",
        "His girlfriend is Isabel Haugseng Johansen, who is a footballer herself and lives with Haaland in a stylish, open-plan flat in Manchester's Northern Quarter.Haaland, who is paid £900,000 a week has recently landed a £20million deal with Nike and another with watchmaker Breitling.And given that existing icons Cristiano Ronaldo and Lionel Messi are both now ageing and towards the end of their careers, Haaland is fast becoming the world's most idolised footballer.He is also known for his unusual wardrobe, including an array of pyjamas that he wears out.",
        "Haaland has been described by former Arsenal boss Arsene Wenger as 'a monster'; and by Liverpool boss Jurgen Klopp 'a force of nature', His boss at Man City, Pep Guardiola describes him as 'scary'.He is in fact a Yorkshireman by birth and was born at St James's Hospital - known as 'Jimmy's' - in Leeds on July 21, 2000.However, his family moved back to their home town of Bryne, when he was three.He started training with local club Bryne FK aged five and was picked to travel to Spain with Norway under-15s. ",
        "He joined Molde aged 16 in 2017 before moving to Red Bull Salzburg in 2019 and then Borussia Dortmund the following year.And he stayed at the German club until last summer before his big-money move to Manchester.Haaland now has 35 goals in the Premier League, surging past the previous record of 34 shared by Andy Cole and Alan Shearer in 42-game campaigns early in the Premier League era.He scored in seven straight league games from August to October - his third to his ninth appearances in the competition.",
        "Hat-tricks against Crystal Palace, Nottingham Forest and Manchester United helped him to 13 goals in those games and 18 in a 10-match scoring run in all competitions.",
        "A fourth treble against Wolves in January left him one behind Shearer's record of five in a season while he also has five doubles - against West Ham, Brighton, Leeds, Southampton and Leicester - and has scored in 22 of his 31 appearances.Haaland arrived in Manchester with 23 Champions League goals to his name in 19 appearances for RB Salzburg and Borussia Dortmund, and has more than maintained that form.He netted group-stage doubles against Sevilla and FC Copenhagen, either side of a goal against Dortmund, and Pep Guardiola could afford to largely rest his star man for the return fixtures save for a scoreless first-half run-out on his old stomping ground in Germany. ",
        "He was quiet in a drawn first leg against RB Leipzig but more than made up for it in the return fixture, equalling the competition record of five goals in a game as City won 7-0 and 8-1 on aggregate.Goals in both legs against Bayern Munich took him to a dozen for the European season, with an outside chance of threatening Cristiano Ronaldo's record 17 for Real Madrid in 2013-14.Haaland's first FA Cup goals came with a hat-trick in the 6-0 quarter-final win over Burnley, having sat out the clash with Chelsea and not scored against Arsenal.",
        "He was shut out by Liverpool in the Community Shield - as well as in both league meetings - but scored against them in the Carabao Cup. ",
        "There are a maximum of nine games remaining for City this season - five in the league, a Champions League semi-final over two legs and a possible final, and an FA Cup final.With Haaland scoring more than a goal a game to this point, if he keeps up his season-long rate and plays every possible match, he could hit an astonishing 63 goals and match former Everton striker Dixie Dean's all-time record for an English season in 1927-28.His recent hot streak, even by his standards, raises the prospect of even more.Haaland has scored 18 goals in his last 11 games, including the Leipzig and Burnley games and league doubles against Southampton and Leicester."
    ]
}