{
    "articleURL": "/wires/ap/article-12060235/ASEAN-relief-convoy-attacked-Myanmar-no-casualties.html",
    "content": [
        "BANGKOK (AP) - A convoy including diplomats representing the Association of Southeast Asian Nations on a mission to provide humanitarian assistance to displaced people in strife-torn Myanmar has been ambushed, state media and a member of an ethnic minority militia said Monday.",
        "State-run television MRTV reported that the attack on the convoy with delegates from the ASEAN Coordinating Center for Humanitarian Assistance and the Indonesian and Singaporean embassies occurred Sunday in eastern Shan state and was carried out by \"terrorists.\" The report did not say which organization the \"terrorists\" were from. The military government uses the term \"terrorists\" for a wide range of forces opposed to military rule.The report said the gunmen opened fire with small arms and the security team accompanying the convoy returned fire. A security vehicle was damaged, but no one in the convoy was injured, it said.The \"heinous\" attack made it more difficult for displaced people as the government tries to improve relations with other countries to alleviate the situation, the report said.MRTV said the government is cooperating in providing humanitarian assistance under a Five Point Consensus reached by ASEAN in 2021 in an effort to help restore peace in Myanmar after the army seized power from the elected government of Aung San Suu Kyi in February 2021.The military government has not implemented most parts of the consensus, which calls for an immediate end to violence in Myanmar, dialogue among all parties, the appointment of a special envoy, humanitarian assistance by ASEAN, and a visit by the special envoy to Myanmar to meet with all parties. Its failure to carry out the agreement has caused ASEAN to bar Myanmar´s military leaders from its top-level meetings.",
        "Nay Phone Latt, a spokesperson for the National Unity Government, an underground group that calls itself the country´s legitimate government and serves as an umbrella organization for opponents of military rule, denied that its armed wing, the People´s Defense Forces, had carried out the attack.He said the convoy was going to the office of the Pa-O National Liberation Organization, an ethnic group living in the area, to distribute aid to displaced people.\"We condemn those who carried out this attack on a convoy that came to give aid and support to people fleeing the war,\" Nay Phone Latt said. \"It is believed that this attack was carried out by a group that did not want this aid to reach the PNLO-controlled area. It is only the terrorist military council and their subordinate factions who do not want humanitarian aid and diplomats to reach the PNLO, which is deeply involved in the revolution\" against the military government, he said.Khun Tun Tin, vice chairman of the Pa-Oh National Liberation Organization, confirmed that the attack took place five miles (eight kilometers) before the convoy reached the PNLO´s office in Shan state´s Hsi Hseng township, and that the group´s secretary was in the convoy.The PNLO signed a nationwide cease-fire agreement with the previous military-backed government in 2015 and recently joined peace talks with the head of the ruling military council, Senior Gen. Min Aung Hlaing.",
        "The township is about 128 kilometers (80 miles) northeast of Myanmar's capital, Naypyitaw. The area is part of the self-administered zone of the Pa-O ethnic minority. It is governed by the Pa-O National Organization, which is allied with the military government. Other Pa-O groups support the resistance.Since early 2022, over 5,000 people have taken shelter in Hsi Hseng due to fighting between the army and the resistance forces. The latter include the Karenni National Progressive Party - an ethnic minority militia battling the army - and their allies in the Karenni Nationalities Defense Force and the National Unity Government-affiliated People´s Defense Forces.The Karenni have been fighting for decades for greater autonomy. The People´s Defense Forces were formed by the pro-democracy movement after the 2021 military takeover, and are allied with groups such as the Karenni.The 2021 military takeover prompted nationwide peaceful protests that security forces suppressed with lethal force, triggering armed resistance that U.N. experts now characterize as civil war.Urban guerrillas are active in major cities, and the loosely organized People´s Defense Forces, along with their allies in ethnic minority guerrilla groups, regularly strike military columns and outposts.Civilians have borne the brunt of brutal military offensives in the countryside, including the use of artillery and airstrikes, which have displaced more than a million people, causing a humanitarian crisis."
    ]
}