{
    "articleURL": "/wires/ap/article-12053197/Randy-Arozarena-homers-Rays-beat-Yankees-5-4.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Randy Arozarena homered in the first inning and then was hit by pitches in his next two plate appearances, leading to Tampa Bay manager Kevin Cash being ejected as the MLB-best Rays beat the New York Yankees 5-4 on Friday night in the first meeting this season between the AL East rivals.",
        "Arozarena homered to center field off Jhony Brito before the rookie right-hander plunked the outfielder on the elbow guard in the third. Albert Abreu then hit Arozarena around belt high with a fifth-inning pitch.An angry Arozarena walked slowly toward first base and whipped his bat in disgust towards the Rays´ dugout.There was yelling between the benches, but no trouble on the field. The umpires gathered and issued warnings to both teams, which prompted Cash to rush out of the dugout to argue with crew chief and first base umpire Lance Barksdale.Wander Franco put the Rays up 5-4 with an RBI double off Jimmy Cordero (1-1) in the seventh. Kevin Kelly (3-0) pitched 1 1/3 scoreless innings for the win, and Jason Adam worked the ninth for his third save.The Rays (27-6) opened a 10-game lead over the last-place Yankees (17-16) in the AL East.",
        "RED SOX 5, PHILLIES 3PHILADELPHIA (AP) - Chris Sale struck out 10 in six innings, and Boston earned its seventh consecutive victory.The game was delayed for about 10 minutes in the first inning when a spectator fell over a protective railing and into the Red Sox bullpen while reaching for a baseball.Boston rookie Masataka Yoshida extended his hitting streak to 15 games. Kiké Hernández and Enmanuel Valdez each had two hits and drove in a run.",
        "The 34-year-old Sale (3-2) was charged with three runs and seven hits. Kenley Jansen worked the ninth for his seventh save.Boston grabbed a 5-3 lead with two runs in the sixth against Zack Wheeler (3-2).The Phillies have dropped five in a row to fall three games under .500.PADRES 5, DODGERS 2SAN DIEGO (AP) - Fernando Tatis Jr. hit two home runs off Clayton Kershaw, and San Diego beat Los Angeles in the first meeting between the teams since the Padres eliminated the Dodgers in the NL Division Series.Yu Darvish (2-2) outpitched Kershaw (5-2), who was knocked out in the fifth inning in front of a loud, festive crowd on Cinco de Mayo. The division-leading Dodgers had their six-game winning streak snapped.It was the first matchup between the teams since Oct. 15, when the Padres beat the 111-win Dodgers 5-3 on a rainy Saturday night to advance to the NL Championship Series.Josh Hader pitched the ninth for his 11th save.ORIOLES 9, BRAVES 4ATLANTA (AP) - Anthony Santander homered from both sides of the plate, including a grand slam, and Cedric Mullins also went deep as Baltimore won for the 14th time in 17 games.Dean Kremer (3-1) allowed one run in six strong innings for the Orioles, who became the first team this season to go deep off Braves ace Max Fried.",
        "Fried (2-1) was charged with seven runs, five earned, in six-plus innings. His ERA climbed from 0.45 to 2.08.Hot-hitting Sean Murphy drove in all four Atlanta runs, three of them on an eighth-inning homer.Baltimore improved to 22-10, surpassing the Braves (22-11) for the second-best record in the big leagues.ASTROS 6, MARINERS 4SEATTLE (AP) - Kyle Tucker hit a two-run homer in the ninth inning off Matt Brash, and the Astros beat the Mariners in the first meeting between the AL West foes this year.Tucker and Yordan Alvarez provided all the offensive punch for the Astros. Alvarez continued to torment Seattle pitching with a three-run homer off Luis Castillo in the third.Brash (3-3) didn´t get the call on a borderline 2-2 pitch from plate umpire Shane Livensparger that froze Tucker, and missed his spot on the 3-2 pitch. Tucker´s homer was his sixth of the season.Seattle manager Scott Servais argued the non-strike call later in the inning during a pitching change and was ejected by Livensparger.Bryan Abreu (1-0) got the win, and Ryan Pressly pitched the ninth for his fourth save.BLUE JAYS 4, PIRATES 0PITTSBURGH (AP) - Chris Bassitt pitched seven innings, George Springer homered and Toronto stopped a five-game losing streak.",
        "Bassitt (4-2) allowed four hits, struck out five and walked four. Springer hit a two-run shot off Rich Hill (3-3) in the fifth.Pittsburgh finished with four hits in its fifth consecutive loss. Bryan Reynolds extended his hitting streak to 10 with a double in the sixth, Pittsburgh´s lone extra-base hit.Hill was charged with four runs and eight hits in 5 1/3 innings.TIGERS 5, CARDINALS 4ST. LOUIS (AP) - Riley Greene hit a two-run double in the seventh inning and Javier Báez added a two-run homer, sending Detroit to the come-from-behind victory.St. Louis fell to 0 for 11 in series openers. It is the first team to begin the season with that many losses in such games since the 1981 Kansas City Royals dropped their first 13 series openers, according to OptaSTATS.The Cardinals have lost seven in a row and 14 of 17 overall.Detroit's Matthew Boyd (2-2) pitched six innings of three-run ball. Alex Lang earned his sixth save after giving up a leadoff double to Paul Goldschmidt. He struck out the final three batters.The Tigers scored three runs in the seventh to take a 5-3 lead. Jordan Hicks (0-3) got the loss.ANGELS 5, RANGERS 4, 10 INNINGSANAHEIM, Calif. (AP) - Zach Neto scored on Josh Sborz´s wild pitch in the 10th inning, and the Angels earned their fifth straight win.",
        "Neto started the inning on second base as the automatic runner. After Will Smith (0-2) intentionally walked Mike Trout, Neto advanced to third when Trout was forced out at second on Shohei Ohtani´s grounder. Sborz relieved Smith and his first-pitch slider got by catcher Jonah Heim to score Neto.Carlos Estevez (1-1) pitched a scoreless 10th and had a pair of strikeouts. Trout had two hits and drove in a run.The Angels trailed 4-1 in the ninth and were down to their last out before rallying against Smith.METS 1, ROCKIES 0NEW YORK (AP) - Kodai Senga pitched six innings of two-hit ball after a long layoff, and the Mets beat the Rockies to avoid falling under .500 for the second time this year.Brandon Nimmo homered and made a diving catch in center field after committing a costly baserunning blunder Thursday in Detroit.David Robertson caught a break to strand two in the eighth when Ryan McMahon´s line-drive single hit pinch-runner Brenton Doyle on the leg between first and second for the final out of the inning.Adam Ottavino worked the ninth for his fourth save.Colorado had its four-game winning streak snapped and was blanked for the second time this season.Pitching for the first time in nine days, Senga (4-1) worked around four walks and struck out four.",
        "Colorado's Antonio Senzatela (0-1) allowed one run and three hits over five innings in his season debut.DIAMONDBACKS 3, NATIONALS 1PHOENIX (AP) - Arizona's Merrill Kelly struck out 10 in seven strong innings, and Corbin Carroll homered in his return to the lineup.Kelly (3-3) gave up a solo homer to Luis García in the first, but also had three strikeouts in the inning. He allowed four hits and walked one in his second straight solid start.Carroll homered off Josiah Gray (2-5) in his first start since crashing into the wall against Colorado last Sunday. Andrew Chafin worked a perfect ninth for his fifth save in six chances, completing a combined four-hitter.TWINS 2, PHILLIES 0CLEVELAND (AP) - Max Kepler hit a two-run homer for Minnesota, and Bailey Ober pitched seven innings in a combined three-hitter.Ober (2-0) gave up three hits and a walk while striking out six. Jorge López worked a clean eighth and Jhoan Duran pitched the ninth for his seventh save.Guardians starter Peyton Battenfield (0-3) did not allow a baserunner until Christian Vázquez singled with two outs in the sixth. Kepler followed with a 440-foot drive to right.The Twins have homered in a franchise-record 17 consecutive games. Kepler has 15 home runs at Progressive Field since 2016, the most by a visiting player.The game featured six total hits and was played in 2 hours and 11 minutes.ATHLETICS 12, ROYALS 8KANSAS CITY, Mo. (AP) - Brent Rooker and Ramón Laureano hit back-to-back homers, and the Athletics outslugged the Royals in a matchup between the bottom two teams in baseball.Kyle Muller (1-2) became the first A´s starter to earn a win in 33 games this year. The drought was the longest to begin a season in MLB history, according to the Elias Sports Bureau.Rooker and Ryan Noda each had three hits and three RBIs as Oakland improved to 7-26 with only its second victory by more than one run.Nick Pratto homered for the Royals (8-25), who dropped to 2-15 at home. Brad Keller (2-3) gave up seven runs, six earned and 11 hits in 4 1/3 innings.CUBS 4, MARLINS 1CHICAGO (AP) - Justin Steele pitched seven effective innings, and the Cubs stopped a three-game slide.Ian Happ hit a two-run homer for Chicago. Matt Mervis made his big league debut and drove in an insurance run in the eighth with his first hit, a sharp single to right.Steele (5-0) allowed one run and six hits while lowering his ERA to an NL-leading 1.45. Mark Leiter Jr. got three outs for his first save.Luis Arraez had three hits for Miami in its fourth consecutive loss. Edward Cabrera (2-3) struck out eight while pitching five innings of three-run ball.WHITE SOX 5, REDS 4CINCINNATI (AP) - Luis Robert Jr. and Elvis Andrus homered, helping Lance Lynn and the White Sox to the win,Andrus erased a 3-0 deficit with a three-run shot in the fifth. Robert put the White Sox ahead to stay with a two-run drive against Hunter Greene (0-2) in the sixth.Lynn (1-4) was charged with four runs and eight hits in 6 2/3 innings. Reynaldo López got three outs for his fourth save.Jonathan India hit a solo homer for Cincinnati. Greene allowed five runs and seven hits in 5 2/3 innings.GIANTS 6, BREWERS 4SAN FRANCISCO (AP) - Joc Pederson hit a go-ahead, two-run single against Corbin Burnes in the fifth inning that propelled San Francisco past Milwaukee.J.D. Davis and pinch-hitter Wilmer Flores homered for the Giants, who erased a pair of two-run deficits and won their third straight following a five-game skid.The Brewers fell to 0-4 on their trip to Colorado and San Francisco and dropped their fifth in a row overall after starting the season 18-9.Sean Manaea (1-1) allowed four runs - three earned - in five innings for his first win with the Giants.Burnes (3-2) permitted five runs over six innings, but only two were earned. A two-base throwing error by shortstop Willy Adames keyed a three-run fifth.Three relievers combined for four shutout innings for the Giants, and Camilo Doval earned his sixth save.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}