{
    "articleURL": "/wires/reuters/article-12046307/Euro-zone-bond-yields-edge-ECB-Fed-hike-stride.html",
    "content": [
        "By Stefano Rebaudo and Harry Robertson",
        "LONDON, May 4 (Reuters) - Euro zone yields fell on Thursday after the European Central Bank raised rates by 25 bps supporting expectations the central bank is close to the end of its tightening cycle.The ECB eased the pace of its interest rate hikes and kept its options open on future moves as it continues its fight against stubbornly high inflation in the euro zone.Money market expectations for the ECB deposit facility rate dropped to around 3.63% by September 2023, implying less than two 25 bps rate hikes by fall.The euro dipped on Thursday, giving back some of its overnight gains against the dollar, while European shares pared some losses.Germany's 2-year bond yield, which is more sensitive to policy rate expectations, was down 13 bps at 2.55%.Inflation data, which triggered a significant downward repricing of market expectations for the ECB policy path last week, were not strong enough to justify another 50 bps rate hike, especially after an ECB survey of lending data for March revealed banks were tightening access to credit.Most analysts reckoned the ECB had reached a fine-tuning phase of the monetary tightening cycle, which will involve default 25 bps increments of policy rates.\"Such a move was widely expected. We see another 25 bps hike in June. Then, unless May inflation data comes up stronger than expected, the ECB might send a message like the Fed did yesterday,\" said Massimiliano Maxia, a senior fixed-income strategist at Allianz Global Investors.",
        "\"The Fed's job is done or almost done; the ECB has still some work to do,\" he added.The Federal Reserve raised rates by 25 bps on Wednesday but its statements fuelled expectations that its hike may be the last one as the central bank paid heightened attention to credit and other economic risks.The ECB also said it would stop reinvesting cash from maturing bonds bought under its 3.2 trillion Asset Purchase Programme, starting from July.Sandra Holdsworth, head of rates at Aegon Asset Management said: \"The (ECB) balance sheet is expected to contract by around 25 billion per month on average.\"Germany's 10-year yield, the euro zone benchmark, was down 5.5 bps at 2.195%.Italy's 10-year yield was down 0.5 bps at 4.12%. The closely watched gap between Italian and German borrowing costs widening to 191 bps.\"I expect the decision on quantitative tightening (QT) not to affect much bond yields and spreads between the core and periphery, as the euro area already allocated almost 70% of its net bond supply expected for this year,\" said Francesco Maria Di Bella, rates strategist at Unicredit, also flagging a yield curve showed less inversion after the ECB decision.The spread between Germany's 2-year and 10-year bond yields hit its tightest in almost four weeks at 33.1 bps.",
        "Survey data released before the ECB decision showed that Germany's services sector activity grew in April at the fastest pace in a year, while growth in euro zone business activity sped up slightly less than initially hoped.Euro zone yields have fallen sharply since the start of March, with problems in the banking system sending investors towards safe-have assets.Germany's 10-year yield is around 55 bps below the almost 12-year high of 2.77% hit in early March.Yet yields have also risen from their mid-March lows as central bankers have made clear that squelching inflation remains the priority.(Reporting by Stefano Rebaudo and Harry Robertson; Editing by Sharon Singleton and Ken Ferris)"
    ]
}