{
    "articleURL": "/wires/reuters/article-12060079/Indians-escorted-home-riot-hit-northeast.html",
    "content": [
        "By Rupam Jain",
        "NEW DELHI, May 8 (Reuters) -Thousands of people who fled deadly rioting and ethnic clashes in northeast India last week are returning home, escorted by security personnel, officials said on Monday.Fierce fighting broke out in the state of Manipur bordering Myanmar when members of about 30 tribal groups clashed with a non-tribal group, the ethnic majority Meitei, over the economic benefits and reservation status extended to some tribes.\"We are trying to ensure villagers return to their homes as leaders from opposing sides have started holding peace talks today,\" Lorho S. Pfoze, a member of parliament from the state, said.\"The situation is extremely tense and victims are scared to return to their villages as they fear clashes could erupt again.\"Civilians were taken home after the completion of combing operations near the border areas, a Indian Army officer said on condition of anonymity. A dawn-to-dusk curfew will continue this week, he added.Police in Manipur's capital of Imphal said 62 people were killed in the fighting that had raged in the hills and some parts of the valley, but there was no violence over the weekend.Three politicians of the state's ruling Bharatiya Janata Party (BJP) said the death toll was around 70.Manipur Chief Minister N. Biren Singh told a press briefing late on Monday around 230 people were injured, 35,000 displaced, and about 1,700 houses burnt by protesters.",
        "\"The situation is slowly limping back to normal ... We shall order a high level probe to enquire into the violent clashes,\" he said.Rights groups in Imphal said tension started building last month after the Manipur High Court asked the government to consider the Meitei community's request to be given the constitutionally defined status of a scheduled tribe.The existing recognised tribes opposed the request.\"The tribal and non-tribal groups have had a history of jealousy over the distribution of economic resources and opportunities, but this time their anger just could not be contained,\" one of the participants in the peace talks, Khuraijam Athouba, said.India reserves some government jobs, college places and elected seats - from village councils to parliament - for those categorised as scheduled tribes, in a form of affirmative action to tackle historical structural inequality and discrimination.\"We are urging both sides to really put an end to the violence or they will have to live under strict curfew for months,\" said Athouba, a member of the Coordination Committee on Manipur Integrity. (Reporting by Rupam Jain and Zarir Hussain; writing by Sakshi Dayal; Editing by YP Rajesh, Clarence Fernandez and Andrew Heavens)"
    ]
}