{
    "articleURL": "/news/article-12052993/Coronation-mug-1660-market-55-000.html",
    "content": [
        "A 1660 Charles II Coronation mug sold is ow being put on sale for £55,000 The piece is thought to be one of four in existence and the first Coronation mug Your souvenir Charles III Coronation mug might be worth a fortune in the future – but you’ll have to wait a few centuries.",
        "A Charles II Coronation mug made in 1660 is being offered for sale for £55,000 following its discovery last year at a Buckinghamshire car boot sale, when it was reportedly picked up for just a few pounds.The piece – possibly the first Coronation mug ever made – is thought to be one of only four in existence. Eric Knowles, veteran ceramics expert on the BBC’s Antiques Roadshow, said: ‘It’s simply a jewel.’The couple who bought it sold it in December for £14,808 via Claydon Auctioneers in Buckingham. ",
        "But it went on to London antique dealers E&amp;H Manners, who will exhibit the ‘great rarity’ at The Treasure House Fair from June 22 to 26.Co-director, Errol Manners, said: ‘We’re hugely excited. It’s a great rarity… It’s just the icing on the cake that it coincided with the forthcoming Coronation.’Less than four inches high, it was made for drinking a loyal toast to the monarch, who was reinstated on the throne after the death of Oliver Cromwell.At that time, the only potteries that made this type of delftware were in London on the Thames in Southwark. There were about six ‘pothouses’ there. Of the surviving examples, two are in public collections, including the Museum of London.On May 29 1660, Charles II rode into London in triumph after landing at Dover. Weeks earlier, Parliament had despatched a delegation to Holland to invite him to return to his Kingdom.",
        "Mr Manners said: ‘Charles was greeted at St George’s Fields by the Lord Mayor of London in Southwark, the borough where our mug was made. ",
        "A huge procession, formed of the army, the London bands and City dignitaries crossed London Bridge. The parade took seven hours to pass, and it was already early evening by the time the King reached Whitehall. Charles was greeted by the assembled peers and MPs at the Banqueting House, which had been the scene of his father’s execution 11 years before. The Speakers of both houses greeted him with loyal speeches and the MPs queued to kiss his hand…‘Whitehall Palace was hastily refurbished, and a new crown commissioned. This, the St Edward’s Crown, is the one that is still used at the Coronation today. King Charles II was crowned at Westminster Abbey on 23 April 1661.’He added that the mug depicts the king in armour, which represented military prowess: ‘This is from the period, like we’re in now, just before he was officially crowned, but he was still called king.’"
    ]
}