{
    "articleURL": "/tvshowbiz/article-12059739/Victoria-Beckham-enjoys-vodka-jelly-shots-Guy-Ritchies-wife-Jacqui-Ainsley.html",
    "content": [
        "Victoria Beckham enjoyed shots of vodka jellies with Guy Ritchie's wife Jacqui Ainsley in snaps shared to her Instagram Story on Monday.",
        "The fashion designer, 49, looked chic in a navy blouse as she cosied up to the model, 41, in Guy's £50k BBQ tent before superimposing crown emojis on their heads. Joined by Bosnian model Andrea Rajacic, 37, the threesome soon sprawled out in the garden and soaked up the sun on picnic blankets.They had made some trendy outfit changes, with the former Spice Girl now sporting a light blue shirt, which she'd tucked into her jeans. Jacqui put on a fashionable display in a navy sweater for the shots, and later donned a light blue blouse and brown trousers. ",
        "Victoria and her husband David enjoyed Coronation celebrations with Guy and Jacqui over the bank holiday weekend, having not been invited to the big ceremony.The Beckhams took to their Instagram Stories to share a glimpse at the fun as they sipped on fizz and indulged with some scones.In one snap David looked smart in a navy suit jacket and chinos as he sat beside Guy while they relaxed with drinks.He captioned the snap: 'Celebrating in style' along with a crown emoji before showing off the delicious food they had including trifle and cakes.Meanwhile on Victoria's social media she posed with a glamorous Jacqui outdoors as Union Jack bunting was seen behind them.",
        "She penned: 'Love you poo!!! Amazing weekend celebrating with friends! Kisses!'Back in March, David first showed fans inside his latest cooking extravaganza, as he enjoyed a night inside one of Guy's tents.The sportsman shared a look inside the epic double tent, which boasts a 12-seat table and BBQ alongside a huge grill.",
        "The 'double tent' apparently can host up to 20 guests, however David's evening appeared to be a more intimate affair as he gave fans a look at what he was cooking.Sharing a snap of his fish in the grill alongside a hearty portion of vegetables, David revealed that the cooking experience was 'unbelievable'.David also shared pictures of the outside of the cooker and claimed it was 'by far the best fish I've ever eaten', while tagging Guy's brand Wild Kitchens.Clearly impressed by the set-up, the father of four said it was a 'thing of beauty', and also said 'it doesn't get any prettier'.Guy first unveiled his £50,000 luxury BBQ on the first day of the Chelsea Flower Show in September 2021.The director designed the outdoor grill to entertain celebrity guests all year round at his home, Ashcombe House near Salisbury, Wiltshire, which he bought with his ex-wife Madonna.He was joined by his ex-model wife Jacqui Ainsley as he launched the fire-table, which featured in his 2019 action-comedy The Gentlemen, at the Royal Horticultural Society's first ever autumn show.",
        "The BBQ obsessive, who previously admitted to having over 30 grills, has said the Wildtable is a 'brand new way to cook, gather and eat'.",
        "In the film, which stars Matthew McConaughey, Hugh Grant's sleazy journalist Fletcher said: 'So that heats up your knees and cooks at the same time.'Ha, you got to show me how to get one of them.'Guy and Jacqui often host outdoor meals for friends, including the Beckhams, using the grill on their 1,100-acre estate.Speaking of his love of barbecues, the film-maker, who also directed Lock, Stock And Two Smoking Barrels, said: 'There's just something about them. I'm a caveman in many ways.'His firm, The Cashmere Caveman Co, Wild Kitchens, said the Wildtable works by burning charcoal or wood under a glass lid in the centre with smoke drawn away by a flue.Prices range from £2,500 for a four-seater to £50,000 for a 12-seater in a kitchen in a dining tent.He told The Times: 'Well, we have a company called the Cashmere Cavemen Company.'I have a lot of time for cavemen. I like primitive man.'But I like the life of a primitive man in a romantic sense - you want to 'cashmere' it.'You want all the benefits of a very simple, primal natural life, with all the benefits of evolution and technology that we have managed to refine over the past few hundreds or thousand years, so you can have the best version of a natural life.'"
    ]
}