{
    "articleURL": "/tvshowbiz/article-12045571/All-Creatures-Great-Smalls-Rachel-Shenton-transforms-1940s-beauty-film-series-4.html",
    "content": [
        "Rachel Shenton was worlds away from her 1940s alter-ego as she resumed filming on the fourth series of All Creatures Great And Small on Tuesday.",
        "The actress, 35, who plays vet's wife Helen Herriot, was bundled up in a dry robe as she arrived on the set in Grassington, north Yorkshire, which has been turned into the fictional town of Darrowby for filming.Rachel donned a camouflage dry robe and a bright pink hairnet to protect her vintage curls as she prepared to film with co-star Anna Madeley.Anna, who plays stalwart housekeeper Mrs Hall, was equally bundled up ahead of the scenes.Removing her jacket, Rachel sported a pretty white floral dress and a green linen blazer, teamed with brown lace-up brogues.",
        "Samuel West, who plays Siegfried Farnon, and James Anthony-Rose were also spotted enjoying a ride in a vintage green sports car during the filming.Set during World War II, the show is based on the memoirs of vet Alf Wight - written under the pen name James Herriot.The period drama follows the life of veterinarian James, who has moved to the Yorkshire village of Darrowby in 1930s England.The North Yorkshire town of Grassington is used as a filming location, standing in for the fictional market town of Darrowby in the show. Rachel and her family's farm is located in the small village of Airton, which is a half-hour's drive from Grassington. In season three, Helen Alderson tied the knot with her on-screen husband James Herriot (played by actor Nicholas Ralph).",
        "Last year, All Creatures Great And Small was renewed for a third and fourth series.On the double series order, Sebastian Cardwell, Channel 5 said: 'It is clear that our viewers adore James Herriot's adventures in Darrowby and so do we at Channel 5.",
        "'I am looking forward to us all being reunited with the Skeldale House family when series three arrives on our screens this year.' Executive Producer Louise Pedersen, CEO of All3Media International, commented: 'All Creatures Great and Small has proven to be a perfect tonic for audiences around the world seeking a top quality production with a warm and positive view of the world.'We are pleased to be able to offer these further series to build the brand globally.' On the announcement of a third and fourth series, Jim Wight and Rosie Page, Alf Wight's children said: 'For many years the books of James Herriot have provided a source of comfort to tens of thousands of people worldwide at difficult times in their lives.'With this recent adaptation of his books, a new generation has been introduced to the joys of the Herriot stories.'We are delighted that there are to be at least two more series of All Creatures Great and Small, and we are especially pleased that the same excellent actors and producers are to be involved.' ",
        "Never out of print, the books have become a global cultural phenomenon with devoted fans around the world.All Creatures Great And Small will return to Channel 5 in the UK and PBS' Masterpiece streaming service in the US soon. "
    ]
}