{
    "articleURL": "/news/article-12060447/Police-launch-probe-cash-machine-blown-explosion-heard-miles.html",
    "content": [
        "Police were called to Fishponds Road at 4.30am today and closed the areaOne person said explosion caused 'humongous bang' and her building 'vibrated'A cash machine was blown up in an 'explosion' that could be 'heard for miles' around and damaged nearby cars.",
        "Police and Avon Fire and Rescue were called to Fishponds Road in Bristol at 4.30am today and promptly closed the road.Residents in the area shared on social media the cashpoint had been 'blown up' and saw multiple emergency services vehicles in the area. Photos from the scene show the cash machine completely destroyed, with debris and parts scattered across Fishponds Road.Police believe an amount of cash was stolen but they would not confirm how much. ",
        "Officers were at the scene on Monday morning to maintain a cordon on the pavement while National Grid workers assessed the damage. Several parked cars were also damaged in the incident while mangled pieces of metal laid on the pavement.A part of the wall at Lodge House also appears to show the impact of the explosion, which could be heard almost four miles away.The noise led many to come on social media this morning to ask what they had heard.One person wrote: 'Shook the entire house! So loud.' Another said: 'I was awake already so heard it loud and clear.'One woman added: 'I was going to sleep, and the next minute there was a humongous bang, and the building vibrated.'I looked outside and saw two fire engines, one empty bus and five or six police cars.",
        "'They closed the road and I could see alot of neighbours put their heads out of their windows.'",
        "A spokesman for Avon and Somerset Police shared: 'We are appealing for witnesses to come forward following an ATM being damaged in Bristol in the early hours of this morning (Monday, May 8). Police were called to Fishponds Road at about 4am following the incident. Avon Fire and Rescue Service also attended.'Officers found a cash machine had been damaged, along with a number of parked cars in the vicinity. A scene remains in place currently, but the road is open. Enquiries, including reviewing CCTV footage, are ongoing.'Anyone who saw what happened, has CCTV footage or any information is asked to call 101 and quote reference number 5223106495."
    ]
}