{
    "articleURL": "/tvshowbiz/article-12050181/The-cracks-Kym-Marsh-Scott-Ratcliffs-marriage-words.html",
    "content": [
        "Kym Marsh is set to divorce her husband Scott Ratcliff, it was claimed on Thursday after an apparent strike of the 'Strictly Curse', following 18 months of marriage. ",
        "The former Hear'Say star, 46, is said to have embarked on a 'trial separation' from the Army Major after the stress of their jobs consumed their romance, before finally calling it quits when she was on Strictly and he was placed in the barracks. According to The Sun, Kym and Scott decided to end their marriage due to the strain of work, but 'cracks' had been present in the relationship for some.While Kym lives in Cheshire, Scott is based in barracks down south meaning the couple struggled to spend quality time together - and Kym's intense Strictly rehearsals last year reportedly put further strain on the marriage.While the split may come as a shock to some, over the past year Kym has touched on the strains of her personal life, including the realities of being an army wife - branding things 'grim' when her husband is posted away from home. ",
        "In January last year, she revealed that two days after their wedding in October 2021 he was sent away for a fortnight - something she 'was not expecting' and branded life as an army wife 'pretty grim' due to the distance. As well as the stress of their distance, she admitted the danger of his job added to the problem as she was worried about war. ",
        "She said: 'There is always anxiety, it is always stressful when he goes away. There may not be an actual war threat currently but there's always a risk when you're in these dangerous places.'As well as her assessment of the distance in their lives, she also spoke about how Strictly exacerbated her anxiety - with training falling in line with Scott's time away with the Parachute Regiment - leaving the couple barely seeing one another. Speaking to OK! in January 2022, she said: 'It's been really good. Well, I say that, but we got married and then two days later Scott was sent away for two weeks and we weren't expecting that! That was a bit grim, but it's just part of being an army wife...'It felt like on the honeymoon I could properly celebrate being Mrs Ratcliff!'Scott detailed why he had to leave his new wife for work so soon after the wedding, adding: 'I do three terms per year at (military academy) Sandhurst and every term I'll go away for two weeks to run an overseas training exercise.'Aside from her life as an army WAG, she also spoke about how her time on Strictly increased her anxiety - just four months before her split was announced. ",
        "She said: 'I've always been open about my struggles with anxiety, and there were times on set where it reared its head and threatened to take hold...'I was nervous, but I discovered I could beat it and take control. That's the lesson I'll cherish most. I've realised how far I'm able to push myself and overcome things that I might think I'm too weak to do.'Kym stars in Waterloo Road and is a regular host of BBC1 daytime show Morning Live as well as appearing in theatre roles. A source told The Sun: 'They both really tried to make it work, but the cracks have been there for a while and they were only getting to see each other for one or two days a week at the very most.'They continued: 'They had a trial separation earlier this year and were hoping to get things back on track but they've decided it's best to go their separate ways.",
        "'It's very sad for all involved, but they've decided it's time to tell their family and friends and focus on the future - which means filing for divorce, they're hoping to keep things as amicable as possible. Hopefully time will help to heal things.'MailOnline have contacted Kym's representatives for comment.  ",
        "The Former Hear'Say singer - who is also mother to David, 27, and Polly, 12 - cut a very sombre figure as she was spotted out shopping on Thursday. Kym also had a son Archie, but he sadly died at 21 weeks in 2009.Kym was previously married to EastEnders' Jack Ryder from 2002-2009 and Hollyoaks' Jamie Lomas 2012-2014. ",
        "DAVE CUNLIFFE - 1994-1999Kym met Dave, a builder and the father of her children, David, 27, and Emilie, 26- in a karaoke pub in her home town in 1994 and were engaged until 1999.JACK RYDER - 2001-2009 Kym met EastEnders star Jack in the BBC canteen in 2001 after performing on Top Of The Pops while he was starring as Jamie Mitchell on the soap. They wed at St. Albans Parish Church in Hertford, in August 2002 and sold the pictures to OK for a reported £300,000.Their split was announced in March 2008 and they announced their divorce in August 2009. JAMIE LOMAS - 2009- 2014Kym and Hollyoaks' Jamie began dating in 2009, before she fell pregnant the following year, Tragically, at just 21 weeks Kym went into labour due to a condition that meant her body was rejecting the baby. Baby Archie died minutes after being born.The couple had happier news when they welcomed daughter Polly in March 2011. They wed in September 2012 but were divorced by 2014.OLIVER MELLOR - 2013In 2013, she dated her co-star Oliver, who is now married to Rhian Sugden, however they split soon after. He said after the romance: 'We planned a future together. We loved each other and we weren’t afraid to say it. It wasn’t something we intended to happen, but we couldn’t stop our feelings.'DAN HOOPER 2015-2015Kym began dating personal trainer Dan Hooper in April 2014. In whirlwind romance, they became engaged by the December the same year.Just five months later however they split in May 2015.Scott Ratcliff - 2019-2023Kym met her third husband Scott in 2019, before he asked for her hand in marriage in 2021 while ringing in her birthday.The married the same year however their split was announced in May 2023. "
    ]
}