{
    "articleURL": "/tvshowbiz/article-12048571/Vin-Diesel-Michelle-Rodriguez-promote-tenth-Fast-Furious-Fast-X-F1-Miami-Grand-Prix.html",
    "content": [
        "Vin Diesel and Michelle Rodriguez appeared at the Formula One Miami Grand Prix on Thursday to promote their new film, Fast X. ",
        "Diesel, 55, showed off his muscular arms in a black sleeveless top paired with bandana-embellished jeans and combat boots. Diesel, who plays the role of Dominic Toretto in the cinematic series, wore dark glasses as he leaned against a 1969 Dodge Charger RT alongside his co-star. Rodriguez, 44, who plays Letty Ortiz in the film franchise, wore a plunging silver top under a black button-up with white pants and sneakers. The Avatar actress - who put on an elegant display at the LA premiere of Dungeons And Dragons: Honor Among Thieves on Saturday - styled her long black wavy locks in curls over her shoulders and completed her look with a gold necklace and multiple rings on each hand. ",
        "Michelle's makeup was classically done, with a layer of mascara on her lashes and a smoky shadow around her eyes. Fast X will feature previous franchise stars Tyrese Gibson, Jordana Brewster, Ludacris, Nathalie Emmanuel, Sung Kang, and Scott Eastwood.The tenth installment also introduces newcomers Jason Momoa, Brie Larson, Daniela Melchior, Alan Ritchson, and Rita Moreno.Fast X is the first part of a two-part finale to end the series.The film is being directed by Transporter director Louis Leterrier, 49, who replaced Justin Lin, 51, after the F&amp;F franchise veteran dropped out a week after filming began due to creative differences. ",
        "Vin also is a producer of the sequel in addition to starring in it.The record-breaking action films have made over $6.6 billion at the box office, with Fast X due to be released on May 19. Last week, Diesel revealed that the eleventh and final Fast and Furious movie will release in 2025. ",
        "This means viewers will likely be faced with a cliffhanger - and won't find out what happens for a further two years. Speaking at CinemaCon in Las Vegas on Tuesday, Diesel said: 'This summer is only the beginning of Fast X. 'And with all of your effort and with all of your love and the fact that you are a part of our family, Fast X will continue.'And after this explosive summer, I will have the privilege of coming to you for Part 2 in 2025.' Vin, whose real name is Mark Sinclair, added: 'Fast is now the longest-running franchise in movie history featuring the same actors playing the same characters.'This is our family, the audience is our family, and as we were building towards this achievement we attracted directors who brought their own magic to the saga.'I'm proud to say for nearly two decades the films have been the most successful film of every one of our directors.'",
        "Director Louis Leterrier previously told Empire Magazine about what fans can expect from the final film: 'There's a war brewing. It's coming to an end, and it is a race to the finish.'",
        "The official synopsis for Fast X reads: 'The end of the road begins. Fast X, the tenth film in the Fast &amp; Furious Saga, launches the final chapters of one of cinema's most storied and popular global franchises, now in its third decade and still going strong with the same core cast and characters as when it began. 'Over many missions and against impossible odds, Dom Toretto (Diesel) and his family have outsmarted, out-nerved, and outdriven every foe in their path. 'Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever. 'In 2011's Fast Five, Dom and his crew took out nefarious Brazilian drug kingpin Hernan Reyes and decapitated his empire on a bridge in Rio De Janeiro. 'What they didn't know was that Reyes' son, Dante (Aquaman's Jason Momoa), witnessed it all and has spent the last 12 years masterminding a plan to make Dom pay the ultimate price. ",
        "'Dante's plot will scatter Dom's family from Los Angeles to the catacombs of Rome, from Brazil to London, and from Portugal to Antarctica. New allies will be forged, and old enemies will resurface. 'But everything changes when Dom discovers that his own 8-year-old son (Leo Abelo Perry, Black-ish) is the ultimate target of Dante's vengeance.' ",
        "The franchise started with the 2001 film The Fast And The Furious, which starred Vin as Dom and the late Paul Walker as Brian O'Conner.Paul died in November 2013 at age 40 from injuries sustained in a single-vehicle collision while riding as a passenger in a speeding car.He had not yet completed filming of the 2015 film Furious 7 at the time of his death, and his brothers Cody and Caleb were used as stand-ins to complete the rewritten film.Fast X will hit cinemas on May 19."
    ]
}