{
    "articleURL": "/news/article-12041183/Journalist-Ash-Sarkar-brands-Royal-Family-cartel-weird-people.html",
    "content": [
        "She once called for Britain's national anthem to be replaced by a 'grime banger'A republican journalist has triggered outrage after branding Britain's monarchy a 'cartel of some very weird people' that is 'neither fair nor representative'. ",
        "Ash Sarkar, senior editor at Novara Media, tore into the Royal Family in her latest controversial broadside against the Firm - just days before King Charles's coronation on Saturday.The journalist, who previously called for Britain's national anthem to be replaced with a 'grime banger', said young people interested in the 'values of fairness and representation' were increasingly becoming turned off by the royals. 'Whatever way you slice it, the monarchy is neither a fair nor representative institution,' Ms Sarkar told BBC's Newsnight on Tuesday. 'There have been attempts by the Royal Family to strip themselves of some of the mystery, invite the media in and show the public what they really do. And what they've revealed themselves to be is a cartel of some very weird people.'",
        "But the controversial media personality's claims triggered outrage online, with royalists branding her comments as 'nonsense' and a 'load of hot air', with one person saying: 'I have never heard so much rubbish in all my life.'",
        "Daniel Knowles tweeted: 'As someone on the right, I like hearing from you but this was total nonsense. Expecting the Royal family to behave perfectly is beyond irrational. 'Yes they have flaws and they try to hide them, as do most people. If you remove them, you leave a void. They aren't harming you.' ",
        "While others pointed out the value to the nation of having a Royal Family, which contributed £19billion to Britain's economy pre-pandemic, according to Forbes.'You completely miss the international effects, millions of Americans are only interested in Great Britain because of the Royal family, when that ends their interest ends. Great Britain shrinks on the world stage when that happens,' one person added.Although there was some support online for the journalist's comments, with one saying 'well done' and another adding she had 'hit the nail squarely on the head over the dysfunctional' Royal Family. It's not the first time Ms Sarkar has been blasted by Britons for her divisive opinions about the monarchy. In 2018 she appeared on GMB and sparked outrage when she demanded the national anthem, which at the time was 'God Save The Queen', was replaced by a 'grime banger' by Wiley.",
        "Viewers watching at home branded her comments as 'idiotic' on social media, with one accusing her of 'talking utter s***' on Twitter. And earlier this year, she used a slot on BBC Question Time to launch another attack on the royals, branding them a 'hideous cartel'.During her latest tongue lashing of the monarchy last night, she claimed social media and 24-hour press coverage had shown some of the Royal Family to be 'deeply unhappy by the institution that they were born into'.",
        "'The more unhappy you see them being, the less you're into it,' Ms Sarkar told the debate.   Her comments come days after a poll found nearly 40 per cent of 'Generation Z' are in favour of abolishing the monarchy.Some 38 per cent of  18 to 24-year-olds want to replace the Crown with an elected head of state, YouGov claimed.About a third of Gen Z back the Royal Family, while another 30 per cent said they did not know. ",
        "BBCAnd among the oldest group of those 65 and over, 78 per cent back the monarchy while just 15 per cent want it abolished.Another finding in the study was that 78 per cent of 18-24-year-olds are 'not interested' in the Royal Family.It also revealed that 40 per cent of that younger age bracket think it is bad value for money – although this falls to 32 per cent as a total figure across all age groups.Speaking during last night's debate on the BBC, TikTok historian Rosie Harte claimed young Britons were ignorant to the role carried out by the Royal Family, which was helping to fuel apathy towards the Windsors.She said: 'Young people don't understand the sort of messaging why they should care about the Royal Family (and) why they should feel that they're important in their lives.' ",
        "The debate comes as anti-monarchists led by the group Republic continue to threaten the upcoming Coronation at Westminster Abbey this weekend. ",
        "The campaign group,  led by chief executive Graham Smith, is planning big protests on Coronation Day in their bid to try and have the monarchy abolished. They have urged thousands to descend on the procession route between Buckingham Palace and the Abbey with yellow T-shirts and placards proclaiming 'Not My King'.It follows similar protests staged during official engagements attended by His Majesty King Charles earlier in the year.  Deputy Prime Minister Oliver Dowden said 'all necessary steps' will be taken to 'protect the integrity' of the coronation."
    ]
}