{
    "articleURL": "/wires/reuters/article-12053421/Reuters-Entertainment-News-Summary.html",
    "content": [
        "Following is a summary of current entertainment news briefs.",
        "Hollywood insiders predict writers strike to drag on through summerThe Hollywood writers' strike that kicked off this week could last well into the summer and likely beyond, top executives close to the discussions told Reuters this week. On day three of the walkout that has roiled the industry, the two sides remained so far apart that each side blamed the other for the abrupt end of 11th-hour negotiations to avert the strike. No new talks have been scheduled.On 'Star Wars' day, Carrie Fisher receives posthumous star on Walk of FameMay the 4th, the annual unofficial \"Star Wars\" day, was bittersweet for fans in Hollywood as Princess Leia actress Carrie Fisher, who died at age 60 in 2016, received a posthumous star on the Walk of Fame on Thursday. Along with a large group of fans, \"Star Wars\" droids R2-D2 and C-3PO and a pair of Stormtroopers came to the ceremony, as did actor Mark Hamill, director J.J. Abrams and Lucasfilm President Kathleen Kennedy.Warner Bros Discovery's surprise loss clouds strong streaming unit showWarner Bros Discovery Inc reported a surprise quarterly loss on Friday on costs tied to its 2022 merger, taking the shine off the first profit for its streaming business and sending the company's shares down 5%. The media company forged by the union of WarnerMedia and Discovery Inc recorded a $1.81 billion charge in the first quarter due to the merger, while also booking $95 million in restructuring expenses.",
        "Ed Sheeran did not violate 'Let's Get It On' copyright, US jury findsEd Sheeran's 2014 hit \"Thinking Out Loud\" did not unlawfully copy from Marvin Gaye's classic 1973 song \"Let's Get It On,\" a jury decided on Thursday in a closely watched copyright lawsuit - a verdict that the British pop star said would help protect the creative process for song writers in the U.S. and globally. The jury in Manhattan federal court determined that heirs of \"Let's Get It On\" songwriter Ed Townsend had not proven that Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing had infringed their copyright interest in the Gaye song. Sheeran hugged his attorneys in the courtroom after the verdict was read.Hollywood unions back striking writers as TV production slowsStriking film and television writers met with union leadership on Wednesday, the second day of a work stoppage that has thrown Hollywood into disarray as the industry deals with changes brought on by the streaming TV boom. Members of the Writers Guild of America (WGA) turned out for briefings from negotiators in New York and Los Angeles after walking picket lines in front of Netflix Inc, Walt Disney Co and other major studios.Hollywood studios push back against striking writers' claim of 'gig' workforce",
        "The group representing Hollywood studios fired back on Thursday at claims from striking film and television workers that they have been forced into the \"gig economy\" because of changes brought by the streaming TV era. Roughly 11,500 members of the Writers Guild of America (WGA) went on strike on Tuesday, saying that studios had \"created a gig economy inside a union workforce.\"'Guardians' Vol. 3, a bittersweet goodbye for eclectic space crewActor Chris Pratt, whose movie career took off with the first \"Guardians of the Galaxy\" in 2014, decided that he wouldn´t watch the third and final installment of the film franchise, until the world premiere in Los Angeles. Pratt had seen one or two short unfinished sequences of \"Guardians of the Galaxy Vol. 3,\" but at the premiere he took the time to savor the entirety of the swan song in Marvel´s \"Guardians\" trilogy.DeSantis signs bill allowing Florida board to cancel Disney dealsFlorida Governor Ron DeSantis on Friday signed a bill into law that gives a new board he controls the power to void development agreements its predecessor body signed with Disney - the latest episode in a feud between the conservative governor and the entertainment giant. Under the bill, which passed the Republican-controlled legislature largely along party lines, the Central Tourism Oversight District Board - whose members are appointed by DeSantis - can cancel any deals signed up to three months before the board's creation.",
        "Director Damien Chazelle to head Venice Film FestivalDamien Chazelle, the Oscar-winning director of hit movies \"La La Land\" and \"Whiplash,\" will head the main competition jury at this year's Venice Film Festival, organizers said on Friday. The Franco-American director, screenwriter and producer has close ties to the festival, having opened the prestigious event with two of his films in the past decade -- \"First Man\" in 2018 and \"La La Land\" in 2016."
    ]
}