{
    "articleURL": "/wires/ap/article-12057445/De-Gea-error-gifts-West-Ham-1-0-win-Man-United-EPL.html",
    "content": [
        "LONDON (AP) - David De Gea´s error in Manchester United´s 1-0 loss to West Ham loosened his team's grip on the final Champions League qualification place on Sunday.",
        "The Spain goalkeeper let Said Benrahma´s hopeful shot from 20 meters slip over his glove and into the net to condemn Erik Ten Hag´s team to back-to-back defeats in the Premier League, after a 1-0 loss at Brighton on Thursday.\"Mistakes are part of football and in this team you have to deal with it and bounce back because it is a team sport,\" Ten Hag said. \"Over the season, he is the one with the most clean sheets and also we did it as a team. It can happen, it´s football but everybody has to take responsibility.\"United now lies just one point ahead of a rapidly advancing Liverpool, albeit with a game in hand, but an eighth loss on the road this season could prove as costly for the visitors as it was priceless for West Ham.The Hammers climbed seven points above the relegation zone and are surely now safe ahead of two matches against AZ Alkmaar in the semifinals of the Europa Conference League.\"As players, you can´t help to look around you,\" West Ham midfielder Declan Rice said. \"To win this one was big to give ourselves a gap between ourselves and the bottom.\"",
        "De Gea´s match began inauspiciously when his poor clearance flew to the feet of Rice, whose run into the area was only curtailed by a last-ditch tackle from Wout Weghorst.",
        "Marcus Rashford curled over for the visitors while Bruno Fernandes and Antony smashed low shots narrowly wide.Christian Eriksen´s effort also floated too high before Rashford cut inside Thilo Kehrer and crashed his shot against the outside of the near post.The goal arrived in the 27th minute and it is not one De Gea will want to see again.Benrahma had few options as he drove forward with Aaron Wan-Bissaka, Victor Lindelof and Luke Shaw for company.The Algeria winger tried his luck from outside the area but his shot lacked any real menace and De Gea should have made a routine save.But the ball seemed to spin away from the Spaniard as he attempted to push it away, and instead it rolled almost apologetically into the net.\"In terms of shot-stopping, he´s made a mistake today but that´s not the area I question him,\" said former United defender Rio Ferdinand, working as a pundit for British broadcaster BT Sport. \"Is he a good enough footballer to play for Manchester United?\"The only person that can answer that is Erik ten Hag and we´ll know at the end of this season.\"United tried to hit straight back and Antony´s shot flicked the heel of defender Nayef Aguerd before clipping the far post.",
        "But the visitors had a lucky escape in first-half stoppage time when Benrahma broke through again. De Gea saved the winger´s initial shot and his attempt to turn the rebound back into the box clearly hit the arm of Lindelof.If anything, the Sweden defender got a better hand to it than his goalkeeper did for the goal, but the penalty appeals were waved away with the VAR apparently seeing nothing untoward.United got away with another after the break when De Gea went down as he was challenged by Michail Antonio at a corner, the West Ham striker ending up hooking the ball in only to be pulled up for a foul.Weghorst had United´s first shot on target as the hour mark approached, a tame effort from the edge of the box which was straight at Lukasz Fabianski.But West Ham, eager to put its relegation worries to bed with the Europa League Conference semifinals to look forward to, sensed something special and Tomas Soucek´s volley hit a post before the Czech midfielder´s header was ruled out for offside.Fabianski made late saves from Rashford and Anthony Martial but Ten Hag´s side offered little in its 57th match of a grueling season which, along with Liverpool, might just be catching up with them.",
        "\"We can't be sorry for ourselves,\" Ten Hag said. \"We have to keep going and show character. It´s only four games (left). You need energy. Get ready for the games, clear your head, energy, focus and go.\"___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}