{
    "articleURL": "/wires/afp/article-12055611/Pricey-training-complicates-US-pilot-diversity-push.html",
    "content": [
        "Caitlyn Blanco realized early on that there was no ready template to follow in her quest to become a professional pilot.",
        "A Latina female in a field traditionally dominated by white men, Blanco, 20, didn't know any pilots growing up, and nobody at her New York public school could advise her.\"And then when it came to looking into the colleges and how expensive it was, it was extremely scary,\" said Blanco, a junior at Farmingdale State College who is midway through her pilot training.Blanco's experience highlights the challenges facing the US aviation industry as it seeks to diversify the pilot workforce in a tight labor market.",
        "For more than a year, US airlines have been competing for trained pilots in a market roiled by the sudden surge in demand after the doldrums of Covid-19.That dynamic has resulted in labor contracts with hefty wage increases, as well as signing bonuses of up to $100,000.The staffing crunch has also generated concern in Washington from lawmakers who represent low-population areas that have seen service curtailed.A 2022 task force report identified a \"largely untapped\" solution: \"young people from currently underrepresented groups.\"But the report, developed by a US Federal Aviation Administration advisory panel, noted that pilot training costs can easily top $100,000, posing \"a significant barrier,\" particularly to students like Blanco, the first in her immediate family to go to college.",
        "- A 'dream deferred' -Besides tuition, the costs include tens of thousands of dollars in flight training for the multiple certifications in the Odyssey-like path to becoming a professional pilot.For Darrell Horton, the financial toll was simply too high when he entered college, leading him to the Marines before working in engineering and project management.But faced with a setback at his old employer and seeing headlines about a pilot shortage, Horton sensed an opportunity.",
        "At 37, the African-American Horton is more financially established, and, with his wife's encouragement, began training at United Airlines' Aviate Academy in Arizona in October 2021.\"It was a dream deferred for me,\" said Horton, who describes flying as \"a magical feeling.\"United Airlines pilot Khaled Chebli also came to the cockpit later.Chebli was bitten by the aviation bug early, but not knowing any pilots, pursued a career in information technology. But \"the stars aligned,\" said Chebli, who met the pilot of his firm's corporate jet, a female, who became a mentor.Chebli, 35, avoided a heavy debt toll by taking pilot classes on the side while staying in his job.He has helped start a New Jersey nonprofit to mentor and provide scholarships to high school students interested in aviation.\"It's historically been such an expensive field to break into that you've almost had to come from a certain demographic financially to be able to afford flying,\" Chebli said.",
        "\"When I was in high school, I had no idea how to be a pilot,\" he said. \"You don't see pilots out in the wild.\"- Long road -At Farmingdale, which is about an hour car-ride away from Blanco's Queens home, less than a third of the entering class makes it through to becoming pilots, said aviation program director Michael Canders.",
        "Many exit quickly when they realize the hours of classroom work before they even get up in the air.A \"passion for flying\" is the most important trait needed to undertake the years of training, he said, adding, \"that's really what carries them through.\"Blanco was around six when she became enamored of flying, watching the planes at JFK Airport near her home.She credits her mother with finding aviation networks that ultimately led her to Farmingdale. A Women in Aviation event at LaGuardia Airport also helped.While a New York State scholarship covers her tuition, Blanco works three jobs to cover daily living expenses, plus flight hours, which come to $18,000 a year.Of the $9,000 for the current semester, she can pay $6,000 and is taking the rest in loans.Blanco recently attained instrument certification, a second major stepping-stone after the private pilot license. She hopes to work as a flight instructor at Farmingdale after graduating, enabling her to build enough flight hours to be hired by a regional carrier in about three years.",
        "Instrument certification involves the use of navigation tools when visibility is poor. The process culminates in a test flight where the student pilot wears \"foggles,\" view-limiting eyewear that block everything but navigation tools.While Blanco felt relief at passing instruments, she is focused on the next step in the journey: a commercial license.\"Finances have caused a lot of stress, but I will not let that discourage me because I know it will pay off in the future,\" she said."
    ]
}