{
    "articleURL": "/tvshowbiz/article-12038433/Anna-Faris-looks-unrecognisable-brown-wig-oversized-suit-films-Spy-2-Venice.html",
    "content": [
        "Anna Faris was spotted filming scenes on a ferry for upcoming comedy My Spy 2 in Venice, Italy on Tuesday.",
        "The actress, 46, looked unrecognisable in a long brown wig as she spoke into a microphone to a whole host of extras that appeared to take on the roles of tourists.Anna sported dark eye make-up and an oversized brown suit as she put on a very animated display. The Mom star completed the look with suede heels as she battled the torrential downpour. My Spy 2 is the sequel to 2020's comedy My Spy, which starred Dave Bautista and Chloe Coleman. ",
        "In February Deadline broke news that Prime Video had reenlisted Bautista, Coleman, Kristen Schaal, and Ken Jeong for the part two.And announced as newcomers were Faris, Craig Robinson, and Flula Borg.The original movie told the story of JJ (played by Bautista), a CIA operative who crossed paths with Sophie (Coleman), an astute nine-year-old girl.They met after JJ was assigned to monitor Sophie's family.Schaal portrayed the role of Bobbi, JJ's tech specialist colleague, and Jeong played David, his boss.My Spy was written by Jon Hoeber &amp; Erich Hoeber and directed by Peter Segal.Last month Anna's ex-husband Chris Pratt opened up about meeting his second wife, Katherine Schwarzenegger, while on The Drew Barrymore Show. The Guardians of the Galaxy actor, 43, gushed over seeing her for the first time when he was at church.",
        "He explained to Barrymore, 48, that 'there was a moment in my life where I was really struggling and felt really broken,' before he met Katherine, 33.Pratt went on to tell the whole story about how he met the rising author 'five, maybe six years ago. God has a fast-forward button, you know, when it's right, boom.'You get hit, you fall in love, you get married, now we have two beautiful daughters to add to my family. It feels really great.'The Jurassic World actor also shares his 10-year-old son Jack with his ex-wife Anna, who he was married to from 2009-2018.'There was a moment in my life where I was really struggling and felt really broken. For me, my own journey of finding a higher power and leaning on that and feeling like, \"Please save me,\" and feeling saved,' Pratt shared.",
        "'And shortly later, meeting the woman of my dreams. It's all about timing. There's a perfect plan out there for you. You have to have faith.'The Charlie's Angels actress then asked him if he had met his now-wife in a place of faith, to which he responded, 'Yeah, we met at a church. I was in the front row of church.'And you kind of don't want to be like, \"Woah, who's that?\" at church. But I was sneaking some glances and wondering, \"Who is that? Anyway, what am I doing? Come on, I'm broken, help me. But who's that?\"'",
        "He continued, 'So we hit it off. We didn't start dating right away, but we met there and, later on, ended up going out.'The pair welcomed their first daughter Lyla in 2020, only a year after they got married, and their second daughter Eloise in 2022."
    ]
}