{
    "articleURL": "/tvshowbiz/article-12042849/Priyanka-Chopra-gets-candid-botched-early-2000s-surgery-led-Plastic-Chopra-nickname.html",
    "content": [
        " Priyanka Chopra has opened up about the botched face surgery in the early 2000s which led to her being called 'Plastic Chopra'.The 40-year-old actress - who attended the Met Gala with husband Nick Jonas on Monday - got candid during a recent appearance on SiriusXM’s The Howard Stern Show about about the removal of a polyp in her nasal cavity that went wrong .",
        "She explained: 'This thing happens, and my face looks completely different, and I went into a deep, deep depression.'Chopra said that she was fired from movie projects and even had fears that the botched surgery would prematurely end her career.At the time she was hesitant to go under the knife but it was her late father Ashok - who happened to be a doctor himself - who persuaded her to undergo a corrective surgery.",
        "She explained: 'I was terrified of that, but he was like, \"I will be in the room with you.\"'He held my hands through it and helped me build back my confidence.'As far as getting back her confidence on the big screen, Chopra credited Bollywood director Anil Sharma for helping her assuredly get back in front of the camera.She explained: 'I was supposed to play this lead, and I was shifted to a supporting character. That filmmaker was very kind.'He, while the tide was against me, said, \"It will be a small part but give it your all.\" And I did.'Chopra went into more detail about the botched surgery and aftermath in her autobiography - titled Unfinished - which was released in February 2021.At the time she said it led to some haters calling the former beauty pageant queen 'Plastic Chopra.' ",
        "She was a young adult when she noticed a benign growth in her nasal cavity that needed surgery to be removed.",
        "'Fortunately, a polypectomy sounded like a pretty routine procedure. Unfortunately, it wasn't,' she wrote in her book. The surgeon 'accidentally shaved the bridge of my nose and the bridge collapsed.' And the star, who had already became famous in her native India for her looks, was left 'horrified.''My original nose was gone,' Priyanka shared. 'My face looked completely different. I wasn't me.'The bad surgery lost her work - she says in the book she was fired from two movies.'All the talk of body parts and skin tone collectively made me feel devalued and unseen and uncertain about my future,' said the Baywatch star. 'Having experienced the aftermath of a supposedly simple polyp removal, I knew I wasn't willing to follow the course he'd laid out for me, even if he, as the highly successful expert, was right,' she added.'… My difference is my strength. If I looked like other \"classically beautiful\" girls, then I wouldn't stand out, and more important, I wouldn't be me.'Priyanka had 'several corrective surgeries' and has now 'gotten accustomed to this face.'",
        "'Now when I look in the mirror, I am no longer surprised; I've made peace with this slightly different me…I'm just like everyone else: I look at myself in the mirror and think maybe I can lose a little weight; I think maybe I can work out a little more. But I'm also content. This is my face. This is my body. I might be flawed, but I am me,' she added.",
        "And at the time the red carpet favorite refused to explain what happened.'I was dared to give an explanation for the obviously different nose, but I chose a course then that I've followed in all the years since. I decided that there was a line I was going to draw in my life,' wrote the wife of boy bander Nick Jonas.She felt she did not owe anyone an explanation.'I am an entertainer,' she began. 'That's what I've signed on to do, and that's what I love doing. I will say my lines, dance my dance, hit my mark. I'll do my best to make you laugh, and I'll do my best to make you cry, but just because I'm a public person doesn't mean everything about my life has to be public knowledge. I get to choose what I share and when I share it.'Chopra can currently be seen starring alongside Richard Madden in spy thriller television series Citadel which is currently streaming on Amazon Prime Video. "
    ]
}