{
    "articleURL": "/news/article-12052297/Trump-impersonator-says-Donald-stole-work-passed-own.html",
    "content": [
        "Comedian John Di Domenico has been a Trump impersonator for 20 years and told DailyMail.com that Donald has been stealing his comedy materialHe pointed out several lines from his comedy routines that Trump has used as his own, including calling Covid 'Kung Flu'Di Domenico, 60, said Trump advisor Kellyanne Conway told him the ex president watches him and likes his sketches A top Donald Trump impersonator claims the former president has flipped the script and is using his comedy material in real life.",
        "Comedian John Di Domenico's Trump character has been featured on Jimmy Kimmel, The View, Conan, Howard Stern – and even performed at Trump's 55th birthday party.Speaking exclusively to DailyMail.com, Di Domenico gave examples of Trump allegedly stealing his best lines, including calling Covid 'Kung Flu', claiming that courtroom staff were 'crying' over his arraignment, quipping that he would be sworn in as president on his book The Art of the Deal instead of the Bible, and that his March 2020 Covid test was 'so negative it was almost positive'.Di Domenico, 60, said Trump's close friend and senior advisor Kellyanne Conway told him the ex-POTUS watches and even likes his sketches, because 'I am the nice Trump impersonator.'",
        "'I am asking whether he is listening to my work and then repeating some of it?' the comic told DailyMail.com in an interview last month.'I'm so happy that I'm inside this guy's head and that I can write the material to the point where I can predict what he's going to say.'I'm kind of like the AI [artificial intelligence] for Trump. I'm the predictive text for Trump.'Di Domenico, who has been performing his Trump character since 2004, said he finally decided to speak out about the apparently lifted lines when he saw Trump on Tucker Carlson's now-defunct Fox News show on April 12.",
        "Trump told Carlson that courtroom staff were crying and apologizing at his April 5 arraignment in New York on 34 charges of falsifying business records.'People that work there were crying, they were actually crying,' he told the recently fired anchor. 'They said ''I'm sorry.''... Tears were pouring down.'Six days earlier, Di Domenico had impersonated Trump on Howard Stern's Sirius XM radio show and said guards were 'crying their eyes out' at his arrest.'Once again, I was ahead of the curve,' Di Domenico told DailyMail.com. 'But there are certain things I can't take too much credit for, because there are certain things he's going to say. And I just wrote that in and it just hit perfectly.'The comedian cited several other moments where life imitated art, with the ex-Commander-in-Chief appearing to reference comic material Di Domenico had written beforehand.",
        "In 2017 while impersonating Trump on a morning news show Di Domenico said: 'Instead of the Bible, I'm going to be sworn in on Art of the Deal.'The following year former White House staffer Omarosa Newman wrote in her memoir, Unhinged, that Trump asked her in the days leading up to his inauguration: 'Omarosa, what do you think about me getting sworn in on The Art of the Deal?'",
        "Di Domenico says he coined the controversial term 'Kung Flu' for Covid in a March 27 2020 video. 'We're looking at legal remedies, we are going to sue the Kung Flu,' he said.Then at a campaign rally on June 20 that year, Trump said: 'It's a disease, without question, it has more names than any disease in history. I can name, Kung Flu, I can name 19 different versions.'On Mar 25, 2020 Di Domenico posted a video as Trump, boasting that his coronavirus test was 'perfectly negative… it was the greatest negative score'.'They said it was beautifully negative, they were very impressed. It was perfect. It was perfectly negative,' he said.Then in a May 2021 interview before getting on his chopper Trump told reporters he tested 'positively towards negative… perfectly.''I tested positively towards negative, right? I tested perfectly this morning,' the then-POTUS said.On November 7, 2020, the day after Trump lost the presidential election, Di Domenico posted a video where he played the president saying: 'There will be rioting and looting like you have never seen before' – an eerie prediction of the January 6 riots.Di Domenico spoke exclusively to DailyMail.com at the 2023 Cheer Choice Awards at The Palms Resort in Las Vegas on April 15. He was a presenter at the event, which honors creators making an impact on social media.",
        "Emmy nominated Di Domenico has spent almost 20 years doubling as Trump, appearing on dozens of TV shows at home and abroad like Conan, Chelsea Handler and Jimmy Kimmel.During an appearance on Fox News, ex White House advisor Kellyanne Conway revealed that The Apprentice star was a 'huge' fan of his work.Knowing that Trump watches his work has Di Domenico wondering whether the 2024 candidate is inspired by his comedy scripts, which have generated millions of views on YouTube.'We all know that he loves people who talk about him. He loves people who impersonate him,' said Di Domenico. 'I was on Fox News and Kellyanne was there, and she told me specifically that he watches me and he likes me because I'm ''the nice Trump''. I made him warm and funny and I think he appreciates that.'Laughing about being an influence on Trump's policies, he added: 'Yes, it concerns me. I have to be very careful with what I want, with what I write.'In a sense it's flattering that over a number of years I was kind of ahead of him on a few things, but I think he's pretty much on his own when he's coming up with his ideas.'Di Domenico is not shocked that the demand for his Trump impersonations remains enormous despite not being in power.",
        "'The first time people would say, what if he doesn't win? I said, he's not going anywhere. The guy's always been here. He's like this American archetype. And when he lost this time, people asked: ''what are you going to do now?'''I'm going to keep doing the same thing. He's not going anywhere. I think people have to realize that in office, out of office, businessman, whatever he is doing, he has to be front and center because that's who he is.'So, to me, it doesn't affect me too much with everything that's happening. It just gives me more material, a different perspective and kind of a fresh take on it.'",
        "Di Domenico has become the most high profile Trump impersonator over the last 19 years.He appears regularly on Sirius XM's Stern show with X-rated skits discussing the politician's campaigning, his scandalous alleged affair with porn star Stormy Daniels, his marriage to Melania and relationship with Joe Biden.The Las Vegas-based performer, who writes scripts and shows around the character, has made headlines before after dealing with angry Trump supporters and annoyed Democrats.Domenico revealed he has needed security at many events following some physical attacks and threats.While Domenico stays silent about his earnings, top impersonators can earn up to $30,000 for MC-ing at a conference, $10,000 for doing 45 minutes of jokes as dinner entertainment, $1,500 for an hour-long appearance at a party, and anywhere from $125 to $3,000 for a custom video or Zoom appearance"
    ]
}