{
    "articleURL": "/wires/reuters/article-12045865/FOREX-Dollar-pressure-Fed-eyes-ECB.html",
    "content": [
        "By Alun John and Rae Wee",
        "LONDON, May 4 (Reuters) - The dollar remained pressured against most majors on Thursday, helping Sterling to its strongest in 11 months, after the Federal Reserve hinted at pausing its aggressive tightening cycle, and ahead of a significant European Central Bank meeting.Markets were also buffeted by risk aversion amid a rout in regional U.S. bank shares, which further supported market expectations of rate cuts later in the year.The euro was last down slightly on the day at $1.1044, having jumped 0.57% on Wednesday.The pound was last flat at $1.2566, but in Asia trade hit $1.2595, its highest since June 2022, and the Swiss franc reached 0.88215 per dollar, its strongest since January 2021, before softening.The narrowing rate differentials between the U.S. and Europe, as markets price in more European rate increases than in the U.S., has been boosting European currencies in recent months.The Fed on Wednesday raised its benchmark overnight interest rate by a quarter of a percentage point, as expected, but dropped from its policy statement language that it \"anticipates\" further rate increases would be needed.\"If this does prove to be the last hike of the cycle, the next big question for FX markets will be: how long will rates remain at these levels?\" said HSBC analysts in a note.",
        "The Fed has guided markets away from the possibility of rate cuts this year, though markets are pricing them in nonetheless.\"If the Fed is proved right over the course of 2023, then it will make it harder for the USD decline to extend later in the year.\"\"But for the time being, the market is likely to run with the theme of a peak in Fed rates justifying a clear peak in the USD and an ongoing reduction in the greenback's residual overvaluation,\" said HSBC.Money markets are now pricing in a slightly more than 10% chance the Fed will begin cutting rates in June, and expect roughly 80 basis points of rate cuts through to the end of the year.The European Central Bank announces its rate decision later in the day. Market positioning is for a 25 basis point increase, though it reflects a chance of a larger 50 bp increase.Traders will also be closely watching the ECB statement and governor Christine Lagarde's press conference for indications about the central bank's future rate path, with expectations being the ECB has not finished raising rates.Adding to expectations the Fed will soon have to begin easing monetary conditions were lingering fears of banking sector turmoil, intensified by news that PacWest Bancorp is exploring strategic options. The Los Angeles-based lender said it has been approached by several potential partners and investors.",
        "\"There are a lot of concerns in the U.S. around the banking sector and the crunch on credit. This is a credit event and that feeds through to the economy quite quickly,\" said Jarrod Kerr, chief economist at Kiwibank.\"So I think central banks, including the Fed, are at or very near the peak in their cash rates.\"The cautious risk sentiment kept the Japanese yen - a traditional safe haven in times of market turmoil - well supported, with the currency at 134.71 against the U.S. dollarThe dollar fell 1.4% against the yen on Wednesday, with the rate sensitive Japanese currency supported by a slide in U.S. Treasury yields.The Norwegian crown took a short trip after Norway's central bank raised interest rates by 25 basis points as expected. It initially softened sharply against the euro and dollar, but recovered.The dollar was last down 0.4% at 10.715 crowns, the euro was last down 0.7% at 11817.(Editing by Robert Birsel)"
    ]
}