{
    "articleURL": "/wires/ap/article-12051825/CDCs-Rochelle-Walensky-resigns-citing-pandemic-transition.html",
    "content": [
        "NEW YORK (AP) - Dr. Rochelle Walensky, the head of the Centers for Disease Control and Prevention, submitted her resignation Friday, saying the waning of the COVID-19 pandemic was a good time to make a transition.",
        "Walensky's last day will be June 30, CDC officials said, and an interim director wasn´t immediately named. She sent a resignation letter to President Joe Biden and announced the decision at a CDC staff meeting.Walensky, 54, has been the agency's director for a little over two years, and the announcement took many health experts by surprise. In her letter to Biden, she expressed \"mixed feelings\" about the decision and didn't explain exactly why she was stepping down, but said the nation is at a moment of transition as emergency declarations come to an end.\"I have never been prouder of anything I have done in my professional career,\" she wrote.The World Health Organization said Friday that COVID-19 no longer qualifies as a global emergency, and the U.S. public health emergency will expire next week. Deaths in the U.S. are at their lowest point since the earliest days of the coronavirus outbreak in early 2020.The CDC, with a $12 billion budget and more than 12,000 employees. is an Atlanta-based federal agency charged with protecting Americans from disease outbreaks and other public health threats.",
        "Walensky, previously an infectious-diseases specialist at Harvard Medical School and Massachusetts General Hospital, had no experience running a government health agency when she was sworn in on the first day of the Biden administration.",
        "She came with a reputation as a prominent voice on the pandemic, sometimes criticizing how the government was responding. She was brought in to raise morale at the CDC, to rebuild public trust in the agency and to improve its sometimes-bumbling response to the pandemic.At the time of her arrival, more than 400,000 U.S. COVID-19 deaths had been reported, and states were scrambling to get supplies of new vaccines. Morale at the CDC was abysmal. The Trump administration had marginalized the agency, with the White House taking over the government's messaging about the pandemic and sometimes opposing or undermining what the CDC wanted to do.\"No CDC director in history inherited the set of challenges she faced coming into the job,\" said Jason Schwartz, a health policy expert at the Yale School of Public Health.The CDC regained prominence in government messaging - although even under Biden, the White House remained at center stage in the handling of the response, Schwartz said.She leaves at a time when the national COVID-19 death toll stands at about 1.1 million. Reported cases, hospitalizations and deaths have all been trending down for months.At CDC, Walensky started a center for forecasting and outbreak analytics and took steps to modernize data collection and analysis. Last year, she began a reorganization designed to make the agency more nimble and to improve its communications with the public.",
        "Biden, in a statement, said Walensky \"leaves CDC a stronger institution, better positioned to confront health threats and protect Americans.\"White House Chief of Staff Jeff Zients applauded her performance.\"Her creativity, skill and expertise, and pure grit were essential to our effective response and an historic recovery that made life better for Americans across the country,\" Zients said in a statement.There were stumbles during her tenure too.In the spring of 2021, Walensky said fully vaccinated people could stop wearing masks in many settings, only to reverse course as the then-new delta variant spread. In December 2021, the agency´s decision to shorten isolation and quarantine caught many by surprise and caused confusion.Also, Walensky and other U.S. officials were criticized last year for not being aggressive enough against an emerging mpox outbreak that faded in the late summer and fall.Jennifer Nuzzo, a pandemic expert at the Brown University School of Public Health, is worried that the proposed reforms won´t happen without Walensky there to drive them.\"CDC is exhausted. They have been working around the clock, nonstop, for three years with little gratitude,\" she said. \"To have a leadership change in the midst of all that ... I can't imagine that doesn't take the wind out of the sails of change.\"",
        "___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}