{
    "articleURL": "/wires/pa/article-12044095/A-special-night--Erling-Haaland-proud-setting-Premier-League-goals-record.html",
    "content": [
        "Manchester City forward Erling Haaland reflected on a “special night” after his strike against West Ham earned him the record of scoring the most goals in a single Premier League season.",
        "Haaland claimed the achievement in the 70th minute when he raced through on goal from Jack Grealish’s pass and chipped Lukasz Fabianski to reach 35 league goals this term.It moved the Norwegian beyond Andy Cole and Alan Shearer, who had previously held the record for their efforts in the 1993-94 and 1994-1995 seasons respectively.“A special night and special moment. Yeah I’m really happy and proud,” Haaland told Sky Sports.",
        "“Of course I knew about it. Of course but we try to create the chances to score goals. It was not easy.“They came here to try to defend for 90 minutes and we struggle a bit in the first half but second half, Nath (Ake) scored, I scored and the last one Phil (Foden) of course scored so it was an important win.”An early penalty at Fulham on Sunday saw Haaland equal the 34-goal tally achieved by Cole and Shearer, but he was forced to wait a few days before he moved in front outright.His City team-mates gave the summer arrival a guard of honour at full-time following his achievement in a 3-0 win that moved Pep Guardiola’s side back to the Premier League summit. I will go home now and play some video games, eat something and then sleep. That's what I'll do and tomorrow we have to start thinking about Leeds. That's my life  Erling Haaland  ",
        "The next individual target in Haaland’s sights is Dixie Dean’s feat of 63 goals for Everton in the 1927-28 campaign.But Haaland, on 51 goals for the campaign, insisted: “No, I don’t think of this now. I will sleep on this game and wake up tomorrow and I think of trying to get three points here against Leeds.“It will not be easy with a new manager and everything, but we cannot keep thinking about these records. My head would become crazy, I would become crazy in my head so I don’t think of this.“I will go home now and play some video games, eat something and then sleep. That’s what I’ll do and tomorrow we have to start thinking about Leeds. That’s my life.”Haaland revealed team-mate Grealish had wanted to be the player to set up his record-breaking goal.The three points for City kept them firmly in control of the title race and on course to clinch the treble, but 22-year-old Haaland reiterated their focus will stay on the next game at home to Leeds on Saturday.“You see what my first thought is, to run towards the goal,” Haaland added.“Me and Jack spoke about it before the game. He wanted to give me the assist for the record-breaking goal and I knew I would get the ball there. I saw the keeper coming and it was a perfect ball from Jack.",
        "“It was a nice feeling, as every single goal I score and especially to win the game is also really important. It was really painful this guard of honour. Everyone hit me in the back, but it was a nice thing and I’m really happy.“As I said, everyone knows it is possible (the treble) but we cannot think of FA Cup final against Manchester United now. We play against Leeds in three days and if you do this, you are not good in your head.“So, you have to think of the next game and focus because every single game, the last nine games are all finals.”Fellow goal-scorer Nathan Ake hailed his “humble” team-mate.“It’s crazy. You know the way he came in and does what he does every day, today again scoring the goal,” Ake told Sky Sports.“He honestly deserves everything he gets, he works so hard and he’s a top player.“The way he works hard, the way he is for the team and how humble he stays after all the way. He is a great addition and hopefully he can score even more.”"
    ]
}