{
    "articleURL": "/wires/ap/article-12056627/Monaco-beats-Angers-strengthen-grip-European-place.html",
    "content": [
        "Alexandre Lacazette and Elye Wahi each scored four goals but only one of the strikers saw their team win Sunday as Lyon overturned a three-goal deficit to beat Montpellier 5-4 in a French league match full of twists and turns.",
        "Lacazette completed his quadruple deep in added time from the penalty spot. His shot to the top right corner sparked wild celebrations in the stands that lasted long after the game was over.It was the first time in the league that both teams had one of their players scoring at least four goals since Reims beat Monaco 8-4 in 1974.\"We played with character and managed to come back, with the support of the fans,\" Lacazette said.Lacazette - the league's top striker alongside France star Kylian Mbappé - took his tally for the season to 24 goals as seventh-place Lyon kept alive its hopes of qualifying for a European competition next season.Mbappé scored his 24th league goal during PSG's 3-1 victory at struggling Troyes. It was a welcome win for the defending champion, following a turbulent week which included a home loss and Lionel Messi´s suspension for making an unauthorized trip to Saudi Arabia.",
        "The win in Troyes extended PSG's lead over Lens at the top of the standings to six points, with four games left to play.Mbappé broke the deadlock after seven minutes and Vitinha doubled PSG's lead near the hour mark. Troyes did not offer much until starting to press in the last 10 minutes, and the change in attitude was rewarded by Xavier Chavalerin's goal in the 82nd minute. Fabian Ruiz sealed PSG's win soon after with a left-footed shot.",
        "Montpellier led 4-1 after Wahi completed his own quadruple in the space of 15 minutes. The 20-year-old forward now has 17 league goals. Gifted with speed and great technical skills, Wahi is reportedly sparking interest from Premier League clubs, including Arsenal and Tottenham.\"We are disgusted, we had done the hardest (work),\" Montpellier midfielder Jordan Ferri said.It brought back bitter memories for Montpellier of an epic match the club lost to Marseille in 1998 after leading 4-0 at halftime at the Stade Velodrome. Forty five minutes and five goals later - including two from France international Christophe Dugarry and a stoppage-time penalty by Laurent Blanc - who is now coaching Lyon - Marseille had turned things around to win 5-4.Lacazette broke the deadlock in the 30th minute on Sunday after an uneventful start to the game but Wahi made the most of two consecutive mistakes from defensive midfielder Johann Lepenant to put Montpellier in the driving seat five minutes before halftime.Wahi then gave Montpellier a two-goal lead from the penalty spot and completed his quadruple on the counter in the 54th minute.Whistled by its fans, Lyon did not give up.Lacazette pulled one back in the 58th before Dejan Lovren headed home a precise cross from Maxence Caqueret. Lacazette scored again in the 81st minute as Montpellier crumbled under pressure and Lyon continued to press to snatch the win in added time.",
        "MONACO STRENGTHENS GRIPWith the race for European spots heating up, Monaco put daylight between itself and its pursuers with a 2-1 win at last-place Angers.Monaco strengthened its grip on fourth spot behind the leading trio of PSG, Lens and Marseille by moving five points clear of Lille. The fourth-place side in Ligue 1 qualifies for the Europa League.Lille lost ground on Monaco when Reims snapped a three-match losing streak thanks to Marshall Munetsi´s winner on Saturday. Trailing three points behind Lille, sixth-place Rennes also misfired, losing 2-1 at Nice.Monaco did not play particularly well against already-relegated Angers. But a superb shot from outside the box into the top right corner from Aleksandr Golovin coupled with Myron Boadu's finish in the 60th minute were enough to secure the win, although Abdallah Sima's header four minutes later ensured a tense finish.OTHER RESULTSNantes remained in the relegation zone after slumping to a 2-0 home loss against Strasbourg that extended its miserable winless run to 11 matches.Ibrahima Kone scored twice as Lorient beat Brest 2-1. Ajaccio and Toulouse drew 0-0 while Clermont held Auxerre 1-1.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}