{
    "articleURL": "/wires/reuters/article-12039155/Tinder-parent-Match-sees-weak-second-quarter-revenue.html",
    "content": [
        "By Akash Sriram",
        "May 2 (Reuters) - Match Group on Tuesday forecast second-quarter revenue below analysts' expectations, but said it is seeing signs of growth at Tinder after it made changes at the dating platform.Tinder has undergone changes to product and marketing execution and though those optimizations are not visible yet in the financial results, it is seeing early signs of greater momentum, Match Group said in a letter to shareholders.Shares of the company, whose revenue per paying user grew by about 2% from a year earlier, rose 3% in volatile trading after the bell.Match, which also announced a $1 billion share buyback program, said paying users and direct revenue for its flagship app Tinder were little changed in the first quarter from a year ago, the company said.\"Online dating, though resilient in recent history, is beginning to feel the pressure of tightening wallets and ARPU (average revenue per user) can be expected to decline industry-wide throughout the rest of 2023,\" said Nicholas Cauley, an analyst at Third Bridge.The company forecast current-quarter revenue between $805 million and $815 million, compared with analysts' average estimate of $822.3 million, according to Refinitiv.Dating app Hinge introduced a two-tier subscription model, giving users more options, which is expected to increase the average revenue per user and bring in more paying users.",
        "The company said negative foreign exchange impact in the reported quarter was $35 million, $7 million more than it had anticipated in its fourth-quarter earnings call.Match Group said it saw paying users across its family of dating apps fall 3% from a year earlier to 15.9 million.The company reported revenue of $787 million in the three-month period ended March 31, compared with analysts' average estimate of $793.8 million.Net profit fell to $120.8 million, from $180.5 million, a year earlier. (Reporting by Akash Sriram in Bengaluru; Editing by Shailesh Kuber)"
    ]
}