{
    "articleURL": "/wires/ap/article-12044177/Lionel-Messi-set-leave-PSG-end-season.html",
    "content": [
        "Lionel Messi is set to leave Paris Saint-Germain when his contract expires at the end of the season after two years with the French club, a person with knowledge of the situation told The Associated Press on Wednesday.",
        "The person spoke on condition of anonymity because they were not authorized to publicly comment on the Argentine great's status.The person said Messi's departure was a mutual decision, with his contract effectively allowed to run down since January.The news comes a day after PSG suspended the seven-time Ballon d'Or winner following his trip to Saudi Arabia without the club´s permission.Messi has a commercial contract with Saudi Arabia to promote tourism in the Middle Eastern country and has been linked with a lucrative move there at the end of the season.There has also been talk of a return to Barcelona, where he spent the majority of his career, or to the United States to play in MLS.",
        "Barring a late change of heart from him or PSG, this seems certain be his final season in the French capital.His suspension and news of his impending exit comes at a time when PSG is embroiled in an increasingly fraught French league title race.Messi was supposed to be training alongside his teammates on Monday, but was instead in Saudi Arabia, holding a falcon on his arm, watching a palm-weaving demonstration and looking around the Arabian Horse Museum as part of his commercial contract with the kingdom to promote tourism there.",
        "It was an expensive trip for the recent World Cup winner, who won´t get paid or be allowed to train or play with the team during his suspension.It looks like it will be a disappointing end to a turbulent and somewhat underwhelming two-season spell at a club where soap opera-style drama, on and off the field, is rarely far away given the presence of other superstars like Kylian Mbappé and Neymar in the squad.It also exposes the tensions now that Qatar and Saudi Arabia - gulf neighbors and fierce recent rivals in regional politics - have become major influencers in the world of soccer.Messi is right in the middle of it all, through his own making and because everyone - inside and outside the game - wants a piece of one of the all-time greats.The Argentina forward never intended to be playing for PSG, a club owned by Qatar Sports Investments, but found himself moving there in 2021 after previous team Barcelona, the soccer love of his life, plunged into financial problems that still persist.Immediately, it thrust Messi into the hands of the Qataris, given QSI is a subsidiary of the emirate's sovereign wealth fund, and invited accusations against him of sportswashing.Messi placed himself in an even more delicate position last year when, just a few months before the World Cup in Qatar, he signed up to be essentially an ambassador for Saudi Arabia.",
        "Hence this week's trip to the kingdom, which he decided to make without PSG's permission and covering a period when the squad had been asked to train in response to the team's 3-1 loss at home against Lorient on Sunday.According to French daily L´Equipe, PSG coach Christophe Galtier had pledged to give his players Monday and Tuesday off if they beat Lorient. Instead, the team trained on Monday and had Tuesday off.In the wake of Messi's resulting suspension, the Saudi Tourism Authority released a long statement detailing the movements of the man it called a \"football icon\" and his family on a day he was supposed to still be in France. Other aspects of the trip included \"feeding the indigenous Arabian gazelles,\" while the Messis apparently also were \"charmed by the authenticity and architecture of At-Turaif and the beauty of the Arabian horses.\"It would make interesting reading for PSG president Nasser Al-Khelaifi, chairman of QSI and beIN Media Group, which has been the victim of broadcasting piracy in Saudi Arabia in recent years.Indeed, Saudi Arabia and Qatar are engaged in a proxy battle to be the epicenter of Asian soccer. The presidency of the Asian Football Confederation is vacant in 2027 and both have potential candidates lined up.",
        "Since elections in February, the presidents of the Saudi and Qatari soccer federations - Yasser Almisehal and Sheikh Hamad Al Thani, respectively - are members of the FIFA Council, the executive body that makes the decisions in world soccer.The neighbors and rivals were competing to host the 2027 Asian Cup, until a solution emerged that rewarded both.Qatar stepped up when China handed back hosting rights to the 2023 edition, citing the COVID-19 pandemic, and that tournament will start in Doha in January. The AFC then awarded Saudi Arabia the 2027 edition - a likely audition for ambitions to stage a future World Cup, possibly in 2034.It does not stop at soccer. Doha will host the multi-sport Asian Games in 2030 and Qatar is widely expected to launch another campaign to host an Olympics in the city, this time in 2036.The 2034 Asian Games are in Riyadh, and Saudi Arabia won a bid to host the 2029 Asian Winter Games in a futuristic mountains resort, Trojena, that is not yet built.All of this, of course, is way above Messi's head but his decision-making over the past two years has placed him front and center in this regional contest.His ties with PSG may be coming to end, however. His contract expires at the end of this season and there's uncertainty about his next destination, with reports linking him to Inter Miami in MLS, a return to Barcelona and, naturally, a money-spinning move to a Saudi team, potentially Al-Hilal.",
        "Playing for Al-Hilal would place him in direct confrontation with longtime rival Cristiano Ronaldo, who has been at Saudi team Al-Nassr since the start of the year.Shifting the Messi-Ronaldo rivalry to Saudi Arabia would sum up modern-day soccer, with the riches of the Middle East proving as enticing to two of the game's GOATs as they are to FIFA and other sports bodies.___AP Sports Writer Graham Dunbar in Geneva contributed to this report.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}