{
    "articleURL": "/sport/football/article-12059777/Wayne-Rooney-says-four-Man-United-2008-players-Man-Citys-current-squad.html",
    "content": [
        "Man City have aspirations of matching Man United's treble success of 1999Wayne Rooney was part of the team that won the Champions League in 2008He has named just four players who would get into Man City's current team Wayne Rooney has admitted that Manchester City's current squad would 'have had the edge' on the Manchester United side he played for which won the Champions League in 2008. ",
        "The United and England legend played a huge part in helping the Red Devils win the Premier League and Champions League during the 2007-08 season - beating Chelsea on penalties to lift Europe's most prestigious trophy.City, meanwhile, are on course to match United's famous treble-winning exploits of 1999. They hold a one point lead over Arsenal in the title race, are due to play Real Madrid in the semi-finals of the Champions League and the Rooney's former side in the final of the FA Cup. In his column with the Telegraph, he named just four of United's 2007-08 winning squad that would make City's current squad - notably omitting Cristiano Ronaldo, who won the first of his five Ballon d'Or's later that year.He also claimed that the Red Devils would have been similar to Jurgen Klopp's Liverpool of recent years, in that they can beat Man City in one-off games but would 'usually' be behind them in the final league table.  ",
        "The D.C. United manager said: 'Could the 2008 United team have competed with City? Head to head, we’d have had a good chance but over a 38-game season they would have had the edge. 'I think we’d have been similar to Jurgen Klopp's Liverpool, able to beat them in one-off games but usually just a bit behind them in the final league table.",
        "'There were players in our team who would have got into this City side. Paul Scholes would have been perfect, Rio Ferdinand and Nemanja Vidic too. I believe I would have fitted into it as well — and I would have loved to play with Kevin De Bruyne and Haaland.'As well as Ronaldo, other notable omissions include Edwin van der Sar, Patrice Evra and Carlos Tevez.Rooney criticised the Portuguese star for refusing to come on as a substitute for United against Spurs earlier this season - before Ronaldo's interview with Piers Morgan which led to his Old Trafford departure. Al-Nassr star Ronaldo in the interview said to Morgan about Rooney: 'I don't know why he criticises me so badly.'Probably because he finished his career and I'm still playing at a high level'I'm not going to say that I'm looking better than him. Which is true... but it's hard to listen to that kind of criticism and negativity from people who play with you for example, Gary Neville, as well.'",
        "It was then reported that Rooney was 'bemused' by Ronaldo's comments. Meanwhile, Rooney has said that if City are to win the Champions League final, it will kickstart them reaching a number of finals in the next few years. He made reference to the fact that United went on to play in finals against Barcelona in 2009 and 2011.",
        "He said: 'After winning in 2008, we reached two further finals over the next three seasons and if City win this year I’m sure that, like us, they’ll get to more finals. 'At the same time, they’ll keep strengthening that already incredible squad. The scary thing is they could go on and win it multiple times, doing something similar to what Madrid have done over the past few years.'If they win the Champions League and the title, much as it pains me, I think you’d have to put City up there with United’s 1999 treble winners as the best Premier League team of all time. 'Our 2008 United team were also a great side but the way City dominate opponents and make it look so easy, so often — while constantly fighting on all fronts — is beyond what we did.'"
    ]
}