{
    "articleURL": "/health/article-12060309/Are-high-tech-scans-spot-tiny-growths-causing-harm-good.html",
    "content": [
        "READ MORE:  Has Covid created a generation of germaphobesAfter experiencing repeated bouts of stomach cramps and heartburn excruciating enough to take her to A&amp;E, Karen Myers decided to use her private healthcare to get to the bottom of what was wrong.",
        "But the results of the MRI scan she underwent were far from what she expected. 'While my stomach was fine, I was told something could be seen in my breast,' says Karen, 49, who works in media compliance and lives in London.On the basis of this finding, her GP referred her for a mammogram which confirmed there was a mass in her right breast.Seven days later Karen was sent for a biopsy, and the results were shattering.'When they said I had cancer, I went numb — it didn't feel real at all,' she says.",
        "Her surgeon recommended a lumpectomy, but when, after two attempts, they couldn't remove all the cancer this way, in November 2018 she was told that the only option was a mastectomy.'That was even more of a shock than finding out about the cancer and it was very hard to process,' recalls Karen.Yet she also feels lucky. Nearly five years after her diagnosis she is cancer-free. As for her stomach pain: in 2020 she had her gallbladder removed as it was infected, and this was identified as the cause. She's had no health problems since.'The doctors said I was fortunate the breast cancer had been found so early, as the tumour was only 15mm wide,' says Karen.",
        "'Thank goodness I happened to also be having stomach problems and needed the MRI — otherwise I would have never found out about the cancer when I did, and it's possible it would have spread.'Karen is one of an increasing number of patients who, each year, undergo scans or tests for one health problem only to have the doctors come across an unrelated growth or abnormality — a phenomenon known as an 'incidentaloma'.  There is no such thing as a normal scan these days Investigations on the chest produce the highest rate of incidentalomas — a 2018 review in the BMJ found that around a third of MRIs of the heart identified an incidentaloma, and 42 per cent of those that were malignant were in the breast. Around 25 per cent of incidentalomas in the kidneys, ovaries and thyroid were cancerous.Clearly incidental findings might be potentially life-saving — earlier diagnosis can mean conditions are easier to treat, leading to better outcomes.But doctors are also concerned that, in some cases, patients are becoming a 'victim of medical imaging technology' — charmingly known as 'vomit'. Detailed modern imaging can spot tumours, growths or cysts that you would otherwise not be aware of, but are completely harmless.Yet being alerted to the presence of any kind of growth can trigger significant anxiety for the patient. And in some cases, they will undergo invasive tests such as biopsies, or even have surgery, which can come with risks and turn out to be unnecessary.",
        "An unidentified abnormality may have unforeseen knock-on effects — for example, potentially raising the premium of life and medical insurance policies.The authors of the landmark BMJ research said that as investigating incidentalomas can, in some cases, cause 'more harm than good', doctors should now discuss the risk of incidental findings with their patients 'before they order an imaging test'. This lets the clinician and the patient 'weigh up the risk and benefits' of the test.The psychological impact cannot be overestimated. When physiotherapist Claire Wallace developed severe pain and weakness in her left leg following the emergency delivery of her daughter, Nora, in August 2021, an incidentaloma created so much anxiety that she was prescribed antidepressants.She'd undergone an MRI scan, which confirmed the leg pain was due to injury resulting from her Caesarean, but also identified a tiny, 5mm tumour on her spine.'I thought the worst — that I had cancer — and worried what would happen to me, Nora and Ryan,' says Claire, 32, who lives in Hull with husband Ryan, 33, an Army sergeant.Fortunately, another MRI confirmed the tumour was benign, 'but they said I'd need another scan a year later and if it grew they'd do something about it — although they didn't say what. I found it all really overwhelming'. She was prescribed anti-depressants some months later, 'as the tumour was all I could think about', she recalls. 'The extra worry had a huge impact on my first few months as a mother. It put a dampener on what should have been a very special time.'",
        "In March, a follow-up scan found that the tumour hadn't grown so no action needed to be taken.Giles Maskell, a consultant radiologist at an NHS trust in South-West England, says modern imaging is now revealing tiny growths that would never have been detected before (blood test technology has not changed significantly in recent decades and incidental findings happen much less frequently).'Modern imaging is very detailed — the size of what can be detected is a fraction of what was able to be seen even 20 years ago — and our ability to find things has outstripped our understanding of what they mean,' he adds. 'Knowing how these things will develop is not always clear — in many cases it may be safe to do nothing, whereas in others prompt action is vital.''The one thing that's certain is the more we look, the more we find,' says Dr Maskell, who is also former president of the Royal College of Radiologists. 'Scanning is great, but there is no such thing as a normal scan these days because imaging has moved on so much and now shows everything in greater detail.'This means that if I scanned the whole body of anybody over 20, I would find something which might conceivably be important for their future health. It probably won't be, but it might be.'",
        "And a lot of people have no idea that if, for example, they have a scan on their spine, their kidneys might be included in the image too, or that parts of the lungs and bones are visible on heart scans, he says.I know how worrying an incidentaloma can be. In February, I underwent a liver scan after blood tests revealed I had high levels of antimitochondrial antibodies, meaning the body's immune system was mistakenly attacking the mitochondria (the powerhouses in our cells). This can be a sign of a liver condition called primary biliary cholangitis.This disease destroys bile ducts in the liver and, if left untreated, the liver stops working properly.Thankfully, the ultrasound scan showed that my liver was normal, but I left hospital feeling anxious about a different part of my body entirely.The scan revealed that there was a 6mm polyp — a growth — in my gallbladder. I was told that if it grew to 10mm, my gallbladder would need to be removed as there was a risk it would become cancerous.This was not the first time I'd had an incidentaloma.In 2014, after suffering from bloating and pain in my stomach, a scan revealed a 2.5cm benign tumour on my kidney, known as an angiomyolipoma (AML).",
        "AMLs rarely cause symptoms so most people with them will not be aware that they have them.But once you do know, you live with the knowledge that an AML can rupture and cause a potentially fatal internal bleed.I had annual scans to monitor the growth of my symptomless tumour — if it grew to 4cm it would need to be surgically removed. Much to my relief, mine never grew, so I was discharged in 2018.During my recent liver scan, the radiographer saw that my AML was still 2.5cm. Had there been any benefit in knowing I had it? And would the same turn out to be true about my gallbladder polyp? Some conditions lead to incidental findings more often than others, says GP and Good Health columnist Dr Martin Scurr.  IBS can lead to more of these random findings For example, he says, as there is no definitive test for IBS, patients may be referred for tests to rule out other possible diagnoses, such as an ultrasound to check for gallstones.'Quite often when you're investigating something in the gut, you see something else, too — such as a kidney stone that hasn't caused any problems,' says Dr Scurr.Incidentalomas may be becoming more common because patients increasingly request scans, he says. 'Patients are more demanding and better informed than they used to be, and they want a clever scan to diagnose them.''They perceive that a scan — rather than a blood test, say — can give them the full picture of what's going on inside their body.'But it's important to remember that information is not knowledge — this information comes with relative risks.'",
        "Finding incidentalomas can be an even bigger problem within private healthcare, as people who appear to be well can have 'health MoTs', which often involve blood tests and scans, says Dr Scurr.'The more you go looking, the more you'll find a few things which you then need to investigate further, and the question is: where do you stop? This is the problem with the worried well. You may make people more anxious by investigating, not less.'Dr Maskell agrees: 'I've never been keen on that kind of thing [health MoTs] because the potential disadvantages outweigh the potential advantages.'Everything gets more common with age so, as you get older, it's more or less certain we will find something that we won't be absolutely sure about.'So how do doctors decide if an incidental finding is, in fact, significant?The density and shape of a tumour, and the patient's age and general wellbeing, can give clues as to how noteworthy the incidentaloma is. But there are still gaps in our knowledge as to what these findings mean and if anything needs to be done about them, says Dr Maskell.'Every tumour has to start small and grow, so at any size you're looking at something which might be significant,' he says.'We know that, on balance, statistically if we see one million 2mm lung nodules [an abnormal growth in the lung], for example, none of them is likely to become cancerous. But if we see one million 2cm lung nodules, quite a lot will be.'Often the only way to tell if the finding is important or not is to do another scan, says Dr William Ramsden, a consultant paediatric radiologist at Leeds Children's Hospital, and vice president of clinical radiology at the Royal College of Radiologists. 'This can take up time and money — and causes anxiety along the way.'  Doctors are more cautious out of fear of litigation 'Sometimes your prior knowledge and experience will allow you to let things pass, but occasionally findings may prompt a follow-up examination,' he adds.'It's a fine balance, and because you don't want bad things to happen to patients, you might be more likely to check it out.'However, this process of repeating scans adds to the workload of already-strained imaging services.'There's a lot of pressure on imaging in the NHS at the moment,' says Dr Scurr.'There's also a shortage of consultant radiologists — it's all very well doing scans, but someone has to look at the images and interpret them.'Doctors may be more proactive when it comes to incidental findings because they feel they need to protect themselves against being sued for missing something, adds Dr Scurr.'The situation has changed a lot in the past few decades and there is a much greater tendency to investigate,' he says.'Doctors are now more cautious because litigation is on the up. This is partly driven by social media, law firms offering no-win, no-fee claims, and the public being more aware and inclined to ask questions.'The bottom line is that people need to recognise that with modern technology 'you end up discovering things which have probably always happened but have never been observed before,' adds Dr Scurr. 'Often all it does is give you something to worry about — and in a lot of cases it would be better not to know.'Dr Maskell suggests we should 'think of scanning like surgery, which always has potential complications. In the process we can find something which, later, you wish we hadn't found.'Accidental diagnosis has stolen good years from my lifeKevin Reid, 61, was diagnosed with kidney cancer after a scan for muscular pain, leaving him ‘flabbergasted’. Sometimes he wishes he’d never been told about the finding.‘Knowing I have cancer has stolen good years from us,’ says the retired chemical engineer, who lives with his wife Emma, 55, a charity sector volunteer, in Cardiff.Kevin (pictured) had originally gone to the doctor after experiencing a painful ‘pulling sensation’ in his abdomen during sex. He was sent for a scan which found a 1cm tumour on his left kidney.‘The GP said my pulling sensations were nothing to do with it — I still have them,’ says Kevin. ‘I was told the cancer could have remained there for many years without me knowing about it.",
        "‘Kidney cancers are often symptomless until the tumours are at least 1.5cm wide.’Kevin had surgery to remove half of his kidney in July 2018 and had scans every year. For the next two years he ‘lived as normal’, he says.‘But then a scan in December 2020 found four 5-10mm tumours on my lungs. They were slow-growing but inoperable as they were so deep inside my lungs.‘I was given three to five years to live. So many thoughts went through my head, and I became withdrawn and depressed, thinking about what would happen. I’d always thought I was invincible and that I’d live to an old age.‘It all felt so surreal, especially as I didn’t feel unwell. I had no symptoms and still don’t — if it wasn’t for the scans I wouldn’t know the tumours were there, and they haven’t grown since.’He has retired in order to enjoy the time he has left, but adds: ‘Knowing my prognosis changed everything. Since then our lives have been all about cancer.’He has a scan every three months — last December this showed the cancer had spread to near his windpipe.In February he started having immunotherapy and chemotherapy to shrink the tumours so they wouldn’t affect his breathing.‘I still don’t feel unwell at all from the cancer, but I have experienced side- effects from the treatment, including tiredness.‘Recently I became very unwell and I was diagnosed with immunotherapy-induced type 1 diabetes, an uncommon side-effect of the treatment.‘If it hadn’t been for the initial scan, chances are I’d still feel fine and be enjoying life without cancer hanging over me.‘I would rather have waited until I got symptoms to know about all this, even if that meant only having months left to live. It’s a real double-edged sword having these things found by accident.’"
    ]
}