{
    "articleURL": "/news/article-12046647/Floridas-crackdown-pronouns-dont-match-persons-sex.html",
    "content": [
        "Florida Legislature approved massive education reform billsIt forbids schools from calling students by pronouns that don't correspond to the person's sex and makes it easier to ban booksREAD MORE: Billionaire Peter Thiel will back DESANTIS in 2024 - but is worried he is focusing too much on 'woke' Florida's state legislature gave final approval to a massive education reform bill that targets how teachers and students can use their pronouns in schools, in a move designed to strengthen the state law that was dubbed 'Don't Say Gay.' ",
        "Gov. Ron DeSantis is expected to sign the legislation, which also bans diversity programs in colleges.The Republican governor has pushed a conservative culture agenda in his state ahead of an expected announcement he'll run for president. DeSantis has declared a war on 'woke,' taken on Disney, and pushed to ban sex identity and certain books in schools.It's also increased his national profile as he takes on LGBTQ rights and one of America's most iconic companies. ",
        "The latest legislation prevents school staffers or students from being required to refer to people by pronouns that don't correspond to the person's biological sex. It's an expansion of DeSantis' so-called 'Don't Say Gay' law - a state law prohibiting classroom discussion of sexual orientation and gender identity. The new legislation also bans classroom instruction on gender identity and sexual orientation up to the 8th grade, expanding it legally beyond DeSantis' original proposal. Republicans argue lessons about sexual identity and gender orientation should be taught at home and not in schools.'You see society coming at our children in a culture war that has an agenda to make them confused,' Republican state Senator Erin Grall said.'We are depriving children of the ability to figure out who they are when we push an agenda, a sexualized agenda, down onto children.' ",
        "Democrats say it's an attack on LGBTQ rights.'Let's be honest about at least what this bill is about,' Democratic state Sen. Tina Polsky said on the floor Tuesday. 'It is about trying to silence any discussion about anything different from heterosexuality.' And the bill strengthens the system in which people can lodge challenges against school books. It requires schools to yank challenged books within five days of someone flagging it. Opponents have charged this is 'book banning.'DeSantis and his supporters have led an initiative that has led to the removal of material he and his supporters argue are inappropriate for children. Among the books removed in one school districts are Toni Morrison's 'Beloved,' and Margaret Atwood's 'The Handmaid's Tale.' Florida ranks second, behind Texas, as the state with the highest number of book removals, according to a report this month from PEN America.DeSantis has pushed back on the idea he is banning books.'This idea of a book ban in Florida, that somehow they don't want books in the library — that's a hoax,' he said at a press conference in March. 'And that's really a nasty hoax, because it's a hoax in service of trying to pollute and sexualize our children.' ",
        "However, on Tuesday, Florida came in first for education as part of the annual Best States rankings from US News &amp; World Report. It displaced former No. 1 New Jersey and No. 2 Massachusetts, after coming in third during last year's rankings. ",
        "The rankings are based on the state's low tuition and debt, as well as high college-graduation rates. Last week, high school and college students across Florida walked out of their classrooms to protest DeSantis' policies. And, on Wednesday night, over a dozen activists were arrested outside of DeSantis' Capitol Hill office. They were protesting the new education laws.The 14 people arrested were charged with misdemeanor trespass and were booked into the Leon County Jail, Florida Department of Law Enforcement spokeswoman Gretl Plessinger told the Tallahassee Democrat.'Once the building closes, unless you have an office in the Capitol, you're not allowed to be here,' Plessinger said, citing Department of Management Services policy.Many of the protesters were heard screaming 'Where is Ron!' over DeSantis' trip to London this past week as the legislature passes key pieces of his agenda. The demonstrators said they refused to leave until they had a meeting with the governor. The protest was organized by a human rights group called the Dream Defenders. ",
        "'Florida is on fire, and he's gallivanting around the country and around the world while the legislators under his boot are passing really harmful legislation,' said Nailah Summers-Polite, co-executive director of Dream Defenders. 'DeSantis likes to meet with his donors, the people who voted with him, his little pals, but he seems not to want to face the people who don't actually like him,' she added. 'If he won't face us, he shouldn't be the governor.' ",
        "The arrests were made by the Florida Capitol Police and Florida Highway Patrol, Plessinger said."
    ]
}