{
    "articleURL": "/tvshowbiz/article-12042483/Sue-Cleaver-59-showcases-jaw-dropping-weight-loss.html",
    "content": [
        "Sue Cleaver showcased her jaw-dropping weight loss in a stylish new snap on Wednesday.",
        "The Coronation Street star, 59, wore a chic pink suit as she posed up a storm - as fans gushed that she looked '20 years younger'.She paired her stylish pink suit with a black top and some white trainers, while she wore her blonde tresses in a stylish pixie cut. Her Instagram followers were loving the snap as one even commented: 'I'm currently watching you on episodes of Corrie from 20 years ago... you look younger now!'Another said: 'Looking fabulous darling! X', while a third wrote: 'The weight loss you look amazing!'",
        "Another penned: 'You look incredible xxx', while a fifth then gushed: 'Gorgeous!' It comes after back in February Sue insisted she's 'not obsessed over diets' as she reflected on the unfair expectations placed on women as she covered March's Prima.The actress displayed her slimmed-down figure in a glamorous shoot to accompany the interview as she declared she would never promote any weight-related products as women have 'enough difficulties as it is'.It came after the week before the star - who admitted to shedding pounds in the I'm A Celeb jungle - showcased her jaw-dropping weight loss in an Instagram snap. On not being embroiled in diet culture she told the publication: 'I lost some weight in the jungle, but I'm not obsessing over diets: life is hard enough! ",
        "'There's always going to be outside pressure and unfair expectations placed on women, but I refuse to get pulled into it. 'That's why I'll never promote anything weight-related, and it's why I'd always rather compliment somebody on their smile or their outfit, rather than their weight.'She continued: 'Let's just let women be women – we have enough difficulties and struggles as it is.'During the chat she also opened up about her stage of life as she nears her 60th birthday.",
        "She said: 'My 50s have been the happiest decade of my life. I'm happy with me and where I am, so I'm looking forward to seeing what the next decade brings.'Then again, if it doesn't bring anything, I'm just going to have to make something happen myself. Since doing I'm A Celeb, my eyes have been opened to all these new experiences. Now, I'm just thinking, 'Right, what's my next challenge?'It came after the week before Sue's fans begged for her diet plan as she showcased her jaw-dropping weight loss in a snap posted to Instagram.The actress looked sensational in a classic black top, which she teamed up with leather jacket and bold green trousers.In her caption, she wrote: 'Getting my glam on for @thismorning this morning - trousers by @reiss &amp; jacket by @mintvelvet - styled by @johnlewis_samantha @johnlewis Cheadle.'",
        "Her followers were left in shock by the post, writing in their comments, 'Who is this woman!!!!!,' and, 'OMG!!! You look amazing xxx.'Others penned, 'Omg share your weight loss journey please. Looking fabulous,' and, 'Looking fabulous Sue how did you lose all the weight? Other than being in the jungle.'More wrote to recent I'm A Celeb campmate: 'Get me in that jungle if this is how much weight I'll lose,' and, 'Wow .. you look fab. Way younger than 60 soon x how have you done it ?? Your so slim x.'Back in 2019, Sue lost three-stone after overhauling her diet and adopting a new health and fitness regime.",
        "It was reported she dropped to a size 12-14 from a size 16, after making a change to have a healthier lifestyle in 2016.Discussing her weight loss, a source told Woman magazine: 'Sue was always a self-confessed foodie, who admitted that over-indulgence was her Achilles Heel. Now everything's changed. 'Sue's in her mid 50s so it was a no brainer that cutting down on certain things was what she had to do.'She's in this for the long game and wants to live a long, happy and healthy life,' they said, as they added she did it for her partner and son Elliot."
    ]
}