{
    "articleURL": "/wires/aap/article-12053881/Dolphins-thrash-Sharks-Bennett-magic-900th.html",
    "content": [
        "The Dolphins have given Wayne Bennett a memorable celebration of his 900th premiership match with a stunning 36-16 win over Cronulla.",
        "The Dolphins raced out to a 30-0 lead in the first half with razzle dazzle footy of rare quality and punishing defence, led by hitman Felise Kaufusi.In an incredible storyline, blockbusting Dolphins debutant centre Valynce Te Whare scored a double and revealed why his nickname of 'Val Meninga' is well earned.\"I think we are going to find with Val that he is a big match player. The bigger the occasion the better he will play,\" Bennett said.\"Some players have that kind of psyche and it is part of his DNA.\"Even Bennett himself could not have scripted the Magic Round fairytale at Suncorp Stadium, the scene of so many of his great wins. The Dolphins were almost perfect early and the Sharks had no answers.\"I did enjoy that,\" Bennett said of his team's performance.\"We had three quality props out tonight and a couple of good backs missing. I just give guys a jersey ... and they get the job done. It is quite remarkable and a credit to them.\"There's a lot of trust there. I encourage them ... and trust them.\"Bennett has instilled incredible belief within his players and has backed them to show their skill.The coach has rebooted careers of a suite of his players with wingers Jamayne Isaako and Tesi Niu, five-eighth Kodi Nikorima and prop Herman Ese'ese all playing their best football.",
        "He has shown enormous faith in teenaged half Isaiya Katoa and it has been vindicated.Bennett's decision to debut Te Whare proved a masterstrokeIn just his second year of rugby league, Te Whare bulldozed his way through three Sharks defenders to score a try of pure strength and power.Te Whare had a shock and awe battle with opposite number Siosifa Talakai. Talakai got the better of him on occasions but the younger man refused to yield and had the last laugh.The Dolphins' first half was sensational from the moment hooker Jeremy Marshall-King split Cronulla up the middle and sent Katoa over in the seventh minute.Centre Euan Aitken burst through to send flying fullback Hamiso Tabuai-Fidow in under the sticks.Nikorima provided classy passes for Connelly Lemuelu and Niu to score and it was 30-0.The Sharks scored two tries in the space of as many minutes on the cusp of halftime to Ronaldo Mulitalo and Will Kennedy to have them believing.All hope was snuffed out when Te Whare stormed onto an Anthony Milford pass to slide over in the corner with a grin from ear to ear to confirm his cult hero status.The Dolphins' defensive resolve in the second half was full of courage and desire after Aitken failed to return after halftime with a hamstring injury and Nikorima moved to the centres.",
        "\"I looked at Kodi and he said, 'Can you play in the centres?' He said 'No problems coach. I'll get the job done for you',\" Bennett said.\"That's what makes us the team we are at the moment.\"Cronulla shot themselves in the foot with errors. Coach Craig Fitzgibbon said his side's poor display was \"an attitude thing\".\"It was a good lesson for us to be honest. Tonight meant more to them than it did to us,\" he said."
    ]
}