{
    "articleURL": "/debate/article-12057415/RICHARD-KAY-Middletons-heart-new-royal-order.html",
    "content": [
        "Television cameras did not linger long on the invited guests inside Westminster Abbey eagerly craning their necks to catch every historic moment of the Coronation spectacle.",
        "Spectators in row seven, however, had the best seats in the house, immediately behind the Royal Family and next to world leaders. Provided they could navigate the view-blocking plume on Princess Anne's elaborate headwear, they could see all the action.Prominent among them were the Middleton family, the Princess of Wales's mother Carole, her father Michael, whom his son-in-law William calls Mike, and siblings Pippa and James.Given that they are grandparents of the next king but one, it was understandable that Kate should want both her mother, a former flight attendant who was brought up in a council flat, and her father, a one-time aircraft despatcher, close at hand.",
        "What was surprising was the presence of her brother and sister when pressure of space meant so many more familiar names were absent from the guest list.For example, there was only room for two members of the King's maternal grandmother's family, Sir Simon and Lady (Caroline) Bowes-Lyon; and for just one solitary representative of the Mountbatten clan — a dynasty steeped in royal history — in Countess Mountbatten, who was there without her estranged husband, Norton, a Gordonstoun school friend of Charles.Admittedly, James and Pippa, who are both married, came solo and, like the King's wider Windsor family members, were not able to bring their spouses.",
        "But beyond this very visible picture of dizzying social mobility that the Middletons represent, their presence — more than perhaps anyone else's at Saturday's ceremony — is a very clear sign about the future direction of the monarchy.Charles may be on the throne but by including William's in-laws and in such a conspicuous position in the Abbey, there was a tacit acknowledgement of the role the Middletons are undoubtedly going to play.So while this was his father's day, it was also the beginning of a new royal order and the extension of what was once referred to by courtiers as 'The Middleton Rules'.The King and Camilla will lean heavily on William and Kate in the years ahead. Indeed, it is already possible to look not too much further into the future to see the day when the King and Queen step back from overseas tours, for instance, just as Queen Elizabeth and Prince Philip did.This would mean the Prince and Princess taking on those visits to distant Commonwealth countries and far-flung realms, in the way that Charles did when he was Prince of Wales, easing the burden on his parents.When that happens — and in the case of the Queen, who finds international travel gruelling, this may be sooner than people realise — it will be Mike and Carole Middleton who are called on to help out by taking care of Prince George and his siblings Charlotte and Louis. ",
        "They have always been the most involved grandparents from the moment of George's birth in 2013 — which, in the early days, was a source of some friction between Charles and William.The then Prince Charles complained that he had seen less of his grandson than he would have wished. Yet now, with his duties as King, Charles is bound to have even fewer moments to enjoy his grandchildren's company.",
        "Kate's parents have been 'brilliant', according to friends, at stepping in and helping out, always willing to drop everything at a moment's notice. Mrs Middleton's decision to step back from the day-to-day running of her online party paraphernalia business will free up still more time. Carole has always been just 'Granny' to Kate's three children although they have, of course, been told everything about their other grandmother, Princess Diana.The split with Prince Harry, whose graceless contribution to his father's Coronation saw him leave for the U.S. directly after the Abbey service, is another significant factor in placing Carole and Mike front and centre as the new royal order takes shape. Even without the disgraced Prince Andrew, Charles has continued to enjoy the active support of his sister Anne and brother Edward in picking up the royal slack. There is no such back-up for William, who had always hoped that his brother would be at his side, not just when he was Prince of Wales but also King.",
        "With the prospect of any kind of reconciliation fast disappearing, William has no one but Kate to support him through the challenges ahead. And, since Charles has admitted he would have struggled to cope without Camilla to encourage and reassure him, there is an understanding between father and son that anything William can do to ease the burden will be granted.That's where the Middletons come in. Ever since William first began dating Kate back in their university days at St Andrews, Carole and Mike have played a significant part in the couple's lives.He was welcomed into their circle of cosy domesticity — meals together and often in front of the television — and he loved it.He adored the gatherings for Sunday lunches at his girlfriend's home when all three Middleton children would routinely and happily descend on their parents.He had no experience of such simple family unity — if his memories were not of his parents' quarrelling, they were of never being under the same roof as both his mother and father at the same time.",
        "When the Middletons were unfairly attacked for their middle-class ordinariness not just from within the royals but in wider aristocratic circles, he bridled at the snobbery of it.And while Mike and Carole never complained, William most certainly did. He had already demonstrated his resolve not to allow Kate to suffer the invasion of privacy his mother had suffered. But soon it went beyond that.",
        "After his and Kate's wedding in 2011, William was more determined than ever to transpose the Middletons' way of doing things into his own marriage.It shows most clearly in the way their three children have been raised. It helps, of course, that they are not the offspring of a damaged marriage.But unlike William and his brother when they were young, George and his siblings have not been banished to a nursery floor and the care of nanny. The couple's decision last year to down-scale their living arrangements from Kensington Palace to modest Adelaide Cottage in Windsor Great Park was a key part in ensuring their children do not grow up remote from other boys and girls, as previous generations of royal offspring often have.The property was chosen deliberately because it has no room for live-in staff. It means that Prince George will be the first heir in line to the throne to have grown accustomed to his mother — and father — preparing the evening meal, getting him up in the morning and ready for bed at night.These may seem modest steps but they are a sea change in how royals have usually been raised where so much is prepared by others, rather than their own family.",
        "William's most significant intervention was to weave Carole and Michael into every facet of his and Kate's life.He refused to allow them to be treated as in-laws had in the past, rarely receiving royal invitations. Cleverly, he enlisted his grandmother's help in this ambition.The late Queen was delighted —she warmed to the hard-working aspirational values of the Middletons, inviting them to Balmoral, to Royal Ascot and to Sandringham, where they were Christmas Day guests. In the past, in-laws such as the Spencers, the Fergusons and the family of Anne's first husband Captain Mark Phillips had been discarded once the weddings were over.If one picture signified this transformation in attitude it was of the Queen driving Carole over the grounds of Balmoral to join a shoot, something that would have been unthinkable a few years earlier. It spelled out that, unlike previous generations, the Middletons were going to be active participants in the then Duke and Duchess of Cambridge's lives.There were other crucial aspects to The Middleton Rules, from the couple's decision to spend their early years as a family in Norfolk away from prying eyes, which meant they avoided much of the stiff formality of the royal household that they found suffocating, to choosing the schools for their children's education.In recent times there have been more tweaks. Kate's decision to take control of the children's public images, for example, through providing her own photographs of them for public consumption has been brilliantly successful. Not only has it protected them from the intrusions William and Harry had to endure as young boys but it also sabotaged the paparazzi market for pictures.It has not all been plain-sailing: at times there was conflict with Charles. William resisted anything where he suspected his children might be used to prop up the sagging popularity of anyone in the Royal Family.And after the dazzling Diana years, the last thing Charles wanted was he and Camilla being outshone by the glamour and poise of his daughter-in-law.But then, extraordinarily, out of the royals' greatest setback came an unexpected dividend. Harry's decision first to quit Britain and royal life and then to use his exile to mount attacks on his father, stepmother, brother and sister-in-law brought about a rapid rapprochement between Charles and William.The relationship between the two had not truly been close for years: William often felt he and Kate were simply there to inject an X-factor into royal life. Father and son have short tempers.But now there was cause for a joint enterprise — both Charles and William feared that Harry's real and imagined complaints about royal life and the treatment of Meghan was doing serious damage to the royal brand.William's anger at Harry's description in his book of Kate as 'cold' has brought a new warmth with his father — and an agreement. Rather than being diminished by Harry's antics, their ties have been strengthened.At the Coronation on Saturday this new understanding between father and eldest son received its first public outing. Their embrace when William declared that he would be the King's 'liege man' was both warming and highly emotional. Charles was at his most vulnerable, the prince at his most accommodating.Sitting in row seven, the Middleton family, meanwhile, were being quietly upgraded. They are not royal, of course, but they are now central to the future wellbeing of the Royal Family."
    ]
}