{
    "articleURL": "/femail/article-12041527/Queen-Letizia-Spain-dons-lacy-day-dress-King-Felipe-VI-welcome-Columbias-president.html",
    "content": [
        "Queen Letizia, 50, welcomed Colombia's presidential couple to Zarzuela PalaceREAD MORE: For all the latest Royal news, pictures and video click hereQueen Letizia of Spain donned a breezy white lace dress today, as she welcomed the Colombian president and his wife to Madrid.",
        "The stylish mother-of-two opted for the pretty dress by Spanish brand Sfera, which was first spotted last summer and recycled today for the Colombian official visit. Standing by King Felipe VI's side, Letizia greeted their esteemed guests on the steps of Zarzuela Palace in the Spanish capital - with Colombian First Lady Veronica Alcocer similarly attired in a flamboyant white dress. Showcasing her renowned sartorial flair, Queen Letizia added a pop of colour to her look by accessorising with a small floral clutch bag from Furla. The Spanish royals will attend King Charles' coronation in London on Saturday. ",
        "Letizia, 50, was the picture of poise as she welcomed resident Gustavo Petro and First Lady Veronica Alcocer to the Royal Palace, where they will be treated to a state dinner later this evening.The presidential couple arrived in Spain yesterday and will stay until Friday. The Spanish Queen's understated frock boasted a round beck and floral guipure details, in a shade of white that complimented the royal's sun-kissed skin.Known for her effortless fashion, Letizia paired the number with a pair of nude slip-on heels. Her Furla Toni Bag in Ballerina, which she has also worn before, added a pop of flowers to the overall look. The Monarch let the dress do the talking and kept her pick of jewellery to a minimum. On top of a gold ring on her left index finger, Letizia also opted to wear studded silver earrings for today's event. ",
        "Her hazelnut locks were styled in a slick straight blow-dry tucked behind her ears, which highlighted her immaculate posture. Letizia opted for a sun-kissed natural makeup, with a terracotta eyeshadow, a dash of mascara and blush, and a nude lipstick that brought out the sparkle of her green eyes.",
        "As luck would have it, the Spanish Queen's outfit matched that of the First Lady of Colombia. Veronica Alcocer looked as elegant as her host in a white and gold day dress she also paired with nude heels. Meanwhile, King Felipe VI looked dapper in a pin-striped navy blue suit which he paired with a yellow tie and crisp white shirt. After the Colombian president's visit, Queen Letizia and King Felipe will join other crowned heads and 203 international heads of state in attending King Charles' Coronation in London on Saturday. It has been reported that some 2,200 people will witness the historical event at Westminster Abbey this weekend.A number of recognisable figures, such as the Archbishop of Canterbury and the Duke of Westminster, will have key roles to play during the coronation ceremony.In a break from previous plans, Camilla will be crowned as Queen, having initially been set to use the title of Queen Consort."
    ]
}