{
    "articleURL": "/sport/football/article-12057739/A-League-Sydney-FC-fans-slam-coach-Wanderers-star-marched-teams-change-room.html",
    "content": [
        "Vision shows the Serbian star being forcibly removed  Fans have slammed Sydney coach Steve Corica for his actionsIncident is latest in heated rivalry between the clubs Sydney FC fans have turned against their own coach with many saying that Steve Corica's 'classless' act of having former teammate Milos Ninkovic removed from their dressing room was the final straw.",
        "There has been bad blood between the Serbian star and Coric since Ninkovic defected to cross-town A-League rivals Western Sydney Wanderers in 2022 after seven seasons with the Sky Blue.Making his defection harder to take for Sydney fans was the fact the star international announced he was quitting the club on Instagram. That tension boiled over in the first-ever Sydney derby in the A-League finals on the weekend when Sydney FC eliminated the Wanderers 2-1 at CommBank Stadium.Ninkovic was reportedly involved in an altercation with his former coach on the sideline during the clash.Footage shows the Wanderers star being frog-marched out of the Sydney FC dressing sheds following the match, reportedly at the directive of Corica.",
        "Both Corica and Wanderers coach Marko Rudan said Ninkovic had only been in the sheds to congratulate his old teammates. While Sydney fans continue to be angry at Ninkovic for walking out on their club, many have slammed Corica for his handling of the situation.'As a Sydney FC fan, Corica is a fool. Ninkovic did nothing wrong and even if he said something to Corica who cares. Instead of focusing on the club, the players and fans he is all about himself,' one fan fumed after seeing the vision.'Other than the Sydney FC board everyone else can see this. Even if we by chance win the finals, Corica needs to go.' ",
        "'Corica has issues with him. Even if he said something, he has given his everything to SFC &amp; it’s a shame that Corica is not man enough to ignore him and be the bigger person,' another added.'Corica is the problem. Making the play offs doesn't change anything, he needs to go,' posted another.The Sydney FC coach admitted there were still unresolved issues between him and Ninkovic but did not elaborate after the match.'He just come to wish the players all the best, have a good season,' Corica said.'He's just upset obviously losing the game.'You know, we have issues with him, obviously, but that's all between me and him.'  ",
        "Plenty of fans applauded Ninkovic for showing sportsmanship despite the bad blood and the heavy loss.'Ninković showed what it means to be a real sportsman, congratulating his ex-team players. Pushing him out like he was some troublemaker was an act that belongs to some village show,' one fan posted.Respect for Ninkovic to go in there and congratulate the lads. Yeah the contract saga was unfortunate and unsavoury but people ought to remember the massive contribution he made to the club’s success in the past decade,' said another.There were also plenty of Sydney FC supporters who said Ninkovic ignited the fuse by going into the sheds, with some Western Sydney supporters even agreeing their prize recruit should have stayed away. ",
        "'As a Wanderers fan I don't see any reason why he needed to go in there. When I heard about this, it didn't sit right with me,' a Western Sydney fan posted.'Post a game like that he should have been with his own team mates and being a 'leader'. Yes, he can congratulate his ex team, but do it when you shake hands or after you and your current team have debriefed. Don't go in their change room mate.'",
        "In the corresponding derby last year, Sydney FC supporters group The Cove burned the jersey of Ninkovic during their march through Moore Park to Allianz Stadium for the derby.That move also attracted widespread criticism from football fans.'This is not passion, it’s hooliganism,' one posted following the 2022 derby.'Burning ur clubs badge shows that Ninković was bigger than Sydney FC,' added another.'I understand passionate fans but I don't understand why they/any fans need to burn symbolic items,' said another.Sydney FC will now take on Melbourne City in a two-leg semi-finals series while the Wanderers have been eliminated from the A-League finals."
    ]
}