{
    "articleURL": "/tvshowbiz/article-12040983/Chantel-Jeffries-showcases-jaw-dropping-figure-snazzy-bikini-hits-beach-Miami.html",
    "content": [
        "Chantel Jeffries sent pulses racing as she hit the beach in Miami.",
        "The DJ, 30, showcased her jaw-dropping figure in a snazzy multi-coloured bikini as she soaked up the sun on Tuesday.She pulled her brunette tresses back into a neat updo and secured it with a beige claw clip, while sporting light blue sunglasses.Chantel has been posting photos of herself in bathing suits from Fashion Nova on social media recently.She is one of many celebrities to collaborate with the fast fashion brand.",
        "In April, Chantel posted sizzling images to Instagram on after a fun weekend in Indio, California for the Coachella Music Festival.The star attended parties such as the one hosted by Revolve, which Olivia Culpo and Christina Milian also attended .The pinup was seen in a multi-colored long-sleeved bikini style top with a 1960s Pucci flair that gave fans a look at her tummy as she added a little matching mini skirt.Her hair was newly highlighted and worn down in soft waves over her shoulders.The focus was her toned tummy and her long, sculpted arms as she smoldered for the camera while on the sandy step-and-repeat portion of the Revolve party.The DJ - whose handle is Ceejay The DJ - looked cute in her light blue denim boots with a semi pointy toe as she wore her legs bare.",
        "The pinup held onto a orange woven purse that had a knot on one end of the strap at the event held in Thermal.Thermal is an unincorporated community within the Coachella Valley in Riverside County, California, United States.",
        "Chantal is also an influencer for Alo Yoga, a brand favoured by many celebrities.The Better hitmaker promotes multiple streams of income to her 4.6 million fans, as exhibited in her web show, Chantel's Money Moves.She stars in the show with with financial influencer Taylor Price and certified financial planner Brittney Castro.Each short episode of the Facebook Watch series focused on a different investment opportunity, including cryptocurrency, real estate, stocks and more.Over the years, she has been romantically linked to The Chainsmokers' Drew Taggart, Justin Bieber, Justin Combs, Machine Gun Kelly and Logan Paul.In 2019, the YouTuber opened up to DailyMail.com about her strict diet plan: 'I try to stick to exactly what I'm supposed to eat so that I don't feel sick, and then I just stay in shape because everything's pretty healthy.''Whenever I'm home, every time I finish a large meal I like to go for a nice walk. It's good to digest your food and clear your head anyways,' explained Chantel.The stunner went on to add that she tries to steer clear of sugar, dairy and gluten.",
        "'I try to stay away from sugar as much as possible. I don't eat dairy or gluten because I'm allergic.'"
    ]
}