{
    "articleURL": "/news/article-12056381/William-Kate-lead-Coronation-Big-Lunch-celebrations-nation.html",
    "content": [
        "The Duke and Duchess of Edinburgh will be in Cranleigh, Surrey, with members of the Scouts and Guides Follow all the latest royal news and updates on Coronation events on MailOnline's live blog hereA delighted William was handed a can of Coronation ale as he and Kate surprised royal fans in Windsor on a 40-minute walkabout today.",
        "The Prince and Princess of Wales made the unannounced appearance ahead of Sunday's star-studded coronation concert at Windsor Castle at 8pm this evening. Millions will be watching at home tonight, but tens of thousands have been in Windsor since early this morning to see pop icons Lionel Richie, Katy Perry and Take That perform in a star-studded bash.And to show their appreciation, William and Kate greeted crowds, shaking hands and chatting to revellers in some welcome sunshine after a rainy Coronation day. The prince and princess were also gifted ale before sipping homemade cocktails with fans.The heir to the throne also revealed that his father Charles' neck hurt last night after wearing St Edward's Crown, which weighs a hefty 5lbs and had to be carefully adjusted by the Archbishop of Canterbury to ensure it didn't topple off his head.Speaking to one group of fans, the prince said: 'I think his neck hurt last night, having the crown…it does weigh a hell of a lot.'When the couple first walked over to chat to family groups picnicking ahead of the concert, William was offered a drink in a union-flag decorated paper cup by a group of women who all wore yellow-coloured cloth crowns. He took a sip and later handed it to his wife, who drank from the cup and appeared to like it.",
        "William was handed a can of 'Return of the King', a specially brewed organic 'Coronation ale'. He looked absolutely thrilled, and Kate smiled as her husband told the well-wisher he'd save it for later. At one point, Kate, wearing a pale blue blazer and white top, picked up a small union flag on a stick which had fallen on the floor and handed it to the well-wisher who dropped it. She also comforted a little girl who was overwhelmed to meet her.Scores of people crowded around the Prince and Princess of Wales in Windsor, with William crouching down to chat to a boy and girl wearing golden crowns. The prince and princess looked relaxed, with William telling one group of well-wishers: 'Enjoy the concert tonight.'One woman in the crowd complimented Kate on the headpiece, by Jess Collett x Alexander McQueen, which she wore at the coronation, telling her 'I loved your head piece'.The item featured silver bullion, crystal and silver thread work three-dimensional leaf embroidery, and in response Kate touched the woman on the shoulder as if to say 'thank you'.The prince and princess continued to chat to the well-wishers and finally ended their walkabout, which lasted 40 minutes, with a wave goodbye.The couple's appearance came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.",
        "A Palace spokesman said the King and Queen were 'deeply touched' by the nation's celebration of their historic coronation.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.Heir to the throne William is to take to the stage to deliver a speech during the musical extravaganza in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza to see performances by Take That, Katy Perry and Lionel Richie.Kate Middleton greeted fans dressed in a pale blue blazer, while Prince William opted for a darker shade as he shook hands with those gathered outside the castle. ",
        "Alongside the thousands of smaller street parties expected to be held at the weekend, people are encouraged to come together across the country for the Coronation Big Lunch.In Cranleigh, the Duke and Duchess of Edinburgh will join residents and representatives from the Royal British Legion, the Scouts and the Guides - of which Sophie is president.",
        "Elsewhere, the Princess Royal and Vice Admiral Sir Tim Laurence will visit a community street party in Swindon, and Princess Beatrice and Princess Eugenie will join a big lunch in Windsor. Members of the public and organisers from a number of charities across the UK have expressed their enthusiasm ahead of the event. Lucinda Spelman-Ives, from Wilstock, who raised over £1 million to fund a community hub, hopes the Big Lunch will 'unify and bring everyone together being part of history, making amazing memories, laughing and meeting lots of people who have never met before'. 'Everyone is bursting with pride after yesterday's ceremony,' she said. 'This will be a very special memory for us all. Long live the Big Lunches and long live the King.' Kate Welch, chairwoman of Acumen Community Buildings at The Old Rectory in Sunderland, and part of one of the biggest parties in the North East, said: 'The coronation badge is shining from our building, we've made lots of red, white, and blue chains with bunting and flags out in force. 'We expect 4,000 people to join us tomorrow for Houghton-le-Spring's Coronation Big Lunch and the whole town is buzzing with excitement.' ",
        "Emily Connally, who leads the Cherwell Collective in Oxford, an organisation inspiring people to live more sustainably, is 'thrilled' to be part of the Big Lunch. ",
        "Ms Connally and her team, who are 'buzzing with excitement' will serve dishes using locally sourced ingredients. 'We're especially thrilled because of (Charles's) climate legacy, as our work tries to set an example of sustainable celebration,' she said. 'We've laid tables using only surplus decorations including cut flowers. 'We're cooking food for an expected 500 people using only surplus and food we grow within one mile.'We're even doing our take on the official Big Lunch dish.' Politicians also got involved with the Big Lunch on Sunday, with Prime Minister Rishi Sunak hosting his own event at No.10 Downing Street.There was a hum of excited chatter as those invited - including volunteers, Ukrainian refugees and youth group members - sipped fruit drinks and took photos in front of the famous Number 10 door as they awaited the arrival of Rishi Sunak and his wife.The street was bedecked in Union flag bunting and music was being played by the RAF Northolt brass quintet.Mr Sunak and Akshata Murty are hosting the event as part of the Big Lunch celebrations taking place across the country over the coronation weekend. Their daughters Krishna and Anoushka also attended the celebrations and were pictured on the front steps of No.10 with their parents.On Sunday evening there is a special Coronation Concert being held at Windsor Castle which will be attended by members of the royal family and will see special live performances from artists such as Katy Perry, Olly Murs and Paloma Faith.",
        "It will also incorporate elements such as dance and opera, and see special guest appearances including Tom Cruise and Winnie the Pooh.Royal fans - some draped in Union flags or wearing Union flag dresses - started arriving hours before the concert was due to begin at 8pm.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, will see Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones appear via video message.There will also be performances by veteran rock guitarist Steve Winwood and Nicole Scherzinger of The Pussycat Dolls. Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Buckingham Palace also said the planned Big Help Out on Monday will 'highlight the positive impact volunteering has on communities across the nation'. A palace spokesperson said: 'In tribute to the King's public service, it will encourage people to try volunteering, and join the work being undertaken to support their local areas. 'The aim of Big Help Out is to create a lasting volunteering legacy from the coronation weekend.' The palace spokesperson said that, according to the latest polling, an estimated 6.5 million people say they are planning to take part in the Big Help Out, ranging from community litter picks to signing up to longer-term volunteering opportunities with a wide range of charities. The palace said that while 'wholly supportive' of the Big Help Out initiatives on Monday, Charles and Camilla will not be attending any of the events in person. King Charles and Queen Camilla also sent their 'warmest wishes' to millions of Brits who are today holding Big Lunches. Preparations for coronation celebrations are well underway across the country as royal fans share pictures of British flag-decked tables, cakes and quiches and bunting-lined streets. Pictures from early this morning show police and contractors setting up for tonight's Coronation Concert in Windsor, which will see 20,000 spectators flock to the castle's East Lawn. In a message shared on the Royal Family's Instagram page, the King and Queen said: 'Whether this is your first ever Big Lunch or whether it is an annual part of your local calendar, we send our warmest good wishes to each one of you, and all those who will be with you, at what we hope will be a truly enjoyable event for everyone.'",
        "Police were seen walking up the castle's Long Walk and cardboard cutouts of the monarch were being positioned near bunting-clad street party tables as decoration. ",
        "Across the country people are getting ready to host and attend coronation lunches in celebration of the King's crowning - with many baking the special coronation quiche that was created for the occasion. Ahead of the show on Sunday evening, thousands of street parties are expected to be held with people encouraged to come together across the country for the Coronation Big Lunch.Many will be putting their aprons on to produce a veritable feast for lunch today - including the coronation quiche, which has broad beans, spinach and tarragon in the recipe. Pictures of Coronation Big Lunch preparations have shown bunting-full set-ups, with tables lined with cakes, scones and quiches. The king's younger brother Prince Edward, his sister Princess Anne and Princess Beatrice and Princess Eugenie, the daughter of Charles' other brother Prince Andrew, were due to attend 'Big Lunch' events, joining some of the estimated 50,000 street parties being held around the country.While millions across the country stayed at home yesterday to watch the coronation, people will take to the streets today. Fiona Chapman and Lorna Dodwell crafted their own special capes to try and impress the King and Queen at the coronation.Mrs Chapman said: 'We went down on the train yesterday from Windsor and found our way to the Mall.'We did not see very much but we had a great laugh. Everyone was taking our photo.'We are royalists. I have always stuck up for Charles.'Mrs Chapman's husband spent six weeks making special crowns for the pair.They will both be attending a street party in Eton before watching the coronation celebration on a big screen in a nearby park.They applied for tickets for the concert at Windsor Castle but they did not manage to get any.",
        "Mrs Chapman added: 'Gary Barlow will miss me. I'm his biggest fan. We wanted Charles and Camilla to notice us yesterday.'For the late Queen Elizabeth II's coronation in 1953, Coronation Chicken – cold chicken in a curry cream sauce with a well-seasoned dressed salad of rice, green peas and mixed herbs – was invented to feed the foreign guests who were entertained at Buckingham Palace after the ceremony.Buckingham Palace said the quiche was chosen because it worked as a sharing dish, can be served hot or cold, suits a wide variety of dietary requirements and can be easily adapted to suit different tastes. It's also rumoured that it features some of the King's favourite foods, namely cheese and eggs. Millions of cakes - from Victoria sponges with cream and jam to carrot cakes with cream cheese icing - will be lovingly baked as people join their neighbours to celebrate. Tonight's show in Windsor, hosted by Paddington and Downton Abbey actor Hugh Bonneville, will include video messages from Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and Welsh singer Sir Tom Jones.Zoe Ball was due to present a show from the grounds of Windsor Castle but has said she is 'absolutely gutted' at having to pull out of covering the Coronation Concert for BBC Radio 2 at the last minute after falling ill.Scott Mills will take over from Ball to chat to the crowd ahead of the concert, while Dermot O'Leary will be backstage speaking to the stars before they perform.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary figure Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "There will also be performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.And the weather looks likely to be lovely for most with highs of up to 22C - the hottest day of the year so far. The best of the weather will be in London and the South East this afternoon, with pleasant conditions also expected in Windsor for the Coronation Concert tonight.Most of the UK will see good periods of sunshine today and it will be mainly dry, but large areas of cloud cover will bring a threat of showers to some eastern areas.Overnight, steel barriers standing at 10 feet high were erected around Windsor Castle's Town Gate, where 20,000 spectators will pour through for the event.Before entering the concert to mark the crowing of King Charles and Queen Camilla fans will undergo extensive searches watched by police snipers.",
        "Anti-terrorist vehicle barriers, designed to stop trucks of up to seven-and-a- half tonnes, were being positioned around the castle.Metal spikes which can pierce tyres were being brought in along with eCCTV cameras and floodlights.Police armed with automatic rifles patrolled the streets while others took up position on rooftops.Police have not revealed any specific threats, but will also be on guard for any intrusion by anti monarchists who were present at yesterday's coronation procession in Trafalgar Square.The heavy security did not deter tourists and royal well-wishers from pouring into Windsor at breakfast time to be part of the party.",
        "The Long Walk was sealed off as giant TV screens were being installed in to allow fans to watch the concert which will be attended by the King and Queen.Evelyn Karrier, 30, from Austria, said: 'It is such a wonderful time to be here. The atmosphere is a happy one and anyone who is here at this historical time is very lucky.'American royal fan Susan Keys, 55, from Houston said : ' being from Texas, I just love all the tradition surrounding his coronation and this historic place.'You Brits do pageantry, pomp, and everything else so well. It's no surprise to me that so many people come from all over the world to visit Windsor and to be here at the coronation time is such a bonus.'Greg and Gina Watkins travelled from Gwent to be in the Castle town with their toddler son.Greg,47, said: 'Charles will be a wonderful King. He was already great as a Prince, but we can expect even greater things from him, as he has such incredible foresight.'",
        "Bartley Graham,48, from Durham walked around Windsor in his Union Jack suit and said: 'I am a royal super fan. I will be watching the concert here tonight.'It's such an important time for our country and for our own family. What we are doing, is seal in the future, everyone for centuries to come with this wonderful series of events to celebrate Charles.'Royal fans have started arriving in Windsor hours before the coronation concert at 8pm.People draped with Union flags and dressed in Union flag dresses have been flooding off trains at the station.Garry and Donna Howarth travelled down from Bolton after winning tickets to the event.",
        "Mr Howarth, dressed in a Union flag blazer, said: 'We are here just for the concert. We have come down for the weekend.'We are about 10 hours early but we will have a look around and see what we can.'Mrs Howarth said: 'I'm so excited to be here.'The pair are keen to see opera singers perform at the concert and decided to avoid the coronation on Saturday because of the rain.The Coronation concert features a union flag shaped stage, which was barely visible to tourists who paid for a nearby field to try to catch a glimpse.It is set on the eastern facade of the castle with multiple levels, and will hold a 70 piece orchestra with four cat walks around Launch out like the union flag into the crowd.As part of the Coronation Concert, choreographed lasers, projections and drone displays will radiate over historic bridges and buildings around the country.Seven of the 10 locations involved in the event, Lighting up the Nation, have been disclosed so far, including Blackpool seafront in Lancashire, where people can join a viewing party from Blackpool Tower.",
        "Sheffield Town Hall will showcase a display in the Peace Gardens, while Newcastle's Tyne Bridge and Gateshead's Millennium Bridge lights will cast riverside reflections for an audience stretching between the quays.A drone show will light up the sky above the Eden Project in Cornwall, and its biomes will become multicoloured for spectators invited from the local volunteer community.Light shows will also brighten up Belfast, Edinburgh and Cardiff at various locations.The remaining three locations will be revealed during the concert.The Coronation Concert will be broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds from 8pm. Are you having a coronation party? Email hannah.mcdonald@mailonline.co.uk to share your pictures"
    ]
}