{
    "articleURL": "/wires/pa/article-12054019/Pro-Kremlin-novelist-injured-car-explodes-Russia.html",
    "content": [
        "The car of a prominent pro-Kremlin novelist has exploded in Russia, injuring him and killing his driver, state news agency Tass reported, citing emergency officials.",
        "The incident involving Zakhar Prilepin, a well-known nationalist writer and a supporter of what the Kremlin calls its “special military operation” in Ukraine, happened in Nizhny Novgorod, about 250 miles east of Moscow.It is the third explosion involving prominent pro-Kremlin figures since the start of the war in Ukraine.In August 2022, a car bombing on the outskirts of Moscow killed Daria Dugina, the daughter of an influential Russian political theorist often referred to as “Putin’s brain”. Authorities alleged Ukraine was behind the blast.Last month, an explosion in a cafe in St Petersburg killed a popular military blogger, Vladlen Tatarsky. Officials again blamed Ukrainian intelligence agencies for orchestrating it.Gleb Nikitin, governor of the Niznhy Novgorod region, said Prilepin suffered minor bone fractures and was receiving medical treatment.Russian news outlet RBC reported, citing unnamed sources, that Prilepin was travelling back to Moscow from Ukraine’s partially occupied Donetsk and Luhansk regions on Saturday, and stopped in the Nizhny Novogorod region for a meal.",
        "Police are investigating the incident, and a criminal probe has been launched. Interior Ministry spokeswoman Irina Volk said a suspect had been detained.Prilepin became a supporter of Vladimir Putin in 2014 after the Russian president illegally annexed the Crimean peninsula. He was involved in the conflict in eastern Ukraine on the side of Russia-backed separatists.",
        "Last year, he was sanctioned by the European Union for his support of Russia’s full-scale invasion of Ukraine.In 2020, he founded a political party, For the Truth, which Russian media reported was backed by the Kremlin. A year later, his party merged with the nationalist A Just Russia party which has seats in parliament. Direct responsibility of the US and Britain  Maria Zakharova  As a co-chairman of the newly formed party, Prilepin won a seat in the State Duma, Russia’s lower house of parliament, in the 2021 election, but gave it up.Party leader Sergei Mironov called the incident on Saturday “a terrorist act” and blamed Ukraine for it.Russian Foreign Ministry spokeswoman Maria Zakharova echoed Mr Mironov’s view in a post on Telegram, adding that the responsibility lies with the US and Nato.“Washington and Nato have nursed yet another international terrorist cell — the Kyiv regime,” she wrote. “Direct responsibility of the US and Britain. We’re praying for Zakhar.”Ukrainian presidential adviser Mykhailo Podolyak appeared to point the finger at the Kremlin, tweeting that “to prolong the agony of Putin’s clan and maintain the illusionary ‘total control,’ the Russian repression machine picks up the pace and catches up with everyone”, including supporters of the Ukraine war."
    ]
}