{
    "articleURL": "/news/article-12057589/Disgraced-tech-mogul-Elizabeth-Holmes-speaks-works-stay-prison-appeal-conviction.html",
    "content": [
        "Elizabeth Holmes, the disgraced CEO of Theranos, conducted a series of interviews with the New York Times in an attempt to rebuild her public imageLast week, she successfully delayed the start of her more than 11-year prison sentence through a last-minute appeal The interviews are significant as they mark her first engagement with the media since 2016 as she aims to present herself in a more relatable mannerDisgraced Theranos CEO Elizabeth Holmes has given a series of interviews to the New York Times in an attempt to rehabilitate her image - after a last-minute appeal meant she's avoided starting her more-than 11-year prison sentence.",
        "In a lengthy profile piece published in Sunday's paper, the convicted fraudster, now a mother to two young children, conducted a series of interviews in which she revealed how she spent some of the past year volunteering at a rape crisis hotline, working 12-hour shifts. The interviews are significant because it is the first time she has spoken with the media since 2016 with this latest outreach an attempt to portray herself in a more relatable light whilst defending her actions while promoting her future as a health-tech innovator.Speaking about Theranos, Holmes acknowledged she made numerous mistakes due to her lack of knowledge and understanding at the time. 'I made so many mistakes and there was so much I didn't know and understand, and I feel like when you do it wrong, it's like you really internalize it in a deep way,' Holmes said as she walked around the San Diego Zoo with her baby and a reporter from the New York Times.",
        "She expresses a deep sense of personal responsibility for the failures, acknowledging the impact it had on her but still appears to be of the mindset that her company, despite being exposed as a fraud, could have changed the healthcare industry for good.'We would've seen through our vision,' she insists and reveals she is even working on new inventions. The Times describes Holmes  view as 'idealistic delusion'.",
        "'I still dream about being able to contribute in that space,' Holmes said. 'I still feel the same calling to it as I always did and I still think the need is there.' Holmes fall from grace came after journalist John Carreyrou exposed the claims made by her health-tech startup, Theranos, as false. At the time, Theranos was valued at $9 billion after it touted blood-testing technology that only required tiny amounts of blood and capable of detecting dozens of health issues from a single drop.  ",
        "Carreyrou's report in 2015 triggered regulatory investigations and a lawsuit by the SEC, ultimately leading to Holmes' conviction in January 2022 on four counts of fraud and conspiracy. Stanford dropout Holmes founded Theranos, when she was still a teenager in 2003, claiming she could revolutionize blood testing.Ten years later the value of the company shot up when it formed a partnership with Walgreens to offer in-store blood collection centers.By 2014 the company was said to be worth $9 billion and Forbes ranked Holmes as the youngest self-made billionaire in the world.But the following year the exhaustive investigation by WSJ, it was claimed Theranos's system provided false reports and revealed the company had been using commercially available machines from other companies for most of its testing, and Holmes was banned from operating a blood-testing service for two years.",
        "Lawsuits started flooding in and Theranos collapsed in scandal, eventually shuttering in 2018.During her time at the helm, Holmes developed a particular look becoming known for her distinctive black turtleneck, red lipstick, messy blonde hair, and a deep voice. Holmes admitted to the Times that such traits were not authentic. 'I believed it would be how I would be good at business and taken seriously and not taken as a little girl or a girl who didn't have good technical ideas,' said Holmes. 'Maybe people picked up on that not being authentic, since it wasn't.' Holmes also details her personal life, featuring her partner, Billy Evans, and their two children. She described finding love amidst the chaos of Theranos' collapse as a beautiful experience.'Finding your person in the middle of all of this and experiencing that love when you're going through hell is the most beautiful thing I've ever experienced,' she said. Up until now, the mom-of-two had been putting on a brave face ahead of her sentence, going about her daily life as if nothing is bothering her.",
        "She and partner Billy Evans were seen doing everything they can to ensure that life goes on as normally as possible right up to the time she would swap her designer duds for a prison jumpsuit.",
        "Holmes had a child shortly before her trial and has had a second since her conviction which some have seen as a cynical ploy to obtain a reduced sentence following her trial. In recent pictures, hotel heir Evans could be seen carrying son William, 2, while Holmes carefully snuggled tiny Invicta, the daughter she gave birth to in February. Perhaps showing her state of mind, the couple named the little girl after the Latin word for invincible. It can also mean unconquered. Holmes also revealed that she volunteered at a rape crisis hotline, citing her own history of alleged abuse as a driving force behind her involvement. During an earlier court hearing she testified against her former partner and ex-Theranos COO Ramesh 'Sunny' Balwani, accusing him of physical and emotional abuse. She also disclosed that she had been a victim of sexual assault during her time at Stanford University, an event that influenced her decision to drop out and establish Theranos. Holmes chose not to press charges."
    ]
}