{
    "articleURL": "/travel/article-12060217/Taking-hotel-breaks-new-heights-expensive-penthouse-suites-US.html",
    "content": [
        "The towering Times Square Edition offers a lofty penthouse boasting prime views of Times Square There is a newly-renovated three-bedroom penthouse suite at the Beverly Wilshire, A Four Seasons Hotel The Setai's swanky presidential suite, which is one of singer the Weeknd's favorite spots, costs from $50,000Bagging a sky-high hotel room can come with sky-high prices, as these pricey penthouse suites demonstrate. ",
        "DailyMail.com contacted a spread of hotels across the US to reveal an up-to-date list of some of the costliest penthouse suites around. Coming in at first place, and retaining its number one spot, is the cavernous Mark Penthouse at New York's Mark Hotel which costs from $75,000 per night and is best known for being the suite of choice for Meghan Markle's lavish baby shower. Other lofty hotel rooms costing top dollar include a contemporary pad at the Times Square Edition in New York ($15,000), a salubrious lair at the Faena Hotel beloved by a roster of celebrities including Leonardo DiCaprio ($65,000) and a historic three-bedroom apartment which has welcomed everyone from the Kardashians to Marylin Monroe ($22,000). Travel down to see the rest of the rooms, reserved for the rich and famous.  Oriental Penthouse Suite, Mandarin Oriental, Miami - From $10,000 per night",
        "Offering a slice of tranquility amid the bright lights of Miami, the Mandarin Oriental resort is located on the three acre island of Brickell Key.Still within walking distance of shops, restaurants and popular nightspots, the five-star prides itself on being 'the ultimate tranquil oasis for an escape.'All of the rooms within the curved Art Deco building boast balconies but the Oriental Penthouse Suite on the top floor has an outdoor space that runs the entire length of the unit.",
        "Floor-to-ceiling windows also allow for top notch views of Biscayne Bay and Miami's skyline beyond.Other perks of the room - which starts from $10,000 per night - include a lavish master bedroom, a spacious living area with piano, a marble bathroom with dual vanities, a freestanding bath and an oversized shower.The dining space includes a butler kitchen, which makes it the perfect space for entertaining, and there is a state-of-the-art media room.In terms of the interiors, the 2,368 sq ft suite features contemporary furnishings in neutral colors with splashes of lipstick red here and there and unique artworks. Penthouse Diamond Suite, Espacio The Jewel of Waikiki, Hawaii - From $10,000 per night",
        "Get into the island swing of things and soak up stunning views of the Pacific Ocean from the Penthouse Diamond Suite at the boutique Espacio hotel in Hawaii.This hotel's top-floor two-bedroom apartment offers breathtaking panoramic views of the coastline and the Diamond Head volcanic cone beyond. Sliding glass doors lead out to a generous terrace space decked out with a whirlpool, which makes for an ideal place to hang out and gaze at the night sky come nightfall.  From the kitchen to the living room and bedrooms, this suite has a relaxed beachy feel thanks to a neutral color scheme featuring soft sandy, cream and blue hues. ",
        "While the price of the suite is still around the five-figure mark the price gets you lots of perks including round-trip luxury airport transportation, an in-room massage, champagne upon arrival, full in-suite breakfast daily, a private dining experience, a $300 wine credit, and a serving of caviar and champagne at the rooftop lounge.Penthouse Suite, Edition Times Square, New York City - From $15,000 per night",
        "The towering Times Square Edition, which sits within the portfolio of hotels masterminded by famed hotelier and former Studio 54 co-owner Ian Schrager, offers a lofty penthouse boasting prime views of Times Square and the Hudson River.In keeping with the rest of the five-star hotel, the 1300 sq ft suite features slick contemporary furnishings in sandy, cream and white tones, with floor-to-ceiling windows allowing for plenty of natural light. Perks include a plush king bed, a natural stone bathroom with an enclosed rain shower and deep soaking tub and custom-made bathroom amenities made from luxury perfumer Le Labo. But the pièce de résistance is the penthouse's outdoor balcony, which makes for the ultimate spot for an Instagram shot or two.   The five-star 516ft-tall Times Square Edition, which was in the works for more than eight years and opened in 2019, took shape as part of an $800million-plus development project. Schrager's aim was to inject a bit of sexy and chic into Times Square. ",
        "Other attractive features of the hotel include a club where weekly performances are held, an exotic palm-filled terrace restaurant and a state-of-the-art fitness club with sky-high views.TriBeCa Penthouse, The Greenwich Hotel, New York City - From $18,000 per night",
        "Hollywood legend De Niro opened this celeb-favored hotel in his home city in 2008. Architect David Rockwell designed the project to the actor's personal taste, which Wallpaper magazine said he defined as 'masculinity and comfort, executed with meticulous, refined craftsmanship.''It was a really good, collaborative project,' Rockwell said. 'Bob (De Niro) wanted the hotel to fit into the fabric of TriBeCa, so we started looking at brick treatments, among other elements.'There's an eclectic feel inside the hotel and none of the 88 rooms and suites are the same apart from the beds, which are from UK manufacturer Savoir. The most luxurious accommodation offerings are the three penthouses, with the sprawling TriBeCa pad coming in at $18,000 per night. The swanky suite, beloved by celebrities, features three bedrooms, which all lead through to a picturesque terrace space dripping with wisteria.Other highlights include a large living room with a minimalist custom stone fireplace, a large skylight in the main corridor and an upper terrace decked out with an outdoor wood-burning fireplace, an 18-person table for al fresco dining, and a heated spa pool. ",
        "In terms of the hotel's restaurant, De Niro sticks to what he knows best. Locanda Verde, headed up by Andrew Carmellini serves up Italian comfort food beloved by everyone from Kendall Jenner to the Sussexes. Another draw is the hotel's slick basement gym and Japanese-inspired spa, complete with a lantern-lit swimming pool.Despite the name, the hotel is not near Greenwich Village and instead on the edge of De Niro's favorite neighborhood, TriBeCa.Penthouse Suite, Beverly Wilshire, A Four Seasons Hotel, California - $25,000 per night",
        "If you're looking for the ultimate spot to entertain guests while staying in Los Angeles, look no further than the newly-renovated three-bedroom penthouse suite at the Beverly Wilshire, A Four Seasons Hotel.The iconic hotel, which counts Elvis Presley, Warren Beatty and Steve McQueen among former residents, boasts the biggest suite in Los Angeles with it covering 5,000 square feet.Upon entering, guests are welcomed with prime views of Rodeo Drive, the Hollywood Hills, Century City and Downtown Los Angeles, and the living room features a wraparound balcony to further enjoy the vistas. Designers say the suite's open floor plan was made for hosting private parties, with 'guests easily flowing from the media room to the living room to the dining room and onto the terrace.'Meanwhile, a state-of-the-art kitchen with a serving island and marble countertops 'makes catering a breeze'. ",
        "On the design side of things, there's hints of leopard print to inject a little Hollywood glamor, while the contemporary furnishings were inspired by Art Deco-style. Penthouse Suite at the Fairmont San Francisco Hotel - $22,000 per night",
        "Follow in the footsteps of the Kardashians, Elton John, The Rolling Stones, John F. Kennedy, and Marilyn Monroe by checking into the 6,000 sq ft Penthouse Suite at the historic Fairmont San Francisco.Located on the eighth floor, the expansive and lavishly furnished apartment (which has been valued at $20 million) features three large bedrooms and four bathrooms.Some of the suite's more unusual features include a secret passage behind a bookcase, a two-story library with 2,500 books and a domed ceiling, a very ornate billiard room decked out with Moorish-inspired designs and a Mediterranean-style outdoor terrace overlooking the city and Bay areas.The hotel says while the suite can be booked out for private use, it also 'provides an unforgettable setting for important occasions ranging from lavish weddings to high-profile meetings and accommodates up to 100 people for entertaining.' The is a piano in the living room for a spot of entertainment, while the formal dining room can seat up to 60 guests in 'high Art Deco style'.To cater for events, there is a full professional kitchen within the suite. Before opening to the public as one of the world's most luxurious suites in 1981, the penthouse served as a home for various wealthy owners including Maude Flood, the heiress to a mining fortune.Thanks to its spectacular interiors and unique history, the Fairmont's Penthouse Suite is on the National Register of Historic Places. Grand Penthouse, The Plaza, New York City - $35,000 per night",
        "Feel like top dollar within the regal confines of the Grand Penthouse at The Plaza in New York.Set on the 20th floor of the iconic hotel, where a young Macauley Culkin famously bumped into Donald Trump in Home Alone 2, this lavishly-appointed suite serves up two bedrooms and a large living-cum-dining room over two levels.Each bedroom also comes with a full bathroom, decked out with mosaic floors and 24-carat gold-plated fixtures. But the real perk of this 2,100 sq ft apartment is its sundrenched terrace, with plenty of space for hosting get togethers or staging photoshoots. The outdoor area can be accessed via the master bedroom on the upper level or via another entrance way off the suite's staircase. On the design side of things, the hotel notes that the attractive mix of antique and modern furnishings is 'evocative of sophisticated Upper East Side residences while paying homage to the hotel's unique heritage.'The price of the Grand Penthouse - from $35,000 per night - also includes 'white glove butler service', with a team of staff on hand to cater to every whim.Marybelle Penthouse Suite, Four Seasons Hotel at The Surf Club,  Florida - $40,000 per night",
        "Sail away on your vacation in style at the ocean-facing Marybelle Penthouse Suite. Located on the top floor of the Four Seasons Hotel at The Surf Club in Florida, the bright and airy apartment features three bedrooms, and multiple terrace areas set across three levels.Designed for entertaining friends and family, the suite features a media room, a dining room, and a large living room with floor-to-ceiling windows.Moving outdoors, there is an expansive patio area off the living room and all of the bedrooms on the second floor boast their own balconies. The master suite is especially impressive with a large bathroom and a roomy walk-in closet.However, the real selling point of this suite is the rooftop, where guests can dip between a sundeck, lounge area and a private pool overlooking the ocean.  To get into the vacation swing of things, the suite boasts an extensive wine collection with more than 85 wines to pick from. And to complement the wine program the hotel restaurant's chef - who is behind notable Michelin-starred spots in New York City - has crafted five and six-course menus exclusively for guests of the Marybelle to enjoy at their leisure.Rates for the penthouse suites start from $40,000 and it can accommodate up to eight adults or five adults and three children.The Penthouse, The Setai, Miami Beach - $50,000 per night",
        "Take your Miami vacation to new heights by checking into The Setai's swanky presidential suite. Available exclusively upon request and from $50,000 per night, this 10,000-square-foot accommodation offering spans the hotel's entire 40th floor. Features of the pricey suite, which is one of singer the Weeknd's favorite spots, include four bedrooms decked out with floor-to-ceiling windows and four-poster beds, a gourmet kitchen, a separate music room and a dining room that can seat up to ten guests.The use of dark woods and natural stone in the suite help to create a warm and inviting ambiance.  Moving to the terrace space, there's an Instagrammable private pool serving up city and beach vistas, along with a generous sundeck area. Penthouse Suite, Faena Hotel Miami Beach, Florida - $65,000 per night",
        "Lap up dreamy views of Miami Beach from the theatrical five-bedroom Penthouse Suite located at the top floor of the luxury Faena hotel. This 14,507 square-foot residence - generously decked out with floor-to-ceiling windows - is spread across two levels with plenty of space for entertaining. The lounge area serves as the main hub of the suite, with large couches, a marble-topped dining table and a grand piano for musical sessions after the sun's gone down. In terms of furnishings, the suite - as with the rest of the hotel - features plush red velvet upholstery, lashings of gold and bold animal prints. In the bathrooms, there's generous use of marble-cladding, while free-standing soaking tubs and gold fixtures complete the regal look. Moving to the bedrooms, each one features furnished balconies, so guests can soak up the sun at their leisure. The Faena, which is beloved by everyone from Serena Williams to Leonardo DiCaprio, houses an array of other gems including a cabaret theatre 'inspired by Europe's grand opera houses and the glittering allure of Old Hollywood', a sophisticated restaurant masterminded by Argentine grillmaster Francis Mallmann and a 22,000-square-foot spa. ",
        "The Mark Penthouse, The Mark Hotel, New York - $75,000 per night ",
        "It costs an eye-watering $75,000 a night, which makes the Mark Penthouse at New York's Mark Hotel America's most expensive hotel room. The 10,000-square-foot suite on the 16th floor has five bedrooms, six bathrooms, a living room, dining area and a stunning rooftop terrace. Drake recently checked into the penthouse while in New York for a two-night stand at the Apollo Theater and it was also the suite of choice for Meghan Markle's baby shower.  It certainly makes for an impressive place to entertain, with 26-foot-high vaulted ceilings adding to its grandiose appeal. The kitchen off the main entertainment area boasts top-of-the-range appliances, a stone-topped central island and a floor-to-ceiling wine fridge, allowing one's private chef to rustle up culinary delights with ease. The majority of the suite was designed by French interior designer Jacques Grange, while the kitchen was masterminded by Piero Lissoni from Italian luxury firm Boffi, with professional appliances by Gaggenau and Miele.For dining, guests have access to 24-hour room service by The Mark Restaurant by Jean-Georges, and can request an al fresco dining experience on the terrace with an exclusive menu prepared by three-Michelin-starred chef Jean-Georges Vongerichten."
    ]
}