{
    "articleURL": "/property/article-12041255/The-Brits-starting-vineyards-producing-wine-rival-French.html",
    "content": [
        "MailOnline has looked at some of the Britons who have set up thriving vineyardsThe British wine industry is thriving, improving and in competition with France, Italy and Spain as Britons' dreams of running their own vineyards increasingly becomes a reality. ",
        "It is said to be one of the fastest-growing sectors of the economy - and home-brewed recipes are coming at a fraction of the cost of comparisons from abroad. Global warming means that vineyards in the hottest parts of Britain can now produce grapes with sufficient ripeness to make wine. And over the next 20 years there could also be a 1.4C rise in average temperatures, making it around 15C-16C during the vineyard growing season (April to October).'A lot of overseas buyers and investors are developing commercial vineyards in the South-East of England, while hobby vineyards make wonderful retirement projects,' Ed Dixon, head of rural asset management at Knight Frank, said.MailOnline has looked at some of the Brits who have set up their own thriving vineyards on their country estates. ",
        "Carlton Towers, Goole, home of Lord and Lady Fitzalan-HowardLord Gerald Fitzalan-Howard and his wife Emma Georgina Egerton Fitzalan-Howard own Carlton Towers, near Goole.'Having a stately home is a privilege,' Emma told Hull Live, 'but it comes with a big emotional price tag'.The couple have come up with several ways to fund the upkeep of the 126-room Towers, including hosting weddings. They have also planted a vineyard to produce their own sparkling wine for guests.Emma said: 'The moment the vines start growing, we're immersed in that. We're pruning all day long. It's back-breaking but it's so rewarding.'",
        "The Carlton Towers webpage reads: 'Step through the powder-blue gate into our beautiful, Walled Garden Vineyard. 'The Yorkshire climate is ideal for producing our limited release, deliciously light sparkling wine.' Carlton Towers is officially the Yorkshire home of the 18th Duke of Norfolk, Lord Gerald's elder brother. But it fell to Lord Gerald and Lady Emma to restore the property, and make it a shining example of the new concept of 'stately home as recreational destination', available for corporate events, weddings, stag and hen weekends. ",
        "Simpsons Wine Estate, Canterbury - owned by Ruth and Charles SimpsonRuth Simpson and her husband Charles who own Simpsons Wine Estate just outside of Canterbury said the region has a lime-rich chalky soil reminiscent of soil found in France - which helps the production of wine. 'One of the most important factors of growing wine is the terroir,' she told Kent Live. 'There is no direct translation from France, but terroir refers to a combination of several elements of wine growing, including temperature, climate, soil and composition. 'There's a chalk which is also not just similar but identical to the terroir in Champagne and also in Burgundy. That's why most of the vineyards are situated along the North Downs in Kent, through Sussex, Hampshire and to Dorset.'People have been growing wine in England for years but they have planted the Germanic varieties because the climate is so inclement. Whereas now people have very much made this switch to the Champagne variety, Chardonnay, Pinot Noir because those are the quality varieties that we can actually make really good sparkling wines and still wines from.'",
        "She said Kent's sparkling wine could rival wine found in the Champagne or Burgandy regions in France - and at a much cheaper price. ",
        "Sealwood Cottage Vineyard, Derbyshire, established by John and Elizabeth GoodallJohn and Elizabeth Goodall have turned the land surrounding their South Derbyshire house into a successful vineyard. Sealwood Cottage Vineyard is now a popular local business with wine tasting on offer. They sell Rondo, Regent, Augusta and Solaris from the cellar door to wine-lovers, farm shops, delis, markets and agricultural shows. 'After we planted the vines, it just took off, coming into its own just before Covid,' Elizabeth told Derbyshire Live. 'British wine has certainly changed. You now even have French people buying land in southern England,' she added.'People ask us, 'Is your wine like French wine?'. But we don't want our wine to be French or Italian, we want it to be English.' John added that they have managed to produce new varieties of Pinot and Chardonnay.And in August the newspaper reported that the couple were looking for new owners to take over their business, despite enjoying every minute of the process. 'We built it from the ground up, but John's nearly 80 so we're retiring,' Elizabeth added. ",
        "Oastbrook Estate Vineyard, Sussex, established by America and Nick BrewerAmerica Brewer and her husband Nick oversee affairs at Oastbrook Estate, Sussex, which they planted with vines in 2018. ",
        "The estate produces both still and sparkling wines and even has its own 'hobbit house' for guests to enjoy overnight stays. They also run wine-tasting and tours of the vineyard. ",
        "Velfrey Vineyard, Pembrokeshire, a family business led by Andy MounseyAndy Mounsey established his three-acre vineyard in Lampeter Vale, Pembrokeshire, with his wife Fiona and their son, Ryan, from scratch.Velfrey Vineyard began in 2016 and the family started selling their first bottles of sparkling white wine in 2020. 'Our sons suggested creating a vineyard and we found our site ticked every box. Also, the grapes wouldn't run away,' Andy told the Telegraph. ",
        "High Clandon Estate Vineyard founded by Sibylla and Bruce TindaleSibylla and Bruce Tindale founded High Clandon Estate Vineyard in 2004, both with a passion to create quality English sparkling wine. It has come to specialise in singular, matured-vintage-only English sparkling Cuvées.Sibylla, a lover of champagnes according to the estate's website, believed the best of British could surpass French sparkling wine. ",
        "Furleigh Estate, Dorset - owned by Rebecca Hansford and Ian EdwardsRebecca Hansford felt drawn to the English countryside to make wine. She grew up in Furleigh, Dorset, on her father's dairy farm, before doing a degree in maths and moving to London to become an actuary.But despite herself, Rebecca found herself pining to return to the country, and when she saw her former family home up for sale she jumped at the opportunity.She says: 'I thought I would never return to the West Country. I was an actuary advising companies on pension schemes and I realised Dorset was the most beautiful place in the world. ",
        "'My father had sold the farm, but my husband and I bought it back, and now I can see my children grow up where I grew up.' Her reasons for deciding to plant a vineyard were entirely straightforward. 'When you come back to somewhere where there are not many people you can't start a business where you require lots of people coming in and we're not into animals so we wanted to grow something.'They produce sparkling champagne grapes chardonnay, pinot noir and pinot meunier and have Bacchus and Rondo grapes, used to produce still wine. Rebecca thinks English wine is coming of age.'I think English wine is a bit at that stage now some people will give it to their friends and say 'where do you think this comes from?''It says Dorset on our label - people will bring it back from holiday but to get them to buy the second bottle, it has to be good.'Now more people are trying it, more people want it and so it keeps on expanding. '"
    ]
}