{
    "articleURL": "/tvshowbiz/article-12039599/Pregnant-Karlie-Kloss-keeps-warm-cream-sweater-shes-seen-stepping-New-York.html",
    "content": [
        "Karlie Kloss was seen stepping out in New York a few days prior to her pregnancy reveal at the Met Gala on Monday night.",
        "The model, 30, covered up her burgeoning baby bump in a cozy cream sweater, and held a large Dior tote bag which she carried in front of her.The Victoria's Secret Angel paired the look with black jeans and matching black loafers.She wore her brunette tresses cascading down her back and sported a pair of black sunglasses for the day. This will be the second child for Karlie and her businessman husband Joshua Kushner, 37, who accompanied her to the Super Bowl of fashion where she proudly showed off her baby bump.",
        "The couple welcomed their first child - son Levi, who is now two - in March 2021.The beauty opted for a stunning skintight black gown that clung to her curves and was adorned with strings of white pearls as she hit the red carpet at the Metropolitan Museum of Art. The runway sensation rather accessorized with a number of silver jewels, including a ring and earrings.The expecting mother wore her brunette tresses parted in the middle and slicked back into a long ponytail, which was adorned with a chic black satin bow.She wore a touch of matte lipstick on her pout and a light brush of highlighter on her cheeks.Kloss discussed the 'special' and 'vulnerable' reveal with Emma Chamberlain as she hit the red carpet as per Page Six.",
        "'I don’t know how to style a belly,' she told her, sharing that her last pregnancy happened during the coronavirus pandemic.Following the Met Gala Karlie changed into a sheer minidress and headed to an afterparty with her other half.She opted for a short number, featuring netting and a cinched-in waist.",
        "The Chicago native also took to Instagram to show off her preparation for the event. Wearing a cozy white robe, Karlie was seen prepping her skin with a violet light Therabody machine in a clip posted to her Stories.She also posted a cute snap that saw her toddler son reaching for her tummy as she was getting ready.Another clip showed off the makeup she would be using for the occasion.She also shared a mirror selfie taken in a bathroom while getting ready for the big night.Karlie and Joshua - whose brother and sister-in-law are Jared Kushner and Ivanka Trump - were first spotted spending time together during an afterparty for the 2012 Victoria's Secret Fashion Show.They waited for a whole year before making their initial public appearance as a couple. The duo went Instagram official with their relationship in 2014.Although the two fielded rumors of an engagement in 2017, they initially shut down the idea before they decided to begin planning their marriage the following year, with Karlie converting to Judaism.",
        "Kushner and Kloss made their union official during a wedding ceremony that was held in October of 2018, and they had a second event in June of 2019.In October of 2020, multiple sources reported that the two were planning on bringing a child into their lives.The supermodel later confirmed that she was pregnant with a video that was shared to her Instagram the following month, during which she showed off her then-growing baby bump.She eventually gave birth to Levi Joseph in March of 2021."
    ]
}