{
    "articleURL": "/news/article-12046773/Number-modern-slavery-victims-quarter-year.html",
    "content": [
        "4,746 potential victims were referred to the Home Office from January to MarchThe number of potential victims of modern slavery in the UK rose by more than a quarter in the first three months of 2023 compared with the same period last year.",
        "A total of 4,746 potential victims were referred to the Home Office from January to March, new figures show. That is an increase of 26 per cent from 3,773 in the first quarter of 2022, and a rise of seven per cent on the period October to December.Albanian nationals accounted for almost a third (31 per cent) of all potential victims, making up 1,452 of the total number.British nationals were the second most commonly referred nationality at 1,163, making up 25 per cent of the total, while the third most common nationality was Sudanese at 226, making up per cent. ",
        "The number of people referred into the National Referral Mechanism (NRM) - a system which identifies potential victims of modern slavery and human trafficking so their case can be considered - in the first three months of this year was the highest since the scheme started in 2009, the Home Office said.The Home Office said referrals for Albanian nationals reached the highest number and proportion since the NRM began, and were higher than UK nationals for the fifth consecutive quarter.Referrals for British nationals reached their highest quarterly figure since the scheme began, having grown since July to September 2021.The role of anti-slavery commissioner remains vacant after Dame Sara Thornton left the post in April 2022.",
        "Last month, speaking during the opening session of the Home Affairs Committee's new inquiry into human trafficking, she described the failure to find someone to replace her as 'deeply regrettable' and suggested there could be a conflict of interest with the Home Office being in charge of the appointment."
    ]
}