{
    "articleURL": "/sport/mma/article-12049169/Anti-trans-UFC-star-Jake-Shields-offered-fight-10-trans-men-row-challenge-accepted.html",
    "content": [
        "Texas transgender wrestler has accepted the challenge Will only fight Shields in a one-on-one match Has declared they are going to destroy the UFC star UFC star Jake Shields created a scandal when he challenged 10 trans male fighters to face him without a break between bouts - and now wrestler Mark Beggs has answered the call and boasted he will 'f**k up' the former world title contender.",
        "Shields has aired his controversial views about transgender issues on more than one occasion, including a now-deleted Tweet calling for public executions for anyone who supported children in transitioning from one gender to another.After suffering a decision loss to former Bellator middleweight champion Hector Lombard at UFC 171 in 2014, Shields was let go from the organisation.He has called out transgender men for an exhibition MMA fight, declaring he would take on 10 of them in separate fights without any rest in between. ",
        "'Since trans men are real men I would like to challenge the 10 toughest trans men in the world to a fight. I fight them with no training camp and no rest between each fight,' Shields tweeted.He then doubled down on his challenge when nobody initially accepted. 'A million views and not a single trans man has stepped up to accept my challenge. I'm starting to think they don't have the balls to fight me,' he posted.However, Beggs - an amateur wrestler and transgender man - has now stepped up to take him on. ",
        "'We just going to make this an official call out, but Jake Shields I will take you up on your offer,' he said.'But the offer isn't going to be 10 versus one and 10 trans men you're going to be fighting for the rest of the night.",
        "'You're going to do a one-on-one type match.'You're going to do it right. If you're going to call yourself a fighter do it f***ing right.'Like, that's just f***ing disrespectful. It's disrespectful to the sport of MMA for you to just be like 'oh yeah let me just call out 10 trans men and I'll f***ing whoop them.'And [to ask] if there even is any trans man fighters out there. And there is.'The fact that everyone is like 'oh yeah like trans women are f***ing up the fighting world. Hey, we still here too bro.'We still here, we've always been here.'It's the fact that y'all are so fixated and hyper-fixated and have some f***ing fetish with trans women that you even forget that we f***ing out here and we going to f*** you up.'I'm specifically going to f*** you up Jake Shields.'Shields has accepted the challenge, with the details to be determined. ",
        "Beggs was infamously forced to wrestle against girls while transitioning from female to male in high school.He won the Texas state girls' wrestling championship two years running after being denied entry into the men's division because Texas law requires students to compete under the gender listed on their birth certificate.'I can say that I was biologically a woman, so technically there was no advantage,' Beggs said in 2021.",
        "'And I made sure there was no advantage because when I was on testosterone, I took a hormone blocker on top of taking my hormones. 'So it wasn't just my estrogen being depleted, but it was also the synthetic hormone testosterone that I was also putting inside my body that was also decreasing.'"
    ]
}