{
    "articleURL": "/wires/ap/article-12051199/Could-AI-pen-Casablanca-Screenwriters-aim-ChatGPT.html",
    "content": [
        "NEW YORK (AP) - When Greg Brockman, the president and co-founder of ChatGPT maker OpenAI, was recently extolling the capabilities of artificial intelligence, he turned to \"Game of Thrones.\"",
        "Imagine, he said, if you could use AI to rewrite the ending of that not-so-popular finale. Maybe even put yourself into the show.\"That is what entertainment will look like,\" said Brockman.Not six months since the release of ChatGPT, generative artificial intelligence is already prompting widespread unease throughout Hollywood. Concern over chatbots writing or rewriting scripts is one of the leading reasons TV and film screenwriters took to picket lines earlier this week.Though the Writers Guild of America is striking for better pay in an industry where streaming has upended many of the old rules, AI looms as rising anxiety.\"AI is terrifying,\" said Danny Strong, the \"Dopesick\" and \"Empire\" creator. \"Now, I´ve seen some of ChatGPT´s writing and as of now I´m not terrified because Chat is a terrible writer. But who knows? That could change.\"",
        "AI chatbots, screenwriters say, could potentially be used to spit out a rough first draft with a few simple prompts (\"a heist movie set in Beijing\"). Writers would then be hired, at a lower pay rate, to punch it up.Screenplays could also be slyly generated in the style of known writers. What about a comedy in the voice of Nora Ephron? Or a gangster film that sounds like Mario Puzo? You won't get anything close to \"Casablanca\" but the barest bones of a bad Liam Neeson thriller isn't out of the question.",
        "The WGA´s basic agreement defines a writer as a \"person\" and only a human´s work can be copyrighted. But even though no one´s about to see a \"By AI\" writers credit at the beginning a movie, there are myriad ways that regenerative AI could be used to craft outlines, fill in scenes and mock up drafts.\"We´re not totally against AI,\" says Michael Winship, president of the WGA East and a news and documentary writer. \"There are ways it can be useful. But too many people are using it against us and using it to create mediocrity. They´re also in violation of copyright. They´re also plagiarizing.\"The guild is seeking more safeguards on how AI can be applied to screenwriting. It says the studios are stonewalling on the issue. The Alliance of Motion Picture and Television Producers, which bargains on the behalf of production companies, has offered to annually meet with the guild to go over definitions around the fast-evolving technology.\"It´s something that requires a lot more discussion, which we´ve committed to doing,\" the AMPTP said in an outline of its position released Thursday.Experts say the struggle screenwriters are now facing with regenerative AI is just the beginning. The World Economic Forum this week released a report predicting that nearly a quarter of all jobs will be disrupted by AI over the next five years.",
        "\"It´s definitely a bellwether in the workers' response to the potential impacts of artificial intelligence on their work,\" says Sarah Myers West, managing director of the nonprofit AI Now Institute, which has lobbied the government to enact more regulation around AI. \"It´s not lost on me that a lot of the most meaningful efforts in tech accountability have been a product of worker-led organizing.\"AI has already filtered into nearly every part of moviemaking. It´s been used to de-age actors, remove swear words from scenes in post-production, supply viewing recommendations on Netflix and posthumously bring back the voices of Anthony Bourdain and Andy Warhol.The Screen Actors Guild, set to begin its own bargaining with the AMPTP this summer, has said it's closely following the evolving legal landscape around AI.\"Human creators are the foundation of the creative industries and we must ensure that they are respected and paid for their work,\" the actors union said.The implications for screenwriting are only just being explored. Actors Alan Alda and Mike Farrell recently reconvened to read through a new scene from \"M(asterisk)A(asterisk)S(asterisk)H\" written by ChatGPT. The results weren´t terrible, though they weren´t so funny, either.\"Why have a robot write a script and try to interpret human feelings when we already have studio executives who can do that?\" deadpanned Alda.",
        "Writers have long been among notoriously exploited talents in Hollywood. The films they write usually don´t get made. If they do, they´re often rewritten many times over. Raymond Chandler once wrote \"the very nicest thing Hollywood can possibly think to say to a writer is that he is too good to be only a writer.\"Screenwriters are accustomed to being replaced. Now, they see a new, readily available and inexpensive competitor in AI - albeit one with a slightly less tenuous grasp of the human condition.\"Obviously, AI can´t do what writers and humans can do. But I don´t know that they believe that, necessarily,\" says screenwriter Jonterri Gadson (\"A Black Lady Sketchshow\"). \"There needs to be a human writer in charge and we´re not trying to be gig workers, just revising what AI does. We need to tell the stories.\"Dramatizing their plight as man vs. machine surely doesn't hurt the WGA's cause in public opinion. The writers are wrestling with the threat of AI just as concern widens over how hurriedly regenerative AI products has been thrust into society.Geoffrey Hinton, an AI pioneer, recently left Google in order to speak freely about its potential dangers. \"It´s hard to see how you can prevent the bad actors from using it for bad things,\" Hinton told The New York Times.",
        "\"What´s especially scary about it is nobody, including a lot of the people who are involved with creating it, seem to be able to explain exactly what it´s capable of and how quickly it will be capable of more,\" says actor-screenwriter Clark Gregg.The writers finds themselves in the awkward position of negotiating on a newborn technology with the potential for radical effect. Meanwhile, AI-crafted songs by \"Fake Drake\" or \"Fake Eminem\" continue to circulate online.\"They´re afraid that if the use of AI to do all this becomes normalized, then it becomes very hard to stop the train,\" says James Grimmelmann, a professor of digital and information law at Cornell University. \"The guild is in the position of trying to imagine lots of different possible futures.\"In that way, the long work stoppage that many are expecting - Moody´s Investor Service forecasts that the strike may last three months or longer - could offer more time to analyze how regenerative AI might reshape screenwriting.In the meantime, chanting demonstrators are hoisting signs with messages aimed at a digital foe. Seen on the picket lines: \"ChatGPT doesn't have childhood trauma\"; \"I heard AI refuses to take notes\"; and \"Wrote ChatGPT this.\" ___ Associated Press Writer Krysta Fauria in Los Angeles and Robert Bumsted and Aron Ranen in New York contributed to this report.",
        "___ Follow AP Film Writer Jake Coyle on Twitter at: http://twitter.com/jakecoyleAP"
    ]
}