{
    "articleURL": "/news/article-12049281/Budget-2023-Superannuation-warning-two-million-treasurer-Jim-Chalmers-doubles-tax-rate.html",
    "content": [
        "Labor plans to double super tax on $3m-plus fundsTreasury advice reveals the young will be hit worst Millions of young Australians could be caught in a superannuation tax trap laid by Treasurer Jim Chalmers when they finally prepare to retire.",
        "Treasury modelling reveals 2.05million Aussies currently aged 25 or under will be most affected by the new $3million tax cap on superannuation funds.Even if they only earn the average wage now, the modelling reveals they are likely to have more than $3million put aside by the time they're 60.They will then be hit by the government's planned new super tax which doubles the concessional tax rate from 15 per cent to 30 per cent on $3million-plus super funds.The treasurer was warned of the ticking timebomb he was leaving for the young but the government pressed on with the plan anyway, newly-released papers reveal.",
        "The treasurer also rejected a suggestion to future-proof the $3million cap and index-link it to the rate of inflation, but instead set it in stone to remain at the same level.Treasury advisory papers released under a Freedom of Information application by The Australian reveals those on average wage now will be earning $200,000 a year within 20 years.By the time they're in their 60s, their superannuation funds will hit $3million and face double the current tax rate as a result.'A 20-year-old who earns average wage throughout their career (around $90,000 in 2023) is projected to have a super balance that exceeds $3m in their early 60s,' the documents reveal.",
        "'That same individual is projected to have wages that exceed the top marginal tax bracket ($200,000) in their early 40s.'It also confirms more of today's younger generation will be affected by the super tax - planned to come into effect in 2025 -  compared to very few current older Aussies.The government said the super tax would have little impact on the wider population when the plan was announced in March and was targeted only at the super rich.Dr Chalmers insisted: 'This is a modest change that only affects half a per cent of Australians.'It's predicted to affect around 80,000 by 2025 and will raise $2billion, targeting the top 10 per cent of the nation's highest paid over the next 30 yearsOther age groups - including those in the 30s or 50s - are unlikely to be affected by the tax change, the Treasury modelling reveals.But by refusing to index-link the $3million cap, the tax change ignores the impact it will have on future generations.The Treasury document added: 'The $3m threshold is very generous. It can ­provide far more than what is needed to fund a comfortable retirement. 'This aims to provide structural savings to the budget over time.' The move has been slammed by Coalition shadow treasurer Angus Taylor who said Labor had been deliberately deceiving the public.",
        "'The idea that this policy change will only affect the super wealthy is complete nonsense,' he told The Australian. 'This is a tax on young Australians’ future in order to pay for Labor’s pet projects today.",
        "'Treasury’s own analysis shows that Labor’s doubling of tax on super will mean for the first time, young Australians will face higher taxes on their super than the generation before them.'The government has been misleading Australia and it is time for the Treasurer to come clean and confirm exactly how many people will lose out under these changes.'The Treasurer's office defended the super tax and said it would have less impact than a Coalition super tax tweak in 2017 which affected 160,000.A spokesman added: 'All their hypocrisy and hyperventilating is to distract from the fact that the Liberals want to add to their trillion dollars of debt to fund bigger tax breaks for people who already have tens of millions in super.'"
    ]
}