{
    "articleURL": "/wires/reuters/article-12045297/Angels-aim-stay-hot-Cards-reeling-finale.html",
    "content": [
        "The surging Los Angeles Angels will look to complete a three-game road sweep of the slumping St. Louis Cardinals on Thursday.",
        "The Angels won 5-1 Tuesday, then rallied with three ninth-inning runs for a 6-4 victory Wednesday for their sixth victory in their last eight games.\"Lot of great performances tonight,\" Angels manager Phil Nevin said after the comeback. \"Great win and good stuff in that clubhouse right now.\"Los Angeles will start Griffin Canning (1-0, 4.11 ERA) in the finale at Busch Stadium. He allowed three runs on four hits and two walks in five innings in his previous start, a 5-3 victory over the Oakland A's.That was his first big league victory since June 9, 2021. Canning missed the 2022 season while recovering from a stress fracture in his lower back.He is still scraping off rust and rebuilding endurance.\"I just think he just keeps getting better and better the more pitches he throws,\" Nevin said. \"I think a lot of it is feel for him with the changeup and the breaking ball. And you take almost two years off, it's hard to get that back. It takes some time. But he's been really good for us.\"Canning, who struck out seven in the win, believed that his performance against the A's represented a step forward.\"I had pretty good stuff,\" Canning said. \"I had a pretty good feel for all four of my pitches. I had a lot of 3-2 counts, which is something I want to eliminate.",
        "But overall, I felt good. I'm finding my breaking pitches earlier in games. There's a lot of positives to take from it.\"The Angels will likely play without shortstop Zach Neto, who suffered a finger contusion and laceration while fouling a bunt attempt Wednesday.\"Day-to-day, right now I'm leaning toward giving him (Thursday) off,\" Nevin said. \"It's going to be tough to grip a baseball (Thursday).\"The reeling Cardinals will bring a five-game losing streak into the series finale.\"I'd be lying if I said it's not frustrating,\" Cardinals manager Oliver Marmol said after his team blew a 4-3 lead in the ninth-inning on Wednesday. \"We've been tested quite a bit, and this fits right in.\"The Cardinals have sunk to the National League Central cellar while losing eight of their last nine games and 10 of 12.\"It takes a hell of a lot of courage to be patient, I'll tell you that,\" Marmol said. \"What I can tell you is I can't look at one guy in the eye that's in that clubhouse and ask for more, because of the way they are going about it, with their preparation and overall intensity during the game.\"It hasn't amounted to wins, and that's the part that's frustrating. But I can honestly look at each one of these guys and know that they are putting in the work.\"",
        "The Cardinals will start Jack Flaherty (2-3, 3.94 ERA), who struggled in his last start while lasting just 4 2/3 innings against the Los Angeles Dodgers.He allowed five runs (four earned) on seven hits, two walks and a hit batter in a 7-3 loss.--Field Level Media"
    ]
}