{
    "articleURL": "/tvshowbiz/article-12052525/Im-Celeb-Helen-Flanagan-emotional-phone-call-daughters.html",
    "content": [
        "Emotional scenes unfolded during Friday's episode of I'm A Celebrity... South Africa as Helen Flanagan was treated to a phone call home to her children.",
        "The former Coronation Street actress, 32, is mother to Matilda, seven, Delilah, four, and Charlie, two, with her ex-fiancé Scott Sinclair.Helen was chosen nominated to speak to her offspring for 90 seconds, with the ex soap star being chosen over Myleene Klass because Helen had been in the camp longer.Myleene, who is mother to daughters Ava, 15, Hero, 12, and son Apollo, three, burst into tears at the news.Although Myleene insisted she was over-the-moon for Helen and thrilled to hear her kids were doing well, the singer was left devastated over not being chosen. ",
        "A delighted Helen went to a clearing nearby for her call, with her mother Julia answering the phone, telling her the girls had been on their best behaviour.Elsewhere, screen star Helen was seen shedding some tears during Thursday's episode while thinking about her children during.She was pitted against former royal butler Paul Burrell during the show in a task that saw them try and win a luxury picnic for their respective teams.Helen became emotional ahead of the task and fellow campmate Myleene gave her words of encouragement.She told her: 'It's all in your head. Everything's in your head. Nothing's going to hurt you.'Also, there's a superpower that you've got behind you – that's your children. No bigger power.",
        "'Every day they make us proud, but this time around you'll get to make them proud.'Helen and Myleene hugged and the soap star later beat Paul in the challenge and won a picnic for her team.Elsewhere during Friday's episode, Joe Swash complained he had the 'worst outro ever' on EastEnders as the campmates discussed their challenging experiences in the media industry.",
        "The contestants discussed the BBC One soap opera as both Joe and fellow new arrival Dean Gaffney both previously starred in it.Singer and presenter Myleene also claimed her pop group Hear'Say once received a present from Sir Elton John as an apology for describing them as the 'ugliest band in pop'.During the latest instalment of the reality show, Joe and Dean reflected on their time on EastEnders.Dean, who played Robbie Jackson on the show, revealed he would go back to the show even after returning five times already.The discussion led to Joe, who previously portrayed Mickey Miller on the show, admitting: 'I wouldn't mind (going back), you know. Purely because of the family. Because you know what you're doing, how you're doing it, when you're doing it.'They've never asked me to go back in again, not once, mate!'When asked about how things ended for his character, the actor added: '(It was) the worst outro ever ... I didn't even leave at the end of the episode.",
        "'You know you leave and you get the \"duff duff\"? Mine, I went to Norwich to be a bellboy at a hotel and mid-scene just walked in The Vic, went, \"See you later\", turned back to Phil, come to me and I'd gone.'What? That was it? No \"duff duff\". I was there five years and not one \"duff duff\"!'",
        "Myleene also reflected on difficult moments within her career, including alleging that Sir Elton sent her pop group Hear'Say sympathy flowers after making a rude comment about the band.She said: 'We got sent flowers from Elton John who said we were the ugliest band in pop.'He realised, \"maybe I shouldn't have said that\". He sent \"sorry\" flowers to us... I look back at that time, it was a different time in history.'I'm A Celebrity... South Africa continues at 9pm on ITV1 and ITVX on Monday."
    ]
}