{
    "articleURL": "/tvshowbiz/article-12057909/King-Charles-III-Queen-Camilla-appear-American-Idol-judges-Katy-Perry-Lionel-Richie.html",
    "content": [
        "American Idol judges Perry and Richie were speaking to host Ryan SeacrestKing Charles then made the surprise appearance alongside Queen Camilla King Charles and Queen Camilla joked with Lionel Richie and Katy Perry during a surprise appearance on American Idol following the Coronation Concert.",
        "The singers, both judges on the US talent show, appeared on a livestream from Windsor Castle to speak with host Ryan Seacrest when the royal couple made the unexpected cameo last night.'What a party, it was unbelievable. Now we are trying to figure out what we can do to bring something different to the show,' Lionel said. 'So, I have a surprise.'Charles, wearing a blue suit, and Camilla, wearing a long blue jacket, then walked out and joined them, with a shocked Katy saying: 'Oh goodness.''I just wanted to check how long you will be using this room for,' King Charles said laughing. 'I just wanted to check.'",
        "'We have to give up the room up right away,' a smiling Lionel replied.Earlier, the two singers were asked how they had been enjoying the Coronation weekend.'What a party,' said Lionel, wearing an all-black outfit including an embellished sequin jacket. 'It was unbelievable.'Katy, 38, was by his side wearing a strapless green dress with a large pearl necklace and matching earrings.'It was incredible and we're here for the coronation concert at Windsor Castle,' Katy said.",
        "Then joined by the royal couple, King Charles praised the singers for their performances at the star-studded concert in the grounds of Windsor Castle.",
        "He added: 'No, thank you for your brilliant performance and thank Katy as well. It really was.'King Charles said it was 'great to have you both here.''Are we making too much noise?' Katy asked Queen Camilla.'I understand there is a party,' Lionel said.'Ah you have heard about that,' King Charles said.'Well, you are throwing a party right next door,' Lionel said.'Ah, that's right,' King Charles said. 'Had we better take you to the party but you're busy with all these other things.''As soon as we finish, we are coming to the party,' Lionel said.",
        "'We are coming to the party,' Katy said.'Well, you deserve it,' King Charles said. 'Bless you.''Thank you so much,' Katy said. 'We love you,' Lionel said as King Charles walked off. 'Congratulations.''God bless you,' Katy said.King Charles and Queen Camilla then walked off.Earlier in the night, Charles and Camilla watched from the royal box as Richie performed his hits Easy and All Night Long.Zara and Mike Tindall could be seen singing along to the songs, with some swaying from the Duke of Edinburgh. The performance sparked huge applause from the King and Queen. Richie revealed that he immediately jumped at the chance to perform at the celebratory concert, saying: 'It's an honour because it's every 80 years, except for the Queen who just took it all the way to the end. But I mean, this is amazing.' ",
        "Princess Charlotte, 8, and her mother, Kate, the Princess of Wales, then sang along as Perry, dressed in a gold foil ball gown, performed her pop hit 'Roar.' The event, which was organised by the BBC and watched by millions around the globe, featured a 70-piece orchestra, choirs and several unique dramatic performances. Hollywood star Tom Cruise, actress Joan Collins and singer Tom Jones all appeared via video message. A series of pre-recorded sketches also aired, revealing little-known facts about Charles and included moments from The Muppets and beloved literary character Winnie the Pooh.A message from Charles on the importance of environmental conservation was played, and the show was accompanied by a light and drone display with a nature theme. Prince William took to the stage to pay tribute to his father, saying that he knew the late Queen would be 'a very proud mother'.At the same time, 10 towns and cities across the country were treated to spectacular light displays, while 1,000 drones took to the sky for a UK-first 'multi-location drone show'."
    ]
}