{
    "articleURL": "/wires/ap/article-12048249/Kids-social-media-Here-tips-concerned-parents.html",
    "content": [
        "When it comes to social media, families are seeking help.",
        "With ever-changing algorithms pushing content at children, parents are seeing their kids' mental health suffer, even as platforms like TikTok and Instagram provide connections with friends. Some are questioning whether kids should be on social media at all, and if so, starting at what age.Lawmakers have taken notice. A bipartisan group of senators recently introduced legislation aiming to prohibit all children under the age of 13 from using social media. It would also require permission from a guardian for users under 18 to create an account. It is one of several proposals in Congress seeking to make the internet safer for children and teens.Meanwhile, on Wednesday the Federal Trade Commission said Facebook misled parents and failed to protect the privacy of children using its Messenger Kids app, including misrepresenting the access it provided to app developers to private user data. Now, the FTC is proposing sweeping changes to a privacy order it has with Facebook's parent company Meta that would include prohibiting it from making money from data it collects on children.But making laws and regulating companies takes time. What are parents - and teens - supposed to do in the meantime? Here are some tips on staying safe, communicating and setting limits on social media - for kids as well as their parents.",
        "IS 17 THE NEW 13?",
        "There's already, technically, a rule that prohibits kids under 13 from using platforms that advertise to them without parental consent: The Children´s Online Privacy Protection Act that went into effect in 2000 - before today´s teenagers were even born.The goal was to protect kids´ online privacy by requiring websites and online services to disclose clear privacy policies and get parents´ consent before gathering personal information on their kids, among other things. To comply, social media companies have generally banned kids under 13 from signing up for their services, although it´s been widely documented that kids sign up anyway, either with or without their parents´ permission.But times have changed, and online privacy is no longer the only concern when it comes to kids being online. There´s bullying, harassment, the risk of developing eating disorders, suicidal thoughts or worse.For years, there has been a push among parents, educators and tech experts to wait to give children phones - and access to social media - until they are older, such as the \"Wait Until 8th\" pledge that has parents sign a pledge not to give their kids a smartphone until the 8th grade, or about age 13 or 14. But neither social media companies nor the government have done anything concrete to increase the age limit.",
        "IF THE LAW WON'T BAN KIDS, SHOULD PARENTS?\"There is not necessarily a magical age,\" said Christine Elgersma, a social media expert at the nonprofit Common Sense Media. But, she added, \"13 is probably not the best age for kids to get on social media.\"The laws currently being proposed include blanket bans on the under-13 set when it comes to social media. The problem? There's no easy way to verify a person´s age when they sign up for apps and online services. And the apps popular with teens today were created for adults first. Companies have added some safeguards over the years, Elgersma noted, but these are piecemeal changes, not fundamental rethinks of the services.\"Developers need to start building apps with kids in mind,\" she said.Some tech executives, celebrities such as Jennifer Garner and parents from all walks of life have resorted to banning their kids from social media altogether. While the decision is a personal one that depends on each child and parent, some experts say this could lead to isolating kids, who could be left out of activities and discussions with friends that take place on social media or chat services.Another hurdle - kids who have never been on social media may find themselves ill-equipped to navigate the platforms when they are suddenly allowed free rein the day they turn 18.",
        "TALK, TALK, TALKStart early, earlier than you think. Elgersma suggests that parents go through their own social media feeds with their children before they are old enough to be online and have open discussions on what they see. How would your child handle a situation where a friend of a friend asks them to send a photo? Or if they see an article that makes them so angry they just want to share it right away?For older kids, approach them with curiosity and interest.\"If teens are giving you the grunts or the single word answers, sometimes asking about what their friends are doing or just not asking direct questions like, `What are you doing on Instagram?´ but rather, `Hey, I heard this influencer is really popular,´\" she suggested. \"And even if your kid rolled their eyes it could be a window.\"Don´t say things like \"Turn that thing off!\" when your kid has been scrolling for a long time, says Jean Rogers, the director of the nonprofit Fairplay´s Screen Time Action Network.\"That´s not respectful,\" Rogers said. \"It doesn´t respect that they have a whole life and a whole world in that device.\"Instead, Rogers suggests asking them questions about what they do on their phone, and see what your child is willing to share.",
        "Kids are also likely to respond to parents and educators \"pulling back the curtains\" on social media and the sometimes insidious tools companies use to keep people online and engaged, Elgersma said. Watch a documentary like \"The Social Dilemma\" that explores algorithms, dark patterns and dopamine feedback cycles of social media. Or read up with them how Facebook and TikTok make money.\"Kids love to be in the know about these things, and it will give them a sense of power,\" she said.SETTING LIMITSRogers says most parents have success with taking their kids´ phones overnight to limit their scrolling. Occasionally kids might try to sneak the phone back, but it´s a strategy that tends to work because kids need a break from the screen.\"They need to an excuse with their peers to not be on their phone at night,\" Rogers said. \"They can blame their parents.\"Parents may need their own limits on phone use. Rogers said it´s helpful to explain what you are doing when you do have a phone in hand around your child so they understand you are not aimlessly scrolling through sites like Instagram. Tell your child that you´re checking work email, looking up a recipe for dinner or paying a bill so they understand you´re not on there just for fun. Then tell them when you plan to put the phone down.",
        "YOU CAN´T DO IT ALONEParents should also realize that it´s not a fair fight. Social media apps like Instagram are designed to be addictive, says Roxana Marachi, a professor of education at San Jose State University who studies data harms. Without new laws that regulate how tech companies use our data and algorithms to push users toward harmful content, there is only so much parents can do, Marachi said.\"The companies are not interested in children´s well-being, they´re interested in eyes on the screen and maximizing the number of clicks,\" Marachi said."
    ]
}