{
    "articleURL": "/sport/afl/article-12044763/How-Carlton-Blues-AFL-star-Sam-Docherty-inspired-four-year-old-fan-suffering-cancer.html",
    "content": [
        "Docherty 'inspires' young fan Blues star has also beaten cancer Ran out with side against Eagles Carlton star Sam Docherty has developed a heartwarming bond with a young cancer survivor for one very special reason: he's battled it and won, as well.",
        "As the 29-year-old prepares to play in his 150th AFL game, the attributes that make him so universally loved and respected across the entire footy world were evident during the club's trip to Perth to take on the Eagles.Docherty reunited with young Blues fan Noah, 4, who is currently battling leukemia prior to the club's 108-point demolition over West Coast on Saturday, with the All Australian defender the youngster's 'inspiration'. That's primarily because Docherty has beaten testicular cancer twice, had a benign tumour removed this offseason and survived a reoccurrence when the cancer spread to his lymph nodes, lungs and stomach.Throughout his battle, the Blues defender has retained his zest for life and passion for making a difference for young kids going through their own battle with the killer disease. ",
        "Docherty bonded with Noah when he ran out with the team in the game against West Coast last year; though unfortunately the youngster couldn't stay and watch the whole game as he was still undergoing chemotherapy.This time he was able to run through the banner with his beloved side alongside older brother Cruz, and stay and watch the side crush the Eagles in a stunning rout.Noah's mother Prue Willis-George explained why Noah is so 'inspired' by his friendship with Docherty and enamoured with Carlton - and it all started with a teddy bear. ",
        "'You've (Docherty been an inspiration to Noah, a big inspiration, and just been everything that he's thought of when he's been at his chemo (chemotherapy appointments),' she said in a heartwarming video post on Carlton's social media.'He just loves watching Carlton, loves watching you run around and you really inspire all of us.'He wasn't really that into football but we happened to be at my parent's house a little bit after he had started his treatment, and he found a little Carlton teddy that was exceptionally old - it was my dad's, he was born in Carlton so he's a massive Carlton fan.'From then on he just started watching football and watching Carlton and we kind of explained to him that there was another player that had actually dealt with cancer as well and he decided that that was going to be Sam his teddy.'He fell in love with football after that and it's really actually helped give him something to watch and something to do when he couldn't really do much over the last year and a bit.'",
        "Docherty said one of his favourite parts about the trip across the Nullarbor from Melbourne is the chance to see Noah again and do whatever he can to put a smile on his face. ",
        "'One piece of coming to Perth that I really enjoy is I get to spend some time and see him (Noah),' he said.'He's looking really healthy, which is awesome.'I know he's on some meds at the moment, which are helping his energy and he was going absolutely nuts at training yesterday; it's awesome to see.'One of the great things about footy is you get to see the smiles you put on people's faces, and I'm fortunate in the position I'm in that I get to inspire people going through some pretty tough times, and he's definitely one that I keep a close check on.'These are some of the cool moments you get in footy, and you probably start to appreciate them a bit more as you get a bit older.'",
        "Willis-George said her it was incredible to see the power of football, and what it can do to a kid who has been through some very rough times during his battle with cancer.She was full of praise for Docherty, captain Patrick Cripps and the entire club for supporting not only Noah, but brother Cruz, and putting a smile on their faces. 'For me, it's seeing him ecstatically happy; he's a happy boy and he's maintained that throughout his treatment but I've seen him in some really bad positions in hospital and seeing him have experiences like this ... that's what he remembers and to me it's heartwarming that he's not remembering all those really bad times,' Willis-George said.",
        "'His older brother Cruz has been by his side each time, something their mum is really grateful for.'To be invited back again this year, it's a dream and for them to have involved Cruz as well, is amazing because you know, he's been the best big brother, the best support that Noah could have, and he's made life a lot easier for me and for my husband as well.'We're coming out the other side soon ... it's been a bit of a whirlwind.'",
        "Many fans were touched by the heartwarming story, with one joking: 'Who's cutting onions in here?''Just a beautiful man our 'Doc' (Docherty),' one Bluebagger wrote, with another concurring: 'Sam Docherty is one of the most beautiful humans you could ever meet.''Noah should permanently run out with the Blues every year. Inspiring young man,' one fan wrote of the young cancer survivor.Willis-George herself shared the video, saying 'these moments will last a lifetime for our boys'. The down-to-earth Docherty is clearly passionate about working with kids in hospital, knowing all too acutely how tough it can be. ",
        "He appeared alongside Carlton teammates and fellow cancer survivor Ben Cunnington, a Kangaroos veteran, at the Royal Children's Hospital in Melbourne over Easter and said it just hit different now he is a father.",
        "'I find going to the Royal Children's one of the tougher ones to do, more from your own personal bias … Now having a child myself puts an extra layer on it,' he said at the time. 'Essentially you're bringing a smile onto their child's face, but a living memory that they get to take back home and wherever that brings great joy to their whole family.'Docherty will run out for his 150th AFL game this Friday night when the Blues take on the in-form Lions. "
    ]
}