{
    "articleURL": "/wires/reuters/article-12045749/High-rates-pose-risk-Hungarian-economy-says-minister.html",
    "content": [
        "BUDAPEST, May 4 (Reuters) - High borrowing costs threaten the Hungarian economy and risk a credit crunch, the economic development minister said on Thursday, adding that inflation needed to fall so that interest rates can come down.",
        "At 13%, Hungary has the European Union's highest base interest rate and the central bank has previously faced pressure from Prime Minister Viktor Orban's government to cut the cost of credit because of the impact it is having on a fragile economy.In April, the National Bank of Hungary slashed the top of its interest rate corridor by 450 basis points to 20.5%, paving the way for further rate cuts.\"Interest rates are high. The benchmark interest rate could average around 16% in 2023 based on market expectations,\" Marton Nagy told a banking conference.\"Although there will certainly be additional rate easing in 2024... interest rates will still be high, especially in government debt financing.\"Nagy said that government debt financing costs would jump to around 4% of gross domestic product (GDP) by 2024 from 2.8% of GDP in 2022, an increase of some 1 trillion forints ($2.95 billion) over two years.He said plugging the expected losses of the central bank due to high interest rates could impose an additional burden on the budget.According to Nagy, the way to escape from the \"trap\" of high interest rates is to \"wrestle down\" inflation.\"On this issue, central bank and government policies are fully aligned. We need to reach single-digit inflation by the end of the year,\" he said.",
        "\"But even with single-digit inflation at the end of the year, markets expect borrowing costs to remain in double digits. There is no life in the lending market at double-digit borrowing costs... The risk of a credit crunch is definitely rising.\"($1 = 338.41 forints) (Reporting by Gergely Szakacs, writing by Alan Charlish; Editing by Sharon Singleton)"
    ]
}