{
    "articleURL": "/tvshowbiz/article-12051611/Matt-Healys-father-Tim-breaks-silence-sons-romance-Taylor-Swift.html",
    "content": [
        "Matt Healy's father broke his silence amid his son's rumoured romance with Taylor Swift on Thursday as he hit back at a troll.",
        "According to The Sun, the Benidorm actor, 71, took to Twitter to reply to someone who reacted to the prospect of the Love Story singer's in-laws being Denise Welch and Tim Healy.The now deleted tweet read: 'The thought of Denise Welch and Tim Healy being in-laws to Taylor Swift is very, very funny.'His response to the troll was a very simple, one word: 'Why?' according to the Sun.Matt's mother Denise, 64, is a Loose Women panellist who used to be married to Tim. ",
        "It comes after it was revealed that Taylor and Matty are reportedly set to go public with their romance with an on-stage appearance this weekend. The pop star and the 1975 frontman's relationship was revealed this week, soon after her split from boyfriend of six years Joe Alwin was announced.However, the smitten pair are said to be excited to 'go public with their love', with Matty, 34, allegedly set to join Taylor, 33, on-stage as a special guest during her show in Nashville amid her Eras tour.According to The Sun, Matty will perform two of Taylor's tracks, following in her footsteps when she sang two 1975 numbers at their London gig in February.A source told the publication: 'Taylor and Matty have been planning their 'coming out' for a few weeks now, and are really excited just to go public with their love.",
        "'Neither of them want any secrets, or to hide away. The plan is for Matty to walk out on stage mid-show and play two songs.'They will chat to the audience and, at present, the idea is for them to confirm their romance with some kind of PDA — public display of affection. It won't be anything remotely cheesy though.'MailOnline contacted representatives of Taylor and Matty for comment at the time.   ",
        "It comes as Matty reportedly split from model Meredith Mickelson just weeks before he started dating Taylor.The singer was said to have been romancing the model, 23, who has built up a large following on social media, before they parted ways in Febuary.A source told The Sun: 'Matty was seeing Meredith while he was in LA in February - but things fizzled out when he went to New York at the end of the month,' says an insider.'They're still on good terms but haven't been romantically involved since then.'Meredith boasts over 3million followers on Instagram and is said to be based primarily between Los Angeles and Paris.",
        "MailOnline has contacted representatives of Meredith Mickelson for comment. It comes after Matty and Taylor's reported new romance was revealed on Wednesday- just weeks after her split from actor Joe Alwyn. The singer is said to be 'madly in love' with Matty after their long-term friendship blossomed into romance. ",
        "The duo - who first met in 2014 - are now gearing up to go public with their romance during her concert in Nashville, Tennessee on Friday, reports The Sun.News of the new romance comes just weeks after it emerged that Taylor split from her boyfriend of six years Joe, 32, after the pair 'struggled' with their 'career differences'. Yet despite the short turnaround, Taylor is said to be 'madly in love' with Matt - who is the son of Loose Women star Denise Welch and Benidorm actor, Tim Healy. The rumoured romance with Matt is the latest in a string of British boyfriends for Taylor, who - as well as her last relationship with Joe - has dated Harry Styles, Calvin Harris, and Tom Hiddleston. An insider told the publication: 'She and Matty are madly in love. ",
        "'It's super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn't work out.'The source went on to insist that there was no crossover in Taylor's love life, despite news of her split from Joe emerging last month, insisting that the pair actually broke up in February. Taylor is currently in the middle of the US leg of her The Eras Tour while The 1975 are on their At Their Very Best concert tour, but the source insisted they have kept in constant communication by texting and Face Timing.",
        "The source added: 'As two international megastars, they understand the pressures of one another's jobs better than anyone, and are incredibly supportive of their respective careers.'They are both massively proud and excited about this relationship and, unlike Taylor's last one — which was very much kept out of the spotlight, deliberately — she wants to 'own' this romance, and not hide it away.'Taylor just wants to live her life, and be happy. She's told pals Matty is flying to Nashville over the weekend to support her on the next leg of her tour.'DailyMail.com contacted representatives for Taylor for comment.Back in 2015, Matt denied romance rumours with Taylor but confirmed they had been texting each other frequently. ",
        "After rumours began circling he confirmed on Australian radio: 'It's fake. It's all bloody fake. It's a farce!'Yeah, we met each other, we exchanged numbers in the same way that a lot of people in this kind of world do and we spoke occasionally.'And she's the biggest pop star in the world and I'm in Australia. There's no like, relationship or anything happening. It's just funny how people really, really buy into that.' "
    ]
}