{
    "articleURL": "/travel/article-12041001/The-gritty-French-city-Marseille-spruced-culinary-hotspot.html",
    "content": [
        "Mal Rogers reveals how he has watched the French city 'change and grow'Cafe Prinder is 'one of the most venerable establishments in Marseille', he saysREAD MORE: Beauty in the east - photos that show how stunning Bulgaria can beKeen to improve France’s image abroad in former times, local tourism authorities persuaded members of the travel industry in every arrondissement to sign a hospitality contract.",
        "This included an undertaking to adopt a friendlier approach to visitors, with ‘bonjour’ and ‘bienvenu’ signs displayed about hotels and restaurants.It had mixed success. The welcoming sign tended to be used as a substitute for bonhomie. When a visitor appeared, the maître d’ or receptionist would retain their air of studied insouciance, merely jerking a thumb in the general direction of the sign.But I like that attitude. And I like the French all the more for it. And it is Marseille writ large.Of course, this kind of outlook does put you on your guard. On my last visit I was queuing at one of the cabanes at L’Estaque, the next beach up from the Old Port, where stalls serve street food such as chichi frégi — a type of fried dough, a bit like churros but lighter.",
        "Dusted with sugar and accompanied by black coffee, it’s the perfect snack. I paid, and departed the stall, when there was an almighty roar from the lady behind the counter. What had I done? And would I be able to get out of what promised to be an uncomfortable confrontation. Maybe I had unintentionally insulted French culture.I turned to see the woman looking at me and giving the universal bonkers sign — a forefinger tapping her head.",
        "I approached; she looked stern. Then with a huge smile she handed me six euros. My bill had come to four, but I’d given her ten and not five, as I had thought. My chichis frégi tasted even sweeter.You might tend to think of Marseille in terms of The French Connection or The Count Of Monte Cristo. But maybe not as a holiday resort.",
        "Yet I’ve spent time there over the decades, and watched this city change and grow into an exciting and welcoming destination.With a history no more chequered than you might expect from any port earning its living sandwiched between Europe and North Africa for 26 centuries, Marseille is a place where life is lived large.For more information on the backstory, step into the Museum of European and Mediterranean Civilisations. This new centre takes in every local nook and cranny of Western culture.For perhaps a more exciting evocation, Marseille has a slew of festivals over the summer. My own personal choice runs July 8-25.The Marseille Jazz Festival will feature augmented minor chords from five continents. The Festival de Marseille takes place from June 17 to July 9 with dance, theatre and music along with plenty of Ooh La La, if my memory serves me correctly.",
        "But you can just as easily be a flâneur as a festival-goer.The old medieval quarter, Le Panier has effortlessly segued into something less hard-edged. Regeneration has seen the winding streets become home to quirky boutiques and bistros — and cats sleeping in the sun.Marseille’s main drag La Canebière is one of the most famous streets in maritime history. Lying at the heart of the city, the name alludes to the hemp grown here and spun into rope in the Middle Ages. At least that’s their story.A five-minute stroll from La Canebière to the Noailles quartier will take you to Café Prinder on Rue du Marché des Capucins. One of the most venerable establishments in Marseille, it has been run by the same Italian family since 1925.Sip coffee or mint tea on the terrace overlooking the Capucins market square and watch the baroque pantomime of Marseille life.",
        "Hôtel La Résidence du Vieux-Port has double rooms from £160 (hotel-residence-marseille.com). London Stansted to Marseille with Ryanair from £40 (ryanair.com). For more information, go to marseille-tourisme.com.",
        "To the north is the ramshackle Quartier Belsunce — an exuberant area of street food, stalls and shops, with everything you could conceivably want to buy — bling, leather goods etc — and much you wouldn’t.",
        "Meanwhile, on the Quai des Belges, the fishing boats disgorge their catches, as they have done for centuries.Fishwives holler out their wares, soon to be grilled, fried, braised, baked and transformed into one of the many legendary Marseillaise dishes that are available in the cafes that jostle round the old port — including bouillabaisse.Combining Gallic cool, Mediterranean panache and North African exuberance, the Marseillaise are an attractive bunch — generous, gregarious and shouty.But by and large anywhere I’ve wandered I’ve pretty much been treated the same as a local. And a traveller can ask for little more than that."
    ]
}