{
    "articleURL": "/wires/reuters/article-12041549/Former-Audi-boss-set-confession-diesel-emissions-scandal.html",
    "content": [
        "By Jörn Poltz",
        "MUNICH, May 3 (Reuters) - Former Audi boss Rupert Stadler is ready to make a confession about his role in the diesel emissions scandal in exchange for a suspended sentence and a payment of 1.1 million euros ($1.21 million), he and his defence team said on Wednesday.The former CEO has been on trial for fraud since 2020 over his role in the scandal after parent group Volkswagen and Audi admitted in 2015 to having used illegal software to cheat on emissions tests. Stadler had previously rejected the allegations.Stadler's defence team said a statement would be made on May 16, after which the judge will decide whether it amounts to a complete confession and deliver a verdict in June. It was not immediately clear whether Stadler would deliver the statement personally or through his lawyers.Prosecutors also agreed to the deal. A judge had said the 60-year-old Stadler faced a prison sentence of 1.5-2 years, which would be suspended if Stadler agreed to make a confession.The trial is one of the most prominent court proceedings in the aftermath of the diesel scandal at Volkswagen and its subsidiary Audi. Revelations that millions of emissions tests had been manipulated emerged in September 2015.According to prosecutors, engineers manipulated engines in such a way that they complied with legal exhaust emission values on the test bench but not on the road. Stadler was accused of failing to stop the sale of the manipulated cars after the scandal became known.",
        "Stadler has been on trial along with former Audi executive Wolfgang Hatz and an engineer. Hatz and the engineer confessed to having manipulated engines.Audi declined to comment, saying it was not party to the trial.Wednesday's deal follows haggling between Stadler's defence team, the prosecutors and the court, especially over how much money Stadler would pay in exchange for a suspended sentence.Prosecutors wanted 2 million euros, citing Stadler's salaries at Audi and Volkswagen and his financial and real estate assets. Stadler's team had initially argued that 1.1 million euros was too high, as he had no current income and faced hefty legal costs.($1 = 0.9063 euros) (Reporting by Jörn Poltz; additional reporting by Christina Amann; writing by Matthias Williams; editing by Friederike Heine, Christina Fincher and Bernadette Baum)"
    ]
}