{
    "articleURL": "/wires/pa/article-12056779/Dean-Holden-wants-fitter-Charlton-mount-promotion-push-season.html",
    "content": [
        "Dean Holden says Charlton must mount a League One promotion push next season after they signed off this term with a 2-2 draw at Cheltenham.",
        "Alfie May’s late strike during an entertaining season finale denied Holden a winning end and he has demanded a big improvement in 2023/24.“I don’t know how we threw that game,” Holden said. “It’s a game we should’ve won comfortably, but we conceded a cheap goal at the end.“Having said that, we had 10 academy players on the pitch today which is encouraging.“We have to be pushing at the top end of the table next season given the size of this club and we have to be fitter.“We had gilt-edged chances right throughout the game and so how we didn’t win it I don’t know.",
        "“We finished 10th in the league and so it’s been a decent second half of the season, but collectively we’ve not been good enough.“The players have to go away in the summer and use it wisely and come back fitter than they’ve ever been.”The Addicks led through Scott Fraser’s first-half strike, but Aidan Keena levelled for the Robins early in the second period.Substitute Jack Payne struck with seven minutes left to restore Charlton’s advantage, but May’s 20th League One goal of the season sealed a point for the Robins.Cheltenham boss Wade Elliott was happy after overseeing the club’s second highest-ever placing of 16th in the EFL.",
        "“It was a good game, with two teams wanting to win it and I thought we were really good,” he said.“I thought we deserved to win it. It’s really pleasing to see the connection between the players and fans at the end.“The fans can see they have a really genuine, honest group. It’s been good, so make the most of it.“We’ll enjoy the summer, take stock and we know it’ll be tough against next season. We can’t get blase about being at this level.”"
    ]
}