{
    "articleURL": "/wires/ap/article-12053393/Tuckers-2-run-homer-9th-lifts-Astros-Mariners-6-4.html",
    "content": [
        "SEATTLE (AP) - Until the Houston Astros get all their hitters back to full health, they'll continue needing big swings from Kyle Tucker and Yordan Alvarez.",
        "Tucker hit a two-run homer in the ninth inning off reliever Matt Brash, and Houston beat the Seattle Mariners 6-4 on Friday night in the first meeting between the AL West foes this year.Tucker and Alvarez provided all the offensive punch for the Astros. Alvarez continued to torment Seattle pitching with a three-run homer off Luis Castillo in the third.And it was Tucker capping a three-hit game with his sixth homer of the season in the ninth.\"He was swinging great all night. Hopefully he's about to get hot again,\" Astros manager Dusty Baker said.Brash (3-3) didn´t get the call on a borderline 2-2 pitch from plate umpire Shane Livensparger that froze Tucker, and missed his spot on the 3-2 pitch.",
        "Seattle manager Scott Servais argued the non-strike call later in the inning during a pitching change and was ejected by Livensparger.It was the first homer allowed by Brash since moving into a relief role early last season. He had gone 52 games without giving up a home run.\"Probably should not have happened. I thought he had Tucker struck out, made a really good pitch on him. Unfortunately did not get the call and they put a big swing on us after that,\" Servais said.Tucker also scored on an attempted double steal in the fourth with one out and runners at the corners. Jeremy Peña was thrown out at second base, but the throw allowed Tucker to sprint home from third.",
        "For a while that appeared to be the deciding run. But Seattle´s Kolten Wong lined a three-run double in the fifth off Houston starter Cristian Javier, and the Mariners pulled even in the eighth thanks to three consecutive two-out singles.Singles by Ty France and Jarred Kelenic put runners at the corners with two outs against reliever Bryan Abreu. Eugenio Suárez, who nearly homered earlier in the game, dribbled a single into right field to score France with the tying run.Abreu (1-0) still got the victory despite giving up the lead, and Ryan Pressly pitched the ninth for his fourth save.\"Them being in the division, we've had some good games going back and forth,\" Tucker said.It was a strong night of pitching for both starters, who each had just one hiccup.Javier threw a season-high seven innings and was helped by the chilly 51-degree conditions with long fly balls by Suárez and Julio Rodríguez becoming outs rather than home runs as they likely would have with warmer conditions. Javier struck out eight and allowed three hits.But he stumbled in the fifth and Wong continued to show signs of rebounding from his slow start. Wong lined a shot to right-center that cleared the bases, giving him five RBIs in the past two games after driving in just three runs in his first 22.",
        "Castillo was nearly Javier´s equal outside of Alvarez´s big blow. Castillo allowed five hits, four earned runs and struck out five. But it was his only walk that became problematic.Castillo was ahead of Alex Bregman 1-2 with two outs in the fourth, but ended up walking him on a 3-2 pitch. Two pitches later, Alvarez homered on a changeup left in the middle of the plate.\"The first changeup I did it perfect, right where I wanted to put it. The second one I wanted to put it in the same place, but unfortunately I put it where he could hit it,\" Castillo said through an interpreter.HELLO AGAINIt was the first meeting between the teams since last October when the Astros swept the Mariners in the ALDS, capped by Houston´s 18-inning, 1-0 win in Game 3.TRAINER´S ROOMHouston announced RHP Luis García needs Tommy John surgery and will miss the rest of the season. García landed on the injured list earlier this week.UP NEXTAstros: RHP J.P. France will make his major league debut Saturday. France was 2-1 with a 2.33 ERA in five games with three starts for Triple-A Sugar Land this season.Mariners: LHP Marco Gonzales (2-0, 4.74 ERA) looks to rebound after lasting just three innings and giving up five earned runs in his last start against Toronto.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}