{
    "articleURL": "/wires/ap/article-12049513/Oregon-GOP-boycott-bills-high-reading-score.html",
    "content": [
        "Oregon Republicans blocking bills about abortion, gun control and gender-affirming health care in the Statehouse say they are simply following a decades-old law requiring that bill summaries be easy to read.",
        "The 1979 state law requires a score of at least 60 on something called the Flesch readability test. That´s the equivalent of an eighth- or ninth-grade reading level. Dr. Rudolf Flesch, a Vienna-born psychologist, developed the test in the 1940s.Scores range from 1 to 100, with 100 being the easiest to read and 1 being the most difficult.But most bills have a college-level reading score, regardless of political party affiliation.Here is a sampling of summaries from some recent Oregon bills and their Flesch readability scores:CONTESTED BILLS:",
        "House Bill 2005 What it´s about: A gun control measure banning untraceable guns, raising minimum age to buy firearms like semiautomatic weapons from 18 to 21 and allowing local agencies to prohibit firearms on government property. Flesch Reading Score: 24 Reading level: College graduate Support: Democrat.House Bill 2002 What it´s about: Modifying protections for reproductive health rights, relating to gender-affirming treatment. Flesch Reading Score: 14.2 Reading level: College graduate Support: Democrat.___BIPARTISAN HOUSING BILLS:House Bill 5019 What it´s about: Appropriating money to state agencies for certain purposes related to housing. Flesch Reading Score: 17 Reading level: College graduate Support: BipartisanHouse Bill 2001 What it´s about: An array of housing policies and protections. Flesch Reading Score: 12.3 Reading level: College graduate Support: Bipartisan",
        "___GOVERNOR-SIGNED BILLS:Senate Bill 427 What it´s about: Clarifying access to funds in Early Learning Account. Flesch Reading Score: 14.4 Reading level: College graduate Support: DemocratSenate Bill 577 What it´s about: Modifying when use of force on a minor child or student is justifiable. Flesch Reading Score: 10.7 Reading level: College graduate Support: Democrat"
    ]
}