{
    "articleURL": "/wires/reuters/article-12049611/Astros-Mariners-meet-time-22-ALDS.html",
    "content": [
        "The Astros and Mariners find themselves in similar circumstances as they enter their first meeting of the season Friday night when Houston visits Seattle for a three-game set at T-Mobile Park.",
        "Both teams are hovering around .500 -- the Astros are a game above and the Mariners a game below entering the game -- and chasing Texas and the Los Angeles Angels in the American League West.The Astros and Mariners, who met in an AL Division Series last fall, have had health concerns among their starting pitching rotations and offenses struggling to score runs.Houston starters Jose Urquidy (shoulder) and Luis Garcia (elbow) were placed on the injured list on consecutive days earlier this week, while Seattle's Robbie Ray underwent Tommy John surgery after making just one start this season.Despite the injuries, the Astros have the second-best ERA in the major leagues at 3.20, while the Mariners are fourth at 3.44.Instead, it's the offenses that have been lacking. The Astros have scored 137 runs and the Mariners have 134, well below Tampa Bay's MLB-leading 210.The Astros were shut out Tuesday at home by San Francisco and didn't score Wednesday until Alex Bregman's two-run homer in the eighth inning of a 4-2 loss.\"It felt good to square the ball up, but overall we're not doing enough offensively right now,\" Bregman said. \"We need to do a better job of swinging at better pitches and damaging pitches over the middle of the plate. I think we'll all get together here before the game on Friday and kind of go through things and see where we can improve. I know how good of an offense we have here and look forward to showing it.\"",
        "The Mariners have won four consecutive games and their offense has produced 12 runs over the past two, but any progress is hard to gauge because they were playing the lowly Oakland A's.Outfielder Taylor Trammell, activated last weekend after missing the first month of the season with a broken bone in his right hand, hit a two-run homer and drew a bases-loaded walk in Thursday afternoon's 5-3 victory in Oakland.\"Just keep the baton moving,\" Trammell said, referring to one of Mariners manager Scott Servais' favorite phrases.Trammell said the Mariners are looking forward to facing the defending World Series champions, who swept Seattle in three games in the ALDS despite the games being decided by a total of four runs. That included an 18-inning thriller on Oct. 15 in the first playoff game held in Seattle since 2001. The Astros won 1-0 on Jeremy Pena's solo homer.\"It's going to be a nice test for us,\" Trammell said of the upcoming series. \"Obviously, we know about Houston. They're a well-rounded team. We're going to come out, do our thing, compete each and every day that we're out there and hopefully get some wins.\"Friday's series opener is scheduled to be a showdown between right-handers Cristian Javier (2-1, 3.48 ERA) of Houston and Seattle's Luis Castillo (2-0, 1.82). Javier is 3-1 with a 2.08 ERA in seven career appearances against the M's, including four starts; Castillo is 1-0 with a 3.00 ERA in one previous start against the Astros -- in 2019 while Castillo was with Cincinnati.",
        "--Field Level Media"
    ]
}