{
    "articleURL": "/wires/pa/article-12056917/Jonathan-Milan-wins-stage-two-Giro-British-duo-affected-late-crash.html",
    "content": [
        "Jonathan Milan won stage two of the Giro d’Italia in a reduced sprint after a late crash ruled out Mark Cavendish and cost Tao Geoghegan Hart valuable time in the general classification.",
        "This flat stage would have been one of the ones circled by Cavendish as he seeks his first win for Astana-Qazaqstan, but the Manxman hit the deck in the aftermath of a collision just under four kilometres from the line that left several riders counting the cost.Chief among them was 2020 Giro winner Geoghegan Hart, with the Londoner held up to concede 19 seconds and fall from fourth to eighth overall, now 59 seconds behind leader Remco Evenepoel.Amid the chaos, the 22-year-old Milan came around Kaden Groves to win comfortably from David Dekker on the seafront in San Salvo, taking his first Grand Tour stage win and doing it in his home race at the first attempt.Evenepoel stayed safe in the pink jersey and retains his 22-second lead over Filippo Ganna at the end of the 202km stage from Teramo. Joao Almeida remains third at 29 seconds down, but Geoghegan Hart is now four seconds behind Ineos Grenadiers team-mate Geraint Thomas, who managed to avoid the trouble.So much focus had been on a tight roundabout just before the final straight, but before that even came into view several riders went down on a narrow section of road.",
        "Pushing and shoving between the rival sprint trains had a domino effect as riders spilled out to the right-hand side of the road with inevitable results.",
        "Cavendish was behind the initial incident but was then struck from behind as riders struggled to slow, although his team was quick to say he was unhurt.In his podium interview, Evenepoel was pointed in his remarks on the stage-defining incident.“We were in front so we were out of trouble, but of course it was a pretty nasty crash,” the Soudal-QuickStep rider said. “I think I actually saw it happen and we know who we can blame for the crash but that’s racing. It wasn’t a nice move but luckily we stayed out of trouble and arrived safely.”While the recriminations began, Bahrain-Victorious rider Milan celebrated a breakthrough moment.“I am without words,” the Italian said. “I cannot believe it. My first Giro, the second stage. Yesterday I did a nice time trial, I was quite happy with my result and I was pushing good but I could never imagine that today a victory was coming.”Although Cavendish was out of the running, there was one Brit in the top 10 as Jake Stewart sprinted to ninth for Groupama-FDJ.The race continues with a 213km stage from Vasto to Melfi on Monday."
    ]
}