{
    "articleURL": "/wires/aap/article-12058391/Sydney-star-Mak-takes-flight-international-recall.html",
    "content": [
        "Sydney FC winger Robert Mak credits his international call-up for Slovakia as the catalyst for an upturn in form that has helped put the Sky Blues on the cusp of the A-League Men grand final.",
        "The 32-year-old has been in a rich vein of form, scoring five goals in as many games, the most recent of which came in Saturday's 2-1 elimination final win over the Western Sydney Wanderers.Mak's hot streak - his best domestic return in a career which has taken in stints in Germany, Russia, Turkey and Greece - has propelled Sydney into Friday's home semi-final meeting with Melbourne City.And the Slovakian winger says scoring on his return to the national set-up against Bosnia in March has helped him find his groove in clubland.\"Maybe I need to fly more often,\" Mak joked ahead of the first of a two-legged clash with City to decide who plays in the grand final.\"When you score and get called up for your national team you feel confident.\"It's much easier to play on the pitch if you have this confidence.\"Since I came back I have scored almost every game and that has helped me a lot.\"I'm just doing my job. I came here to help Sydney FC win finals and I'm finding form at the right moment.\"Mak said Sydney's come-from-behind win over the Wanderers had given the Sky Blues the belief they can trouble a City outfit who finished the regular season 11 points clear at the top.",
        "Sydney claimed a 2-1 win over City at Allianz Stadium earlier this year and Mak is confident a repeat is on the cards.\"We felt amazing and everyone was happy and feeling good (after the Wanderers game),\" he said.\"These games motivate you and we were so up for it. They thought they'd pass us easily.\"We showed how good and strong we are and that gives us much more confidence.\"I think against Melbourne City it will go the same way and we can beat them.\""
    ]
}