{
    "articleURL": "/news/article-12047231/Female-officer-cadet-21-hanged-sleeping-sergeant-Sandhurst.html",
    "content": [
        "Olivia Perks, 21, was found dead at the military training school February 2019This was just less than a year following a previous suicide attempt in 2018For confidential support call the Samaritans on 116123 or go to samaritans.org A 21-year-old officer cadet, who hanged herself after sleeping with a sergeant at Sandhurst, was interviewed and told to sign a letter saying she risked losing her place if she self-harmed.",
        "Olivia Perks was found dead at the elite military training school in Berkshire on February, 6, 2019.This was just less than a year following a previous suicide attempt at a Royal Engineers visit in July 2018.She was deemed to be at a 'low risk of reoccurrence' and was back in training two days later.Her inquest at Reading Town Hall on Thursday was told the attempts were deemed 'half-hearted' and 'rudimentary'.",
        "On Thursday, the inquest heard the reason for the interview was recorded as 'inappropriate behaviour during the regimental visit, the catalyst being excessive alcohol'.Coroner Bridget Dolan KC said Ms Perks appeared to be being told to sign a letter that makes clear 'deliberate self-harming is inappropriate behaviour'.It said: 'Reoccurrence of inappropriate behaviour could lead to questions about suitability for employment.'Lieutenant Colonel Whitelegge said he accepted 'that's one way you could read it', adding the language used was 'really crass'.He added: 'It doesn't accurately reflect the discussions and the tone.'Ms Perks was told to resolve underlying issues that could have caused her to have 'violent outbursts' that encouraged self-harm, according to Ms Dolan KC.The lawyer added that the letter makes clear 'deliberate self-harming is inappropriate behaviour' and said Ms Perks was being told to 'pack in' such behaviour.",
        "Lieutenant Colonel Whitelegge, who was commander of the academy's Old College, defended the decision to return Ms Perks to training, saying putting her back in the platoon but away from her friends would have been the 'worst of all worlds'.Lieutenant Colonel Jason Buchanan, who was Officer Commanding of the Falklands Company, told the hearing no one had been assigned to accompany Ms Perks to a parade she was supposed to be at on the day she died.An earlier inquest hearing recorded her provisional cause of death as 'asphyxia due to hanging'.The hearing heard that there was one welfare officer for 2,500 people. Despite being rated outstanding three times by Ofsted before the tragedy, the inspectorate had told it to improve the welfare services it offered.",
        "Lieutenant Colonel Rupert Whitelegge told the hearing: 'Sandhurst had its own ways. I am not saying that necessarily as an excuse.'It was very uncomfortable. There was an ambiguity about which policies to follow at the time.'When asked by counsel to the coroner Bridget Dolan KC about Ofsted highlighting a need for better welfare services for officer cadets, he replied: 'Yes, I am more than aware of that.'He went on: 'Sandhurst was given three outstanding ratings. I don't think the welfare support for officer cadets or staff was outstanding. It certainly wasn't to the staff.",
        "'Having one welfare officer for two and a half thousand people is irresponsible. The college had no unit welfare officer.'I had 500 cadets and staff were changing several times a year with no unit welfare officer.'When asked about a lack of welfare training among the chain of command, who often ended up dealing with it, he said it is 'easy to put it on the chain of command'.He added: 'If one doesn't resource welfare, then it doesn't happen.'For confidential support call the Samaritans on 116123 or go to samaritans.org "
    ]
}