{
    "articleURL": "/wires/ap/article-12049333/Police-video-shows-Idaho-killings-suspect-traffic-stop.html",
    "content": [
        "PULLMAN, Wash. (AP) - Newly released body camera video shows the man accused of fatally stabbing four University of Idaho students being pulled over for allegedly running a red light about a month before the killings.",
        "The video shows Washington State University campus police stopping Bryan Kohberger on Oct. 14, 2022, in Pullman, the Idaho Statesman reported Thursday.During the nearly 10-minute video, WSU Police Officer Isobel Luengas parks her vehicle behind Kohberger´s 2015 Hyundai Elantra in a parking lot. Luengas approaches Kohberger as he sits in the car and she says he drove through a red light. She asks for Kohberger´s license, vehicle registration and proof of insurance.Kohberger tells the officer he was stuck in the middle of the intersection.\"I was behind you the whole time,\" she said. \"You´re not supposed to enter the intersection at all for that reason because if the light turns red, then you´re stuck in the intersection.\"Kohberger, then a WSU graduate student living in Pullman, says he is unfamiliar with how to drive through crosswalks because he's from rural Pennsylvania and asks for further explanation.",
        "\"It never even occurred to me that was actually something wrong,\" Kohberger said. \"I´m just curious about the law. I don´t mean to disagree with anything.\"Luengas notes in the video that Kohberger´s registration was current, with an expiration of Nov. 22, 2022. The officer eventually lets him go with a warning.Kohberger, 28, is charged with four counts of first-degree murder and burglary in connection with the stabbing deaths in Moscow, Idaho.",
        "The bodies of Madison Mogen, Kaylee Goncalves, Xana Kernodle and Ethan Chapin were found on Nov. 13, 2022, at a rental home across the street from the University of Idaho campus.The slayings shocked the Idaho community and neighboring Pullman, Washington, where Kohberger was a graduate student studying criminology at Washington State University.Kohberger remains in custody with a court hearing set for late June."
    ]
}