{
    "articleURL": "/sport/football/article-12056703/Alexis-Mac-Allister-NOT-set-join-Liverpool-despite-reports-claiming-talks-ongoing.html",
    "content": [
        "Alexis Mac Allister is reportedly not currently in talks over a move to LiverpoolRecent reports claimed the Reds have contacted Brighton about the ArgentineBut as things stand the two clubs have not discussed a deal for the 24-year-old Brighton have reportedly not received contact from Liverpool regarding signing Alexis Mac Allister.",
        "The World Cup winner has long been linked with a move to Merseyside with speculation having only increased since Liverpool pulled out of the race to sign Jude Bellingham last month.However, despite reports that the 24-year-old has began negotiations for a move to Anfield the Athletic journalist Andy Naylor has stated there has been no contact between the two sides at this stage.'Ignore the noise/reports re: Mac Allister and Liverpool.' Naylor tweeted.'As things stand, there has been no contact between the clubs....and Brighton aren't expecting any'.",
        "While Naylor was quick to deny that a move was currently in progress, he did add in another tweet responding to a fan that Mac Allister may yet depart the Amex this summer.'I haven't said he won't go, Mike. Numerous pieces I've written have flagged the probability that he will.'I've just responded to specific claims that it's reached the stage of talks between Liverpool and Brighton, with a fee agreed.'Mac Allister has played an integral part of Brighton's success in the Premier League this season, with Roberto De Zerbi's side having already set a record number of points earned for the club in the top flight with six games remaining.Despite only having eight senior caps to his name prior to the tournament, Mac Allister proved an invaluable member of Lionel Scaloni's squad during the 2022 World Cup in Qatar.",
        "After not playing in the shock opening-game defeat to Saudi Arabia, Mac Allister would start ever subsequent match for La Albiceleste en route to their victory in Doha. "
    ]
}