{
    "articleURL": "/tvshowbiz/article-12057629/MasterChef-Australia-Tommy-Littles-regret-time-saw-Jock-Zonfrillo.html",
    "content": [
        "Comedian Tommy Little spoke of the 'only regret' he has about his late friend Jock Zonfrillo during The Project's tribute to the late MasterChef judge on Sunday night.",
        "Little, 38, said he felt guilty that his final encounter with Zonfrillo was when he interrupted the chef while he was on a dinner date with his wife Lauren Fried.The Scottish-born restaurateur - who died of natural causes on April 30 - was too polite to tell Little to go away, so the trio ended up having a long conversation during what would have been one of Fried's last-ever dates with her husband.'The only regret I have is the last time I saw him I interrupted his dinner with Lauren and he didn't tell me to go away,' said Little, who knew Zonfrillo well as they were both employees of Channel Ten.'Had I known he would have so few dinners left with the love of his life, I never would have come over. I love you, mate. I miss you.'",
        "Little said he would always remember Zonfrillo's immense kindness and hospitality when it came to helping him prepare a meal. 'He would humour me when I messaged him with questions about the cheese. He offered to have me round his house to show me how to cook things properly,' he said.The Sunday Project paid special tribute to the late Zonfrillo ahead of the premiere of his final season of MasterChef Australia.",
        "Gordon Ramsay, Nigella Lawson and Marco Pierre White were among those sharing their memories during the emotional episode.",
        "Ramsay broke down in tears as he described how Zonfrillo 'lit up the kitchen' and the profound effect his death has had on the cooking world. 'The ripples have been devastating. No one's going to get over this quickly. If there's one thing that we've done as chefs is we've united and we're talking about the good times,' he said, as he chocked back tears. 'S**t. Sorry. It's just so painful. That's all,' he added, taking some time to compose himself. ",
        "Pierre White said in his own tribute that Zonfrillo had qualities 'very few chefs possess' and will live on through MasterChef.'Jock Zonfrillo will never die. He will live on through everyone he touched,' the British chef said.Jamie Oliver, who is a guest judge on MasterChef Australia this season, added: 'Jock's superpower, I think, was his curiosity. He was super curious and fascinated in people, food, travel.'Zonfrillo died on April 30 at the age of 46. He is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.  "
    ]
}