{
    "articleURL": "/femail/article-12058763/The-Duchess-Edinburgh-proves-shes-just-like-rest-Coronation-concert.html",
    "content": [
        "The Duchess of Edinburgh let her hair down at the Coronation concertFans took to Twitter to praise her free-spirited nature as she danced all nightRead More: Duchess of Edinburgh boogies along to Lionel Richie at Windsor The Duchess of Edinburgh proved she is just like the rest of us as she let her hair down at the Coronation concert on Sunday night.",
        "Sophie, 58, was beaming with joy as she boogied along to Lionel Richie as he sang his hit tunes 'All Night Long' and 'Easy Like Sunday Morning' in Windsor.However the mum-of-two proved she was the most relatable royal with her carefree dance moves.Royal fans took to Twitter to praise her free-spirited nature with someone claiming she is 'all of us who couldn't attend the concert but wanted to.'Sophie was spotted in the crowd dancing in her chic coral midi dress which was from one of her favourite labels, Beulah.",
        "Fans flocked online to praise Sophie for being the 'most real' royal and letting her hair down.One person wrote: 'I’m still not over Sophie vibing to All Night Long'Another wrote: 'An appreciation tweet for HRH The Duchess of Edinburgh. Sophie was living her best life tonight, singing &amp; dancing (at times to the discomfort of James, but I always say what the point of having teenagers if you can’t embarrass them) Go Soph. Love it.Someone else said: 'I’m sorry but I have just become a Sophie fan boy lol It’s like she’s in a music video with the the wind machine blow her hair looking all glamorous.'Another said: 'She’s gorgeous. Representing beauty and rhythm for older women all over the world' ",
        "While another said: ' I have never wanted to party with a Royal more than I do after watch the way Sophie #DuchessofEdinburgh danced tonight! Sophie has moves.'",
        "Take That, Katy Perry, and others will be taking to the stage in Windsor last night for a musical extravaganza following the King's Coronation on Saturday.The King, Queen and royal family joined around 20,000 members of the public at the musical extravaganza.Heir to the throne William took to the stage to deliver a speech during the event with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.Earlier in the day, Sophie, and her husband Duke of Edinburgh, 59, attended a Big Lunch event in Cranleigh, Surrey.Their visit came after the Duke and Duchess made a regal appearance at the Coronation of King Charles III and Queen Camilla.",
        "They were joined at Westminster Abbey by their two children, Lady Louise and James, Earl of Wessex.Sophie donned a regal white Suzannah couture floor-length embroidered gown with a Jane Taylor headpiece and Royal Victorian Order Mantle, while her husband wore morning dress with a Garter Mantle over a black smart suit.Meanwhile, Lady Louise, 19, who is a university student at St Andrew's, stole the show in a flowing white and blue floral gown and a chic headpiece.",
        "James, Earl of Wessex, 15, who rarely makes public appearances, also looked smart in a black suit which he paired with a white shirt and a burgundy tie.It comes after Buckingham Palace said the King and Queen were 'deeply touched' by the nation's celebration of their coronation.",
        "More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September.After the ceremony, the family appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering supporters.Lady Louise and James stood beside their royal parents as they waved to crowds before a RAF flypast, which had to be scaled back to just helicopters and the Red Arrows because of the heavy rain in London.Over the last two years, Lady Louise has taken on an increasingly public role as her parents Prince Edward and Sophie have been bumped up the royal food chain following the disgrace of Prince Andrew and the departure of the Duke and Duchess of Sussex.She was front and centre in the Platinum Jubilee celebrations, joined her parents at the Commonwealth Games and made her successful TV debut in a documentary about her beloved grandfather the Duke of Edinburgh.",
        "Meanwhile, yesterday Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said."
    ]
}