{
    "articleURL": "/tvshowbiz/article-12043635/Mark-Wahlberg-51-weighs-Hollywoods-Ozempic-craze-sharing-insane-daily-schedule.html",
    "content": [
        "Mark Wahlberg - who is a fitness fanatic - has weighed in on the latest celebrity trend of using the weight-loss shot Ozempic.",
        "The 51-year-old actor - who recently opened up about his family's move from Los Angeles to Las Vegas - gave his opinion on the diet trend.Wahlberg spoke to Page Six at Tao’s grand opening of Cathédrale at the Aria Hotel &amp; Casino in Las Vegas on Saturday as he said: 'To each his own, but I do encourage people to eat right and exercise.'It’s much more [of] a lifestyle change. You’d be surprised what you can accomplish when you’re willing to do the work.'Ozempic and Wegovy have surged in popularity after becoming the first drugs proven to aid weight-loss.",
        "Celebrities including Elon Musk and Remi Bader have revealed they used the drug to help trim fat. Many other famous faces who have looked svelte recently are rumored to have used them.The drugs act like a hormone in the brain which causes people to feel less hungry and slow the clearing of food from the stomach — spurring weight loss.Wahlberg explained to Page Six that maintaining your health 'the good old-fashioned way' is his personal preference as it is the 'most sustainable' route adding that it will give you longevity.He did say that even if he isn't a fan of Ozempic use, he does not judge anyone who chooses to take the injections.",
        "Wahlberg said: 'Everybody has their own path. I don’t knock anybody for making their own choices.'But I prefer, and I’ve seen lots of people accomplish amazing things, ordinary people doing extraordinary things on a fitness base, and they’re now encouraging other people that look like them. That’s what I’m into.'Obviously the star takes his fitness very seriously as back in September 2018, Walhberg went viral by sharing his daily schedule which showed that he squeezed in multiple workouts with an incredibly early start. When an Instagram fan asked how often the Hollywood icon works out, the  Transformers actor offered a very detailed breakdown of his day which begins at 2:30 and ends at 7:30 pm.",
        "On the former rapper's check list were two major workouts that lasted more than an hour, two showers, snacks and meals, a cryo chamber recovery, golf and business meetings, in a routine that has baffled his fans.Wahlberg also mentioned time with family as he also picks up the kids from school.He has four children with 44-year-old model wife Rhea Durham: Ella, 19, Michael, 17, Brendan, 14, and Grace, 13.   It all begins at 2:30 am when his alarm goes off. Next it's a prayer session. Then the action star has breakfast at 3: 15 am, his first meal of many throughout the day.",
        "His day culminates with dinner and family time which comes at 5:30 pm and then at 7:30 pm he goes to sleep."
    ]
}