{
    "articleURL": "/news/article-12055121/Black-Oklahoma-man-charged-racist-hate-killing-two-white-strangers.html",
    "content": [
        "Carlton Gilford, who is homeless, shot Lundin Hathcock, 35, and James McDaniel, 55, in two different shootings on April 18He killed Hathcock in Rudisill Library around 9.40am. He walked up behind Hathcock, who was sitting at a desk, and shot him Shortly after, he went to a nearby QuikTrip convenience store and shot McDaniel. He died on the sceneA black man has been accused of shooting two white men in the back of the head in what authorities are describing as a racially motivated hate crime in Oklahoma. ",
        "Carlton Gilford, who is homeless, allegedly shot Lundin Hathcock, 35, and James McDaniel, 55, in two different shootings on April 18, according to the Tulsa Police Department. He allegedly killed Hathcock in Rudisill Library around 9.40am. He reportedly walked up behind Hathcock, who was sitting at a desk, and shot him. Shortly after, he allegedly went to a nearby QuikTrip convenience store and shot McDaniel. After he fell to the ground, Gilford shot him again. Hathcock, was rushed to the hospital where he died while McDaniel died at the scene. Surveillance footage also shows Gilford shooting at another person and a security guard at QuikTrip, according to Fox News. When police arrived, the homeless man admitted to shooting Hathcock and McDaniel. ",
        "Gilford was arrested and charged with two counts of first-degree murder, two counts of shooting with intent to kill, and one count of malicious intimidation or harassment. The latter charge is Oklahoma's version of a hate crime. Under Oklahoma law, there is no specific hate crime statute, but malicious intimidation or harassment includes targeting someone based on their race. His malicious intimidation charge is considered a hate crime in Oklahoma and means the victims were targeted based on their race, according to Fox News. Tulsa County District Attorney Steve Kunzweiler said the evidence supported that the two men were targeted based on race, but did not elaborate to Fox News about why she thought that. ",
        "'The information suggests that race played a role in it,' said Kunzweiler, according to KOTV. 'I feel like that is something we can prove, and it is something that a judge or jury obviously needs to listen to. So, we will present that information along with everything else.' 'Whenever you are talking about the dynamic where the safety of the public is at risk, in my mind, somebody who is killing somebody or doing harm toward somebody who they don't know, that really amps things up,' said Kunzweiler. "
    ]
}