{
    "articleURL": "/news/article-12055461/Charlie-Bradley-death-body-Sydney-real-estate-agent-died-Bali-return-Australia.html",
    "content": [
        "Charlie Bradley, 28, found dead in the street Family desperately seeking answers His body is being flown home today  The body of a Sydney real estate agent who died in Bali last month will be flown home today as his family await answers around his mysterious death. ",
        "Charlie John Bradley, 28, was found dead on the road outside a hospital clinic in north Kuta, in the south of Bali, several hours after leaving a popular beach club around 4am on April 16.His distraught family have been desperately searching for answers about what happened to him between leaving the club just after midnight and when he was found, amid troubling reports he was seen staggering around and banging his head against the ground.  ",
        "Mr Bradley's sister, Beth, previously told Daily Mail Australia she suspected her brother may have been a victim of methanol poisoning - after being assured by friends no drugs were taken.'Charlie doesn't drink beer - he sticks to spirits,' she said.'There's a lot of methanol poisoning in Bali. It seems that a lot of the bars pump their alcohol with ethanol themselves to save them money in terms of producing it. 'The body can't hack that much which can end up with you having hallucinations, not being able to walk, shaking and multiple other symptoms.'North Kuta's Police Chief Made Prama Setya said there was no evidence that Mr Bradley was a victim of methanol poisoning.Bali police asked Mr Bradley's family for permission to carry out an autopsy, but the family declined.",
        "They explained it would have meant months of waiting for his body to be returned to Australia.Ms Bradley said she had 'wracked her brain a million times over' in a search for answers and that methanol poisoning was the most plausible theory. 'Every time I've Googled people dying in Bali it seems to be a very similar situation and it seems to be happening more as of late,' she said.",
        "She received a chilling phone call from a doctor who treated her brother at Siloam Hospital in Kuta the day after he died. ",
        "Saturday 15 April: Charlie Bradley spends the evening drinking at Finn's Beach Club in North Kuta, south Bali with a friend he has travelled from Australia with and several others they have met out there.10pm: Mr Bradley's friend leaves the club to return to the villa. He stays with the group.Sunday 16 April - 12.10am: Mr Bradley is seen going into a taxi by a female friend who hears him give his address to the driver. The driver knows where it is. 1.30am: Mr Bradley makes three phone calls to his friend over WhatsApp.Time unknown: Mr Bradley is reportedly seen stumbling and staggering outside Da Maria restaurant on Petitenget Road, not far from his villa.3.40am: Mr Bradley is found in the road outside a health clinic a three minute walk from Da Maria restaurant by a local woman driving by on a motorbike. A taxi driver later stops and helps drive him to hospital. A foreigner - who claims he is unknown to Mr Bradley - is seen at the hospital and reportedly shows the doctor a video of Mr Bradley acting erratically, stumbling around and banging his head against the floor.Monday 17 April: Mr Bradley's family learn of his death.  ",
        "'The doctor told me that a man had brought Charlie into the hospital and that he showed him a video of Charlie standing, looking confused and shouting,' she said.'He then fell to the ground and was rolling around. He stood up, fell again and banged his head on the floor - five times. By the time he received Charlie at the hospital, Charlie had passed away.'Unfortunately, the doctor did not get the man's name or ask for a copy of the video. Ms Bradley made a desperate plea for that individual to come forward to spare their family the anguish of not knowing what happened in his final moments. The 'mystery man' accords with the latest update from Bali Police, whose spokesperson told Daily Mail Australia that they have interviewed two witnesses about the baffling death.The first is a local woman who came across Mr Bradley while driving past on a motorbike and the second is a taxi driver called Dani Siswanto who drove him to hospital.'Mr Siswanto said that the first time he saw Mr Bradley, there was another foreigner who also helped to take the victim into the taxi and take him to Siloam Hospital,' Bali police spokesperson Stefanus Setianto said.'Dani said that the foreigner told him that the he didn't know Mr Bradley. When police arrived at hospital, the foreigner was no longer there.'",
        "Mr Setianto also revealed that Mr Bradley was seen stumbling and falling in the street outside Da Maria Restaurant, which is less than a five minute walk from where he was found outside the clinic.'Witnesses said that the victim was staggering and fell down several times along the street,' he said.He added: 'There were some abrasions (scratch wounds) in his body, allegedly because he fall down on the street.' The ABC has seen CCTV footage of Mr Bradley's collapse from a camera above a bar across the road from the clinic.It shows him falling on the road, getting up and trying to walk, only to collapse again moments later.Yeni Wahyuni, a nurse at the 24-hour Bhaktivedanta clinic where Mr Bradley was first found, told the ABC that they had no choice but to turn him away because there was no doctor available. 'When I opened the door I could see he was having a seizure,' she said.",
        "Mr Siswanto, the taxi driver who took him to hospital, said that by then it was too late. 'He was already dead,' he said. 'I could tell because he wasn't breathing. There was no movement in his chest.'The friend left the beach club before him at around 10pm and Mr Bradley was put in a taxi by a female acquaintance at around 12.10am.",
        "He tried calling his friend three times at 1.30am but the friend did not pick up. There are scant few details about what happened to him after leaving the club. 'Did Charlie make it home?', asked Ms Bradley.'Did he get into the villa and then go back out? Or did he even make it back there? We have no idea. We're assuming by the fact that he called his friend he made it back and was banging on the door trying to get in but it's just so hard to know.' Although Ms Bradley acknowledges she is dealing with a 'massive language barrier', she feels cruelly let down by the Indonesian authorities. 'To be honest, with the actions that have been taken, I've really lost faith in their system,' she said.'If this had happened in any other country there wouldn't be this many gaps.'A GoFundMe page, set up by a friend of Mr Bradley's devastated mother Angela to raise funds to bring his body back to Australia, has has so far raised over $55,000.Doctors in Adelaide, where the family live, will perform an autopsy to try to determine the cause of death. ",
        "- Methanol is a chemically-simple version of alcohol that is found in locally-made spirits, such as Arak, in Bali.- It is often illegally substituted for vodka and other spirits to boost profits or cut costs.  - Symptoms of methanol poisoning include headaches, dizziness, amnesia and drowsiness, and can start immediately.- In extreme cases, it can cause psychosis, blindness, brain damage and death. - A 600ml plastic bag of Arak costs less than $5 in Bali.- Stick to beer, wine, cider and premixed drinks as methanol is only found in fake or illegally imported spirits.- Steer clear of bars and clubs in dodgy neighbourhoods, and never order cocktails."
    ]
}