{
    "articleURL": "/sport/boxing/article-12050167/Canelo-Alvarez-vs-John-Ryder-Ring-walk-time-watch-PPV-price-live-stream-undercard.html",
    "content": [
        "Canelo Alvarez defends his super-middleweight belts against Brit John Ryder The pound-for-pound star is fighting in Mexico for the first time in nearly 12 yearsSign up here to watch the fight exclusively on DAZN Canelo Alvarez fights in Mexico for the first time in nearly 12 years this weekend as he defends his super-middlweight titles against John Ryder. ",
        "The 32-year-old, who last defended his belts in September 2022 as he defeated a 40-year-old Gennady Golovkin on points, will put his WBC, WBO, WBA and IBF titles on the line. Canelo, who underwent surgery on his hand following the victory, is looking to set up a rematch with light-heavyweight champion Dmitry Bivol, who beat him emphatically last year. Ryder believes he is the fighter in the ascendancy, having beaten Zach Parker and Daniel Jacobs in his last two fights. But taking on Canelo - on Cinco de Mayo weekend - as the Mexican fights on home soil for the first time in nearly 12 years is a tough ask. With the bout now swiftly approaching, Mail Sport takes you through everything you need to know. ",
        "When is Canelo Alvarez vs John Ryder?The clash between Canelo and Ryder is scheduled to take place on Saturday, May 6 at the Estadio Akron in Guadalajara, Mexico.The pair are expected to walk to the ring at around 4am on Sunday morning for those in the UK, though that will of course depend on results beforehand.Julio Cesar Martinez and Ronal Batista will also square off for the WBC flyweight title on the undercard. How to watch the fightThe fight, which will be a 12-round contest, will be broadcast live on DAZN. Viewers will need a DAZN subscription to watch, but they won't be charged an additional payment. ",
        "A flexible pass for DAZN - meaning you pay monthly and can cancel within 30 days' notice - costs £19.99. If you pay for the year, though, it will cost £9.99 a month.For those in the US and Canada though, the fight will be PPV. In the US, it will cost $54.99 if you are a subscriber, and the same amount - plus a subscription fee - if not. Subscribers in Canada will need to pay $79.99. Canelo vs Ryder: The key statsCanelo AlvarezAge: 32Height: 5ft 8inReach: 70.5' Stance: OrthodoxRecord: 58-2-2Knockouts: 39Rounds: 460Debut: 2005John RyderAge: 34Height: 5ft 9inReach: 72' Stance: SouthpawRecord: 32-5-0Knockouts: 18Rounds: 233Debut: 2010",
        "Fight card in fullCanelo Alvarez vs John Ryder – for WBA (Super), WBC, IBF, WBO, and The Ring super middleweight titlesJulio Cesar Martinez vs Ronal Batista – for WBC flyweight titleGabriel Gollaz Valenzuela vs Steve SparkOleksandr Gvozdyk vs Ricards BolotniksNathan Devon Rodriguez vs Alexander MejiaBek Nurmaganbet vs Argenis EspanaLawrence King vs Elio German RafaelAbilkhan Amankul vs Fabian Rios FraustoJohansen Alvarez Suarez vs Johan Rodriguez ArreguinCarlos Rojo Vazquez vs Fabian Trejo RiveraJesus Larios vs Alejandro CurielWhat's been said? Canelo insists his full focus is on Ryder, but the Mexican is still thinking about a rematch against Bivol. 'You know, I want the same terms, the same everything as the last fight,' Canelo told reporters ahead of the bout. 'Right now, I'm focused a hundred percent on John Ryder because, you know, it's boxing and you never know. But Bivol, I [want] to have the rematch with Bivol [on] the same terms.' ",
        "Ryder meanwhile insists all the pressure is on Canelo ahead of the match-up. 'All the pressure is on Canelo,' Ryder exclusively told Mail Sport. 'There's no pressure on me. It's his first time back home in 12 years. I feel like I'm coming off a career-best year, while he's potentially coming off a career-worst. ",
        "'I know it's against a different level of opposition, but he lost to Dmitry Bivol and then gave a lacklustre performance against Gennnady Golovkin. He didn't look as he should have done. 'A lot of people were expecting him to get Golovkin out of there, but he couldn't. He's had surgery on his wrist after that, so we'll just have to see what he's got left.'Sign up here to watch the fight exclusively on DAZN "
    ]
}