{
    "articleURL": "/wires/ap/article-12040685/Pardon-frees-2-100-Myanmar-political-prisoners.html",
    "content": [
        "BANGKOK (AP) - Myanmar´s ruling military council on Wednesday said it was releasing more than 2,100 political prisoners as a humanitarian gesture. Thousands more remain imprisoned on charges generally involving nonviolent protests or criticism of military rule, which began when the army seized power in February 2021 from the elected government of Aung San Suu Kyi.",
        "State-run MRTV television reported that the head of Myanmar´s military council, Senior Gen. Min Aung Hlaing, had pardoned 2,153 prisoners on the most important Buddhist holy day of the year, marking the birth, enlightenment and death of Buddha.In a separate report, it said Min Aung Hlaing had commuted the death sentences of 38 prisoners to life in prison. The report provided no details about them.According to the Assistance Association for Political Prisoners, there were 112 prisoners on death row as of Tuesday who had been put there since the army takeover. The group keeps detailed tallies of arrests and casualties linked to the repression of the military government. At least four executions have been carried out since the military seized power.The prisoner releases began Wednesday but may take a few days to be completed. The identities of those released were not immediately available, but do not include Suu Kyi, who is serving a prison term of 33 years on more than a dozen charges her supporters say were trumped up by the military.According to an official announcement on state media, all of the prisoners granted pardons on Wednesday were convicted under a section of the penal code that makes it a crime to spread comments that create public unrest or fear, or spread false news, and carries a penalty of up to three years in prison.",
        "The terms of the pardons warn that if the freed detainees violate the law again, they will have to serve the remainder of their original sentences in addition to whatever term they are given for their new offense.Two prisoners freed from Yangon's notorious Insein Prison told The Associated Press they continue to support opposition political activities.One arrested in 2021 said the terms under which they were released meant they would be on a government watch list.\"But we know what we have to do. And we learned a lot from prison. Using that, we will continue to fight for the revolution,\" said the former prisoner, who asked not to be identified for safety reasons.The human rights organization Amnesty International said in an email that \"Anyone imprisoned for peacefully opposing the military coup in Myanmar should never have been jailed in the first place.\"\"This long-overdue release should mark the first step towards the immediate release of all individuals who have been arbitrarily detained for exercising their basic rights to freedom of expression and peaceful assembly or other human rights,\" the group's deputy regional director for campaigns, Ming Yu Hah, said. \"Amnesty International remains deeply concerned about the further thousands of individuals who are still unjustly languishing in prisons across the country where they face torture and other ill treatment.\"",
        "Mass prisoner releases are common on major holidays in Myanmar. The last release of that many political prisoners at one time occurred in July 2021, when 2,296 prisoners were freed.In November last year, several high-profile political prisoners, including an Australian academic, a Japanese filmmaker, an ex-British diplomat and an American, were released as part of a broad prisoner amnesty that also freed many local citizens held for protesting the army takeover.The Assistance Association for Political Prisoners had said Tuesday that 17,897 people taken into custody since the 2021 army takeover remained in detention.Prisoner releases appear to be efforts by the hard-line military government to soften its image as a major human rights abuser.Last week, former U.N. Secretary-General Ban Ki-moon urged Myanmar´s military to take the initiative in finding a way out of the country´s violent political crisis, including releasing political detainees, after a surprise meeting with Min Aung Hlaing.A statement following the meeting said Ban \"supported the international community´s calls for the immediate release by the Myanmar military of all arbitrarily detained prisoners, for constructive dialogue, and for utmost restraint from all parties.\"The amnesty also came a day after Min Aung Hlaing met with the visiting foreign minister of China, which has provided key support to his regime since it seized power.",
        "MRTV said Tuesday that Qin Gang held talks in the capital, Naypyitaw, with Min Aung Hlaing and other top officials and exchanged views on bilateral relations, Myanmar´s political situation and conditions needed for its stability and development.Qin´s visit followed a meeting Monday in Beijing with U.N. special envoy for Myanmar Noeleen Heyzer, who stressed that \"a robust international response\" to the crisis requires a unified effort by neighboring nations working together to stop the violence, U.N. deputy spokesman Farhan Haq said Wednesday.Heyzer emphasized China´s important global role and its support for the 10-nation Association of Southeast Asian Nations' efforts to facilitate peace, Haq said, while Qin underscored that the international community \"must act prudently and pragmatically\" to prevent the Myanmar conflict from intensifying and spilling over into the region.China has strategic geopolitical and economic interests in Myanmar, its southern neighbor, and is one of the few large nations that has maintained good relations with its military government, which is shunned and sanctioned by many Western nations for its takeover and brutal repression of its opponents.Myanmar has been in turmoil since the army took power. Its takeover prompted peaceful protests that security forces suppressed with bloody violence. Violence has since escalated with the rise of armed resistance around the country and major military efforts to suppress it.",
        "As of Tuesday, 3,452 civilians had been killed by the security forces since the military takeover, according to the Assistance Association for Political Prisoners."
    ]
}