{
    "articleURL": "/wires/aap/article-12045113/Rinse-repeat-Wanderers-watch-derby-thrashing-loop.html",
    "content": [
        "Western Sydney winger Yeni Ngbakoto has vowed to keep his emotions in check as his side prepare to renew hostilities with bitter rivals Sydney FC by watching their most-recent derby win on repeat.",
        "The Wanderers host the Sky Blues at CommBank Stadium on Saturday in the first ever finals encounter between the A-League Men sides.Marko Rudan's players have had the highlights of March's 4-0 thrashing of their city rivals playing on loop on TV screens in the meeting room and gym of their training HQ throughout this week.The excitement for the Wanderers, who haven't featured in finals for six years, is palpable and DR Congo international Ngbakoto is aware the players will have to keep calm heads if they want to knock their rivals out.\"The point of this video is to show how good we were in the last derby,\" Ngbakoto told AAP.\"(Rudan) has a job to remind us of the kind of game we need to play.\"Every moment, we were there. It was us, it wasn't by luck.\"We controlled our emotions and we were better than them, and that's why we won.\"It's going to be a finals game and we need to control every aspect.\"Sydney coach Steve Corica said the Wanderers' recent win would count for little come Saturday.\"I'm not really that interested in what they're watching or the way they want to prepare, that's down to their coach,\" Corica said.\"Finals is different, it's another ball-game, it's a one-off game.\"",
        "The 4-0 drubbing was a highlight of the Wanderers' impressive campaign under Rudan.But earlier in the season Ngbakoto had a derby moment he would love to have back.Trailing 1-0 at home, the 31-year-old was sent off for slapping Sky Blues midfielder Paulo Retre.There is a certain irony to his moment of madness given the Wanderers often finish training with a mediation session in the build-up to games.\"We have big players but need to find this balance to not over-react like I did,\" Ngbakoto said.\"I got a red card because of my emotions, maybe I went too hard.\"I need to find a way to find this intensity and anger and use it in a positive way.\"When I cross the line my mind changes, I want to win and be a leader.\""
    ]
}