{
    "articleURL": "/wires/reuters/article-12038075/Uber-confident-profit-ride-sharing-rebounds-2023.html",
    "content": [
        "Q1 revenue, adjusted core earnings above estimates",
        "Uber earnings boosted by ride-sharing, food-delivery heftStock soars 7%, also lifts Lyft(Adds details)By Yuvraj MalikMay 2 (Reuters) - Uber Technologies Inc forecast quarterly core earnings above estimates on Tuesday, after a surge in demand for travel and food delivery helped the U.S. ride-sharing giant report better-than-expected results for the January-March period.Shares of the company rose 7% and helped drive small gains in those of rival Lyft Inc, which reports earnings on Thursday.Uber is benefiting from its dominant position in key global markets as travel rebounds from a pandemic-induced lull. A jump in the number of people looking for extra income has also helped it offer lower incentives to gig workers, analysts have said.\"Our clear lead on driver preference has allowed us to better serve this growing demand: 5.7 million drivers and couriers earned $13.7 billion (including tips) on Uber during the quarter, both all-time highs,\" CEO Dara Khosrowshahi said.After a tepid performance in the last two years, \"the rideshare category in the United States and Canada is now growing faster in 2023,\" he said.Uber expects adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) of between $800 million and $850 million for the June quarter, compared with analysts' projection of $749.1 million, according to Refinitiv.",
        "The company said it was on track to post operating income profitability this year and that it was keeping its workforce flat after headcount fell sequentially in the first quarter.Uber also forecast gross bookings of between $33 billion and $34 billion, compared with the expectations of $33 billion.\"Return to work/travel tailwinds are causing mobility to outperform 'normal' 1Q seasonality,\" Oppenheimer &amp;amp; Co analyst Jason Helfstein said, adding that increased driver density and trips were boosting the fee Uber gets on transactions.Uber's first-quarter revenue jumped 29% to $8.82 billion, beating estimates of $8.73 billion, thanks to a 72% surge in the ride-hailing segment.The food delivery unit's revenue growth was slightly above expectations at 23% and Uber said it expected \"strong growth\" in the coming quarters.Adjusted EBITDA was $761 million, Uber's highest on record, while the adjusted loss of 8 cents per share was narrower than expected.Regarding competition with Lyft, Uber's Khosrowshahi said on a post-earnings conference call that \"they're looking to price competitively with us\" but \"the days of paying for share and essentially using shareholder money to buy share temporarily, those days are over.\"Lyft has been forced to become more disciplined with driver incentives, prompting Uber to do the same and helping its margins, Oppenheimer's Helfstein said.",
        "(Reporting by Yuvraj Malik in Bengaluru; Editing by Anil D'Silva)"
    ]
}