{
    "articleURL": "/wires/aap/article-12060427/A-little-bit-NT-budget-Lawler.html",
    "content": [
        "GST revenue and mining royalties are expected to return the Northern Territory to a fiscal surplus within three years, Treasurer Eva Lawler says.",
        "The NT budget has forecast an operating surplus of $121m by 2024-25 and a fiscal surplus of $67m by 2026-27.The recovery is overshadowed by an increased net debt of $9.23b which will mainly be spent on long-term infrastructure projects, including a $2.1b investment in roads, transport, housing and record spending in justice and cost of living relief.Ms Lawler introduced the budget into parliament, saying the government needed to balance social and economic factors in the territory.\"This budget is a fair budget, it is rock solid budget that looks after all territorians,\" she said.\"It is a budget that cares about territorians wherever you live...(and) is made for a territory upwards trajectory.\"Despite $36b earmarked for pipeline of major projects, a number of them have not reached investment stage and remain excluded from this year's budget making it a difficult task for the government to reach its aim of a $40b economy by 2030.Forward surplus is contingent on the contentious Santos Barossa gas project reaching production in coming years, despite being on hold because of legal action in the Federal Court.Net exports have dropped due to pressures on Inpex's Ichthys oil and gas project.The budget expects to grow to pre-pandemic levels by 2025 with exports hitting $11.3b, including forecast production from the Barossa project.",
        "The government has provided $71.7m in cost of living relief for households in the next two years as the government attempts to contain power prices.Almost $160m will be spent in the next five years for corrections and justice initiatives.This will go toward increased staffing, infrastructure and the government's youth justice \"model of care\" for a more therapeutic approach to youth detention.For the first time, health will not be the biggest spend in the budget with $2b allocated on health, $100m behind the commitment to roads and transport.Population growth is expected to drop significantly in coming years because of intrastate migration after the pandemic, but forecasts include a lift in international migration.NT BUDGET 2023/24Deficit: $1.13bRevenue: $8.2bExpenditure: $8.31bNet debt: $9.23bGST revenue: $3.8bUnemployment: 4.2 per centGrowth: 2.7 per cent"
    ]
}