{
    "articleURL": "/wires/reuters/article-12045387/German-exports-fall-significantly-expected-March.html",
    "content": [
        "Exports fell on weak demand from China and U.S.",
        "Effects of China's reopening to be seen in 2QTrade surplus of 16.7b euros in March, up from 16.1b in Feb(Adds economists' comments, export expectations and exports forecast)By Maria MartinezMay 4 (Reuters) - German exports fell significantly more than expected in March, as deliveries to the United States and China sharply declined, data showed on Thursday. Exports decreased by 5.2% on the previous month, with exports to European Union countries falling 6.2%, to the United States declining 10.9% and to China dropping 9.3%, the federal statistics office said.A Reuters poll had predicted a month-on-month decline of 2.4%.\"We continue to see no evidence of China's reopening in these data,\" said Claus Vistesen, chief eurozone economist at Pantheon Macroeconomics.Trade volumes with China shrunk significantly at the end of the first quarter, but Vistesen noted that China's reopening didn't get fully underway until the beginning of the second quarter.Sentiment among German exporters has rebounded to the highest point seen since the outbreak of war in Ukraine, on hopes of increased demand following China's reopening and thanks to the resilience of the U.S. economy, according to a survey by the Ifo economic institute.Despite the upbeat sentiment among exporters, the global economy has important challenges ahead: sticky inflation, rising interest rates and geopolitical uncertainties stemming from the war in Ukraine. \"The export-heavy German economy is feeling the effects of this,\" said Thomas Gitzel, chief economist at VP Bank.",
        "Imports fell by 6.4% compared with February versus analysts' expectations for a 1.7% fall.The foreign trade balance showed a surplus of 16.7 billion euros ($18.52 billion) in March, up from 16.1 billion in the previous month.The German Chamber of Commerce and Industry (DIHK) on Wednesday slashed its forecast for real growth of German exports in 2023 to 1% from a previously predicted 2.5%.The statistics office publishes more detailed economic data on its website. (Reporting by Maria Martinez in Berlin and Tristan Veyet in Gdansk. Editing by Kirsti Knolle and Christina Fincher)"
    ]
}