{
    "articleURL": "/news/article-12054027/Royal-fans-react-Justin-Welby-struggles-fit-crown-King-Charles-head.html",
    "content": [
        "Follow our live blog for all the latest updates on King Charles III's CoronationWorries crown could fall off as Justin Welby struggles to place it on King's headThe Archbishop of Canterbury was forced to spend several seconds adjusting the crown as the King was officially coronated.",
        "As St Edward's Crown was placed on Charles' head, there was complete silence in Westminster Abbey as the 2,300-strong congregation stood for the momentous occasion.Mr Welby appeared to place it on King Charles's head firmly, before giving it a twist in an attempt to keep it on. But after the twist failed to work, the Archbishop then lifted the crown up again, before having another go at securing it in position. After his second attempt the crown tipped forwards on the King's head. Mr Welby then tilted it to the side before he was content with removing his hands. The Archbishop then leaned forward towards the King and carefully inspected the ancient artefact before eventually retreating. The official crowning of the King took around eight seconds in total. The 2,300 guests in the ancient church then heartily echoed the archbishop's cry of God save the King.",
        "King Charles's crown is known to be heavy, with the monarch once commenting on how his mother the late Queen said goodnight to him while wearing it so she could 'get used to its weight on her head' before her Coronation in 1953. The official crowning of the Queen Consort was also not completely smooth, as she raised her hand and appeared to give the Archbishop some verbal assistance. Queen Camilla then used her index finger to adjust her hair underneath the crown five times.",
        "Royal onlookers were shocked at the trouble Welby had making the crown fit. One wondered whether there would be a 'Cinderella-style hunt' for a head that would fit the crown.One royal said: 'I mean... that crown didn't really fit, did it? Had to really smash it on there.' Another quipped: 'There's probably good reasons why they didn't, but why am I wondering why nobody checked if the crown fitted? Justin Welby was struggling there to fit it.'",
        "It marked the moment he was crowned King - in the historic first Coronation in 70 years today - having prayed to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain around the globe.Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, dating back to William the Conqueror in 1066, as Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.The historic moment, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.",
        "The monarch and his wife Queen Camilla smiled to the congregation as they walked through the church for a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.",
        "The monarch had been heir to the throne since the age of three, and was ready to finally embrace his day of destiny with the woman he loves by his side.Before his crowning moment the King was anointed with holy oil away from public view. He was dressed in a white linen garment called Colobium Sindonis, a golden coat called the Supertunica and has had the Coronation Girdle placed around his waist.After being sanctified at his anointing, the King was presented with the Coronation regalia. ",
        "Minutes earlier Charles swore on the Bible and kissed it, having taken the oath: 'I, Charles, do solemnly and sincerely in the presence of God profess, testify, and declare that I am a faithful Protestant, and that I will, according to the true intent of the enactments which secure the Protestant succession to the throne, uphold and maintain the said enactments to the best of my powers according to law.'His family were sat closest to him in a 2,300-strong congregation, although Prince Harry was sat in the third row, away from Prince William, his wife and children, and other working royals. The national anthem had played and crowds shouted God Save the King as Charles and Camilla took their 1.3-mile journey from Buckingham Palace to the Abbey through streets lined with two million people and 7,000 British troops.",
        "The two-hour service, pared back from his mother's in 1953, is a pivotal moment in the history of the Royal Family and will balance ancient tradition and a future in the 21st Century.Earlier, Charles and Camilla's Diamond Jubilee Coach arrived at the Abbey, following a procession from Buckingham Palace, in the midst of a Sovereign's Escort provided by the Household Cavalry's Blues and Royals and Life Guards with their shining breastplates and plumed helmets and led by the Household Cavalry Mounted Regiment band.The monarch and his wife's entrance through the west door was heralded by a fanfare from four State Trumpeters of the Household Cavalry and the abbey congregation stood as one.A large ceremonial procession was lined up before the King and Queen with representatives of all elements of the nation's ceremonial and spiritual life.",
        "There were recipients of Orders of Chivalry and Gallantry, Heralds from the College of Arms in their colourful tunics, senior clergy associated with the monarchy and the glittering coronation regalia carried by leading figures.St Edward's Crown was carried by General Sir Gordon Messenger, Lord High Steward of England.With their lavish and unwieldy robes, the King and Queen walked single file along the nave of the abbey with Camilla ahead of Charles as the hymn I Was Glad As They Said Unto Me was sung.",
        "There had been cheers and clapping from those gathered near Whitehall when, just after midday, Charles was proclaimed King The crowd was listening to audio of the coronation ceremony being broadcast in Trafalgar Square.Those waiting in the rain during the two-hour service joined in with a rousing rendition of God Save the King as the coronation ceremony came to a close.After the coronation the King and Queen left Westminster Abbey in the Gold State Coach at 1.07pm for a procession back to Buckingham Palace.",
        "The newly crowned King and Queen smiled at the thousands braving the rain to line the streets as royal couple were carried in the Gold State Coach back to Buckingham Palace.The Princess Royal followed behind on horseback in her role as Gold Stick and Colonel The Blues and Royals (Royal Horse Guards and 1S Dragoons).Next came the carriage with the Prince and Princess of Wales inside, along with their children Prince George, Princess Charlotte and Prince Louis.Five-year-old Louis waved eagerly from the window. Prince George, Princess Charlotte and Prince Louis were seen turning around in their carriage seats to get a better view of the procession and crowds along the route.The Waleses' carriage was followed by Edward, the Duke of Edinburgh, and his family."
    ]
}