{
    "articleURL": "/sport/football/article-12051037/Hugo-Lloris-played-game-Tottenham-suffering-thigh-injury.html",
    "content": [
        "Hugo Lloris, 36, only has one year remaining on his present Tottenham contractFormer France goalkeeper's future at Spurs is uncertain ahead of the summerHe won't play again this season after picking up a thigh problem at Newcastle Tottenham captain Hugo Lloris will not play again this season due to a thigh injury.",
        "Lloris has not featured since he was replaced at half-time of Tottenham's 6-1 thrashing at Newcastle and there are now doubts over whether he will play for the club again given his uncertain future with only one year left on his deal.'Hugo's out for the season,' Spurs' acting head coach Ryan Mason confirmed ahead of Saturday's visit of Crystal Palace.'We had the results back. Obviously disappointing, but we kind of feared that initially. We did some more tests and he won't play for us again this season.'I can't speak about next season but what I can say is that he has a very important role for us until the end of the season. We need him. We need him to be part of the group and I'm sure he will be.'",
        "Lloris is alongside Emerson Royal (ankle), Ryan Sessegnon (hamstring), Yves Bissouma (ankle) and Rodrigo Bentancur (knee) on the treatment table.Mason provided a positive update on Emerson and Bissouma but Sessegnon will not play again this season while Bentancur is set for a long spell on the sidelines as he recovers from anterior cruciate ligament damage.On Bissouma, Mason said: 'There are obviously some hurdles he has got to overcome and to hit some certain goals but we are hopeful he will appear before the end of the season.",
        "'Ryan had a significant injury, he's been out for a long time so Ryan won't feature again this season.'Emerson, I think it is a day-to-day check on how he is and how he's coping. Hopefully Emerson can help us between now and end of the season.'When Emerson does return to full fitness, it will increase the likelihood of Spurs reverting to a back four, which Mason used during his previous tenure in caretaker charge.",
        "He hinted on Friday that a tactical switch could occur before Palace visit and also started his press conference with a congratulations message to the club's under-18s.Stuart Lewis' side won 3-1 at Aston Villa to clinch the Under-18 Premier League Cup on Thursday night, having also sealed the Under-17 League Cup last month.Academy graduate Mason is hopeful some of them can progress into the first-team.'I'd just like to congratulate our under-18s from our academy because they won the under-18s Premier League Cup last night. Backed the under-17s up. It's important and good for the football club,' Mason added.'First of all you have to be good enough. That's a challenge to any of our academy players.'It is a big step up to the first team and we want them to aspire to that. We need academy players.",
        "'We've got Harry Kane, we've got (Oliver) Skippy, we've got others in the squad that are helping. I understand and the club certainly understand the value in that.'Mason also paid tribute to 'amazing' Crystal Palace boss Roy Hodgson, who gave him his solitary England cap in 2015.'I will obviously always have a soft spot for Roy Hodgson because he gave me my England debut,' he said of the 75-year-old.'I think the most important thing in football is if you have the fire inside you and if you can influence players and he's definitely got that still.'"
    ]
}