{
    "articleURL": "/news/article-12056269/Pictured-Man-stabbed-death-fight-outside-McDonalds-Bath-city-centre.html",
    "content": [
        "Ben Moncrieff died at the scene in Bath City Centre on Saturday morningThree men were arrested have been arrested and a boy, 15, charged with murderPolice have confirmed the arrest of a 15-year-old boy on suspicion of murdering a man who was stabbed to death outside a McDonald's.",
        "Ben Moncrieff was pronounced dead at the scene in Southgate Street, Bath city centre after emergency services were called just before 3.30am on Saturday. His family have been informed and Avon and Somerset Police officers arrested three in connection with the tragedy over the weekend.One boy, 15, remains in custody, while two others have since been released without charge. Mr Moncrieff was critically injured in an attack and sadly was pronounced dead at the scene on Bath high street at around 3.30am on Saturday morning.",
        "Police say an official identification has not yet taken place, and enquiries into the killing are continuing.Specially trained family liason officers are continuing to support Mr Moncrieff's family following the incident.His friends have since paid tribute to him as a 'loving, funny and hard working' young man.Chief Inspector Ronnie Lungu, of the Bath Neighbourhood Team, said: 'Our thoughts remain with Ben's family at this difficult time. Specially-trained officers are providing them with support and continuing to update them as the investigation progresses.'We'd ask his family's privacy is respected as they try to come to terms with the events of the past couple of days.'Ch Insp Lungu added: 'Our Major Crime Investigation Team is continuing to progress its enquiries into what happened, reviewing a significant amount of CCTV footage and taking statements from witnesses.",
        "'An extension has been granted this afternoon to allow us to continue to question the individual we have in custody.'We're grateful for the public's patience and understanding while enquiries were carried out at the scene and these were concluded yesterday. Extra reassurance patrols are taking place and anyone with concerns is encouraged to speak with those officers who will be happy to stop and help.'Anyone with information who has not yet come forward is asked to please call us on 101 and quote reference number 5223105088. Alternatively, Crimestoppers can be contacted anonymously on 0800 555111.'",
        "Paying tribute to Mr Moncrieff, a friend wrote on GoFundMe: 'Sadly a dear friend to many was taken from us on Saturday morning in the centre of Bath.'Ben was a hard working lad who had his life taken for no reason. The pain we're all experiencing is something words can't describe but I hope you're happy up there - seeing us all cherish the many memories we all made with you.' 'Ben was not only one of the most loving people I had the pleasure to meet, he was also the funniest. 'He brought endless smiles to everyone who was lucky enough to meet him and will never be forgotten.' He added: 'I'm so lucky to have made so many memories with you and I will cherish them everyday you're not here with me.",
        "'You will be missed forever Ben. We will never forget you.'  The GoFundMe page, titled 'Giving Ben the send off he deserves', has so far raised more than £1,500 towards helping Mr Moncrieff's family with funeral costs. Investigating officers said a post-mortem will be carried out in due course, according to The Mirror.  Chief Inspector Ronnie Lungu said yesterday: 'First and foremost our thoughts go out to the family of the man who has died at this difficult and incredibly upsetting time. 'A murder investigation is underway and we'd please ask for the benefit of our enquiries, but more importantly the welfare of the man's family, that people avoid speculating on the possible circumstances while that is ongoing.'Three people were arrested this morning on suspicion of murder and are in custody.'Chief Inspector Lungu added: 'While such tragic incidents are rare in Bath, people can expect to see an increased police presence in the area over the coming days while investigative enquiries are carried out and officer patrols conducted. 'We would encourage anyone who does have concerns to speak with those officers who will be happy to assist.'A scene remains in place at this time. We appreciate that will cause some disruption to the public and businesses today, but would please ask for understanding while officers carry out important work to establish what has happened.' ",
        "One witness previously told reporters he saw a male stab another young male outside the fast food chain, before security intervened.",
        "'I was going home, and there was around 15 younger people outside McDonald's and I saw a male stab a male and he fell to the floor,' the witness said.'Security then restrained the male to the floor. Other security gave CPR to try and save him but this wasn't successful.'People then tried to get to the lad who was being restrained. The police took a while to get there, it was chaos. Seeing the poor lad on the floor dead will live with me forever.'He only looked around 18 years old. The police then took the lad away and ambulances arrived.'Anyone who saw the incident or has footage of the surrounding area is urged to call 101 and quote reference number 5223105088. MailOnline has contacted Avon and Somerset Police for comment."
    ]
}