{
    "articleURL": "/tvshowbiz/article-12057855/Gordon-Ramsay-chef-mates-catch-remember-Jock-Zonfrillo.html",
    "content": [
        "Gordon Ramsay joined some of Australia's best-known celebrity chefs at a boozy lunch in Melbourne to celebrate the life of their late friend Jock Zonfrillo.",
        "Zonfrillo, an award-winning restaurateur and judge on MasterChef Australia, died of natural causes on April 30 at the age of 46.Ramsay reunited with his mates George Calombaris, Shannon Bennett and Matt Moran on Sunday for a bittersweet catch-up as they swapped stories about Zonfrillo over food and several rounds of drinks.Bennett, 47, posted a photo on Instagram of the four chefs posing at the venue, and captioned it: 'That hangover was for you, Jock Zonfrillo mate. RIP brother.'The four men were standing in front of a table with several empty wine glasses on it.",
        "Calombaris, 44, also posted a photo of the group, and wrote: 'A great dinner with a couple of beautiful humans. Love you boys.'Their lunch took place hours before The Sunday Project aired a special tribute to the late Zonfrillo ahead of the premiere of his final season of MasterChef Australia.Nigella Lawson and Marco Pierre White were among those who shared their memories during the emotional episode.",
        "Ramsay, 56, broke down in tears as he described how Zonfrillo 'lit up the kitchen'. 'The ripples have been devastating. No one's going to get over this quickly. If there's one thing we've done as chefs is we've united and we're talking about the good times,' he said, fighting back tears.'S**t. Sorry. It's just so painful. That's all,' he added. ",
        "Australian chef Curtis Stone remembered Zonfrillo as a 'kind, fair, genuine and honest' man.With a wry laugh, Stone called the plain-speaking Scotsman someone who 'treated everyone with respect - unless they didn't deserve it, then he wouldn't'.Zonfrillo died on April 30 at the age of 46. He is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.   "
    ]
}