{
    "articleURL": "/wires/afp/article-12040313/Suspect-Texas-neighbor-slayings-arrested.html",
    "content": [
        "A man accused of massacring five neighbors after they asked him to stop firing his rifle in his yard was captured Tuesday after a days-long manhunt, Texas law enforcement said.",
        "Francisco Oropesa had eluded authorities since the shooting Friday in the small town of Cleveland in southeastern Texas.\"We now have this man in custody,\" San Jacinto County Sheriff Greg Capers told reporters at a press conference Tuesday night.\"He was caught hiding in a closet underneath some laundry.\"The 38-year-old Mexican national is accused of attacking his neighbors after they allegedly asked him to stop shooting his semi-automatic AR-15 rifle because the noise was keeping a baby awake.The victims were between the ages of nine and 31, with several other residents in critical condition after multiple gunshot wounds.Capers said the surviving family members could \"rest easy\" now that Oropesa was behind bars.Authorities deployed hundreds of law enforcement officers to look for the suspect and offered an $80,000 reward for information leading to his capture.FBI special agent Jimmy Paul told reporters Tuesday night that a call to the bureau's tip line ultimately led law enforcement to Oropesa, who was arrested north of Houston at around 6:45 pm local time (2345 GMT).\"I just want to thank the person who had the courage and bravery to call in the suspect's location,\" he said.US Customs and Border Protection Commissioner Troy Miller also thanked law enforcement officials for apprehending \"the suspect of Friday's brutal murders in Texas ... without incident\".",
        "\"Tonight's actions clearly demonstrate that our agents and officers bring incredible capabilities to bear every day as they work to keep our communities safe,\" he said in a statement Tuesday night.- Horrifying scene -Capers had previously described a horrifying scene when authorities arrived at the victims' residence after receiving a call about \"harassment\" at around 11:30 pm Friday.",
        "Bodies were strewn from the front door to an inside bedroom, where two deceased women were found lying on top of two traumatized children who survived the massacre.Friday's attack quickly became fodder for the acrimonious debate on immigration in the United States.Texas Governor Greg Abbott drew criticism after referring to the suspect as having \"killed five illegal immigrants,\" though their immigration status was not immediately clear and Abbott later said at least one victim \"may have been in the US legally.\"The victims were all originally from Honduras.Honduran Deputy Minister of Foreign Affairs Tony Garcia told AFP that one of the victims would be buried in the United States, while the other four would be repatriated in the coming days, according to their families' wishes.Oropesa had been deported from the United States at least four times since 2009, according to CNN.The Texas killings appeared to be the latest in a series of US shootings spawned by normally banal interactions: a teenager mistakenly knocking on the wrong door, a cheerleader accidentally stepping into the wrong car, someone driving into the wrong driveway, a ball rolling into a neighbor's yard.",
        "There have been more than 180 mass shootings -- defined as four or more people wounded or killed -- so far this year in the United States, according to the Gun Violence Archive.With more firearms than inhabitants, the United States has the highest rate of gun-related deaths of any developed country: 49,000 in 2021, up from 45,000 the year before."
    ]
}