{
    "articleURL": "/news/article-12051053/Couple-says-earn-4-5K-month-house-hacking-means-live-SIX-tenants.html",
    "content": [
        "Experts say 'house hacking' is on the rise as first-time buyers try to find creative ways to get on the property ladderTrend sees homeowners rent out parts of their home for considerable tax perks  Dailymail.com speaks to one couple who lives with six tenants - and make $4,500 a month Overstretched homeowners are turning to 'house hacking' - a technique where they rent out parts of their own property and live alongside their tenants.",
        "Experts say the strategy - which comes with a host of tax perks - is on the rise amidst soaring mortgage rates and an uncertain real estate market. And one married couple has revealed they earn $4,500 a month through 'house hacking' - though it involves sharing their five-bedroom home with six other people. Nicole and Cam Masters, from Roseville, California, said the technique had helped them to get on the property ladder in October 2020.The money made from renting out their rooms covers their $300,000 mortgage - which works out at $1,000 a month repayments. ",
        "It means they have $3,500 excess each month have invested the surplus cash into two more properties which they rent on Airbnb.Nicole, 28, a real estate agent told Dailymail.com: 'We usually have tenants stay with us for around six months or longer. 'We have the master suite, and we live with one other couple, who we already knew, and four other females who we found on online renting sites like Facebook Marketplace and Roomies.com.'It's just one big bunch of strangers in a big house. We renovated our kitchen over the summer and it meant there was eight of us all sharing one gas camp burner.'The money they make from their tenants goes back into running the home and into their other property investments.",
        "House hacking has long been a popular strategy for first-time buyers trying to invest in real estate.This is because it allows homeowners to take out a residential mortgage - rather than an investment mortgage which typically comes with higher downpayments. An owner can acquire a residential mortgage with a payment as low as 3 percent but property investors would need at least 20 percent.FHA rules stipulate the owner must live at the property for at least a year to qualify.What's more owners are eligible for a mortgage interest deduction.This allows them to reduce their taxable income by the amount of money they've paid in mortgage interest during the year.It is capped up to $750,000 of mortgage debt.And the strategy means owners are effectively mortgage-free as the money they make from tenants covers the cost of their monthly repayments. Typically buyers look for multi-unit properties that are carved up into separate quarters.But increasingly buyers are just finding traditional houses and renting out singular rooms. They might do this either through short-term rental sites like Airbnb or seek out longer-term tenants. Some homeowners have even been known to rent out their lawn or driveway.",
        "Nicole and Cam say they share everything with their tenants - the kitchen, lounge space and even amenities such as cleaning and cooking equipment.",
        "However each room has its own private bathroom. 'There have been no disasters so far. It's gone pretty smoothly for us,' Nicole said.It comes amidst a turbulent few months in the property market which recently saw home sales plunge by 21 percent.Plummeting sales - and prices - has been sparked by rising interest rates which are deterring homeowners from moving.Mortgage rates have hovered above six percent since September 2022 after years of rock-bottom deals.The increase was sparked by the Federal Reserve's decision to repeatedly hike its base rate to tame red-hot inflation.Data from Freddie Mac released yesterday showed the average 30-year fixed mortgage rate was 6.39 percent, down from 6.43 the week before.North Carolina realtor Drake Johnson, of Five Pillars Realty, said more and more buyers would be likely to consider house hacking to cover the cost of increased rates.",
        "'House hacking has been around for a really long time. 'But now it could be a really good option for people to get to invest in real estate right now when mortgage rates are so high.'However buyers should be aware that they will be taxed on their rental income.On top of that they may even have to pay a self-employment levy if they provide services such as meals, transportation or concierge services.  Basic property maintenance does not count.",
        "And when selling a home that has been 'hacked' they are eligible for less tax perks than normal homeowners.Usually a seller pays capital gains and depreciation recapture taxes on a rental property. Capital gains tax is a levy imposed on the net profit you make when selling something you own. Current capital gains taxes are 0 percent, 15 percent or 20 percent depending on the income of the filer.But homeowners can exclude $250,000 of capital gains if they have lived at the property for two out of the last five years. This is known as a Section 121 exclusion.However in a house hack it only applies on the owner-occupied part of the home - rather than the whole property."
    ]
}