{
    "articleURL": "/health/article-12038111/Now-say-responsible-drinking-claims-phrase-shames-drunken-thugs.html",
    "content": [
        "EXCLUSIVE: The wording ignores the 'inherent risks' of boozing, WHO saysREAD MORE: No amount of alcohol is safe, WHO experts warnThe World Health Organization has come under fire for claiming the phrase 'responsible drinking' stigmatises drunks.",
        "The wording ignores the 'inherent risks' of boozing and unfairly pins the blame for poor behaviour on individuals who overindulge, the quango adds.This creates a 'sense of shame' for those who fail to control their intake, when they are really a victim of the low price and easy availability of alcohol, it warns.Critics last night accused the WHO of trying to erase the concept of 'free will and personal responsibility' so it could push 'nanny-state restrictions'.They said its guide to writing about alcohol is 'strewn with factual errors and scaremongering' - and highlighted that some of its authors have links to the temperance movement, which promotes total abstinence.",
        "The document says the 'risk to health starts from the first drop of any alcoholic beverage' and it is therefore 'not possible to consume safely – no matter how responsibly the drinker behaves'.However, some studies have found potential links between moderate consumption and health benefits - a point recognised by the UK's own alcohol guidelines.The controversial WHO guide says: 'Across the population, any level of alcohol consumption, regardless of the amount, is associated with a greater risk of loss of healthy life.'The vague notion of \"responsible drinking\" that is actively promoted by alcohol producers and marketers, does not define when to stop drinking or suggest the option of not drinking.",
        "'It does, however, create a mistaken impression that the alcohol industry is part of the solution to harms from drinking rather than a driver of the problem.",
        "'Moreover, the moralising tone implicit in \"responsible drinking\" messages ignores the inherent risks in consuming alcohol, mischaracterising its harms as the result of a small minority of individual drinkers who cannot control their intake.'It also can perpetuate stigmatising attitudes, wrongly blaming individual drinkers as the cause of all health or social problems linked to alcohol consumption, creating a sense of shame that stops them and their family members from seeking help when they need it.'The UK's chief medical officers, including Professor Sir Chris Whitty, say to keep health risks from alcohol to a 'low level' it is safest not to drink more than 14 units a week on a regular basis.This is the equivalent of around six pints of beer or six medium glasses of wine.They warn the risk of developing a range of health problems increases 'the more you drink on a regular basis' but they acknowledge there may be 'net benefits from small amounts of alcohol'.The WHO guide includes a glossary that says: 'Responsible drinking (Stigma alert!) – Drinking alcoholic beverages in moderation; drinking that does not lead to misbehaviour and health-related or other harm to the drinker or others.",
        "'The term is not defined more concretely and is favoured by alcohol industry interests.'However, it points to the behaviour of the consumer rather than their product as the source of any harm.'It puts the entirety of the blame for alcohol problems on individual drinkers rather than more prominent environmental factors such as advertising, pricing or availability.'Christopher Snowdon, head of lifestyle economics at the Institute of Economic Affairs, said: There is a growing tendency among nanny state activists to erase the concept of free will and personal responsibility.'We see this not only with regards to alcohol, but with food and gambling.'Their aim is to pin all the blame on the people who sell products rather than on the people who misuse products.'This gives them the excuse for endless restrictions on individual liberty masquerading as controls on industry.'He added: 'It beggars belief that the WHO is commissioning temperance activists to write reports about alcohol.'This report is strewn with factual errors and scaremongering, which its authors presumably hope journalists will repeat.'It explicitly recommends total abstinence from alcohol and pushes draconian nanny state policies.'Member states need to tell the WHO to stay in its lane, distance itself from fanatical pressure groups and focus on its day job.'",
        "A WHO spokesperson said: 'Less alcohol is more health. Alcohol is a carcinogen, and its consumption does not protect from diseases.'In recent years, science has shown that even a small amount of alcohol use harm individuals and their families, creating an unnecessary burden on societies.'",
        "One screening tool used widely by medical professionals is the AUDIT (Alcohol Use Disorders Identification Tests). Developed in collaboration with the World Health Organisation, the 10-question test is considered to be the gold standard in helping to determine if someone has alcohol abuse problems.The test has been reproduced here with permission from the WHO.To complete it, answer each question and note down the corresponding score.",
        "YOUR SCORE:0-7: You are within the sensible drinking range and have a low risk of alcohol-related problems.Over 8: Indicate harmful or hazardous drinking.8-15: Medium level of risk. Drinking at your current level puts you at risk of developing problems with your health and life in general, such as work and relationships. Consider cutting down (see below for tips).16-19: Higher risk of complications from alcohol. Cutting back on your own may be difficult at this level, as you may be dependent, so you may need professional help from your GP and/or a counsellor.20 and over: Possible dependence. Your drinking is already causing you problems, and you could very well be dependent. You should definitely consider stopping gradually or at least reduce your drinking. You should seek professional help to ascertain the level of your dependence and the safest way to withdraw from alcohol.Severe dependence may need medically assisted withdrawal, or detox, in a hospital or a specialist clinic. This is due to the likelihood of severe alcohol withdrawal symptoms in the first 48 hours needing specialist treatment."
    ]
}