{
    "articleURL": "/wires/ap/article-12047711/Prince-William-pours-pint-meets-public-coronation.html",
    "content": [
        "LONDON (AP) - Prince William has poured a pint of ale and taken a ride on the subway with his wife Kate as part of a royal ramble in central London before King Charles III's coronation.",
        "With just two days to go until Saturday's coronation ceremony at Westminster Abbey, William and Kate took time to chat with royal fans, tourists and Londoners on Thursday in the U.K. capital's bustling Soho entertainment district.The pair took their first trip on the Elizabeth line, named after Queen Elizabeth II and the latest line on London's busy train network. They then stopped at the historic Dog and Duck pub, where William went behind the bar and poured a pint of Kingmaker, a pale ale brewed to celebrate the coronation.William joked that he would have to watch how much he drank and \"get back into work mode.\"Hundreds of royal fans - some hailing from China, Canada and the United States - lined the streets of Soho, hoping for a glimpse of the couple, a handshake or a brief chat.Kate told well-wishers that her eldest child, Prince George, was \"excited\" about the coronation. The 9-year-old royal, who is second in line to the throne after his father, is expected to carry Charles' robes as one of the king's four pages of honor on Saturday.",
        "George and his younger siblings Princess Charlotte and Prince Louis attended a rehearsal for the ceremony alongside other members of the royal family on Wednesday.",
        "Thursday's royal visit came as London prepared for the United Kingdom's first coronation since Elizabeth II was crowned 70 years ago.Union Jack bunting and crown decorations have appeared across the capital, while Big Ben was lit up in red as part of late-night dress rehearsals around midnight on Wednesday.Some 100 heads of state, representatives from 200 countries and hundreds of thousands of visitors are expected to descend on London for the historic event. Many die-hard royal fans are already camped out near Buckingham Palace to secure the best viewing spot.\"We´ve always been a massive fan of the royal family. I was also over for the (queen's) jubilee, so all the big moments that we can, we come over,\" said Luisa Rawes, from Portugal. \"It is a massive occasion.\"Thousands of police are being deployed across London for one of the most complex security operations in U.K. history, bracing for any disruptions and anti-monarchy protests.On Tuesday night, officers arrested a man who threw shotgun cartridges into the grounds of Buckingham Palace, and blew up a suspicious bag belonging to the man. Police said the man was searched and a lock knife was found.Authorities said Thursday that the 59-year-old suspect, who hasn't been named, was detained under mental health laws and taken to a hospital. No one was injured, and Charles and Camilla, the queen consort, weren't at the palace at the time.",
        "___Follow AP´s coverage of King Charles III and the coronation at https://apnews.com/hub/king-charles-iii"
    ]
}