{
    "articleURL": "/tvshowbiz/article-12046435/Coronation-Street-star-Maria-Charles-dies-aged-93-fans-pay-tribute-actress.html",
    "content": [
        "Coronation Street star Maria Charles has died aged 93, it was announced on Thursday.",
        "The actress, who was known for her role as Lina Thistlewood in the ITV soap and as Bea Fisher in the sitcom Agony, passed away on April 21, with fans of the star paying tribute on social media. Maria's cause of death is currently unknown. Her acting career spanned over seven decades after she made her West End debut in 1945 and went on to star in multiple dramas. She last starred in 2008's Sisterhood as Ethel and appeared on stage in 2007's Bad Girls: The Musical in London as Noreen Briggs. ",
        "Sharing their condolences on Twitter, one fan wrote: 'Such sad news about Maria Charles; best known to me as playing Noreen Biggs in Bad Girls. This scene with Bodybag will always make me chuckle.' Another added: 'RIP Maria Charles. She was fantastic in Bad Girls as Noreen Biggs. Great actress. To Sylvia Hollamby, I Leave What's Under My Mattress. My p***.' 'MARIA CHARLES: \"Miss Hannigan\" in the very first show the monkey ever saw in a West End Theatre. So sad to hear of her passing today. Condolences to her family and friends at this time,' a third person penned. Another wrote: 'I'm devastated to hear about Maria Charles. Absolutely loved her playing Jane's eccentric mum in Agony.'Maria was born Maria Scheneider in September 1929 to Jewish parents, she took her professional name from her father, a hairdresser, who was known locally as Mr Charles. ",
        "Upon leaving school aged 14, she worked in hairdressing salons and beauty parlours like her dad before convincing her parents to let her pursue acting. She went on to attend The Royal Academy of Dramatic Art after lying about her age to get in. Maria landed her first role as the Doormouse in Alice in Wonderland before starring as Ruby Lockwood in Elsa Shelley’s drama Pick-Up Girl, which soon moved on to the West End from Notting Hill. ",
        "She enjoyed a successful stint in many theatre productions from musical The Boy Friend to Beauty and the Beast, Fiddler on the Roof and Annie. The actress went on to star in TV shows, Agony in 1979, Agony Again in 1995 and Coronation Street in 2005, amongst many more. In 1952 she married co-star and fellow actor Robin Hunter, the couple divorced in 1966. Maria is survive by two daughters from her marriage to Robin, Kelly, an actor, and Samantha, a production stage manager.  "
    ]
}