{
    "articleURL": "/wires/aap/article-12055993/Rozee-stars-Port-pip-Essendon-AFL-thriller.html",
    "content": [
        "Port Adelaide coach Ken Hinkley is lauding the toughness of his players after scraping yet another narrow comeback AFL victory, this time over Essendon.",
        "The Power came from 21 points down in the second quarter to pip the gallant Bombers by five points, 12.20 (92) to 13.9 (87) at Adelaide Oval on Sunday.Hinkley's charges are entrenched in the upper echelon after a fifth consecutive triumph - four of them by 14 points or less, and those four all when coming from behind.\"They are learning a lot, I reckon, in this period of four or five weeks as to what it takes to stick at it,\" Hinkley said.\"To stay resilient and stay tough ... you have just got to keep at work and we have kept at work for a good period of time.\"Confidence and belief comes from repetition.\"And we're now producing repetition in these types of games and that should give the boys great confidence and great belief.\"Port (six wins, two losses) were propelled to victory by their dynamic midfield duo, Connor Rozee and Zak Butters.Rozee collected 30 disposals and kicked a crucial last-quarter goal and Butters had 28 touches, seven clearances and nine score involvements despite nursing a sore knee.\"I don't like watching him play footy,\" Hinkley said of Butters.\"He's very, very good at it but I don't like watching play - he's too tough for his own good.\"",
        "Port's Junior Rioli will come under match review scrutiny for a behind-play incident which concussed Essendon's Jordan Ridley.Rioli, attempting a block when not looking at his opponent, caught the Bomber backman high with a back-hander.\"If you said the player that we could least afford to lose going into the game, it would have been Ridley,\" Essendon coach Brad Scott said.\"We were already under a bit of pressure back there with our tall stocks.\"Scott's Bombers (four wins, four losses) led by 15 points at quarter-time and 14 at halftime.After trailing by one point at three quarter-time, Essendon led by five early in the last quarter but conceded the next three goals.Still, the visitors rallied again: ruckman Andrew Phillips had a 50m set-shot with less than a minute remaining to level scores but his effort fell short and was rushed for a behind.\"We were able to find a way to fight and stay in the contest and show some real grit ... we just kept fighting to the end and I think that's a great hallmark,\" Scott said.Essendon on-baller Darcy Parish was brilliant, his match-high 37 disposals featured nine clearances, as were captain Zach Merrett (28 touches, nine tackles, one goal) and utility Jake Stringer, who booted two goals from his 18 disposals and had six centre clearances."
    ]
}