{
    "articleURL": "/wires/reuters/article-12058867/Chinese-state-tabloid-criticizes-South-Korean-protest-letter.html",
    "content": [
        "By Laurie Chen",
        "BEIJING, May 8 (Reuters) - China's hawkish state media tabloid, the Global Times, criticized on Monday a letter of protest by South Korea's embassy in Beijing, the latest public spat amid worsening ties between the Asian neighbors.South Korea's recent diplomatic push towards Japan and the U.S. would \"induce and aggravate the ... collapse of the situation in northeast Asia\" the paper said, a day after Japanese Prime Minister Fumio Kishida's landmark visit to Seoul.The editorial comment followed a letter published by the embassy on its website on Friday that \"expressed strong regret over a series of unreasonable slanderous articles\" by the paper.The articles used \"sensational, provocative and inappropriate vocabulary to denigrate not only our leader but also the Korean government's foreign policy,\" the embassy added.In turn, the Global Times criticized the embassy's \"brutal interference in (its) independent reporting.\"Foreign embassies in China rarely offer public criticism of reporting by Chinese state media.South Korea's embassy in China did not immediately respond to a request for comment.China's foreign ministry distanced itself from the state-affiliated tabloid at a daily briefing on Monday.\"The relevant media viewpoint does not represent the position of the Chinese government, but reflects current Chinese public opinion,\" said its spokesperson, Wang Wenbin.\"It is crucial to manage the original cause in order to avoid negative public opinion.\"",
        "Known for its nationalist rhetoric, the Global Times has repeatedly attacked South Korean President Yoon Suk Yeol for \"blindly following the U.S.\" after his visit there late last month.It has accused Seoul of bringing further tension to the Korean peninsula by building security ties with Japan and the United States.Sunday's visit by Kishida, the first by a Japanese leader in 12 years, is a sign of warming relations as both U.S. allies look to close a chapter on historical disputes that have dogged relations for decades.In a similar incident last December, China's ambassador in South Korea criticized Korean media for stoking anti-China sentiment. (Reporting by Laurie Chen in Beijing; Editing by Clarence Fernandez)"
    ]
}