{
    "articleURL": "/tvshowbiz/article-12056167/MAFS-AU-Cast-left-fuming-Nine-delays-handing-Instagram-accounts.html",
    "content": [
        "The latest season of Married At First Sight has been a ratings hit, with viewers across the globe tuning in to catch a glimpse of the drama and romance.",
        "However, the show's contestants are not happy with Channel Nine's latest move.The network is delaying handing the cast their Instagram accounts back, much to the frustration of the fame-hungry participants. In previous seasons Instagram accounts were handed back two weeks after the finale. However, this year's cast will have to wait another week despite being told they would get their accounts back on May 8.Channel Nine and the production company are reportedly concerned about the cast going rogue on social media while season 10 is still airing overseas.",
        "This has left many of the participants feeling angry and disappointed, as they see this as a missed opportunity to cash in on their newfound fame. Evelyn Ellis, Bronte Schofield, and Harrison Boon are just some of the contestants who will be affected by the delay.By the time they get their Instagram accounts back, their 15 minutes of fame may have faded, leaving them with fewer opportunities to capitalise on their MAFS experience.",
        "'They won't be getting their Instagram back for another week, and the cast are pi**ed,' an insider told Daily Mail Australia on Sunday. According to the insider, Nine and the production company are worried about certain cast members who have already gone rogue. 'It's safe to say that certain cast members haven't done themselves any favors with Channel Nine and they won't be invited to the Logies this year,' the insider added.",
        "By the time the MAFS cast get access to their Instagram accounts, their engagement levels will have dropped significantly, affecting their potential earnings. While the show was airing, participants were allowed to write their own captions on photos supplied by Nine's publicity team, but that is the extent of their permitted social media activity.In the past few days, Nine have allowed the brides and grooms to supply photos and captions to be posted on their behalf.",
        "Comments have also been disabled on their posts and the cast aren't allowed to access their direct messages, which is how sponsors would contact them.One angry unnamed bride told Daily Mail Australia she doesn't have time to wait to get her social media accounts back.'I've met up with a few brand managers and they told me they tried to contact me via Instagram DM's but couldn't,' they said. 'I'm super pi**ed off, we won't even get your messages.' While previous seasons have seen brides soar to half a million followers during the show's run, the new batch of brides haven't attracted the same level of attention.",
        "Claire Nomarhas' following has gone from 2,800 to 241,000, while Melinda Willis - who was already an influencer before the show - has grown her audience from 150,000 to 440,628 followers.",
        "Intruder bride Evelyn Ellis has tripled her fan base from 65,000 to 253,330, which is impressive, but far from the heights of Martha Kalifatidis, Domenica Calarco or Ella Ding.Other stars have had only moderate success in building their social media brands.Bronte Schofield, for example, has garnered 123,400 followers, while Tahnee Cook sits on 165,000 followers.Melissa Sheppard has attracted 32,600 new followers, while Tayla Winter has seen an even more modest growth of 89,900 followers. ",
        "Considering the fact MAFS draws up to two million viewers per episode, this growth is pretty underwhelming.The social media expansion of this year's brides pales in comparison to Dom and Ella from last year's season, who left the show with a whopping 500,000 followers each.As the tenth season is still underway in the UK, the brides' accounts may continue to grow in the coming weeks."
    ]
}