{
    "articleURL": "/news/article-12052933/Coronation-order-service-list-hymns-music-prayers-readings-revealed.html",
    "content": [
        "Follow MailOnline's new Royals channel for all the latest news and updates Full details of the service at Westminster Abbey that will see the Coronation of King Charles III and his wife Queen Camilla have been released.",
        "The Procession of The King and Queen Following the choir, and religious and Commonwealth leaders, Their Majesties will enter Westminster Abbey to the anthem I Was Glad, a version of Psalm 122 set to music by Sir Hubert Parry, the composer of Jerusalem. Parry’s setting contains the cry ‘Vivat Rex!’ (Long Live the King!) which will be proclaimed by scholars from Westminster School.A Moment of Silent PrayerThe Royal Couple take a moment to reflect and pay homage to God.Greeting and IntroductionThe Archbishop of Canterbury welcomes the congregation with a blessing.The RecognitionThis is the first element of the traditional English Coronation Rite in which the congregation affirms support for the King by exclaiming: ‘God Save King Charles.’",
        "The Presentation of the Holy BibleA copy of the Bible is gifted to the King, symbolically setting the ‘word of God’ above all human laws. The Moderator of the General Assembly of the Church of Scotland will tell the King: ‘Here is Wisdom; This is the royal Law; These are the lively Oracles of God.’ This tradition dates back to the Coronation of William III and Mary II in 1689.The OathsThe Oaths are vows to support people of all faiths and beliefs. The Archbishop asks Charles III if he is willing to take the Oaths and to ‘promise and swear to govern’, to which the King will reply: ‘I solemnly promise so to do.’",
        "The King’s PrayerThe Monarch offers a specially composed prayer which draws inspiration from Galatians 5 and the much-loved hymn, I Vow To Thee My Country.",
        "CollectAnother prayer, written especially for the Coronation, addressing the theme of loving service.The EpistleColossians 1 9:17Prime Minister Rishi Sunak will read from the first chapter of the Epistle (which translates as ‘letter’) to the Colossians.GospelLuke 4:16-21The Gospel — derived from the Greek for ‘Good News’ — is St Luke’s account of Jesus at worship in the synagogue.SermonThis is an opportunity for The Archbishop to place the ceremony within a broader religious context, and explain how the themes of the celebration relate to both the public and the monarch.The AnointingAs The King prepares to be anointed upon the Coronation Chair, he removes the Robes of State — signifying his humility in front of God.The Archbishop will anoint The King on his hands, breast and head. This sacred part of the ceremony will be held behind a screen and is not broadcast on TV.Meanwhile, the choir sing Handel’s anthem Zadok The Priest, which he composed for the Coronation of George II in 1727.It has been sung prior to the anointing of the sovereign at the Coronation of every British monarch since then.",
        "The Presentation of RegaliaPeers from the House of Lords and senior Anglican bishops will present various symbols of royalty. Non-Christian peers will present regalia which does not bear explicit Christian motifs, affirming the different faiths that will serve under the King.The OrbA representation of sovereign power, the Orb is placed in The King’s palm.",
        "The RingSimilarly to rings exchanged during a marriage ceremony, the Coronation Ring is a symbol of the monarch’s promise and commitment to God. The Archbishop will tell King Charles that the ring represents ‘the covenant sworn on this day between God and King, King and people’.The Sceptre and RodAnother piece of regalia loaded with significance, the Sceptre represents temporal power and authority. The Rod of Equity and Mercy represents the Monarch’s spiritual role and his pastoral care of the people.The CrowningMade of solid gold and set with precious stones, St Edward’s Crown (made in 1661) represents the King’s vocation before God, and is a reminder of the promises and vows he has made to the people.As he crowns the King, the Archbishop will lead the congregation in declaring ‘God Save the King!’ — a loyal exclamation that has been part of the Coronation ritual since 1689.",
        "FanfareRichard Strauss’s famous Vienna Philharmonic Fanfare will follow the crowning and then the abbey bells will ring for two minutes, followed by a gun salute fired by The King’s Troop Royal Horse Artillery as well as all saluting stations throughout the kingdom, including in Bermuda, Gibraltar and on ships at sea.",
        "The BlessingThe Archbishop and other Christian leaders will deliver the blessing. It is the first time the Blessing has been shared by clergy from different denominations — a reflection of Britain’s ecumenical progress.Enthroning The KingThe King is settled on the throne while the Archbishop commands him to ‘stand firm, and hold fast from henceforth this seat of royal dignity, which is yours by the authority of Almighty God’ — phrasing which dates back to the coronation of King Edgar in 959.HomageThe Church of England, followed by Prince William, pays homage to the King. This is then followed by a new tradition: the opportunity for the public to swear their ‘true allegiance’ to the Monarch and his heirs. A chorus of millions will participate — from members of the congregation and subjects in the streets outside to people up and down the country — in this solemn and joyful moment.Coronation of the QueenIn a shorter sequence to that of the King, Queen Camilla has her own Coronation, which begins with a brief anointing.The last sovereign consort to be crowned was the late Queen Mother in 1937. It is an honour that is bestowed only on female consorts, and therefore His Late Royal Highness Prince Philip had no such ceremony.",
        "The CrowningQueen Mary’s Crown is placed upon her head. The crown has been embellished with jewels from her Late Majesty’s personal collection, including the Cullinan III, IV and V diamonds.Enthroning The QueenCamilla is seated beside the King, symbolising their joint vocation before God. A significant moment of music comes next, as the choir will sing Andrew Lloyd Webber’s coronation anthem, Make A Joyful Noise, as the King and Queen are united in their joint vocation. This setting of verses from Psalm 98 was commissioned for this service.",
        "Offertory HymnGifts of bread and wine are brought before the King.Eucharistic PrayerThis prayer recalls the words of Jesus at the Last Supper.SanctusWith words dating to the fifth century, the Sanctus will be sung to music composed by Roxanna Panufnik, a British composer of Polish heritage, one of the King’s 12 commissions for the Coronation.The Lord’s PrayerThe Archbishop will invite everyone to join him in prayer, wherever they may be, in whichever language they wish. The Our Father was Jesus’s gift to his followers when they asked how they should pray.Prayer after CommunionTaken from the Book Of Common Prayer, this prayer asks God to direct us in His holy ways.The Final Blessing",
        "The Archbishop of Canterbury leads a final blessing, praying: ‘Christ our King, make you faithful and strong to do his will, that you may reign with him in glory.'Te DeumThis Latin hymn dates back to the 4th Century and is sometimes called The Hymn Of The Church. It is sung as Their Majesties go to St Edward’s Chapel to be vested in the Robes of Estate and Charles puts on the Imperial State Crown.The term ‘Imperial State Crown’ dates back to the 15th Century, when English monarchs chose a crown design closed by arches to demonstrate that England was not subject to any other earthly power.The National AnthemGod Save The King has been the national anthem for more than 250 years. It is both song and prayer, calling on God to protect the Sovereign and ensure their wise rule. The eponymous phrase is far older than the song, appearing several times in the King James Bible.Greeting of faith leaders, representatives and the governor-generalsIn an unprecedented gesture marking the significance of the religious diversity of the realms, the Sovereign will spend his final moments in the Abbey receiving a greeting from the leaders and representatives from the major non-Christian faith traditions: Jewish, Hindu, Sikh, Muslim and Buddhist.In a historic first, the complete Coronation will be recorded and released as an album on the very day of the ceremony."
    ]
}