{
    "articleURL": "/tvshowbiz/adam-collard/article-12041331/EXC-Love-Islands-Adam-Collard-admits-chose-ex-Paige-Thorne-game-plan.html",
    "content": [
        "Adam Collard has admitted he had a game plan during second stint on Love Island in a new interview with MailOnline.",
        "The reality star, 27, earned a reputation as a lothario during his stint on the 2018 series and later returned for the 2022 series.And now, Adam - who met ex-girlfriends Zara McDermott and Paige Thorne on the dating show - has revealed he would 'choose the right person' to stay on the programme longer.In an exclusive interview, the fitness enthusiast explained: 'The thing with Love Island is I'm the only one who is willing to admit it, I would completely choose the right person to stay on the show. 'That's why I got back on the show in my eyes, they realised I didn't care about anything.'",
        "Adam and Paige broke up after she accused him of cheating after he was filmed flirting with other girls on nights out. He continued: 'We all know the game. It was really hard for me the second time because I could see through everything, it is unbelievable how clear it is the second time. 'It messes with your head, you almost convince yourself you like these people and then once you see the light and get back home you realise you aren't a perfect match.' Adam, who is currently single, has now appeared on Love Island twice, as he became the first former Islander to return as a bombshell during last year's series.",
        "For the first time in Love Island history, the social media profiles of this year's Islanders remained 'dormant' during their time on the show.Speaking about the new rule, which meant contestants came out to a lower social media following, Adam said: 'I don't know if I would have said yes the second time if they had said that to me because what is the point.'I don't feel sorry for anyone who puts themselves in that situations. Unless you are from one of the early series, the first three series you could come off and have a normalish life but now everyone is going on to strive to be a Molly-Mae.'If you stay on there for more than two weeks you are going to be in the public eye, you are going to get trolled, you've got to take the rough with the smooth. You have to be thick skinned because it is horrendous.'Adam previously shared on his YouTube how he's seen people like Molly-Mae Hague become hugely successful from the show, and admitted he wanted a 'piece of that' himself. ",
        "He said: 'You are getting a few followers, if you have a business like me it's going to help amplify that and that put you in a better situation and there's going to be loads of really good opportunities afterwards. ",
        "'So yes, everyone comes on and says I am here to find love and that, yes you kind of are and obviously that is unreal but nobody is daft.'Speaking about his future reality TV career, Adam said: 'I'd love to go on I'm A Celebrity, the hardest challenge for me would be jumping out of the helicopter as I'm terrified of heights. I'd also love to do SAS: Who Dares Wins, anything challenging.'But I'm not going to lie, I think I've well and truly done my time on reality TV, not sure I would do it anymore.'Adam recently revealed he hopes to settle down in the future and wants to get married 'as much as the next person'.Speaking to The Sun, Adam acknowledged he has been 'ruthless' in past relationships but hopes to turn a new leaf. He said: 'I am dating again now. Do you know what, as much as I have been a little bit ruthless in the past with relationships and yes I've ended things when it has started to not work out, I am actually a bit of a hopeless romantic.'I do think there is someone for every person and I want to go and do all the things I like to do with someone else.'",
        "Adam and Paige broke up after she accused him of cheating after he was filmed flirting with other girls on nights out.",
        "Fitness expert Adam acknowledged the split was 'a little bit my fault', adding: 'I ended up splitting up on the second or third day of when I was in Bali. I think we both knew then that we were on the same page and we knew what was coming.'Paige previously told Cosmopolitan that she knew their relationship was over after the personal trainer 'literally ghosted me'. She said: 'He wasn't texting me back. He would leave me on read for the entire day. My own boyfriend literally ghosted me.'From then, I was just like, \"We're done. This is beyond a joke now\". He replied, \"I didn't want it to go this way, but at least we both know where we stand\".'"
    ]
}