{
    "articleURL": "/femail/article-12052011/BEL-MOONEY-does-cruel-mother-cause-pain.html",
    "content": [
        "Dear Bel,",
        "I’m struggling at the moment and your wisdom would be very much appreciated. I am almost 80, a widow and the mother of a wonderful daughter of 49, who I love dearly and of whom I am incredibly proud. My first husband was abusive, but, not believing anyone could ever want me, I was so grateful to him — until he abused my daughter and we left.I brought her up as a single mother, with no input from the ‘father’, or ‘sperm donor’ as I call him. We knew poverty like no one today will ever know, but we did it! I was so lucky later to marry Steve, who was a wonderful step-dad to my daughter and whom I greatly miss.Here’s the thing — loving my daughter so much makes it impossible to understand why my mother was so cold and unloving. She idolised the brother I haven’t seen for 40 years.My childhood was so painful and I suffer from the memories. For some reason, my mother just didn’t take to me — apparently, she had a bad time giving birth — which I heard about every birthday.Sadly my father was mentally ill and emotionally absent. He was cold and scary, and Mum was hyper-critical. I could do no right, but her little boy could do no wrong.",
        "I grew up thinking I was the ugliest, most useless ‘thing’ on the planet and loathed myself so much I can’t even describe it. When I arrived home from school she always said: ‘Oh, it’s you,’ although who else was she expecting? I went to a school a long way from home, a mile walk to catch the bus, a long bus ride and then a half a mile walk the other end.I used to grab a few biscuits when I came home, until one day I put my hand in the tin to find a note saying: ‘Keep your sticky fingers out.’My brother was watching and said gleefully: ‘She’s seen it, Mum!’Can you imagine how much that hurt? I spent much of my childhood in my bedroom dreaming that someone cared about me.Mum was always comparing me with other girls and sneering, ‘Why do you always feel so sorry for yourself?’ She made me feel so worthless. There is so much more I could write.I would have done anything for the parents who let me know I wasn’t good enough and inflicted such hurt. But why is this more painful as I age?VAL",
        "Perhaps other readers share your experience — and mine, too — of dwelling more and more on the past as the years pass. Why is this? It could be because of the pressure of mortality.",
        "We can do nothing about getting older and more vulnerable, so feel wistful about dreams not achieved, while simultaneously flinching at the inner pain, the memory of harsh words and small put-downs which helped cumulatively to dent our confidence. Who knows? It was all such a waste of precious time, wasn’t it? You deserved so much better.",
        "All shall be well, and all shall be well, and all manner of things shall be well.From Revelations Of Divine Love by Julian of Norwich (medieval Christian mystic, 1343 – 1416)",
        "Your letter came to me via Facebook, not the office, although you are a Mail reader. Besides, it’s even more unusual since I’ve met you, so for once can put a face to a name.Some years ago you and your late husband came to rent the holiday cottage my husband once ran as a business and so we chatted. I am so sorry about the death of your rather jolly husband (a robust gin-and-tonic and roast beef man!) and suggest that loss still hangs over you, lowering your mood.Grief (compounded by long, previous stress of taking care of somebody in poor health) does not ‘go away’, but becomes a part of our character forever. It could be that it’s served to focus your sad memories of childhood, too, because you’ve been tired and unwell.",
        "At this time in life all of us tend to reflect on past, present and future — and it’s a melancholy process. When exhausted, I do it too.Who can possibly understand why a mother could be so nasty to her only daughter? I wonder what might have happened in her own childhood to make her so unloving of you, yet devoted to your brother.It might have been the shock of childbirth; there’s no way of knowing how the human mind and spirit respond to events. You suffered cruelty, bullying and rejection in the very place where you ought to have felt safe, and I feel such deep compassion for the little girl you were and the woman who is still asking, ‘Why?’No one can answer that question, Val. Perhaps you should derive a little consolation from the thought that your parents taught their poor daughter the resilience (bloody-minded determination too?) which gave her the courage to leave an abusive marriage, bring up a wonderful daughter, and then attract a good man. That’s not nothing, is it? Your mother made you feel worthless, yet just consider the love you have made in your life.Your mother and father were unfortunate in never having the good fortune to know the person their daughter became. Can you forgive them — and also forgive yourself for feeling at fault?",
        "Now, because we met, I happen to know something not in your letter. I sum up the extra-special unconditional love you receive every day of your life in one word: DOGS! You are a passionate dog-lover, have rescued dear animals, and given some financial help to those fostering and rescuing from abroad.Every day you experience delight in every single wag of a tail. What a gift. The thing to do when you feel sad is take the dogs out, rejoice in their fidelity and fun, and consciously use their devotion to drive away the bad memories — just as the morning light banishes the darkness and illuminates the beauty of new leaves in May.We’re growing apart as the years go by Dear Bel,My husband (French) and I (American) are 68 and 70 respectively. Exhausted by working to pay the mortgage and high taxes and social charges in France, he proposed we try another country.For family reasons we ended up in the U.S., needed to work, but could not find jobs in our field of teaching and academic writing, only part-time minimum wage.I felt depressed, and in turn, he became depressed because I was so unhappy. I wanted to return to Europe, he wasn’t ready, but didn’t want to stay in the U.S. without me, so we left.",
        "We returned to Europe (the Netherlands and France), I found lots of work — but he hasn’t had any work since 2017. Nor has he looked, though he says he thinks about work every day.We cannot retire comfortably and need extra income to supplement our low pension. As it stands, I work hard and he stays home and reads.At first I was resentful, but I realised I’d pressured him to leave the U.S. However, he’s rather isolated. We still travel, are quite compatible in terms of enjoying the same things, and have similar values: we love animals, children, nature, art, and literature.My job requires me to grow as a teacher and person, and continually hone my skills. I wish he would make a contribution to our finances, however small.We only argue periodically, but when we do it’s unbearable. He won’t calm down so I have to leave the house no matter the hour, even if it’s just to drive around in the car for a few hours.Am I being unreasonable? Divorce seems out of the question at this age.LAURADivorce is never out of the question, of course; there are those who divorce late in life and feel all the happier, even though mortality beckons and realistically they know they have not that long left to feel ‘free’.Yet you and your husband have so much in common and can, I’m sure, converse contentedly about all the books he reads (there were more details in your longer letter) as well as the work that satisfies you. Had you private incomes there would be no problem, which is a far cry from those couples I know who are miserably incompatible. So I’m glad you listed your shared values and interests, and suggest they are the bedrock of a good marriage. Never forget that.However, you’ve both had a very tough time financially (like many other people) and it sounds as if your husband became utterly demoralised by your time in America, and that’s probably why he lacked the energy to move back to Europe. You pushed it, for the best of reasons, but it sounds as if his confidence never returned. That’s a hard thing to snap out of, and it must be made worse for him to see you fulfilled by work.Worse, he knows you are the breadwinner who often feels resentful because he’s not contributing. That’s why he loses his temper so completely when you row.It’s hardly ‘unreasonable’ of you to want him to work, because you know it would also help him regain a sense of identity. He needs confidence and things to talk to you about, apart from books.He hasn’t gone to look for work, so might you engineer work to come to him? Could you ask around about getting him some tutoring work? Trawl everyone you know? Might you tell him, ‘Oh, X is desperate to find somebody to coach Y for English A-level (say)’ and edge him into it? That could be the start.You sound a strong woman and I’m on your side, but I think this talented man needs help.And finally... Like 70 years ago, today I’m rejoicingThe bunting hangs over our gateway, the champagne’s on ice, my Coronation chicken is delicious, and our friend Vicky is bringing a surprise Coronation pudding. I’ve even embroidered a Coronation keepsake to hang on the wall.Yes, I’m a very Merry Monarchist! We have the best clothes and the best times, just like the Cavaliers of the 17th century. Well . . . OK, we lost that civil war, but then the monarchy came back with more fun and games and ‘cakes and ale’, to borrow Shakespeare’s phrase. Hooray!",
        "Bel answers readers’ questions on emotional and relationship problems each week. Write to Bel Mooney, Daily Mail, 9 Derry Street, London W8 5hy, or email bel.mooney@dailymail.co.uk. Names are changed to protect identities. Bel reads all letters but regrets she cannot enter into personal correspondence. ",
        "Seven at the last Coronation, I belong to the post-War generation which remembers respectfully standing up for the National Anthem in the cinema when the film or cartoon had ended and a fug of cigarette smoke wreathed our heads.Nobody scuttled out. We saw television for the first time when Queen Elizabeth II was crowned and my grandparents bought the little set specially for the occasion. The curtains were closed against the daylight as the family crowded round that tiny, flickering grey screen.How magical to see the pretty young Queen in her golden coach — right there, in the corner of Nan’s back room in Liverpool. I remember the sense of excited belonging. We recognised ourselves in this.The thrilling event was even more personal because my 31-year-old father had travelled all the way to London with two friends — blue-collar workers all three — to join the crowds. There were no motorways; the journey was long and expensive.Those patriotic working men stayed in a boarding house for two nights, all for the experience. It mattered. Their effort was rooted in national identity; the war against the forces of evil had been won and that (recent) victory was proclaimed in a forest of Union Jacks.That joyful memory adds to my sense of deep rejoicing today. The King is a cultured, warm, intelligent, humorous, kind and far-sighted man, and I’m happy to pledge my allegiance aloud. God Save The King!"
    ]
}