{
    "articleURL": "/tvshowbiz/article-12055713/Chris-Pine-joins-stylish-father-daughter-duo-Dannielynn-Larry-Birkhead-Kentucky-Derby.html",
    "content": [
        "Chris Pine was one of the many stars spotted at the annual 149th Kentucky Derby in Louisville, Kentucky on Saturday.",
        "The 42-year-old Star Trek actor looked dapper as he teamed a navy-colored tie with a pastel blue blazer worn over an otherwise all-white ensemble for the annual horse races at Churchill Downs.   The Don't Worry Darling star — who partied it up with Jeff Bezos and Oprah Winfrey in Beverly Hills last weekend — accessorized with a pair of classic wayfarer sunglasses and a stylish pocket square. At the highly-anticipated event, the later Anna Nicole Smith's daughter Dannielynn Birkhead, 16, and her father, Larry Birkhead, 50, were also seen posing on the red carpet together.Many celebrities native to Kentucky — including self-dubbed 'second best white rapper' Jack Harlow and country singer Carly Pearce — also attended the derby.",
        "The father-daughter Birkhead duo looked radiant as they matched in pastel blue tones with golden yellow accents.The day before, the reality TV star also attended the Barnstable Brown Gala with her father.The model looked dazzling in a halter-style gown featuring a voluminous skirt.The eye-catching dress was adorned with the landscape scene of large golden sunflowers In the foreground of a baby blue sky and crisp, white clouds.The lookalike of her mother — the late model and actress Anna Nicole Smith — styled her blonde tresses with voluptuous curls and a blowout.",
        "She accessorized with a large sunflower pinned in her hair and a chunky, tennis necklace.By her side, Larry donned a handsome, pale blue suit to match her outfit. Paired with the suit, her father sported a white button-up with horizontal blue stripes and a gold satin tie with polkadots.The actor and producer also wore a sunflower brooch in the lapel of his blazer and accessorized with a gold, silk pocket square.",
        "Macy Gray, 55, looked effortlessly stylish in a bright blue, linen set.The Grammy-winning singer donned a quarter-sleeve top with white lace decorating the V-neck style of the tunic.The Fuller House actress also modeled the matching pants with the pant legs cuffed.For a bit of contrast, Gray wore a pair of red Converse sneakers with zipper details and accessorized with reflective, turquoise-colored sunglasses in a round frame.She also sported a pair of dangling cactus earrings, dainty silver bracelets, and a stylish pendant necklace as she posed on the red carpet. Jack Harlow, 25, put on a stylish display in a gray tweed suit worn over a black button-up top.The rapper looked sharp in the double-breasted and double-buttoned blazer with a burgundy trim outlining the lapels.He wore the matching pants with the same oxblood detail running down the sides of the legs and accessorized with a simple pair of diamond earrings. ",
        "Ahead of the event, Rachel Platten, 41, dazzled in a watercolor-inspired pantsuit.The singer and songwriter appeared to be wearing nothing else but a black bralette underneath the stylish blazer with a shiny blue and green design.The Wildfire hitmaker sported a pair of black sandal heels and modeled a wide-brimmed, white hat with an oversized, silk bow.She accessorized with a pair of silver statement earrings and a black, rectangular clutch. Kaitlyn Bristowe, 37, and Jason Tartick, 34, looked like a stylish pair in matching pink ensembles.The television personality put on an elegant display in a sheer, longed-sleeved top decorated with floral embroidery and pearls.The lead on the eleventh season of The Bachelorette teamed the colorful top with a baby pink, tulle miniskirt as well as rose gold platform heels and a pinkish-brown fascinator on her head.Her husband, Jason, donned a bubblegum pink blazer with a magenta tie and cream trousers. The Restart Roadmap author sported a pair of brown, leather dress shoes and a white fedora.",
        "Carly Pearce, 33, was eye-catching in a pastel blue dress with a straight neckline and a flared skirt adorned with ruffled flowers.The country crooner donned a pair of satin blue heels with gold frames on the toe caps and a floral fascinator atop her blonde curls.  ",
        "Chris Harrison, 51, and his wife Lauren Zima, 35, looked bright and cheery in different colorful, floral patterns.The former host of The Bachelor looked stylish in a checkered navy blue suit over a vivid and vibrant button-up.  He sported a white fedora hat with a red and blue ribbon as well as comfortable white sneakers.The senior producer and host at Entertainment Tonight donned a white tea dress with off-shoulder straps and a yellow floral design. She modeled a large white hat with yellow-green and white ribbons. Patrick Mahomes, 27, was also spotted with his wife Brittany in dramatic ensembles as they mixed colors, fabrics, and patterns.The two-time Super Bowl MVP — who had the honor of kickstarting the race this year — donned a pastel purple button-up and a blue polkadot tie. ",
        "He also sported a green and blue checkered blazer and bright cerulean trousers. The Kansas City Chiefs quarterback also rocked a pair of purple sunglasses to match his wife's plunging tweed dress and violet clutch purse.Tricia Helfer, 49, put on an effortlessly stylish display in a sleeveless, high-neck minidress in a bright color to match the red carpet she posed on.The Battlestar Galactica actress also modeled a bold red fedora hat with thin black ribbons to match her pointed-toe stilettos and leather clutch.",
        "The former model styled her blonde, collarbone-length tresses in beach waves and wore a bright pink lip to finish off her look.Smokey Robinson, 83, looked striking in matching red and white colors with his wife, Frances Gladney.The singer and songwriter donned a shiny red blazer and belt with an otherwise all white business casual ensemble.The Miracles frontman sported a pair of rhinestone-encrusted sneakers with a subtle red touch on the back of the shoes.",
        "His wife of over two decades looked lovely in a white pantsuit decorated with red flowers and green leaves.To match Smokey, Frances also donned red sandal heels, dangling statement earrings, and a show-stopping hat. Bill Bellamy, 58, looked debonair in a salmon pink suit at the derby with his longtime partner, Kristen Baker Bellamy.Underneath the blazer, the actor donned a classic white button-up and also modeled crisp, white sneakers.The stand-up comedian shielded his eyes with rectangular-framed sunglasses as his posed next to his wife — who looked ethereal in a colorful, bohemian-inspired minidress.To match the pink details in both his and her outfits, she wore a pair of platform, bubblegum pink heels as well as a beige hat with pink and purple feathers.Randy Travis, 64, and his wife, Mary Davis, also opted for pinks and florals like many of the other attendees at the Kentucky Derby.",
        "The singer and songwriter sported a pink, pinstriped blazer with a white button-up covered in a floral pattern as well as gray trousers.",
        "He accessorized with a white fedora with a black ribbon while Mary donned a chic, black hat.Like Randy, she opted for a vibrant top with a floral-patterned wrap blazer and hot pink slacks.Travis Tritt, 60, looked handsome in a tan, pinstriped suit over a classic black button-down.The country crooner sported dark, leather dress shoes and accessorized with a cream pocket square.  Jerry Mathers, 74, looked dashing in a black blazer with gold buttons over a blue button-down and a colorful tie.For a classic look, the Leave It to Beaver actor also sported tan trousers and black, leather oxford shoes.His wife, Teresa Modnick, donned a black top and paisley-patterned cardigan.The producer donned black dress pants and sandal heels as well as a bowler-style hat adorned with white flowers. ",
        "The Kentucky Derby is held annually at Churchill Downs in Louisville, Kentucky.Multiple galas and events lead up to the highly-anticipated races as well as following the one-day occasion. For the 149th derby, this year's event was held on Saturday in front of a crowd of over 150,000 attendees. After the races between 20 thoroughbred horses, Mage won the famed event as a 15-1 long shot. Angel of Empire, a fan favorite, finished in third place."
    ]
}