{
    "articleURL": "/wires/ap/article-12041087/French-constitutional-body-rules-pension-referendum-call.html",
    "content": [
        "PARIS (AP) - France´s top constitutional body rejected on Wednesday a last-ditch effort by opposition lawmakers to undo President Emmanuel Macron's law to raise the retirement age to 64, deeming that a proposed bill doesn't meet the needed criteria.",
        "It was the second time that the Constitutional Council has rejected the plan to restore the retirement age to 62, notably via a possible referendum or new bill. Had it passed muster, the process called for would be long and wouldn't stop Macron's law from taking effect.The council ruled that the proposed legislation doesn't address a required \"reform regarding social policy ... and therefore judges that it does not satisfy conditions\" set out in the French Constitution.Opposition lawmakers, mainly from the left, wanted to launch a complex process in hopes of rejecting Macron's unpopular pension law that was enacted last month.The Constitutional Council´s role was to assess whether the opposition´s request meets the legal conditions for a potential referendum. Had it been accepted, supporters would have had nine months to collect signatures from at least 4.8 million, or 10%, of French voters.Macron´s government would then have been able to choose between sending the opposition´s text to parliament for debate and eventually a vote, or waiting for six months to put the measure before voters in a referendum. The proposal would only have gone to a national referendum if it weren't debated by lawmakers.",
        "The Constitutional Council rejected a similar proposal in April. The authors revised the measure to add language stating that a change in the financing of France´s pension system is needed.",
        "The process, established in 2015, has never yet led to a referendum.A favorable ruling wouldn't have suspended the law that Macron´s government pushed through by using a special constitutional power to raise the retirement age without a final parliamentary vote.Macron has defended the reform, saying it's needed to keep the pension system afloat as the population ages.The measure has prompted months of street protests from opponents who argue there are other ways to finance the pension system, including via a tax on the wealthy or employers instead.For detractors of the retirement age increase, the battle continues despite the ruling.A new bill aimed at repealing the retirement reform law is to be examined in the National Assembly, the lower house of parliament, on June 8.The leftist CGT union, among those leading more than a dozen nationwide protests against raising the retirement age, said defeating \"this unjust, unjustified and deeply unfair\" law can only come through continued mobilization. It renewed a call Tuesday by the country's main unions for another round of demonstrations and strikes on June 6."
    ]
}