{
    "articleURL": "/wires/ap/article-12058279/Panthers-beat-Maple-Leafs-OT-3-0-series-lead.html",
    "content": [
        "SUNRISE, Fla. (AP) - Sam Reinhart scored 3:02 into overtime and the Florida Panthers beat the Toronto Maple Leafs 3-2 on Sunday night to take a commanding 3-0 lead in their Eastern Conference semifinal series.",
        "Reinhart dumped the puck off the boards behind the net to set up his game-winner, taking a pass back from Anton Lundell and scoring to give Florida its first 3-0 series lead in 27 years.Anthony Duclair and Carter Verhaeghe scored for Florida, and Sergei Bobrovsky stopped 22 shots.Sam Lafferty and Erik Gustafsson scored for Toronto. Joseph Woll stopped 18 of the 21 he faced for the Maple Leafs after he relieved starter Ilya Samsonov, who stopped all eight shots he saw before leaving early in the second period with an injury.Game 4 is Wednesday night.DEVILS 8, HURRICANES 4",
        "NEWARK, N.J. (AP) - Jack Hughes had two goals and two assists to help New Jersey cut their series deficit to 2-1.Nico Hischier and Ondrej Palat each had a goal and an assist, and Timo Meier, Damon Severson, Michael McLeod and Miles Wood also scored for the Devils. Dawson Mercer had three assists, and Jesper Bratt, John Marino and Luke Hughes each added two. Vitek Vanecek returned to the net and made 26 saves.The eight goals were the most for the Devils in a playoff game since they beat Washington 10-4 on April 22, 1988.Carolina set an NHL record, scoring three short-handed goal in the game. Jordan Martinook scored on a penalty shot in the second period with the Canes down a man and Jordan Staal and Seth Jarvis scored 50 seconds apart on the same penalty kill in the third. Sebastian Aho had other goal for the Hurricanes.",
        "Frederik Andersen, who allowed two goals on 48 shots in the first two games of the series, gave up four on 12 shots before being replaced by Pyotr Kochetkov early in the second period. Kochetkov finished with 18 saves.KRAKEN 7, STARS 2SEATTLE (AP) - Jordan Eberle sparked a five-goal outburst in the second period outburst with his fourth goal of the playoffs, Philipp Grubauer made 24 saves and Seattle took a 2-1 series lead in the Western Conference semifinal.Alex Wennberg, Matty Beniers, Eeli Tolvanen and Justin Schultz each had a goal and an assist, and Carson Soucy and Yanni Gourde also scored for the second-year Kraken. Soucy became Seattle's 16th different goal scorer this postseason.Mason Marchment and Jani Hakanpää scored for Dallas. Jake Oettinger had 12 saves on 17 shots and was replaced for the third period by backup Scott Wedgewood, who finished with six saves.Game 4 is Tuesday night.___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}