{
    "articleURL": "/wires/pa/article-12050661/Murder-accused-nurse-stunned-death-alleged-victim.html",
    "content": [
        "Murder-accused nurse Lucy Letby told jurors she was “stunned” at the collapse and death of her first alleged victim.",
        "On Friday, Letby, 33, entered the witness box at Manchester Crown Court to give her second day of evidence.She is on trial accused of the murders of seven babies and the attempted murders of 10 others at the Countess of Chester Hospital.The prosecution says she targeted the infants who were treated on the hospital’s neonatal unit on various dates between June 2015 and June 2016.Her barrister, Ben Myers KC, turned to the first individual allegation against her, that she murdered a prematurely born twin boy shortly after a night shift started on June 8. You never forget something like that  Lucy Letby  Asked how she felt after the death of Child A, Letby said: “Stunned. It was a complete shock to all of us.",
        "“I felt like we had walked through the doors into this awful situation. The first time I had met (Child A), the first time I had met his parents.“It was a huge shock.”Mr Myers said: “It is alleged of course that you did this – did you?”Letby said: “No.Mr Myers said: “What’s it like to have that allegation made?”Letby said: “It’s awful. That day I was not even supposed to be working that night.“It was just a shock to walk into that situation.”",
        "Asked if it had had a lasting impact, she replied: “You never forget something like that.”The Crown says Letby intravenously introduced air into the bloodstream of Child A. I recognised (Child A) to be jittery when I did my observations. It’s an abnormal finding. That is not something you want a baby to be displaying  Lucy Letby  Letby recalled that she assisted a colleague with giving fluids to Child A through an intravenous line.Her workmate left nursery one to write notes up on a computer, she said, as she made standard equipment checks.Mr Myers said: “What was the first indication you had that anything might not be right?”Letby said: “I recognised (Child A) to be jittery when I did my observations. It’s an abnormal finding. That is not something you want a baby to be displaying.”Mr Myers asked: “What happened next?”Letby said: “When I was carrying out my equipment checks around the bedside (Child A’s) monitor sounded. That’s when we noted his colour had changed and he was apnoeic.”She said his hands and feet were white as attempts were made to assist his breathing.Mr Myers asked: “Do you recall how you were feeling as the resuscitation unfolded?”Letby said: “I remember it was a huge, unexpected shock.”",
        "Child A died within 90 minutes of Letby starting her shift, the court heard. I wanted to see the people behind the awful event that had happened. They were on my mind  Lucy Letby  Mr Myers asked why she searched for Child A’s mother on Facebook the next day.Letby replied: “I think it was curiosity. I wanted to see the people behind the awful event that had happened. They were on my mind.“It’s a common pattern of behaviour for me. I think of somebody and I look them up.”Letby is also accused of attempting to murder Child A’s twin sister, Child B, by also administering air into her system.Child B deteriorated in nursery one – the unit’s intensive care room – at about 12.30am on June 10 during a shift which saw Letby designated to care for two babies in nursery three.Mr Myers asked: “Do you recall events leading up to (Child B’s) deterioration?”Letby replied: “Not with any clarity, no.”She said she was in nursery one when she thinks a fellow nurse, who was looking after Child B, alerted her to the deterioration and a colour change.Letby said: “She became quite mottled and dark. All over her body, from memory.“It was like general mottling of a baby. It was not unusual but obviously we were concerned for (Child B) because of (Child A’s) decline the night before.",
        "“(Child A) was pale. He was white. (Child B) had some colour; it was a purple mottling colour.”Letby told the court she was asked to retrieve a camera from a manager’s office to take photographs  but Child B had stabilised by the time she returned.Letby added: “And I got it very quickly.”The defendant also allegedly murdered a baby boy, Child C, with an injection of air via his feeding tube on the night shift of June 13.Child C collapsed in nursery one at about 11.15pm, 15 minutes after he was said to have received his first milk feed, the court has heard.Letby said she was allocated on the shift to care for two infants in nursery three.She said she first became aware of a problem when the nurse who was designated to care for Child C called for help.Mr Myers asked: “Where were you before you were called to help?”Letby said: “I was not in nursery one.”She said she thinks she helped with heart and chest compressions at “certain times” before the youngster died just before 6am the next day. When you get home from work you don’t forget about babies you cared for and what happened  Lucy Letby  Letby denied standing by the cot when alarms sounded at Child C’s cotside.",
        "Mr Myers asked her why she searched Facebook for Child C’s mother about 10 hours after the boy’s death.Letby said: “Because the family were very much on my mind. The first time I had met the parents was during the resuscitation of their son.“When you get home from work you don’t forget about babies you cared for and what happened.”Mr Myers said: “How do you feel about what they had been through?”Letby replied: “What the parents have been through? It’s unimaginable.”She said she had no memory of events surrounding the death of Child D, a baby girl, who she is said to have injected with air.Child D was being cared for by a colleague in nursery one on the night shift of June 21/22, while Letby was allocated two other infants in the same room.Letby, from Hereford, denies all the allegations against her.The trial continues next Thursday."
    ]
}