{
    "articleURL": "/debate/article-12048979/EPHRAIM-HARDCASTLE-Oh-fly-wall-Buckingham-Palace-today.html",
    "content": [
        "Oh to be a fly on the wall at Buckingham Palace as King Charles today lunches the Governor Generals and Prime Ministers of his 14 remaining overseas territories. Half those at the Royal trough plan to de-throne him. Jamaica, the Bahamas, Antigua, St Vincent and Belize all have reviews under way to replace him. Australia is increasingly anti-monarch while New Zealand’s prime minister Chris Hipkins and St Kitts’ PM Terrance Drew make no secret of their republican views. The late Queen was adept at charming those who wanted to abolish her. Has her son inherited that talent?Among rituals practised is the signing of the Coronation Oath with the King’s chosen pen thoroughly road tested. Having to go through the ceremony with stained fingers wouldn’t do anything for HM’s blood pressure. The Queen’s coronation pen was made by the Worshipful Company of Scriveners from ivory, gold, enamel and gemstones. It featured two cherubs representing Charles and Anne. Will the King be immortalising William and Harry on his own implement? ",
        "Andrew Parker Bowles remembers at the last coronation he and his fellow page boys receiving sticks of barley sugar to suck. One of them, Duncan Davidson, managed to cajole Andrew and the others to hand over the treat. ‘He ate it all and then was sick,’ recalls APB. Duncan went on to great wealth as founder of house builder Persimmon. ‘Even in those days,’ remarks Andrew, ‘he was quite commercially minded.’Marriage to Rupert Murdoch may not have been an untrammelled bed of roses for Jerry Hall. According to a Vanity Fair profile describing the couple’s 2020 Covid quarantine at his £20million Bel Air Vineyard Moraga, Rupert kept Jerry busy doing an online course in winemaking. It wasn’t just to slake his thirst – ‘Hall told friends,’ reveals Vanity Fair, ‘that Murdoch wanted her to do it so he could write off $3million of vineyard expenses as long as she worked 500 hours a year on winemaking.’ ",
        "Gyles Brandreth recalls playwright Noel Coward’s remark at the 1953 coronation when asked to identify the diminutive Sultan of Kelantan sitting next to the 6ft 3in Queen Salote of Tonga in the processional carriage. ‘That,’ noted Coward, ‘is her lunch.’ The late Queen heard the quip only afterwards. ‘It made her laugh out loud,’ writes Gyles in The Spectator. Dame Joan Collins recalls her first meeting with King Charles at a charity ball in Palm Beach. ‘We had a little dance together, which was very nice,’ she remembers. Charles also retains pleasant memories, writing: ‘She was very amusing and with an unbelievable cleavage (all raised up and presented as if on a tray!), so eye wander was a problem!’ Sadly, his eyes failed to wander to Joan’s address for the Coronation guest list. She hasn’t been invited. "
    ]
}