{
    "articleURL": "/tvshowbiz/article-12061597/Meg-2-Trench-trailer-finds-Jason-Statham-squaring-against-massive-prehistoric-shark.html",
    "content": [
        "After conquering a massive megalodon shark in 2018's The Meg, Jason Statham's Jonas Taylor returns in the sequel Meg 2: The Trench.",
        "Warner Bros. Pictures has released a new trailer for Meg 2: The Trench, which teams Statham's Jonas with international action star Jing Wu (Wolf Warrior).They head up a research team on a dive to the deepest part of the ocean, though their journey is hampered by a mysterious mining operation.This global team must find a way to survive against multiple megalodon sharks (a.k.a. Megs).The thriller — which also brings back original stars from The Meg such as Sophia Cai and Page Kennedy, along with Sergio Peris-Mencheta (Rambo: Last Blood), Skyler Samuels (The Gifted), and Cliff Curtis (Avatar franchise) -]— hits theaters August 4.",
        "The trailer begins with a brief demonstration of the food chain, with a small insect being eaten by a small lizard... which is in turn eaten by a much larger creature.'For 65 million years one species ruled the world,' a graphic reads, as we see a dinosaur come out of the woods and eat the larger creature... before a massive meg shark leaps out of the water and eats the dinosaur and drags it back into the water.Jonas Taylor (Statham) is seen working out, when a man approaches and says they need his help.'We're detecting increased aquatic activity 25,000 feet deep in the trench,' the voice adds, likely referring to the Mariana Trench, the deepest oceanic trench on Earth.",
        "'It's an ancient ecosystem untouched by man,' the man says, revealed to be Cliff Curtis' James 'Mac' Mackreides, adding, 'Whatever is down there, is trying to make its way to the surface.'The team gears up for their journey, wearing seemingly powerful suits that give the user super-human strength as Jing's character is seen smashing massive cinder blocks.DJ (Page Kennedy) admits, 'this was a bad idea,' as Jonas jokes, 'just a little bit,' as they get out and explore the ocean floor... unaware a massive meg is stalking them.One of the team members is suddenly snatched away when Jing's character states, 'Jonas, we've got company.''That's the biggest meg I've ever seen,' one of the women says, as Taylor adds, 'biggest meg anyone's ever seen,' as the woman calls is, 'the apex predator.'Jonas yells for everyone to get back to the station as we see the meg closing in on them at the station doors.'Three massive megs and who knows what else have escaped the breach,' a woman says, as we see the three huge shark fins approaching a beach town.",
        "The woman adds, 'I just hope it goes better than last time,' as the meg is seen destroying a dock as Taylor runs away.The team is trying to clear the beach town as Taylor notices, 'they're hunting in packs' as we see a couple in a paddleboat getting eaten.",
        "The trailer — set to Heart's Baracuda — winds down with a huge tentacled creature grabbing onto a helicopter as Jing's character dives out before it crashes.The final shot shows Taylor trying to evade the meg on a jetski as a meg leaps out of the water as the trailer comes to an end. "
    ]
}