{
    "articleURL": "/wires/ap/article-12046215/Volkswagen-sees-sales-slump-China-vows-rebound-year.html",
    "content": [
        "FRANKFURT, Germany (AP) - Volkswagen profits fell 30% in the first three months of the year despite booming business in Europe and North America because sales dropped in China, where the German automaker is facing increasing competition from homegrown models.",
        "After-tax profit fell to 4.7 billion euros ($5.2 billion) from 6.7 billion euros in the first quarter of last year, the Wolfsburg-based company said Thursday.The number of vehicles sold rose 7.5%, to 2.04 million. Revenue jumped by 21.5%, to 76.2 billion euros, as VW saw strong demand and increased pricing power - meaning the willingness of customers to shell out more for its cars.However, the company sold 14.5% fewer vehicles in China, the world's largest car market, where competitors such as BYD are rapidly developing new electric and hybrid vehicles at competitive price points and competing with foreign brands.BYD Auto, owned by battery maker BYD Co., edged ahead of Tesla in total 2022 sales at 1.9 million vehicles. Half were gasoline-electric hybrids, while Tesla´s fleet is pure electric.Volkswagen said it was \"confident\" that an expanded model range and more China-specific technological features would mean deliveries to the country would \"recover during the remainder of the year.\"",
        "The company said it plans to invest 1 billion euros in a new center for electric car innovation headquartered in the Chinese city of Hefei.VW said it was systematically pushing ahead with its move into electric vehicles, selling 141,000 battery-only cars during the quarter, or about 7% of total deliveries.",
        "It confirmed its profit outlook for the year and said strong demand for its products was reflected in an order book of 1.8 million vehicles in Europe, including 260,000 battery-electric vehicles.The January-to-March quarter was burdened by a non-cash charge of 1.3 billion euros from Volkswagen hedging its purchases of raw materials, while hedges offered a boost to the tune of 3.2 billion euros in the same period a year ago."
    ]
}