{
    "articleURL": "/wires/reuters/article-12050425/Biggest-issues-Canadian-province-Albertas-May-29-election.html",
    "content": [
        "May 5 (Reuters) - Voters in Alberta, Canada's main oil-producing province, will go to the polls on May 29 to elect a new government, in what is expected to be a tight race pitting Premier Danielle Smith's ruling United Conservative Party (UCP) against Rachel Notley's New Democratic Party (NDP).",
        "Below are the main issues in the election:HEALTHCAREIn the wake of the COVID-19 pandemic, healthcare has become a big issue in Alberta.The province faces a doctor shortage, particularly in rural areas, and a 2022 survey by the Fraser Institute think-tank showed Albertans face a median wait of 33.3 weeks between seeing a general practitioner and receiving treatment, 5.9 weeks longer than the Canadian average.The NDP has made healthcare the focus of the left-leaning party's campaign, promising access to a family doctor for all Albertans within a day or two and decreased pressure on hospitals and emergency rooms.The UCP last month committed to keeping Alberta's publicly-funded healthcare system, contrasting with comments previously made by Smith about dismantling universal healthcare paid for by taxpayers.AFFORDABILITYAlberta's annual inflation rate in March was 3.3%, the lowest of the 10 provinces, thanks to a drop in energy prices. But Albertans, like other Canadians, are feeling the pinch from a higher cost of living.The UCP has pledged to lower taxes by creating a new 8% tax bracket on income under C$60,000 ($44,033.47). Smith's government also promised legislation ensuring no future government can increase personal or business taxes without first getting approval from Albertans in a referendum.The NDP said it will not raise personal income taxes and plans to create affordable housing for 40,000 Albertans over the next five years.",
        "ENERGY AND CLIMATEBoth the UCP and NDP are supportive of the energy sector, recognising it as Alberta's main economic engine.The UCP released the province's first-ever climate plan last month. The plan targets net-zero emissions by 2050, but does not have interim emissions-reduction targets and was criticized by climate think-tanks as lacking details.The NDP is also targeting a net-zero economy by 2050 and a net-zero electricity grid by 2035.TRUST IN LEADERSSmith, a right-wing populist, has been dogged by a string of controversies since becoming UCP leader and premier in October and walked back a number of policy proposals that turned out to be unpopular or unworkable, such as pardoning people convicted under COVID-19 public health laws.The NDP is keen to paint the premier as untrustworthy and capitalise on polling showing voters like Notley more than Smith.The UCP says Notley, whose term as premier from 2015-2019 coincided with a slump in oil prices and an economic downturn, is a threat to the energy sector, and portrays her as an ally of Liberal Prime Minister Justin Trudeau, a much-maligned figure in Alberta. ($1 = 1.3626 Canadian dollars) (Reporting by Nia Williams; Editing by Paul Simao)"
    ]
}