{
    "articleURL": "/wires/ap/article-12053165/Kepler-hits-two-run-homer-Twins-blank-Guardians-2-0.html",
    "content": [
        "CLEVELAND (AP) - Max Kepler hit a two-run homer and Bailey Ober pitched seven innings in a combined three-hitter, sending the Minnesota Twins to a 2-0 victory over the Cleveland Guardians on Friday night.",
        "Ober (2-0) gave up three hits and a walk while striking out six, lowering his season ERA to 0.98 over three starts. Jorge López worked a clean eighth and Jhoan Duran pitched the ninth for his seventh save.\"I felt pretty good in the bullpen and I was calm after I got done with the first inning,\" said Ober, a 6-foot-9 right-hander. \"I carried the confidence in there and was able to keep it going the rest of the game.\"Cleveland starter Peyton Battenfield (0-3) did not allow a baserunner until Christian Vázquez singled with two outs in the sixth. Kepler followed with a 440-foot blast to right field, driving in the only runs of the ballgame.The Twins have homered in a franchise-record 17 consecutive games. Kepler has 15 home runs at Progressive Field since 2016, the most by a visiting player.\"I feel like I´ve seen every one of them,\" Guardians manager Terry Francona said. \"I think I have. Kepler is very dangerous when you leave something over the plate.\"",
        "Cleveland´s best scoring opportunity came in the seventh when Oscar Gonzalez reached on an infield single with two outs, but José Ramírez was thrown out at the plate trying to advance. The Guardians have been blanked four times.Battenfield worked a season-high seven innings, giving up two hits, in his fifth big-league appearance. The righty struck out seven without issuing a walk, only permitting two hard-hit balls to Vázquez and Kepler.",
        "\"I thought I threw the ball really well,\" Battenfield said. \"Obviously (a perfect game) is in the back of your head, but I was just focused on the glove and driving the ball to the glove tonight.\"Byron Buxton of the Twins went 0 for 3 with three strikeouts, ending his eight-game hitting streak. He also had reached base multiple times in a career-high six straight.Minnesota leads the AL Central by 4 1/2 games over the Guardians, who have lost nine of their last 13 and are a season-low four games below .500. The teams will meet 12 more times this season.\"Kep had a big swing and Bailey´s outing is all you need when a guy can take over the game like he did,\" Twins manager Rocco Baldelli said. \"Bailey is in great form right now. We didn´t want to take our eyes off him in the dugout.\"The game featured six total hits and was played in 2 hours and 11 minutes.DOWN ON THE FARMGuardians RHP Zach Plesac was optioned to Triple-A Columbus, but Francona said the four-year veteran is not out of their plans. The nephew of former big leaguer Dan Plesac went 1-1 with a 7.59 ERA in five starts, allowing opponents to hit .374.",
        "\"Whether it´s the stress or the emotion of the game, there has been less command this season with Zach,\" Francona said.TRAINER´S ROOMTwins: LHP Caleb Thielbar (right oblique strain) was placed on the 15-day injured list with discomfort that surfaced Wednesday. \"He doesn´t know when he did it, but it doesn´t look like a long-term issue,\" Baldelli said.Guardians: LHP Sam Hentges (left shoulder inflammation) was activated from the 15-day IL. Valuable reliever Hentges posted a 1.93 ERA over five rehab appearances with Triple-A Columbus and Double-A Akron.UP NEXTTwins RHP Sonny Gray (4-0, 0.77 ERA) takes on Guardians LHP Logan Allen (1-1, 2.45 ERA) in the second game of the three-game series. Gray tied the franchise record for the lowest ERA in March/April, allowing three runs in 35 innings.___ More AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}