{
    "articleURL": "/wires/reuters/article-12043061/Greece-warned-shipowners-days-Iran-seized-tankers--sources.html",
    "content": [
        "By Jonathan Saul and Lefteris Papadimas",
        "ATHENS, May 3 (Reuters) - Greece issued a series of warnings to shipowners to avoid sailing close to Iranian waters days before Tehran seized two tankers amid heightening tensions in the region, according to documents and industry sources.Iran seized a second oil tanker in a week on Wednesday in Gulf waters, the U.S. Navy said, the latest escalation in a series of seizures or attacks on commercial vessels in Gulf waters since 2019.The incident comes after Iran on April 27 seized a Marshall Islands-flagged oil tanker in the Gulf of Oman, which is being held by authorities in the Iranian port of Bandar Abbas.Greece is home to many of the world's leading ship owners, managers and the broader maritime services industry.\"Due to recent Iranian threats of possible retaliation against Greek shipping, we strongly recommend the navigation in the above area as well as in the Straits of Hormuz and the Gulf of Oman to be carried out, if possible, outside the waters under Iran's jurisdiction, and under increased caution when sailing near the above areas,\" Greece's shipping ministry said in an advisory dated April 20 seen by Reuters.Greek government officials did not immediately respond to a request for comment.One industry source with knowledge of the situation said shipping companies were advised to leave the area close to Iran.",
        "\"Greece has issued a couple of informal warnings for the seafarers in the area a few weeks ago,\" a Greek shipping industry official with knowledge of the issue told Reuters separately.The official added that other Greek tankers were \"moving away from the area\" without providing more details.Data from analytics company MarineTraffic showed the number of tankers that left Gulf countries near to Iran reached 107 vessels and an additional 36 LNG carriers in the April 19-26 period versus 60 tankers and 26 carriers in the April 27-May 3 period.About a fifth of the world's crude oil and oil products passes through the Strait of Hormuz, a narrow choke point between Iran and Oman, according to data from analytics firm Vortexa.Maritime security company Ambrey said following the initial warning by Greece's shipping ministry, it \"observed the exodus of an unusually high number of Greek-flagged vessels from the Gulf region\".\"Ambrey assess the risk to merchant shipping was not limited to the flag-state but to the affiliations with Greece and the U.S.\"Washington has seized a cargo of Iranian oil in recent weeks aboard a tanker managed by a Greek company. (Reporting by Jonathan Saul in London and Eleftherios Papadimas in Athens; Editing by Nick Macfie)"
    ]
}