{
    "articleURL": "/news/article-12060257/Memorial-appears-two-control-dogs-shot-dead-police-woman-mauled-London.html",
    "content": [
        "WARNING: GRAPHIC CONTENTMemorial has appeared for two dogs shot by police in Limehouse, London READ MORE: Footage shows the moment Met Police shoot and kill two dogsA makeshift memorial has appeared for two 'out of control dogs' that were shot dead by police officers after a woman was mauled in a horrifying attack.",
        "Videos posted on social media by horrified witnesses show a group of police officers following a man with two barking dogs on short leads along a canal in Limehouse, east London yesterday.Officers were seen in a heated row with the man as he continued to hold on to his dogs and attempt to calm them down.The situation quickly became escalated with one of the black dogs being shot dead, while the screaming owner was then tasered and pinned to the ground.The second dog was subsequently shot dead as screaming witnesses looked down at the scene from balconies of surrounding flat blocks.",
        "A bunch of flowers in a red bow and a handwritten sign have since been left against a wall at the scene. The sign reads: 'In memory of two beloved dogs who were tragically shot by the Metropolitan Police on May 7th '23'.",
        "The London police force defended its actions explaining that the officers had 'a duty to act where necessary before any further injury was caused'.One woman, filming from a window on the opposite side of the canal, can be heard repeatedly saying 'oh my god' before shouting 'are you okay' to the man after gunshots were fired.Somebody who filmed the scene said: 'This stopped me in my tracks and is very upsetting.",
        "'There had to be a way of containing these the dogs instead of shooting them.'The chaotic scene saw groups of people head out to their balconies and rooftops to see what was causing the commotion.The Met said they were forced to act swiftly because 'the aggressive behaviour of two dogs was of considerable concern'.Officers had been called to the scene following reports of a woman being attacked by the dog on Commercial Road in Tower Hamlets.The dogs were said to be 'of considerable concern' and posed a 'significant threat to' officers who attended the scene.No one was taken to hospital as a result of the attack, but a man was arrested in connection with having a dangerously out of control dog.A 25-year-old woman who witnessed the situation unfold told the Mirror: 'It didn't seem proportionate. It is beyond belief.'It was so shocking. I didn't realise it was a proper gun until the dogs were just lying completely out on the ground. There was blood coming out of them.'I've never seen anything like that. You hear of these things happening in America but not here. Whatever had happened, it's not an excuse for it to end like that.'In a statement, the Met said: 'Police were called just after 5pm on Sunday May 7 to a woman being attacked by a dog in Commercial Road, E14.",
        "'Officers attended the location where the aggressive behaviour of two dogs was of considerable concern and posed a significant threat to them.'A man was arrested in connection with the incident for having a dog dangerously out of control and assault offences. He has been taken into police custody.'A Taser was discharged by police.'",
        "The statement continued: 'No person was taken to hospital.'Both dogs were destroyed by police at the scene.'This is never an easy decision for any officer to take, but police have a duty to act where necessary before any further injury is caused.'The Met's Directorate of Professional Standards will review the circumstances of the incident.'"
    ]
}