{
    "articleURL": "/wires/reuters/article-12042253/Texas-authorities-arrest-people-helped-fugitive-hide.html",
    "content": [
        "May 3 (Reuters) -",
        "Texas authorities have arrested several people who may have helped a man suspected of killing five neighbors evade a manhunt for four days, a local deputy sheriff said on Wednesday, a day after the suspect's capture.The bloodshed erupted on Friday in Cleveland, Texas, after neighbors asked the suspect to stop firing his semiautomatic rifle in his yard because it was keeping their baby awake. Instead, the man reloaded, entered the home of the neighbors and killed five, including an 8-year-old boy, officials said.San Jacinto County Chief Deputy Tim Kean at a news conference on Wednesday said several additional arrests have been made but did not go into details on their involvement in the crime or the search for the suspect.\"Anybody that helped this maniac definitely has some issues as far as I am concerned,\" Kean said.The suspect, identified as 38-year-old Francisco Oropesa, was apprehended on Tuesday after a four-day manhunt conducted by local, state and federal officials. He was found in a closet under some laundry in a home in nearby Montgomery County.A $5 million bond will be set for the suspected gunman when he appears later Wednesday before a judge in a local jail where he is being held on five counts of murder, Kean said.",
        "The suspect was arrested in the town of Cut and Shoot, Texas, roughly 17 miles (27 km) west of Cleveland, where the shootings took place. Both are about 50 miles (80 km) north of Houston.Officials acted on a tip from an unidentified person who was eligible for an $80,000 reward offered for information leading to the arrest, San Jacinto County Sheriff Greg Capers said on Tuesday.Most of the victims were shot in the head. All were from Honduras and among the 10 people living at the address, but they were not all family members, Capers said.The suspect is a Mexican national who immigration officials said had been deported from the United States four times since 2009. (Reporting by Brendan O'Brien in Chicago; Editing by Mark Porter)"
    ]
}