{
    "articleURL": "/news/article-12040009/Seattle-man-dies-climbing-Mount-Everest.html",
    "content": [
        "Former doctor Jonathan Sugarman died on Mount Everest's Camp 2 on MondaySugarman leaves behind his wife, Terese Sullivan, and his daughter, Maya A retired Seattle doctor who died while climbing Mount Everest on Monday could not be airlifted down the mountain due to the current bad weather.",
        "Jonathan Sugarman, 69, died at Camp 2 while on an expedition arranged by Washington state-based International Mountain Guides.An official at the base camp said he died during his acclimatization rotation, which are designed to gradually expose the body to higher altitudes before returning to a lower, more comfortable altitude.He added: 'Rescuers are trying to bring down his body to the base camp, which will then be flown to Kathmandu for autopsy.'The University of Washington said on Twitter that Sugarman was a clinical faculty member known for his work in Native American health care and international health. ",
        "Eric Simonson, CEO of International Mountain Guides, confirmed the death of Sugarman in a post on their website: 'It is with deep sorrow that IMG reports the death of one of our Everest 2023 team members at Camp 2.He stressed that Sugarman's tragic death was not due to an accident or conditions that could affect other teams. The mountaineer was on an acclimatization rotation at around 6,400 meters when he died on Monday.A guide said the man, who has not been named, had been taken unwell and died at Camp 2, around 2,400-meters below the 8,849-meter summit. According to Outside, Sugarman had arrived in the Khumbu valley in early April and reached base camp on 10 April. ",
        "The group trained for a week before starting acclimatization hikes to get used to the altitude. Sugarman and the other IMG expedition climbers began moving up the mountain on April 29, according to expedition posts on the International Mountain Guides site.Sugarman previously attempted the mountain in 2016 but came down with high-altitude pulmonary edema at Camp 1. He tried again in 2022 with 'a good fitness base' from his work with an outdoor-athlete-focused coach. Despite injuries, Sugarman went on to reach Camp 3.Publication UphillAthlete, who worked with Sugarman, said he was a 'good, earnest guy' who was 'humble and... really cared about the Sherpa people'. ",
        "A statement from the American Embassy in Kathmandu, Nepal read: 'Dr. Jonathan Sugarman passed away while climbing Mt. Everest Monday May 1. 'Our deepest sympathies go out to his family and friends. The embassy is in contact with Dr. Sugarman's family and with local authorities.'Sugarman's tragic death is the fourth on the world's tallest mountain this year, and the first American fatality, per Outside.Three Sherpa climbers died after falling into a deep crevasse on a treacherous section of Mount Everest just above the base camp in April.Hundreds of foreign climbers and a similar number of Nepalese guides and helpers were expected to try to scale the 8,849-meter (29,032-foot) mountain during the main climbing season that began in March and ends in late May.",
        "Sugarman leaves behind his wife, Terese Sullivan, and his daughter Maya Sugarman."
    ]
}