{
    "articleURL": "/sport/nba/article-12044777/Brittney-Griner-claims-fame-overwhelming-says-dope-meet-Usher-Met-Gala.html",
    "content": [
        "Brittney Griner attended the Met Gala Monday night with her wife CherelleJust days earlier, she had attended the White House Correspondents' DinnerDailyMail.com provides all the latest international sports newsWNBA star Brittney Griner claimed her newfound fame can be 'a little overwhelming' after she attended the 2023 Met Gala Monday, five months on from her release from a Russian Penal Colony. ",
        "The 6-foot-9 center looked chic on the famous steps of the Metropolitan Museum of Art in New York City as she attended fashion's biggest night of the year with her wife Cherelle Monday. Just days earlier, she had attended the White House Correspondents' Dinner in Washington D.C. on Saturday night. Her appearance at the events came almost five months after her release in prisoner swap that allowed arms dealer Viktor Bout to return to his native Russia on December 8. Since being arrested at an airport outside Moscow with what Russian security claimed were cartridges of hash oil, Griner has become a household name and she claimed her newfound celebrity can be exhausting at times. ",
        "However, she insisted that being invited to the Met Gala, where she was dress by Calvin Klein, was an honor as she enthused about meeting singer Usher and former NBA star Dwyane Wade. 'It was an honor to be there,' Griner said. 'It was magical, just meeting everybody, seeing all the stars that were there was, I mean, it was pretty dope.'She reportedly flew home from Washington late Saturday night and didn't land in Arizona until 4am. She then went home and slept until 9am, before heading to the Mercury's first training camp practice just two hours later.",
        "The center then jetted back east to New York City and flew back Monday night immediately after the Met Gala, landing in Arizona at 1am so that she could attend practice again Tuesday. Speaking at the Mercury's media day Wednesday, she joked that she needed a big nap following her 'whirlwind' weekend. 'It's been a whirlwind,' Griner said. 'I have a lot of respect for the stars that do that. That is not me. I don't see how they do it but it was amazing. 'I mean, like I said, two big honors to be able to go and be there, but it was a long couple days. I'm taking a big nap tonight or today.'",
        "While her new schedule can prove to be 'crazy,' Griner pledged to use her 'bigger' platform for good. 'I didn't think it could get that big, but I mean it's cool because now I'm able to reach even more people and bring them into the WNBA and then also keep them aware of other detainees that are still left behind right now and that we're trying to get home,' Griner said. 'So, just using that bigger outlet to continue to support others that are in need or don't have the spotlight or the media coverage that they should be able to get.' ",
        "Griner flew private to both the White House Correspondents Dinner and the Met Gala and there is a concern she may need to also do so when traveling for games during the upcoming WNBA season. However, while Griner's need stems from security concerns, she insisted she hoped it could be the same for the entirety of the league. When asked if she felt comfortable flying commercial, she replied: 'The being comfortable part, it's just weird. ",
        "'It's just always different experiences that make you feel different, but the league's doing a good job. They're helping out in different ways and the Mercury, they're going to make sure I'm in the best position where I have support and everything will be good.'But definitely would love to make all those flights private. That would be nice, not just for me and my team, but for the whole league. We all deserve it. We work so hard. We do so much and it would be nice when we finally get to that point where we're rewarded on that end, too.'In March 2022, the WNBA fined the New York Liberty $500,000 for secretly using charter flights during the 2021 season in violation of the league's collective-bargaining agreement. The WNBA's reliance on commercial flights, as opposed to charters, has been a major point of contention between players and the league. "
    ]
}