{
    "articleURL": "/wires/reuters/article-12040515/MORNING-BID-EUROPE-Deja-vu-Powell-bank-debt-fears-revive.html",
    "content": [
        "A look at the day ahead in European and global markets from Ankur Banerjee",
        "For the second time this year, Fed Chair Jerome Powell will take the stage in the wake of a bank failure (that's three in the US for those keeping count: SVB, Signature Bank and First Republic) and as worries over the financial system resurface.Amid so much uncertainty, markets are hopeful that the Fed's current tightening cycle will soon be over.The collapse of First Republic Bank, the largest U.S. bank failure since the 2008 financial crisis, has brought back much of the jitters that gripped the market in March - the last time the Fed met and raised interest rates by 25 bps. Shares of regional banks were pulverised on Tuesday and sentiment will likely be weak through the week.Also on the minds of investors is the looming deadline for U.S. debt ceiling, with Powell likely to be asked about his contingencies.With all that in mind, investors have been risk averse, with gold loitering above the key $2,000 level. Trading has been thin due to holidays in China and Japan. Futures indicate European stocks are likely to open higher but whether the gains will hold remains to be seen.And that brings us back to Powell and what he is likely to say after delivering an expected 25 basis point increase in interest rates. Investors will be keen to parse through his comments to see if there are cuts likely this year as well as the state of the financial system.",
        "But as the Reserve Bank of Australia showed us earlier this week, central banks are still capable of surprising the market.Speaking of surprises, short seller Hindenburg Research took aim at Icahn Enterprises LP over the reporting of its finances, leading to a 20% drop in the shares of activist investor Carl Icahn's firm.Meanwhile, Advanced Micro Devices shares slid after the chipmaker forecast quarterly sales below estimates due to a weak PC market, overshadowing the company's optimism that the chip market would start to recover in the second half of 2023.Earnings from chip designer Qualcomm later in the day will provide more clues about where the chip market is headed.A sharp recovery in its business in China helped Starbucks beat earnings estimates, highlighting the importance of China's reopening for some consumer companies.Key developments that could influence markets on Wednesday:Economic events: Euro zone March unemployment rate, Italy March unemployment rateEarnings: Airbus, Lufthansa, BNP Paribas, Porsche and Qualcomm(Reporting by Ankur Banerjee in Singapore; Editing by Jacqueline Wong)"
    ]
}