{
    "articleURL": "/wires/pa/article-12051887/Coronation-biggest-ceremonial-military-operation-Churchill-s-funeral.html",
    "content": [
        "The King’s coronation will involve Britain’s biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965, according to the army officer in charge of logistics.",
        "Brigadier Patrick Reehal is responsible for coordinating thousands of armed forces personnel involved in the ceremony, and ensuring their access to transport and food provision runs smoothly throughout.As part of a family with military lineage dating back more than 150 years, he is being assisted by his brother, Lieutenant Colonel Ben Reehal, who serves as the commanding officer of 27 Regiment Royal Logistic Corps. This plan is on a scale not seen since the state funeral of Sir Winston Churchill in 1965  Brigadier Patrick Reehal  Meanwhile, his son, Marine Patch Reehal, is part of the marching contingent.Brig Patrick, a commander normally based in Aldershot, Hampshire, said that on an average day preparing for the coronation he oversees the movement of thousands of personnel and the serving of more than 30,000 meals.“This plan is on a scale not seen since the state funeral of Sir Winston Churchill in 1965,” he said.",
        "During rehearsals so far, 122,445 meals have been served, 81,630 eggs and 74,130 sausages cooked, and 81,630 litres of bottled water have been issued, according to the Ministry of Defence (MoD).",
        "Combined distance in kilometres those in the procession will have marched",
        "The organisation has also involved 1,700 tailoring alterations, 3,000 bags of laundry, and 900 haircuts – while those in the procession will have marched a combined distance of 122,445km – or three times around the world.",
        "Brig Patrick described his family as “a small part of a big team” comprising the armed forces, civil servants, contractors, coach drivers, chefs, kitchen staff, barbers, tailors, cleaners, medics and security teams.“This is a genuine military and civilian combined national effort,” he said.“For myself, Ben and my son it’s a moment of intense pride. It’s a privilege to be a part of His Majesty’s coronation alongside my dad and uncle  Marine Patch Reehal  “We have a very strong military family tradition, so this really is very special for us, as it was for our ancestors, to honour our sovereign, our commander-in-chief, and make the United Kingdom proud.”His son added that Saturday will be “a very proud moment” for their family.Marine Patch Reehal said: “It’s a privilege to be a part of His Majesty’s coronation alongside my dad and uncle.”"
    ]
}