{
    "articleURL": "/news/article-12056441/Horror-house-siege-Coronation-Day-Armed-cops-storm-home-shoot-gunman-holding-woman-hostage.html",
    "content": [
        "Officers were called to a terraced house in Priory Road, Dartford, yesterdayWitnesses recalled hearing two rounds of gunshots following a standoff Armed cops yesterday stormed a home where they found a 'gunman' who was holding a woman hostage while millions of people around the world celebrated the Coronation of King Charles and Queen Camilla.",
        "Officers were called to a terraced house in Priory Road, Dartford, Kent, on Saturday afternoon on a day in which around 11,500 cops were deployed in the capital for the King's crowning at Westminster Abbey.Witnesses who lived nearby said a woman had been 'held hostage' at the back of the property. Kent Police said a man and a woman suffered serious injuries consistent with gunshot wounds and were taken to a London hospital. No police weapons were discharged.Officers and a trained negotiator went into the house at 12.40pm, just moments after Charles and Camilla were crowned, after receiving reports of a 'disturbance' and attempted to 'engage with a man' there. ",
        "Witnesses described how police cordoned off the road and ordered people to stay inside their homes, before officers broke through the front door. After an hour-long stand-off, 'pandemonium' broke out and neighbours heard what they described as sounding like two rounds of gunshots. The house remained cordoned off and forensics teams could be seen entering the property late on Saturday evening. A spokesperson for Kent Police said: 'Kent Police was called to a report of a disturbance at a property in Priory Road, Dartford, at 12.40pm on Saturday May 6. 'Officers, along with a trained police negotiator, attended and attempted to engage with a man inside the address. ",
        "'Whilst they were at the scene, a man and a woman suffered serious injuries consistent with gunshot wounds and were taken to a London hospital where they remain in a serious condition. 'Patrols remain in the area and enquiries are ongoing to determine the circumstances and how the injuries were sustained.' The force has made a mandatory referral to the Independent Office for Police Conduct due to police being at the scene at the time of the injuries. ",
        "One woman, who wished not to be named, described the scene as 'chilling'. She said: 'I was in the house and my husband and two girls were out - they couldn't get back home. 'I went out and was told 'get back - you must stay indoors'. 'I went to the garden where I could see more.' About an hour after police entered the property, she said she heard gunshots before a person was carried out on a stretcher. 'It was pandemonium,' she said. 'I heard five gunshots - a pause and then another five.' The IOPC confirmed it had received a referral from Kent Police, adding: 'We are assessing the available information to determine if any future action is required from us.'"
    ]
}