{
    "articleURL": "/sport/cricket/article-12047739/Ollie-Robinson-gives-Steve-Smith-pre-Ashes-warning-takes-seven-59-against-Worcestershire.html",
    "content": [
        "Ollie Robinson put Sussex in control on day one of their clash vs WorcestershireThe England seamer took seven for 59 as the hosts were bowled out for 264  Steve Smith watched the spell from second slip in his first game for SussexSteve Smith had the perfect view of the threat Ollie Robinson will present to Australia’s hopes of retaining the Ashes.",
        "Smith, on the first day of his brief stint at Sussex, stood at second slip as Robinson produced an outstanding display of seam bowling to take seven for 59 from 17 probing overs in Worcestershire’s 264 all out.Robinson was a class above any other bowler and gave his new team-mate Smith a glimpse of what to expect when they lock horns at Edgbaston on June 16.And the Ashes rivals joined forces to claim Worcestershire’s ninth wicket, Smith holding a sharp chance to give Robinson his sixth victim and end Joe Leach’s belligerent run-a-ball 53.Robinson, who has had a cortisone injection in his back ahead of what is expected to be three consecutive matches for Sussex, was quickly in the groove after Cheteshwar Pujara won the toss on a sunny morning.",
        "Smith’s first innings in Division Two will have to wait until today but the crowd were instead treated to the sight of Robinson rapidly taking the first four wickets as Worcestershire crashed to 44 for five.Sussex were held up by 59 from Adam Hose and then a Bazball-like eighth wicket stand of 103 in 14 overs between Leach and Matthew Waite (59 off 54 balls) before Robinson cleaned up the tail. Sussex reached 63 for one in reply.",
        "‘I was probably at about 80 per cent,’ said Robinson. ‘I didn’t get it right early on but the wicket was helpful and when I did get it right they nicked it. I’m trying to bowl as many overs as possible and peak for the Ashes.’Meanwhile, Jonny Bairstow marked his first competitive match in nine months with a stunning one-handed grab among three catches behind the wicket for Yorkshire.Aussie Marnus Labuschagne made 65 before also falling to the George Hill-Bairstow combination. Bairstow was forced to bat late on because of a Yorkshire collapse, with two nightwatchmen falling as they closed on 62 for five."
    ]
}