{
    "articleURL": "/wires/pa/article-12052715/Frank-Lampard-insists-Chelsea-s-new-signings-need-time.html",
    "content": [
        "Chelsea’s new recruits have not been given the opportunity to find the connections necessary to build a winning team, according to Frank Lampard.",
        "The Blues looked incoherent and without a plan in losing meekly 3-1 to Arsenal on Tuesday, a sixth straight loss on a run that has seen them sink to 12th in the Premier League table.Several of the players who were signed in January have failed to make a significant impact, with Mykhailo Mudryk and Noni Madueke in particular big-money buys that have shown only flashes of their talent.Madueke at least netted his first goal for the club in the loss at the Emirates, something Mudryk, who cost £88million despite only having made 44 first-team appearances for Shakhtar Donetsk, is yet to achieve.There has been little consistency in the starting XI, something that was apparent under former boss Graham Potter and has continued into Lampard’s dire interim spell.It has made an unbalanced squad, loaded up on creative talent but with no one to score goals, look even more disjointed on the pitch, with little apparent chemistry. They have scored only twice in their last eight games.Chelsea will drop below Bournemouth should they lose to Gary O’Neil’s side at the Vitality Stadium on Saturday, despite the fact their opponents have spent most of the season battling relegation and were in the bottom three at the start of April.",
        "“The numbers show you we’re the team that changes its XI the most,” said Lampard. “Coming in at this point for me, it’s trying to find the connections and partnerships in the team which are crucial as we all know.",
        "“The great teams we’ve witnessed over the years, you can pretty much always name connections. Full-backs; Liverpool off the top of my head, the full-backs are absolutely central to what they do.“When you’re trying to find that, it’s difficult, and I think it’s important to know that when we’re in a bad run and those things are not settled, it’s very hard to get consistency of what you want.“You end up searching for it, and that’s probably why people call it a transition. That’s a challenge. In my position as much as we want results, because results will get thrown in your face, we also need to try and find those little connections within the team going forward.“Some of the younger players that have come into the club have maybe not had the opportunity to settle, to feel comfortable within the team, to understand the full-backs are going to overlap them, or the midfield players are going to support them. In my position as much as we want results, because results will get thrown in your face, we also need to try and find those little connections within the team going forward  Frank Lampard  ",
        "“That is a process, and that needs work. It’s probably work I haven’t been able to do in this role as interim. It feels less in practice about coaching to that degree.”Lampard defended Raheem Sterling despite the England forward’s form having totally deserted him during Chelsea’s slide.Sterling, who was the first signing of the club’s whirlwind recruitment drive this season, has not replicated the performances that saw him score 131 goals in seven seasons at Manchester City, en route to winning four Premier League titles and becoming a lynchpin of Gareth Southgate’s national team.He has managed only four league goals since arriving at Stamford Bridge in July.“I’ve spent the last three years talking to all my younger wingers that I work with, showing them videos of Raheem Sterling arriving at the back post, doing defensively the work he does,” said Lampard.",
        "“You absolutely cannot take that away from him, what he’s done, for Manchester City and England.“When you move club, even though everyone on the outside goes ‘oh what hard work that is, moving from Man City to Chelsea, what a terrible situation’, it does bring around changes in your life.“Of course maybe the form of the team this season has not been great, so there can always be a lot of contributing factors to individual form.",
        "“He’s got credit in the bank. Keep working, things around him falling more into place, I think with Raheem he’ll show what he’s shown in his career.“We have a lot of understandable reasons and stories within the squad, the newer younger players, some players who will be moving on. There are a lot of those reasons.”"
    ]
}