{
    "articleURL": "/femail/article-12054653/Prince-Harry-attended-Kings-coronation-three-piece-suit-Dior.html",
    "content": [
        "Dior revealed it dressed the Montecito-based royal for his father's Coronation  READ MORE: King Charles' Coronation LIVE blogDior has revealed they dressed Prince Harry for King Charles' coronation - as the royal forwent wearing a military uniform. ",
        "The Duke of Sussex, 38, wore a designer suit for today's event, which he watched from the third row, while the senior members of the royal family wore their military garments. The French fashion house revealed on their social media channels that they had the 'honour' to dress the royal for the event, adding he was wearing a custom design by Kim Jones, Dior Men's Artistic Director. Harry, who left swiftly after his father's coronation for Heathrow, where he caught a flight home to California, still wore his honours pinned to the suit. After his father's coronation, Harry left Westminster Abbey and got straight into a car that immediately left London and headed to the airport.",
        "Shortly after the coronation ceremony, Dior took to its social media to reveal Kim Jones was the designer behind the father-of-two's suit. 'Tailoring fit for royalty. Dior is honored to have dressed Prince Harry, Duke of Sussex, for the coronation of King Charles III in a custom design by Kim Jones,' the brand wrote on social media. 'Seen arriving at Westminster Abbey, gain an insight into the savoir-faire of his three-piece suit next,' it added. The three-piece suit consisted of a morning coat, a black vest, which Harry wore with a crisp white shirt and a pearl grey tie.  ",
        "Royal commentators had speculated about whether the royal would wear a military uniform - after he didn't wear one for the late Queen's funeral last September. Military Historian Dr Peter Johnston told True Royalty TV's The Royal Beat in April that Harry may be allowed to display a different tribute to his service despite serving two tours in Afghanistan.'I imagine Harry won't wear uniform [at the Coronation],' he said. Even as a veteran who did two tours in Afghanistan, he won't wear uniform.",
        "'I imagine he'll wear his medals but quite where he fits within the procession and where he comes, I think will be probably reasonably similar to where he was at the funeral as well.'Discussing Harry's role in the procession, the historical expert added that he will 'be a part of it, but not necessarily, a [leading] part of it'. Harry had been expected to swiftly return to Meghan in Montecito so they could celebrate the birthday of their son, Archie, who turns four today. It is believed the Duke boarded a British Airways flight to Los Angeles International. The flight time is around 11 hours, meaning he could be back in California in time to for his son's special day. ",
        "The King's youngest son was all smiles as he climbed into a black vehicle immediately after the event on Saturday afternoon, rushing to make his way back to the airport. ",
        "The same car was then seen being escorted away from the capital by a police motorcade in the direction of Heathrow. There was no appearance from Harry, nor his uncle, Prince Andrew, on the Buckingham Palace balcony for the finale of the day, with the Palace confirming earlier that the ex-working royals had no formal role at the event.After his father's service at Westminster Abbey, Harry got straight into a car that immediately left London and headed to the airport.",
        "It was reported that the Duke had been invited to a post-coronation lunch at Buckingham Palace, in what many would have seen as an olive branch after his explosive memoir Spare left members of the Royal Family reeling - most notably his brother Prince William.Harry had worn an awkward smile at his father's ceremony as he was forced to watch the event of a generation from his relegated seat in the third row - while his sibling took centre stage alongside a radiant Kate Middleton. Harry had no formal role in the day's proceedings as he is no longer a working royal.  The Duke seemed keen to put on a jovial display, however, amid ongoing speculation of the Royal Family's inner turmoil following the release of his bombshell book in February.",
        "Wearing medals pinned to his suit jacket, he had been seen laughing and smiling as he entered the church alongside Princesses Eugenie and Beatrice and their respective husbands Jack Brooksbank and Edo Mapelli Mozzi.He had awkwardly nodded at other guests as he endured a solo walk down the aisle to take his seat next to his cousins ahead of the arrival of his father and the-now Queen Camilla. Once sat next to Mr Brooksbank, a lipreader consulted by Hello! magazine believes the Duke told him: 'I will be straight to the airport.' "
    ]
}