{
    "articleURL": "/wires/reuters/article-12045027/McConchie-shines-debut-New-Zealand-crash-ODI-series-loss.html",
    "content": [
        "May 4 (Reuters) - All-rounder Cole McConchie boosted his hopes of making New Zealand's World Cup squad with an unbeaten half-century on his ODI debut but it was not enough to prevent the Black Caps from crashing to a 26-run defeat that sealed the series for Pakistan.",
        "Long seen as a potential backup to all-rounder Mitch Santner, the 31-year-old Canterbury skipper's 64 from 45 balls proved in vain as New Zealand's chase of Pakistan's 287 for six in Karachi fell short.New Zealand trail 3-0 in the five-match series and have plenty of work to do ahead of the World Cup in India but McConchie, who also took the wicket of Abdullah Shafique, was pleased that his own game is moving in the right direction.\"From a personal point of view, to get that cap today and go out and put in a couple of performances, it's pleasing,\" McConchie told reporters.\"Today was a nice little stepping stone to eventually prove to myself a little bit that I can compete against a world class Pakistan team in their home conditions.\"I would have been more pleased if I got the boys over the line.\"McConchie, who bowls off-spin, made his international debut in 2021 in a T20 series against Bangladesh but has been outside selection until earning a recall for the white ball series against Pakistan.He has been working closely with former Pakistan spinner and coach Saqlain Mushtaq, who recently joined the New Zealand camp as an assistant coach.Saqlain, who pioneered the 'doosra', the off-spinner's delivery that spins towards leg rather than off, has helped McConchie on bowling variations.",
        "However, McConchie said he was a bit too tense to try them during his debut.\"I think the hands were a little bit sweaty, a little bit nervous today,\" he said.\"I haven't been brave enough to bring out one of those carom balls in a game.\"But we'll see how we go and hopefully we'll have a bit of time in the nets to work on them.\" (Reporting by Ian Ransom in Melbourne; Editing by Peter Rutherford)"
    ]
}