{
    "articleURL": "/wires/ap/article-12043725/New-legislation-counter-China-pushed-Senate-Democrats.html",
    "content": [
        "WASHINGTON (AP) - Senate Democrats launched a new legislative effort Wednesday in one of the few areas that appears to be generating bipartisanship in Congress - taking on China.",
        "The aim is to build on last year's bipartisan passage of a bill to boost computer chip production in the United States with more than $52 billion in manufacturing incentives and semiconductor research. That package, like the new one, was touted by lawmakers as a necessary step toward making America more competitive with China.But passage of a second bill could prove more difficult. Republicans have taken the majority in the House, placing more emphasis on spending cuts than on enacting new programs, and have so far found little common ground with the Senate.Still, a new House committee focused exclusively on countering China is supported by lawmakers in both parties as they try to speak with one voice on issues such as human rights abuses and bringing supply chains back to the United States. And many of the ideas raised Wednesday by Senate Democrats dovetail with proposals circulating in the House.Senate Majority Leader Chuck Schumer, D-N.Y., long a critic of China, is betting that he can forge new bipartisan partnerships on China despite the divides in Congress on other issues.\"The Chinese government is not constraining itself in its pursuit to dominate the 21st century,\" Schumer said. \"If we in America rest on our laurels, if we let the CCP beat us, it would have serious consequences for the world's democratic nations.\"",
        "Schumer said the new legislation will focus on such areas as limiting U.S. technology and capital from going to Chinese companies. It could also include curbs aimed at preventing China from buying U.S. farmland and provisions that would give the Biden administration more authority to review and potentially restrict foreign-made computer apps.The bill will also focus on deterring the Chinese government from engaging in conflict with Taiwan. Schumer said the various provisions will be packaged into one large \"Chinese government competition bill.\"The legislation is clearly in the formative stages. Schumer was vague on a timeline for consideration, saying Democrats hope to get a bill together \"within the next several months.\"While Democrats see the passage of last year's semiconductor and science bill as a model for China-focused legislation, some Republicans are skeptical. Sen. John Thune, the No. 2-ranked Senate Republican, said he's unconvinced that legislation with a big price tag can advance in a divided Congress. The CHIPS and Science Act that passed in the last Congress had a projected price tag of about $280 billion over 10 years.\"It will be challenging, and partly because of what we're talking about here, spending and debt, concerns about too much spending and the impact it has had on inflation, the way the deficit is exploding,\" Thune told reporters.",
        "Yet, lawmakers are eager to show voters they're willing to confront China, particularly as the Chinese take stances in opposition to America's interests on the global stage, such as President Xi Jinping's efforts to boost Russian President Vladimir Putin as Russia's invasion of Ukraine continues to devastate civilian areas.\"There are a few areas where we have agreement, it seems like these days,\" said Sen. Debbie Stabenow, D-Mich. \"But one area that we do agree on is ensuring we compete successfully against the Chinese government on the global stage.\""
    ]
}