{
    "articleURL": "/wires/reuters/article-12041313/Huge-fires-oil-depots-Russia-Ukraine-sides-press-drone-war.html",
    "content": [
        "Video appears to show object exploding over Kremlin",
        "Zelenskiy government denies accusations of responsibilityWhite House says it cannot authenticate Russia's accountOil depots ablaze in Ukraine and RussiaRussian shelling kills 18 people in Kherson region -KyivMOSCOW/KYIV, May 3 (Reuters) - Russia accused Ukraine on Wednesday of a failed attempt to assassinate President Vladimir Putin in a drone attack on the Kremlin citadel in Moscow, and threatened to retaliate.Ukrainian President Volodymyr Zelenskiy said Kyiv had nothing to do with the reported overnight incident.\"We don't attack Putin, or Moscow, we fight on our territory,\" Zelenskiy told a press conference during a visit to Finland, of the war against Russian occupiers.A senior aide to Zelenskiy called the accusation a sign that the Kremlin was planning a major new attack on Ukraine, at a time of potential turning point in the war as Kyiv prepares to mount a long-anticipated counteroffensive.Shortly after the Kremlin announcement, Ukraine reported alerts for air strikes over the capital Kyiv and other cities.Russia said that two unmanned aerial vehicles were aimed at the Kremlin.\"As a result of timely actions taken by the military and special services with the use of radar warfare systems, the devices were put out of action,\" a Kremlin statement said.\"We regard these actions as a planned terrorist act and an attempt on the president's life, carried out on the eve of Victory Day, the May 9 Parade, at which the presence of foreign guests is also planned.\"",
        "Fragments of drones were scattered in the Kremlin grounds but there were no injuries or damage, it said.Putin himself was safe. The RIA news agency said he had not been in the Kremlin at the time, and was working on Wednesday at his Novo Ogaryovo residence outside Moscow.\"The Russian side reserves the right to take retaliatory measures where and when it sees fit,\" the Kremlin added.Former Russian president Dmitry Medvedev, now deputy head of Russia's Security Council, said the incident \"leaves us no option but to physically eliminate Zelenskiy and his clique\".SMOKE OVER KREMLINTwo of numerous videos published on Russian social media channels show two objects flying on the same trajectory toward one of the highest points in the Kremlin complex, the dome of the Senate. The first seemed to be destroyed with little more than a puff of smoke, the second appeared to leave blazing wreckage on the dome.Reuters checks on time and location indicated that the videos could be authentic, though some Western analysts said it was possible Russia might have staged the incident to pin the blame on Kyiv and justify some kind of crushing response.Ukrainian presidential adviser Mykhailo Podolyak said the drone accusation, along with an announcement that Russia had caught suspected saboteurs in Ukraine's Russian-occupied Crimea region, \"clearly indicates the preparation of a large scale terrorist provocation by Russia in the coming days\".",
        "In Washington, the White House said it was aware of reports that Russia had accused Ukraine of attacking the Kremlin with drones to try to kill Putin but could not authenticate the allegations.Russia says it launched its \"special military operation\" to counter a threat from Kyiv's relations with the West. Ukraine and its allies call it an unprovoked war of conquest by Moscow, derailed by a failed assault on the capital Kyiv early last year and Ukrainian advances in the second half of 2022.Over the past five months, Ukrainian ground forces have kept mostly to the defensive, while Russia launched a huge, largely unsuccessful winter assault, capturing little new ground.KHERSON SHELLED, 18 KILLEDIn Ukraine's southern Kherson region on Wednesday, 18 civilians were killed and 46 injured in heavy Russian shelling that hit a hypermarket, a railway station and residential buildings, Ukrainian officials said.At least 12 of those killed were in Kherson city, which has been repeatedly shelled from areas of Kherson province occupied by Russia. The dead included three engineers trying to repair damage to the power grid from earlier Russian bombardments.\"When the enemy can achieve nothing on the battlefield, it strikes at peaceful cities,\" Ukrainian military spokesperson Serhii Cherevatyi said.Elsewhere, oil depots were ablaze in southern Russia and Ukraine alike as both sides escalated a drone war ahead of Kyiv's promised spring counteroffensive against Russian forces.",
        "Ukraine said it had shot down 21 of 26 Iranian-made drones in an overnight volley.Ukraine and Russia have both been carrying out long-range strikes since last week in apparent anticipation of a Ukrainian counteroffensive, which Zelenskiy said would begin soon, aided by supplies of sophisticated Western weaponry.Moscow says it has struck military targets, though it has produced no evidence to support this. Kyiv, without confirming any role in incidents in Russia or Crimea, says destroying infrastructure is preparation for its planned ground assault.Zelenskiy visited Finland on Wednesday, his fourth known trip abroad since Russia's full-scale invasion. Leaders of Denmark, Iceland, Norway and Sweden also attended his visit.Zelenskiy said his goals were to beef up Ukraine's military and secure an eventual place in the NATO alliance, a goal endorsed by the five Nordic nations in a statement.Blinken said later the U.S. government had authorised another $300 million worth of arms and equipment for Ukraine.(Additional reporting by Felix Light, Jake Cordell, Max Hunder, Olena Harmash, Essi Lehto, Anne Kauranen, Doina Chiacu and Daphne Psaledakis in Washington, Andrew Gray in Brussels Writing by Peter Graff and Mark Heinrich; editing by Philippa Fletcher and Andrew Cawthorne)"
    ]
}