{
    "articleURL": "/sport/nfl/article-12047743/NFL-investigation-allegations-workplace-discrimination.html",
    "content": [
        "AGs Letitia James and Rob Bonta have issued subpoenas to NFL executivesThe investigation focuses on the league's corporate offices, not specific teamsDailyMail.com provides all the latest international sports newsThe attorneys general of New York and California announced Thursday that they are investigating allegations of workplace discrimination at the NFL, citing lawsuits filed by employees that describe sex, racial and age bias, sexual harassment, and a hostile work environment.",
        "Attorneys General Letitia James, of New York, and Rob Bonta, of California, said they have issued subpoenas to NFL executives as part of an examination into the workplace culture at the the league's corporate offices in both states.The officials said they are exercising their legal authority to seek information from the NFL regarding allegations of gender pay disparities, harassment, and gender and racial discrimination.The investigation focuses on the league's corporate offices, not specific teams or players.'No person should ever have to endure harassment, discrimination, or objectification in the workplace,' James said in a statement. ",
        "'No matter how powerful or influential, no institution is above the law, and we will ensure the NFL is held accountable.'Bonta said he and James have 'serious concerns about the NFL´s role in creating an extremely hostile and detrimental work environment.'The league said it would cooperate with the investigation but called the allegations 'entirely inconsistent with the NFL's values and practices.''The NFL offices are places where employees of all genders, races and backgrounds thrive. We do not tolerate discrimination in any form,' league officials said in a statement.James and Bonta cited a 2022 New York Times story that detailed allegations of gender discrimination by more than 30 former female NFL employees.",
        "The women described a sexist culture at the NFL that they said persisted despite promises of reform that Commissioner Roger Goodell made after the 2014 release of a video that showed Baltimore Ravens running back Ray Rice punching his fiancée.Rice would never play again in the NFL. "
    ]
}