{
    "articleURL": "/wires/reuters/article-12057237/Erdogan-calls-opposition-pro-LGBT-election-rally.html",
    "content": [
        "ANKARA, May 7 (Reuters) - Turkey's President Tayyip Erdogan accused the opposition of being \"pro-LGBT\" at a rally in Istanbul on Sunday, as he stepped up his rhetoric against his opponents a week before what is expected to be a tight election.",
        "Elsewhere, protesters threw stones at Istanbul Mayor Ekrem Imamoglu, a member of the main opposition Republican People's Party (CHP), during an election rally in the eastern city of Erzurum, a stronghold of Erdogan's AK Party (AKP).Imamoglu later claimed nine people had been injured at the event.Turkey is due to hold presidential and parliamentary elections on May 14 and opinion polls show that Erdogan faces his biggest electoral challenge in his two decades in power.At his rally in Istanbul, the president was appealing to his conservative Muslim voter base.\"AK Party and other parties in our alliance would never be pro-LGBT, because family is sacred to us. We will bury those pro-LGBT in the ballot box,\" he told the crowd.Erdogan has toughened his rhetoric against the LGBT community in recent years, frequently labelling members \"deviants\".On Sunday, he also attacked his key election rival Kemal Kilicdaroglu, who heads the main opposition alliance.\"My people will not allow drunks and boozers to take the stage,\" Erdogan also said. \"Mr. Kemal, you can drink barrels of it, nothing can cure you,\" he said.\"My nation will make the necessary response on May 14. We will not allow Kilicdaroglu, who is hand in hand with terrorists, to divide our homeland,\" Erdogan said.",
        "Erdogan has also accused Kilicdaroglu of getting support from the outlawed Kurdistan Workers Party (PKK), which has been waging an insurgency since the 1980s in which more than 40,000 people have been killed. It is considered a terrorist group by Turkey, the United States and the European Union. The opposition has previously denounced claims by Erdogan linking them to terrorists as divisive and dangerous campaign rhetoric.At the event in Erzurum, Istanbul Mayor Imamoglu, who would become vice president if Kilicdaroglu wins the election, was addressing his supporters from the top of an open air bus when some members of the crowd threw stones at him and his supporters in the crowd, video footage showed.Imamoglu cut short his speech and left the scene in the bus.\"We are leaving for your safety,\" Imamoglu told his supporters, adding that he would file a criminal complaint against the Erzurum governor and police chief for allowing the violence.Footage showed at least one person wounded in the face.\"Erzurum's governor called and told me that seven people were wounded. I spoke to nine wounded people at this time,\" he later said in a tweet.In the 2018 presidential election Erdogan won 72% of votes in Erzurum. (Reporting by Huseyin Hayatsever; Editing by Susan Fenton)"
    ]
}