{
    "articleURL": "/wires/pa/article-12042469/King-advised-follow-Queen-s-footsteps-marker-reign.html",
    "content": [
        "The King should follow in his mother’s footsteps during his reign and remember the “terrific example” set by the late Queen, retirement home residents and workers said as they look forward to his coronation this weekend.",
        "Memories of meeting Charles when he was the Prince of Wales and of watching the Queen’s coronation in 1953 have been shared as the nation prepares for the royal celebrations on Saturday.Margaret Regardsoe, 76, recalls crowding around a specially bought television set with her family to watch the late Queen crowned in black and white from their Southampton sitting room.",
        "The Anchor Hythe retirement scheme resident is looking forward to the King’s coronation but said she does not think it will be “such a grand affair as it was for our Queen”.Speaking about her memory of watching the ceremony as a child all those years ago, she said: “I was very proud because my parents loved the royal family and that resonated down through to us children.“At school we all received a lovely blue coronation glass given to us by Southampton Town Council, which I still have now, before the event so there was a lot of excitement in the community.”",
        "Asked what her advice would be to the King, she said: “I would say to Charles, ‘Remember what a wonderful woman your mother was, and you must follow in her footsteps’.“The way she carried herself, the way she behaved and her whole demeanour.“She committed herself to our country and our Commonwealth right until the day she died, and I would expect that sort of commitment and passion from our King.”",
        " His mother was a terrific example, but he must now put his own marker on things  Terry Burton, retirement scheme location manager  Terry Burton, who met Charles while working as a teacher in Frome, Somerset, praised the royal for being “very good at making people feel at ease” and described him as “engaging”.The 65-year-old, who now works as a location manager at Hanover Gardens retirement home, said he is looking forward to the “pageantry” on Saturday, adding that he wishes Charles well as King.He said: “It’s a different world to June 1953 and the Queen’s coronation. He will have many challenges. Some people question why we should give such patronage to one man, one family, but I believe the royal family are an asset to the country. He certainly has waited a long time to take the reins.”While he said the late Queen set a great example, he added that the King can “put his own marker on things”.He said: “There will be plenty of people who will want to trip him up, but I say don’t rise to the bait. His mother was a terrific example, but he must now put his own marker on things.”",
        "Other care home residents offered snippets of advice for the new King, including 99-year-old Eric Deacon who said he must “be a good diplomat”, and Mary Huke, 89, who said she hopes he can “keep up the friendly, relaxed attitude”.",
        "Both are residents of St Mary’s Care Home in Ipswich.Sarah Jones, Anchor chief executive, said she had enjoyed hearing the “wonderful stories” from residents and colleagues who “hold fond memories of the royal family over the years”.She said: “At Anchor, we’re marking the occasion in various ways within our local communities, from street-style parties to delicious dinners highlighting ingredients from all over our nation. The celebrations will be a chance for us all to reflect on fond moments and create new joyful memories with loved ones that go beyond a single day.”"
    ]
}