{
    "articleURL": "/news/article-12042053/Idaho-murder-house-victim-Madison-Mogens-boyfriend-celebrates-second-anniversary.html",
    "content": [
        "The boyfriend of Mogen shared a photo to celebrate their 2nd anniversaryAlongside a photo of the pair together Jake Schriger sent 'kisses to heaven'Bryan Kohberger, 28, was arrested for killing four student in their Idaho home The boyfriend of one of the victims in the University of Idaho killings, Maddie Mogan, celebrated the couple's two year anniversary by posting a new photo of them together.",
        "Jake Schriger, who knew all four victims, also said in a message to Mogan: 'I miss you so much. I wish I could spoil you today but I'm sending extra hugs and kisses to heaven.' Schriger's girlfriend Mogan, 21, her close friend Kaylee Goncalves, 21, Xana Kernodle, 20, and her boyfriend Ethan Chapin, 20, were all stabbed to death in the off-campus home in Moscow, Idaho, on November 13.In December, Bryan Kohberger, 28, was arrested for killing the students and charged with four counts of first-degree murder. He's being held in prison awaiting his next court appearance. Schriger and Mogan were dating at the time of her murder and April 28 would have marked their two year anniversary. The two had been dating for around 18 months at the time of the murders.",
        "Schriger was also a student at the University of Idaho and spoke at a vigil in December of the couple's first date at The Breakfast Club in the university town of Moscow.'She was the first person I talked to every morning and the last person I talked to before bed,' Schriger said at the time. 'She was the person that I loved most.''I remember always being so excited to see the way that your face would light up when I finally got to see you and have you in my arms again,' he wrote in a different social media post honoring Mogen in November, less than a week after she was killed.",
        "'I promise to make you proud from heaven and carry on your values of showing and spreading love to everyone,' he added. A preliminary hearing on the murders is scheduled for June, in which several witnesses are expected to give testimony.Previously, a crucial witness - one of the surviving roommates in the house - had fought a subpoena forcing her to appear in both the preliminary hearing and the trial.Then, court documents last week revealed that Bethany Funke, 21, had agreed to an interview with Kohberger's defense team.In new documents submitted last Wednesday, both sides came to the agreement that the defense would go to Funke for an interview in Nevada – dismissing a subpoena issued on April 11.",
        "It means that the surviving roommate may not be forced to appear at the preliminary hearing on June 28, depending on the information that she gives investigators.Investigator Richard Bitonti, who is working for Kohberger's defense team, subpoenaed Funke on the basis that she may have exculpatory information.They claimed that the information she has is 'material and necessary' to the alleged killer's defense – though it is unclear exactly what that is.Bitonti wrote in an affidavit: 'During the course of my investigation, it became known to me that [she] has information material to the charges against Mr. Kohberger.'",
        "He added that she 'disclosed things she heard and things she saw' when interviewed by police and was present when police were called.However Funke's lawyers hit back by saying that the preliminary hearing is not meant to 'become a mini-trial', and is only meant to decide probably cause.They also said the subpoena was improperly filed, and there is no authority for an Idaho criminal defendant to summon a Nevada witness to Idaho for a preliminary hearing.As a potential witness Funke can willingly testify in the hearings, but if she refuses a subpoena can force her to attend court even if she does not want to.",
        "If a witness refuses to testify after being ordered to do so by a subpoena they can be held in contempt of court and given a fine of $500 or 25 days in jail. However they can invoke their Fifth Amendment rights while testifying at the hearing if doing so might implicate them in a crime.According to the statement of Office Brett Payne, both Funke and the other surviving roommate Dylan Mortensen, were home at the time of the homicides.Funke's bedroom is described as being located on the east side of the first floor of the property, and she heard Ethan Chapin and Xana Kernodle return to the property at 1.45am on the night of the murders.",
        "Mortensen's account of seeing a 'tall man' who was 'clad in black clothing and a mask' is detailed in the document.However Funke's version of events has not been publicly released, though both roommates phones were forensically downloaded by officers – leading them to believe the crimes occurred between 4am and 4.25am.It is unclear what defense investigators feel could clear Kohberger, but if Funke's version of events contradicts that of Mortensen it could play a key role in the trial.A gag order also remains in place, preventing anyone connected to the case from speaking publicly.Kohberger is yet to enter a plea in the quadruple homicide, and is charged with four counts of murder and one of burglary. "
    ]
}