{
    "articleURL": "/wires/pa/article-12056327/King-s-coronation-service-watched-19-million-viewers-UK.html",
    "content": [
        "The King’s coronation service at Westminster Abbey was watched by more than 18 million viewers in the UK, provisional figures have shown.",
        "The lavish ceremony on Saturday which saw Charles and Camilla crowned was broadcast simultaneously on a range of channels between about 11am and 1pm, including BBC One and Two, ITV and Sky News.An average of 18.8 million people watched across 11 channels and services, with audience figures peaking at 20.4 million when the King was crowned just after midday, according to overnight ratings released by the research organisation Barb.The figure is not quite as high as the ratings for the funeral service of the late Queen last September which was seen by 26.5 million people across more than 50 TV channels.Millions of people are thought to have watched the Queen’s coronation on television in June 1953 – but there are no reliable figures, making comparisons with TV ratings of today difficult.There was no independent organisation responsible for compiling and publishing ratings, and no consistent way in which the data was collected. Instead, the BBC carried out its own surveys to discover what people had seen or heard on the television and radio.The surveys were not carried out in a particularly robust way: BBC staff interviewed a varying cross-section of people across the country, asked them to remember what they had watched recently, then used the responses to estimate a figure for the overall number of viewers.",
        "Based on surveys carried out after the coronation of Elizabeth II, the BBC estimated its television coverage of the event was seen by more than 20 million adults in Britain.",
        "Twenty million is still a remarkable number when considering the number of households with a TV licence on March 31 1953 – nine weeks before the coronation took place – stood at just 2.1 million.With so few licences, and such a huge estimated TV audience, many people are likely to have watched the coronation at someone else’s house, getting together with neighbours, friends and family.As television was still in its infancy in the UK in the early 1950s and the same was true of the methods used to measure its audience, estimates of TV audiences cannot be compared directly with TV ratings as they are measured today.The current method of calculating TV audiences was established only in 1981 by the audience research organisation Barb.",
        "Since 1981, the highest TV audience on record was for the funeral service for Diana, Princess of Wales, in September 1997, which was seen by 31.0 million on the BBC and ITV.The King’s coronation also had a lower combined audience than the televised address by former prime minister Boris Johnson in March 2020, during which he announced the first Covid-19 lockdown, which was watched by 28.2 million people.",
        "The ratings are also lower than the opening and closing ceremonies of the London 2012 Olympic Games, which had 24.2 million and 24.5 million viewers respectively on BBC One, and the final of the Euro 2020 football championship in July 2021, which attracted a combined total of 22.5 million on BBC One and ITV.It did overtake the viewer ratings for the Queen’s Platinum Jubilee concert, which took place in front of Buckingham Palace last June, as it was watched by an average of 13.1 million people on BBC One."
    ]
}