{
    "articleURL": "/tvshowbiz/article-12050879/Michael-Palin-79-supported-friend-lunch.html",
    "content": [
        "Michael Palin was comforted by a friend as they met up just days after he announced the death of his beloved wife Helen earlier in the week. ",
        "On Tuesday, the actor, 79, announced his beloved wife had died after suffering chronic pain and kidney failure, just weeks after their 57th wedding anniversary.Later in the week, he was seen stepping out with a friend for a meal at Lemonia restaurant in Primrose Hill. He greeted the pal with a warm hug. Michael confirmed the devastating news in a post on his official website on Tuesday, stating that Helen had died in the early hours of the morning. Legendary actor Michael branded his beloved wife the 'bedrock of my life' and said her death was an 'indescribable loss' for himself and their children - Thomas, 54, William, 52, and Rachel, 48.",
        "The Monty Python star told how Helen had been suffering with chronic pain for a few years and had been diagnosed with kidney failure before her death. The childhood sweethearts met when they were 16 and married in 1966, marking their 57th wedding anniversary weeks before Helen passed away.Announcing the news on his blog, Michael shared a selfie of them together and wrote: 'My dearest wife Helen died peacefully in the early hours of Tuesday morning.'She had been suffering with chronic pain for several years, which was compounded a few years ago by a diagnosis of kidney failure.",
        "'We first met on a summer holiday on the Suffolk coast when we were both sixteen and we married in our early twenties. Two and a half weeks ago we celebrated our 57th wedding anniversary.'Her death is an indescribable loss for myself, our three children and four grandchildren.",
        "'Helen was the bedrock of my life. Her quietly wise judgment informed all my decisions and her humour and practical good sense was was at the heart of our life together. The family ask that their privacy be respected at this time.'Last September, Michael spoke about Helen's ill-health as he revealed that she had been moved into respite care from the home they had shared for 50 years.He explained that she had not been responding to medication for her chronic pain, saying they had moved her to help her 'manage' her symptoms.The comedian told the Telegraph at the time: 'I don't think you can cure it, but they will help her manage it. 'It's such a bore. She was so active and still is mentally. But the body is declining. We live life with our fingers crossed.'",
        "Michael and Helen met as teenagers when they were both on summer holidays in Southwold, Suffolk, where they were staying in neighbouring cottages with their families.",
        "He described Helen as a 'vision of rebellion' when he first met her and admitted their romance quickly blossomed, according to The Telegraph.Michael was living in Sheffield at the time while Helen was in Cambridgeshire, but the pair remained in touch by writing letters and met again the following summer.They were then reunited on Michael's first day at Oxford University, where Helen was visiting her friend for the weekend, with fate bringing them together once again.Recalling the reunion, Michael said: 'You can see fate was actually tightening the screws on us very hard at that time.'They tied the knot in 1966 and while Michael turned to a career in comedy, Helen worked as a teacher before becoming a bereavement counsellor.The couple had three children together and have four beloved grandchildren.In 2015, Michael told The Telegraph what the secret to his happy marriage with Helen was enjoying spending time together. He added: 'What is the really important thing in a relationship, what is the main thing? Sex, or going to the theatre, or having lots of friends, or whatever?'None of that matters. There's something underneath that works - that you're happy to be with somebody for an awful lot of the time.'The more time you spend together, the more things you have to share, the less likely it is that you want to throw all that away.'",
        "Speaking about his family life to MailOnline in 2012, Michael also shared how he spent his day-to-day life with his wife. He told how he collected stamps, drank sensibly, jogged daily on Hampstead Heath and would sooner have run up and down Oxford Street with his underpants on his head than cheat on Helen.Gushing over his wife, he said: 'I was lucky to find somebody early on when I was in my teens who I got on with really well and still get on with really well. It sort of works better as it goes along. You build up layers of experience.' Speaking about his love for travel, he went on: 'Helen's always been really tolerant of my travels. If she said, \"You've got to stay home\", she'd just have a frustrated man kicking chairs in the kitchen and looking at atlases. 'So she's always been very happy to let me go. I see no reason to rupture such an extraordinary relationship. I don't like a life that's edgy and uncomfortable. I'm restless in other ways – in terms of work.'In recent years, Michael has addressed his health and recently spoke about undergoing heart surgery in 2019 amid the Covid-19 pandemic.In December 2020, Michael compared the coronavirus lockdown to a 'huge doctor's note' following his operation.",
        "He said he accepted having to remain in his home quite happily, particularly after being away while filming his show Travels of a Lifetime.Speaking to Radio Times, he said: 'The great surprise is that I've been extremely content to be in the same place for some time.'I had heart surgery last September and was told to have rest and recuperation – then lockdown came along. I accepted it rather happily, it's been like a huge doctor's note. 'Anyway, coming home has always been the best part of the process. We live near Hampstead Heath in London and near friends.'"
    ]
}