{
    "articleURL": "/news/article-12040261/Cash-App-founder-Bob-Lees-alleged-murderer-gleams-courtroom.html",
    "content": [
        "Nima Momeni, 38, smiled while walking into the courtroom on Tuesday He is accused of killing Cash App founder Bob Lee on April 4 in San Francisco His arraignment was delayed for a third time until May 18 The tech executive charged with the brutal murder of Cash App founder Bob Lee appeared all smiles in court - as a coroner report revealed the brutal details of the slaying. ",
        "Nima Momeni, 38, gleamed while being escorted into the courtroom Tuesday for his arraignment hearing for the killing of Lee, 43, on April 4. Momeni is accused of stabbing the entrepreneur multiple times with a kitchen knife near the west edge of the San Francisco Bay Bridge.But the alleged killer's hearing got pushed back for the third time as his lawyer, Paula Canny, told the judge she needed more time to prepare amid the victim's autopsy revealing he had a mixture of drugs an alcohol in his system when he was stabbed.The arraignment was postponed until May 18 as Momeni prepares to plea not guilty.",
        "Paramedics found Lee collapsed in front of an apartment block after he called 911 himself at around 2.36am on April 4. Lee was 'unconscious, pulseless' and gasping for breath when medics found him. Paramedics, who discovered two stab wounds to his chest and a third on his hip, fitted a tube to help with breathing and performed CPR.The autopsy from the San Francisco Medical Examiner revealed in graphic detail how Lee was found slumped outside an apartment block with no pulse before paramedics rushed him to the hospital.He found he had a mixture of drugs and alcohol in his system when he was stabbed, including ketamine, cocaine and alcohol.",
        "During the desperate, hours-long attempt to save his life, medics performed several procedures to try and seal the wounds and stop his bleeding before Lee was pronounced dead on an operating table at San Francisco General Hospital. The autopsy also revealed traces of cocaethylene, which is produced when alcohol and cocaine are consumed, and the allergy medication antihistamine levocetirizine.",
        "The medical examiner's discovery of drugs in Lee's system comes after claims that Lee was romantically involved with Momeni's sister, Khazar, and the pair had visited the home of a drug dealer the day before the murder.It has also been claimed Momeni was concerned his sister had been using drugs and had argued with Lee hours before the stabbing.",
        "Momeni is the older brother of Khazar Momeni, known as Tina to her friends, who had a close friendship with Lee. Surveillance footage following the stabbing showed Momeni stabbing Lee in his BMW after driving him to a secluded part of town in the early hours of April 4, prosecutors said.They, however, said the footage was dark and difficult to make out. But, Momeni's lawyer claim she is not convinced by the surveillance footage she has seen.'He's gonna plead not guilty, and he's gonna deny the special allegation and absolutely the plea will be not guilty,' Paula Canny said following an April hearing.",
        "'I don't think you can see anything in the videos.' Friends have claimed Khazar was romantically involved with Lee despite her being married to plastic surgeon Dino Elyassnia, and one alleged in a recent interview with The San Francisco Standard that Khazar had a drug problem. 'She was basically asking me to buy drugs with my money,' Samira Kuduzovi, who was friends with her, said. Police sources said on the day of his murder, Lee and Khazar visited the home of a man who has a criminal record for dealing drugs. It's unclear if they purchased any from him that day. A previously-filed court motion says the trio were 'drinking' at his home. The man in question has not been named.",
        "The apparent connection to drugs ties into an earlier claim that Lee argued with Nima Momeni about Khazar hours before the stabbing. It was claimed by friends that Nima was concerned his sister was wrapped up in a bad crowd and had been using drugs.Lee, according to the friends, assured him she was not. Robert Canny, an attorney who spoke on behalf of Khazar Momeni and her husband at her brother's first court appearance, did not immediately respond to  previous DailyMail.com inquiries. Authorities have not released any further details regarding illicit substances being involved in the case. ",
        "Canny, the attorney representing Nima, previously suggested police had arrested the wrong person. 'Clearly they seem to think they have enough to make an arrest, but I haven't seen it.'So, until I see it and analyze it, I'm gonna say they've made a mistake. There isn't enough [to hold him].'My client is a super nice person, his family loves him and supports him.' "
    ]
}