{
    "articleURL": "/wires/pa/article-12053873/Ukraine-downs-Russian-hypersonic-missile-US-Patriot.html",
    "content": [
        "Ukraine’s air force claims to have downed a Russian hypersonic missile over Kyiv using Patriot defence systems recently acquired from allies.",
        "It is the first known time the country has been able to intercept one of Moscow’s most modern missiles.Air force commander Mykola Oleshchuk said in a Telegram post that the Kinzhal-type ballistic missile was intercepted in an overnight attack on the Ukrainian capital earlier in the week.It is also the first time Ukraine is known to have used the Patriot defence systems. There is confirmation that it effectively works against even a super hypersonic missile  Yurii Ihnat  “Yes, we shot down the ‘unique’ Kinzhal,” Mr Oleshchuk wrote. “It happened during the night-time attack on May 4 in the skies of the Kyiv region.”He said the Kh-47 missile was launched by a MiG-31K aircraft from Russian territory and was shot down with a Patriot missile.The Kinzhal is one of the latest and most advanced Russian weapons. The Russian military says the air-launched ballistic missile has a range of up to 1,250 miles and flies at 10 times the speed of sound, making it hard to intercept.A combination of hypersonic speed and a heavy warhead allows the Kinzhal to destroy heavily fortified targets like underground bunkers or mountain tunnels.The Ukrainian military has previously admitted lacking assets to intercept the Kinzhals.“They were saying that the Patriot is an outdated American weapon, and Russian weapons are the best in the world,” air force spokesman Yurii Ihnat said on Ukraine’s Channel 24 television.",
        "“Well, there is confirmation that it effectively works against even a super hypersonic missile.”He said intercepting the Kinzhal is “a slap in the face for Russia”.Ukraine took its first delivery of Patriot missiles in late April. It has not specified how many it has, but they have been provided by the US, Germany and the Netherlands.Germany has acknowledged sending at least one system and the Netherlands said it has provided two.Ukrainian troops have received extensive training to locate a target with the systems, lock on with radar and fire. Each battery requires up to 90 personnel to operate and maintain.Defence minister Oleksii Reznikov said he first asked for Patriot systems when visiting the US in August 2021, months before Russia’s full-scale invasion but seven years after Russia illegally annexed Ukraine’s Crimea peninsula.He has described possessing the system as “a dream” but said he was told in the US at the time that it was impossible.The Patriot system costs approximately £3 million per missile, and the launchers cost about £8 million, according to analysts.In other developments, Ukraine’s Special Operations Forces accused Russia of using phosphorous munitions in its attempt to win control of the eastern city of Bakhmut.Russian troops have been trying to take the city for more than nine months, but Ukrainian forces are clinging to positions on the western edge of the city.",
        "On Saturday, the Ukrainska Pravda newspaper quoted military officials as saying that “the enemy used phosphorus and incendiary ammunition in Bakhmut in an attempt to wipe the city off the face of the Earth”.Russian forces have not commented on the claim but have rejected previous accusations by Ukraine that they used phosphorus.International law prohibits the use of white phosphorus or other incendiary weapons in areas where there could be concentrations of civilians."
    ]
}