{
    "articleURL": "/tvshowbiz/article-12044845/Neighbours-star-Scott-McGregor-accused-sexually-touching-woman-Espy-hotel-St-Kilda.html",
    "content": [
        "Former neighbours star Scott McGregor charged with count of sexual assaultCharge relates to alleged incident at St Kilda pub The Esplanade CCTV footage shows he was in process of ordering drink at the time An ex-Neighbours star accused of 'sexually touching' a woman  at one of Melbourne's most famous seaside pubs had been in the process of ordering a drink. ",
        "Scott McGregor, who played police detective Mark Brennan on the iconic Aussie soap, found himself on the wrong side of the law in November when detectives charged him with one count of 'sexually touching' a woman without her consent. On Thursday, the Melbourne Magistrates' Court heard police had obtained CCTV vision from behind the bar of St Kilda's Hotel Esplanade, known by locals as the 'Espy', that captured the alleged incident. ",
        "The vision allegedly shows the top half of McGregor as he stood at the bar about 8pm on Sunday, February 20 last year.Police allege McGregor 'touched' his alleged victim who was standing behind him at the time. McGregor's barrister Carly Marcs claimed that footage did not actually contain any visual evidence supporting the charge. 'He's looking forward the entire time,' Ms Marcs said.  Ms Marcs, who played an integral part in overturning the conviction of supposed gangland killer Faruk Orman, had called on the magistrate to demand police provide supporting footage from at least three other CCTV cameras from within the venue. However the court heard detectives had failed to obtain the footage at the time and it had now been erased. Ms Marcs claimed cameras positioned at the rear of the bar likely captured footage that would have exonerated her client. ",
        "Prosecutors confirmed all that remained of CCTV footage captured from the rear of the bar was a single still image. ",
        "Ms Marcs suggested the footage obtained by police to prosecute her client had been 'selective'. The court heard McGregor had never met his alleged victim and had no interaction with her on the night leading up to the alleged assault. The alleged victim had complained to bar staff before contacting police. McGregor adamantly denies the charge and is set to contest it at a two-day hearing in August.  McGregor had been regarded as one of Australia's finest young talents, appearing in Underbelly, Offspring and Winners &amp; Losers, and appeared in 940 episodes of Neighbours from 2013 to 2020.McGregor appeared in court via videolink, but will be required to attend in person when the matter returns. In 2019, McGregor was the victim of a glassing incident after exotic dancer Danielle 'Ivy' Lee picked up a glass 'in a fit of rage' and threw it at his face. The actor was at the Hollywood Showgirls Club on Queensland's Gold Coast when the glass hit his face and caused a small cut that required three stitches.Lee pleaded not guilty to assault occasioning bodily harm and told the court McGregor verbally abused her after she approached him in the club. ",
        "The dancer's reaction was found to be 'disproportionate' to the offence and found her guilty before releasing her on a $1,000 good behaviour bond. No conviction was recorded and she was ordered to pay $80 for medical costs. Fans were devastated after McGregor didn't appear in the final episode of Neighbour's in July, which saw the return of dozens of ex-characters return to Ramsay Street. The actor and model lives in the leafy Melbourne suburb Brighton East and shares two children with his wife of three years Bianka Voigt.McGregor regularly uploads photos to Instagram of his enviable lifestyle, including trips to the beach with his young family, golf days and home renovations.  "
    ]
}