{
    "articleURL": "/wires/reuters/article-12041469/Kremlin-says-Russia-talking-U-N-Black-Sea-grain-deal.html",
    "content": [
        "MOSCOW, May 3 (Reuters) - Russia said on Wednesday that it will keep talking to the United Nations about the future of a deal that allows the safe Black Sea export of Ukraine grain, but would not do anything to harm its own interests.",
        "Top U.N. trade official Rebeca Grynspan is due to travel to Moscow for talks on Friday about U.N. efforts to help facilitate Russia's grain and fertilizer exports. While not subject to Western sanctions imposed over the February 2022 invasion of Ukraine, Moscow has complained of obstacles to such shipments.The United Nations and Turkey brokered what was described as a package deal in July last year - the safe resumption of Ukraine's Black Sea grain exports and a U.N. commitment to help Russian shipments of grain and fertilizer.Russia has threatened to quit the Black Sea export pact on May 18, but on a call with reporters, Kremlin spokesman Dmitry Peskov said of the package deal: \"The Russian side will continue contacts with both U.N. and other representatives, in the hope that the terms of the deal will be fulfilled after all.\"He added: \"Of course, Russia will not do anything further that will be contrary to its interests.\"Russia has a list of demands it wants met for continuation of the Black Sea pact, which the U.N. said helps tackle a global food crisis aggravated by Moscow's war in Ukraine. The deputy defence ministers of Russia, Ukraine and Turkey are due to meet in Istanbul on Friday to discuss the Black Sea deal.",
        "Ukrainian President Volodymyr Zelenskiy said on Wednesday that Russia did not appear to be interested in extending the Black Sea agreement.U.N. Secretary-General Antonio Guterres last week sent a letter to Russian President Vladimir Putin that a U.N. spokesperson said proposed a \"way forward aimed at the improvement, extension and expansion\" of the pact.He also sent similar letters to Zelenskiy and Turkish President Tayyip Erdogan.\"I was informed that the Kremlin is looking into the proposal and that there would be a response to my proposal,\" Guterres told reporters during a visit to Nairobi on Wednesday.\"If you ask me if I am optimistic, I will answer with my usual quote - Jean Monnet: I am not optimistic, not pessimistic, I am determined. I think this is good for the world. I think this is good for the parties, and the U.N. will do everything possible to make it happen,\" he said. (Reporting by Reuters; writing by Michelle Nihcols; Editing by Mark Trevelyan and Grant McCool)"
    ]
}