{
    "articleURL": "/travel/article-12041635/The-countries-love-royals-according-bookings-flights-Coronation.html",
    "content": [
        "Global tech company Travelport has released trend data on flights to the UKMost searches for UK-bound flights for the Coronation originated in EuropeREAD MORE: The 20 breakfast fails that annoy Brits the most revealedThe U.S is the country outside the UK that loves the Royal Family the most, according to new research. ",
        "Travellers from the U.S have booked the highest number of flights to the UK for King Charles' Coronation weekend, followed by tourists from India (second) and Australia (third).Canada and Italy also appear to share a passion for the British monarchy, ranking fourth and fifth respectively.The research also analysed the countries that registered the biggest surges in searches for flights to the UK within 24 hours of the Coronation date being announced. The Republic of Ireland tops this ranking, with searches for UK flights up 580 per cent after May 6 was confirmed as the Coronation date. The second biggest search surge came for domestic travel within the UK (442 per cent), followed by searches from Italy (third, 355 per cent), Spain (fourth, 349 per cent) and the Netherlands (fifth, 313 per cent).",
        "The rankings are based on trend data from Travelport, a global technology company that powers bookings for international travel suppliers.The remaining top 10 countries to have booked the most UK-bound flights are Nigeria (sixth), South Korea (seventh), Germany (eighth), Thailand (ninth) and Spain (10th). Notably, though there was a high volume of flight searches from the Irish, they didn't appear to follow through with booking a trip. In general, bookings for UK-bound flights for the Coronation weekend increased by 149 per cent within 24 hours of the announcement of the Coronation date.",
        "Looking to the rest of the top 10 countries that searched for flights after the Coronation date was confirmed, the U.S ranks sixth with searches up by 293 per cent compared to the day beforehand.",
        "SEARCHES FOR INTERNATIONAL FLIGHTS TO THE UK WITHIN 24 HOURS OF THE ANNOUNCEMENTRepublic of Ireland (up 580 per cent in the day after announcement)Domestic travel within the UK (up 442 per cent)Italy (up 355 per cent)Spain (up 349 per cent)Netherlands (up 313 per cent)United States (up 293 per cent)Germany (up 257 per cent)Switzerland (up 231 per cent)Singapore (up 175 per cent)Canada (up 172 per cent)BOOKINGS FOR INTERNATIONAL FLIGHTS TO THE UK FOR THE CORONATIONUnited StatesIndiaAustraliaCanadaItalyNigeriaSouth KoreaGermanyThailandSpainSource: Travelport",
        "Germany, meanwhile, is seventh with a surge of 257 per cent in searches, while Switzerland is eighth with a 231 per cent boom in searches.The remainder of the top 10 is comprised of Singapore (ninth, searches up 175 per cent) and Canada (tenth, searches up 172 per cent).Overall, the majority of searches for flights to the UK during the Coronation weekend originated from Europe.Travelport says of the Coronation: 'Nearly 70 years after the Coronation of Queen Elizabeth II in June 1953, this landmark event is expected to draw thousands of spectators from around the world to celebrate the new monarch.'"
    ]
}