{
    "articleURL": "/wires/pa/article-12056695/John-Coleman-accepts-relegated-Accrington-haven-t-good-enough.html",
    "content": [
        "Accrington boss John Coleman admitted his side “haven’t been good enough” this season after relegation was confirmed despite a 2-1 win at Oxford.",
        "Stanley needed to win and overturn an improbable 16-goal difference to have a chance of staying up but Cambridge’s victory over Forest Green sealed their fate in any case.Billy Bodin put the U’s ahead after eight minutes but Stanley hit back in the second half through substitute Korede Adedoyin and Aaron Pressley.Coleman said: “We were all over the place in the first half. But we’ve given our all and we thoroughly deserved to win.“Yes they had far better chances than us but that’s when your goalkeeper and your defenders need to make a good save or make blocks and we haven’t had enough of that this season.“But we scored two good goals. The sickening thing is if we’d have won last week, we’d have stayed up. Over the course of the season we haven’t been good enough and we have to accept that.",
        "“We have to do it the right way and get ourselves back on an even keel, steady the ship and go again for next season. It’s going to be a tough league and we’re going to have to be prepared for a battle.“We have given away too many chances all season.“We’ve got to focus our efforts on restructuring the squad, get players in who can compete and produce on a regular basis in League Two, and make sure we don’t go down a slippery pole.",
        "“We won’t get kidded by the result today – we’ve just got to sign the right players.“I won’t rush into making decisions about who goes out. I need to get the right decisions so that we find ourselves in a healthier shape than we have this season.”Oxford head coach Liam Manning reflected on a poor finish and poor finishing.He said: “It was very disappointing to lose the game, especially after the number of chances we had. It’s the story of the season for us really.“But in the bigger picture there’s huge credit to the players for getting it done when they did, getting over the line to stay up.“We’re missing composure. We create so many chances and we just have to convert them.“We have to learn from this season. It’s such a difficult division, so competitive, if you don’t have the right culture and the players aren’t all in you can find yourself really up against it.“We have to make sure we evaluate all of that and put it right for next season.“I’ve had meetings about the building here already. We’ve got a lot of work to do to get the right culture.“Some players will need to move on – but that’s the same at any club. I will have to make some tough decisions.",
        "“Yes, we need a striker or a number nine who scores goals but it’s not just a number nine, we need players all over the park who can score goals from multiple positions.“When I came in I had to prioritise key areas because they were playing the game slightly differently to the way I see the game or how I like so it was about altering the shape and the organisation and not giving away goals.“I always felt that we needed to be harder to beat and not keep giving away three or four goals a game.“We’ll have a look at the squad and then come back in the summer to make sure we do the things we need to get ourselves in the right half of the table next season.”"
    ]
}