{
    "articleURL": "/wires/aap/article-12049229/More-police-security-troubled-Alice-Springs.html",
    "content": [
        "Extra police, liquor inspectors and security guards will be deployed in Alice Springs to help improve community safety.",
        "The federal and NT governments have signed a $14.2 million two-year agreement to deliver additional policing and other support.The deal will fund 30 police officers, 21 liquor licensing inspectors and compliance officers and 10 security guards in public places across Alice Springs.Announcing the funding on Friday, federal Attorney-General Mark Dreyfus said the commonwealth continued to work closely with the Territory to tackle crime, keep women and children safe and support young people in communities across Alice Springs and central Australia.But the extra cash came amid continuing concern over violence across the region after the fatal bashing this week of a Bangladeshi student in an unprovoked attack in Darwin.That assault followed the fatal stabbing in March of bottle shop worker Declan Laverty.NT acting Police Commissioner Michael Murphy said the region still had some underlying social issues to address.But he said things were getting better and policing operations had \"definitely made an impact\".\"We'll continue to keep that tempo up, not just in Darwin but across Alice Springs as well,\" Mr Murphy told Sky News.\"The Territory is a place that we want people to come to. (But) there's a perception of fear, that you can't come here.\"We'll make a difference and change that. I can guarantee that.\"",
        "The commissioner said in respect to Alice Springs, the latest crime statistics had revealed a decline in violent incidents.He said following the introduction of new alcohol laws, the number of domestic violence, alcohol-related assaults and youth violence incidents had dropped significantly.\"We've turned the tide gradually in Alice Springs but we need to do more work,\" Mr Murphy said.\"Over the next few months, we're going to evaluate, keep the pressure on and then provide advice across government to say what we're going to do in the future.\""
    ]
}