{
    "articleURL": "/sport/formulaone/article-12051275/Max-Verstappen-Tua-Tagovailoa-swap-jerseys-link-Miami-Grand-Prix.html",
    "content": [
        "The world champion got an autograph from the Miami Dolphins signal caller Others including Valtteri Bottas, Charles Leclerc, and Carlos Sainz ran drills DailyMail.com provides all the latest international sports news Red Bull Racing driver Max Verstappen has been to Miami's Hard Rock Stadium to compete only once before. This time, he was shown around by someone who has been in the stadium complex for the past three years.",
        "The reigning driver's world champion met Miami Dolphins quarterback Tua Tagovailoa as part of the buildup to Sunday's second ever Miami Grand Prix.World no. 1 Verstappen and Miami's no. 1 Tagovailoa swapped 'jerseys' as Tua autographed a jersey for the Dutchman. This event marks the first of three Grands Prix in the United States - ahead of the United States Grand Prix in Austin, Texas in October and the first Las Vegas Grand Prix to be held under the lights in November.Verstappen wasn't the only one to be given the star NFL treatment at the stadium at the center of the 3.36 mile circuit.",
        "This season, Formula One moved the paddock inside the 64,000 seat stadium - covering the turf with non-pit-side team facilities and allowing for various NFL-esque activities to take place. Other Miami Dolphins players - like linebacker Jalen Phillips and running back Raheem Mostert were on hand to interact with the drivers.Tagovailoa was seen giving passing lessons to both of Alfa Romeo's drivers: Zhou Guanyu of China and Finland's Valtteri Bottas. Both Alpha Tauri drivers were also seen on the field, with images capturing teammates Nyck de Vries and Yuki Tsunoda tossing the pigskin.Ferrari's driver pair of Carlos Sainz and Charles Leclerc were put through their paces as well - with Leclerc seen practicing a shuttle drill and Sainz weaving between tackling dummies.",
        "Others seen tossing the football around include Aston Martin's Lance Stroll and the Williams drivers Alex Albon and Logan Sargeant.This marks a homecoming for Sargeant - the Fort Lauderdale born and raised American who is in his first season in Formula One and is racing in his hometown for the first time.Meanwhile, away from the field, Lewis Hamilton was seen in the garage alongside New York rapper A$AP Rocky. ",
        "Verstappen will look to beat out his teammate Sergio Perez - who closed the gap between the top two spots with last Sunday's win in Azerbaijan.Perez was able to hold on at a track where Red Bull have had some famous incidents between their top drivers in past seasons.With the victory, Perez closed the gap to six points behind his teammate going into this race weekend.Verstappen was victorious last season, beating out both Ferraris while Perez finished P4 and over two seconds behind third-place finisher Sainz."
    ]
}