{
    "articleURL": "/wires/reuters/article-12055359/Motor-racing-Perez-pole-Miami-Verstappen-ninth.html",
    "content": [
        "Perez on pole as Verstappen qualifies ninth",
        "Leclerc crash ends session earlyAlonso puts Aston Martin on front rowHamilton slumps to his worst U.S. qualifying(Adds detail and quotes)By Steve KeatingMIAMI, May 6 (Reuters) -Red Bull's Sergio Perez was gifted a dream pole position at the Miami Grand Prix on Saturday while team mate and Formula One leader Max Verstappen qualified only ninth.Ferrari's Charles Leclerc halted qualifying when he crashed with a minute and 36 seconds remaining and race control announced the session would not resume, leaving Verstappen unable to set a flying lap.Aston Martin's Fernando Alonso joined Perez on the front row with a time 0.361 slower than the Mexican's pole time of one minute 26.841 seconds at a humid Hard Rock Stadium.\"It has been my worst weekend up to qualifying,\" said Perez, winner in Azerbaijan last weekend and now hoping to lead the championship for the first time.\"We put in the lap when it mattered.\"Verstappen, last year's winner in Miami and currently six points ahead of Perez after four races, had failed to complete his first flying lap after making a mistake and running wide.He had everything riding on a second that never happened. Leclerc lost control through turn six, spun and hit the barriers where the Monegasque had also crashed in Friday's second practice.",
        "\"I think what's unacceptable is doing twice the same mistake in the same corner. I am really disappointed with myself,\" said Leclerc, who started on pole in Miami last year.\"A podium would be a really good finish tomorrow, considering our race pace.\"Perez will go top, in a city with plenty of his supporters, if he can convert pole into his third win of the season and end double world champion Verstappen's almost year-long run at the summit.The championship so far has been a battle between the Red Bull drivers, who have been in a league of their own when it comes to race pace, and Verstappen cannot be counted out despite his grid position.\"I was trying to put it on the limit and then I made a mistake and had to abort the lap,\" said Verstappen, who had been consistently faster than Perez in practice.\"Then you rely on a bit of luck that there is not going to be a red flag but that can happen on a street circuit. I'm just a bit upset with myself.\"Ferrari's Carlos Sainz qualified third and Kevin Magnussen qualified an astonishing fourth for Haas.Alpine's Pierre Gasly will line up fifth with George Russell in sixth place on the grid for Mercedes and Leclerc seventh despite the crash.",
        "Verstappen will also have to get past Alpine's Esteban Ocon in eighth place. Valtteri Bottas lines up 10th for Alfa Romeo.Alonso's team mate Lance Stroll provided the early surprise by failing to make it out of the first phase, the Canadian qualifying only 18th.Mercedes' seven times world champion Lewis Hamilton provided the next shock, with the most successful Formula One driver of all time only 13th in his worst ever qualifying at any circuit in the United States.\"Left that way too late guys,\" Hamilton observed over the radio.Williams' Alex Albon and Haas's Nico Hulkenberg qualified higher than Hamilton in 11th and 12th respectively.Hamilton had swerved to avoid going into the back of Magnussen's Haas in the opening session, hitting the wall and telling the team over the radio to check his car's front wing.McLaren's Lando Norris and Oscar Piastri qualified 16th and 19th respectively.\"There was nothing that surprised us. We knew it would be difficult to get out of Q1 and it showed,\" said Norris.Logan Sargeant, the only U.S. driver in the race, will start last of all for Williams. (Writing by Alan Baldwin in London, editing by Toby Davis)"
    ]
}