{
    "articleURL": "/news/article-12045817/Billionaire-Stephen-Deckoff-snaps-dead-pedophile-Jeffrey-Epsteins-two-private-islands-60m.html",
    "content": [
        "Jeffrey Epstein's infamous Caribbean islands finally have a new owner Private equity mogul Stephen Deckoff paid less than half of initial asking price Deckoff, who said he never met Epstein, has plans to develop a 25-room resort Two private islands previously owned by pedophile Jeffrey Epstein have finally been snapped up by a billionaire after more than a year on the market. ",
        "Epstein's infamous Caribbean islands - one of which is dubbed 'Pedophile Island' - have been bought by billionaire Stephen Deckoff for $60million - less than half of their $125m initial asking price.Mr Deckoff, the founder of private equity firm Black Diamond Capital Management, has announced plans to develop a state of the art luxury 25-room resort on the land in the US Virgin Islands.The two private islands, known as Great St. James and Little St. James, first hit the market as a package deal for $125m in March 2021, but this was cut to $55m a piece - or $110m for the pair.Little St. James is the infamous island where Epstein - who died in a Manhattan jail in 2019 aged 66 - built his lavish compound to host orgies and traffic underage girls. ",
        "Government documents show that Little St. James Island, which sits on 70 acres of land located a little over a mile from St Thomas - a tropical island near Puerto Rico - was purchased by one of Epstein's companies in April 1998 for $7.95million. Nearby Great St. James, through roughly twice as big at 160-plus acres, is largely undeveloped, and Epstein purchased it primarily to keep tourists away from his hideaway. ",
        "In 2016, Epstein spent $18million on Great St. James Island, which once was popular with locals and tourists for its main attraction, the Christmas Cove nature preserve.",
        "Virgin Islands prosecutors in 2020 accused Epstein of bringing girls as young as 11 to the islands and sexually assaulting them.Mr Deckoff, who has lived in the US Virgin Islands since 2011, says that he never met Epstein and had not stepped foot onto his land until they were marketed following the financier's death.Speaking about his acquisition of the islands, Mr Deckoff, who has a net worth of $3 billion according to Forbes, said: 'I've been proud to call the U.S. Virgin Islands home for more than a decade and am tremendously pleased to be able to bring the area a world-class destination befitting its natural grace and beauty.'Mr Deckoff made his fortune in private equity, progressing through several firms including Drexel Burnham Lambert, Bear Stearns and Kidder and Peabody &amp; Co. before building Black Diamond Capital.",
        "Last August, Dirt reported that in addition to his property in New York and a multi-million dollar villa in the Virgin Islands, Mr Deckoff and his wife Pamela forked out more than $13.2m on a luxurious home in the mountains above Beverly Hills.The property is in exclusive area - sitting directly between the late Paul Allen's $45m estate and billionaire tech heiress Sophie Schmidt's $29m mansion across the street.Mr Deckoff's equity firm manages $9billion in assets and specializes in high-yield debt, distressed debt, restructuring and business turnarounds. ",
        "In a press release today, SD Investments LLC - a firm founded by Mr Deckoff - said that 'a significant portion of the sale proceeds are being paid to the Government of the U.S. Virgin Islands under a previously announced settlement agreement between the government and Mr. Epstein's estate.'Under the settlement announced by the Virgin Islands Department of Justice in December, half of the proceeds from the sale of Little St. James, 'the island on which Epstein resided and on which many of his crimes occurred', will be put in a trust to provide support for sexual abuse victims.Epstein's estate also agreed to pay $105m to the US Virgin Islands to settle sex trafficking and child exploitation claims - and and another $450,000 payment 'to remediate environmental damage around Great St. James,' where Epstein 'razed the remains of centuries'-old historical structures of enslaved workers to make room for his development.'Mr Deckoff is currently retaining architects and engineers to develop the resort - which he hopes will open in 2025."
    ]
}