{
    "articleURL": "/wires/reuters/article-12058387/After-salvaging-road-trip-Brewers-return-home-face-Dodgers.html",
    "content": [
        "After salvaging the final game of their Western road trip, the Milwaukee Brewers will turn to right-hander Freddy Peralta to keep the momentum going against the visiting Los Angeles Dodgers on Monday in the opener of a three-game series.",
        "Peralta (3-2, 3.63 ERA) will be opposed by right-hander Tony Gonsolin (0-0, 3.38), who is making his third start since coming off the injured list.Milwaukee topped San Francisco 7-3 on Sunday after dropping the first five games of the road trip, including a sweep at Colorado. Adrian Houser was activated off the injured list and made his season debut for the Brewers, allowing two runs in 4 2/3 innings. Willy Adames hit his 100th career homer and drove in four runs.The Dodgers rallied for a dramatic 5-2 victory at San Diego in 10 innings on Sunday. Mookie Betts tied it 2-2 with a two-out solo homer off closer Josh Hader in the ninth and James Outman had a two-run homer in the 10th to help give the Dodgers the rubber match of the three-game series.Prior to Sunday's 12-hit outburst, the Brewers had scored 14 runs in the first five games of the trip. Milwaukee is 16-3 when scoring at least four runs, 3-12 when scoring three or fewer.\"Obviously not a good trip, but salvaged it with a nice game today,\" Brewers manager Craig Counsell said. \"Always nice flying a long flight and coming home with a win.\"Despite the road struggles, the Brewers actually moved within a half-game of first place in the National League Central behind Pittsburgh, which has lost seven straight.",
        "In his last start, Peralta gave up a pair of solo homers in six innings, striking out a season-high 10, but did not get the decision in a 3-2 loss at Colorado last Tuesday.\"I thought Freddy pitched well, for sure,\" Counsell said after Peralta's last start. \"Two pitches, really, but he pitched exceptionally well.\"Peralta, 10-5 with a 2.81 ERA as an All-Star in 2021, has shown no signs of the shoulder issues that limited him to 78 innings last season.\"I think Freddy's pitched well a whole bunch,\" Counsell said. \"Maybe, the San Diego start (five runs in five innings), he might want some of that back, but the rest of the outings have been plus-plus. He's in a good spot to continue to perform well.\"Peralta is 1-1 with a 1.93 ERA in three career starts against the Dodgers, including a 4-0 loss last season at American Family Field.Gonsolin, 16-1 with a 2.14 ERA last season, has made two starts since coming off the IL on April 26.In his first start back, he tossed 3 1/3 scoreless innings in an 8-1 loss at Pittsburgh, allowing two hits and three walks in a 65-pitch outing.His last time out, Gonsolin allowed three runs on five hits in 4 2/3 innings, striking out three and walking two, but building up to 80 pitches in a 13-4 win over the Phillies.",
        "\"Tonight, getting Tony, his pitch count up, getting him into the (fifth) inning, I thought was great,\" Dodgers manager Dave Roberts said after Gonsolin's last start.Gonsolin is 2-0 with a 0.75 ERA in two starts against Milwaukee, both last season, allowing one run on five hits over 12 innings, with 11 strikeouts and three walks.The Dodgers, who have won eight of their last nine, will return home to host the Padres after the three games in Milwaukee.--Field Level Media"
    ]
}