{
    "articleURL": "/wires/reuters/article-12058013/Lakers-aim-command-series-vs-Warriors.html",
    "content": [
        "Back in charge of their Western Conference semifinal series once more, the Los Angeles Lakers will see if their advantage can stick this time.",
        "The Lakers took a 2-1 series lead Saturday with a dominating 127-97 victory in Game 3 as the scene shifted to Los Angeles. With another home game on Monday, the Lakers have a chance to move a victory away from their first Western Conference final since they were 2020 NBA champions.Anthony Davis scored 25 points and grabbed 13 rebounds for the Lakers on Saturday, while LeBron James added 21 points. Neither played more than two minutes in the fourth quarter with the outcome well in hand.\"I don't want to say we dominated them,\" James said. \"I think we played the game the right way. One thing we were not very good at in Game 2, we weren't very forceful at the rim. We allowed their pressure to get us on our heels in Game 2. We're very good when we get into the paint. That's just who we are.\"Davis had just 11 points in Game 2, while James had 23. Davis was more assertive in Game 3, by shooting 7 of 10 from the field and drawing enough fouls to go 11 of 12 from the free-throw line. He was 5 of 11 from the field in Game 2 and took just one free-throw attempt.However, Davis appeared to come away with an injury to his left rib cage on Saturday when he fell on the Warriors' Draymond Green in the first half. He remained in the game but appeared to clutch at his side often. Even so, he sounded more than ready to take the court for Game 4.",
        "The Lakers pulled out the victory at Golden State in Game 1, with the Warriors orchestrating a resounding response. Golden State will have to rebound again in order to even the series before it heads back to San Francisco for Game 5 on Wednesday.\"We'll respond and we have a lot of confidence in our ability to do that,\" said the Warriors' Stephen Curry, who scored 23 points on 9-of-21 shooting (including 4-of-10 success from 3-point range) on Saturday.The Warriors looked comfortable early in Game 3, taking a 30-23 lead after one quarter. But the Lakers put together a 22-2 run in the second quarter and led 59-48 by halftime. Los Angeles never trailed in the second half.While the Warriors were called for four fouls in the first quarter, they were whistled for nine in the second period, when the Lakers went 11 of 15 from the free-throw line. The Warriors were 1 of 1 from the line in the second quarter.\"The game stopped,\" Green said. \"It is what it is. Game over now. Doesn't matter if I'm satisfied.\"Golden State's Andrew Wiggins scored 16 points while Klay Thompson had 15 on 3-of-9 shooting from 3-point range. The Warriors hit 13 of 44 (29.5 percent) from long distance on Saturday after they were 42 of 95 (44.2 percent) through the first two games of the series.",
        "\"At the end of the day, it doesn't matter if you win by 30 or lose by 30, it's still 2-1 (in the series),\" Thompson said. \"We have to remind ourselves we have a chance to even the series and go home. As ugly as (Game 3) was, we have an opportunity to respond on Monday, so there is no point in hanging our head and getting discouraged.\"--Field Level Media"
    ]
}