{
    "articleURL": "/news/article-12049041/Truth-Ukraine-invasion-smuggled-Russia-inside-popular-computer-game.html",
    "content": [
        "The Finnish newspaper created a devastated and war-torn Slavic city 'Vonya'Russians have been prohibited from accessing media content produced abroadREAD MORE: Putin seen in the Kremlin for the first time since drone attackThe truth about the Ukraine invasion was smuggled into Russia inside a very popular computer game. ",
        "Finland's largest daily newspaper, Helsingin Sanomat, fought against the county's intense media restrictions by hiding news about the war in Ukraine inside the shooter game Counter-Strike. The publication's editor-in-chief, Antero Mukka, said the paper had to get creative in trying to breach the restrictions.This was felt necessary after Russia cracked down on independent journalism and banned free reporting. Since Moscow set their 'special military operation' in motion, Russians have been prohibited from accessing media content produced abroad. ",
        "Mr Mukka said: 'As we have been widely concerned about the press freedom situation and freedom of speech in Russia, we decided that maybe it's possible to find some new channels to provide Russian audience with some reliable, independent journalism for example about the situations in Ukraine.'Counter-strike, which is popular among Russian men, was released by the US-based private game maker Valve Corporation in 2012.The newspaper created a devastated and war-torn Slavic city named 'Vonya' to showcase the harrowing despair which has been being inflicted upon Ukraine. This word 'vonya' means war in Russia and residents have been banned from referencing the word to the conflict in Ukraine. The eerie room is confined in blood-red walls featuring news articles detailing the gruesome and devastating truth behind the war. The creators have draped heartbreaking photographs of the destruction and despair that is spreading through Ukraine at the hands of Russia.",
        "They have also included a large map detailing the different attacks launched on innocent civilians. ",
        "'You will find there a secret room, and there we provide them our own articles, our own documentation, for example, about massacres in Bucha and Irpin, and also the casualties of the Russian army there in Ukraine,' Mr Mukka added. Game users are allowed to create their own content on the platform and so the media company did not need to ask for permission from Valve. While the game content may not be shared nationally on the front of newspapers, Finnish journalists are hopeful that at least some Russians will stumble across their dark room of news. 'If some young men in Russia, just because of this game, happen to think for a couple of seconds what is going on in Ukraine then it's worth it,' he added. "
    ]
}