{
    "articleURL": "/news/article-12051681/MAUREEN-CALLAHAN-Women-youre-told-race-against-biological-man-IGNORE-starting-gun.html",
    "content": [
        "How can you win a race that’s rigged?",
        "There’s no other way to describe what’s happening in women’s cycling — the latest sport to be infiltrated by biological males competing, and winning, as trans women.Meet Austin Killips, called ‘the Lia Thomas of women’s cycling’ by three-time Olympic cyclist Inga Thompson.On Sunday, the 27-year-old Killips, who began transitioning in 2019, became the first openly transgender woman to win Tour of the Gila, a UCI women’s race in New Mexico.Killips beat her nearest competitor by a whopping 89 seconds.She was also awarded a ‘Queen of the Mountains’ jersey and a $35,000 prize.That’s how much of the coverage reads: Killips ‘won,’ ‘was awarded.’ESPN called it a ‘triumph.’Let’s call it what it really is: Thievery. Cheating. Making a mockery not just of women’s sport but of biological female athletes who have sacrificed everything for their brief time competing at the highest levels.Here's a tidbit that’s gone largely unreported: This was the first year that women racing in Tour of the Gila’s 36-year history won a monetary prize equal to UCI men. Talk about irony.How utterly gutting.Yet Killips, as Lia Thomas does, insists that she is the real victim here.‘It is incredibly painful to be othered,’ Killips griped to Cyclingnews after her win.",
        "Let’s talk pain, shall we? Pain is being part of a cohort that has fought long and hard for basic human rights — is still fighting, actually — and is told to step aside and allow biological males into your hard-won spaces.Pain is being told that you don’t matter, that the rights of another marginalized group supersede yours, and that to question the intrusion of biological men into your elite sport — biological men who often can’t hack it against their equals but blow away biological females — is to be a bigot.What nonsense.Yes, the UCI, just like women’s NCAA swimming, requires that biological men suppress testosterone levels if they want to compete against biological women.But that's not enough. Any athlete born biologically male retains distinct advantages over those born female: Greater lung capacity, longer and bigger bones, different and dominant musculature.Even a study published by the NIH supports this.According to a paper published in August 2022, there is little hope for biological females ever winning against trans competitors, 'because males are faster, stronger, and have greater endurance capacity.’‘Male physiology underpins their better athletic performance including increased muscle mass and strength, stronger bones, different skeletal structure, better adapted cardiorespiratory systems, and early developmental effects on brain networks that wires males to be inherently more competitive and aggressive.’",
        "‘Testosterone secreted before birth, postnatally, and then after puberty is the major factor that drives these physiological sex differences.’The paper went on to assert that suppressing testosterone levels makes no real difference: 'Using testosterone levels as a basis for separating female and male elite athletes is arguably flawed. Male physiology cannot be reformatted by estrogen therapy in transwoman athletes because testosterone has driven permanent effects through early life exposure.'This is science. As the saying goes, feelings aren't facts. Women's rights are being serially eradicated.The backlash, finally, is mounting. Here was Inga Thompson on Twitter two days ago: ‘All of us used to be “polite” and “respectful.” But you actively tried to shame and silence us. We will not be silenced any longer. Women Athletes are furious. Can you feel the heat! We will not allow gender doping anymore.'Gender doping — haven’t heard that term before. But it feels apt, does it not?‘This is beyond disappointing,’ Olympic swimmer Sharron Davies told Mail Sport of Killips’s win. ‘Those in charge should hang their heads in shame. The UCI is not fit for purpose.’Alison Sydor, a former world champion cyclist, tweeted: ‘The current UCI rules that allow males to compete in female cycling events are not fair to female athletes. Time for UCI to admit this current rule situation is unsustainable and leaving a black mark on cycling as a fair sport for females.’",
        "Such is the outrage that on Thursday, the UCI announced they would reconsider whether trans women should compete against biological females — just two days after asserting that ‘transgender athletes may wish to compete in accordance with their gender identity.’",
        "The UCI's turnabout is a start. And it's proof that continued protest matters and that more voices — those of elite and pro athletes especially — are needed. Let's see if the UCI has the guts to do what's right here.In the meantime, the Twitter feed @FemaleAthleteTM has a long list of biological males competing as females and suddenly out-performing themselves. Among them:Jenna Lingwood, who raced as a man until 2018 and won the Women’s 40-44 Masters National Cyclocross last December.Jillian Bearden, who raced for years as a man and began transitioning in 2014, while in her early 30s, and helped change the International Olympic Committee’s rules for male-to-female athletes in women’s competition.No longer are ‘surgical anatomical changes’ a precondition — only lowered testosterone levels and a doctor’s note.Bearden, you won’t be surprised to learn, has been doing better against biological females than she ever had against males. In fall 2016 Bearden won Arizona’s El Tour de Tucson.‘She’s a podium contender,’ said the Denver Post, ‘and she’s ready for the hate that might bring.’",
        "Tiffany Thomas, 47, who began racing in 2018 after getting winded while walking in NYC and then got a Peloton. Thomas handily beat biological female competitors ranging in age from 24 to 32 in a New York City race in March — her 20th win.Yet we are constantly bullied into believing that inclusion in women’s sport is only fair. That there are no real consequences for biological females.To which I say: Tell that to Hannah Arensman, a top female cyclist with 35 national wins who retired at age 24 after routinely getting beaten by trans cyclists.",
        "As she wrote in an amicus brief to the US Supreme Court, seeking protection for biological women in sports: ‘It has become increasingly discouraging to train as hard as I do only to have to lose to a man with the unfair advantage if an androgenized body that intrinsically gives him an obvious advantage over me, no matter how hard I train.‘I have decided to end my cycling career. At my last race at the recent UCI Cyclocross National Championships in the elite women’s category in December 2022, I came in 4th place, flanked on either side by male riders awarded 3rd and 5th places . . . I have felt deeply angered, disappointed, overlooked and humiliated that the rule makers of women’s sports do not feel it is necessary to protect women’s sports to ensure fair competition for women anymore.’",
        "Arensman is 100 percent right. All that rigor and discipline and pain, only to be discredited and diminished. To lose money and endorsements and your life’s work. Your goals and dreams.There’s really only one thing for biological female athletes to do: Refuse, no matter your sport, to compete against biological males. Show up en masse and sit down. Ignore the starting sound. Embarrass all these cowardly governing bodies and make sponsors question who it's really profitable to endorse in the world of women’s sports.Ladies: Strike! Now is the time.As sports scientist Ross Tucker tweeted, ‘Thanks to the abdication of its leaders, sport will move from “moment” to “moment” until enough people recognize biological reality &amp; respect women’s rights. The only question is whether cycling realizes it this time, or does it need more moments?’It’s not just cycling. It’s not just about elite athletes.Sport has always been about so much more than sport — it’s a reflection of what we value as a culture, premised on nothing more so than that essential tautology: Fair is fair.What’s happening to biological women everywhere isn’t fair. Anyone can see it. The only question is: Will our sisters in sport strike the first blow?"
    ]
}