{
    "articleURL": "/news/article-12042885/Wholl-NEXIT-countries-likely-join-Britain-ditching-Brussels-freedom.html",
    "content": [
        "Brexit did not prove to be the pandora's box of anti-EU rebellion some had fearedBut euroscepticism is still very much alive and well in several EU member statesWhen Britain voted to leave the European Union on June 23, 2016, pro-EU commentators warned that a eurosceptic domino effect could drive other countries to follow suit.",
        "But Brexit did not prove to be the pandora's box that many European bigwigs feared, and no other member state has since made plans to leave the bloc.COVID-19 wrought havoc on the economies of many European countries who have since depended on EU recovery funds in the wake of the pandemic, and Vladimir Putin's invasion of Ukraine has been instrumental in fostering solidarity between EU states to levy economic sanctions against Moscow and send arms to Kyiv. Nevertheless, euroscepticism is still very much alive and well across the continent, with Jimmie Akesson, the leader of Sweden's second largest political party, writing this week that there are 'good reasons to seriously re-evaluate our membership in the union'. And even some of the EU's most powerful and long-standing members continue to harbour their fair share of doubts over the involvement of the bloc in their nations' affairs. Now in light of Akesson's latest comments, MailOnline takes a look at which countries in Europe may one day make a bid for freedom from the EU - or seek to reduce Brussels' influence from within. ",
        "GreeceGreece has had a rocky relationship with the EU since it joined the bloc in 1981. The country's debt crisis, which began in 2009, has been a major source of tension between Greece and its EU partners. ",
        "The EU's insistence on austerity measures as a condition for financial aid has been deeply unpopular in Greece, with many people feeling that the country has been humiliated by its EU partners.Greek Prime Minister Kyriakos Mitsotakis has gone great lengths to repair his nation's relationship with the European bloc, voicing his support for Brussels while successfully boosting Greece's economy and paying back debts early.But his New Democracy party is set to lose its majority in elections later this month and the attitude of the Greek people towards the EU is among the worst on the continent. The bloc's most recent polling of member states' attitudes in February 2023 found Greece to be the most anti-EU.A total of 53 per cent of citizens claimed they were pessimistic about the future of the EU, while 60 per cent said they did not trust the EU - the highest score of any member state. And with Mitsotakis likely to lose out to more anti-European political groups later this year, Greece's future in the union is far from certain. ",
        "ItalyItaly has always been a Europhile country and is one of the founding members of the European Union. But the events of the last few years have made Italians more disillusioned with the EU than ever before. ",
        "The country was hit hard by the COVID-19 pandemic, and the EU's response was criticised for being slow and ineffective. Then in the run up to September's elections, Italian nationalist leader Giorgia Meloni's fiery rhetoric and historically anti-European stance saw her labelled by German media as 'the most dangerous woman in Europe'.In reality, the head of the most right-wing government Italy has seen since World War Two has chosen caution over confrontation with Europe in the eight months since her sensational victory.In her first trip to Brussels in November, Meloni professed her support for the EU and has largely approved of the bloc's attitude towards the war in Ukraine, inflation, and energy prices.But some analysts believe the Italian premier is simply playing along with the EU out of necessity as a result of Italy's financial woes.",
        "At nearly 150 per cent of GDP, Italy has the third largest public debt pile in the industrialised world after Japan and Greece, and Rome is heavily dependent on the European Union's recovery and resilience fund. ",
        "Meloni's nation stands to receive some 190 billion euros in grants and loans so long as her government fulfils a series of reforms agreed with the previous administration.But according to the most recent Eurobarometer survey, only 50 per cent of Italians trust the EU, and many suspect Meloni is simply biding her time, consolidating support for her Brothers Of Italy party and benefitting from EU cash while figuring out how to loosen Brussels' grip on her nation's affairs. ",
        "And Italian deputy prime minister Matteo Salvini, who heads the right wing Northern League party working in coalition with Meloni's Brothers Of Italy, once famously called the European Union a 'cage of crazies'.FranceFrance has always had a complicated relationship with the EU. It is one of the founding members of the bloc and its second-largest economy, with French leaders proving instrumental in shaping EU policy over the years. But France has also been one of the most vocal critics of the EU, with many French people feeling that the country has lost its sovereignty to Brussels.French euroscepticism peaked in the last decade when Marine Le Pen, leader of the right wing populist National Assembly party, made leaving the EU a key part of her political platform.Following defeat in the 2017 election, Le Pen abandoned full 'Frexit' plans, but confirmed her intention to soften the EU's bureaucratic hold over France from within. Ahead of last year's election, the National Assembly leader wanted to establish national border controls on imports and people, reduce the French contribution to the EU budget and cease to recognize that European law has primacy over national law.She described her approach as 'a people's initiative referendum', and left the door open for a future Frexit, declaring in her campaign that it is up to the French people if they want to leave the EU.",
        "France's current president, centrist and consummate EU statesman Emmanuel Macron, narrowly defeated Le Pen last year to win a second term in power. But his approval rating in France is now at an all-time low following months of widespread protests against disastrous and heavy handed pension reforms which have united the country against him.Meanwhile, February's Eurobarometer survey found 57 per cent of French people do not trust the European Union, with 50 per cent of the population pessimistic about the bloc's future. Sweden The leader of Sweden's second largest party yesterday sparked fresh eurosceptic debate when he declared it was time to 're-revaluate' the country's membership of the EU.Jimmie Akesson said the EU's ever-expanding power meant 'German, Polish or French politicians, in practice decide what car you can buy, how expensive petrol should be and which tree you can cut down on your own property'.The leader of the Sweden Democrats said the country should seek more exemptions from EU laws as part of a reset in relations with the 27-member group.Akesson, whose anti-immigration party has a big influence over Sweden's right-of-centre government, stopped short of directly calling for 'Swexit', but he said the EU was heading in the wrong direction.",
        "'Today, there are good reasons to seriously re-evaluate our membership in the union,' Akesson wrote in the daily newspaper Aftonbladet earlier this week. ",
        "'Our general elections in Sweden will soon cease to have any significance in Sweden's development. Naturally, we can't allow that to happen.'Akesson warned the EU might impose more liberal immigration policies on Sweden, which has taken an increasingly tough line in recent years on asylum applications.But the prospect of a Swexit is highly unlikely - Swedes are among the most positive in Europe regarding EU membership, with 63 per cent of people claiming they trust the bloc, and 73 per cent remaining optimistic about its future, according to Eurobarometer.Hungary Hungary's authoritarian president Viktor Orban has made himself somewhat of a pariah in Europe as of late. Despite his country being a member of both the EU and NATO, Orban has maintained a strong relationship with Vladimir Putin throughout the war in Ukraine and has continually advocated for a softer Western stance on Russia.Orban's government has also been accused of eroding democratic freedoms in Hungary since taking power in 2010, and using state resources to cement its power. What's more, the Hungarian leader is locked in a battle with top EU officials over access to the bloc's pandemic recovery funds.The nation has been refused access to tens of billions of euros, with the EU declaring it will only grant Orban the funds on the condition the Hungarian government implements a long list of reforms to comply with European democratic and legislative standards.",
        "This level of influence exhibited by Brussels over Budapest is one of the key problems anti-EU commentators point to when arguing the virtues of leaving the bloc.But in Hungary's case, the union's insistence on a change of legislation extends beyond anti-corruption measures and strengthening the rule of law.The European Commission, the EU's legislative and executive arm, decreed that a large portion of funds earmarked for Hungary cannot be accessed until the nation revamps its stance on human rights, asylum and immigration laws and LGBT rights.To meet the EU's demands would be to conduct a series of major policy U-turns, something Orban and his powerful Fidesz party are highly unlikely to do. Meanwhile, 43 per cent of Hungarians are pessimistic about the EU and 44 per cent distrust the bloc, according to the Eurobarometer. "
    ]
}