{
    "articleURL": "/wires/aap/article-12058085/Broncos-beware-Storm-greats-Munster-home-truth.html",
    "content": [
        "Cameron Munster says sage advice from club legends Billy Slater and Cameron Smith in a leadership group meeting has Melbourne ready to fire against competition leaders Brisbane on Thursday night.",
        "The Storm five-eighth was filthy after the 28-12 loss to South Sydney following a poor display by the team.An hour after full-time Munster was in a huddle in a lengthy discussion in the dressing room with Smith, Slater and the team leaders dissecting what went wrong, and how to fix it ahead of the home showdown with the Broncos on Thursday night.\"Cameron and Slats, they are the masters,\" Munster told AAP.\"We spoke in that leadership meeting about how we are not far away from getting it right.\"We got a bit of closure and a lot of confidence out of that chat. The boys were down about the way we played but a good performance is not far away.\"They just spoke to us about simplifying things and having more communication between our spine.\"When it comes to spinal surgery there is none better than Smith and Slater at identifying issues, after winning multiple titles in their hooker and fullback roles respectively.Queensland Maroons coach Slater works with the Storm on a part-time basis and former skipper Smith, who lives in Queensland, is only too happy to assist when available.Munster said the dynamic duo reinforced that his combination with half Jahrome Hughes and hooker Harry Grant must improve.",
        "\"We agreed there is a bit of disconnect between me, Harry and Hughesy at the moment and it shows when we are close to the line,\" he said\"Everyone is not sure what we are doing. We are probably trying to score off every play and just have to be patient down there.\"We've probably been sugar coating it and tiptoeing around it and letting some stuff slide by. It gives us so much confidence when Smithy and Slats are around us.\"The Broncos haven't beaten the Storm since 2016 but Munster reads nothing into that.\"They are playing with a lot of confidence and we are not playing with a lot,\" he said.\"We need to get back to playing confident, hard, tough footy and get in the dogfight with them.\"Their middles are going forward. (Half) Adam Reynolds is kicking well. (Five-eighth) Ezra Mam is playing class footy and you've got (fullback) Reece Walsh who is lightning out the back of shape.\"You've got to somehow stop that but if we play anything like we did against Souths it will be a similar scoreline.\"The Storm are on 12 competition points and just four points behind the Broncos, but Munster issued a warning\"We have to be smarter,\" he said.",
        "\"Individuals are trying to do things by themselves but if we can gel as a team and connect then it is going to be a good year. If we don't do that, it is going to be early doors and early curtains.\""
    ]
}