{
    "articleURL": "/tvshowbiz/article-12042927/Olivia-Attwood-poses-storm-racy-black-bubblegum-pink-lingerie-sets.html",
    "content": [
        "Olivia Attwood posed up a storm on Tuesday as she modelled sets of lingerie on her Instagram stories. ",
        "The former Love Island star, 31, is set to marry her long-term partner Bradley Dack in June - and the couple were later seen out for a stroll together on Wednesday. She turned up the heat on Tuesday evening in matching black and bubblegum pink lingerie sets from Rihanna's Savage X Fenty line. Olivia put her enviable assets on display in the sexy pieces, which were embellished with tiny pearl detailing and lace trims. She then changed into a loungewear set including black joggers and a grey bra for a more relaxed staying-at-home look. ",
        "Olivia, who has been engaged to 29-year-old Blackburn Rovers footballer Bradley since 2019, pulled back her blonde tresses into a messy bun as she went make-up free for her modelling session in her closet.  It was recently revealed the couple's nuptials and the build-up to their wedding will take centre-stage in her new show, Olivia Marries Her Match.After postponing their wedding a number of times due to the pandemic and Bradley, being injured, the couple are finally set to walk down the aisle in June and their fanbase will have the chance to see all the action unfold.Olivia and Bradley are getting hitched at luxury venue Grantley Hall after scoping out potential locations in the series, which concludes with the pair sharing their romantic day with the show's viewers.",
        "A TV source told MailOnline: 'Olivia and Bradley are so excited to begin filming Olivia Marries Her Match. It has been everything they have dreamed of for years now and finally their day big day is almost upon them.'Olivia's fanbase has watched her grow from her time on Love Island and she can't wait to share her wedding day with them all.'So far this year she's been jam-packed filming the next series of Filthy Rich, which often means her and Bradley are spending days apart.'But filming the build-up to their nuptials will be so special because they will be doing it together, plus they will always have the memories captured to look back on.'",
        "Olivia met Bradley in a nightclub before she starred on Love Island, but the couple found their way back together and have been engaged since the footballer popped the question in 2019.A number of setbacks prevented the pair from sealing the deal, with Olivia revealing to MailOnline in November 2021 that she and Bradley cancelled their 2022 wedding because neither of them wanted to rush making important decisions.Olivia listed several reasons including the pressure on her shoulders with work commitments, Bradley's football schedule and recovering from his injury, plus needing time on their side for their stag and hen dos.",
        "But after three years of planning, they are set to marry in an idyllic ceremony and Olivia's dress, which she's had in her possession for months, will finally be worn.Olivia and Bradley live together in Manchester with their dogs Lola and Stitch and even share matching tattoos in tribute to their 'first babies.'Olivia, who's amassed over 2million followers on Instagram since starring on Love Island in 2017, became the first former Islander to sign up to I'm A Celeb last year.The star's time on the show was short-lived after she was forced to quit the series when a blood test showed that was anaemic, causing concern among ITV bosses.She was rushed to A&amp;E and denied access back into the Australian jungle, with many viewers believing the engaged star discovered she was pregnant while in camp.The real reason was that she had 'dangerously low potassium levels' and producers couldn't take the risk in allowing her to participate in the series.Since the ordeal, Olivia admitted she struggled with flying back to the UK while her jungle co-stars including winner Jill Scott and former Radio 1 DJ Chris Moyles continued to take part, after feeling as though she missed out on the opportunity."
    ]
}