{
    "articleURL": "/wires/ap/article-12058445/Kraken-ride-2nd-period-outburst-thump-Stars-7-2-Game-3.html",
    "content": [
        "SEATTLE (AP) - The demands of a seven-game series in the opening round and the immediate transition into the conference semifinals left the Seattle Kraken needing a breather.",
        "An extra day off proved wonders for the playoff newcomers.Jordan Eberle sparked a five-goal outburst in the second period with his fourth goal of the playoffs, Philipp Grubauer made 24 saves and the Kraken beat the Dallas Stars 7-2 on Sunday night to take a 2-1 series lead in their Western Conference semifinal.\"We´ve been going steady here every other day since the start of the playoffs,\" Eberle said. \"So you get a couple of days off, not just for your body but for your mind, too.\"Seven different Seattle players scored and 12 different players picked up a point as the rejuvenated Kraken took control of the series.Eberle got it all started as the recipient of an unfortunate bounce, beating Dallas goalie Jake Oettinger at 2:10 of the second period after the puck hit Stars defenseman Miro Heiskanen in the face and fell to Eberle´s stick.",
        "That was just the start. Alex Wennberg doubled the lead 1:26 after Eberle´s goal; Carson Soucy became Seattle´s 16th different goal scorer this postseason, beating Oettinger five-hole at 6:30; and Matty Beniers made it 4-0 at 8:22.Seattle´s first four shots of the period beat Oettinger, and the Kraken made it 5-1 when Eeli Tolvanen finished a rebound with 37 seconds left in the period.",
        "\"We wanted to get into it early. I think that´s why the physical play helped us and then after our first period, we kind of realized we´re fresh, we got some momentum and then we just took it and ran in the second,\" Soucy said.It was the second time in three games of the series that Oettinger had surrendered five goals after Dallas lost the opener 5-4 in overtime. Oettinger gave up four goals in the first period of Game 1 and Seattle became the first team this postseason to score five times in a single period.Oettinger had 12 saves on 17 shots and was replaced for the third period by backup Scott Wedgewood. Wedgewood was greeted with a short-handed breakaway by Seattle and Yanni Gourde´s third goal of the playoffs on the Kraken´s first shot of the third period. Justin Schultz added a seventh for Seattle with 2:30 left on the power play.Game 4 is Tuesday night.\"They came out and played hard tonight. We probably deserved what we got,\" Dallas' Jamie Benn said. \"They were the hungry team.\"It's the second straight series the Stars split the first two games at home only to be routed in Game 3. Dallas lost 5-1 to Minnesota in Game 3 in the opening round before winning the final three games of the series.",
        "\"I think the good news is it really mirrors our Game 3 in Minnesota. We were in the exact same spot, and we played pretty much the exact game,\" Dallas coach Pete DeBoer said. \"We responded the right way in that series, and we gotta make sure that happens here.\"Equally concerning for the Stars was Heiskanen, who was left bloodied on his left cheek by the puck to the face and did not return to the game. The original shot from Tye Kartye appeared to deflect off Ryan Suter´s stick and Heiskanen was not prepared for the ricochet.DeBoer said the score played a role in the decision not to have Heiskanen return, but didn't provide clarity on whether he'd be available for Game 4.Meanwhile, Grubauer was excellent again for Seattle. Mason Marchment pulled Dallas within 4-1 late in the second period finishing a one-timer from Evgenii Dadonov, but Grubauer was very good the rest of the period with breakaway saves on Roope Hintz and Jason Robertson, and a lunging save with his blocker on a deflected puck that looked to be going over his head and toward the net.Jani Hakanpää scored his first of the playoffs with 13 minutes left.\"That team on the other side can score and they can score in bunches, and their veteran presence can can find momentum in those situations, so (Grubauer) was key at those times for us,\" Seattle coach Dave Hakstol said.",
        "SWEET 16According to the NHL, the Kraken are the fifth team in the past 25 years to have 16 different players score a goal within the first 10 games of a single postseason. That group doesn´t include Jared McCann, who led Seattle with 40 goals in the regular season, but has been out since Game 4 of the opening round due to injury.WATCH PARTY CANCELEDThe Stars canceled a watch party that was planned during Sunday´s game in the plaza outside their home arena. That is less than 30 miles from a Texas outlet mall where an assailant killed eight people on Saturday. The Stars said they canceled the watch party outside the American Airlines Center out of respect for the victims, families and community of Allen.___AP NHL: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}