{
    "articleURL": "/wires/reuters/article-12043323/U-S-SEC-adopts-new-rules-private-fund-disclosures-share-buybacks.html",
    "content": [
        "By John McCrank",
        "NEW YORK, May 3 (Reuters) - The U.S. Securities and Exchange Commission on Wednesday adopted new disclosure rules for hedge fund and private equity fund advisors aimed at increasing transparency, competition, and efficiency in the $25-trillion marketplace.The rule-making updates Form PF, which was put in place following the financial crisis of 2008-2009 to monitor risks in the rapidly growing private fund sector, to boost the quality of confidential regulatory disclosures by large funds about their investment strategies and leverage.\"I think that this final rule, through the greater visibility into funds it will provide to regulators, will help protect investors and promote financial stability,\" SEC Chair Gary Gensler said in an open meeting ahead of the vote.Under the new rules, large hedge fund advisors have to inform financial regulators on certain events that may indicate significant stress or otherwise signal the potential for systemic risk and investor harm, such as significant margin calls or counterparty defaults, within 72 hours of the event.The regulator also adopted a final rule to enhance the disclosures companies make around share buybacks that requires quantitative disclosure of daily repurchases on a quarterly or semi-annual basis, depending on the type of issuer. The aim of the rule is to provide investors with more information to assess the purposes and effects of share repurchases, which last year amounted to nearly $950 billion, the SEC said.",
        "\"Through these disclosures, investors will be able to better assess issuer buyback programs,\" Gensler said. \"The disclosures will also help lessen some of the information asymmetries inherent between issuers and investors in buybacks. That's good for investors, issuers, and the markets.\" (Reporting by John McCrank Editing by Mark Potter)"
    ]
}