{
    "articleURL": "/wires/ap/article-12041433/Colombias-Petro-begins-visit-Spain-boost-peace-plan.html",
    "content": [
        "MADRID (AP) - Colombian President Gustavo Petro began a state visit to Spain on Wednesday to seek support for his peace plan for the South American country while urging for greater action against climate change from Europe.",
        "King Felipe VI and Queen Letizia greeted Petro and his wife in Madrid, where they will later attend a state dinner hosted by the Spanish royals.Prime Minister Pedro Sánchez, Spain´s Socialist leader, is a backer of Petro, an ex-rebel who became Colombia´s first leftist president last year.One of the main topics on his agenda is his peace process with the National Liberation Army (ELN), a communist-inspired guerrilla organization still active after the dissolution of FARC, a group which spent decades pursuing rebellion.Colombia´s government and the ELN started talks in November, shortly after Petro was elected president. Petro has called the talks a cornerstone of his effort to resolve a conflict that dates back to the 1960s.Last week, ELN militants killed nine Colombian soldiers in an attack, complicating efforts by Petro to negotiate a lasting peace.",
        "The Colombian leader seeks Spain's full support for his plan, which he will likely explicitly obtain from Sánchez, according to reports from high-ranked officials in the European country.Starting in July, Spain is set to hold the European Union's rotating presidency, a six-month period in which Madrid aims to revitalize Europe´s relations with Latin America. That includes plans by Spain to hold a summit between Latin America and the EU in the early days of its presidency.",
        "Petro, 63, started his speech before the joint session of parliament by recalling the importance of his early reading of Don Quijote and the role of Spain in Colombia's cultural imagination, but he quickly moved on to warning of what he called the existential threat to humanity posed by global climate change.The environmental message was timely for Spain´s lawmakers, who are managing a prolonged drought after a record-hot 2022.\"We are on the brink of extinction or change,\" Petro said. \"There is no time to waste. This is no longer just a political debate - it's an order given to us by science. You can believe or not believe as if this were a religious question, but this is still science.\"Lawmakers from Spain´s far-right Vox party left the chamber before his speech in protest against the leftist leader. Vox supporters held a small protest outside the parliament.The visit to Europe comes two weeks after Petro traveled to Washington to meet with U.S. President Joe Biden amid deep differences on drug policy and Venezuela. But they did find some common ground on their concern for the adverse effects of climate change.Spain recently announced a collaboration with the United States and Canada on establishing migrant centers in Latin America to facilitate orderly and safe migration.",
        "\"It is a step forward for Spain, which is taking the initiative regarding a certain lack of action by Europe in this matter,\" Anna Ayuso, senior researcher for Latin America at the Barcelona Centre for International Affairs (CIDOB), told The Associated Press.Spain is the leading European recipient of Latin American migration - some 500,000 Colombians live in Spain - and in recent months it has sponsored specific initiatives to accept migrants from American countries in humanitarian situations. One of these initiatives was offering nationality to 100 Nicaraguan opponents exiled by Daniel Ortega in February 2023.\"There is a shift of strategy from emphasizing containment, as promoted by (former U.S. President Trump), to facilitating orderly migration and preventing irregular migration, which, in the end, encourages international crime,\" Ayuso said.Petro´s is the only state visit that Spain is set to host this year. Felipe and Letizia welcomed Petro and his wife, Verónica Alcocer, whose car arrived at the Royal Palace accompanied by soldiers on horseback. A military band played and cannons were fired in their honor.The Colombian leader will sit down with Sánchez on Thursday, when he will attend a meeting with the Spanish Confederation of Business Organizations.The confederation is the country´s leading business group, representing 2 million companies and self-employed entrepreneurs. Petro is expected to push his economic agenda, particularly in green energy and digitization.",
        "\"Petro wants to present Colombia before Europe not only as a country committed to peace but also a stable one that deserves the trust of investors,\" Ayuso said.On Friday, Petro will visit Salamanca University, where he studied.___Joseph Wilson contributed to this report from Barcelona."
    ]
}