{
    "articleURL": "/news/article-12043915/GOP-Senate-candidate-Bernie-Moreno-accused-reinventing-familys-wealthy-roots.html",
    "content": [
        "Bernie Moreno's previous interviews boasting about his 'wealthy' upbringing have raised questions about his alleged roots as a poor Colombian immigrantIn recent campaign events, the Ohio Senate Republican candidate, 56, claimed his parents 'left everything behind' to move to the US when he was a child But in interviews years earlier, Moreno spoke about growing up in 'generational wealth', admitting his mother moved to the US to prevent spoiling him A candidate vying for the Republican nomination for Senate is being accused of reinventing his family's 'outsized privilege' to compare himself with Latin American refugees who arrived in the US with 'absolutely nothing' – in a heated spat among the state's GOP.",
        "Bernie Moreno, 56, announced his candidacy against incumbent Democrat Senator Sherrod Brown last month for what is sure to be a hotly-contested 2024 race in Ohio.But his U-turn on his support for Donald Trump and his alleged switch from boasting about his family being 'generationally wealthy' with 'so much money', mansions, and staff in Colombia, to comparing himself to destitute immigrants, has drawn the ire of GOP strategists in his state.In interviews with DailyMail.com some even labeled Moreno 'the second coming of George Santos', the New York Republican congressman famously caught in a series of brazen lies about his resume and past.Moreno's spokesman, Conor McGuiness, rejected the comparison, calling it a 'desperate and cowardly' smear attempt, and says there is nothing inconsistent about the would-be Senator's statements.",
        "The critical comments suggest in-fighting is already beginning for the up-for-grabs Republican candidacy for the Ohio seat next year.At two town hall events in March, Moreno said that his family came to the US with 'absolutely nothing' and 'left everything behind' in Colombia.'Just before my fifth birthday, my mom decided, without 100 percent of my dad's commitment, to bring my six brothers and sisters to America,' he said in a recording of one event obtained by DailyMail.com.'We left everything behind in Colombia because she wanted to live in a place where your destiny was determined by your hard work, your perseverance ... we came here with absolutely nothing… nine of us in a two-bedroom apartment.'",
        "In an August 2021 interview with the Jewish Insider, the politician said his family story is the 'same' as Cuban immigrants fleeing their own country who 'had a government that was imprisoning us for our beliefs, that was taking away our businesses, taking away our rights'.'It was the same story I remembered as a kid growing up that I saw from Cuba,' said Moreno – who stirred controversy last month by suggesting reparations for white descendants of Union soldiers who fought in the Civil War to free enslaved people.And in an April 2021 Senate campaign video, Moreno said he 'came from a country surrounded by the ideology of radicals like Fidel Castro and Che Guevara who promised to give everyone all they needed and solve all their problems.'But Republicans unhappy with the Ohio businessman's story pointed out that in 2020, before entering politics, the GOP candidate was instead emphasizing his wealthy background.In a January 2020 interview with the Up2 podcast he described his parents as 'privileged' with both coming from wealthy families in Colombia, and that he grew up with 'multiple' properties in the country, 'staff', and that his father's family home was 'so large that it was converted into the embassy for Germany'.",
        "'So my mother's family has a long history of, I'd say, outsized privilege, which is typical in South America. ",
        "'My dad's family is the same way… generationally wealthy for a long time. 'In fact, I like to joke that in a lot of these developing countries, the families that have wealth forgot how it is that they have so much money,' Moreno told the podcast. 'My mom was an only child, but her dad was extraordinarily successful. My dad was one of 11 kids and his father was extraordinarily successful,' he added. 'My dad went to the best schools, got his master's degree at the University of Pennsylvania in medicine… My mom, even though it was the early 50s, came to the United States to get an education.'Despite his comparison with socialist-run Latin American countries, Colombia was ruled by a Conservative and Liberal coalition when he emigrated in 1971 – an administration in which his father worked as Minister for Health. It was only later that the country fell into widespread violence partly fueled by drug cartels.Unlike refugees or dissidents afraid of persecution in their home countries, Moreno said he 'traveled back to Colombia a lot when I was growing up'.Instead he described his mother's decision to move them to America was to prevent spoiling him and his siblings.'One day my mom decides that she is very disappointed in the way that she felt the family was being raised, that we were seven of us and that we were being raised in an entitled way and she didn't want us to be raised that way', he told the podcast. ",
        "'So she packed up 23 suitcases, seven kids, and flew to Fort Lauderdale where her mother had a condo – a two bedroom condo.'",
        "McGuiness told DailyMail.com that in the Jewish Insider interview his boss 'wasn't comparing his own immigration experience to Cuban exiles,' but instead 'to the people he saw in Colombia when he went back and visited later in life, while that country was being torn apart by Pablo Escobar.'Speaking to the Up2 podcast in 2020, Moreno described starting with a 'lower middle class type life', until his mother bought a home and worked to establish an 'incredibly successful real estate practice with three offices, 100 plus associates'.His father had to drop to a low level hospital job in Florida when he emigrated, but also rose there to become surgery chief, Moreno said.A 1972 letter to Moreno's father from Memorial Hospital in Hollywood, Florida, seen by DailyMail.com said they couldn't hire him due to his lack of a US medical license, and sheepishly offered him a $10,000 assistant role – which he accepted.'We do have a position, known as Surgical Assistant, in which the unlicensed physician functions as the assistant to the operating surgeon,' the letter from the director of medical education said. 'I feel somewhat ashamed to offer the position to a man with your qualifications.'",
        "'It's up to you to achieve wealth and not have it be given to you,' Moreno said in his 2020 interview.GOP strategists opposed to Moreno have sought to compare him to Santos over his statements. Earlier this year Santos admitted lying about working at Citigroup and Goldman Sachs, and attending Baruch College and New York University Stern School of Business'Bernie Moreno is the second coming of George Santos. God forbid Bernie Moreno ends up as the GOP nominee in Ohio', one strategist, who asked to stay anonymous said. 'This is a s***show waiting to happen.'This fact pattern around Moreno is egregious because it directly calls into question his trust and credibility.  'Sherrod Brown would have a field day with it and it's the kind of liability that could spread to other Republican candidates on the ballot in the general election.'",
        "Unlike Santos, there is no evidence Moreno has made up large swaths of his family, education, or career history.McGuinness argued that the quotes 'are not in conflict with each other in any way,' that 'Bernie has never claimed he fled Colombia ' and that the comments were a 'vile' attempt by 'desperate and cowardly political opponents to smear him anonymously'.'Bernie is a well known businessman and community leader in Cleveland and has been for many years now. Nothing in this story shows any inconsistencies regarding his personal or professional background,' McGinness said.",
        "'He's always been clear about his family being wealthy in Colombia and then having to restart when the family moved to Florida.'Gus Hoyas, a former president of the Ohio Hispanic Chamber of Commerce, went to bat for Moreno, saying comparisons with George Santos were merely based on 'blatant racism and xenophobia'.'If Bernie was white instead of South American, they wouldn't be making these ridiculous comparisons. It's disgusting,' he told DailyMail.com.Chris Grant, a successful GOP advisor and founder of Big Dog Strategies who helped steer Santos's campaign to a House seat, has been posting photos on Twitter from Moreno's rallies this month – suggesting the former Santos advisor is now working with the Senate hopeful.Big Dog Strategies lists over 80 Republican candidates and conservative organizations on its website.In an interview with DailyMail.com, a former Republican County Chairman who declined to be named, rounded on Moreno for flipping on his support for Trump, and also compared him to Santos.'Those who know Bernie are shocked with how quickly he reinvented himself. He trashed Donald Trump for years. He didn't vote for Trump and actively encouraged all Ohio Republicans to write in someone else at the polls. 'And now, just like George Santos, he creates a new persona as an outsider out of thin air. It's head spinning and voters won't fall for it.'",
        "Social media archives show Moreno has made previous critical statements of the former president.In now-deleted tweets, the Senate hopeful wrote in 2015 that Trump was Hillary Clinton's 'best fundraiser and ally', that the 'Bully in chief is now cry baby in chief'.Another previous Moreno tweet said that listening to Trump was 'like watching a car accident that makes you sick, but you can't stop looking.'Since then he has turned to praising the former president, saying he 'would be honored to have Donald Trump's endorsement' in 2021 and in February 2022 that he 'look[ed] forward to being [Donald Trump's] strongest and most loyal ally in the United States Senate.'In a statement on his campaign website, Moreno said Trump 'stood up to everyone who rigged the system against outsiders, and he fought for Americans every step of the way.' The flattery appears to have paid off, with his Senate run last week gaining a tacit stamp of approval from Trump.'Word is that Bernie Moreno, the highly respected businessman from the GREAT STATE of OHIO, and the father-in-law of fantastic young Congressman, Max Miller, is thinking of running for the Senate', Trump said on his website Truth Social. 'He would not be easy to beat, especially against Brown, one of the worst in the Senate!''While Bernie, like many others, was initially skeptical of President Trump, he is proud to be the only candidate or prospective candidate in this race to endorse Trump in the 2024 election,' McGinness told DailyMail.com.Ohio Secretary of State Frank LaRose, who has said he is 'actively' considering running for senate, has previously called Trump's tweets racist, and after tapes emerged in 2016 of Trump saying he would 'grab' a woman 'by the p***y', LaRose called the comments 'abhorrent'.One of Moreno's rival senatorial candidates, Matt Dolan, dodged a question of whether he would commit to supporting Trump in the general election if he becomes GOP nominee, in a February CBS interview. "
    ]
}