{
    "articleURL": "/wires/pa/article-12041491/Livingston-boss-David-Martindale-vows-strong-finish-missing-six.html",
    "content": [
        "David Martindale is adamant there is no chance of Livingston winding down in the closing weeks of the season even though they have little to play for.",
        "The Lions spent much of the season in the top half of the cinch Premiership and in contention for a European place but a run of six defeats in nine games before the split led them to slip into the bottom six.Livingston have little chance of being relegated – they are 11 points clear of second-bottom Kilmarnock – but Martindale feels duty-bound to ensure his team do not take their foot off the gas as each of the five sides they will be coming up against are still threatened by the drop.“In the last batch of fixtures we fell a bit short for the top six and we’ve only got ourselves to blame,” he said. “But when you look at the bottom six it would be hard to say there’s nothing to play for when you look at the teams that are around us.“Our next three games are Ross County, Kilmarnock and Dundee United who are all fighting for their lives to stay in the Premiership.“I’ve got to make sure for the integrity of the league, not just Livingston Football Club, that I’m not tinkering with my squad thinking about next season because there’s a lot at stake for teams within the bottom six.",
        "“I’ll be trying to play my strongest team possible because I genuinely do think I’ve got to do that for sporting integrity.",
        "“Have I got one eye on next year? Potentially. But is that going to have an impact on my decision-making just now? Probably not because of the reasons I’ve touched on, for the better of Scottish football and the teams in the bottom six.”Livingston missed out on the top six on the last pre-split weekend last season but picked themselves up from that blow and finished a comfortable seventh in the league with three wins and two draws from their five bottom-six fixtures.Martindale is confident his team will not be plagued by any lingering negativity this time round either.“We did it last year and we’ll do it again,” he said when asked if it would be hard for the players to rouse themselves for the run-in. “The way I like to coach is ‘one game at a time’ so there’s not going to be a hangover.“If we go up to Ross County (this Saturday) and don’t pick up points it will not be because of their mindset about not getting into the top six.“That doesn’t play a part in my psyche anyway, and I’ll be making sure it doesn’t play a part in the players.”"
    ]
}