{
    "articleURL": "/wires/pa/article-12048613/Roy-Hodgson-maps-defensive-plan-Crystal-Palace-prepare-face-Harry-Kane.html",
    "content": [
        "Roy Hodgson labelled Harry Kane as one of the best players in world football and expects his goal-threat to pose a hard challenge for Crystal Palace during their visit to Tottenham on Saturday.",
        "The Spurs and England striker has scored 25 times this Premier League campaign, with four games remaining to try and better his record tally of 30 goals from the 2017/18 season.Former Three Lions boss Hodgson, who handed Kane his senior international debut in 2015, lauded Tottenham’s talisman, whose form has been a shining light for the north London club despite their struggles throughout a turbulent campaign.The Palace managed said: “Kane is one of the very best players in world football and is an outstanding goalscorer.“The need for you to defend well as a group becomes even harder, because one thing we aren’t going to do or be capable of doing is to say we are going to nullify Harry Kane because ‘X’ is going to mark him and that’s the end of the story. We know that won’t be able to work.“We’re going to do it by good corporate defending. We’ll have to try and restrict as much as we can any good service to him.",
        "“We’ll have to be very much aware when he’s in and around the penalty area, where we’ve got to get close to him and try and stop the space he has to create the room he needs to get the shots away. When he gets shots away they go in the goal, it’s what we’ve seen for the last goodness knows how long.",
        "“I have an awful amount of respect for Harry Kane. He made his debut with England while I was the manager, and over the years I’ve watched him go from strength to strength and get better and better and cause havoc with almost all the defences he meets.”Palace have witnessed an upturn in form under Hodgson since his return in March, having picked up four wins in six – a run the manager attributes to the defensive performances of his team.Last month’s consecutive clean sheets against Southampton and Everton were the first time the Eagles had done so since April 2022 under former manager Patrick Vieira.“Much of our work is on defending,” said Hodgson.“If you wanted to say to me what’s most impressed you about (Michael) Olise, (Eberechi) Eze, (Jordan) Ayew, (Wilfried) Zaha and (Jeffrey) Schlupp, it’s been there defending work, how well they’ve defended from the front, how well they’ve screened things off and made it difficult for teams in midfield to play.“Marc Guehi and (Joachim) Andersen are very good players. They’re good defenders and good on the ball, which is very useful because it helps you start attacks, switch play and develop the composure you need to build attacks up.“They’re both very useful to the club and would be to any club because they’re good players.”"
    ]
}