{
    "articleURL": "/tvshowbiz/article-12058727/Katy-Perry-shares-secret-Coronation-concert-gown.html",
    "content": [
        "After performing at Sunday night's Coronation concert, Katy Perry shared some backstage details with her Instagram followers. ",
        "The Firework songstress, 38, joined stars including Lionel Richie and Take That in lighting up the stage at Windsor Castle in honour of King Charles III following his Coronation at Westminster Abbey the previous day. In the early hours of Monday morning, she took to the photosharing site to show the inside of the Vivienne Westwood she wore on stage. The lining of the vast gold lamé ballgown featured delicate embroidery reading: 'Katy Perry [Crown symbol] Charles III 2023 VW'. She also revealed her Pentecostal pastor mother Mary Perry was in tow, as she shared a snap of the duo hugging, while her British fiancé Orlando Bloom gushed about being 'immensely proud' of the star. ",
        "Katy took to the stage at King Charles and Queen Camilla's Concert, where she looked sensational in a huge gold metallic gown as she entertained the 20,000 strong audience with a selection of her most famous hits. Katy's impressive vocals were accompanied by an incredible light show and pyrotechnics as the audience cheered for more. One of the light up drones formed a tiger's head in a nod to her hit Roar  Beaming Katy thanked his majesty for the privilege and revealed her honour as she gushed: 'I got to bring my mum and stay in a castle!'.  ",
        "Her show stopping frock featured a sculpted bodice with plunging neckline as well as an enormous princess skirt that made sure she could be seen from far and wide.The gown also boasted quirky sleeves with puff detailing at the shoulders and she completed the look with large gold earrings, before later sharing  her post which displayed the delicate embroidery on the inside. ",
        "Following her own Instagram post, Orlando posted a picture of the concert on his own Instagram page, writing: 'Immensely proud of you my my love. You always bring the light', under which she responded: 'Our light'. Elsewhere during the show Tom Cruise made a surprise cameo in a surprise pre-recorded segment.The A-list actor, 60, was flying his iconic Top Gun plane in the cameo during an interlude between performances as stars including Pierce Brosnan and Bear Grylls discussed the King's military service.A clip of Tom then came up on the screen as he flew a plane and quipped: 'Pilot to pilot - your Majesty, you can be my wingman anytime!'",
        "King Charles served in both the Navy and air force during his military career between 1971 and 1994.  Top Gun: Maverick star Tom is known for his love of flying and appeared in the P-51 Mustang which featured in the film. ",
        "The cameo was part of a series of pre-recorded sketches revealing little-known facts about the monarch. The King and Queen of the royal family joined around 20,000 members of the public at the Coronation Concert to continue the celebrations after their crowning at Westminster Abbey on Saturday.The Coronation Concert also saw performances by Paloma Faith Lionel Richie and veteran rock guitarist Steve Winwood. The show in Windsor, which was hosted by Downton Abbey and Paddington star Hugh Bonneville, started at 8pm. Buckingham Palace promised 'global music icons and contemporary stars' for the big concert. It was the highlight of the second day of coronation celebrations with around 20,000 members of the public attending.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill."
    ]
}