{
    "articleURL": "/wires/ap/article-12059757/Biden-veto-House-GOP-bill-immigration.html",
    "content": [
        "WASHINGTON (AP) - President Joe Biden would veto a House GOP bill that aims to restrict asylum, build more border wall and cut a program that allows migrants a chance to stay in the U.S., including Ukrainian refugees, the White House said Monday.",
        "Republicans are looking to capitalize as immigration trouble surges into a national spotlight this week with the ending of COVID-19 restrictions that allowed border authorities to quickly return many migrants who crossed the border illegally.GOP lawmkers aim to vote on their Secure the Border Act on Thursday - the same day the emergency expulsion powers expire. Officials have already seen an increase of migrants at the U.S.-Mexico border and are bracing for more.The legislation represents the GOP´s first major immigration policy proposal since the Trump era, when immigration opponents controlled the White House. The 213-page bill resurrects a slew of former President Donald Trump´s policies, such as building barriers along hundreds of miles of border country, and in some cases pushes beyond his efforts.It faces strong headwinds from some Republicans representing agricultural areas over requirements that businesses verify employees´ legal immigration status, and even if it passes the majority-Republican House, it stands little chance of passing the Democratic-held Senate. But if it were to end up on the president's desk, he'd veto it.The Biden administration regularly argues that Congress needs to act significantly on the border in order to fix major problems that have led to record numbers of people illegally crossing. But this isn´t the way to do it, in the view of the White House.",
        "\"While we welcome Congress´ engagement on meaningful steps to address immigration and the challenges at the border, this bill would make things worse, not better,\" says a statement from the White House Office of Management and Budget. \"Because this bill does very little to actually increase border security while doing a great deal to trample on the nation´s core values and international obligations, it should be rejected.\"In the absence of legislation, the Biden administration has adopted policy shifts beginning this week that pair stricter enforcement at the border with a growing avenue for migrants to apply for asylum, as long as they come legally, have a sponsor and pass background checks. The decisions are an effort to persuade immigrants to skip the dangerous journey north and to apply for asylum through a new app, or at regional hubs opening in Guatemala and Colombia.Congress in past decades has traditionally tackled overhauls to border security and immigration law by coupling stronger border-enforcement measures with policy changes that expanded legal pathways or provided legal status for undocumented immigrants already in the U.S.The House GOP is applying the same logic - pairing a border security package with changes in immigration reform rules - in hopes of uniting mainstream and far-right lawmakers. But instead of expanding legal pathways for migrants, the package restricts them.",
        "\"Joe Biden sent a message that America´s border is open, and millions of people answered that call and started coming across our border illegally,\" House Majority Leader Steve Scalise, R-La., said at a news conference, adding, \"We´re going to show the president how to solve the problem.\"The bill would expand border wall building, which was a major focus of Trump, who claimed he was going to build a wall and make Mexico pay for it. It would also essentially choke off asylum, requiring migrants to cross legally, pay a $50 fee and meet more stringent requirements to show in initial interviews that they are fleeing political, religious or racial persecution.It would also cut the program that has allowed U.S. officials to accept or quickly turn away some migrants from Venezuela, Haiti, Cuba and Nicaragua. The program is a cornerstone of Biden's immigration efforts, allowing migrants from those countries to apply to come to the U.S. for two years legally and work. It could also, in theory, bar Ukrainian refugees since they are in the U.S. under the same type of agreement.Scalise, on Twitter Monday, called the legislation \"the strongest border security package in history\" and said that Biden's veto promise showed the president \"has no plan to solve the crisis he created.\"",
        "The White House statement from the management and budget office said the Republican bill stands to \"cut off nearly all access to humanitarian protections in ways that are inconsistent with our nation´s values and international obligations.\" It would also cut necessary funding.Meanwhile in the Senate, Sens. Thom Tillis, a Republican from North Carolina, and Kyrsten Sinema, an Arizona independent, have proposed legislation that would give federal officials the power to quickly expel migrants for another two years. The pair are also working on a Senate proposal that would expand legal immigration while increasing border security.Some House Republicans hope their bill could offer a start to negotiations with the Senate.As lawmakers began forming the proposal last month, Republican Rep. Mario Diaz-Balart, a Republican who has pushed for years for immigration rule changes, said, \"We have to in the House, get the votes to pass a serious border security bill to make sure that this issue doesn´t just go away.\""
    ]
}