{
    "articleURL": "/wires/reuters/article-12055785/Japan-PM-Kishida-visits-Seoul-forge-closer-ties-amid-N-Korea-threats.html",
    "content": [
        "Relations strained by disputes over 1910-1945 occupation",
        "Japan's PM stops short of new apology during Seoul visitAnalysts say North Korea, China concerns driving reconciliationS.Korean opposition party decries 'humiliation diplomacy'(Adds opposition party comment in paragraphs nine and 10)By Choonsik Yoo, Hyonhee Shin and Sakura MurakamiSEOUL/TOKYO, May 7 (Reuters) - Japan's Prime Minister Fumio Kishida told South Koreans on Sunday his \"heart hurts\" when he thinks of suffering and pain during Japanese colonial rule, in a nod to historical disputes that have soured relations between the two U.S. allies.Kishida was in Seoul for the first visit to the South Korean capital by a Japanese leader in 12 years, returning the trip South Korean President Yoon Suk Yeol made to Tokyo in March where they sought to close a chapter on the historical disputes that have dominated Japan-South Korea relations for decades.Speaking to reporters after his summit with Yoon, Kishida stopped short of offering a new official apology for wrongs committed under the 1910-1945 occupation, but said his government inherits the stance of earlier administrations, some of which have issued apologies.\"For me personally, my heart hurts when I think of the many people who endured terrible suffering and grief under the difficult circumstances of the time,\" he said.Yoon said unresolved historical issues should not mean that no forward steps can be taken to deepen ties.",
        "A senior official at Yoon's office said Kishida's remarks had not been pre-arranged and Yoon thanked him for \"showing his sincere position even though there was no such request,\" and said it would be \"greatly helpful for future cooperation.\"The pledge by the leaders to boost cooperation has been welcomed by the United States as a way to better confront threats from North Korea and competition from China.\"Cooperation and coordination between South Korea and Japan are essential not only for the common interests of the two countries, but also for world peace and prosperity,\" Yoon said in opening remarks at their meeting.Yet South Korea's main opposition Democratic Party criticised Yoon for being submissive, \"oblivious to history\", and engaging in \"humiliation diplomacy.\"\"Why should the prerequisite for restoring the bilateral diplomacy be giving up on our history,\" party spokesperson Kang Sun-woo told a briefing, according to Yonhap news agency.HISTORICAL DISPUTESHistorical differences between South Korea and Japan threaten to cast a shadow over the blossoming ties between its two leaders.Under Yoon and Kishida's predecessors, relations between South Korea and Japan plunged to their lowest in decades. Koreans accuse Japan of forcing women to work in wartime brothels for the Japanese military and using forced labour, among other abuses.",
        "After South Korean courts ordered Japanese companies to pay compensation in the forced labour cases in 2018, Japan restricted exports of high-tech material to South Korea and Seoul threatened to pull out of a military intelligence-sharing deal with Tokyo.Yoon is facing criticism at home that he has given more than he has received in his efforts to improve relations with Japan, including by proposing that South Korean businesses - not the Japanese companies as ordered by a court - compensate victims of wartime labour. Polls show many South Koreans don't believe Japan has done enough to atone and apologise.Yoon has signalled he doesn't believe Japan needs to \"kneel\" any more over what happened in the past, but some South Korean officials were hoping Kishida would make a gesture.\"I was moved by the many people who opened their hearts for the future without forgetting the painful memories of the past,\" Kishida said of Yoon's proposal.On Sunday, gatherings of about 50 people demonstrated in opposition and support of Kishida's visit, but his presence did not spark widespread protests.Despite the lack of a new apology, Kishida's reaffirmation of reconciliation and the summit symbolism has value for the countries' relations, said Leif-Eric Easley, a professor at Ewha University in Seoul.",
        "\"Publics will be reassured that Korean and Japanese flags fly side by side, national anthems play together, and leaders host each other at friendly dinners with their spouses,\" he said.SECURITY, ECONOMIC COOPERATIONThe focus of the summit between the two U.S. allies revolved around security cooperation in the face of North Korea's nuclear threats, with a particular eye on American interests in the region, said Shin-wha Lee, a professor of international relations at Seoul-based Korea University.\"Their military and economic capabilities are crucial for promoting multilateral regional security cooperation, and a poor relationship between the two countries could obstruct U.S. objectives,\" she said.Kishida said they discussed bilateral ties as well as regional and global issues such as North Korea. He said he had agreed to allow South Korean experts to inspect the planned release of water from the crippled Fukushima nuclear power plant, which has been controversial with Japan's neighbours concerned about possible environmental effects.He has also invited Yoon to the Group of Seven summit set for later this month in Japan and for trilateral talks with the U.S. on the sidelines.While Yoon and Kishida did not mention points of friction with China, they did speak about shared values for human rights, rule of law, and a free and open Indo-Pacific, Easley noted.",
        "\"This suggests that Seoul and Tokyo are increasingly on the same page about strengthening supply chain security, resisting economic coercion, and deterring unilateral uses of force in Asia,\" he said. (Reporting by Choonsik Yoo, Seoyun Kang, Josh Smith and Hyonhee Shin in Seoul, with Sakura Murakami in Tokyo and David Brunnstrom in Washington; Writing by Josh Smith; Editing by Mike Harrison and David Holmes)"
    ]
}