{
    "articleURL": "/sport/football/article-12058877/Fulham-5-3-Leicester-Rampant-Cottagers-slay-hapless-Foxes-Dean-Smiths-stare-relegation.html",
    "content": [
        "Willian and Tom Ciarney both scored braces as a rampant Fulham won 5-3Harvey Barnes got two goals for the Foxes, as James Maddison scored a penaltyRe-live the action from Craven Cottage as Leicester suffered a bitter defeat Dean Smith criticised the lack of urgency. James Maddison called it a lack of hunger. Harvey Barnes conceded the Leicester fans were quite within their rights to vent their fury at the players as they slipped deeper into relegation peril on a leaky day by the River Thames.",
        "Fulham were rampant, three-up by half-time and four-up soon afterwards. Marco Silva's team were slick in transition and clinical in front of goal during this exhilarating opening to the game.But, for an hour, Smith's team awful, soft throughout the centre of the team, devoid of resistance and painfully fragile at the back.They improved and fought back and, ultimately, it would have been a tight finish if Jamie Vardy had not seen a second-half penalty saved, but Fulham coasted in with the game won and the main takeaway from Craven Cottage was that the Premier League champions of 2016 are going down if they continue to defend like this. They face Liverpool, next.'We're hurting,' said Maddison. 'It was a big game for us and we were not at it. We didn't start well enough. We were not hungry enough to want to win the game. You defend as a team. The team needs to be watertight and that comes from the front too. We were not aggressive enough. They played through us.'",
        "Fulham seized control when Willian curled in a free-kick from wide on the left, in the 11th minute. His expert delivery swerved and dipped as it made its way through a crowded penalty area without a touch and caught goalkeeper Daniel Iversen out.",
        "It was the 60th goal conceded this Premier League campaign by Leicester. They have not kept a clean sheet since November, before the World Cup, and Fulham sliced them open, seemingly at will.Vinicius made it 2-0. Released by a pass from Harry Wilson, he timed his run well, took a touch and slid the ball past Iversen from the edge of the penalty box with his left foot.Bernd Leno saved from Vardy and Youri Tielemans, and Timothy Castagne headed over. But whenever Fulham won the ball – and with Joao Palhinha patrolling the midfield they won it often – they were able to spring forward at speed through the blue shirts.The third was another delightful move from Fulham's perspective, another crumbling shield from the visitors.Cairney collected a pass from Vinicius, feinted one way, checked back onto his right foot and curled the ball beyond Iversen, inside the far post.The long-serving Fulham captain scored his second soon after the interval.",
        "Fulham (4-1-4-1): Leno 7; Tete 7.5, Adarabioyo 6, Diop 6 (Duffy 77), Robinson 6.5; Palhinha 7.5; Wilson 7 (Kebano 82), Reed 7 (Lukic 77), Cairney 8 (De Cordova-Reid 82), Willian 8.5 (Solomon 81); Vinicius 7.5.Subs: Rodak, Soares, Harris, Dibley-DiasGoals: Willian 11, 70, Vinicius 18, Cairney 44, 51Manager: Marco Silva 7Leicester (4-2-3-1): Iversen 4.5; Castagne 6, Faes 5, Soyuncu 5, Kristiansen 5 (Thomas 76, 6); Soumare 4.5 (Deswbury-Hall 76, 5), Teilemans 4 (Ndidi 60, 6); Praet 4 (Tete 46, 5.5), Maddison 5.5, Barnes 6; Vardy 5.5 (Daka 76, 5).Subs: Ward, Evans, Soutter, Daka, PereiraGoals: Barnes 59, 89 Maddison 80 (pen)Bookings: Barnes, MaddisonManager: Dean Smith 5Ref: Rob Jones 6Att: 24,443",
        "Again, it was a sweeping counterattack met without resistance. Kenny Tete carried the ball forward and cut a pass square. Cairney took it in his stride and beat Iversen with a side-footer.Fulham fans turned up the volume on another chant aimed at Smith's coach John Terry, for so long the captain of nearby Fulham. 'Terry what's the score,' they wanted to know.Then began something of amounting to a Leicester response. Barnes pulled a goal back, firing in off the bar from a pass by Maddison, and Vardy won a penalty, sent tumbling by 'keeper Leno.After a VAR check, Vardy took the penalty only to see it saved by Leno, diving to his left.Fulham scored their fifth, Willian's second, with the rejuvenated Brazilian jinking once more inside from the left wing, past two defenders before finding the bottom corner.Leicester reduced the deficit when awarded their second penalty of the game. Palhinha was ruled to have tripped Maddison. It was innocuous although not overruled and Maddison took the kick, sending Leno the wrong way and finding the net.Then Barnes grabbed his second in the 89th minute when a mix-up between Shane Duffy and Leno allowed Patson Daka to nip in and set up Barnes to score from close range.",
        "'We didn't start the game with enough urgency,' fumed Smith. 'We gave really poor goals away. The first half killed us, you can't give three-goal leads at this level and expect to come back.'Fans in the away end made their feelings clear at half time when they accused players of not being fit to wear the shirt but the mood was improved by the fightback.'The fans support us every week and performances like that are not acceptable,' said Barnes. ",
        "'We know that, hopefully we can get that continued support for the last three games, we will need it.'Fulham, meanwhile, celebrated getting back on track. They are 10th with 48 points, an impressive return on their first season back in the Premier League.'Great goals, great moments of football,' said boss Silva. 'We started with the intensity, the desire, the will and quality. We should have won more comfortably. We want to finish with a big stamp and we are going to fight for it.'"
    ]
}