{
    "articleURL": "/tvshowbiz/article-12040429/From-gifted-Goyard-bag-saving-Range-Rover-Inside-life-millionaire-child.html",
    "content": [
        "An 11-year-old millionaire has opened up about her lifestyle of expensive gifts, swanky events and being ferried around by nannies in luxury cars.",
        "Pixie Curtis, from Sydney, earned her fortune as the face of accessories range Pixie's Bows and toy brand Pixie's Pix - businesses set up by her mother Roxy Jacenko.She is already 'semi-retired' from her toy empire in order to focus on her education.Speaking to News.com.au on Wednesday, Pixie opened up about her daily life, as well as some of the more extravagant trappings of being so rich at such a young age.She spoke of receiving a $3,000 Goyard handbag for Christmas from her parents, and saving for a Range Rover for when she's old enough to drive.",
        "Pixie, who is a mini influencer in addition to being the face of merchandise, already owns a a $267,000 Mercedes-Benz GLS, which her nannies use for the school run.She also has no qualms about admitting she is a 'nepo baby' who wouldn't have had the same level of success without her ambitious mother.'My parents have given me lots of opportunities, so I suppose I am a nepo baby,' Pixie said.'The Goyard bag that I got for Christmas from my parents was really cool and pretty pricey. I put it on my list, but I didn't think I would actually get it.'",
        "She added: 'Any money earned from my toy business was reinvested or put into savings. I am not allowed to use it.'",
        "Pixie said her father Oliver Curtis, who spent a year in prison for insider trading, puts money in her Spriggy account - a pocket money app for kids - for when she goes out with her friends. Elsewhere in the interview, Pixie described herself as a 'night owl' who goes to bed at 11pm and is a 'nightmare' in the mornings.She also maintains an active social life, and is known to get spray tans on a Thursday night with her mother if they have a big weekend ahead.",
        "Pixie insisted her friends 'don't think I am any different to anyone else', despite having a bank balance most adults could only dream of.But one thing that sets her apart from most kids her age is her entrepreneurial spirit.'I love thinking of ideas to make money. My friends and I even started making bracelets and selling them to our friends. I love doing things like that,' she said.",
        "Pixie insisted she's just like any other child in most ways, and is a fussy eater when it comes to her school lunch box - much to her mother's annoyance.In February, Roxy announced her daughter was 'semi-retiring' from her online toy empire to focus on school.The PR guru, 43, said that while Pixie's fidget toy brand was once raking in $200,000 a month, she has decided it is time to 'refocus' her priorities.",
        "'Pixie has decided to hang her online toy store shoes up to focus on her impending entry into high school,' she told News.com.au at the time.'Over the past few months, we have been discussing the business plans going forward as a family and decided it was time to refocus with high school just around the corner.'The mother of two said her daughter's fidget spinner store and accessories label Pixie's Bows won't be shutting down, but will be scaling back operations so Pixie can focus on her education.Roxy previously said her daughter's savvy entrepreneurial skills would set her up for life and predicted she would retire in her teens.",
        "'You won't need to worry; you can retire at 15 the way you're going,' she said to her daughter in a joint interview in Stellar magazine in December.The Ministry of Talent founder went on to say Pixie is a natural businesswoman.'You know, what is the most exciting for me is the entrepreneurial spirit she has at such a young age,' she told the publication.'So I guess to me the biggest thing is her drive as an entrepreneur. Yes, I've enabled it, but she's still got it, which is for me the most rewarding part.'In May last year, Pixie's line of fidget toys generated $200,000 in revenue in their first month on sale in Australia.",
        "Roxy shares two children, Pixie and son Hunter, eight, with husband Oliver Curtis."
    ]
}