{
    "articleURL": "/wires/reuters/article-12049653/Skidding-Brewers-turn-ace-Corbin-Burnes-vs-Giants.html",
    "content": [
        "Corbin Burnes returns to the neighborhood of much collegiate -- and some professional -- success when he leads the Milwaukee Brewers into San Francisco for a three-game series against the Giants starting on Friday night.",
        "A native of the Central California town of Bakersfield, Burnes (3-1, 4.01 ERA) used little Saint Mary's College on the east side of the San Francisco Bay as a springboard to a major league career that has already featured two All-Star invitations and a National League Cy Young Award.The right-hander has made six previous appearances in San Francisco, including four scoreless outings when he was a reliever early in his career.He has started twice at Oracle Park, striking out 19 in 13 1/3 innings. He earned a win and a no-decision in 3-1 and 3-2 Brewers wins, allowing just two earned runs and eight hits.For his career, he's gone 3-1 with a 2.25 ERA in 12 games, including five starts, against the Giants. He has never pitched in nearby Oakland.Burnes is unbeaten in his last five starts, allowing just five earned runs over 24 1/3 innings in his most recent four outings. He earned a home win in a 7-5 victory over the Los Angeles Angels on Saturday, his last time out.Among all of his good pitching, however, Burnes has struggled against one Giants player in particular. Joc Pederson, who also faced his fellow Bay Area native while with the Los Angeles Dodgers and Atlanta Braves, has gone 5-for-16 (.313) with a double, home run and three RBIs in his career against Burnes.",
        "Pederson had a hand in both of the Giants' runs Tuesday in a 2-0 win at Houston (scoring one and driving in the other). San Francisco went on to win 4-2 on Wednesday to complete a 2-1 series win and salvage a 2-3 trip that began with a pair of losses to the San Diego Padres in Mexico City.Catcher Joey Bart contributed three hits to the two wins in Houston and also earned praise from two starting pitchers on the road trip.\"I set the bar high for myself,\" said Bart, who takes a .302 average into Friday's game. \"Everything I'm looking to do is just improve a little bit and stay about that process all across every aspect of my game. Just trying to have better at-bats. Just trying to have better games behind the dish. That's kind of been my focus.\"Left-hander Sean Manaea is hoping to continue the Giants' run of impressive pitching.Manaea (0-1, 7.85) didn't take well to the conditions south of the border, taking a no-decision in a 16-11 loss to the Padres on Saturday. He went just two-plus innings, allowing five runs (four earned) and five hits while also walking four.Manaea has faced the Brewers just twice in his career, going 0-1 with a 4.15 ERA.",
        "He will be facing a team that has lost four in a row and flew into town stinging from a 9-6 loss Thursday afternoon that complete a three-game sweep at the hands of the Colorado Rockies in Denver.The hosts erased a 4-0 deficit with a four-run seventh inning, then tacked on five in the eighth to steal the win.Afterward, Brewers manager Craig Counsell refused to say his team played poorly in the three games, but acknowledged maybe a change of scenery would help.\"It wasn't a good series,\" he shrugged. \"So we'll just pack up and get ready to go play a good one.\"The Brewers lost the finale despite getting home runs from Christian Yelich, Rowdy Tellez and Tyrone Taylor. Milwaukee had totaled just three runs in its previous three losses, including 3-2 and 7-1 in Colorado.--Field Level Media"
    ]
}