{
    "articleURL": "/wires/aap/article-12053223/Exiled-Vic-Liberal-MP-not-pursue-legal-action.html",
    "content": [
        "Victorian Liberal MPs will seek to expel Moira Deeming at a party room meeting.",
        "Opposition Leader John Pesutto on Saturday announced he received a notice of motion from five MPs calling for Ms Deeming's expulsion at the meeting to be held on Friday.\"I remain firmly committed to leading a disciplined, united and inclusive Liberal Party that will continue to take the fight up to the tired, corrupt and incompetent Andrews government,\" Mr Pesutto said in a statement.\"Our focus is on Victorian families and small businesses who face a horror state budget with higher taxes and cuts to key services and infrastructure projects.\"Earlier, the exiled MP said she would not pursue legal action over her temporary suspension from the parliamentary party.She was suspended for nine months in late March after attending an anti-transgender rights rally in Melbourne where neo-Nazis performed the \"sieg heil\" salute.In an email, Ms Deeming demanded Mr Pesutto agree to issue a media statement exonerating her of being a Nazi or Nazi sympathiser by 2pm on Thursday or face legal action.The upper house MP later confirmed she would make good on her threat in a follow-up email to colleagues but she backed away from that position on Saturday.In a statement, Ms Deeming said she never considered suing the Liberal Party, rather she contemplated legal mediation as a way to settle on the conditions of her suspension.",
        "She maintained that once she was told on Thursday night the party leadership refused her mediation request, she immediately informed party president Greg Mirabella she would not pursue it further.Ms Deeming said published minutes from a March meeting showed the Liberal Party agreed no one was accusing her of being a Nazi or a Nazi sympathiser.\"All I have ever wanted, since the leader's failed attempt to have me expelled for allegedly bringing the party into disrepute, was to have my name cleared,\" she said in a statement on Twitter.\"These minutes afford me the full, official, written, public exoneration that the leadership seems unwilling to provide.\"Ms Deeming said she was a proud Liberal and she looked forward to rejoining the parliamentary party at the end of her nine-month suspension.Mr Pesutto on Friday said the party was considering expelling Ms Deeming over her planned legal action.Federal Opposition Leader Peter Dutton also flagged intervening in the Victorian division as a way to sort out \"the whole mess\".The anti-trans rights rally Ms Deeming attended in March was headlined by British campaigner Kellie-Jay Keen-Minshull and crashed by neo-Nazis who performed Nazi salutes.Ms Deeming had initially faced expulsion in a move triggered by Mr Pesutto, before it was withdrawn."
    ]
}