{
    "articleURL": "/news/article-12060753/Disney-tries-derail-DeSantis-war-expanded-lawsuit.html",
    "content": [
        "Disney amends its lawsuit against Ron DeSantisArgues there may be more to come from the Florida governorAccuses him of 'retribution campaign' and uses his own threats against him DeSantis office slammed move as 'desperate' Disney expanded its lawsuit against Ron DeSantis on Monday after the Republican-controlled state legislature voided its 30-year agreement on developing ts theme park land around Orlando.",
        "The company accused the Republican governor of a 'retribution campaign' and used some of DeSantis' own comments against him.The war between the two entities continues to ratchet up with high stakes for both sides. Disney holds a shareholders call on Wednesday. DeSantis' is expected to announce later this summer that he'll run for president.'Governor DeSantis and his allies have no apparent intent to moderate their retaliatory campaign any time soon,' Disney noted in its additions filed to its lawsuit filed in U.S. District Court in Tallahassee.DeSantis' office slammed Disney's move as 'desperate.''Development agreements, as creations of state law, are plainly subject to revocation by subsequently enacted state law. Disney's latest move is yet another desperate attempt to maintain their special privileges and ignore the will of Floridians as expressed through their duly elected representatives,' said the governor's  Communications Director Taryn Fenske in a statement. 'Disney should accept that it must live under the same rules as everyone else.'",
        "And Disney argued there may be more to come from the Florida governor, pointing to his own words.DeSantis has issued a series of threats against the House that Mickey built - including putting taxes on its hotels, raising tolls on roads leading to its theme park and building a state prison on land near the park that the state owns. ",
        "'The Governor and his allies have made clear they do not care and will not stop. The Governor recently declared that his team would not only 'void the development agreement'—just as the State has now done, twice—but also planned 'to look at things like taxes on the hotels,' 'tolls on the roads,' 'developing some of the property that the district owns' with 'more amusement parks,' and even putting a 'state prison' next to Walt Disney World. 'Who knows? I just think the possibilities are endless,' he said,' the complaint noted.Disney, in its amended filing, also argued DeSantis and the state legislature are targeting their theme park's monorail system, requiring it to undergo state inspections, which it had previously been exempt from. The Department of Agriculture and Consumer Services did not conduct inspections of amusement park rides at facilities or parks that have more than 1,000 employees and full-time inspectors on staff due to carve outs that the state legislature has now removed. The Disney monorail system, which opened in 1971, covers nearly 15 miles and handles more than 50 million passengers a year, according to the company. The monorail cars were last updated in 1989. Disney alleges DeSantis violated the company's constitutional rights by dissolving the Reedy Creek Improvement District, the public entity that oversaw its Florida resort property, and replaced it with a board controlled by the governor after the company opposed DeSantis' 'don't say gay' bill. ",
        "'The State's actions over the last two weeks are the latest strikes,' Disney said in its amended complaint. 'At the Governor's bidding, the State's oversight board has purported to 'void' publicly noticed and duly agreed development contracts, which had laid the foundation for billions of Disney's investment dollars and thousands of jobs. Days later, the State Legislature enacted and Governor DeSantis signed legislation rendering these contracts immediately void and unenforceable. These government actions were patently retaliatory, patently anti-business, and patently unconstitutional.' The old board was essentially controlled by Disney, which opposed DeSantis' law that forbids conversations in schools about sexual orientation and gender identity.But before DeSantis' Central Florida Tourism board took over the special tax district where Disney keeps its theme parks, Disney entered into a development agreement with the old board that gave it autonomy on what gets built on its land and the surrounding property.Disney and the old board used an obscure legal clause that name-checks King Charles III to secure control - prompting fury from DeSantis who started a war against the theme park company in response.",
        "Last week, DeSantis' new board and then the state legislature moved to void that development agreement. Florida responded to the original suit by countersuing Disney in state court. DeSantis, meanwhile, accused Disney of trying to do a contract with themselves before the state board took over but said the contract is not valid. ",
        "'The legislature here just passed a statue which I will sign shortly nullifying that agreement because these development agreements under Florida law are subject to revocation, so I think they got too cute,' he said in an interview with Newsmax.'I think that we will end up winning that fight. Disney should not be governing themselves they should absolutely be held accountable.'Walt Disney World single-handedly transformed Orlando and its surroundings after opening in October 1971.The Florida city is now one of America - and the world's - top tourist destinations, with Universal Studios also opening a huge theme park resort nearby.Disney World is the largest employer in central Florida, with close to 75,000 employees, drawing 36.2 million visitors in 2021, according to the Themed Entertainment Association. "
    ]
}