{
    "articleURL": "/news/article-12054879/Keir-Starmer-warned-not-copy-Neil-Kinnock-triumphalism-predicts-General-Election-victory.html",
    "content": [
        "Labour leader predicted a General Election victory after local council success Sir Keir Starmer was accused of 'doing a Kinnock' yesterday by predicting a Labour General Election victory on the back of last week's local council polls success.",
        "The Labour leader sparked claims that he was repeating Lord Kinnock's infamous 1992 Sheffield rally boast of impending success just a week before the Tories staged a comeback and held on to power.A senior Labour backbencher also contrasted Sir Keir's 'boasting' tone with Tony Blair's warnings against complacency in the run-up to his landslide 1997 win.The MP told The Mail on Sunday: 'Keir's tone is all wrong – Blair would never have boasted like that. And anyway, last week's results point more to a hung Parliament – not a Labour majority.'Last night, one of the hard-Left MPs in the party's Socialist Campaign Group told the MoS that there was already talk of it having 'leverage' because, on 'last week's performance, Starmer's not going to win outright'.",
        "There are also fears that a 'feeble' Labour minority administration would have to trade PR voting reform to win Lib Dem co-operation, while the Scottish National Party's Westminster leader Stephen Flynn is already boasting his party could be in a position to 'pull the strings' after the Election.Sir Keir's boasts came after his party won more than 500 new council seats, with some in key 'Red Wall' areas. Amid Tory internal recriminations at their defeats, ex-Brexit Minister David Jones called on Prime Minister Rishi Sunak to get back to real Tory tax policies.",
        "He said: 'Conservative voters are looking to the Conservative Party to provide Conservative policies and that means lower taxes – particularly corporation tax.'The Tories lost more than 1,000 seats with the Lib Dems signalling their threat to so-called 'Blue Wall' southern seats at the next Election – gaining 405 seats overall. Speaking in Chatham, Kent, after Labour won control of Medway Council, Sir Keir said: 'Make no mistake – we are on course for a Labour majority at the next General Election.'Speaking yesterday, Labour frontbencher Peter Kyle claimed that, based on current polls, 'we are going to win decisively, we are going to win outright'. But election expert Michael Thrasher warned that based on last week's results, Labour would fall 28 seats short of an overall Commons majority.Using Sky News projection of national vote share, he said Labour were on 36 per cent, the Tories on 29, with the Lib Dems on 18 and others on 17 per cent. That would give Sir Keir's party 298 Commons' seats – well short of an overall majority. ",
        "Polling guru Sir John Curtice warned: 'The local election results confirm that Labour is in its strongest position since 2010 but whether or not Labour would have won an overall Commons majority on Thursday is less clear.' Labour Party sources dismissed talk of Campaign Group post-election influence, saying: 'We're gunning for a majority Labour government – the Left's leverage won't extend beyond the Guardian's comment pages.'",
        "Former Labour leader Lord Kinnock has said he regretted his tone at 1992's Sheffield rally where he was shown calling out 'we're all right' or 'well all right' with Labour narrowly leading in the polls a week before Tory PM John Major won a surprise victory.Last night, a spokeswoman for Sir Keir denied he was complacent but said: 'Results last week showed that Keir's changed Labour Party is on course to form the next government.'"
    ]
}