{
    "articleURL": "/wires/pa/article-12041281/Missing-RBC-Heritage-easy-decision-Masters-misery--Rory-McIlroy.html",
    "content": [
        "Rory McIlroy insists it was an “easy decision” to potentially forfeit £2.4million in bonus money as he spoke for the first time about how missing the cut in the Masters “sucked”.",
        "McIlroy did not speak to waiting reporters after a second round of 77 at Augusta National brought a premature end to his latest bid to win a green jacket and complete the career grand slam.The world number three then withdrew from the RBC Heritage at Hilton Head, meaning he had missed his second ‘designated event’ of the year on the PGA Tour and was subject to losing 25 per cent of his Player Impact Program bonus.“We certainly have our minimums, we obviously signed up for this designated-event series this year,” McIlroy said at a promotional event for FedEx ahead of the Wells Fargo Championship.“I obviously knew the consequences that could come with missing one of those. It was an easy decision, but I felt like, if that fine or whatever is to happen, (it) was worth that for me in order to get some things in place.“I had my reasons not to play Hilton Head. I expressed those to Jay [Monahan, the PGA Tour commissioner] and whether he thinks that is enough to warrant… look, again, I understood the consequences of that decision before I made it.“So whatever happens, happens.”McIlroy revealed that he had allowed himself to think about his prospects of becoming just the sixth player to have won all four major titles after shooting five under par on the back nine of his Wednesday practice round at Augusta.",
        " I needed some time to regroup and focus on what’s ahead  Rory McIlroy  “Me thinking that way isn’t a good thing,” the four-time major winner said. “All I should be thinking about is that first shot on Thursday.“You need to stay in the present moment and I feel like at Augusta I didn’t quite do a good job of that because of how well I came in playing. I maybe got ahead of myself a little bit.”Describing his performance, McIlroy added: “It sucked. It sucked.“It’s not the performance I obviously thought I was going to put up. Nor was it the performance I wanted. Just incredibly disappointing. But I needed some time to regroup and focus on what’s ahead.“It’s been a big 12 months and I don’t know if I fully reflected on stuff. I never really got a chance to really think about the Open and St Andrews (where he was joint leader after 54 holes) and everything that went on there.“It was nice to have three weeks to just put all that stuff in the rearview mirror and just try to focus on what’s ahead.”",
        "What’s ahead on the course includes the US PGA Championship later this month and July’s Open Championship at Hoylake, where McIlroy lifted the Claret Jug in 2014.",
        "And McIlroy hopes he will now be able to expend less energy on his role as an unofficial spokesperson for the PGA Tour in its battle against LIV Golf as the season progresses.“I wasn’t gassed because of the golf, I was gassed because of everything that we’ve had to deal with in the golf world over the past 12 months and being right in the middle of it and being in that decision-making process,” McIlroy added.“I’ve always thought I’ve had a good handle on the perspective of things and where golf fits within my life, but I think over the last 12 months I’d lost sight of that, lost sight of the fact that there’s more to life than the golf world and this silly little squabble that’s going on between tours.“And I think once I disconnected from it a little bit, I could see things a little clearer and where everything fits. I guess that was a good reset.”"
    ]
}