{
    "articleURL": "/wires/reuters/article-12049399/Marcos-dismisses-criticism-campaign-played-family-corruption.html",
    "content": [
        "By Michael Martina and Don Durfee",
        "WASHINGTON, May 4 (Reuters) - Philippines President Ferdinand Marcos Jr dismissed criticism during an interview on Thursday that his presidential campaign played down the corruption and extravagance the Marcos family was known for during his father's rule.Marcos told Reuters at the end of a four-day visit to Washington that his country's citizens could not continue to fight decades-old social battles.\"My opposition would try to bring up this old issue. But of course, we answer to the voting public and the voting public has given their very clear and loud response to that and that they are not worried,\" he said.\"These are not the things that Filipinos feel we must be talking about,\" he added. \"We need to be talking about livelihoods, about jobs, about education, about the economy.\"A fractured society that continues to fight battles that are 45 years old is selling itself short because it's the future that we're worried about, not the past.\"During his campaign, critics said Marcos' presidential bid tried to whitewash the corruption and authoritarianism associated with his father's 20-year rule.The elder Ferdinand Marcos ruled for two decades starting in 1965, almost half of it under martial law, helping him extend his power until his overthrow and his family's retreat into exile during a \"people-power\" revolution.",
        "During his rule the family name became associated with cronyism and billions of dollars' worth of missing state wealth. The Marcos family denies wrongdoing.Marcos Sr died in exile in Hawaii in 1989, but his family returned to the Philippines to launch a comeback that culminated in his son's election in May.Marcos' Washington visit has been the first by a Philippine president in more than 10 years and included a summit on Monday with U.S. President Joe Biden. It was the latest of several high-level meetings Marcos has held with leaders of the United States and China, which are jostling for strategic advantage in the region.U.S. officials describe the Philippines as strategically vital to efforts to push back against China's expanding influence, and Biden has courted Marcos, who still faces a U.S. court judgment connected with $2 billion of plundered wealth under his father's rule. As head of state Marcos is immune from U.S. prosecution.The Philippines and the U.S. have drawn closer since Marcos won his election, a change from the administration of Marcos' predecessor Rodrigo Duterte, who turned the Philippines sharply away from its oldest ally and built closer ties with China.(Reporting by Michael Martina, Don Durfee and David Brunnstrom. Editing by Gerry Doyle)"
    ]
}