{
    "articleURL": "/news/article-12051079/Black-homeless-man-dies-placed-chokehold-former-marine-NYC-Subway.html",
    "content": [
        "A 24-year-old former marine pulled one arm tightly around Jordan Neely's neck When police arrived, Mr Neely was found unconsciousness and unresponsiveAnger is growing in New York after a black homeless man was choked to death on a Subway train, reportedly by a former US marine.",
        "The altercation has grim parallels to the killing of George Floyd and has sparked protests in the city.Jordan Neely, 30, was said to have been shouting at passengers in the carriage in Manhattan and trying to tell them he was thirsty and hungry.Witnesses said Mr Neely was then tackled by passengers and restrained by at least three people, including the ex-marine. The 24-year-old from Long Island, whose identity is unknown, pulled one arm tightly around Mr Neely's neck during the scuffle on Monday.Mr Neely struggled to break free from the chokehold, but a second rider held down his shoulders while a third pinned his arms.",
        "Onlookers watched as Mr Neely lost consciousness. When officers arrived at the scene he was unresponsive.Mr Neely was taken to hospital where he was pronounced dead.The death has sparked outrage in New York. Protests were said to have grown in areas across the city, with chants of 'Black Lives Matter,' 'justice for Jordan Neely,' and 'the homeless matter' being heard, according to New York news website Gothamist.The city's mayor Eric Adams has declined to comment directly on Mr Neely's death. But his office later said that the police's initial response represented the 'double standard black people and other people of colour continue to face'.",
        "A video of the altercation, filmed by journalist Juan Alberto Vazquez, showed the man lying beneath Mr Neely, holding him in a headlock position for several minutes.His death has been likened to the murder of George Floyd, who was killed by a Minneapolis police officer who knelt on him in 2020 while the victim complained 'I can't breathe', triggering a summer of riots.",
        "The veteran who restrained Mr Neely was taken into custody but was released without charge.However, the Office of Chief Medical Examiner of the City of New York has ruled Mr Neely's death as a 'homicide' caused by compression of the neck.A decision on whether to charge the marine will now be made by the Manhattan District Attorney. He has been described as a 'decorated' sergeant who was an active service member until two years ago."
    ]
}