{
    "articleURL": "/wires/pa/article-12048719/Lloyd-Webber-Writing-coronation-anthem-antidote-death-son.html",
    "content": [
        "Lord Andrew Lloyd Webber has said writing the coronation anthem has been “a kind of antidote” for dealing with the death of his son earlier this year.",
        "The theatre impresario’s song, Make a Joyful Noise, will be played publicly for the first time as the King is enthroned on Saturday.Lord Lloyd-Webber, 75, who is known for hit musicals including The Phantom Of The Opera, Evita and Jesus Christ Superstar, has drawn on the words of Psalm 98 for his anthem.Speaking with Channel 4 News, he described it as a “joyful noise” which has helped him cope with the death of his son, Nicholas, at age 43 on March 25. I do obviously have the thought of my son in my mind and there will be a moment when I'm in the abbey, I know, as there was the other day, when I'm thinking of my lovely Nick. And thinking that making a joyful noise is also for him  Andrew Lloyd Webber, composer  “Obviously writing the anthem, because it’s joyful, it was a wonderful thing to do as a kind of antidote to what I knew was going on in my private life,” he said.“Music is my life. Music is what I do. The music and what I may have written for the coronation – I do obviously have the thought of my son in my mind and there will be a moment when I’m in the abbey, I know, as there was the other day, when I’m thinking of my lovely Nick. And thinking that making a joyful noise is also for him.”",
        "Speaking with the Daily Telegraph, Lord Lloyd-Webber also revealed that the King insisted that the piece should be “hummable” and cheerful because “he wants the anthem sung in churches”.The composer said he hopes the anthem will be sung during celebratory occasions like weddings and christenings.After the coronation, the tune will be released as a single to raise money for the Royal British Legion and Age UK."
    ]
}