{
    "articleURL": "/wires/ap/article-12052229/Column-Stench-death-hangs-Kentucky-Derby.html",
    "content": [
        "They came 150,000 strong for the party of the year, adorned in the gaudiest of hats and sipping on mint juleps, witnesses to what, at its best, is the most thrilling two minutes in sports.",
        "Sadly, the stench of death overwhelmed the Kentucky Derby and its magnificent athletes on Saturday.Five horses perished in the past week at Churchill Downs, again raising troubling questions about the sport of kings even before the 149th run for the roses.Then, on the Derby undercard, two more died.Seven horses gone.Just like that.",
        "\"There's something going on,\" said Derby spectator Pat Murtha, who was attending the race for the first time. \"They need to find out, and set some rules and regulations to protect these animals.\"Seriously, if this can happen at Churchill Downs, with the eyes of the world focused on its biggest race, what's happening when no one is looking?Is enough being done to make this sport as safe as possible for 1,200-pound thoroughbreds that can reach top speeds of 45 mph?\"I don't think we're close to that right now,\" said Wayne Pacelle, president of Animal Wellness Action and a long-time advocate for greater regulation of the racing industry. \"When you're in competition, there are risks. I don't think a zero-injury or zero-death standard is achievable. But we can do so much better than the present circumstances.\"It's hard to argue with that point.Especially after the past week.According to a database kept by the Jockey Club, which oversees the breed registry for thoroughbreds in the United States and Canada, more than 7,200 horses died in races from 2009-21.",
        "\"There's a lot less injuries here with legs than there are in other sports, but here it means your life is over,\" said Mike Repole, co-owner of early Derby favorite Forte, who was among five horses scratched before the race. Four were due to injuries; another trainer didn't think his horse was fit enough.\"God, it´s depressing as you can get,\" Repole said.There's no getting around that some horses will break down on the track, and many of those will be catastrophic injuries that require them to be euthanized. The risk of paying the ultimate price can never be removed from such a perilous sport.But five deaths so close to the Derby - and two more on Derby day - have rocked the industry, much like more than 40 deaths during the 2019 racing season at California's Santa Anita track forced a reckoning over health and safety issues.Churchill Downs indefinitely suspended trainer Saffie Joseph Jr., who worked with two horses that collapsed on the track and died after races held before the Derby. Lord Miles, who was trained by Joseph, was scratched from the big race.Kudos for that decision, even though Joseph insisted he had done nothing wrong, and there hasn't been a finding on why either of his horses died.",
        "\"It shatters you,\" Joseph said, his voice breaking. \"Anyone around me knows how much I care about my horses. Whether it just be a small issue, I care. When you care, it hurts.\"Pacelle said it was highly unusual for two horses from the same stable to die under such mysterious circumstances.\"The sort of people who know something about the sport find it incredibly unusual that 4-year-old and 5-year-old horses dropped dead after their races,\" he said. \"It wasn't like they broke a leg and had to be euthanized. It's just a sudden-death circumstance - and two horses with that end-of-life circumstance. It's so incredibly unusual that it speaks to something the trainer did to put them at some risk.\"In the wake of the Santa Anita deaths, new rules were written to address track safety, the health of the horses, and a hodge-podge of doping rules that varied from state to state. Part of the Horseracing Integrity and Safety Act (HISA) took effect last summer, but new antidoping rules have been delayed by court challenges that seemed largely designed to maintain the status quo.Sadly, those regulations won't be implemented until after the first two legs of this year's Triple Crown.\"We should have had federal authority in place by now for testing horses and making sure the race day anti-doping provisions and other provisions of the law were being enforced,\" Pacelle said. \"It's like the Miami Dolphins having different rules in Florida for football compared to the Detroit Lions. It doesn't make sense.\"",
        "Horse racing, by its very nature, will always have a bit of a PR problem compared to other sports.\"If every athlete, when they break their leg they have to be put down, you´d stop sports. You´d have to,\" Repole said. \"You see a football player carried out. Unfortunately, if that happened to a horse, he gets more than carried out. That´s the reality of it.\"Horse racing needs to demonstrate once and for all that it truly cares about the athletes at the heart of its sport. The safety rules are a good start. Doping guidelines that apply across the nation will help even more. But that won't be the end of it.Breeding practices that produce faster horses but perhaps increase the risk of other health problems is the next big frontier that needs to be addressed. That's going to be the most perplexing issue of all.\"No one has moved into this area,\" Pacelle said. \"The industry needs to pick it up, but the problem is - just like getting trainers to stop doping voluntarily - are you going to do something that might make your horses a tad bit slower? You're worried that a competitor is not going to do this and you're going to lose the race.\"",
        "There were some encouraging signs at Churchill Downs.Bob Baffert, the sport's most famous - or should we say, infamous - trainer, wasn't at the track Saturday. He's still serving a two-year ban that was imposed after his 2021 Derby winner, Medina Spirit, failed a post-race drug test and was disqualified.Joseph wasn't there, either.The crowd at Churchill Downs reveled in a tradition that has survived world wars and worldwide pandemics. Maybe it's time for some of the many celebrities who came to be seen to speak out more forcefully on behalf of those who can't speak for themselves.Pacelle, unlike some animal-rights activists, is not calling for horse racing to be eliminated. He knows that sort of stance is unrealistic, and only provides fuel to those who resist any meaningful change.\"The industry is here and will be here for decades,\" he said. \"Horse racing is a big industry in the United States. A lot of jobs are tied to it. The fan base is passionate about this enterprise.\"This isn't greyhound racing, which has largely been wiped out in the U.S. This isn't one of those animal acts in the circus or an amusement park, which have come under increasing scrutiny.Despite the challenges posed by other forms of legalized gambling, horse racing still holds a significant niche in our sporting world.",
        "\"Horse racing is in a different political, economic and cultural position,\" Pacelle conceded. \"It's going to be around. We just hope we can have safe competition for the horses in racing.\"Thankfully, the 18 horses that burst from the starting gate at the Kentucky Derby all made it to the finish line safely.Mage was the winner, but it didn't really matter.The roses were red, but they should've been black.___AP Racing Writer Beth Harris in Louisville, Kentucky, contributed to this report.___Paul Newberry is the national sports columnist for The Associated Press. Write to him at pnewberry(at)ap.org or at https://twitter.com/pnewberry1963"
    ]
}