{
    "articleURL": "/wires/ap/article-12046381/Hungarys-Orban-bemoans-liberal-virus-CPAC-conference.html",
    "content": [
        "BUDAPEST, Hungary (AP) - Hungary's populist prime minister likened liberalism to a \"virus\" in an opening speech at the Conservative Political Action Conference in the Hungarian capital on Thursday, painting a picture of a global right-wing movement mobilizing to defeat \"progressive elites.\"",
        "Viktor Orban's speech at CPAC Hungary centered around battling what he frequently described as \"woke culture,\" and delved primarily into hot-button cultural topics such as transgender and LGBTQ+ rights, migration and the content of education for children.The two-day conference, the second in Hungary in as many years, featured segments titled \"Make Kids Not War\" and \"No Country for Woke Men.\" A sign over the entrance to the venue, a conference hall on the Danube River, read, \"No Woke Zone.\"After receiving a standing ovation, Orban said Hungary had become \"world-famous\" for its hard-line migration and cultural policies, and offered those in attendance a recipe for implementing a similar right-wing agenda at home.\"No migration, no gender, no war,\" Orban said, urging his international audience to focus on these issues in their own countries.\"Hungary is actually an incubator where experiments are done on the future of conservative policies. Hungary is the place where we didn't just talk about defeating the progressives and liberals and causing a conservative Christian political turn, but we actually did it,\" Orban said.",
        "Orban has styled himself as a champion of what he calls \"illiberal democracy,\" drawing controversy and raising concerns in the European Union and elsewhere about Hungary sliding into authoritarian rule. He has depicted himself as a defender of European Christendom against Muslim migrants, progressives and the \"LGBTQ lobby.\"",
        "In 2021, his right-wing Fidesz party banned the depiction of homosexuality or sex reassignment in media targeting people under 18. Information on homosexuality was also forbidden in school sex education programs, or in films and advertisements accessible to minors.On Thursday, Orban argued that liberalism sought to degrade nations, which had led to the West falling behind Asia in economic and demographic indicators.\"The woke movement and gender ideology are exactly what Communism and Marxism used to be,\" he said. \"They artificially cut the nation into minorities in order to spark strife among the groups.\"The CPAC Hungary conference was the latest embrace of Orban by the U.S. right-wing movement. Last summer, he spoke at CPAC´s national conference in Texas where he told the crowd in Dallas to \"take back the institutions in Washington and Brussels\" and focus on winning U.S. elections next year.Orban was the first European national leader to publicly endorse former President Donald Trump´s candidacy in 2016, and voiced his support for Trump´s 2020 campaign as well. On Thursday, Orban said he was certain that \"if President Trump were president now, there would be no war affecting Ukraine and Europe today.\"\"Come back, Mr. President, make America great again, and bring us peace!\" he said, to vigorous applause from the audience.",
        "As in 2022, the Associated Press and other international news organizations were not granted accreditation to cover the CPAC Hungary meeting despite making multiple requests over several months.In opening comments, CPAC chairman Matt Schlapp said that CPAC in the U.S. had decided to \"go Hungarian\" in their approach to the media, deciding for themselves \"who is a journalist and who is not a journalist\" when determining which outlets to allow into their events.Orban, in power since 2010, has overseen a deep transformation of Hungary´s media landscape. His government has frequently been accused of eroding press freedoms and rolling back democratic checks and balances.Former Fox News host Tucker Carlson on Thursday gave brief comments by video link, one of his first public appearances since the network ousted him in April.\"I wish I was there in Budapest,\" Carlson said. \"If I ever get fired and have some time and can leave, I will be there with you. But in the meantime, Godspeed.\""
    ]
}