{
    "articleURL": "/sport/football/article-12042379/The-Lionel-Messi-era-PSG-showed-stars-treat-club-celebrity-playground.html",
    "content": [
        "Messi's relationship with PSG only ever seemed lukewarm at best on both sidesNow the brief love affair is all but over after he missed training while in SaudiThe background to the tale tells you what a parody of a football club PSG areIf Nasser Al-Khelaifi possessed the capacity of self-reflection and had a scintilla of humility, then the humiliating and bitter end of Paris St Germain's love affair with Lionel Messi, a romance that only ever seemed lukewarm at best on both sides, should also see the president step down from his duties as mastermind of the club.",
        "Eleven years into the project, PSG remain the sniggering stock of European football, accumulating domestic trophies which their gargantuan wealth render increasingly meaningless, whilst having the Midas Touch in reverse when it comes to spending.Sports washing is meant to provide cover for your human rights abuses and make your nation state look good: see Manchester City and Abu Dhabi for details. But if PSG are a reflection of Qatar, you would have to conclude their core values are the worship of celebrities, excessive materialism and wasteful spending.On Tuesday night PSG belatedly discovered a backbone and took the first steps on becoming something more than a celebrity playground for multi-millionaire young men to play at being professional footballers. They suspended Lionel Messi for two weeks and fined him the same amount of wages because he has prioritised his visit as tourism ambassador to Saudi Arabia over Monday’s training.",
        "The background to the tale tells you what a hollowed-out parody of a football club PSG have become. They will still probably win the French league, though even with the world’s richest state blowing their rivals to financial smithereens and with Messi and Kylian Mbappé in the side, they can’t be one hundred per cent sure of that. Yet they are still five points clear with five to play and their nearest rivals, Lens and Marseille, play each other next Saturday, so they can’t both launch a late challenge.",
        "The reason for the title even being up for debate is PSG losing 3-1 at home to mid-table Lorient on Sunday, their third home defeat in four games. The jeers and whistles around the Parc des Princes tell their own story of a lack of engagement and commitment from a disjointed and listless team. This is a club that added Messi and became worse.The problems is that, in signing Messi, you are also accommodating a global advertising hoarding with commitments beyond your immediate needs. In Messi’s case, this is his willingness to be a human rights shield for, awkwardly, Qatar’s fiercest regional rival, Saudi Arabia.Messi had twice delayed a trip to the kingdom to promote tourism there because of the optics, coming as they did after PSG defeats. Yet with players scheduled for two days off after the Lorient game, it seemed safe to reschedule so that his PR team could post unconvincing Instagram stories about the lushness of the Saudi landscape. (Memo to Team Messi: if this is really the best you can do, best say nothing; just count the money and try your best to black out Jamal Khashoggi haunting your dreams)Trouble was, Messi hadn’t reckoned on Lorient (one win in eight) sweeping aside PSG, who had Achraf Hakimi sent off after 20 minutes. Lorient’s opening goal came after a superb 25-pass sequence, with Romaine Faivre, Enzo Le Fée and Darlin Yongwa all shining in the game. Such a gutless defeat definitely falls into the ‘something must be done’ category and sadly for Messi it came under the classic of that genre: day off cancelled, extra training on Monday.",
        "Messi representative’s say he was on the flight before the schedule was changed, that he couldn’t cancel this trip yet again, once all the arrangements had been made and that he’s always been professional. Penny for the thoughts of Kylian Mbappé as he sat through Galtier’s video dissection of a dismal performance, knowing that his fellow superstar was sat in the Arabian dessert getting busy on Insta, earning Riyals from his second job. It’s not a look that immediately says #apologiestothefans #wegoagain.",
        "It definitely marks the end of the Messi era at PSG, notable for nothing much other the obligatory two league titles. Will he even be on the pitch if and when they wrap up this title? If Galtier has anything about him, surely Messi won’t play for PSG again after the two week suspension? The reception at the Parc des Princes, where he has already been booed and jeered, would likely be ferocious should he deign to turn up.As such, he will likely end up at Al Hilal in Saudi Arabia next season, where his ambassadorial duties can be easily accommodating around his occasional training/playing needs and where he can resume his rivalry with Cristiano Ronaldo who plays at Al-Nassr. It would be unkind to remind him of his compatriot Jorge Luis Borges' line about ‘two bald men fighting over a comb’ as there is a genuine football culture and passionately-followed league in Saudi Arabia. But there also seems a willingness to serve as a retirement home for the greats.",
        "This seems his only likely financially viable option (how much money is enough? Just a little more!) unless Barca can somehow conjure together another financial magical trick and convince La Liga that they can replenish their squad and re-sign Messi. This courtship has been a long-drawn out media dance that seems more performative than substantial. No self respecting Barca president can appear unwilling to sign Messi and so this tale is likely to run and run for the moment.But in reality the spotlight should be on PSG. How can they have constructed a team which seasoned observers say is the worst of the 11-year Qatari era? Had they been a genuine sporting project over the last 11 years, they might have Parisiens like Mike Maignan, Jules Kounde, William Saliba, Ibrahima Konaté, N’Golo Kanté, Paul Pogba, Riyad Mahrez and Randal Kolo Muani alongside Mbappé.They may persuade Zinedine Zidane to bring some sense to the madhouse next season. But for those who see the club as reality TV show masquerading as a sports franchise, then Antonio Conte, with his unique brand of man management and disdain for presidential opinions, is the appointment for which we must all hope.",
        "German referee's admission refreshing to hear It’s not going to make Jude Bellingham feel better, as Borussia Dortmund yet again let slip their lead at the top of Bundesliga with a 1-1 draw at Bochum last week, but it was startling to English eyes to see referee Sascha Stegemann engaging with the media and apologising for what was a clearly terrible decision not to award a penalty to BvB when Karim Adeyemi was clattered to the ground by Danilo Soares. ",
        "‘It’s a foul and a penalty kick,’ said Stegemann, who added that he ‘felt like s***.’ This business of fronting up for your mistakes will never catch on.Naples holds its breath... again And so to Udinese, on the Slovenian border, and about as far from Naples as you can get in Italy, for the next attempt to ignite the mother of all parties, with Napoli needing a point on Thursday to secure their first Serie A title since 1990. Local authorities were so concerned that festivities would get so out of hand last Sunday, when a victory over Salernitana would have been enough, that they warned fans not to follow through on a plan to set off flares to illuminate Mount Vesuvius in celebration. Given the city’s troubled history with the volcano, you might have thought any attempt to light it up might be best avoided."
    ]
}