{
    "articleURL": "/wires/pa/article-12038511/Royals-attend-Big-Lunch-Big-Help-Out-events-celebrate-coronation.html",
    "content": [
        "Buckingham Palace has revealed which members of the royal family will take part in Big Lunch and Big Help Out events as part of coronation celebrations.",
        "Thousands of street parties are expected to be held at the weekend, with people encouraged to come together across the country for the Coronation Big Lunch.A palace spokeswoman said big lunches will take place from Saturday to Monday “in a nationwide act of celebration and friendship”.On Sunday, the Duke and Duchess of Edinburgh will attend a big lunch in Cranleigh, the Princess Royal and Vice Admiral Sir Tim Laurence will attend a community street party in Swindon, and Princess Beatrice and Princess Eugenie will attend a big lunch in Windsor.",
        "Kensington Palace is expected to release information about the Prince and Princess of Wales’s plans over the weekend in due course.Buckingham Palace said the Big Help Out on Monday will “highlight the positive impact volunteering has on communities across the nation”.A palace spokesperson said: “In tribute to the King’s public service, it will encourage people to try volunteering, and join the work being undertaken to support their local areas.“The aim of Big Help Out is to create a lasting volunteering legacy from the coronation weekend.”Edward and Sophie will take part in a puppy class at the Guide Dogs training centre in Reading, while Anne and Sir Tim will attend a civic service recognising local volunteers at Gloucester Cathedral.",
        "The service will be followed by a short reception for invited volunteers and representatives of voluntary organisations from across Gloucestershire.The Duke and Duchess of Gloucester will meet young volunteers from the Coptic Orthodox Church at a coronation party at St Mark’s Coptic Orthodox Church in Kensington.The palace spokesperson said that according to the latest polling, an estimated 6.5 million people say they are planning to take part in the Big Help Out, ranging from community litter picks to signing up to longer-term volunteering opportunities with a wide range of charities.The palace said that while “wholly supportive” of the Big Help Out initiatives on Monday, Charles and Camilla will not be attending any of the events in person."
    ]
}