{
    "articleURL": "/wires/aap/article-12061555/Wallabies-halfback-White-signs-Western-Force.html",
    "content": [
        "Nic White admits a decision on his playing future has been affecting his form, and hopes signing with the Western Force will have him at his best for the ACT Brumbies' Super Rugby Pacific finals campaign.",
        "The veteran Wallabies halfback signed a two-year deal with Rugby Australia and the Force, who he will join at the end of the current season.His Brumbies and Test teammate, back-rower Pete Samu, also confirmed on Tuesday he had signed with French powerhouse Bordeaux.While he has been a consistent performer for the second-placed Brumbies, 32-year-old White felt his future had been weighing heavily on his mind.\"It has been a massive decision, one that's probably weighed on me more than I would have thought,\" said White, who made his Super debut with the Brumbies in 2011.\"It's probably affected me more than I would have liked. Having it linger over my head for quite some time, I feel like it has affected me a little bit.\"That's why I feel like now's a good time to rip the bandaid off and give myself the chance to throw everything at this year.\"It's been a rough couple of months to come to terms with it, but I've still got plenty to play for this year to go out on a high.\"With a swag of Wallabies on their books and promising halfback Ryan Lonergan signed up, the Brumbies couldn't afford to pay White big money to stay.The 59-Test veteran, who played in France and England before returning for a second stint in Canberra, was grateful to the Force for the chance to remain in Australian rugby.",
        "Eyeing the visiting 2025 British and Irish Lions after this year's Rugby World Cup, White said he still had plenty to offer in the gold jumper, with Wallabies coach Eddie Jones agreeing.\"I spoke to him (Jones) a little bit and he's happy I'm sticking around,\" White said.\"There's some fun years coming up for rugby in Australia and I'm very thankful that I've got the opportunity to stick around, and I'm keen to see what I can do over in Perth.\"There's a young group over there and it's a way for me to give back to Australian rugby.\"Western Force coach Simon Cron described White as a \"winner\" who would add valuable leadership.\"Nic is a great addition to the team,\" Cron said.\"We have a number of emerging leaders here and the key thing for us is to give them role models to learn from. Nic will be one of these.\"Brumbies head coach Stephen Larkham said he was disappointed to lose both White and Samu, but accepted it was the commercial reality of sport.\"We understand in professional sport, players ... have to make a difficult decision for themselves and their families,\" Larkham said.\"The club made every effort to retain both players past this year, but the reality is there are factors outside of our control, as well as the competitive marketplace for players of their calibre that come into play.\""
    ]
}