{
    "articleURL": "/news/article-12041647/Aaron-Carters-mom-arrested-battery-arguing-husband-TV-remote.html",
    "content": [
        "Aaron Carter's mom Jane Schneck was arrested on Friday night for batteryIt's understood that Jane and her husband got in a row over a TV remoteWas also arrested in 2004 for hitting then-husband's girlfriend with remote Aaron Carter's mom has been arrested for battery after reportedly arguing with her husband over the TV remote while she had the volume turned up.",
        "Jane Schneck, whose son drowned in his bathtub after consuming Xanax and huffing ahead of his death at 34 in November, was arrested on Friday night, according to online jail records seen by DailyMail.com.Ms Schneck, who is also the mom of Backstreet Boys star Nick Carter, was said to be listening to music so loudly that her husband could not get to sleep.The couple's altercation became so heated that it led to Ms Schneck's husband calling the police over her actions.TMZ reports that the 64-year-old grabbed her husband's wrist in an attempt to stop him from recording what was going on.",
        "When cops descended on Ms Schneck's Florida home, officers are said to have watched the cell phone video and decided that it warranted an arrest for battery.Online records show that Ms Schneck was taken in on early Saturday morning where she eventually posted a $100 bond and was released from custody that evening.It's understood that despite the physical altercation, Ms Schneck's husband was not injured and did not want to go to hospital. ",
        "Ms Schneck was also arrested in 2004 for battery after an alleged attack on her ex-husband's girlfriend Ginger Elrod. At the time, it was reported that she used a rock to break a window and entered her then-husband's home before dragging Ms Elrod out of bed and hitting her with a remote control. ",
        "Ms Schneck, formerly married to the late Robert Gene Carter, recently shared a series of chilling images which were taken in the bathroom where her son tragically died.She shared the photos on Facebook in March - before the autopsy report was produced last month - as she begged police to investigate her son's death.Alongside the images, she wrote: 'Still trying to get a real investigation for the death of my son Aaron Carter.'I want to share these death scene photos with you all because the coroner wrote it off as an accidental drug overdose. They never investigated it as a possible crime scene because of his addiction past.'Following the autopsy, Carter's fiancée Melanie Martin said she wanted a second autopsy performed on the singer after revealing she has lingering suspicions about his official cause of death.",
        "She has said there are still aspects of the circumstances of his passing that don't make sense to her.The fact that he was partially clothed in the bathtub when his body was found, could point to a third party being involved.Last month, Aaron's brother Nick faced allegations of sexual assault and battery from singer Melissa Schuman in a new lawsuit over a 2002 incident that took place in Santa Monica, California.",
        "In February, Carter named Schuman in a $2.3 million suit against Shannon Ruth, who has also accused Carter of sexual assault, TMZ reported.Shannon 'Shay' Ruth, 39, who has autism and cerebral palsy, claims the singer invited her on to his tour bus when she was 17 following the band's concert in Tacoma, Washington in February 2001 after seeing her waiting for an autograph. Ruth claims the star pulled down his trousers and exposed himself to her in a bathroom - before allegedly forcing her to perform oral sex on him and then raping her. "
    ]
}