{
    "articleURL": "/tvshowbiz/article-12038737/Helena-Bonham-Carter-56-shows-eccentric-fashion-sense-gets-Fiat-500.html",
    "content": [
        "Helena Bonham-Carter showed off her eccentric fashion sense on Tuesday as she hopped into her baby blue Fiat 500 while out and about in London. ",
        "The Harry Potter actress, 56, has enjoyed a chilled-out Bank Holiday weekend - as she was spotted going for a stroll with her husband Rye Dag Holmboe, 35, on Saturday. And on Tuesday Helena was spotted out in London once more, as she went to get some fresh air. She showed off her quirky sense of style for a second time in an abstract long skirt, which she paired with a black-and-white kooky floral scarf. Despite the warm spring weather, she added a thick brown wool overcoat and finished the look with black trainers.  ",
        "She chose to pin up her tresses, which she has now dyed scarlet from their signature raven tones. Helena has had a very chilled-out Bank Holiday weekend, enjoying walks around London with her family.   On Saturday the actress was joined by her husband Rye Dag Holmboe, 35, as they walked their two dogs.Helena donned a black midi dress featuring a floral print, as she layered a black coat on her shoulders.The Fight Club star covered her neck with a black and white scarf and carried the essentials in a black crossbody bag.She kept it comfortable for her daily stroll with simple black trainers.Earlier this year Helena has been busy promoting her latest role for the new ITVX series Nolly.",
        "The actress portrays Crossroads star Noele Gordon in the miniseries and the show is set to be released sometime this year.",
        "Gushing about her role, Helena has previously said: 'When I read the script, it was like a gift. A dream. It's like meeting someone and falling in love.'I watched Crossroads. So I knew Noele Gordon as a figure, but I hadn't really taken on board the sacking.'The three-part miniseries, penned by Russell T Davies, will explore the all-powerful reign and fall from grace of the inimitable Noele, who died in 1985.Noele was declared the 'Queen of the Midlands' thanks to iconic role as Meg Mortimer in Crossroads and was the darling of the establishment until it turned on her.As flame-haired widow Meg in the long-running soap opera Crossroads, Noele became one of the most famous people in Britain.Then in 1981, at the height of the show's success and the peak of her fame, she was axed without ceremony, without warning and with no explanation, with the soap eventually ending two years later.With the boss's words 'all good things must come to an end' ringing in her ears, Noele found herself thrown out of the show that was her life for over 18 years.A love letter to a legend of television, and to the madcap soap she starred in, Nolly will be an entertaining ride through Noele's most tumultuous years, and a sharp, affectionate and heart-breaking portrait of a forgotten icon."
    ]
}