{
    "articleURL": "/news/article-12048037/Liverpool-drone-no-fly-zone-Eurovision-security-fears-city-holds-contest-Ukraine.html",
    "content": [
        "Drones banned from flying above Liverpool during the Eurovision Song ContestA no-fly zone has been imposed over Liverpool ahead of Eurovision due to security fears as the city holds the contest on behalf of Ukraine next week.",
        "The beloved competition is being held from May 9 to May 13.Drones will be restricted from flying above Liverpool during the Eurovision Song Contest, as police in Merseyside prepare for their biggest ever operation.Merseyside Police said restrictions affecting drones would be in place from Thursday until Sunday May 14, the day after the competition final.A 'visible armed presence' was also expected as tens of thousands of music fans descend on the city for the contest.",
        "Chief Inspector Iain Wyke said: 'Our policing plans for the Eurovision Song Contest take land, sea and air into consideration and these airspace restrictions, just like other security measures such as road closures or patrols on the River Mersey, are aimed at keeping people safe.'During the event, there are temporary restricted areas for drone flights over parts of Liverpool city centre from 11pm Thursday May 4 to 5am Sunday May 14.'Specialist resources, made up of Merseyside Police officers and officers from regional and national teams, including air support, will be in place for the duration of the Eurovision Song Contest to ensure a safe and secure event.'Chief Superintendent Jonathan Davies, tactical commander for Eurovision 2023, said there were 'unique challenges' because the event was being hosted on behalf of last year's winner, Ukraine.",
        "'It is important to acknowledge our policing role in this event and, despite it being the biggest policing operation we have ever done here in Merseyside, we are confident we have a robust policing plan in place to ensure the safety and well-being of everyone involved,' he said.",
        "'Hosting on behalf of Ukraine has presented some unique challenges whilst completing our preparation but we are confident we have the plans and processes in place to deal with any incidents that may arise and to prevent any significant or ongoing disruption to event visitors to the city, local residents and businesses.'He added: 'There will be a visible armed presence, but I would like to reassure visitors that this is not in response to any direct threat but just as part of our normal reassurance for everyone enjoying the festivities.'He urged visitors to plan their journeys in advance, with a strike by members of the Rail, Maritime and Transport (RMT) union due to affect 14 train operators across the country on the day of the final.Mr Davies said: 'Public transport is expected to be very busy, which may well be further impacted by the national strikes which are scheduled to take place.'So, it doesn't matter which country you're backing in this year's competition or whichever festivities you're taking part in, our officers will be out and about to make sure that everyone can enjoy themselves.",
        "'Have fun, look after each other and remember to report any incidents to our officers.'"
    ]
}