{
    "articleURL": "/wires/ap/article-12046133/Europes-central-bank-weighs-jumbo-rate-hike-Fed-slows.html",
    "content": [
        "FRANKFURT, Germany (AP) - The European Central Bank slowed the pace of its interest rate increases Thursday, stepping back like the U.S. Federal Reserve from a string of jumbo hikes aimed at snuffing out inflation. But the ECB also said it was \"not pausing\" even as its efforts have worked by making mortgages and business loans harder to get.",
        "The quarter-point hike came a day after the Fed approved the same increase but hinted it may be the last for now. The central bank for the 20 countries that use the euro currency started later and said it has further to go even as economic growth slows to a crawl and U.S. bank instability stirs new fears of financial turmoil.\"Based on the information we have today, we have more ground to cover, and we are not pausing. It´s extremely clear,\" ECB President Christine Lagarde said at a news conference. She later added, \"This is a journey. We have not arrived yet.\"Lagarde said there's no \"magic number\" but that the bank \"will know what that is when we get there.\" Inflation has declined for several months, but at 7% is still far above the ECB's goal of 2% considered best for the economy.The previous streak of six hikes of half- or three-quarters of a point were being \"transmitted forcefully\" to lending practices, making it harder to borrow, the bank said. But how that is affecting the rest of the economy, namely by bringing down prices, isn't yet clear.The ECB's lending survey this week showed that banks are getting stricter about giving loans and that consumers and companies are asking for less credit and fewer mortgages.",
        "While the rate hikes are having an effect, \"is it a sufficient effect yet? We don´t know,\" Lagarde said.Holger Schmieding, chief economist at Berenberg bank, foresees two more increases of a quarter-point.\"Unlike the US Fed, the ECB is almost certainly not done yet,\" Schmieding said by email. \"However, the fact that the ECB ... slowed down the pace of hikes suggests that the peak is not far away.\"Making it more expensive to borrow can cool off spending, easing pressure on prices but potentially weighing on economic growth. Demand for housing loans in the eurozone plummeted in the first three months of the year, following the sharpest decline since statistics started in 2003 at the end of last year.Inflation - which peaked at 10.6% in October - has been fueled by Russia´s invasion of Ukraine, which drove up oil prices and led Moscow to cut off most natural gas to Europe. Energy costs have since fallen, but the surge is still feeding through to higher prices for goods, services and food.The spiking cost for Europeans to feed their families has become the new pain point because \"the most vulnerable spend a lot more on food,\" Lagarde said. Food prices jumped 13.6% in April from a year earlier, following a 15.5% annual increase the month before.",
        "Lagarde said employees seeking raises and companies hiking prices to preserve profits were forces that could push up prices.\"We would hope that through a good social contract, these drivers of inflation do not activate each other in what I have called in other places a tit for tat,\" she said.Workers across Europe have been striking for wages that keep pace with inflation, with analysts saying average pay rises could hit 5% this year - driven by eye-catching deals like German public employees´ 11% salary increase over two years.Lagarde, meanwhile, called renewed financial turmoil a risk to economic growth, though upheaval in the U.S. banking system appears - so far - not to be shaking the stability of Europe´s banks, the chief source of credit for businesses.U.S. officials seized First Republic Bank this week and sold it to JPMorgan Chase, the third major bank failure following the collapse of Silicon Valley Bank and Signature Bank in March.The earlier turmoil enveloped long-troubled Swiss lender Credit Suisse and led to a government-orchestrated takeover by rival UBS, but European financial officials say their banks have minimal direct exposure to the U.S. troubles.The central bank has pressed ahead with rate hikes despite concerns about their impact on economic growth. The eurozone barely scraped out 0.1% growth in the first three months of the year compared with the previous quarter.",
        "The ECB´s decision brings its benchmark rate on deposits from banks to 3.25%."
    ]
}