{
    "articleURL": "/usshowbiz/article-12055015/Loose-Women-star-Carol-McGiffin-forced-quit-Covid-conspiracy-views-row.html",
    "content": [
        "Loose Women ITV star Carol McGiffin was forced to quit after a bizarre radio rant, including claiming the Covid pandemic was a World Health Organisation plot to take over every government.",
        "Ms McGiffin, 63, revealed last week that she had left the lunchtime show, protesting that ITV insisted she sign a contract with clauses that were 'totally unjust and unworkable'.Now The Mail on Sunday can disclose that a free speech row was at the centre of her departure, after a backlash over her tirade in an interview on TNT talk radio. In it, original Loose Women panelist Ms McGiffin also accused reputable mainstream news organisations of conspiring to brainwash the public, causing a mass mental health breakdown, after being 'bought off by the Government'.She added she thought the then Health Secretary Matt Hancock tried to bring in Covid patients from France to fill 'empty hospital beds' in Britain at the height of the pandemic.",
        " ITV chiefs saw a backlash against her diatribe on social media, while others phoned the network to demand that she be sacked.Ms McGiffin, who was married to DJ Chris Evans from 1991 to 1998, last appeared on Loose Women on March 2, a week before her TNT Radio interview for The Freeman Report, with James Freeman. She had been a Loose Women regular from 2000 to 2013, then again from 2018.But in her radio interview she slated the show, one of ITV's most popular daytime programmes, hinting that she had been censored by its bosses.",
        "She said: 'I always look back at when I started working in television and radio as the good old days because they were much less policed, I suppose. Much less restricted and it was a freer place to be.'When I look back at the old Loose Womens I used to do from 2000 all the until I left in 2013, they're completely different. There is so much offence. People take so much offence at so much and they never used to.'Last Thursday, Ms McGiffin said she had been forced to leave the show following a row over her contract that had been going on since January.",
        "She said: 'The problem was ITV were insisting, for the first time since I went back in 2018, that if I wanted to carry on doing the show, I would have to sign a contract that was totally unjust and unworkable for me, so I had to say, ''No thanks''. No one in their right mind would have signed that contract.'An ITV spokesman said: 'ITV will not comment on speculation around individual contracts. 'We understand Carol has decided to leave Loose Women and we wish her well.'"
    ]
}