{
    "articleURL": "/wires/ap/article-12061173/Southampton-heading-relegation-losing-Forest.html",
    "content": [
        "NOTTINGHAM, England (AP) - Southampton was on the brink of relegation after 11 years in the English Premier League following a 4-3 loss at Nottingham Forest, which climbed out of the bottom three on Monday.",
        "Taiwo Awoniyi´s brace, Morgan Gibbs-White´s penalty and Danilo´s brilliant team goal earned Forest its latest home win at the expense of the last-placed Saints, whose demotion could be confirmed at the weekend.Forest took full advantage of defeats for Leeds and Leicester in this round of games to move up to 16th place in the 20-team league, three points above the drop zone with three games to play.Southampton´s situation is far bleaker, despite goals from Carlos Alcaraz, Lyanco and James Ward-Prowse. Even if it beats Fulham on Saturday, results elsewhere could also send the team down to the Championship.It was a thrilling end-to-end encounter at the City Ground that completed a bumper Bank Holiday goals bonanza. The 21 goals scored on Monday were a Premier League record for a three-game matchday.Two goals in three minutes from Awoniyi put Forest in command, the first coming in the 18th after a devastating attack at speed. After a quick free kick was taken, Danilo´s long ball set Brennan Johnson free on the right and his first-time cross was perfect for Awoniyi to fire home from 10 meters.The Nigeria international soon doubled his tally, and in some style too, as he hit an instinctive volley on the turn after Danilo´s improvised pass in the area.",
        "Southampton was in danger of being blown away but gave itself a lifeline in the 25th when Gibbs-White´s loose ball allowed a quick break that saw Stuart Armstrong play in Alcaraz and the Argentine converted from close range.There were a few dicey moments as Saints pushed for a leveler, but Forest crucially restored its two-goal lead just before the break.Johnson nipped in to take the ball away from Ainsley Maitland-Niles and was on the end of a kick, with referee Michael Oliver taking his time to deliberate before pointing to the spot.Gibbs-White made no mistake from the penalty, sending his effort down the middle to give Forest a big halftime advantage.Southampton reduced its arrears again in the 51st when Lyanco climbed highest from Ward-Prowse´s corner to power a header that was too hot for Keylor Navas to handle.That changed the complexion of the game and Forest was suddenly hanging on as Saints chased an unlikely equalizer.Another header by Lyanco from a corner caused chaos in Forest's six-yard box as Navas came under a barrage of dangerous set-pieces.But the hosts eased their nerves in the 73rd with a flowing team goal converted by Danilo.Johnson surged down the right and crossed for Gibbs-White, whose delightful deft flick teed up the Brazilian and he made no mistake for his third goal in three games.",
        "Felipe had another goal for Forest chalked off in stoppage time and then Saints were given a lifeline as Sam Surridge fouled Romeo Lavia, with Ward-Prowse sending the penalty straight down the middle in the sixth minute of added-on time.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}