{
    "articleURL": "/wires/reuters/article-12052045/Colombias-Clan-del-Golfo-rules-surrender-open-talks-lawyer.html",
    "content": [
        "By Luis Jaime Acosta",
        "BOGOTA, May 5 (Reuters) - Colombia's Gaitanista Self-Defense Forces (AGC) crime gang, better know as the Clan del Golfo, wants to hold peace talks with the government but rejects a proposed surrender to end its role in the country's conflict, a lawyer for the group told Reuters on Friday.Colombia's leftist President Gustavo Petro has said a key policy for his administration is to make peace negotiations and potential surrender deals with armed groups to end the six-decade conflict, which has killed at least 450,000 people.A proposed law to regulate crime group surrenders, currently under debate in congress, has drawn harsh critique, including from the country's attorney general.\"Surrender, no, they're not going to submit to the justice system with that law, a legal framework is needed,\" lawyer Ricardo Andres Giraldo told Reuters in a phone interview. \"They want a (peace) negotiation.\"The surrender law proposes lighter prison sentences of between six and eight years for participants, coupled with four years of victim restoration work, as opposed to sentences of some 30 years to members who do not comply.Interested groups must commit to destroying their criminal networks, recognizing their crimes, giving victim reparations and turning over weapons, assets and information about their activities.Though the government suspended a ceasefire with the 5,600 member-group in March, accusing it of breaking the deal, the door to negotiations remains open, Giraldo said.",
        "\"We're still sitting in dialogues with the government, trying to build trust between the parties again, to get the government to declare a new bilateral ceasefire,\" he said.The AGC does not want to be treated differently than guerrilla organizations which are eligible for peace negotiations instead of surrender, Giraldo said.The office of the government's High Commissioner for Peace has previously said it is open to talks with the AGC but that the group's structure means negotiations are not applicable. (Reporting by Luis Jaime Acosta Writing by Oliver Griffin Editing by Josie Kao)"
    ]
}