{
    "articleURL": "/news/article-12053841/Britain-grinds-halt-Coronation-Roads-traffic-shopping-centres-deserted.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk High streets, shopping centre and motorways are deserted today as millions of Britons sat at home to watch the Coronation of King Charles and prepare for an afternoon of celebrations.",
        "Whether they are enjoying a street party, joining the crowds in central London or watching live streams from the sofa, royal fans are celebrating the historic moment - leaving the UK's towns empty.Roads are pictured with only a handful of cars and London's streets are bare as many are set to make the most of the King's day of destiny.Bluewater, a large shopping centre just south of London, was near empty today, with the public opting for a day of Coronation celebrations instead of shopping. Pictures show the centre with just a few shoppers, who no doubt enjoyed a queue-free shopping trip. It comes as the world watched King Charles III and Queen Consort Camilla leaving Buckingham Palace in the Diamond Jubilee State Coach as the historic first Coronation in 70 years began today.",
        "The national anthem played and crowds shouted God Save the King as he started on his 1.3mile journey to Westminster Abbey through streets lined with 2million people and 7,000 British troops. 100million people are watching on TV around the world. Many royal fans from the UK and abroad took to London's pubs to get in early pints as they settled in to watch the historic service, which began at 11am at Westminster Abbey.Many have spent thousands to get a glimpse of the atmosphere as the country watches the first coronation of a monarch in 70 years.",
        "Tourists who jetted into London's Heathrow for the Coronation were welcomed to London with a giant celebratory mural on the airport flight path courtesy of British Airways and VisitBritain.  Meanwhile millions poured into the Mall early this morning to get the best possible view of the historic Coronation procession, securing their spots along the route, on the VIP grandstand or in front of big screens.Wave upon wave of spectators attempted to secure a spot to watch the procession from Buckingham Palace.Some sprinted to try and bag a spot at the front of the metal barriers others opted to use Hyde Park's big screens to view King Charles and Camilla as they journey in the Diamond Jubilee coach to Westminster Abbey."
    ]
}