{
    "articleURL": "/wires/ap/article-12053373/Tatis-2-HRs-3-RBIs-Kershaw-Padres-beat-Dodgers-5-2.html",
    "content": [
        "SAN DIEGO (AP) - Fernando Tatis Jr. hit two home runs off Clayton Kershaw and had three RBIs for San Diego, which beat NL West rival Los Angeles 5-2 Friday night in the first meeting between the teams since the Padres eliminated the Dodgers in the NL Division Series.",
        "Yu Darvish (2-2) outpitched Kershaw (5-2), who was knocked out in the fifth inning in front of a loud, festive crowd on Cinco de Mayo. The division-leading Dodgers had their six-game winning streak snapped.It was the first matchup between the teams since Oct. 15, when the Padres beat the 111-win Dodgers 5-3 on a rainy Saturday night to advance to the NL Championship Series for the first time in 24 years.Tatis sent Padres fans into a frenzy when he homered to center leading off the third and again when he lined a two-run shot to left with no outs in the fifth for a 3-1 lead. He has four homers since returning April 20 from an 80-game PED suspension.It was Tatis' ninth career multihomer game and fourth against the Dodgers. He also connected twice against Kershaw on April 23, 2021, at Dodger Stadium.\"He's one of the best pitchers of all time,\" Tatis said. \"You've got to bring your best when you're facing him. I put in a good approach against him, getting good pitches and putting the ball in play. ... They're one of the best teams out there. We were looking forward to facing them and we were ready.\"",
        "Tatis did his trademark stutter step around third base and a teammate placed a green, red, white and black sombrero on his head after he scored. Tatis bought the sombrero a week earlier in Mexico City before he and a cousin went on a boat ride on the Xochimilco Canals, and the Padres began using it for home run celebrations the next day, when they hit six in a 16-11 win against San Francisco.",
        "The Padres have had piñata parties after wins ever since, and Tatis got his first whack Friday night. \"It was fun. Glad I got to hit the piñata for the first time and I'm looking forward to it again,\" Tatis said.\"It's just amazing,\" the 24-year-old Tatis said about the sombrero and piñata celebrations. \"It's bringing the boys together, the energy, having a great time with the boys in this jungle. It's what it's about.\"Manager Bob Melvin said Tatis \"is an extreme talent. These are the type of games, off elite pitchers, he hits good pitching. When you're down 1-0 all of a sudden he comes back and now you're even, and he hits another home run. It doesn't surprise you. He can hit good pitching.\"After Tatis' second homer, Manny Machado and Juan Soto singled before Kershaw struck out Xander Bogaerts and Nelson Cruz. Jake Cronenworth then walked and Machado scored on Ha-Seong Kim's infield single, when shortstop Miguel Rojas couldn't make the play to second baseman Miguel Vargas.Manager Dave Roberts popped out of the dugout to lift the 35-year-old Kershaw, who allowed four runs and eight hits on 94 pitches in 4 2/3 innings. He struck out seven and walked five.It was just the second time in Kershaw's career in which he worked as few innings and allowed as many earned runs and walks. On April 16, 2011, against St. Louis, he allowed five earned runs and walked five in 4 2/3 innings. It was his first-ever outing in which he allowed at least four earned runs, five walks and eight hits in 4 2/3 or fewer innings.",
        "Kershaw, who won his previous four starts, saw his ERA rise from 1.89 to 2.53.\"We made him work some. I think the walks were key,\" Melvin said. \"Obviously Tati had a big night, but we made him throw some pitches, for sure.\"Darvish, moved up a day after Joe Musgrove developed a blister on his right foot, permitted two runs, one earned, and four hits in 6 2/3 innings. Josh Hader pitched the ninth for his 11th save.The Padres, who have won 10 of 14, drew a season-high 11 walks.The Dodgers had runners on second and third with no outs in the first after Mookie Betts drew a leadoff walk and advanced on Freddie Freeman's double into the right field corner. They got only one run out of it, though, when Betts slid in headfirst on Max Muncy's grounder to first base.TRAINER'S ROOMPadres: OF Oscar Azocar was placed on the 10-day injured list with left elbow inflammation, retroactive to Wednesday. OF Adam Engel was reinstated from the 10-day IL.UP NEXTDodgers RHP Dustin May (3-1, 3.19 ERA) and Padres LHP Blake Snell (1-4, 5.28 ERA) are scheduled to start Saturday night.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}