{
    "articleURL": "/tvshowbiz/article-12056225/Nigella-Lawson-Grace-Tame-Rebecca-Gibney-share-memories-late-Jock-Zonfrillo.html",
    "content": [
        "The Sunday Project paid special tribute to the late Jock Zonfrillo ahead of the premiere of his final season of MasterChef Australia.",
        "Gordon Ramsay, Nigella Lawson and Marco Pierre White were among those sharing their precious memories during the emotional episode.Celebrity chef Ramsay broke down in tears as he described how Jock 'lit up the kitchen' and the profound effect his death has had on the cooking world. 'The ripples have been devastating. No-one's gonna get over this quickly. If there's one thing that we've done as chefs is we've united and we're talking about the good times. So...' he said, pausing as he chocked back tears. 'S**t. Sorry. It's just so painful. That's all,' he added, taking some time to compose himself. ",
        "Marco Pierre White said in his own tribute that Jock had qualities 'very few chefs possess' and will live on through MasterChef.'Jock Zonfrillo will never die. He will live on through everyone he touched,' the British chef said.'He lives within us, and everybody who watches that show, a little piece of him will be still in there. That's the truth.'Jamie Oliver also took part in the dedication, saying, 'Jock's superpower I think was his curiosity. He was super curious and fascinated in people, food, travel.",
        "'He did what he did by doing. Like seeing is believing, actions speak louder than words. That's kind of Jock, right?' Australian chef Curtis Stone was among the stars who had kind words for Jock, calling him a 'kind, fair, genuine and honest' man as she fought back tears.  ",
        "With a wry laugh, Stone called the late chef, someone who 'treated everyone with respect, unless they didn't deserve it, then he wouldn't'. 'He genuinely loved people. He would speak to the person who made coffee the same way he spoke to the director. ",
        "'He did a lot on this planet, and it's time for him to rest,' a visibly emotional Stone added. Maggie Beer called Jock, 'the most creative, warm-hearted, exuberant person who was just an amazing chef'. Beloved British chef Nigella said in her own clip: 'My heart breaks, as I'm sure everyone's does, for Jock's children' 'And his family and everyone who loved him of course. This is an old-fashioned phrase here but - may his memory with a blessing.'",
        "Designer Collette Dinnigan also shared a tribute, saying: 'What a great provider and a great chef he was. He was truly world class. 'He had so much energy and the saddest thing for me, he had a big life but he had an even bigger life to still have.'Activist Grace Tame was visibly emotional as she said:  'He lived for his passion, for food, for his kids. He was a legend. He was. He always will be.'Actress Rebecca Gibney shed a few tears when remembering Jock, but said that he'd not want to see her cry. ",
        "'He brought so much joy to so many people. I think that's hard. But I also know if he could see me tearing up he'd go, \"Stop it\"', she said. Singer Jimmy Barnes looked back to nights spent having a drink and a chat with the late chef.  'I never met a Scottish Italian before you,' the Scottish-Australian rocker said, addressing Jock. 'We hit it off in so many bloody ways. In fact, one of my fondest memories is having the odd whisky and singing Scottish songs with you.'",
        "Tommy Little became tearful as he recounted seeing Jock one last time before his death when he spotted the chef out at dinner with his wife Lauren Fried. 'The only regret I have is the last time I saw him I interrupted his dinner. He didn't tell me to going away, but had I known you had so few dinners left with the love of your life, I never would have come over. I love you, mate. I miss you,' he said. Designer Collette Dinnigan said: 'He had so much energy and the saddest thing for me, he had a big life but he had an even bigger life to still have.'The chef died at age 46, and is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.   ",
        "In the year leading up to his shock death multiple welfare checks were carried out by emergency services on Zonfrillo, it's been reported.Medical response units were called on 'a number of occasions' to check up on Zonfrillo, 46, a source told the The Herald Sun.The welfare checks were due to ongoing concerns about the late chef's health before he was found dead at Zagame's House hotel at 2am on Monday, May 1 by police.Police were alerted that something might be wrong with him after receiving an anonymous tipoff, which is believed to have come from his concerned wife Lauren Zonfrillo, well-placed sources have told Daily Mail Australia.",
        "Zonfrillo was set to star in the latest season of Australia's MasterChef, which had been scheduled to start on the day he was found unresponsive.Lauren rang police from Rome early on Monday morning when Zonfrillo failed to answer multiple calls from his wife.Officers who attended Zagame's House at Carlton at about 2am on April 30 found Zonfrillo dead in his bed and saw no signs of anything suspicious or unusual.There was no drug paraphernalia located, no one else in the hotel room and police formed the view the father-of-four had died of natural causes.Mrs Zonfrillo is now left to care for the couple's two young children and the chef's adult daughters from his former relationship, who are understood to have arrived in Australia from Italy on Tuesday night."
    ]
}