{
    "articleURL": "/news/article-12052465/New-Yorkers-DailyMail-com-surprising-reactions-citys-subway-death.html",
    "content": [
        "It was the footage that shocked America – and put New York City on edge: for two long minutes, video captured a Marine veteran holding a homeless man in a chokehold on the floor of subway car.",
        "The video from Monday showed 24-year-old Daniel Penny restraining 30-year-old Jordan Neely.Witnesses say Neely was throwing trash, yelling that he wanted to 'die' or 'go to jail' and menacing other subway riders.It’s still unclear what occurred immediately before the men began wrestling, but apparently Penny tackled Neely and put him in a chokehold lasting longer than two minutes.Penny can be seen restraining him for 45 seconds even after Neely appears to go limp, and as a bystander warned: ‘You're going to kill him.'Neely was later pronounced dead at the hospital. He had been known over the years for his Michael Jackson impersonations, but also more than a dozen run-ins with police - many related to his mental health struggles.Progressive politicians, like Congresswoman Alexandria Ocasio Cortez, have called for Penny to be prosecuted for murder, while fellow Democrat, New York City Mayor Eric Adams, has urged people to wait for the facts of the case to be establishment before making any judgments.However, many have already taken a position.Protesters demanding that Penny be charged have demonstrated in the downtown Manhattan subway station where the incident occurred, and more protests are expected this weekend.Amid all this DailyMail.com went into the city’s streets and subways to ask ordinary New Yorkers – who ride the underground rails everyday – how they are reacting to this tragedy.",
        "‘THINGS HAVE GOTTEN WORSE… ESPECIALLY WHEN YOU’RE A GIRL’‘This week’s killing was a result of the city, and they need to do a better job,’ Rashad, a delivery worker who travels the trains for work, told DailyMail.com.Overall, New Yorkers who spoke to MailOnline agreed that, while disturbing incidents have always occurred on the NYC’s trains, things have noticeably deteriorated since the Covid-19 pandemic began in 2020.Jay, an engineer living in downtown Brooklyn, just several subway stops away from the station where Neely, who was reportedly schizophrenic, was rendered unresponsive, said every time that he rides the subway, he encounters the mentally ill.‘They’re just walking back and forth, so I don't feel safe,’ he told DailyMail.com.Though while most men said that they do generally feel safe, they concede that it’s very different for women.‘My wife's five feet nothing, and Asian, so it’s not so safe for her,’ said David, a retired public transportation worker. ‘I’m her security detail every time she's got to take the subway any place.’Brianna, a young woman from downtown Manhattan, said she often faces sexual harassment. Yvette, a street vendor from Harlem, told DailyMail.com that she was even attacked while riding the subway two months ago.",
        "‘A homeless man punched me in the face after I accidentally touched him. I said I was sorry, but he got up screaming and punched me. He was arrested,’ Yvette recalled. ‘Things have gotten worse. It's not easy, especially when you're a girl.’",
        "NEW YORKERS BECOMING ‘DESENSITIZED’ TO SUBWAY VIOLENCEOne fear many that New Yorkers shared with DailyMail.com is that they feel trapped when subway cars are traveling between stops, because in that time things can go horribly wrong.‘Police should be inside the train instead of outside because we have to wait until we stop to get any help,’ Yvette said, recalling her harrowing assault.‘I was being attacked for about 3 to 5 minutes until the next stop, and then the cops intervened. [Bystanders] were running to the other side of the train. They were scared and nobody knew what this guy had on him.’New Yorkers are so used to these troubling episodes that at least one woman was not even surprised to hear about Neely’s death.‘To me, that's normal at this point. It’s how the city is,’ said Brianna from downtown Manhattan.Darrio, who lives in Long Island City in the nearby borough of Queens and works in Manhattan, compared his reaction to the tragedy to the desensitization that Americans experience after school shootings.‘In the beginning, you were flabbergasted. And then after a while, you stop getting so surprised,’ he explained. ‘Unfortunately, something happens, and you move on.’",
        "Still, despite the constant danger, New Yorkers expressed sympathy for those living on the streets with mental illness.",
        "SYMPATHY FOR HOMELESS AND UNDERSTANDING FOR MARINE VET‘It’s especially hard for the homeless because the cops mistreat them and then they’re attacked by other homeless people, too,’ said Yvette, even though she had been the victim of an attack herself. ‘On top of being homeless, they’re getting mistreated by everybody around.’At the same time, many of the city’s residents, including Jay, the engineer from Brooklyn, were not quick to condemn the Marine veteran who restrained Neely.‘I feel the person that did it tried to do something good and protect everybody around him,’ he said. ‘But I think he overdid it, and he just lost it. He held on to the person too long and when the person was unconscious, he should've realized the person wasn't a threat.’Some even defended Penny, like former MTA worker David, who believes the veteran ‘did the right thing’ in a ‘scary situation.’Others were firm in their belief that Penny should face swift justice.‘I think he should be prosecuted,’ said Karen, a social worker from Queens who avoids taking the train as much as possible because she doesn’t feel safe. ‘He took a life.’Dario agreed, saying ‘100 percent [Penny should at least be charged]… No matter his reason or logic as to why that was happening at the moment, we need due process.’",
        "New Yorkers though could agree on one thing - the city is not doing enough to protect them.‘THE POLICE ARE NOT DOING THEIR BEST’‘[New York City] tells us that they're trying… but, you know, at the end of the day, it's the same old stuff,’ Dario told DailyMail.com. ‘The pandemic and everything really put a damper on things in respect to the safety of trains, because it was already s**t.’Indeed, subway crime rose dramatically during the pandemic, though it is still less dangerous than it was during the 1980s and 1990s - decades that saw more than two dozen murders every year.",
        "That said, the underground carnage is difficult to write off. There were 10 murders on the train last year, compared to about two murders annually over the last five years prior to the pandemic.One New Yorker said she felt so unsafe, and so distrustful of police that she wants to arm herself.‘At this point… we should be allowed to walk around with the weapons because it is very dangerous,’ said Moody, from Brooklyn.‘I've had situations where I've always been attacked by men on the street late at night, and I feel like the police are not doing their best patrolling way to keep us safe.’",
        "‘The police are clearly not helping us, our system is not working, I feel like the only people who can protect us is us,’ she told DailyMail.com.For now, the investigation into the incident is ongoing and an attorney for Daniel Penny tells DailyMail.com they have contacted the DA's Office and the NYPD to cooperate.But regardless of the outcome of this case, New Yorkers certainly believe that the dangers they regularly face have not been addressed."
    ]
}