{
    "articleURL": "/wires/aap/article-12044955/Phoenix-coach-Talay-eyes-vulnerable-Reds-ALM-Finals.html",
    "content": [
        "Despite his own side's recent wobbles, Ufuk Talay believes Adelaide United's own form dip will see Wellington Phoenix win their first A-League Men's final of his tenure.",
        "The two sides meet on Friday night at Cooper's Stadium, not a happy hunting ground for the Nix, in an elimination final.Their last two visits have produced 5-1 and 4-0 wins for the Reds, who start warm favourites to progress to the semis.Wellington have limped to the finals, earning one point from five matches before a 1-0 win over wooden spooners Macarthur FC earned them sixth place.Talay bristled when questioned on his team's form.\"The boys would have regained confidence from our win against Macarthur and I can't certainly say that for Adelaide,\" he said.\"Ever since (a round 24 loss to) Western United, they've struggled, their form has dropped.\"They were flying at one stage, they were 12 or 13 games unbeaten, but finals football is a different ball game.\"United lost 4-1 to Central Coast at home last Saturday and drew 4-4 on the road to Perth the week before, and Talay said those games provided clues to success this weekend.\"Adelaide love an open game ... they don't mind playing a bit of transition,\" he said.\"We need to stop that from happening when we do lose the ball.\"They're a team that's third on the list by long balls. So we need to deal with those moments ... it's not just dealing with the ball into the box. It's also stopping that from happening.",
        "\"We know their strengths or weaknesses and we'll plan and prepare for that.\"Wellington will be without Sam Sutton, Nikko Boxall and Ben Old for the trip.They are also preparing to be without Talay, who after four seasons will finish up as coach at the end of this campaign to chase a job overseas.Wellington fans will hold the Australian high in their thoughts after three finals campaigns in four seasons, though he is yet to win a finals clash.A win here would prolong his tenure, earn the club's first playoff win since 2012, and achieve their season-long goal of a home final - something the club hasn't enjoyed for eight seasons.\"We all want to go all the way. I don't want this to be my last game with the club. We win this game. We get a nice home game to play in front of our fans,\" Talay said.\"We haven't had that luxury since my tenure at the club because of COVID. So this game is very important to myself and the club.\""
    ]
}