{
    "articleURL": "/femail/real-life/article-12049451/Mike-Halligan-Melbourne-rakes-10million-making-healthy-dog-food-brand-Scratch.html",
    "content": [
        "Mike Halligan is the co-founder of Scratch Dog FoodHe started the business after researching the pet food industryScratch has sold $10M worth of dog food since launching in 2018 A frustrated businessman whose beloved dogs got suddenly sick and died decided to fight back against the 'unregulated' pet food industry, and his own dog nutrition brand has now raked in more than $10million.",
        "Mike Halligan quit his job in the fashion industry to launch Scratch Dog Food in 2018 which is a subscription-based company that delivers high-quality healthy kibble to thousands of Australian dogs. The idea was born after Mike discovered dog food producers don't have to adhere to any regulations in Australia and are under no obligation to inform customers what exactly goes into their products.Before he started Scratch, Mike began to research the pet food industry to improve the health of his two sick dogs and was shocked by what he found. 'I really started looking at what they were eating... it turned out most of the food was crap. I was looking around and it was just a mess,' the Melbourne businessman told FEMAIL.",
        "'Both of them passed away in a short amount of time and in that last period I learnt that the dog food industry was unregulated and I got really p***ed off.'The loss of his dogs and his new-found knowledge 'planted the seed' to start his own 'honest' and healthier pet food brand. 'I was so hellbent on making a dog food – your dog eats the same food day in and day out, so if your food isn't good that's going to do a lot of damage to their health that might not be obvious at first,' he said. ",
        "Through a mutual connection, Mike met Doug Spiegelhauer who had been working in the pet food industry for eight years at the time. 'He was one of the top dog food product developers in the country and was actually just about to quit his job,' the cofounder said. 'He was so fed up with having good intentions of making the food but ultimately the brands he was working for would chose price over health.'",
        "The pair set out to create a healthy dog food while informing dog owners exactly what is going into their pet's dinner. ",
        "Blueberries (fresh or frozen) for a low calorie antioxidant boost.Natural Greek yoghurt for probiotics. Being fermented, the dairy is easier to digest.Raw carrots for some satisfying crunch and help keep teeth clean.Natural peanut butter, preferably 100 per cent peanuts and definitely no artificial sweeteners.Raw or cooked broccoli: the superfood we have forgotten - packed with antioxidants.Source: Doug Spiegelhauer, Scratch Dog Food co-founder",
        "Mike said dog owner's are often misinformed as to what supermarket and even premium foods contain with many using meat 'leftovers'. 'Most foods swap out meats and ingredients based on what's cheap at the time. They make it so the packet looks exactly the same but one month it might be lamb then one might be beef and the next month it might be chicken'It's the same dog food but it's just getting swapped out all the time based on cost.'Dog food packaging can also used sneaky marketing tricks to make customers believe their dog is getting more protein than they really are. 'Brands might say there's over 80 per cent protein from meat sources but the meat sources part will be really really small,' Mike explained. ",
        "'Many people will think their dog food has 80 per cent protein in it or 80 per cent meat but that's just not the case. Just look at what the big claim on the packet is really saying.'He also said to watch out for foods that contain high amounts of starches like potato and tapioca which offer little nutritional value. 'There's a lot of confusion because there's so many options. They're all saying they're the healthiest thing and they've got a vet's approval but people just want to be able to see what's in the food,' Mike said. 'The labelling is so vague and there no laws around it so it really is the wild west when you're trying to look on a package for what's healthy or not because it can be disguised so much.'",
        "Together Mike and Doug created Scratch which delivers healthy kibble to pet owners doors on an online-only subscription basis and is fully transparent about the ingredients they use. 'We're the only brand in the country that discloses how much we use of every ingredient and we'll never change that,' Mike said. 'People are able to see 'ok my dog has an issue with chicken, I want to be able to see the dog food doesn't have chicken in it'.'",
        "With no brick-and-mortar stores, rather than spending on rent, the business can invest more money back into sourcing high-quality ingredients. Doug with the help of two certified pet nutritionists develop healthy recipes and source Australian-sourced ingredients. ",
        "'A lot of dog food you buy in the store is bulk-made a few times a year, we make food monthly at times when our dogs need it,' Mike added. 'They end up getting food we might have made in the last week straight to their front door.' Dog parents can even tailor their furry friend's diet, whether they're an adult, senior or puppy, to their specific needs and get foods that help with joint, skin and stomach issues. In the beginnings of Scratch five years ago, Mike said the business took off after word of the brand got around an online community of French Bulldog owners. 'Some of those early people who were looking for transparency in the dog food industry had Frenchies who had been struggling with these skin issues all their life,' he said.At the time, Scratch was selling just one recipe with kangaroo meat that many bulldog owners say cleared up their dog's skin issues. ",
        "'We got shared around all these Facebook groups for Frenchies and suddenly half the customers we had were for French Bulldogs and it really took off from there,' Mike said.",
        "'Once you start helping the health of dogs people just talk about it.'Since then, Scratch has sold more than $10million worth of dog food to thousands of pooches around the country.Mike said this year as the brand turns five he hopes to turn over $15million and hit their 40,000 dog fed by Scratch. He also hopes Scratch will pave a new path for the dog food industry and show owners the importance of what they are feeding their furry friends.  "
    ]
}