{
    "articleURL": "/wires/reuters/article-12044611/LATAM-POLITICS-TODAY-Bolsonaro-aides-arrested-Brazil-vaccine-probe.html",
    "content": [
        "Mexico leader asks Biden to stop USAID funding opposition groups",
        "Peru's Boluarte dismisses report on human rights violationsUS Homeland Security to visit border ahead of Title 42 liftingSpanish far right dub Colombia's Petro \"unrepentant terrorist\"(Adds Mexico request on stopping some U.S. funding and Peru president reaction to human rights report)May 3 (Reuters) -The latest in Latin American politics on Wednesday:Bolsonaro's home raided and aides arrested in Brazil vaccine probeBRASILIA - Brazilian police raided former President Jair Bolsonaro's home, arrested his trusted aides and seized his phone as part of a probe into his COVID-19 vaccination records.The investigation may answer questions about how Bolsonaro, a strident coronavirus skeptic who vowed never to get a COVID vaccine, was registered as vaccinated in health records made public in February.Bolsonaro confirmed the raid on his home in Brasilia to journalists and reiterated that he had never taken a COVID vaccine. He denied any role in allegedly forging documents.Federal police said they were serving 16 search warrants and six preventive arrest warrants in Brasilia and Rio de Janeiro as part of the operation, without naming those targeted.Mexico president asks Biden to stop USAID funding opposition groupsMEXICO CITY - Mexico's president asked his U.S. counterpart Joe Biden to stop the United States Agency for International Development (USAID)",
        "from funding groupshostile to his government, according to a letter presented to journalists, echoing previous Mexican criticism of U.S. interventionism.President Andres Manuel Lopez Obrador did not specify which Mexican groups the U.S. should stop funding, but he has in the past accused several media organizations of being part of a conservative movement against his government.The State Department and USAID did not immediately respond to a request for comment. The State Department has said there are credible reports on restrictions on free expression and media in Mexico.Peru's Boluarte plays down report on human rights violationsLIMA - Peru's president has dismissed claims from the Inter-American Commission on Human Rights that Peruvian security forces' response to demonstrators last Decembercould be classified as a massacre, amid findings of rights violations.More than 60 people died in clashes with police and soldiers in anti-government protests that broke out following the ouster of then-President Pedro Castillo.\"We reject the supposed findings of extrajudicial killings and the 'massacre' description,\" President Dina Boluarte, who replaced Castillo, said at a press conference.US Homeland Security secretary to visit border ahead of Title 42 liftingWASHINGTON - U.S. Homeland Security Secretary Alejandro Mayorkas will travel to the Texas border with Mexico this week ahead of the lifting of Title 42, the department said in a statement.",
        "The trip comes as the COVID-19 health policy known as Title 42 is set to end on May 11 and the U.S. prepares for a possible subsequent spike in illegal border crossings.Spain's far right leader calls Colombia's president 'unrepentant terrorist' during state visitThe leader of the Spanish ultra-right-wing Vox party has criticized Colombian leftist President Gustavo Petro in his first state visit to Spain, calling him \"an unrepentant terrorist\", according to Colombian press Caracol.None of Vox's representatives, including leader Santiago Abascal, attended Petro's speech at Spain's congress to mark the start of the visit by the South American leader. (Compiled by Steven Grattan and Brendan O'Boyle; Editing by Kirsten Donovan and Leslie Adler)"
    ]
}