{
    "articleURL": "/tvshowbiz/article-12042127/Ed-Sheeran-debuts-new-tattoo-second-daughters-footprints.html",
    "content": [
        "Ed Sheeran debuted a tattoo tribute to his youngest child as he stripped off in his new Disney+ docu-series. ",
        "In his series, titled Ed Sheeran: The Sum Of It All, the Photograph hitmaker went shirtless as he took a dip in the pond on his Sheeranville estate in Suffolk. Turning his back to the camera, he revealed the four photo frames inked on his back, with one bearing the footprints of daughter Lyra Antarctica, two, and a new set of prints belonging to his youngest child Jupiter, 12 months. The 32-year-old singer still has two photo frames on his back that have been left bare - with sources previously claiming they symbolised the number of children Ed wanted with his wife Cherry Seaborn. After he debuted the inking in 2021, a source said: 'He has Lyra’s footprints in one and is saving the other spaces for the three more kids he wants.'",
        "They added to The Sun: 'Now he just needs to persuade his wife Cherry to have more.' Ed recently gave a rare insight into fatherhood as he joked that the couple are now 'in the trenches' as they parent their daughters.Speaking on Good Morning America, about how he's finding fatherhood, he explained: 'It's great. We're in the trenches.'Giving a further insight he added: 'They’ve been on tour with me. My second daughter was born while we were on tour, but my first daughter comes to the shows, she’s quite aware.",
        "'I think she assumes everyone else’s dad sings as well, though,' Ed joked.'It's every cliché that people say about parenting. You love both kids exactly the same but also completely differently. I’m really enjoying being a father of two,' he continued.Ed previously spoke about his desire to have a big family and after the birth of his first child he confessed: 'I would obviously be super grateful to be able to have any more kids... 'I think girls are far superior to boys. As a boy myself, I feel like I can say this.'",
        "The star also gushed: 'I’d love more kids man, I’d love it, but it does all depend on what Cherry wants too because it’s her body.'I’m really proud of Cherry as a mother. She’s such an incredible human, I’m just in awe.'Elsewhere in the documentary, Ed broke down in tears as his wife admitted she feared she would die when she was diagnosed with cancer. ",
        "Doctors discovered Cherry, 30, had a tumour in her arm in February last year while she was six months pregnant with their second child, daughter Jupiter. 'I got diagnosed with cancer at the start of the year, which was a massive s*****r,' Cherry said of why she said yes to letting the cameras into their notoriously private life.  ",
        "'But it made me massively reflect on our mortality. We're all human. 'I was saying to Ed I would have never agreed to do anything like this but it made me think, this whole year \"If I die, what's people's perception of me? What do you leave behind?\". 'For Ed he wants to say \"I'm not just this music machine, a robot trying to get number ones. I'm a father. I'm a son, husband, friend\". 'And I've massively reflected. It wasn't until this year where I thought \"I might die\". It was horrible.'When Cherry first sought medical help, she was initially told by a doctor 'this is really bad' and that she had cancer.The mother-of-two immediately rang Ed telling him to cancel all of his plans, while they waited an agonizing month long wait for the full report. But Cherry, who was six months pregnant at the time, was told there were no treatment plans that would work with her pregnancy. After a sequencing test was done on the tumour, the couple found it was much less severe than what was thought originally and surgery could be done after she had given birth to Jupiter. Cherry said: 'It was the most incredible news. I nearly threw up when the surgeon told us we could wait to the end of the pregnancy to get the tumour out. ",
        "'We didn't have to worry about delivering the baby early.' "
    ]
}