{
    "articleURL": "/sport/football/article-12055109/DANNY-MURPHY-Sam-Allardyce-no-dinosaur-manager.html",
    "content": [
        "Everything in football these days does not need to be about the new schoolLeeds should have hired Sam Allardyce as soon as they sacked Jesse Marsch Even if they get relegated, Big Sam can be the man to bring Leeds back up Sam Allardyce ruined some of my favourite football memories. The first time I captained Liverpool was in a League Cup game at Anfield against Big Sam’s Bolton. I scored, too, in what is one of the proudest moments of my career — but we still lost!",
        "That’s what Sam’s teams did to you. I scored one of my best goals for Crewe against his Blackpool side and, guess what, we lost that one as well.So, I didn’t like him much early in my career. His teams always caused me problems and he used to gloat about coming to Anfield and beating my Liverpool side. He revelled in it. It was so easy to dislike him.But you couldn’t help but admire the work he did. His Blackpool team was a hell of a side, even at that level, with Tony Ellis and Andy Preece up front, so I was aware of his managerial skills even as a young lad.Then to see the progression of his Bolton side, from one that was aggressive and hard to play against to that sophisticated team packed with top-class players.",
        "Over time, you had to recognise his management even if you hated playing against him!The older and wiser you get in football, you understand what a brilliant job he did. When I spoke to the lads who played for him, the likes of David Dunn, Gary Speed and Kevin Nolan, they all adored him. I look back and think I’d have loved to play for Big Sam.Getting to know him over the years, too, working with him at Soccer Aid, you cannot help but love him. He’s a likeable character, such an infectious personality and, crucially, he knows his football.",
        "I think it’s a great move by Leeds to bring him in. They should have done it sooner. They should have done it when Jesse Marsch was sacked.I am not of the opinion that everything in football needs to be about the new school. Crystal Palace have shown that with Roy Hodgson while Neil Warnock has worked wonders at Huddersfield.If Leeds had brought Allardyce in then, they would not be in this position now.Sam believes in himself and what he does. His press conference last week showed that. He believes in his man-management and the tactical approach he uses depending on the players at his disposal.He’s no dinosaur. I worked with a guy called Mark Taylor at Fulham. He was head of sports science and medicine for Allardyce at Bolton. He was a huge factor in our success at Fulham, keeping players fit, working on our training schemes, our scheduling around European matches.Big Sam was years ahead of his time with sports science. He’s not just someone who gets a group of players, hoofs long balls and nicks the odd win. That’s not him.His new Leeds side showed fight and spirit at the end of the Manchester City game.",
        "It means nothing in terms of points, especially at this stage of the season, but they will take heart from it going into some massive games.",
        "Not getting dismantled also avoided too much damage to their goal difference, which could be crucial come the end of the season — though they will need points from somewhere.Sam’s got a big job to do but there’s still a chance.Even if the worst should happen and Leeds go down, they could do worse than leaving him in charge. I think he’d bring them back up."
    ]
}