{
    "articleURL": "/wires/ap/article-12055703/U-S-earns-final-semifinal-spot-International-Crown.html",
    "content": [
        "SAN FRANCISCO (AP) - Lexi Thompson made back-to-back birdies on the back nine Saturday and the United States earned the final spot in the semifinals of the LPGA's International Crown team match-play event.",
        "The U.S. clinched the semifinal berth late in the round when China lost its second match to England, but got a half-point anyway when Thompson and Danielle Kang rallied to tie Sweden's Madelene Sagstrom and Maja Stark.Sweden won Pool A when Anna Nordqvist and Caroline Hedwall beat Nelly Korda and Lilia Vu 1 up and will play Pool B runner-up Australia in the semifinals on Sunday.The U.S. will take on Thailand in the other semifinal. Thailand was the only country to win all six fourball matches in pool play.\"Another day to represent our country,\" Korda said. \"That´s all we could hope for, and hopefully we can get a W and make it to the afternoon round for the championship.\"The International Crown is a match-play tournament featuring teams of four players from eight countries. The teams are divided into two pools of four countries, with the top two from each group after three days of round-robin play of fourball competition advancing to the semifinals. Teams get one point for each win and a half for a tied match.",
        "There was little drama headed into the final day of pool play, with Australia and Thailand already advancing to the knockout stage in Pool B and Sweden sweeping both matches in Pool A to advance.",
        "The U.S. team needed just a half-point or have China fail to sweep England to secure the fourth semifinal spot and got it when Alice Hewson made a birdie on 18 to win her match with Liz Young 1 up over Yu Liu and Ruixin Liu.The Americans had a tough time with Sweden despite Vu delivering the shot of the day when she holed out from the fairway for eagle on the sixth hole, leading to a high-five with her caddie.\"It was just 170 and we agreed on 6-iron and I was just going to hit it, and then drain-o,\" Vu said.The U.S. led most of that match before Nordqvist made birdies on the 15th and 17th holes to give Sweden the win.\"Obviously a great finish because I felt like it was pretty tight all day,\" Nordqvist said. \"You knew it was going to have to be really strong play, and I think just proud of ourselves. We finished really strong yesterday to gain some momentum, and we came out firing pretty strong this morning. Going into tomorrow I think we´re all just very excited to have a shot at it.\"Thompson and Kang rallied from two shots down to take the lead by winning three straight holes starting at No. 14. Thompson made birdie putts on 15 and 16 but Sweden earned the half point when Stark made a birdie on the final hole.",
        "\"I watched Lexi hit some unbelievable shots coming in,\" Kang said. \"I was fan-girling coming in. I go, `Oh, my God.´ She just kept side-eyeing me because she knows it´s like the sexiest shot ever. It was good.\"Thailand and Australia squared off to determine who would win Pool B. Thailand had earned four points the first two days and the Aussies got 3 1/2.Thailand won both matches, with sisters Moriya and Ariya Jutanugarn beating Hannah Green and Sarah Kemp 3 and 2, and Patty Tavatanakit and Atthaya Thitikul beating Stephanie Kyriacou and Minjee Lee 1 up.Defending champion South Korea lost all four matches the first two days before salvaging the weekend with two wins over Japan.The semifinals and finals will both be played Sunday, with each match featuring two singles competitions and one alternate shot matchup.This is the fourth time this tournament has been held after being canceled in 2020 because of the COVID-19 pandemic. Spain won the inaugural tournament in 2014, followed by the United States in 2016 and South Korea in 2018.This is the first professional women´s event to be played at TPC Harding Park, which has hosted several big events for the men, including the 2009 Presidents Cup and the 2020 PGA Championship.",
        "___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}