{
    "articleURL": "/wires/reuters/article-12047357/Republican-debt-limit-plan-cut-US-jobs-slow-growth-economist-tells-Senate-panel.html",
    "content": [
        "By Andy Sullivan and Moira Warburton",
        "WASHINGTON, May 4 (Reuters) - A Republican plan to cut federal spending in exchange for lifting the U.S. government's debt ceiling would lower employment, slow economic growth and \"meaningfully increase\" the likelihood of a recession, Moody's Analytics' chief economist told a Senate committee on Thursday.Mark Zandi told the Senate Budget Committee that U.S. GDP growth would be 1.61% in 2024 if the Republican plan were enacted, compared with 2.23% otherwise, and lead to 790,000 fewer jobs.Republicans are pressing Democratic President Joe Biden to agree to spending cuts as a condition for raising the United States' self-imposed $31.4 trillion debt ceiling. Biden and his fellow Democrats insist Congress should raise the cap without conditions.The standoff is already spooking investors: On Thursday the federal government paid the highest interest ever for a one-month debt issue.Zandi said that passing the bill approved by the Republican-controlled House of Representatives without changes would take a heavy toll on U.S. economic growth. But he also said failure to avoid default would be \"catastrophic,\" echoing the assessment of many other analysts and economists.Zandi said the government is most likely to run out of money to pay its bills on June 8 if Congress does not act, though he said it could happen any time between June 1 and Aug. 8.",
        "\"We need to end this drama as quickly as possible. If we don't, we'll go into a recession and our fiscal problems will be made even worse,\" Zandi told the committee.The hearing is the first of several planned by Senate Democrats, who say legislation that passed the House last week on a party-line vote would undercut child care, education and other government programs.Republicans say the cuts are needed to slow the growth of the U.S. debt, which is projected to climb steadily in the years to come as an aging population drives up pension and health costs.That would require the government to devote a growing share of revenues to paying interest on its debt, rather than more productive uses, without action to narrow annual budget shortfalls.Biden is due to meet with House Speaker Kevin McCarthy and other top lawmakers at the White House on Tuesday. The standoff is worrying investors, who have pushed yields on as much as $650 billion of Treasury securities to record highs.Democrats have accused Republicans of hostage-taking, but Brian Riedl of the conservative Manhattan Institute said that Congress has often used debt-ceiling deadlines to reach budget deals in the past.\"If we don't want lawmakers to use this risky and flawed process to address growing deficits, then let's debate and come up with a better budget process,\" he said.",
        "The centerpiece of the House Republican plan would cut a wide swath of government spending by 8% next year, and cap its growth by 1% each year after that.The Republican plan does not specify what spending would be cut, but some party figures have said they would shield military and veterans programs. Democrats say that would force average cuts of 22% on domestic programs like education and law enforcement, a figure top Republicans have not disputed.Biden has proposed raising taxes on the wealthy to narrow budget deficits, but Senate Democrats have not produced a proposal of their own.(Reporting by Andy Sullivan and Moira Warburton; Editing by Scott Malone and Jonathan Oatis)"
    ]
}