{
    "articleURL": "/wires/pa/article-12052169/Former-CPS-worker-jailed-passing-sensitive-information-criminals.html",
    "content": [
        "A former Crown Prosecution Service worker has been jailed after she downloaded and passed on highly sensitive files that ended up in the hands of criminal gangs.",
        "Paralegal Rachel Simpson, 39, from Newport, South Wales, had worked for the CPS since 2003 and is known to have started illegally accessing material from around 2016 until 2020.The single mother’s “inexplicable” actions were said not to have been financially motivated but were rather to maintain the attention of an ex-boyfriend, Cardiff Crown Court heard on Friday.The court was told how most of the information obtained by Simpson during that four-year period related to complex police operations into high-level conspiracy to supply drugs and money laundering cases in South Wales.Searches entered by Simpson on the CPS and Crown Court computer systems were often the names of well-known drug dealers – some of whom she was said to be acquainted with.Documents from those systems were later found to have been downloaded by Simpson onto her laptop. She is also known to have made hard copies of some of those files which were then passed onto a third party.",
        "One bundle of documents printed off by Simpson in April 2019 were anonymously handed in to a solicitors firm in Birmingham that was representing Newport gangster Jerome Nunes – who had been jailed for his role in flooding the city’s streets with over £10 million of class A drugs.The documents came to the attention of the police after they were submitted to the court as part of an appeal to have Nunes’ conviction overturned.",
        "Simpson’s fingerprints were discovered on the papers along with the fingerprints of Nunes’ girlfriend and associate.In May 2020, Simpson downloaded an eight-page document detailing a surveillance operation being carried out on a drug gang in Porth, Rhondda Cynon Taf.A picture of the document was shared a day later between criminals – one of which was former Newport kingpin Stephen Gibbons – on EncroChat, an encrypted messaging platform.Prosecutor David Temkin KC said the information caused those being surveiled to “modify their criminal strategy”.Some of the messages sent over EncroChat included references to a “busy fella in Newport” who “gets CPS papers for us”.The image was discovered by Tarian, the Regional Organised Crime Unit for South Wales, when they were given access to EncroChat data by the National Crime Agency (NCA) after French authorities hacked the service.It led investigators to Simpson, who officers then arrested at her home in June 2020.She was later charged with and admitted two counts of misconduct in a public office and 29 counts of unauthorised access of a computer system.Other information Simpson was found to have accessed included applications by the police to use as evidence calls made on prison phones by former drug-dealer David Perry.Victim personal statements written by a barrister and a detective chief inspector which were read to the court by Mr Temkin detailed how Simpson’s actions had impacted them individually but also undermined the trust between the CPS and police, and between different police units due to suspicions raised over how the information was being leaked.",
        "Edward Hetherington KC, defending Simpson, told the court his client had a “matrix of vulnerabilities” due to her long-term depression and diagnosis of probable autism and that she was susceptible to “influence and exploitation”.Sentencing Simpson to six years in prison, High Court Judge Mrs Justice Jefford DBE said: “Your offending was not a one-off error of judgment.“In addition to the two instances of misconduct, you accessed or attempted to access material once in 2016, twice in 2017, twice in 2018, then 17 times in 2019 and eight times in 2020 before you were stopped. On some occasions you did that multiple times in one day.“The evidence is that you often did so when you were not at work, late at night or off sick making it all the more obvious that you knew that what you were doing was wrong.”“When interviewed by the police, you never offered an explanation or motivation for what you have done,” the judge continued.“Investigations have been carried out to see whether you’ve benefited financially and there is no evidence at all that you did. In one sense, your actions are inexplicable.“You said that you had had a relationship with a man for a few months in 2012 to 2013. About a year later, and out of the blue, he asked you to look up someone at work for him. You did, and you kept doing this when he asked you to.",
        "“You wanted his attention, and you would do anything that he asked. You have not identified him.”She added: “You were well aware that what you were doing was illegal. You had signed the Official Secrets Act.“The public, the courts, and all those engaged in the criminal justice system are entitled to expect the highest levels of integrity from the CPS.“What you did, fundamentally undermines public confidence in that integrity, and in the ability of the CPS properly to prosecute defendants.”Detective Inspector Matt Houghton of Tarian Police said: “Simpson enjoyed a position of trust and responsibility within the Crown Prosecution Service which she betrayed, letting down her colleagues, the police and the public.”"
    ]
}