{
    "articleURL": "/sport/boxing/article-12040445/Harry-Garsides-ex-girlfriend-Ash-Ruscoe-breaks-cover-boxer-denies-allegations-violence.html",
    "content": [
        "Harry Garside charged with common assault on Tuesday nightRelates to alleged domestic violence incident with ex-girlfriendHe was pictured with mystery woman days after alleged assaultHarry Garside's ex-girlfriend has been spotted for the first time since her domestic violence case against the Olympic boxer became public as he takes aim at police and claims his 'reputation will be vindicated'. ",
        "Ash Ruscoe broke her cover to meet with her manager on Wednesday, just hours after her ex-boyfriend was arrested and charged with common assault. The wellness coach appeared relaxed as she strolled through Sydney's Double Bay wearing blue activewear, red sunglasses and a Christian Dior bag. She took swigs from a large water bottle as she laughed and smiled with her agent, who held a coffee and repeatedly glanced down at her phone. The outing came as Garside posted a statement to Instagram, in which the boxer wrote he 'categorically denied' the allegations of violence. The Olympic bronze medallist boxer, 25, is accused of assaulting Ms Ruscoe at her home in Bellevue Hill, in Sydney's east, on March 1.",
        "Police will allege Garside hit his former partner in the head with his elbow and spat in her face and that there was a clash involving a mobile phone. The 25-year-old was arrested as he flew into Sydney Airport on Tuesday night as he travelled home from South Africa, where just hours earlier he had been named the runner-up on the reality TV show I'm a Celebrity... Get Me Out of Here. Daily Mail Australia can reveal police have hit the 25-year-old with a provisional AVO. He also been granted conditional bail on the assault charge and has pledged to defend it. He is due to appear in Downing Centre Local Court on May 24.",
        "On Wednesday, Garside told his Instagram followers he had 'nothing to hide'.'The conduct of police in the presence of media at Sydney International Airport yesterday took me completely by surprise,' he wrote.'I categorically deny the allegations of violence and dispute the account given to police. I have nothing to hide and will defend myself against this charge. 'The police have not been provided with all the facts and I am confident that my reputation will be vindicated through the legal process. 'Because the matter is before the courts, I won't say anything further.' ",
        "It comes as video surfaces of Garside's ex-girlfriend described how surviving a previous violent incident had changed her life forever. Ms Ruscoe said the alleged incident had been the 'best thing' to ever happen to her and had been the inspiration behind her personal training business 'Hit Like A Girl'.'I felt super disempowered, and I guess as a woman experiencing ... violence, so many woman experience it in some way shape or form,' she said during an appearance on the King Beats Fitness podcast in March 2022. 'So when I experienced it, I was like, what is the one thing that's going to re-empower myself, and it was through combat sport.'I thought, I'm going to create a business that's based on empowering other women and men, and I want to pass that on.' ",
        "In another interview, the personal trainer said surviving one of the hardest times in her life had given her the opportunity to help others. 'In retrospect, that is the best way I could have dealt with it, to channel that energy into helping others, I think that is a key thing,' she said. 'It puts everything into perspective and it just takes the shift off yourself and the sadness off yourself and you're able to feel gratitude from helping someone else.' It is not suggested Garside had anything to do with the previous incident described by Ms Ruscoe.  The couple dated for about 18 months before splitting earlier this year."
    ]
}