{
    "articleURL": "/wires/reuters/article-12040079/Plagiarism-machines-Hollywood-writers-studios-battle-future-AI.html",
    "content": [
        "By Dawn Chmielewski and Lisa Richwine",
        "LOS ANGELES, May 3 (Reuters) - Hollywood writers have for decades penned sci-fi scripts featuring machines taking over the world. Now, they are fighting to make sure robots do not take their jobs.The Writers Guild of America is seeking to restrict the use of artificial intelligence in writing film and television scripts. Hollywood studios, battling to make streaming services profitable and dealing with shrinking ad revenues, have rejected that idea, saying they would be open to discussing new technologies once a year, according to the guild.A spokesperson for the Alliance of Motion Picture and Television Producers, which is negotiating the contract on behalf of the studios, did not comment.The dispute over AI is one of several issues that led Hollywood´s film and TV writers to strike Monday, marking the first work stoppage in 15 years.Although the issue is one of the last items described in a WGA summary of negotiating points, many of which focus on improving compensation in the streaming era, the debate over AI's role in the creative process will determine the future of entertainment for decades to come.Screenwriter John August, a member of the WGA negotiating committee, said writers have two concerns regarding AI.\"We don't want our material feeding them, and we also don't want to be fixing their sloppy first drafts,\" he said.",
        "At issue is a rapidly growing, multifaceted technology that's swept across global industry.In Hollywood, AI is helping to erase wrinkles from an aging performer´s face, clean up an actor´s liberal use of f-bombs and draw animated short films with the aid of OpenAI´s Dall-E, which can create realistic images. Some writers are experimenting with creating scripts.'LAST BASTION'\"The problem here seems to be that we thought that creativity, per se, was the last bastion, the line in the sand, that would stop machines from replacing someone's job,\" said Mike Seymour, co-founder of Motus Lab at the University of Sydney, who has a background in visual effects and artificial intelligence and has consulted with several studios. \"I would argue that that's just some kind of arbitrary notion that people had that caught the popular imagination.\"AI can help writers break \"the blank piece of paper phenomenon,\" Seymour said, and it's good at what he describes as \"pantomime,\" or producing straight-forward, blunt dialogue, though it lacks nuance.\"I'm also not claiming that AI is going to become super intelligent and produce, you know, 'Citizen Kane,' because it just isn't right,\" said Seymour.Writers fear they will be sidelined, or at least, shortchanged.\"What (AI) could do is spew out a garbled piece of work,\" said Warren Leight, a screenwriter who served as showrunner and executive producer of the NBC drama \"Law &amp;amp; Order: SVU.\"",
        "\"Instead of hiring you to do a first draft, (studios) hire you to do a second draft, which pays less. You want to nip that in the bud.\"The union proposed that material generated by an AI system such as ChatGPT could not be considered \"literary material\" or \"source material,\" terms already defined in their contract.As a practical matter, that means that if a studio executive were to hand a writer an AI-generated script to revise, the writer could not be paid a lower rewrite or polish rate.The union is arguing existing scripts should not be used to train artificial intelligence, which would open the door to intellectual property theft.\"We call it the 'Nora Ephron problem,'\" August said, referring to the writer of romantic comedy hits including \"When Harry Met Sally\" and \"You've Got Mail.\"\"One can imagine a studio training an AI on all of Nora Ephron's scripts, and having it write a comedy in her voice. Our proposals would prevent that.\"WGA chief negotiator Ellen Stutzman said some members have another term for AI: \"plagiarism machines.\"\"We have made a reasonable proposal that the company should keep AI out of the business of writing television and movies and not try and replace writers,\" she said. (Reporting by Dawn Chmielewski and Lisa Richwine in Los Angeles, additional reporting by Rollo Ross and Danielle Broadway in Los Angeles. Editing by Kenneth Li and Lincoln Feast)"
    ]
}