{
    "articleURL": "/wires/pa/article-12060393/Watford-boss-Chris-Wilder-takes-small-positive-Stoke-victory.html",
    "content": [
        "Chris Wilder admitted that Watford’s 2-0 win over Stoke was only a small crumb of comfort after his immensely disappointing season.",
        "The Hornets boss, who was sacked by Middlesbrough last October, refused to discuss his future at Vicarage Road, with the rumour mill rife that he is about to be replaced.Imran Louza and Keinan Davis scored second-half goals to ensure Wilder’s side at least ended the campaign with a top-half finish.Louza’s brilliant 20-yard curler broke Stoke’s resistance after 70 minutes and Villa loanee Davis’ deflected shot beat Matija Sarkic four minutes later.Wilder said: “The message to the players was that there is always something to play for. There’s always somebody watching, there’s always that pride in pulling that shirt on, whether as an individual or as a team.“From my point of view it could have been a really disappointing afternoon. The atmosphere might have turned one way but it didn’t because we’ve got a result.",
        "“The supporters want to see a winning team and they’ve seen a winning team today, even all three results could have happened.“We had some good moments first half and they had some good moments first half. But in the second half we get the goals in quick succession and then it’s a comfortable afternoon.“To get a small consolation out of a deeply disappointing season is a small positive. But it was disappointing when we’re walking around (on the lap of appreciation) because this shouldn’t have been the end of the season. But it is and there’s a reason behind that.",
        "“It’s been a strange old season, personally. It’s been quite tough. I’ve had a relatively successful career as a manager in terms of being involved in winning sides and building teams and personal accolades as well.“You’ve got to take the rough with the smooth. I’m a better manager for all these experiences, I haven’t gone off the boil.“I’m just concentrating on this win today, anything else going forwards will be a conversation, I’ve not sat down with anybody, I don’t want to go into gut feelings.”Stoke boss Alex Neil looked relieved to wrap up a poor campaign from the Potters, especially as his former club Sunderland, who he left last August, clinched a play-off spot.Neil said: “My verdict is that game pretty much sums up our season.“I don’t think it was a poor performance. I thought in the first half we were really good at times, we created some really good chances. But, ultimately, if you don’t stick the ball in the net and then you can’t defend in moments, because that was all Watford had in the second half, moments.“Their first goal was quite a good goal. Their boy cuts in and puts it in the far corner. Their second goal was just a one-v-one situation where we just don’t deal with it and the ball ends up in the back of our net.",
        "“But we had three or four similar opportunities and we don’t manage to convert any of them. That’s basically the tale of our season for me. This season, at both ends of the pitch, we haven’t been good enough.“Today wasn’t ever going to change anything. What’s been needed has been needed for a number of weeks.“I feel as if I’m doing the same press conference week after week. It’s going to be a big summer for the club.“I’ve got meetings (with the players) over the next week. Loan players we’re not in control of because ultimately they’re not our player.“We’ll need to see what happens over the summer, but the difficulty is that we’ve got urgency, but that urgency needs to be shared by the opposite club. So it’s going to be difficult to get anything done.”"
    ]
}