{
    "articleURL": "/tvshowbiz/article-12042279/Amy-Childs-cradles-twins-lavish-family-stay-Claridges-fiance-Billy-Delbosq.html",
    "content": [
        "Newly-engaged Amy Childs and her fiancé Billy Delbosq cradled their newborn twin babies during lavish family night away at Claridge's Hotel. ",
        "Sharing a sweet video to Instagram on Wednesday, the former TOWIE star, 32, told her followers how she had used her time away to plan a 'very special' wedding. Amy could be seen as she cuddled her daughter Amelia Mae while Billy, 40, held their son Billy River. The TV personality looked effortlessly stylish in a linen shirt with a tiered linen hem and a pair of checked flared trousers. She styled her brunette locks into voluminous curls and shielded her eyes with a pair of sunglasses while posing for another photo in the hallway.  ",
        "Amy captioned the clip: 'A night away at our favourite @claridgeshotel with the twins… what a whirlwind April has been for us both, Billy's 40th, twins was born and then getting ENGAGED!! April 2023 you have been amazing ❤️'A night away speaking everything wedding plans, think we have got an eye on something very special we are so excited!!'The twins are the couple's first children together while Amy is also proud mum Polly, five, with ex-boyfriend Bradley Wright and son Ritchie Jr, two, from a previous relationship. The couple announced their engagement last week on Instagram, with Amy sharing a sweet video of the moment the First Dates star got down on one knee. The couple's twins wore baby-grows asking: 'Mummy will you marry my Daddy?' ",
        "Billy decided to pop the question with a huge diamond ring during a photoshoot, just weeks after they welcomed son Billy River and daughter Amelia Mae. 'I said YES… Future Mrs Amy Delbosq,' Amy captioned the video. She teased the moment has been captured on their new ITVBe spin-off show Amy Childs: The Twin Life. ",
        "Amy previously spoke about how she wanted to marry Billy, who owns a flooring business and gym in Brentwood, Essex. He previously starred on First Dates. 'I've never been engaged and I'm putting the pressure on him now. We're going in the right direction,' she told MailOnline last year. The couple have been an item since October 2021, just two months after the mother-of-two split from her ex-boyfriend Tim following 14 months together. He later joined the cast of TOWIE which was a big step for Amy, who hasn't had a partner on the show since she dated former co-star Kirk Norcross, 34, when she was 19. "
    ]
}