{
    "articleURL": "/sport/rugbyunion/article-12055031/Saints-fly-half-Fin-Smith-focused-Premiership-semi-final-eyeing-England-future.html",
    "content": [
        "Smith was staring down the barrel of unemployment after his club went bust Fly-half was signed up by Northampton and fast-tracked into the starting XV He joined England squad during the Six Nations despite his Scottish rootsPaint me like one of your French girls!’, says Fin Smith, perching on the bonnet of his Ford Fiesta for a quick photograph, surrounded by BMWs and Mercedes in the Franklin’s Gardens car park.",
        "Having just offered a lift to Northampton train station, the young No 10 pushes back the passenger seat and makes a joke at his own expense.‘Most of the guys get into their big sports cars and I do a lap and wait for them all to leave! They take the p*** that I’m still driving the little Fiesta that I got as a joint 17th birthday present but I love it. It’s in good nick. With everything that’s gone on this season, I can take having the s******* car in the car park!’Eight months ago, Smith was staring down the barrel of unemployment. He watched his club Worcester, which he joined at 13, fall into bankruptcy and suddenly found himself without a job.Life has moved on quickly. Smith was one of the lucky ones. He was signed up by Northampton, fast-tracked into the starting XV after Dan Biggar’s mid- season exit and is now preparing for a Premiership semi-final against Saracens.",
        "‘At the start of September, I had a smashed-up jaw, Worcester were going bust and it was all going to pot,’ says the 20-year-old.‘No one was training and I was thinking, “What the hell happens now?” There were days when I was looking on uni websites thinking I should probably apply in case I don’t get another club.",
        "‘I would probably have moved back in with my parents, gone to the gym every day, done my kicking and got a job in a pub to keep the money ticking over until next season. Guys are still in that situation now. It’s scary. I care about that club so much so it was pretty hard to see it all just get ripped away.‘I haven’t had time to reflect on it all because it happened so quickly, but I look back and think, “How on earth did that happen?” It’s nice to look around the league and see guys like Ollie Lawrence, Ted Hill, Joe Batley and Seb Atkinson ripping it up but it does leave you with a feeling of, “What if?”’",
        "Smith’s parents, who both have distinct Scottish accents, traded their Sixways season tickets for Franklin’s Gardens. Rugby runs deep in the family, ever since Smith’s grandad, Tom Elliot, played for Scotland and toured with the British &amp; Irish Lions in 1955. In recent months, however, Smith has nailed his colours to the English mast. His breakthrough season with Northampton was recognised by Steve Borthwick, who called him up for England’s camp throughout the Six Nations.‘At the start of the season, international rugby probably wasn’t on my radar,’ says Smith. ‘Things have happened faster than I expected and it was a cool experience to get a little look in during the Six Nations. Obviously I’ve got Scottish roots. My grandad was prop for Galashiels and was a bit of a legend there. The whole family’s rugby mad. Unfortunately I never got to meet my grandad but there are some cool bits at my granny’s house in Scotland. Lions caps, blazers, things like that.",
        "‘My parents moved down here and met at London Scottish Rugby Club in Richmond! Dad played in the 6th team. Mum had probably turned up to watch the 1st team but then met a 6th team weirdo at the bar! The rest is history.‘Dad’s from Dunfermline and mum’s from Galashiels but I’m very much desperate to play for England. I grew up here. If things don’t work out then never say never, but at the moment I’m 100 per cent all-in on England, be it now or a couple of years after the World Cup when they start a new cycle. That’s the route I want to take. I’d love to get a shot, and hopefully it’s sooner rather than later.’Still living in the academy house with Kayde Sylvester and Ed Prowse, Smith has been balancing rugby with an Open University degree in Maths and Economics. ‘My next exam’s on June 12 so it’s only an hour or so of revision at the moment. Macro-economics stuff: tariffs. Loads of stats, loads of graphs, supply and demand.‘The exams all come in and around the World Cup camps. Fingers crossed I’ll be involved, but I’m not sure what Steve would say if I need to dip out for a three-hour exam!’",
        "How about a dissertation on Worcester Warriors? ‘It could be an interesting study: How can a business with two owners go to pot so badly?‘These new guys, Atlas, have bought the club and people just want to know what that looks like. The idea of Wasps playing at Sixways, which has been reported this week, doesn’t seem like the most sustainable idea. The fans have been bashed around enough and deserve some clarity.’In the meantime, Smith’s focus rests entirely on Saracens at the StoneX Stadium next Saturday. Northampton are bidding for a first Premiership title since 2014 but first they must overcome the title favourites, built around their steely No 10 Owen Farrell. The head-to-head will be the ultimate test of Smith’s credentials.‘It was so interesting to sit in meetings with Owen, Marcus Smith and Nick Evans during the Six Nations and hear them talk about game management.",
        "‘If Owen’s playing for Saracens, they’ve got a much higher chance of winning. He’s a legend of the English game. He drives standards. He’s not the fastest or the most flashy player but his skillset is unbelievable. In no means am I pushing to those levels any time soon but it’s good to get up against someone like that. Measure up how close you are on a good day or how far away you are on a bad day.’",
        "If Smith has a good day, we will see Northampton at their free- flowing best, stitching together phases, bidding for an upset.‘The worst thing we can do next Saturday is get stuck in an arm wrestle, with Saracens kicking to us and us kicking it straight back,’ he says.‘That’s how they’ve won however many trophies over the last five or six years. Obviously we’ll need to kick the ball, but hopefully you won’t see too much of us feeding into what they’re good at. If we’re going to do it, we may as well do it the hard way.’"
    ]
}