{
    "articleURL": "/tvshowbiz/article-12038579/Luca-Bish-Conor-McGregor-fans-glimpse-unlikely-friendship.html",
    "content": [
        "He will have mingled with plenty of stars since rising to fame as a contestant on last year's Love Island.",
        "But reality star Luca Bish, 23, who finished runner-up on last summer's series with Gemma Owen, is likely to have left some of his fans surprised a he gave a glimpse at his unlikely friendship with former Ultimate Fighting Championship legend Conor McGregor, 34, at the weekend.Former fishmonger Luca took to TikTok to share a video of himself boarding a private jet in Los Angeles, California as he and Conor jetted to Denver, Colorado with some other pals to watch a Bare Knuckle Fighting Championship match.Irish mixed martial artist Conor was a surprise ringside guest at the fight where he watched ex-opponents Chad Mendes, 37, and Eddie Alvarez, 39, battle it out, with Eddie winning.And Conor certainly made Luca and his other pals welcome on the trip, as they all flew to Denver on a private plane, with the group posing on the tarmac before boarding the aircraft.",
        "Conor took to his Instagram page to share pictures of the group in which they held up bottles of whiskey, with the sportsman captioning his post: 'Bare knuckle with a couple of goers and a jet full of @properwhiskey. @tiernanbradleyboxing @tommywelchboxing @lucabish.'It comes after Luca's ex Gemma Owen insisted she still hasn't dated anyone after splitting from Luca five months ago.The former Love Island star, 20, who met fishmonger Luca, 23, on the ITV2 series last year, told MailOnline she's been 'focusing on herself' and isn't ready to meet anyone after the couple went their separate ways in November.",
        "Gemma exclusively told MailOnline: 'I haven't dated at all.'She added: 'I have been focusing on myself and getting myself in a happy and content place personally before I start to try and find someone.'Gemma and Luca split last November, three months after missing out on being crowned Love Island winners.Daughter of former footballer Michael Owen, Gemma, confirmed their split with a statement shared to her Instagram Stories, saying it 'wasn't an easy decision'.A source close to the couple told MailOnline at the time: 'Gemma and Luca have decided to part ways.",
        "'Their relationship hasn't worked for the last few weeks, and they have come to the conclusion that it's better for them both to end things now.'They hope to remain friends and will continue to support each other in everything they do going forward.'Love Island was a special time in their lives but sadly their romance hasn't felt the same outside of the villa.'Confirming the split on her Instagram, Gemma wrote: 'To all my followers, I wanted to let you know that Luca and I are no longer in a relationship. It wasn't an easy decision but ultimately this is what is best for both of us right now.",
        "'Many of you have been on this journey with us from the very beginning and I want to thank you for your continued support as we start new chapters. Love always, Gem x.'",
        "Luca also shared his own statement confirming the split, writing: 'I would have liked some time to process this privately but as you all already now know sadly Gemma and I made the mutual decision earlier today to go our separatre ways.'We have been on such a journey together and have made some amazing memories which I will treasure. I can't thank everyone enough for all their support for us as a couple during and after Love Island.'We will remain good friends and I wish nothing but the best for her.'"
    ]
}