{
    "articleURL": "/money/mortgageshome/article-12038265/Housebuilders-scale-building-new-homes-affect-prices.html",
    "content": [
        "In annual results, firms say they will reduce number of homes they build Barratt Homes, Persimmon and Taylor Wimpey all report a fall in buyer demandWe look at what else is affecting market and whether it will impact house prices The UK's major housebuilding firms have revealed a subdued outlook in their most recent results, with some suggesting that they will cut back the number of new properties they develop. ",
        "It comes as household budgets continue to be squeezed, and mortgage rates remain high following rising interest rates and the fallout from last year's mini-Budget. These factors could lead to a reduced demand for new homes. Persimmon's trading update last week revealed a 42 per cent fall in completed property sales in the first quarter of this year - though the average price the homes were sold for was up 10 per cent compared to the same period in 2022.The overall picture is not dissimilar from its peers. In its first quarter update Taylor Wimpey reported a total order book of 8,576 homes, down from 11,119 in 2022.",
        "Furthermore, the company said it was axing up to 450 jobs as part of an effort to make £19million through cost savings.In its latest update in March, Berkeley said it hadn't changed its outlook for this year, despite a fall in sales since the end of September compared to the start of the financial year. However, it admitted it was taking a 'cautious approach' to new building. Likewise Barratt Developments reported that forward sales between January and April 23 totalled £2.96billion, about a third down on the same period in 2022, while the net reservation rate was 30.1 per cent lower. Construction also finished on 3,194 properties, compared to 3,915 last year. ",
        "We look at why these companies might reduce the number of homes they build, and what that might mean for those looking to buy. Why are housebuilders holding back? Like homeowners, housebuilders have also been affected by the fallout from last autumn's mini-Budget.The sharp fall in buyer demand as mortgage rates shot up, coupled with the wider economic stagnation and inflation increasing the cost of building, has created an uncertain outlook - although most expect better activity in the second half of the year.'It is hugely capital intensive to buy land and build on it,' says Tom Nicholson, advisor at property data company Outra. 'You are putting in a significant amount of money years before you start getting a return.'It takes years to turn a piece of land into a development full of completed houses - and if those homes don't sell for as much as initially expected, the housebuilder could lose out. ",
        "This is one of the reasons that these firms are cautious in their attitude to risk, and will often pull back from building homes or buying new land at the first sign the market might be slowing down.  'A slowdown in the market when you have invested significantly is not great,' says according to Justin Gaze, head of residential development land at the property consultants Knight Frank.",
        "'Many are trying to increase their volumes to take advantage of the increase in house prices, but demand has been slow.' This was reflected in a recent survey Knight Frank took of housebuilders, in which 70 per cent of respondents said they were looking to defer payment for land for up to three years, or pay in increments. In a further indication of the pressure they face, over 50 per cent of survey respondents said they expected offering incentives to buyers would help increase sales in 2023. Incentives could include paying service charges for the first five years, or paying for stamp duty to alleviate costs, especially for first time buyers.Finally, the higher cost of building materials has had a detrimental effect on housebuilder since inflation began rising - but that could be set to ease.  The Build Cost Information Service is forecasting costs to increase by 4.2 per cent this year, down from a jump of 11.6 per cent in 2022. In the Knight Frank survey, 48 per cent of developers said build costs had a significant impact on their business in Q1, but these were expected to reduce throughout the year as construction supply shortages are easing.Planning permission 'too slow' According to Gaze, economic factors are not the main reason that housebuilders are reducing the amount of properties they build. ",
        "The bigger issue, he tells This is Money, is that it takes too long to get planning permission. He says that the Government does not encourage the development of new housing and is not 'funding the planning service properly.' For housebuilders and developers buying land without planning consent it is taking years to get projects off the ground.'What's happening is that pricing of the finished product is relatively inelastic,' says Gaze. 'So, what they're selling the houses for hasn't really changed, and the reason is that because there's such a limited supply of land coming through the housebuilders are slowly but surely building to demand.'They're not building lots of houses and having to discount it because they can't sell.'",
        "In Knight Frank's Survey, 85 per cent of housebuilders said planning delays were one of the biggest challenges for their business this quarter.There is also the issue of Nimbys - standing for 'Not in my back yard' - a name given to residents who oppose local housing developments.Gaze says the Conservative Government has taken the political view that it is better not to 'upset the Nimbys than to build more houses.' Nicholson agrees. 'There is a significant amount of land stuck in the planning system, and even areas that already have outline planning consent are being captured by restraints,' he says. ",
        "Although the Conservative Government has committed to streamlining the planning system, there have been few updates since it was announced late last year. Will house prices fall? If demand for homes was to fall enough, housebuilders might be forced to reduce their prices to entice buyers in.But at the moment, falling inflation and mortgage rates mean many expect buyer interest to pick up soon. There are also suggestions that the Government may bring back the Help to Buy scheme, which in its previous form only applied to new-build homes and boosted housebuilders' profits. 'The developers have got no need to discount pricing to encourage sales volumes,' says Gaze. 'Our prediction overall is that house prices will fall in the second hand market, but I don't think that will impact new builds.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}