{
    "articleURL": "/sport/football/article-12052533/AHEAD-GAME-Sky-Sports-internal-Jeff-Stelling-replacement.html",
    "content": [
        "Italian broadcaster offered FIFA below £1m for the women's World Cup rightsJeff Stelling is likely to be replaced in house while Martin Tyler is going nowhereWenger could be at the Emirates for last game if Arsenal can still win the title Sky look to replace Stelling on the cheap amid cost cuts ",
        "Sky Sports are planning on making an internal appointment to replace Jeff Stelling as host of Soccer Saturday next season after the veteran presenter announced his departure on last weekend’s programme.Sky are in the midst of a major cost-cutting exercise after losing nine per cent of their UK subscribers last year, with a number of their football reporters facing redundancy, and a big-money recruit from outside the organisation is viewed as inappropriate in the circumstances.Match of the Day 2 host Mark Chapman was approached by Sky to front Soccer Saturday when Stelling considered stepping down last year.But existing staff members Julian Warren and Adam Smith are now viewed as the front-runners.",
        "Tyler not ready to follow in Stelling's footsteps Sky's veteran commentator Martin Tyler has no intention of following Stelling and top pundit Graeme Souness, who also announced his departure last weekend. Tyler, 77, demonstrated his remarkable work ethic by commentating on three live Premier League games in the space of four days for Sky this week and is determined to carry on next season. ",
        "49ers Steer Allardyce hireThe San Francisco 49ers were heavily involved in Leeds’ sacking of Javi Gracia and recruitment of Sam Allardyce this week as they prepare to complete a full takeover of the club.",
        "49ers Enterprises president Paraag Marathe has been on the board at Elland Road since they first bought into the club five years ago and is now heavily involved in all major decisions.As Mail Sport revealed last month, Leeds’ value will drop by about £220million if they are relegated so the 49ers’ initial outlay would be far less if they are in the Championship, but the NFL franchise’s primary consideration is keeping the club in the Premier League.",
        "World Cup TV row escalatesEuropean broadcasters have valued the Women’s World Cup at less than one per cent of the price they paid for the men’s tournament in Qatar, with the stand-off over TV rights of this summer’s competition in Australia and New Zealand set to continue. Mail Sport has learned that the offer FIFA received from Italian state broadcaster RAI was below £1million for the entire tournament — in contrast to the £100m they paid last year to cover a World Cup for which Italy did not even qualify. German company ARD also offered less than three per cent of what they paid last year.",
        "The leading offers from broadcasters in Spain and Italy were worth less than five per cent of the value of the men’s TV deal, leading FIFA president Gianni Infantino to threaten a TV blackout in Europe.",
        "TV coverage in the UK is not under threat as the BBC and ITV have agreed a joint deal worth about £9m to screen all 64 matches.Baggies' barmy interest BillWest Bromwich Albion are committed to shelling out more than £700,000 per year in interest payments alone to service a £20million loan from MSD Capital. The club took out the loan to provide cashflow in December after owner Guochuan Lai failed to repay £5m he borrowed from the club for one of his Chinese companies. ",
        "West Brom have effectively written off that loan, and to compound matters Lai failed to make agreed interest payments as well as the capital repayment. West Brom will be unable to meet their existing wage obligations next season if they remain in the Championship so are planning a fire sale of players this summer. Arsenal plan Wenger inviteArsenal are planning to invite Arsene Wenger to their final Premier League game against Wolves on May 28 if the title race goes to the last day of the season. Wenger attended his first match at the Emirates since leaving the club five years ago when Arsenal beat West Ham 3-1 on Boxing Day, and the club want him to be present if Mikel Arteta’s side have a chance of winning the league for the first time since the Frenchman’s last of three titles in 2004. "
    ]
}