{
    "articleURL": "/news/article-12043099/Men-accused-Rochdale-grooming-gang-court-charged-100-offences.html",
    "content": [
        "Ten men aged 37 to 62 were accused of being part of Rochdale grooming gang Ten men have appeared in court accused of being part of a grooming gang that sexually abused teenage girls in Rochdale.",
        "The men are accused of more than 100 offences including rape, sexual activity with an underage girl and trafficking persons for sexual exploitation.The charges relate to alleged incidents involving three underage girls in the Lancashire town between 2000 and 2006.They form part of Operation Lytton, an ongoing investigation by Greater Manchester Police (GMP) into historical child sexual exploitation.All of the men appeared on Wednesday at Manchester and Salford Magistrates’ Court.",
        "They were charged as part Operation Lytton in March, 2022. Mohammed Zahid, 62, of Station Road, Crumpsall has been charged with 32 offences, including rape, trafficking persons within the UK for sexual exploitation and penetrative sexual activity with an underage girl, gross indecency with an underage girl, and procuring an underage girl to have unlawful sexual intercourse with unknown males.Roheez Khan, 37, of Rochdale, has been charged with three offences, including two rapes and one charge of penetrative sexual activity with girls aged 15 to 17.Arfan Khan, 39, of Rochdale has been charged with four offences, including two rapes and two counts of engaging in sexual activity with a child.Mohammad Salim, 44, of Rochdale, has been charged with eight offences, including four rapes and four counts of engaging in penetrative sexual activity with an underage girl.",
        "Mohammed Shazad, 42, of Rochdale, has been charged with 16 offences, including seven rapes, one charge of inciting a girl to commit gross indecency, one charge of trafficking persons for sexual exploitation, two counts of penetrative sexual activity with an underage girl and five counts of sexual penetration of a girl.Mustaq Ahmed, 65, of Oldham, has been charged with six offences, including two rapes and four counts of gross indecency with an underage girl.Kasir Bashir, 48, of Oldham has been charged with six offences, including two rapes and four counts of gross indecency with an underage girl.Nisar Hussain, 39, of Rochdale, has been charged with three offences, including one count of making an indecent image of a child and two counts of trafficking persons for sexual exploitation.Naheem Akram, 46, of Rochdale, has been charged with 10 offences, including six rapes and four counts of sexual activity with an underage girl.",
        "Sucklene Shah, 44, of Crawford Street, Rochdale has been charged with two counts of sexually touching a girl aged 14 to 15.No pleas were entered and the men spoke only to confirm their name, address and date of birth.But lawyers for each of them indicated their intention was to plead not guilty to all of the charges.",
        "An eleventh man has also been charged but failed to appear at court.Tahir Rashid, 52, of Rochdale has been charged with 13 offences, including rape and penetrative sexual activity with an underage girl.The court heard that police intelligence indicated that he left the UK for the Republic of Ireland on Sunday and has yet to return.District judge Tom Mitchell issued a bench warrant for his arrest.The judge bailed the men to appear for a pre-trial hearing at Minshull Street Crown Court, in Manchester, on June 7.They were handed various bail conditions, which include surrendering their passports, residing at their home addresses and not travelling from the UK.Eight other men, mainly from Rochdale, are due to go on trial next week accused of various child sex offences."
    ]
}