{
    "articleURL": "/wires/reuters/article-12060631/Warren-Buffetts-rival-attention-Berkshire-weekend-Squishmallows.html",
    "content": [
        "By Jonathan Stempel",
        "May 8 (Reuters) - One of the biggest hits from the just-concluded annual love fest for Warren Buffett showed the enduring popularity of the investing legend: plush, squishy toys featuring the billionaire and his business partner Charlie Munger.On Friday, the start of Berkshire Hathaway Inc's three-day shareholder weekend, thousands thronged a convention hall in downtown Omaha, Nebraska, for five hours to buy discounted products from many Berkshire-owned brands.For many, the $9.99 Squishmallows featuring Buffett and Munger, made by Berkshire's recently acquired toy company Jazwares, were the must-have memento.Omaha police cut off a long line to buy them two hours early. \"No more sales,\" one officer said.Michelle Young, of Cottonwood, Arizona, who once ran a pottery studio, was able to snag a pair, saying she was \"fascinated by Warren and Charlie.\"About 10,000 Buffett and Munger Squishmallows were sold, and by Monday they were fetching as much as $255 at auction on eBay.Jazwares, whose former parent Alleghany Corp was acquired by Berkshire in October, declined to comment on secondary sales. EBay Inc did not immediately respond to a request for comment.Those who traveled to Omaha for the weekend included many first-timers as well as others who have gone for decades.Many said they were anxious to see Buffett and Munger - who are 92 and 99, respectively - while they still could. Some pledged to return even after they are no longer around or if the events are pared back.",
        "'ONE IN A TRILLION'On Saturday, Buffett and Munger appeared before a full house in the city's 18,300-seat downtown arena. Thousands of shareholders lined up hours before doors opened at 7 a.m. to see them.\"They're old, and I want to see them once in my life,\" said Ziyi Ruan from Shanghai, who works in marketing for an electric-vehicle company, and said he arrived at 2 a.m.Berkshire's weekend attracts tens of thousands of people, and among annual events in Omaha only the College World Series generates more business for the city.Cissy Zhang, a business consultant from Madison, Wisconsin, attending with her 5-year-old son and her parents, who both flew in from China, said she would attend \"at least one more time. To operate this whole thing is teamwork. It's not just one man.\"Richard Callahan, a local banker, expects attendance to drop without what he called the \"panache\" of Buffett and Munger, but said he will still go.But while shareholders expressed comfort in Berkshire's long-term planning, many were skeptical when asked if the weekend would remain a big draw without Buffett, Munger or both.\"No,\" said Bill Smead, who runs Smead Capital Management in Phoenix. \"These two guys were one in a trillion.\"Berkshire declined to comment on Monday.",
        "'CONTAGIOUS' ENTHUSIASMFor decades, Berkshire has been planning for the eventuality when Buffett, who has run the company since 1965 and Munger, a vice chairman since 1978, are no longer there.Greg Abel, who oversees non-insurance operations, is slated to become chief executive, while Todd Combs and Ted Weschler, who handle some investments, could take over all of them.Ajit Jain would keep oversight of insurance. And Buffett's eldest son, Howard, would become nonexecutive chairman.At Saturday's meeting, Buffett and Munger discussed among many topics how mismanagement and greed were causes of this year's banking-sector turmoil.They also agreed that artificial intelligence could disrupt many industries - though Munger said \"old-fashioned intelligence\" worked well too.\"You come to hear the same wonderful message and receive a refresher and right-set your mind,\" said Mark Blakley, a Tulsa, Oklahoma, corporate benefits supervisor at his 14th meeting.First-time attendee Jennifer Koon, a public relations executive from Roswell, Georgia, plans to return.\"The culture among short and long-term attendees was enviable and their enthusiasm contagious,\" she said in an email on Sunday. \"I'd challenge you to find that kind of loyalty among owners of other stocks.\"(Reporting by Jonathan Stempel in Omaha, Nebraska Editing by Megan Davies and Matthew Lewis)"
    ]
}