{
    "articleURL": "/wires/pa/article-12057483/Lionel-Richie-says-King-bring-new-flavour-role-monarch.html",
    "content": [
        "Lionel Richie has said he thinks the King will bring a “new flavour” and his “amazing sense of humour” to the role of monarch before taking to the stage at the Coronation Concert.",
        "The US singer, who was one of the celebrity guests at the coronation service on Saturday, performed his hit tracks Easy and All Night Long at the celebratory event held in the grounds of Windsor Castle on Sunday evening.His appearance prompted a royal singalong and huge applause from the King and Queen who joined around 20,000 members of the public at the event to continue the celebrations after their crowning at Westminster Abbey.",
        "Reflecting on Charles’ new role backstage ahead of his performance, Richie told the PA news agency: “I think he’s going to bring a new flavour.“I’m going say this to you honestly, a lot of people don’t know this about him, but he has an amazing sense of humour that we haven’t seen yet, so I think we may in the future see a little bit of a glimpse of that – and of course, inclusiveness.”Richie revealed that he immediately jumped at the chance to perform at the celebratory concert, saying: “The answer no matter what you had planned for that day, the answer is yes right away. And then the second thing that comes up is you start thinking: ‘Well, wait a minute, what am I going to wear?'”The singer admitted he did initially question if it was a joke but felt “honoured” when it was confirmed to be true.",
        "“It’s an honour because it’s every 80 years, except for the Queen who just took it all the way to the end. But I mean, this is amazing,” he said.",
        "Richie added that he had a chance to speak to Charles ahead of the event and revealed he was “so happy” and “really looking forward” to the concert.“He’s throwing a party, think about that. This is unusual. I understand this has not happened this often where you have this kind of thing after the big one. So I’m very happy about this. He’s very loose,” he added.As Richie took to the stage to perform a rendition of his track Easy, it prompted a singalong throughout the audience including including the King and Queen.Zara and Mike Tindall could be seen singing along to the song, with some swaying from the Duke of Edinburgh.The crowd amplified further when he struck up the chords to his classic song All Night Long, causing Prince George to dance and wave his flag alongside his sister Charlotte.The King himself also got to his feet to dance – as did the Duke and Duchess of Edinburgh."
    ]
}