{
    "articleURL": "/news/article-12044703/ATO-shares-bizarre-items-Aussies-claimed-tax-return-Botox-breast-implants-family-dog.html",
    "content": [
        "Aussies trying to claim tax on bizarre expensesBreast implants and botox are not deductibleHowever, clowns can claim tax on costumes Australians have been urged to play by the rules this tax season as some of the strangest items people have claimed as deductions are revealed. ",
        "A $145,000 luxury car, a trip to Italy, botox, teeth whitening and breast implants are just some of the weird items Aussies have tried to claim as work-related expenses. Tim Loh, the assistant commissioner at the Australian Tax Office, said items that can be claimed as work-related expenses were different for every occupation. He revealed an accountant starting a new career as an opera singer had tried to claim $20,000 for the cost of several expensive Opera gowns and a trip to Italy.",
        "In another bizarre instance, an administrative worker tried to claim tax on six different vehicles, despite only owning one car, the Daily Telegraph reports. Adrian Raftery, the founder of Mr Taxman, said people listed beauty services like teeth whitening and botox as work-related expenses. One Aussie lodged a dubious deduction for a breast augmentation, which can cost anywhere between $5,000 and $20,000. One of the more bizarre deductions was a Cavoodle, which was listed by its owner as the guard dog of a home business, Mr Raferty revealed. Some of the weirder claims Aussies have tried to get money back from the ATO in the past include dog food, dental work, gambling losses, toilet paper, cigarettes, vapes and holidays that were not only unrelated to work, they were entirely faked.",
        "The ATO clearly states that a deduction has to be related to earning an income. Work-related expenses can only be claimed if a person spent the money, were not reimbursed and have a receipt to prove the transaction. Sex workers can claim deductible items like costumes, toys and handcuffs while circus performers can claim tax back on their costumes and 'tools of the trade'. Ahead of the 2022 tax season, Mr Loh urged Aussies to be vigilant when checking their deductions and avoid 'copying and pasting' from the previous year. In 2020 a bank executive from NSW was fined $1,500 and given a criminal conviction for falsely claiming a fake holiday.He claimed more than $15,000 in travel expenses for 'overseas conferences' even though he hadn't left the country that financial year, the ATO revealed. ",
        "It's a common misconception that personal self improvement is tax deductible because it often seems to help with employment.That means a gym membership, yoga class and meditation app are not deductible.One type of deduction often overlooked that is often legitimate is education.New data has revealed at least 30 per cent of Australians are spending up to $1,936 on employment-related learning every year, a cost that is tax deductible.Accounting for the other 70 per cent of Aussies who don't spend any of their money on personal education, the average spent each year is about $587.",
        "The average return for Australians is $2,600 according to blog taxback.com. ",
        "There are three golden rules set from the Australian Taxation Office (ATO) to determine legitimate deductions as work-related expenses:The expense must directly relate to earning your income. You must have already incurred the expenseYou must have the records to prove itSource: ITP Accounting ProfessionalsItems that Aussies have tried (and failed) to claim include: Alcohol Chocolate biscuits Cigarettes and vapesCoffee Dental work Dog foodGambling losses Gym memberships HolidaysMeditation and yoga apps and sessions Self-improvement programs and appsStreaming services ie. Netflix, Disney and Stan SunscreenTeaToilet paper Tooth whitenerBotox Breast implants "
    ]
}