{
    "articleURL": "/wires/reuters/article-12049303/Gold-flat-set-weekly-jump-hopes-Fed-pause-banking-woes.html",
    "content": [
        "Dollar heads for weekly fall",
        "Gold up over 2% for the weekU.S. non-farm payrolls due at 1230 GMT(Adds graphics, analyst comments and updates prices)By Ashitha ShivaprasadMay 5 (Reuters) - Gold eased on Friday from near record highs as traders waited for more economic cues, but was still bound for its best week in nearly two months as hopes of a U.S. rate hike pause and banking woes fired up safe-haven demand.Spot gold was down 0.5% to $2,040.10 per ounce at 0801 GMT, but was up over 2% for the week. U.S. gold futures were down 0.3% to $2,048.60.On Thursday, prices jumped to $2,072.19, just shy of a record high of $2,072.49.Investors now await more economic data, including U.S. non-farm payrolls figures at 1230 GMT, that could build the case for a rate cut, after Fed Chair Jerome Powell pushed back on such expectations.If prices remain above $2,030, gold could climb to previous records if U.S. data allows, said Matt Simpson, senior market analyst at City Index.Economic uncertainty and lower rates boost demand for zero-yielding gold.\"But if we see further panic around the (U.S.) debt ceiling or U.S. banks, hold onto your hats as I fear price action could get nasty around these highs and punish bulls and bears,\" Simpson said, warning that in \"times of severe stress all markets including gold can fall.\"",
        "PacWest Bancorp's move to explore strategic options deepened fears about the health of U.S. lenders and hit shares of regional banks and major financial players on Thursday.Also burnishing bullion's appeal, the dollar headed for a weekly drop.\"With investors more concerned about protecting capital rather than seeking high yield, gold is fitting the bill as the asset of choice,\" said KCM Trade's chief market analyst Tim Waterer.On the physical side, however, elevated prices played spoil-sport, especially in India and China.Silver fell 0.6% to $25.91 per ounce.Platinum lost 0.1% to $1,038.52 while palladium rose 0.2% to $1,450.59.(Reporting by Ashitha Shivaprasad in Bengaluru; Editing by Sonia Cheema and Mark Potter)"
    ]
}