{
    "articleURL": "/wires/reuters/article-12058993/Joint-Philippines-U-S-patrols-South-China-Sea-begin-quarter--envoy.html",
    "content": [
        "MANILA, May 8 (Reuters) - Joint patrols between the Philippines and the United States in the South China Sea may begin later this year, a top diplomat said on Monday, just days after Washington clarified its commitment to defend Manila from an attack at sea.",
        "Discussions were continuing on the joint maritime patrols, which were announced in February, said Philippine ambassador to the United States, Jose Manuel Romualdez.\"An estimate would be no later than the third quarter of this year. We should have that in place,\" he told CNN Philippines.U.S. Defense Secretary Lloyd Austin announced in February he and his Philippine counterpart, Carlito Galvez, have agreed to restart joint maritime patrols in the South China Sea, which former President Rodrigo Duterte, who sought warmer ties with China, had suspended after he took office in 2016.But Philippine Defense Secretary Galvez told reporters on Monday there were no formal discussions on the joint patrols with the United States and Australia.Ties between the Philippines and the United States are seeing a reinvigoration under Duterte's successor, Ferdinand Marcos Jr, who last week met President Joe Biden on a four-day visit to Washington.During the visit, the Pentagon issued guidelines that laid out in clear terms the extent of U.S. defence treaty commitments to the Philippines that refer specifically to attacks in the South China Sea, including on its coast guard.When asked about the timing of the joint patrols, a spokesperson at U.S. Embassy in Manila, Kanishka Gangopadhyay, said on Monday: \"Our conversations on combined maritime activities with the Philippines are continuing, and our military planners are working hard on specific issues like logistics\".",
        "Australia may also participate in the combined maritime activities, Romualdez said.China claims most of the South China Sea, through which more than $3 trillion of world trade is shipped every year. Vietnam, Malaysia, Brunei, the Philippines and Taiwan have rival claims. (Reporting by Karen Lema; Additional reporting by Enrico dela Cruz and Neil Jerome Morales; Editing by Kanupriya Kapoor)"
    ]
}