{
    "articleURL": "/wires/aap/article-12061471/New-Zealand-finances-worsen-budget-deficit-looms.html",
    "content": [
        "As Australia banks its first surplus in 15 years, New Zealand's pathway back to black appears to have been washed away by storms.",
        "Treasury posted updated financial statements on Tuesday that show a worsening fiscal outlook in Wellington.In the nine months to March, Treasury has recorded a deficit of $NZ3.4 billion ($A3.2 billion), almost $NZ2.5 billion ($A2.3 billion) worse than predicted in December.Revenue has fallen away, with a $NZ2.3 billion ($A2.2 billion) shortfall in GST revenue and business and income tax.The government must also grapple with repairs following two huge weather events over summer: flooding in Auckland and Cyclone Gabrielle, which come with a multi-billion dollar price tag.At the last budgetary update in December, NZ was in touching distance of a surplus, with a projected deficit of just $NZ461 million ($A435 million) in 2024.That could be as close as it comes to a surplus, which would have boosted the government in an election year.Finance Minister Grant Robertson wouldn't be drawn on the budget's bottom line so close its delivery on May 18.\"Clearly, economic activity based on the Treasury statements is slowing. We can see that,\" he said from parliament.\"We've been forecasting and predicting that for some time. On top of that, we have to deal with the North Island weather events with the cyclone and the and the flooding.\"All of those will be impacting on the government's books, but I'll have more to say about that soon.\"",
        "Opposition leader Chris Luxon called the crown accounts \"alarming\", drawing a contrast with the expected $A4 billion surplus to be booked by Treasurer Jim Chalmers on Tuesday night.\"Seeing a softening of the New Zealand economy at a time when we actually see some strength building in Australia with their budget day,\" he said.Mr Robertson, usually fond of healthy trans-Tasman fiscal rivalry, said \"not going to turn (the budget) into that kind of competition\".\"Both New Zealand and Australia have done well over recent years and getting through COVID and being able to continue with a resilient economy and resilient government set of books,\" he said.\"It's inevitable that the government's books will be affected as the economy cools. We are doing our bit to restrain spending and responsibly manage our finances.\"The upcoming budget has required tough choices as we respond to the deteriorating economic conditions.\"In brighter news, NZ's net debt has fallen to $NZ72.8 billion ($A68.1 billion), or 19.1 per cent of GDP.The shrinking debt has been attributed to \"favourable movements in the fair value of financial assets and liabilities\", including the NZ Super Fund."
    ]
}