{
    "articleURL": "/tvshowbiz/article-12055387/Bachelorette-alum-Becca-Kufrin-smoldering-fianc-Thomas-Jacobs-REVEAL-sex-baby.html",
    "content": [
        "The Bachelorette alum Becca Kufrin and her sizzling fiancé Thomas Jacobs have announced the sex of their baby.",
        "Becca, 38, proposed to Thomas a year ago, and last month they joyfully told the public they are expecting their firstborn child.In a heartwarming video posted this Friday, Becca and Thomas put an athletic spin on the traditional sex reveal party trick.The idea was for Becca to throw a ball to Thomas, who would then hit it with a baseball bat, causing colored dust to billow out and break the news.Although it took a couple of hits for the ball to actually burst, it eventually released a massive blue cloud declaring the baby to be a boy.",
        "Becca then rushed across the backyard to her husband-to-be, who gathered her up in his arms as their loved ones cheered. 'It's a...,' Becca began her caption, skipping a few lines before she crowed: 'LITTLE TOMMY' with a smiling face and cold sweat emoji and a string of blue hearts.Becca shot to reality TV stardom on The Bachelor in 2018 as one of the women competing for the hand of race car driver and realtor Arie Luyendyk Jr.Arie initially picked Becca as his winner at the end of the season, only to do dramatic U-turn and throw her over in favor of the runner-up Lauren Burnham.To add insult to injury, Becca earlier in the season had rejected a proposal from her old flame Ross Jirgi, who traced her to Peru during filming to pop the question.",
        "Lauren and Arie got married the following year and have since welcomed three children together - Alessi, three, and twins Lux and Senna, one.Meanwhile Becca, riding a wave of support from Bachelor Nation fans, became The Bachelorette and picked firefighter Garrett Yrigoyen as her winner.However, although they attempted to make their relationship work for over a year, their engagement fell apart in 2020 amid the coronavirus pandemic.",
        "Thomas meanwhile first joined the ABC franchise with the 2021 season of The Bachelorette, but was eliminated in the third week. Later that year, Becca and Thomas finally met on Bachelor In Paradise, and although their fling on the show fizzled, they wound up reuniting afterwards off-air.Becca popped the question to Thomas last May - and a few months later Thomas, not to be outdone, gave Becca a romantic proposal on the beach in San Diego.They ecstatically announced the pregnancy on Instagram last month, posting a slideshow of them cuddling up to one another while holding the sonogram pictures.'Party of 5 coming September 2023,' wrote the couple in the caption of their joint social media post. 'Little Bebe, we can’t wait to meet you, hold you, and watch you grow. We already love you to the moon and back - mom &amp; dad'"
    ]
}