{
    "articleURL": "/news/article-12058893/Jayne-Hrdlicka-Virgin-Australia-bosss-husband-dies-bravely-battling-severe-health-condition.html",
    "content": [
        "Jayne Hrdlicka's husband Jason Gaudin died after cancer battleShe said it was 'rare, aggressive, and ultimately incurable'Virgin Australia CEO Jayne Hrdlicka's husband Jason Gaudin has died after a long battle with cancer. ",
        "Although Mr Gaudin had a far more low-key public profile than his wife, he also enjoyed a very successful high-powered corporate career and worked with Wells Fargo Bank as the head of corporate and investment banking for Australia and New Zealand. 'As many of you know, my husband Jason was diagnosed with a rare, aggressive, and ultimately incurable cancer in November of 2019,' Ms Hrdlicka in a statement on Monday night.'It is with a very heavy heart that I say, after a long, difficult, and brave battle he has now passed on.'As well as the American-born Ms Hrdlicka, Mr Gaudin is survived by the couple's two sons, Alec, who was born in 2004, and Josh, born in 2007.",
        "'For his sake, I am grateful that the suffering is behind him. For our sake, it is a devastating loss,' she said. 'He was such a kind, loving, fun and adventurous person with a sharp and quick wit. Jason will be sorely missed as a father, husband, son, brother and friend to many.'The family has lived in Brisbane, where Virgin Australia is headquartered, since she replaced Paul Scurrah as its chief executive in November 2020.Their previous home, the historic Hawthorn mansion Crossakiel in Melbourne, was listed for sale in 2022 with a guide of $18million to $19million. ",
        "They had bought the five-bedroom Victorian-era home for $13.3million in 2016.Ms Hrdlicka had previously been the CEO of the A2 dairy company, but stood down from that role in December 2019 after just two years in the top job.Though she was initially vague about the departure, she later said there had been 'unforeseen changes' in her personal life that she had to deal with.But in March 2021, she said her husband's cancer diagnosis was why she had left A2. 'That was kind of it. Game over. Life's short,' she said at the time.",
        "Ms Hrdlicka said that 'For the next few weeks, I will be taking leave to spend time with family. 'I deeply appreciate the heartfelt support and compassion from so many over the last couple of years as Jason and I worked our way through his various treatment phases and challenges.'She added that her husband's 'strength, incredibly positive attitude and passion for his boys enabled him to live years beyond the expectations of his doctors. 'For that we are blessed and grateful.'Mr Gaudin had worked for American multinational Wells Fargo Bank as the head of corporate and investment banking Australia and New Zealand from January 2013 to August 2018.",
        "Before that, he was the managing director of Balmoral Debt Advisory for 10 years up to January 2013.",
        "He studied at the University of Queensland from 1987 to 1990, graduating with a Bachelor of Economics degree. In 2014, Mr Gaudin and Ms Hrdlicka were among those thanked by Melbourne's prestigious Scotch College for making a substantial donation to its fundraising campaign, and were honoured on the school's donors board. In the high school's annual report for 2018, the couple were listed as Associate Fellows. Virgin Australia posted a message on Ms Hrdlicka's LinkedIn page, saying 'On behalf of everyone at Virgin Australia, we send our deepest condolences to you and your family. We are all thinking of you during this difficult time.'Another poster wrote that 'no words can ever replace your loss as a woman and your children's loss of their Father... Rest peacefully Jason and I pray you and your children spend quiet times remembering him with love.' A third wrote that 'This is a time to celebrate all that your husband stood for and no doubt a life well lived. 'Thoughts and prayers with you and your family during this time of bereavement.'Many people who work in the aviation industry also posted condolences to the family.  "
    ]
}