{
    "articleURL": "/sciencetech/article-12041163/Britons-biggest-phone-pas-revealed-fallen-victim-them.html",
    "content": [
        "HMD Global asked 2,000 Britons about the phone habits that make them cringeDropping your phone and smashing the screen was the biggest 'phone pas' We've all been there - you fire off a quick email to your boss, only to discover a second too late that you've accidentally added a cheeky 'x' at the end of your message.",
        "This cringeworthy 'phone pas' has been revealed as one of Britons' most embarrassing mobile mishaps, according to a new survey.For the survey, HMD Global asked 2,000 Britons about the phone habits that make them cringe the most.Dropping your phone and smashing the screen was revealed as the biggest 'phone pas', with 55 per cent of respondents saying this left them with a pounding heart and sweaty palms.This was followed by clicking a video on full volume in a crowded space (31 per cent) and starting a long journey with three per cent battery (27 per cent).",
        "Dropping your phone and smashing the screen Clicking a video on full volume in a crowded space Starting a long journey with three percent battery Forgetting to put your phone on silent at the cinema Clicking on a spam link Dropping your phone down the loo Waking your partner by looking at your phone in the nightSending an email to the wrong person Putting a kiss at the end of a text to your bossLiking an ex's Instagram's postPutting a kiss on an email to a clientAccidently dialling 999 when trying to get into your phoneUploading a pic to social media you didn't want anyone to seePutting your phone in the washing machineDriving off with your mobile on top of the car",
        "According to HMD Global's survey, which was commissioned to celebrate the launch of the new Nokia XR21 phone, the average Briton suffers as many as 36 'phone pas' ever year.Forgetting to put your phone on silent at the cinema was revealed as the fourth most embarrassing mobile mishap, followed by clicking on a spam link and dropping your phone down the loo.Meanwhile, accidentally putting a kiss on a text to your boss (14 per cent), liking an ex's Instagram post (12 per cent), adding a kiss on a work email (12 per cent), matching with a colleague on a dating site (11 per cent) and dialling 999 by mistake (11 per cent) also get our hearts racing, according to the survey.",
        "However, the pain of a smashed phone screen was found to be the most infuriating, with more than half of respondents admitting to smashing their device within just 2.5 months of buying it.'It is clear that our mobile phones go through a lot in their lifetimes,' said Adam Ferguson, Head of Product Marketing at HMD Global.'With people changing their phones an average of every four years, our devices need to survive as many as 144 drops, scrapes and slips.'Thankfully, the days of having to dodge shards of glass while you text on a phone with a smashed screen could soon be a thing of the past, according to a recent study. A material that is as light as plastic yet stronger than steel and 4–6 times harder to damage than bulletproof glass could soon be used to protect smartphone screens.The substance was created by experts from Massachussets Institute of Technology and achieves something long thought impossible — polymerisation in two dimensions.",
        "Polymerisation is a process by which small atoms called monomers are joined together, usually to form long, spaghetti-like chains called polymers.These can then be shaped into three-dimensional objects such as water bottles, by means of injection moulding.The researchers, however, have succeeded in creating a material that self-assembles instead into two-dimensional sheets that are more like lasagne than spaghetti.",
        "These sheets, dubbed polyaramides, stack on top of each and are held together by robust hydrogen bonds, making the overall material extremely sturdy.Alongside enhancing phone casings, the polymer could also be used as a protective coating on car parts, or as a large-scale construction material."
    ]
}