{
    "articleURL": "/tvshowbiz/article-12039953/Amazon-Prime-hikes-membership-fees-40-Australia.html",
    "content": [
        "Popular streaming service Amazon Prime has announced it will increase its monthly and annual membership fees.",
        "Users on a monthly plan will see their subscription increase from $6.99 to $9.99, while the annual membership will go up from $59 to $79.These price hikes are the first time Amazon Prime has raised its fees since launching in Australia in 2018.The new prices will come into effect from May 24 for new members, while existing customers will feel the pinch from June 28.Despite the price increase, Amazon Prime is still cheaper than Netflix's basic plan ($16.99 a month), Binge ($16 a month) and Disney+ ($13.99 a month).",
        "Amazon Prime members also get the benefit of free delivery for items bought on Amazon, and access to Amazon Prime deals on the Prime Day sales.The new fees come after the streaming platform recently released its new spy thriller series Citadel, starring Priyanka Chopra Jonas and Richard Madden.Citadel is the second most-expensive TV series ever made, with the six-episode first season costing a total of $300million, or $50million per episode.The big-budget show is said to be a passion project for Jennifer Salke, the Head of Amazon Studios.Part of the reason for the inflated cost is the fact Citadel was renewed for a second season before the first season even dropped.Amazon Prime Video is looking to expand Citadel into a franchise with spin-offs.",
        "Other factors also drove the cost up, including the break in production caused by Covid-19 and the high cost of pandemic protocols, which were not factored into the budget when the series was greenlit.Priyanka also fought for equal pay with her male co-star Madden.'If your contribution, time and what you bring to the table is the same as your male counterpart, there is a very serious conversation to be had about compensation,' she said.'It was not a conversation I was encouraged to have for a very long time because it was just a given when I started out in movies that your male counterpart would have a substantially larger pay check.''I think my generation of female actors really stood up for themselves,' she added.The Indian actress, who is married to Nick Jonas, plays the character of Nadia Sinh."
    ]
}