{
    "articleURL": "/sciencetech/article-12046591/Is-Twitter-Thousands-users-worldwide-reporting-issues.html",
    "content": [
        "Thousands of users worldwide reported a Twitter outage Thursday While not everyone is having problems, some cannot log into their accounts Thousands of reports about Twitter experiencing an outage surfaced Thursday.",
        "While many users appeared to have service, others claimed the app and website were hit with an outage for more than one-hour. Issues appeared around 8am ET, with tens of thousands of reports flooding into DownDetector, a site that monitors online services for issues.Twitter's API Status page showed all systems were operational, but users claimed that was not the case.",
        "DownDetector's live US outage map showed issues in the New York region, Boston and southern California.Countries like China, Finland, Greece and Switzerland were also experiencing problems with Twitter.Twitter was also hit with issues around 2am ET, but only a few hundred reports were submitted.Nearly every social media platform is hit by an outage here and there, with Twitter's last on March 6, which lasted for one hour.Twitter's API Status Page also showed 'All Systems Operational,' which is far from what users were experiencing in March.Elon Musk tweeted shortly after the platform was back online, calling it 'so brittle.'Twitter co-founder Jack Dorsey said this month that Musk is not the right person to run the company and that it 'all went south' for the billionaire after he bought the social media giant.Once a supporter of Musk's $44 billion takeover, Dorsey gave a frank assessment when asked if the company's new owner and CEO had proven himself the right man for the job.",
        "'No. Nor do I think he acted right after realizing his timing was bad. Nor do I think the board should have forced the sale. It all went south,' Dorsey wrote on Bluesky, an invite-only Twitter alternative he is backing, Bloomberg reported.Dorsey had been on good terms with the Tesla CEO before his takeover and called Musk's acquisition of Twitter last year 'the singular solution I trust.' ",
        "Elon Musk created quite the storm when he purchased Twitter in October 2022 and has rarely been out of the spotlight.",
        "Musk has since implemented widespread changes to boost revenue at Twitter after the social media platform saw advertising income drop last year in the run up to his takeover.The company has rolled out its Twitter-verified blue tick as a paid service, a move Dorsey also slammed on Bluesky.'Payment as proof of human is a trap and I'm not aligned with that at all,' he wrote.'The payment systems being used for that proof exclude millions if not billions of people.'Musk has since returned blue ticks to accounts with more than one million followers - confusing celebrities worldwide.The entrepreneur has also shrunk the employee base by about 80 percent since his acquisition.Musk said the social media firm was now 'roughly breaking even' in a recent Twitter Spaces interview.",
        "But after Twitter had made 3,700 of the company's approximated 7,500 employees redundant in November, Dorsey apologized to current and ex-staff.In his first tweet addressing the takeover, Dorsey said he was sorry for growing the company 'too quickly' and declared that Twitter employees 'always find a way no matter how difficult the moment'.The co-founder rolled over his 18 million shares into the Elon Musk era of the company rather than taking a payout. His shares equal approximately a 2.4 percent stake in the company.This means he will be one of Twitter's biggest company investors, contributing roughly $1 billion to Musk's $ 44 billion purchase."
    ]
}