{
    "articleURL": "/wires/reuters/article-12045605/IMF-discuss-Pakistans-budget-plans-funding-lifeline-nears.html",
    "content": [
        "By Ariba Shahid",
        "KARACHI, May 4 (Reuters) - The International Monetary Fund (IMF) is preparing to discuss Pakistan's budget plans for the coming financial year as part of a process to unlock a crucial financing injection for the cash-strapped nation, the IMF's country mission chief said.An IMF review of the budget presents a fresh hurdle before the lender approves the release of pending bailout funds, which are crucial for Pakistan to resolve an acute balance of payments crisis. A staff-level agreement to release $1.1 billion has been delayed since November.The finance ministry did not immediately respond to Reuters' request for a comment.\"In all IMF programs, the authorities issue a letter of intent associated with the last review outlining their policy intentions for the period after the program,\" Nathan Porter, IMF mission chief to Pakistan, told Reuters on Thursday.Pakistan has struggled to strike a deal with the IMF to release funds critical to stabilise the struggling economy.Economist Sakib Sherani of Macroeconomic Insights said the IMF wants to ensure that the government remains committed to the agreed path of fiscal consolidation as the country prepares for elections later this year.\"Historically, the biggest fiscal slippages in Pakistan occur in an election year,\" Sherani said.It was not immediately clear if the review of the budget would affect the pending ninth review, or would be part of the two reviews that remain after this.",
        "On Thursday, Finance Minister Mohammad Ishaq Dar reiterated that Pakistan has already taken all the agreed steps to unlock the funding.Prior to that, the government said that external financing was the last hurdle for the deal. Pakistan is required to give an assurance that its balance of payments deficit is fully financed for the fiscal year ending in June to unlock the next tranche of IMF funding.The United Arab Emirates, Saudi Arabia, and China came to Pakistan's assistance in March and April with pledges that would cover some of the funding deficit.The $1.1 billion tranche is a part of a $6.5 billion bailout package the IMF approved in 2019, which is due to end in June, prior to the budget. So far, Pakistan has received $3.9 billion.In response to a question about the possibility of combining the 9th and 10th reviews in light of the imminent end of the latest programme, the IMF's Porter said that the current baseline is to proceed sequentially with reviews.The country is reeling from an economic crisis with inflation surging to 36.4%, the highest in its history and the highest in South Asia.The government has removed caps on the exchange rate, imposed taxes, raised energy tariffs, and scaled back subsidies in an attempt to unlock the IMF funding. It has also raised key interest rates to a record 21%. (Reporting by Ariba Shahid; Writing by Shivam Patel; Editing by Jacqueline Wong, Kim Coghill and Sharon Singleton)"
    ]
}