{
    "articleURL": "/news/article-12045137/Son-NSW-sports-minister-Steve-Kamper-faces-court-riding-unlicensed-Vespa.html",
    "content": [
        "Christopher Kamper convicted of drink drivingHe is the son of the new NSW sports minister The son of the NSW Sports Minister appeared in court on Wednesday after having a 'couple of drinks' and riding unlicensed on a Vespa. ",
        "Christopher Kamper, 28, was stopped by police after riding a red Vespa along a footpath in Bondi, Sydney. Kamper, who had a woman on the back, told cops he had 'a couple of drinks' and admitted he did not have a current driver's licence. Appearing at Waverley Local Court on Wednesday, he was convicted of driving without a licence and drink driving.His conviction comes around a month after his father, Rockdale MP Steve Kamper, was sworn in as part of Chris Minns' new NSW ministry. ",
        "The elder Mr Kamper is the new Minister for Sport, Small Business and Multiculturalism.Christopher is one of five children he shares with wife Magda. After Kamper was stopped by police, he returned a positive reading on a breathalyser and was arrested. At Waverley police station, he recorded a blood alcohol reading of 0.111. Cops also said that both Kamper and the woman were not wearing helmets.Kamper's lawyer Warwick Korn asked the court to consider Christopher's education and career, including postgraduate studies at the London School of Economics.The lawyer added that Kamper works as a manager at his company, which works closely with disability organisations. Travelling regionally was a key part of his client's role, he added, before explaining how Kamper had completed the smart recovery program and traffic offenders' program.",
        "In a letter of apology, Kamper also told the court how he was aware he could have easily become 'a statistic' thanks to his behaviour.",
        "Magistrate Jacqueline Milledge criticised Kamper but said his work to rehabilitate himself was a strong indication 'you are very sorry'.'You've handed this very well indeed,' she said.Magistrate Milledge convicted Christopher for mid-range drink driving and fined him $1,000.He was also handed a three-month driver's licence disqualification. Kamper also had a 12-month interlock placed on his motorbike and was convicted of driving a vehicle he was not licensed to."
    ]
}