{
    "articleURL": "/femail/article-12047669/Inside-crazy-world-real-life-Gossip-Girls.html",
    "content": [
        "Mortimer, 47, is featured in Queenmaker: The Making of an It GirlThe documentary explores how socialites became famous in the early 2000s Mortimer hints at her rise and fall in the new Queenmaker trailer  Tinsley Mortimer breaks down in tears as she recalls the dark side of early 2000s socialite culture in the new trailer for Hulu's documentary Queenmaker: The Making of an It Girl. ",
        "The former Real Housewives of New York City star, 47, opens up about her rise and fall in the documentary, which explores how socialites were launched to stardom and then torn apart by the public. 'At the time, New York felt very thriving, and it was just this crazy, over-the-top world,' she recalls. 'All of these photographers, I just remember thinking, \"I want to be part of this. This looks cool.\"'Mortimer followed in the footsteps of heiresses Paris and Nicky Hilton, who were just teenagers when they were dubbed the 'littlest socialites in town' in a profile published by The New Yorker in 1999. ",
        "In the trailer, famed photographer Patrick McMullen takes partial credit for turning the socialite sisters into celebrities. 'I kind of invented the Hilton sisters,' he says, clarifying. 'Well, I taught them how to pose. People realize the power of image.'A number of socialites, photographers, gossip bloggers, and publicists were interviewed for the documentary, including celebrity publicist R. Couri Hay.'When I met Tinsley Mortimer, we were at a party,' Hay recalls. 'I said, \"It's all about being in the right dress at the right time.\"'In a 2017 Town &amp; Country profile, the publicist details how helped her become an 'It' girl by having her quit her job as an event planner and join committees at the American Museum of Natural History and the Central Park Zoo.",
        "Mortimer, who was married to oil heir Topper Mortimer at the time, is described as '[dropping] on the scene like a bombshell' by one interviewee in the documentary.'It was fun until it just became not fun,' she says of her socialite status. By 2007, Mortimer was being photographed in New York City constantly. She had designed a handbag line for Samantha Thavasa and had her own lip gloss shade for Dior — 'Tinsley Pink.' ",
        "'It was a new time. It was kind of a free-for-all,' fellow socialite Olivia Palermo explains in the documentary.  'People were doing blow, and they were hanging out, and they were making the world go around,' publicist Kelly Cutrone recalls. Socialites turning into celebrities coincided with the rise of blogs such as Gawker and Perez Hilton, as well as the anonymous sites Socialite Rank and Park Avenue Peerage. Blog culture was ruthless at the time, and stars who were built up were just as quickly torn down. 'We created storylines of who the villains were,' explains Valentine Uhovski, who co-founded Socialite Rank with his stepsister Olga Rei in 2006. Much like in the Gossip Girl books that were written by Cecily von Ziegesar and later turned into a CW series, the Russian-born bloggers targeted the Upper East Side elite in their posts. ",
        "Uhovski and Rei kept their identities secret as they pitted the women against each other with their 'Social Elite Power Ranking,' which Mortimer always topped. Palermo, who was a 20-year-old student at the New School at the time, became the site's prime target when she started making a name for herself in the New York social scene. ",
        "She was branded a social climber and wannabe who wanted to steal Mortimer's crown, sparking an alleged feud between them. 'That's America for you,' Palemero says in the documentary. 'They are gonna bring them up and then they bring them down.'Within a year of its launch, Socialite Rank met its demise when it published an apology letter purporting to be from Palermo. The socialite sued, and a judge ruled the letter was fake, New York Magazine reported. Mortimer went on to divorce her husband and appear in the short-lived CW reality series High Society, which was critically panned and credited with causing her downfall. Socialites told the New York Post in 2010 that the show 'had caused her to lose her elusive socialite status.' Mortimer started spending more and more time in Palm Beach, Florida, where she was arrested for trespassing outside Alexander 'Nico' Fanju's home in 2016, her mugshot becoming tabloid fodder. 'It ended up putting me in a place that I was so low,' she says in the documentary. ",
        "Mortimer apologizes as she starts to cry, turning her head away from the camera to wipe her tears. ",
        "Emily Gould, a former editor at Gawker, explains that she felt far removed from the socialites she was writing about in the early aughts.  'There was no sense I was writing something that would affect someone's actual life,' she says in the trailer. 'These were real people and not like characters in a book,' she adds. 'We made them into characters.'In 2007, Gould became a target of public scrutiny herself after appearing on an episode of Larry King Live hosted by Jimmy Kimmel. She wasn't prepared when Kimmel confronted her over Gawker's 'stalker map,' which published anonymous tips of celebrity sightings that weren't fact-checked.In an essay for The New York Times, she admits that she came off as 'dismissive and flip' during the segment. The barrage of angry emails and comments she received triggered panic attacks, and she would only leave her house if she had to. Gould quit Gawker just months after her appearance on Larry King Live. ",
        "Queenmaker director Zackary Drucker tells people that the documentary offers a 'candid insider perspective on the toll this seemingly glittering lifestyle took on the women who lived it.' It also promises to reveal the truth behind Park Avenue Peerage, which was started by James Kurisunkal when he was a student at the University of Illinois at Urbana-Champaign in 2007. ",
        "'Through a prism of firsthand stories from women like Tinsley Mortimer and Olivia Palermo, told with some time and distance, the era's ruthlessness comes fully into view,' Drucker says. 'Ultimately, I wanted to celebrate the women of Queenmaker — and all women — taking back their own stories, with their own voices, loudly, clearly, and without fear,' she adds. Queenmaker: The Making of an It Girl premieres on Hulu on May 17. "
    ]
}