{
    "articleURL": "/wires/aap/article-12053289/Reynolds-Broncos-best-player-Walsh-ready-Origin.html",
    "content": [
        "Brisbane skipper Adam Reynolds says fullback Reece Walsh has been the side's best player this year and is ready for the State of Origin stage.",
        "Reynolds, a former NSW Origin representative, has played a role in the 20-year-old finding the right balance in games, putting him in the selection frame for a Maroons debut.\"Walshy is a hungry kid with a load of knowledge but he always wants to be doing everything,\" Reynolds said after the Broncos' 32-6 win over Manly on Friday night.\"He is always trying to perfect his craft and be involved in the game and that's where I ... am trying to rein him back a little bit because at times he is trying to be too involved.\"It is a good sign but at times we want him to pick his moments and not be one hundred per cent (all the time). I think that is when errors creep into his game.\"When we can limit his opportunities he ices it on the back of that, because he is fresh and thinking clear.\"Walsh had two try assists against Manly to take his season tally to 11 and played tough in defence. Reynolds said he was the best player on the field for the Broncos.The irony is that Walsh was quiet in the previous week's loss to South Sydney and coach Kevin Walters had a chat to him.\"Kev challenged him a little bit during the week about being more involved, and out the back of shape I thought he was fantastic,\" Reynolds said",
        "\"He was involved in most of the good stuff that came off.\"Finding the balance between wanting to do everything and chiming in at the right time is a challenge Walsh is rising to.Reynolds said the Origin cauldron would not daunt Walsh\" He is a competitor and a winner. It doesn't matter what stage he is on,\" Reynolds said.\"Definitely he wouldn't look out of place (in Origin). I am hoping I have got him in the Broncos jersey but that is just me being selfish. He definitely deserves (Origin selection) and has been our best player this year.Maroons captain Daly Cherry-Evans got a close up look at Walsh on Friday night and said he was \"in great form\" ahead of the Origin series opener in Adelaide on May 31.\"Watching him out there first-hand he was fantastic.\" Cherry-Evans said.\"I said to him after the game, 'Keep playing good footy and you never know what can happen'. He was smiling and that's all you can ask. When people are happy and smiling it is good to see in rugby league.\""
    ]
}