{
    "articleURL": "/sport/football/article-12054959/Frank-Lampard-encourages-Chelsea-players-beer-glass-wine-Bournemouth-win.html",
    "content": [
        "REPORT: Frank Lampard FINALLY gets his first win as Chelsea's interim boss The Blues' boss says they have taken 'small step forward' with win over CherriesBournemouth boss Gary O'Neil rued his side's missed opportunities on SaturdayFrank Lampard encouraged his players to celebrate with a beer or glass of wine after Chelsea took a 'small step forward' by halting their six-match losing streak with a 3-1 win at Bournemouth.",
        "Late goals from Benoit Badiashile and Joao Felix earned the Blues an overdue victory after Cherries defender Matias Vina cancelled out Conor Gallagher's early header at Vitality Stadium.Success on the south coast was Lampard's first since returning to Stamford Bridge on an interim basis a month ago and a fitting way to cap his 100th game in Premier League management.The former England and Blues midfielder urged his team to embrace the club's first triumph in almost two months but warned they cannot ease off going into their final four fixtures of a dismal campaign.'They should enjoy it and we're happy because when you don't have that feeling for a while, it gradually knocks you down,' said Lampard.",
        "'It was very evident in the dressing room from coming in that there was a lot of picking up that needed to be done and unfortunately you need results to come in line with that to keep you stepping forward, so that's been tough.'Today was a nice small step forward.'The lads are all human, we're all affected in similar ways when you're not winning games or you don't feel like you're at your best and the only way to get through that is to fight and to work through it.",
        "'I've been in relative periods where they're tough, so absolutely they should enjoy tonight and have a beer or have a glass of wine or do whatever they do.'But we cannot take our foot of the pedal in terms of trying to take steps forward until the end of this season because it's important.'Victory in Dorset moved the two-time European champions on to 42 points, three ahead of their hosts, albeit they remain in the bottom half of the table.Bournemouth had the better of the chances before the late drama, with Dango Ouattara squandering a golden opening by heading over from inside the six-yard box.Badiashile and Felix punished that profligacy in the final eight minutes, leaving Chelsea supporters to salute the long-awaited win with ironic chants of 'we are staying up'.Some of the away end had jeered substitutes Hakim Ziyech and Raheem Sterling but the pair responded by claiming assists for Badiashile and Felix respectively.Lampard hopes to help rebuild the bond between fans and players and backed the under-fire duo to show their true class following underwhelming campaigns.",
        "'Our fans were fantastic today so I personally appreciate their support,' said Lampard.'I appreciate we had a moment on the end of the pitch where everyone feels good for a day.",
        "'I think that's important to build a connection between players and fans.'Opinion can always change in a period but Hakim and Raheem want to do well, as football players they've got big talent both of them.'I think their class is permanent and I'm pleased for them for having some impact when they came on.'Bournemouth boss Gary O'Neil rued his side's missed opportunities.'I thought it was an even contest,' he said. 'There were lots of bits in it that I liked.'When we were on top, Vina has a one-on-one where Kepa (Arrizabalaga) makes a good save, Kepa makes a great block from Dango as well from four, five yards out and obviously the massive chance, Dango's free header.'If we get our noses in front then the game will probably finish very differently.'I'm disappointed we weren't clinical enough and then we get punished at the other end.'We were well in the game.'"
    ]
}