{
    "articleURL": "/news/article-12054753/Prince-Harry-dons-war-medal-King-Charless-coronation-Andrew-wears-order-garter.html",
    "content": [
        "It was hard to ignore the smart attire of certain members of the Royal FamilyKing Charles Coronation LIVE: Read the latest updates from an historic day hereDressed in lavish robes and crowns, King Charles and Queen Camilla undoubtedly owned the limelight during today's Coronation service at Westminster Abbey.",
        "But it was also hard to ignore the smart attire of many other members of The Firm, who made sure they were dressed to impress for such an historic occasion.Prince Harry, shunned from the Buckingham Palace balcony once again, and relegated to the third row during the ceremony, was among the Royals to display his collection of medals.As he did during the Queen's funeral last year, the Duke of Sussex wore the Afghanistan Campaign medal as well as medals for the Golden, Diamond and Platinum Jubilees and the Star of the Grand Cross Knight Commander of the Royal Victorian Order.",
        "The Golden Jubilee Medal was his first, awarded in 2002 to everyone who was in active service and had been in the forces for five years. ",
        "2002 - Awarded the Queen's Golden Jubilee Medal, which was given to everyone who was in active service on February 6 2002 and had been in the forces for five years2008 - Received an Operational Service medal to mark his service in Afghanistan.2012 - Awarded the Queen's Diamond Jubilee Medal, which was awarded to all those in the Armed Forces, emergency services, prison services and members of the Royal Household.2015 - Knighted by his grandmother for his service and was made a Knight Commander of the Royal Victorian Order (KCVO).2022 - Awarded the Queen's Platinum Jubilee medal despite stepping back from royal duty ",
        "In 2008, Harry received recognition of his service in Afghanistan before then being awarded the Diamond Jubilee Medal four years later - given to all those in the Armed Forces, emergency services, prison services and Royal Household.He was made a Knight Commander of the Royal Victorian Order (KCVO) in 2015 when he was knighted by his grandmother, Queen Elizabeth II, and last year was also handed a Platinum Jubilee medal, despite his much-publicised retreat from royal duty.The Duke wore his medals on his tailored, three-piece Dior suit designed by celebrity favourite British-born Kim Jones.Elsewhere in the Abbey, Mike Tindall also showed off his silverware for the Coronation, despite previously admitting he 'hates' wearing them.The former England rugby ace, who wed Queen Elizabeth II's granddaughter Zara in 2011, was seen wearing three military-style medals for the service as he sat next to his wife among the other British royals.The medals included one shaped like a cross, which is his Member of the British Empire (MBE), which he was awarded in 2007 for his contribution to rugby. The sportsman helped England to World Cup victory against Australia in 2003.He also wore the Diamond Jubilee medal, which was created to mark 60 years of Queen Elizabeth II's reign back in 2012. It is made of silver and is embellished with a portrait of the late Queen, along with the year of the jubilee. ",
        "Former I'm A Celeb star Mike's third medal was awarded to mark the 2022 Platinum Jubilee, which celebrated the late Queen's 70-year reign.",
        "Meanwhile, Harry's uncle, Prince Andrew, was also present, wearing ceremonial robes of the Order of the Garter, despite also stepping back from frontline royal duties in recent years.The Order of the Garter is the oldest and most senior Order of Chivalry in Britain.Last June, Andrew did not appear alongside senior members of the royal family at the annual Order of the Garter ceremony at Windsor Castle, so King Charles' decision to allow his brother to wear the distinctive navy mantle perhaps suggested a thawing of their strained relationship."
    ]
}