{
    "articleURL": "/wires/reuters/article-12038211/Kenyan-police-fire-tear-gas-anti-government-protests-resume.html",
    "content": [
        "NAIROBI, May 2 (Reuters) - Kenyan police fired tear gas at a small group of protesters in the capital Nairobi on Tuesday as the opposition took to the streets again in anti-government demonstrations following a one-month pause.",
        "Police said they had arrested 46 people \"engaging in acts of criminality\" and said the protests were unlawful.The Azimio La Umoja (Declaration of Unity) coalition said some of its members of parliament were stopped on their way to the president's office and met with teargas.\"Tomorrow, we take a break to strategize and recharge. Our protests will resume on Thursday,\" the coalition said in a statement.A Kenyan television station showed police firing tear gas to disperse a handful of protesters in Nairobi's Mathare neighbourhood as well as footage of a minibus that had been set on fire on a road leading to the city centre.In the central business district, there was a heavy police deployment and some shops remained closed. A Reuters photographer saw a trailer on fire on a bypass around the capital.The main opposition coalition had organised three days of demonstrations in March to protest high living costs and alleged fraud in last year's election, which its leader Raila Odinga lost to President William Ruto.Those protests were marred by clashes between police and demonstrators as well as sporadic incidents of violence, including one that Interior Minister Kithure Kindiki termed as \"ethnically-laced arson\" when a church and mosque were set ablaze in Nairobi's Kibera neighbourhood.",
        "Odinga suspended the demonstrations in early April, agreeing to talks with Ruto's representatives. But he later announced that the protests would resume, accusing the government of not negotiating in good faith.(Reporting by George Obulutsa, Thomas Mukoya, Humphrey Malalo and Bhargav Acharya; Editing by Aaron Ross, Alexandra Hudson, Conor Humphries and Angus MacSwan)"
    ]
}