{
    "articleURL": "/wires/reuters/article-12050787/CNH-Industrial-raises-FY-revenue-guidance-cash-flow-negative-Q1.html",
    "content": [
        "By Bianca Flowers and Giulio Piovaccari",
        "MILAN, May 5 (Reuters) - Agricultural and construction machine maker CNH Industrial on Friday raised its full-year revenue forecast as operating profit topped expectations in the first quarter, aided by a strong order backlog and resilient demand for its large tractors. Shares for the global industrial manufacturer rebounded in early trading and were up 2.3% on the NYSE, after initially dropping in the premarket.The company increased its revenue outlook for industrial activities to between 8% and 11% this year, versus a previous forecast of between 6% and 10%.Farmers' solid income cushioned profits even as commodity prices came down from their peaks a year ago. Growers were able to cash in on the still elevated wheat and soybean prices, which fueled purchases for new and used machinery, CNH's Chief Executive, Scott Wine said.\"The high-horsepower and cash crop markets continue to be very strong,\" he said in an interview, adding that the company is planning to accelerate production of large agriculture equipment to catch up on volume output that was reduced during an 8-month long United Auto Workers strike.Like competitors Deere &amp;amp; Co. and Caterpillar Inc. , CNH's profit margins were propped up by price increases across its machinery businesses to offset inflated input costs and a choppy supply chain.",
        "Analysts believe the manufacturer's double-digit price hikes that contributed to a 16% increase in net sales on the year for its agriculture division will sustain the company's margin growth in the coming quarters, said Eric Greaser, vice president at Moody's.Industrial activity revenues increased 21% in 2022.CNH's first-quarter adjusted earnings before interest and tax (EBIT) for industrial activities rose 29% to $555 million, just ahead of analysts' consensus forecast in a Reuters poll. Revenue was in line with expectations at $4.78 billion.Company executives said they were confident the company would complete its delisting from the Milan bourse by the end of the year and keep its shares trading only in New York. (Reporting by Giulio Piovaccari and Bianca Flowers in Chicago; Editing by Kirsten Donovan, Mark Potter and Louise Heavens)"
    ]
}