{
    "articleURL": "/tvshowbiz/article-12048763/Sharon-Osbourne-opens-cheeky-relationship-King-Charles-ahead-Coronation.html",
    "content": [
        "Sharon Osbourne has opened up about her relationship with King Charles and Queen Camilla ahead of their Coronation on Saturday.",
        "The foul-mouthed star, 70, gushed about the 'wonderful' couple and admitted to having even turned the air blue in their presence. Sharon, who has met the monarch many years ago and their paths have crossed at both private and public events, said: 'Charles and Camilla are wonderful and I love them very much.'She told The Sun: 'Camilla has a wicked sense of humour and is very naughty, and Charles is so incredibly caring. He is a great guy and so relatable.'Before adding: 'I've sworn in front of Charles plenty of times, he never says anything, he just looks and thinks, \"Oh here she is\".'",
        "Having ascended to the throne in September 2022, following the death of Queen Elizabeth II, Charles will be officially crowned as the reigning monarch of the United Kingdom.It will be the first coronation of a British monarch in over half a century, after the late Queen enjoyed a 70-year reign atop the throne following her coronation. This was the longest reign by a British monarch and history, with Queen Elizabeth II also recording the longest-ever verified reign of any female monarch. It comes after Sharon has revealed she has turned her back on cosmetic surgery following a 2021 facelift that left her 'looking like a cyclops'.She has been fond of going under the knife in the past but now says the most recent procedure's results left her 'frightened'.",
        "She told The Sun that she can now she 'really f***ing pushed it' before vowing to never have surgery again.She previously told The Sunday Times: 'I'm telling you, it was horrendous. [To the surgeon] I'm, like, \"You've got to be f***** joking. One eye was different to the other. I looked like a f***** Cyclops. I'm, like, \"All I need is a hunchback,\"''It hurt like hell. You have no idea,' she added of the cosmetic surgery, which took five and a half hours.Her singer-songwriter husband Ozzy Osbourne, 74, apparently concurred that the results were not great and offered to pay to fix it.'He said, \"I don’t care how much it costs, we’ll get it redone,\"' Sharon - who shares children Aimee, 39, Kelly, 38, and Jack, 37, with Ozzy - said.Osbourne has always been open about the procedures she's undergone over the years, and spoke about up getting a face lift in 2019.",
        "She discussed the procedure in an October 2019 appearance on The Kelly Clarkson Show. 'I had this thing where they lifted up my mouth and then for the first week I couldn’t feel my mouth, I can hardly feel my mouth now, to be honest with you,' she said.'I couldn’t find my mouth. It was numb and it was up on one side and I looked like Elvis. ",
        "'All the kids and Ozzy are going, \"Why are you snarling at me?\" And I’m like, \"I’m not snarling; I’m not doing anything!\"'"
    ]
}