{
    "articleURL": "/wires/ap/article-12040155/Calhoun-Volpe-help-Yanks-rally-past-Guardians-halt-skid.html",
    "content": [
        "NEW YORK (AP) - Until the New York Yankees get Aaron Judge and Giancarlo Stanton back, they're going to need some other guys to help generate offense.",
        "Willie Calhoun is one of those guys.After spending most of last season in the minors, Calhoun snapped a seventh-inning tie with his first home run for the scuffling Yankees in a 4-2 victory over the Cleveland Guardians that stopped a four-game slide Tuesday night.\"Obviously, when you hit a home run like that to put your team in the lead, it's always exciting,\" Calhoun said. \"But to be able to do it here was fun.\"Gerrit Cole settled down after a rocky start and Anthony Volpe homered in the sixth to begin New York's comeback from a two-run deficit.Gleyber Torres followed with a double that chased impressive rookie Tanner Bibee, and Anthony Rizzo's single off James Karinchak tied it.",
        "With one out in the seventh, Calhoun lined an 0-2 curveball from Karinchak (0-4) to right field for his first major league home run since April 11 last year with Texas.\"That was a special homer,\" Calhoun said. \"Especially like I said, in Yankee Stadium, to be able to hit a home run here is pretty cool. But yeah, just to overcome all the things that I overcame the last few years and kind of put it behind me in the rearview mirror and to be able to do that at this stage is a pretty surreal feeling.\"",
        "Calhoun started at designated hitter in place of Stanton, one of several regulars missing from an injury-depleted Yankees team that sits last in the AL East. New York (16-15) had dropped seven of nine, totaling only 10 runs during those seven defeats.\"Obviously, losing guys like that, they're some of the best players in the game,\" Calhoun said. \"No one's going to fill those shoes that those guys bring to the table every single day. But just making sure that you stay ready for whenever they need you - I'll be ready.\"Center fielder Harrison Bader came off the injured list and went 1 for 4 with a diving catch in his season debut.\"He's such a difference-maker in the middle of the field,\" Yankees manager Aaron Boone said. \"It's fun to watch him go play out there.\"Volpe singled in the eighth and the rookie then stole two bases before scoring on a two-out single by DJ LeMahieu that made him 9 for 21 (.429) with runners in scoring position.\"He´s a special baserunner,\" Boone said of Volpe. \"He´s one of the best I´ve ever seen.\"Volpe also made a good play at shortstop in the top of the eighth when reliever Wandy Peralta bounced a throw to second.Peralta (2-0) got two outs and Michael King worked 1 2/3 hitless innings for his second save, striking out three.",
        "Cole fanned eight in six innings and remained unbeaten in seven starts this season with a 1.35 ERA. He pitched out of trouble early before allowing a run-scoring double to Josh Naylor and an RBI groundout to Andrés Giménez in the third.The right-hander needed 69 pitches to get through the first three innings but threw only 39 over the next three.\"Early on, Cole obviously was having trouble commanding his fastball,\" Cleveland manager Terry Francona said. \"It kind of just shows you how good a pitcher he is.\"Bibee took a two-hit shutout into the sixth and hasn't walked a batter in either of his first two big league stars. He got hit by a line drive on the meaty part of the thumb on his non-pitching hand in the fifth, but remained in the game.Francona said afterward Bibee was sore but fine. The right-hander struck out five and was charged with two runs on four hits in 5 1/3 innings.\"He competes. He throws all his pitches for strikes. There´s a lot to like with this kid. We´re going to enjoy watching to see how good he can get,\" Francona said.EXTRA! EXTRA!Before the sixth, New York had gone 50 innings without multiple extra-base hits.\"Just stringing together good at-bats,\" Volpe said. \"We know what we´re capable of.\"",
        "TRAINER´S ROOMGuardians: LHP Sam Hentges has been unable to make his rehab appearance with Triple-A Columbus because of consecutive rainouts Sunday and Tuesday. Francona said the club will try again Wednesday and if it doesn't work out, Hentges will throw a simulated inning before coming off the injured list. The reliever has been sidelined since spring training with shoulder inflammation.Yankees: Judge planned to take swings indoors for the second consecutive day. He went on the 10-day injured list Monday, retroactive to April 28, because of a strained right hip. ... RHP Lou Trivino (elbow strain) is scheduled for season-ending Tommy John surgery Wednesday in Los Angeles.UP NEXTGuardians ace Shane Bieber (2-1, 3.11 ERA) faces struggling right-hander Clarke Schmidt (0-3, 6.84) in the series finale Wednesday night.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}