{
    "articleURL": "/wires/reuters/article-12059431/Chinese-militia-boats-cross-Indian-ASEAN-warships-exercising-South-China-Sea.html",
    "content": [
        "By Krishn Kaushik and Francesco Guarascio",
        "NEW DELHI/HANOI, May 8 (Reuters) - Boats belonging to a Chinese maritime militia approached an area where navies of India and ASEAN countries were taking part in drills in the South China Sea, two Indian sources said on Monday.An independent expert in Vietnam said Beijing appeared to be using the militia to intimidate and disrupt the naval exercise.Beijing has not responded to Reuters queries about the alleged incident and its possible motives. The Indian and Vietnamese governments declined to comment.The two-day sea phase of the ASEAN-India Maritime Exercise (AIME 2023) began on Sunday with naval ships and aircraft from India, Vietnam, Thailand, the Philippines, Indonesia and Brunei taking part.They were in the Vietnamese Exclusive Economic Zone when the Chinese boats moved towards them, the Indian sources said. However, the militia boats and naval vessels crossed each other without any face-off, they said.Indian authorities were tracking the movements of at least five militia boats, according to the sources, who did not wish to be identified as they are not authorised to speak to the media.A Chinese research vessel was also following these boats towards the same area, they said.Ray Powell, who leads Project Myoushu on the South China Sea at Stanford University, said the boats belong to the Qiong Sansha Yu militia fleet in the area.",
        "Such militias consist of commercial fishing boats, which work in coordination with the Chinese authorities for political objectives in the South China Sea. The Chinese government, however, in the past rejected the existence of any such militia.Van Pham, manager of The South China Sea Chronicle Initiative (SCSCI), an independent non-profit which monitors vessel-tracking data, said this was not the first time Chinese \"so-called fishing vessels\" were around and intimidated warships of other countries.\"So it´s likely that the exercise was interrupted...the pattern was broken and some had to change their directions,\" she told Reuters.Chinese research vessel Xiang Yang Hong 10 had come as close as 10 miles to the participating Vietnamese warship at one point, Pham said.The drill is the first ASEAN-India Maritime Exercise (AIME-2023) and is co-hosted by the Indian and Singaporean navies.Several of China´s littoral neighbours have accused it of using its official and militia vessels to harass and intimidate their fishing and military boats in the South China Sea.China has for years claimed sovereignty over the entire South China Sea, and has been sensitive to the presence of other militaries in the region.Relations between India and China have also plummeted since a clash between their armies in the Himalayas in 2020 in which 24 soldiers were killed. (Reporting by Krishn Kaushik in NEW DELHI; Francesco Guarascio in HANOI; Additional reporting by Khanh Vu in HANOI; Editing by YP Rajesh and Angus MacSwan)"
    ]
}