{
    "articleURL": "/wires/reuters/article-12050615/Warner-Bros-Discovery-streaming-business-turns-profit.html",
    "content": [
        "May 5 (Reuters) - Warner Bros Discovery Inc said on Friday its streaming business turned a profit in the first quarter, a milestone for a division that had been losing money in its bid to gain subscribers and a foothold in the industry's digital future.",
        "The company's streaming unit, which includes the HBO Max and Discovery+ services, posted adjusted pre-tax earnings of $50 million in the quarter, compared with a loss of $227 million a year earlier. It gained 1.6 million subscribers.CEO David Zaslav was in the vanguard of media executives who sought to restrain spending on content for the company's service, seeking to balance the growth of the nascent service with continued investment in Warner Bros Discovery's traditional film and television business.\"We are not trying to win the direct-to-consumer spending war,\" Zaslav said a year ago.Other entertainment conglomerates, notably Walt Disney Co , have followed suit, as they look to strike the right balance between improving profitability and spending on fresh content to attract and retain subscribers in an uncertain economy.Warner Bros Discovery's new streaming service, christened \"Max,\" is set to launch on May 23, combining HBO Max's scripted entertainment with Discovery's reality shows. It will seek to expand its reach beyond fans of HBO's acclaimed and edgy shows by incorporating unscripted fare and children's programming.Warner Bros Discovery reported revenue of $10.70 billion for the first three months of 2023, compared with analysts' estimates of $10.78 billion, according to Refinitiv data.The company reported per-share loss of 44 cents for the quarter ended March 31, reflecting non-cash accounting items related to the 2022 acquisition of WarnerMedia.",
        "The Warner Bros studio segment missed on its revenue forecasts, as its big March release \"Shazam! Fury of the Gods,\" a sequel to 2019's \"Shazam,\" was met with a cool reception at the box office. The sequel brought in $133 million at the box office, far below the $368 million garnered by the original.Advertising revenue at the company's networks business, which includes HGTV, Discovery Channel and TLC, rose 56%.The company posted a net loss of $1.07 billion, compared with a net income of $456 million a year earlier.(Reporting by Dawn Chmielewski in Los Angeles and Samrhitha Arunasalam in Bengaluru; Editing by Sriraj Kalluvila)"
    ]
}