{
    "articleURL": "/wires/pa/article-12039033/Final-UK-evacuation-flight-leave-Sudan-Wednesday-says-Cleverly.html",
    "content": [
        "The final UK evacuation flight is expected take off from Sudan on Wednesday, the Foreign Secretary has announced.",
        "James Cleverly urged British nationals still wanting to leave the war-torn nation to make their way to Port Sudan.It was previously thought the evacuation airlift had ended on Monday when planes left Sudan for Cyprus.So far during the airlift – the longest and largest by any western nation in Sudan – 2,341 people have been evacuated on 28 flights, according to the Government.",
        "Downing Street said 1,195 were British nationals, with other nationalities, including Sudanese dependants of British nationals, also helped to leave.No 10 confirmed that, as of Monday, 18 Sudanese clinicians had left the country as part of the UK evacuation.",
        "In updated guidance on its website on Tuesday, the Foreign, Commonwealth and Development Office said: “The UK government will run final evacuation flights from Port Sudan on 3 May.“If you plan to leave Sudan, you should arrive at the Coral Hotel in Port Sudan by 10am on 3 May to be processed to travel.“After that, no further British evacuation flights will operate from Port Sudan.”Mr Cleverly tweeted: “After the successful evacuation of 2341 people on 28 flights, the last UK flight is expected to leave Port Sudan tomorrow.“I urge British Nationals still wishing to leave the country to go to the Coral Hotel in Port Sudan and continue to follow our Travel Advice.”",
        "Earlier, the Foreign Secretary said there was still a British military presence at the country’s main seaport on the Red Sea coast as the situation remained dangerous.As well as officials and military personnel in Port Sudan, the HMS Lancaster warship is off the coast to support Britons.The international focus is shifting to preventing a wider humanitarian catastrophe in the region and Mr Cleverly warned that any further fighting would hamper relief efforts.The United Nations said Sudanese army chief General Abdel Fattah Burhan and his rival General Mohammed Hamdan Dagalo, the head of a paramilitary group known as the Rapid Support Forces (RSF), have agreed to send representatives to the negotiation table in a bid to establish a more stable truce.Generals Burhan and Dagalo, both with powerful foreign backers, were allies in an October 2021 military coup that halted Sudan’s fraught transition to democracy, but they have since turned on each other."
    ]
}