{
    "articleURL": "/wires/reuters/article-12049359/China-enhance-credit-support-private-investment-projects.html",
    "content": [
        "BEIJING, May 5 (Reuters) - China's state planner will step up credit support for projects with private investment, the state-run People's Daily reported on Friday, reinforcing efforts to encourage more private capital investment in major projects.",
        "Despite better-than-expected economic growth in the first quarter, the recovery of the world's second-largest economy has seen public investment outpacing sluggish private investment by a big margin.Private sector fixed-asset investment only grew 0.6% during January-March from a year earlier while state sector investment jumped 10.0%, official data showed.An official from the National Development and Reform Commission (NDRC) told the newspaper that as part of the bid to encourage private investment, private capital would be treated equally, without discrimination, when distributing government investment funds.\"In recent years, due to the impacts from the global economic situation and the pandemic, some private firms suffered declining profits, cash flow shortage and inability to reinvest,\" the newspaper cited the NDRC official as saying.\"In addition, some private firms face financing difficulties and high financing costs,\" which resulted in their inability to take part in big infrastructure projects - like \"a small horse pulling a big cart\", the People's Daily said.Some private firms said they were willing to participate in projects in the hope of good yields but there were still \"tangible or intangible barriers to the market access\".According to the NDRC official, local governments in 2022 promoted more than 50,000 projects to investors and about 9,000 of them attracted private capital to the tune of about 2.9 trillion yuan ($419.44 billion).",
        "The Politburo, a top decision-making body of the ruling Communist Party, said last week that the government would reinforce business confidence and stimulate private investment. ($1 = 6.9139 Chinese yuan renminbi) (Reporting by Ellen Zhang and Ryan Woo; editing by Robert Birsel)"
    ]
}