{
    "articleURL": "/wires/ap/article-12055759/As-beat-Royals-5-4-win-1st-time.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The Oakland Athletics won consecutive games for the first time this season as Ryan Noda had a triple and double, reaching base four times in a 5-4 win over the Kansas City Royals on Saturday night.",
        "Noda was 5 for 7 with three doubles, a triple, four runs and four RBIs in the first two games of the series between teams tied for the worst record in the major leagues at 8-26.\"He's swinging the bat,\" Oakland manager Mark Kotsay said. \"He's learned early in the season that when you're as patient as he's been coming through the minor leagues, these big-league guys will attack you. He's been a little more aggressive in the zone and that's created some results.\"Noda is just trying to keep an even keel.\"My job is to get on base any way I can,\" he said. \"The last two days I've been doing a pretty good job of it. I'm just sticking to my approach and grinding it out. I've been getting good pitches and not missing them.\"Ken Waldichuk (1-2) allowed four runs, six hits and six walks in five innings with six strikeouts. His 115 pitches were the most he's thrown in his major-league career.",
        "\"I really wanted to get through five and help out the bullpen a little bit,\" Waldichuk said. \"I'm really happy that Kots let me stay out there.\"I was battling a lot with my command. Once I walked (Michael Massey leading off the fifth), I knew it was go time.\"",
        "Zach Jackson retired Bobby Witt Jr. on a game-ending groundout with two on for his first save this season.Brady Singer (2-4) gave up five runs and six hits in four innings.Kansas City honored Lorenzo Cain in a pregame ceremony. A member of the 2015 World Series champions, Cain signed a one-day contract to retire with the Royals. The team drew 29,549, its highest home crowd since opening day.The Royals had seven baserunners in the last three innings but didn't score.\"To leave that many guys stranded you have to have some good at-bats, too, to put them on base,\" Royals manager Matt Quatraro said. \"We put a lot of good at-bats together so there is a flip side to everything.\"Maikel Garcia hit a two-out RBI double in the first, but Esteury Ruiz's two-run single in the second and JJ Bleday's homer in the third built a 3-1 lead. Ryan Noda hit an RBI triple in the fourth and scored on Brent Rooker's double.It marked the first series win of season for the Athletics after losing their first 10 series.\"For this club, we know where we're at,\" Kotsay said. \"We know the hole we dug ourselves. Our focus is on winning each day. I don't think the weight of not winning a series was impactful. But it definitely does feel good to get our first series win.\"",
        "Freddy Fermin's solo homer and Witt's two-run drive, a 434-foot drive for his sixth homer this season, cut the deficit to one run in the bottom half.UP NEXTRHP Mason Miller (0-1, 3.52 ERA) starts Sunday for Oakland and LHP Ryan Yarbrough (0-4, 7.40 ERA) for the Royals.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}