{
    "articleURL": "/sport/formulaone/article-12043877/Lewis-Hamilton-trades-curbs-court-playing-basketball-actors-James-Marsden-Simu-Liu.html",
    "content": [
        "Lewis Hamilton hit the courts in Miami as Grand Prix weekend approaches Rumors about a move to Ferrari have swirled since last weekend in Azerbaijan DailyMail.com provides all the latest international sports news Sir Lewis Hamilton was seen taking to the court with sponsor IWC in Florida just ahead of this weekend's Miami Grand Prix.",
        "At a sponsorship event for the luxury watch company, Hamilton was spotted on a branded court with a large sign of the driver behind one of the hoops.Joining him at this event were other IWC-sponsored celebrities - including Hollywood actors James Marsden and Simu Liu.The event took over Jungle Plaza in the Florida city, inviting basketball fans to participate in a clinic with professional basketball coaches and then compete in our Free Throw Challenge.The Mercedes driver appeared to be participating in a challenge of his own as he teamed up with Marsden and NFL star Antrel Rolle to take on skateboarder Jagger Eaton, Brandon Okpalobi and Liu. ",
        "Hamilton is preparing for the 2023 Miami Grand Prix - the second year that the race has been held at the Miami International Autodrome.It's been a season of struggles for the seven time World Champion - who remains steadfast in his search for an eighth crown - as he's failed to finish atop the podium so far.Hamilton's last victory in Formula One came all the way back at the 2021 Saudi Arabian Grand Prix - before a controversial decision at the final race of the season in Abu Dhabi cost him an eighth crown.While he couldn't find wins last season, he still managed multiple podium finishes - including five P2 results and four P3 finishes. That led to him finishing the year in sixth position.",
        "This season looks on track to be more of the same for the British racing legend - with only the only podium finish to his name so far coming with a P2 in Australia.He finished P5 in the first two rounds of the season at Bahrain and Jeddah in Saudi Arabia before finishing P6 in Azerbaijan.",
        "Struggles to find results have plagued both Mercedes drivers as Hamilton's teammate George Russell has finished P7 in Bahrain, P4 in Saudi Arabia, P8 in Azerbaijan and crashing out in Australia.Hamilton looks to be far behind the leaders of the field - with Red Bull drivers Max Verstappen and Sergio Perez seemingly outclassing him in a better car each weekend.That, coupled with Hamilton's contract expiring at the end of the season, has led to speculation regarding his future.F1 fans were aflutter on social media when images of Hamilton speaking to Ferrari team principle Fred Vasseur spun the rumor mill.",
        "Additionally, Mercedes team principal Toto Wolff said that Ferrari's golden boy Charles Leclerc is 'on [our] radar'. But Wolff has also said that he isn't willing to speak to other drivers or form a 'Plan B' if Hamilton departs.Unlike Hamilton's current deal, Leclerc's contract runs until the end of the 2024 season.",
        "The pair will face off against the rest of the field in Miami Gardens this weekend - with Hamilton sitting fourth in the driver's championship and Leclerc in sixth.It's an event that Leclerc won pole at last season, but he only managed a P3 finish behind Perez and Verstappen. "
    ]
}