{
    "articleURL": "/wires/reuters/article-12051643/Rate-swap-connect-China-Hong-Kong-begin-May-15.html",
    "content": [
        "HONG KONG, May 5 (Reuters) - Mutual access to interest rate swap markets between Hong Kong and mainland China will commence on May 15, the Hong Kong Monetary Authority said on Friday.",
        "The programme will begin with Northbound Trading, allowing overseas investors to participate in mainland China's interbank financial derivatives market through a connection between the two markets, HKMA said in a statement.The latest announcement follows the guidance issued last Friday by the People's Bank of China (PBOC), which set the initial net daily trading quota for Northbound Swap Connect at 20 billion yuan ($2.9 billion). Last week, the Chinese central bank also said regulators would studyextendingthe scheme's Southbound leg, which allows mainland investors to access the Hong Kong financial derivatives market \"in due course\".The launch of the Northbound Swap Connect will enable foreign investors outside China access to interest rate swaps (IRS) traded in the onshore interbank market.Currently, offshore investors use non-deliverable interest rate swaps to hedge against interest rate risks of their underlying China bond positions. These swaps are settled in U.S. dollars.As there are fewer dealers in Hong Kong that offer such instruments, offshore investors often face a heftier hedging cost than onshore counterparts, analysts said.\"Swap Connect and the participation of overseas investors would help diversify the investor base, improve price discovery, and further increase market liquidity,\" said Bank of America's analyst Janice Xue in a research note published last week.Standard Chartered bank said it welcomed the launch.",
        "\"The programme will facilitate global investors´ management of interest rate risks for their bond investments in Mainland China, enhancing the attractiveness of yuan-denominated assets as part of their portfolios and furthering the internationalization of the yuan,\" said John Thang, head of financial markets, Hong Kong and Greater Bay Area at Standard Chartered. (Reporting by Meg Shen and Georgina Lee; Editing by Toby Chopra and David Gregorio)"
    ]
}