{
    "articleURL": "/news/article-12040347/Horrific-video-shows-former-Marine-24-putting-erratic-subway-passenger-deadly-chokehold.html",
    "content": [
        "The fight broke out at Broadway-Lafayette station when a man identified as Jordan Neely, 30, entered a subway car and began threatening passengersA former marine, 24, then put him in a headlock until he was unconsciousNeely later died in hospital, and the former marine will not be chargedWARNING: GRAPHIC CONTENT BELOW The horrific moment a 24-year-old former Marine put an erratic New York subway passenger in a headlock until he died was captured on camera.",
        "The fight broke out at the Broadway-Lafayette station on Monday afternoon when a 30-year-old man identified by the New York Post as Jordan Neely entered the subway car and started threatening passengers.Witnesses said he was was acting in a 'hostile and erratic manner' before the younger man put him in a headlock and held him there until he was unconscious.In the clip, the younger man could be seen holding the Neely down on the floor of the subway car while he tried to free himself from the headlock, before suddenly going limp.The Marine was arrested after the fight and Neely was taken to Lenox Hill Hospital, where he was pronounced dead. Police the Marine would not be charged in the incident.",
        "The incident happened just before 2:30pm on the northbound F train platform at Broadway-Lafayette station in downtown Manhattan. The 30-year-old entered the northbound train and reportedly started yelling and throwing garbage at other commuters, prompting an argument with the former Marine, who NY Daily News reported was from Queens.'He started screaming in an aggressive manner,' witness Juan Alberto Vazquez told The Post. 'He said he had no food, he had no drink, that he was tired and doesn't care if he goes to jail. He started screaming all these things, took off his jacket, a black jacket that he had, and threw it on the ground.' ",
        "The Marine then intervened by putting the other man in a headlock until he was unconscious, police said. When an EMS team boarded the train, which remained at the platform, they were unable to revive him.Footage from the altercation showed the 24-year-old grappling with the 30-year-old on the floor of the car, while others restrained the man's arms and legs as he tried to free himself.People could be heard calling for the police on the Subway platform throughout the fight, and then finally the 30-year-old went still on the ground.At that point an onlooker could be heard asking whether the man was breathing, saying 'You don't want to kill him now.'One of the people holding the man's arms down replied 'It's alright, he's not squeezing him now.'Police have chosen not to identify the 24-year-old man, who was released without charges Tuesday.Neely was homeless and had mental health issues, according to the Post. ",
        "The decision not to charge the younger man aligns with recent decisions by the Manhattan DA, Alvin Bragg.In April his office U-turned by saying it would not charge a garage security guard who shot a suspected thief with his own gun.The garage attendant was himself shot twice by the alleged thief before tussling for the same gun and firing back.",
        "Both were initially charged with attempted murder, assault and firearms charges before the DA's office changed its position.Bragg's office said at the time it would dismiss the case 'pending further investigation'."
    ]
}