{
    "articleURL": "/wires/pa/article-12054187/Crowned-King-switches-purple-tunic-robes-Abbey-finale.html",
    "content": [
        "The newly-crowned King, wearing his Imperial State Crown for the first time, switched into an outfit of regal purple splendour for his departure from his coronation ceremony.",
        "Charles moved to St Edward’s Chapel behind the High Altar to change into a newly-made purple satin Coronation Tunic, trimmed with gold artillery lace, and George VI’s grand purple silk velvet Robe of Estate.The purple Coronation Tunic was made by traditional royal robe makers Ede and Ravenscroft and the design was inspired by similar tunics worn by Charles’s great-grandfather George V and grandfather George VI at their coronations.The King wore his Garter Star and Garter Collar decorations.",
        "The Robe of Estate with lengthy train is made of purple silk velvet and embroidered in gold, and was worn by George VI at his coronation in 1937.Robemakers at Ede and Ravenscroft have conserved and prepared the robe, which is nearly 90 years old.At the start of the service, the King arrived in his crimson Robe of State and matching rich, deep red Coronation Tunic.",
        "The newly-crowned Queen also swapped her crimson Robe of State for a purple Robe of Estate to leave the Abbey.The specially commissioned regal cloak with train is embroidered in goldwork threads, and intricately decorated with bees, a beetle and a host of flowers – drawing on the themes of nature and the environment.It pays tribute to the King by incorporating delphiniums – one of his favourite flowers which is also Camilla’s birth month flower – and in memory of Elizabeth II includes the late Queen’s favourite bloom, lily of the valley.",
        "There are a total of 24 plants featured on the robe, all chosen for their personal associations, including hawthorn which represents the month of May when the Coronation takes place and oak leaves for strength and longevity.It was designed and hand embroidered by the Royal School of Needlework and made by Ede and Ravenscroft."
    ]
}