{
    "articleURL": "/wires/ap/article-12044331/Titans-drafting-QB-deja-vu-vet-Ryan-Tannehill.html",
    "content": [
        "NASHVILLE, Tenn. (AP) - The final year of his current NFL contract is not a topic Tennessee Titans quarterback Ryan Tannehill will discuss.",
        "Yes the quarterback who turns 35 in July noticed the Titans drafted a quarterback for a second straight year. This time, the franchise traded up to No. 33 to take Kentucky's Will Levis, its highest selection used at quarterback since taking the man Tannehill replaced at No. 2 overall in 2015.A case of deja vu for sure.Also nothing Tannehill didn't already know.\"Nothing´s given to you in this league, and I´ve seen that over my now 12 years here in the NFL,\" Tannehill said Wednesday. \"Things can change quickly.\"Tannehill has been busy since the season ended, working himself back into shape to be ready for all the new competition.",
        "He had surgery to fix the right ankle he sprained not once, but twice and that ended his 2022 season. The Titans lost seven straight games to finish the season - the final three without Tannehill -and just missed a third straight AFC South title.Coach Mike Vrabel made clear after the NFL draft that Tannehill is their starter backed up by Malik Willis, the 86th pick overall a year ago, with Levis starting at No. 3. That happens when rookies report May 11 for their minicamp.Tannehill stayed in Nashville this offseason to work with the Titans' training staff to recover fully from surgery. He's also been around since the start of the offseason program April 17, working with new offensive coordinator Tim Kelly and new passing game coordinator Charles London.",
        "Vrabel fired Todd Downing as coordinator after the Titans ranked ahead of only four other NFL teams in scoring, averaging a mere 17.5 points a game. Tannehill said there's a big difference in what Kelly, who spent last season as passing game coordinator, has added to the offense.\"New terminology, new concepts, you know huge changes, but fresh line of thinking on things,\" Tannehill said. \"So just having to get up to speed with how we´re doing things, what we´re calling things, different ways we´re attacking the defense.\"The Titans made a bunch of offseason changes aside from the coaching staff.New general manager Ran Carthon started revamping an offensive line that gave up 49 sacks - only four NFL teams allowed more - by releasing three-time Pro Bowl left tackle Taylor Lewan and center Ben Jones. Right guard Nate Davis was allowed to leave in free agency.Carthon used his first selection as GM on offensive tackle Peter Skoronski of Northwestern at No. 11 overall, and he also signed Andre Dillard and Daniel Brunskill in free agency.Tannehill, who was sacked 33 times in the 12 games he played, noticed all the familiar faces now gone and the additions. He's been busy getting to know the veterans added.Aaron Brewer, an undrafted free agent in 2020 out of Texas State, started two games at center last season. He is spending quality time with Tannehill and Kelly preparing for the first opportunity at center after starting 15 games at left guard last season.",
        "The Titans used only one draft pick on tight end in Josh Whyle of Cincinnati in the fifth round and their final pick in the seventh on a wide receiver in Colton Dowell of UT Martin, a FCS school. Tennessee did sign Chris Moore to a one-year deal.A trio of 2022 draft picks will get their opportunities now from receiver Treylon Burks, the 18th pick overall a year ago and tight end Chig Okonkwo to receiver Kyle Philips.Someone has to step up.\"You look who we got in the room, and that´s who it is,\" Tannehill said. \"So I´m going to have to go out, compete each and every day, and we´ll see who ends up getting the majority of the time. But definitely guys are going have to step up.\"Just like Tannehill.___AP NFL coverage: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}