{
    "articleURL": "/wires/reuters/article-12039229/CANADA-STOCKS-TSX-falls-near-one-week-low-oil-price-tumbles.html",
    "content": [
        "TSX ends down 1% at 20,407.56",
        "Energy falls 4.6%, oil settles 5.3% lowerFinancials lose 1.8%Materials add 1.9% as gold rallies(Adds details on stocks)By Fergal SmithMay 2 (Reuters) - Canada's main stock index fell on Tuesday as a sharp drop in the price of oil pressured energy shares, while investors worried that higher borrowing costs could slow the economy, leading to a volatile period for the market.The Toronto Stock Exchange's S&amp;amp;P/TSX composite index ended down 207.54 points, or 1%, at 20,407.56, its lowest closing level since last Wednesday\"I think that what we are seeing today is the fact that inflation and interest rates are at the top of everybody's mind,\" said Michael Sprung, president of Sprung Investment Management.U.S. stock indexes also fell as investors fretted about the impact of further interest rate hikes on the U.S. economy and banking system.The Federal Reserve is expected on Wednesday to raise interest rates by 25 basis points to a range of 5% to 5.25%, its highest level in nearly 16 years.\"People are still fearing this possibility of a recession which has not yet happened but could well still happen,\" Sprung said. \"So I think that we are going to see a lot of radical price changes over the next number of months as people try to digest all this.\"",
        "The Toronto market's energy sector led the declines, down 4.6%, as oil settled 5.3% lower at $71.66 a barrel. Financials were also a drag, falling 1.8%.The materials group, which includes precious and base metals miners and fertilizer companies, helped limit the TSX's losses. It added 1.9% as gold prices jumped.Among the major movers was Colliers International Group Inc . Shares of the investment management company slumped 9.7% after it missed first-quarter profit estimates.In contrast, BlackBerry Ltd shares added 9.3% after the company said it would conduct a review of strategic alternatives and Restaurant Brands International Inc was up 2.8%, helped by better-than-expected earnings. (Reporting by Fergal Smith in Toronto; Additional reporting by Shristi Achar A and Vansh Agarwal in Bengaluru; Editing by Shilpi Majumdar,d Marguerita Choy and Jonathan Oatis)"
    ]
}