{
    "articleURL": "/news/article-12052939/Former-UC-Davis-student-accused-string-stabbings-scholarship-doctor.html",
    "content": [
        "Carlos Dominguez, a 21-year-old biology student, was arrested on Wednesday and charged with fatally stabbing two people and injuring a thirdDominguez on Friday pleaded not guilty to two counts of murder and one of attempted murder in Woodland, 15 miles north of SacramentoThe University of California, Davis, confirmed that Dominguez was a third-year student majoring in biological sciences until April 25The man accused of fatally stabbing two people in California and injuring a third had a full academic scholarship to university, it emerged, and was studying to become a doctor.",
        "Carlos Dominguez, 21, was arrested on Wednesday after terrorizing the college town of Davis.He appeared in court on Friday in Woodland, 15 miles north of Sacramento, and pleaded not guilty to two counts of murder and one count of attempted murder.The University of California, Davis confirmed that he had been a student, in his third year of a biological science degree, until April 25, 'when he was separated for academic reasons.'They did not provide more detail. ",
        "'We urge the community not to rush to conclusions or speculate until all facts are known,' the release read. 'We are grateful for law enforcement's quick response and resolution during an extremely difficult period for the city and campus.'Two days after the university kicked him out, Dominguez allegedly stabbed to death David Breaux, 50. Breaux, a beloved homeless man known locally as 'Compassion Guy', was found on a bench near the campus at 11.20am and 'stabbed many times'.On April 29, UC Davis senior Karim Abou Najm, 20, was on his way home from an undergraduate awards ceremony at around 9.15pm when he was fatally stabbed.Then on the morning of May 1, a 64-year-old woman, Kimberlee Guillory, was stabbed through a tent at a homeless encampment at around 11.46pm. She remains in a critical condition.",
        "On Friday police were continuing to search the house Dominguez shared with a roommate, and taking away bags of evidence.'This is a really heavily-traveled road by a lot of people. Kids. Old couples and college students,' said Talia Mickelsen, who lives across the street from the home where Dominguez lives, and spoke to KCRA. 'So it's pretty scary that something like that is happening in such a populated area.'Another neighbor, who asked not to be identified, lives a couple doors down and told KCRA 3: 'It's especially scary, especially leaving campus at night because some of us have night classes.'And just like, knowing the killer was right next door that was so scary.'",
        "Dominguez had come to the U.S. as an unaccompanied minor from El Salvador in 2009.He crossed near Galveston, Texas, and was transferred to a family member at the time. He was a student at Castlemont High School in Oakland before going to UC Davis.His former high school football coach, James Barnes, said Dominguez was a good athlete and student.'Great kid, 3.85 GPA. He was involved in all the school activities. He also ran track and participated in other athletics as well,' Barnes said.Barnes told KCRA that Dominguez volunteered for organizations, and won the full scholarship for university.",
        "'Nice kid. Never had any issues,' said Barnes. 'Very well respected through his peers. He respected adults. 'I wouldn't see where this would come from.'Darren Pytel, Davis Police Chief, said that he was surprised by Dominguez's demeanor when he was arrested. A large hunting knife was found in his backpack: police are trying to determine whether this was the knife used in the stabbings. 'The behavior was quite unusual in a circumstance like this. He was compliant during the entire process,' said Pytel. 'He was reserved and spoke for a long time.'Will Arnold, mayor of Davis, said on Thursday: 'The murderer is off the streets and our families can sleep easier.'Arnold said the 'brazen' killing of Breaux was 'devastating'.",
        "Breaux, who was a fixture in the community for over the past decade, was 'instrumental' in the addition of a 'Compassion Bench' at the corner of 3rd and C Streets in 2013.'The death of David Breaux is utterly and completely devastating,' said Arnold. 'Many of us knew David. We talked with him. We shared in his vision for a kinder world. 'We connected on what it means to be human and humane.' The bench is where he would ask people their definition of the word 'compassion.' He later published his notes as a collection of anonymous writings.",
        "'Like so many of you, I am grieving the death of David Henry Breaux, known as the 'Compassion Guy,'' said the chancellor of UC Davis.'David led a life with real purpose, to connecting humanity for the greater good, something we should all aspire to do.'"
    ]
}