{
    "articleURL": "/sport/football/article-12060709/Dean-Smith-left-dismayed-Leicesters-atrocious-display-Fulham-loss.html",
    "content": [
        "Fulham beat Leicester City 5-3 to plunge the Foxes deeper into troubleManager Dean Smith described end-to-end contest as a 'basketball game'The result leaves Leicester in serious trouble with just three games remainingDean Smith admitted he did not see Leicester's poor first-half performance coming as they were beaten 5-3 by Fulham at Craven Cottage to plunge them deeper into relegation trouble.",
        "The visitors were overrun before the break by Marco Silva's side, with Leicester - porous and disorganised in defence - allowing Fulham to rip into them and build a three-goal lead by half-time.Willian and Tom Cairney both hit braces either side of the interval whilst Carlos Vinicius also netted to affirm the home side's dominance, with two second-half goals from Harvey Barnes and a James Maddison penalty lending a respectability to the score that did not reflect Leicester's frailties.It leaves Smith's side in serious danger of being relegated from the Premier League with three games remaining, and he said: 'The game was lost in the first-half.'The performance in the first-half was nowhere near what it has been and what the players can produce.",
        "'I'm disappointed because I didn't see that coming. We'd had a good week in training, good attitude, good application, good quality.'I expected a far better performance and a better start to the game than we got. At this level, if you give the kind of goals away that we gave away it's going to be an uphill battle.'I don't like basketball games, I don't think it suits us given the fact we haven't kept a clean sheet for so long.'The first goal was really disappointing, a soft free-kick and it goes straight in. From there you could see the buoyancy in their players.",
        "'It was far too easy to get into our penalty box and create chances. We were quite happy to get in at half time to try and stem the flow.'I wasn't happy (at half-time), the players weren't happy with their performance as well. We started the second-half better, had a chance early on then got done on the counter-attack ourselves.'It ended a three-game unbeaten run for Leicester which had seen them rise to 16th, but with only a point separating four threatened sides at the start of play the Foxes could ill afford to make the kind of start the travelling fans witnessed.Their woeful first half means no amount of effort after the break was likely to rescue the game, though the team did at least make a fight of the final 10 minutes with two late goals.",
        "By then they already trailed 5-1, and now face an uphill struggle in their final three games against Liverpool, Newcastle and West Ham if they are to avoid dropping into the Sky Bet Championship for the first time since 2014.",
        "'We had a reaction (in the second half), said Smith. 'We got some chances, had two penalties, we've scored three goals. I think we've had more shots than Fulham today, but the first half is what's killed the game.",
        "'I was certainly very worried in the first half today. It got better in the second half. That's the first time I've seen (a lack of fight) with these players. I hope I don't see that again and I'm sure I won't.'I can't talk for the players but what I saw on the training ground this week, I thought we would be ready for this game. But the game was never going to be a given, any game in the Premier League is tough.'I believe there is (enough quality to survive). There are signs I had seen prior to the first half today that they're good enough. The first half certainly was a step backwards, the second half was a step forwards again. We have to make sure we put in a 90-minute performance next week.'Fulham boss Silva felt the two-goal margin of victory for his side did not represent the gulf in class between the teams.'We were the best team on the pitch, no doubt about it,' he said. 'We should have won this game much more comfortably. Great moments of football, great goals. From the first minute we were the team that started to command.'We started really intensely with desire, the will and quality to play. The dynamic we played in the first half and beginning of the second, I was really pleased to see it, the way the players expressed themselves on the pitch.'"
    ]
}