{
    "articleURL": "/tvshowbiz/article-12053005/Nonbinary-activist-Deni-Todorovi-dropped-manager-amid-scandal.html",
    "content": [
        "Nonbinary activist Deni Todorović split from their high-profile manager Pru Corrigan the same day they goaded brands to drop them over a shocking admission that they use cocaine. ",
        "The 35-year-old, who uses they/them pronouns, admitted they 'love a line of cocaine' and invited brands to drop them if they disagreed last Friday.Just hours later, Corrigan, who founded PR consultancy group One Day Dream, announced she had parted ways with the influencer as a client. 'I am no longer behind the wheel of Deni's car,' Corrigan said in a message posted to Instagram.'It's with mixed emotions that I say goodbye to this time in my life. I am very grateful for the time we shared as partners but like everything else - the show much go on.'",
        "Daily Mail Australia has reached out to Todorović for comment. It comes after the fashionista announced they take cocaine recreationally and won't apologise for it. The stylist dared luxury brands to drop them if they have a problem with their admission before calling for the decriminalisation of drugs. Todorović, who controversially partnered with swimwear brand Seafolly earlier this year, shared their thoughts on illegal substances in an Instagram post last week.",
        "They said they are 'partial to a line or two [of cocaine] just like every AFL footy player who does it behind the world's back'. Todorović went on to extol the virtues of drug legalisation - noting how the policy has reduced crime rates in countries like Portugal - then challenged 'any of the brands I work with' to nix their deals with them if that 'doesn't align with your ethos'.",
        "Just a few weeks prior, Australian swimwear brand Seafolly distanced themselves from the non-binary activist after a photoshoot which left consumers divided. At the time, some feminist critics said that having a nonbinary biological male promote women's swimwear was 'erasing women', and noted the unfortunate proximity of the Seafolly campaign to International Women's Day.",
        "Writer Alexandra Marshall was one of those who had spoken out against brand's partnership with Todorovič, saying the swimwear brand was 'mocking women' and said she would boycott Seafolly.'Bye @seafolly. Never again. Been buying swimsuits from you for many years. Never again,' she posted on Twitter.A source with knowledge of the situation said: 'Seafolly will never work with Deni again. They said, in so many words, that Deni is a liability to the brand and alienating customers. There were even talks of financiers withdrawing investment.'Seafolly issued a public statement at the time of the scandal, insisting that they are 'supportive of all women' and that supermodel Joanna Halpin was always their official ambassador, not Deni. Since the scandal, the once-celebrated swimwear brand has been put up for sale less than three years after it was saved from administration."
    ]
}