{
    "articleURL": "/sport/afl/article-12049415/Footy-fans-slam-new-AFL-23-video-game-thats-awful-gone-viral-wrong-reasons.html",
    "content": [
        "AFL 23 has launched for PS5 and PC It is a broken, bug-filled mess Fans who paid full price share the litany of glitches Aussie Rules fans eagerly awaiting the latest video game to hit the shelves have been warned: the latest instalment is more of a broken mess than the North Melbourne defensive line.",
        "AFL 23 hit the shelves for PlayStation and PC on Thursday, with the Xbox version delayed until June. Footy fans who pre-ordered or paid a premium price to snap up a copy on launch day were left more disappointed than your average Brisbane Bears supporter in the 1990s.They claim what Big Ant Studios delivered was broken, incomplete and effectively unplayable.",
        "The character models are nothing like the real thing, with the representation of Western Bulldogs coach Luke Beveridge copping plenty of ridicule online.It is possible to simply run and bounce your way from goal square to goal square and kick a major completely uncontested - even on the hardest difficulty level.Want to use the build a stadium mode? You'll have the interchange bench placed in the centre bounce circle.Hilariously, footage has emerged of players spilling a simple catch only for the ball to cannon 70 metres upfield and over the sideline off their arms.The career mode has been downsized while the Pro Team mode, modelled after the popular FIFA Ultimate Team mode with trading cards, is missing completely. The fan reaction has been swift and severe. 'That's a $100 game if ever I saw one!' one fan mocked.'I can't believe I paid full price for this game,' posted another.",
        "'Genuinely don't understand how the game shipped in this state,' another wondered. Two separate day one patches appear to have done little to fix the mess.",
        "The issues are so bad that even the AFL itself has made a statement.'The AFL and Big Ant Studios are aware of issues on launch of #AFL23 on Thursday,' its statement read.'Patches in the first 24 hours have addressed gameplay and stability issues, while other missing features will be re-introduced over the coming days to ensure the best experience.'The game was developed by Big Ant Studios, the small Melbourne company behind AFL Live back in 2011, Rugby League Live in 2010 and Don Bradman Cricket 17 in 2017 amongst other titles.While AFL might be a huge deal in Australia, the domestic market is just a drop in the ocean compared to Asia, America and Europe  - meaning you really can't compare AFL and rugby league video games to juggernaut titles like FIFA and Madden. As of 2021, the globally acclaimed FIFA series had sold over 325 million copies while publisher EA Games reported that FIFA 23 sales are up 10 per cent the previous year's game.The Madden series by the same publisher and carrying the name of NFL legend John Madden has made over $4billion since it debuted - $600million annually.",
        "By contrast, the most recent Aussie Rules game, AFL Evolution, sold just 18,541 units in 2017.That meant that expectations were pretty low for AFL 23, but even they were not met. ",
        "The game includes the licences for all 18 current AFL franchises, including all players and stats.There is an impressive range of guernseys to choose from including retro options - you can even play in the infamous Carlton M&amp;M's strip.Little details will impress AFL fans, like Big Ant including the Collingwood banner with the misspelling of 'tonihgt'.The new goal-kicking mechanics are a dramatic improvement on previous games, allowing you to choose your style of kick while battling conditions like the wind off a two-step run up."
    ]
}