{
    "articleURL": "/femail/article-12043165/AMANDA-PLATELL-wish-hadnt-thrown-cheating-husband-watching-new-Fatal-Attraction.html",
    "content": [
        "When I watched it, it all came rushing back in a flood of painful memories that took me by surprise after so many years READ MORE: Is it ever right to keep an engagement ring after a break-upThe memory is etched in my mind for ever. It was the summer of 1988, around 10pm.I was a junior newspaper executive - complete with huge 1980s hair, a power suit and permanent exhaustion - when a friend appeared. I was desperate for the paper to go to press, so I could head home to my gorgeous husband of four years.To my surprise, the friend gave me a huge hug and said, 'Poor you, no wonder you're devastated after what you're going through . . .' She added that she was glad I finally 'knew'. 'Knew what?' I asked.'That your husband is having an affair. Everyone knows.'Well, I didn't until that moment. And it felt as if she'd unloaded both barrels of a sawn-off shotgun into my gut. After something terrible happening to their children, betrayal is many women's greatest fear.Whether personally or through friends, we have all experienced the fallout: the grief, anxiety, panic attacks, sleepless nights, lack of self-confidence, weight loss, depression and, all too frequently, the self-medicating, before realising peace is not found at the bottom of a bottle of Chablis.",
        "I was reminded of all this heartache as I watched a sneak preview of the new TV remake of 1980s blockbuster Fatal Attraction, which originally starred Michael Douglas as a cheating husband and Glenn Close as his obsessive, bunny-boiling mistress.It all came rushing back in a flood of painful memories that took me by surprise after so many years.The TV series largely follows the same plot as the film: an adorable and loving mother is blindsided by her hot husband's affair with a predatory career mistress, and chaos and heartbreak ensues.The subject is as relevant today as it was when the film came out in 1987. People still cheat and infidelity still hurts like hell.The major difference, it seems to me, is how the wronged party responds to that betrayal.Back in the late 1980s, I did what most empowered professional women, consumed with pain but hanging on to their dignity and pride, would do. I plotted my cool, calm, collected revenge.Doing anything else would have marked me as a simpering doormat of a housewife — like Anne Archer, who plays Michael Douglas's wife in the film and ends up taking him back.After my husband admitted his affair, like Douglas, he claimed it was just a moment of madness.In our case, though, it was many months of madness, to which I had been completely oblivious. Silently raging, I suggested he went away for a few days to think it over.",
        "I packed his bag and had already called a locksmith to change the locks by the time his cab pulled away.I can remember him trying desperately to get his key into the front door when he returned. He called out for me to let him in, pleading for a second chance. He pleaded for a second chance. I poured myself another whisky  I simply poured myself another glass of whisky, having already employed a high-end divorce lawyer and closed our joint bank account.That's what strong women of my generation did. We were bold, we were uncompromising. Back then, we all believed an affair was marriage-ending.But were we right, or even wise, in taking that decision, when so much was at stake? Should an affair inevitably end a marriage?Looking back more than three decades on, I wish my reaction hadn't been so vengeful.I wish I had tried to remember the joyful day we wed, how much we loved each other. How, as my long gossamer bride's veil wafted up into the blue sky in a gust of wind, I took it as a blessing from the heavens for a long and happy life together.Had I been able to see in shades of grey rather than black and white, I might have responded differently. And I would not have changed the locks.Because, over the ensuing years, I have observed a collective shift in women's attitude to affairs.I know several, all with great careers, who discovered their husband was cheating.After hurling abuse and any convenient object at them, they sat down and thought, 'I do have a choice here. This is not out of my control.' One asked me: 'Do I really want to give up all the goodies and happiness of a 20-year marriage and a family, a lifetime of love, to some interloper?' I threw a divorce party that felt like a funeral. But now friends stick it out – and see off the mistress  Another even admitted her part in the breakdown of the marriage. She hadn't had sex with her husband for months, was so busy with kids and career that she had stopped seeing him as a man - he was just the irritating guy who left the lid off the toothpaste, dropped his clothes on the floor and forgot to put the rubbish out.That's what got me wondering if my pride had got in the way of a possible reconciliation. I had long been deaf to my husband's pleas that my working around the clock made him feel abandoned, unheard and unseen. His adoring mistress, he later admitted, made him feel validated, like a man again.",
        "Maybe I should have noticed he was working late a lot, often came home the worse for wear, wanted to take a shower the moment he came in.Then there was the lacklustre intimacy - there was hardly a hug between us, a kiss on the cheek and not the lips.My husband said the affair was 'a cry for help'. All I remember is me doing the crying, alone in our tiny flat, still awake at 4am, my mind flooded with images of them together, Abba's The Winner Takes It All playing on a loop in my mind: 'But tell me, does she kiss like I used to kiss you?' And a coldness in my heart that was almost suffocating — because I still loved him.I'm not ashamed to admit that when I discovered the affair, such was my fury that, provided I didn't go to prison, I would have gladly shot his mistress dead — as happens in the original Fatal Attraction. After all, she had blasted my marriage to smithereens.When I made the decision to end our marriage, I should have felt triumphant. Yet my 'divorce party' with the sisterhood was utterly soulless, more like a funeral than a celebration — which of course it was; the burial of love.",
        "Ironically, the year before, my husband and I had gone to see Fatal Attraction. It was a box office sensation, earning multiple Oscar nominations, and I remember even feeling smug that this could never happen to us. He said it was a cry for help - but I did all the crying  The film was attacked by feminists including Susan Faludi, who saw it as pitting women against women -  demonising single, successful career women like Glenn Close's character while lionising the stay-at-home, married mum. They sided with the career woman, rather than the housewife.Maybe Faludi missed the scenes in which Glenn Close's femme fatale stalks her lover of two days, pours acid on his car, slashes her wrists in an effort to keep him, kidnaps his daughter, claims to have accidentally fallen pregnant (the oldest so-not-feminist trick in the book), breaks into the family home to boil their daughter's pet bunny and tries to stab his wife to death in the bath.At the time, everyone took sides. But now, as the new version is released, women find themselves in a different place.What we have learnt is that it takes not three but just two to end a marriage, when partners stop seeing and nurturing each other. (Guilty as charged.)My relationship with my ex-husband had been a classic case of mutual love at first sight. We were both in our mid 20s, our eyes met across a smoke-filled journalists' bar and we just clicked. No, we both actually swooned.",
        "But over time I did start to take him for granted. Whatever possessed me to think that a hot young guy would be happy for me to work non-stop and arrive home exhausted when his mistress, with her little job, could be at the bar by 6pm, all doe-eyed and adoring?I have come to see that we stilettoed warrior women of the Eighties weren't as strong as we seemed (and believed ourselves) to be. Every day we put on our armour to present an impenetrable front to the world, to be perfect, impervious. 'Weakness' of any sort — a tear in the eye — was considered career-ending.Beneath it all, though, we were just as vulnerable as any young woman in previous decades navigating her way in a male-dominated world.It took me six months to tell my parents that my marriage had broken down.Such was the shame, my Catholic mum swore me to secrecy when I went back to Australia. I was the first Platell ever to get divorced.I contrast my experience with that of female friends who stuck it out with a cheating husband. They are still bruised by the betrayal but genuinely happy they stayed the distance and, as one said, 'saw off the mistress trying to steal my life'.Another, after her husband left to live with his mistress, pursued a calm, calculated strategy. When they met to hand over the children, she was charming, smiling, looking casually gorgeous and glad to see him. No accusations, no tantrums, no rush for the divorce lawyers. She then had an affair with her own husband behind his mistress's back — and within six months he was back with his wife and children.Now, these are not decisions many betrayed women would or could pursue, but at least today's wronged wives find it easier to see they have a choice. In the end we're all the same. We all have hearts that can be broken . . . but they can also be mended.In fact, I would argue that thanks to feminism, women are now more likely to stay with their man and try to work it out. We no longer see ourselves as powerless in deciding the fate of our marriages, our children's happiness, our own future.As for my marriage, after a very bitter divorce, we saw each other a couple of times but it was too painful for us both. He moved abroad; I met a lovely man, got engaged and moved on.I have never set eyes on my ex-husband since. We had an email exchange a couple of years ago in which I said it wasn't just him, it was me too who broke our marriage. We put some pain to rest, we forgave each other.We both turned out to be very different people from the ones we thought we'd married. Ultimately, divorce was the best outcome for both of us. Yet the pain of recalling all this has caught me off guard. I had to stop halfway through writing this article; the memories went so deep, I felt I was suffocating in them.I was genuinely surprised to find that after more than three decades, those first blissful years still hold some magic for me. I thought I'd packed them away long ago, along with my wedding dress and the long gossamer veil."
    ]
}