{
    "articleURL": "/news/article-12047997/Bombshell-letter-supports-Menendez-brothers-claim-sexual-abuse.html",
    "content": [
        "Attorneys for Menendez brothers file petition seeking their immediate releaseCite letter by Erik appearing to reference sexual abuse by their father JoseDefense argued at trial that the 1989 killings were a case of manslaughterAttorneys for convicted killers Erik and Lyle Menendez have filed a petition seeking their release from prison, citing newly discovered evidence that supports their claims of sexual abuse by their father.",
        "The Menendez brothers are serving life sentences without the possibility of parole after being convicted of first-degree murder for fatally shooting their parents Jose and Kitty Menendez in 1989 in their Beverly Hills mansion.At trial, they admitted to the shooting, but claimed the killings followed years of sexual abuse and sought a lesser charge of manslaughter, which the trial judge did not allow the jury to consider.The brothers' attorneys filed a petition in Los Angeles County court on Wednesday with newly discovered evidence in the form of a letter Erik sent his cousin Andy Cano about eight months before the killings, seeming to support the abuse claims.'I’ve been trying to avoid dad. It’s still happening Andy but it’s worse for me now. I can’t explain it. He so overweight that I can’t stand to see him,' the chilling, hand-scrawled letter reads.",
        "The letter continues: 'I never know when when it’s going to happen and it’s driving me crazy. Every night, I stay up thinking he might to come in. I need to put it out of my mind. 'I know what you said before but I’m afraid. You just don’t know dad like I do. He’s crazy! he’s warned me a hundred times about telling anyone especially Lyle.'The petition for writ of habeas corpus filed by the Menendez brothers' attorneys, Mark Geragos and Cliff Gardner, asks the court to vacate their convictions.",
        "The petition argues the newly discovered letter could have changed the outcome of their second trial, after the first one resulted in a hung jury.'The theory of defense at both trials was straightforward. Neither Erik nor Lyle denied the shooting. Instead, the crime was manslaughter, not murder. The killings occurred in imperfect self-defense, after a lifetime of physical and sexual abuse from their parents,' the petition states.'The state’s theory in both trials was also straightforward. Erik and Lyle were lying about the sexual abuse. It never happened. They had killed their parents not in imperfect self-defense, but to inherit their parents’ money,' the filing continues.'Had jurors seen the letter Erik Menendez wrote to Andy Cano, and learned that Jose Menendez anally raped and orally copulated a 13 or 14 year-old boy in 1984, the prosecutor would not have been able to argue that “the abuse never happened,”' the attorneys argued.",
        "At the first trial in 1993, Cano testified that when Erik was 13, Erik came to him and told him that his father Jose was touching and 'massaging' his genitals, asking if that was normal. Cano testified that, when he proposed asking his own mother about the situation, Erik swore him to secrecy and insisted he not tell anyone about the alleged sexual abuse.  ",
        "At the second trial, testimony related to the abuse allegations was sharply limited by the judge, and prosecutors flatly told the jury that the allegations were a 'total fabrication'. Cano died of a drug overdose in 2003. The 1989 letter he received from Erik was given by his mother to a journalist in 2018, who passed it to the brothers' former counsel before it reached his current attorneys, according to the petition. The petition also cites new evidence that emerged in a new documentary on the case, titled Menendez + Menudo: Boys Betrayed, airing on Peacock.In the documentary, former boy band member Roy Rossello describes an incident of sexual abuse at the hands of Jose Menendez, who was the president of RCA Records when the label signed the band, Menudo.In a declaration attached to the petition, Rossello said that Jose Menendez had anally raped him twice, and orally copulated with him, when he was 13 or 14.'In short the new evidence not only shows that Jose Menendez was very much a violent and brutal man who would sexually abuse children, but it strongly suggests that -- in fact -- he was still abusing Erik Menendez as late as December 1988. Just as the defense had argued all along,' the petition states.",
        "The Los Angeles County District Attorney’s Office, which prosecuted the cases in the 1990s, did not immediately respond to a request for comment by DailyMail.com. ",
        "The brother's murder convictions captured the nation at the time of the slayings, because they appeared to be a family of great affluence and wealth.Lyle, who was 22 at the time, had been attending Princeton, while Erik was a professional tennis player, and was 19 when his parents were killed.On August 20, 1989 the brothers walked into the den of their parent's $5 million Beverly Hills mansion and shot Jose point blank in the back of the head, then shot Kitty in the leg as she tried to run out of the room.Jose was shot five times, and Kitty nine. Initially police believed that the mob was behind the slayings, only arresting the siblings a year later, after they went on a wild spending spree with their multi-million inheritance.The brothers argued at trial that they were driven to murder their father and mother after a lifetime of physical, emotional, and sexual abuse, and their father had threatened to kill them if they did not keep the abuse a secret.Erik said that he was sodomized by his father for the first time when he was six-years-old, and Lyle testified that Jose also made him molest his own brother when they were children.",
        "During their first trial the brothers claimed that they confronted their father about the alleged crimes, and he became enraged – forcing them to kill out of concern for their safety.The trials were some of the first to be aired on television, with some jurors in the first trial believing their testimony of abuse. The juries in the first trial deadlocked after the votes split on conviction for manslaughter or murder.",
        "However in the trial in which the brothers were convicted, the judge banned cameras, restricted witnesses testimony relating to the abuse, and restricted the jury to deciding on a verdict of first-degree murder.Both brothers were unable to name any other witnesses or victims of their father during the trial, with Judge Stanley Weisberg ruling that it was not admissible.A criminal defense lawyer told the Peacock documentary that the allegations made by Rossello have given the brothers a 'glimmer of hope' that it could make a difference in their case.Both Erik and Lyle are heard on the documentary discussing how the new evidence found could have made an 'enormous difference' at their trials.Erik said: 'Frankly I feel horrible. It's sad to know that there was another victim of my father.'I always hoped and believed that one day the truth about my dad would come out but I never wished for it to come out like this, the result of trauma that another child has suffered and it makes me very sad. '"
    ]
}