{
    "articleURL": "/news/article-12046811/Is-Tesco-open-Coronation-bank-holiday-Opening-times-revealed.html",
    "content": [
        " MailOnline reveals Tesco opening times for coronation weekend, bank holidayAhead of King Charles' coronation, supermarket giant Tesco has revealed its opening hours for the upcoming Bank Holiday. ",
        "Different opening hours may be in place at your local Tesco store, depending upon its size and location. It is the second Bank Holiday to fall in May 2023, after the traditional early May Bank Holiday on 1 May. So, will Tesco be open on coronation day? Will hours change due to the occurrence of another Bank Holiday? Read on below for everything you need to know about Tesco opening times over the coronation weekend. ",
        "Will Tesco be open on coronation day?On the day of the coronation, Tesco's larger stores will open at either 6am or 7am and close at either 10pm or 11pm.On Sunday, Tesco stores in England and Wales will operate between the hours of 10am and 4pm.However, Tesco stores in Scotland will be open between 8am and 8pm, with operating until 10pm on Sunday.Does Tesco open on bank holidays? On the Bank Holiday, Monday 8 May, the majority of larger Tesco stores will open from 8am to 6pm - but some may be open until 8pm. This includes stores in Scotland.Meanwhile, the brand's Express stores will also be open as normal, opening at 6am or 7am and closing between 10pm and 11pm.You can find your nearest Tesco with the supermarket's store locator.The move by Tesco follows that of other supermarkets and shops in the UK, which have altered their opening hours to give staff a well-deserved break. ",
        "How do I get a Tesco discount? Martin Lewis has shared his latest supermarket hack which could see you get £5 off your next Tesco order if you are shopping online. ",
        "By using the code GR4PYL at checkout - if you're doing your shopping online - you could get 'five pounds off when you spend 15 quid or more on selected frozen food'.'There are 150 eligible items including Birds Eye fish fingers, Goodfella's pizzas, McCain jacket potatoes and Aunt Bessie's Yorkshires,' he explained.Customers can also obtain discounts at Tesco through signing up to its popular Clubcard scheme, which currently has 21 million members and offers discounts on more than 8,000 products. Tesco Clubcard holders can also collect points for money spent in store or online, which can be converted into vouchers to spend in store or at one of its partners such as Virgin Atlantic and Café Rouge. However, the value of points is dropping from 14 June."
    ]
}