{
    "articleURL": "/tvshowbiz/article-12049251/Jennifer-Lopez-vision-elegance-classic-black-dress-Mother-Tastemaker-event.html",
    "content": [
        "She has been serving look after look as she promotes her upcoming action film The Mother.",
        "And Jennifer Lopez pulled out another stunning ensemble as she attended an event in promotion of the Netflix flick on Thursday. The Jenny From The Block hitmaker, 53, wowed in a classic black dress with dazzling, snake-like necklace at The Mother Tastemaker event, held at The Whitby Hotel in New York. The Bronx, New York native matched that design around the neck perfectly with a pair of strappy heels that wrapped around her ankles.She accessorized with a silver-looking bracelet that would also be in line with the style of the entire ensemble, along with a black clutch purse.",
        "Rounding out her overall look, Lopez opted to wear her lightened locks with a healthy dose of volume, allowing her tresses to fall down over her chest and to the middle of her back with a center part.JLo plays a former assassin who reappears after years of hiding out in the Alaskan wilderness to rescue her estranged daughter.She was joined on the red carpet by Lucy Paez, the actress who plays her daughter in the flick.The duo also posed with several members of The Mother team, director Niki Caro and executive producer Elaine Goldsmith-Thomas.The group also appeared inside, where Jennifer delighted attendees with a few remarks.Also in attendance was RHONJ legend Melissa Gorga and her husband Joe Gorga.",
        "Melissa wowed in a hot pink suit dress that tied into her waist. She slipped her feet into strappy metallic heels.Her husband opted for a purple blazer, black trousers, and chain necklace.",
        "It has been quite the day for JLo's new film.  Netflix also held a special screening of the action drama at the Paris Theater, which is an old art house movie theater situated in Midtown Manhattan that opened back in 1948.Jennifer was seen posing outside the theatre in the same elegant look.  Getting a lay of the land ahead of time, Lopez took a stroll inside and outside the venue, while also striking a number of poses for admiring photographers on the scene.While outside checking out the marquee, Lopez looked to be impressed by the vintage touches of the 535-seat single-screen theater. ",
        "Being the longtime professional of the moviemaking machine, the actress, singer and dancer slipped in a few more poses for the photographers before moving on inside again.Lopez was also seen coming out from The Whitby Hotel earlier in the evening and heading to The Mother premiere as it got closer to showtime for the screening.While making her way out of the exit doors, the fashionista was wearing a long black overcoat over her elegant dress, as a man, who appeared to be working as security, followed close behind. ",
        "Once back outside the Paris Theater more fans had gathered outside of the gates that had been erected along the sidewalk and into the street.The Paris Theater has been operated by Netflix since November 2019, playing first-run releases alongside repertory programming.Directed by Niki Caro from a screenplay by Misha Green, Andrea Berloff and Peter Craig, the action drama is set for release on Netflix on May 12, two days before Mother's Day. ",
        "Along with Lopez, the cast also includes Joseph Fiennes, Omari Hardwick, Gael García Bernal, Paul Raci, Lucy Paez, Jesse Garcia and Yvonne Senat Jones.The other new film Lopez has been working on of late is the science fiction thriller Atlas, that's also a Netflix production.Directed by Brad Peyton from a screenplay by Leo Sardarian and Aron Eli Coleite, the story follows Atlas, a military intelligence officer who has spent years pursuing intergalactic terrorist Harlan, who murdered her family during an attack on her agency’s headquarters on Earth, as reported by What's On Netflix.",
        "While out in space to oversee a mission to capture Harlan, battles erupt that lead to a fight to the death, all while Atlas tries to figure out an AI driven mechanical armored suit that's more than meets the eye.Along with Lopez the cast also includes such stars as Simu Liu, Sterling K. Brown, Abraham Popoola and Lana Parrilla.",
        "Peyton's Hollywood resume as a director includes such films as Journey 2: The Mysterious Island (2012), San Andreas (2015), and Rampage (2017), which all star Dwayne 'The Rock' Johnson in the lead role.Atlas is expected to make its premiere on Netflix sometime in late 2023. "
    ]
}