{
    "articleURL": "/tvshowbiz/article-12043615/Justin-Bieber-looks-cool-baggy-jeans-navy-sweatshirt-steps-Los-Angeles.html",
    "content": [
        "Justin Bieber was spotted on the move in Los Angeles on Wednesday morning.",
        "The 29-year-old pop sensation - who was recently seen dancing at Coachella - was casually dressed in baggy light wash jeans, a white tank top, and a navy blue zip-up hoodie.The Canadian music artist wore the sweatshirt unzipped, flashing his many chest tattoos in his scoop neck shirt.Justin, who is married to supermodel Hailey Bieber, finished the look with a pair of gray and white New Balance sneakers.He sported a shadow of a beard and wore his hair in a neat, short cut while out and about in SoCal.",
        "Justin, who was mentored by Usher during his career, carried his phone in-hand as he made his way to his car.It comes after days earlier the devoted husband was with his entrepreneur wife at a work event for her brand.The duo went to coffee shop Community Goods, where fans had a chance to win Hailey's Rhode skincare products.The founder and creative director flaunted her toned tummy in a short-sleeved white crop top and both stars wore light-colored jeans.The Sorry hitmaker announced in June 2022 that he was diagnosed with Ramsay Hunt Syndrome, a rare version of shingles that can cause hearing loss and facial paralysis.Bieber postponed his tour last year, with hopes of getting back on the road in 2023, though he announced in April that the rest of the shows were canceled.",
        "DailyMail.com learned that the singer's doctors 'forced' him to cancel the show while his wife Hailey and his family were worried about his health.Recently, the star has shown progress in beating his facial paralysis as he has been able to flash his bright smile.",
        "Bieber hasn't shared any recent updates on his health, though it seems he has come a long way since he first revealed his diagnosis last June.Last year he shared a video where he explained his diagnosis, which occurs when 'a shingles outbreak affects the facial nerve near one of your ears.'The syndrome causes facial paralysis and hearing loss, which in most cases is temporary but can be permanent if not treated quickly.'Obviously, as you can probably see with my face, I have this syndrome called Ramsay Hunt syndrome and it is from this virus that attacks the nerves in my ear and my facial nerves and has caused my face to have paralysis,' Bieber explained in a June 2022 video.Justin later posted an update on his Instagram Story, stating, 'Been getting progressively harder to eat which has been extremely frustrating, please pray for me,' with a teary emoji.'Can't believe I'm saying this. I've done everything to get better but my sickness is getting worse,' he wrote in another post.",
        "'My heart breaks that I will have to postpone these next few shows (doctors orders). To all my people, I love you so much and I'm gonna rest and get better.'He posted another clip showing the devastating effects of his diagnosis as he demonstrated that his eye wasn't blinking, he couldn't smile, and one nostril would not move on the right side of his face.",
        "In March sources close to the singer told DailyMail.com that his team of doctors 'forced' him to cancel the tour.According to the source, 'He feels horrible about it. He is aware that this impacts so many people who really on him and he is committed to making sure that they are all okay.'And it's not only Justin's doctors who have expressed concern; his wife Hailey, 26, family and friends have all been 'worried' about his declining health, the insider added.'For so many years, Justin felt like he was invincible and that nothing could hurt him. But after getting sick with Ramsay Hunt, it became so clear to him that he is not,' the source shared."
    ]
}