{
    "articleURL": "/wires/reuters/article-12060417/Motor-racing-Leclerc-says-Ferrari-struggling-like-crazy-car.html",
    "content": [
        "May 8 (Reuters) - Ferrari are struggling with an inconsistent car that is competitive in qualifying but off pace in the race, Charles Leclerc and Carlos Sainz said after a difficult Miami Grand Prix.",
        "The Italian team's next outing is a home one at Imola and fans will be apprehensive after a weekend that delivered far less than hoped for.Sainz finished fifth and Leclerc seventh in Miami as Max Verstappen led Sergio Perez to Red Bull's fifth win in five races and fourth one-two.\"(It's a) very similar picture to the beginning of the year, we are competitive in qualifying (but) once we come to race day we are struggling like crazy,\" said Leclerc, who had been on pole position at the previous race in Azerbaijan.He had finished second in the sprint in Baku, raising hopes that Ferrari had made a step forward, and a lonely third in the Sunday race.\"The (performance) window of our car is so narrow and whenever you get a little bit out (of it), it has huge consequences on the balance,\" added the Monegasque.\"It´s from one corner to the other, and even in one corner, sometimes you can have huge understeer, which goes to huge oversteer, and this is obviously not ideal to have confidence in the car.\"Leclerc crashed in both practice and qualifying, when he looked competitive, at the same corner in Miami and said he had struggled with the car bottoming at speed and also affected by the wind.",
        "Sainz started third on the grid on medium tyres but a switch to hard tyres changed everything, with the Spaniard finishing 42.5 seconds behind double world champion Verstappen -- who had lined up ninth.\"It´s a very inconsistent car, it´s very peaky. You´re driving properly on the limit or on a knife edge and this means that in the race we´re paying the price,\" he said.Team boss Fred Vasseur recognised both had found the car hard to drive.\"Finding some consistency in the car´s performance has to be our number one priority, especially in terms of tyre management, so that the confidence the drivers have in qualifying can be replicated in the race,\" he said.Leclerc was Verstappen's closest rival last season, winning two of the first three races before the challenge petered out in strategy errors, unreliability and driver mistakes. (Reporting by Alan Baldwin in London, editing by Toby Davis)"
    ]
}