{
    "articleURL": "/wires/reuters/article-12046067/Rohingya-refugees-Bangladesh-make-Myanmar-visit.html",
    "content": [
        "By Sudipto Ganguly and Ruma Paul",
        "DHAKA, May 4 (Reuters) - Twenty Rohingya Muslim refugees and some Bangladeshi officials will visit Myanmar's Rakhine State on Friday as part of an effort to encourage their voluntary repatriation, a Bangladeshi government official told Reuters.Nearly one million Rohingya Muslims are living in camps in the Bangladeshi border district of Cox's Bazar, most after fleeing from a military-led crackdown in Buddhist-majority Myanmar in 2017.The day trip to Myanmar was a \"go and see\" visit for the refugees, said Mohammed Mizanur Rahman, Bangladesh's refugee relief and repatriation commissioner in Cox's Bazar.\"We want to show them the arrangements being done for their repatriation,\" Rahman said by telephone.\"We want to build their confidence in the repatriation process and ensure voluntary participation ... Bangladesh has always spoken about their dignified and sustainable repatriation and this is an effort towards that.\"Bangladeshi officials have made several trips to Myanmar as part of efforts to get repatriation going, this will be the first by Rohingya refugees since 2017.A Myanmar junta spokesman did not answer calls seeking comment. The U.N. refugee agency did not immediately respond to a request for comment.Myanmar's military had until recently shown little inclination to take back any Rohingya, who have for years been regarded as foreign interlopers in Myanmar and denied citizenship and subjected to abuse.",
        "A Myanmar delegation, however, visited the camps in March to verify a few hundred returnees for a pilot repatriation project.A Bangladesh official said the project would involve about 1,100 refugees but no date had been set. Attempts to get repatriation going in 2018 and 2019 failed as the refugees, fearing violence, refused to go back.One refugee who will be among the 20 on the visit said people wanted to go home with \"all our rights and security\".\"This visit will be helpful. We can at least see what they've done for us,\" said the refugee, who declined to be identified. (Reporting by Sudipto Ganguly in Mumbai and Ruma Paul; Editing by Krishna N. Das and Robert Birsel)"
    ]
}