{
    "articleURL": "/news/article-12056335/Mother-left-unable-walk-brain-aneurysm-sent-home-E-paracetamol.html",
    "content": [
        "Moji Akinremi, 65, has been in hospital for eight weeks since the aneurysm A mother has been left unable to walk due to a brain aneurysm after she was sent home from A&amp;E with paracetamol. ",
        "Moji Akinremi, 65, of Newham, has been in hospital for eight weeks, while her family question whether the brain damage would be as great had doctors acted sooner. She first experienced back pain and headaches in early February that persisted for several weeks until the pain became unbearable. According to Ms Akinremi's daughter, 40-year-old Kehinde, the mother was taken to A&amp;E by a friend and waited hours to be seen by doctors. 'My mum has always been fit and healthy and has never suffered from underlying conditions,' said Kehinde.",
        "The daughter said they eventually took blood samples but the tests did not show anything, so Ms Akinremi was sent home with paracetamol and referred back to her GP for an X-ray.'I left work to see her as she was already home from A&amp;E,' Kehinde said. 'She was just a bit stiff. That's all I can say. She was still talking, walking well and just laughing and joking as normal.'We told her, ''if you're not feeling well, do let us know''. I was concerned they didn't do a scan at A&amp;E. I was also worried she would have to wait a long time for a GP appointment so we thought about going private.'Kehinde went to see her mother again two days later, and said she was still coping okay with the back pain and headaches. By Saturday things quickly escalated.",
        "'I got another call from my mum's friend to say they were at A&amp;E again,' Kehinde continued. 'She told me the pain had got worse and my mum seemed a bit confused at this point. I went straight to the hospital and said to the doctors ''my mum came in on Tuesday, she was sent home but something is clearly wrong. She's a 65-year-old woman, she has headaches and she's in a lot of pain. Please can you do something?''.'After considerable persistence Kehinde said doctors agreed to do a CT scan.",
        "From this they discovered Ms Akinremi had suffered a bleed on the brain. She was quickly transferred to the Royal London Hospital where further tests showed a ruptured aneurysm. 'They think she'd been suffering with it for three to four weeks,' Kehinde said.'Although she was experiencing headaches, mum was mainly complaining of back pain, so we just assumed it was her back. We didn't know back pain is a symptom of a brain aneurysm. It makes sense now because the spine and brain are connected. But like most people, we didn't know about all the symptoms that can present themselves.'Two days later Ms Akinremi underwent emergency surgery to save her life. But she ended up having two more operations due to multiple complications. These included a secondary brain bleed, seizures and vasospasm. ",
        "She also has post-traumatic Hhydrocephalus - a condition where there is excess fluid on the brain leading to harmful pressure. She has therefore been fitted with a VP shunt in her head to drain the built-up fluid down a tube into her stomach.The impact of the aneurysm has caused Ms Akinremi significant brain damage and disability. She is still bed bound at the Royal London Hospital. She cannot walk and her arms are very shaky. In addition, she has suffered major memory loss.'She knows who my brothers and I are but she can't remember what day it is and sometimes she gets very confused and doesn't know where she is,' Kehinde explained. While they said the care at Royal London has been amazing, Kehinde and her two brothers wonder whether things would be different if doctors had acted sooner.",
        "'That five-day window between our mum's first visit to A&amp;E and her first surgery is critical,' Kehinde said. 'When she first went to A&amp;E she was in a lot of pain but she was much stronger. She had suffered from this brain bleed for weeks but was yet to feel the full impact of it. And then a few days after going to A&amp;E she really deteriorated.'I wish they had scanned her straight away instead of referring her back to the GP. They would have found the aneurysm and, maybe because she was stronger at that point, she wouldn't have had so many complications and as much damage.'",
        "A spokesperson for Barts Health NHS Trust said: 'We continue to provide Ms Akinremi with the best possible care at this difficult time. We take any concerns raised very seriously and will review the care she received at Newham Hospital.'Currently, doctors reportedly do not know if or when Ms Akinremi will regain her mobility and cognitive function. They have applied for her to go to a rehabilitation centre, which will be vital to her recovery, but the waiting list is four to six weeks at least. Kehinde and her family are fundraising to cover the costs of a private unit. They are also hoping to adapt Ms Akinremi's house for post her recovery.'Our mum has always been a fiercely strong independent woman,' Kehinde said. 'When my twin and I were eight and when our brother was a baby, our dad passed away. Mum raised us all on her own after that. So the three of us are trying our best to make sure she's okay and looked after.'She added: 'As well as a specialised rehabilitation centre, we want to ensure our mum has an amazing space to come back to. Before she fell ill, she worked in catering and she loves to cook Nigerian food.'We would like to make the kitchen user-friendly and, if she's in a wheelchair, we plan to install ramps. We also want to build a downstairs bathroom. Our mum was thinking of retiring not long before her illness. So we ultimately want her to enjoy her retirement years and live as independently as she can.'"
    ]
}