{
    "articleURL": "/wires/pa/article-12059763/Rishi-Sunak-Akshata-Murty-don-aprons-surprise-volunteers-lunch-club.html",
    "content": [
        "Diners at a local lunch club in Hertfordshire have said they feel “really fortunate” after a surprise visit by the Prime Minister as part of the Big Help Out.",
        "Local residents, most of them elderly, were served lamb casserole and wine by “very special guests” Rishi Sunak and his wife, Akshata Murty, in the dining room of Mill End Community Centre in Rickmansworth.The Royal Voluntary Service (RVS) runs a lunch club at the centre from Monday to Friday, predominantly for people in the community who are removed from family networks.",
        "Mr Sunak and Ms Murty chopped parsnips and strawberries in the kitchen in black aprons before joining the room in a toast which ended in the group saying “long live the King” and giving three cheers.Across the country people have been encouraged to devote some free time on the Monday of the coronation bank holiday weekend for the Big Help Out, aimed at showcasing volunteering.Diners, who had not been warned about their prestigious helpers, chatted and took selfies with the Prime Minister surrounded by Union flag tablecloths, napkins and helium balloons, and rows of golden paper crowns.Mr Sunak could be heard telling people about a “big street party” he attended yesterday in Downing Street to celebrate the coronation.He chatted with volunteers about how many courses the club usually serves and whether there were any “particular favourites” on the menu.One diner, Val Leach, a former teacher from Rickmansworth, told the PA news agency: “I told him I had been a young Conservative when I was 16 but over the years I lost my way as the party lost its way, but I’m back now.”",
        "With a miniature crown around her neck, the 77-year-old added that she was the proud owner of a bottle of whiskey signed by Margaret Thatcher and David Cameron.Another regular, 89-year-old Peter Worthington, called the Prime Minister “brilliant”.“What a relaxed person,” the former vet said. “He was just like one of the crowd.”“It was a lovely surprise. What you see is what you get. They are natural.“They don’t appear to be career politicians – so refreshing.“We’ve been really fortunate.”Pauline Warren, who has a brain injury and struggles to cook for herself, said she made Mr Sunak laugh.She told PA: “He brought my lunch and put it down in front of me. I said I always vote for people who feed me and he thought that was quite funny.”",
        "Catherine Johnstone, chief executive of RVS and co-creator of the Big Help Out campaign, told PA that the charity runs hundreds of lunch clubs for people in various local communities – catering for the elderly, people with learning disabilities and those with long-term health conditions.Asked about the Prime Minister’s visit, she said: “It was brilliant, absolutely amazing that they took the time to come in.“What was really impressive was that they just wanted to help out.",
        "“They came in, they donned their pinnies, they helped prepare the lunch, served the lunch and then they spent a lot of time with a lot of care talking to the clients that came here.”"
    ]
}