{
    "articleURL": "/sport/formulaone/article-12052247/George-Russell-takes-fastest-lap-Miami-Grand-Prix-practice-teammate-Lewis-Hamilton.html",
    "content": [
        "Russell beat out teammate Lewis Hamilton on his last full lap in practice The proceedings were halted with a red flag after Nico Hulkenberg crashed out DailyMail.com provides all the latest international sports news George Russell was able to knock Mercedes teammate Lewis Hamilton off the top spot by two-tenths of a second to take the fastest lap in the first free practice at the Miami Grand Prix. ",
        "Charles Leclerc of Ferrari finished P3 and three-tenths back of the leader.World champion Max Verstappen ran on the hard compound tires this practice, and finished a whole tenth behind Leclerc to finish P4 - just .424 seconds behind the leaders.P5 and P6 went to Carlos Sainz of Ferrari and Pierre Gasly of Alpine - who were the last two drivers to finish less than a second behind Russell.The two Aston Martins of Fernando Alonso and Lance Stroll, Haas' Nico Hulkenberg, and Alpine's Esteban Ocon rounded out the top ten.",
        "A spin at turn three by Hulkenberg brought out the red flag and stopping the proceedings.The Haas driver was enjoying himself just before the wreck - sitting P2 up until he lost control of his vehicle and collided with the wall in a tight part of the track.He spun and sent debris out onto the road - halting the practice and sending cars back to the pitlane.By the end of practice, Hulkenberg was sitting P9 as he was passed by both Aston Martins, both Ferraris and both of the Mercedes drivers.Last week's race winner in Azerbaijan, Sergio Perez, just missed out on the top ten by just over two hundredths of a second.P12 and P13 went to two cars that set their fastest laps on the medium compound tires: McLaren's Oscar Piastri and Hass' Kevin Magnussen.",
        "Alfa Romeo's Valtteri Bottas ended FP1 tied with Williams' Logan Sargeant for the most laps completed in the session with five. Bottas finished P14.Williams' Alex Albon and McLaren's Lando Norris finished P15 and P16 respectively and were the final two drivers to finish less than two seconds behind the leader.",
        "In P17, Alfa Romeo's Zhou Guanyu was about to join Albon and Norris, but missed out on the under-two minute club by one-hundredth of a second.Behind him finished Alpha Tauri's Yuki Tsunoda in P18 and Sargeant in P19.The American took his first laps at his home circuit in South Florida, putting in five laps but failing to make a crack in the top-ten.In last came Alpha Tauri's Nyck de Vries - who ran one lap on the hard compound tire and finished four-and-a-half seconds behind Russell. "
    ]
}