{
    "articleURL": "/news/article-12056897/Justina-Stubbe-killed-five-injured-drive-shooting-California-house-party.html",
    "content": [
        "The gunman opened fire from a vehicle into a group of people in the parking lot of an apartment complex in Chico, California at about 3:30am. Justina Stubbe, 17, was shot and killed while five others were rushed to hospital The gunman remains on the run while a GoFundMe has been launched to cover Stubbe's funeral expensesA teenage girl is dead and five others have been left injured after a drive-by shooting in Chico, California.",
        "The gunman opened fire from a vehicle into a group of people in the parking lot of an apartment complex at about 3:30am on Saturday morning. Justina Stubbe, 17, was shot and killed while five others were rushed to hospital from the scene.The victims, aged between 17 and 21, had been at a large party earlier in the night in Chico, about 90 miles north of Sacramento.",
        "Chico Police Lt. Terry Tupper said officers were still searching for a motive.'The actual shooting was not random,' he said, though it is unclear whether any of the specific victims were targets. Tributes from family and friends have since poured in for Stubbe.'Justina Stubbe you were just a baby with soo much life left to live. We are all soo sorry this has happened. This has to stop we are losing our babies too fast !!' wrote Clint Lobo, whose son was one of the other victims of the shooting.A close family friend of Stubbe has launched a GoFundMe.'No parent should ever have to go through the pain of out living [sic] their baby,' wrote Jackie Wilson.'Everyone wants to know what they can do to help the family. The only thing right now is donate. Funerals are expensive and it's bad enough this family is grieving.'",
        "Of Sunday afternoon, the fundraiser had $4,565 in donations. Another 17-year-old girl and a 21-year-old man were admitted to a local hospital with non-life threatening injuries while a 19-year-old man is in a stable condition. An 18-year-old man and a 20-year-old man have since been discharged from the hospital.",
        "Police soon deemed the shooting to be an 'isolated incident,' and declared that there is no threat to the community. Investigators are 'aggressively pursuing some substantial leads' in search for a suspect. Police located someone in possession of a firearm and took them into custody in relation to a separate incident that occurred several hours earlier at another house party in the area.A second individual was apprehended at the second party in Chico and was arrested for possession of a firearm and reckless discharge.The mass shooting was the culmination of a hectic night in Chico. Chico Police Chief Bill Aldridge said cops were initially dispatched to the same area just before 3am after a fight broke out when a party guest was asked to leave.'During the fight, two victims were reported to have been assaulted. One was allegedly struck on the head with a firearm and the other was allegedly hit over the head with a glass bottle,' said Aldridge. "
    ]
}