{
    "articleURL": "/wires/ap/article-12043907/Business-Highlights-Federal-Reserve-McDonalds.html",
    "content": [
        "___",
        "Fed raises key rate but hints it may pause amid bank turmoilWASHINGTON (AP) - The Federal Reserve reinforced its fight against high inflation by raising its key interest rate by a quarter-point to the highest level in 16 years. But the Fed also signaled that it may now pause its streak of 10 rate hikes, which have made borrowing for consumers and businesses steadily more expensive. In a statement, the Fed removed a sentence from its previous statement that had said \"some additional\" rate hikes might be needed. It replaced it with language that said it will weigh a range of factors in \"determining the extent\" to which future hikes might be needed.___McDonald´s franchises fined for child labor violationsFederal officials say two 10-year-olds are among the 300 children who worked at a McDonald´s restaurants in Kentucky with no or little pay. The Labor Department says its fining the owners of three Louisville franchises a total of $212,000 following its investigation into wage theft and underage work by minors. One of franchise owners says in a statement that the 10-year-olds were just visiting a parent on the night shift. The agency the owners employed 24 minors under 16 to work more hours than legally permitted. The investigations are part of an ongoing effort by the Labor Department´s Wage and Hour Division to stop child labor abuses in the Southeast region. McDonald´s called the reports unacceptable and deeply troubling.",
        "___Stock market today: Markets slip after latest Fed rate hikeNEW YORK (AP) - Stocks dipped after the Federal Reserve announced its latest hike to interest rates but said it´s not sure what may come next. The S&amp;P 500 fell 0.7% Wednesday after drifting between modest gains and losses immediately after the Fed´s announcement. The Dow Jones Industrial Average fell 0.8% and the Nasdaq lost 0.5%. The Fed´s move, which was widely expected, is meant to slow the economy further in hopes of getting inflation under control. The hope among investors is that this is the final increase for now following the Fed´s fastest series of hikes in decades.___FTC: Facebook misled parents, failed to guard kids´ privacyU.S. regulators say Facebook misled parents and failed to protect the privacy of children using its Messenger Kids app. The Federal Trade Commission says Facebook misrepresented the access it provided to app developers to private user data. As a result, the FTC on Wednesday proposed sweeping changes to a 2020 privacy order with Facebook - now called Meta - that would prohibit it from profiting from data it collects on users under 18. This would include data collected through its virtual-reality products. Meta would also be subject to other limitations, including its use of face-recognition technology and be required to provide additional protections for users.",
        "___Writers strike looks to be a long fight, as Hollywood bracesLOS ANGELES (AP) - It looks likely to be a long grind for Hollywood writers who have gone on strike to preserve pay and hang on to job security. Members of the Writers Guild of America picketed in Los Angeles and New York on Tuesday, a day after their contract expired. The first Hollywood strike in 15 years, brought on by the economic pressures of the streaming era, has already led to most late-night shows going into reruns. Some scripted productions have also pushed pause, and many more could follow if it gets stretched out. With no talks at the moment and none pending, a solution does not appear near.___United plans to hire 15,000, adding to surge in airline jobsThe hiring sign is out at United Airlines. The airline said Wednesday that it plans to add 15,000 workers this year, and hired 7,000 in just the past four months. It´s part of a trend, as airlines benefit from a boom in travel. Airlines are trying to avoid a rerun of last year, when they were caught unprepared for a rapid recovery in air travel. Shortages of pilots and flight attendants contributed to a jump in the rates of canceled and delayed flights. United says it´s got enough pilots to operate its summer schedule.",
        "___Scientists warn of AI dangers but don´t agree on solutionsCAMBRIDGE, Mass. (AP) - Computer scientists who helped build the foundations of today´s artificial intelligence technology are warning of its dangers, but that doesn´t mean they agree on what those dangers are or how to prevent them. After retiring from Google so he could speak more freely, so-called Godfather of AI Geoffrey Hinton outlined his concerns Wednesday at a conference at the Massachusetts Institute of Technology. He voiced doubt about humanity´s survival if machines get smarter than people. Fellow AI pioneer Yoshua Bengio, co-winner with Hinton of the top computer science prize, told The Associated Press on Wednesday that he´s \"pretty much aligned\" with Hinton´s concerns but worries that to simply say \"We´re doomed\" is not going to help.___French constitutional body rejects pension referendum callPARIS (AP) - France´s top constitutional body has rejected a last-ditch effort by opposition lawmakers to undo President Emmanuel Macron´s law raising the retirement age to 64. The Constitutional Council deemed that a proposed bill doesn´t meet the needed criteria. It was the second time the council has rejected the plan to restore the retirement age to 62 via a possible referendum or new bill. The process called for would be long even had it passed muster. And it wouldn´t have stopped Macron´s law from going forward. The council ruled on Wednesday that the proposal does not address \"reform regarding social policy\" and therefore doesn´t satisfy the French Constitution.",
        "___US approves 1st vaccine for RSV after decades of attemptsWASHINGTON (AP) - The U.S. has approved the first vaccine for RSV, shots to protect older adults. The respiratory virus filled hospitals with wheezing babies last fall but also endangers seniors. After decades of failure in developing an RSV vaccine, the Food and Drug Administration decision Wednesday makes GSK´s shot the first of several in the pipeline to be licensed. Next, the Centers for Disease Control and Prevention must decide if everyone 60 and older needs a shot or just those at high risk. The FDA is considering a similar vaccine for adults from Pfizer. There isn´t a vaccine for kids yet.___New legislation to counter China pushed by Senate DemocratsWASHINGTON (AP) - Senate Democrats have launched a new legislative effort aimed at taking on China. Democratic Leader Chuck Schumer on Wednesday said they will propose new legislation to try and prevent U.S. technology and capital from going to Chinese companies. It could also include provisions aimed at preventing China from buying U.S. farmland and giving the Biden administration more authority to review and potentially restrict foreign-made computer apps. Schumer provided no firm timeline for considering the bill.___The S&amp;P 500 fell 28.83 points, or 0.7%, to 4,090.75. The Dow Jones Industrial Average fell 270.29 points, or 0.8%, to 33,414.24. The Nasdaq composite fell 55.18 points, or 0.5% to 12,025.33. The Russell 2000 index of smaller companies rose 7.17 points, or 0.4%, to 1,739.28."
    ]
}