{
    "articleURL": "/news/article-12060355/Protesters-gather-Texas-State-Capitol-call-tighter-gun-regulations.html",
    "content": [
        "Protestors, several of whom were relatives of Uvalde victims, gathered in the lobby of the Texas State Capitol Monday to call for gun law reform In a surprise move by the Texas State House, a committee advanced a bill to the floor on Monday that would raise the required age to buy a semi-automatic rifle The protest and advancement of the bill arrive as more information trickles out about the Allen gunman who killed eight people at an outlet mall Saturday Anti-gun protestors gathered at the Texas State Capitol in Austin on Monday after a gunman killed eight people, including children, at an outlet mall over the weekend.",
        "Those attending the protest brandished signs with slogans like, 'Texas Mass shooting did that.' Others bore the face of past mass shooting victims, including the 19 children and two teachers who were killed nearly one year ago at the Uvalde mass shooting.Dozens of protestors gathered in the lobby of the Texas Capitol and chanted 'raise the age,' referring to a bill before the Texas House that would raise the required age to buy semi-automatic rifles in the Lone Star state.In a surprise move Monday, the bill advanced past a Texas House committee hours before a key legislative deadline.",
        "The bill will face an uphill battle in the Legislature to become state law, but the vote marked a milestone for the proposal that was generated and advocated for by relatives of the Uvalde shooting victims.The House committee voted 8-5 to send the bill to the floor, with two Republican state representatives joining with their Democratic colleagues on the House Community Safety Select Committee to vote for its advancement.Monday is the last day this session that House bills can be voted out of committee in the legislature's lower chamber.The legislative deadline comes just two days after a gunman in Allen - a suburb of about 100,000 outside of Dallas - killed eight shoppers at an outlet mall with an AR-15-style rifle, the same sort used by the gunman in Uvalde.",
        "Because the gunman in Allen - now identified as 33-year-old Mauricio Garcia - was outside of the age range that the new law would potentially apply to, it is unlikely that it would have prevented him from purchasing such a weapon. The proposed law would increase the age to buy a semiautomatic weapon from 18 to 21.Garcia is reported to have been a security guard who was removed from the Army in 2008 over mental health concerns.A neo-Nazi, he was living in a Budget Inn in Texas, killed eight people and injured five others outside the H&amp;M store at Allen Premium Outlets in Texas on Saturday afternoon. A police officer who was at the scene responding to another call shot Garcia dead when he heard the shots. While his motive remains unconfirmed, law enforcement sources say now-deleted social media pages show he shared sympathies with neo-Nazis.",
        "The US Army has not provided anymore information about his reported discharge.  Neighbors say they believe Garcia was working as a security guard but it's unclear if he held a job in the mall or at another location.According to the Washington Post, a patch the gunman was wearing on his chest alluded to his extremist ideologies. The patch read 'RWDS' which is an acronym for 'Right Wing Death Squads.'",
        "The FBI and police raided dead Garcia's Dallas home just one hour after the massacre and requested a translator to speak with his family. Neighbors say they often saw Garcia wearing a security guard-type uniform, but he was 'very quiet' and had 'very unusual behavior.'His gray Dodge Charger, which was seen at the scene, was often parked outside the home.Dashcam video showed Garcia, clad in full tactical gear, getting out of a car and shooting at people on the sidewalk. More than three dozen shots could be heard as the vehicle that was recording the video drove off.After the mass shooting - the 199th of the year in America - Texas Governor Greg Abbott doubled down on his and his party's position on firearm regulation. ",
        "Abbott told Fox News on Sunday: 'We need to recognize the reality we've seen across the United States over the last year or two, and that is an increased number of shootings in both red states and blue states.''We've seen an increased number of shootings in states with easy gun laws, as well as states with very strict gun laws. I think that the state in which the largest number of victims occurred this year is in California, where they have very tough gun laws,' he said. ",
        "The governor has said that the age restriction law that passed out of committee today would be unconstitutional, if passed by the legislature. "
    ]
}