{
    "articleURL": "/tvshowbiz/article-12044565/Kris-Jenner-wows-plunging-silk-dress-Julianne-Hough-sets-night-fire-red-frock.html",
    "content": [
        "Kris Jenner and Julianne Hough put their styling chops on display as they attended the 27th annual ACE Awards in New York City on Wednesday evening.",
        "The bash, thrown by the Accessories Council, honors those who have made an significant contribution to the accessories industry. Kris, 67, and Julianne, who will be co-hosting the next season of DWTS, showed their support in style as they worked the red carpet looking their absolute best.In a nod to the accessory-focused night, the momager was dripping in bling.She wore a dazzling layered necklace, silver bracelets, studded earrings, and carried a dainty metallic purse.",
        "The Kardashians star wowed in a silky white dress that cinched at the center of her waist and flashed a hint of leg.Her famous visage was done up with heavy smoky eye shadow, a dusting of radiant blush, and a fresh swipe of peachy lip gloss.As for Julianne, the DWTS pro, 34, commanded attention in a hot red ruffled dress with an exposed back.In a fun twist, the dress was tied at the back with a black ribbon.  It also flashed a hint of leg and her matching crimson heels.She swept her hair up into an opulent 'do with some bangs skimming over her blue eyes. A bold red lip and radiant touch of blush polished off her complexion.Julianne opted for minimal accessories tonight, choosing a pair of earrings and a bright red clutch.  ",
        "This isn't just any ordinary night for Julianne - the dancer/actress is set to be recognized as Style Ambassador.",
        "Ciara showed off her impeccable sense of style as she arrived on the red carpet. The singer-turned-entrepreneur, 37, modeled an oversized black blazer that hung off her gym-honed figure.She teamed her outerwear with matching wide-legged pants and a black knit sweatshirt from her clothing brand LITA by Ciara.Her hair was worn sleek and straight and she let her natural beauty shine by opting for a soft glam look.Ciara was honored with the 'sustainability' award for the fashion retailer she co-founded with her NFL star husband Russell Wilson and businesswoman Christine Day.The House of LR&amp;C - which stands for 'Love, Respect and Care - aims to 'democratize retail and redefine the way the fashion industry works' by creating ethical brands that are inclusive.Another honoree on the red carpet was Dee Ocleppo, who will be recognized as Emerging Designer.Dee stunned in a shimmering patterned dress that skimmed the floor and complimented her emerald green clutch.She was joined by her husband, fashion designer Tommy Hilfiger.Tommy smartened up in a midnight blue tuxedo with black accents, a crisp bowtie, and pocket square.",
        "The outing comes as Julianne prepares to return to Dancing With The Stars, but this time as co-host.",
        "Julianne rose to fame as a pro dancer on the show before eventually becoming a judge.This time, she will be helming the program alongside Alfonso Ribiero. Julianne will be handling dancer interviews while Alfonso will serve as the show's emcee, according to Deadline.In a statement to Variety, she raved of the new opportunity: 'It is such an honor to be rejoining Dancing with the Stars as co-host. The show holds such a special place in my heart from the many years and different roles I have had the privilege of being a part of,' she said.'The energy is magnetic every time you step foot in to the ballroom and I can’t wait to feel it again.' "
    ]
}