{
    "articleURL": "/tvshowbiz/article-12059945/Amber-Heard-spends-quality-time-baby-daughter-Oonagh-ride-scooter-Madrid.html",
    "content": [
        "Amber Heard was spotted pushing a scooter on Sunday.",
        "The Rum Diary actress was also holding her daughter Oonagh Paige, age one, in one of her arms as she headed to a park in Madrid.The 37-year-old performer, who has given up on her Hollywood career in favor of starting a new life in Spain, wore an all-black outfit that included a crop top, which showed off a slight portion of her toned midsection.The Aquaman actress also donned matching pairs of form-hugging leggings and athletic shoes while keeping a sizable blue bag slung over her left shoulder.The performer kept a pair of sunglasses perched above her forehead and tied her blonde locks into a lengthy ponytail. ",
        "Her child wore a pink shirt under her blue and ivory striped overalls, adding mauve colored shoes.DailyMail.com exclusively reported on Thursday that Amber has retreated from the US and the hustle and bustle of Hollywood in the wake of her ex-husband Johnny Depp's mostly successful defamation trial against her in Virginia last year.Now she has set up camp in a home just outside Madrid with her daughter.But it's unclear when she will attempt to make her wake back to Hollywood and to restart her acting career.    Heard announced that she had welcomed Oonagh into her life via surrogacy through a post that was shared on her Instagram account in July of 2021.",
        "The actress wrote a lengthy message in her post's caption where she revealed that her daughter, whose father has not been publicly revealed, had arrived that April.She also also expressed her thoughts about parenthood in the statement, which partially read: 'I hope we arrive at a point in which it's normalized to not want a ring in order to have a crib.'Heard's daughter was born a year before the much-publicized Depp v. Heard case, which was centered on allegations of defamation that were made by both the actress and her 59-year-old former husband. ",
        "The pair were married from 2015 until 2017, and the Pineapple Express actress alleged that the Pirates Of The Caribbean star had been physically abusive over the course of their marriage, which he denied.Heard also had an op-ed published by The Washington Post in 2018, in which she outlined how she felt as if speaking out about the alleged abuse she suffered during her marriage negatively affected her career. The performer went on to file suit against News Group Newspapers for printing various allegations about his marriage through The Sun in 2020, although he ultimately lost his case. ",
        "Depp went on to sue his former wife for defamation regarding the op-ed in 2019, and she followed suit before their trial began in July of last year.",
        "It was ultimately found that the Fear And Loathing In Las Vegas star had been defamed by his ex, while a single statement that was made by his former lawyer Adam Waldman regarding the actress was also found to have been defamatory.While both parties made appeals regarding the judgements, they dropped them and settled the case in December of last year, when it was decided that the actor would receive $1 million from his former spouse's insurance company.Heard subsequently released a statement regarding the settlement and expressed via BBC that she had 'lost faith in the American legal system.' "
    ]
}