{
    "articleURL": "/wires/ap/article-12053099/NYC-send-asylum-seekers-upstate-deal-influx.html",
    "content": [
        "New York City's mayor announced plans Friday to send hundreds of asylum-seekers to two hotels north of the city for up to four months as it tries to cope with a surge of arrivals, antagonizing officials in the largely suburban area.",
        "Democratic Mayor Eric Adams' administration said up to 300 single, adult men under the city´s care will be transported on a volunteer basis to a hotel in Orangeburg in Rockland County and another in Orange Lake in neighboring Orange County. Adams has denounced Texas Gov. Greg Abbott for busing asylum-seekers to New York City without prior coordination, and officials representing the areas north of the city lodged similar complaints against Adams on Friday.The mayor also has repeatedly pleaded for more state and federal help to deal with an influx of asylum-seekers, many of whom were bused to the city by out-of-state governors. He said the program would help the city handle the more than 37,500 asylum-seekers currently in the city´s care.The administration said the men using the hotels as temporary shelters will be provided with meals, counseling, legal support and other services.\"With a vacuum of leadership, we are now being forced to undertake our own decompression strategy,\" Adams said in a prepared release. \"This new, voluntary program will provide asylum-seekers with temporary housing, access to services, and connections to local communities as they build a stable life in New York state.\"Some Republican officials in areas north of New York City reacted harshly, saying they were just informed about the plan and that the region lacks subways and the necessary services to handle a surge of asylum-seekers.",
        "Rockland County Executive Ed Day called the mayor's plan \"reckless.\"\"This is akin to taking a nonswimmer, dropping him in the middle of the ocean and hoping he does well,\" Day said in a phone interview.Day said the county attorney was looking at getting a restraining order.Orange County Executive Steve Neuhaus said he was shocked to hear the news Friday and that he still had questions with the arrivals expected imminently.\"Who are these guys? Were they properly vetted? What are they going to be doing? Are they going to be roaming around the town?\" Neuhaus said in a phone interview.Advocates for immigrants also criticized the move.\"Busing people upstate for shelter is only a temporary fix,\" Murad Awawdeh of the New York Immigration Coalition said in a prepared release. \"They will be out of sight, but it´s short-sighted to think that the Mayor can resolve New York City´s housing problems in this manner.\"About 60,000 asylum-seekers have come to the city since last spring, according to the mayor´s office.The administration has already tried a number of ways to accommodate the asylum-seekers, including a plan announced in January to temporarily turn a cruise ship terminal into a shelter and services hub."
    ]
}