{
    "articleURL": "/wires/reuters/article-12047633/US-STOCKS-Wall-Street-falls-PacWest-woes-fuel-fresh-selloff-regional-banks.html",
    "content": [
        "PacWest slumps as it looks at strategic options",
        "First Horizon tanks as Canada's TD calls off buyout dealFed opens door to pause in tightening cycleIndexes down: Dow 1.21%, S&amp;amp;P 0.83%, Nasdaq 0.50%(Updates prices throughout; adds analyst comments in paragraphs 7 and 8)By Ankika Biswas and Sruthi ShankarMay 4 (Reuters) - U.S. stock indexes fell on Thursday after PacWest's move to explore strategic options deepened concerns about the health of regional banks, with uncertainty around the path of U.S. interest rates also weighing on the mood.PacWest Bancorp tumbled 49.7% to a record low after confirming it was exploring strategic options, including a sale, after shares of the regional lender and peers got hammered recently on fears of a worsening banking crisis.Regulators seized troubled First Republic Bank on Sunday and JPMorgan Chase agreed to buy majority of its assets, marking the largest U.S. bank failure since the 2008 financial crisis.Regional lenders including KeyCorp, Valley National Bancorp and Zions Bancorp fell between 5.8% and 9.7%.Western Alliance Bancorp tumbled 43.7%, with trading in the stock halted multiple times. The lender denied a report that it was exploring a potential sale that sent its shares down more than 60%.The KBW Regional Banking index dropped 4.0%, while the S&amp;amp;P 500 Banks index fell 3.3%.",
        "\"The continued downside in regional banks will be a problem for the market overall,\" said David Russell, vice president of market intelligence at TradeStation.\"In many ways the Fed's continued hawkish slant is giving short sellers a license to kill the banks, particularly the regional banks.\"The CBOE volatility index, also known as Wall Street's fear gauge, rose to 21 points to touch its highest since late March.The Fed on Wednesday raised interest rates by 25 basis points to the 5.00%-5.25% range and signaled a pause in its policy tightening, giving officials time to assess the recent bank failures, U.S. debt ceiling situation and sticky inflation.However, U.S. stocks dropped on Wednesday after Chair Jerome Powell said that it was too soon to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.U.S. interest rate futures are factoring in a 62% chance of rate cuts starting as soon as July, according to CME Group's FedWatch Tool.Data on Thursday showed the number of Americans filing new claims for jobless benefits increased last week as the labor market gradually softens amid higher interest rates, which are cooling demand in the economy.Apple Inc shares fell 1%. The iPhone maker is set to report quarterly results after the closing bell.",
        "At 11:49 a.m. ET, the Dow Jones Industrial Average was down 405.02 points, or 1.21%, at 33,009.22, the S&amp;amp;P 500 was down 33.95 points, or 0.83%, at 4,056.80, and the Nasdaq Composite was down 59.55 points, or 0.50%, at 11,965.77.Moderna Inc jumped 4.5% on stronger-than-expected sales for its COVID-19 vaccine for the first quarter.Qualcomm Inc slumped 5.7% after the chip designer's third-quarter forecasts missed estimates, while Paramount Global Inc tanked 28.1% after missing first-quarter revenue estimates amid a weak advertising market in its TV business.Canada's Toronto-Dominion Bank Group called off its $13.4 billion acquisition of First Horizon Corp, triggering a 37% drop in the U.S. regional bank's shares.Declining issues outnumbered advancers for a 2.63-to-1 ratio on the NYSE and a 1.80-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded four new 52-week highs and 24 new lows, while the Nasdaq recorded 37 new highs and 349 new lows.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}