{
    "articleURL": "/wires/pa/article-12051263/Coronation-icing-cake-Red-Cross-volunteer-ahead-60th-birthday.html",
    "content": [
        "A British Red Cross volunteer who will form part of the guard of honour during the coronation has said it will be the “icing on the cake” for her own 60th birthday celebrations.",
        "Irene Guild, 59, from Leven in Fife, has already made the journey to London, and she told the PA news agency: “You can feel the atmosphere as soon as you get off the plane.“The people milling around Westminster, (they all want to take) photographs.”Having volunteered for the Red Cross for 10 years, the coronation will be Mrs Guild’s sixth royal occasion, and it comes days before her birthday on Tuesday.She decided to work with the organisation following the death of her son as a way to support people and communities.",
        "She said it is “nice” that she has been able to witness the transition from one monarch to the next.“I’m seeing two ends of the scale, the very sad side of things and the very happy side of things for the public,” she said.“The public have come together on both occasions really well.”Mrs Guild also worked tirelessly to deliver food and medicine to people unable to leave their homes during the Covid-19 pandemic.She was selected to be involved in the coronation alongside 21 other volunteers, and said it is an “absolute honour”. We’re incredibly proud of these three exceptional volunteers and delighted their work is being recognised  Rob Murray, Red Cross Scotland  ",
        "She added: “I’m just so ecstatic to be asked and given the opportunity. For me, it’s like winning the lottery.”Mrs Guild was on hand to help a woman who took ill at the late Queen’s lying-in-state at St Giles’ Cathedral in Edinburgh last year.“I just gently walked up behind a lady looking very unwell, put my arm around and put my other hand on her elbow and I went ‘I’ve got you, you’re okay’.“I found a chair, out of line from the cameras so nobody could see her, and we got some water, took her thick coat off, which she had been wearing in the heat.“I basically got everything off and took her outside. When I sat her down she said ‘How did you know?’ I said I could just tell.“I’d watched the blood drain away from her face and could see she was pasty and sweating. I knew if I hadn’t caught her, she was going to hit the concrete floor.”",
        "Two other Scottish Red Cross volunteers, from the Highlands and Shetland, will also take part in the ceremony and for Mrs Guild, it will be the perfect early birthday celebration.“That’s a wee bit of icing on the cake (when people ask) ‘what did you do for your 60th?’,” she said.",
        "“Well, I went to see Charles.”Rob Murray, director of Red Cross Scotland, said: “We’re incredibly proud of these three exceptional volunteers and delighted their work is being recognised.“Our volunteers play a crucial role helping us to support people in crisis across Scotland, whether that’s welcoming refugees fleeing conflict, supporting families who have lost their homes to floods or fires, or training people in life-saving first aid techniques.“It never ceases to amaze me how dedicated our Scottish volunteers are, helping people whenever and wherever they are needed.”"
    ]
}