{
    "articleURL": "/femail/article-12056131/Is-going-teetotal-new-dating-trend.html",
    "content": [
        "Private Health Clinic found 60% of people reduced alcohol intake after CovidRead more: The REAL reason you should give up booze? The joy of sober sex!Countless relationships have started with grabbing a pint at the local pub.",
        "But it seems the younger generation are ditching alcohol at first dates, with a new TikTok movement encouraging the practice of 'sober dating' - and offering alternative plans.One user, Issy, who posts updates about her sober life, was asked how she bypasses the issue as 'everyone wants to meet for drinks'. She said: 'I've always been really upfront about it.'She added that she wears her decision to embark on a sober life 'like a badge of honour, rather than being embarrassed of it'. Issy said if people aren't supportive of this, then 'move on'. ",
        "'They're not for you, they're not for your journey and they're not going to add anything to your life'.Issy is just one of a host of creators who post on the matter, with other including the Landmark Recovery addiction treatment centre in Norfolk, Virginia.In one video, they asked people on the street whether they would date someone who is sober. The first man said simply: 'Yeah.'Another girl also agreed, while another man said it 'depends' but 'probably'.A team at the Private Rehab Clinic in Delamere told the Independent that this trend demonstrates a 'more positive approach' to alcohol consumption among young people.",
        "Martin Preston said: 'This way of living is inspiring the \"sober curious movement\" and the latest trend of \"sober dating\", which is about thinking more consciously about consuming alcohol and our drinking habits.'",
        "The Private Rehab Clinic found that 60 per cent of people had reduced their alcohol intake to improve their well being after the coronavirus pandemic. Mr Preston added: 'We're also seeing a rise in the number of alcohol-free dating apps, which allow those in recovery or simply those exploring their relationship with alcohol to find love.'This dating trend has many benefits, from feeling more safe and secure when meeting strangers to getting to know an individual's real personality instead of their drunk personality, to feeling more clear-headed and having an emotional connection.'"
    ]
}