{
    "articleURL": "/tvshowbiz/article-12048993/PETER-HOSKIN-Im-afraid-sleepy-New-England-town-vampire-problem.html",
    "content": [
        "Redfall (Xbox, PC, £69.99 or included with Xbox Game Pass)",
        "Verdict: Lacks biteRating:Welcome to Redfall, Massachusetts, a small fishing town on its own island. It's a simple, quaint sort of place, with coffeeshops, a movie theatre and a sturdy firehouse. In autumn, golden leaves fall from the trees and carpet the streets.Oh, and there's vampires — lots of vampires. In Redfall (the game), something bad has gone down in Redfall (the town), leaving you and dozens of others stranded without hope of external rescue, while the undead prowl beneath a blotted-out sun.It's amazingly atmospheric, this conglomeration of American wholesomeness and gothic horror. Walking around it feels like you're in a Stephen King novel. Had that been all I had to do in Redfall, I might have fallen for it like a 19th-century maiden for Dracula.But, sadly, the gameplay intrudes and ruins the mood. Which is a surprise, because the makers of Redfall, a studio called Arkane, are behind some of the most satisfying gaming experiences of all time — such as the Dishonored series.",
        "There is some of that classic Dishonored DNA here. There are people's diaries and other documents to read, to fill in some of the mysteries of what's happened in this town. You're encouraged to explore and use your special powers in creative ways to clear out the vampire-infested buildings.",
        "And yet, too often Redfall plays like Dishonored Lite — or worse. The care and artistry shown by those games is supplanted here by routine first-person shoot-outs, a dumb emphasis on improving your weapons, and the option of playing alongside your mates. Just like any other game.Until, that is, the corrupted sunlight alights on a distant lighthouse just so. Or a fell wind whistles down Main Street. Please let me just wander around this wonderful place.Showgunners (PC, £24.99)Verdict: Compulsive carnageRating:Turns out that, in the future, there'll still be reality teevee, but the stars of it will be gangs of gun-totin', murderous meatheads out to triumph over gangs of other gun-totin' murderous meatheads. Anything's better than Kim Kardashian, I guess.Or at least that's the future as presented in Showgunners, a new turn-based strategy game in the spirit of the XCOM series — though altogether bloodier. You control a gang of meatheads that's rather more likeable than all the others, not least because its main character, Scarlett, had her family killed by one of the stars of the reality show and is now out for revenge.",
        "And so you go from episode to episode — which is say, level to level — trying to shoot and bludgeon your way to the finale. ",
        "Each of these levels is more sprawling than I anticipated, full of bad guys and incident, as well as different areas to discover. It's a joy just to unpick everything that these arenas have to offer.But what really makes Showgunners shine is its setting. The satire isn't exactly subtle — one of the companies vying to sponsor your gang is called Warmart, for instance — but that's the point. Everything here is pleasingly lurid, from the punkish hairdos to the neon lights. This grim future-world even becomes… attractive?Then there are the ways the setting affects the gameplay. Every so often, the show's executives will shake up the formula by, say, rigging the entire arena with bombs that need defusing. Or by dropping in a particularly tough enemy. It never feels as challenging as XCOM, but it certainly keeps you on your toes.By the end, Showgunners took on the qualities of the very best reality television: it's a compulsive experience that always had me wanting more. Bring on Season Two."
    ]
}