{
    "articleURL": "/sciencetech/article-12047315/Shake-Shacks-vegan-shakes-ice-cream-veggie-burgers-launch-260-stores.html",
    "content": [
        "Shake Shack announced three new plant-based items set for all its locationsThe company is launching dairy-free desserts and a meatless burgerREAD MORE: Dietitian reveals what to order at Chipotle if you want to lose fatArtificial intelligence is breaking into the fast-food business.",
        "Shake Shack partnered with NotCo to use its AI-generated dairy-free milk, called NoMilk, to make a new chocolate milkshake and frozen custard.NoMillk was created by 'Giuseppe' - an AI system that can analyze any food product on a molecular level and then replicate it using only plant-based options. The New York-based burger joint is also releasing a veggie burger to all 260 locations Friday to complement the newly available plant-based desserts.",
        "The plant-based boom has taken over the US and many fast-food companies are taking full advantage.Burger King offers an Impossible Whopper, White Castle has Impossible sliders and Chipotle gives the option of a Sofritas Bowl.And now Shake Shack has joined the movement.The company is launching the three items in all locations across the US.It previously released the plant-based burger at select spots and has always offered the Shroom burger - a breaded portabella mushroom.The new Veggie Shack has been under development for the past five years, reports VegNews.This meatless burger is made with mushrooms, sweet potatoes, carrots, farro and quinoa and comes topped with American cheese, crispy onions, pickles and ShackSauce.Jay Livingston, chief marketing officer at Shake Shack, said in a statement: 'Since we started Shake Shack in 2004, our mission has been to serve up elevated versions of the classics that not only taste great, but are crafted with premium ingredients.'",
        "While adding a plant-based burger might appease many diners, AI-generated milk is the menu's star.Shake Shack teamed up with NotCo in 2022 to embark on a journey with Giuseppe, which is designed to seek out plant-based equivalents for products to create a more realistic taste and texture.Giuseppe analyzes animal products on a molecular level and pulls from a database of more than 300,000 edible plants to replicate the inputs sans animals.NotCo said the first NoMilk was actually green because the original recipe called for dill - but they have since perfected the mixture. 'We're also excited about our new non-dairy items—the Non-Dairy Chocolate Shake and Non-Dairy Chocolate Frozen Custard—are made with plant-based milk from food tech leader NotCo,' Livingston said.Shake Shack reported earnings and revenue Thursday, showing revenues were upbeat at $253.3 million. That is an increase of 24.53 percent in revenues from the year-ago report and is 3.10 percent higher than consensus estimates set at $245.7 million. "
    ]
}