{
    "articleURL": "/news/article-12053465/Bodhi-Mani-Risby-Jones-appears-Aceh-press-conference-Indonesian-arrest-nude-rampage.html",
    "content": [
        "A Queensland surfer who has been arrested for an alleged drunken rampage in Indonesia has made a bizarre appearance after being paraded in a black balaclava to make a public apology.",
        "Bodhi Mani Risby-Jones, 23, is facing a maximum of five years in an Indonesian prison and a public caning if authorities charge and sentence him for allegedly breaking laws in an ultra-conservative province.Mr Risby-Jones was on a three-week surfing holiday on the island of Simeulue, off the coast of Sumatra, when he allegedly drank vodka in Aceh province, where alcohol is banned.Police allege just after midnight last Thursday the 23-year-old left his hotel in a drunken state, punched a security guard in the neck and knocked local fisherman Edi Ron off his motorbike.",
        "Mr Ron has suffered a broken ankle and needed 50 stitches.Footage of Mr Risby-Jones' appearance at a press conference on Saturday shows him being marched by police to a stage in handcuffs while wearing and an orange jumpsuit and a black balaclava.'I'm very sorry for my actions and the embarrassment I've caused and the embarrassment that I've caused for us Aussies overseas, especially Indonesia,' he told the conference.'I'm very sorry and yeah, I wish what I did never happened. I really, really want to come home.'When asked if he knew alcohol was outlawed in Aceh, the Queenslander said: 'I was not aware, no, I was not aware. I understand now.'It was at duty free in the airport. It was cheap and my friends actually purchased it.",
        "'I actually don't usually drink that much at home. If I do drink though it would be beer usually.'Mr Ron and his family are demanding AUD$60,000 compensation for the fisherman's injuries and income loss. ",
        "Mr Risby-Jones and his family have so far paid Mr Ron over $2,000.A lawyer for Mr Risby-Jones is hopeful a peaceful resolution can be reached and Mr Risby-Jones can be deported without charges.Police chief Jatmiko said investigators gave information to prosecutors on Friday.'If they choose to withdraw their police report, or if they want to resolve this issue peacefully among themselves, we can talk about that,' he said.'But, if not, then we're going to continue (processing the case).'"
    ]
}