{
    "articleURL": "/wires/ap/article-12042641/Voters-oust-Michigan-clerk-doubts-election-results.html",
    "content": [
        "ADAMS TOWNSHIP, Mich. (AP) - Voters in one of Michigan's most conservative counties have ousted a small-town clerk accused of improperly handling voting equipment after casting doubt on President Joe Biden´s election victory.",
        "Stephanie Scott lost Tuesday's recall election in Hillsdale County´s Adams Township to Suzy Roberts, who got 406 votes to Scott's 214, according to unofficial results reported by the county clerk´s office.Roberts, a Republican who identifies as an independent, filed as non-party-affiliated in the recall election because Michigan law does not allow for challengers to file under the same political party, the Hillsdale Daily News reported previously.Scott had run unopposed as a first-time Republican candidate when she was chosen in the November 2020 election to handle the voting in Adams Township, a reliably Republican community where the ticket of Donald Trump and Vice President Mike Pence received nearly 76% of the vote that year.But she joined a crew of GOP elections officials around the nation who have questioned the accuracy of U.S. voting systems. Scott is among a number of elections officials around the country accused of mishandling voting equipment in their zeal to uncover fraud.Before Tuesday´s recall election against Scott, her challenger said that \"the lying has to stop.\"",
        "\"Somehow, nationwide, we have to make lying wrong,\" said Roberts, 69. \"If you got caught in the lie there was a feeling of shame. It has to be wrong again.\"A message seeking comment was left Wednesday with Roberts. Scott and her attorney did not answer questions or provide comment before Tuesday´s election, and additional messages seeking comment were left Wednesday.",
        "During preparations for her township´s November 2021 election, Scott said she had voting accuracy concerns and had considered paper ballots and a hand count before settling on using the same voting system.The state intervened after Scott allegedly refused to allow a contractor to perform preventive maintenance and failed to conduct accuracy tests, among other issues. She was stripped of her duties running township elections in October 2021.When the Hillsdale County clerk´s office took custody of an election tabulator and a voter-assist terminal from township offices to prepare for a public accuracy test, they discovered the tabulator´s tablet had been removed. It was later seized by Michigan State Police after Scott allegedly refused to turn it over.One of Scott´s supporters, Adams Township Supervisor Mark Nichols, also lost in Tuesday´s recall election. Challenger Randy G. Johnson bested Nichols by 394 to 222 votes, unofficial results show."
    ]
}