{
    "articleURL": "/news/article-12056251/Car-hoon-doing-donuts-knocks-spectator-Queensland-protest-erupts.html",
    "content": [
        "Teenager knocked down and seriously injuredTwo police officers were also hospitalised  A teenager was knocked down and seriously injured when a car spun out of control while doing donuts.",
        "The boy remains in hospital in a serious condition after he was hit and thrown into the air on Saturday night at a Swanbank carpark in Ipswich, 40km south-west of Brisbane.Horror footage of the incident was posted to social media on a wild night in south-east Queensland.Violence erupted on the Gold Coast when more than 100 hoons were locked in a tense standoff with police protesting strict new laws targeting dangerous driving and illegal street racing.Rocks and bricks were thrown at patrol cars by young men, many of whom were wearing balaclavas, injuring two police officers who needed hospital treatment. ",
        "Protesters chanting 'F*** QPS (Queensland Police Service)' and 'F*** you dogs'.Video from a protest in Robina showed a man charging at a police car, allegedly smashing a window and then boasting about it. 'I got that window,' he said while holding his arms in the air and then laughing.A 20-year-old has since been charged with assault and damaging a police vehicle. He is due to appear before Southport Magistrates Court on May 29.Police officer Chris Tritton told 9News that 'The two officers that were in the vehicle (whose window was smashed) have sustained glass fragment injuries and one has glass to the eye.'He added that 'This sort of violence towards police won't be tolerated (or) to any emergency service ... There will be a swift response by police in the coming days.' ",
        "The new anti-hooning laws which came into effect last month give police extraordinary powers to charge anyone who is attending an illegal street racing event - not just the drivers or passengers.",
        "The legislation which is the toughest in any Australian state, also means spectators can be charged for simply watching burnouts or drifting. Specialist police, accompanied by the dog squad and PolAir were eventually able to bring the latest outbreak of violence under control and detained several people. Anyone with information is urged to contact police. A police spokesperson told Daily Mail Australia the two injured officers have since been released from hospital.  "
    ]
}