{
    "articleURL": "/wires/afp/article-12047857/British-musician-Ed-Sheeran-wins-US-copyright-trial.html",
    "content": [
        "British pop phenom Ed Sheeran expressed joy and relief Thursday after a US jury found he did not plagiarize Marvin Gaye's \"Let's Get It On\" in composing his hit \"Thinking Out Loud,\" calling the ruling a win for creative freedom.",
        "The English musician hugged his team inside a Manhattan federal courtroom after jurors ruled that he had \"independently\" created his 2014 song.Outside, he told reporters he was \"very happy\" but \"unbelievably frustrated that baseless claims like this\" even make it to trial.The civil lawsuit was filed by heirs of Gaye co-writer Ed Townsend, who alleged that harmonic progressions and rhythmic elements of Sheeran's song were lifted without permission from the classic made famous by Gaye.The heirs sought a share of the profits from Sheeran's hit.\"If the jury had decided this matter the other way, we might as well say goodbye to the creative freedom of songwriters,\" Sheeran told reporters.\"It is devastating and also insulting to be accused of stealing other people's songs when we put so much into our livelihoods,\" he added. \"I am just a guy with a guitar who loves writing music for people to enjoy.\"\"I am not and will never allow myself to be a piggy bank for anyone to shake.\"- 'Songwriter's alphabet' -The jurors spent some three hours deliberating whether Sheeran's song and Gaye's classic are substantially similar and if their common elements are protected by copyright law.Sheeran spent days testifying with guitar in hand, playing demos for the court to prove the 1-3-4-5 chord progression in question is a basic building block of pop music that can't be owned.",
        "The 32-year-old said he writes most of his songs in a day, and said he co-wrote \"Thinking Out Loud\" with singer-songwriter Amy Wadge, a regular creative collaborator.A musicologist retained by the defense told the court the four-chord sequence was used in a number of songs before Gaye's hit came out in 1973.",
        "\"These chords are common building blocks,\" Sheeran said Thursday. \"They are a songwriter's 'alphabet', our tool kit.\"\"No one owns them, or the way they are played, in the same way nobody owns the color blue.\"Plaintiff Kathryn Townsend Griffin left court and breezed by reporters smoking what appeared to be a cigarillo, saying only: \"God is good all the time, all the time God is good.\"- 'Sense of relief' -Industry insiders closely followed the copyright lawsuit as some feared it could chill songwriters' creativity and open the door to future litigation.It was the second trial in a year for Sheeran, who successfully testified at a London court last April in a case over his song \"Shape Of You,\" saying the lawsuit was emblematic of copyright litigation going too far.The judge also ruled in his favor in that case.Sheeran's \"Thinking Out Loud\" shot up America's Billboard Hot 100 charts upon release, and won Sheeran a 2016 Song of the Year Grammy.",
        "There have been a handful of landmark music copyright cases in recent years, notably when Gaye's family -- who was not part of the New York lawsuit against Sheeran -- successfully sued the artists Robin Thicke and Pharrell Williams over similarities between the song \"Blurred Lines\" and Gaye's \"Got to Give it Up.\"That result in 2015 surprised many in the industry, including legal experts, who considered many of the musical components cited as foundational, and existing largely in the public domain.Then an appeals court decision confirmed Led Zeppelin's victory over a similar case focused on the classic \"Stairway to Heaven\" -- a victory for songwriters that Sheeran's case should bolster.\"I hope that the verdict gives songwriters and publishers some sense of relief that they don't need to be looking over their shoulders quite so much,\" said Joseph Fishman, a law professor specialized in intellectual property at Vanderbilt University.\"That would be a big shift from the mood following the 'Blurred Lines' verdict.\"- 'Sanity prevailed' -The swinging pendulum has nevertheless left some songwriters fearful of the volatility of opinions from jurors who almost certainly do not have a background in musicology and must rely on expert witnesses for context.After delivering the verdict, juror Sophia Neis told journalists it took a beat for all seven members to find common ground.",
        "\"There was a lot of back and forth\" with advocates on both sides, the 23-year-old said.Joe Bennett, a forensic musicologist at the prestigious Berklee College of Music, told AFP he was \"delighted\" that \"sanity prevailed\" in the case.\"In music copyright litigation cases involving one or two bars of music, the plaintiff's allegation of plagiarism is almost always wrong,\" he said. \"Coincidental similarity happens all the time, particularly with chords and short melodic fragments.\"\"Hopefully this sensible verdict will discourage other spurious complaints.\""
    ]
}