{
    "articleURL": "/news/article-12043811/Ron-DeSantis-set-sign-expansion-Dont-Say-Gay-law-public-school-grades.html",
    "content": [
        "Florida legislature passed an expanded version of so-called 'don't say gay' lawInclude restrictions on in-classroom instruction of gender identity and sexual orientation for all public school grade-levels instead of just K-3rd The bill now goes to Florida Governor Ron DeSantis' desk for signature Ron DeSantis scored another massive win for his conservative agenda Wednesday when the Florida Republican supermajority passed an expansion of his so-called 'don't say gay' law to cover all public school students Kindergarten through 8th grade.",
        "The newly expanded Parental Rights in Education bill was sent to DeSantis' desk Wednesday afternoon for his signature after it passed the legislature by a 27-21 vote.It follows the Florida State Board of Education voting last month to ban the topic of sexual orientation and sexual identity in all public schools for all grades up through graduating high school.The Florida governor is expected to make a bid for president in coming weeks and has made education and fighting leftist 'woke-ism' a cornerstone of his agenda.DeSantis' education-related law originally passed last year and restricted the instruction of sexual orientation and gender identity in grades Kindergarten through 3rd. But DeSantis and other hard-liner Republicans in the Florida legislature didn't think the law went far enough.",
        "Critics have dubbed the bill the 'don't say gay' law, claiming that it could hurt gay and transgender students by keeping the discussions off limits in public school classrooms.Additionally, the new law also makes the process easier for parents to make sure books they feel are inappropriate are taken off their childrens' bookshelves.Any person can challenge a book for any reason within their county. Once a challenge is levied, the book in question must be pulled from the shelves during the review process, which could take weeks or months.",
        "Not only does the new law expand the current range of the ban from capping out at third graders to now including middle schoolers, it also restricts teachers from addressing students by the pronouns that don't align with the gender in which they were born.While there is more flexibility with high schoolers, teachers and instructors for these grade levels are restricted to only discussing these topics in a manner that is 'age appropriate or developmentally appropriate' for their students.'This bill promotes parental rights, transparency, and state standards in Florida schools. It requires that lessons for Florida's students are age-appropriate, focused on education, and free from sexualization and indoctrination,' Republican Florida State Rep. Adam Anderson previously stated regarding the impending law.The original version of the Parental Rights in Education law signed last March sparked DeSantis' war with Walt Disney Co. after the CEO-at-the-time spoke out against the measure.Since then, DeSantis has taken several moves to strip, what he calls, the 'corporate kingdom' of special privileges and tax-exemptions it was awarded with the development of the Reedy Creek Improvement District in 1967."
    ]
}