{
    "articleURL": "/news/article-12056967/At-six-people-killed-car-rams-people-outside-Texas-migrant-shelter.html",
    "content": [
        "Police have arrested the driver following the horrific crash on Sunday morning The Range Rover SUV is believed to have 'intentionally' plowed into pedestrians outside the Ozanam Center in Texas at 8.20am WARNING: GRAPHIC CONTENT At least seven people were killed and multiple left injured after a car struck a group of people outside a migrant shelter in Brownsville, Texas. ",
        "Police initially said they believed the driver of the Range Rover 'intentionally' plowed into pedestrians waiting at the bus stop outside the Ozanam Center at 8.20am on Sunday, but later clarified they are still investigating the incident.The driver, who witnesses said was yelling insults at the group before accelerating towards the curb, is undergoing testing to see if he was under the influence of alcohol at the time of the tragic crash.Police arrested him at the bloody scene in the border town and charged him with reckless driving but more charges may follow as FBI and Border Patrol agents are brought in investigate.Footage from the aftermath showed multiple injured people lying on the ground in bloodied clothing while emergency services rushed to the scene. ",
        "The suspect is currently in hospital being treated for injuries, but he is under police watch.Video circulating online shows the SUV running up the curb where a group of about 25 men were sitting at a bus stop, toppling them over one-by-one.'What we see in the video is that this SUV just ran the red light and was about 100 feet away and just went through the people who were sitting in the bus stop,' shelter director Victor Maldonado told the Associated Press.",
        "The SUV then apparently flipped over after running up the curb and continued moving for about 200 feet, striking others who were walking on the sidewalk about 30 feet away from where the group was sitting.The driver then tried to flee the scene, Moldonado told the Washington Post, but was stopped by some witnesses.Some witnesses also said they believed the man was intoxicated at the time.Footage from the scene also showed police arresting a man sitting on the ground - who was not wearing a shirt - outside the homeless migrant shelter. Officials believe he is a Hispanic male from Brownsville, but have said he is 'extremely uncooperative' and have given authorities a few different names. ",
        "Among those who were injured is Luis Herrera, who said he and his friends were waiting to go to the airport when they were struck. It is understood that the group was congregating near the bus stop at the time.'A woman went by in a car and warned us to get away,' he recounted in an interview with AFP, describing the crash as 'sudden.' 'It was a matter of moments. The killer came [through] in the car, gesturing at us, insulting us,' the 36-year-old Venezuelan claimed.A number of his friends were killed, he told NBC 4, and he was injured on the right side of his body.",
        "Eleven people injured in the crash were taken to local hospitals, the Brownsville Fire Department announced on Facebook.One was also airlifted to Valley Baptist Medical Center in nearby Harlingen.The victims' conditions are not currently known. ",
        "The Ozanam center is a homeless shelter that serves individuals and families in the area - and because it sits right on the US-Mexico border, many of its clients are migrants.Maldonado said the center has not received any threats in the past, though it has started to in the aftermath of the crash.'I've had a couple of people come by the gate and tell the security guard that the reason that this happened was because of us,' he said.Maldonado added that most of the men who were struck were Venezuelan men. It is unclear how many of the victims were migrants, and a motive has not yet been established.",
        "The crash comes as the city of Brownsville deals with an influx of migrants.Last month, the city issued a disaster declaration after 15,000 migrants — mostly from Venezuela — crossed over in a single week, overwhelming border security.In a normal week, only about 2,000 migrants attempt to cross at Brownsville.Tensions flared amid the uptick in migration last month, when some tents housing the immigrants were set ablaze and destroyed.",
        "Some migrants blamed cartel-backed gangs, but a government official suggested the fires may have been set by a group of frustrated migrants. The situation may also get worse in the coming week, with the end of Title 42 on Thursday. The COVID-era policy allowed border agents to send migrants back to Mexico."
    ]
}