{
    "articleURL": "/news/article-12044917/Drag-queen-featured-Navys-digital-ambassador-says-doesnt-f-k-haters.html",
    "content": [
        "Yeoman 2nd Class Joshua Kelley posted a new video Tuesday saying he 'doesn't give a f**k' about hatersThe position was unpaid as part of the Navy's efforts to reach a younger audienceREAD MORE: 'I can't believe I fought for this bulls**t' says Navy SEAL who helped kill Osama Bin LadenThe non-binary drag queen tapped to be a 'digital ambassador' for the United States Navy has hit out at haters in a new video as she revealed she has gotten death threats for her role.",
        "Yeoman 2nd Class Joshua Kelley, whose stage name is Harpy Daniels, posted a new TikTok video on Tuesday lip syncing to singer Jared Leto's response about his inspiration for an outfit on the red carpet in which he says it was 'basically DGAF,' an acronym for 'don't give a f***.'The video came as it emerged she was one of only five active sailors to participate in the Navy's 'digital ambassador' program in its efforts to reach a younger audience.The program has since ended, a spokesperson for the Navy told DailyMail.com, but former service members are now criticizing the military branch for using a drag queen to promote the armed forces. Among those who spoke out was podcaster Graham Allen, who tweeted: 'This is not the same military I served under. Our enemies LAUGH at us.'",
        "Allen included a video showing Kelley in her different drag outfits in her tweet.But it inspired Kelley — who uses she/her pronouns —to speak out in what she called her 'first rebuttal.'Writing directly to Allen on Instagram Tuesday, Kelley said: 'You want to tear down service members and use my content without a tag so you don't look homophobic or transphobic.'She then went into a history of LGBTQ rights in the military, writing: 'Queer people were oppressed in the military for years, only until 2011 and trans people since 2021.'",
        "'You only want to support the military when it benefits you and doesn't involve queer people,' Kelley continued. 'Yet the military is the largest diverse and adaptable organization in use.'You're better off calling me a slur than using content from five years ago,' she said. 'Yet that video you're sharing was published in 2018, you had noting to say til now.'You don't actually care, you just need more followers, more content and more people to praise someone who only creates toxic environments and hate.'You don't care if I get death threats, people wanting to harm me or spread disinformation,' Kelley wrote. 'You only want the spotlight. 'Well, as a service member, a queen and an open queer person, you don't scare me and you won't stop the LGBTQ+ community [from] thriving.'Haters only hate when we're winning.' She added in the video 'LGBTQ+ people serve loud and proud.' ",
        "But Allen was not the only one who has spoken out about Kelley's role in recent days, with many comparing her to Dylan Mulvaney, the trans activist whose association with Bud Light sparked a PR crisis for the brand and sent sales plummeting.'US Navy are now using Drag Queen Joshua Kelley (AKA Harpy Daniels) to attract new enlistment. 'This must strike fear in our enemies,' quipped one critic. ",
        "'So the US military misses recruitment goals by a mile.. and instead of getting a clue their strategy is to enlist a drag queen influencer that goes by the name of Harpy Daniels to meet recruiting goals?'I'm sure China is terrified!' said another. Robert J. O'Neill, a decorated combat veteran who served for eight years as a member of SEAL Team Six, also said on Twitter he 'can't believe [he] fought for this bulls**t.''Alright. The U.S. Navy is now using an enlisted sailor Drag Queen as a recruiter,' he wrote. 'I'm done. China is going to destroy us.'The tweet quickly gained 1.1 million views and thousands of likes and retweets. 'As a Navy veteran, I am ashamed on behalf of the US Navy. I hope that goes over as well as Bud Light did,' one person responded.'This is beyond disturbing. I’m a former military officer and I just can’t believe what our brass is doing,' another added. 'An insult to every veteran and their families. My dad just rolled over in his grave at Arlington. I'm so glad he didn't have to see this happen,' a woman wrote. ",
        "Kelley first announced that she would be serving as a non-paid digital ambassador in a video posted to her TikTok in November, highlighting her journey from performing on board beginning in 2018 and growing to become an 'advocate' for those who 'were oppressed for years in the service.'",
        "She said that her experiences in the Navy have 'brought me so much strength, courage and ambition to continue being an advocate and [representative] of queer sailors.'Kelley has said she began dressing in drag and performing in shows while still in high school, drawing on inspiration from the queens on RuPaul's Drag Race — which she started watching at the age of 16.After deciding to follow in her father's footsteps and join the Navy, Kelley began performing on ships during a sanctioned MWR (Morale. Welfare and Recreation) lip-syncing contest in 2017, while deployed on the USS Ronald Reagan. Soon, she became a regular in the competitions, according to NBC News, and her twin brother soon also took up drag.The officer insists she never experienced harassment in the Navy, but when she was scheduled to perform at a diversity, equity and inclusion event at Langley Joint Air Force Base in the summer of 2022, it 'caused an uproar to many conservatives and Christian extremists.''I'm an advocate for the LGBTQ+ community, and being able to do drag is not just for me, but a tribute to many service members who were kicked out, harassed, bullied or worse for being openly gay during Don't Ask, Don't Tell,' she told the USS Constitution Museum in an interview, referencing the Bush-era policy that discouraged military members from disclosing their sexual orientation.",
        "'It shows representation, and that is truly needed for a culture and organization that has shunned us for so long.' Harpy Daniels now has over 60,000 followers on TikTok and more than 8,000 on Instagram."
    ]
}