{
    "articleURL": "/wires/afp/article-12040841/Cambodia-poised-SEA-Games-Chinese-flavour.html",
    "content": [
        "Cambodia will welcome thousands of athletes from across the region when the Southeast Asian Games begin on Friday with an opening ceremony at a new stadium built and paid for by China.",
        "The capital Phnom Penh will stage the 32nd edition of the biennial SEA Games, the first time Cambodia plays host.More than 11,000 athletes, coaches and delegates from 10 other countries will descend on the country for the Games, which run until May 17.Regional glory is up for grabs but competitors will also have one eye on the Asian Games in China in September-October and next year's Paris Olympics.Southeast Asia's finest will take part in a host of competitions including athletics, swimming, badminton and football, as well as more obscure sports such as Kun Bokator, an ancient Cambodian martial art.The Games will welcome world-class athletes such as pole-vaulter Ernest John Obiena and weightlifter Vanessa Sarno, both from the Philippines.But fellow Philippine weightlifter Hidilyn Diaz, a Tokyo Olympic gold medallist, will not compete.Another notable absentee is swimmer Joseph Schooling, Singapore's 2016 Olympic gold medallist, who pulled out in March saying he was \"not at the level\" to do his best.The Games usually take place every other year but because of the pandemic the previous edition, in the Vietnamese capital Hanoi, was just 12 months ago.The hosts topped the medal table, ahead of Thailand and Indonesia.- China influence -Cambodia and Prime Minister Hun Sen hope the Games will have benefits beyond the two weeks the country plays host.",
        "\"The Games will not only promote sports but also boost Cambodia's tourism in the post-Covid-pandemic era,\" said tourism minister Thong Khon, who is also president of the National Olympic Committee.Cambodia has never staged the Games before, in part because of violence and instability that plagued the country throughout the back-end of the 20th century.Hun Sen's government is keen to showcase the country's stability and has gone all-out in whipping up local fervour.A successful event and a creditable medal haul could help boost national sentiment two months ahead of parliamentary elections.Tickets have been given away for free and all schools and universities will close for a month so students can watch the Games. The SEA Para Games follow in early June.The Games would not be complete without some controversy between rivals.Cambodian medal hopes will be helped by a Thai boycott of the event known locally as Kun Khmer, or more widely called Muay Thai.Cambodian insistence on using the former name for the Southeast Asian \"art of eight limbs\" sparked the pullout, removing one of the best nations from the combat sport.The athletes from 11 nations -- the 10 members of the Association of Southeast Asian Nations plus Timor-Leste -- will on Friday night parade their flags through Phnom Penh's 60,000-seater Morodok Techo National Stadium.",
        "China -- whose athletes are not involved -- paid the $160 million bill for the stadium, built and designed by Chinese firms. Hun Sen has called it a symbol of the \"iron-clad friendship\" between the two countries.The government in Phnom Penh has put the price tag for the Games, excluding the stadium grant, at $118 million."
    ]
}