{
    "articleURL": "/wires/reuters/article-12044911/Australias-NAB-warns-end-windfall-rising-rates.html",
    "content": [
        "H1 cash profit A$4.07 bln, up 17%",
        "Net interest margin shrank in March 2023 quarter from prior qtrShares fall 8% in morning, other big banks fall more than 2%(Writes through with CEO quotes, share price and investor comment)By Byron Kaye and Himanshi AkhandMay 4 (Reuters) - National Australia Bank Ltd, the country's No. 2 lender, fell short of analyst forecasts in half-year profit released on Thursday and took a hit to its share price after warning that the windfall from rising interest rates had peaked.Profit at the bank, also Australia's biggest business lender, jumped 17% to A$4.07 billion ($2.72 billion) in the half year to March as higher rates allowed banks to widen their margins, but fell short of the A$4.15 billion average analyst forecast, according to Refinitiv.The company's net interest margin, a closely watched measure that shows the amount banks take in interest payments minus operating costs, also grew from a year earlier but shrank in the March 2023 quarter from the prior quarter, hit by fierce competition for refinancing loans.The update signals a tough new phase for Australia's lenders which have benefited from a year of rising interest rates by charging more to borrowers while limiting the amount they pay deposit-holders. Competition in a stagnant mortgage market has become so fierce that some banks are offering cash payments to lure borrowers.",
        "NAB shares fell as much as 8% in morning trading, their biggest intraday fall since March 2020 and helping to drag down the broader market 0.6%, as investors worried that the sweet spot for banks had turned sour.Shares of rivals Commonwealth Bank of Australia, Westpac Banking Corp, ANZ Group Holdings Ltd and Macquarie Group Ltd, all due to report earnings in the next week, were down more than 2%.\"What the market's concerned about is the exit NIM (net interest margin),\" said Hugh Dive, chief investment officer at Atlas Funds Management which holds bank stocks.\"It suggests it peaked in Q1 - December last year.\"He said the structure of NAB's mortgage book was also a cause for concern.A higher-than-expected proportion of customers are on fixed-rate home loans which would expire in 2024, exposing them to higher floating rates, and more stress for consumers will mean more stress for the lenders.\"There's a bit more pain next year and it's a bit more lengthened,\" Dive added.NAB CEO Ross McEwan said the company was focusing on expanding business in areas more profitable than mortgages, such as business lending, where profit in the half-year grew by one-fifth from the same period a year earlier.In personal banking, which includes mortgages, profit shrank slightly due to a A$393 million impairment charge. The bank said that partly reflected lower house prices as the impact of rising living costs spread through the economy.",
        "Still, McEwan said, the bank expected that the world No. 13 economy would avoid a \"pronounced economic correction\" and that bad debts would remain low. The bank had telephoned 7,000 borrowers deemed to be most vulnerable to rising interest rates and just 13 had requested assistance.\"It's showing resilience in the market, it's showing that full employment is really helping,\" he said on a call with journalists. He noted that the country's unemployment rate, at 3.5%, is the lowest in decades.NAB declared an interim dividend of 83 Australian cents per share, up from 73 cents a year earlier. ($1 = 1.4990 Australian dollars) (Reporting by Byron Kaye in Sydney, Himanshi Akhand and Jaskiran Singh in Bengaluru; Editing by Maju Samuel and Edmund Klamann)"
    ]
}