{
    "articleURL": "/femail/article-12059323/Duchess-Edinburgh-takes-class-Guide-Dogs-Blind-Association.html",
    "content": [
        "The centre has put on a pop-up 'Coronation Cafe' for the Duke and DuchessREAD MORE: See all the Coronation coverage on our brilliant royal channel Sophie, Duchess of Edinburgh, has taken part in a puppy class at the Guide Dogs for the Blind Association Training Centre in Reading today.",
        "The duchess, 58, was joined with her husband, Prince Edward, Duke of Edinburgh, 59, as the third day of Coronation events continue for the royals. The centre have put on a pop-up 'Coronation Cafe' for the Duke and Duchess, where the puppies will learn the skills needed as guide dogs in a busy coffee shop environment. Sophie is Patron of the Guide Dogs for the Blind Association. She joined Hollie, Lucy, Luker, Nyla and Sunny and their volunteer puppy raisers themed cafe to continue this weekend's festivities.",
        "The duchess was smothered with kisses from Labradors and Golden Retrievers as soon as she exited her car in a rather rainy Reading. She smiled as she was bent down slightly to stroke one of the dogs, while speaking to those who volunteered for the charity. Sophie looked elegant as she donned smart scarlet trousers, paired with a white floral patterned blouse.To complete her outfit she wore a tan coloured blazer, paired with a brown bag and camel wedges. Her golden tresses sat below her shoulder, showing off her small gold hoop earrings and she wore natural makeup - with a touch of eyeliner and highlighter.The duke and duchess have volunteered as part of The Big Help Out - a day when people are encouraged to volunteer in their communities. ",
        "Prince Edward looked dapper as he wore a brown blazer, blue shirt and navy coloured smart trousers, with polished shoes.",
        "She donned a coral dress by one of her favourite labels - Beulah, which retails for £695.The royal pair attended the Coronation concert yesterday evening with their two children Lady Louise, 19, and James, Earl of Wessex, 15.Sophie danced the night away as she was seen swaying side-to-side and dancing as Richie gave a live rendition of his hit All Night Long.  Prior to the concert, Sophie and her husband attended a Big Lunch event in Cranleigh, Surrey.The pair headed to Cranleigh Village Hall where they visited the Coronation Craft Market, before heading to a fun fair on the high street. "
    ]
}