{
    "articleURL": "/wires/reuters/article-12037963/US-factory-orders-rebound-aircraft-March.html",
    "content": [
        "WASHINGTON, May 2 (Reuters) - New orders for U.S.-made goods rebounded in March, boosted by a jump in civilian aircraft bookings, but the overall manufacturing industry continued to struggle under the weight of higher interest rates.",
        "Factory orders increased 0.9% after decreasing 1.1% in February, the Commerce Department said on Tuesday. Economists polled by Reuters had forecast orders rebounding 1.1%. Orders increased 2.4% on a year-on-year basis in March.The sector, which accounts for 11.3% of the economy, is being dragged down by the Federal Reserve's fastest interest rate hiking campaign since the 1980s.Banks have also tightened lending following the recent financial market turmoil, while spending is shifting away from goods, typically bought on credit, to services.Businesses are cutting back on restocking in anticipation of weaker demand later this year. The Institute for Supply Management reported on Monday that its manufacturing PMI contracted for a sixth straight month in April.Orders for transportation equipment increased 9.0% after dropping 3.2% in February. Civilian aircraft orders soared 78.3%. Motor vehicle orders fell 0.6%. Excluding transportation, orders fell 0.7% for a second straight month.Orders for machinery declined 0.3%, but bookings for computers and electronic products increased 2.1%. Orders for electrical equipment, appliances and components rose 0.8%.Shipments of manufactured goods fell 0.1%. The inventory of manufactured goods at factories dropped 0.8%. Unfilled orders at factories rose 0.4%.The Commerce Department also reported that orders for non-defense capital goods, excluding aircraft, which are seen as a measure of business spending plans on equipment, declined 0.6% in March instead of 0.4% as reported last month.",
        "Shipments of these so-called core capital goods, which are used to calculate business equipment spending in the gross domestic product report, dropped 0.5% instead of 0.4% as previously reported. Business spending on equipment has contracted for two straight quarters. (Reporting by Lucia Mutikani; Editing by Andrea Ricci)"
    ]
}