{
    "articleURL": "/wires/aap/article-12040421/Two-police-officers-stabbed-person-dead-SA.html",
    "content": [
        "Two police officers have been stabbed, both suffering serious injuries, and an offender shot dead in a shocking incident in a small South Australian town.",
        "Just after 10am on Wednesday, the officers, one from Port Germein and one from Crystal Brook, had gone to a property on Symons St at Crystal Brook to conduct inquiries in relation to \"another matter\".\"While at the home an occupant allegedly stabbed the two officers where they both sustained serious injuries,\" police said in a statement.\"The man was then shot by police and he died at the scene.\"The Port Germein officer was airlifted to the Royal Adelaide Hospital in a serious but stable condition.The Crystal Brook officer was also in a serious but stable condition.He was originally taken to the Port Pirie Hospital but was later to be airlifted to Adelaide.SA Premier Peter Malinauskas said he had been briefed by Police Commissioner Grant Stevens in relation to the incident.The commissioner subsequently travelled to the scene, about 200km north of Adelaide, where major crime detectives, the forensic response section and the internal investigation section were leading inquiries.\"This is obviously an evolving situation and will be difficult news for the South Australian community to absorb,\" the premier said.\"Our frontline workers do an inherently difficult and dangerous job each day when they go to work.\"They exercise this duty with courage and bravery.\"Mr Malinauskas said his thoughts were with the two officers and their families.",
        "\"I would also like to extend our thoughts and well wishes to the wider SAPOL family and all the officers who work so hard to keep our community safe,\" he said.A shop worker in Crystal Brook, who believed she served the dead man earlier in the day, said they had chatted about the rain and his dog.\"Not long after we found out there was a siege down the street where he lived,\" she told Adelaide radio FIVEaa.\"From there we found out more information, exactly what did take place.\"Which is pretty scary and hard to hear. These things don't really happen to a small country town very often.\"The SA Police Association said it was providing support to the families of the two officers.President Mark Carroll said there would obviously be a commissioner's inquiry to determine how the incident unfolded.But he said it was an example of how situations could quickly escalate.\"Policing is a highly dangerous occupation. We try to be as safe as we possibly can,\" Mr Carroll said.\"But it's so unpredictable. People can do things in an instant.\"No South Australian police officer has been killed while on duty for more than 20 years.The last was Senior Constable Bogdan Josef Sobczak who died in a motorcycle crash in 2002."
    ]
}