{
    "articleURL": "/news/article-12056199/Nimbin-MardiGrass-2023-Thousands-gather-call-reform-Australias-cannabis-laws.html",
    "content": [
        "MardiGrass festival was held in Nimbin on the NSW north coastThe event ran from Friday to Sunday including the 'Big Rally' parade The tiny Australian village of Nimbin was awash with green more than usual this weekend as thousands of revellers turned out for the MardiGrass Festival and cannabis law reform protest. ",
        "The village, about an hour's drive from Byron Bay on the NSW north coast with a population of just 1,800 people, has been holding the festival annually since 1993.MardiGrass began as a peaceful demonstration following a lengthy police crackdown on marijuana in the region, with organisers stating they intend to hold the event every year as a way to 'protest, educate and celebrate' until the drug is legalised in Australia.This year's event, the 31st in its history, ran from Friday to Sunday and drew in large crowds for the dozens of activities spread throughout the three days, including the main event, the colourful cannabis law reform rally and parade on day three. Spectators lined the road as floats and participants made their way along the main street, many dressed in outlandish and colourful costumes, including the 'ganja fairy' dancers with their marijuana leaf fans.",
        "Other activities throughout the weekend included the sporting competition style Hemp Olympix, the Green Cabaret stage show, Kombi van Konvoy, and the Hemposium conference featuring dozens of guest speakers.  'There's quite a lot of excitement over getting Legalise Cannabis MP Jeremy Buckingham elected in NSW,' MardiGrass Organising Body president Michael Balderstone said.The political party, which was founded in Nimbin and formerly known as the Help End Marijuana Prohibition (HEMP) Party, now has five elected state Senators - two in Victoria, and two in WA along with Mr Buckingham.",
        "'A highlight of MardiGrass will be the handful of new Legalise Cannabis senators attending, and with their Green counterparts,' Mr Balderstone said.'There's a terrific program of speakers on all things cannabis now at four different venues if we include the Northern Rivers Hemp Growers Co-op.'The new business in the village held a series of talks including a 'hemp root puppet making workshop' with Hempstone - hemp concrete - creator Martin Ernegg.The Co-op also held a Senators' learning circle where cannabis party and green Senators spoke with farmers and producers  to discuss strategy and tactics as their self proclaimed cannabis 'revolution' progresses. ",
        "Dr Karen Hitchcock, one of Australia's first authorised prescribers of medical cannabis spoke at the event.While there was also an appearance from Wilfred the Stoner Dog.The famous canine comedian from his own TV series, which briefly got a US remake co-starring Elijah Wood, has now apparently become a 'ganjapreneur'.   Fellow comedians the Laugh Mob coming from Sydney turned up for their annual show held in the 'Indica Arena'.While 'Sativa Stadium' was the home of the Hemp Olympix which included events like the Growers' Iron Person Event and the Bong Throw and Yell. The Joint Rolling competitions were held in the Town Hall.As were the MMMAs, or the MardiGrass Marijuana Music Awards, where no song can be longer than 4 minutes 20.",
        "'It's hard to believe we are still labelled as criminals as much as ever,' Mr Balderstone said.'Thirty years of loudly crying out about the mistake of banning the most useful plant in creation, and despite the experts now agreeing with us, there's still no let up on hunting down cannabis users.''Giant pharmaceutical companies are the only people allowed to grow natures best painkilling plants and we can only access them legally via a doctors approval.''Cannabis and the opium poppy were in the majority of medicines only a century ago, now Big Pharma controls what medicine we are allowed to use and what not,' he said.'Basically we've lost the plot it seems on this issue of prohibition. MardiGrass is about enjoying life and the heaven we are standing in.'In Australia prescription-only cannabis was legalised in 2016 but it still remains illegal to privately grow or have without a prescription.However, Australian attitudes are changing according to a 2019 National Drug Household Survey conducted by the government.The survey found about 41 per cent of the population 14 and over supported legalising marijuana, up from 26 per cent in 2004.While those opposed to its legalisation are now in the minority at 37 per cent, down from 54 per cent in 2004."
    ]
}