{
    "articleURL": "/wires/ap/article-12060827/Colorado-woman-guilty-killing-11-year-old-stepson.html",
    "content": [
        "DENVER (AP) - A judge sentenced a woman convicted of killing her 11-year-old stepson in Colorado and dumping his body over a bridge in Florida to life in prison without parole on Monday, calling her claim that she was insane and that one of her other personalities killed him a disservice to those who are mentally ill.",
        "Earlier in the day, jurors found Letecia Stauch guilty of first-degree murder and other charges she faced in Gannon Stauch´s killing over three years ago. Prosecutors said she stabbed Gannon 18 times as he tried to fight her off before hitting him in the head and then shooting him once.Prosecutors claimed Stauch killed the boy in January 2020 because she hated him and wanted to hurt his father, Al Stauch, whom she planned to leave and who was away on a National Guard deployment at the time. They said she then put his body in a suitcase and drove over 1,300 miles with it in a rented van.Judge Gregory Werner said Stauch was also motivated by \"hatred and jealousy\" of Gannon´s mother, Landen Bullard, and resentful of being left to take care of Gannon and his younger sister.Unlike other defendants with mental health problems, Werner said Stauch was never surprised by what her alleged other personality did but instead took conscious steps to cover up her actions.\"There is no time during the minutes, hours and days following the murder where Letecia came out and wondered 'Gee, why am I carrying a body around a body in my luggage?' That just isn't credible,\" he said.Al Stauch broke down in court while addressing Gannon, saying he would never would have thought he was leaving him with his \"murderer.\" Both he and Bullard recalled how their severely premature son weighed about a pound and a half when he was born, able to fit into the palms of his dad´s hands, but proved to be a survivor.",
        "\"You came into this world fighting. Unfortunately, you left this world fighting,\" Bullard said.Stauch did not deny killing Gannon, but she pleaded not guilty by reason of insanity. The defense argued that she killed Gannon during a \"psychotic break\" caused by trauma from being physically, emotionally and sexually abused during her childhood.Experts at the state mental hospital concluded that Stauch had a personality disorder with borderline and narcissistic features but was sane at the time Gannon was killed. Under Colorado law, that means understanding the difference between right and wrong and being able to form the intent to commit a crime.The main defense witness, Dr. Dorothy Lewis, author of the book \"Crazy, Not Insane\" and featured in an HBO documentary with the same title, concluded Stauch suffered from dissociative identity disorder - when someone has two or more personalities as the result of trauma - and was not sane at the time Gannon was killed.In the weeks leading up to Gannon's killing, Stauch was diagnosed with generalized anxiety disorder after she was referred to a psychologist while being treated military health clinic. Therapist Ronda Niederhauser testified that Stauch did not show any signs of being a threat to herself or others and was aware of her surroundings.",
        "Authorities believe Stauch killed Gannon in his bedroom a few hours before reporting him missing on Jan. 27, 2020, saying he had not come home from playing with friends. Dozens of volunteers helped search for the boy in the area around where the family lived near Colorado Springs. However, investigators later revealed that Stauch concocted a variety of stories to mislead them, including that a man she hired to repair a carpet raped her and then abducted Gannon.After Al Stauch became suspicious of his wife, he allowed the FBI to listen in on his phone calls with Stauch, trying to draw out more information from her about where Gannon was. Hours of audio from those calls along with video recordings of interviews with Stauch about her mental health were a prominent part of the evidence offered during the five-week trial.Gannon´s body was found in a suitcase below a bridge on the Florida Pandhandle during an inspection done twice a year in what prosecutors called \"divine intervention.\"Stauch was convicted of first-degree murder after deliberation, first-degree murder of a child by a person in a position of trust, tampering with a deceased human body and tampering with physical evidence.She did not appear to show any reaction to the verdict as it was read, sitting at the defense table between her two lawyers, or as Al Stauch, Bullard and others spoke to the judge about how Gannon's killing had hurt them."
    ]
}