{
    "articleURL": "/wires/aap/article-12057045/Super-funds-accused-boosting-fossil-fuel-investments.html",
    "content": [
        "Australia's 30 biggest superannuation funds invested an extra $34 billion last year in companies most responsible for expanding fossil fuel use.",
        "Analysis by Market Forces, which wants banks and super funds to use investments to protect the environment, shows the money boosted capital in companies developing coal, oil and gas projects by 50 per cent over the past year.It says the funds have more than nine per cent of their members' share investments in \"climate-wrecking companies\".But Australia's largest super fund, AustralianSuper, has defended its investments in the gas sector, including petroleum company Woodside, saying it is an important part of an orderly energy transition over coming years.Market Forces estimates more than $140 billion of Australians' retirement savings are invested in companies directly involved in expanding fossil fuels.Its superannuation funds campaigner Brett Morgan said funds were making a mockery of their commitments to net zero by buying up wholesale in those companies and \"letting them get away with trashing our climate\".\"Australia's super sector is collectively responsible for threatening members' safety in retirement with a whopping $140 billion gamble against a stable climate future.\"Mr Morgan said the share value of fossil fuel companies had generally increased over the past year due to a supply shortage fuelled in part by the Russia-Ukraine war.But he said Market Forces' analysis showed some Australian super funds had also been buying millions of shares in them.",
        "Market Forces estimates AustralianSuper's default option bought at least 30 million shares in Woodside in 2022, increasing its stake by nearly 19 times.\"Australia's biggest super fund has bought up big in Australia's biggest climate wrecker and a growing number of members are outraged by this,\" Mr Morgan said.\"AustralianSuper needs to explain to its millions of members why it's actively buying shares in Woodside while failing to address this company's reckless fossil fuel expansion plans.\"Responding to the Market Forces report, AustralianSuper said it had increased its exposure to Woodside through the company's merger with resources giant BHP and other activity.\"The gas sector is an important part of the orderly energy transition over coming years,\" a spokesman for the fund said.\"As an active and responsible owner, we will continue to proactively engage with Woodside to understand how the company plans to transition its operations to deliver long-term value to members in a low-carbon environment.\"AustralianSuper fund member Craig Shaw, a market research executive from the NSW Central Coast, said super funds increasing their exposure to fossil fuel investments was \"nigh on criminal\".\"Yes there's an objective about maximising returns but not paying attention to what the underlying business is doing to the planet I think is a big problem,\" he told AAP.",
        "Another member, Tamara Winkoff, a former architect from Sydney, said she was motivated to move her money if she felt her fund was \"greenwashing\".\"I don't want to see the savings I'm relying on to survive in my old age being used to destroy the world,\" she told AAP."
    ]
}