{
    "articleURL": "/wires/reuters/article-12055949/Gavaskar-suggests-IPL-break-struggling-Rohit-WTC-final.html",
    "content": [
        "NEW DELHI, May 7 (Reuters) - Batting great Sunil Gavaskar has advised India captain Rohit Sharma to take a break from the ongoing Indian Premier League (IPL) to keep himself fit and fresh for the World Test Championship (WTC) final against Australia next month.",
        "Mumbai Indians captain Rohit fell for his 16th duck in IPL, most by any batters in the tournament's history, in Saturday's defeat by Chennai Super Kings and now has five runs from four innings.The off-colour opener demoted himself to number three against Chennai but fell for his second successive duck after attempting an ill-fated scoop shot against Deepak Chahar.Rohit will lead India's bid for the WTC title at the Oval on June 7 and Gavaskar felt a break could do wonders to the opener's fitness and confidence.\"I would say that Rohit should maybe take a break for the time being and keep himself fit for the World Test Championship final,\" the former India captain told Star Sports channel.\"He can come back again for the last few matches, but right now (he should) take a little bit of a breather himself.\"New Zealand beat India in the final of the inaugural WTC in 2021 and Rohit would have to lead by example if they are to prevail this time around despite mounting injury woes.India will be without pace spearhead Jasprit Bumrah, recovering from a back surgery, and first-choice wicketkeeper Rishabh Pant, who remains sidelined after a horrific car crash in December.Batters KL Rahul (thigh) and Shreyas Iyer (back) have also been ruled out of the contest at the Oval with injuries.",
        "Five-time champions Mumbai, the most successful IPL team, are sixth in the points table having won five of their 10 league matches so far.They host Royal Challengers Bangalore in their next match at the Wankhede Stadium on Tuesday. (Reporting by Amlan Chakraborty in New Delhi; Editing by Muralikumar Anantharaman)"
    ]
}