{
    "articleURL": "/news/article-12055473/And-afterparty-Mother-concerts-Big-Lunches-planned-today.html",
    "content": [
        "At noon the Eden Project's Coronation Big Lunch events start across the countryTake That will lead a party to Never Forget at 8pm with the Coronation ConcertBritain is poised to continue celebrating the King's crowning in style today - as a series of events are set to keep the Coronation spirit rolling.",
        "At noon the Coronation Big Lunch events will start across the country - with senior royals expected to make appearances.And in the evening royal devotees will be rocking and rolling as gates open to the Coronation Concert. Thousands of street parties are expected to be held over the weekend, with people encouraged to come together for what has been dubbed the 'Coronation Big Lunch'.More than 3,600 have been organised across the UK with more than 50 overseas - as far afield as Hong Kong and California.",
        "Organisers told MailOnline that the most northern event in Britain is planned on the Shetland Islands, while the most southern event will be on the Isles of Scilly. ",
        "Buckingham Palace said the lunches at 12am from Saturday to Monday will be 'a nationwide act of celebration and friendship', with some Royal Family members set to join in. On Sunday, the Duke and Duchess of Edinburgh will attend a Big Lunch at Cranleigh in Surrey, while Princesses Beatrice and Eugenie will be at one in Windsor.And on BBC1's Coronation: the UK Celebrities - Live, familiar BBC faces including Breakfast's Jon Kay and Carol Kirkwood will be dropping in on Big Lunches and street parties from Mortlake to Morecambe, talking to revellers about their festivities and no doubt sampling a few Coronation Quiches along the way.",
        "Big Lunches take place across the UK every year with more than one million held since 2009. Last year the events raised more than £22million for local charities.The gatherings are overseen by the Eden Project, which is an educational charity and visitor attraction based in Cornwall. ",
        "The Coronation quiche created in honour of the new King had its limelight stolen as shoppers appeared to favour Coronation chicken ahead of the celebrations this weekend.Quiches are filling up trolleys as a party food classic, but the raw ingredients needed to make the Coronation quiche have not been in popular demand, according to The Times.Meanwhile, searches for Coronation chicken - created for the crowning of the late Queen in 1953 - have doubled on the Waitrose website this week.",
        "They aim to bring neighbours together to celebrate the Coronation, and Camilla has been patron of the initiative since 2013. A statement on the Eden Project website said: 'As events go, they don't come much bigger than the crowning of a new monarch.'We're excited to be part of the official celebrations and we'd love for people across the UK (and the world!) to hold a Coronation Big Lunch to celebrate.'Those wanting to get involved have been able to request a Coronation Big Lunch pack from the Eden Project, which features ideas, tips and practical notes to help with an event. ",
        "Charles and Queen Camilla have personally chosen a recipe for 'Coronation Quiche' in celebration of the Big Lunches due to be staged to mark their Coronation. Last month the couple shared a recipe for the open-baked savoury dish, which features spinach, broad beans and tarragon. It was created by royal head chef Mark Flanagan and was chosen by Charles and Camilla in collaboration with him. Former Buckingham Palace chef Darren McGrady said the King's choice came as no surprise because Charles loves anything with eggs and cheese. ",
        "For the late Queen Elizabeth II's coronation in 1953, Coronation Chicken – cold chicken in a curry cream sauce with a well-seasoned dressed salad of rice, green peas and mixed herbs – was invented to feed the foreign guests who were entertained at Buckingham Palace after the ceremony.Buckingham Palace said the quiche was chosen because it worked as a sharing dish, can be served hot or cold, suits a wide variety of dietary requirements and can be easily adapted to suit different tastes. In the evening, Take That will lead a party to Never Forget at 8pm to celebrate the Coronation. The group are said to be one of the many acts performing at the concert, with three of the band's original members; Gary Barlow, 52, Mark Owen, 51, and Howard Donald, 54, set to hit the stage.",
        "They said: 'A huge live band, choir, military drummers, the backdrop of Windsor Castle and the celebration of a new King – we can't wait.' ",
        "But fourth bandmate Robbie Williams will be noticably missing from the line-up, as he reportedly turned down the gig. He is one of a prestigeous list to refuse the honour - including Elton John, Harry Styles, the Spice Girls and Adele.The show will be aired on BBC1 and Radio 2 along with catch-up services.While many are expecting a roster of British performer, US native Katy Perry will also be performing at the event.As a special honour in return for her performance, Katy will be allowed an exclusive stay in the royal residence of the 1,000-year-old castle.Lionel Ritchie is also set to perform, with the legendary singer admitting that the offer came as a shock to him.He recently shared: 'I mean, you don't get in the business and say, \"You know what? I'll be at the King's coronation.\" You know, that just never comes up,' Richie said. '[It's] A, a surprise. B, what an honor. And C, the fact of all the names that are out there that he could have had for this, he called my name.'Freya Ridings, known for her hit Lost Without You, will give a touching performance for the new King too.",
        "While Andrea Bocelli and Welsh singer Sir Bryn Terfel will be taking the limelight as a duo act.",
        "A number of choir groups will also join forces as an official coronation choir, including refugee, NHS and LGBTQ+ singing groups.While it will be hosted by actor Hugh Bonneville.Olly Murs, Paloma Faith, Nicole Sherzinger and Tom Cruise are also set to appear at the event, hosted by actor Hugh Bonneville. And in a nod to Paddington Bear's cameo at the late Queen's Platinum Jubilee, Winnie the Pooh will feature. "
    ]
}