{
    "articleURL": "/wires/ap/article-12038463/Wisconsin-Supreme-Court-wont-order-ivermectin-use-COVID.html",
    "content": [
        "MADISON, Wis. (AP) - Wisconsin's conservative-controlled Supreme Court ruled Tuesday that a hospital could not be forced to give a deworming drug to a patient with COVID-19, saying a county judge did not cite a legal basis for ordering the facility to administer ivermectin.",
        "Ivermectin became popular among conservatives after commentators and even some far-right doctors held up the antiparasitic drug as a miracle cure for the coronavirus and other illnesses. But the Food and Drug Administration has not approved it for use in treating COVID-19 and warns that misusing ivermectin can be harmful, even fatal.The Wisconsin lawsuit is one of dozens filed across the country seeking to force hospitals to administer ivermectin for COVID-19. The drug is commonly used in cattle and also approved for human use to fight parasites and certain skin conditions. But some members of online alternative medicine groups have reported self-administering highly concentrated, veterinary grade ivermectin to treat illnesses. The FDA warns that self-administering the drug, especially in doses intended for animals, can be lethal.In Tuesday's ruling, the Wisconsin Supreme Court ruled 6-1 in favor of Aurora Health Care, with three liberals and three conservatives in support and only conservative Justice Rebecca Bradley dissenting.The decision upholds an appeal court´s ruling against Allen Gahl, who sued Aurora in October 2021 when doctors refused to treat his uncle, John Zingsheim, with ivermectin. Gahl was authorized to make medical decisions for Zingsheim and had researched the drug online after Zingsheim was put on a ventilator to treat COVID-19 complications.Gahl obtained a prescription for ivermectin from a retired doctor who had never met Zingsheim or his medical team, but hospital staff said the drug did not meet their standards and refused to administer it. None of the information in the complaint Gahl subsequently filed against the hospital came directly from medical professionals, according to court documents.",
        "The Waukesha County Circuit Court ordered hospital staff to give Zingsheim the drug but later modified its decision to say Gahl would have to provide the drug himself, as well as a doctor to administer it. An appeals court overturned that decision after Aurora´s attorneys argued a judge could not force a medical provider to give treatment they had determined to be substandard. The Supreme Court heard arguments in the case in January.\"We do not know what viable legal claim the circuit court thought Gahl had presented,\" Justice Ann Walsh Bradley said in the court's opinion.Gahl was represented by the Amos Center for Justice, a conservative Wisconsin law firm that has brought litigation against ballot drop boxes and promotes conspiracy theories about the safety of COVID-19 vaccines on its website. His attorney, Karen Mueller, did not immediately return a voicemail Tuesday seeking comment.___Harm Venhuizen is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Venhuizen on Twitter."
    ]
}