{
    "articleURL": "/news/article-12051875/Video-shows-Marine-veteran-Daniel-Penny-ignoring-warnings-restraining-Jordan-Neely.html",
    "content": [
        "WARNING: GRAPHIC CONTENT Fuller video shows the 2 minutes after Jordan Neely appeared to go limp A bystander warned Penny of a 'murder charge' and told him to let Neely go READ MORE: Marine veteran in chokehold incident is decorate sergeant An extended video of Marine veteran Daniel Penny putting homeless man Jordan Neely in a fatal chokehold shows him continuing to restrain Neely for 45 seconds after he went limp and ignoring bystanders who warned: 'You're going to kill him.'",
        "Penny was questioned by the NYPD on Monday but was released without charge. The investigation is ongoing and it is likely that a grand jury will be impaneled to determined whether or not charges should be brought. Penny's attorney tells DailyMail.com they have contacted the DA's Office and the NYPD to cooperate. ABC cites law enforcement sources who say the DA's office have spoken with six witnesses, but are seeking at least another four.  Initial footage showed Penny holding Neely in a chokehold while two other men restrained his arms, but it did not show the moment Penny released him. ",
        "Witnesses say Neely, who was schizophrenic, was behaving erratically, throwing garbage and screaming that he wanted to 'die' or 'go to jail' because he was fed up about having no food. The longer video that emerged today shows the three minutes and 52 seconds after the train pulled into Broadway Lafayette station on Monday at 2.30pm. The footage begins with Penny already with Neely in the chokehold. For two minutes and five seconds, Neely struggled on the floor, flailing his feet. He went limp after two minutes and six seconds, by which point a by-passer had stepped onto the train.The man - who can be heard but is not seen - warned Penny that Neely had defecated, which he feared was a sign that he was dying.",
        "'He's defecated on himself... you're going to kill him now,' he said. ",
        "Another man who was helping Penny restrain Neely replied that it was an old stain on Neely's trousers, and that Penny was no longer 'squeezing'. 'He's not squeezing? All right. Because after he's defecated himself that's it. You've got to let him go,' he replied. He then warned of a 'murder charge'.  The second man turned to Neely and said: 'Hey can you hear me?'. Met with silence, the man told Penny to stand up. Penny does not speak, but releases Neely and springs to his feet. The unidentified by-stander can be heard saying: 'That was one hell of a chokehold, man.' Over the next several seconds, Penny and the other man who had been helping him attempt to put Neely in the recovery position. After three minutes and 50 seconds, Neely appears to convulse or take a deep breath. The video cuts out at three minutes and 52 seconds. It is unclear whether he moved again.",
        "The NYC Medical Examiner who yesterday ruled Neely's death a homicide has not confirmed the exact time of death. Police arrived at the scene but Neely did not regain consciousness. He was pronounced dead at Lenox Hill hospital later in the afternoon. Manhattan DA Alvin Bragg must now weigh whether or not to bring charges. ",
        "He and the NYPD are appealing to the public for information about the incident. There were no surveillance cameras on-board the train in question. In a statement yesterday, a spokesman for the DA's office said: 'This is a solemn and serious matter that ended in the tragic loss of Jordan Neely’s life. 'As part of our rigorous ongoing investigation, we will review the Medical Examiner’s report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records. 'This investigation is being handled by senior, experienced prosecutors and we will provide an update when there is additional public information to share. 'The Manhattan D.A.’s Office encourages anyone who witnessed or has information about this incident to call 212-335-9040.'"
    ]
}