{
    "articleURL": "/wires/afp/article-12054505/Baby-Malinga-leads-Chennai-big-IPL-win-Mumbai.html",
    "content": [
        "England's Phil Salt hit a blazing 87 to power Delhi Capitals to a thumping seven-wicket victory over Royal Challengers Bangalore in the Indian Premier League on Saturday.",
        "Salt struck his second half-century in his debut IPL season to steer Delhi's chase of 182 as the home team won with 20 balls to spare at the Feroz Shah Kotla ground.Salt, a wicketkeeper-batsman, began with a 60-run stand with skipper David Warner, who hit 22, and then put together 59 runs with Mitchell Marsh, who smashed 26.The batting effort trumped Virat Kohli's 55 and an unbeaten 54 by Mahipal Lomror which helped Bangalore to 181-4 after electing to bat first.Salt got into a mid-pitch exchange with opposition pace bowler Mohammed Siraj and the verbal duel only spurred him to finish with six sixes in his 45-ball knock.Leg-spinner Karn Sharma bowled Salt before Rilee Rossouw hit an unbeaten 35 off 22 balls and sealed the match with a six.Delhi, who started the season with five losses, moved up from the bottom to ninth in the 10-team table with slim chances of making the top four for a place in the play-offs.Delhi's South African import Anrich Nortje missed the match after he flew back home late Friday due to a \"personal emergency\".The spotlight remained on the Delhi-born Kohli as the former captain set foot on the ground in front of a capacity crowd, mostly wearing the star's Bangalore jersey.",
        "His every run was cheered and the superstar, who was playing his first game after an ugly spat with Lucknow mentor Gautam Gambhir, obliged the fans with his fifth half-century of the season.",
        "In-form skipper Faf Du Plessis, who consolidated his top spot in the batting chart with 511 runs, put on an 82-run opening stand with Kohli.But it was Lomror who set the Bangalore innings on fire with his blitz after Mitchell Marsh sent back du Plessis, for 45, and Glenn Maxwell, for a first-ball duck.In the first match of the day, Sri Lanka's Matheesha Pathirana led an inspired pace attack to help Chennai Super Kings hammer Mumbai Indians by six wickets in a clash of IPL heavyweights.Pathirana, who is called \"Baby Malinga\" for his slinging action similar to former Sri Lankan pace ace Lasith Malinga, returned figures of 3-15 to limit five-time winners Mumbai to 139-8 in Chennai.New Zealand opener Devon Conway made 44 as M.S. Dhoni's Chennai -- four-time IPL champions -- romped home with 14 balls to spare and move second in the 10-team table.Dhoni praised Pathirana, saying, \"People who don't have any clean action, batsmen have a difficult time picking it. But his consistency, pace makes him special.\""
    ]
}