{
    "articleURL": "/news/article-12057271/Whos-royal-box-Coronation-Concert-VIPs-best-seats-house.html",
    "content": [
        "PM Rishi Sunak and I'm A Celeb star Mike Tindall were among the VIPs treated to the best seats in the houseStars from the worlds of politics and royalty were out in force at last night's Coronation Concert as they joined the newly-anointed King and Queen inside the Royal box. ",
        "Prime Minster Rishi Sunak and I'm A Celeb star Mike Tindall were among the VIPs treated to the best seats in the house at the star-studded spectacle, which featured performances from Katy Perry, Lionel Richie and Take That.The historic concert, presented by Downton Abbey star Hugh Bonneville, took place in the grounds of Windsor Castle and on the biggest stage ever built in Britain. Naturally, a string of senior royals were seen front and centre in the box as they waved their Union Jack flags and swayed to the music, including the Duke and Duchess of Edinburgh, Edward and Sophie and their children Lady Louise Windsor, 19, and James the Earl of Wessex, 15. Around 20,000 jubilant spectators were also in the grounds to enjoy the show, while millions more watched from TV screens around the world. ",
        "King Charles III and Queen Camilla were joined on the front row by some of their closest family members, including Prince William and Princess Catherine of Wales and their children George, nine, and Charlotte, eight. Unfortunately it was past the bedtime of the Wales's youngest son Prince Louis, five, who stayed at home. Sitting next to Charles was the general secretariat of the Commonwealth Baroness Patricia Scotland, who brought her husband Richard Mawhinney.",
        "They were joined in the box by other leaders from the community of nations, including Dame Susan Dougan, the Governor of St Vincent and the Grenadines.As night fell, the royals donned their glowstick wristbands and got to their feet as they started dancing to Lionel and his classic hit All Night Long.Charles and Camilla laughed and chatted as they bopped along, with Kate, Charlotte and George also getting into the groove.Mother-of-three Princess Kate, 41, looked radiant in a striking red suit from one of her favourite British fashion brands, Alexander McQueen.She sat with her children George and Charlotte, who after also stealing the show on Saturday with their adorable antics, put on a similarly animated display at the star-studded concert. The duo appeared to be having a whale of a time within moments of the event kicking off, as they danced and jigged along to the songs being played including Katy Perry's Roar.",
        "However Princess Charlotte, eight, who took little brother Prince Louis under her wing at yesterday's Coronation, didn't appear too keen on Pete Tong's 'Ibiza classics'.It comes amidst a busy weekend for the little royals, who all played a starring role in the Coronation on Saturday to watch their grandfather be crowned King. Also there was Prince Andrew, the Duke of York, and his ex-wife Sarah Ferguson, who divorced in 1996 but have remained close and put on a friendly display at the Coronation concert together.",
        "Sarah, known to many as Fergie, marked the moment on Instagram, sharing a sweet snap of the royal couple from the day's celebrations. Their daughters Princess Beatrice and Princess Eugenie also attended the historic event, being held on the castle’s East Lawn, with their husbands Edo Mapelli Mozzi and Jack Brooksbank.",
        "Also in attendance was the Duke and Duchess of Edinburgh, Prince Edward and Princess Sophie and their daughter Lady Louise Windsor, 19, who is at university student at St Andrew's.James, Earl of Wessex, 15, who rarely makes public appearances, also looked smart in a black suit which he paired with a white shirt and a burgundy tie. The couple had attended the final rehearsal of a choir specially assembled by celebrity choirmaster Gareth Malone earlier in the day, during which the duke cracked a joke to the 300-strong band.The Princess Royal's son Peter Phillips and his partner Lindsay Wallace were also seen taking their seats.Princess Anne's son, 45, looked relaxed as he arrived at the concert with his girlfriend Lindsay Wallace and his two daughters Savannah, 12, and Isla, 11 . Princess Anne's daughter Zara Tindall was also seen in the royal box with her husband, I'm a Celebrity star Mike Tindall, speaking to the BBC director-general Tim Davie.",
        "Mother-of-three Zara, 41, who is the King's niece, looked stunning in green as she arrived at the concert this evening, arm-in-arm with her husband Mike. ",
        "Prime Minister Rishi Sunak was seen enjoying festivities with his wife Akshata Murthy, while the Leader of the Opposition Sir Keir Starmer was also seen soaking up the celebratory atmosphere with partner Victoria.Other political heavyweights that were invited in the royal box were Foreign Secretary James Cleverly, Speaker of the House of Commons Sir Lindsay Hole, Chancellor of the Duchy of Lancaster Oliver Dowden and the Commonwealth Secretary-General Patricia Scotland. ",
        "The King and Queen were seen arriving for the Coronation Concert just after 8pm and immediately got in the spirit by waving the Union Flag as the show began.Charles III and his wife Camilla walked into the royal box to roars from the 20,000-strong crowd who did three cheers for the couple who waved and grinned back as the sun set over Windsor Castle.Stars including Nicole Scherzinger and Amanda Holden were also in place for the spectacular show on a Union Flag-shaped stage where pop icons including Katy Perry, Lionel Richie and Take That will performed.More than 20,000 people attended the show, which was hosted by Downton Abbey star Hugh Bonneville.Nicole Scherzinger said she felt like a Disney princess when she was rehearsing her song for the Coronation Concert.",
        "The Pussycat Dolls frontwoman performed a rendition of Reflection, which was written and produced for Disney's 1998 animated film Mulan.",
        "Ms Scherzinger said backstage ahead of the event that she felt 'overjoyed' and 'honoured' to take the stage.'Now that I'm here, it just feels really surreal. Being on the ground and having Windsor Castle as your backdrop is the dream,' she added.The concert was considered by many to be a crowning touch on the magnificent weekend, after joyous big lunch celebrations today and a surprise walkabout by the Prince and Princess of Wales.",
        "During the celebrations, Prince William paid a moving tribute to his father, telling him: 'Pa, we are all so proud of you.'He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven.William delivered his emotional address from Windsor Castle as the nation celebrated the crowning of King Charles and Queen Camilla with the official Coronation Concert, a glorious mix of music, dance and the spoken word.Set on a spectacular stage shaped like a multi-tier Union flag, it was an unashamedly patriotic highlight of a long weekend of celebrations.Events to mark Saturday's Coronation will culminate today with a 'day of service' dubbed the Big Help Out as senior royals join volunteers around the country."
    ]
}