{
    "articleURL": "/wires/aap/article-12049377/Walters-backs-super-sub-Fyfe-thrive-against-Hawks.html",
    "content": [
        "Fremantle veteran Michael Walters has backed Nat Fyfe to get through Saturday night's AFL clash with Hawthorn even if he's subbed into the action earlier than planned.",
        "The Dockers have confirmed that Fyfe will be named as the tactical sub for the Optus Stadium encounter in what will be his first appearance since round one.A painful case of plantar fasciitis has grounded Fyfe over the past six weeks.But with the Dockers' finals hopes on thin ice at 2-5, the two-time Brownlow medallist will be brought straight back through the senior team instead of a carefully-managed run in the WAFL.The move comes with risks, and Fremantle will be hoping to avoid any early injuries against Hawthorn to ensure Fyfe doesn't enter the fray too early.Walters, who returned from an Achilles injury via the sub role in round two, is backing Fyfe to thrive no matter how long he is needed.\"The plan is for him to come on when scheduled,\" Walters told reporters on Friday.\"But there's no doubt he'll be ready to go if there was an injury\"We won't bring someone in for the sub unless they're fully ready to play a full game if need be. He's definitely ready.\"The exact role Fyfe will play when he runs on remains a mystery.Fremantle wanted Fyfe to play as a full-time forward this year, but coach Justin Longmuir is now open to injecting the 31-year-old back into the midfield to help fix the club's clearance and contested ball woes.",
        "Whether Fyfe would be ready for a midfield role in his first game back remains to be seen, but the axing of Will Brodie opens the door for the former skipper to play a role in there.Walters praised Fyfe's leadership this year.\"Even though he's not captain or in the leadership group, his leadership throughout the club, each and every day, has been unreal,\" Walters said.\"He's been teaching those midfielders little crafts here or there to get better.\"But also coming up forward, he's just been a sponge.\"He's been trying to learn as much as he can. Even though he's been here for 14 years, he's still trying to get better.\"Hawthorn (1-6) enter Saturday's clash without Changkuoth Jiath (managed) and Luke Breust (managed), while last week's debutant Max Ramsden was dropped.Former Dockers ruckman Lloyd Meek has been named to take on his old club, while Connor Macdonald and Jack Scrimshaw were also included in the 22.Fremantle welcome back Michael Frederick from an adductor injury, and handed spearhead Josh Treacy a recall.Matthew Johnson goes out through suspension, while Brodie and Sam Sturt were axed."
    ]
}