{
    "articleURL": "/wires/ap/article-12052807/Veteran-jurist-picked-weigh-moving-Trump-s-criminal-trial.html",
    "content": [
        "NEW YORK (AP) - A judge known for his care and cautiousness in presiding over litigation in the aftermath of the 9/11 attacks was selected Friday to decide whether Donald Trump ´s criminal case proceeds in state or federal court.",
        "Alvin Hellerstein, a Manhattan federal judge for a quarter century, picked up the case after it was originally assigned to a colleague whose husband was a key prosecutor in special counsel Robert Mueller ´s investigation of the former president.Trump´s lawyers petitioned Thursday to have a federal court seize control of his criminal case, arguing that the case \"involves important federal questions\" and shouldn´t be tried in the state court where his historic indictment was brought.Such requests are rarely granted in criminal cases, but Trump´s request is unprecedented because he´s the first former president ever charged with a crime.The matter was initially assigned Friday to Judge Ronnie Abrams. Hours later, the docket showed it had been reassigned to Hellerstein. Abrams previously recused herself from a Trump-related case in 2017 because of husband Greg Andres' work investigating ties between Russia and Trump´s 2016 presidential campaign.Case assignments are random in federal court and the parties could choose to proceed before a federal magistrate judge who has been designated to the case, Barbara Moses.",
        "Trump, a Republican, was indicted in March and pleaded not guilty at an April 4 state court arraignment to 34 felony counts of falsifying business records related to hush-money payments and subsequent reimbursements made during the 2016 campaign and early in his presidency to bury allegations of extramarital sexual encounters.",
        "Messages seeking comment were left with Trump´s lawyers and the Manhattan district attorney´s office, which is prosecuting the criminal case.Hellerstein, now 89, was appointed to the federal bench in 1998 by Bill Clinton, a Democrat whose wife, Hillary Clinton, was Trump´s 2016 election rival. He served as a district judge until moving to senior status in 2011. Before that, he was as a litigator in Manhattan.In the aftermath of the 2001 terror attack on the World Trade Center, Hellerstein presided over dozens of wrongful death, injury and property damage lawsuits - a years-long effort that shaped his legacy on the bench.Some of the judge's former clients died in the attack and, lawyers say, he showed great empathy to victims and their families, meeting with them for hours in his chambers and rejecting what he felt were low-ball settlement offers.Others were dismayed when, in 2008, Hellerstein put an end to an effort to force New York City government to keep searching for human remains in debris moved from ground zero to a Staten Island landfill.In 2020, Hellerstein ordered Trump´s estranged former lawyer and fixer Michael Cohen released from prison after the Justice Department revoked his home confinement in an attempt to thwart him from publishing a book or talking to the media. The government´s action, he ruled, was retaliatory and a First Amendment violation.",
        "In 2015, the judge made headlines when he ordered a New York City cable company to pay a Texas woman $229,500 to a Texas for flooding her phone with 153 robocalls.Moses, the federal magistrate, was selected to the bench by a judicial panel in 2015. She was previously the director of Seton Hall University's Constitutional and Civil Litigation Clinic. She also worked at a Manhattan law firm whose partner, Elkan Abramowitz, represents a key witness in Trump´s case: David Pecker, the former National Enquirer chief executive who was involved in some of the hush-money payments.___Associated Press reporter Eric Tucker in Washington contributed to this report.___Follow Michael Sisak on Twitter at twitter.com/mikesisak and send confidential tips by visiting https://www.ap.org/tips/"
    ]
}