{
    "articleURL": "/sport/football/article-12056091/Leicester-target-Swansea-manager-Russell-Martin-Dean-Smith-fails-Foxes-up.html",
    "content": [
        "If Leicester are relegated from the top flight, the Foxes are scouting a new bossThere is reported interest in Russell Martin - hailed the 'next Brendan Rodgers' Martin has just one year left on his contract to manage Championship SwanseaLeicester are targeting the 'next Brendan Rodgers' to lead the Foxes if they cannot maintain their Premier League status for next season.",
        "Dean Smith was brought in last month to manage Leicester until the end of the season, after Rodgers was jettisoned from the hotseat due to the fear of relegation.Smith has just four games to secure top-flight football for next season, with the club currently in 16th place, only ahead of Leeds United and Nottingham Forest on goal difference. If the Foxes are relegated, they will look to someone with Championship experience, and The Sun report that they will look to acquire Russell Martin from Swansea City. Martin began his managerial career in 2019 with MK Dons, before being scouted by the Welsh side to take over in 2021.",
        "However, the 37-year-old has just one year left on his contract at the Swansea.com Stadium, and while the club would want to be compensated for the move, they would reportedly not stand in his way if he wanted to join Leicester City.Martin is seen as the 'next Brendan Rodgers', and could be used to help mould a new Leicester, after the Northern Ireland's four-year spell in charge from February 2019 until April 2023. Rodgers was also previously in charge at Swansea City, before joining Liverpool in 2012, and also taking charge of Scottish side Celtic before moving to Leicester.  ",
        "Leicester's fate as a Premier League side looked in serious jeopardy, just seven years after lifting the title in the 2015-16 season. ",
        "But picking up three points against Wolves, and draws with Leeds and Everton, have pushed the Foxes closer to safety this season - which would undoubtedly aid Smith's long-term job prospects.Leicester's bid for Premier League survival continues when they travel to Fulham on Monday, ahead of further May fixtures against Liverpool, Newcastle and West Ham.  Swansea City, who sit in 10th place in the Championship and cannot make the playoffs, complete their season with a home game against West Brom on Monday.  "
    ]
}