{
    "articleURL": "/news/article-12060529/Eight-year-old-boy-vanished-camping-trip-remote-Michigan-found.html",
    "content": [
        "Nante Niemi, 8, disappeared while camping in the Porcupine Mountains Wilderness State Park in the upper peninsula of Michigan  Niemi, originally from Hurley, Wisconsin, had been camping with his family in the area with family After a large scale rescue operation, the young boy was found on Monday afternoon An eight-year-old boy who disappeared on Saturday in the Upper Peninsula of Michigan has been found by rescue teams. ",
        "Nante Niemi disappeared in the middle of the day during his family's trip to the Porcupine Mountains Wilderness State Park on Saturday around 1pm local time. On Monday afternoon, rescue teams successfully found Niemi who had braved the elements by taking shelter under a log just two miles from his campsite. In a statement, Michigan State Police said he was in good health and reunited with his family.  ",
        "His mother Jessica had made a frantic Facebook appeal, saying: 'This is Nante but at this time they are not asking for help. 'We appreciate the outpouring support if they are in need for help I will update.'Please stay away it will make it harder to find him!'In a post to Facebook, the Hurley School District said: 'From our Hurley School Community to the hundreds of volunteers and organizations that helped bring Nante back safely, we can't even adequately express our sincere gratitude. 'Although our emotions are very raw at this time, we want to acknowledge the extreme outpouring of love and support we received over these past few days! 'May all those who took part in the search and rescue efforts know that your work will have a positive impact on many lives forever!'More than 150 search and rescue personnel from Michigan State Police and local police, including nine K9 scoured the forty square mile area on foot for the boy",
        "Air and water teams where also called in to the area for the missing youth, who was last seen wearing a white sweatshirt, grey sweatpants and black boots. ",
        "According to Michigan State Police, family members had been camping in the state park, with half of the family fishing while the other half collected firewood.Nante had asked to return to the camp site and left to walk back around 1pm on Saturday, which was the last time he was seen.Family members searched for the youngster on their own before reporting the situation to law enforcement around 6pm on Saturday. Michigan State Police warned that there is no cell phone service in the area and that they are working to improve communications. Following the boy being found safe, Michigan State Police said: 'The Michigan State Police wish to thank all of the volunteers and support services that assisted in locating this child.'The Porcupine Mountains Wilderness State Park is an area that covers 60,000 acres of forest, waterfalls, rivers, trails and ridges."
    ]
}