{
    "articleURL": "/money/cars/article-12042753/Twelve-shortest-lived-cars-sold-UK.html",
    "content": [
        "Even the famous DeLorean was only on the market for less than two yearsRead more: Is this Britain's most expensive car parking spot?The average lifetime of a car model is seven to eight years - but some models are destined to be ditched far sooner.",
        "This can be for a variety of reasons - in some cases even because the car may have been ahead of its time. In other circumstances, oddball designs might have meant they never caught on, or that the manufacturer just got things horribly wrong.Here are 12 of the shortest-lived cars sold in the UK, picked from Autocar's full list, but did they go on to make a lasting impression? Tell us your views on them in reader comments below.",
        "Audi A2First up on the list of short-lived cars is the Audi A2, an example of which would now cost around £1,800 second hand.Introduced in 2000, this 'rare off-target car from Audi', according to Autocar, was only sold up until 2005.With functional low-drag styling, it was ahead of its time, but high production costs combined with slow sales led to its early demise, and there are only 9,000 left in the UK. ",
        "Peugeot RCZNext up is the sad tale of the Peugeot RCZ, one of which will set you back around £3,500 today.What went wrong with this model? Was it that the would-be sports car shared its platform with a Partner van, as Autocar notes, or was it that buyers just didn't equate the Peugeot brand of the early 2000s with a dynamic, desirable two-seater coupe?",
        "Its striking looks and double-bubble roof meant it had its fans at the time, however, and it still has some now - with many suggesting it is on the verge of modern classic status. UK sales lasted from 2010 to 2015 and there are only 11,500 left.",
        "Smart RoadsterThink the Peugeot RCZ was a quirky two seater? 'Hold my beer,' says the Smart Roadster. This dinky oddball coupe with a targa roof hit the market in 2003 but only survived for four years until 2007. With only about 3,000 left today it remains a rare eyecatcher of a car. Autocar says that a frustrating gearbox massively hampered sales, but potential classic status beckons.A decent used Smart roadster now costs roughly £2,800. ",
        "The Honda CR-ZCan you see a theme emerging here? Two off-the-wall coupes down, it's now time to move on to the Honda CR-Z. It disappeared from British showrooms in 2013, only three years after its introduction.It was conceived as a hybrid coupe update of the classic Honda CR-X of years past, but Autocar says it wasn't fast enough to excite, while an ordinary diesel supermini matched its economy.  That meant it didn't quite deliver on its low-guilt ownership of the hybrid sports car promise.Around 3,800 are left today and a pre-owned one will cost you £5,900. ",
        "Vauxhall AmperaThe Vauxhall Ampera can certainly be put in the bracket of being ahead of its time. The range-extending electric car, which has a small petrol motor to recharge the battery, had a high price tag. This coupled with buyers' indifference to green machines at the time saw it dropped after three short years of production from 2012 to 2015.Around 1,200 Vauxhall Amperas are left on UK roads today and one will cost you £8,800. Ironically, they are in quite high demand among second-hand buyers.",
        "Range Rover Evoque ConvertibleIs the Range Rover Evoque the most 2010s car ever? As the SUV market boomed, Land Rover came up with a cunning plan, chop the roof off an Evoque and sell it to those who wanted the somewhat niche high-riding, wind-in-the-hair experience.With a starting price of £47,000, the Range Rover Evoque convertible proved to be too pricey to last even among Britain's posing classes.Hampered by its dynamics on the road, and possibly the SUV convertible being a step too far, it struggled to sell and was only made between 2016 and 2019.Today a Range Rover Evoque convertible will set you back roughly £30,000.",
        "Ford CougarNext up is the Ford Cougar, which tried to recapture the magic of the Capri days in the 70s and 80s.",
        "But by the time this came out in 1999 the market had changed, and the model only lasted until 2002.Around 700 Cougars are left today, and one will cost you £1,500. Among those who like a bargain modern classic Ford they are almost popular, but are outshone by their little brother the Ford Puma, which is considered a great drive.",
        "Aston Martin CygnetFirst introduced in 2011, the Aston Martin Cygnet only lasted two years on the market. It was essentially a Toyota iQ city car converted into an Aston Martin, so substantially more luxurious inside and a lot more expensive.Autocar says the Cygnet was allegedly dreamed up by two executives on a golf course, and only 135 are left today. The most likely place you will spot one is on London's posher streets. The owner will probably have a proper Aston Martin, too.",
        "DeLoreanDespite its enduring popularity the DeLorean only lasted on the market from 1981 to 1982. The story of the shambolic business side of the DeLorean operation is well known, but the car's problem was it was too heavy, not very quick and not very well built.By the standards of its time, however, it certainly wasn't a bad car, says Autocar. With only very few left on the UK roads today, a DeLorean will cost around £30,000. What would that value be if Back To The Future hadn't featured one? You'll need a time machine to find that out.",
        "Tesla RoadsterWas this another failed roadster, a car only ever destined to burn brightly and briefly, or ahead of its time? The Tesla Roadster lasted just one year on the market, from 2010 to 2011.Based on a Lotus Elise, Elon Musk's electric version offered remarkable speed, but the range was limited.It's a definite collector's car, and a used example could cost you whatever you are willing to pay, particularly as there are only an estimated 41 left on UK roads. There is just one Tesla Roadster for sale on AutoTrader today, it has done 4,750 miles and has a price tag of £225,000.",
        "Suzuki X-90The Suzuki X-90's strange looks really didn't help this car's chances on the market.It lasted just two years from 1995 to 1997, as it failed to rival the convertible Jeep it targeted, says Autocar. There are around 130 and one will set you back £1,500, but you will need to search high and low to find one. Even if you do, a Suzuki Jimny might be the better choice.",
        "Austin Allegro EstateAlthough the Austin Allegro was a big-selling car, the estate version is a rare beast.Autocar says it doesn't know how long it remained on sale, but the Austin Allegro Estate was in production for just 100 days. Very few are left in the UK today.",
        "Rarity has boosted its value and you should expect to pay at least a few thousand pounds for an Austin Allegro Estate... if you can find one.&gt; Read more: Autocar's full list of the shortest-lived cars on sale in the UK ",
        "Car insurance bills have a habit of creeping up, so comparing prices for the best deal is a wise move. New rules introduced to stop insurers bumping up renewal quotes haven't had the desired effect and it still makes sense to check for better deals on the comparison sites. We suggest:MoneySupermarket*Confused.com*GoCompare*Uswitch*Mail Finance* Also check Direct Line and Aviva, which do not appear on comparison sites.* Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. Car insurance: can you save money? &gt; Tips to cut the cost of car insurance &gt; Beware of these sneaky car cover fees ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}