{
    "articleURL": "/news/article-12048593/David-Starkey-slammed-appalling-claim-Rishi-Sunak-not-fully-grounded-culture.html",
    "content": [
        "Historian David Starkey said Rishi Sunak was not 'fully grounded in our culture' But his comments were slammed as 'appalling' and he was accused of racismHistorian David Starkey was embroiled in a new racism row yesterday – within hours of declaring he had 'uncancelled' himself following a previous scandal.",
        "The controversial academic came under fire for claiming Rishi Sunak – Britain's first non-white Prime Minister – was 'not fully grounded in our culture' and had been 'invisible' in plans for the Coronation.He also took aim at the Coronation itself, claiming Parliament would not be 'properly represented', that the Government was not interested in the constitution and the ceremony would highlight 'differences' instead of unity.On GB News, Dr Starkey said Mr Sunak was 'a man of immense talent and extraordinary skill, but really not fully grounded in our culture'.He added: 'I know that's a difficult and controversial thing to say, but I think it's true, and again this Coronation is going to highlight far too much our differences.'",
        "Asked to explain his comment, he said he meant differences 'in terms of religion'. GB News tweeted a clip of his interview but then deleted it after accusations of racism.Dr Starkey's comments were condemned as 'appalling' and commentators pointed out that Mr Sunak was born and raised in Britain, growing up in Southampton.Former Cabinet minister Shailesh Vara said: 'This is an appalling comment and in no way reflects modern Britain, and the people who live and work here – irrespective of their family background. 'Rishi Sunak is as enthusiastic and committed for the Coronation celebrations as the most ardent of patriotic citizens.' ",
        "Mr Sunak, a Hindu, will read from the Bible during the service, which will see members of other faiths play active roles for the first time.Nayaz Qazi, head of the Conservative Friends of India, said: 'I am appalled at the offensive comment made by David Starkey about our Prime Minister.'The comment... demonstrates his lack of understanding of what modern Britain and the Commonwealth stand for.'I, too, like Rishi, was born in Britain, and our parents like millions of others emigrated to Britain in the 1960s to make it home. 'Britain and its culture are first and foremost to us, and it is through the diversity and richness of Britain and the Commonwealth that Britain is recognised worldwide.' ",
        "Mr Qazi said the Coronation celebrated his role as monarch but also as head of the Commonwealth, and was a chance to extol 'the richness and diversity of modern Britain'.Dr Starkey, 78, was dropped by his publisher and lost two university positions after prompting outrage by claiming slavery was not genocide because there are 'so many damn blacks' in Africa and Britain. Canterbury Christ Church University terminated his role as a visiting professor over the comments in 2020 and he resigned from his honorary fellowship at Cambridge University's Fitzwilliam College.",
        "Dr Starkey told the latest edition of The Spectator magazine he had been 'spat out' by Cambridge University, adding: 'I'm a very determined person and I feel I have things that are worth saying. I am not going to be cancelled.'I have uncancelled myself. I believe in fighting. If you think that two or three words can destroy a lifetime's achievement, isn't there something seriously wrong?'Dr Starkey insisted his comments were not racist, saying: 'I've never made a racist utterance in my life.' He also described tomorrow's Coronation as 'the most extraordinary potpourri' and said Charles took a 'pick'n'mix' approach to religions.He condemned the decision for peers not to wear robes and coronets, saying: 'It was a magnificent piece of theatre. And that's gone.'We will now have this extraordinary miscellaneous collection of people, the sort traditionally referred to as the \"salt of the earth\", in sloppy dress.'I think that the disappearance of our old governing class and its replacement by a new one is actually a matter for regret.'"
    ]
}