{
    "articleURL": "/tvshowbiz/article-12059519/Ex-MAFS-UK-star-SLAMS-producers-letting-appear-battling-booze-addiction.html",
    "content": [
        "Former Married At First Sight UK contestant Gemma Rose Barnes has slammed producers for allowing her to appear on the show last year while battling a booze addiction.",
        "The former hairdresser, 31, claimed bosses on the E4 programme 'used her vulnerability' while insisting she'd told them about her three-year alcohol battle before signing on.Alleging they exploited her troubled childhood for the entertainment of viewers, Gemma revealed the experience heightened her drinking troubles.She told The Sun of the pre-show vetting process: 'I had the counselling, we discussed my childhood, which was a very negative childhood, and discussed the things that led up to my adult life.'I was very proud to say to the counsellor that I'd put them in a box and it was like it was someone else's story, and she said, \"You're suffering from trauma.\"",
        "'I said, \"Do you think I should be going on a TV show?\" They're like, \"Yes, you'll be fine. We're gonna look after you.\"'Gemma - who shares sons Ozzy, 11, and Cash, five, with a previous partner - went on to claim the production company paired her with calisthenics athlete Matt Murray, 32, knowing they wouldn't get on.But she's since signed up to a 12 Step Programme and is on the road to recovery, after the Covid lockdowns saw her spiral out of control, drinking Martini Astis at 11am.A Channel 4 spokesperson told The Sun: 'All individuals taking part in MAFS UK have been deemed suitable to take part by an independent clinical psychologist and after being cast all contributors have the ability to stay in or leave the process at any stage.",
        "'Contributor care and wellbeing is of paramount importance and appropriate support is available to contributors before, during and after broadcast.'During filming, alcohol consumption is at the discretion of individuals, but it is monitored and limited by the production team.'All broadcast episodes of MAFS UK are a fair and accurate reflection of the events that took place.'While not every contributor finds lasting love in the MAFS process, many have a positive and enriching experience and the UK franchise has brought together couples who remain in committed relationships and have started families.'MailOnline has contacted Channel 4 for comment. "
    ]
}