{
    "articleURL": "/sport/nba/article-12044471/Joel-Embiid-play-76ers-Game-2-against-Celtics.html",
    "content": [
        "Joel Embiid sat out Game 1 of the series due to the sprained LCL in his right knee He underwent a workout in practice on Tuesday to test the status of his knee DailyMail.com provides all the latest international sports newsReigning NBA MVP Joel Embiid will play and start in Game 2 of the 76ers' second-round playoff series against the Boston Celtics.",
        "Embiid was cleared to play after a successful morning shootaround on Wednesday and a follow-up workout once the team arrived at TD Garden in the afternoon.Embiid said during a morning news conference to discuss winning the NBA's Most Valuable Player award that he would need to see how his sprained right knee felt before the game on Wednesday night, when the Sixers will try to take a 2-0 lead over the Celtics. He was just waiting for the OK from doctors and the team training staff.The Philadelphia center picked up a pricey gift on Wednesday when teammate James Harden presented him with a Rolex watch to celebrate his MVP honor.",
        "Embiid will now get a chance to reciprocate by joining Harden on the court for Game 2 against the Celtics.76ers coach Doc Rivers said the coaching staff went into Wednesday with plans for Embiid being available and sitting out again.Rivers also acknowledged that there was a school of thought that was 'logical' to err on the side of resting his big man with the 76ers having already gained home-court advantage with their Game 1 victory.'Players when they are healthy they should play. When they're not, they shouldn't play,' Rivers said. 'But we're not going to risk him for anything.'",
        "The oft-injured Embiid led the NBA in scoring for the second straight season, playing in 66 games - the second-most in his career.He missed the last game of Philadelphia's first-round sweep of the Brooklyn Nets and the first game of the second round, when the Sixers beat Boston to steal the home-court advantage in the series. "
    ]
}