{
    "articleURL": "/wires/aap/article-12055075/Perth-rockers-Voyager-feeling-extra-Eurovision.html",
    "content": [
        "Synth metal may not be the first genre that comes to mind when contemplating the poptastic Eurovision competition.",
        "But for Perth rockers Voyager - Australia's entry for the music festival this year - it couldn't be a more harmonious coupling.\"Metal and rock music is all about theatre and drama really,\" lead singer Danny Estrin tells AAP.\"And what's Eurovision? Exactly the same. I think we're a perfect fit.\"Voyager is in Liverpool, getting their glam and glitter on in preparation for this year's competition, which begins with a turquoise carpet and a sensational opening ceremony on Sunday and culminates in the grand final on Saturday, May 13.\"If you can imagine 20 years of playing stages wherever you can get them, and wishing if I just had one more light, or a bit more space, or 20 giant LED screens, what would I do?\" continues drummer Ashley Doodkorte.\"We've been thinking about this for a very long time. It's the stage show we've always wanted to have.\"The band has already upped the ante with the staging and costuming of their performance in the lead-up to the competition.\"There's a lot of glitter, there's a lot of houndstooth, sequins, they've added a skort to my outfit... it's extra,\" says Estrin.And they are preparing to level up again for the final shows.It's no wonder Voyager is preparing to bring out the big guns. If they make it to the final, they could be performing to an international audience of more than 180 million people.",
        "\"That's one 40th of the world,\" Estrin marvels.Voyager has been having a crack at Eurovision ever since Australia began participating in the contest in 2015 but never made it to the finals.The band is certainly feeling the pressure because, contractually, this is Australia's last year in the comp.\"Whether it gets renewed or not is up in the air. So there's no pressure at all,\" the long-haired lawyer-rocker jokes.The band haven't experienced any backlash within the Eurovision community for not being from Europe.\"It seems to me everyone's quite happy with Australia being Europe's cousin that comes around for Christmas and has a good time,\" laughs Doodkorte.\"Get's a little bit too drunk,\" Estrin chimes in.\"It's like - ah, leave them alone, they can stay and have a bit of turkey,\" Doodkorte adds.But it's not just Australia that Voyager is representing - it's also their heavier music genre.\"We want to carry heavy music with us as well,\" explains bassist Alex Canion.\"The rising tide raises all ships. We can shine a light on other bands in our genres and in our scene.\"Their entry song, Promise, takes listeners on a three-minute journey with a mysterious build-up, catchy chorus and \"crushing people's spirits for a good 20 seconds\" before lifting them up again and leaving them feeling elated, Estrin says.",
        "Exploring this rollercoaster ride of a genre will open people's minds to what metal is and encourage more listeners, he says.\"Whether it be prog metal, or Viking metal or glitter German goth metal,\" he says.\"It's really cool to see more heavy bands getting into it.\"The 2023 Eurovision is being held in Liverpool and hosted by the UK on behalf of Ukraine, whose Kalush Orchestra claimed victory last year.Australia's semi-final competition is Albania, Armenia, Cyprus, Romania, Austria, Denmark, Lithuania, San Marino, Belgium, Slovenia, Iceland, Georgia, Greece, Poland and Estonia. The top 10 countries go on to the grand final."
    ]
}