{
    "articleURL": "/news/article-12055369/Federal-MPs-kept-TikTok-despite-ban-China-fears-Tanya-Plibersek-Julian-Hill-Pauline-Hanson.html",
    "content": [
        "45 federal MPs still have TikTok accountsSix are current government ministers Australia banned its use on government devicesForty-five federal government MPs still have TikTok accounts more than a month after it was banned over fears of Chinese surveillance.",
        "Some 22 are Labor MPs and six are federal cabinet ministers, including environment minister Tanya Plibersek, employment minister Tony Burke and industry minister Ed Husic.The Liberals and Greens each have eight and six independent MPs have the under-fire social media app owned by Chinese company ByteDance.Attorney general Mark Dreyfus banned it from government devices on May 3, following similar bans in the United States and Britain.",
        "Since the ban was announced, 14 federal government MPs have posted on TikTok, WA Today reported.The independents still on TikTok include Kylea Tink, Bob Katter and Pauline Hanson, who has posted five times since the announcement.Ms Hanson has been mainly using the platform to distribute her South Park-style cartoon, in which she mocks leading politicians from all sides.  The MPs and their staff have sidestepped the ban by using the app on personal phones and laptops. The ban applies only to devices issued by commonwealth departments and agencies.Less than a week after the ban, Ms Plibersek uploaded a video to her personal account with a scene briefly showing Prime Minister Anthony Albanese in his office.  Ms Plibersek defended her use of TikTok but said she had followed security advice and that neither she nor her staff have it on any devices.'I think it’s always important to embrace effective ways to talk with different audiences about the work our government is doing,' she said.",
        "Labor backbencher Julian Hill, who with 146,000 followers and 2.3 million likes is Australia's most popular politician on the platform, said he uses the platform because it's how millions of Aussies communicate. 'It’s important that elected representatives meet the community wherever they are – whether that’s down the shops, at the railway station, at the footy, schools, senior clubs, the RSL or online,' Hill said.The Greens' digital spokesman David Shoebridge claimed the government was guilty of 'dangerous naivete' in thinking that a ban on government devices was doing enough.",
        "He said Australia is in the grips of a privacy and data security crisis and it's a mistake to focus so much attention on just one app.Mr Shoebridge claimed personal information is being 'exploited' by any corporation that can get it.Hundreds of apps for everything from budgeting to fertility and even kid's games are collecting sensitive personal information on users and sometimes sharing that with other companies.Some 13 countries have placed sanctions on TikTok, though only Afghanistan and Iran have total bans.New Zealand banned the app on devices with access to the country's parliamentary network due to cybersecurity concerns. Experts fear that once the app is downloaded it could access senstitive information on a device. There have also been claims that ByteDance collects more user data than other social media companies.",
        "ByteDance disputes that it practices any kind of surveillance and said the bans are based on 'misinformation'.Public warnings about Chinese surveillance or banning the app on government devices is unlikely fatally wound TikTok. ",
        "It had 7.38 million users in Australia last year, making it the most downloaded mobile entertainment app in Australia.Social media commentators expect the number of TikTok users to continue to grow between 5-10 per cent each year. In the US TikTok has 150 million active users (the most of any country) and has been downloaded there more than 210 million times.According to Adweek, 39.2 million Americans aged over 18 used TikTok in March 2023 - a 300 per cent jump on April 2022. "
    ]
}