{
    "articleURL": "/wires/ap/article-12055559/David-UCLA-Hawaii-win-20th-NCAA-mens-volleyball-title.html",
    "content": [
        "FAIRFAX, Va. (AP) - Ido David had a season-high 23 kills to help top-seeded UCLA beat two-time defending national champion Hawaii 28-26, 31-33, 25-21, 25-21 Saturday to win the 20th NCAA men's volleyball championship in program history - and the first since 2006.",
        "Alex Knight tied his career highs with 15 kills and 18.5 points for UCLA. Merrick McHenry hit .500 with 11 kills and J.R. Norris IV added eight kills on .727 hitting and a match-high five aces for the Bruins. Andrew Rowan finished with 60 and became just the sixth freshman setter in NCAA history - and first in nearly 30 years - to lead his team to a national title.UCLA (31-2) has appeared in 27 of the 53 men's volleyball championship games, but this was just the Bruins second title match since 2006 (UCLA lost the 2018 championship to Long Beach State in five sets).Hawai`i (29-3), which had its seven-game win streak in the NCAA Tournament snapped, set the program's single-season wins record.Dimitrios Mouchlias, who had a career-high 25 kills in the semifinals against Penn State, had 18 kills for the Rainbow Warriors. Jakob Thelle, the AVCA player of the year, had 50 assists, nine digs, three blocks and two service aces.A kill by Spyros Chakas gave Hawaii a 23-20 lead in the first set before UCLA, which twice fought off a Hawaii set point, rallied to score eight of the next 11 points to win 28-26. David recording back-to-back kills two close it out with a set-high nine points.",
        "UCLA led 19-13 in the second set before a service error - one of 22 by the Bruins in the match - and Thelle's ace sparked a 4-0 run by the Rainbow Warriors and ignited a rally that helped Hawaii even the match with a 33-31 win. The Bruins brushed off six more set points before Mouchlias put away a set by Thelle to end it.After a service error by Hawaii, Knight had a kill and McHenry followed with an ace to make it 11-10 and the Bruins never again trailed in the third set. David had three kills in a 6-2 spurt that made it 20-15 after a block by Rowan.The Rainbow Warriors were trying to become just the first team to win three consecutive NCAA titles since UCLA, which accomplished the feat four times. The Bruins won four straight from 1981-84 and won three in a row from 1970-72 and 1974-76.Hawaii is the first school to appear in four consecutive NCAA title matches since UCLA made six straight appearances from 1993-98.John Speraw won his fourth title as a head coach and his ninth overall. Speraw won national championships in 1993 and `95 as a player at UCLA and three more (1996, ´98 and 2000) as an assistant coach for the Bruins before leading UC Irvine to the first three national titles in program history in 2007, '09 and 2012.",
        "___More AP college sports: https://apnews.com/hub/college-sports and https://twitter.com/AP_Top25"
    ]
}