{
    "articleURL": "/news/article-12048109/Fist-fight-Ukrainian-Russian-delegates-tore-away-invaded-countrys-flag.html",
    "content": [
        "The fracas took place at a Black Sea diplomatic conference in Ankara today  It came a day after Russia claimed Ukraine tried to assassinate Vladimir PutinThere were furious scenes at a diplomatic conference in Turkey today after a Russian representative tore a flag from the hands of a Ukrainian MP.",
        "Punches appeared to be thrown in Ankara on Thursday after the man ripped the item from the hands of Oleksandr Marikovsky, who had been posing for a photo.It came after members of the Ukrainian Parliament tried to disrupt a speech by Russian delegates during the meeting of the Parliamentary Assembly of the Black Sea Economic Cooperation (PABSEC).Russia earlier claimed Ukraine tried to assassinate President Vladimir Putin in a drone attack on the Kremlin in Moscow on Wednesday morning.It has since stepped up its own drone strikes on the war-torn country, targeting cities such as the capital Kyiv and Odesa, which are miles from the front line.",
        "The tensions from the ongoing war between the two countries spilled over at the conference in Ankara today when Ukrainian MPs tried disrupt a speech by Russian State Duma member Ola Timofeeva.The Ukrainians unfurled their countries flag behind the Russian's as they were giving their speech, according to Pravda.The disruption led to a break in the meeting as the delegation from Ukraine was escorted out of the hall.",
        "This was followed by a physical confrontation between Ukrainian Member of Parliament Oleksandr Marikovsky and an unnamed Russian delegate outside the hall. As Mr Marikovsky posed for a picture with the flag, the man tore it from his hands and the furious Ukrainian ran after him.",
        "Several punches appeared to be thrown  before security staff came between the two of them, according to NOELreports. It came days after Russia accused Ukraine of trying to assassinate Putin with a double drone strike on the Kremlin in Moscow - something his counterpart Volodymyr Zelensky has denied.Nevertheless, there was a furious Russian response to the claims, as Putin's stooges launched a barrage of missiles in Ukraine overnight. Around 40 explosive-laden drones with 'for Moscow' scrawled on them were fired at cities that were miles away from the front line, with explosions heard in the capital Kyiv and southern cities of Odesa and Zaporizhzhia.Today, the Kremlin accused the US of masterminding the alleged drone strike on Putin's Moscow residence which it said was carried out by Ukraine.'Decisions on such attacks are not made in Kyiv, but in Washington,' Kremlin spokesman Dmitry Peskov said. 'Kyiv only does what it is told to do.'But Zelensky denied the claims and British security officials believe the attack was a 'false flag' operation by Russia to distract Ukraine from its anticipated counter-offensive and rally up support back home. Moscow had claimed two Ukrainian drones exploded over Putin's Kremlin residence in the early hours of Wednesday morning in 'a planned terrorist act and assassination attempt'.",
        "Medvedev, who has been increasingly hawkish since Moscow's Ukraine offensive, said in response: 'After today's terrorist attack, there are no options left aside the physical elimination of Zelensky and his cabal.'And hours later, the Kremlin issued a statement saying it 'reserves the right to take retaliatory measures wherever and whenever is deemed necessary'.",
        "But Zelensky, who is visiting the International Criminal Court in the Hague today, denied carrying out the attack or attempting to assassinate Putin, saying: 'We didn't attack Putin. We leave it to the tribunal. We fight on our territory, we are defending our villages and cities.'",
        "And while Ukraine has demonstrated the capability to launch such attacks on the Kremlin, Kyiv is considered unlikely to risk fracturing international support by targeting the dictator directly.A Russian 'false flag' attack appeared a more likely explanation, with the explosion intended to generate support for Putin and further Russian attacks on Kyiv, UK officials said last night.In footage shared on social media, an unidentified object was seen flying through the night sky towards the Kremlin. Putin was not in the building.Suddenly the object burst into flames and a plume of smoke drifted over the ornate doomed roof.Experts from the Institute for the Study of War think-tank said it is 'extremely unlikely that two drones could have penetrated multiple layers of air defence and detonated or been shot down just over the heart of the Kremlin in a way that provided spectacular imagery caught nicely on camera'.",
        "They added: 'Russia likely staged this attack in an attempt to bring the war home to a Russian domestic audience and set conditions for a wider societal mobilisation.'The strike came less than a week before the large annual military parade in Red Square on May 9 that marks the defeat of Hitler.The Kremlin has persistently attempted to persuade Russians that the conflict is necessary to 'denazify' Ukraine.A staged explosion may have also been part of an internal public relations campaign designed to prepare Russians for Ukraine's counter-offensive.The thrust, using Western tanks and long-range missile systems, may lead to a loss of Russian-held territory in eastern Ukraine and heavy casualties."
    ]
}