{
    "articleURL": "/sport/football/article-12057685/Jamie-Carragher-taunts-Gary-Neville-blaming-Man-Uniteds-West-Ham-defeat-GLAZERS.html",
    "content": [
        "Manchester United lost 1-0 to West Ham at the London Stadium on Sunday nightGary Neville ranted on twitter after the game, blaming the loss on the GlazersJamie Carragher argued the owners didn't 'play Wout Weghorst as a No 10'Jamie Carragher has taken a dig at fellow Sky Sports pundit Gary Neville for blaming Manchester United's 1-0 loss to West Ham on the club's owners.",
        "Erik ten Hag's side went behind in the first half after an error from David de Gea allowed Said Benrahma to score from 20 yards out.United created a number of chances as the game progressed, but could not find a way back into the game after a string of tame finishes.Gary Neville fumed at his former side's 'poor' outing but blamed it on the Glazers for failing to sell the club, as he tweeted: 'The real disgrace are the Glazers. Are they waiting for the last game at Old Trafford to pass? It would be typical of them. Weak and shirking accountability and responsibility to the end! 'Members of staff on and off the pitch are in an uncertain position waiting for new owners, let alone recruitment and what budget their is going to be! This should have been done. Classless to the end.'",
        "The American owners first announced they were selling the club in November last year and took their third round of bids last week.Ineos billionaire Sir Jim Ratcliffe is thought to be leading the bidding war, along with Qatari Sheikh Jassim bin Hamad Al Thani.Carragher took the opportunity to point out that the Glazers had not made all the decisions that affected United's performance at the London Stadium.",
        "'Yeah the Glazers decided to play [Wout] Weghorst as a 10,' he tweeted sarcastically,  'spend £90 million on Antony and £70m on Casemiro (31) on a five year deal!'",
        "Weghorst, who remains goalless after 14 Premier League appearances for the Red Devils, came under particular criticism against West Ham as he played as a number 10, an unusual position for a 6ft 6in striker.  United remain in the Champions League places after Sunday's loss, but are now just one point ahead of fifth place Liverpool with a game in hand.Jurgen Klopp's side are ending the season on a hot streak after winning their last six games, and face a relatively easy run in with games against Leicester, Aston Villa and Southampton.United's end to the season also looks straightforward on paper as they face Wolves, Bournemouth, Chelsea and Fulham, but they have now lost consecutive games 1-0 and won just once in their last four. "
    ]
}