{
    "articleURL": "/wires/reuters/article-12049289/Shares-rise-dollar-weakens-bank-sector-fears.html",
    "content": [
        "By Ankur Banerjee",
        "SINGAPORE, May 5 (Reuters) - Asian stocks rose, the dollar eased and gold hovered around its record highs on Friday, as jittery investors remained nervous about the U.S. banking sector following another rout in shares of regional lenders.MSCI's broadest index of Asia-Pacific shares outside Japan was 0.44% higher and was on course to snap its two-week losing streak. Japan remains shut for holiday, while Australia's S&amp;amp;P/ASX 200 index fell 0.06%.Wall Street ended lower on Thursday after Los Angeles-based PacWest Bancorp's move to explore strategic options deepened fears about the health of U.S. lenders as pressure grows on regulators to take more steps to shore up the country's banking sector.Shares of U.S. regional banks sank this week in the wake of the collapse of First Republic Bank over the weekend that has brought back fears of a financial sector crisis.\"With the dust barely settling post Wednesday's Fed meeting, banking sector developments have added to conviction not just that the Fed is done tightening, but that the Fed will be cutting rates before the end of the year and more aggressively than previously priced for,\" said Ray Attrill, head of FX strategy at National Australia Bank.The Federal Reserve on Wednesday raised interest rates by 25 basis points, but hinted that its marathon hiking cycle may be ending.",
        "Markets are pricing for the Fed to stand still at its next meeting in June but expect rate cuts from July, according to CME FedWatch tool.Investor attention will also be on April nonfarm payroll data later in the day. Saxo Markets strategists said the report will be used to gauge the Fed's next move, whether that be a pause, or lead to some \"additional policy firming\".\"It is worth stressing there is plenty of data between now and the June 14 Fed meeting, with what happens in the banking sector being more key at the moment,\" they said.Over in Europe, the European Central Bank raised interest rates by 25 basis points to 3.25% on Thursday and signalled that more tightening would be needed to tame inflation.Having raised rates by the most in its 25-year history, the ECB, the central bank for the 20 countries that share the euro currency, is moderating the pace of monetary policy tightening in light of data showing the euro zone economy is barely growing and that banks are turning off the credit taps.Markets though pared back their expectations on how much further rates would continue to rise.Nick Rees, FX market analyst at Monex Europe, said it was clear that the ECB is now in the home stretch when it comes to monetary tightening, despite ECB President Christine Lagarde's attempt to steer markets away from this narrative.",
        "China shares rose 0.21%, while Hong Kong's Hang Seng index was up 0.6%, helping lift the region's shares.China's service activity grew for a fourth straight month in April, a private-sector survey showed on Friday, as businesses continued to benefit from the country's reopening, although expansion slowed slightly.The country's tourism rebounded to pre-COVID levels in the five-day May Day holidays as domestic travel rose by more than two-thirds from a year earlier, government data showed.E-mini futures for the S&amp;amp;P 500 rose 0.35% after Apple Inc's results beat expectations, helped by better-than-expected iPhone sales and notable inroads in India and other newer markets.In the currency market, the Japanese yen strengthened 0.20% to 134.04 per dollar, on course for its first weekly gain in nearly a month due to safe haven demand.Sterling was last trading at $1.2591, up 0.15% on the day, while the euro firmed 0.21% to $1.1034.Against a basket of currencies, the dollar eased 0.109%.Spot gold was at $2,051.48 an ounce, not far from its all-time high of $2,072.49.U.S. crude rose 0.47% to $68.88 per barrel and Brent was at $72.82, up 0.44% on the day.(Editing by Jacqueline Wong)"
    ]
}