{
    "articleURL": "/wires/reuters/article-12057537/Paul-Goldschmidt-hits-3-HRs-Cardinals-explode-vs-Tigers.html",
    "content": [
        "Paul Goldschmidt hit three homers and drove in four runs as the St. Louis Cardinals snapped their eight-game losing streak with a 12-6 victory over the visiting Detroit Tigers.",
        "Brendan Donovan hit a three-run homer for the Cardinals and Lars Nootbaar drove in two runs.Cardinals starting pitcher Steven Matz allowed one run on five hits in 5 1/3 innings. He struck out two without a walk. Reliever JoJo Romero (1-0) earned his first career victory.Jake Rogers hit a grand slam and Spencer Torkelson also hit a homer run for the Tigers, whose five-game winning streak came to a halt.Tigers starting pitcher Alex Faedo allowed three runs (two earned) on three hits in 4 2/3 innings. Reliever Mason Englert (1-2) took the loss, allowing five runs -- though only one was earned -- on three hits while recording just one out.The Cardinals took a 1-0 lead on Goldschmidt's first-inning homer, then they extended their lead to 2-0 in the second inning on Tommy Edman's sacrifice fly.Goldschmidt made it 3-0 with his third-inning solo homer, then Torkelson cut the Detroit deficit to 3-1 with his fourth-inning blast.The Tigers moved ahead 6-3 in the sixth inning against relievers James Naile and Romero. Torkelson hit a one-out single immediately after Matz departed, took second when Eric Haase reached on an Edman error, then scored on Miguel Cabrera's single.Romero came on and walked Zach McKinstry to load the bases to set the stage for Rogers' second career grand slam.",
        "The Cardinals surged ahead 10-6 in their half of the inning. Goldschmidt hit a leadoff single and Nolan Gorman was hit by a pitch -- then they executed a double steal after Englert relieved Tyler Alexander. Goldschmidt scored on a Nolan Arenado grounder past shortstop Javier Baez, which was ruled an error. With two outs Donovan hit his three-run blast to put the Cardinals up 7-6.Carlson then hit a single, Edman reached on an error by Nick Maton and Andrew Knizner hit an RBI double to dispatch Englert. Nootbaar followed with a two-run single off Tyler Holton, capping a wild inning that saw 12 combined runs between the teams.The Cardinals made it 12-6 in the eighth inning when Knizner hit another double and Goldschmidt smacked a two-homer -- for the third three-homer game of his career.--Field Level Media"
    ]
}