{
    "articleURL": "/wires/reuters/article-12058503/China-Hong-Kong-stocks-rise-banks-lift-Shanghai-index-10-month-high.html",
    "content": [
        "By Georgina Lee",
        "HONG KONG, MAY 8 (Reuters) - China and Hong Kong stocks rose on Monday, as banks and energy shares climbed on hopes that a rebound in the country's services consumption would benefit those sectors.** China's blue-chip CSI300 index added 0.99% by the lunch break, while the Shanghai Composite Index gained 1.56%. During early trade, it briefly rose above the 3,400 level - the highest in ten months.** Hong Kong benchmark Hang Seng Index was up 0.75% and the Hang Seng China Enterprises Index rose 0.92%.** Asian shares crept higher as investors braced for a week when U.S. inflation data will test wagers the next move in interest rates will be down, while worries about a possible credit crunch weighed on the dollar.** \"Chinese banks and insurance stocks bolstered the Shanghai blue-chip index, as investors are pinning on hopes that China's consumption recovery would benefit banks' profit this year,\" said Kenny Ng, a strategist at China Everbright Securities International.** Shanghai-listed state-owned banks such as Industrial and Commercial Bank of China, up 6%, and Agricultural Bank of China rose 5.8%.** State-owned financial stocks account for 15%-20% of the Shanghai Composite and CSI300 index weighting and nearly half of A-share earnings, according to a Bank of America report published last week.",
        "** \"State-owned banks are defensive and our preferred exposure in the current volatile market,\" said Bank of America.** Household consumption per capita rose 5.4% in Q1, compared with a year ago, up from 2.4% year-on-year increase in Q4, according to a Goldman Sachs report. The increase was led by a strong services consumption rebound. ** In Hong Kong, HSBC shares rose 1.37%, the highest in two months. Last Friday, it defeated a proposal backed by its biggest Asian shareholder Ping An to break-up the bank and spin-out its lucrative Asian business at its annual investor meeting in Birmingham in England.** The Hang Seng Mainland Oil &amp;amp; Gas Index rose 4.19%. (Reporting by Hong Kong Newsroom; editing by Uttaresh Venkateshwaran)"
    ]
}