{
    "articleURL": "/wires/reuters/article-12055825/Chris-Taylors-homer-helps-Dodgers-edge-Padres.html",
    "content": [
        "Chris Taylor broke up a scoreless pitching duel between the Padres' Blake Snell and the Dodgers' Dustin May with a two-out, two-run homer in the top of the fourth Saturday evening to lead visiting Los Angeles to a 2-1 victory over San Diego to even the three-game weekend series at 1-1.",
        "Taylor's sixth homer of the season was the only hit allowed by Snell over six innings.May held the Padres scoreless on three hits and a walk with six strikeouts over six innings to earn the win and improve to 4-1 on the season. No Padre reached second against May.Right-hander Evan Phillips picked up his fourth save on the season, striking out Trent Grisham to end the game after the Padres' center fielder hit two long foul drives. Phillips struck out three in the inning around a walk to Jake Cronenworth.Snell retired the first 11 Dodgers he faced before walking Will Smith on five pitches with two outs in the fourth.After taking a ball, Taylor drove a high changeup 403 feet into the seats in left field to end the scoreless tie. Before the homer, the Dodgers third baseman was 3-for-16 lifetime against Snell with nine strikeouts.Snell (1-5) took the loss despite allowing the one hit and three walks with six strikeouts in six innings.The Padres finally got on the scoreboard in the bottom of the eighth against reliever Brusdar Graterol and had the tying run on second with no one out but couldn't get him home.Brett Sullivan opened the Padres' eighth with a double to left. Fernando Tatis Jr. then hit a sharp grounder inside third for a run-scoring double.",
        "Tatis reached third when Manny Machado grounded out to third. But Tatis had to hold when Juan Soto grounded out to second with the Dodgers' infield playing in. Xander Bogaerts then grounded back to Graterol to end the inning.The Padres had five of the eight hits in the game.--Field Level Media"
    ]
}