{
    "articleURL": "/tvshowbiz/article-12055449/Jeremy-Renner-shares-motivational-clip-recovery-progress-near-fatal-snowplow-accident.html",
    "content": [
        "Jeremy Renner posted another social media update on his recovery on Saturday.",
        "The 52-year-old Mayor Of Kingstown actor shared a time-lapse video updating fans on the progress he has made in physical therapy since his near-fatal snowplow accident earlier this year.The Hawkeye star was seen needing a walker to move around before now being able to walk without any assistance at all.The Bourne Legacy alum wrote in his Instagram video: 'My PT made this for reference and to remember, you cannot walk unless you take one step at a time! #onefootinfrontoftheother'.Just months earlier on January 1, Renner survived being crushed by a 14,000 pound snowplow and suffered from major injuries — including more than 30 broken bones.",
        "Since then, the Mission Impossible alum has been sharing his daily exercises to his Instagram account and keeping fans updated on his miraculous recovery.The California native — who made since made his first red carpet since the near-fatal accident at the premiere of his Disney+ series, Rennervations — was seen becoming more confident in his walk over time.At the beginning of the clip, he was seen practicing steadily with a walker and had to have somebody behind him for additional support.With dedication and diligence, he advanced to just needing a cane to walk by himself.Later in the clip compiled by his physical therapist, he was seen not needing any support at all and was walking hands-free. ",
        "By the end of the video, Renner was moving more swiftly and even appeared to have a little bit of pep in his walk. On Thursday, he also shared a video of himself pushing himself to continue exercising after a day of physical therapy.'I've decided to push through the pain of progress (this d*** shattered tibia) and take the new parts for a tiny test drive,' he wrote in the caption.",
        "'The body is miraculous,' he continued. 'Even though I feel like the Tin Man, needing oil for all my new joints (hips, knees, ankles, tibia etc).' Renner added: 'Encouraged after this warm up to press on (don’t tell my PT)'. In the clip, he stretched and worked out the muscles in his legs with a pulley cable connected to a treadmill.He practiced mobility in his legs and hips by doing squats as well as various joint exercises.Earlier in the day, he had also posted a photo of his lower body while performing physical therapy.With the social media update, he shared that he has been making the 'great progress' in his journey to full recovery and mobility.In the caption, the California native also wrote that he has been busy 'making recovery and surpassing goals a daily habit'.",
        "The snap shared by Renner did not show his face but instead just the lower half of his body as he exercised on an anti-gravity treadmill.",
        "Renner also shared a photo of himself using a bone growth stimulator and also ending off his busy day with a leg compression machine. In April, the Academy Award nominee made an appearance on Jimmy Kimmel Live to promote his documentary miniseries.During the interview, he also spoke about how 'lucky' he was to survive the terrifying accident.He revealed that it was fortunate that the machine missed the critical parts of his anatomy. 'It just missed every vertebrae, did not hit any organs, membrane did not swell,' he detailed.'My eye did pop out — that's weird — but I got pretty lucky that none of the organs got messed up,' he added.The New Year's Day accident left more than 30 of Renner's bones broken.He was hospitalized in 'critical condition' and underwent multiple surgical procedures. ",
        "When Kimmel asked him about the best thing to come out of the incident, Renner joked and responded that it was getting time off for the rest of the year.'I was making so many plans,' he replied. 'I was going to buy a boat. I was going to live in Mexico ... because my year was pretty jammed up until I got crushed, right?' ",
        "'And then also it was like a New Year's resolution,' he continued. 'I did drop like 20 pounds.'Renner continued in good humor: 'I quit smoking. It's easy! Easiest way to quit smoking, I'm telling you!'"
    ]
}