{
    "articleURL": "/wires/afp/article-12047425/Four-far-right-Proud-Boys-convicted-sedition-Capitol-attack.html",
    "content": [
        "Four members of the far-right Proud Boys were convicted of seditious conspiracy on Thursday for their roles in the January 6, 2021, attack on the US Capitol by supporters of former president Donald Trump.",
        "Enrique Tarrio, 39, the former \"national chairman\" of the neofascist organization, was among those found guilty by a jury after a more than three month trial in the nation's capital.Three of Tarrio's lieutenants -- Joseph Biggs, 39, Ethan Nordean, 32, and Zachary Rehl, 37 -- were also convicted of seditious conspiracy, which carries a sentence of up to 20 years in prison, while a fourth Proud Boy, Dominic Pezzola, was found not guilty.\"After January 6, I promised that the Justice Department would do everything in its power to hold accountable those responsible for the heinous attack that sought to disrupt a cornerstone of our democracy -- the peaceful transfer of power to a newly elected government,\" Attorney General Merrick Garland told reporters.\"Today's verdict makes clear that the Justice Department will do everything in its power to defend the American people and American democracy,\" Garland said.Tarrio was not in Washington on January 6 but was accused of directing the storming of the Capitol in an attempt to stop the certification by Congress of Democrat Joe Biden's election victory over Trump.All five Proud Boy defendants were also convicted of several lesser charges, including obstruction of the proceedings of Congress, impeding law enforcement and destruction of government property.The 45-year-old Pezzola was also found guilty of robbery of US property. In widely viewed video footage from January 6, Pezzola can be seen using a stolen police riot shield to break a window at the Capitol.",
        "The success of federal prosecutors in obtaining convictions for sedition among the January 6 rioters could raise the stakes for Trump and his aides in the probe by a special counsel into whether they plotted or fomented the Capitol attack.More than 1,000 people have been arrested in connection with the storming of Congress by Trump supporters -- and more than 600 convicted -- but only about a dozen have faced the rarely used charge of sedition.- Special counsel probe -",
        "Two leaders of another far-right group, the Oath Keepers, were convicted of seditious conspiracy last year, including founder, Stewart Rhodes, and several other members pleaded guilty without going to trial.According to Tarrio's indictment, he met with Rhodes on January 5 in an underground parking garage in Washington and was in contact with members of the Proud Boys who breached the Capitol.In January, four other members of the Oath Keepers were found guilty of seditious conspiracy, fortifying the government's argument that the January 6 attack was not simply a spontaneous action, but involved significant planning and coordination.The assault on Congress left at least five people dead and 140 police officers injured and followed a fiery speech by Trump to thousands of his supporters near the White House.",
        "Trump was impeached for a historic second time by the House of Representatives after the Capitol riot -- he was charged with inciting an insurrection -- but was acquitted by the Senate.A House committee that investigated the Capitol riot recommended that the Justice Department pursue criminal charges against Trump.Garland named a special counsel to oversee the probe into the January 6 assault and the former president's efforts to overturn the 2020 election result.Three weeks before the violence, Trump urged his supporters to descend on Washington on January 6, tweeting: \"Be there, will be wild.\"Trump is also facing possible indictment in Georgia for allegedly pressuring local officials to change the election results in the southern state.The special counsel is also looking into a cache of classified documents that the FBI seized in a raid on Trump's Mar-a-Lago residence last year."
    ]
}