{
    "articleURL": "/news/article-12056667/Frontier-Airlines-passenger-flown-foreign-country-900-miles-away-no-passport.html",
    "content": [
        "Passenger flying from Philadelphia to Jacksonville wound up in the Caribbean after airport staff didn't inform her of a last-minute gate changeBeverly Ellis-Hebard was not stopped by the Frontier Airlines gate agents when she mistakenly boarded a flight to Jamaica in November Airline apologized for the error whish left her stranded on the jetway in Jamaica for hours as she did not have a passportA woman travelling from Philadelphia to Jacksonville wound up in the Caribbean after airport staff mistakenly directed her to the wrong Frontier Airlines flight.",
        "Beverly Ellis-Hebard arrived at the Frontier Airlines gate, where the board read: PHL to JAX.She asked the gate agent if she had enough time to run to the restroom before boarding and was told she had about 20 minutes.When Ellis-Hebard returned a short while later, she found her flight had almost completely boarded and the jetway door was about to close.She went to board the flight but the gate agent gave her a hard time about the size of her carry-on bag and made her place it in the baggage sizer.",
        "'I put it in and when I went to take it out my arm right here got all scraped up. I was bleeding,' she told ABC7 about the incident in November last year.The gate agent then hurried her onto the plane.'She said, ''Come on, come on. Give me your boarding pass'',' she explained. 'I would say I took about ten steps, and she said, ''are you Beverly Ellis-Hebard?'' I said, ''you just had my boarding pass, you just checked me in. yes''!'She said, ''all right, go! Go''.'Once the flight was airborne, a flight attendant who had provided Ellis-Hebard with supplies to tend to her injured arm told her that she would be able to relax once the flight landed in Jamaica.",
        "'I laughed. I said ''I would love to be going there but I have a beach where I live'',' referring to her Jacksonville home.'She said, ''Look at me. This plane is going to Jamaica'' and I knew by the look on her face she wasn't joking.'The flight crew eventually told Ellis-Hebard that her flight to Jacksonville had a last-minute gate change and she was now on her to way to the Caribbean - roughly 900 miles from her assumed destination.However, Ellis-Hebard had not packed a passport because she was not expecting to leave the country.She was told: 'You're entering a different country without a passport. That's bad.'Jamaican authorities allowed Ellis-Hebard to remain on the jetway, which she was told is technically considered U.S. soil.The flight crew stayed with her until a next flight to Philadelphia departed several hours later.TSA, FAA, and US Customs and Border Protection guidelines say it is ultimately up to the airline to ensure passenger board the correct flight.",
        "Frontier Airlines issued a statement on the matter saying: 'We extend our utmost apologies to Beverly Ellis-Hebard for this unfortunate experience. We sincerely regret that Ms. Ellis-Hebard was able to board the wrong flight.'As a gesture of our apology, we have issued a $600 Frontier Airlines flight voucher tied to the name Beverly Ellis-Hebard that is valid for one year.'",
        "Ellis-Hebard also got her original ticket refunded, but told ABC7 that what she was really after was an apology.'It should have never have happened because I did not have a passport. The woman at the gate did not do her job,' she said.Ellis-Hebard said she is a frequent traveler who flies close to every six weeks.'I picked Frontier flights because we flew so often,' she said. She may now be reconsidering that choice."
    ]
}