{
    "articleURL": "/wires/ap/article-12057657/Merrifield-4-RBIs-Blue-Jays-win-10-1-Pirates-skid-7.html",
    "content": [
        "PITTSBURGH (AP) - Whit Merrifield had four RBIs, three on his first home run this season, and the Toronto Blue Jays routed Pittsburgh 10-1 Sunday for a three-game sweep that extended the Pirates' losing streak to seven.",
        "Merrifield put Toronto ahead with a run-scoring infield single in the first following a 95-minute rain delay and opened a 4-0 lead in the third when he sent a hanging curveball from Roansy Contreras (3-3) into the left-field bleachers. The two-time All-Star last had four RBIs on Aug. 25, 2021, while with Kansas City.\"That's what this lineup is capable of,\" Blue Jays manager John Schneider said. \"You don't have to be so reliant on the top four. ... It's a pretty dangerous lineup.\"Toronto outscored Pittsburgh 22-3 during the sweep, bouncing back from five straight losses. The Pirates have been outscored 44-9 during their longest skid since eight straight losses last Sept. 15-23. They began the season 20-8, their best start since winning a 1992 division title.\"I think no one expected that pace to keep up, as well as we played,\" Pittsburgh manager Derek Shelton said. \"During that time, we were playing full games and right now we´re not. We´re not pitching extremely well, we´re not swinging the bats extremely well.\"Yusei Kikuchi (5-0) allowed four hits in 6 1/3 scoreless innings after giving up five runs in just 4 1/3 innings to Boston on May 2.",
        "\"Using my fastball effectively has been really good for me,\" Kikuchi said. \"More so than my pitching performance, I'm just glad that the team's winning. I'm glad I'm able to help the team earn the wins.\"",
        "Contreras gave up five runs and nine hits in five innings. He´s been tagged for nine runs in 10 1/3 innings his past two starts.Carlos Santana had an RBI single in the eighth. Jordan Romano came in with the bases loaded to strike out Jack Suwinski and get Miguel Andujar to pop to third.\"Right now, we´re just not getting that big hit,\" Shelton said. \"The hits that we were getting earlier in the season, we were getting a base hit there and then we were getting another hit, so we were able to add on. Right now, we´re just lacking that hit to maybe relieve a little bit of that pressure.\"Daulton Varsho and Kevin Kiermaier each had a two-run homer in a five-run ninth. Varsho drove a slider from Chase De Jong over the Clemente Wall, bouncing the ball into the Allegheny River for his fifth home run this season. It was the 68th home run to reach the river since PNC Park opened in 2001.\"I haven't seen it yet. People just told me that some fan with khakis jumped into the river and got the ball,\" Varsho said. \"Just trying to feel athletic. Swinging at good pitches. That's kind of my goal right now.\"Bryan Reynolds went 0 for 4, ending an 11-game hitting streak dating to April 22, four days before the outfielder signed a $106.75 million, eight-year contract.",
        "TRAINER´S ROOMBlue Jays: INF Vladimir Guerrero Jr. missed a second straight game because of left wrist discomfort. He was a late scratch for an 8-2 win on Saturday after going 1-for-4 with an RBI in a 4-0 victory on Friday.Pirates: OF/DH Andrew McCutchen walked in a pinch-hit appearance in the eighth after missing the previous two games with a sprained left ankle.UP NEXTBlue Jays: RHP Alek Manoah (1-2, 4.71) will start Tuesday as Toronto travels across Pennsylvania for the first of a two-game set against Philadelphia.Pirates: RHP Mitch Keller (3-1, 3.32) will take the mound Monday to start a three-game series against Colorado.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}