{
    "articleURL": "/wires/reuters/article-12046271/Blackstone-mulls-sale-Dutch-bank-NIBC-sources.html",
    "content": [
        "By Pablo Mayo Cerqueiro, Amy-Jo Crowley and Andres Gonzalez",
        "LONDON, May 4 (Reuters) - U.S. buyout house Blackstone is weighing options for Dutch merchant bank NIBC, including a possible sale, people familiar with the matter told Reuters.The fund manager has been informally sounding out other banks and potential financial buyers to gauge their appetite, said the people, who declined to be named discussing private matters.Deliberations are preliminary and may not lead to any transaction, the people cautioned. Blackstone has also been considering potential acquisitions in the absence of a sale, one person added.Blackstone declined to comment. NIBC did not immediately respond to a request for comment.With its roots dating back to the 1940s, NIBC returned to the stock market in 2018 after more than a decade of private equity ownership under JC Flowers &amp;amp; Co.Blackstone took the bank private again in early 2021 for roughly 1 billion euros - a fraction of its book value - after negotiating down the price it originally agreed with the company over concerns about the COVID-19 pandemic.Valuations for listed European banks have risen since, buoyed by higher interest rates. But a recent crisis of confidence in credit institutions has set back the strategic plans of some midsize lenders, including Apollo Global Management-backed OLB in Germany.The Hague-based NIBC offers financing for industries such as automotive, commercial real estate, infrastructure and shipping, as well as retail mortgages. It has been exiting non-core businesses, including deal advisory and leveraged finance, in a bid to streamline its operations.",
        "The group had 22.8 billion euros of assets on its balance sheet at the end of last year and an equity value of around 2 billion euros ($2.21 billion), according to its 2022 annual accounts, which showed a profit of 179 million euros excluding non-recurring expenses. Mortgages made up the bulk of its loan book.The news was first reported by Bloomberg on Thursday. ($1 = 0.9046 euros) (Reporting by Pablo Mayo Cerqueiro, Amy-Jo Crowley and Andres Gonzalez in London; editing by Elisa Martinuzzi and Elaine Hardcastle)"
    ]
}