{
    "articleURL": "/news/article-12049163/Father-Bob-Maguire-funeral-Whos-Melbourne-elite-gather-state-service.html",
    "content": [
        "State funeral for Father Bob Maguire held on FridayThe 'people's priest' farewelled by Melbourne's eliteCharity campaigner died in hospital at the age of 88Larrikin priest and charity campaigner Father Bob Maguire has been honoured for his his work for the most marginalised people in society by a who's who of Melbourne personalities. ",
        "The state funeral at St Patrick's Cathedral began at 11am on Friday, with Victorian Opposition Leader John Pesutto and colourful local figure Mick Gatto pictured arriving  at the packed service with their wives. Also seen arriving were NDIS minister Bill Shorten and former Victorian premiers Jeff Kennett and Steve Brack. State Opposition leader John Pesutto, deputy leader David Southwick, former Liberal MP Bernie Finn, and transport minister Ben Carroll were also in attendance. Father Bob's family, broadcaster John Safran, The Bob Maguire Foundation and Victorian Premier Daniel Andrews provided tributes during the service, while Melbourne Archbishop Peter Comensoli lead the mass.Mr Andrews said that as a parish priest in South Melbourne for several decades, Fr Bob had built a community and helped the most marginalised people in society. 'In his own words ... he loved the unloved and lovely,' the premier said. ",
        "Mr Andrews said the priest had brought peace and comfort to countless people. 'He would greet everyone he met with a \"G'day cobber\",' he said. 'If he thought that the church had overstepped. On the rare occasion he thought the government had made a decision,' he added, pausing for laughter.'He was most certainly not afraid to let me or them have a piece of is mind.'Prior to the mass starting, Aunty Di Kerr performed a Welcome to Country and told the crowd Fr Bob respected everybody, regardless of where they came from. ",
        "'He always had that cheeky smile, he always said something to make you laugh. He was true. He spoke the truth,' she said. ",
        "Radio host John Safran, who he co-hosted a Triple J show for a decade with, shared a tender yet hilarious tribute to his friend. 'I spent so much time with Father Bob over twenty years, I feel I can auto-generate an AI chat between him and me regarding today,' he said before launching into the imagined conversation.'Bob, you're dead, do you want a state funeral?' he asked. 'No!,' he expected would be Bob's reply.Laughter echoed off the cathedral walls as Safran suggested Father Bob would prefer a 'Tibetan sky burial where they take up your mountain and you're eaten by the birds'.",
        "The service was broadcast at The Edge at Federation Square, while hundreds had already joined the online livestream before the service started.Minister for Government Services Bill Shorten appeared in good spirits as he chatted with Ms Andrews, the Victorian premier's wife. At one point in the service, clergymen were seen walking around Fr Bob's casket which was draped in an Australian flag. The much-loved priest balanced media commitments with his parish duties until he was forced to retire from the Catholic Church in 2012.",
        "Fr Bob was appointed a Member of the Order of Australia in 1989 for services to youth homelessness and Victorian of the Year in 2011.",
        "He was ordained as a priest at the age of 25 in 1960 and was the parish priest of St. Peter &amp; Paul's Catholic Church in South Melbourne from 1973 until his retirement. Fr Bob founded the Father Bob Maguire Foundation in 2003 which aimed to end homelessness and disadvantage by creating a caring community. He died at Cabrini Hospital in Melbourne on April 19, aged 88.After news broke of Fr Bob's death, Mr Andrews shared a tribute to the man who made the state a 'kinder, fairer place'.'He spread his message of kindness on Triple J, took to the street to protest and was never afraid to pick up the phone and argue for what was right,' he said.'Our state is a kinder, fairer place because of Father Bob. And we'll miss you greatly, comrade.'Just days before his death, the well-respected priest concerned supporters with a troubling Twitter post, which would ultimately be his last.The disturbing tweet read: 'MSM please help me survive ambush by treacherous frenemies…sad I am.'",
        "It's unclear what Fr Bob was referring to but, two days before his death, he publicly hit out at the charity in his own name, the Father Bob Maguire Foundation, after the board announced last week he had voluntarily stepped down as chairman. ",
        "He claimed he was blindsided by his termination, which the charity has denied. They insisted that he was not sacked from the board - but was simply no longer eligible to be on it. 'There have been many grossly ill-informed and patently wrong assertions made, often by people who have never met him or worked with him saying that it's all a conspiracy by the Board to get rid of Fr Bob,' the board said in a statement.Fr Bob first became known for his work with disadvantaged people in his South Melbourne parish from the 1970s before appearing in national media alongside Safran from 2004. Mourners have been asked to donate to his foundation in lieu of flowers.",
        "Father Bob's distressing final post: Renegade clergyman begged for help in tragic last days before his death aged 88Much-loved Catholic priest Father Bob Maguire claimed he was being 'ambushed by treacherous enemies' in his final post before his death on Wednesday at 88. The larrikin Melbourne icon and one-time Triple J radio star had just last week reassured friends, family and supporters that 'everything's alright with me'.But sadly, he passed away in Melbourne's Cabrini hospital on Wednesday, his family confirmed.Father Bob complained of 'treachery' and claimed he had been sacked by the charity he founded, two days before he died. And his disturbing final tweet has now been shared by supporters, where he claimed: 'MSM please help me survive ambush by treacherous frenemies…sad I am.'",
        "It's unclear what Fr Bob was referring to but, two days before his death, he publicly hit out at the charity in his own name, the Father Bob Maguire Foundation, after the board announced last week he had voluntarily stepped down as chairman. Fr Bob claimed he was blindsided by his termination, describing the situation as a 'bloody mess'.'It's nasty … I've known these blokes for years but they have turned treacherous,' he told the Herald Sun on Monday in what would be his final interview.'I'm not used to this, we always ran the show as a fighting unit, I'm the commander in chief. We're hurt but we aren't out.' The foundation's board refuted that Father Bob had been sacked in a lengthy statement on Tuesday. They insisted that he was not sacked from the board - but was simply no longer eligible to be on it. 'There have been many grossly ill-informed and patently wrong assertions made, often by people who have never met him or worked with him saying that it's all a conspiracy by the Board to get rid of Fr Bob,' a statement from the board read. ",
        "Hours after the drama, Fr Bob's family confirmed he died at Cabrini Hospital, in suburban Malvern, on Wednesday morning. ",
        "In recent times, the priest had been living in a retirement home in order to receive 24 hour respite care. His family insisted that he had been deteriorating for some time, both physically and mentally. 'Father Bob was a dear and much-loved member of our family and will be sorely missed for his energy and good humour,' the statement read.'His physical and mental health had been deteriorating for some time, but his preference was always to help others rather than consider his own situation,' his family said.",
        "'Father Bob was not just a much-loved family member, but was loved by all Australians for what he stood for. He has fought bravely for the underprivileged and homeless all his life. He represented the highest of principles, and he fought to actively live those principles.''Despite his high profile in the media, he was always on the job, especially for the disadvantaged families and individuals for whom he had great love and compassion. 'He wanted nobody to be left behind and always saw and believed in the good in people, but he knew that there were many whom he referred to as the unloved and unlovely. These were his real passion.'The last few months have been very difficult for both the family and for those around Fr Bob as we managed his declining health. We thank all the medical staff who have attended him in recent months and express our gratitude to them for their work and devotion.'Fr Bob dedicated his life to the Catholic church and charitable work. He gained a reputation as a candid commentator who wasn't afraid to speak his mind or call out church leaders, particularly on his radio show with John Safran. ",
        "Father Bob appeared frail but in good spirits when he shared a Facebook video message from his aged care facility last week, hinting an 'event' would soon be announced.'I'm just sending out a little reassurance to you that everything's alright with me,' Father Bob said.'In fact, I'll leave this place very soon and I'll return to Albert Park and we'll continue our expedition to make sure nobody gets left behind and we'll continues that as soon as I can get back.''I'm very grateful to you for your concern, consideration and compassion and there'll be an announcement soon about an event.'Father Bob assured everyone he was 'back on the right track.'  'I've got my legs back and I've got all kinds of good things happening,' he reassured.'I might even get an infusion of immunoglobulin that restores mobility. We'll be back after the break as they say, so thank you, thank you and thank you.' Prime Minister Anthony Albanese led the outpouring of tributes.'With the passing of Father Bob, we have lost a great Australian. An irrepressibly cheerful champion for all those battling disadvantage, he dedicated his life to brightening the lives of those most in need,' Mr Albanese said."
    ]
}