{
    "articleURL": "/wires/ap/article-12043527/Iowa-Democrats-plan-Hold-1st-caucuses-report-votes-later.html",
    "content": [
        "DES MOINES, Iowa (AP) - Iowa Democrats are proposing a novel way to get around their demotion from the leadoff spot on the party´s presidential nominating calendar: They would still put on the first-in-the-nation caucuses but would be open to withholding the results until after other states have their contests.",
        "The creative approach is the latest effort by the Iowa Democratic Party to claw back the prized slot it held for nearly 50 years, until chaos during the state´s 2020 presidential caucuses led the Democratic National Committee to reorder the calendar.Iowa Democrats say the plan demonstrates their willingness to work with the DNC on its new voting calendar, which elevates South Carolina as the first voting state for 2024 and drops Iowa out of the top five voting states.\"This flexibility is purposeful,\" Iowa Democratic Chair Rita Hart said Wednesday, describing the scenario of holding the caucuses first, with the option of reporting the results after other states report theirs.A spokesperson for the DNC declined to comment on the Iowa proposal.The plan is largely moot since President Joe Biden is seeking reelection in 2024 and doesn´t face a major Democratic primary challenger. But it is another example of how the new voting calendar, meant to empower minority voters in more diverse states, has contributed to resentment among the states left behind and created headaches for the DNC.",
        "The reasoning behind the revised Iowa plan, say Hart and Des Moines lawyer Scott Brennan, is that New Hampshire has already signaled its intention to keep the state's first-in-the-nation primary, regardless of how the DNC restructures the voting calendar.",
        "\"This calendar will not hold,\" said Brennan, who is also a member of the DNC's rules committee. \"New Hampshire has made it very clear that they´re going to move. They are not going to go behind South Carolina.\"Under the new calendar, South Carolina would hold its primary first on Feb. 3, followed three days later by New Hampshire and Nevada, which is swapping the caucus it used to hold in favor of a primary.Georgia would vote fourth on Feb. 13, followed by Michigan on Feb. 27, with much of the rest of the nation set to vote on Super Tuesday in early March.More changes are possible later this year, and states are submitting their individual contest plans to the DNC´s rules committee, which is expected to review them in June.Under Iowa Democrats' plan, the party would hold its caucuses - individual precinct-level party meetings and not state-run primary elections - on the same night as Iowa Republicans, which would still hold the GOP's leadoff 2024 caucuses, on Feb. 5.In a losing effort to salvage its leadoff caucuses, Iowa Democrats had previously agreed to allow voters to submit presidential preference cards by mail or in person before caucus night, and to eliminate the often confusing and time-consuming process of realignment.",
        "The party, which retains the mail-in provision in its new plan, hoped that the changes would increase participation in the voting process and avoid the chaos that marred the 2020 caucuses. The process was racked with so many irregularities and inconsistencies that the AP was unable to declare a winner, denying top finishers Bernie Sanders and Pete Buttigieg of the full measure of momentum ahead of New Hampshire's primary eight days later.Iowa had long encountered criticism from party officials in other states envious of the outsize national media attention. They also often complained about Iowa´s vastly white voting population in the racially and ethnically diverse party, as well as the caucuses´ odd rules with their weeknight, in-person participation in the dead of winter that often kept night shift workers or parents of young children from attending.What´s more, the state has shifted increasingly to the right in recent years and is no longer considered the battleground state it once was. Only one Democrat currently holds statewide office now."
    ]
}