{
    "articleURL": "/femail/article-12050641/My-seven-year-old-stepdaughter-eating-fruit-house.html",
    "content": [
        "A woman has vented on Mumsnet about her stepdaughter's eating habitsREAD MORE: My stepson will miss out on a family meal because he can't afford itA stepmother has divided opinion after revealing her seven-year-old stepdaughter is driving her 'crazy' from eating too much fruit.",
        "The unnamed woman took to British parenting site Mumsnet to disclose that her food budget had worn thin after her husband's biological daughter moved in with them in January.She explained that as the higher earner and breadwinner - who was also now on maternity leave - it was driving her crazy that the child was eating all their fruit and 'leaving nothing for her husband and I.'She added that their weekly shop of two bunches of bananas, berries, peaches, melon, grapes and tangerines was going nowhere fast as the girl ate through the lot in two days.The woman's post divided opinions with some calling for her to invest in cheaper alternatives, while others thought the mother was justified in her actions. ",
        "Her annoyance was further exacerbated by the mother's refusal to contribute towards her daughter's expenses while she lived there. And in turn, the mother-of-one who said the girl was 'greedy' clashed with her husband who believed fruit was 'good for a growing child.'She wrote: 'My stepdaughter, seven, moved in with us full time back in January. Our situation is that I am a higher earner and breadwinner on maternity leave with a five month old baby.''My husband does some part time work that doesn’t bring in much (he runs our family vehicle and contributes towards household costs such as shopping etc)' she added.",
        "'My step daughter's mother does not contribute towards her expenses while she is living here (indefinitely for now).''At the moment, we are on a tight budget due to my maternity leave - and one thing driving me crazy is my stepdaughter eating all our fruit.''We will buy a weekly shop with two bunches of bananas, a few punnets of berries, peaches, melon, grapes, tangerines etc and she will eat her way through the lot in two days.'The woman went on to disclose what she thought were the reasons behind her stepdaughter's fondness for fruit, and the impact it had on her health.",
        "She said: 'She is then obviously reluctant to finish a proper evening meal or try anything she dislikes.''She also has had a couple of accidents with loose stools (It's my opinion this is from bingeing on fruit). She takes from the fridge without asking and leaves nothing for my husband and I)''I’ve spoken to my husband about this and he says she is a growing child and at least fruit is good for her. Fair enough I buy fruit partly for her to eat, but the amount seems greedy to me, and beyond what is necessary for a healthy child. 'I think reasonable is a small bowl of berries and grapes, along with a tangerine and banana after school as a snack, and then one piece for dessert.'",
        "'I want her to learn that food costs money, we don’t have a bottomless pit of it and you don’t just gorge on whatever you want because you are bored/tired/didn’t eat your dinner.''You ration portions in a family so everyone gets a fair share, and sometimes eat less tasty things to maintain a healthy diet.''When she first came to us she was also gorging like this on sweets - that’s been easier to nip in the bud as my husband can see how unhealthy it is.''I want to handle this in a compassionate way, would I be unreasonable to stop buying fruit until my husband agrees to a sensible ration for my stepdaughter.'In over 300 responses to the post, some admonished the woman for her remarks, while others were keen to find out what was causing the girl's hunger.",
        "One person said: 'Unpleasant to call a seven-year-old eating fruit \"greedy.\" But it's reasonable to expect her to eat her evening meal before snacking her way through fruit.'Another person added: 'Poor girl - so many changes in the last few months, new home, new sibling. 'Is anyone supporting her emotionally? As for the rest, of course you are not being unreasonable but your husband needs to step up and parent properly and she is comfort eating. ",
        "'Two to three portions of fruit is plenty a day. You can also buy frozen fruit to make it cheaper.'A third said: 'This makes me feel quite sad. It sounds like she's having some issues, bless her. And it also makes me sad that you resent her for it. But perhaps I have read it all wrong.'And another thought the poster was too harsh, adding: 'She sounds like she’s had quite a traumatic time, so maybe don’t call her greedy eh? It’s comfort eating - she’s just moved from sweets to fruit. That amount of sugar isn’t good for her so talk about it to your husband in those terms. Explain to her it isn’t healthy to eat fruit (or anything) to excess, and portion it out. Put it where she can’t get to it.'Meanwhile some sympathised with the mother, with one adding: 'Not unreasonable at all.'That’s a ridiculous amount of fruit to be eating in one day, and like you say, never mind the cost, she is going to end up making herself ill. You can't have too much of anything, no matter how healthy it might be! 'The cost would be annoying me too - that’s easily £5 plus worth of fruit in a day.'",
        "And another wrote: 'That's a crazy amount, and I'm surprised her dad isn't stepping in and setting boundaries.'It might be \"healthy\" food but it's still sugar. I'd be p*ssed if I was paying the food bill too original poster.'"
    ]
}