{
    "articleURL": "/tvshowbiz/article-12052499/Coronation-Street-cast-TikTok-star-Noah-Olaoye-Maxs-prison-pal-Gav.html",
    "content": [
        "Coronation Street have announced that they've cast TikTok star Noah Olaoye as Max Turner's prison pal Gav.",
        "The actor, 24, best known for his impersonations of Match Of The Day &amp; Gogglebox star Micah Richards, made his debut in the ITV soap on Friday's episode.Fellow student Gav meets Max in the STC and the two quickly forming a close friendship as Gav becomes a shoulder to lean on for troubled Max.  Speaking about joining the cast, Noah said: 'I’m so excited to be joining the Coronation Street family, such an iconic show and I’m really looking forward to everyone meeting Gav!'People know me as the Micah Richards guy, but not many people know that I’m a professional actor, and I’m glad that people are getting to see a different side of me, on a TV screen instead of a phone screen!",
        "'It’s been an amazing experience, and I’ve loved every second of it and I hope everyone else does too!'Meanwhile, the Nigerian born and Liverpool raised actor teased what's to come for his character.He said in an interview: 'Gav is a lovable rogue. He is not a bully, he is not someone who throws his weight around.'He is genuinely a likeable guy but he does have a screw loose so there is that side to him where people are afraid of him but not because he will push people around the classroom but because he is going to do something slightly unhinged if you get on his wrong side.'",
        "On what draws Max to Gav, Max actor Paddy Bever shared: 'Gav is quite respected within the STC and before they met, this was something that Max feared. 'But Gav has got this wonderful energy about him which is so upbeat, playful and fun and Max has really lacked that in his life. For years, he has had no fun!'He went on: 'Max has missed out on a lot of childhood and I think there is something quite child-like about Gav. Noah brings that into the character really well and Max is attracted to the idea that life isn’t always miserable. 'It’s a lovely feeling for Max because Gav brings light relief in Max’s life which, for years, has been very dark.'",
        "While Noah added: 'I would agree with that as a lot of people see Gav as the unofficial ‘Head Boy’ and they see him as a figure of respect, like Paddy has said. 'People acknowledge Gav as ‘the guy’, and you don't mess with Gav otherwise you are going to have a problem. 'He is not an authoritative figure, just his presence and his aura alone let people know you don’t mess with him.'Meanwhile, Noah, who started created TikTok videos during the pandemic, opened up on what viewers will see in their friendship.",
        "'Every friendship will have its ups and downs and I think we will see that with Gav and Max', he said.'There will be a lot of trouble-making and I think Max is just trying to do his time in the STC and get through it whereas Gav’s attitude is “I might as well have fun while I am here!” 'Max will definitely tell Gav to chill out! They are similar in some respects but quite different in that regard; Max is trying to keep a level head and Gav is trying to cure his boredom. 'It’s a very interesting friendship and I am excited to see how people will receive it.'"
    ]
}