{
    "articleURL": "/wires/reuters/article-12050767/US-STOCKS-Futures-climb-Apple-earnings-cheer-jobs-report-tap.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers seen adding 180,000 jobs in AprilLyft slumps as lower fares stoke margin concernsFutures up: Dow 0.54%, S&amp;amp;P 0.72%, Nasdaq 0.69%(Updates prices throughout; adds details on jobs data estimates in paragraph 6)By Ankika Biswas and Sruthi ShankarMay 5 (Reuters) - U.S. stock index futures rose on Friday as upbeat results from Apple underscored resilience in corporate earnings despite a slowing U.S. economy, while investors awaited a monthly employment report to gauge the outlook for interest rates.Apple Inc gained 2.7% in premarket trading on better-than-expected results, helped by strong iPhone sales and notable inroads in India and other newer markets.The company's executives also noted that gross profit margins for the current quarter would be better than forecast on improving supply-chain issues.\"Thanks to their (Apple and Microsoft) sizeable balance sheets, and falling yields, big tech companies remain a refuge for equity investors, which certainly explains why the S&amp;amp;P 500 has been relatively resilient to the bank turmoil,\" Ipek Ozkardeskaya, senior analyst at Swissquote Bank, said.\"What's risky is that if winds change direction for Big Tech, we could rapidly see gains in S&amp;amp;P 500 crumble.\"The Labor Department's closely watched employment report is expected to show nonfarm payrolls increased by 180,000 jobs last month. That would be the smallest gain since December 2020 and would follow a 236,000 rise in March.",
        "However, the data will offer little comfort to Federal Reserve officials battling sticky inflation, with wage growth expected to have remained fairly strong last month. The unemployment rate is forecast to have risen to a still historically low 3.6%.The Fed raised its benchmark interest rate by 25 basis points as expected on Wednesday, but Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Still, traders are pricing in a 50% chance of the Fed cutting rates by its July meeting, according to CME Group's FedWatch Tool.Wall Street fell on Thursday after PacWest Bancorp's move to explore strategic options deepened concerns about the health of regional banks, pulling down shares of peers and big banks such as JPMorgan Chase and Wells Fargo &amp;amp; Co.PacWest rebounded on Friday with a 19.6% gain, while Western Alliance Bancorp bounced back 13.2%. Western Alliance on Thursday denied a report that it was exploring a potential sale.The S&amp;amp;P 500 has gained nearly 6% so far this year, while the S&amp;amp;P 500 Banks index and KBW Regional Banking index have lost 17% and 31%, respectively.However, the earnings season has proven largely supportive for markets.Following upbeat results from megacap companies, analysts expect profits for S&amp;amp;P 500 companies in the first quarter to decline 0.9% from a year earlier, according to Refinitiv data, compared with a 5.1% drop expected at the start of April.",
        "At 07:36 a.m. ET, Dow e-minis were up 180 points, or 0.54%, S&amp;amp;P 500 e-minis were up 29.25 points, or 0.72%, and Nasdaq 100 e-minis were up 90.25 points, or 0.69%.Used-car retailer Carvana Co jumped 36.3% as it expects to post a profit in the current quarter and plans to further bring down excess used-car inventory.Lyft Inc slumped 15.5% as the ride-hailing company's strategy to claw back market share from rival Uber Technologies Inc with lower fares stoked concerns about a hit to its profit margins.(Reporting by Ankika Biswas in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}