{
    "articleURL": "/tvshowbiz/article-12060353/Take-confirm-comeback-performing-Coronation-Concert.html",
    "content": [
        "Take That have confirmed they will continue to work together after the band performed for the first time in four years at King Charles III's Coronation Concert at Windsor Castle on Sunday.",
        "Howard Donald, 55, Gary Barlow, 52, and Mark Owen, 51, took to the stage to sing for the royal family and 20,000 fans at the historic residence in Berkshire, with a television audience of millions watching around the world.They started the performance by taking to the stage with German DJ Robin Schulz as they sing their single Greatest Day.After belting out Shine, the choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's third song, Never Forget, which gave the show an uplifting finale.Less than 24 hours after they left the stage, the group - who are set to headline BST Hyde Park on Saturday 1 July - shared a video of themselves during the show on the Instagram page, which they captioned: 'It was incredible to perform live together again for the first time in 4 years and there is so much more to come. We’re back for good.'",
        "Earlier this month, Take That attended a special screening of film Greatest Days at the Soho Hotel in London. The band formed in 1990 with the original line-up consisting of Howard, Gary, Mark, Jason Orange, 52, and Robbie Williams, 49.Robbie quit the band to pursue a solo career in 1995, while Jason left in 2014. ",
        "The musical movie, which will be released on June 16, follows a group of best friends who have the night of their lives seeing their favourite boy band in concert. Fast forward 25 years and their lives have changed in many different ways as they reunite for one more epic show by their beloved band, to relight their friendship and discover that maybe their greatest days are ahead of them.The band have also released their first new music in five years after re-recording their hit 2008 single Greatest Day with singer Calum Scott.Calum told The Sun: 'I was really nervous about jumping on a song that was already such a smash and recording on my vocal in there but it was also such an honour.'Gary and I hit the studio together for a day working on a new section and doing new vocals and then we went it to the boys [Mark and Howard] to rerecord their parts.'",
        "Calum also chatted to Gary about writing some new, original music together.He said: 'We said after this track we want to get in the studio together and write original music.'I'm in the middle of working on my third album so hopefully we can do something for that.'I'm excited to be able to work with him. Even being linked to a band like Take That is wild.'",
        "DJ Robin Schulz has added some dance influence to the stripped-back, anthemic number, which will also appear in the musical.Speaking about the new song, Take That said: 'Greatest Day is a special song for us - it was one of our biggest singles, and our 11th No.1.'It's been fantastic being in the studio working on the new version of the track with Calum and Robin, both such talented artists.'With the movie Greatest Days coming out this summer we wanted to do something special with the title track and we were really excited that Calum and Robin agreed to be involved.'They have been brilliant! We're really excited for everyone to hear it.'It comes after Take That teased all five members will return to the stage 'sometime soon' after posting a throwback video of the original lineup singing Never Forget.",
        "Gary, Howard and Mark have been rehearsing for their upcoming performance at Hyde Park on July 1 in recent weeks and fans are already gearing up for that.The men were recently in Spain where they all met up to record and Mark posted pictures online of them making their way to the studio, cups of tea in hand.Howard also posted a video of himself last week sporting a large beard before a DJ performance with Judge Jules ahead of his forthcoming appearance at Ingliston Country Club in Scotland.",
        "The post on the Take That page got everyone excited, with all five boys - including Robbie Williams and Jason Orange - on stage in a video alongside a caption that said: 'Never forget we will have fun like this again... someday soon.'"
    ]
}