{
    "articleURL": "/femail/article-12043453/I-discovered-kind-husband-actually-cruel-abusive-NARCISSIST.html",
    "content": [
        "In this week's agony aunt column, Jane shares guidance with a wife who thought she'd found her Prince Charming - only to learn he is an abusive narcissist She also writes to a woman abandoned by her friend after her cancer diagnosis  Do you have a question for Jane? Email dearjane@mailonline.com or ask it below Dear Jane,",
        "I married my second husband thinking he was a wonderful person – only to discover that he is a cruel narcissist who I am now unable to escape.I met my current husband when I was still married to my abusive ex. I had three children with my first husband and he abused us all. During that marriage I met the man who would become my second husband. He was an older retired military guy who was warm, funny, and acted like he really cared for me and my children. He seemed as though he was able to provide everything I wanted in a relationship and his support finally gave me the courage to leave my ex once and for all. My kids and I moved in with the military guy - and at first, things were great.But his behavior changed overnight. It was like his emotions just disappeared. After months of kindness and generosity, it all vanished. He became increasingly cruel and demanding – barking orders at me and my children. ",
        "If my kids break his strict rules, he forces them to sit in the corner for hours, ignoring them while they cry – and screaming at me if I try to intervene. It feels like I can’t do anything right. When I do chores, I don’t do them in the right way. If I say something nice to him, I’m trying to kiss his a**. He criticizes my looks, my clothing, my weight… then when I get upset, he tells me I’m just being insecure.",
        "Yet when we leave our home, he’s the same kind, funny guy I met all those months ago. He tells jokes, he’s so nice to people, and when we’re in front of others, he’s really nice to me. Then we go home and he snaps back into his cold, cruel self.I feel like I’m going crazy. I’ve tried to tell him how I feel but he just shrugs my feelings off, telling me I’m being paranoid and that I’m trying to make him feel bad – when all he’s ever tried to do is help me.It’s like I’m living with Dr. Jekyll and Mr. Hyde and I don’t know how much longer I can cope.From, A SurvivorDear Survivor,You are not going crazy. Survivor, you are living with a man who does not value you, who is abusing not just you but your children, and nothing that he is doing falls anywhere within the realm of love or healthy relationships.",
        "I understand your fear and frustration. You never wanted to repeat that pattern and yet here you are again. It’s not unusual to see people subconsciously attracting the same abusive partners, even though every conscious part of you wants things to be different.The fact that he is only kind when there are people around tells me, and I suspect everyone reading this, that this man is not the man you should be with.",
        "There is a woman in my social circle who I have always quite liked. Whenever we found ourselves in the same group of women, she was warm, chatty, funny, engaged. But whenever we went out, she treated the waiters and waitresses like dirt. She was rude and superior, and I knew then that I would never be friends with her. How you treat people when no-one is watching is how you show your character. This woman’s character is awful. Just as this man you are dating is awful, despite whatever crumbs he throws at you when people are watching. How he treats you when it doesn’t matter is the key to this.I am so, so sorry that you are going through this again, particularly when it was the last thing you wanted. Your description of his behavior towards your children is terrifying. You need to get yourself out of this relationship, and quick.And then, Survivor, you need to find yourself a very good therapist, because a sad truism of life is that we are destined to repeat unhealthy patterns until we repair the reason why we are unconsciously attracting them.When we fall into repeated abusive relationships – and make no mistake, your relationship with this man is abusive – we are often repeating patterns of our childhood. Perhaps you had abusive parents, perhaps you were diminished, treated badly, or made to feel unworthy. ",
        "Either way, the chances are that you are recreating very old patterns, and until you do the work to teach yourself that you are worthy of being treated with kindness, respect and love, you are going to keep attracting the same type of man because we repeat what we don’t repair.My first advice to you is protect your children and yourself by ending it with this man. I don’t know where you are based, but I would reach out to your local group supporting victims of domestic violence for help and advice. And then, Survivor - who deserves to be loved and treated well - get yourself into therapy so you never have to go through this again. I am sending you all of my support and love.Dear Jane,I was diagnosed with stage 3 breast cancer six months ago and have been undergoing some rather aggressive treatment. I made the decision to get a double mastectomy pretty early on and have since been doing chemotherapy, which has caused most of my hair to fall out. And that is what it is. I’m not asking for sympathy because of my illness – but rather for some advice about how to handle one friend’s response to it.A friend who I would previously have counted as being one of my closest has effectively disappeared from my life since I was diagnosed. ",
        "While so many people in my life – including several who I haven’t spoken to in years – have rallied around me and offered unwavering support, I’ve only seen this one friend once since I shared the news with her. And that was with a group of people and the whole time it felt like she was avoiding speaking with me one-on-one.Perhaps I’m being overly sensitive (chemo will do that to you!) but I’ve made several attempts to reach out, to ask if she wants to meet up, to ask her just to talk, and she’s always made an excuse. She’s too busy with work, she has a dentist appointment, her kids need shuffling to play dates… the list goes on. We used to see each other at least once a week, and it’s only since my diagnosis that she seems to have no time for me.I can’t help but feel horribly betrayed. Losing my hair is one thing but I can’t stand the thought that I’m going to lose someone I care about so much because of cancer.I don’t know whether I should confront her or just let her go from my life for good.Any advice you can give would be very much appreciated.From, At a Loss",
        "Dear At a Loss,I am so sorry that you are going through cancer treatment, and even sorrier that a friend you love has disappeared. ",
        "Friendships between adult women can be as complicated and troubled as they were in high school. We think we have outgrown drama, hurt and disappointment, but can so easily be let down or feel betrayed, have friendships that we thought were for life blow up in a puff of dust. If someone has hurt you, it is vital to let them know. If you can’t face a confrontation, write to them. The ones who are supposed to be in your life will always hear you and respond. If they don’t answer, we wish them well and move on.",
        "The thing is that severe illness, death, the difficult things that life throws at us, can be terrifying for those we love, and in lieu of not knowing what to say, they sometimes say nothing at all. Not everyone has the capacity to deal with the hard stuff, and it may be that you have to decide whether or not this is a friendship that you want to continue.I do not know whether or not your friend has the capacity to be the person you need, but I do know that you have to express how you feel. Whether it’s in person, or in a letter, you need to tell her how hurt you are. How she responds, indeed whether she responds at all, will show you whether she is someone you should continue to have in your life.I am going to share my own story for I went through something similar. When I was diagnosed with cancer a few years ago, I sent an email to my closest friends informing them. I heard back from everyone. Except one. My closest friend. When I ran into her unexpectedly a couple of weeks later, she made a lighthearted joke about needing to get a check-up, and that was that. I felt as bewildered, hurt and confused as I imagine you are feeling now. I wrote her a letter explaining how I felt. I told her that I believed she loved me, and couldn’t understand how she could be so cavalier. I told her how hurtful her silence was, as was making a joke when my life felt like it was being held in the balance.She sent back the warmest, most apologetic and contrite letter. Yes, she loved me, and hadn’t realized how cavalier she had been. Several years on, she remains one of my closest. Had I not written to her, had she not been able to hear me, we would no longer be friends.Find a way to tell your friend how you feel, how frightening cancer is, how you need your friends to be there for you right now in a way you might not usually. Tell her you understand this is difficult for some people, and if she does not have the capacity, she needs to tell you.The important thing here is for you to express your feelings. After that, you let the chips fall where they may. I wish you health and happiness on this journey, and that you are surrounded by people who are able to catch you when you fall."
    ]
}