{
    "articleURL": "/wires/aap/article-12055961/Role-Victorian-First-Peoples-Assembly-widen.html",
    "content": [
        "Victorian Premier Daniel Andrews says Aboriginal people should have a greater say in how taxpayer money is spent on programs intended to improve outcomes for them.",
        "His comments follow reports the role of the First Peoples' Assembly of Victoria could widen to become similar to a statewide voice to parliament.The assembly is set to begin statewide treaty negotiations later this year and voting to elect 22 members gets under way next week.\"The First Peoples' Assembly is about treaty and some of the issues that are canvassed in coverage today would be, might well be part of treaty,\" Mr Andrews told reporters on Sunday.\"It'll be many years before we have all of those things resolved but ultimately, listening to Aboriginal people is how you get better outcomes for Aboriginal people.\"We've tried the other way for a long time, and it has not worked.\"In a submission to the Yoorrook Justice Commission in late April, the government said there was no mechanism for Aboriginal community decision-making on budget priorities, and funding was difficult to track over multiple years.\"The Treaty Negotiation Framework includes funding and revenue-raising as potential subject matters for Treaty negotiations, and offers the potential, over time, to transfer the Victorian Government's spending on First Peoples to a representative decision-making body,\" the submission stated.\"An ongoing representative body could lead reforms to improve budget outcomes for First Peoples - working with (Aboriginal Community-Controlled Organisations) to determine funding priorities and linking budget reporting measures to Aboriginal-led outcome measurements.\"",
        "The assembly's co-chair Marcus Stewart said nothing was off the table when it came to negotiating treaty.\"The Assembly will seek to negotiate what representation First Peoples have in the long term to make sure there are no decisions made about us without us,\" Mr Stewart said in a statement.\"This could be through the Assembly becoming a permanent Black Parliament with decision-making powers, for example.\"Victorian Liberal Leader John Pesutto said the party would consider whether the assembly could have a greater role but was waiting for further details.\"Anything that helps close the gap, anything that helps promote better opportunities for Indigenous Victorians, we will obviously look at with an open mind,\" Mr Pesutto said."
    ]
}