{
    "articleURL": "/tvshowbiz/article-12044505/Nicola-Peltz-hides-dog-husband-Brooklyn-Beckham-New-York.html",
    "content": [
        "Brooklyn Beckham and Nicola Peltz kept a low profile while out in New York on Wednesday - after Gillian McKeith's daughter Afton claimed she once had a fling with him. ",
        "The famous son of Victoria and David Beckham, 24, and the actress, 28, were shopping in What Goes Around Comes Around in Soho, New York. Brooklyn held their beloved pooch Lamb on a lead as he dotingly followed behind his wife, who he tied the knot with in April 2022.He opted for a laid-back look as he sported a black sweatshirt and matching denim jeans. Meanwhile, Nicola looked stylish even for a casual outing in a black fitted top that exposed a portion of her toned midriff. ",
        "She added denim mom jeans and chunky heeled boots for a practical look as she walked her dog. The happy couple, who married in April 2022, brought Lamb into their family in October, sharing a slew of sweet snaps with their new fluffy white pooch. Alongside the adorable photos, Nicola penned: 'We adopted our baby today and named her Lamb. 'She is the sweetest angel! Today is such a hard for me because it's Gina's birthday and I can't hug her but I feel like she sent me Lamb. 'I'm so grateful for this love. Please adopt or foster if you can the love it brings to your family is like nothing else.'It comes after Gillian McKeith's daughter Afton claimed that she once had a fling with Brooklyn. ",
        "The 23-year-old claimed she dated the famous nepo baby when she was younger - but added she no longer 'keeps up' with what he's doing.She also told how she recently had an awkward run in with Brooklyn and his wife Nicola at an LA supermarket.  ",
        "She told The Sun: 'I didn't watch any of his wedding. I actually don't keep up with what he does.'But I actually bumped into him not so long ago in Los Angeles at my local supermarket - Erewhon - and her as well. It was extremely awkward.'You know, they seem good. I wish them the best. I hope they have a really long and happy marriage.'Afton has previously told how Brooklyn blocked her on Instagram.Their fling was reportedly in between Brooklyn's relationships with Madison Beer and Chloe Grace Moretz. A source told The Star at the time: 'The romance didn't last too long but Afton definitely grew feelings for Brooklyn.'Reps for Brooklyn have been contacted by MailOnline for comment. "
    ]
}