{
    "articleURL": "/wires/afp/article-12044733/Bidens-election-campaign-hard-notice--now.html",
    "content": [
        "In Joe Biden's menacing, online meme persona, \"Dark Brandon,\" he zaps enemies, effortlessly fixes problems and sweeps every obstacle aside. In the real-life president's now week-old re-election campaign, however, hardly anything is happening at all.",
        "Biden announced on April 25 via video that he is seeking a second term in 2024. He hasn't talked about it a huge amount since.The 80-year-old doesn't have a campaign headquarters yet, although it is expected to be in his beloved, if sleepy, hometown of Wilmington, Delaware. And he doesn't have an active campaign manager either: Julie Chavez Rodriguez doesn't start for another two weeks.Forget rallies in swing states, media interviews or rousing speeches in the near future.Asked Wednesday whether Biden would be ramping up travel, Press Secretary Karine Jean-Pierre said, \"We don't have anything to share at this time on his travels, whether political or official.\"On Monday, Biden's main event was a short celebration in the White House Rose Garden for National Small Business Week. On Tuesday, Biden had no public events at all. On Wednesday, the White House told journalists not to come in before lunchtime, while the only public event for Biden was a dinner with top military officers.The sole press conference he's had since his announcement a week ago was while hosting South Korean President Yoon Suk Yeol. The only election-related question concerned whether at 80 he was too old to run again.",
        "Biden answered by saying he'd taken \"a hard look\" at his age, but that \"I feel good.\"",
        "Hardly the stuff of \"Dark Brandon.\"In the memes, doctored photos and manga-style cartoons show Biden's eyes emitting red or yellow laser beams as he pulverizes foes. The White House has embraced the satirical character in an attempt to flip Biden's grandfatherly image into something cooler.\"Dark Brandon is crushing it,\" as a White House spokesman, Andrew Bates, said in one Biden-boosting tweet last summer.- 2020 all over again? -While Biden tiptoes into 2024, Donald Trump, the man he beat in 2020 and wants to come back, is already on the charge.",
        "The scandal-engulfed former president is steamrolling his way to a powerful frontrunner position for the Republican nomination, setting the stage for perhaps the most extraordinary comeback attempt in American political history.His schedule looks a little different.Last Thursday, Trump was delivering a typically meandering, often bizarre speech to ecstatic supporters in New Hampshire, one of the first states to vote in the nomination contest.This Tuesday, he issued a video railing against \"Marxist maniacs.\"Then on May 10, in a piece of high-wire political theater, Trump will attend a live audience question-and-answer town hall on CNN -- the very network that when he was president he cursed as \"enemy of the people.\"Even more intriguing is a May 13 trip to Iowa, the state holding the first Republican nomination caucuses next year.",
        "Trump will be looking to upstage a simultaneous visit by Ron DeSantis, the Florida governor whose undeclared campaign to be anointed the hard-right's new, young champion appears to be in the process of withering.Looks, however, can be deceiving.In 2020, Republicans derided Biden for spending most of the campaign in his Delaware home's basement office -- ostensibly in response to the Covid-19 pandemic. Trump, meanwhile, ignored health warnings and continued staging rallies where he mocked his challenger as weak.Biden proved his doubters wrong.The low-key start now may again be hiding his strengths.As the incumbent, he has the huge advantage of being in the public eye whether he openly campaigns or not. Rose Garden events give the president the backdrop of the most storied patch of lawn in the country.And he doesn't have to rely on making campaign promises. He has a record of achievements to wave -- and a slick team making videos to tell Americans about it.Biden certainly appears relaxed.At the black-tie White House Correspondents Association annual dinner last Saturday, Biden said he and Vice President Kamala Harris will be no pushover.\"This dinner is one of the two great traditions in Washington. The other one is underestimating me and Kamala,\" he said.",
        "Then, turning to Roy Wood Jr, the comedian coming on stage to make fun of him, Biden triggered roars of laughter by putting on his Aviator sunglasses.\"I'm going to be fine with your jokes,\" he told Wood. \"But I'm not sure about 'Dark Brandon.'\""
    ]
}