{
    "articleURL": "/wires/reuters/article-12044819/Hurricanes-dominate-phases-crush-Devils-5-1.html",
    "content": [
        "Jesper Fast had a goal and an assist as the Carolina Hurricanes collected a 5-1 win over the visiting New Jersey Devils in Game 1 of their Eastern Conference semifinal series on Wednesday in Raleigh, N.C.",
        "Jordan Martinook and Jordan Staal each had two assists, while Brett Pesce, Seth Jarvis, Jesperi Kotkaniemi, and Brady Skjei all scored for the Hurricanes. Frederik Andersen made 18 saves.It was an impressive blend of both offense and defense for the Hurricanes, as the Devils couldn't generate consistent pressure against Carolina's blanketing forecheck and backcheck.While the Hurricanes finished the game with a relatively even 23-19 shots advantage, Carolina set the defensive tone early by outshooting New Jersey 10-1 during a lopsided first period.Nathan Bastian had the only goal for the Devils, who also lost by a 5-1 score in the first two games of their first-round series with the New York Rangers.Jarvis' goal 14:43 into the first period was emblematic of Carolina's performance at both ends of the ice, as he started the play with a takeaway in the Hurricanes' zone. Jarvis then took the puck down the boards, turned toward the Devils' net, and capped off the individual effort with his third goal of the playoffs.Kotkaniemi's goal at 1:55 of the second period gave Carolina a 3-0 lead and chased Devils starting goaltender Akira Schmid from the game. Schmid allowed three goals on 11 shots, while Vitek Vanecek stopped 10 of 11 shots in the relief effort.",
        "Once the Devils' offense started to heat up, Andersen prevented New Jersey from gaining any momentum. Injury and illness have limited Andersen to just two appearances this postseason, but the goalie is 2-0 with an outstanding .962 save percentage.New Jersey was 0-for-2 on the power play, as the Hurricanes' penalty-kill unit continued to dominate. Carolina was second in the NHL in penalty-kill percentage during the regular season, and it has killed off 19 of 20 penalties in the playoffs.Game 2 is on Friday in Raleigh.--Field Level Media"
    ]
}