{
    "articleURL": "/wires/reuters/article-12055871/Grant-Enfinger-gets-win-season-Kansas.html",
    "content": [
        "Grant Enfinger stayed ahead of trouble in a race that produced seven cautions for 40 of 134 laps and forged a decisive victory in Saturday night's Heart of America 200 NASCAR Craftsman Truck Series race at Kansas Speedway.",
        "Enfinger crossed the finish line 4.358 seconds ahead of Corey Heim to post his first victory of the season.Enfinger's eighth career win was his first at Kansas and his first since winning at Lucas Oil Raceway in Indianapolis in the 17th race of 2022.\"It was a huge night for us,\" said Enfinger, who led a race-high 65 laps.\"From the drop of the green flag, we had a really, really good Chevy Silverado. Just started out really tight. Once (crew chief) Jeff (Hensley) made one adjustment on it, I felt like from that point forward, we were potentially the best truck out there,\" Enfinger said.Heim won a close battle for second over Zane Smith. Stewart Friesen was fourth, followed by Ross Chastain. Nick Sanchez, Kyle Busch, Jake Garcia, Taylor Gray and Tyler Ankrum completed the top 10.The final caution dimmed Heim's chances.\"I think that last caution (for Kris Wright's second spin) put a hole in our strategy a little bit,\" Heim said. \"If we had that last run go green and we had the same tires as the 23 (Enfinger), I thought we could beat him straight up.\"As soon as we got that last caution and we were on uneven tires, I knew it was going to be all track position. I got hung up trying to block the 38 (Smith) and kind of took a step back from there and lost track position.\"",
        "Two of the fastest trucks in the race saw their chances to win end in a shunt on Lap 72, when Rajah Caruth spun across the bumper of Ty Majeski's No. 98 Toyota into the outside wall on the frontstretch.Caruth's truck was too heavily damaged to continue, and Majeski's was too heavily damaged to contend.\"It was really close, and we had a long way to go,\" Caruth said after exiting the infield care center. \"I was trying to cover the top, and he just kind of hooked me there. Good to know.\"I didn't double-move or anything. I picked the top there, and he just took me.\"From appearances, though, Caruth was late in an attempt to block Majeski's progress, to the detriment of both trucks. Majeski finished 25th.Pole winner Christian Eckes likewise was involved in a terminal wreck after the subsequent restart on Lap 79. Aggression got the best of drivers at the front of the field, and the trucks of Eckes, Matt DiBenedetto, Carson Hocevar and Chase Purdy all were KO'd in Turn 1.\"Just aggression, I guess, Eckes said. \"He (DiBenedetto) blocked a little late and got loose, and I tried to go high, and I might have caught his rear quarter panel. Yeah, it sucks.\"",
        "Busch won the first stage before tangling with Ben Rhodes after the Stage 2 restart. Enfinger powered past Busch into the lead on Lap 40 but came to pit road under the third caution for Wright's spin through the infield grass.Enfinger gave up the lead with the stop but charged back to second by the end of the stage, which Majeski won.NASCAR CRAFTSMAN Truck Series Race -- Heart Of America 200Kansas SpeedwayKansas City, KansasSaturday, May 6, 20231. (11) Grant Enfinger, Chevrolet, 134.2. (12) Corey Heim, Toyota, 134.3. (7) Zane Smith, Ford, 134.4. (14) Stewart Friesen, Toyota, 134.5. (17) Ross Chastain(i), Chevrolet, 134.6. (6) Nick Sanchez #, Chevrolet, 134.7. (2) Kyle Busch(i), Chevrolet, 134.8. (4) Jake Garcia #, Chevrolet, 134.9. (19) Taylor Gray #, Toyota, 134.10. (23) Tyler Ankrum, Toyota, 134.11. (21) Matt Crafton, Ford, 134.12. (16) Hailie Deegan, Ford, 134.13. (10) Daniel Dye #, Chevrolet, 133.14. (28) Bret Holmes #, Chevrolet, 133.15. (24) Toni Breidinger, Toyota, 133.16. (5) Ben Rhodes, Ford, 133.17. (34) Lawless Alan, Chevrolet, 133.18. (8) Tanner Gray, Toyota, 133.19. (27) Johnny Sauter, Ford, 133.20. (26) Brennan Poole(i), Toyota, 133.21. (31) Nick Leitz, Chevrolet, 133.",
        "22. (30) Tyler Hill, Toyota, 132.23. (32) Justin Carroll, Toyota, 132.24. (29) Josh Reaume, Ford, 132.25. (9) Ty Majeski, Ford, 131.26. (36) Spencer Boyd, Chevrolet, 131.27. (33) Mason Maggio, Ford, 131.28. (25) Kris Wright, Chevrolet, Accident, 91.29. (18) Matt DiBenedetto, Chevrolet, DVP, 81.30. (1) Christian Eckes, Chevrolet, Accident, 78.31. (20) Carson Hocevar, Chevrolet, Accident, 78.32. (22) Dean Thompson, Toyota, Accident, 78.33. (3) Chase Purdy, Chevrolet, Accident, 78.34. (13) Rajah Caruth #, Chevrolet, Accident, 72.35. (15) Colby Howard, Chevrolet, Accident, 55.36. (35) Tim Viens, Toyota, Transmission, 2.Average Speed of Race Winner: 101.005 mph.Time of Race: 1 Hrs, 59 Mins, 24 Secs. Margin of Victory: 4.358 Seconds.Caution Flags: 7 for 40 laps.Lead Changes: 15 among 9 drivers.Lap Leaders: C. Eckes 1-6;B. Rhodes 7-23;K. Busch(i) 24;Z. Smith 25-29;K. Busch(i) 30-39;G. Enfinger 40-50;T. Majeski 51-55;C. Heim 56;T. Majeski 57-63;G. Enfinger 64-85;S. Friesen 86;C. Heim 87-94;T. Gray 95-97;Z. Smith 98;C. Heim 99-102;G. Enfinger 103-134.Leaders Summary (Driver, Times Lead, Laps Led): Grant Enfinger 3 times for 65 laps; Ben Rhodes 1 time for 17 laps; Corey Heim 3 times for 13 laps; Ty Majeski 2 times for 12 laps; Kyle Busch(i) 2 times for 11 laps; Christian Eckes 1 time for 6 laps; Zane Smith 2 times for 6 laps; Tanner Gray 1 time for 3 laps; Stewart Friesen 1 time for 1 lap.",
        "Stage #1 Top Ten: 51,99,38,23,4,24,16,11,42,13Stage #2 Top Ten: 98,23,11,24,38,19,16,4,52,5--By Reid Spencer, NASCAR Wire Service. Special to Field Level Media"
    ]
}