{
    "articleURL": "/sport/nba/article-12050437/NBA-star-Luka-Doncic-cover-funeral-costs-Belgrade-school-shooting-victims.html",
    "content": [
        "Eight children and guard have been killed in a shooting at a school in BelgradeSlovenian basketballer Luka Doncic, who has connections to Serbia, is helpingThe Dallas Mavericks star is covering the funeral costs of the shooting victims Basketball star Luka Doncic is covering the funeral costs for the victims of Wednesday's mass school shooting in Belgrade, it has been revealed.",
        "Slovenian star Doncic, who has family connections to Serbia on his father's side, has been left 'heartbroken' by the shooting and is determined to help the school and families affected.The Dallas Mavericks star signed a $207million contract extension in 2021 to stay in Texas until 2027 and he is eager to use his fortune to help the grieving city of Belgrade now. Kosta Kecmanovic, 13, identified by police as the suspected shooter, opened fire in his classroom at a Belgrade school on Wednesday, Serbian police revealed. Eight pupils and a security guard at the Vladislav Ribnikar primary school in the Serbian capital were killed, marking the nation's first mass school shooting.",
        "'I am heartbroken by the tragic school shooting in Serbia and the loss of lives, including those of innocent children,' Doncic said on Twitter.'I am exploring both immediate and long-term ways to support the students, faculty, and families affected by the shooting.'The Slovenian four-time NBA All-Star plans to provide 'long-term assistance' to those impacted, a Mavericks spokesman added.'I am committed and I will continue to share updates and ways to support as details become available,' said Doncic.  Kecmanovic, 13, has been arrested for killing eight children and a guard but it is feared the death toll could rise, with at least seven others injured. ",
        "On Wednesday night hundreds of people massed in Belgrade in memory of those killed as they lay flowers, left teddy bears and lit candles in their grief.The baby-faced teenager, who may not be legally responsible for his actions due to being under the age of 14, was arrested in the Vladislav Ribnikar primary school yard and led away with his face covered after he called police himself.",
        "Serbia's President Aleksandar Vucic said on Wednesday that both the boy's parents have also been arrested, and that he is to be taken to a psychiatric institution.The shooter drew up plans for the massacre over a month, making sketches of classrooms which looked like a 'horror movie', Belgrade's police chief, Veselin Milic, revealed.He was armed with two guns and two petrol bombs and had planned everything meticulously, even compiling a list with the names of children he wanted to kill and their classes, according to Milic.Terrified students hid under their desks amid 'non-stop shooting' at around 8.40am on Wednesday morning. Kecmanovic then called police himself when the depraved attack was over.Seven people were injured, including a teacher, who reports have said is fighting for their life.The shooter first killed a guard at the school in central Belgrade and then three students in a hallway, police said. He then entered a classroom - reportedly choosing it simply because it was close to the entrance - and opened fire again. ",
        "Body bags were later seen being brought out of the school to a van outside.A follow-up shooting took place on Thursday when gunman said to be shooting at random killed eight people and wounded 14 in three Serbian villages.Police arrested a suspect on Friday after an all-night manhunt.Serbian President Aleksandar Vucic called Thursday's shooting an attack on the whole nation - and said the person arrested wore a T-shirt with a pro-Nazi slogan on it."
    ]
}