{
    "articleURL": "/wires/ap/article-12060757/Source-Army-booted-Texas-mall-gunman-mental-health.html",
    "content": [
        "DALLAS (AP) - The man accused of killing eight people and wounding several others in a mass shooting at a suburban Dallas shopping mall researched when it was busiest and posted photos on social media in mid-April of a store near where he ultimately started his attack.",
        "The posts by Mauricio Garcia on a Russian social networking site suggest the 33-year-old had been planning the attack for weeks before he stepped out of a silver sedan and opened fire Saturday. Among the dead were two elementary school-age sisters, a couple and their 3-year-old son, and a security guard.Garcia's online activity also betrayed a fascination with white supremacy and mass shootings, which he described as sport. Photos he posted showed large Nazi tattoos on his arm and torso, including a swastika and the SS lightning bolt logo of Hitler´s paramilitary forces.Other posts indicated Garcia had researched when the Allen Premium Outlets in Allen, one of the Dallas-area´s most diverse suburbs, would be the busiest - Saturday afternoons, the time he carried out the massacre, which ended when police shot and killed him.The online activity contributed to an emerging picture of the gunman Monday. He was discharged from the Army in 2008 because of mental health issues and apparently had been working as a security guard, according to neighbors and an Army official.Aric Toler, director of training and research at the international research collective bellingcat.com, said he identified Garcia´s profile on the site OK.RU by searching for active accounts with his birthdate located in the U.S. The AP independently verified the account, which also featured an image of a traffic ticket with Garcia´s name and birthdate as well as paperwork from a motel where he stayed before the shooting.",
        "Federal agents investigating what motivated the shooting have also reviewed the online posts, according to a federal law enforcement official who could not discuss details of the investigation publicly and spoke to the AP on condition of anonymity.The official also said Garcia had a patch on his chest when police killed him that read \"RWDS,\" an acronym for the phrase \"Right Wing Death Squad,\" popular among right-wing extremists and white supremacy groups.Investigators have also interviewed family members and associates of Garcia to ask about his ideological beliefs and are examining his financial records and other electronic media, the official said.Garcia joined the Army in 2008 but was terminated three months later without completing his initial training, U.S. Army spokeswoman Heather J. Hagan said.According to an Army official who spoke on the condition of anonymity to discuss personnel issues, he was kicked out due to mental health issues.Garcia received an \"uncharacterized\" discharge, which is common for recruits who don´t make it through training or the first 180 days, according to a defense official who also spoke on condition of anonymity to discuss personnel issues. That type of discharge - which is not dishonorable - would not set off red flags or require any reports to law enforcement.",
        "On the Dallas block where Garcia lived at a family home until recently, neighbors said they thought he worked as a security guard but they weren't sure where. The company that manages the mall where the attack happened didn't immediately reply to messages seeking further information.A woman who lives next door said she didn't know her neighbors well but described them as nice and polite. Garcia was always friendly, waving and honking, she said.A law enforcement official said investigators also have searched a Dallas motel where Garcia had been staying ahead of the attack.Amid protests Monday at the Texas Capitol for stricter gun control, two Republicans sided with Democrats to advance a bill that would raise the age to buy semiautomatic rifles from 18 to 21, though the measure has little or no chance of actually becoming law.The shooting was the latest attack to contribute to the unprecedented pace of mass killings this year in the U.S. Just over a week before, five people were fatally shot in Cleveland, Texas, after a neighbor asked a man to stop firing his weapon while a baby slept, authorities said.The community mourned the dead and awaited word on the seven people who were wounded. Medical City Healthcare said Monday it was treating six patients: Three were in critical condition, two were in fair condition and one was in good condition at a children´s hospital. Police said a seventh wounded person was taken to a different hospital.",
        "Allen, which is home to about 105,000 people, is among the Dallas-Fort Worth area's diverse suburbs. The area saw the largest Asian American growth rate of any major U.S. metro area, according to U.S. Census figures. Those statistics show that Allen's population is about 19% Asian, 10% Black and 11% Hispanic.Allen also is connected to another of Texas´ recent mass shootings. Patrick Crusius lived there in 2019 before he posted a racist screed online warning of a \"Hispanic invasion\" and drove to El Paso, where he opened fire at a Walmart, killing 23. Crusius, 24, pleaded guilty to federal hate crime and weapons charges in February.___Baldor reported from Washington and Johnson from Seattle. Jamie Stengle and Adam Kealoha Causey in Dallas; Michael Balsamo in Washington; Vanessa Alvarez in New York; James Vertuno in Austin; Michelle R. Smith in Providence, Rhode Island; and Rebecca Boone in Boise, Idaho, contributed to this report."
    ]
}