{
    "articleURL": "/wires/reuters/article-12040957/Pirates-look-series-Rays.html",
    "content": [
        "The Tampa Bay Rays, who have the best record in the American League, and the Pittsburgh Pirates, who are tied for the best mark in the National League, have proven over the first month of the season that they are multidimensional.",
        "The first game of their head-to-head series in St. Petersburg, Fla., featured the teams' pitching prowess on Tuesday, as the Rays emerged with a 4-1 win. The three-game set continues Wednesday.Tampa Bay went with a bullpen game on Tuesday, with Javy Guerra serving as an opener in front of Josh Fleming, who was expected to pitch the bulk of the game. That went sideways when Fleming got hit on his left foot by a comebacker off the bat of the Pirates' Ke'Bryan Hayes in the fifth.Initial images showed no fracture for Fleming, according to the team.Even with Fleming's exit, the Rays won with their arms, getting a scoreless inning from each of five relievers after Fleming departed. Overall, Tampa Bay held the Pirates to five hits.\"Everybody believes in our pitchers,\" said Rays designated hitter Harold Ramirez, whose solo shot on Tuesday was Tampa Bay's major-league-leading 62nd homer of the season.Pittsburgh, which had won 11 of 13 entering the series, has lost two straight games for the first time since it dropped the second and third games of the season at Cincinnati.The Pirates didn't let Tampa Bay's offense go wild in the opener, allowing just six hits. However, Pittsburgh will have to win Wednesday and Thursday to clinch its fifth straight series victory, one that would come in the most important and telling matchup so far.",
        "\"There's not a lot of room for error,\" Pittsburgh manager Derek Shelton said of facing the Rays.On Wednesday, Pittsburgh right-hander Mitch Keller (3-0, 3.53 ERA) is scheduled to start against Tampa Bay left-hander Shane McClanahan (5-0, 2.12).McClanahan most recently pitched five innings, giving up two runs, in a road win over the Chicago White Sox on Thursday.That matched his shortest outing this year, but he only came out at that point because of circumstances.\"Pitch count was way down, but it was (previously) a 30-minute half-inning, and it was a little colder than we're accustomed to playing in,\" Rays manager Kevin Cash said. \"We felt like if there was a time to shave an inning off, why not do it then?\"McClanahan's only career start against the Pirates came last June 26, when he yielded one run and four hits in seven innings, with no walks and 10 strikeouts. McClanahan emerged with a 4-2 win.Keller tied his career high with 10 strikeouts on Thursday, when he gave up two runs in six innings during a 6-2 win against the Los Angeles Dodgers.At that time, the three-game set against the Dodgers was a measuring stick for Pittsburgh. Keller and the Pirates clinched that series by taking the finale.",
        "\"I don't know if it's a statement series. I think we're just playing really good baseball,\" Keller said then. \"Everything's clicking. We're hitting the ball, we're pitching the ball, we're running, we're playing defense. We're doing everything right.\"Now Keller, who has worked at least six innings in each of his past five starts, will take the mound in what is an even bigger matchup.In his only career start against the Rays, last June 24, Keller allowed three runs in five innings and did not get a decision.--Field Level Media"
    ]
}