{
    "articleURL": "/wires/reuters/article-12040051/UPDATE-2-Singapores-Keppel-drop-conglomerate-structure-targets-150-bln-AUM-2030.html",
    "content": [
        "Operations to be divided into three units",
        "Targets S$100 bln in assets under management by 2026-endExpects annual savings of up to S$70 mln by 2026 from restructureTargets up to S$12 bln in asset monetisation by 2026-endMay 3 (Reuters) - Singapore's Keppel Corp on Wednesday announced a major corporate restructuring, doing away with its conglomerate form and divide itself into three distinct units, in a bid to simplify and further grow its operations.The conglomerate, which has operations ranging from data centres to renewable energy assets, will restructure itself into three businesses - fund management, investment, and operating platforms.The fund management business will focus on capital raising, investment platform will make capital investment decisions, while the operating platform unit will subsume its other existing operations.\"This latest restructuring reflects a fundamental shift in how we organise ourselves to operate in a nimbler manner and harness technology to grow at speed and scale,\" Keppel Chief Executive Officer Loh Chin Hua said.\"From a diversified conglomerate, we are accelerating our transformation to be one integrated company - a global alternative real asset manager, with deep operating capabilities in Infrastructure, Real Estate and Connectivity.\"The company, which traces its roots to a small ship repair yard corporatised in 1968, said the shake-up could result in annual savings of between S$60 million and S$70 million by 2026.",
        "Keppel also announced plans to significantly increase its assets under management (AUM) to S$200 billion ($149.93 billion) by 2030, with an interim target of achieving S$100 billion worth of AUM by 2026-end, double of what it had at the end of last year.The firm is now targeting between S$10 billion to S$12 billion in cumulative asset monetisation by 2026-end. It has already achieved asset monetisation of S$4.9 billion as at end of first-quarter of fiscal 2023 since the program was launched in late 2020. ($1 = 1.3340 Singapore dollars) (Reporting by Sameer Manekar in Bengaluru; editing by Uttaresh Venkateshwaran)"
    ]
}