{
    "articleURL": "/news/article-12048859/RICHARD-LITTLEJOHN-miracle-slimming-drug-NHS-Let-eat-dust.html",
    "content": [
        "What would Marjorie Dawes, the group leader of FatFighters in Little Britain, make of Wegovy, the new miracle weight-loss injection?Matt Lucas’s grotesque creation delighted in humiliating her obese clients — even though she was no stranger to the all-you-can-eat buffet, either.Her top dieting tip involved eating nothing but dust, because dust is low in calories.‘Dust, anybody . . . NO?’Alternatively, they could cut their portions in half. Then, because they’d halved the number of calories, they could eat twice as much. Needless to say, none of them lost any weight, yet continued to subject themselves to Marjorie’s weigh-ins and cruel insults.",
        "But what if, instead of having to attend an ordeal in a draughty church hall they could simply have a jab once a week and watch the pounds melt away?How long would FatFighters have lasted in the face of an effortless alternative?Enter Semaglutide, a ‘game-changer’ drug from the U.S., already popular with porky celebrities including Jeremy Clarkson and Elon Musk. In trials, it has been shown to reduce weight by at least 10 per cent by suppressing appetite and is sold under the brand names Ozempic and Wegovy.",
        "It has just been approved for use in the UK by the National Institute for Health and Care Excellence (Nice). Four million people in England are expected to be eligible to receive it on the NHS.In the States, the drug costs around £1,000 a month, but because the NHS buys in bulk, that could be as low as £125 when it becomes widely available here.All that appears to be holding it back is the fact that the manufacturers can’t produce it fast enough to keep up with demand.But if this sounds like the holy grail in the fight against obesity, steady on. It’s one thing for Clarkson and Musk to fork out a grand a time. It’s their money, they’ve earned it, good luck to them.What we should be asking is why, even at a ‘mere’ £125 a pop, Wegovy should automatically be doled out free on the NHS.Especially at a time, post-Covid, when more than seven million people are on interminable waiting lists for everything from routine knee replacements to life-saving cancer treatment.",
        "The NHS is always pleading poverty, no matter how much money is tipped into its bottomless pit. So where, exactly, is the cash for Wegovy coming from?According to my back-of-an-envelope calculation, four million doses a month at £125 a pop adds up to £6 billion a year.That’s half as much again as the latest NHS pay settlement, which will cost taxpayers £4 billion, even if striking nurses and doctors cave in without winning another penny. How can anyone justify spending six billion quid on a flab jab for people who can’t control their appetite?Sorry, but I refuse to accept that obesity is a disease. And even if you disagree, it’s self-inflicted. People get fat because they eat too much and take too little exercise.If you’re overweight, the solution is in your own hands. Stop stuffing your face with Hobnobs, lay off processed food, and move about more.Nobody should be entitled to expect the State health service to provide them with an expensive miracle weight-loss drug, free of charge.Maintaining a healthy weight shouldn’t be too difficult, given a bit of willpower. Fad diets aren’t the way to go, either.",
        "According to a new report from the United Nations food commission, vegan meals are actually less healthy than eating meat, eggs and dairy. You only have to look at most vegans to work that out.Which might explain why a Yorkshire sausage maker has just scrapped 90 per cent of its vegan products because nobody wanted to buy them.How many people would choose a quinoa and beetroot banger over a juicy Cumberland sausage? That might also explain why supermarket sales of meat-free food fell by £37 million in the year to last September.Perhaps the NHS would be better off prescribing vegan sausages, rather than shelling out a Gulf sheikh’s ransom on fancy new drugs we can’t afford and don’t need. Faced with having to live on nothing but quinoa and beetroot, the chubbies wouldn’t eat anything at all and the flab would fall off.So next time some morbidly obese lardbucket wobbles into the local surgery, demanding that the NHS helps them lose weight, his or her GP should simply point them in the direction of Marjorie Dawes and FatFighters.Never mind Wegovy, let them eat dust.Why are seagulls a protected species? They are an absolute menace. Over the years, this column has covered seagull attacks on women, children, golfers, pets, motor vehicles, you name it. Nowhere is safe. Day trippers to seaside towns live in terror of gulls stealing their chips.",
        "The birds’ droppings are toxic. A library in Folkestone, where gulls have destroyed roofing, guttering and windows, has been forced to close until further notice. Repairs will cost £2 million. Scarborough says tourists are being driven away because of ‘gull muggings’.Yet it is still an offence to shoot one of these flying rats, punishable by a £5,000 fine. So how do you get rid of them? I once heard from a fisherman who breaks off match-heads and hides them in dough balls, which he throws to the gulls. The sulphur in the matches reacts with the acid in the bird’s stomach and . . . BOOM! Problem solved.Naturally, I couldn’t endorse this method, so other deterrents must be found. Blackpool Zoo is plagued by dive-bombing seagulls, and has advertised for five people to dress up as giant eagles to scare them away. Incredibly, more than 250 people applied.They’ve even had one application from Ukraine. To be honest, he’d probably be safer in Kyiv.",
        "My column on Tuesday highlighted the news that some desperate employers are now offering doggy daycare in an attempt to lure staff back to work.That same morning, the first contestant on Ken Bruce’s Popmaster on Greatest Hits Radio was Linda Elms, from Oxford. She runs a doggy daycare centre.Walking the dog, just a walkin’ the dog...The Chinese info takeawayAmong the dignitaries invited to the Coronation, the Chinese Communist Party (CCP) are sending their vice-president responsible for the repression of freedom in our former colony of Hong Kong, in flagrant breach of assurances given during the handover.Why do we continue to kowtow to an increasingly belligerent Beijing?",
        "Having eventually decided to exclude Huawei from involvement in Britain’s 5G network — under pressure from our U.S. allies — who then thought it was a good idea to use Chinese-made CCTV cameras at the Coronation?Who knows what data they are gathering and sending back home. They could be programmed to spy on our security arrangements or look for Chinese dissidents in the crowd. It was recently revealed that Beijing has a number of secret ‘police stations’ operating in Britain, targeting opponents of the CCP regime living in exile.The way things are going, the Chinese will soon have more police stations over here than we do.Civil servants want to set up BDSM (Bondage, Domination, Sadism and Masochism) support groups in Whitehall. Presumably the bondage enthusiasts are desperate to be tied up with red tape.",
        "The switch to a four-day week gathers pace. Some firms, including L’Oreal, online fashion retailer Asos and Nike are letting staff finish work at midday as part of a ‘Summer Friday’ scheme.Nothing new here. Knocking off at lunchtime and heading for the pub on Friday used to be par for the course in Fleet Street. Friday was known as ‘POETS day’ — Push Off Early Tomorrow’s Saturday. Or words to that effect.",
        "Thanks to those readers who responded to my item about the Government treating the under-25s like children, banning them from laying online bets over £2 and driving cars with young passengers. They all pointed out that when Wing Commander Guy Gibson VC, DSO &amp; Bar, DFC &amp; Bar led the Dambusters Raid he was only 24. In today’s Nanny State Britain, Gibson would probably be considered too immature to pilot a Lancaster with a 20-something rear gunner or put two shillings on a game of cribbage in the officers’ mess. "
    ]
}