{
    "articleURL": "/debate/article-12048499/ROBERT-HARDMAN-best-advert-global-Britain-weve-seen.html",
    "content": [
        "Quite apart from Saturday's spectacular, we could see history made tomorrow. For Buckingham Palace will stage what could be the most high-powered party ever assembled in Britain when the VVIP guests invited to Saturday's Coronation arrive for Friday evening's reception being given by the King and Queen Consort at Buckingham Palace.",
        "Neither the 2012 Olympics, nor the massive climate change conference COP26 pulled in a hundred heads of state and representatives of 200 governments. Nor, for that matter, did last September's state funeral of Elizabeth II, though it came very close (aside from the short notice, it also clashed with the United Nations General Assembly). It means Britain is in a rare and fortuitous position, according to the minister in charge of much of it.'The whole country is taking part in the biggest advert for global Britain we've ever seen,' says Lucy Frazer, secretary of state for Culture, Media and Sport, as we walk the processional route, picking out some of the new installations along the way, not least the loos.Huge temporary toilet blocks have sprung up in giant square formations across the Royal Parks. 'We've got 1,099 Portaloos,' she says proudly, pointing at one jumbo site which resembles a plastic stockade as we stroll up the Mall. It's not pretty but I dare say it will have few detractors tomorrow.The Government is paying more attention towards anything which might spoil their 'advert', not least planned demonstrations by an anti-royal group which has pledged a vocal protest with megaphones and speakers in Trafalgar Square.",
        "'These are operational decisions for the police but I know they're taking it very seriously because there are meetings every day,' says Ms Frazer, a lawyer. She took on the Coronation brief in the February Cabinet reshuffle, when she moved from Housing to Culture.",
        "'The police have said they will have a very low threshold for action,' she adds, pointing to new legislation rushed through last week to crank up penalties for disruptive protesters, such as those who attach themselves to public infrastructure.'They have to respect the fact that other people want to enjoy the event.'Any use of megaphones along the Mall is illegal under laws governing the Royal Parks. On other parts of the route, written permission is required from the Mayor of London or Westminster City Council. Both authorities tell me that this has neither been sought nor granted. So amplified noise will be an instant breach of the law. Over to the police.The total of 11,500 officers on duty is 1,500 more than the record number who covered the state funeral. The police will easily outnumber the 7,000-strong military presence, though that itself is the biggest for a royal event since 1953. As Ms Frazer walks the course, she meets Major General Chris Ghika, the officer in charge of the entire procession, coming the other way on his horse, Atticus. They swap notes.The minister hopes people will see this as a moment in history and remember it for the pageantry, the symbolism and the spectacle. Every night until Sunday, Big Ben will be illuminated with a new multi-coloured decor depicting the floral emblems of all four home nations.",
        "The same pattern, created by former Apple design guru Sir Jony Ive, has been used to dress Admiralty Arch and the National Gallery. Across the country, 57 giant screens have gone up to broadcast the celebrations to the rest of the UK.While the grumblers moan that none of this is a patch on the 'wow factor' of 1953 – and it is true that we are unlikely to wake up to anything on a par with the conquest of Mount Everest tomorrow morning – it is a much bigger deal diplomatically, says Ms Frazer.'You have to remember the value that it brings. You can't put a cost on bringing together 200 nations in the UK,' she argues. That certainly did not happen in 1953 because the rules were different.",
        "Prior to this Coronation, invitations were never sent to heads of state because they would automatically outrank the new monarch. Since precedence, particularly among monarchs, was based on length of office, the newcomer would be at the bottom of the pile.Such things mattered in 1953. Not so in 2023. The King has ditched the rule. As a result, the heads of state are pouring in – with tangible benefits. 'On this occasion, there is an opportunity for bilateral discussions with everyone, whereas we couldn't do that during the Queen's funeral,' explains the minister.",
        "One big name who will not be attending tomorrow is US President Joe Biden, not least because he has already made two visits to the UK inside six months. He will be represented by First Lady Dr Jill Biden.However, since everyone has been given several months' notice, the overall royal, presidential and prime ministerial headcount is expected to hit a new high.It is therefore just as well that there is no dinner at Buckingham Palace tomorrow (the King and Queen will dine quietly at Clarence House). Drawing up the seating plan would have been impossible."
    ]
}