{
    "articleURL": "/tvshowbiz/article-12040883/Jameela-Jamil-slams-Met-Galas-Karl-Lagerfeld-theme.html",
    "content": [
        "Feminist stars who attended the event included Florence Pugh, Emily Ratjkowski, Michaela Coel and Janelle MonaeREAD MORE: The Met Gala's heavenly bodies! Stars stun on the red carpet for fashion's biggest night to honour the late Karl LagerfeldJameela Jamil has blasted the Met Gala's Karl Lagerfeld theme, claiming the event has double standards in honouring a 'known bigot'.",
        "The Good Place actress, 37, slammed the 'selective cancel culture' shown by organisers and attendees of the annual Metropolitan Museum of Art's Costume Institute benefit, which took place on Monday.This year the Met Gala honoured the late Chanel designer, who died in 2019, with the theme Karl Lagerfeld: A Line of Beauty.The event saw a slew of huge names in attendance, including many stars lauded for their outspoken feminist views, including Florence Pugh, Emily Ratjkowski, Michaela Coel and Janelle Monae. Jameela blasted the fact people had opted to 'gleefully ignore' some of the late designer's 'cruel' opinions while still calling for the cancellation of others whose views they don't agree with.",
        "Taking to Instagram, Jameela wrote: 'Last night Hollywood and fashion said the quiet part out loud when a lot of famous feminists chose to celebrate at the highest level, a man who was so publicly cruel to women, to fat people, to immigrants, and to sexual assault survivors.'And all the women's publications, and spectators online, chose to gleefully ignore it.'Nobody has perfect morals, least of all me, but Jesus Christ we had a year to course correct here, and not award the highest honour possible to a known bigot…and everyone just decided all of a sudden we can separate the art from the artist when *convenient*.",
        "'And it's one rule for us and another rule for everybody else. Last night we relinquished our right to be taken at all seriously about anything important.'Jameela used the caption of her post to highlight 'slippery tactics and double standards' and warned people should reflect on her points ahead of the next presidential election.She wrote: 'This isn't about cancel culture. It's not even about Karl. It's about showing how selective cancel culture is within liberal politics, in the most blatant way so far.'It's about showing why people don't trust liberals. Because of slippery tactics and double standards like this.'And it's not just Hollywood here, the general public online participated and were entirely complicit in the erasure of the truth last night. 'They replaced their pitchforks with spoons last night, to lap that s**t right up… If we carry on like this, don't be shocked when we lose the next election.'",
        "This isn't the first time Jameela has slammed the decision to honour Karl, who died in February 2019, at the Met Gala.After the theme was announced, she shared a series of screenshots highlighting the designer's controversial previous comments.She captioned her post: 'Why is THIS who we celebrate when there are so many AMAZING designers out there who aren't bigoted white men? What happened to everyone's principles and ''advocacy.'' ",
        "'You don't get to stand for justice in these areas, and then attend the celebration of someone who reveled in his own public disdain for marginalized people.'Sorry, but no. This isn't the 90s. We didn't fight all this s*** just to throw it all away because some white guy made some pretty clothes for people's skinny faves… come on now.'Florence has previously been lauded for saying she's 'not complying' with Hollywood's body standards as she condemned the 'shocking' expectations placed on young women in the industry. Speaking on Vogue's YouTube Channel, she said: 'Body image for women is a major thing. From the moment you start growing thighs and bums and boobs and all of it, everything starts changing. And your relationship with food starts changing. 'I had a weird chapter at the beginning of my career, but that was because I wasn't complying. I think that was confusing to people, especially in Hollywood.'Florenece continued: 'Women in Hollywood, especially young women in Hollywood, are obviously putting themselves in all these ways in order to get whatever opportunity that they need to get because that's just the way that it's been.'When I went and I did that project it was expected that you would be on whatever diet you needed to be on and for me that was shocking because I'd never done that before.'",
        "Michaela has also been universally praised for her hard-hitting series I May Destroy You, which focuses on a young woman struggling with rebuild her life after being raped.Emily has also been outspoken on her feminist views, and two years ago, in a series of essays the model put a whole new perspective on that Blurred Lines performance when she accused Robin Thicke of groping her naked breasts during filming.She said it was only something she had allowed herself to acknowledge 'half a decade later'. Having said nothing on set, she described her own feeling of powerlessness. 'I was nothing more than the hired mannequin,' she wrote.After posing for the Love Magazine Advent calendar, Emily said in the accompanying text: 'To me, female sexuality and sexiness, no matter how conditioned it may be by a patriarchal ideal, can be incredibly empowering for a woman if she feels it is empowering to her.'The way I dress, act, flirt, dance, have sex — those are my decisions and they shouldn't be impacted by men. Being sexy is fun and I like it. I should never have to apologise for that.'This year's Met Gala saw stars including Kim Kardashian, Rihanna, Gisele Bundchen and Emily Ratajkowski honor Karl in their statement gowns as they brought their A-game for fashion's biggest night.",
        "And one unexpected character who stole the show during the red carpet was a stray cockroach, who decided to embrace their moment in the spotlight.Following the red carpet, stars donned even racier looks as they headed into NYC for the afterparties, with Kendall Jenner, Rita Ora and Emily slipping into even skimpier looks for the bashes. The event takes place on the first Monday in May each year, with stars splashing out $50,000 to attend, if they are invited.The Met Gala had Penelope Cruz, Michaela Coel, Roger Federer and Dua Lipa as the co-chairs, along with Anna Wintour. Vogue magazine announced the news in January via their social media and website, writing on Instagram: 'This year, the #MetGala - which benefits the @metmuseum 's @metcostumeinstitute - falls on May 1 and will honor one of fashion's greatest talents: Karl Lagerfeld.'The outlet added that the 2023 theme will be 'in honor of Karl,' who died February 19, 2019 at the age of 85 following complications of pancreatic cancer.The fashion designer served as the creative designer for Chanel, Fendi as well as his own label.Over the years, Karl has sparked controversy over a number of pointed comments aimed at celebrities and well-known figures over the years.Karl blamed Kim Kardashian for her 2016 robbery at gunpoint in Paris, claiming she brought the terrifying ordeal upon herself by flaunting her wealth.",
        "The late fashion designer also called Adele 'too fat' in an interview: 'The thing at the moment is Adele. She is a little too fat but she has a beautiful face and a divine voice.'He later said his quotes were taken out of context and apologized; however in his apology it appeared he was shading Lana del Rey, per The Hollywood Reporter.",
        "He also said he believed Lana to be full of 'implants;' he described singer M.I.A. as someone who displays 'not the best behavior.'He said the comment about M.I.A. after she gave cameras the middle finger when appearing at the Super Bowl halftime show with Madonna in 2012, per Page Six.'Nowadays people give the middle finger quite quickly - it's not the best behavior, Everybody does that, what's new about that? It's just become a bad habit. Women in magazines are 50% bimbo and 50% pregnant women.'Karl said on Heidi Klum: 'I don't know Heidi Klum. She was never known in France. Claudia Schiffer also doesn't know who she is.'He also spoke of Heidi's ex-husband Seal: 'I am no dermatologist but I wouldn't want his skin. Mine looks better than his. His is covered in craters.'He commented on what he called 'short, unattractive people': Life is not a beauty contest, some [ugly people] are great. What I hate is nasty, ugly people... the worst is ugly, short men. Women can be short, but for men it is impossible. It is something that they will not forgive in life... they are mean and they want to kill you.'Karl also slammed the #MeToo movement, revealing he was 'fed up' with models and actresses speaking up about the sexual harassment they face over the years.He also spoke out about his dislike for Pippa Middleton, saying: 'Kate had a nice silhouette and she is the right girl for that boy. I like that kind of woman, I like romantic beauties. On the other hand, her sister struggles. I don't like the sister's face. She should only show her back.'In his book The World According To Karl, he criticized people who wore sweat pants: 'Sweatpants are a sign of defeat. You lost control of your life so you bought some sweatpants.'"
    ]
}