{
    "articleURL": "/wires/reuters/article-12050569/US-STOCKS-Futures-climb-Apple-earnings-cheer-key-jobs-report-tap.html",
    "content": [
        "Futures up: Dow 0.30%, S&amp;amp;P 0.47%, Nasdaq 0.57%",
        "May 5 (Reuters) - U.S. stock index futures rose on Friday as upbeat results from Apple underscored corporate earnings resilience despite a slowing U.S. economy, while investors awaited a key monthly employment report due later in the day.Apple Inc gained 2.2% in premarket trading on better-than-expected results, helped by strong iPhone sales and notable inroads in India and other newer markets.The company's executives also noted that gross profit margins for the current quarter would be better than forecast on improving supply-chain issues.With a handful of major technology and growth companies reporting better-than-expected earnings, analysts expect profits for S&amp;amp;P 500 companies in the first quarter to decline 0.9% from a year earlier, according to Refinitiv data, compared with a 5.1% drop expected at the start of April.\"Thanks to their (Apple and Microsoft) sizeable balance sheets, and falling yields, big tech companies remain a refuge for equity investors, which certainly explains why the S&amp;amp;P 500 has been relatively resilient to the bank turmoil,\" Ipek Ozkardeskaya, senior analyst at Swissquote Bank, said.\"What's risky is that if winds change direction for Big Tech, we could rapidly see gains in S&amp;amp;P 500 crumble.\"The S&amp;amp;P 500 has gained nearly 6% so far this year, while the S&amp;amp;P 500 Banks index and KBW Regional Banking index have lost 17% and 31%, respectively.",
        "Wall Street fell on Thursday after PacWest Bancorp's move to explore strategic options deepened concerns about the health of regional banks, pulling down shares of peers and big banks such as JPMorgan Chase and Wells Fargo &amp;amp; Co.Wall Street executives and bank analysts called for regulators to quickly provide more protection for bank deposits and consider other backstops, arguing only an intervention could stop the crisis.PacWest rebounded on Friday with an 11.7% gain, while Western Alliance Bancorp bounced back 10.4%. Western Alliance on Thursday denied a report that it was exploring a potential sale.U.S. interest rate futures are factoring in a 50% chance of the Federal Reserve cutting rates by its July meeting, according to CME Group's FedWatch Tool.On Wednesday, the Fed raised its benchmark interest rate by 25 basis points, with Chair Jerome Powell noting it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Investors will keep a close watch on the non-farm payrolls report for April for more clues on the state of the labor market.At 5:34 a.m. ET, Dow e-minis were up 101 points, or 0.30%, S&amp;amp;P 500 e-minis were up 19 points, or 0.47%, and Nasdaq 100 e-minis were up 74 points, or 0.57%.",
        "Used-car retailer Carvana Co jumped 33.6% as it expects to post a profit in the current quarter and plans to further bring down excess used-car inventory.DoorDash Inc rose 3.7% as the food delivery company raised its annual core profit forecast after beating quarterly revenue expectations.(Reporting by Ankika Biswas in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}