{
    "articleURL": "/wires/reuters/article-12053329/Cubs-eye-winning-streak-encore-Marlins.html",
    "content": [
        "After being swept at Miami last weekend, the Chicago Cubs are off to a good start in the return series against the Marlins.",
        "Having taken the opener 4-1 on Friday, the Cubs are looking to win consecutive games for the first time in more than two weeks on Saturday afternoon. The Marlins are hoping to avoid a fifth straight defeat.Chicago dropped three one-run contests in Miami, then lost three of four to the Nationals in Washington to conclude a 1-6 road trip.On Friday, however, Cubs left-hander Justin Steele threw seven solid innings and Ian Happ clubbed a two-run homer.\"The energy in the clubhouse was so much better (Friday), being back home,\" Cubs manager David Ross said.Back to .500 with just their fourth win in 13 games, Chicago will try for their first winning streak since a four-game run from April 16-19.\"I think we're (at) home with maybe a sense of urgency, like, `Let's step on it a little bit, get back on track,'\" Cubs pitcher Jameson Taillon said.Drew Smyly (3-1, 2.83 ERA) is slated to take the mound for the Cubs on Saturday. The left-hander yielded just a second-inning homer and five other hits without a walk while lasting seven innings in Monday's 5-1 victory at Washington.It was Smyly's fifth straight start allowing two or fewer earned runs, and he is 4-1 with a 2.37 ERA in six appearances (including five starts) against the Marlins. However, Miami's Jean Segura, Jon Berti (8-for-17 with three walks and four runs in his last five games) and Bryan De La Cruz are a combined 7-for-11 against Smyly.",
        "The left-hander has never faced the Marlins' Luis Arraez, the majors' leading hitter with a .437 average after recording three hits on Friday. Arraez is 8-for-13 this season against the Cubs.\"The way he's going about it, you just know he's going to put the ball in play, or he's going to hit it hard somewhere,\" Marlins manager Skip Schumaker said.\"Righty or lefty, it doesn't matter. You want him up as many times as you can in the game.\"Even with Arraez's remarkable start, Miami has been outscored 30-10 while losing four in a row since taking all three from Chicago.Schumaker is scheduled to hand the ball to right-hander Bryan Hoeing (0-1, 6.23 ERA), who allowed two runs on five hits and a walk with four strikeouts in five innings of Sunday's 4-3 win over the Cubs.\"I think as a starter, the goal is to go as far as you can to give the bullpen a bit of a break,\" Hoeing said.Dansby Swanson went 2-for-3 against him last weekend, but Swanson is 1-for-12 in the last three contests. Meanwhile, Happ went hitless in three at-bats versus Hoeing but is batting .357 (5-for-14) with two home runs and three RBIs in five games this month.Hoeing could also get his first look at highly touted Cubs first-base prospect Matt Mervis, who went 1-for-4 with an RBI single in his major league debut on Friday.",
        "--Field Level Media"
    ]
}