{
    "articleURL": "/tvshowbiz/article-12055261/Graziano-Di-Prima-support-Kym-Marsh-split-husband.html",
    "content": [
        "Graziano Di Prima has reportedly vowed to be there in support of his friend Kym Marsh following her rumoured split from her husband Scott Ratcliff.",
        "Professional dancer Graziano, 28, was paired up with Kym, 46, on Strictly Come Dancing last year, with the pair remaining good friends.Twinkle-toed star Graziano is said to see actress and singer Kym as his 'big sister' and it is claimed 'he'll support her through anything'. A source told The Sun: 'Kym and Graziano have had an unbreakable bond since leaving Strictly.'They are like peas in a pod and get on so well, Graziano sees Kym as a big sister and one of his best friends.",
        "'They've got the same sense of humour and enjoy each other's company whether that's having a natter on the phone or having a night out.'Graziano's currently in the UK and he's said he'll support Kym through anything, he thinks she's an incredible woman, inside and out.'MailOnline has contacted Graziano and a representative for Kym for comment.It comes after Kym broke her social media silence on Saturday following her reported split from her third husband Scott Ratcliff.The former Hear'Say star put any marriage troubles behind her this weekend as she prepared to take to the stage for the opening night of her new show Greatest Days.Taking to Instagram, she shared a picture of herself with the cast of the show before their opening night in Churchill Theatre in Bromley. ",
        "The production tells the story of five pals who dream of rising to fame as boyband stars, and will feature 15 of Take That's hits.Kym shared the picture of herself and her daughter Emilie, 26, who is also appearing in the show, on Instagram.",
        "She wrote: 'Posted this photo before but….. I just want to take this opportunity to say how proud I am of this cast and crew! 'This whole experience has been incredible and I truly feel so privileged to be part of it!!! We open tonight in Bromley! Let's go SMASH it gang!!! This show is one I will 'NEVER FORGET' @greatest_days @takethat.'Kym and Emilie play the parts of Rachel and Young Rachel respectively in the musical inspired by boyband Take That.It comes after it was reported Kym split from her third husband Scott after they married at a lavish ceremony in October 2021. After 19 months as husband and wife, they are said to have broken up following a trial separation, due to work keeping them apart.A source told The Sun: 'They both really tried to make it work, but the cracks have been there for a while and they were only getting to see each other for one or two days a week at the very most.",
        "'Kym's been so busy, and last year (being on Strictly Come Dancing) meant even her weekends were stacked up along with weekdays rehearsing.'More recently she's been filming all over the place and rehearsing for a new theatre run.'Adding about how Army Major Scott's work drove a wedge between him and Kym, the insider said: 'Scott is based in barracks down south – he's got a very busy career as well.'Kym's still a working mum, too, and lives up in Cheshire with her family. 'In the end it was the fact they lived so far away from each other that just made it impossible.'The source said the pair 'had a trial separation earlier this year' and were 'hoping to get things back on track', but added they have decided 'it's best to go their separate ways'.They added: 'It's very sad for all involved, but they've decided it's time to tell their family and friends and focus on the future – which means filing for divorce. They're hoping to keep things as amicable as possible.",
        "'Hopefully time will help to heal things.'Kym's first husband was former EastEnders actor Jack Ryder, 41, who she married in 2002 but divorced seven years later.In 2012 she married Hollyoaks star Jamie Lomas, 48, but they divorced in 2014, and she met Scott in 2018.",
        "Kym has children David, 28, and Emilie from an earlier relationship as well as daughter Polly, 12, with Jamie, with whom she also had son Archie in 2009, who died moments after he was born."
    ]
}