{
    "articleURL": "/sport/racing/article-12054693/Super-Bowl-winner-Patrick-Mahomes-call-Riders-Kentucky-Derby.html",
    "content": [
        "The NFL star is taking over from rapper and Louisville native Jack HarlowHe attended the the Barnstable Brown Gala on Friday night with wife Brittany DailyMail.com provides all the latest international sports newsSuper Bowl winner Patrick Mahomes will have the honor of kickstarting the 149th Kentucky Derby Saturday. ",
        "The Kansas City Chiefs will have the chance to test his calling ability when he gives the famous 'riders up' command. From the moment the two-time Super Bowl MVP gives the introduction, they'll be off to the races for the 'Most Exciting Two Minutes In Sports.'The NFL star is taking over from rapper and Louisville native Jack Harlow, who made the call in 2022, according to The New York Post. Mahomes was pictured with Harlow at the Barnstable Brown Gala on Friday night, perhaps getting some tips. ",
        "The signal caller also posed on the red carpet with wife Brittany, wearing a grey plaid blazer with an all-black ensemble underneath in black pants, shirt and tie, wrapping up the look with a pair of sunglasses. Starting in 2012, Kentucky Derby officials made the decision to let a celebrity make the legendary call. And, Mahomes follows a long list of athletes to have had the honor of making the call. Denver Broncos coach Sean Payton and former University of Louisville standout Teddy Bridgewater have delivered the 'Riders Up' command in the past.Meanwhile, NBA Hall of Famer Julius Erving, former Louisville football coach Charlie Strong and Kentucky basketball coach John Calipari have also had the honor. 'Riders Up' is a command in which jockeys mount their horses prior to the Triple Crown race getting underway, according to the Kentucky Derby's official website. ",
        "The call kickstarts the action with a $3million purse waiting at the finish line for the winner. ",
        "However, race favorite Forte was scratched from the race Saturday morning. Forte, who stumbled during training on Thursday, was seen in video this morning from ACCN reporter Will Clark having his leg looked at by a state racing commission vet.Separately, four horses died in the leadup to the race, with the track calling the deaths 'unusual and unacceptable.'Forte was listed as a 4-1 favorite before he was scratched. "
    ]
}