{
    "articleURL": "/wires/reuters/article-12047753/US-jury-sides-Ed-Sheeran-Lets-Get-It-On-copyright-trial.html",
    "content": [
        "By Blake Brittain",
        "May 4 (Reuters) - British pop superstar Ed Sheeran's 2014 hit \"Thinking Out Loud\" did not unlawfully copy from Marvin Gaye's classic 1973 song \"Let's Get It On,\" a jury in Manhattan federal court decided on Thursday in a closely watched copyright lawsuit.The jury determined that heirs of \"Let's Get It On\" songwriter Ed Townsend had not proven that Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing had infringed their copyright interest in the Gaye song.Townsend's heirs sued Sheeran for copyright infringement in 2017, contending that \"Thinking Out Loud\" copied the \"heart\" of Gaye's song including its melody, harmony and rhythm. Sheeran's attorneys argued that any similarities between the songs involve basic musical \"building blocks\" that cannot be copyrighted.Testifying during the trial, Sheeran denied the copyright infringement claims, telling the jury, \"I find it really insulting to devote my whole life to being a performer and a songwriter and have someone diminish it.\"Sheeran on the witness stand played the chord progression to \"Thinking Out Loud\" and sang the opening words: \"When your legs don't work like they used to.\" Sheeran testified that his friend and collaborator Amy Wadge first started strumming the chords for the song during a visit to his home in England, and that they collaborated on the lyrics.",
        "Ben Crump, a lawyer representing the heirs, told jurors that Sheeran effectively confessed to ripping off Gaye's song when he performed it live in concert as a medley with \"Thinking Out Loud.\"Sheeran testified that singers frequently perform such \"mash ups,\" and that he had on other occasions combined his song with Van Morrison's \"Crazy Love\" and Dolly Parton's \"I Will Always Love You.\"Gaye, who died in 1984, collaborated with Townsend, who died in 2003, to write \"Let's Get It On,\" which topped the Billboard charts. Sheeran's \"Thinking Out Loud\" peaked at No. 2 on the Billboard Hot 100 in 2015.The plaintiffs asked for a share of the profits from \"Thinking Out Loud.\" The heirs said in a court filing that they received 22% of the writer's share of Gaye's song from Townsend.Two similar lawsuits are pending against Sheeran in Manhattan, brought by investment banker and \"Bowie Bonds\" creator David Pullman's Structured Asset Sales LLC, which also owns copyright interests in the Gaye song.Sheeran won a trial in London last year in a separate copyright case over his hit \"Shape of You.\" Gaye's heirs won an important verdict in 2015 when a jury in Los Angeles agreed with the claims that the Robin Thicke and Pharrell Williams song \"Blurred Lines\" copied Gaye's \"Got to Give It Up.\"",
        "(Reporting by Blake Brittain in Washington Editing by Will Dunham and David Bario)"
    ]
}