{
    "articleURL": "/femail/article-12052257/Husband-humiliates-wife-sons-birthday-party.html",
    "content": [
        "An unnamed husband is being slammed online after he 'humiliated' his wife The anonymous mom shared a vidoe from their son's first birthday partyIn the clip, the father smashes the cake into his spouse's faceA husband is being furiously slammed online after his wife shared a video of his 'humiliating' behavior that left her in tears at their son's first birthday. ",
        "A mom who goes by @candie1983 went viral on TikTok after sharing a clip of her husband ruining the joyful memory of their child's very first birthday party. The viral video, which has amassed over 3.1 million views, shows the unnamed husband and wife around their son as family and friends record what they thought was going to be a touching moment. However, it ended up being a nightmare that left the mom wanting to 'choke' her husband for the 'red flag' that saw him smashing their son's birthday cake onto his wife's face, causing her to miss the moment they cut the dessert and the photos because she was attempting to get the sweet treat off of her. ",
        "The anonymous mom captioned the clip: 'The time I wanted to choke my husband for putting out son smash cake in my face, surrounded by family I had just met for the first time. 'I had long look forward to our son first party and the family pictures… we didn't get but one photo before I had to shower. Not sure why he thought this was a good idea… I cried like a baby at the memories lost, cake was even cut while I showered. 'If he does this ever again, he wont live to talk about it,' she revealed. ",
        "After experiencing a difficult and high-risk pregnancy, the mom and content creator was ecstatic for her baby's first birthday, and she couldn't wait to document the moment with tons of family photos. The clip began as a sweet moment shared between family and friends that showed the parents singing to their baby boy. And while the son didn't seem too interested, the father certainly was. Towards the end of the video, the husband picks up the cake and smashes it onto his wife's face, who had her tongue sticking out because she thought he was giving her a bite. The video then ends by showing the mom covered in cake. ",
        "Viewers were horrified at what they just saw, slamming the husband for his 'narcissistic' behavior, with some even pushing for the woman to 'divorce' him. 'That man wanted the attention on him,' commented one person. One person said: 'I will never understand people who find humor in publicly humiliating their spouses.''I get weird vibes from him. Your feelings are 100% valid, I’m sorry,' one user commented.Someone else said: 'I just feel like this is so hurtful. Like why would he do that? It all was so cute before that and then totally ruined.' Another person added: 'Would've been ex husband from there on out… can’t imagine how he is as a dad and partner.' ",
        "One person wrote: 'Divorce immediately.'",
        "And while many people called for her to divorce him, others said they didn't see the harm in his actions, noting that it was just plain fun. One user commented: 'It's not the end of the world. There were people telling him to do it and the whole comment section is so mad, bringing him down left and right.' 'Why is everyone pressed it’s just cake chill out lol,' said someone else.Another user wrote: 'Omg these comments are not it! He was having fun.' Someone else said: 'Am I the only one who thought it was fun and games? 'In a follow-up video, the mom said the situation occurred a year ago and it is now water under the bridge, adding that he is a great dad and partner.  "
    ]
}