{
    "articleURL": "/news/article-12045443/Bobby-Davros-fianc-e-England-defender-Billy-Wrights-daughter-Vicky-Wright-dies.html",
    "content": [
        " Vicky Wright's cancer diagnosis was only publicly revealed last weekBobby Davro's fiancé and England defender Billy Wright's daughter, Vicky Wright, has died after short cancer battle.",
        "Vicky, 63, was diagnosed with pancreatic cancer last year - the same form of cancer her father died from.Her daughter Kelly posted a message on Twitter to reveal the sad news, writing: 'Hello everyone... Some incredibly devastating news to share.'My wonderful mum Vicky has sadly passed away this morning, I wanted to use this platform to let you all know, as I know how much she valued all your love and support in so many ways.'Bobby only publicly revealed his fiancé's cancer diagnosis in an interview last week. ",
        "Tributes have poured in online for Vicky, who was only diagnosed with pancreatic cancer last year.Newsreader Nick Owen tweeted: 'Oh no. Shattering news. I had known Vicky for more than 40 years and loved her company. 'Her dad Billy gave me my first job in television. I feel terribly sad tonight. Thoughts with all the family x.' Radio broadcaster Russell Kane shared his condolence message: 'RIP Vicky Wright. Funny, charming, glamorous, down to earth. My deepest condolences to her fiancee @BobbyDavro1 and to her family. F*** cancer.'",
        "Les Dennis said: 'So very sad to hear this. Vicky was a lovely woman and a talented performer. Thoughts with you and family and friends.'Former Arsenal midfielder Ray Parlour wrote: 'So sorry for your loss. Sending [heart emoji] to you and your family.' ",
        "Speaking last week, Bobby said he was trying to 'smile through the absolute agony' of his long-term partner 'devastating' illness but admitted things haven't been easy.He told the Daily Star : 'To see someone as beautiful as her with this ­illness is horrific. It's so sad. It's extremely, ­extremely, ­extremely painful...'My best advice for someone in a similar position is that laughter is the best medicine.",
        "'I always remember this quote, 'Don't let the world change your smile – get your smile to change the world'.'Bobby proposed to Vicky last year after 12 years of dating on and off.Vicky's father Billy Wright, who spent his entire footballing career with Wolverhampton Wanderers, died from the same form of cancer in 1994.Vicky had performed as a singer and actress, following in the footsteps of her mother Joy Beverley, one third of the Beverley Sisters.She also took the stage to perform a one-woman show about her father called the 'Billy Wright Story'."
    ]
}