{
    "articleURL": "/tvshowbiz/article-12056751/Jamie-Oliver-reveals-welcomed-TWO-Ukrainian-families-home-amid-Russian-invasion.html",
    "content": [
        "Jamie Oliver has revealed he welcomed two Ukrainian family into his home last year, in the wake of the country's war with Russia.",
        "The TV chef, 47, announced his act of kindness while appearing as a guest judge on MasterChef Australia's fifteenth series.He had been presented with a Russian and Ukrainian dish, borscht and pampushka, by contestant Larissa Sewell, when he told of his living arrangement.Jamie, who already has a full house with children Poppy, 21, Daisy, 20, Petal, 14, Buddy, 12, and River, six, married his wife Jules, 48, in 2000.He said: 'With things going on in the world at the moment, it's kind of profound you're here this year with both a Russian and Ukrainian dish.",
        "'Can I give you a little secret that no one really knows? I have had two Ukrainian families living with me for the like the last seven months.'We have done fundraisers with top chefs from Ukraine, so I have had my fair share of borscht. This is absolutely fabulous.'Borscht is a sour soup common in the country made with red beetroots as one of the main ingredients.On 24 February 2022, Russia invaded it's neighbour Ukraine and occupied parts of the country resulting in tens of thousands of deaths.As civilians fled the country it instigated Europe's largest refugee crisis since World War II. It comes after the chef praised Aussie TV for its 'amazing' tribute to MasterChef Australia judge Jock Zonfrillo following his death at age 46. ",
        "Jame, who was a close friend of Zonfrillo's, took to social media to express his gratitude to the show's producers and presenters.'A sincere thank you to Channel 10 and the wonderful team at The Project for making this amazing tribute show for Jock and his family tonight and turning the show around so fast. I know many of you knew him personally and this must have been so hard to do but the right thing to do. Bless you all Jamie oxxx,' he wrote.",
        "The hour-long tribute to Zonfrillo featured interviews with his friends and colleagues, as well as footage of him cooking and mentoring contestants.The Scottish-Australian chef was found dead by police at a hotel on Lygon Street in Carlton, Melbourne, at about 2am on Monday, May 1.Zonfrillo, who joined MasterChef Australia as a judge in 2019, quickly became a favourite with fans due to his warm demeanor, culinary expertise, and mentorship to contestants.His passion for Indigenous Australian ingredients and his philanthropic efforts in the culinary world were well-known and admired.Police found Zonfrillo's body after they were called to a hotel in Carlton, Melbourne for a welfare check."
    ]
}