{
    "articleURL": "/wires/ap/article-12039365/Argentinas-Fernandez-seeks-dollar-relief-Brazils-Lula.html",
    "content": [
        "BRASILIA, Brazil (AP) - Argentine President Alberto Fernández and his Brazilian counterpart, Luiz Inácio Lula da Silva, vowed Tuesday to keep working to come up with a mechanism that would allow them to avoid using the U.S. dollar in trade between the neighboring nations.",
        "Argentina´s economy is looking particularly fragile after a run on the peso in the financial markets caused a sharp devaluation of the local currency late last month as well as a drain of U.S. dollars from central bank reserves in part due to a devastating drought that has slashed exports.There was lots of anticipation Tuesday that the two countries would unveil a mechanism allowing Argentine firms to continue trading with Brazil without draining precious dollars from the country's reserves. Yet after a nearly four-hour meeting the two presidents made clear they were still fine tuning the details.\"The meeting was long, difficult and we will carry out many more meetings,\" Lula said alongside Fernández as the two left-leaning presidents spoke to the press. \"I made a commitment to my friend Alberto Fernández that I will do every and any sacrifice so we can help Argentina in this difficult moment.\"The proposed plan involves a line of credit to finance Brazilian companies that export to Argentina with the intention of avoiding use of the dollar, said the finance ministry´s executive secretary, Gabriel Galípolo.On Tuesday morning, Finance Minster Fernando Haddad told reporters the two governments are studying possible guarantees in order for Brazil's government to provide such financing.",
        "\"They've made the decision to help make sure that Brazilian companies continue exporting to Argentina and they had asked us to do some homework, which we have already done, and have to do with the necessary guarantees,\" Fernández said, adding that Economy Ministry officials will be meeting with their Brazilian counterparts next week to fine tune the details.",
        "\"Now what we have to do is find these points of agreement ... to get those credits operating that guarantee the production of Brazilian companies that export to Argentina,\" the Argentine president said.Brazil is Argentina´s largest trade partner and the deal could afford Argentina some breathing room at a time when it is suffering from a shortage of dollars.Argentina struck a deal with China that allows its companies to pay for Chinese imports with yuan. Lula, for his part, hailed an agreement between Brazil and China to use the yuan in their bilateral commerce while in Shanghai last month, while also taking swipes at the dominance of the dollar in international trade and at the International Monetary Fund.\"We aren't having a discussion to help Argentina,\" Lula said. \"We need to help Brazilians who export to Argentina and finance Brazilian exports, just like China does with Chinese products.\"Lula also said he was in talks with China to change the regulation of BRICS - the group of countries made up of Brazil, Russia, India, China and South Africa - to assist countries who are not part of the group, including Argentina.Argentina´s Economy Minister Sergio Massa has said his country is renegotiating aspects of its agreement signed with the IMF in 2022 to restructure some $44 billion in debt taken on by the center-right government of Fernández´s predecessor, Mauricio Macri.",
        "\"We're renegotiating the program we committed to with the IMF ... because the conditions have indeed changed,\" Fernández said, referring to Russia's invasion of Ukraine and the drought. Lula said Brazil would also negotiate with the IMF on behalf of ArgentinaFernández´s visit to Brazil comes weeks after he announced he will not seek reelection in the election this October. He was joined in Brasilia by Massa and Argentina´s ambassador to Brazil, Daniel Scioli, both of whom are considered possible contenders for the presidency.___Politi reported from Buenos Aires."
    ]
}