{
    "articleURL": "/sport/mma/article-12040809/Conor-McGregor-claims-make-easy-adjustments-BEAT-Floyd-Mayweather-rematch.html",
    "content": [
        "Conor McGregor suffered a TKO defeat by Floyd Mayweather back in 2017 Irishman is convinced he could beat legendary boxer if they ever re-matched He tweeted that anyone who thinks he wouldn't 'finish the job' is 'silly' Conor McGregor claims a few easy adjustments would see him 'finish the job' and beat Floyd Mayweather if they are ever to rematch in the boxing ring. ",
        "Mayweather stopped the UFC superstar back in 2017 in what was one of the most lucrative bouts in history between two of the leading names in combat sport. McGregor remains convinced he has the tools to beat Mayweather in the legendary American's own discipline. One Twitter user posted a clip of some of his success in the fight, including a 'body shot' that was deemed to be a low blow by the referee. McGregor responded to it, writing: 'Round 9. I was playing ping pong with this guys head in there at many times in this fight. ",
        "'If you don't think there is some real nice adjustments that can be made and implemented in a second fight, to get the job finished, you're silly.'Mayweather banked more than £170million from the fight, while McGregor is thought to have earned around £100m.On a global level, following a huge promotional tour with numerous face-offs at different stadiums, it sold around five million pay-per-view buys.It was by far McGregor's biggest payday but he has not ventured back into professional boxing since and remains under contract with the UFC. He is set to return to the octagon later this year against Michael Chandler for a comeback two years after he broke his leg. ",
        "McGregor has won just one fight since 2016 but remains the biggest name in the sport and only MMA fighter to have real cross-over success.  Mayweather continues to cash-in on money-spinning exhibitions from time to time, but is yet to re-enter the pro ranks. The 46-year-old is still in outstanding shape but has little interest in risking his 50-0 legacy past his prime years. ",
        "A second bout between the pair seems highly unlikely and the UFC have been reluctant to let their stars box since when under contract.It led to the departure of heavyweight champion Francis Ngannou, who wanted the option of a mega-fight against Anthony Joshua or Tyson Fury while still competing for the organisation.McGregor's foray into the boxing world, while a fascinating one at the time, was fairly one-sided. Compubox said McGregor landed 111 punches, 26 per cent of the 430 thrown. When Robert Byrd called time on the fight, Mayweather was up 87-83, 89-82 and 89-81 on the judges' cards. "
    ]
}