{
    "articleURL": "/wires/reuters/article-12049079/Ecuador-buys-1-6-bln-debt-Credit-Suisse.html",
    "content": [
        "By Rodrigo Campos and Marc Jones",
        "NEW YORK/LONDON, May 5 (Reuters) - Ecuador is set to complete the biggest ever debt-for-nature swap, freeing up cash for conservation of the Galapagos Islands, one of the world's most precious ecosystems, after Credit Suisse bought up three of its bonds.A slump in Ecuador's bond prices triggered by an ongoing political crisis meant the Swiss Bank paid just $644 million for bonds with a face value of $1.6 billion, which will save the country roughly a billion dollars in repayments over 17 years.In return, the government in Quito has committed to spend about $18 million dollars annually for 20 years on conservation in the Galapagos, the remote islands whose unique animal life inspired Charles Darwin's Theory of Evolution.The old debt will be replaced with a cheaper-to-service $656 million \"Galapagos Bond\" maturing in 2041 and insured by the U.S. International Development Finance Corporation.It will also carry an $85 million guarantee from the Inter-American Development Bank that could, if needed, cover the first six quarterly interest coupons.Moody's on Friday gave the new debt a provisional investment-grade Aa2 credit rating - much higher than Ecuador's Caa3 \"junk\" rating and reflecting that additional security for investors.Credit Suisse said on Thursday it had bought just over $1 billion face value of Ecuador's 2035 bond at a price of 38.5 cents on the dollar, plus $202 million of a 2030 note at a price of 53.25 cents and $420 million of a 2040 bond, bought at 35.5 cents.",
        "The 2030 note was trading on Friday at around 55 cents on the dollar according to MarketAxess data - a positive sign for holders that there is a new floor on prices, according to Aaron Gifford, emerging markets sovereign analyst at T. Rowe Price. \"It looks like there's still enough interest in holding the bonds that were being tendered, which suggests to me that a lot of investors still think there's a lot of upside\", Gifford said.The buyback comes against a backdrop of political turmoil in Ecuador, with the National Assembly seeking to impeach President Guillermo Lasso for alleged embezzlement, which Lasso denies.In the works for more than a year, the turbulence was a vital boost for the economics of the deal, which has also survived the troubles of lynchpin lender Credit Suisse, which required an emergency takeover by rival UBS in March.UNIQUE SPECIESThe volcanic Galapagos islands lie 600 miles (970 km) off Ecuador's coast. Many species that live there, including giant tortoises, marine iguanas and Darwin's finches, are found nowhere else.A number of bondholders have given the buyback deal the thumbs-up, both for its conservation benefits and as a savvy way for the country, which has defaulted a number of times in recent decades, to do some repair work on its finances.",
        "\"Overall, I think it is positive,\" said Carl Ross, a veteran of emerging market debt restructurings, including past ones by Ecuador, at asset manager GMO.\"The bonds have been traded at very depressed prices, so why not take advantage and do some liability management. It's a good idea for a country that is trying to regain credibility with the market.\"Tellimer analyst Stuart Culverhouse estimated that more of Ecuador's bonds could have been bought.\"The impact in terms of lower debt service and lower debt stock is relatively mild,\" Culverhouse said, calculating it was shaving around 10% off the debt stock, which had been just over $16.5 billion beforehand and would now drop to $14.9 billion.(Editing by Catherine Evans)"
    ]
}