{
    "articleURL": "/tvshowbiz/article-12041241/Ed-Sheeran-breaks-reflects-grief-Jamal-Edwards-death.html",
    "content": [
        "For help, call Samaritans for free on 116 123 or visit samaritans.org READ MORE: What was music star Jamal Edwards' cause of death?Ed Sheeran broke down in tears while reflecting on his close pal Jamal Edwards' tragic death in his new Disney+ documentary series.",
        "The music producer and the son of Loose Women star Brenda Edwards, tragically died after a cardiac arrest brought on by taking cocaine and drinking alcohol in February 2022 at the age of 31.In his series, titled Ed Sheeran: The Sum Of It All, the Perfect hitmaker admitted he 'hadn't experience grief and loss' until Jamal's death, and it 'took over his whole life.'His wife Cherry Seaborn later added that the singer hadn't had time to process the loss, as Jamal's death came weeks after she was feared to have cancer, and had to delay having treatment because she was pregnant with their second child.Reflecting on his friendship with Jamal, Ed said: 'I basically lived in his bedroom. His mum thought we were having a relationship.",
        "'Jamal died in the morning. I was at his mum's house midday. It's Caribbean culture, you go to the family home for nine days and nine nights. On the ninth night they throw a big party.'Grief instantly ends your youth. The funeral was like 30 people but he knows like 10,000 people.'The pair became close after Jamal's YouTube channel SBTV helped to propel Ed into the spotlight, and the entrepreneur gave the aspiring musician a place to sleep when he was 18 and had no place to live in London. ",
        "The documentary showed Ed attending a cookout in memory of Jamal alongside his mother Brenda, and breaking down in tears in the back of a car.Sobbing, the Shape Of Your hitmaker added: 'This is his first birthday and he's not here. It's still very raw. It's very real. His grave we go past it a lot it just feels so weird that he's in amongst loads of people he didn't know.'It's all pure sadness. It's horrible. I know everyone goes through it. It's a common thing that you can't avoid.'I felt I hadn't really grown up until I experienced grief, loss. It just took over my whole life. It's just weird. I was thinking I don't want to cry in front of 78,000 people. I found myself really close at times.'It's just mad, straight back to it. The show must go on.'",
        "Reflecting on honouring his friend's legacy, Ed added: 'Jamal's legacy is empowering people to be who they want to be. All he did was get a camera and start filming his mates, put it on YouTube when was 14. 'I don't want my legacy to be Shape Of You or Perfect. I would love for my legacy to be essentially saying to kids 'just do what you want to do'.",
        "'I want kids to be like ''Ed's from Ipswich, I'm from Ipswich I can do it.'''Music has always been like therapy for me, to get my thoughts and feelings down. It works.'Ed's documentary series also saw him detail his wife Cherry Seaborn's cancer diagnosis, which came just weeks before Jamal's shock death.In the series' third episode, Ed admitted that it was in the midst of these struggles he vented through his songwriting.He added: 'I was hit by heavy stuff one after the other. They found a tumour in Cherry's arm. The diagnosis wasn't good. She was pregnant and they can't do anything. 'Then suddenly I'm in this three week court case. Then Jamal dies. 'The moment you find out that the worst thing in the world has happened to someone you truly love with all your heart, you feel like you're drowning and can't get out from under it. Just from that situation all of these songs came out.'I remember being sat in this specialists waiting room thinking the worst was going to happen. I'm worried about Cherry, the unborn daughter that's in her. You start writing a song and you vent a little bit and that's why songs get written.'His wife Cherry also admitted that Ed hasn't 'processed' Jamal's loss adding: 'The difficult thing about grief is everyone rallies around you at the start, six months down the line that wears off. ",
        "'Everything's been so busy and there's an attitude, especially in Brtian, of carrying on. I'm in a much better place from a processing perspective. I don't think Ed is there yet. 'There's no way he had time to process and be at peace with things. He's been too busy. He needs to stop. He needs to process, he hasn't processed at all.'The documentary series showed Ed breaking down on stage, adding he felt 'weird and embarrassed' to be crying while in the middle of a concert.Ed went onto film a tribute to at the home ground of Chelsea FC, the team Jamal supported, with his name added to one of the seats in Stamford Bridge.He added: 'I do believe in the afterlife and I will see him again. This is the first thing he will say.'",
        "Earlier this month, Ed revealed the opening track to his forthcoming album encapsulates his feelings towards depression as he sings, 'The more that I love, the less that I feel.'Ed, whose album Subtract is released on May 5, has dedicated Boat, the first song on his sixth body of work, to the uphill struggle he's faced in recent years against grief, illness, and addiction.Accompanying the new track, which was written by the English seaside, Ed premiered a video in which he is lashed by waves on a shore.",
        "The father of two, who has documented his overwhelming feelings of depression in his upcoming series, sings 'but the waves won't break my boat', symbolic of his hope and determination as he recovers from a series of hard-hitting events.In artwork captured by Annie Leibovitz, Ed can be seen running free from the crashing waves."
    ]
}