{
    "articleURL": "/news/article-12044367/Commonwealth-Bank-Australias-gives-member-staff-two-days-pet-bereavement-leave.html",
    "content": [
        "CBA gives staff two days annually for pet emergenciesAus FairWork Ombudsman doesn't guarantee any  CBA earns the country's sixth largest revenue Australia's biggest is set to offer staff two days of paid leave if their pet dies or needs emergency medical care, according to company insiders.",
        "Anonymous employees at the Commonwealth Bank of Australia have claimed that the bank is introducing two days of leave annually to deal with vet emergencies or the passing of 'beloved animals'.The Australian FairWork Ombudsman says that employees can take compassionate leave if immediate family members pass away, but doesn't include any reference of family pets in their workers right policies. The claims come the same day that the CBA announced another round of massive layoffs for staff amid a move offshore to India. Commonwealth Bank is Australia's largest retail bank, and the country's sixth largest company based on revenue. ",
        "The proposed policy was reported by The Aussie Corporate.‘Anon please. CBA offering Pet Leave “to support emergency vet care or the passing away of a beloved animal” Two days a year,' one employee told the page.'Cba proposing 2 days per year for pet leave to support emergency vet care and passing away of a beloved animal,' another confirmed. While Commonwealth Bank is under no mandate to provide employees leave when a family animal is in urgent need of care or dies, some companies do extend workers rights to pets.Under the Fair Work Act 2009, an employee’s eligibility for carer’s leave or compassionate leave is strictly relevant to human family members only.",
        "These protections extend to any miscarriage and stillborn that the family may experience.Employers can provide increased access to existing leave entitlements such as carer’s leave or compassionate leave, in arrangements referred to as ‘pawternity’ or ‘furternity leave’.Refusing to free up any time for the loss of an animal can have dire consequences, according to Ceri Hohner, associate and solicitor at FCB Workplace Law.'Refusing any form of leave can have massive impacts on employee productivity, trust, and longevity – not just for the individual in question, but also the wider workforce,' Ms Hohner wrote in 2021.'Depending on the circumstances, such a decision could destroy years of loyalty by representing the business as uncaring, heartless or unsupportive. 'That doesn’t mean it’s not a decision an employer can’t make – but one which should take into account all of the potential impacts when doing so.'",
        "This week, Commonwealth Bank announced that it was laying off staff after announcing a $5.15billion profit for the half year to December 2022, with greater profits expected from in the current half year.Finance Sector Union National Secretary Julia Angrisano said the move to ship jobs offshore was nakedly greedy. 'This is nothing but a naked grab for profits at the expense of bank workers who have kept the CBA functioning during the pandemic and the post-pandemic economic restart,' Ms Angrisano told Mirage News.",
        "'These are workers who are contributing to the record profits being made by the CBA and yet the bank responds by pushing them out the door.'The CBA has seen net interest income rise by 19 per cent as mortgage interest rates have gone up but that’s not enough for this bank.'Commonwealth Bank also cut more than 40 Sydney-based jobs in April, adding to the more than 500 jobs they had already sent overseas since 2021.The Commonwealth Bank of Australia declined to comment when contacted by Daily Mail Australia."
    ]
}