{
    "articleURL": "/wires/reuters/article-12061167/Soccer-Nottingham-Forest-edge-Southampton-escape-drop-zone.html",
    "content": [
        "NOTTINGHAM, England, May 8 (Reuters) - Nottingham Forest's Premier League survival hopes got a massive boost as Taiwo Awoniyi's brace helped them to a 4-3 home win over bottom club Southampton whose 10-year stay in the top flight looked to be coming to an end on Monday.",
        "A nerve-jangling City Ground clash exposed the defensive frailties of both sides with Nigerian striker Awoniyi scoring twice within four minutes early on to give his side control before Carlos Alcaraz hit back for the visitors.A Morgan Gibbs-White penalty restored Forest's two-goal lead in the 44th minute but Forest's fans were on edge again when a Lyanco header gave Southampton renewed hope.Southampton were threatening an equaliser but Forest struck on the break in the 73rd minute with Danilo finishing off a flowing move. Forest had a Felipe goal ruled out for offside before Saints captain James Ward-Prowse ratcheted up the tension by converting a stoppage-time penalty.Forest held out for the three points that lifted them out of the relegation zone to 16th with 33 points from 35 games.Southampton have 24 points from 35 games and are eight points below the safety zone with three games left. Failure to beat Fulham in their next game will condemn them to the drop.It was a joyous night for Forest although manager Steve Cooper's fingernails, not to mention those of the club's vociferous fans, would have taken a battering.Two-time European champions Forest's first season back in the top flight has been a struggle but they can finally see light at the end of the tunnel.",
        "Victory against Southampton was imperative and it was achieved largely thanks to Awoniyi's first goals since January and superb displays by Gibbs-White and Brennan Johnson.\"The most important thing was the win, I just felt we showed some good attacking moments and recovered from mistakes because at times we didn't cover ourselves in glory,\" Cooper said.\"But we stuck together and got over the line.\"Johnson's sizzling pace caused Southampton problems all night and his superb low cross was struck home by Awoniyi in the 18th minute. Three minutes later Forest turned the screws when Danilo flicked the ball towards Awoniyi who swivelled to smash a superb volley past Alex McCarthy.Southampton had looked the better side up until Awoniyi's quickfire double and got back into the game when Stuart Armstrong set up Alcaraz to fire past Keylor Navas.Chances went begging at both ends before Johnson was quick to a loose ball in the area and was tripped by Ainsley Maitland-Niles and Gibbs-White thumped home the penalty.Ward-Prowse's delivery was headed in by Lyanco and Forest were hanging on before a sensational flick by Gibbs-White played in Danilo to beat McCarthy with a clinical finish.It was never going to be that straightforward though and Forest's hearts were in their mouths after Ward-Prowse's late penalty led to a late Southampton siege.",
        "With relegation looking a near-certainty, Ruben Selles, Southampton's third manager of a dreadful season, said he was not sure what his future held.\"I can tell you what we are going to do for the next weeks, we are going to just keep working as much as we can and keep the situations for the future for the people that need to be responsible for that,\" he said.(Reporting by Martyn Herman Editing by Toby Davis)"
    ]
}