{
    "articleURL": "/wires/aap/article-12049503/Payten-aiming-calm-Cowboys-face-bogey-Roosters.html",
    "content": [
        "Sin-bins and poor discipline have cost North Queensland in recent fixtures against the Sydney Roosters which is why coach Todd Payten has employed a mantra of relaxation ahead of their Magic Round clash.",
        "With their season teetering at 3-6 and a raft of suspensions and injuries plaguing their team sheet so far in 2023, it shapes as a difficult task for the Cowboys to maintain calm given the circumstances.After a 44-6 drubbing at the hands of Cronulla in round nine, the alarm bells were ringing in the north after enjoying such a successful season in 2022.That's why Payten is opting for a different approach this week and seeking calm from his players against the Roosters who have won their past five against the Cowboys.In their round four match-up last year, three Cowboys were sin-binned leading to a 20-0 halftime deficit and an eventual 28-4 home loss.A year earlier, Lachlan Burr's 10-minute marching orders late in their Magic Round clash was the catalyst for the Roosters comfortably holding on 30-16 after the Cowboys threatened a comeback.Payten says he's been guilty of over-hyping his players for what is always a bruising and imposing Roosters side.\"Last year when we played them in that first round I revved them up too hard through the week,\" the Cowboys coach said on Friday.\"We got emotionally charged and didn't play well in the first 20-25 minutes.\"It's about staying relaxed and not getting over-hyped. We're playing a good team, they're physical, they run hard and they like to bully teams, so we can't show any weakness.",
        "\"It's just staying calm and motivated and getting the job done.Staring up the ladder in 16th position, the statistics should indicate North Queensland are struggling across a plethora of categories ahead of Sunday's clash..But it isn't the case.They are tied highest in the NRL for set completions at 81 per cent, have the fifth highest run metres as a team, the second highest kick metres and most kicks of any club. Deep territory kicking and pressure on the opposition's line is part of Payten's game plan.But where the Cowboys are truly struggling this year is with their discipline.They have missed 338 tackles at an average of 38 per game and have conceded the second most penalties in the competition behind Canterbury at seven per game.Easy \"piggy-back\" penalties as Payten describes has heaped pressure on their defence leading to confusion and communication disparity in their own half.\"The problem with our defensive system at the moment is that we've had guys make decisions outside principles, and then we've missed tackles that should have been made,\" Payten added.\"We need guys making decisions together, staying calm and relaxed, and then once someone makes a decision, we always have to make the same decision on the outside.\""
    ]
}