{
    "articleURL": "/news/article-12040907/Rishi-Sunak-Keir-Starmer-face-PMQs-eve-local-elections.html",
    "content": [
        "Thousands of council seats in England being contested in elections tomorrowRishi Sunak and Keir Starmer engaged in brutal clashes about housing today on the eve of crunch local elections.",
        "The leaders faced off at PMQs amid a final push for votes across England - with the results seen as a waypointer for who will be in Downing Street after next year.Sir Keir savaged Mr Sunak over rising mortgage rates, saying that together with scrapping housebuilding targets was 'killing the dream of home ownership for a generation'.But the premier shot back that Labour wanted to 'impose top-down housing targets' and would 'concrete over the greenbelt and ride roughshod over local communities'. Both parties have been engaged in desperate expectation management ahead of the ballot tomorrow, with the Tories playing up predictions that they could lose more than 1,000 seats.However, MPs are privately more optimistic about limiting gains by Labour and the Lib Dems. Sir Keir's allies have suggested that picking up an extra 400 seats would be a good performance - but experts insist that would be far short of what is needed to win a general election.Labour HQ is said to have been sending in 'hit squads' to struggling local associations, with tip sheets featuring inspiring quotes from Second World War hero Field Marshall Montgomery. ",
        "Sir Keir opened hostilities by asking: 'How many mortgage payers are paying higher rates since the Tory Party crashed the economy last autumn?'",
        "Mr Sunak replied: 'Our record on homeownership is crystal clear - because of our tax cuts, 90 per cent of first-time buyers now don't pay any stamp duty at all.'Last year, we saw the largest number of people buying their first home in 20 years.'That is a Conservative Government delivering on people's aspiration to own their own homes.'Sir Keir said: 'The answer that the Prime Minister avoided giving is 850,000.'Nearly a million people paying more on their mortgage each month because his party used their money as a casino chip.'He asked: 'Does the Prime Minister know how many more people will be joining them on higher mortgage rates by the end of this year?'Mr Sunak replied: 'We know that our plans will deliver lower inflation and lower interest rates, but we know that his plans just mean more debt, and I quote 'year after year after year'.'Those aren't my words, that is the assessment of the former Labour shadow chancellor.'Sir Keir responded: 'By the end of this year, nearly two million homeowners counting the cost of the Tories' economic vandalism with every mortgage payment they make.'It's not just those who already own their home that are counting the cost of Tory recklessness, the average deposit for a first-time buyer is going up to £9,000.'",
        "Mr Sunak replied: 'That's why we've introduced a 95% mortgage guarantee scheme, it's why we're helping people in social housing own their own home through our first homes and our shared home ownership schemes.'Sir Keir said: '£9,000 would take four years, they think it's funny ... roughly the annual bill to heat his swimming pool, but for most people, four more years of scrimping is a hammer blow to their ambitions.'And now he's kicking them when they're down, because his decision to scrap housing targets is killing the dream of homeownership for a generation. Why doesn't he admit he got it wrong and reverse it?'Mr Sunak said: 'I promised to put local people in control of new housing and I'm proud that that's what I've delivered within six weeks of becoming Prime Minister.'Now he wants to impose top-down housing targets, he wants to concrete over the greenbelt and ride roughshod over local communities. Now previously he did say, he's on record as saying, local people, local communities should have more power, more control. Now he's U-turned, just another in a long list of broken promises.'Sir Keir responded: 'His councillors simply don't want to build the houses local people need, so he's given them a way out.'",
        "He added: 'Why doesn't he stop the excuses, stop blaming everyone else, and just build some houses instead?'Sir Keir was boosted yesterday by polls showing Labour stretching its advantage.Redfield &amp; Wilton Strategies research found the party's support running at 45 per cent - up one from a week ago - while the Conservatives were down one on 28 per cent. In another worrying sign for Mr Sunak, the Lib Dems - hoping to make big gains in the England council contests - were up to 12 per cent.A separate poll by Deltapoll suggested Labour's lead has extended from 13 points to 15 points. Although the gap has been narrowing slightly in recent months and Mr Sunak's personal approval ratings have been ticking up, the findings underline the scale of the challenge for the Tories tomorrow.They will have been encouraged by Sir Keir's woes over appointing Sue Gray as his chief of staff, with a review into whether she broke civil service rules due imminently.The Labour leader also confirmed yesterday that he is ditching a pledge to scrap tuition fees, admitting it is not affordable. Experts point out that the measures of success are particularly complicated in these local elections. Around 90 per cent of the 8,000 seats were last up for grabs four years ago, when Theresa May was struggling to get her Brexit deal through. ",
        "But Labour was also failing to make major inroads with an unpopular leader in Jeremy Corbyn. According to The Times, Labour HQ has dispatched campaign improvement boards (CIBS) to areas including Leicester, Birmingham and Croydon in a bid to boost gains.Training sessions have apparently included quotes from Field Marshal Montgomery, such as: 'I have no intention of launching our great attack until we are completely ready.'",
        "A senior Tory told MailOnline that Downing Street could be happy even if the party loses 800 councillors.'Labour taking that few seats would be a real problem for Keir,' they said. Election guru Professor Michael Thrasher told Sky News that Labour should be doing 'far better' than 4000 gains tomorrow.'I think that's a very modest claim and given two things. Number one is where Labour currently is in the polls - it's at 43 per cent,' he said.'So again, if you recall, in 2019, we were saying that Labour was on 31 per cent. That's an increase of 12 percentage points on the position four years ago, so they should be doing well, and we think far better than 400 gains.'Really, that's a very modest swing from the Conservatives to Labour since 2019. They should really be aiming much higher than that, given what they need to do to win the next general election.'"
    ]
}