{
    "articleURL": "/news/article-12052201/Lori-Vallow-Chad-Daybell-referred-kids-spouses-obstacles-cult-moms-trial-hears.html",
    "content": [
        "Texts showed they plotted the killings of her husband Charles Vallow, her kids JJ, seven, and Tylee, 16, and Daybell's wife Tammy, FBI agent Doug Hart told jurorsVallow, 49, and Daybell, 54, also engaged in lengthy sexting sessions in which they described showering and lying in bed together during their twisted affair The State says Vallow wanted 'money, power, sex' and that she also used 'those things to get what she wanted.' Daybell is being tried separately Lori Vallow and Chad Daybell referred to her kids and their spouses as 'obstacles' before they were murdered, the cult mom's trial heard today.",
        "Texts show they plotted the killings of her husband Charles, her children JJ, seven, and Tylee, 16, and Daybell's wife Tammy, FBI agent Doug Hart told jurors.Vallow, 49, and Daybell, 54, also engaged in toe-curling sexting sessions about showering together and 'naked activities' during their affair which started shortly after they met at a doomsday conference in late 2018.The couple are accused of killing JJ and Tylee and burying their bodies in Daybell's backyard in Rexburg, Idaho, in September, 2019. A month later Daybell's wife Tammy was suffocated in bed. They married two weeks later in Hawaii.Vallow is further accused of plotting the death of her estranged husband Charles who was shot by her brother in Arizona in July of that year. She is facing a separate trial over his killing.",
        "The State says Vallow wanted 'money, power, sex' and that she also used 'those things to get what she wanted.' Vallow, who faces life in prison if convicted, denies the charges against her. Daybell is being tried separately.FBI agent Hart told the Ada County Courthouse in Boise that he seized two iCloud accounts belonging to Vallow under the usernames lori4style and lollytime.He pored through her data from the point after she met Daybell at a Preparing a People conference in St. George, Utah, on October 26, 2018.",
        "'It was apparent that they were very quickly after meeting involved in an illicit affair with one and other and they made plans to get married and share a life together,' he told the court.As part of their alleged plan Vallow and Daybell discussed how to remove the 'obstacles' of her children and their respective spouses, Charles and Tammy.Hart said: 'There were several communications regarding JJ and Tylee that were relevant to their deaths. They discussed their deaths. After the affair began, there began to be communication regarding the deaths of Charles Vallow, Tammy Daybell, JJ Vallow and Tylee Ryan.'Their messages were often highly sexualized - Daybell even writing Vallow an erotic novel in the form of chapterized texts.In one typical exchange - just three days after Vallow's husband Charles was shot dead - Daybell tells the cult mom he wants to enjoy 'naked activities' with her.'I need so badly to just gently kiss you ...for hours,' Daybell wrote on July 14, 2019. 'It would likely lead to other activities.'Vallow replied suggestively: 'Likely or luckily?'Daybell wrote back: 'It would LUCKILY lead to nakedness.'Through the texts, agent Hart established that Daybell was the 'quasi-religious leader' of their cult and that Vallow acted as his conduit through which other members, like her brother Alex Cox, would seek advice.",
        "Cox, who died of natural causes in December, 2019, shot dead Charles Vallow and is also accused of participating in the murder of Vallow's children.",
        "'Her position was right next to Chad Daybell. The two of them were in an elevated position and others would seek their advice and counsel as it related to alleged visions and so forth,' Hart told the court. He showed jurors texts exchanged between Cox and Vallow in which she referred to her 'source', meaning Daybell.'Can't wait to share all the things I learned about you [kiss and heart emojis] wow U r gonna like it. It explains a lot,' Vallow told Cox in March, 2019.He replied: 'Ok hurry up. Please.'She wrote back: 'Going to check everything with my source tonight to make sure I got this all right but it's really good. We can talk about it tomorrow hopefully [heart emojis].'In another exchange about a week later, Hart told the court that Vallow and Cox referred to her husband Charles as being possessed.Cox wrote to his sister: 'Correct. Charles body is alive. What did u learn?'She replied: 'A lot !! Still working on it. Will call u later.'The FBI agent said: 'We see very frequent usage of that particular term, \"We are working on things\", and that is a direct reference to this belief that they were in a battle against zombies and dark entities so when they were talking about working on things they were talking about that.'",
        "The court has previously heard how Vallow and Daybell referred to all of their alleged victims as being 'dark' and 'zombies' before their deaths. The twisted couple even scribbled down a ranking system with numbers denoting the extent to which someone was either 'light' or 'dark'.On July 9, 2019, two days before Charles Vallow was shot dead by Cox, Vallow texted her niece Melani Boudreaux saying: 'It’s coming to a head! This week will change everything.'The same day she said to Cox: 'It’s all coming to a head this week. I will be like Nephi I am told. And so will you.'",
        "Hart explained that Nephi is an ancient prophet referred to in the Book of Mormon who is instructed by God to slay Laban. The FBI agent summarized the oblique scriptural reference, telling jurors that Laban is the 'bad guy.' The jury were also shown texts in which Daybell told Vallow how his wife Tammy 'would be gone.'On July 13, 2019, Daybell told Vallow he was attending a Brigham Young University graduation ceremony for his children on the 23rd of that month.'I feel she will be gone by then, but I will still have that hoopla to deal with because a lot of ... family are coming and will stay for July 24th,' he wrote.",
        "The following day, Daybell texted Vallow: 'Good morning my most beautiful Lili. Thanks for joining me in the shower this morning. Wow. Getting ready to leave for my meetings. Does noon your time look like a time we could talk? I love you so immensely that the whole universe knows it. And very soon the people on this little blue globe will know it too.'Hart explained that the pair often used figurative language suggesting they were together when they were physically in different places. In this case, Vallow was not actually in the shower with Daybell but he is imagining that she was. Hart's evidence regarding the iCloud messages was broken off due to time constraints and will resume on Monday morning.Hart, who has since retired from the FBI, became involved in the case at the request of Rexburg PD on November 27, 2019. He began examining the iCloud accounts before the kids were found the following July - nine months after they vanished.He examined some 4,500 text messages sent and recieved by Vallow after she met Daybell in the fall of 2019 through to November 2020, when activity ceased on the iCloud accounts.Vallow's children were missing for almost a year before their corpses were found buried in Daybell's yard on June 9, 2020.",
        "During the opening, prosecutor Lindsey Blake described how charred remains were all that was left of Tylee.She told jurors: 'You will hear it explained as a mass of bone and tissue. That's what was left of this beautiful young woman.'",
        "Tylee's DNA was later found on a pickaxe and shovel in a shed on the property. JJ's body was wrapped in trash bags and duct tape - the tape binding his arms in front of him and wrapping around his head. He had been suffocated inside a plastic bag.The two children and Daybell's previous wife Tammy were all killed because they stood in the way of the couple's relationship, the State says. 'Remember, the defendant will remove any obstacle in her way to get what she wants, and she wanted Chad Daybell,' Blake told jurors.'The defendant used money, power and sex to get what she wanted.'Jurors have heard from friends and relatives of Vallow that she and Daybell believed the children were 'dark' and referred to them as 'zombies' before they disappeared.'The common theme was the body has to be destroyed,' Blake said. 'The defendant and Chad used their self-proclaimed religious teachings to justify their actions to others — their actions from affair to murder.'Prosecutors say the couple planned to use life insurance money from Tammy's death, and that Vallow kept collecting and spending the children's social security and benefits after they died.The trial opened on April 10 and the State is expected to rest its case next week. Vallow denies two counts of first-degree murder and three counts of conspiracy in the deaths of her two children and Tammy Daybell.She further denies grand theft for allegedly collecting government benefits on behalf of her children after they were killed.",
        "July 11, 2019: Lori Vallow's husband, Charles Vallow, is killed by her brother, Alex Cox, in Arizona. Police initially rule that Alex acted in self defense but reopen the case months later after the children are reported missing. August, 2019: Lori moves children JJ and Tylee to Rexburg, Idaho, close to where her future husband Chad Daybell lives with his wife Tammy.September 8, 2019: Tylee is seen alive for the last time during a trip to Yellowstone National Park with Lori, JJ and Alex. In the following weeks Lori tells people that her daughter is studying at Brigham Young University's Idaho campus.September 23, 2019: The last time JJ is seen at his school in Rexburg. Lori emails the school the following day claiming she is moving the family to California for a new job. October 2, 2019: Brandon Boudreaux, the ex-husband of Lori's niece Melani Pawlowski, is targeted in a drive-by shooting in Arizona. Police identify the vehicle carrying the shooter as a Jeep registered to Charles Vallow, Lori's late husband. October 19, 2019: Chad's wife Tammy, 49, dies at their Idaho home. An obituary states that she passed away peacefully in her sleep. Chad declines an autopsy and her death is listed as due to natural causes.October 25, 2019: A friend of Tylee receives a vague 'miss you' text from her phone but says that it didn't sound like the teen.   November 5, 2019: Lori and Chad tie the knot on a beach in Kauai. Receipts indicate that Lori purchased her own wedding ring from Amazon nearly three weeks prior to Tammy's death. November 26, 2019: Out-of-state relatives ask Idaho police to perform a welfare check on JJ. Lori and Chad claim he is in Arizona with relatives and ask their friend, Melanie Gibb, to lie and say she took the boy there for Thanksgiving. Police soon learn that no one has seen JJ or Tylee, since September. November 27, 2019: Police execute a search warrant related to the children at Lori's home and discover that she and Chad have fled Idaho.December 11, 2019: Tammy's body is exhumed from a Utah cemetery and her death is reclassified as suspicious.December 12, 2019: Lori's brother, Alex Cox, is found dead in a bathroom in his Arizona home. Months later an autopsy determines that he died of natural causes while he had the overdose drug Narcan in his system. December 21, 2019: Rexburg police issue the first press release about JJ and Tylee, revealing they believe their disappearance could be linked to Tammy's death and asking the public for information.December 24, 2019: Lori and Chad issue a statement through an attorney saying they love their son and daughter and look forward to addressing 'allegations once they have moved beyond speculation and rumor'.December 30, 2019: Police accuse Lori and Chad of lying to investigators and say they believe the couple know where the kids are or what happened to them.January 3, 2020: Police search Chad's home in Salem and remove 43 items, including tech devices and journals. They also comb over sections of the snow-covered yard with rakes and metal detectors.January 26, 2020: Lori and Chad are seen for the first time in months as police serve them with two search warrants in Kauai. Lori is also served with a court order to produce the children to authorities in Idaho in five days. The couple are approached by the media while officers serve the documents and refuse to say anything about the children.January 30, 2020: Lori misses the court deadline to produce the children to Idaho authorities.February 20, 2020: Lori is arrested in Kauai and charged with two felony counts for desertion and nonsupport of dependent children, and one misdemeanor count each for resisting and obstructing an officer, solicitation of a crime, and contempt of court. March 5, 2020: Lori is extradited to Idaho, where she is held on $1million bond at Madison County Jail.March 17, 2020: Lori professes her innocence in a statement through her attorney as two other members of her defense team quit and the judge removes himself from the case. March 24, 2020: Court documents filed in the divorce of Lori's niece Melani and her husband Brandon Boudreaux allege that Lori told people she believed her children were zombies before they disappeared. April 9, 2020: Authorities reveal they are investigating Lori and Chad for murder, attempted murder and conspiracy in connection with Tammy's death. June 9, 2020: Police search Chad's home in Salem for the second time and discover human remains in the backyard. Chad is taken into police custody and charged with destruction or concealment of evidence.May 25, 2021: Lori and Chad are charged with first degree murder in the deaths of the children. Chad is also charged with first-degree murder in the death of his wife Tammy. May 27, 2021: Lori is deemed incompetent to stand trial on the murder charges in Idaho. August 5, 2021: Prosecution announces it will seek the death penalty for Chad. April 11, 2022: Lori is restored competency. Criminal proceedings against her in Idaho are ordered to continue. April 14, 2022: Lori is taken to the Madison County Jail in Rexburg, Idaho, by Fremont County Sheriff officers.April 10, 2023: Lori Vallow goes on trial for the murders of JJ, 7, and Tylee, 16. "
    ]
}