{
    "articleURL": "/wires/reuters/article-12040225/Fuel-depot-ablaze-Russias-Krasnodar-governor-says.html",
    "content": [
        "May 3 (Reuters) - A fuel depot was on fire early on Wednesday near a crucial bridge linking Russia's mainland with Crimea, a Russian official said, days after Moscow blamed Ukraine for an attack that set fire to an oil depot in Sevastopol.",
        "Flames and black smoke billowed over what appeared to be large tanks emblazoned with red warnings of \"Flammable\" in videos posted on Russian social media, though Reuters could not independently verify either the fire reports or the videos.\"The fire has been classified as the highest rank of difficulty,\" Veniamin Kondratyev, the governor of the Krasnodar region lying across the Sea of Azov from Ukraine, said on the Telegram messaging app, adding that there were no casualties.Kondratyev said the blaze broke out in the village of Volna. The hamlet is close to the Crimean bridge over the Kerch Strait, a major artery for Russian forces, as it links the mainland to the Crimean peninsula that was annexed in 2014 from Ukraine.The incident came days after a drone strike set ablaze a Russian fuel storage facility in the Crimean port of Sevastopol on Saturday, in what Moscow called a Ukrainian attack.Ukraine did not claim responsibility for the Sevastopol attack, in line with its standard practice during the conflict, which began in February 2022.Over the weekend, however, Kyiv's military said undermining Russia's logistics formed part of preparations for a long-expected counteroffensive, aided by fresh deliveries of more powerful Western weapons.Blasts derailed a train on Monday in Russia's region of Bryansk bordering Ukraine, the second such incident in two days. Russian officials say pro-Ukrainian sabotage groups have made attacks there since the start of hostilities.",
        "Russia has also stepped up attacks on Ukraine ahead of a counteroffensive expected by the latter, with nearly nightly waves of drones and missiles targeting Kyiv and other areas over the past week.Early on Wednesday, authorities in the Ukrainian capital said they parried Moscow's overnight attack as air defence systems destroyed all the drones launched. (Reporting by Lidia Kelly in Melbourne; Editing by Muralikumar Anantharaman and Clarence Fernandez)"
    ]
}