{
    "articleURL": "/wires/reuters/article-12041153/Barratt-track-year-profits-sees-early-signs-recovery.html",
    "content": [
        "Improved demand allows group to reiterate profit target",
        "Barratt follows rivals in retaining new build target(Adds background, reaction)By Suban AbdullaLONDON, May 3 (Reuters) - Britain's largest housebuilder Barratt Developments said on Wednesday an improving rate of sales would help it to meet annual profit forecasts and, like rivals, retain its target for new build completions this year.Britain's housing market has shown signs of recovery in recent weeks, helped by an easing in fixed mortgage rates for the traditionally strong spring selling season, following the market turmoil that followed former prime minister Liz Truss's unfunded tax cuts plan.That improved buyer demand filters through to the country's housebuilders, and while Barrett said the \"economic backdrop remains difficult\", it reported improving buyer interest.\"We are pleased that more positive sales rates have been maintained through this period and ... we expect to deliver full year adjusted profit before tax in line with current market expectations,\" Chief Executive David Thomas said in a statement.Shares in the FTSE 100 firm were flat in early trading but up 27% for the year to date, ahead of the bluechip index which is up 5%.Barratt reported average weekly net private reservations per active outlet, or site, which reflects buyer interest, of 0.65 units between Jan. 1 and April 23, up from 0.49 in January.",
        "Its year-to-date forward sales - another key measure of near-term demand - stood at 2.95 billion pounds ($3.68 billion), up from 2.67 billion pounds reported at the end of January, but still 34.4% lower than the year before.It reaffirmed its home completions target of 16,500-17,000, after it raised the outlook range from 16,000-16,500 earlier this year.Barratt's smaller rivals Persimmon and Taylor Wimpey last week highlighted renewed buyer interest since the start of 2023, despite remaining cautious about broader economic concerns.However, Julie Palmer, partner at Begbies Traynor, said Barratt's scale means it is \"better placed than many smaller developers\" to withstand any upheaval in the construction sector.Bank of England data showed the volume of mortgages approved by British lenders in February rose by more than expected, while mortgage lender Nationwide on Tuesday reported a 0.5% rise in house prices in April after having fallen in the seven previous months. ($1 = 0.8008 pounds) (Reporting by Suban Abdulla; Editing by Kate Holton and Christina Fincher)"
    ]
}