{
    "articleURL": "/tvshowbiz/article-12043847/Is-real-reason-James-Corden-quit-America-list-chat-losing-20m-year.html",
    "content": [
        "As we clinked our glasses of champagne, James Corden proclaimed: 'I'm the luckiest man alive.'",
        "We were toasting his first episode as host of the U.S. chat show The Late Late Show, and Corden was visibly relieved that his much-anticipated debut on American TV had 'gone well'.I was based in Los Angeles at the time and Corden had invited me along, probably glad of a friendly face in the audience.I saw him, briefly, in his dressing room before the show started recording. He was pale and shaky. This was the biggest moment of his career and he knew it.But the evening was a triumph — the start of an eight-year run of success for the British actor and comedian. And, it has emerged, quite an expensive one for CBS, the huge U.S. television network that aired The Late Late Show.",
        "Just days after Corden's final show, it has been reported in America that it was losing CBS as much as $20million (£16million) a year. Brian Stelter, an anchor for news channel CNN, claims to have been told by a CBS executive that the show was earning less than $45million a year, while spending up to $65million.'It was simply not sustainable,' the executive said. 'CBS couldn't afford him [Corden] any more.'A spokesman for Corden declined to comment on any losses. Sources close to the star say CBS did try to keep both him and the programme.",
        "George Cheeks, CBS President, said: 'I've had the privilege to see James' creative genius up close and experience his valuable partnership with CBS, both as a performer and a producer. 'We wish he could stay longer, but we are very proud he made CBS his American home.' The revelation — which coincided with Corden's appearance at the Met Gala in New York on Monday — throws a new and rather unflattering light on Corden's surprise departure from The Late, Late Show, which has been spun as the star wanting his three children to grow up in Britain as he took 'a pause' to consider what he might want to do next.There has been no mention of financial losses — but then, the former Gavin &amp; Stacey star has always been rather good at his own PR, as I saw for myself on the evening of his debut.Corden's opening words to The Late, Late Show's audience, back in 2015, were: 'Believe me, however shocked you are about me doing this job, you'll never be as shocked as I am. You probably don't know who I am, rather like the rest of America.'",
        "It was false modesty: many U.S. stars knew exactly who he was and had been queueing up to appear on his chat show. That night alone his line-up included Tom Hanks, Meryl Streep, Mila Kunis, Chris Rock and Eddie Redmayne.",
        "In the course of their chat, Kunis revealed that she had married partner Ashton Kutcher, setting the celebrity news agenda alight. 'Not bad for a first night!' Corden said with a wink.So, how did a chat show rookie manage to round up those stellar guests? The truth is that by the time he arrived in Los Angeles, his contacts book was already heaving with names and he was a star on both sides of the Atlantic. He had hosted the Brit Awards three times and performed on TV and stage in both London and New York.Corden told me he had personally called Hanks to invite him to take part in a skit in which the two men dressed up as characters from all the Oscar-winner's movies, including Splash, for which Corden donned a blonde wig and a seashell pendant to play the film's central character, a mermaid.",
        "Redmayne, meanwhile, just received a text message from Corden — he was an old friend from drama school.Corden was an instant hit on The Late Late Show: American news stations praised him as a 'British superstar', while showbusiness trade magazine Variety described the Hillingdon-born actor and comedian as 'natural' and 'likeable'.But now, eight years on, the warm embrace America gave him seems a distant memory. His halo has undoubtedly slipped.",
        "First, there has been a rumoured fall-out between Corden and his best friend of more than 25 years, producer and director Ben Winston. The son of IVF pioneer Sir Robert Winston uprooted his life in London to direct The Late Late Show and there have been multiple claims that all is not well between the two men.About 18 months ago, Fulwell 73 Productions LLP, which makes The Late Late Show and of which both men are directors, was on the verge of being dissolved. This was, bizarrely, dismissed as a 'procedural technicality with HMRC' caused by delays in filing accounts due to Covid.Days after that was reported, the paperwork was updated.Corden and Winston both deny there are problems — and last Thursday night, Winston was at Corden's side as they celebrated with a star-studded wrap party after recording the last show.But during his time on the programme, Corden's wit, judgment and behaviour came into question on several occasions.In 2017, he was forced to apologise after he made jokes about Harvey Weinstein while hosting the AmfAR Gala — an HIV/Aids fundraiser — in Los Angeles.He later apologised, tweeting: 'To be clear, sexual assault is no laughing matter. I was not trying to make light of Harvey's inexcusable behaviour, but to shame him, the abuser, not his victims.'",
        "Around the same time, Corden was left mortified when asked on his show by guest Jimmy Kimmel if he could name two of his camera crew. He couldn't and tried to bluff it out. 'That is a great question,' giggled Corden, before replying that it was 'a different crew tonight, actually'.For someone who was always positioned as a 'man of the people', the incident confirmed suspicions that he was really only interested in the celebrities.But perhaps the most telling insight into the change in Corden came last year when he was branded 'a tiny cretin of a man' and banned from glitzy New York restaurant Balthazar for being rude to staff.Owner Keith McNally claimed on Instagram that Corden was 'the most abusive customer to my Balthazar servers since the restaurant opened 25 years ago'.To be fair, Corden apologised profusely, saying: 'The truth is I have made a rude, rude comment. And it was wrong. It was an unnecessary comment, it was ungracious to the server.' The ban was later lifted.But only last month, television director Craig Duncan claimed Corden was 'the most difficult and obnoxious presenter' he had ever worked with, while former Spice Girl Melanie Brown has claimed Corden was one of the 'biggest d***head celebrities' she has ever met. Corden has not commented.",
        "Friends say he has had 'many offers' for new projects since his return to the UK but is yet to commit. Speculation that he will host a chat show for a British channel is said to be wide of the mark.'What is the point of James doing a daily or even weekly programme after giving up one in America?' says one source close to the star. Others insist his great love is the theatre (he starred in award-winners The History Boys and One Man, Two Guvnors), so maybe stage roles are more likely.",
        "What is undeniable is that Corden has revolutionised the U.S. chat show, largely courtesy of 'Carpool Karaoke', the slot on his show filmed in a car with a celebrity as they chat, laugh and sing together, which became a global phenomenon, notching up hundreds of millions of views on YouTube.The celebrities clamouring to go for a spin and a sing-song in his Range Rover included Michelle Obama, Sir Paul McCartney, Stevie Wonder and — in last week's finale — Adele.Eight years after Corden's debut, in which he appeared nervous and humble, the last Late Late Show was, well, all about him. And there was a celebrity-filled programme of tributes beforehand.Adele declared she 'won't know what to do in LA' without Corden; Harry Styles told his friend how proud he was of him; Tom Cruise featured in a pre-recorded skit involving the musical The Lion King; and Will Ferrell was there to smash up the desk from which Corden has presented the show.Even President Biden popped up from the White House to thank the star 'for all the joy he brought to the homes of America' during his 1,200 shows. 'I'm going to miss you, buddy,' the President said, before thanking him for 'never making me sing in a car'.The party ended with Corden leading a singalong with his cast and crew.In leaving the show, he will be giving up the sunshine-soaked, bling-filled west coast celebrity lifestyle he clearly loves: nipping down to the Mexican retreat of Cabo with the likes of Adele and Styles; dropping in on his friends Gwyneth Paltrow, Justin Timberlake, Matt Damon and Ben Affleck; heading up the 101 highway to Montecito to see the Duke and Duchess of Sussex.The Cordens will also miss their £20million mansion in the exclusive LA district of Brentwood Park, with its dual lawns — one with real grass, one made of AstroTurf — and its cinema, pool and spa. All easy to afford when you're worth more than £56million.Maybe Corden and his wife Julia really do want their children — Max, 12; Carys, nine; and Charlotte, five — to grow up close to their grandparents and would have returned to Britain anyway.But the crueller truth may be that The Late Late Show was too expensive, Corden's popularity was on the wane — and he's getting out just in time.A spokesperson for The Late Late Show with James Corden said: 'The Late Late Show was hugely successful and profitable. Rumours that say otherwise are untrue.'The network made it clear they wanted James to continue making the show and offered him a multi year deal to stay.'"
    ]
}