{
    "articleURL": "/news/article-12049217/Mt-Barker-Granny-guilty-letting-child-use-cannabis-butter-cupcakes-making-high-classmates.html",
    "content": [
        "Pam Bickerton, 74, gave grandson weed-butter  He was given the butter for cleaning the kitchen The teen then sold it to classmates who got highShe has been charged after pleading guilty A great-grandmother has been hit with a criminal charge for providing the butter that her grandson used to sell 'cannabis-laced cakes' at his school.",
        "Pam Annette Bickerton, 74, was sentenced on Thursday after giving cannabis-butter to her grandson in exchange for house chores, who then sold weed cupcakes at his Mount Barker, SA school.The plot was discovered by police after several students at the high school went to the nurses office with symptoms of cannabis use, leading staff to call police.  Bickerton had pleaded guilty to one count of supplying or administering a controlled drug to a child before appearing in the Adelaide Magistrates Court.The charge carried a maximum sentence of life in prison, but Bickerton was handed a two-year good-behaviour bond instead.",
        "After cleaning the kitchen for his grandma, the teenager baked the cakes which eventually sent his classmates to the sickbay, the court heard. 'Police became aware of an allegation that a student was selling cupcakes laced with cannabis at [the school after the students] presented at the sick bay displaying symptoms consistent with cannabis consumption',' Magistrate Justin Wickens said.'Police spoke to two students who disclosed that [another student] was providing the cannabis-laced cakes.' 'This is very serious offending and supplying drugs to minors is a very serious offence,' he said.After police arrived at the school to interview students, including one who had returned a positive urine test for the drug, classmates dobbed the teen in who then told the cops that his grandmother had supplied the ingredients.",
        "When police arrived at Bickerton's home in the weeks after she immediately told them that she still had three bags of butter in her freezer and two bongs which were then seized.Bickerton told the police and the courts that she began using cannabis to help with a sleeping condition and did not remember where she originally bought it from. ",
        "Since the incident, Bickerton has given up her use of the drug. 'I'm told you are extremely remorseful for allowing this to occur,' Magistrate Wickens said.'You are very disappointed in yourself over your actions [and] you have removed cannabis from your life completely.''You should understand the need to shield minors from illicit drug use for as long as possible.'A jail sentence of 3.5 years behind bars was initially on the table for Bickerton, but dropped in favour of the two-year good-behaviour bond.No charges were laid against her grandson for distributing the cakes."
    ]
}