{
    "articleURL": "/news/article-12049985/Famous-retailer-owned-Bed-Bath-brink-bankruptcy.html",
    "content": [
        "The popular retailer has 83 locations around the country according to its websiteFor more than five decades, the bargain retailer has sold household furniture in addition to Christmas decorationsAn iconic US store once owned by bankrupt retail giant Bed, Bath &amp; Beyond is said to be preparing to file for its own bankruptcy.",
        "Christmas Tree Shops, a legendary New England retailer which has stores across the US, is said to be in peril as lawyers ready documents amid its reported insolvency.The store - which last year was forced to rebrand to CTS as some customers assumed they only sold Christmas trees - has 83 locations around the country, according to its website.For more than five decades, the bargain retailer has sold household furniture, food, toys as well as the eponymous Christmas decorations. Now, just like its old owner, the New England firm risks closing its doors to customers for good.",
        "The Wall Street Journal claimed 'people familiar with the matter' said the store was preparing their filing for bankruptcy, which could be processed as early as this weekend.",
        "The paper also said Christmas Tree Stores had instructed lawyers from the Boston legal firm Murphy &amp; King.The news comes just a year after the company's CEO announced plans to open 15 new stores in the US following its rebranding to CTS.But the legal filings might not see the complete closure of the retailer.'Chapter 11 isn't the end of the road. It is really a way for firms to restructure,' Ken Morris from Cambridge Retail Advisors told CBS. He said there would likely be some stores that would have to close, but the better performing flagship shops may be able to keep their doors open.",
        "Retail experts also stressed to consumers they should use any gift cards they have before further developments in the process.Husband and wife duo Charles and Doreen Bilezikian started the company on Cape Cod in 1970. It expanded across the north-western states into Michigan, Indiana, Kentucky and Ohio in the 1980s before opening up in locations around the rest of the country.Bed, Bath &amp; Beyond then acquired the company in 2003 before selling off 80 stores to private company Handil Holdings.",
        "This comes after Christmas Tree Shops' previous owners Bed, Bath &amp; Beyond filed for bankruptcy last month.The furnishings giant filed for Chapter 11 bankruptcy protection at the end of April after failing to secure funds to stay afloat, announcing all 360 nationwide stores will eventually close, putting 30,000 jobs at risk.The home goods retailer filed for bankruptcy in a District of New Jersey court, listing both its estimated assets and liabilities in the range of $1 billion and $10 billion, according to the court filing.Bed, Bath &amp; Beyond stores will stay open for the time being, but a liquidation process has begun which will eventually see all 360 of its stores closing.The company said it has received a commitment of approximately $240 million in debtor-in-possession financing from Sixth Street Specialty Lending Inc, according to a separate statement. ",
        "The store has since moved to 'slash' prices to empty some of its defunct stock.Following the April filing, Sue Gove, president &amp; CEO of Bed Bath &amp; Beyond Inc., said: 'Millions of customers have trusted us through the most important milestones in their lives – from going to college to getting married, settling into a new home to having a baby.'Our teams have worked with incredible purpose to support and strengthen our beloved banners, Bed Bath &amp; Beyond and BuyBuy BABY.'We deeply appreciate our associates, customers, partners, and the communities we serve, and we remain steadfastly determined to serve them throughout this process.'We will continue working diligently to maximize value for the benefit of all stakeholders.'Bed, Bath &amp; Beyond had previously warned of a potential bankruptcy in early January when it issued a 'going concern' notice that it might not be able to cover its expenses following a difficult holiday season."
    ]
}