{
    "articleURL": "/wires/pa/article-12051157/Marco-Silva-sets-Fulham-points-target-ahead-Premier-League-run-in.html",
    "content": [
        "Marco Silva vowed Fulham would do everything they could to match their best-ever Premier League points tally with just four opportunities left to meet the objective.",
        "Fulham last hit 53 points in 2008-09 under Roy Hodgson, ultimately finishing seventh that campaign.Silva’s 10th-placed Cottagers are still eight points away from repeating that feat and have their next opportunity to move closer when they host relegation-threatened Leicester on Monday.“We are going to fight for it,” said Silva. “We are going to fight because it’s a target for us, clearly it’s a target for us. We have 12 points to fight for and we are going to do our best.“As always, game by game, thinking the next one will be a very good one at home at the Cottage that we want to do our best and we are going to do our best to win.“It’s there, the target is there but realistically we are going to have to fight really hard to get it.”Silva’s side are hoping to bounce back from three-consecutive losses, including Wednesday night’s Liverpool encounter decided by Mohamed Salah’s 39th-minute penalty – awarded following a VAR decision the Fulham boss reiterated should not have gone the Reds’ way.He said: “Liverpool clearly didn’t deserve the result. It was a clear mistake that made us to lose the match and that penalty that I repeat is embarrassing, that decision and of course it’s up to us to react, to go again and to do our best to take the three points.”",
        "Fulham’s second-most recent loss was at the hands of surging table-toppers Manchester City, who presented a very different challenge from the one expected from the 16th-placed Foxes on Monday.Silva will be without midfielder Andreas Pereira and skipper Tim Ream, who were both ruled out for the rest of the season following injuries sustained in the City clash.Dean Smith’s men are outside the drop zone on goal difference alone and Silva expects their precarious position to be a dangerous motivator come the Bank Holiday.",
        "He added: “Probably the next game against Leicester will probably be even more difficult than against City and Liverpool.“People probably don’t understand what I’m saying. I’m not saying that Leicester is a better team than the other two, that’s not what I’m saying, but they’re fighting for their lives.“They come to play in a different way than the other two teams against us and of course, it will be a tough one, a good test, another one for us at the Cottage with our fans and of course we have to play as best as we can to win the game.”"
    ]
}