{
    "articleURL": "/wires/reuters/article-12043523/Blinken-says-US-engaged-Syria-case-missing-American-journalist-Austin-Tice.html",
    "content": [
        "By Humeyra Pamuk and Daphne Psaledakis",
        "WASHINGTON, May 3 (Reuters) - The United States is extensively engaged on the case of a U.S. journalist who disappeared a decade ago, including with Syria and other countries, U.S. Secretary of State Antony Blinken said on Wednesday.Austin Tice, a former U.S. Marine and a freelance journalist, was kidnapped in August 2012 while reporting in Damascus on the uprising against Syrian President Bashar al-Assad. He was 31 at the time.His family believes he is alive and still being held in Syria. The identity of Tice's captors is not known, and there has been no claim of responsibility for his abduction.President Joe Biden last year said Washington knows \"with certainty\" that Tice has at times been held by the Syrian government. Syria's government has denied kidnapping or holding Tice.\"We´re extensively engaged with regard to Austin - engaged with Syria, engaged with third countries - seeking to find a way to get him home. And we´re not going to relent until we do,\" Blinken said in a Washington Post interview on Wednesday.The Wall Street Journal on Wednesday reported that the Biden administration has renewed direct talks with Syria over Tice's case and those of other Americans, citing Middle East officials familiar with the efforts.When asked about Tice, White House press secretary Karine Jean-Pierre said she could not confirm any meetings.",
        "Washington suspended its diplomatic presence in Syria in 2012 with the onset of the country's civil war.State Department deputy spokesperson Vedant Patel in a briefing said the United States has pursued every channel to seek Tice's release.\"We have pursued every channel we can to seek his safe return to his family and will continue to do so, and that includes discussing the case with a number of countries in the region,\" Patel told reporters. (Reporting by Humeyra Pamuk and Daphne Psaledakis; editing by Jonathan Oatis)"
    ]
}