{
    "articleURL": "/wires/ap/article-12043261/Expert-Trump-accuser-shows-signs-trauma-resilience.html",
    "content": [
        "NEW YORK (AP) - Donald Trump called a writer´s claims that he raped her at a Manhattan department store \"the most ridiculous, disgusting story,\" testifying in a deposition shown in court Wednesday that the allegations were \"made up\" and that the assault never happened.",
        "Lawyers for accuser E. Jean Carroll played about 30 minutes of excerpts from the former president´s deposition, including his emphatic denial of the longtime advice columnist´s accusation that he attacked her in the mid-1990s in a Bergdorf Goodman dressing room.\"If it did happen, it would have been reported within minutes,\" Trump said, contending that shoppers and employees at the \"very busy store\" would´ve heard a commotion and alerted authorities.\"It´s the most ridiculous, disgusting story. It´s just made up,\" Trump said in the video deposition taken in October.Several jurors leaned forward, watching without expression as the video played on individual monitors in front of their seats.In other developments Wednesday, Trump´s attorneys said they would not call any witnesses, and the judge said closing arguments would likely happen Monday before the jury begins deliberations on Tuesday.",
        "Trump has not attended the trial and will not testify, giving his deposition more weight. Asked about the case while traveling in Ireland on Wednesday, Trump told reporters: \"I hear we´re doing very well in New York.\"Jurors in federal court in Manhattan are expected to hear more of Trump´s deposition Thursday, followed by three more witnesses being called to the stand by Carroll´s lawyers.Carroll is seeking unspecified monetary damages and a retraction of Trump statements that she alleges were defamatory.",
        "Trump has denied ever knowing Carroll, saying once that \"she's not my type\" and arguing that her claims are politically motivated attempts to smear his reputation and deny him the White House.His deposition denials punctuated an emotional day in court that saw more allegations of inappropriate behavior with women and the playing of the infamous \"Access Hollywood\" video in which Trump bragged about grabbing women's genitals without asking permission.Natasha Stoynoff, a former writer for People magazine, testified through tears that Trump forcibly kissed her against her will while showing her around his Mar-a-Lago estate just after Christmas in 2005 for an article about his first wedding anniversary with his third wife, Melania.Before the trial, Trump's lawyers were unsuccessful in trying to block jurors from seeing the \"Access Hollywood\" video and hearing from Stoynoff, who said she told only a few people about the alleged incident at the time, but decided to go public after seeing the tape and Trump's subsequent denials at a 2016 debate.\"The horrifying part to me was that I worried, because I didn´t say anything at the time, other women were hurt by him so I had to regret,\" Stoynoff said.Stoynoff started to cry when asked about her trip to interview the Trumps in Palm Beach, Florida, reaching for tissues and pausing between questions to pat her eyes. Stoynoff testified that Trump drew her away from staff and a photography crew with a ruse of wanting to show her a \"really great room\" at the estate, before cornering her and kissing her.",
        "Stoynoff, a Canadian who adopted an old family name for her writing career, recalled the door shutting behind her and that Trump soon \"had his hands on my shoulders, pushed me against the wall and started kissing me.\" The encounter lasted several minutes, said Stoynoff, whose real name is Nancy Stevens.\"I tried to push him away,\" Stoynoff said, explaining how Trump came at her again and how she again tried shoving him away. She was \"so shocked and flustered\" she was unable to speak and didn't scream, she said.\"No words came out of me,\" Stoynoff told jurors.Trump showed no signs of stopping, but suddenly pulled away when a butler came into the room to report that Melania was ready for the next phase of the interview, Stoynoff said.As they walked to a patio area, Stoynoff said, Trump told her \"you know we're going to have an affair,\" and reminded her that his second wife, Marla Maples, had once bragged to a tabloid that sex with Trump was the best she ever had.Trump has denied that he ever tried to kiss Stoynoff. Trump's lawyer, Joseph Tacopina, suggested she had no relevance to Carroll's case and ended his cross-examination after asking her a single question: Was she involved in any litigation against Trump? She isn't.",
        "Stoynoff´s testimony came a day after another woman, former stockbroker Jessica Leeds, testified that Trump grabbed her breasts and tried to put his hand up her skirt when they were seated next to each other on a late-1970s airline flight.Carroll kept her claims against Trump secret for 17 years, telling just two close friends before going public with the allegations in a 2019 memoir. In the book, she described how a sometimes flirtatious chance encounter with Trump at the department store in spring 1996 ended with violence when Trump cornered her in a dressing room after they challenged each other to try on a piece of lingerie.Trump's lawyers attacked Carroll´s credibility through exhaustive cross-examination, questioning why she didn´t scream out for help during the alleged attack and why she never went to police.A psychologist testifying on Carroll´s behalf said Wednesday that it´s common for rape victims to fall silent and blame themselves.___On Twitter, follow Michael Sisak at https://twitter.com/mikesisak and Larry Neumeister at https://twitter.com/lneumeister. Send confidential tips by visiting https://www.ap.org/tips/."
    ]
}