{
    "articleURL": "/tvshowbiz/article-12044179/CHRISTOPHER-STEVENS-reviews-nights-TV-tailors-kitting-Kings-men-goats.html",
    "content": [
        "Coronation Tailors: Fit For A King ",
        "Rating:Location, Location, Location Rating:Why is a palace guardsman like a snooker table? They’re both covered in fabric from the same woollen mill.Savile Row tailor Patrick Grant toured the storeroom at Hainsworth, the Yorkshire manufacturer that supplies much of the material for ceremonial military uniforms, as well as billiards baize, in Coronation Tailors: Fit For A King (BBC2).Lifting one cover, he revealed a roll of rich crimson wool that will adorn the coronation platform or dais at Westminster Abbey.No one will be looking at the carpet, of course... unless it is less than perfect. Then, everyone will notice.The same is true for the Italian silk velvet of the state coat worn by the Drum Major of the Coldstream Guards, who marches at the front of the Coronation procession. The dense red fabric, soft but exceptionally tough, is completely covered by intricate gold frogging.",
        "‘You ain’t gonna see any of that,’ said master tailor Russell Kashket, stroking the material. ‘The ’ole bloody thing’s covered in gold.’Russell is the third generation of royal uniform makers, running the family firm in Tottenham established by his grandfather Alfred.Alfred was Tsar Nicholas II’s hat-maker until the Russian Revolution, before arriving in London as a refugee, and Kashket’s has made the royal ceremonial uniforms for the past hundred years — including those worn by the Beefeaters at the Tower of London, as well as the military finery for Princes William and Harry on their wedding days.",
        "Bridal dressmakers for royal weddings, such as David and Elizabeth Emanuel, are celebrities, but the Kashkets are happy to keep a lower profile. Russell’s son Nathan seemed particularly wary of the cameras.When presenter Patrick picked up a royal insignia, the initials C and R (for Charles Rex) entwined around the Roman numeral III, Nathan whipped it out of his hands. ‘What are you looking at, you nosy bugger?’ he said.The insignia supplies one of the Kashkets’ biggest challenges, since every Elizabethan ‘EIIR’ logo on all existing uniforms will have to be replaced. That’s in addition to the 4,000 brand-new uniforms that were yet to be made back in February, with ten weeks to go. ‘We could still be beheaded,’ Russell fretted.As he toured the machinists’ floor, Patrick drew our attention to some of the intricate detail and arcane tailoring techniques. His expertise made this one-off show a blend of Inside The Factory and The Great British Sewing Bee, where he’s a judge.Sewing Bee has yet to do military uniforms for pets, though Patrick’s cogs were whirring as he watched Seamus the wolfhound being measured for his tunic, as the mascot of the Irish Guards. Haute couture for animals would be worth a series on its own, and it wouldn’t have to be just dogs. ‘We do a lot of goats,’ Russell pointed out.",
        "There’s no need for novel ideas as Kirstie Allsopp and Phil Spencer return with the 39th series of Location, Location, Location (Ch4), which has been running since 2000. Why tweak a perfect formula?",
        "This time, bickering affectionately as they always do, the duo were home-hunting around Oxford, looking for a detached house for a couple beginning their relationship, and an apartment for a young academic.It’s slightly unnerving to see Kirsells (as Phil calls her) strolling around the varsity streets, in the shadow of the Bodleian library. We’re so used to seeing a murder beneath every dreaming spire.Thankfully, their endeavours attracted no serial killers, and the pair returned safely to their favourite outdoor office, the village pub garden, to close a deal. Chin-chin, you two."
    ]
}