{
    "articleURL": "/wires/reuters/article-12047655/Buffett-set-59th-shareholder-marathon-big-questions-loom.html",
    "content": [
        "By Jonathan Stempel",
        "OMAHA, Nebraska, May 4 (Reuters) - Warren Buffett is set to preside over Berkshire Hathaway Inc's annual meeting for the 59th time on Saturday as investors make their pilgrimage to hear the investing legend, at a time of turmoil for the banking industry and as trouble looms for the economy.Tens of thousands of people are flocking to Omaha, Nebraska this weekend for the extravaganza that Buffett, 92, calls \"Woodstock for Capitalists.\" Attendance is expected to be up significantly from last year, which was the first in-person meeting since the pandemic began, Buffett's assistant said.While Berkshire has a succession plan in place, with Vice Chairman Greg Abel slated to succeed Buffett as CEO, investors know that their time to see and hear Buffett and longtime Vice Chairman Charlie Munger is limited.\"Even though I've gone for 32 or 33 years, it's enjoyable, uplifting, and you're always learning something new,\" Paul Lountzis, who makes Berkshire his largest investment at Lountzis Asset Management LLC in Wyomissing, Pennsylvania.\"Charlie is 99 and Warren turns 93 on Aug. 30,\" Lountzis added, \"and you just don't know how many more you're going to have.\"Buffett and Munger are due to answer five hours of shareholder questions at the meeting. Abel, who oversees Berkshire's dozens of non-insurance businesses, and Vice Chairman Ajit Jain, who oversees insurance operations, will join in the morning.",
        "Berkshire has had a succession plan since at least 2006 when Buffett, then 75, told shareholders his board would \"show me the door\" if his \"decay\" required it.Under that plan, Buffett's eldest son Howard would become non-executive chairman, in part to preserve Berkshire's culture. Todd Combs and Ted Weschler, who oversee some of Berkshire's investment portfolio, may take over all of it.INVESTMENT QUESTIONS ARE LOOMINGBuffett may be asked to address recent U.S. bank seizures, Federal Reserve efforts to fend off inflation while avoiding recession, and the potential fallout if lawmakers in Washington do not raise the ceiling on how much debt the federal government can take on.Among Berkshire's largest bank and financial services investments as of Dec. 31 were Bank of America Corp, American Express Co, Citigroup Inc and Bank of New York Mellon Corp.Other questions may address Buffett's own huge investments in Apple Inc and Occidental Petroleum Corp, or his now-uncertain bet that video game maker Activision Blizzard Inc can be acquired by Microsoft Corp.While Berkshire no longer far outperforms markets over long periods as it did in Buffett's early days, in the past decade it has slightly outpaced the Standard &amp;amp; Poor's 500 including dividends, often with less volatility.And Berkshire has kept growing, with Buffett spending $19.7 billion since October to buy the Alleghany insurance company and a larger stake in truck stop operator Pilot Travel Centers.",
        "Analysts expect Berkshire on Saturday to report more than $7 billion of first-quarter profit from its dozens of businesses including the BNSF railroad, Geico car insurance and many energy, manufacturing and retail operations.Morningstar analyst Geoffrey Warren this week lauded Berkshire's \"decentralized business model, broad business diversification, high cash-generation capabilities and unmatched business strength,\" while lamenting its \"lack of engagement and opaqueness\" on governance issues.While it is unclear whether Abel could ever command the trust that investors have in Buffett, many hope he would maintain the culture that Buffett views as a key to Berkshire successes.\"It is precisely because Berkshire is decentralized and its businesses have their own CEOs that the company will do well in the post-Buffett era,\" said James Armstrong, who runs Henry H. Armstrong Associates in Pittsburgh and first invested in Berkshire 35 years ago.SIX PROPOSALS TO BE PRESENTEDStill, some shareholders do want change.At the meeting, shareholders are due to present six proposals for Berkshire to address including on climate change, diversity and political advocacy, and a renewed call for Berkshire to install someone other than Buffett as chairman.Buffett opposes all six proposals.The largest U.S. public pension fund, the $455 billion California Public Employees' Retirement System (CalPERS), for a third straight year wants Berkshire to report annually on how it addresses climate change. Just over a quarter of votes in 2021 and 2022 supported the idea.",
        "\"CalPERS views climate risk as a risk to our portfolio over the long term,\" and is not singling out Berkshire, Drew Hambly, a CalPERS investment director and head of corporate governance in equities, said in an interview.Meanwhile, a proposal from Illinois state Treasurer Michael Frerichs asks Berkshire's board to disclose how the company governs climate risks, including through its audit committee.\"We believe in constructive engagement and dialogue, whether it's Warren Buffett or another company,\" Frerichs said in an interview. \"By the nature of who he is, a lot of investors would follow his lead. We would like to see him lead.\"Buffett's control of 32% of Berkshire's voting power makes passage of the proposals an uphill battle.Not all shareholders consider such proposals necessary.\"They are important issues but they are not paramount,\" Lountzis said.(Reporting by Jonathan Stempel in Omaha, Nebraska; Editing by Will Dunham and Megan Davies)"
    ]
}