{
    "articleURL": "/news/article-12039653/Maryborough-Queensland-crash-Parents-accused-teenage-driver-heckled-court-appearance.html",
    "content": [
        "On Sunday a three-car crash killed three womenA Bundaberg teen, 13, is accused of causing the crashHis parents were yelled at following his court appearanceThe parents of a teenage driver accused of killing three women and critically injuring another were screamed at and called 'shameful idiots' when they arrived at their son's court appearance.",
        "A 13-year-old boy from Bundaberg, central Queensland, appeared at Maryborough Children's Court on Tuesday accused of causing the fatal three-car crash on Sunday night.A heckler waited outside the courthouse to confront the boy's parents as they walked along Wharf St in the town centre.'Idiots, idiots. Shameful parents,' the man yelled as the couple left the court, video shows. 'Three people are dead! Three people are dead because of your son! Idiots,' the man claimed.",
        "Police have charged the Bundaberg teen with three counts of dangerous operation of motor vehicle causing death and one count of unlawful use of a motor vehicle.It's alleged the Mercedes-Benz was stolen from a home on Dalhousie Street, 2.5km from the crash site, at 8.40pm on Sunday.CCTV footage showed two hooded figures taking the car.Police believe the car was then driven around Maryborough and Hervey Bay before it collided with a Holden travelling south on Saltwater Creek Road at about 10.45pm.The force of the crash then sent the Holden into a Mazda that was driving in the opposite direction. Former Riverside Christian College student Kelsie Davies, 17, and Reach Church pastor Michale Chandler, 29, were in the Holden and died during the crash.Kaylah Behrens, 23, was the third person travelling in the Holden and has been left severely injured. As of Tuesday morning, she remained in a critical condition. ",
        "Maryborough Hospital nurse Sheree Robertson, 52, was driving the Mazda home after her shift and was killed.A GoFundMe by Reach Church has raised more than $34,000 for the four women's families, including a $4,000 donation from another local church.The 13-year-old charged driver was treated for minor foot injuries following the horror crash before he was taken into custody at Maryborough watch house. Officers are investigating whether there was a passenger in the Mercedes who fled the scene. Anyone with information or footage of the car is urged to contact Crime Stoppers.Queensland Police Union president Ian Leavers used the crash to highlight why the legal age of criminal responsibility should not be raised to 14.Currently, Australian children aged between 10 and 14 are subject to criminal law so long as it can be proven they had the capacity to understand their actions.However, a 2020 report from the Standing Council of Attorneys-General found children under the age of 14 do not have this capacity so should not be punished under the same laws as though who do - meaning they are not criminally responsible. ",
        "Mr Leavers slammed the finding and said current measures, like curfews, are not effective against young offenders and 'penalise the ordinary child'.'These young people like this alleged 13-year-old, they are nothing but criminals. We need to target them, the courts need to hold them to account,' he said.",
        "'The courts have actually got to stand up when we lock these kids up.'Mr Leavers said he knows Maryborough and Hervey Bay well from his 30 years on the Queensland Police Force.'There is a core group of under a dozen young people who are causing mayhem and putting the community at risk,' he said.'They need to be incarcerated and put away because they cannot live by society's standards.'States across Australia want to raise the age of criminal responsibility to 14. That would mean this 13-year-old would not be held to account.'We cannot even put them before the courts.'",
        "Instead, Mr Leavers urged law enforcement to intervene early by holding children's parents accountable.'We need look at other programs and things that we can put in place at a very early age because when many of these kids get to 12 or 13, it's a learned behavior,' Mr Leavers said.They are recidivist offenders and we can't change that.'We need to look at the parents and caregivers.'"
    ]
}