{
    "articleURL": "/tvshowbiz/article-12038321/Love-Islands-Olivia-Hawkins-goes-braless-plunging-black-night-Tanya-Manhenga.html",
    "content": [
        "Olivia Hawkins went braless in a plunging black top as she enjoyed a night out with her Love Island co-star Tanya Manhenga over the weekend. ",
        "The ring girl, 27, dazzled in the tiny top, which exposed her very toned stomach and emphasised her assets. She added a cropped black blazer and tailored trousers for the monochrome and stylish look. Posting a series of sexy snaps from her weekend, Olivia wore her raven tresses loose for her evening out, and later slicked back her locks into a trendy half-up, half-down style.  She was joined by her co-star Tanya Manhenga, 23, who is dating Shaq Muhammad from the same series. ",
        "The pair sipped on some cocktails as they made the most of the Bank Holiday weekend and had a catch-up. But although Olivia and Tanya seem to be firm friends, the same cannot be said for Olivia's relationships with other cast members. The TV personality was reportedly embroiled in a feud with her former co-stars last Wednesday evening.The former ring girl was among the many reality stars who headed out to Zizzi restaurant in central London for musician Big Zuu's collaboration with the chain.But she is said to have steered clear of her former co-stars at the event, with The Sun reporting that winner Sanam Harrinanan was the only islander approached by Olivia.Sharing that she stayed far from nemesis Zara Deniz, an insider told the publication: 'She looked fuming she was even there to be honest. It was awkward.'",
        "While they added that she 'totally avoided' the star all night, explaining: 'Liv wouldn’t pose up for a photo with anyone apart from Sanam'. A number of stars headed out for the evening, including Sanam's boyfriend and fellow winner Kai Fagan, who also has a rocky past with former flame of Olivia.",
        "Strictly's Katya Jones was also in attendance, with Olivia heading out to the bash with her best pal Lavaud - with sources claiming that the singer was one of the few that Olivia interacted with. While they rose to prominence at the beginning of the year with their stint on Love Island, Olivia and Zara's relationship actually spans back further.The duo knew each other before heading into the villa due to working in similar circles, but are said not to have been close.But this didn't appear to bode well during the ITV2 dating show, as the two fiery stars often butted heads - including over mutual flame Tom Clare.Speaking on Olivia after leaving the villa, Zara previously said she felt 'lonely and isolated' in the villa amid her feud with the ring girl.She explained: 'We've all cleared the air now but obviously you're not going to get on with everyone.'I have nothing to say to Olivia anymore to be honest, we saw her at the last event and it's very much cold.",
        "'Everyone else I love, I've got good vibes with everyone else but I feel like she's been the recurring issue personally.'The reality star claimed no-one else really cared that she was upset and that the other girls only comforted Olivia.While she told The Sun last month: 'I've got good vibes with everyone else [on the show] but I feel like Olivia's been the recurring issue.' "
    ]
}