{
    "articleURL": "/tvshowbiz/article-12054971/EMILY-PRESCOTT-Princess-Wales-stunned-husband-pours-massive-pint-Dog-Duck.html",
    "content": [
        "She is always so poised and well-prepared when it comes to Royal engagements, but it seems the Princess of Wales is a stranger to one thing – the fact that a pint glass is a standard size.",
        "Emerging from the Dog And Duck pub in Soho on Thursday, where William pulled a pint of Kingmaker pale ale, Kate told wellwishers: ‘I asked for a cider and got a massive pint of cider.’ Meanwhile, it seems William was a little stressed by his wife’s leisurely walkabout pace and was overheard telling aides that she needed to ‘speed up’. It’s a good thing they didn’t organise the Coronation together!",
        "No wonder there wasn’t a speck of dust to be found inside Westminster Abbey. At one of the rehearsals last week, those practising their ceremonial roles had to wear blue overshoes – the sort you would normally find at the local lido – over their footwear. The King may be the first monarch to be fluent in Welsh since Elizabeth I, but TV presenter Gethin Jones reveals the late Queen also had a handle on the notoriously tricky language. Gethin, 45, tells me: ‘I met her and spoke Welsh to her and she replied in Welsh – it was very natural how she did it.’There was a strong Welsh tribute at yesterday’s ceremony – bass-baritone Sir Bryn Terfel sang a Welsh-language song with the Westminster Abbey choir, while Royal harpist Alis Huws – a role reinstated by the King during his tenure as Prince of Wales – is from Powys.",
        "Tom Pettifer, who was a page boy at the wedding of the Prince and Princess of Wales back in 2011, was determined to be part of the historic event – but had to make do with watching from a spot in The Mall in order to get a glimpse of the action.Tom, 20, who is the godson of Prince William and whose mother, Tiggy Legge-Bourke, was nanny to the two Princes, set up camp with friends and his Army father Charles yesterday – and was spotted enjoying a can of lager as he waited for events to start."
    ]
}