{
    "articleURL": "/news/article-12044055/King-Charles-tailor-warns-absence-VAT-free-shopping-scheme-causing-retailers-shun-Britain.html",
    "content": [
        "Household brands are among the names on a 150-strong letter to the ChancellorJeremy Hunt’s refusal to re-introduce the scheme described as an 'own goal'  The King’s tailor and the UK’s oldest family jeweller last night warned that the controversial tourist tax is discouraging investment in the UK.",
        "Business leaders said the absence of a VAT-free shopping scheme for holidaymakers was not only deterring shoppers from spending money but influencing retailers to shun the UK too.Household brands including Burberry and Harrods are among names on a 150-strong letter to Chancellor Jeremy Hunt, organised by hotelier Sir Rocco Forte, arguing the move is an own goal for Britain.The Mail’s Scrap The Tourist Tax campaign – urging the Government to bring back tax-free shopping – has also been backed by MPs from across the parties.Anda Rowland, who heads the Royal suitmaker Anderson &amp; Sheppard in Savile Row, said the tax was one of several challenges for European businesses setting up shop in the UK and she would ‘certainly think twice’ about coming to London if in their shoes.",
        "She described Chancellor Jeremy Hunt’s refusal to re-introduce the scheme, ditched after Brexit, as an ‘own goal’ that could drive businesses, as well as wealthy shoppers, to Paris and Milan.Last week, footfall in the West End – including in Oxford St and Bond St – was down 23 per cent compared to the same week in 2019. Dee Corsi, boss of the New West End Company, which shared the figures, said a Covid recovery was being held back by the tax.",
        "Although international visitors were slowly returning to London, they were hesitant to go on shopping sprees to the same extent, she said, adding: ‘The harmful impact of this tourist tax is being amplified as international visitors return in greater numbers.’ Peggy Porschen said she would consider expanding her cake cafe business in countries other than Britain.She said she ‘always imagined strengthening our foothold here’ but there were ‘too many challenges to further entertain this plan’, including a dramatic drop in both European and Asian customers since the tax was scrapped.And Henry Deakin, who runs Britain’s oldest family jeweller Deakin &amp; Francis, told The Mail: ‘If I was a tourist, doing a world-wide tour, I’d hold back’ on splurging in the UK.",
        "He said he would ‘100 per cent’ consider opening a store in Paris over London. ‘I certainly wouldn’t want to lose my Mayfair store, but I wouldn’t think about opening a second UK one.’Their remarks come as John Dickie, chief executive of industry group BusinessLDN, writes in today’s Mail that the Coronation will be a missed opportunity because tourists will be deterred from spending by the VAT levy.The Treasury claims that reinstating tax-free shopping would cost the nation £2billion a year, but research suggests there would be a net annual gain of around £350million because of the knock-on benefits.",
        "Coronation is missed chance to make most of visitor boomBy John Dickie  ANALYSIS This weekend the UK will host a spectacle that will be watched by millions across the globe – the King’s Coronation. It is the first time in 70 years that people have had the chance to see history being made in the capital.That’s why visitors from the UK and beyond will descend on London to soak up the atmosphere.The Coronation will provide a much-needed boost for London’s leisure, hospitality and retail businesses badly hit by the pandemic. However, despite the scale of the occasion, we are not doing everything we should to attract high-spending visitors to this event or to maximise the capital’s attractiveness to overseas tourism, which, in turn, will support jobs and growth.In 2019, according to Visit Britain, tourism in England contributed £106billion to the British economy and supported 2.6million jobs.",
        "After Brexit, the Government inexplicably decided to stop overseas visitors from being able to reclaim VAT on goods purchased here and then taken home. This puts us at an enormous disadvantage to the EU.American, Chinese, Indian and other visitors to continental European countries can claim back VAT when they leave. As can we Brits. But no visitors to the UK can.We are seriously losing out as a result. Figures from Global Blue show that 10 per cent of UK spending by international shoppers in 2019 has now moved to EU countries, which have kept VAT-free shopping.",
        "We are also lagging behind other European cities in attracting visitors from key markets. For example, spending by American shoppers in the UK is now back at 2019 levels, a welcome recovery from the dark days of the pandemic. But our figure lags starkly behind France, Spain and Italy, which have virtually doubled their American spending. This is an issue that matters for the whole of the UK’s flatlining economy.A week after the Coronation, Liverpool will host the music industry’s biggest night – the Eurovision Song Contest. The event is predicted to be worth around £25million to the regional economy.Events like this in the UK would attract even more international visitors that would help turbocharge our economy if we brought back VAT-free shopping. By doing so, it would strongly support growth, generate £4.1billion gross added value annually, and create 78,000 jobs, according to Oxford Economics.Re-introducing the scheme would boost spending from visitors and more than compensate for the short-term loss of VAT receipts – delivering an extra £350million in tax revenues for the Exchequer every year. This would ultimately be a win-win for business, the economy and the country.Britain is competing in the global race for tourism with our shoelaces tied together.We must act now to restore VAT-free shopping so, for example, we are an attractive hop across the Channel for visitors to the Olympics in Paris next summer.",
        "The Government missed a trick by failing to seize the opportunity to bring back VAT-free shopping for international visitors ahead of the Coronation. We need to act now to show the world that Britain is open for business.John Dickie is the chief executive of BusinessLDN"
    ]
}