{
    "articleURL": "/wires/afp/article-12059999/Southern-African-troops-deploy-against-rebels-east-DRCongo.html",
    "content": [
        "Southern African countries on Monday agreed to deploy forces to help quell violence in the eastern Democratic Republic of Congo, where armed groups have terrorised civilians for decades.",
        "A special summit of the 16-bloc Southern African Development Community, which includes South Africa, Angola and Tanzania, backed the deployment \"to restore peace and security in eastern DRC\", SADC said in a statement from the Namibian capital Windhoek.The decision was reached at talks attended by several heads of states, including DRC's Felix Tshisekedi, his South African counterpart Cyril Ramaphosa, Tanzania's Samia Suluhu Hassan and ministers from the regional group.The meeting did not give the numbers of troops to be deployed nor a timeline for the deployment.Armed groups have plagued much of mineral-rich eastern DRC for three decades, a legacy of regional wars that flared in the 1990s and 2000s.One militia, the M23, has captured swathes of territory in North Kivu since taking up arms in late 2021 after years of dormancy.The rebel campaign has displaced over one million people, according to the UN Office for the Coordination of Humanitarian Affairs.Some troops from three SADC countries -- South Africa, Tanzania and Malawi -- have already been operating in eastern DRC since 2013 under the umbrella of the major a UN peacekeeping force MONUSCO.\"South Africa stands ready to contribute to the development of effective regional instruments that could assist to stabilise the current security situation prevailing in the eastern DRC,\" president Ramaphosa said in a statement.",
        "- 'Immediate collective action' -The deployment will also add to an East African regional military force that has taken over some areas previously occupied by the M23 since December but has so far failed to thwart the insurgency.The East African Community (EAC) force draws on troops from Burundi, Kenya, Uganda and South Sudan.There is a need for SADC to work together with the East African Community and other (regional groups) in order to better coordinate our efforts in support of government and people of the DRC,\" Namibian President Hage Geingob told the summit.SADC executive secretary Elias Magosi said: \"We are regrettably noticing a very disturbing security situation in eastern DRC with the deterioration of the humanitarian situation due to the resurgence of the M23 rebellion and illegally armed groups.\"Acts of violence intensified over the past year undermining the DRC´s \"sovereignty and integrity\" as well as development prospects, as the country prepares for national elections in December, Magosi added.\"This calls for immediate collective action in support of the DRC to restore peace and security.\"Tshisekedi is scheduled to visit Botswana, which houses the headquarters of SADC, for four days from Tuesday.The DRC accuses its smaller central African neighbour Rwanda of backing the M23, something Rwanda has repeatedly denied.",
        "But US and French officials, as well as United Nations experts, agree with the assessment.UN Secretary-General Antonio Guterres on Saturday urged African leaders to redouble efforts to bring peace to conflict-wracked region.Guterres addressed a meeting in Burundi of African nations that signed the 2013 accord to promote stability and security in DRC.However, \"Despite our collective efforts, more than 100 armed groups -- Congolese and foreign -- still operate today and thus threaten the stability of the entire Great Lakes region.\"It is time for the violence to stop. I reiterate my call to all armed groups -- lay down your arms, immediately,\" Guterres said."
    ]
}