{
    "articleURL": "/tvshowbiz/article-12059175/Katie-Holmes-44-channels-Dawsons-Creek-days-Nineties-inspired-slip-dress.html",
    "content": [
        "She soared to fame in the Nineties playing Joey Potter in Dawson's Creek. ",
        "And while Katie Holmes has since enjoyed huge success up to the present day - as well as achieving style icon status, she was throwing it back to the Nineties as she stepped out with a palfor dinner on Sunday. The actress, 44, looked sensational in a slip dress layered over a tee - a beloved look of the era - paired with a pair of slip on, low-heel mules. She scraped her brunette tresses into a messy bun and showed off her glowing skin by going make-up free for the outing and accessorising with small hoops. Her new exploration into style of days gone by comes after Katie set tongues wagging around the world with a questionable look earlier this year. ",
        "She came under fire from fashion critics after sporting a noughties-inspired ensemble to the Madison Square Garden Jingle Ball Red Carpet in December.After the event, she spoke out over the outfit choice, which included a satin blue dress and jeans, sharing that women should look past what they are wearing.She discussed the style mishap during a recent interview with Glamour magazine, describing the backlash as 'powerful language'.She also touched on image and role stereotypes in the industry, sharing that she has never had any desire to 'be the sexy young thing'.",
        "'I didn't want to be the sexy young thing. I am not sexy,' declared Katie.",
        "As she was probed on not falling into the casting stereotypes of being a young woman in Hollywood, Katie revealed that she ensured that she wasn't portrayed in a sexualised way. 'I used to have a friend of mine come to all my photo shoots to make sure that they didn't try to make me that way. Yeah, I guess I just wanted to be an actor,' she explained.The actress also touched on her recent fashion backlash, which saw her hitting headlines following an appearance at the Jingle Ball in December.Katie sported a Y2K inspired navy blue minidress over a pair of jeans to the event, teamed with trainers.",
        "Breaking the internet with the viral ensemble, many declared that the satin dress was an interesting mix with the jeans.Her stylist previously spoke out to defend the look, saying: 'We decided the rich color and subtle bustier effect detailing of the top was elegant and would be fun if paired with jeans'.But less keen to discuss the look is Katie, who has kept fairly quiet on the look and still appears reluctant to go over it.'That’s powerful language,' she says after hearing many claims surrounding her ensemble, before telling women to 'hold each other up' rather than discuss more."
    ]
}