{
    "articleURL": "/sport/football/article-12043431/Micah-Richards-says-Manchester-City-NOT-win-treble-season.html",
    "content": [
        "Former Manchester City defender said he did not think they would win trebleMicah Richards admitted to being worried about the forthcoming semi-final City are favourites to retain their league crown after beating Arsenal last weekFormer Manchester City defender Micah Richards has said he does not expect his former side to win the treble this season, despite growing feeling that Pep Guardiola's side are well placed for a truly historic campaign.",
        "City beat Arsenal at the Etihad last week to overhaul their rivals at the top of the Premier League table, just days after beating Sheffield United to reach June's FA Cup final.Meanwhile, such was their comprehensive beating of Bayern Munich in the quarter-finals of the Champions League to set up a repeat of last year's semi-final with Real Madrid, many have pre-emptively anointed them winners of that particular competition.Bookmakers in recent weeks have heavily cut odds for City to win the treble and become only the second English side ever to achieve the feat.However, Mail Sport columnist Richards, appearing on YouTube channel Filthy Fellas, said he did not expect City to do the treble - but stopped short of revealing which competition he thought they would fall short in.",
        "'I don't think they're going to do the treble,' he said. I am worried about that game [vs Real Madrid]. 'I'm worried. I'm worried, man. I'm worried. I've got to be honest - I am worried about them, I wrote off Real Madrid last season.'In the right moments, they know how to get it done. The only thing is now, the second leg is at the Etihad, it's not at the Bernabeu. That could be the difference.'City's match up with Real Madrid carries particular intrigue after last season's semi-final.",
        "Leading 5-3 on aggregate with the seconds ticking down and seemingly bound for a second consecutive Champions League final appearance, City were hit by two Rodrygo goals within seconds of each other to leave them utterly shell-shocked.Extra-time came, with Karim Benzema settling the tie with a penalty. It marked the third time in the competition that season alone Real Madrid had appeared to come back from the dead.Regarding Real Madrid's ability to never let the game die, a key facet of their success over the past decade or so, Richards said they picked the 'right moments', though he did not think Guardiola would allow the same to happen again this time out.Put to him that City 'battered' the Spanish giants last season and deserved to go through, he hit back arguing so did Paris Saint-Germain and Chelsea, the two sides they had knocked out in the rounds prior. 'Yeah, but so did PSG, so did Chelsea - it was at the right moments,' he said. 'I don't think so (Guardiola allowing lightning to strike twice].",
        "'The double, the double [City will win],' he said. 'I don't think the treble.'With City having taken command of the title race, however, they do look set to win the Premier League - albeit with the other two trophies appearing much more of a lottery owing to the nature of the competition.",
        "Richards, who grew up an Arsenal supporter but came through the ranks at City and went on to win the Premier League with them in 2011-12, said they had just hit their stride at the opportune time, describing them as in the 'form of their lives'.'It's tough to call you know,' he said when asked who would win the English top flight. 'But the thing is, Man City are in the form of their lives - they have come with the best form at the right part, at the end of the season.'"
    ]
}