{
    "articleURL": "/news/article-12053735/New-Caledonia-beach-Australian-father-Chris-Davis-mauled-death-shark-closed-year.html",
    "content": [
        "Beaches in Noumea to close for a yearChris Davis, 55, attacked by tiger sharkTourists can only swim in one netted area",
        "A popular beach where a beloved Aussie father was mauled to death by a shark will be closed for a year as will other nearby swimming spots following a spate of recent attacks. ",
        "Chris Davis, 55, died from horror injuries after being bitten by a four-metre tiger shark while swimming at Château-Royal beach in the New Caledonian capital of Noumea on February 19.The triathlete and father-of-three was swimming just 150m from shore when the predator severed his femoral artery in a single bite.The horrific attack was the third in months, with a 49-year-old woman mauled by a bull shark while swimming at the beach just weeks before. In response to the series of attacks, the Noumea City Council has banned swimming at the capital's tropical beaches until November 30, 2023. Tourists can only swim 20m from the shore in one supervised area at Lemon Bay in Baie des Citrons between 8.45am and 4pm. ",
        "The ban will remain until the council installs shark nets at the beaches, with swimming allowed in bays outside the council area.Australian government service Smartraveller has issued a warning to tourists, which originally warned beaches would be closed in December, rather than November 30. 'Beaches in Noumea will remain closed until 31 December 2023 following a ban by local authorities on swimming along the city's entire 300m coastal zone,' it said. 'This follows three shark attacks in early 2023, one of which was fatal.'Australians have taken to social media to complain about the ban. ",
        "'Hey New Caledonia I thought I should point out that due to the stupid council decision to ban all beach swimming in Noumea, we have been forced to cancel our bookings,' one wrote on Facebook. 'We used to love heading to the Hilton Noumea La Promenade and local restaurants.'But that's it for us. Those bookings are cancelled and we're done. Au revoir.'",
        "Others were concerned about the danger shark nets can bring to other wildlife.'So all the turtles that I swam with at Duck Island are now going to be caught up in nets... f****** ridiculous,' one said. 'It's funny to read this info... looking at the stats, the area has had 13 shark attacks since the 1990s and Australia has had 365 or so... we are still swimming in our beaches,' a third commented. Mr Davis had been on holiday in New Caledonia when he was attacked by a tiger shark, with eye witnesses saying the attack lasted no more than 10 seconds.Jet-skiers plucked him from the water and returned him to the sand where paramedics performed CPR for 40 minutes but could not revive him. It was the third shark attack in the bay in recent months, after a local teacher lost her leg on January 29 and a foil surfer was attacked but escaped unharmed a week later.",
        "A map of shark attacks in New Caledonia and surrounding islands over the 60 years shows attacks have happened regularly at tourist beaches around Noumea. The island has recorded an average of one shark attack a year since 1958. Local authorities removed tiger and bull sharks from its protected species list in 2021 as part of a wider mission to reduce attacks.  There has been local speculation that the shark was drawn to the beach by food scraps discarded into the water from a nearby restaurant's viewing platform. Local posters warn people not to throw food or fish less than 500m from the shore."
    ]
}