{
    "articleURL": "/wires/ap/article-12043883/Vikings-finale-Cousins-expiring-deal-not-going-there.html",
    "content": [
        "EAGAN, Minn. (AP) - The absence of a contract extension for Kirk Cousins in Minnesota could well spell the end of his time as quarterback of the Vikings, who have won only one game in the NFL playoffs since their groundbreaking signing five years ago.",
        "Despite the depth of his desire to finish his career with Minnesota, Cousins would be about the last player in the league to feel defeated or slighted. Betting on himself, after all, has been the story of his entire football career.Assuming there's no new deal done in the meantime, Cousins will for the fourth time as a pro play the season on an expiring contract. That's a rare scenario for an established starter at this premium position around which every NFL team revolves its roster construction and, thus, salary cap strategy.\"In this league, there should never be entitlement,\" Cousins said. \"You've always got to go play, and teams can do whatever they want to do. That´s their prerogative.\"Speaking to reporters on Wednesday after the team's voluntary workout, his first public comments since the Vikings lost in the first round of the playoffs in January, Cousins sounded as confident, determined and relaxed as ever.\"I do think I have a lot of good football ahead of me, so I´ve got to go out there and earn that. I feel positive about the future looking forward,\" said Cousins, who agreed in March to change bonus language in his existing deal that saved the Vikings $16 million in cap charges for this year.",
        "Harkening back to his time at Holland Christian High School in Michigan, Cousins recalled answering questions from the hometown newspaper about his lack of college scholarship offers. After developing into a Big Ten standout at Michigan State, he was a fourth-round draft pick by Washington in 2012.He became the full-time starter in 2015, the final season of his rookie contract. Then he played 2016 and 2017 on one-year - albeit expensive - deals after the team put the franchise tag on him. Finally, Cousins hit free agency in 2018 and got an $84 million, fully guaranteed contract from the Vikings. They've extended him twice since then, but a third remains to be seen.So as Cousins approaches his age-35 season, he's in prove-it mode yet again.\"It´s more the norm than the exception. I think the exception is that you have something penciled in for future years. Most of our locker room has no idea what´s coming in three or fourth months, let alone three or four years, or next year,\" Cousins said. \"So I feel like I´m one of the guys, if you will, like we´re all in this together.\"Cousins is the perfect example of quarterback value in the NFL. He's in his 12th year, with career earnings from salaries and bonuses that will pass $231 million by the end of the season, yet the commitments from the Commanders and the Vikings have been merely temporary and tentative.",
        "\"I think it´s part of what makes this league great, because everybody has an edge, everybody´s working, everybody´s got something to prove,\" Cousins said.The Vikings didn't bring in anybody to challenge him, re-signing backup Nick Mullens and drafting a developmental quarterback in the fifth round: BYU's Jaren Hall. If Cousins thrives this year and the Vikings do, too, they could well get a new deal done before he hits the open market again. Still, the possibility of this being his last year in purple is real.\"I don´t think you go there. I just think it´s healthiest to be present,\" Cousins said.That means taking advantage of the knowledge base from his first season in head coach Kevin O'Connell's system and using it to create more momentum over the spring and summer entering 2023.\"It´s nothing to make you think, `Oh, we can just show up, second year, it´ll click.´ I think it´s important to still have an edge in your work,\" Cousins said. \"But you can also take some encouragement in the fact that time on task together is good. Having somebody in my helmet for the second year in a row I´m really encouraged by, because there had always been that change.\"___AP NFL: https://apnews.com/hub/NFL and https://twitter.com/AP_NFL"
    ]
}