{
    "articleURL": "/wires/aap/article-12048683/Enough-PM-calls-Assange-release.html",
    "content": [
        "Bipartisan backing for the release of WikiLeaks founder Julian Assange has buoyed supporters' hopes the Australian's prison stint will end, as the prime minister declares \"enough is enough\".",
        "In his strongest comments on the case since his election win, Anthony Albanese said there was no benefit to the 51-year-old's ongoing detention in the UK.His position was backed by Opposition Leader Peter Dutton, who said he was concerned for the Australian's fate and the case had gone on for too long.Greg Barnes, a barrister and advisor to the Australian Assange campaign, said the leaders' comments were significant and represented a united front.He urged both political leaders to raise the issue of Assange's imprisonment with US President Joe Biden during his visit to Australia later this month.\"(Their comments) send a strong signal to Washington that Australian politicians are united on this issue.\"They are the strongest we've seen from the prime minister expressing frustration ... and the Dutton comments are the strongest comments a coalition leader has made in relation to the case since the very early days.\"Mr Albanese, who is in the UK for the King's coronation, would not say whether he planned to raise the issue with Mr Biden.Assange has been in prison in the UK for more than four years and is fighting extradition to the US to face espionage charges.\"My position is that enough is enough. And I continue to say in private what I have said publicly ... that enough is enough,\" Mr Albanese said on Thursday, UK time.",
        "\"I can't do more than make very clear what my position is and the US administration is certainly very aware of what the Australian government's position is.\"Mr Albanese said Assange's case needed to be looked at in the context of the time the WikiLeaks founder had already spent in custody, comparing his treatment to that of Chelsea Manning.The former US Army soldier was released in 2017 after disclosing hundreds of thousands of sensitive documents to WikiLeaks.\"When Australians look at the circumstances, look at the fact that a person who released the information is walking freely now having served some time in incarceration ... then they will see a disconnect there,\" Mr Albanese said.\"There is nothing to be served by his ongoing incarceration and I am concerned about Mr Assange's mental health.\"Mr Dutton said he agreed with the prime minister that the case needed to be dealt with and had been drawn out for too long.\"Of course I'm concerned for him at an individual level. I think it's gone on for too long and I think that's the fault of many people - including Mr Assange, to be honest,\" he said.\"The matters have to be dealt with. If the prime minister's charting a course through to an outcome, then that is a good thing.\"",
        "Mr Barnes said he hoped the prime minister would also discuss Assange's case with UK Prime Minister Rishi Sunak during a bilateral meeting in London on Friday.\"The UK is the nation which has to approve any extradition request and certainly (the prime minister) ought to be urging Rishi Sunak and his government to withdraw the approval for that request,\" he said.\"The case has gone on far too long and no public interest is served.\"Assange has appealed to the UK High Court and the European Court of Human Rights to block his extradition.In 2021, a British judge ruled the Australian should not be extradited to the US due to concerns for his mental health, but the decision was overturned on appeal."
    ]
}