{
    "articleURL": "/wires/pa/article-12041079/Labour-principles-not-changed-says-Reeves-tuition-fees-U-turn.html",
    "content": [
        "Shadow chancellor Rachel Reeves insisted Labour’s principles have not changed as she defended her party leader’s U-turn on his commitment to abolish tuition fees.",
        "The shadow cabinet minister was forced to answer questions about Sir Keir Starmer’s commitment to the pledges, which formed part of his bid to become Labour leader, after the promise to ditch tuition fees became the latest pledge to be dropped by the party.The move has been criticised by those on Labour’s left, while some Conservative opponents branded the party leader “Sir Flip-Flop”. The next election is probably a year, maybe more, away. We will set out our policies in good time ahead of that election  Shadow chancellor Rachel Reeves  Ms Reeves blamed the Government’s handling of the economy for the policy shift.“The Tories have crashed the economy, they have brought public services to their knees and that does mean that we need to look again at what we can afford and what our priorities will be if we have the privilege to form the next government,” she told ITV’s Good Morning Britain.She said the circumstances since Sir Keir became leader have “changed significantly”, forcing the change to pledges announced when he ran for the party leadership.",
        "But she added: “We have got work going on on a whole range of areas, including student finances.“The next election is probably a year, maybe more, away. We will set out our policies in good time ahead of that election.”",
        "Labour is expected to spell out in the coming weeks its new tuition fee policy after Sir Keir branded the current system “unfair”. I don’t think anybody would seriously say that the circumstances when Keir became leader of the Labour Party are the same as the circumstances that we face today  Shadow chancellor Rachel Reeves  Tuition fees sit at a maximum of £9,250, with the current system introduced by the Conservative and Liberal Democrat coalition in the face of severe opposition from students.Ms Reeves said “principles don’t change but the priorities and the policies must change according to the circumstances”.Sir Keir, she said, is a “pragmatic sort of guy”.“I don’t think anybody would seriously say that the circumstances when Keir became leader of the Labour Party are the same as the circumstances that we face today, when we’ve had the global pandemic, the war in Ukraine, the Conservatives’ mini-budget last year that crashed the economy, a massive cost-of-living crisis and public services on their knees.“His vision, his mission as prime minister, remains the same and his values remain the same,” she added.Sir Keir’s spokesman on Wednesday vowed that none of Labour’s manifesto commitments at the next general election will be dropped.“What we will set out in our manifesto at the next election is the programme that we will deliver in government if we’re lucky enough to be elected,” he told reporters in Westminster.",
        "“There are clearly circumstances that have changed that it would be daft for any politician not to be grounded in the reality of the situation that we are in now…“The promises that we make will be determined by the economic reality of the situation that we find ourselves in.”Students in England are split on what Labour should do about tuition fees, a poll of more than 1,000 full-time UK undergraduate students in April suggests.Some 28% of students living in England want Labour to commit to abolishing tuition fees in England, 23% want the party to reduce fees to £6,000 and 20% want Labour to back the current system of fees capped at £9,250, the Higher Education Policy Institute survey carried out by Savanta found."
    ]
}