{
    "articleURL": "/news/article-12058101/Scott-Baio-leaving-California-selling-3-85M-mansion-rising-homelessness-crime.html",
    "content": [
        "Baio is placing his $3.85million home in Woodland Hills on the marketHe said that rising crime and homelessness have led to him fleeing the stateThe star added on Twitter that California is 'just not a safe place anymore' Scott Baio says he's set to become the latest celebrity to escape from California as he's placed his $3.85million home on the market, citing the state's disastrous homelessness and crime issues.",
        "The former Happy Days star put his home in Woodland Hills, LA, on the market last month, having purchased it for just $1.85million in 2010.On Twitter, the conservative-leaning sitcom star said that he just doesn't feel secure in the Golden State anymore given the various issues under Democrat Governor Gavin Newsom.'After 45 years, I'm making my way to finally 'exit stage right' from California,' he wrote.He then cited the state's homelessness statistics, noting that 'it brings down property value. Also no consequences for crime that is rampant, making things higher in price and it’s just not a safe place anymore.' ",
        "The Joanie Loves Chachi star tacked on the hashtag '#ImFree.\"  Baio also joked that Californians won't miss his right wing views. The actor has been a guest of President Trump's White House in the past. The actor lives in a gated community called Westchester County Estates, according to Realtor.com. A 6,300-square foot property containing five bedrooms and 4.5 baths, it also contains a big ceiling, stone floors, a curved staircase, a great room, dining room and home office.The outside includes a pool, spa, and loads of plantings and a no-build zone behind it.Los Angeles' wealthiest residents are fleeing the city as Governor Gavin Newsom hikes taxes on the rich and the city crumbles under soaring crime rates - with actor Jim Carrey the latest A-lister to list his home for sale. ",
        "Carey, 61, who purchased his Brentwood mansion for $3.8 million in 1994, listed his home for a whopping $28.9 million after announcing his plan to retire from acting.In a statement to the Wall Street Journal, Carey said he no longer spends much time at the property and was ready for 'Cha cha cha cha ... changes,' referencing the David Bowie hit.It's unclear whether Carrey will remain in Los Angeles but, with several other icons of entertainment departing, will there anyone who wants to enjoy it? ",
        "According to the LA Times, the state of California has lost over 500,000 residents between 2020 and 2022. It's the fourth largest decrease in the country in that time, behind New York, Illinois and Louisiana.Not only are California lawmakers pushing legislation that would impose a new tax on the state's wealthiest residents, there's also a rising crime and homeless problem which has led these celebs to flee.Actor Mark Wahlberg has sold his longtime home in Los Angeles for just over $55million, more than $30 million below the initial asking price, as he leaves in favor of Nevada in a quest to eventually build 'Hollywood 2.0' in Sin City.With these celebrities all packing it in and heading for greener pastures, even more could flee with progressive Democrat assemblyman Alex Lee recently introducing a bill that would impose an extra annual 1.5 percent tax on residents - past and present - with a worldwide net worth above $1 billion, beginning in January 2024. ",
        "As early as 2026, the threshold for being taxed would decrease. Those with a worldwide net worth exceeding $50 million would have to pay a 1 percent annual tax on wealth, while billionaires would still be taxed 1.5 percent.Worldwide wealth includes diverse holdings such as farm assets, arts and other collectibles, as well as stocks and hedge fund interest. California already taxes the wealthy more than most states, with the top one percent of earners accounting for about half of the state's income tax collections.According to Forbes' 2022 World's Billionaires list, there are 186 billionaires living in California, down from 189 the year before, but far more than any other state. ",
        "In 2020, California had the greatest number of millionaire households in the US, with 1.14 million households having one million or more in investible assets. While some are fleeing Los Angeles for the rise in taxes, others are worried that the homelessness, poverty and crime are on the rise as well. According to SafeWise, the Golden State 'saw 4.4 violent crime incidents per 1,000 people - exceeding the national rate of 4.0.' Homelessness, and especially homelessness with the added facet of severe drug addiction, presents a significant issue for many major metropolitan areas in the US right now.",
        "Especially in Los Angeles and San Francisco, where the drug-addled homeless populations have all-but overtaken entire areas of the cities, making it hard for people to run businesses and parents to feel comfortable with their children walking to school.Late last year, members of the Los Angeles City Council voted  to stop homeless people from setting up their tents within 500 feet of schools in the city.LA, like the rest of California, is struggling to come to grips with its homelessness problem.Between 2010 and 2020, the state saw a 31 per cent rise in homelessness while the rest of the country experienced a drop of 18 per cent.An estimated 40,000 people are homeless in the city, which has a population of nearly 4 million people. "
    ]
}