{
    "articleURL": "/sport/formulaone/article-12058067/Oscar-Piastri-met-Vin-Diesel-Miami-F1-Grand-Prix-heres-rest-race-disaster.html",
    "content": [
        "Diesel was in Miami to promote Fast X Thought Piastri's helmet colours were hilarious McLaren's results were the real joke McLaren's Oscar Piastri may have met Hollywood star Vin Diesel at the Miami GP, but the rest of his weekend was a non-stop disappointment as the Aussie slumped to second last after a brake pedal issue and tyre-gamble backfire. ",
        "Diesel was at the F1 track to promote the upcoming release of Fast X along with fellow star Michelle Rodriguez and he paid a visit to the McLaren garage before racing commenced.While Rodriguez, who plays the character of 'Letty' in the Fast and Furious franchise, enjoyed a hot lap with Piastri's teammate Lando Norris, Diesel was more intrigued by the vibrant colour choices on the Aussie's helmet.McLaren's Instagram video features the Hollywood star asking Piastri whether he picks the colours himself, and erupting in laughter when the Aussie said yes.'You're kidding me!' he exclaimed. 'Nothing, it's amazing. This isn't fair. Come on, you can't ask him to pick the colours too. Did you build this place?'",
        "While Piastri hoped the brush with fame would help deliver a much-needed boost to his debut Formula 1 season, his car had other ideas.The issues began in qualifying with the Aussie sinking to 19th place. McLaren took a gamble on a different tyre strategy, putting Piastri on the soft compound to pick up positions early in the race. Unfortunately, the decision backfired, and Piastri's tires began to degrade after only a few laps.Things went from bad to worse when the Aussie's brake pedal started malfunctioning, causing his pace to drop significantly. Despite a valiant effort, he finished second last, only ahead of Williams' Logan Sargeant.",
        "'I had a lot of issues on the car in the race. We had a failure six or seven laps in on the brake-by-wire system,' Piastri said.'I was managing a lot of issues after that. I had a really good lap one, where I managed to pass five cars and that was the highlight of the weekend. 'Otherwise, a frustrating afternoon, trying to drive around all of the issues. We'll now get our heads down and focus on having a better weekend in Imola.' McLaren teammate Lando Norris also struggled, finishing in 17th place. Team principal Andrea Stella took to social media to try and explain the failed strategy that saw both drivers sink to the bottom of the placings. 'Given our grid positions, we needed a good start, an eventful race and high tyre degradation in order to climb into the points,' he said.'Unfortunately, none of these conditions materialised and the race was a bit of a procession at the back for us. 'Oscar had a race-long brake-by-wire problem and did an incredible job to cope with that through a minimising the consequences and keeping decent pace. 'Our main takeaway from Miami is that we were not quick enough this weekend. After scoring points in Baku, this weekend serves as a reality check on how much work we have ahead of us.'",
        " Frustrated McLaren fans took to social media to vent their frustration.'Some big changes need to be made, and soon,' one posted.'Great to see Lando doing so well now he has gotten rid of DR [Daniel Ricciardo]. Maybe next season he can drive both cars and change his own tyres.' added another.'Tough as a driver to face up to this every week by no fault of their own. The team needs a complete overhaul,' posted another.  Piastri has had a rocky start to his debut season, with only one points finish so far. McLaren will be hoping to turn things around at the next race in Imola on May 21 as they try to climb up the Constructors' Championship standings."
    ]
}