{
    "articleURL": "/wires/aap/article-12047841/Interest-bill-government-debt-soars-18b.html",
    "content": [
        "The federal budget is on track for a short-lived boost but the treasurer stresses the good times will not last.",
        "The Albanese government is anticipating a notable improvement in the near term, largely due to high commodity prices, but spending pressures will intensify in the medium term.Treasurer Jim Chalmers revealed the interest bill on federal government debt was expected to be about $110 billion across the next five years - or $700 a second.He said paying back interest and the National Disability Insurance Scheme were the two fastest areas of expense, with health, aged care and defence rounding out the \"big five\".While forecasts for interest payments have improved, this year alone the Commonwealth will pay almost $18b in interest on $1 trillion of debt.Australia's interest bill is expected to climb above $20b in 2024/25 and reach $26b the following year.The treasurer says the interest bill is adding pressure to the budget, but has flagged a better bottom line than expected amid speculation of a surplus.While keeping the details close to his chest, Dr Chalmers said the fact there was speculation of a surplus highlighted the government's economic credentials after it banked most of its budget gains.\"By making sure when we get these big upward revisions to revenue that we let most of that flow through to the bottom line,\" he told reporters on Friday.",
        "\"What people will see on Tuesday night is a budget that strikes a really good balance between what we need to do to help people right now and what we need to do to set this country up for the future.\"In October, the government banked more than 90 per cent of its upward revisions to revenue from high commodity prices.But Opposition Leader Peter Dutton said the better bottom line was driven by high commodity prices and accused the government of increased spending.\"The revenues ironically from royalties, company tax receipts are through the roof,\" he said.\"But we will wait to see the detail. Most analysts now would expect there to be a surplus.\"Mr Dutton flagged his budget reply speech would outline Liberal Party values but refused to say whether there would be any major announcements.\"No opposition has released its full policy manifesto within the first year of being an opposition,\" he said.\"The whole idea of opposition is to work on your policy, catch up with stakeholders, reconsider your vision for the country and then present that in an election campaign, which is still 18 months, two years away.\"Also on Friday, the government announced a $200 million package to break the cycle of disadvantage as well as a plan to extend the Medicare rebate for heart check-ups.",
        "It has also scrapped the controversial ParentsNext program, which sent parents to employment providers and required them to do training, education and parenting courses to maintain welfare.Compulsory obligations described as punitive, counterproductive and harmful will be immediately suspended."
    ]
}