{
    "articleURL": "/health/article-12047251/These-four-early-warning-signs-colon-cancer-younger-adults-according-new-study.html",
    "content": [
        "Surgeons are becoming increasingly concerned over a mystery spike in casesIn the research, medics looked at 5,000 people with early onset colon cancer READ MORE: Mystery spike in colon cancer cases among younger adults The four early warning signs of colon cancer in younger adults that everyone should look out for have been revealed in a new study.",
        "Once seen as a disease of the old, surgeons are now concerned over a mystery spike in cases in the middle-aged — with rates having doubled among under-55s since the 1990s.In their research, medics looked at the symptoms recorded in 5,075 people with early-onset colon cancer, which struck before their 50th birthday.They revealed four common warning signs that appeared up to two years before diagnosis: Abdominal pain, rectal bleeding, ongoing diarrhea and iron deficiency anemia.",
        "Dr Yin Cao, a surgeon at Washington University in St Louis who was involved in the research, warned it was important not to think of colon cancer as 'simply a disease affecting older people'.'We want younger adults to be aware of and act on these potentially very telling signs and symptoms,' she said.'[This is] particularly because people under 50 are considered to be at low risk and they don't receive routine colorectal cancer screening.'",
        "Data shows diagnoses among people under 55 have nearly doubled in 25 years. They now make up around a fifth of all diagnoses now compared to 11 percent in 1995. ",
        "It is essential to catch the cancer early because while more than 90 percent of patients survive if they are diagnosed in the early stages, this drops to just 13 percent if the cancer is only detected once it has spread to other organs.",
        "Published today in the Journal of the National Cancer Institute, the study was based on health insurance claims submitted to IBM MarketScan Commerical Database — which covers more than 113million Americans.Each patient with early-onset colon cancer was matched to someone who did not have the disease.Scientists then looked at patients' medical reports to check whether they had suffered any of 17 symptoms linked with colon cancer.The analysis revealed four symptoms, with nearly half of patients reporting at least one of them at least three months before diagnosis.They also found that the risk of colon cancer diagnosis increased depending on how many symptoms patients had.Having one of the symptoms doubled the risk of a colon cancer diagnosis. But having two sent it up by 3.5 times and having three or more boosted it six-fold.The four symptoms were normally ongoing, the scientists said.Iron deficiency anemia can be diagnosed via blood tests, a pale coloring under the inside of the lower eyelids or having unusually pale or yellow skin.The symptom list was not exhaustive, however, and other warning signs could also indicate early onset of the disease including a feeling that the bowel has not emptied completely or consistent cramps or gas.Dr Cao added: 'Since the majority of early-onset colon cancer cases have been and will continue to be diagnosed after symptom presentation, it is crucial to recognize these red-flag signs and symptoms promptly and conduct diagnostic work-up as soon as possible.",
        "'By doing so, we can diagnose the disease earlier, which in turn can reduce the need for more aggressive treatment and improve patients' quality of life and survival rates.'",
        "Dr Cassandra Fritz, a gastroenterologist who led the study, said that it normally takes about three months from when a person first goes to the doctor to get a diagnosis.But in the study, they found some patients had symptoms up to two years before getting checked.Colon cancer is when cells start to divide uncontrollably in the colon, part of the large intestine, leading to the formation of growths or tumors. If not diagnosed and treated quickly, these cells can move to other areas of the body causing the cancer to spread. About 150,000 Americans are diagnosed with colon cancer every year, estimates suggest. It is also the third-leading cause of cancer-related death in men and women, behind about 52,000 fatalities.Scientists are sounding the alarm over colon cancer cases in young adults amid a mystery surge in the age group.There has also been an uptick in late-stage diagnoses of the disease when it has spread to other areas of the body and become harder to treat.It was not clear what was driving the trend, but unhealthy diets, alcohol consumption and sedentary lifestyles have all been blamed for the higher rates.",
        "The alarm led the US Preventive Services Task Force — a key medical body — to lower the recommended age for screening for the cancer from 50 to 45 years old.The death of actor Chadwick Boseman from colon cancer in 2020 at the age of 43, who famously played the Black Panther in the blockbuster Marvel movie, drew more attention to the trend.Dr Rebecca Segel, senior scientific director of surveillance research at the American Cancer Society, previously said: 'We know rates are increasing in young people.'But it's alarming to see how rapidly the whole patient population is shifting younger, despite shrinking numbers in the overall population.'The trend toward more advanced disease in people of all ages is also surprising and should motivate everyone 45 and older to get screened.' "
    ]
}