{
    "articleURL": "/news/article-12051047/Yellowstone-officially-coming-end.html",
    "content": [
        "Smash-hit drama will finish in November after season five, Paramount confirmsBut a sequel is already in works, with Matthew McConaughey rumored to starREAD MORE: Inside Yellowstone creator Taylor Sheridan's TWO luxury ranches - including $350M property that is twice the size of Chicago Yellowstone will finish at the end of this season, Paramount has confirmed, with its star Kevin Costner now mired in an ugly divorce battle with his wife Christine Baumgartner.",
        "Paramount Network have announced that Yellowstone will officially end with the final episodes of the fifth season launching in November.The show has been a monster hit for the network, and tells the story of the Dutton family, and their battles over their gigantic Montana ranch.It is still a ratings smash, but the atmosphere on set is said to have become fraught over Costner's insistence on only working part of the week.  But fans of Yellowstone will likely be soothed by news that a sequel has already been given a full-series order. Matthew McConaughey has been tipped as its possible star, although producers have yet to confirm any members of its new cast. Watch the epic final instalment of Yellowstone returns this November, only on Stan.",
        "The announcement follows a protracted battle between Paramount and Costner over the star's scheduling.The Academy Award winner, who is currently shooting for his upcoming film Horizon, has reportedly refused to work for more than a week on the second half of Yellowstone's final season. This frustrated Sheridan, given Costner's lead role as John Dutton, the head of the Dutton family, and had damaged morale among the show's other stars, which includes Luke Grimes, Kelly Reilly and Wes Bentley, it was reported. The first half of the season, known as 5A, continued to prove a hit for the network, with the premiere garnering more than 17 million viewers. ",
        "Chris McCarthy, president and CEO of Showtime/MTV Entertainment Studios, said in a statement: 'Yellowstone has been the cornerstone on which we have launched an entire universe of global hits — from 1883 to Tulsa King, and I am confident our sequel will be another big hit, thanks to the brilliant creative mind of Taylor Sheridan [the show's creator] and our incredible casts who bring these shows to life.'Deadline has previously reported that Interstellar star McConaughey is in talks with Paramount over taking the lead in a Yellowstone sequel.A Paramount spokesman told the publication that 'McConaughey is a phenomenal talent with whom we'd love to partner'.The new show will start on Paramount Network and then stream exclusively on Paramount+.",
        "The news comes at a difficult time for Costner, whose second wife Christine Baumgartner filed for divorce on Monday. The couple have been married since 2004. Baumgartner cited 'irreconcilable differences' and requested joint custody of their three children: Cayden, 15; Hayes, 14; and Grace, 12, TMZ reported.Costner filed a response with celebrity divorce attorney Laura Wasser the following day in which he also requested joint custody.'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' Costner's rep said in a statement.",
        "'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time.'Baumgartner has not requested spousal support, and Wasser's response indicated that there was a prenuptial agreement between the former couple that would determine it."
    ]
}