{
    "articleURL": "/wires/aap/article-12049833/Luai-relishes-underdog-status-NSW-Origin-battle.html",
    "content": [
        "Penrith's Jarome Luai is claiming the role of underdog as he battles reigning Dally M medallist Nicho Hynes for the NSW five-eighth jersey at 2023's State of Origin series.",
        "Luai's form for the back-to-back premiers and his long-standing connection with NSW halfback Nathan Cleary have made him Brad Fittler's first-choice five-eighth at Origin level for the past two years.But the form of Cronulla halfback Hynes has given Fittler plenty to consider.Since the last Origin series, Hynes has guided the Sharks to the semi-finals, collected the Dally M Medal and taken his game to even loftier heights in 2023.Even after missing the first three weeks of the season through injury, Hynes enters round 10 ranked equal-third in the Dally M stakes and has been the mastermind of the Sharks' current three-game winning streak.The Panthers have lost their last two games, leaving Luai with a point to prove in the three weeks before the teams are named for Origin 1.His case for re-selection continues with the Magic Round clash against the Warriors on Saturday.\"Everyone has to earn that jersey and that's the right way it should go,\" Luai said.\"We've lost our last two games so I just want to get back in the winners' circle and have a good game with my brothers.\"(Origin) is a great opportunity to represent myself and my family but I'm wearing the black jersey right now and I've got a job to do.\"",
        "Across three seasons of premiership domination, the Panthers are unaccustomed to being on the back foot.Before round nine, they had not lost back-to-back games outside the Origin period since 2019.With faltering NRL form comes Origin speculation, and Luai is relishing the debate about his position in the Blues side.\"I don't think you can escape it. I'm embracing it,\" he said.\"When things aren't going right, it's going to show who you really are. I love it when times get tough and I've got to step up. That's what I'm here to do.\"I love that stuff. In a way, I'm the underdog now, that's what we love.\"But I've been that my whole life so I can't wait to get it on.\"Luai's NSW and Panthers teammate Brian To'o backed his good friend to retain the five-eighth spot but insisted none of the incumbent Blues should consider themselves safe from relegation.\"It's not our jersey to have,\" the winger said.\"Hopefully I get to pull on the jersey again and same with Romey (Luai) as well.\"We've got to work hard for the Panthers and hopefully earn the right to put on the jersey again.\""
    ]
}