{
    "articleURL": "/wires/reuters/article-12041633/Focused-job-Frances-Le-Maire-defends-writing-steamy-novel.html",
    "content": [
        "By Dominique Vidalon",
        "PARIS, May 3 (Reuters) - French Finance Minister Bruno Le Maire said he was fully focused on creating growth and fighting inflation after coming under fire for penning a steamy novel that was published hours before France's credit rating was downgraded by an agency.Political opponents and commentators have ridiculed Le Maire for an explicit sex scene in the book and questioned whether he should be writing saucy fiction at a time surging consumer prices are eroding households budgets, and when there is widespread anger over an unpopular rise in the retirement age.\"I am 100% focused on the job,\" Le Maire told Franceinfo radio.\"Fugue Americaine\" is a fictitious story about the late legendary pianist Vladimir Horowitz and tells of the travels of brothers Franz and Oskar Wertheimer to Cuba to attend one of his concerts.It is a graphic account of Oskar having sex with a character named Julia that has exposed Le Maire to mocking and criticism.The French edition of the Huffington Post headlined a story \"Bruno Le Maire has written about an anus and no one was ready for this.\"\"These are 10 lines out of a 480 pages book,\" Le Maire shot back when pushed on his writings during the Franceinfo interview. \"This novel is a great human adventure and I wish it be read as such ... Nothing will hinder my freedom to write.\"",
        "The minister has also taken to Twitter to defend his pastime. \"Many of you are asking me how I find the time to write when I am a minister,\" he wrote \"Some people do gardening or go hiking, I write.\"But opponents are not convinced.François Ruffin, a leftwing lawmaker told BFM television: \"At a time when the French people have huge worries about inflation ... should he have one minute, one hour, one week of his time to dedicate to writing erotic scenes?\"The novel comes after President Emmanuel Macron's junior minister for the social economy, Marlene Schiappa, caused outrage by posing for the cover of Playboy magazine, although fully clothed. (Reporting by Dominique Vidalon; Editing by Richard Lough and Alison Williams)"
    ]
}