{
    "articleURL": "/wires/ap/article-12040655/Quarterbacks-come-board-record-rate-NFL-draft.html",
    "content": [
        "The Brock Purdy impact was in full effect in this year's NFL draft.",
        "A year after the San Francisco 49ers found their starting quarterback with the final pick of the draft, teams were far more aggressive when it came to drafting quarterbacks in the later rounds.Three quarterbacks went in the fourth round for the second time in the past 10 drafts and four quarterbacks went in round five for the first time since 2002. That led to a record 12 QBs going in the first five rounds for the first time ever in the common draft era that started in 1967. The previous high was 11 in 1995.The run on QBs started early with Bryce Young going first to Carolina and C.J. Stroud going second to Houston - marking the ninth time quarterbacks went 1-2 in the common draft era, with five of those coming in the last 12 drafts.Indianapolis then took Anthony Richardson fourth, marking the fourth time that three quarterbacks were taken with the first four picks.Things slowed down from there with Will Levis waiting until round two to go to Tennessee and Hendon Hooker being drafted in the third round by Detroit.",
        "Then the run on QBs started late in the fourth round when Fresno State's Jake Haener went 124th overall to New Orleans. Six more quarterbacks followed in the next 37 picks as the philosophy of passing on late-round QBs who historically have little chance of developing into top-flight starters changed.",
        "Some of that could be because of Purdy, who went from being \"Mr. Irrelevant\" as the final pick of the 2022 draft to winning his first seven starts as a rookie to help the 49ers reach the NFC title game last season.While the chances that the QBs that went on day three of the draft will develop into starters are low, the payoff if it happens was high enough to justify the risk.Two-time national champion Stetson Bennett went to the Rams the pick after Haener, with the Raiders taking Aidan O'Connell with the final pick of the fourth round. The Rams and Raiders had been the only teams not to select a QB in any round the previous six drafts.The fifth-round run started with Clayton Tune going to Arizona at No. 139, followed by Dorian Thompson-Robinson (140 to the Browns), Sean Clifford (149 to the Packers) and Jaren Hall (164 to the Vikings).The final two QBs off the board were Tanner McKee to the Eagles in the sixth round and Max Duggan to the Chargers in the seventh.In all, 14 quarterbacks were drafted last weekend, tied for the second most in the last 2 drafts behind the 15 from 2016.TOP TIGHT ENDSThis draft was viewed as a strong one for tight ends and that played out on day two when a record five went off the board in the second round and three more in the third.",
        "It took a while for the first tight end to go with Buffalo trading up to take Dalton Kincaid with the 25th pick.But that all changed Friday with Detroit taking Sam LaPorta with the third pick of the second round and Las Vegas grabbing Michael Mayer one spot later. Green Bay then took Luke Musgrave 44th, Dallas drafted Luke Schoonmaker 58th and Jacksonville took Brenton Strange 61st.This marked the first time in the common draft era that five tight ends were taken in round two and the six that went in the first rounds tied 1974 for the most ever.Tucker Kraft, Darnell Washington and Cameron Latu went in round three with the nine tight ends going in the first three rounds breaking the record of eight reached in 2006 and 2019.BY POSITIONSWhile the drafts were notable to tight ends and quarterbacks, the volume of picks was focused as usual in the trenches and on the perimeter.There were 56 defensive backs drafted - the most of any position - as the increased of extra DBs in nickel and dime packages have put a premium on depth at that spot.Teams also combined 43 offensive linemen, as well as 43 defensive linemen. Receivers came in next at 32.",
        "Only six specialists were taken but the 49ers did surprise many by drafting kicker Jake Moody 99th overall - the highest pick for a kicker since Tampa Bay took Roberto Aguayo with the 59th pick in 2016.ALMA MATERSAfter years of dominating on the field and in recruiting rankings, it was no surprise that Alabama and Georgia led the way with 10 draft picks each.The Bulldogs have now had 25 players taken in the past two drafts from teams that have won national championships each year. New England sixth-round Ameer Speed played on the 2021 title team before transferring to Michigan State, giving Georgia 26 draft picks from that team that ended a four-decade championship drought.Fourteen members of that 2021 defense have been drafted with five going to the Eagles: Jordan Davis and Nakobe Dean in 2022, and Jalen Carter, Nolan Smith and Kelee Ringo this year.Alabama dominated the top of the draft with quarterback Bryce Young becoming the first Crimson Tide player since Harry Gilmer in 1948 to go first and edge rusher Will Anderson going third.It marked the fourth time since 2000 that college teammates went in the first three picks of the same draft with Ohio State's Chase Young and Jeff Okudah going at No. 2 and 3 in 2020, Oklahoma's Sam Bradford and Gerald McCoy going at No. 1 and 3 in 2010, and Penn State's Courtney Brown and LaVar Arrington going with the top two picks in 2000.",
        "The next schools on the list of most draft picks were two of the other teams to make the College Football Playoff with Michigan having nine players picked and TCU eight.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}