{
    "articleURL": "/wires/reuters/article-12054667/Soccer-Kane-grabs-winner-Tottenham-edge-Crystal-Palace.html",
    "content": [
        "LONDON, May 6 (Reuters) - Harry Kane moved up to second place in the all-time Premier League goalscorers list as he helped ailing Tottenham Hotspur to a 1-0 win over Crystal Palace on Saturday, securing their first victory in five games.",
        "Kane headed Tottenham in front in first-half injury time to score his 209th Premier League goal, one more than Wayne Rooney but still some way behind record-holder Alan Shearer's tally of 260.Tottenham's victory lifted them to sixth in the table with 57 points from 35 games. They are six points behind fourth-placed Manchester United who occupy the last of the Champions League qualification places having played two games more. Palace are in 12th with 40 points.Tottenham had conceded 15 goals in their previous four games, but there was no danger of that in a flat opening period from both sides that was lacking in clear-cut chances until it sprung to life in injury-time.Club captain Kane started the move that led to the winning goal as he sent the ball out wide to Pedro Porro in acres of space on the right wing and the Spaniard then sent a cross to the back post, leaving the striker to head the ball in.\"It was tough but really important to get the three points and a clean sheet,\" Kane told reporters. \"Palace are in a good vein of form, so we knew it would be difficult.\"Scoring just on halftime helped and we defended well in the second (period). So overall, a good three points.\"",
        "Tottenham hit the crossbar before their goal from a Cristian Romero header and dominated the second half in terms of possession, as Son Heung-min wasted a superb chance to make it 2-0 but could not beat Sam Johnstone in a one-on-one with the goalkeeper.Kane scored twice in Tottenham's 4-0 win at Selhurst Park earlier in the season but had a quiet afternoon bar his goal, with his other major contribution a scrambled clearance in his own box late on.Johnstone made a smart save to beat away Porro's deflected effort, but too often the home side were wasteful in the Palace half as the final pass, cross or shot was wayward and promising positions led to nothing.\"We know how good he (Kane) is in the air and he showed it again. His moment of brilliance won the game,\" Palace manager Roy Hodgson, who gave Kane his England debut in 2015, told the BBC.\"He's a fine player. What he has done for this club has been enormous. Since he made his debut for England when we were with the England team he has gone from strength to strength.\"He is still a young man and I'm pretty certain Alan (Shearer) needs to be concerned because Harry will be breathing down his neck.\" (Reporting by Nick Said; Editing by Pritha Sarkar, Mike Harrison and Toby Davis)"
    ]
}