{
    "articleURL": "/wires/ap/article-12049473/DeSantis-celebrates-wins-end-busy-legislative-session.html",
    "content": [
        "TALLAHASSEE, Fla. (AP) - On the day he took office, Florida Gov. Ron DeSantis vowed to pursue an agenda that would heal the state's political divisions.",
        "In an op-ed, he pledged to prioritize environmental protection, the economy, education. He highlighted the \"diverse, bipartisan group of qualified individuals\" he hired for his administration.\"It is time for our state to come together,\" he declared in the January 2019 piece.On Friday, more than four years later, DeSantis concluded a legislative session that establishes him as perhaps the most aggressive and accomplished conservative governor in the nation's bitter culture wars - just as he prepares to enter the 2024 presidential contest as a top rival to former President Donald Trump.Intensifying his hard-right shift that began during the pandemic, the 44-year-old Republican governor in recent weeks has pushed the limits of divisive cultural battles over abortion, LGBTQ rights, sex education, guns, immigration and diversity. And in most cases, backed by Republican supermajorities in Florida's Legislature, he won.DeSantis in recent weeks signed a law to ban abortion at six weeks of pregnancy and another to allow people to carry concealed guns without a permit. He expanded what critics call his \"Don't Say Gay\" law that now blocks classroom instruction about sexual orientation and gender identity for all grades. And in the coming days, he will sign a law banning diversity, equity and inclusion programs in state colleges, along with another bill that prevents students and teachers from being required to use pronouns that don´t correspond to someone´s sex.",
        "The governor has also used the power of his office to seize partial control of Disney World, one of his state's largest employers, which spoke out against the \"Don't Say Gay\" law.And as the 2024 presidential contest heats up, he's eager to celebrate his accomplishments.\"When I became governor, the first day, sat in the office, I kind of just looked around and I thought to myself, ´I don´t know what SOB is going to succeed me in this office, but they ain´t going to have much to do because we´re getting all the meat off the bone,\" he said during a Thursday news conference about fishing dates.DeSantis' unapologetic conservative shift, an evolution years in the making, positions him well among GOP presidential primary voters, who tend to be fiercely partisan. But it has sparked concerns among others, including donors, GOP officials and even some moderate Democrats, who initially welcomed DeSantis' approach but now fear that his crusade to champion conservative culture may alienate as many people as it attracts.\"His unrelenting focus on the cultural issues more than the economic issues gets to be tiresome,\" said longtime Republican donor Bobbie Kilberg. \"I think people over time will want someone who does not add to the scenario of pushing people further and further and further apart.\"",
        "DeSantis is poised to launch a presidential bid as soon as next week, though allies believe that a formal announcement, which could begin with an exploratory committee, is more likely to come around the end of May. For much of the year, he has sidestepped questions about his national ambitions, insisting that he was focused on Florida's legislative session.DeSantis' team is optimistic that his conservative accomplishments will strengthen his appeal among primary voters who may be willing to move on from Trump.\"He´s got a lot done,\" former Georgia Lt. Gov. Geoff Duncan, a fierce Trump critic, said of DeSantis. \"Ron DeSantis is more of a conservative than Donald Trump has ever been.\"Still, would-be supporters like Duncan are concerned that DeSantis' fight with Disney has gone too far and that he should be zeroed in on more important issues.\"He´s focusing on the wrong Disney character,\" Duncan said. \"Instead of picking on Mickey, you need to pick on Donald.\"Those who know DeSantis best trace his emergence as a leading voice in the nation's cultural divisions to the pandemic.After initially agreeing to COVID-19 shutdowns, DeSantis soon established himself as one of the GOP's most aggressive critics of public health measures. He became a conservative hero of sorts as he promoted what he called \"the free state of Florida.\"",
        "Before the pandemic, he followed through on his promise to focus on education funding and environmental protection. He dedicated billions of dollars to Everglades restoration and other water protection projects over his first term, and he continued such efforts into the early days of his second. He has also consistently pushed for and secured pay raises for teachers in the state budget.Democrat Bob Buckhorn, the former mayor of Tampa, said he was \"pleasantly surprised\" at the governor's first months in office. But he said his hope faded soon after the pandemic exploded in the spring of 2020.\"I think we all knew he was ambitious, but I don´t think all of us knew how far he would go and the extent to which he would go to build credibility with an audience that doesn´t represent Florida,\" Buckhorn said.DeSantis' team rejects the notion that he has fixated on red meat policies. They note the governor´s spending on education and the environment in addition to recent moves to cut taxes on household items such as diapers.DeSantis' super PAC, which already has a half dozen paid staffers on the ground in each of the first four states on the Republican presidential primary calendar, did not mention his bipartisan achievements in a statement touting DeSantis' \"incredible success.\"",
        "\"Gov. DeSantis´ robust record of legislative accomplishments includes enacting a Parents Bill of Rights and standing up to draconian COVID mandates to supporting law and order and pursuing the death penalty for child rapists,\" said super PAC spokesperson Erin Perrine. \"Ron DeSantis will never back down from pursuing strong conservative policies.\"Indeed, as 2024 has grown closer, DeSantis has done as much or more than any other Republican governor in America to use the levers of government to lean into cultural fights. Along the way, he embraced a new catchphrase: \"Florida is where woke comes to die.\"In other legislative wins, DeSantis has made it illegal for state and local investment funds to consider companies' environmental, social and governance stances in his fight against \"woke\" corporations. He also signed a bill allowing the death penalty in child rape convictions, despite a U.S. Supreme Court ruling that banned capital punishment in such cases. And he signed a bill to end a unanimity requirement in death penalty sentencing.Another new law to harden the state's immigration policy and add millions of dollars to his controversial migrant relocation program awaits his signature.\"It's all red meat,\" Kilberg said. \"I think a Republican would have a better shot getting elected in the general election if they were less divisive and more willing to work together with people for the common good. That clearly is not his mantra.\"",
        "Still, Kilberg said she would \"most likely\" vote for DeSantis and help him raise money if he becomes the Republican nominee in a general election against President Joe Biden.\"I say most likely, because it would be important to me to see DeSantis soften his image, have a more caring image, have a more inclusive image,\" she said. \"DeSantis is not the only alternative to Trump.\"___Peoples reported from New York. Associated Press writer Brendan Farrington in Tallahassee, Fla., contributed to this report.___Follow the AP's coverage of Florida Gov. Ron DeSantis at https://apnews.com/hub/ron-desantis."
    ]
}