{
    "articleURL": "/femail/article-12043727/I-paid-7-500-salt-water-injections-breasts-bigger-deflated-hours-later.html",
    "content": [
        "Kayla Kayden, 34, from Las Vegas, Nevada, had saline injected into her chestThe former Playboy bunny said it increased her breast size by 'five times' The only problem? It only lasted for a few hours before deflating again A model has revealed that she paid $7,500 to have salt water injected into her chest so she could achieve an 'instant boob job' - insisting that it expanded her breasts by 'five times her natural size' but deflated within hours.",
        "Kayla Kayden, 34, a former Playboy bunny-turned OnlyFans star from Las Vegas, Nevada, underwent breast augmentation surgery at age 19, which turned her natural C-cup into an E-cup.For 13 years, she boasted the bigger chest size, until she was forced to remove the implants in 2021, because she had gone over the recommended time frame of 10 years.While Kayla missed her larger breasts, she didn't want to go under the knife again out of fear that it would leave heavy scarring on her chest.",
        "So, her plastic surgeon suggested she try a bizarre new trick dubbed the 'instant boob job,' which involves inserting saline into your boobs to temporarily inflate them - and according to the model, the technique was a total success. ",
        "'I told my plastic surgeon that I didn't know if I want [implants] again, and he suggested getting saline (a mixture of salt and water) put in,' she told NudePR.com recently.'He did the injection and it worked – I was shocked. They looked much bigger.' Kayla insisted that the injections are '1,000 times better than implants' because they feel more 'natural.' 'The injections take you from your normal size to three or five times your natural size,' she said. 'With the implants, you can feel a ball inside your chest. But with the water, it's like a waterbed – you don't even notice it's in there.'",
        "The only problem? The effects only lasts a few hours before your breasts drop back down to your normal size. 'It lasts like 12 hours and it reduces throughout the day,' explained Kayla. '[That means] I can be my normal self and then when I want to look all glammed up, I put a wig on and do my boobs.'The procedure involves a trained plastic surgeon injecting the salt water through a needle after numbing the breast, working in sections to achieve the desired look.It's an expensive treatment though - with an eye-watering price tag of $750 a pop.Kayla said she spent $7,500 in total for 10 injections in 2022. And while she loved the instant 'boost,' it ultimately made her want something more long-term.",
        "In December 2022, the 34-year-old made the decision to risk the consequences and go under the knife again.",
        "'I loved how the insta boob looked so much, I decided to have my breasts done again. So I'm back to fake size D cups again,' she revealed.'Thankfully I didn't get any new scarring because the plastic surgeon went over previous scars.'I do have scarring from my explant but I scar white and my lines are thin. I'm so happy the way I am now.",
        "'I highly recommend anyone who gets breast implants to try saline injections first to see which size they want.'[If I didn't have my implants], I would absolutely get the injections again. It helped me decide that I wanted new implants. And I got the exact size that's right for my body.'",
        "According to Bay Area Aesthetic Surgery, the procedure dubbed the 'instant boob job' involves saline fluid being injected into the breasts for a temporary enlargement, which lasts for around 24 hours.The injections were initially suggested by surgeons as a means of demonstrating to potential patients what the results of a breast augmentation might look like, before they determined whether or not they were ready to go under the knife. However, once the injections became more common among medical practitioners, patients began requesting the temporary enhancement in order to give their chest a boost before an important event like a red carpet appearance or a photo shoot. The 'instant boob job' sees saline fluid being injected into the breast tissue in order to expand the size of the boobs; the fluid is then absorbed by the body within 24 hours. However, there are some risks involved. It has been suggested by some medical experts that the injections could result in bruising, swelling, redness, and even infections. If a patient undergoes the procedure multiple times, it could also cause the breast skin to stretch, which would cause sagging when the saline has dissolved.  "
    ]
}