{
    "articleURL": "/wires/afp/article-12055837/Lebanon-crisis-mutes-national-music-conservatory.html",
    "content": [
        "At Lebanon's national music conservatory, pianos collect dust and classrooms sit empty, making the institution another casualty of an economic collapse that has crippled the public sector and hampered education.",
        "Toufic Kerbage, 65, watched the value of his pay packet and pension evaporate after the Lebanese economy began melting down in 2019, taking the local currency and people's savings with it.Without family support \"I would have starved,\" said the music teacher, who began working at the conservatory in the late 1980s.\"It's difficult at my age to ask for money\", he said from the silence of the conservatory's branch in Sin al-Fil, a suburb of the capital Beirut.Once on a comfortable income, Kerbage now earns around $70 a month, in a country the World Bank says suffers the highest food price inflation globally.He has been teaching his classes online, battling Lebanon's \"disastrous\" internet and spending more than he earns on a generator subscription to get through hours-long daily power cuts.",
        "The state-run conservatory, with several thousand mostly school-aged students and 17 branches around the country, counts prestigious musicians like the composer and oud player Marcel Khalife among its alumni.But as the economic crisis grinds on, some teachers have quit. Many others have turned to online classes to save on travel costs or teach private lessons on the side to make ends meet.Kerbage said he was \"worried\" about colleagues without a support network.- 'Musical revolution' -",
        "Taking matters into their own hands, a group of teachers and students have been holding independent concerts to highlight their plight and give musicians a chance to support each other and perform.\"I am here today to stand with my colleagues who are not happy with the way we are treated,\" said concert organiser Ghada Ghanem, who is also a teacher and soprano.",
        "Some teachers have moved house or \"sold their cars\" to survive, added Ghanem, herself a conservatory student during Lebanon's 1975-1990 civil war.The shows' proceeds will be invested into creating further performance opportunities or distributed among those involved, she said, calling the initiative a \"musical revolution\".\"Let's fix our problems with our own talent,\" Ghanem said recently from a darkened Beirut theatre before a recent show -- the second in a planned series.\"Depression will attack us if we sit and do nothing.\"Matthew Ata, 10, said he was \"a bit nervous\" about his debut concert performance.Despite starting with the conservatory two years ago, he only met his guitar teacher for the first time at the show.\"We really hope that things will get better\" and in-person classes will resume, said Matthew's mother, Rita Jabbour.Some students said the protracted online teaching and disruptions had left them feeling discouraged.",
        "Software engineer Aline Chalvarjian, 33, who studies oud and lyric singing, said she had \"lost motivation\".The conservatory used to be \"like a second home\", she said. Now, \"we feel that we are left behind\".- 'First' pay boost -Like other public sector workers throughout the crisis, conservatory staff have taken strike action to demand their rights are respected, with the head of the conservatory teachers' league sacked in January after organising protests.",
        "In recent months, teacher strikes at Lebanon's public schools have paralysed the education sector.Soprano Hiba al-Kawas, who last year became the first woman to head the conservatory, said she had worked day and night to improve the situation, but political deadlock has stymied progress.Lebanon's entrenched political elite, widely blamed for the country's crisis, has failed to take action to stem the three-year economic collapse.As sectarian barons bicker over who should be the country's next leader, the presidency has remained vacant since October 31, while a caretaker government with limited powers has been at the helm of the bankrupt state for almost a year.Despite the obstacles, Kawas said she had managed to secure pay increases that should allow a return to in-person teaching.A teacher who was paid 30,000 Lebanese pounds per hour -- $0.50 based on an exchange rate used for public sector salaries -- would earn 300,000 once the wage hike takes effect, she said.",
        "It is \"just a first step\", Kawas added. Teacher Kerbage expressed optimism at the new regime, which he said should push his monthly earnings into the hundreds of dollars.\"Anything\" would be welcome, he said.\"I would be able to pay for my fuel, for my electricity, and for some food -- that's a lot.\""
    ]
}