{
    "articleURL": "/tvshowbiz/article-12060899/Irina-Shayk-showcases-eye-catching-physique-wearing-form-revealing-bikini.html",
    "content": [
        "Irina Shayk shared an assortment of photos taken during her trip to Miami to her Instagram account on Monday morning.",
        "The 37-year-old supermodel included a trio of shots in which she showed off her impressively sculpted figure while wearing form-revealing swimsuits.The fashion industry figure, who opened up about motherhood during an interview with Harper's Bazaar, also posted a pair of snaps that had been taken during the recently-held Miami Grand Prix.In her bikini shots, Shayk wore a dark green top that exposed her toned midsection, as well as a matching bottom that showcased her curvy hips.The runway regular contrasted the tone of her swimwear with a pair of jet-black running shoes, and her lengthy brunette hair cascaded onto her shoulders and chest.",
        "The former Sports Illustrated Swimsuit Issue cover model added an element of shine to her look with sparkling gold hoop earrings.She also included two black-and-white shots of herself wearing the bikini, one of which was taken with a backdrop of the city.Shayk shared a pair of selfies that only showed her face and highlighted the bright green shade of her eyes.The supermodel went on to show off the outfit she wore to the Miami Grand Prix in two of her other snaps.The fashion industry personality donned a dual-patterned dress that featured a sparkling black upper portion.The middle and lower parts of her outfit were covered in a lime-green cheetah print that contrasted perfectly with its dark top.",
        "Shayk also wore a pair of knee-high leather boots that added extra darkness to her look for the day.The model accessorized with black wraparound sunglasses and hoop earrings, and her brunette hair cascaded onto her shoulders.",
        "The social media figure was also joined by Burberry's former chief creative officer, Riccardo Tisci, during the event.Shayk previously shared several images that featuring the designer to her Instagram account on Sunday.In one of the snaps, the pair posed alongside fellow model Stella Maxwell, and the Hercules actress flashed a peace sign to the camera.The runway regular kept it relatively casual during the sporting event, as she wore a white t-shirt underneath a sheer black dress. "
    ]
}