{
    "articleURL": "/wires/pa/article-12043355/Ineos-Grenadiers-open-launching-women-s-road-racing-team-coming-years.html",
    "content": [
        "Ineos Grenadiers’ deputy team principal Rod Ellingworth has said the British outfit is open to launching a women’s road racing team in the next couple of years.",
        "The Grenadiers, founded in 2010 as Team Sky and boasting one of the biggest budgets in the sport, have long faced questions over potential investment in a women’s squad – something rival teams including Trek-Segafredo, Jumbo-Visma and Movistar have done with considerable success.In 2021 the team’s former chief executive Fran Millar said the idea had been discussed as far back as 2012 but rejected at board level by Sky, which backed the team until Sir Jim Racliffe’s Ineos took over in 2019.The Grenadiers last year signed French mountain bike world champion Pauline Ferrand-Prevot to their off-road roster, making her their first female rider, but Ellingworth has now said they are open to further expansion into women’s racing.“We’re certainly looking at moving forward,” Ellingworth said. “Obviously bringing Pauline in at the back end of last year, purposefully bringing Pauline in to support her in her Olympic mountain bike campaign.“She made a brilliant start last week (winning at the French Cup in Gueret) in the world champion’s jersey and she’s been a fantastic addition to the team, so we’re moving in the right direction.”Ferrand-Prevot, 31, was a world champion on the road in 2014 and has talked of returning to the discipline after the Paris Olympics next summer.",
        "Asked if she might be able to do that in an Ineos jersey, Ellingworth added: “Why not? I’ve always said, you’ve got to follow riders’ dreams and ambitions. You get hold of a rider with really big ambitions and see where they want to go.“You decide then as a team, are you going to go on that journey or not? If Pauline had the ambition of riding the Tour de France or whatever in the future then what a great story that would be.”",
        "Ineos expanded into off-road racing when they signed Tom Pidcock, the men’s Olympic mountain bike champion and former cyclo-cross world champion, for the start of the 2021 season, and Ellingworth said further expansion could follow.“There’s no real barrier,” he said. “It’s just a focus thing, the focus of the team and the direction we want go in.“What we decided a little while back was to broaden out and that was with the mountain bike team with Tom and his ambitions across different disciplines within the sport, then bringing Pauline in.“I think we’re showing we are looking to spread our wings and do some other things. I think for us all it’s to not just be doing the same things year on year. We’re an ambitious team with ambitious goals and we want to keep moving forward. I think we shall be going in the right direction.”"
    ]
}