{
    "articleURL": "/sport/football/article-12056141/Wigan-players-REFUSE-play-final-match-season-against-Rotherham-Monday.html",
    "content": [
        "Unhappy Wigan players are reportedly thinking about not playing on MondaySome of the team's players and staff haven't been paid their wages yetThe club could field a team of youth players for their last game of the season Wigan players are reportedly considering not playing their final match of the Championship season as they look to strike over unpaid wages.",
        "Mail Sport explained on Saturday that some members of the club's playing team and staff hadn't been paid, marking a fifth such occasion this season for the Latics.Fuming players were subsequently given the day off training on Saturday due to the difficult circumstances and could now refuse to return for their final game of the campaign against Rotherham.The club’s Bahraini owners paid some of their players on Friday while others are being told that they will have to wait until after Monday's game, according to The Sun.Issues surrounding payment appear to be related to player's who are out of contract in the summer, with others paid late in another embarrassing turn of events for Wigan.",
        "That has lead to the first-team discussing options to not play their last game before they are relegated to the third tier of English football.Wigan supporters could therefore arrive at the DW Stadium for their farewell Championship game to watch a team packed with youth players and reserves.A decision such as that would only further anger the EFL who have already disciplined the club this season over previous wage issues and could lead to further punishments being handed out that could impact next season.In February, Wigan were hit with a three-point deduction for breaching an agreement made at the start of the year after the club had accepted a previous suspended penalty.",
        "Wigan chairman Talal Al Hammad previously stressed in March that the delayed receipt of wages 'simply cannot happen again'.A statement released by the cash-struck club on Saturday read: 'There has been some delay with wages which were due to be paid yesterday (Friday 5 May). ",
        "'Staff wages were paid on Friday with the Chairman, Mr Talal Al Hammad, making a decision to pay as many employees as possible within the organisation with the resources available. All remaining playing and non-playing staff will be paid at the earliest opportunity following the Bank Holiday weekend.'The ownership group, Phoenix 2021 Limited, insist they are working hard to ensure that this is rectified as soon as possible and apologise again for the stress this has caused.'All first team players have been given the day off from training today given the difficult circumstances. The Club will make no further comment until it has further clarification.'"
    ]
}