{
    "articleURL": "/news/article-12054461/Taylor-Swift-new-rocker-boyfriend-Matt-Healey-send-secret-message-love-concerts.html",
    "content": [
        "Both Healy and  Swift were seen saying 'This is about you, you know who you are. I love you'He attended her Nashville show on Friday, which appeared to confirm their romance  Taylor Swift appears to have confirmed a romance with rumored new beau Matty Healy - mouthing a cryptic message while on stage in Nashville on Friday night.",
        "The singer, 33, said the words: 'This is about you, you know who you are. I love you' while on stage for her US Eras tour'.Footage of the moment sent fans into a tailspin after realizing that Healy, 34, had used the exact same words at a concert in the Philippines on May 3.  The 1975 singer was also spotted in the crowd at the Nashville performance on Friday, cutting a casual figure as he watched from a gated area with her close friends.His appearance at the concert comes after it was claimed that Taylor had struck up the new romance less than a month after her split from Joe Alwyn, 32.",
        "Video emerged of Healy pointing into the camera saying 'I love you' before swigging from a wine bottle while performing in the Philippines.The singer grinned when he heard Swift say the same words on the Nashville leg of her tour before she performed Cardigan. He flew in to see the star perform, with the visit appearing to coincide with her five-day break before continuing the tour in Philadelphia. Healy has a month-long break in his own schedule after performing with the band in May, getting back on the road with a gig in Poland on June 2.  ",
        "Swift is said to be 'madly in love' with Healy after their long-term friendship blossomed into romance.It was reported on Thursday that Matty and Taylor arranged to go public with their relationship this weekend, though she did not end up bringing him on stage.Matty appeared to be having the time of his life as he shimmied his shoulders in the audience while Taylor belted out Shake It Off.However some fans were quick to shut down the rumors of a romance, with many guessing that the not-so-subtle messages could be a nod at a potential collaboration between the two stars.",
        "Swift sang two 1975 numbers at their London gig in February, with the Sun reporting that Healey was expected to get on stage with her in Nashville – though he stayed in the crowd on Friday night.A source told the publication: 'Taylor and Matty have been planning their 'coming out' for a few weeks now, and are really excited just to go public with their love.'Neither of them want any secrets, or to hide away. The plan is for Matty to walk out on stage mid-show and play two songs.'They will chat to the audience and, at present, the idea is for them to confirm their romance with some kind of PDA — public display of affection. It won't be anything remotely cheesy though.'",
        "It comes as the British hunk reportedly split from model Meredith Mickelson just weeks before he started dating the Mean hitmaker.The singer was said to have been romancing the model, 23, who has built up a large following on social media, before they parted ways in Febuary.",
        "News of the new romance comes just weeks after it emerged that Taylor split from her boyfriend of six years Joe, 32, after the pair 'struggled' with their 'career differences'.Yet despite the short turnaround, Taylor is said to be 'madly in love' with Matt - who is the son of Loose Women star Denise Welch and Benidorm actor, Tim Healy.The rumored romance with Matt is the latest in a string of British boyfriends for Taylor, who - as well as her last relationship with Joe - has dated Harry Styles, Calvin Harris, and Tom Hiddleston.An insider told the publication: 'She and Matty are madly in love.''It's super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn't work out.'The source went on to insist that there was no crossover in Taylor's love life, despite news of her split from Joe emerging last month, insisting that the pair actually broke up in February.",
        "Taylor is currently in the middle of the US leg of her The Eras Tour while The 1975 are on their At Their Very Best concert tour, but the source insisted they have kept in constant communication by texting and Face Timing.The source added: 'As two international megastars, they understand the pressures of one another's jobs better than anyone, and are incredibly supportive of their respective careers.'They are both massively proud and excited about this relationship and, unlike Taylor's last one — which was very much kept out of the spotlight, deliberately — she wants to 'own' this romance, and not hide it away.'Taylor just wants to live her life, and be happy. She's told pals Matty is flying to Nashville over the weekend to support her on the next leg of her tour.'",
        "DailyMail.com contacted representatives for Taylor for comment.Back in 2015, Matt denied romance rumours with Taylor but confirmed they had been texting each other frequently.After rumours began circling he confirmed on Australian radio: 'It's fake. It's all bloody fake. It's a farce!'Yeah, we met each other, we exchanged numbers in the same way that a lot of people in this kind of world do and we spoke occasionally.'And she's the biggest pop star in the world and I'm in Australia. There's no like, relationship or anything happening. It's just funny how people really, really buy into that.'"
    ]
}