{
    "articleURL": "/wires/pa/article-12041561/Care-home-resident-fulfils-dream-watching-male-striptease-92.html",
    "content": [
        "A care home resident has seen her dream come true after watching a male striptease show.",
        "Betty Richardson, 92, who lives at Care UK’s Sway Place in Sway, Hampshire, has always had a love for theatre but this time wanted to see the men at Dreamboys go topless on stage.Thanks to an initiative by the team at Sway Place, where a “Wishing Tree” was installed to allow residents to put forward ideas they want to explore, Ms Richardson’s dream became a reality.Described as someone who appreciates the male physique and has always had a zest for life, Ms Richardson joined her friends at the Bournemouth Pavilion Theatre to enjoy a show by the Dreamboys – a striptease company that has been performing for more than 30 years.",
        "“Well, I’m not going to forget that in a hurry. Was that a dream or was I really there?” she said.Ms Richardson was also treated to a meet and greet with the performers and was given a behind-the-scenes tour of the theatre.She was pictured with a beaming smile on her face while standing with the Dreamboys performers on stage.Jane Baxter, home manager at Sway Place, said Ms Richardson’s dream is testament that “age is just a number”.“Our Wishing Tree initiative is a great way for residents to share their goals and it’s hugely rewarding to be able to make these a reality,” she added.",
        "“The visit was a complete success, and it was lovely seeing her face light up watching the performance.“I would like to thank the team at Dreamboys for making her visit extra special and to the team at Sway Place for organising it for her – it was fantastic to see Betty still chasing her dreams.”",
        "Alice Woods, managing director for Dreamboys, said allowing Ms Richardson to meet the male striptease act “had to happen” after hearing about the 92-year-old’s dream.“When we heard that 92-year-old Betty had made a wish to see Dreamboys via her care home, we knew immediately that we had to make this happen,” she said.“We specialise in celebrations and Betty wanting to visit our show was definitely one. We are a totally inclusive show that can entertain and celebrate any guests whether they are 18 or 101 (Yes, we had a lady celebrate her 101st birthday with us).“We ensured that Betty was given the full VIP experience at our Dreamboys show. Betty and her friends were treated to the best seats in the house and a private meet and greet with our fabulous team, we loved how this put a huge smile on Betty’s face.“We love helping make dreams a reality no matter the occasion.”"
    ]
}