{
    "articleURL": "/wires/reuters/article-12047329/UBS-weighs-options-sale-Credit-Suisses-Swiss-unit--sources.html",
    "content": [
        "By Emma-Victoria Farr and Oliver Hirt",
        "FRANKFURT/ZURICH, May 4 (Reuters) - UBS is reviewing options for Credit Suisse's Swiss bank, including potentially keeping the unit's investment banking operations while selling the rest, two people familiar with the matter told Reuters.UBS is studying plans to sell the Swiss banking business of Credit Suisse in an initial public offering (IPO) after taking over its smaller rival, the people said, speaking on condition of anonymity.The considerations are at an early stage as UBS is focused on completing that takeover and it may not make a final decision on whether to pursue an IPO for months, another person said.UBS and Credit Suisse declined to comment.UBS is racing to complete the state-backed rescue takeover of Credit Suisse that will create a banking giant overseeing more than $5 trillion in total invested assets.The future of Credit Suisse's business in Switzerland is being closely watched as one of UBS's key strategic decisions. A combination with UBS would create a dominant position in the Swiss loan market, according to analysts at Jefferies. The merger has drawn concern from lawmakers that it could lead to reduced competition.Credit Suisse's Swiss bank is one of the lender's four operating units and is seen as the jewel in the crown. The unit reported pre-tax income of 1.5 billion Swiss francs ($1.7 billion) in 2022.",
        "Stripping out its investment banking operations would reverse a move from just a few months ago. In January, Credit Suisse had moved the business from its broader investment banking division into the Swiss unit, according to Credit Suisse's 2022 annual report. The two Zurich-based neighbours for decades have competed head-to-head for mergers and share sales across the world and UBS, which has lagged behind Credit Suisse in dealmaking and share sale rankings, looks to bolster its investment banking business.UBS Chief Executive Sergio Ermotti said on Wednesday that his bank was working on closing its merger with Credit Suisse by the end of May or early June. On a possible sale, Ermotti has said all options for the Swiss business are on the table.On Sunday, NZZ am Sonntag newspaper reported that UBS was working towards spinning off Credit Suisse's domestic unit. The Swiss newspaper cited a source as saying that UBS had come around to the idea of a spin-off, which it initially ruled out, because of growing public and political pressure.($1 = 0.8848 Swiss francs) (Reporting by Emma-Victoria Farr and Oliver Hirt, additional reporting by Pablo Mayo Cerqueiro and Andres Gonzales Editing by Elisa Martinuzzi and Tomasz Janowski)"
    ]
}