{
    "articleURL": "/sport/football/article-12043667/DAVID-COVERDALE-Sam-Allardyce-holds-court-four-game-spell-Leeds-begins.html",
    "content": [
        "Sam Allardyce has been drafted in by a desperate Leeds to secure their survivalThe ex-Bolton and England boss will be paid £500,000 for four games His first press conference was like he had never been away as he rolled the hitsHe issued a fine for a phone going off, took aim at the judiciary, revealed he nearly died from Covid and claimed he was as good as Pep Guardiola. Yes, Big Sam is back – and it is as if he has never been away.",
        "‘Two seconds’ was all Sam Allardyce said it took for him to accept Leeds United’s offer to return to management after two years out of the game. No wonder, really, given he could bank £3million if he pulls off what he admits would be the greatest of all his great escapes.Such was his excitement about being back in the big time, Allardyce conducted a live radio interview from his new office at Leeds’ Thorp Arch training ground even before his appointment – and the sacking of Javi Gracia - had been confirmed by the club.That announcement finally came at 10.30am and, following his first training session, he was in front of the TV cameras by 4pm. There, Allardyce was in his element, holding court for almost 45 minutes, three times the length of his predecessor’s rather more mundane media addresses.",
        "‘We start with an easy one on Saturday,’ grinned the 68-year-old. ‘You can’t really get any easier, can you?’ That ‘easy’ fixture is at champions Manchester City. Then, he takes on two of his former clubs, Newcastle at home and West Ham away, before Tottenham visit on the final day of the season.‘To try and save this club and keep it in the Premier League is a big responsibility and a big challenge but one I was prepared to take because of who Leeds United are,’ said Allardyce, whose side are only out of the relegation zone on goal difference and have not won in five games.",
        "‘It is probably my biggest challenge because of the shortness of games that are left. From the great escape point of view, it would be the greatest, because it is only four games.‘We have to pull off a surprise win from somewhere. I don’t think anybody outside of Leeds expects us to win any of these four games. Hopefully we can shock a few people in the Premier League.’Allardyce, though, would have liked longer. When Jesse Marsch was sacked in February, it is understood he offered his services to Leeds chief executive Angus Kinnear – who he worked with at West Ham. But his advances were ignored, with Victor Orta – the club’s then director of football who was sacked on Tuesday – scouring the continent and somehow ending up at Gracia’s door.‘In the highlight of this year when they've had their troubles, they've always known where I am,’ said Allardyce. ‘The football club chooses which way it wants to go and far too many people think I'm old and antiquated, which is so far from the truth. I might be 68 and look old but there's nobody ahead of me in football terms. Not Pep, not (Jurgen) Klopp, not (Mikel) Arteta.’It was quite a claim but Allardyce knew exactly what he was doing. ‘I’ve just given you a big headline,’ he later said with a twinkle in his eye. ‘I can see it tomorrow – that will be wonderful.’",
        "Allardyce, though, does genuinely believe he has what it takes to stop the Whites from sinking – firstly by shoring up a defence which conceded a Premier League record 23 goals last month.‘The first thing that we’re going to have to do is to stop that if we’re going to get out of trouble,’ he said. And that could include dropping goalkeeper Illan Meslier, whose form and confidence has plummeted in recent weeks.‘We will have a conversation,’ said Allardyce. ‘Unfortunately, he's made mistakes and they’ve cost a couple of goals right at the wrong time. We will make that decision on Friday.’",
        "Assisting Allardyce at Leeds will be Karl Robinson, who was sacked by League One Oxford in February, after his usual sidekick Sammy Lee was ruled out because he is on jury service. ‘The judge has left Sammy unemployed and I find that to be very poor judgement indeed,’ said Allardyce in an unexpected swipe.Robbie Keane, who played for Leeds two decades ago, has also joined his coaching staff. ‘Robbie got a call this morning and came from Ireland by 2pm this afternoon with his bag packed,’ smiled Allardyce. ‘Everything had to move very quickly. I have never moved as quickly in my entire life over a position. I have missed a Covid injection to be here today.’",
        "Talk of Covid then led to one final Allardyce anecdote. ‘Before Covid had come into this country, I must have caught it in Dubai and I was violently ill for about four weeks,’ he revealed. ‘The doctors didn’t know what was wrong with me and no antibiotic worked. I thought I was in big trouble.’Big Sam survived that episode – now can he save Leeds?"
    ]
}