{
    "articleURL": "/tvshowbiz/article-12044125/BBCs-Reeta-Chakrabarti-says-newsreader-50s-invigorating.html",
    "content": [
        "Reeta Chakrabarti has revealed that becoming a newsreader in her 50s was 'invigorating' in a new interview. ",
        "The BBC presenter, 58, started out as a producer on BBC Radio 4 working on the Today programme, and later held roles such as education and political correspondent. She is now known for presenting BBC News at One, Six and Ten - even travelling to Ukraine last year to cover Russia's invasion. But in an interview with Good Housekeeping, Reeta revealed that she hadn't ever expected to become a newsreader. She said: 'It's quite astonishing, actually... I didn't start presenting until I was 49, which might have ordinarily been a stage when I thought being a correspondent was it. ",
        "'But instead, I was given this new opportunity in my 50s and I found it very invigorating, it's been a sort of turning point in my career.' Reeta met King Charles - then Prince Of Wales - in 2007, revealing that she was 'very impressed' with what she saw. She said: 'I met him in 2007 during a reception at Clarence House … I was standing with Clare Balding, who knows him very well, and when he came to us, he was very relaxed. 'I was reporting on politics at the time, and he was very interested in my work. I remember thinking: \"Gosh, he must have to remember who everybody is in this room of 150 guests\" – and it seemed like he did. I was very impressed.' ",
        "In March 2022, she presented from Lviv in Ukraine as Russia's invasion unfolded. But the decision to leave the UK was not an easy one - especially after discussions with her husband and children. Reeta is married to Paul Hamilton, a professor at Queen Mary University of London. The couple share three children. ",
        "The BBC legend says she is now looking forward to what is to come for her career in her 60s. She added: 'It doesn't make any sense to me that I'll be 60… ",
        "'I've tended to find that the numbers at the beginning of a decade are much better than those at the end because when you enter a new decade, it feels like a fresh start.' Reeta then dished the dirt on whether she would ever appear on a series of Strictly Come Dancing, where she would follow in the likes of fellow BBC stars Naga Munchetty, Carol Kirkwood and Chris Hollins. She admitted that as much as she would love to do the show, she doesn't think she would get involved because it wouldn't suit the 'serious' aspect of her job.In April top BBC presenters, including Reeta, were targeted by redundancy letters. Huw Edwards, Clive Myrie and Sophie Raworth were also understood to have been sent the letters. ",
        "Some of the corporations most famous names were hit with the requests to consider voluntarily ending their careers as part of cost-cutting measures. The June 2023 issue of Good Housekeeping is on sale from the 4th May. "
    ]
}