{
    "articleURL": "/wires/ap/article-12057669/Devils-answer-Game-3-rout-Canes-8-4-deficit-2-1.html",
    "content": [
        "NEWARK, N.J. (AP) - With their season on the line once again, Jack Hughes stepped up for the New Jersey Devils and the budding superstar delivered with his stick, his skates and even a few totally unexpected punches.",
        "Hughes scored two goals, set up two more and had a near fight with Carolina star Sebastian Aho as the Devils began the task of digging out of another hole with a 8-4 win over the Hurricanes in Game 3 of the Eastern Conference semifinals Sunday.Hughes set the tone early with an assist on Timo Meier's goal with a pass from behind the net and ripping a second shot past Frederik Andersen five minutes later.\"I think we were just focused right from the get go,\" said Hughes, who is nominated for this year's Lady Byng award for sportsmanship. \"Up and down the lineup, a lot of compete - a lot of guys winning their battles, a lot of skating. That´s our game.\"What wasn't Hughes' game was his second-period dust-up with Aho in front of the Carolina net. Hughes picked up the Finnish player and attempted to body slam him to the ice. A couple of punches were attempted with no damage inflicted.Hughes, who has never had a fighting major, got two-minutes for roughing and Aho got four minutes, the extra two because of a cross-check.",
        "\"I think that kills his chance for the Lady Byng,\" Devils coach Lindy Ruff quipped. \"And really, what was he thinking?\"Besides Meier, Nico Hischier and Damon Severson added their first goals of playoffs and Vitek Vanecek returned to the net and made 26 saves and even had an assist on Miles Wood's third-period breakaway.",
        "\"It feels good. It´s a series now so that´s what we wanted to do, have a bounce-back game and scoring eight goals is a statement,\" Hischier said. \"We still have a couple things to clean up but, hey, we´ll take a win now and it´s 2-1.\"The eight goals were the most for the Devils in a playoff game since they beat Washington 10-4 on April 22, 1988.Michael McLeod capped a three-goal opening period with a short-handed goal and 19-year-old defenseman Luke Hughes - Jack's brother - made his playoff debut and picked up two assists. Dawson Mercer had three assists.Carolina tied an NHL record with three short-handed goals, matching the 1983 New York Islanders, 1983 Edmonton Oilers and 1981 Boston Bruins. Jordan Martinook scored on a penalty shot in the second period with the Canes down a man and Jordan Staal and Seth Jarvis scored 50 seconds apart on the same penalty kill in the third.\"We knew they were going to come with a push,\" Staal said. \"They were ready for us. They didn't do anything crazy special. They got the puck in and played our style of game. They did it better than us tonight.\"Aho had other goal for the Hurricanes. Andersen, who allowed two goals on 48 shots in the first two games of the series, gave up four on 12 shots before being replaced by Pyotr Kochetkov early in the second period.",
        "This was a totally different game than the first two in Raleigh, North Carolina, which the Canes won by a combined 11-2 score. They dominated from start to finish in both games.\"We were not good,\" Carolina coach Rod Brind'Amour said. \"I have never seen us play like that.\"Meier opened the scoring at 5:58, stuffing a puck past Andersen from in close. Hughes followed after taking a pass from Smith and McLeod added his shorthanded goal in close at 12:31.It was never close after that.INJURIESDevils defenseman Ryan Graves did not play because of an upper-body injury sustained in Game 2. Luke Hughes replaced him and coach Lindy Ruff also dressed Smith, giving him seven D-men. ... Hurricanes goaltender Antti Raanta has not dressed as the backup the last two games because of an illness. Kochetkov has been the backup, and made 18 saves on 22 shots.NOTESCarolina failed in its attempt to take its first 3-0 lead in a series since round 2 in 2019. ... The Devils are looking to become the third team in NHL history to win multiple series during a playoff year after overcoming a 2-0 deficit. They were down two games in the first round against the Rangers. Boston accomplished the feat 2011, two years after Pittsburgh. ... Ondrej Palat had a goal and an assist and now has 101 career playoff points (51-50) in 148 games.",
        "___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}