{
    "articleURL": "/wires/pa/article-12048887/Sturgeon-If-I-touting-jobs-leader-come-out.html",
    "content": [
        "Nicola Sturgeon has denied pursuing other jobs during her time as Scotland’s first minister, insisting if she had been it would have been found out.",
        "The former leader of the SNP told the Nicola Sturgeon Podcast, on BBC Sounds, that she would remain in the Scottish Parliament until at least the next election and resigning as first minister was the “biggest life change” she had gone through which would see her have to “almost re-wire how my brain works”.Ms Sturgeon, 52, said on the sixth episode of the series that she had “not been pursuing other opportunities” when co-host Glenn Campbell put to her rumours about her getting a job somewhere like the United Nations.“You know as well as I do, if I had been away touting myself for other jobs, you would know about it because these things would never be secret, and I haven’t. I have been focused on this job, I don’t know what I want to do next,” she told the podcast.",
        "Ms Sturgeon spoke to the broadcaster before turmoil hit the SNP when police arrested her husband Peter Murrell, raided the home she shared with him and her party’s headquarters, seized a campervan, and then later arrested now-former party treasurer Colin Beattie as part of an investigation into how more than £600,000 in donations to the party earmarked for an independence referendum had been used.Both Mr Murrell and Mr Beattie were released without charge.",
        "Ms Sturgeon, who joined the SNP at the age of 16, was among the first MSPs elected to the Scottish Parliament in 1999, and became first minister in November 2014 after her predecessor Alex Salmond stood down in the aftermath of the independence referendum that year – which saw Scots vote by 55% to 45% to remain part of the UK.She told the BBC that she would remain in parliament, but had not yet decided if she would fight to remain in Holyrood at the next election.“And who knows what the future holds? I’ve said before I would probably choose to write down the last 30 years, whether anybody will ever want to read it is another matter but I would probably choose to do it for therapy,” she said.Ms Sturgeon announced her resignation at Bute House in February.And she told the podcast that since then it had “become much more obvious” to her that there was “a process of decompression” that she had to go through.“This is the biggest life change I’ve ever gone through,” the former first minister said.“I don’t think it will always be easy, I think I’m going to go through a period of adjustment and having to adapt to a different way of life that at times, I guess, I will find difficult.",
        "“I am going to have to, I was thinking about this just the other day, almost re-wire how my brain works.“And none of that is going to happen overnight. And I think I’m just going to have to take it as it comes for a while and see how it all goes.”"
    ]
}