{
    "articleURL": "/news/article-12060841/Paranoid-Putin-send-body-double-host-major-Russian-military-display.html",
    "content": [
        "The claim came from Kyiv government official Anton GerashchenkoThe Kremlin has previously denied that Putin has a body double Ukraine claims Vladimir Putin will send a body double to host a huge military parade on Red Square on Tuesday due to a 'paranoid fear for his life'.",
        "The extraordinary claim came from Kyiv government official Anton Gerashchenko.'Putin will not dare to appear at the parade on May 9, but will send a double,' he said.Rumours of Putin using doppelgängers - who have undergone plastic surgery to look like Putin - predate the war against Ukraine but have intensified recently, however unlikely such a theory is.He is said to be fearful of assassination because of the war against Ukraine.",
        "'A drone strike on the Kremlin on 3 May further heightened Putin's fears,' said Gerashchenko, an advisor to the Ukraine interior ministry and former deputy minister.'Now the chances that he, and not some character playing his role, will participate in the parade on 9 May, are equal to zero.'Real fears for his life will force Putin to sit in a bunker, sending another double [onto Red Square].'Putin has a 'paranoid fear for his life' but the doubles show subtle differences to the real Putin due to 'inconsistencies in appearance', he said.And while the real Putin keeps 20ft distance from interlocutors, the doubles are sent to shake hands with people and meet large groups at close quarters.",
        "Russian opposition Telegram channel General SVR echoed the Ukrainian claim.It alleged that Putin will not make a 'risky' appearance at the parade.",
        "'The presence of a double is planned,' said the channel.The aim is that Putin be seen as a 'hero' for hosting the giant parade days after the drone attack on the Kremlin - even though the real dictator is hiding in a bunker.The channel also claims that Putin's security operatives staged the drone strike as a false flag.And it says that the real Putin is ill with cancer and under the constant supervision of doctors, but despite this wrote the speech for the 'understudy' to deliver.The channel is supposedly run by an exiled Kremlin lieutenant-general, known by the alias Viktor Mikhailovich, and claims inside knowledge.Putin has been seen seldom in recent days.",
        "However, today he appeared briefly in Kremlin footage greeting President Sadyr Zhaparov of Kyrgyzstan, one of only a handful of foreign leaders who have flown in to attend the 9 May event.Body doubles were used by former Kremlin leaders, for example longtime Soviet supremos Josef Stalin and Leonid Brezhnev.Putin three years ago confessed that officials had considered using doubles for him, but he claimed the idea was rejected.'I discarded the idea of any doubles,' he said.He admitted the proposal came up in the early 2000s when Russia was hit by terrorist attacks.",
        "It was suggested a lookalike should take his place at events where the head of state might be at risk, he said.'This was during the toughest time of our war against terrorism.'"
    ]
}