{
    "articleURL": "/wires/ap/article-12048221/Commanders-supporting-DC-efforts-control-RFK-Stadium-site.html",
    "content": [
        "The Washington Commanders say they are supporting efforts by the District of Columbia to get control of the RFK Stadium site that used to be the NFL team's home.",
        "A team spokesperson said Thursday officials are communicating with stakeholders at the federal and local levels about the RFK site.\"(We are) sharing our vision for a potential venue at that will create jobs and economic growth for the region and be compatible with the surrounding community and the elected leaders of the District,\" the spokesperson said in a statement sent to The Associated Press.The land less than roughly 2 miles (3.22 kilometers) east of the U.S. Capitol is currently owned by the federal government, and congressional control is one of the biggest obstacles to potentially building a new state-of-the-art football stadium on the site, the future of which has been a matter of considerable debate.One major question around the RFK Stadium site is whether the D.C. government would approve construction of a mixed-use entertainment complex on the land just west of the Anacostia River.While several D.C. City Council members have voiced their opposition to building a stadium there, mayor Muriel Bowser has supported the idea and continues to do so.",
        "\"We have a unique opportunity to transform unused federal land at the RFK campus into a mixed-use destination that could also bring the beloved Washington Commanders back home,\" a spokesperson for the mayor's office said in an email reply to The AP. \"We look forward to continued conversations with the team and our federal and local partners to get this win for Washington.\"",
        "It´s not clear how new ownership might approach the situation once Josh Harris´ group buys the team from Dan Snyder. There's an agreement in principle in place to sell the storied franchise for a record $6.05 billion, pending league approval among other steps.Washington played home games at RFK Stadium from 1961-1996 before moving to FedEx Field in Landover, Maryland. Rushed to completion under previous owner Jack Kent Cooke, that stadium has not aged well in the decades since.Finding a new stadium site is the top long-term priority for the new owners once they assume control of the organization, with places in D.C., Maryland and Virginia still among the options. Last year, Virginia's General Assembly abandoned a stadium bill and Maryland took steps to make bonds available for possible stadium construction.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}