{
    "articleURL": "/sport/nrl/article-12055945/Spine-tingling-moment-Dolphins-NRL-star-Valynce-Te-Whare-performed-haka-Magic-Round-win.html",
    "content": [
        " Valynce Te Whare performs haka after victory Rookie scored two memorable tries on debut Te Whare switched from rugby union last yearEmotions ran high for Dolphins rookie Valynce Te Whare, who performed an electrifying haka with teammates, friends and family after a two-try fairytale NRL debut.",
        "The young centre, who worked previously as a groundskeeper at Dolphin Oval, made a big impression in his side's dominant 36-16 win over Cronulla on Saturday by scoring two tries, six tackle busts and running 72 metres.Te Whare only switched from rugby union to rugby league last year, and was overjoyed by the fantastic result against Cronulla.'It's just a good feeling to be out on the paddock,' he told Fox League post game.'It's been a hard journey, I only came over here last year start of January. Switching codes, I had nothing at home so I just came over ... took the opportunity with the team with two hands, grinded for a year and kept grinding and here I am.'",
        "After the final whistle, the debutant performed a haka with his friends and family close by in the stands. Teammates Kodi Nikorima and Kenny Bromwich rushed to join in on the impromptu war dance.Moments later, Te Whare could be seen embracing family members in the crowd.The debutant gave credit to coach Wayne Bennett for backing him.'Wayne has had a big influence and he just kept it really simple with me,' Te Whare said.'He didn't overcomplicate it. He told me to run hard and tackle hard and have fun. Those were the three main things he told me to do and that's what I did tonight.",
        "'It has just been an awesome journey. I can't really speak. I'm speechless sorry.'",
        "Dolphins teammate Felise Kaufusi said there's more to come from the barnstorming Kiwi.'You have just seen a glimpse of his potential,' Kaufusi said.'He is so big, so powerful and so fast for his size. He scored two tonight.'I guess that is a credit to our recruitment who saw some potential in him.'I'm just happy for him to get a start in the NRL.'"
    ]
}