{
    "articleURL": "/wires/ap/article-12052917/Georgia-enacts-law-letting-panel-punish-oust-prosecutors.html",
    "content": [
        "ATLANTA (AP) - Gov. Brian Kemp signed a bill into law Friday creating a new commission empowered to discipline and remove wayward prosecutors, saying it will curb \"far-left prosecutors\" who are \"making our communities less safe.\"",
        "Kemp made the remarks at the Chatham County Sheriff's Office in Savannah, where he signed the measure establishing the Prosecuting Attorneys Qualifications Commission, which will launch July 1 and start accepting complaints Oct. 1.\"I am not going to stand idly by as rogue or incompetent prosecutors refuse to uphold the law,\" Kemp said. \"Today we are sending a message that we will not forfeit public safety for prosecutors to let criminals off the hook.\"The law parallels pushes to remove prosecutors in Florida, Indiana, Missouri and Pennsylvania, as well as broader disputes nationwide over how certain criminal offenses should be charged.The efforts continue anti-crime campaigns that Republicans ran nationwide last year, accusing Democrats of coddling criminals and improperly refusing to prosecute whole categories of crimes, including marijuana possession.Georgia Democrats strenuously opposed the measure, saying the Republican legislative majority was seeking another way to impose its will on Democratic voters at the local level.\"I strongly oppose an excessive and unnecessary commission as district attorneys are already held accountable under existing laws and through the current democratic process of holding election,\" said Deborah Gonzalez, Democratic district attorney for Athens-Clarke and Oconee counties.Gonzalez, under fire in Kemp´s hometown of Athens, was cited by Republicans as one of the law's top targets. She has declined to prosecute marijuana crimes, some prosecutors have left her office and judges have criticized her for missing court deadlines.",
        "Crucially, the Georgia law mandates that a prosecutor must consider every case for which probable cause exists and can´t exclude categories of cases from prosecution.Experts have said that considering every case individually is unrealistic, because prosecutors turn down many more cases than they charge. However, it´s unclear if the new law will change prosecutors´ behavior or just lead them to avoid talking publicly about charging decisions.The eight-member commission will include six current or former prosecutors and two other lawyers. It will oversee DAs and solicitors general - elected prosecutors who handle lower-level crimes in some counties.Fulton County District Attorney Fani Willis has also decried the measure, calling it a racist attack after voters elected 14 nonwhite DAs in the state. Some have viewed the law as Republican retribution against Willis, who is considering criminal charges against former President Donald Trump over interference in Georgia´s 2020 election. Willis declined further comment Friday.The law was born from frustrations involving a white Republican prosecutor in suburban Atlanta who was indicted for bribery related to sexual harassment claims. He lingered in office until he pleaded guilty to unprofessional conduct and resigned in 2022.Some Democrats were interested in similar measures for a time because of Jackie Johnson, a coastal Georgia DA who was charged with hindering the police investigation into the 2020 killing of Ahmaud Arbery. Democratic interest cooled after voters ousted Johnson.",
        "The rules could also target prosecutors who declared before Roe v. Wade was overturned in 2022 that they wouldn't prosecute abortion-related offenses. Seven current Georgia DAs fit that description.Nationwide, the efforts aimed at curbing prosecutors have met with mixed success.In Missouri, St. Louis Circuit Attorney Kim Gardner announced on Thursday that she will resign June 1 as Republicans maneuvered to oust the Democrat. A bill was proceeding to let Republican Gov. Mike Parson appoint a special prosecutor to handle violent crimes, taking over most of Gardner's responsibilities, but her resignation could sideline the bill. Missouri's Republican attorney general, Andrew Bailey, was pursuing legal steps to remove Gardner.An Indiana bill originally written to let an oversight board appoint a special prosecutor when a \"noncompliant\" prosecutor refused to charge certain crimes appears dead for the year.Efforts by Pennsylvania Republicans to impeach Philadelphia District Attorney Larry Krasner are stalled pending a court appeal. In the meantime the state House has flipped from Republican to Democratic control and, it´s unclear what that would mean for any trial.And in Florida, Republican Gov. Ron DeSantis suspended State Attorney Andrew Warren in Tampa´s Hillsborough County in August. A federal judge found DeSantis illegally targeted Warren because he´s a Democrat who publicly supported abortion and transgender rights. But the judge wrote he had no power to reinstate Warren, leading to an appeal to the state Supreme Court."
    ]
}