{
    "articleURL": "/sport/football/article-12052775/West-Ham-David-Moyes-hoping-welcome-six-footers-against-Man-United.html",
    "content": [
        "West Ham's David Moyes says 'six-footers' are back to bully Manchester UnitedDeclan Rice, Tomas Soucek and Nayef Aguerd missed their 3-0 loss vs Man City The imposing trio trained on Friday, before the Hammers host United on SundayDavid Moyes says his 'six-footers' are back to bully Manchester United after Declan Rice, Tomas Soucek and Nayef Aguerd missed their midweek 3-0 loss against Manchester City with a mystery illness.",
        "The West Ham trio trained on Friday, the morning after Moyes spent the night studying United in their 1-0 defeat by Brighton. The Scot had his cable guy to thank for fixing his TV in his Canary Wharf flat in time to do his homework on Erik ten Hag's team, who are feeling the pressure in the Premier League's fourth position.Moyes wants to pile more misery on the club he previously managed and said: 'We were short of stature (against City) because of the three people who were ill. All six-footers, which didn't help. It is huge.'City have the likes of (Manuel) Akanji, (Ruben) Dias, (John) Stones, Kyle Walker, Rodri, never mind (Erling) Haaland. You are up against five or six real big boys and it means they can't be pushed over.' ",
        "Asked if United look like they are feeling the heat, Moyes said: 'They should see how I feel! If you manage a big club like Manchester United, success and winning is really important.' Moyes said he is confident they can handle the threat of Antony, United's left-footed right winger, as they took care of Arsenal's own inverted winger Bukayo Saka when he visited the London Stadium.'We're going through a 10-year cycle at the moment of inverted wingers,' Moyes said. Years and years ago we were talking about wingers going outside and putting crosses in.",
        "'It sounds simple but it's very difficult to take the ball off them because they're always protecting it. 'Hopefully we can try to stop it. We've had to do a good job on players like Saka who does the exact same thing for Arsenal.'"
    ]
}