{
    "articleURL": "/tvshowbiz/article-12047971/Priyanka-Chopra-SLAMS-Met-Gala-not-serving-BREAD-dinner.html",
    "content": [
        "Priyanka Chopra was not one hundred percent pleased with the Met Gala in NYC on Monday evening.",
        "The actress, who is plugging her series Citadel as well as her movie Love Again, said there was something missing for her.And it was an item that is served for free at many restaurants.Turns out the wife of Nick Jonas felt the dinner would have been more satisfying if the caterers had served some bread and butter. 'There was no bread for dinner […] I was so hungry after,' the India born star told Good Morning America on Thursday.'Maybe I have unrealistic expectations, but one roll of bread would be sufficient.' ",
        "The dinner menu consisted of 'chilled spring pea soup with baby vegetables, lemon crème fraîche, and truffle snow, followed by Ōra King salmon with vegetable nage, asparagus, pickled strawberries, and radish—all served on vintage china,' reported Vogue. Priyanka said her spouse came to the rescue: 'My husband ordered pizza by the time we got to the hotel, so we were fine.'And Chopra admitted that her criticism may have gotten her kicked off the guest list for 2024. 'There goes my invite for next year. If you don't see me at the Met, you know why.' The Quantico actress wore a pale pink satin dress that showed her legs while on the morning program.And she was joined by actor Sam Heughan to discuss new rom-com film Love Again.",
        "They also touched on karaoke singing Celine Dion's classic hits after days of filming, as well as shooting with Dion as well as Chopra's husband, Nick.",
        "GMA also gave viewers an exclusive first listen to Dion's new track I'll Be from the motion picture soundtrack.The movie opens May 5.The synopsis reads, 'Coping with the loss of her fiance, Mira Ray sends a series of romantic texts to his old cellphone number, not realizing it was reassigned to journalist Rob Burns. Rob becomes captivated by the honesty of her words in the beautifully constructed texts. When he's assigned to write a profile of superstar Celine Dion, he enlists her help to figure out how to meet Mira in person -- and win her heart.'",
        "Priyanka's Met Gala food comments come after Teyana Taylor said she ate a plate full of Chick-fil-A she brought herself.Teyana, 32, was called out by tablemate Pusha T, 45, who joked she was 'embarrassing' him for bringing the fast food to the exclusive bash.'@teyanataylor is embarrassing me. She brought @chicfilausa to the #MetGala. I want her away from me... #HARLEM,' he wrote on an Instagram video capturing her plate full of fries, fried chicken, with a side of dip.Even Usher, 44, tried to interfere - the R&amp;B artist chuckled at the sight of Teyana munching on her fast food.",
        "'#HARLEM @teyanataylor @usher tried to stop her...' Pusha T posted, along with a face slapping emoji.",
        "Teyana appeared be teasing Pusha for their different plates as she compared the bowl of partially-consumed pea soup with her own dinner.'It's two types of ppl,' she wrote with crying laughing emojis.Monday night's theme was Karl Lagerfeld: A Line of Beauty, and the menu was curated to pay tribute to the late fashion designer.'This menu was designed to honor the late fashion icon and pay homage to his favorite foods and global palate,' Olivier Cheng, the Vogue special events department and caterer, told the fashion bible.'These dishes were created to maintain seasonality while using some of his favorite ingredients, such as King salmon. There is a sophisticated elegance to these pairings, one we feel that he would have truly enjoyed,' Olivier said.Chopra is hardly the first who has criticized the Met Gala.",
        "In 2013 Gwyneth Paltrow told Australian radio show hosts Kyle and Jackie O, 'It sucked' as she vowed to not go back because it was 'so un-fun.'But in she went back in 2017 and 2019.After attending the 2016 gala, Demi Lovato told Billboard it was 'a terrible experience.'And she added one star 'was a complete bitch and was miserable to be around.'",
        "The singer then added: 'It was very cliquey. I remember being so uncomfortable that I wanted to drink. I changed my clothes, but I still had my diamonds on … I related more to the homeless people in [AA] meeting who struggled with the same struggles that I deal with than the people at the Met Gala.'Madonna's daughter said the gala was not her 'vibe' after making her debut in 2021.'",
        "'I'm sure it's fun if you're someone who is friends with a lot of famous people, but I'm not. I didn't know who the f*** to talk to. I felt so awkward that I literally called my boyfriend in the middle of it.'In 2016 Amy Schumer told Howard Stern she didn't like it.'I have no interest in fashion. I like the idea of coming up with a way to dress that's more comfortable, that looks cool, that sounds good to me. But other than that, I don't care.'Tina Fey called it a 'jerk parade' in 2015 when on David Letterman: 'If you had a million arms and all the people you would punch in the whole world, they're all there. It is so unbelievable. Clearly, I'll never go again. But you go. It's this beautiful space and it's just every jerk from every walk of life is there wearing, like, some stupid thing.'"
    ]
}