{
    "articleURL": "/wires/reuters/article-12054243/Germanys-Scholz-says-renewables-key-lower-industry-costs.html",
    "content": [
        "May 6 (Reuters) - Ramping up renewable power production rather than subsidies is the key to lower electricity prices for Germany's energy-hungry industry, Chancellor Olaf Scholz said on Saturday, in an apparent dig at proposals by his government's economy minister.",
        "Industrial companies in Germany say electricity prices are too high compared with other countries, putting Germany's heavy industry at a structural disadvantage to other manufacturing centres such as the United States and China.Germany's economy ministry, led by Robert Habeck of the Greens, this week released a plan for a subsidized price of 6 cents per kilowatt hour (kWh) until 2030.But the finance ministry of Scholz's coalition government swiftly pushed back against the subsidy scheme on Friday, saying there was no budget for it.\"There are regions already today where power production is as cheap as we want it to be so that industrial operations can prevail against global competition without subsidies,\" Scholz said, when asked to comment on how to best lower power prices.To extend this for the whole of Germany, Scholz said everything within his powers needed to be done to boost power transmission networks and renewable power production.Scholz was speaking to journalists at a geothermal power plant in Kenya during a trip to Africa.\"We know today already that we will have lower power prices than today, once we reached our goal that renewable energies dominate electricity production in Germany,\" he added.Habeck's economy ministry has said the proposed subsidy would be in place until 2030, costing between 25 billion euros ($28 billion) and 30 billion euros at current market prices.",
        "Scholz previously voiced scepticism about the initiative, saying long-term subsidies were not beneficial for the economy. ($1 = 0.9071 euros) (Reporting by Ludwig Burger and Andreas Rinke; Editing by Alexander Smith)"
    ]
}