{
    "articleURL": "/money/buytolet/article-12038079/Bonkers-EPC-eco-rules-forcing-buy-let-landlords-spend-20-000-green-homes.html",
    "content": [
        "Landlords will be barred from letting out properties with EPC ratings less than C 13% of homes in England and Wales, around 14.6m properties, are rated E, F or GThose who fail face a £30,000 fine as part of the latest energy-efficiency drive Energy assessors are speaking out against the Government’s ‘unrealistic’ eco requirements for landlords, warning that even their own homes would fail the new standards.",
        "Landlords will soon be barred from letting properties in England and Wales unless they upgrade them to an Energy Performance Certificate (EPC) rating of C — the third most efficient category — or higher.Those who fail face a £30,000 fine, as part of the Government’s latest energy-efficiency drive to cut household bills and reduce carbon emissions. EPC ratings are the key measure used in Britain to judge how ‘green’ a home is and how much it costs to heat. Your property is rated from A to G, with A being the most energy efficient.",
        "But experts in the field tell Money Mail that these green demands go too far, as it costs the average home £20,000 to get up to standard. At present, let properties must have a minimum EPC rating of E.These hefty costs will be passed down to unsuspecting tenants, who will be forced to pay more in rent and could be displaced during home improvements. In the worst cases, assessors claim it will be impossible to get some homes up to a C band.Two in three landlords could be forced to sell their buy-to-let properties in the next five years, as they fear they will be unable to meet these requirements, according to a survey by the Mortgage Advice Bureau.",
        "In March, the Government extended its EPC deadline for newly let rentals by three years, from 2025 to 2028, after it was warned that the plan risked driving out landlords.James Court, who was among the first to qualify as an EPC assessor in 2007 and visits more than 100 homes a year, says: ‘I can’t understand why the Government is aspiring to such a high level. 'If they wanted everyone to meet the average D rating, it would make sense, but C is unattainable for a lot of people.’",
        "According to the English Housing Survey, some 13 per cent of homes in England and Wales — around 14.6 million properties — are rated E, F or G. James’s own home in Leicester is D-rated, but he believes it is efficient enough. The 58-year-old says: ‘We have cavity wall insulation, double glazing and a modern boiler — why isn’t that sufficient?’M any homes would need wall insulation to meet the new standard, which would cost up to £15,000 and be disruptive, he says. ‘I don’t see how it’s possible to add internal wall insulation with tenants living in the property, and the saving on bills later on would be negligible.‘I know of one landlord who had 19 properties and now only has three left. As a landlord myself, I know how hard it is to get them up to a C rating.’",
        "John Bradbury, a retrofit coordinator from Bingley, in West Yorkshire, who assesses properties to increase their EPC ratings daily, warns that landlords will struggle to improve their homes in time.John, 49, says that the majority of those he visits are rated E, F or G. ‘It is expensive — the average air source heat pump would cost £10,000 to install, for example.‘But another big hurdle will be in finding the workers to do the job in the first place. We already find it difficult to book workers in to do wall insulation,’ he says.A nationwide deadline could trigger a rush of buy-to-let owners trying to upgrade their homes at the same time, making labour even more scarce and pushing prices higher, he adds.",
        "Last November, the Government announced a £1 billion grant to insulate Britain’s draughtiest homes under its ECO+ scheme, set to run until March 2026.But only those with low energy-efficiency ratings in lower council tax bands are expected to qualify, with savings of around £310 a year available. John says the rules around eligibility are ‘perverse’, adding: ‘There is more funding for bigger properties. It means that the people who need help the most are often unable to get it.’One 60-year-old domestic energy assessor from Cornwall says it is unfair that landlords may be forced to sell their properties as a result of the poor ratings he gives them.",
        "‘If I had to upgrade my own home I would have no choice but to sell it,’ he says. ‘Where I live there is no mains gas, so we get an F due to the extra costs of having to run our boiler on bottled gas. 'There’s not much that can be done to improve the rating, barring trying to clad the outside of a building in a heritage area.’",
        "Landlords can get an exemption if it is not possible to improve the energy efficiency of a property.An EPC costs between £60 and £100 and involves an assessor visiting your home to do a survey.Simon Brown, from Wiltshire, whose name has been changed, says the new rules are ‘disastrous’ for tenants and landlords. Of Simon’s four buy-to-lets, split across Surrey and Cheshire, two are C-rated and the others have an E grade.The 47-year-old fears he will be forced to sell at least one property, displacing his longest-serving tenant, who has lived there for almost 20 years.High mortgage costs on the two-bed house in Macclesfield, Cheshire, combined with expensive eco upgrades, mean it is no longer profitable.‘Sadly, the real loser here is the tenant who will be forced to leave his home,’ says Simon. ‘He will go on to pay much higher rent, because I allow him to pay below market value due to his loyalty.’",
        "Simon is becoming increasingly frustrated with ‘constant meddling’ from the Government and says that private landlords are approaching a fork in the road.‘It is done in the name of protecting the tenant or even the planet, but sometimes it’s clearly an attack on landlords.’A Government spokesman says: ‘We have consulted on raising the standard in a way that is fair in terms of costs to landlords. We’ll publish a summary of responses by the end of this year.’j.beard@dailymail.co.uk",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}