{
    "articleURL": "/wires/reuters/article-12050631/World-leaders-gather-London-King-Charles-coronation.html",
    "content": [
        "King Charles to host reception for world leaders",
        "Royal fans gather on The Mall for coronationAcross Britain, preparations underwayPolls show many apathetic, question cost of lavish eventBy Michael HoldenLONDON, May 5 (Reuters) - King Charles will hold a reception on Friday for world leaders gathered in London for his coronation this weekend, the biggest ceremonial event to be staged in Britain for 70 years.Charles, 74, and his wife Camilla will be crowned at London's Westminster Abbey in a glittering but solemn religious ceremony with traditions dating back some 1,000 years, followed by a procession, resplendent with pomp and pageantry.Royal fans have been gathering on The Mall, the grand boulevard that leads to Buckingham Palace, and heads of state and global dignitaries have been arriving in the British capital ahead of Saturday's event.\"It's an honor to represent the United States for this historic moment and celebrate the special relationship between our countries,\" U.S. first lady Jill Biden said on Twitter before leaving for Britain.She will be among the world leaders attending the reception at Buckingham Palace on Friday evening which the king and queen will host along with other senior members of the royal family.Earlier, Charles will hold a meeting of leaders from the Commonwealth of Nations, the voluntary associations of 56 countries which he also heads, while he will also greet prime ministers and royal representatives from the 14 other realms where he is head of state, including Australia and Canada.",
        "The leaders of Australia and New Zealand will pledge their allegiance to King Charles at his coronation on Saturday even though both are life-long republicans who do not shy away from making their positions clear.Across Britain, preparations are underway for the first coronation since 1953 when his mother Queen Elizabeth was crowned. The king has even voiced announcements for the London underground network, reminding passengers to \"mind the gap\".Charles automatically became king after the queen's death at 96 last September but the coronation, although not essential, is regarded as a hugely symbolic moment which legitimises the monarch in a public way.Set against the backdrop of a cost of living crisis, some public scepticism and in a modern era when questions are being posed about the future of the institution, its role and finances, Saturday's event will be on a smaller scale than the previous one 70 years ago.Nonetheless it will be a lavish occasion. The St Edward's Crown, which weighs about 2.2 kg (4 lb 12 ounces) and dates back to 1661 and the reign of his namesake King Charles II, will be placed on his head during the ceremony.BEJEWELLEDAmong the other historic, bejewelled items involved will be the golden Sovereign's Sceptre with Cross which holds the 530 carat Cullinan 1 diamond, also known as the Star of Africa and the world's largest colourless cut diamond.",
        "After the ceremony, there will be a mile-long procession involving some 4,000 military personnel, with the newly-crowned King Charles III and Queen Camilla returning to Buckingham Palace in the four-tonne Gold State Coach, pulled by eight horses.Thousands are expected to line the route and millions more will watch on giant screens erected at 30 locations around Britain or at home, with the event set to be broadcast live around the world.Retailers are hoping for a boost from the three-days of celebrations and street parties with the public enjoying an extra holiday on Monday. Buckingham Palace said it expected it would provide an economic lift for Britain's struggling economy.Supermarket Lidl said it had sold enough bunting to line the procession route 75 times over, and Tesco said it expected to sell enough bunting to stretch from Land's End in southwest England to the tip of Scotland. Sainsbury's said its sales of sparkling wines were up 128% year-on-year.But polls suggest far from everyone will be celebrating with a majority of the public generally apathetic about the event, and critics have questioned the cost at a time when many people are struggling to pay bills.\"They just take everything from me. They never do a day's work,\" said Philip Nash, 68, as he swept the streets in Whitechapel, a more run down area of east London.",
        "(Additional reporting by James Davey; Editing by Janet Lawrence)"
    ]
}