{
    "articleURL": "/wires/ap/article-12043415/Summer-Movies-6-breakout-performances-watch.html",
    "content": [
        "Anonymity can be an actor´s best friend, but this summer several talents are primed to make themselves known in major film roles, whether it´s losing the alien makeup, the protective shield of character work or the comforts of niche small-screen fandoms.",
        "Here are six actors bound to have audiences buzzing this summer at the movies.GRETA LEE IN \"PAST LIVES\"Greta Lee cried through her first reading of Celine Song´s \"Past Lives, \" out June 2. The writer-director had written a deeply personal story about childhood friends, and possible soulmates, who reconnect in New York decades later. Nora's in a relationship but wondering \"what if\" in this aching romance.\"Telling a love story from that point of view felt so radical to me,\" Lee said. \"It read so quiet, but I was struck by how cosmic it was too. It´s connective. It´s universal. It´s just about life and how short life is and how do we reconcile this.\"Lee, a stylish chameleon with comedic chops, has always made the most of every scene she´s in, whether it´s cooing \"Sweet Birthday Baby\" hundreds of times to Natasha Lyonne in \"Russian Doll,\" frustrating Marni as Soojin in \"Girls\" or telling the divas of \"The Morning Show\" the hard truth. But Nora would be something different.",
        "\"There is a hiding in plain sight-ness in character work, with costume or the way people talk,\" Lee said. \"This felt so emotionally X-rated to me, so brutally exposing in a way. It was utterly terrifying.\"XOLO MARIDUEÑA IN \"BLUE BEETLE\"",
        "Fans of \"Cobra Kai\" know Xolo Maridueña as Miguel Diaz, but the Los Angeles native is about to get a much bigger platform as the star of the new DC Comics movie \"Blue Beetle\" (Aug. 18). Maridueña plays Jaime Reyes, one of the highest profile Latino comic book characters.\"As a Mexican American playing a Mexican American, there´s a lot of pride that comes with representing your community in a positive light,\" he said. \"It was a little nerve wracking trying to encompass a culture in a movie. But we have like 40 Latinos who we get to show their perspectives.\"It´s a year of transition as he awaits the spotlight and says goodbye to \"Cobra Kai,\" which is in its final season. But even with the higher profile, Maridueña joked that he's still going to have to clean up for his dog.POM KLEMENTIEFF IN \"GUARDIANS OF THE GALAXY VOL. 3\" AND \"MISSION: IMPOSSIBLE-DEAD RECKONING PART I\"French actor Pom Klementieff has been dreaming about being in a \"Mission: Impossible\" movie for years. In fact, she would even write the words \"Mission: Impossible\" in her stunt training schedule.\"I wanted to manifest it,\" she said. \"I´m crazy like that.\"She also made the smart move of telling her agency, who put her name forward when director Christopher McQuarrie started looking for a new actor with fighting skills.",
        "\"I was ready for it,\" she said. \"I just punched and kicked hard. I was like, `let´s go.´\"The specifics of her character are still under wraps, but from trailers and teases it´s clear she gets a chance to go head-to-head with Tom Cruise´s Ethan Hunt. The film hits theaters on July 12.But first, she and her fellow \"Guardians of the Galaxy\" are closing a chapter with \"Vol. 3,\" out Friday.Her turn as Mantis may have made her famous in Marvel households, but she´s also loved being able to \"hide behind her antenna.\"\"Right now, a lot of people don´t actually recognize me, which is an amazing position to be in because I get to work with great people but I also can have just a private life,\" she said. \"But I know that could change. I have to get ready for that.\"X MAYO IN \"THE BLACKENING\"X Mayo has always had big ambitions. For a few years she even landed a gig writing for \"The Daily Show.\" For some, that would be the pinnacle. But she wanted to do more and it started to seem like the industry was putting her in a box of only being able to write political comedy. She knew she had to move on.",
        "\"You can´t tell me I can´t do it all because I have been doing it all,\" she said.\"American Auto\" helped but this summer she has two big movies: \"The Blackening\" (June 16), a horror comedy about a group of friends who go to a cabin in the woods and the \"SNL\" spinoff \"Please Don´t Destroy\" (Delayed from a summer release, now headed to Peacock on Nov. 17).On the latter, she had the life-changing experience of working with and bonding with Meg Stalter (\"Hacks\").\"It was the first time I´d done a movie alongside a woman who was my exact same size. That was so shifting in my spirit and esteem. Meg has no issues with her body. I had so many at the time,\" she said. \"So many actors are so short and little. With Meg it was not like that. I was free to be physically comedic and she was right there with me.\"JAKE RYAN IN \"ASTEROID CITY\"He´s the little Bishop brother who´s mad that Suzy stole his record player in \"Moonrise Kingdom.\" He´s Llewyn Davis´s skeptical nephew. He´s the pre-teen who had an array of chicken nuggets and dips ready for Kayla in \"Eighth Grade.\" And this summer, Jake Ryan is front and center of Wes Anderson´s latest, \"Asteroid City\" (June 16).",
        "Though he´s worked with Anderson many times - on commercials, shorts and even \"Isle of Dogs,\" which he recorded a voice part for on a lark some four years before the movie came out - he still had to audition for \"Asteroid City.\" It was not a short process either.\"It wasn´t hard but it wasn´t easy,\" Ryan said. \"At the end it was very rewarding.\"In the film, set in 1955, he plays Jason Schwartzman´s character´s son Woodrow.\"He´s going through some stuff right now. He´s a very sensitive person and he wants to leave a mark on the world. He wants to leave something for future generations,\" Ryan said. \"And he longs for a human connection. I respect and totally get that.\"MOLLY GORDON IN \"THEATER CAMP\"Molly Gordon grew up in and around the entertainment industry, acting alongside her best friend Ben Platt in productions of \"Fiddler on the Roof\" and \"How to Succeed in Business Without Really Trying\" before she´d even turned 6.She was Triple A in \"Booksmart\" and Melissa McCarthy´s daughter in \"Life of the Party,\" but this summer is forging her own path forward as a writer-director-actor in the loving satire \"Theater Camp\" (July 14).Gordon plays Rebecca-Diane, who teaches music theory to kids at a crumbling but beloved summer camp in upstate New York. She co-directed with her friend Nick Liebermann and they share writing credits with co-stars Platt and Noah Galvin too.",
        "\"I felt so inspired by so many collectives of people that had come up together, like Christopher Guest, The Groundlings, The Lonely Island, who made (stuff) with their friends and wrote specifically for their friends,\" Gordon said. \"We thought, let´s make something about a world that we know really well and a world that we love and because we love it, we can make a lot of fun of it.\"___This story was updated on Monday, May 8, 2023, to to correct the first name of Xolo Maridueña in \"Blue Beetle\" and change references to \"Please Don´t Destroy,\" which has shifted its release date to the fall.___ For more on this summer´s movie releases, including a comprehensive month-by-month calendar, visit: http://www.apnews.com/movies"
    ]
}