{
    "articleURL": "/tvshowbiz/article-12048955/Ariana-Madix-spotted-holding-hands-new-beau-Daniel-Wai-shopping-trip-NYC.html",
    "content": [
        "Ariana Madix was seen out and about with her new beau, Daniel Wai, in New York City on Thursday.",
        "The Vanderpump Rules reality star, 37, looked casual and comfortable while taking a stroll and holding hands with the fitness trainer after going shopping together in SoHo.Just last month, the new couple were seen packing on the PDA at the airport after a loved-up trip to Coachella. For their outing, the model wore an oversized green sweatshirt with a graphic design emblazoned across the front and a pair of black, tailored sweatpants. During the latest episode of the hit Bravo series, the bartender had confessed that she and her now-ex, Tom Sandoval - who was caught cheating on her with co-star Raquel Leviss - were having bedroom problems near the end of their relationship.",
        "For their day of shopping, the actress threw up her platinum blonde tresses into a messy bun at the crown of her head.She appeared to be modeling a makeup-free look to showcase her natural beauty.To shield her eyes from the sun, she donned a pair of oversized sunglasses with a gold frame and brown-tinted lenses.On her feet, she rocked a pair of green and black Air Jordan 1 sneakers.For jewelry, she wore a chunky gold chain around her neck.The blonde beauty was seen toting around a black crossbody bag while her new beau carried a large Louis Vuitton bag.",
        "Wai looked casual and cool in a simple black T-shirt underneath a black bomber jacket with gold hardware.He sported a pair of dark, baggy cargo pants and cream sneakers with bright red laces. ",
        "As the pair walked, they couldn't keep their hands off each other. At various points, Madix and Wai were seen holding hands or with their arms wrapped around each other. The day before, the latest episode of Vanderpump Rules aired and showed the television personality discussing her relationship and bedroom problems with Sandoval before his affair was exposed.'I just want us to f***ing be better,' Sandoval said to his girlfriend of nearly a decade at the time. 'You know, I want us to be more intimate.'In the next clip, Madix was seen opening up to her best friend, Raquel Leviss, about her relationship while the secret affair was going on.'I feel like in a relationship you should want to have sex,' Leviss had told Madix.Days before a scorned Ariana declared she 'regretted ever loving' cheating ex Tom as the pair screamed at one another in the explosive season 10 finale trailer.The dramatic new clip sees former couple have an incendiary row over his affair, before Leviss and Sandoval joke about their tryst going 'horribly wrong.'",
        "The clip opens with Sandoval telling Scheana Shay: 'I was going to break up with Ariana regardless' with the star retorting: 'But you didn't, you f****d her best friend.'A sobbing Sandoval then says: 'I sacrificed everything and my world got turned upside down' as he hugs Leviss' former love interest Tom Schwartz.The infidelity had begun last year in August 2022, and lasted for seven months until Ariana discovered intimate FaceTime videos on Tom's phone between him and Raquel.Raquel has checked herself into a mental health facility following the affair."
    ]
}