{
    "articleURL": "/tvshowbiz/article-12042569/Rylan-Clark-credits-breakdown-marriage-making-stronger-mental-health-struggle.html",
    "content": [
        "Rylan Clark has credited the breakdown of his marriage to Dan Neal in 2021 for making him 'stronger.'",
        "The presenter, 34, suffered a mental health breakdown following his marital split that year from now ex-husband Dan, who he was with for five years.Speaking to Elizabeth Day on her podcast How To Fail, Rylan said he is 'glad that it nearly killed him' as he is now happy with the person he has become. He candidly explained: 'It killed me. But looking back on that now I'm so glad that it nearly killed me'I'm so thrilled that I can say that two years on because I didn't think I would be here two years on.'",
        "Recalling hitting 'rockbottom' he continued: 'It was extremely traumatic. I was so ill. I'm 6 foot 4 and I went down to 9stone, which is grossly underweight for someone of my height. 'Now to be able to sit here and say I got to the lowest of lows, when someone said rockbottom I never really understood that what that was, until then. 'When you know you have been rockbottom. That's when you sit there and go I will never let anyone or anything to get to that state I was in, not even myself I will never let that happen to me again. 'Because of that trauma it has genuinely made me so much stronger. I think, \"I'm alright, you've got your health, you've got a little bit of money in the bank, you're cool.\"",
        "'I think that the break down of my marriage has made me the person I am now and I am really, really happy with the person I am now, I can sleep very well at night. It comes after Rylan credited Eurovision for helping him get over his divorce after having to pull out of covering the annual competition for the BBC in 2021 because he was so devastated by his split. Following the breakdown of his marriage the telly favourite took five months away from the spotlight due to his deteriorating health.  But he said flying out to Italy for last year's musical extravaganza was exactly what he needed to feel back to himself again.",
        "He told the Daily Star Sunday newspaper: 'Last year I needed to get away from the UK and the Eurovision bubble was perfect for that.'It was what I needed on a personal level. Being there was a full circle moment for me. It was like, 'I'm back, I'm ready to go'.'That's why Eurovision is so important to me. If you cut me open, it's there.'But while Rylan enjoyed flirting with the locals in Italy, he has vowed to behave himself this year. "
    ]
}