{
    "articleURL": "/news/article-12058979/Pictured-Cycling-coach-sexually-abused-Bradley-Wiggins-12-year-old.html",
    "content": [
        "Cyclist Sir Bradley Wiggins has named coach who abused him when he was 12Stan Knight, who was 72, molested him as a boy at Archer Road Club, LondonREAD MORE: Bradley Wiggins opens up on the painful secret after sexual abuseThis is the first picture of Olympic hero Sir Bradley Wiggins with the cycling coach who sexually abused him aged 12, and also groped and fondled other young stars in the making.",
        "Stan Knight, who died in 2003, attacked the Tour de France champion and other children at the Archer Road Club in Acton, west London. Until today, he has previously only been named by his first name by Wiggins. Knight would take the sporting protégé away from home for training camps, staying in a youth hostel in Litton Cheney, Dorset. But his abuser would insist in sleeping in his bed and grope him in the shower, the Times reports. Another of Knight's victims has talked about abuse that was akin to that experienced by the Tour de France champion and four-time OIympic gold winner. He was also abused in the 1990s at the same hostel by 'fondling' him during sports massages.There are new claims that one family even reported concerns about Knight, and allegations involving other young children. One of his victims declared today: 'Stan was utterly useless as a coach. He was like a child, an utter idiot. It was like he used the club just to be around boys. There are big questions to answer about British Cycling and safeguarding at the club.'",
        "The victim added: 'In the years since, other members of the club have discussed allegations about Stan. I know of at least two others. Because Brad has spoken out it has now empowered people to talk about it.",
        "'I knew Brad at the time but he didn't tell me what Stan did to him. He would make jokes about how weird he was. There are big questions to answer about British Cycling and safeguarding at the club.'",
        "In the interview with the Times, Wiggins said that Knight would explain to him 'how to clean your crotch in the shower', saying that it was important he knew for the sport so he did not get saddle sore or infections.Wiggins told the paper that Knight showed him, as a schoolboy, how to 'lift your sac up with a scrubbing brush', adding that 'he actually demonstrated that on me, in the shower'.The cyclist said it was just one of the 'minor acts' that started the abuse when he was 12 and living at the youth hostel with 72-year-old Knight.Another victim, who was a teenager when the abuse happened, said that Knight 'took advantage of this slightly blurred line between what's required to be fit and for the sport and what's not acceptable'. They said that he went 'way beyond the boundaries' of what was needed to help with training and recovery by putting his fingers 'into places that you didn't want to'.The victim also said that Knight was a 'useless' coach and acted like a 'child' and an 'utter idiot' who used the club to be with the boys.",
        "They reportedly know that at least two other former club members were abused by Knight - but are now coming forward because Wiggins has.",
        "The cyclist said that his mother had received a letter from British cycling in 2003, when he was 23, which said they had got a complaint from the family of another boy trained by Knight who alleged similar abuse. It was the year Knight died.But at the time, Wiggins said: 'Nah, nah, of course he didn't.' He says this 'cemented' him into a position of not saying anything.A British Cycling spokeswoman told the Times: 'Abuse of any kind has no place in sport. We urge anybody with concerns about non-recent or current abuse to report them... directly to the British Cycling safeguarding team.'"
    ]
}