{
    "articleURL": "/wires/aap/article-12053779/Fijiana-Drua-claim-Super-W-titles.html",
    "content": [
        "Fijiana Drua captain Bitila Tawake has likened consecutive Super W titles to \"winning the World Cup\" after her side beat the Queensland Reds 38-30 in a pulsating grand final in Townsville.",
        "The Drua's physicality and offloading was too much for a brave Reds outfit that fought hard in the second half after finding themselves on the wrong end of three quick tries that blew out the margin.A breakaway run by skipper Tawake triggered a momentum shift after Reds centre Alana Elisaia's blindside beating of two defenders put Renae Nona over early in the second half.Sereima Leweniqila's diving finish gave the Drua the lead again and then from the restart the Fijians were flying. Karalaini Naisewa broke a couple of tackles to open up Queensland's defence and a right edge hands play put Adita Milinia over.In the blink of an eye, the Drua had turned a three-point deficit into an 11-point lead.Luisa Basei's penalty goal added three more to their tally before Naisewa made a strip in a tackle on halfway and pinned the ears back to score the Drua's third of the second half.Queensland would cross twice more through hooker Tiarna Molloy and Sam Curtis in the final 15 minutes but the damage was done as the Drua turned a fourth-place overall finish in 2023 into another championship.\"Before we went into this week, we talked about creating your own history,\" Tawake said.\"We had a new bunch of girls this year and we told them if you want to win, you have to create your own history and then they did it today.",
        "\"It's like winning the World Cup to us back at home. It means so much to us that we can do something big.\"For the Reds, the loss marks another year of heartache for the club who are now zero wins from five Super W grand finals.Coach Simon Craig said it was little \"key moments\" that differentiated the sides and the Drua's chemistry ultimately prevailed.\"We went down by eight against essentially what is an international team that live and train together every day of the week,\" he said.\"Our girls are still fighting it hard and working a full-time job, trying to play a full-time game of rugby in a professional atmosphere.\"To get to that point and to miss the result by key moments ... I'm really proud of them. Love 'em.\"Both sides promised to bring a distinct level of physicality to the contest and it was the Drua that showed their cards early in the first half, opting to flood midfield with their burgeoning pack and force the Reds to throw numbers their way.But Queensland secured a faster start when a Drua turnover in their own half led to Elisaia pouncing on broken play and beating two defenders for the opening try.The Drua hit back immediately when Tawake extended from the base of a ruck and they had the lead when a beautiful piece of counter-attacking play led to a 50m try.",
        "Queensland threatened down the left edge off a set-piece play that was coughed up cheaply and Drua flanker Sulita Waisega cracked the defensive line before finding Mereoni Nakesa to score under the posts.At 14-7, errors on either side of the ball led to an arm wrestle in the middle of the park before the Drua found themselves defending multiple phases off ruck infringements and penalties.The Reds looked their best when centres Cecilia Smith and Elisaia combined but too many deep territory errors cost them a shot at any further tries in the opening 40 minutes."
    ]
}