{
    "articleURL": "/wires/pa/article-12058191/Coronation-festivities-continue-Big-Help-Out-EastEnders-street-party.html",
    "content": [
        "Festivities will continue on the Monday bank holiday to celebrate the King’s coronation with the Big Help Out.",
        "The King and Queen will not be appearing publicly on Monday – the day of the Big Help Out, which is billed as a lasting volunteering legacy to mark Charles’s crowning.Other royals will be out and about with the Duke and Duchess of Gloucester visiting the Coptic Orthodox Church in London where young volunteers will be hosting a coronation street party.The Duke and Duchess of Edinburgh will take part in a puppy class at the Guide Dogs for the Blind Association Training Centre in Reading.",
        "The Big Help Out day is organised by The Together Coalition and partners such as The Scouts, the Royal Voluntary Service and faith groups from across the United Kingdom.It will highlight the positive impact volunteering has on communities and will encourage people to try volunteering for themselves to create a lasting legacy.On Monday evening from 7.30pm, EastEnders will hold a coronation-themed street party in Albert Square hosted by the residents of Walford.The public have been encouraged to take up hundreds of thousands of volunteering roles on the extra bank holiday with more than 1,500 charities involved.",
        "An app has been created to allow people to search for volunteering opportunities, ranging from helping the elderly to working with environmental charities and supporting animal welfare.",
        "A Buckingham Palace spokesperson said: “While wholly supportive of the Big Help Out initiatives taking place right across Britain on Monday May 7, (the King and Queen) will not be attending any events in-person.“These will instead be attended by other members of the royal family.”Camilla is patron of the Royal Voluntary Service charity and has been patron of the Big Lunch initiative since 2013.The extra bank holiday, which will take place across the UK, caps off a long weekend of celebrations.",
        "On Sunday night Charles and Camilla attended a star-studded coronation concert at Windsor Castle featuring actors, singers and entertainers – and Kermit the Frog who managed to gatecrash the royal box.Take That, billed as pop “royalty”, Katy Perry and Lionel Richie brought the house down and got the royal family on their feet and dancing – including Charles and Camilla – during the 95-minute extravaganza.The Prince of Wales gave the most passionate tribute of the night, telling his father before 20,000 spectators: “Pa, we are all so proud of you.”The concert, hosted by Downton Abbey actor Hugh Bonneville, saw the King’s life celebrated, from his service in the Armed Forces to his passion for the arts and his charitable work.",
        "Footage from Charles’ life was shown during the tributes from celebrities who included actors Hugh Jack and Pierce Brosnan, former Strictly Come Dancing dancer Oti Mabuse and adventurer Bear Grylls.",
        "A host of celebrities recorded messages for Charles or highlighted little known facts, while Hollywood star Tom Cruise delivered his pre-recorded tribute while at the controls of his Top Gun Warbird plane.Highlighting the fact that Charles was qualified as a helicopter pilot, he said: “Pilot to pilot, Your Majesty, you can be my wingman any time”, before saluting and banking off.",
        "The King’s lifelong connection to the skies was also marked in Bedford on Sunday with the de Havilland Chipmunk WP903 in which he learned to fly in 1969 taking part in the King and Country Air Show at Shuttleworth aerodrome.The 70-year-old fire-engine red single-engined primary trainer aircraft delighted crowds as it took to the sky alongside a host of other vintage military aeroplanes.Built in 1952, the tandem, two-seat aircraft served with the RAF Queen’s Flight before it was used to teach the young Charles to fly at RAF Tangmere while he was a student at Cambridge University in 1969.The future King flew solo for the first time in the plane at RAF Bassingbourn on January 14 1969 before being awarded his private pilot’s licence in March 1969 and his RAF preliminary flying badge on August 2."
    ]
}