{
    "articleURL": "/wires/reuters/article-12045313/Volkswagen-revenue-jumps-growth-Europe-North-America.html",
    "content": [
        "By Victoria Waldersee",
        "BERLIN, May 4 (Reuters) - Volkswagen sees higher competition later this year as supply chain bottlenecks ease and China's electric car market heats up, the carmaker said on Thursday, adding that it put margins over volume even as it fights to maintain market share.The company was emboldened to stick to its annual outlook of a return on sales of 7.5% to 8.5% and higher deliveries by a strong first quarter, boosted by higher revenues in Europe and North America.In China, though, sales fell by 14.5% and Chief Financial Officer Arno Antlitz acknowledged that the carmaker had work to do to catch up with domestic competitors on battery-electric vehicles.\"Competition will intensify with more chips and more availability,\" Antlitz said on a media call after the results.Asked how the carmaker would respond to the wave of electric vehicle (EV) price cuts, Antlitz said: \"Our focus is on quality of the business, rather than on volume. This is specifically true for EVs... we don't want to lose our margin parity target out of sight.\"Volkswagen aims to achieve the same margin from combustion engine cars as EVs, though the latter are still far more expensive to produce, in part because of high prices of raw materials.BMW, which also reported results on Thursday, said rising EV sales were weighing on costs this quarter because of higher material prices and research and development costs.",
        "Volkswagen's revenue for the quarter was 76 billion euros ($84.22 billion). Operating profit fell to 5.7 billion euros from 8 billion last year, but still beat expectations of five analysts polled by Refinitiv SmartEstimate for 5.48 billion.Excluding the valuation effect from commodity hedging, operating profit rose by 35% to 7.1 billion euros, yielding a margin of 9.3%.Cariad, the carmaker's beleaguered software unit, made a loss of 400 million euros.Total deliveries in the first quarter were up 7.5% from the previous year on 6.5% higher sales, and in March deliveries were 23.9% higher than the same month last year - in line with BMW , which also reported higher deliveries that month. ($1=0.9024 euros)(Reporting by Victoria Waldersee; Editing by Sharon Singleton and Clarence Fernandez)"
    ]
}