{
    "articleURL": "/wires/aap/article-12060423/Radley-wont-change-tackling-style-targets-title.html",
    "content": [
        "Victor Radley insists his tackling style is fine and he won't be changing his methods as he targets a third title with the Sydney Roosters.",
        "Radley joined Latrell Mitchell as the most sin-binned player in the history of the game, with eight, when he was sent for a high tackle on Michael Molo in the round eight match against St George Illawarra.The match review committee charged him with a grade one careless high tackle and he paid a $3000 fine. Radley was adamant it was a head-on-head collision during play and after the match criticised the decision to bin him.Radley told AAP his view on the Molo incident had not changed and that he had a simple approach to getting on with his game every time he took the field.\"I just get on with it,\" he said.\"It ended up costing me another $3000, which I was disappointed with, but what can you do?\"I just swallow the pill, move on, and try and be present and not think about the past too much.\"I am always working on my game and trying to get better but these (sin binning) decisions don't drastically change anything.\"\"I don't think my (tackling) style has been that bad this year. I have been alright.\"His nickname of 'Victor the Inflictor' carries a connotation that draws attention to the way Radley goes about his business.\"I think the decision was wrong the other week but I am not saying it was just because it was me or that I get picked on or anything. I get treated the same,\" he said.",
        "Radley's goal hasn't changed either. He's not satisfied with the two titles he won in 2018 and 2019.\"My inspiration is to win comps for the Roosters. It is where I am from and where my friends and family are from. I know how much it means to all of them,\" he said.\"You've got to win the comp every single year. That is my goal.\"It is like a drug. You win one and you want to win more. Excellence is what we expect here and what we are striving for.\"Radley is the ultimate modern-day lock with his combination of toughness in the middle and ball-playing ability\"I was always pretty physical. I had three brothers, two older, so it was always a dogfight for me at a young age,\" he said.\"The skill and learning how to pass came from Adrian Lam, who was my footy coach from when I was seven until I was 17. I was extremely lucky.\"I can get a lot better, let me tell you. I want to be at my best to play 80 minutes at 13 every week or wherever I am needed at the Roosters.\"I can have the input into that by making my tackles, connecting the team in attack, supporting and doing all the effort areas.",
        "\"Our spine is firmly in control of the side. I am just the puppet and they tell me what I need to do.\""
    ]
}