{
    "articleURL": "/wires/ap/article-12055971/Sterling-win-UFC-288-send-Cejudo-retirement.html",
    "content": [
        "NEWARK, N.J. (AP) - Aljamain Sterling landed enough stiff knees and elbows in a split-decision victory against a battered Henry Cejudo that the punishment may push the former UFC two-division champion back into retirement.",
        "Moments after winning his ninth straight bout and surviving his latest 135-pound championship title defense in the main event of UFC 288, Sterling's fight night was only heating up.Bantamweight challenger Sean O´Malley stepped inside the cage, stripped off his jacket and stood nose-to-nose with Sterling (23-3) as the two fighters launched into profanity-laced tirades against each other and eventually needed to be separated.\"Get this (expletive) out of my cage,\" Sterling shouted Saturday night at the Prudential Center.They might get their championship match later this summer. UFC President Dana White wanted Sterling-O'Malley to fight in August in Boston - and not late night in New Jersey.\"It was a bad idea,\" White cracked of inviting O'Malley inside the octagon.",
        "Cejudo´s comeback after a three-year retirement also might have been a bad idea. Cejudo, the only person to win an Olympic gold medal and a UFC title, held the bantamweight crown when he abruptly retired in May 2020 after he successfully defended the championship against Dominick Cruz.Cejudo said he was a \"little confused\" about his future plans and would return home to his family - his wife is expecting the couple's second child - and think hard about his fight future. He was wildly cheered through all five rounds by 17,559 fans that paid to watch Cejudo try to turn back the clock.",
        "\"Who knows, this may be the last time in the octagon,\" he said.The 33-year-old Sterling won 48-47, 48-47 on two scorecards and Cejudo won 48-47 on the third.\"I hate losing but it´s also been three years,\" Cejudo said.Sterling, a Long Island, New York native, successfully defended the bantamweight championship for a record third time.At 21, Cejudo (16-3) became the youngest American to capture an Olympic wrestling gold medal when he won the freestyle 55-kilogram division in 2008.. At 36, Cejudo may finally call it quits instead of continuing to chase another UFC championship.White shook Cejudo's hand inside the cage and helped the fighter remove his gloves for perhaps the final time.\"I'm out here to chase greatness,\" Cejudo said. \"If I can't make history, I'm not doing this. I didn't win. The belt's not around my waist.\"Cejudo found greatness in UFC when he became the fourth fighter to hold titles in two different weight classes simultaneously, and the second to defend titles in two different weight divisions.Belal Muhammad (23-3, 1 NC) landed enough stiff kicks to Gilbert Burns´ upper body to earn a unanimous decision victory in the 170-pound five-round fight.UFC fighter Conor McGregor bashed the fight on Twitter.He wasn´t alone in his biting critique of a bland fight that earned plenty of boos from the New Jersey crowd.",
        "Muhammad and Burns exchanged a few kicks in the third and the crowd let the fighters have it at the end of another round on the card that suffered from a deficiency of sustained action. Burns appeared to hurt his left shoulder on a failed takedown attempt and couldn´t muster much offense, one reason for the methodical pace.Muhammad was booed when he was announced as the 50-45, 49-46, 49-46 winner and then told the crowd, \"New Jersey, you suck.\"The win stamped Muhammad - who took the fight on just over two-weeks' notice and extended his winning streak to five and his unbeaten streak to 10 straight fights - as a top contender for a title shot against Leon Edwards.It´s no surprise Burns (22-6) ended the bout in rough physical shape. The Brazilian already won a fight at UFC 283 in January and he retired Jorge Masvidal in a win at UFC 287 on April 8. The fight was rushed onto the card after problems with the original co-main event between Charles Oliveira and Beneil Dariush pushed the fight to next month.If the New York Mets need to add some punch in the lineup, maybe they can find out if Matt Frevola is available. A diehard Mets fan who threw the first pitch at a game last month, Frevola had Mets owner Steve Cohen -- who was soundly booed when shown on the big screen -- watching cageside for his bout against Drew Dobler.",
        "Frevola added to the Mets theme when he walked out to Timmy Trumpet´s signature song \"Narco,\" which belonged to injured reliever Edwin Diaz.The Long Island native had fans singing \"Steam-roll-a!\" in the short time he was in the cage. Frevola scored a TKO win over Drew Dobler at 4:08 of the first round for his third straight first-round finish.On the first fight on the main card, Charles Jourdain defeated Kron Graice by unanimous decision in a fight so dull that fans turned on their camera phone lights to entertain themselves.\"Sorry guys, it was not the most exciting fight,\" Jourdain said after finishing off the one-dimensional Gracie.Movsar Evloev defeated Diego Lopes by unanimous decision in a fight Lopes accepted on five-days notice after an injury forced Bryce Mitchell to drop out. Yan Xiaonan clobbered former UFC strawweight champion Jéssica Andrade with a big right and pounded away at her fallen foe for a TKO victory at 2:20 of the first round.Yan's victory could set her up for a 115-pound championship match against fellow Chinese fighter Zhang Weili.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}