{
    "articleURL": "/news/article-12061359/Drivers-overtaking-cyclist-quiz-stumps-Transport-Main-Road-QLD-ask-question.html",
    "content": [
        "QLD drivers can cross solid lanes to overtake cyclistsDrivers need to give cyclists 1 - 1.5 metres of space Cyclists are listed considered vulnerable road usersDrivers have been left at odds over a very simple road rule when overtaking a cyclist.",
        "Transport and Main Roads Queensland challenged driver's and their knowledge of the road by asking a very simple question online.'Are you allowed to cross double continuous lane markings to pass a bike rider?' Social media users were left scratching their heads with several admitting they did not know the answer. ",
        "'I have always thought you can't ever cross double lines or a solid line,' one wrote.A second added: 'I had no idea.'Queensland drivers are allowed to pass over solid lines and into the oncoming lane to give cyclists a one metre space in a 60km/h zone.They are required to give them 1.5m in higher speed zones according to Transport and Main Roads. Drivers can also travel over a painted island in order to safely pass by someone on a bike. One social media user questioned why 'special rules' were given to cyclists.'So it's illegal and unsafe to cross double white lines at any point, hence why the double white lines are there in the first place, but all of a sudden, it's OK to do it to pass a cyclist,' they wrote.'Doesn't make sense.''But bike riders are allowed to pass cars at zero metres at any speed,' another added. Cyclists are listed by the National Road Safety Strategy as vulnerable road users, along with pedestrians, motorcycle riders, children 7-years and under, the elderly and users of mobility devices. ",
        "'When safe yes, be sure to put your window down and call out 'get a car',' one commenter said.The penalty for motorists who fail to give way to cyclists in QLD is three demerit points and anywhere between $431 to $5,700 in fines.In Australia, drivers were to blame for roughly 79 per cent of accidents involving cyclists in 2018 after 45 people on bikes died according to the 2018 Australian Automobile Association's Benchmarking report.",
        "More recently in NSW, a record-setting 2,330 cyclists were hospitalised in 2021 after collisions on the roads, the highest number since data collected in 2005.Cyclists in the state now account for 23 per cent of road crash hospitalisations, and many near-crashes go unreported according to Bicycle NSW.'Most cyclist complaints to NSW police about aggressive driving are not investigated,' the chairman of advocacy, John Hawkins told Sydney Morning Herald.NSW road laws are almost identical to QLD laws, where drivers must give cyclists one metre of space in 60km/h zones, and 1.5 metres in higher speed areas.In 2022, 20 fines were issued to drivers in NSW for breaking the minimum passing distance rules.Transport for NSW launched the 'Share the Road' campaign in October 2022 to educate cyclists and motorists of their mutual responsibilities.The campaign reinforces safe distance laws and cyclists' need to use bicycle lanes if available, with laws allowing them the ability to use a full lane on the road if there are rough road edges or gravel."
    ]
}