{
    "articleURL": "/health/article-12060453/Could-solution-endometriosis-waiting-for.html",
    "content": [
        "Endometriosis can lead to debilitating pain and infertilityDespite it effecting up to 1.5 million women in the UK, there is no known cureREAD MORE: Has Covid created a generation of germaphobesAs a chronic condition with no known cure, endometriosis can lead to debilitating pain and infertility for up to 1.5 million women in the UK — but hope of new treatments may finally be on the horizon.",
        "Thanks to recent breakthroughs in our understanding of the condition, there is promise that trials of two new treatments may offer long-lasting relief for patients.One drug, dichloroacetate, will soon be tested in a clinical trial involving 100 women with endometriosis in London and Edinburgh. This follows a smaller study which found that patients reported fewer painful symptoms and needed fewer painkillers when taking the treatment.The other new therapy involves monthly injections of a man-made antibody which has been shown partly to reverse endometriosis in monkeys — and is now going to be tested in women.The condition affects women of all ages and can lead to pain, heavy periods, nausea and diarrhoea. It is also a cause of infertility: 30 to 50 per cent of women who struggle to get pregnant have endometriosis.",
        "The condition occurs when tissue similar to the lining of the womb grows elsewhere in the body. This can block fallopian tubes (the tubes that eggs travel down to reach the uterus) or form scar tissue, which make it harder to become pregnant.While this rogue tissue is commonly found around the ovaries or just outside the womb, it can occur throughout the body, including on the bladder and bowel. In rare cases, it has even been found on the spine and lungs.",
        "It causes pain as the tissue builds up and then breaks down — just like the lining of the womb does each month — but this bleeding has no easy way of getting out of the body, leading to inflammation.Currently, standard treatment is with hormone-suppressing drugs, including the combined contraceptive pill, the progesterone-only pill and contraceptive implants. These limit or stop the body’s production of oestrogen — the hormone which encourages the tissue to grow and shed.But because this treatment stops menstruation, it is unsuitable for women who are trying to get pregnant; and progesterone-only treatments can also lead to weight gain.While surgery to remove the scar tissue can ease symptoms, the condition often returns.One of the new treatments being trialled — an antibody called AMY109 — was found to reduce inflammation and partly reverse endometriosis in monkeys.What’s more, it did so without disrupting the menstrual cycle or causing weight gain, according to a study published in the journal Science Translational Medicine.AMY109 blocks an inflammatory protein (interleukin-8) produced by a gene, IL8, which Japanese researchers discovered was more active in endometrial tissue.Scientists at Chugai Pharmaceutical designed an antibody to ‘mop up’ interleukin-8, effectively preventing it from causing further inflammation.",
        "In a six-month trial with 17 monkeys with surgically-induced endometriosis, the scar tissue almost halved in those given monthly AMY109 injections; abnormal tissue continued to grow in the group that received a dummy treatment.",
        "The trial found AMY109 had no impact on menstrual cycles or weight. Chugai Pharmaceutical is now running a trial of AMY109 in human volunteers.‘After a long period when endometriosis received little attention from scientists, there is now a lot more interest in trying to find treatments for the disease, which can severely impact on quality of life,’ Emma Cox, CEO of Endometriosis UK, told Good Health. The charity welcomes the Japanese research, she says, though more is needed ‘to establish whether it will become a useful therapy in the long term’.This was echoed by Ertan Saridogan, a professor of gynaecological surgery at University College London. He added that the reduction in scarring with AMY109 was particularly interesting. ‘With available treatments we’ve not been able to fight against scarring which has already formed and we’ve been restricted with surgery to address this,’ he says.Professor Saridogan says endometriosis probably has multiple causes, so a single cure is not an imminent likelihood. ‘However, the science is taking huge steps and it wouldn’t be impossible to see game-changers in the next five to ten years.’Another avenue being investigated is the use of dichloroacetate (DCA) to reduce scarring and pain. DCA is already used to treat some solid tumours and inherited mitochondrial disorders (where the mitochondria, or ‘powerhouse’ of the cells, fail to produce enough energy for the body to function correctly).",
        "DCA’s use for endometriosis is now being studied at Edinburgh University: it’s thought to reduce lactate, a substance produced by muscle and red blood cells and which research shows is higher in women with endometriosis.‘If you target lactate, this has the potential to reduce lesions and pain,’ explains Andrew Horne, a professor of gynaecology who is leading the Edinburgh research. Previous lab-based experiments have suggested that lactate creates an environment that supports the development and growth of endometriosis.‘When these endometriosis cells were treated with DCA, lactate production decreased to normal levels and the size of endometriosis lesions was reduced,’ says Dr Lucy Whitaker, a clinical lecturer in obstetrics and researcher.In a new trial, 100 women will take DCA pills twice a day for 12 weeks. If successful, it could herald larger tests ‘and DCA could have the potential to be the first non-hormonal treatment for endometriosis’, says Professor Horne.Another trial at Edinburgh is looking at a new CBD-based medicine. ‘These substances are extracted from cannabis and are promising treatments for pain conditions such as endometriosis,’ says Professor Horne.Studies suggest that CBD may reduce pain by increasing levels of a chemical compound, anandamide, which binds to cannabinoid receptors in the body and can reduce pain perception.The Edinburgh team plans to recruit 100 women with endometriosis pain for a 12-week study later this year. The participants will be randomly assigned to take a CBD liquid or a placebo, completing a questionnaire about their symptoms.",
        "There are many theories about what causes endometriosis, including that infections can trigger it in those with a genetic predisposition, says Shaheen Khazali, a consultant gynaecologist and endopelvic surgeon at The Lister Hospital in London.There are three types of endometriosis, according to its location.The most common is superficial peritoneal endometriosis, which affects the peritoneum (the membrane lining the abdominal cavity) and is found in 80 per cent of women diagnosed.Cystic ovarian endometriosis, where the tissue forms ‘chocolate cysts’ on the ovaries (so-called because of their colour) affects 17 to 44 per cent of patients. Less common is deep endometriosis, which has penetrated into tissues and organs including the bowel and bladder. It can grow into nerves, typically the sciatic nerves, which run down each leg.It is possible to have more than one type and it’s not clear if they all behave in the same way.One innovation that could rapidly improve our understanding of the disease is gene mapping. The cells involved in endometriosis have now been genetically mapped as part of a small study at Cedars-Sinai Medical Center in Los Angeles, California.When researchers examined cells from the pelvic tissue of 21 women (17 diagnosed with endometriosis, four without), they found a genetic mutation that apparently affects the lymphatic vessels surrounding the abnormal tissue.",
        "Previous studies suggest endometriosis tissue may spread via the lymphatic system, the body’s drainage system.There have, meanwhile, been improvements in surgical procedures. One new technique used by Mr Khazali is laparoscopic alcohol sclerotherapy, where they first drain the chocolate cyst and then apply 96 per cent alcohol solution into the inside of it through keyhole surgery before removing it after a short period.This encourages adhesions to form, filling up the space, and preventing fluid building up within the cyst again. As this targets only the cyst, it reduces potential damage to surrounding ovarian tissue.Earlier diagnosis is key — yet the average wait is eight years, says Emma Cox. When it comes to identifying the cause of pelvic pain, ‘asking patients to keep a pain and symptoms diary is a fairly straightforward and useful tool, but is often not done’, she says.Currently, the only definitive way to diagnose endometriosis is via a laparoscopy (where a tiny camera is inserted into the abdomen). However, since the start of the pandemic, NHS gynaecology waiting lists have grown by more than 60 per cent across the UK.When there is a strong likelihood that endometriosis is the cause of symptoms, Professor Horne says it may be better to start treatment as soon as possible — as ‘untreated painful symptoms tend to worsen with time’."
    ]
}