{
    "articleURL": "/news/article-12057947/Polish-plane-crashes-Black-Sea-intercepted-Russian-fighter-jet.html",
    "content": [
        "The Polish L-410 Turbolet was on patrol for EU's border agency over Black SeaThe Russian Sukhoi Su-35 fighter jet then flew within 'five metres' of the aircraftA Polish plane nearly crashed after a Russian fighter jet intercepted it in a series of 'aggressive and dangerous' manoeuvres, according to Poland's border force.",
        "The Polish surveillance plane, an L-410 Turbolet, was on patrol for the EU's border agency over the Black Sea on Friday when a Russian Sukhoi Su-35 fighter jet flew within 'five metres' of the aircraft three times.The Russian jet did 'not make radio contact' before approaching the plane, which caused Polish pilots to 'lose control' of the aircraft and perform an emergency landing in Romania, the border agency said.It comes after RAF Typhoon fighters and a Norwegian F-35A plane scrambled to intercept a Russian Tu-142 patrol aircraft approaching British airspace last week.European leaders slammed the move as 'aggressive and dangerous' and called it a 'planned provocation'.",
        "Romania said the Polish plane was on a routine Frontex patrol with Romanian border police when it was intercepted.Romania's defence ministry, which first reported the move, condemned Moscow's 'aggressive and dangerous' behaviour.Poland's Government spokesman also slammed the interception as a 'planned provocation' by Russia.The aircraft landed safely in Romania afterwards and Romanian and Spanish planes were put on 'pre-alert' by NATO.It took place 'in international airspace over the Black Sea,' around 37 miles east of Romania's airspace, according to Romania's defence ministry.The Polish plane has been deployed in Romania from April 19 and is due to stay there until May 17 as part of a Frontex operation organised by Romania that also includes Spain and Sweden.",
        "Nato air commanders have accused Russia of deliberately flying towards its borders to test reaction times and provoke an incident to escalate the war in Ukraine."
    ]
}