{
    "articleURL": "/wires/ap/article-12046191/Maryland-Rep-David-Trone-announces-US-Senate-run.html",
    "content": [
        "ANNAPOLIS, Md. (AP) - Maryland Rep. David Trone announced Thursday he will run for the U.S. Senate seat that will be opening with the retirement of Sen. Ben Cardin.",
        "Trone, a Democrat, has focused on issues including opioid addiction, mental health, medical research and criminal justice reform while in office. The congressman said he would continue advocating for those issues in the Senate.\"Ben Cardin was a great U.S. senator, and we're looking forward to following in his huge shoes,\" Trone said in an interview with The Associated Press. \"But we've got a lot of challenges that are facing Maryland, and we've got to focus on those challenges, and first and foremost, it's the addiction crisis.\"Trone, who is the wealthy founder of Total Wine &amp; More liquor stores, spent more than $12 million of his own money on his House race last year. He said it's too soon to say how much he would spend on a Senate race, but he said using his own fortune means he doesn't take money from political action committees, corporations or lobbyists.\"And the whole key in that is you make your own decisions,\" Trone said. \"You can do what's right for the people of Maryland and not be influenced by anybody.\"Trone is the third candidate to announce a Senate campaign since Cardin said Monday that he would not seek reelection.",
        "On Tuesday, Montgomery County Councilmember Will Jawando, a Democrat, announced his campaign for the seat. Jawando served in former President Barack Obama's administration as associate director of public engagement and as an adviser to Education Secretary Arne Duncan. Activist Jerome Segal announced earlier this week he is running.",
        "Trone won a third term to Maryland's 6th Congressional District in November in a rematch with Republican Neil Parrott, whom he also beat two years earlier. The western Maryland district was redrawn with fewer Democrats after a successful court challenge by the GOP to the state's congressional map.Trone said he worked hard to represent the entire district and ended up winning with nearly 55% of the vote in the state's most competitive House district.\"I'm confident there will be another Democrat that steps up to bring that same willingness to be present, show up everywhere, never leave western Maryland behind ... and keep the seat,\" Trone said.Other potential candidates for Cardin's Senate seat include Maryland Rep. Jamie Raskin, a Democrat, and Prince George´s County Executive Angela Alsobrooks, a Democrat.The winner of the Democratic primary will be a heavy favorite to win the seat in a state where Democrats outnumber Republicans 2-1. Maryland has not elected a Republican to the U.S. Senate since 1980. The state´s eight-member House delegation has only one Republican.Last year, GOP leadership aggressively tried to recruit then-Gov. Larry Hogan to run against Sen. Chris Van Hollen, but Hogan declined, saying he didn´t \"aspire\" to be a U.S. senator. Hogan, who recently wrapped up his second and final term as governor, said in March that he would not seek the 2024 Republican nomination for president.",
        "Cardin, 79, has been a longtime fixture in Maryland politics. His retirement will open up his seat for the first time since 2006, when he was elected to the Senate after spending 20 years in the U.S. House representing a large part of Baltimore and several nearby suburbs.Cardin is the third Democratic senator to decide not to run for reelection next year, following Sen. Dianne Feinstein of California and Sen. Debbie Stabenow of Michigan. On the Republican side, Sen. Mike Braun of Indiana is eschewing a second term and will run for governor instead."
    ]
}