{
    "articleURL": "/news/article-12060449/Will-Hunters-business-partner-throw-Bidens-bus-avoid-jail.html",
    "content": [
        "Hunter Biden's former business partner, Devon Archer, is being pushed by friends to spill any dirt he has on the first family to stay out of jailArcher has been sentenced to one year and one day in jail after defrauding a financially strapped Native American tribe out of more than $60 million He has a final appeals hearing on Tuesday for the case, which was unrelated to the ventures Archer had with the first son  Devon Archer, the former business partner of Hunter Biden, is being pushed by friends to spill any dirt he has on the first family to avoid jail time. ",
        "Last year, Archer was sentenced to a year and a day in prison for swindling the financially-strapped Oglala Sioux Indian tribe out of more than $60 million.That business deal was unrelated to the ventures Archer had with the first son.  On Sunday, New York Post columnist Miranda Devine wrote that Archer was being pressed to divulge any information that he knows about the Bidens' business practices as he makes a final appeal in a Lower Manhattan courtroom Tuesday.Archer, a former Abercrombie &amp; Fitch model, made millions alongside Hunter Biden on the board of Burisma, the Ukrainian energy company led by an oligarch who was under investigation for corruption. ",
        "At the same time, then Vice President Joe Biden was overseeing the Obama administration's policy on Ukraine.Drawing the lines between those two things, Republicans - including former President Donald Trump - have accused the Bidens of being involved in an influence-peddling scheme. While Archer's case was brought by the U.S. attorney for the Southern District of New York, Hunter is being investigated by David C. Weiss, the U.S. attorney for Delaware, over potential tax and gun charges. Hunter Biden's lawyers met with prosecutors last week, often a sign that a probe is wrapping up.  It's unclear what information Archer could bring to the table.",
        "Archer was dealt a blow with the appointment of Judge Richard Sullivan to the three-judge panel that will hear the case Tuesday. Sullivan, a Trump-appointed judge, reinstated Archer's fraud conviction after it was overturned by Judge Ronnie Abrams, an Obama-appointee. One friend remarked to Devine that Archer was 'caught between two presidents.' While Archer was a Yale friend-turned-business partner to Hunter Biden and Chris Heinz, the stepson of former Democratic presidential nominee and ex-Secretary of State John Kerry, his family also has connections to Trump, Devine revealed. ",
        "Archer's uncle, the CAA executive Charles Melniker, was the manager of actress and model Marla Maples, Trump's second wife. When Trump was having an affair with Maples during the summer of 1991, Archer's family was helping the then-business tycoon hide the romance. The teenage Archer was assigned to keep Maples busy by playing tennis with her or driving her around in his Jeep. Archer's aunt Deanie Melniker called Maples 'lovely' in an interview with The Post. 'She stayed with us out on Long Island … We were spending the time with Marla because she didn't have a gig and to keep her out of the crosshairs of reporters and people who were harassing her,' Melniker recalled.  'People didn't think of her favorably as [the Trump] marriage was breaking down, but we were close to her and had a lot of exposure to Donald. He was very supportive and friendly and kind [even] as his fortunes were waning,' she added. ",
        "Melniker said when her father was dying, 'Donald flew my dad down to Mar-a-Lago to see Jackie Mason,' a famous comedian.In January, Archer bumped into Trump at his West Palm Beach golf course after he had played a round of golf with Kid Rock. Archer told his aunt that the ex-president remembered her late husband and spoke of him fondly. 'He was very generous and kind to my family, and appreciated what we were doing for Marla,' Melniker said. "
    ]
}