{
    "articleURL": "/wires/ap/article-12043157/Rights-panel-Peru-used-excessive-force-quell-protests.html",
    "content": [
        "LIMA, Peru (AP) - The Inter American Commission on Human Rights said Wednesday that Peru´s military and police forces used excessive force to quell violent anti-government protests, and that they should be investigated as possible extrajudicial executions and massacres.",
        "The commission, an autonomous arm of the Organization of American States, said the violations took place in several regions across Peru, but centered its investigation on the cities of Ayacucho and Juliaca.Those cities saw the largest number of deaths during the protests from December through February to demand the resignation of President Dina Boluarte and members of Congress.Among violence detailed in the IACHR report was a fatal clash in Ayacucho on Dec. 15, when soldiers fired rifles at demonstrators who were trying to enter the Ayacucho airport, killing 10 civilians. The IACHR said it reviewed testimonies indicating that soldiers also fired shots outside the airport, hitting bystanders as well as people who were fleeing the confrontations.The report also found that 18 civilians died on Jan. 9 in Juliaca, including protesters, a brigade doctor and a teen bystander. All of the victims died from bullets, pellets and blunt objects, according to the report.The protests were carried out, for the most part, by Indigenous peoples and peasant communities, mainly from the southern regions of Apurímac, Ayacucho, Puno and Arequipa, which saw the highest number of victims.",
        "The commission said the killings of protesters may have been extrajudicial executions and massacres and should be investigated \"with due diligence and with an ethnic-racial focus.\"",
        "Monitoring the crisis in Peru, it concludes, requires \"broad, genuine, and inclusive talks with an intercultural and territorial focus, where all the different groups in society are adequately represented.\"The unrest began in early December following the arrest of Pedro Castillo, Peru´s first president of humble, rural roots, following his widely condemned attempt to dissolve Congress and head off his own impeachment.Protesters, mainly in neglected rural areas of the country still loyal to Castillo, have sought immediate elections, Boluarte´s resignation, Castillo´s release and justice for those killed in clashes with police."
    ]
}