{
    "articleURL": "/wires/aap/article-12058755/Penriths-defence-track-despite-losses.html",
    "content": [
        "Penrith coach Ivan Cleary says his side have taken a step in the right direction, with the club's defence statistically on track for a third straight title.",
        "The Panthers sit third on the NRL ladder but have already lost as many games this campaign - four - as they did in each of the past three regular seasons.Cleary himself admitted last week it was fair for critics to question Penrith's form, before they bounced back with an 18-6 win over the Warriors on Saturday.But statistically speaking, Penrith are on track compared with two of their past three runs to the grand final.Penrith have conceded 20 or more points in a game once this season, and have conceded 117 through nine matches to sit well clear as the league's best defensive team.That figure is similar to this stage last year - when Penrith had let in 110 points in the first nine games of their title run - and to the 134 points conceded in 2020 en route to the grand final.The Panthers' stat for 2021 is by far their best, with just 60 points conceded as they went undefeated through the first nine rounds.Still, Cleary said his team's defence was still not exactly where he wanted it to be this year.\"It's not, but we're going OK,\" he said.\"We have definitely had some really good periods of games defensively. But we have been doing too much of it in the wrong parts of the field.",
        "\"It has certainly tested us. It's a whole-of-game thing, where it's a cycle of attack and where you give the ball to the opposition.\"Cleary said there had been improvements in that area against the Warriors, after losses to South Sydney and Wests Tigers in the weeks prior.\"We spent more time with the ball and at their end,\" he said.\"Just trying to get some control of the game, that was the best it has been for some time. That was the main thing.\"You come out of the game and could have had a bit more polish here or there.\"But in terms of what we wanted to achieve on the day, it was a step in the right direction.\"Penrith face a crucial two weeks, with matches against the Sydney Roosters on Friday night and Brisbane in round 12 before losing their stars to State of Origin duties.PENRITH'S AVERAGE POINTS CONCEDED AFTER NINE GAMES2020: 14.892021: 6.672022: 12.222023: 13"
    ]
}