{
    "articleURL": "/tvshowbiz/article-12038695/Mel-B-puts-leggy-display-sparkling-gold-mini-dress.html",
    "content": [
        "Mel B looked as elegant as ever as she shared a fun-filled insight into how she gets glammed-up for an on-screen appearance.",
        "The Spice Girl, 47, took to Instagram on Tuesday to post a lighthearted video giving her 1.5million followers a behind the scenes glimpse into her glamour routine.In the clip, Mel put on a very leggy display in a sparkling gold strapped mini dress with a plunging necklace.She gave herself a few extra inches in a pair of strapped gold stilettos as she strutted her stuff in her dressing room, where she was surrounded by her suitcases.The singer accessorised her bombshell ensemble with a large pair of hoop earrings and slicked her caramel tresses back into a tight high bun.",
        "She bolstered her natural beauty with lashings of mascara and a bold slick of red lipstick as she completed her elegant look.Mel struck a series of playful poses as she danced across her dressing room and pulled a shocked expression for the fun-filled clip.She was then seen sitting in front of a dressing table where she adjusted her neckline to prevent a fashion faux pas while her make-up artist made the finishing touches.Mel then arrived on set and was seen cheekily pretending to sneak through the doors, before grabbing a rainbow fan and wafting it in front of her face. Alongside the lighthearted video, which was set to 2 Unlimited's song Get Ready, she penned: 'This is how I \"get ready for this\" hahaha boom.'",
        "Her latest post comes after Mel told of an embarrassing exchange she suffered with Prince William - all thanks to a dress designed by her pal Victoria Beckham.She revealed how her bandmate Posh, 48, designed her dress for an investiture ceremony at Buckingham Palace last year, and joked that Victoria purposely stitched her up when it came to her outfit.Speaking on Live with Kelly and Ryan in January, Mel detailed how she wore a dress with a 'big slit across the chest' where her medal should have been pinned, adding: 'Victoria knew. She knew!'.Explaining how her friend had designed the dress, Mel said: 'It was quite embarrassing, actually, because I didn't realise the medal goes here on your chest.She continued: 'Victoria [Beckham] designed my dress for the occasion. And she put a big slit right there.  And I was like \"Oh, sorry!\"'",
        "Mel was awarded her MBE (The Most Excellent Order of the British Empire) for services to charitable causes and vulnerable women. The singer also revealed how Prince William had begged her for a Spice Girls reunion.She said: 'He asked, \"Will you get the Spice Girls back together?\". I told him I was having dinner with Victoria that evening and he said, \"Oh good, I’ll work on David then\".'",
        "Mel added that her and Prince William had chatted about her work on domestic violence, with her calling it a 'very special moment for me'. "
    ]
}