{
    "articleURL": "/wires/reuters/article-12059097/Streaming-broke-career-ladder-striking-Hollywood-writers-say.html",
    "content": [
        "By Lisa Richwine",
        "LOS ANGELES, May 8 (Reuters) - Ronald D. Moore started his television writing career in 1989 in a junior-level job on \"Star Trek: The Next Generation\" before he rose through the ranks to produce hits such as \"Battlestar Galactica\" and \"Outlander.\"That path to success is hard to find in today's Hollywood, Moore and other writers say, and is one reason the Writers Guild of America (WGA) called a strike that began May 2 and has shut down late-night television and threatens to undermine the crucial fall TV season.\"If I was starting today, it would be a much harder business than when I started my career,\" Moore, 58, said while picketing outside Comcast Corp's Universal Studios in Burbank, California.How to train and support a new generation of writers is a sticking point in contract negotiations between the WGA, which represents 11,500 film and TV writers, and Hollywood's major studios. Both sides agree that changes brought by TV's streaming revolution have reduced opportunities to work on sets and see first-hand how television is made.A decade ago when broadcast shows dominated television, seasons typically ran for 22 episodes. After one or two were written, filming would start and the writing team would go to the set to help with rewrites and production. Eventually, they could work their way up to running their own series.",
        "Netflix Inc and other streaming services began crafting shorter series in \"mini rooms\" with fewer writers. For a streaming show, 10 to 12 episodes are written all at once, and many of the writers are dismissed before filming begins.While reducing their potential pay, this system also \"is limiting the experience levels of those writers,\" said John August, a member of the WGA negotiating team. \"They're not going to learn how to make a show.\"COLLABORATION WITH ACTORSWriters often rework scripts during production, for various reasons. An outdoor scene, for example, could be moved inside because of bad weather, requiring changes, said \"Boardwalk Empire\" writer Cristine Chambers. Input from actors can lead to revisions.\"Having the ability to talk to actors changes the script,\" Chambers said. \"Suddenly I'm seeing something from (the actor's) point of view. It's a collaboration.\"Hollywood studios made a proposal to help early-career scribes. They suggested having a showrunner identify a promising writer to bring to the set, similar to a Directors Guild of America program, according to a source with knowledge of the talks. The younger writer would be paid a stipend.The WGA, however, is seeking a requirement for at least six TV writers per series, with half of them being employed throughout the production. To the studios, that requirement is impractical and could lead to writers being paid for months while waiting for filming to start.",
        "\"These proposals require the employment of writers whether they're needed for the creative process or not,\" said the Alliance of Motion Picture and Television Producers (AMPTP), the group negotiating on behalf of Walt Disney Co, Universal, Netflix and other studios.\"It is in reality a hiring quota that is incompatible with the creative nature of our industry,\" the AMPTP added.The studios have offered increases in wage and residual payments to address complaints that writers are working more and making less, and that compensation is not high enough for many writers to make a living wage in New York and Los Angeles.The WGA is asking for larger pay raises than the studios have proposed and rewards for writers with more experience.Now, half of all writers work at minimum salary levels, the WGA said. \"The companies have turned the ladder of economic success for writers into a step stool,\" said Chris Keyser said, co-chair of the WGA negotiating committee.On the picket lines, aspiring writers such as 25-year-old Carrie Smith have joined WGA members, hoping to help the Guild secure a deal with better terms to help them build a career.\"I want to be part of fighting for a better future,\" Smith said while holding a \"Writers Guild of America On Strike\" sign. \"You can't climb a broken ladder.\" (Reporting by Lisa Richwine; Editing by Mary Milliken and Diane Craft)"
    ]
}