{
    "articleURL": "/news/article-12054283/Key-Putin-war-supporter-fighting-life-car-bomb-tears-Audi-Q7-half-blast.html",
    "content": [
        "Pro-Kremlin ideologist Zakhar Prilepin, 47,  suffered injuries in a car blast todayAnother driver, Alexander Shubin, 27, was left dead following the incidentPrilepin was there when actor Steven Seagal joined the pro-Kremlin partyA key Putin war supporter is in a '50-50' fight for survival following a car bomb blast that left him 'seriously wounded'.",
        "Pro-Kremlin ideologist Zakhar Prilepin was left with numerous injuries today after an alleged anti-tank mine explosion left another man dead. The incident took place just 100 metres from the spot that Prilepin had dropped his daughter off near Nizhny Novgorod, western Russia, with an explosive device attached to the bottom of another car.The dead driver of the second car was named Alexander Shubin, 27, from Luhansk, Ukraine - a pro-putin fighter whose call sign was Zloi.It is understood that a man named Aleksandr P, 29, has now been detained in connection with the alleged attack.",
        "'Zakhar Prilepin is conscious,' Shot media reported, 'He says he doesn't understand what happened.'Now the victim is being loaded into an ambulance, our source reports.'The Audi exploded near the town of Bor. The wreckage from the car scattered over 50 metres.'Prilepin is a pro-Kremlin novelist turned politician who joined fighters in the war, having been attacked just after a visit to the Donbas -  Russian-occupied eastern Ukraine.The 47-year-old is a strong supporter of the Z-slogan used by Putin supporters to demonstrate their backing of the war.He had also been there at the time when Hollywood actor Steven Seagal joined a pro-Kremlin party nearly two years ago.In 2018, Russia tasked Seagal with improving humanitarian ties with the US at a time when relations between the two countries had begun to deteriorate.",
        "Prior to today's incident, there was some suggestion that Prilepin's car had been tailed, with neighbours also allegedly reporting a suspicious 'bearded man' and an unregistered car in the area.A video from the scene showed severe damage to writer's upturned torn-open car and a huge hole in the ground. Mash media reported that the victim's car was in the vicinity of an anti-tank mine, sparking the catastrophic explosion.'The car was literally torn in half, and tossed in the air. Zakhar survived by a miracle,' said one report. ",
        "Russian state news agency RIA Novosti reported that Prilepin had suffered concussion and 'fractures' in the explosion.Following the incident, some reports claimed that Prilepin was airlifted to Moscow.However, the Telegram channel BRIEF claimed that Prilepin's injuries prevented this from occurring.  He was 'given splints and a brace on his broken leg', reported Mash.Today's attack mirrors a previous car bombing which killed the pro-Putin activist Darya Dugina, 29, in August last year.There was speculation the bomb was aimed at her father Alexander Dugin, a ultranationalist philosopher known as 'Putin's Rasputin'. A group called ATESH - 'The military movement of Ukrainians and Crimean Tatars' - claimed responsibility for the attack.There were immediate calls from pro-war backers for a return of the death penalty.",
        "Today, the Russian foreign ministry immediately put blame on the West for Prilepin's injuries.A criminal case has also now been opened. 'The direct responsibility of the United States and Britain. We pray for Zakhar,' said spokeswoman Maria Zakharova.",
        " Prilepin, 47, is the author of six novels, often focusing on dark themes. His debut novel 'The Pathologies' told the story of young soldiers in the Chechen wars.  The pro-Kremlin ideologist has also written numerous poems, essays and articles, and is the recipient of various state awards including a 2021 arts prize from the defence ministry.He is an outspoken pro-war figure on social media, with around 300,000 subscribers each to his Telegram and YouTube channels.For years, he has organised Russian proxy fighters in the Donbas region of eastern Ukraine, boasting in a 2019 YouTube interview that his unit 'killed people in big numbers'. The extent of his direct combat involvement is not clear.Prilepin has been politically active as the co-chair of the 'A Just Russia - For Truth' party. Last year he took a prominent role in creating GRAD, a parliamentary group that seeks to identify cultural figures with 'anti-Russian' views and persuade the state and business to stop funding them. GRAD's initials stand for 'Group to investigate anti-Russian activity in the cultural sphere.' Grad is also the Russian word for 'hail', and the name of a missile system.Since Russia's full-scale invasion of Ukraine last February, he has been sanctioned by Switzerland, Britain, Australia, Canada, New Zealand and the European Union. The pro-Putin ideologist had also been there at the time when Hollywood actor Steven Seagal joined a pro-Kremlin party nearly two years ago.In 2018, Russia tasked Seagal with improving humanitarian ties with the US at a time when relations between the two countries had began to deteriorate."
    ]
}