{
    "articleURL": "/tvshowbiz/article-12048021/Jennifer-Coolidge-cuts-casual-figure-JFK-Airport-revealed-star-set-host-SNL.html",
    "content": [
        "Jennifer Coolidge was stylishly casual as she arrived at JFK Airport in NYC on Thursday as it's revealed she was set to host Saturday Night Live before WGA strike, per Deadline. ",
        "The White Lotus star, 61, who recently wowed in a bedazzled black gown at the Time 100 Gala, was seen balancing a few items in her hands as she made her way through the crowded airport lobby. The Emmy winner opted to wear a black dress with a hem that stopped a few inches above her knees which was layered with a long, dark gray sweater and a tan, wool coat that she chose to leave unbuttoned. She added a dark brown and black-patterned scarf around her neck that fell on top of her ensemble to keep her warm in the cooler temperatures. The actress slipped into a pair of black, heeled ankle boots with chunky soles that offered an edgy flare to her airport outfit.  ",
        "A dark gray beanie partially covered her long, blonde locks which effortlessly flowed down past her shoulders in light waves. As she strolled through the crowds, Jennifer balances a large, black purse with a gold chained strap over her right arm to hold a few items she needed during her flight. The star also cradled a smaller, black clutch in the crook of her right arm, while gripping a dark brown, Busto and Sun custom hat. She added a smoky shadow around her eyes along with a black liner for a bold touch to her look, and also wore a light pink tint to her lips. ",
        "Coolidge was slated to host the finale episode of SNL's 48th season on May 20, with Succession actor, Kieran Culkin, hosting on May 13. However, due to the Writers Guild of America strike, the season came to an early close, reported Deadline on Thursday. Jennifer's appearance on the sketch comedy would have been her official debut on SNL, and the Home Alone star's second time hosting. Labrinth, who held show-stopping performances at the Coachella Music Festival in April, was slated to perform on May 13 as the musical guest, with the Foo Fighters set to join The White Lotus star during the season finale. Later this week on May 6, former SNL cast member, Pete Davidson, was set to return to the show as host, but the episode was scrapped due to the strike. Reruns instead will take the place of the now-cancelled live shows for the remaining 48th season. ",
        "Jennifer was portrayed on the show by comedian, Chloe Fineman, earlier this year in the sketch titled, The Black Lotus. She also spoofed the actress late last year in December for a Christmas sketch as well. At the time, the Legally Blonde star jumped to her Instagram to applaud Chloe and sent her gratitude to SNL for their spot-on portrayal of her. ",
        "'Wow! A massive thanks to Saturday Night Live!! and to the exceptionally brilliant impressionist @ChloeIsCrazy with your hilarious imitation!!' she had penned. The actress also expressed how she has been attempting to land a coveted spot on the series. 'Also, congrats to the new cast members!! I know how hard it is to get on that show, I tried my a** off to be one but you actually made it!! What a feat! Happy holidays to you all!!' The strike officially began earlier this week on Tuesday, with the last strike taking place in 2007. Other shows that are affected by the strike, along with SNL, include The Tonight Show With Jimmy Fallon and The Late Show With Stephen Colbert. ",
        "A SNL cast member explained to Deadline that, 'We have to think about our crew too.' 'I absolutely support the writers, and I want the writers to get what they deserve and need, but I don’t want our crew to be out of work. We can’t make this art without each other.' Bowen Yang, another cast member, told The Hollywood Reporter on Wednesday, 'We had a few good shows left,' and added that Davidson was, 'very excited to host, even though he knew there was a big asterisk on the week, and there was a looming possibility it might not happen.' ",
        "'I think we were all ready to give it our all for the next three weeks before the season ended,' he concluded to the outlet. Negotiations are still being made, meaning an end to the strike doesn't have an end in sight thus far. In 2007, writers went on strike for a total of 100 days, causing the Los Angeles economy to suffer a loss of $2.1 billion, per The New York Times.  ",
        "Despite no longer making her dream SNL debut this month, Coolidge has been keeping busy and made a show-stopping display at the Time 100 Gala that was held late last month in April, while also making the 2023 Time 100 list. 'I just find it baffling, absolutely baffling, that this is happening. But guess what? I really like it,' she told Time about landing a spot on the list. 'It’s like I was like Sleeping Beauty, where I was locked in a box under the bed or something. And now I’m out and it’s like, \"Well, I’m sure glad they let me out of that box, because this is way better.\"' In regards to a piece of advice that has stuck with her over the years, she revealed that her father once told her, '\"Character is fate.\" As an older person, I’ve realized that’s one of the most accurate things I’ve ever heard. Who you are in this lifetime decides your ending and how your life will go.' "
    ]
}