{
    "articleURL": "/wires/afp/article-12044863/Indias-growing-population-burden-struggling-mothers.html",
    "content": [
        "Married off by her parents at 14, Indian mother-of-seven Jaimala Devi kept having children because her husband insisted she could only stop once she had given birth to two sons.",
        "Devi's story is common across Bihar, the poorest state in the world's most populous country and also its fastest-growing: with around 127 million people, it already has roughly as many people as Mexico.India's overall birthrate has fallen in tandem with its rising economy, but poverty and a deep-rooted bias for male heirs have kept Bihar an engine room of national population growth.\"Having seven kids and managing everything on my own really drives me crazy at times,\" said Devi, who at 30 has never left her home village.\"I thought we'd be comfortable with one or two kids,\" she told AFP. \"But we had girls first, and because of that we have seven.\"Devi, her five daughters and two sons live in a ramshackle one-room hut, unadorned except for a small television, an old fan and some posters of Hindu deities on its unplastered walls.Bihar has scarce opportunities for well-paid employment and Devi's husband Subhash is gone for most of the year, sending back his meagre earnings as an unskilled storehand in the capital New Delhi.Many fathers leave the state to find work elsewhere but consider long absences from home and the struggle to feed their children a worthy sacrifice for the chance of future prosperity.\"Having more children is still considered a way to get more earning members for the family,\" Parimal Chandra, the state head of the non-profit Population Foundation of India (PFI), told AFP.",
        "- 'Respect and pride' -The insistence by many men on having sons reflects cultural expectations that they will support their parents even after marrying and having their own children.",
        "\"Giving birth to a boy means respect and pride for the family and the mother,\" Chandra said.Daughters by contrast are commonly seen as burdensome and costly due to the tradition of wedding dowries paid by the parents of brides.Parents in poorer households often seek to relieve themselves of the responsibility of girls by marrying them off early, as was the case in Devi's wedding as a teenager.This is especially true in Bihar, where the early departure of girls from school has left only 55 percent of women in the state able to read and write -- India's lowest female literacy rate, according to the National Family Health Survey.Chandra said this \"abysmal\" statistic undergirded the state's high birthrate, leaving mothers without access to knowledge on contraception or agency over the size of their families.Bihar's situation was once replicated across India, a country formerly synonymous with grinding poverty but which in recent decades has seen phenomenal economic growth.The average woman in India now gives birth to just two children, down from a 1960 peak of six, in concert with better maternal healthcare and rising living standards.",
        "But Bihar has long been an economic laggard and its much higher birthrate -- around three children per mother on average -- reflects some of India's worst rates of malnutrition, child mortality, education and access to medical care.Raj Kumar Sada, 55, has outlived four of his five children and often tells his only surviving son to have at least four kids of his own.That way \"if something happens to one or two of them, he'd still have someone left,\" he told AFP.\"You will find people with four, five, six, seven or eight children, and it is very normal here.\"- 'A big challenge' -Government healthcare worker Indira Kumari attends to around 400 women in rural Bihar each month, many of whom she says do not get to choose how many children they have.",
        "\"Even if a woman wants to use family planning, her in-laws or husband don't support her view,\" Kumari told AFP.The state government has offered cash incentives for girls to finish their schooling and distributed free condoms in an effort to encourage women to start families later, and have fewer children.These and other efforts have helped change some parents' attitudes in Bihar, when \"even raising the topic was a big challenge\" a few years ago, PFI programme officer Ritu Singh told AFP.",
        "Among the women whose perspective has shifted is Poonam Devi, 26, and no relation to Jaimala, a daily wage labourer who opted for tubal ligation after delivering her fourth child.\"Our people say that a woman is useless if she can't produce kids after marriage,\" she told AFP.\"But I told my husband after our fourth that we have enough and should focus on feeding and educating them, and he agreed.\""
    ]
}