{
    "articleURL": "/news/article-12044289/Crystal-Brook-shooting-Woman-breaks-silence.html",
    "content": [
        "Sean Farris, 52, stabbed two copsHe was then shot dead at his homeCops were doing a welfare check A woman says she feels 'personally responsible' for sparking a meltdown from a dog owner that saw him stab two cops before he was shot dead. ",
        "Sean Ferris, 52, shouted at terrified locals about his dog - a husky called Buddy - outside a supermarket in the small town of Crystal Brook, in South Australia's mid north, on Tuesday.Police officers then attended Ferris' house for a welfare check on Wednesday morning before being stabbed - leaving two in comas and fighting for their lives.Ferris was shot dead at the scene and Pauline Flavel, an elderly local, has now revealed how she feels responsible for what happened.",
        "She says the incident unfolded shortly after a tense confrontation between her and Ferris outside the local shops.She said she had spotted the man's dog tied up to a bollard, whining loudly outside supermarket store Foodland. Ms Flavel thought Ferris would be a long time in the store so she untied the dog and moved him closer to a seat so she could sit down while she comforted it.She said she was friendly with Ferris and would often interact with the man's dog. Ms Flavel said on this occasion Ferris reacted furiously when he came outside and noticed his dog had been moved. 'I was talking to him and petting, so that he wasn't making any noise, but when he came out he just went completely off his tree,' she told The Advertiser.",
        "'He's never done that to me before. I've known him for years, so I just blocked it out and moved on, but I went into the shop and someone was on the phone and I thought I hope she's not calling the police.Ms Flavel said she felt like it was 'my fault' and the following incident between Ferris and police had 'knocked me rotten'. Footage emerged of Ferris, shouting at people about his dog outside the supermarket.He tells them he is 'sick of a**eholes like you whinging about my dog and causing me trouble'.Brevet Sergeant Ian Todd, 53, and Brevet Sergeant Jordan Allely, 32, were stabbed after attending Ferris' home for a welfare check at 10.15am on Wednesday.Brevet Sergeant Todd sustained life-threatening injuries after being stabbed in the neck, arm and hands, while Brevet Sergeant Allely suffered wounds to his right leg and arm.",
        "Both men are in medically-induced comas at Royal Adelaide Hospital.Ferris had had a few run-ins with the police, having been arrested for refusing to wear a mask in November 2021.On the same day he was arrested for assault and disorderly behaviour and later charged with hindering police.Police eventually dropped the assault charge and Ferris pleaded guilty to breaching Covid restrictions, disorderly behaviour and hindering police.  He was ordered to pay costs and had no further penalty imposed after the magistrate took into account the time he had spent in custody following his arrest.",
        "Police Commissioner Grant Stevens revealed that the officers were paying Ferris a visit following a 'disturbance' at the local supermarket on Tuesday. 'There was a minor disturbance at the local supermarket in Crystal Brook,' he said.'The police officers were following up as a result of that incident.' He later described the incident as 'relatively benign' but said it warranted the police to follow-up.In footage from the altercation, Ferris can be seen yelling at another man outside the Foodland while holding a husky and what appears to be a walking stick.'You're the one causing me trouble, (unintelligible) try and do your job,' the man can be heard saying, before shouting: 'Leave me alone'.'I'm sick of a**eholes like you whinging about my dog and causing me trouble … don't tell me what I should do with my life.'   Crystal Brook resident Tom Sawyer witnessed the altercation and said he had heard elsewhere that the man had threatened someone with a knife.'I heard that in passing today,' he told The Advertiser. 'People would get frustrated with the dog, it would make a lot of noise but I never saw it get aggressive.''He was a nice guy whenever I talked to him.",
        "'He'd go down to the shops once a day and then have his lunch under the rotunda … (then) he'd come down again in the afternoon and walk his dog along the trails around town.'",
        "However, there were multiple reports of him confronting strangers with his walking stick and also threatening to unleash his husky.Commissioner Stevens said the shocking incident had devastated the tight-knit police community in Crytsal Brook and the surrounding area. 'Ian has a son-in-law who is the officer in charge of Kadina police station, while Jordan's partner is a constable and his father is also a police officer and the officer in charge of Hallett police,' he said.'So as you can appreciate, there are family members who are directly involved in terms of the impact of this particular incident both as family members and also as police officers.'The police commissioner also revealed that a local resident had provided aid to one of the injured officers during the incident.'We're very grateful for that person stepping forward and providing critical support,' Comm Stevens said.Comm Stevens praised the first responders. 'In all likelihood (ambulance officers') swift actions very likely saved the life of at least one police officer,' he said."
    ]
}