{
    "articleURL": "/tvshowbiz/article-12052903/Emily-Blunts-Tory-MP-uncle-Crispin-attends-Sam-Smith-concert.html",
    "content": [
        "Emily Blunt's Tory MP uncle attended a Sam Smith concert after receiving freebie tickets worth more than £750.",
        "Crispin Blunt, 62, notorious for his liberal views on drugs, accepted a freebie from insurance giant Aviva to watch Smith at the O2 in London.According to the Register of Members' Financial Interests, the uncle of Mary Poppins star Emily Blunt received two hospitality tickets worth a combined total of £756.Sam, 30, who is gender-neutral and uses they/them pronouns, has been travelling around Europe as part of their ongoing Gloria tour. In 2019, Sam said that after years of 'being at war with my gender' they wanted to be referred to as 'them' or 'they', was recently criticised for 'their' sexualised music videos.",
        "He told the Daily Mail's Richard Eden of the event: 'It may have taken a while to attend my first major popular music event, but I thoroughly enjoyed the evening and am grateful to, if unobliged [sic] to Aviva for their hospitality.' Crispin told the House of Commons in 2016 that he would be 'directly affected' by a ban on legal highs, as he regularly used 'poppers'.It comes after Sam returned to stage after cancelling a string of shows on their Gloria tour as they battled a mystery virus.They appeared to be in good spirits as they put on an energetic performance on Monday night after recovering from a mystery illness.",
        "They had postponed two shows on their ongoing Gloria tour last week after Sam and their team were all struck down by illness.Sam appeared to be fully recovered as they danced across the stage and belted out their best-known hits while standing on a huge gold sculpture.They also gestured out to the audience as their fans sang along to their tracks during the high-energy show in Berlin, after they returned to their tour in Copenhagen.Sam's return to stage comes after they cancelled two gigs last week after being struck down by a mystery illness.",
        "Last Monday, Sam had taken to their Instagram Stories to tell fans they would not be able to perform at the Resorts World Arena in Birmingham on Tuesday as they were well not well enough, postponing the show until next month.Just days earlier, Sam had pulled out of performing at the OVO Hydro Arena in the Scottish city of Glasgow on Saturday.Sam announced: 'Sailors, I am so sorry to let you know that my team and I are still really not well, so unfortunately we need to reschedule out Birmingham show to the 27th of May 2023.'It's so important to me that we give you the very best version of Gloria. I don't want you to experience it at anything less.",
        "'Thank you so much for understanding, I know how excited everyone is to see the show, and I feel the same about seeing all of you.'All previous tickets are still valid for the new date. For more information, go to my website www.samsmithworld.com. All my love, Sam X.'The star reassured fans that all tickets would be valid for the new date of Saturday 27 May.Sam had earlier pulled out of their gig in Glasgow on Saturday after they were originally struck down by the mystery virus.Announcing the news on Instagram, Sam shared that they would not be able to perform at the OVO Hydro Arena in the Scottish city at the weekend as they were not well enough.Sam explained how they and their team were feeling 'really unwell' but they would be rescheduling the gig for next month.The pop star has recently found themselves at the centre of some harsh criticism from online trolls for their choice of on-stage attire.Some branded the recording artist 'satanic', after the star previously revealing they were shockingly spat at in the street after announcing they were non-binary.However, Sam has continued to brush off any negative reaction and taunts as they remain confident in their performance art and strong public image.",
        "Sam prompted 100 Ofcom complaints at the BRITs this year where they performed their single Unholy along with Kim Petras, 30, at London's O2 Arena in February. ",
        "They had dressed as the devil, complete with horns coming out of their hat, a similar look to the one they wore at the Grammys the week before.A spokesperson for Ofcom told MailOnline: 'We received 106 complaints about The Brit Awards on ITV1 on 11 February.'The majority of complaints related to Sam Smith's performance, with the remainder about the use of offensive language and consumption of alcohol.'"
    ]
}