{
    "articleURL": "/wires/aap/article-12039843/Hopes-barley-breakthrough-China-grow.html",
    "content": [
        "Australia is pushing for the removal of Chinese trade sanctions on barley and wine exports as the government lobbies on behalf of a journalist detained for nearly three years on espionage charges.",
        "Foreign Minister Penny Wong says it's in the interests of both nations to have the impediments removed after a recent breakthrough led to China agreeing to expedite its review of barley sanctions.Australia in turn agreed to pause its World Trade Organisation dispute against China.\"We're trying to go through a number of processes, including through the World Trade Organisation and discussions with China to resolve these trade agreements,\" Senator Wong told 2GB radio on Wednesday.\"There has been some improvement over this last year, particularly in the area of coal. Barley and wine are the next two sectors that we're really focused on.\"Treasurer Jim Chalmers says he wants to see a breakthrough with a key economic partner in the interests of the region.\"A lot of exporters are big employers here in Australia. We want to see those trade restrictions lifted in the interests of our people but also in the interest of a peaceful, prosperous, stable and secure region,\" he said.Prime Minister Anthony Albanese said while Australia was focusing on its relationships, it was also investing in military capability.\"One of the ways we are also engaging in the region is by lifting up our national security, we don't apologise for that,\" he told broadcaster Piers Morgan in a London interview.",
        "\"Our position on China has been to engage constructively, but to continue to put forward that the impediments to trade should be removed.\"Trade Minister Don Farrell is due to travel to China in coming weeks.But his visit comes at a sensitive time as detained Australian-Chinese journalist Cheng Lei nears 1000 days in prison on espionage charges the Australian government rejects.The handing down of her verdict has reportedly been delayed for another three months for the fifth time.Consular visits resumed in January after being suspended last October because of COVID-19 restrictions.Australian officials last visited the detained journalist on April 26.\"I speak for all of us when I say our thoughts are with her and her loved ones, particularly her two children. Australians everywhere would be united in their call for a mother to be reunited with their children,\" Senator Wong said.\"Regrettably in the Chinese system, the deferral of verdicts is part of the process you often see. Obviously, it's a concern to us that still we don't see Ms Cheng Lei knowing what the verdict against her is.\"Mr Albanese said he would communicate clearly with Chinese President Xi Jinping that Australians needed to be given \"proper justice\".\"They're not receiving that at the moment,\" he said.",
        "\"We don't shy away from (tough issues) but we do so in a way that's constructive and respectful and that's how you advance diplomacy. That's how you advance positive outcomes.\"A Department of Foreign Affairs and Trade spokesman said the government was deeply concerned about the ongoing delays in Ms Cheng's case."
    ]
}