{
    "articleURL": "/wires/ap/article-12038725/Ex-Raider-Ruggs-taking-plea-deal-prison-fatal-DUI-crash.html",
    "content": [
        "LAS VEGAS (AP) - Ex-Las Vegas Raiders player Henry Ruggs told a judge Tuesday he will admit that he drove drunk at speeds up to 156 mph, causing a fiery crash that killed a woman. His plea deal is expected to send the 24-year-old first-round NFL draft pick to state prison for three to 10 years.",
        "Ruggs waived a long-delayed preliminary hearing with the agreement to admit that he drove under the influence of alcohol causing death, a felony, his lawyers said. A six-month sentence for a guilty plea to misdemeanor manslaughter will be folded in with the total.Ruggs spoke only to acknowledge for Justice of the Peace Harmony Letizia that he understands the terms of the agreement. The judge scheduled his plea for May 10. Prosecutor Eric Bauman told the judge the Clark County District Attorney's office endorsed the deal.\"This is the first step toward a fair resolution to this matter and we look forward to closure for all parties involved,\" Ruggs' attorneys, David Chesnoff and Richard Schonfeld, said in a statement handed to reporters. They and their client and several people with them declined additional comment in the court hallway.Ruggs´ lawyers lost a bid to prevent prosecutors from presenting evidence that Ruggs had a blood-alcohol level of 0.16% - twice the legal limit in Nevada - after the predawn rear-end wreck that killed 23-year-old Tina Tintor and her pet dog, Max.The speed limit where the crash happened was 45 mph (72 kph), a fraction of what police said Ruggs was driving. Investigators found air bag computer records showing his 2020 Chevrolet Corvette decelerated from 156 mph (251 kph) to 127 mph (204 kph) seconds before slamming into Tintor's Toyota Rav 4.",
        "An attorney who has represented Tintor's family members at earlier court appearances did not respond to email and telephone messages to him and his media representative about Ruggs´ plea.Ruggs' sentencing will follow on another date in state court in Las Vegas. Other charges will be dismissed, including felony reckless driving, driving under the influence causing substantial injury to Ruggs' girlfriend, Je´nai Kilgo-Washington, and a misdemeanor gun charge. Police said they found a loaded handgun in Ruggs' demolished Corvette after the crash.Ruggs was released by the Raiders shortly after the Nov. 2, 2021, crash. He could have faced more than 50 years in prison if convicted of all the charges at trial, District Attorney Steve Wolfson had said.Wolfson declined to comment Tuesday, ahead of Ruggs' scheduled plea. The district attorney said following the crash that investigators learned that Ruggs spent several hours at a sports entertainment golfing venue in Las Vegas the evening before the predawn crash and may have been at a friend´s home for several more hours before he and Kilgo-Washington headed home.Ruggs posted $150,000 bail to be freed from jail after leaving the hospital and has remained on house arrest for 18 months with strict conditions including alcohol checks.Bauman said outside court that Ruggs would remain on house arrest pending sentencing, and his minimum three-year sentence cannot be reduced by converting that to time already served.",
        "Kilgo-Washington and Ruggs have a daughter together, and Kilgo-Washington was not cooperative with prosecutors as a victim in the substantial injury charge. Her attorney, Peter Christiansen, lost a bid to block prosecutors from getting Kilgo-Washington´s medical records on privacy grounds.Prosecutors said Ruggs suffered a leg injury and Kilgo-Washington underwent surgery for an arm injury.Ruggs had been emerging as a star wide receiver for the Raiders before the crash, and records showed he owned a $1.1 million home not far from the crash scene. He had signed a four-year rookie contract reported to be worth more than $16 million.____This story corrects reference to May 10 plea date. Sentencing will follow at a date to be set by a judge."
    ]
}