{
    "articleURL": "/wires/aap/article-12057859/Single-parent-payment-threshold-extended-budget.html",
    "content": [
        "Financial support will be extended for single parents in the federal budget.",
        "The cut-off for the parenting payment will be raised from when the child turns eight to when they turn 14.Parents will be able to receive $922.10 a fortnight until their youngest turns 14.Changes in Tuesday's budget will also allow for parents to no longer have to transfer to JobSeeker when their youngest child turns eight.The changes will come into effect from September 20, pending the passing of laws, with eligible single parents on JobSeeker set to get a $176.90 increase in pay per fortnight.The raise in the age cut-off will cost $1.9 billion to the federal budget through to the 2026/27 financial year.Prime Minister Anthony Albanese said the changes to single parent payments would bring more stability.\"What that will do is to make sure that women, in particular, but also fathers in situations of raising children by themselves, can have that sense of security, that children can be looked after,\" he told reporters in Perth.\"They're deserving of more support.\"While the age threshold had been lifted, the women's equality task force had urged the government to lift the limit to when the youngest child turns 16.The threshold was originally 16 until changes made by the Howard government reduced it to eight.The task force's chair Sam Mostyn said while she hoped the age would be lifted to 16 eventually, raising the threshold was significant.",
        "\"We're very happy with it and, of course, it is an extra six years for those families and those children, and I think that's a big step forward,\" she told ABC TV.\"It would be wonderful to see the full reinstatement of 16 over time.\"The Greens have called for the age to be set to 16.Mr Albanese said the age cap of 14 was the right balance.\"Fourteen is a period in which a student starts to gain more independence, doesn't need the same level of support at home that a younger child does. Eight was far too low,\" he said.\"An eight-year-old needs mum or dad or their carer to cook them dinner, to look after them. A 14-year-old starts to ... move into that change into adulthood.\"Nationals leader David Littleproud said the changes to payments needed to be examined in relation to the bigger budget picture.\"Obviously, the government's made it clear they wanted to help those that are on social security payments to keep pace with inflation, even though there are indexed movements on that every six to 12 months,\" he told Sky News.\"We'll look at it in the totality ... and understanding who's paying for it, because invariably it's going to be regional Australia.\"",
        "Australian Council of Social Service chief executive Cassandra Goldie welcomed the age limit rise, but said more was needed.\"While today's announcement is excellent and very welcome news for the 57,000 single parents who will benefit, 860,000 people will remain on JobSeeker, including 28,000 single parents,\" she said.\"We need to ensure that everyone - single parents, people with disability, people with chronic illness, people looking for paid work, students, people who are caring - have enough to cover the basics.\""
    ]
}