{
    "articleURL": "/news/article-12057969/Peter-Costello-says-Australian-government-overreacted-Covid-imposed-draconian-rules.html",
    "content": [
        "Peter Costello said government 'overreacted'Former Treasurer slammed use of curfews He said government had 'enormous reach'Nine's chairman has slammed Australia for 'overreacting' to Covid and subjecting residents to 'draconian' and 'unnecessary' restrictions. ",
        "Peter Costello, who was a prominent treasurer under Liberal PM John Howard, said governments across Australia went 'too far' when they shut down workplaces and implemented daily curfews in 2020 and 2021. Mr Costello said not even during World War II had Australians been forced to stay inside their homes past 9pm. 'You'll look back on it and you'll say, 'how did we put up with that infringement on individual liberty,' he told YouTube channel John Anderson Conversations. ",
        "Australia had one of the toughest lockdowns in the world with state leaders closing the borders and introducing draconian stay-at-home orders for millions of residents. Western Australia closed its borders to the rest of Australia in March 2020 and in April enforced borders between regions in the state.  Premier Mark McGowan finally lifted the hard border with other states and territories in March, 2022 for all Australians and triple-vaccinated travellers from overseas. However, it was residents in Melbourne who suffered the longest lockdown in the world, with strict stay-at-home orders enforced for a total of 262 days. People could only exercise within a five kilometre radius of their home and were restricted by a nightly curfew of 9pm to 5am. In Sydney, similar rules were enforced, with the military deployed to 'hotspot' areas like the south and southwest to ensure residents were following lockdown rules. ",
        "'The government had enormous reach, the government had huge media influence, they were running daily press conferences, giving out body counts all the time,' Mr Costello said.'This idea that if you went out of your house for more than an hour a day, you could die, or worse you could infect someone that could die. 'But somehow, if you only went out for 59 minutes you were going to be safe.'The 65-year-old, who was Treasurer under John Howard from 1996 to 2007, criticised state governments who had forbidden residents from visiting their loved ones in hospital or attending their funerals during the pandemic.'You weren't allowed to say goodbye to loved ones, who were dying,' he said. 'And to me, this would have been unthinkable in the Second World War. 'But because the reach of the State now is so much greater, people just by and large just took it. The police were out arresting anybody who broke any of these rules.'YouTube channel host Mr Anderson, who was deputy prime minister from 1999 to 2005, discussed with Mr Costello the highly-publicised arrest of a pregnant mother.Zoe Buhler was live on Facebook and in her pyjamas when officers stormed into her home and handcuffed her in front of her children in September, 2020. ",
        "She was charged with incitement after she made an online post that appeared to encourage locals in Ballarat, Victoria, to protest against Covid restrictions. In the video of her arrest, Ms Buhler said she didn't know she was breaking any rules. 'I wasn't breaking any laws by doing that,' she said to a police officer.'I'm happy to delete the post, this is ridiculous. My two kids are watching, I have an ultrasound in an hour, I'm happy to delete the post.'In 2021, she contested the charge and $1,600 fine in Ballarat Magistrates Court where after a three-day hearing her charges were dropped.Outside court, Ms Buhler said her stance on lockdowns remained the same and that she was glad to have stood up for 'people's human rights and freedom'. '(It's) ridiculous on the police side of things that they dragged it out for so long. I'll be considering my options going forward, especially in regards to being handcuffed while pregnant,' she told reporters. 'I think it's disgusting that our human rights and freedoms were taken away from us.'",
        "Mr Costello said Ms Buhler's planned demonstration had been 'entirely lawful'. 'Police came into her home, put her in handcuffs, take her off to the police station \"enforcing the law\" and it was just intimidation,' he said. ",
        "'As it turned out, the charge was dropped, it was just intimidation. The police might come into your home and they might arrest you.'  Mr Costello was Australia's longest serving Treasurer, serving from 1996 to 2007 under Liberal Prime Minister John Howard. "
    ]
}