{
    "articleURL": "/wires/ap/article-12040115/Elder-shuts-Marlins-outpitches-Alcantara-Braves-win.html",
    "content": [
        "MIAMI (AP) - Bryce Elder outpitched NL Cy Young Award winner Sandy Alcantara by throwing seven innings of three-hit ball and the Atlanta Braves beat the Miami Marlins 6-0 on Tuesday night.",
        "Ozzie Albies homered and doubled, while Ronald Acuña Jr. doubled, drove in a run and stole his NL-leading 14th base for the Braves. Acuña played a day after sustaining a bruised left shoulder when he was plunked by a 93 mph fastball in the second game of a doubleheader against the New York Mets.Elder (3-0) struck out six and benefitted from a sinker to induce 10 groundouts in his longest start of the season.\"I thought it was pretty good,\" Elder said of his start. \"My misses, even the ones that were a full 58 feet, were down and that´s where I shoot to miss. I was pleased with it.\"Elder allowed only one Miami runner reach scoring position after he balked Jon Berti to second with one out in the third. But Elder struck out Jazz Chisholm Jr. and retired Jorge Soler on a pop out to end the early threat.\"The movement on that sinker was just crazy,\" Braves manager Brian Snitker said. \"And he´s efficient, put the ball on the ground. After (Monday) and all the guys that we had to use for the doubleheader, that was big.\"",
        "Alcantara (1-3) has a 7.40 ERA and lost three of his four starts since throwing a complete game shutout against Minnesota on April 4.",
        "The Braves chased Alcantara after five innings and 103 pitches. Alcantara gave up three runs, six hits, walked three, struck out five and hit two batters.\"He just struggled putting guys away,\" Marlins manager Skip Schumaker said. \"A lot of foul balls and deep counts got his pitch count up. That´s why he went five.\"Albies gave the Braves an early lead with his solo shot in the second. He drove Alcantara´s fastball over the wall in right for his eighth homer.Atlanta loaded the bases with no out in the third before Eddie Rosario grounded into a double play that scored Matt Olson from third.Rosario´s two-out RBI single in the fifth made it 3-0.Acuña hit a sacrifice fly and Austin Riley and Sean Murphy had consecutive walks with the bases loaded against Miami reliever Johan Quezada in the eight to pad Atlanta´s lead.Kirby Yates and Joe Jimenez followed Elder and each pitched one inning.BUILDING UP THE PITCH COUNTOlson helped cut Alcantara´s outing with two lengthy plate appearances. In the first, Olson fouled off four consecutive pitches before striking out on the ninth pitch. Olson then worked out of a 1-2 count in the fifth and drew a walk by forcing Alcantara to throw 10 pitches.",
        "\"Any time that you can get him out of a game, like we did, that´s huge, because as we´ve seen him, he can be on top of you for nine innings and not let you breathe,\" Snitker said.ROSTER MOVEThe Marlins placed OF Avisaíl García on the 15-day injured and recalled INF Xavier Edwards from Triple-A Jacksonville. Edwards pinch hit in the ninth and flew out to center.TRAINER´S ROOMBraves: RHP Raisel Iglesias (right shoulder inflammation) is scheduled to throw again in the next couple days after two rehab outings with Triple-A Gwinnett.Marlins: RHP Johnny Cueto (right biceps tightness) will throw in a rehab game with Jacksonville on Saturday. ... INF Garrett Cooper is still dealing with nausea after exiting in the fourth inning of the series finale against the Chicago Cubs on Sunday.UP NEXTBraves RHP Kyle Wright (0-1, 4.86) will start the second game of the series Wednesday against Marlins LHP Braxton Garrett (1-0, 2.45).___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}