{
    "articleURL": "/news/article-12051211/Hunter-Biden-moves-creating-legal-defense-fund-raising-concerns-inside-White-House.html",
    "content": [
        "Move comes as a federal probe is wrapping up and GOP probes escalateSome Democrats worry how the solicitations would appearHunter Biden was in Arkansas court this week in child support battle Hunter Biden is moving toward creating a legal defense defense fund as he contends with federal probes, congressional investigations, and an ongoing custody lawsuit.",
        "The move comes as Hunter Biden's lawyer Abbe Lowell revealed he has paid $750,000 in child support to Lunden Roberts, who is battling him in court as he seeks to reduce child support payments for 4-year-old Navy Joan Roberts. He currently pays $20,000 per month in child support.As with his art career, a defense fund that would allow people to put thousands of dollars in his pocket raises potential ethical challenges. High-level Democrats are concerned about the appearance of the president's son soliciting funds, Axios reported. The push for cash to aid Hunter in his multi-front legal challenges comes as President Joe Biden has launched his reelection campaign – with his own first big fundraiser since announcing set for New York next week. ",
        "The preparations come a week after Hunter Biden met with U.S. Attorney for Delaware David Weiss at Justice Department headquarters in Washington D.C., in a sign that the federal investigation of him on tax matters and a gun charge are reaching a conclusion.Anticipating potential scrutiny, Hunter's team is looking to hire ethics advisors to work with the fund. Weiss and his federal prosecutors are weighing four charges against Hunter, three related to tax crimes and a felony charge related to a gun purchase, according to the Washington Post. White House tensions also encouraged Hunter Biden to hire high profile lawyer Abbe Lowell, who previously represented Trump son in law Jared Kushner, according to the report.  ",
        "The possible federal charges are two misdemeanor counts for failure to file taxes, a single felony count of tax evasion related to a business expense for one year of taxes, and the gun charge, also a potential felony.Meanwhile, Congressional Republicans are stepping up their probes of Hunter Biden's finances and what some of them call the 'Biden crime family.'",
        "This week, Iowa Sen. Charles Grassley, 89, came forward with House Oversight Committee Chairman Rep. James Comer to bring forward claims from a whistleblower that they described as a bribery scheme from when Biden was serving as vice president.'We believe the FBI possesses an unclassified internal document that includes very serious and detailed allegations implicating the current President of the United States,' Grassley said, as Comer subpoenaed the information.However Grassley said in an interview on Newsmax: 'It is a very serious allegation. I wish I could say that I knew it was true or untrue.'Earlier, House Republicans viewed Special Activity Reports at the Treasury Department. Comer has tasked his investigators with running down Hunter's business dealings, even subpoenaing Bank of America for information on three of his business associates. Last month, Lowell fired off an angry letter to a congressional ethics body demanding a probe of Rep. Marjorie Taylor Greene's repeated comments linking the president's son to 'human trafficking.' "
    ]
}