{
    "articleURL": "/sport/nrl/article-12042691/Five-NRL-stars-Blacks-great-believes-make-switch-codes-improve-Wallabies.html",
    "content": [
        "Aaron  Smith believes Cam Munster and Harry Grant would excel in rugbyRugby Australia signed Joseph Suaalii and is targeting Payne HaasCam Murray has also been linked with a switch to the Wallabies All Blacks star Aaron Smith believes Cameron Munster, Harry Grant and Cameron Murray would be standout players should they ever consider switching to rugby union.",
        "Eddie Jones bullishly suggested he may raid league to convince some of the game's biggest stars to move to rugby when he was appointed in charge of the Wallabies in January.And Rugby Australia chairman Hamish McLennan has backed him with an aggressive recruitment strategy that reignited the feud between rugby and the NRL.In March Sydney Roosters Joseph Suaalii agreed a three-year deal worth $1.6million-a-year with Rugby Australia from 2025 and last month McLennan opened negotiations with Broncos superstar Payne Haas.Australian Rugby League chairman Peter V'landys has batted away concerns of an exodus towards rugby union, but that hasn't stopped a number of NRL stars being linked with a code switch.",
        "Aside from Haas, the likes of Rabbitohs star Cameron Murray, Newcastle captain Kalyn Ponga, Manly star Tolu Koula and Parramatta centre Will Penisini have all been mentioned as potential targets.And Smith admitted he would 'hate' to see Murray, who in March left the door open to a possible return to union, playing for the Wallabies.'He'd be a gun. Cam Murray, his schoolboy highlights are pretty gangster and [Angus] Crichton is the same,' the All Blacks great told The Ice Project podcast, hosted by former NRL player Isaac John.'Big centres, ball runners, offload, stay in the play for the whole time. They're your workhorses but they've got that bang, that's what you want your midfield to be.'",
        "The 2015 Rugby World Cup winner also suggested Haas could become one of the best No8s in the world should he switch to the 15-man code.Haas was a member of the Wallabies’ Gold junior development program and played as No.8 in his teens, before turning his attention to rugby league when his family relocated to the Gold Coast. But Smith believes the two players who could have the biggest impact in union are Melbourne Storm duo Harry Grant and Cameron Munster, neither of whom has been linked with a switch to rugby.'I reckon Harry Grant would be the man to be honest at nine [halfback], and he would just destroy it because he's so fast and strong,' he said.",
        "'Harry Grant at nine and [Cameron] Munster for me at fullback would just be, in rugby, a gun. 'I think his talent and gifts and vision, because that's what rugby has - it's so structured defensively - the guys that you don't know what they're going to do, it's just so hard to mark [them]. 'His wiggles and his goosies [goose steps] and his offloads and how hard he is and doesn't give up, they're the players you want in rugby. 'Munster, he'd be a freak.'Smith was also full of praise for Jones, whom he described as a serial winner. ",
        "During Jones' first stint with the Wallabies, Mat Rogers, Wendell Sailor and Lote Tuqiri all crossed codes in the early 2000s and the 63-year-old appears to have injected a new lease of life into the code in just four months in the role.",
        "And the All Blacks scrum half, who is leaving New Zealand to play in Japan after this year's Rugby World Cup, expects Jones to have a similarly significant impact on the field'Eddie Jones will be massive,' he said.'People don't get it, he's a winner and everywhere he's gone he's won. [...] You think of what he's gonna bring and with the Rugby World Cup [in 2027] and the Lions Tour [in 2025] the Aussies really have to capitalise on that.'They [Australia] bring the best out of us too because if you don't get it right, the Aussies never give up […] you've always got to respect [them], the fight in the Aussie is tough. "
    ]
}