{
    "articleURL": "/femail/article-12054873/SHANE-WATSON-Penny-Mordaunt-leads-fashion-parade-Tory-powerhouses-Coronation.html",
    "content": [
        "When Penny Mordaunt, Leader of the House of Commons, Lord President of the Council and bearer of the Sword of State, approached the Abbey – accompanied by an umbrella flunky – there was a hint of Cleopatra preparing to greet her people.",
        "The fitted teal dress and cape, and her matching padded headband, were embroidered with gold leaves – in ancient Rome worn on the head as a symbol of triumph, importance and godly status. In her almost-coronet and modern version of an ermine cloak, a bespoke design of the £2,000 Roni dress by atelier Safiyaa, Mordaunt looked by far the most regal of the Tory Ladies.Right at the other end of the spectrum was Therese Coffey, Environment Secretary, perhaps flying the flag a bit too literally given the occasion. In her red hat, white jacket and navy and white print dress, accessorised with a Union Jack-print scarf, some commentators said she looked a bit like a commemorative Toby Jug.The prize for standing out in a crowd went – not to anyone’s great surprise – to Liz Truss, wearing easyJet orange Karen Millen with a matching saucer hat, while the award for blending in surely went to Boris Johnson’s wife Carrie Symonds, who eschewed her usual bright red and pink for an appropriately conservative navy coat with gold buttons over a lighter blue £279 Claudie Pierlot dress and blue hat.Rishi Sunak’s wife Akshata Murty and Samantha Cameron toughed it out for the award for the most fashionable dresses of the day in the Tory camp. Since Samantha has her own dress label, Cefinn, it was no surprise that she chose the prettiest of her own occasionwear, the £390 Voletta Maxi.",
        "Akshata has established herself as a fashion follower with a passion for big labels. However, her outfit was not by a big fashion house but an elegant dress in sky blue by British designer Claire Mischevani (Kate’s sister Pippa Middleton wore a yellow dress coat by the brand yesterday), perhaps chosen because it cost a relatively modest £945. Akshata’s pretty black hat – somewhere between a pill box and a beret – was one of the chicest of the day.But in the competition for who could be the most frugal Akshata failed miserably. Home Secretary Suella Braverman was hands down the winner in her old-season LK Bennett fitted silver-grey suit and frothy fascinator.Andrea Leadsom’s cream dress and matching round-neck coat, overlaid with lace, was perhaps the least well-judged of the Tory women’s outfits. On a day when the King and Queen were guaranteed to be wearing cream fur and silk, and showers were forecast, the colour was a risky choice.But Theresa May pulled it off, thanks to her coat’s splashy abstract-print front panel. Her orange trilby-style hat was swaggeringly stylish, recalling her leopard-print shoe days in No 10. Sadly, on regal Saturday, the former Prime Minister played it safe with mid-heel, beige footwear."
    ]
}