{
    "articleURL": "/wires/ap/article-12060713/US-agency-plans-deeper-study-sea-turtles-dredging-threat.html",
    "content": [
        "SAVANNAH, Ga. (AP) - A U.S. agency has agreed to an in-depth environmental study into whether dredging a Georgia shipping channel in the spring and summer would threaten rare sea turtles nesting on nearby beaches - a review demanded by conservationists who sued to stop the project.",
        "Georgia conservation group One Hundred Miles moved to dismiss its lawsuit against the Army Corps of Engineers after the agency announced Friday that it would voluntarily conduct the study. The group sued in December, asking a U.S. District Court judge to order the Corps to produce such a report.\"The Corps has now committed to what we´ve asked for, to go back and review the science,\" Catherine Ridley, a One Hundred Miles vice president, said Monday. \"The science is clear: Spring and summer dredging puts Georgia's sea turtles and decades of conservation progress at risk.\"Environmentalists and the Army Corps have battled since 2021 over the agency's plan to end a policy that for three decades has prohibited the dredging of accumulated sand and mud from harbors in Georgia and the Carolinas during the nesting season for sea turtles.In place since 1991, the seasonal limits are intended to protect sea turtles from being killed and maimed by the vacuum-like suction pumps of hopper dredges during the warmer months, when female turtles are most abundant near Southern beaches. Conservationists credit that policy with helping threatened and endangered turtle species begin a fragile rebound.The Army Corps said in a statement Monday that it is undertaking the fuller environmental study to \"ensure robust public, agency, and stakeholder engagement\" as well as \"full evaluation of the impacts that this action may have to the human and natural environment.\" The agency is responsible for keeping shipping channels clear of accumulated sediments to ensure safe passage for ships",
        "Since the 1990s, maintenance dredging in Georgia and the Carolinas has been confined to a period roughly between December and March. Giant loggerhead sea turtles, federally protected as a threatened species, typically start nesting in May. Smaller numbers of endangered green and Kemp´s ridley sea turtles lay eggs in the region as well.The Corps has argued seasonal dredging limits are no longer necessary. That's because the National Marine Fisheries Service concluded in 2020 that sea turtles protected by the Endangered Species Act can likely endure roughly 150 deaths anticipated annually from year-round dredging.Army Corps officials have said seasonal restrictions make it difficult to compete for a limited number of contractors. They also argue that dredging windows timed to protect sea turtles ignore species such as critically endangered North Atlantic right whales, which frequent the same waters during winter.A federal judge in May 2021 temporarily blocked the Army Corps from conducting year-round dredging in Georgia. Last September, a different judge halted a similar plan in North Carolina. Both judges ruled that the Corps failed to adequately assess potential dangers to legally protected sea turtle species.In Georgia, the Army Corps responded a year later with an environmental assessment that concluded year-round dredging in Brunswick would have no significant impact on sea turtles. Last July, the agency solicited bids for dredging in Georgia that included an \"optional bid item\" to dredge in Brunswick between May and August during sea turtle nesting season.",
        "One Hundred Miles filed suit again in December, arguing the Corps' assessment was insufficient. The group asked a judge to order the Corps to produce a full environmental impact statement - the most comprehensive type of review federal agencies can undertake to ensure projects don't violate the National Environmental Policy Act.Col. Joseph R. Geary, commander of the Army Corps' Savannah District, in March prohibited any maintenance dredging in Brunswick outside the seasonal window, pending further review. On Friday, the Corps announced that review would consist of a full environmental impact statement.The Army Corps said it does not know how long the more in-depth study is expected to take."
    ]
}