{
    "articleURL": "/wires/pa/article-12040073/Police-catch-man-accused-killing-five-neighbours-four-day-search.html",
    "content": [
        "Authorities near Houston, Texas, say they have caught a man suspected of killing five of his neighbours.",
        "A nine-year-old boy was among those fatally shot with an AR-style rifle after the family confronted him late at night about firing rounds in his yard.Francisco Oropeza, 38, was arrested on Tuesday, four days after the shooting late on Friday in the town of Cleveland, about 45 miles north of Houston, according to Montgomery County Sheriff Rand Henderson.Mr Oropeza was arrested without incident not far from the site of the shooting, Sheriff Henderson said.Acting on a tip, authorities said they found the suspect hiding underneath a pile of laundry in the closet of a house.Police had used drones and scent-tracking dogs during the wide search for Mr Oropeza that included combing a heavily wooded forest a few miles from the scene.San Jacinto County Sheriff Greg Capers said Mr Oropeza had fled the scene after the attack that also left four adults dead.He said his deputies had been called to the suspect’s house at least one other time previously over shooting rounds in his yard.Mr Oropeza will be charged with five counts of murder. His bond has been set at five million US dollars (£4 million).“They can rest easy now, because he is behind bars,” Sheriff Capers said of the families of the victims. “He will live out his life behind bars for killing those five.”",
        "The arrest happened near Conroe, ending what had become a widening dragnet that had grown to more than 250 people from multiple jurisdictions and had seen 80,000 dollars (£64,000) in reward money offered.As recently as Tuesday morning, the FBI said that Mr Oropeza “could be anywhere”, underlining how investigators for days struggled to get a sense of his whereabouts and candidly acknowledged they had no leads.The tip that finally ended the chase came at 5:15pm, and a little more than an hour later, Mr Oropeza was in custody, said FBI Assistant Special Agent in Charge Jimmy Paul.The alleged shooter is a Mexican national who has been deported four times between 2009 and 2016, according to US immigration officials.All of the victims were from Honduras. Wilson Garcia, who survived the shooting, said friends and family in the home tried to hide and shield themselves and children after Mr Oropeza walked up to the home and began firing, killing his wife first at the front door.The victims were identified as Diana Velazquez Alvarado, 21; Julisa Molina Rivera, 31; Jose Jonathan Casarez, 18; Sonia Argentina Guzman, 25; and Daniel Enrique Laso, nine."
    ]
}