{
    "articleURL": "/news/article-12059185/Ted-Cruz-faces-backlash-Texas-mall-massacre-leaves-nine-dead.html",
    "content": [
        "Mauricio Garcia, 33, killed eight people at mall before being shot dead by policeTed Cruz criticized for praying for victims' families rather than acting with lawsTed Cruz is facing backlash for saying he is 'praying' for the families of the eight victims killed in the Texas mall mass shooting instead of advocating for meaningful gun control laws that would prevent such heinous crimes.",
        "In the hours after Mauricio Garcia, 33, opened fire on shoppers with a AR-15 at the Allen Premium Outlets mall on Saturday, the Texas Senator tweeted his thoughts and prayers are with the families of those shot dead.Eight people, including a child, were shot dead by Garcia before the gunman was killed by a police officer who had been called to the mall on another assignment.Cruz tweeted: 'Heidi and I are praying for the families of the victims of the horrific mall shooting in Allen, Texas. We pray also for the broader Collin County community that's in shock from this tragedy.'But Cruz faced criticism for repeatedly saying his thoughts and prayers are with those affected by mass shootings rather than advocating for better gun control laws.",
        "'You helped arm him with guns, ammo and tactical gear,' Shannon Watts, founder of gun safety group Moms Demand Action, wrote on Twitter in response to Cruz's statement on the shopping mall massacre.",
        "'He did exactly what you knew he'd do. Spare us your prayers and talk of justice for a gunman who is dead. The only accountability we can hope for is that gun extremists like you are thrown into the ash heap of history,' Watts added. Steven Spainhouer, a former police and army officer who witnessed the shooting, said: 'Prayers and condolences won't bring these people back. We need some action in our legislatures at the federal and state level for better gun control, and I'm saying that as someone who loves guns.' ",
        "Spainhouer said it is long pastime automatic weapons were removed from everyday public life, on account of the rising number of mass shootings. The Texas mall massacre was the 199th mass shooting in America so far this year.'I'm a gun lover, I have guns. But these M4s, AR-15s, they've got to get off the streets or this is going to keep happening, and we've got to stop that at some point,' he told MSNBC.Others on Twitter wrote that Cruz's thoughts and prayers 'are nothing but blasphemy and evil'. Another wrote: 'Have you tried turning the prayer machine off and back on again.'Cruz has received more than $442,000 from organizations which support keeping guns as accessible to the public as possible, according to Open Secrets and Axios.The Senator has previously said his and his wife Heidi's thoughts and prayers are with the victims of mass shootings - rather than advocating for gun control laws. In the past 12 months, there have been 91 mass shootings where 200 people have died.After an 18-year-old gunman shot dead 17 children and two teachers at the Robb Elementary school in Uvalde, Texas, last year using a AR-15 type rifle, Cruz had said: 'Heidi and I are lifting up in prayer the entire… community during this devastating time and we mourn the lives that were taken by this act of evil. ",
        "'None of us can imagine the anguish the parents in Uvalde are going through. Our hearts go out to them.'",
        "And in response to a shooting at a Walmart in El Paso in 2019 that left 23 people dead, Cruz said: 'Heidi &amp; I are praying for everyone in El Paso. As events continue to unfold, please heed any warnings from local authorities and law enforcement and stay safe.' Cruz went further than prayers last month when an illegal Mexican migrant shot dead five neighbours, including a nine-year-old boy, when they had asked him to stop shooting his weapon in his yard in Cleveland.Cruz tweeted: 'Thank you to the brave men and women of law enforcement who worked tirelessly to apprehend this mass murdering illegal alien who killed 5 innocent people. 'The victims deserve justice. And this monster when convicted deserves the death penalty.'Meanwhile, Texas Governor Greg Abbott attributed the rising number of mass shootings to a mental health crisis.Abbott said on Sunday: 'We need to recognize the reality we've seen across the United States over the last year or two, and that is an increased number of shootings in both red states and blue states.'We've seen an increased number of shootings in states with easy gun laws, as well as states with very strict gun laws. I think that the state in which the largest number of victims occurred this year is in California, where they have very tough gun laws.'",
        "But Spainhouer said that he works around people with mental health issues, and argued that easy access to automatic rifles is the more severe threat to public safety.'It could be you, it could be your family,' said Spainhouer. 'I never imagined it would be me, I never imagined it would happen in my community. But it did. We've got to stop this type of carnage.'In a statement on Sunday, President Biden renewed calls for Congress to ban assault weapons and high-capacity magazines, as well as to enact universal background checks and end immunity for gun manufacturers. The president noted that Garcia had been wielding an AR-15 rifle and wearing tactical gear. Investigators had also found several handguns, long guns and ammunition inside Garcia's car at the scene of the shooting.'Such an attack is too shocking to be so familiar. And yet, American communities have suffered roughly 200 mass shootings already this year, according to leading counts,' said Biden, who ordered flags lowered to half-staff.\"Too many families have empty chairs at their dinner tables,\" Biden said, as he berated his political opponents for inaction.\"Republican members of Congress cannot continue to meet this epidemic with a shrug,\" he said. \"Tweeted thoughts and prayers are not enough.\"The shooting was the latest attack to contribute to the unprecedented pace of mass killings this year in the US which has seen an average of about one mass killing per week.",
        "Over the first four months and six days of this year, 115 people have died in 22 mass killings - an average of one mass killing a week. That includes the bloodshed Saturday at a Dallas-area mall where eight people were fatally shot.The total represents the highest number of mass-killing deaths this early in the year since at least 2006, an Associated Press data analysis shows, and the deaths were already happening at a record pace before the horror unfolded in Texas."
    ]
}