{
    "articleURL": "/wires/afp/article-12040183/Irans-president-heads-Syria-trip-war-eyeing-rebuild.html",
    "content": [
        "Visiting Iranian President Ebrahim Raisi on Wednesday hailed Syria's Bashar al-Assad for overcoming sanctions and achieving \"victory\" in the country's 12-year-long civil war, in which Tehran has been a major ally.",
        "The Syria conflict has killed more than 500,000 people, displaced millions and battered the country's infrastructure and industry. While the front lines have mostly quietened in recent years, large parts of the country's north remain outside government control.\"Syria's government and people have gone through great difficulties, and today we can say that you have overcome all these problems and achieved victory despite the threats and sanctions imposed on you,\" Raisi told Assad, according to a statement from the Syrian presidency and Iran's IRNA news agency.",
        "Tehran has provided economic, political and military support to Syria, helping Damascus claw back most of the territory it lost at the start of the conflict and positioning itself in a leading role as Assad seeks to focus on reconstruction.Both countries remain under heavy Western sanctions.Assad told Raisi that Syria-Iran ties \"were stable and steady during difficult times despite heavy political and security storms that struck the Middle East\", according to the statement.",
        "Iran \"did not hesitate to provide political and economic support (to Syria), and even offered blood,\" Assad added.Raisi's visit is the first by an Iranian president to Syria since the war broke out, and comes at a time when more regional capitals are re-engaging with the internationally isolated government in Damascus.",
        "The large Iranian delegation includes the ministers of foreign affairs, defence, oil, roads and urban development as well as telecommunications.- 'Strategic cooperation' -Assad and Raisi signed memoranda of understanding on \"long-term strategic cooperation\", covering fields including in oil, aviation, railways and agriculture, SANA said.\"Just as the Islamic republic stood by the Syrian government and nation in the fight against terrorism, it will also stand by its Syrian brothers in the field of development and progress,\" Raisi said, according to the Iranian presidency website.",
        "The visit comes just weeks after Iran's landmark, Chinese-brokered agreement to restore ties with regional rival Saudi Arabia, which has sparked a flurry of diplomacy in the Middle East.Security forces were heavily deployed in key parts of the Syrian capital, while billboards with portraits of the two presidents reading \"welcome\" in Arabic and Persian lined the airport road.Syrian and Iranian flags also flew along the road to the Sayyida Zeinab mausoleum south of Damascus, a pilgrimage site for Shiite Muslims which Raisi visited later Wednesday.At the height of Syria's war the revered shrine, which holds the grave of a venerated granddaughter of the Prophet Mohammed, became a symbol of a bloody sectarian fault line, targeted by Sunni jihadists and used as a rallying call by Shiite armed groups.",
        "The connection between Iran and Syria \"is not just a political and diplomatic relationship, but also a relationship of the heart, between two nations, and a strategic relationship between two governments,\" Raisi told a large crowd seated in the shrine's courtyard.\"Syria resisted for 12 years and has won, and today we celebrate the victory together,\" he added.- 'More appropriate' -The last Iranian president to visit Damascus was Mahmoud Ahmadinejad in September 2010.",
        "Assad has officially visited Tehran twice since the war broke out, the last time in May 2022.The regional atmosphere following the Saudi-Iran rapprochement has made Raisi's visit \"more appropriate\", said Damascus-based analyst Osama Danura.Assad is hoping full normalisation of ties with wealthy Gulf monarchies and other Arab states will also help finance reconstruction.In April, Saudi Foreign Minister Prince Faisal bin Farhan made the first visit to Damascus by a Saudi official since the start of the war.On the ground, Iran-backed groups including Lebanon's Hezbollah continue to bolster Assad's forces, while Iran says it only deploys military advisers in Syria at the invitation of Damascus.",
        "Iran's arch-foe Israel continues to launch air strikes on Syrian territory, primarily targeting Iran-backed forces and Lebanese Hezbollah fighters as well as Syrian army positions.Israeli strikes have killed several Iranian officers in Syria over the years.",
        "Tehran also has been part of four-way talks with Damascus, Moscow and Ankara seeking to repair Syria-Turkey ties, which were severed at the start of the conflict."
    ]
}