{
    "articleURL": "/wires/pa/article-12054757/Liverpool-fans-boo-national-anthem-hours-coronation.html",
    "content": [
        "Thousands of Liverpool fans booed the national anthem before their team played Brentford in the Premier League on Saturday.",
        "When the first notes of God Save The King began to play as both teams lined up around the centre circle the majority of supporters at Anfield voiced their opposition, before the Kop broke into chants of “Liverpool”.The club felt they had been put in an impossible position by the Premier League “strongly suggesting” the anthem was played, hours after the coronation.",
        "Sources admitted they had taken a “tough” decision to play it but believed in safe freedom of expression, even though they were aware the response would not be favourable.Booing the anthem is not new as Liverpool supporters have been doing it for years because of long-standing resentment against the establishment due to Government attitudes towards the city dating back to the 1980s and the handling of the Hillsborough disaster and the fight for justice.During Wednesday’s win over Fulham fans at Anfield sang “You can stick your coronation up your arse”.",
        "In his programme notes on Saturday, manager Jurgen Klopp admitted he was “not an expert on English history or the monarchy” and wrote: “We will be busy with our own concerns, of course, but I would like to take this opportunity to wish King Charles III well, not just today but also for the future”.Elsewhere, sport paid tribute to the King as Chelsea Women forward Sam Kerr led the Australian delegation in the formal procession.",
        "She was chosen to bear her country’s flag as part of the Commonwealth, fronting an Australian contingent which included Prime Minister Anthony Albanese as they made their way into Westminster Abbey for the service on Saturday morning.",
        "Cricketers stood to observe the national anthem ahead of matches on Saturday, and in the afternoon it was played before Manchester City hosted Leeds United at the Etihad Stadium, as the players stood around the centre circle while the big screen showed a symbol to mark the coronation.Ahead of the games at Bournemouth and Tottenham, fans were given the opportunity to watch the ceremony, as were spectators at the Badminton Horse Trials in Gloucestershire, where events were paused during the ceremony.Further afield, Formula One sent its congratulations to the King, with several teams displaying the coronation emblem at the Miami Grand Prix this weekend."
    ]
}