{
    "articleURL": "/wires/reuters/article-12045727/Norway-central-bank-raises-rate-3-25--eyes-hike-June.html",
    "content": [
        "Raises policy rate by 25 basis points to 3.25%",
        "Expects to hike again in JuneWeak currency could trigger more hikes(Adds analyst reaction, updates prices)By Victoria Klesty and Gwladys FoucheOSLO, May 4 (Reuters) - Norway's central bank raised its benchmark interest rate by 25 basis points (bps) on Thursday to 3.25%, as expected, to curb inflation, and added it was likely to hike again in June, with more tightening to follow if the currency stayed weak.All 26 economists polled in the period from April 21 to 26 had expected a hike of 25 basis points, and all but one believed the rate would rise to 3.50% in June.Rates could continue to rise to counter the effects of a weak Norwegian currency, the central bank said.\"If the krone remains weaker than projected or pressures in the economy persist, a higher policy rate than envisaged earlier may be needed,\" Norges Bank Governor Ida Wolden Bache said in a statement.The crown initially weakened after the news at 0800 GMT but soon recovered to trade at 11.81 against the euro, a rise of 0.6% on the day.\"We expect rates to peak at 3.75% but a high of 4% is becoming more and more likely,\" Nordea Markets said in a note to clients.The Norwegian currency has been by far the worst-performing among major currencies this year, reflecting widening interest differentials and increased risk aversion, making imports more expensive and feeding inflation.",
        "The I-44 import-weighted exchange rate index currently trades at 124.8, some 6% weaker than Norges Bank's most recent full-year 2023 projection made in March.Norway's core inflation, which excludes energy costs, stood at 6.2% in March, and has remained above the bank's 2% target since February last year.Norges Bank said a higher policy rate was needed to dampen the rise in consumer prices.\"Growth in the Norwegian economy has slowed, but activity remains high. The labour market is tight, and wage growth is set to be higher in 2023 than last year,\" it said. \"The future policy rate path will depend on economic developments.\" (Reporting by Victoria Klesty and Gwladys Fouche; Editing by Terje Solsvik, Clarence Fernandez and Christina Fincher)"
    ]
}