{
    "articleURL": "/wires/ap/article-12043569/Victims-families-question-release-Oklahoma-sex-offender.html",
    "content": [
        "An Oklahoma sex offender who was released from prison early shot his wife, her three children and their two friends in the head and then killed himself, authorities confirmed Wednesday as concerns grew about why he was free as his trial on new sex charges loomed.",
        "Okmulgee Police Chief Joe Prentice said that the victims had each been shot in the head one to three times with a 9 mm pistol when they were found Monday near a creek and in a heavily wooded area in rural Oklahoma.The bodies apparently had been moved there from where they were originally killed, the scene \"staged\" before Jesse McFadden, a 39-year-old convicted sex offender, killed himself, Prentice said in the first major update on the case.The discovery of the bodies near McFadden's home in Henryetta, a town of about 6,000 about 90 miles (145 kilometers) east of Oklahoma City, came on the very day that he was to stand trial on charges that he solicited nude images from another teen while he was imprisoned for rape.Authorities have declined to release a motive for the shootings, but McFadden had vowed not to return to prison in a series of ominous messages with his young victim.According to screen grabs of the messages, forwarded to KOKI in Tulsa by the now 23-year-old woman McFadden allegedly groomed from prison, he said he was having success at a marketing job and \"making great money.\" His \"great life\" was now crumbling, he wrote, because of the soliciting and possessing images of child sex abuse charges.",
        "\"Now it's all gone,\" he texted. \"I told you I wouldn't go back.\"\"This is all on you for continuing this,\" he finished.A solicitation conviction can mean a 10-year sentence; the pornography charge could mean 20 years behind bars.Prentice declined Wednesday to speculate on whether that is what led to the shooting.\"Everyone wants to understand why,\" he said. \"Normal people can´t understand why. People who perpetrate crimes like this are evil and normal folks like us can´t understand why they do it.\"Authorities began a search after 14-year-old Ivy Webster and 16-year-old Brittany Brewer, who were visiting the family over the weekend, were reported missing. Concerns grew when McFadden failed to appear at his long-delayed jury trial.McFadden had been sentenced to 20 years in 2003 for first-degree rape in the sexual assault of a 17-year-old and was freed three years early, in part for good behavior, despite facing new charges that he used a contraband cell phone in 2016 to trade nude photos with the woman, then 16. He was released in 2020 after serving 16 years and nine months, even though the new charges could send him back to prison for many years if convicted.\"And they rushed him out of prison. How?\" asked Janette Mayo, whose daughter, Holly Guess, 35, and her grandchildren, Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13, were among those killed.",
        "\"Oklahoma failed to protect families. And because of that my children -- my daughter and my grandchildren -- are all gone,\" Mayo said. \"I´ve lost my daughter and my grandchildren and I´m never going to get to see ´em, never going to get to hold them, and it´s killing me.\"Justin Webster, who said he allowed Ivy to join a sleepover at the McFadden home not knowing anything about the man's past, raised similar concerns about McFadden's release.\"To get to save some other children, to make a change is what I want to do,\" Webster told The AP during a tearful interview Tuesday in Henryetta, expressing a determination to \"tell Ivy´s story and our story and get our government officials and everybody to start speaking up loud and keeping those pedophiles in jail.\"\"There needs to be repercussions and somebody needs to be held accountable. They let a monster out. They did this,\" Webster said.A spokeswoman for the Oklahoma Department of Corrections did not immediately respond to a request for comment Wednesday on why McFadden was released despite facing new felony charges.Prosecutors objected to any early release from prison, noting that McFadden had tied a 17-year-old´s hands and feet to bedposts, cut her shirt off and raped her at knifepoint. At one point, he threatened to use the knife on her if she \"did not shut up,\" court records show.",
        "The circumstances have alarmed Republican state Rep. Justin Humphrey, who chairs his chamber´s Criminal Justice and Corrections Committee. He vowed to determine how a person could commit sex crimes in prison and be released on good behavior, and how McFadden was able to be in contact with minors while on sex offender supervision.Rep. Scott Fetgatter, who represents the district where the killings occurred, said what happened was \"absolutely unacceptable\" and vowed to fix any potential loopholes in the law.Court records show McFadden was charged with the new crimes in 2017 after a relative of the young woman alerted authorities. Set free in October 2020, he was arrested the next month and then released on $25,000 bond pending trial, which was repeatedly delayed, in part due to the COVID-19 pandemic.McFadden married Holly Guess in May 2022; what she knew of his record isn't clear. Mayo said the family didn´t learn about her son-in-law's criminal history until a few months ago.\"He lied to my daughter, and he convinced her it was all just a huge mistake,\" said Mayo, of Westville.Lee Berlin, a Tulsa-based defense attorney, told The Associated Press on Wednesday that he´s shocked by what he described as a \"panoply of errors\" in the McFadden case. He said they include releasing McFadden from prison despite serious charges pending against him as well as \"low\" bail for McFadden once he was arrested on the new charges.",
        "\"I´m a sex-crimes defense attorney - this is all I do all day every day - and I´m like, how the hell does that happen?\" Berlin said.The grim discovery could push the number of people slain in mass killings past 100 for the year, according to a database maintained by The AP and USA Today in a partnership with Northeastern University.___Associated Press reporter Heather Hollingsworth in Mission, Kansas, and data journalist Larry Fenn and researcher Rhonda Shafner in New York contributed to this report."
    ]
}