{
    "articleURL": "/femail/article-12056099/Olivia-Dunne-20-rocks-cowgirl-chic-TikTok-video.html",
    "content": [
        "Olivia Dunne, 20, posed to music in her cowgirl outfit in her latest TikTok videoRead more: Olivia Dunne makes a stunning debut in Sports Illustrated SwimsuitTikTok sensation Olivia Dunne has shown she can pull off cowgirl chic as she stuns in her latest video.",
        "The gymnast, 20, who recently wowed fans on the cover of Sports Illustrated with a racy bikini photoshoot, posed in a series of moves to a viral TikTok sound.Olivia sported a figure-flattering fringe crop top paired with black denim mini shorts and finished off her look with a pair of white cowboy boots.Captioning the video 'yeehaw', the New Jersey-born athlete styled her long blonde locks in a half-up do and added a splash of colour to the look with her bright blue nails.Although a more understated look than her sandy beach bikini shoot which was set in Puerto Rico, Olivia's natural beauty shone as she sang along to the lyrics in the video.",
        "The LSU athlete has become a social media sensation in recent years, earning more than 3.9 million followers on Instagram and 7.4 million on TikTok.She shares with them a glimpse into the many glamorous perks that come with being a successful NCAA star, and in doin so has made millions of dollars along the way thanks to her many lucrative brand deals.Just a few weeks ago Olivia wowed fans with the Puerto Rico shoot for the cover of Sports Illustrated, which saw her don a dark gray cut-out bikini as she frolicked on the beach.",
        "The slate gray bra top and thong bottoms, which retail for $100 and $80, respectively, feature cutouts on the chest and hips.Olivia bared it all in a series of other figure-hugging swimsuits throughout the shoot, including a white one-piece with gold embellishments through the middle and a patterned gray suit with a cutout around her stomach.",
        "While speaking to the publication, the 20-year-old opened up about the immense amount of attention she has received lately - and revealed how she deals with nasty comments, especially those about her body.She slammed claims that her success has only come from her racy posts and clapped back at people who told her to 'tone down' her sex appeal online.'People always comment stuff that they would never say to your face, so part of it is just having developed tough skin. Social media is hard,' she told SI Swimsuit.'I think it's important to stand up for yourself. Maybe it's the Jersey girl in me, but I think girls need to know it [isn't] OK [for people to say that], especially [because I'm] posting things that any other college kid would post in.'[Or I'm in] a leotard - which is the required uniform for being a gymnast. It's ridiculous.'She also hit back at people who try to 'downplay [her] success' and suggest it's all down to her good looks. ",
        "The gymnast revealed she tries not to pay attention to that type of 'negativity'"
    ]
}