{
    "articleURL": "/tvshowbiz/article-12056475/MasterChef-Australia-judge-Andy-Allen-haunting-image-following-Jock-Zonfrillos-death.html",
    "content": [
        "Andy Allen has shared the haunting image he can't stop thinking about in the wake of his co-star Jock Zonfrillo's death. ",
        "The MasterChef Australia judge told The Sunday Project that he's haunted by the loss Jock's young son, Alfie, has suffered, and struggled to compose himself several times during the interview. 'The hardest thing is... I can't get Alfie's little voice and face out of my head saying, \"You're my best friend, pappa\". He said it every day,' Allen revealed. Asked by host Sarah Harris if Zonfrillo's wife, Lauren Fried, is okay, Andy, who fought back tears, was honest. 'Um, no. No. She's the strongest woman I have ever known, but she's lost her best friend,' he said. ",
        "'Jock's got three daughters. And it's things like never being able to walk them down the aisle. Which means so much to Jock. And so much to Lauren. They're the things that are hurting her the most'. When drawn on his own grief, Andy said that he spent more time with Jock on the set of MasterChef than he did with his own life, and they were very close, having met up for a three hour lunch just days before Jock died.   'I am gonna miss everything that this guy has brought into my life. He couldn't wait for [Allen's wife] Alex and I to have kids as well,' he said. 'He couldn't wait for that. He always said I was gonna be a great dad. And I just wish he was around to see that.'",
        "The chef died at age 46, and is survived by his third wife, Lauren, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.   Officers who attended Zagame's House at Carlton at about 2am on April 30 found Zonfrillo dead in his bed and saw no signs of anything suspicious or unusual.There was no drug paraphernalia located, no one else in the hotel room and police formed the view the father-of-four had died of natural causes.Zonfrillo was set to star in the latest season of Australia's MasterChef, which had been scheduled to start on the day he was found unresponsive. "
    ]
}