{
    "articleURL": "/news/article-12051093/Lucy-Letby-tells-jury-death-twin-baby-boy-came-complete-shock-her.html",
    "content": [
        "Lucy Letby told jury it felt 'awful' to be the subject of such an allegationLetby acknowledged carrying out three Facebook searches on Baby A's mother The fatal collapse of a twin baby boy came as 'a complete shock' to neonatal nurse Lucy Letby, she told a jury today.",
        "Letby, 33, originally from Hereford, is on trial for allegedly murdering seven babies at the Countess of Chester Hospital and attempting to murder a further ten. The charges relate to a period between June 2015 and June 2016. She denies them all.During her second day in the witness box, Letby said: 'It felt like we walked through the door into this awful situation. That was the first time I'd met (Baby) A and his parents. It was a huge shock'.As the infant's designated nurse it later fell to her to lead the process of copying the baby's hands and feet for a memory box. His parents asked for his twin sister's prints to be taken at the same time.Letby's barrister, Ben Myers KC, asked whether Baby A's death on June 8, 2015, had affected her.",
        "'Yes, it did,' she replied. Mr Myers went on: 'It's alleged that you did this. Did you?''No', said the nurse.Her barrister then asked what it felt like to be the subject of such an allegation.She replied: 'It's awful. I wasn't even supposed to be working that night. It was such a shock to walk into that situation'.The jury at Manchester Crown Court has heard that Baby A collapsed shortly after Letby and a nursing colleague, Melanie Taylor, had connected him to a line feeding him a solution containing 10 per cent glucose.",
        "She said that when an alarm sounded she noticed the infant's limbs turn white and his torso and abdomen become pale. 'He was apnoeic,' she told Mr Myers. 'He wasn't breathing at that point'.A crash call went out but despite efforts to resuscitate him Baby A died shortly before 9pm.Letby recalled that the following morning a nursing friend on the unit sent her a WhatsApp message to say: 'You did amazing. So proud of you…You did fab xxxx'.Moments later she said she hoped the alleged killer hadn't found the compliment patronising.Letby replied: 'It's not patronising at all. Appreciate you saying that and thanks for letting me do it but supporting me so well'.The defendant, who is accused of killing Baby A with an injection of air, said she frequently swapped messages with colleagues in the aftermath of incidents on the unit.'It was my main form of support, living alone and there being no formal support in place at work. It's something we would all do. We were all regularly in touch with each other outside work'.Letby acknowledged carrying out three Facebook searches on Baby A's mother in the days after his death.",
        "'It was just curiosity,' she told Mr Myers.'To walk into the unit that morning and to have not met the parents…I wanted to see the people behind the awful event that had happened. They were on my mind'.",
        "She added: 'It's a common pattern of behaviour for me. If I think of somebody I would look them up. (Baby) A and (Baby) B were on my mind at that time. I would usually look for multiple people over a short period of time'.Letby also told the jury she could not recall the build-up to Baby B's collapse 'with any clarity'.She was with a nursing colleague in Nursery 1 when the infant became 'quite mottled' and 'dark' all over.Asked whether she had seen such mottling before, she said it was not unusual but it was a concern in light of Baby A's death the night before.Letby, who is alleged to have injected Baby B with air, said she was asked to get the unit camera to take a picture of the mottling.She returned 'very quickly' from the manager's office, but by then Baby B's colour had returned to normal and there was no mottling to photograph.",
        "The jury has been told that Baby C – whose mother is a GP - was born on June 10 and died four days later.Letby told the court she had no recollection of the events leading up to his fatal collapse. It had been a 'normal' shift, she added, and she had 'no memory:' of what happened until his collapse.",
        "This had been 'a significant event'.She recalled being called over by her nursing colleague Sophie Ellis. Having looked at the baby, she asked Miss Ellis to put out a crash call. 'I just remember he was apnoeic and needed respiratory support.The nurse insisted that despite what Miss Ellis had said in a police statement she had no recollection of being in Nursery 1 prior to Baby C's collapse. She did not recall being next to his cot when the alarm sounded.Mr Myers reminded Letby about WhatsApp messages she had swapped with nursery assistant Jennifer Jones-Key in the days after Baby C's death.At one point she told her: 'I just keep thinking about Mon. Feel like I need to be in (Nursery) 1'.Ms Jones-Key replies: 'You need a break from full-on ITU. You have to let it go or it will eat you up. I know not easy and will need time'.Letby refers to her time at Liverpool Women's Hospital, telling her colleague: 'I lost a baby one day'.She went on to explain how that experience had helped her realise the importance of returning to a particular nursery following a tragedy.",
        "Mr Myers asked whether anything in her WhatsApp conversation with Ms Jones-Key had made her want to attack any child.",
        "Letby replied: 'No'.Mr Myers: 'The loss of a baby…is that something you wanted to happen?'Letby: 'Not at all, no'.The alleged killer was asked for her thoughts on 'what the parents have gone through'. She replied: 'It's unimaginable'.At one point Letby broke off while answering a question, appearing to be startled by a noise in the courtroom.Mr Myers noticed her hesitancy and asked whether she was able to continue. “Yeah, I’m very easily distracted,” said Letby.Her barrister asked: “Have you always been like that?”. “No,” she replied.Earlier in the week – the 26th of her trial – Letby told the jury she was “easily startled” by unexpected noises as a result of the post-traumatic stress disorder she has suffered since her initial arrest in July 2018.Baby D suffered three collapses on the morning of June 22. She died at 4.25pm.Mr Myers referred her to a statement by Baby D’s mother in which she says she had a conversation with Letby at 7pm on June 21.The nurse says she does not recall a conversation, and a WhatsApp message sent from her phone at 7.15pm refers to her being “just about to leave for a night shift”. Swipe data also recorded her arriving at the unit at 7.26pm.",
        "Letby claimed to have no recollection of Baby E screaming and with fresh blood around his mouth. She said: “No, he was unsettled at some points but he was not screaming”.She also rejected the mother’s assertion that she had told her to leave the unit. “That’s not something we would do,” she told Mr Myers.The neonatal nurse said Baby E was bleeding profusely from his mouth and nose during the resuscitation attempts to save his life.She cried in the witness box as she recalled dressing him in a gown following his death. “He had no clothes, so we found him a gown from the unit to be dressed in”.Another nurse, Belinda Simcock, helped her with that, and then Letby took photos of the infant with two small teddy bears – one for Baby E, the other for his twin brother, Baby F.She took the photos at the request of the parents.Wiping her eyes with a tissue, Letby described Baby E’s death as “very traumatic”. She added: “I’ve never seen a baby bleed that way before”.Mr Myers asked Letby if she had gone back to Baby F “to finish off anything you had started anywhere else, as is alleged?”No, she said.Letby herself read out a medical note she had written about the infant on August 9. This read: “Parents carried out cares and both had cuddles with (Baby) F. Happy that he has opened his eyes for the first time today”.Mr Myers asked whether she had done anything to harm him? Again she said no.Her barrister then asked what her aim had been. She replied: To care for him. To get him ready to go home”.The trial resumes on Thursday. "
    ]
}