{
    "articleURL": "/news/article-12049613/Julian-Assange-Anthony-Albanese-says-enough.html",
    "content": [
        "'Nothing to be served' to keep him behind barsAnthony Albanese has declared there is 'nothing to be served' by keeping WikiLeaks founder Julian Assange behind bars, expressing frustration at the diplomatic stalemate.",
        "The Prime Minister, who is in the UK for King Charles' Coronation, refused to say whether he would raise the matter with US President Joe Biden when they meet later this month.But his push for a conclusion has the support of Opposition Leader Peter Dutton after he agreed the issue must be resolved.Mr Assange is facing extradition from the UK on 18 charges related to the publication of classified military and diplomatic documents.",
        "He has been in London's Belmarsh Prison for more than four years and is appealing the UK government's agreement to his extradition.Speaking to the ABC on Friday morning, Mr Albanese reiterated 'enough was enough' but appeared frustrated by the lack of movement on the matter.'It needs to be worked through, we're working through diplomatic channels, we're making very clear what our position is on Mr Assange's case,' he said.'I know it's frustrating. I share the frustration. I can't do more than make very clear what my position is.'The US administration is certainly very aware of what the Australian government's position is.'",
        "Mr Albanese is set to meet with Mr Biden later this month when he visits Australia for the Quad Leaders' Summit in Sydney.Mr Albanese declined to say if he would raise the issue with Mr Biden but noted the 'disconnect' between the treatment of Mr Assange and Chelsea Manning, the woman who released the information he published.",
        "The former US Army soldier was released in 2017.'I think that when Australians look at the circumstances, look at the fact that the person who released the information (Chelsea Manning) is walking freely now ... then they'll see that there is a disconnect there,' he said.Last month, parliamentarians across the aisle joined together to sign a letter to the US Attorney-General to call for the end of Mr Assange's extradition.Mr Dutton said he agreed with Mr Albanese that the case had been drawn out for too long.'Of course I'm concerned for him at an individual level. I think it's gone on for too long and I think that's the fault of many people, including Mr Assange to be honest,' he told ABC RN.'But the matters, I think, have to be dealt with. And if the Prime Minister's charting a course through to an outcome for that, then that is a good thing.'"
    ]
}