{
    "articleURL": "/wires/reuters/article-12048803/Motor-racing-Hamilton-no-fan-Florida-Governor-DeSantis.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 4 (Reuters) - It's probably safe to say Florida Governor Ron DeSantis will not be cheering for Lewis Hamilton this weekend at the Miami Grand Prix and the Mercedes seven-times world champion made it clear he is no supporter of the Republican leader.A long-time champion of LGBTQ+ rights, Hamilton will have a Rainbow Flag on his helmet for Sunday's race and said he stands with the gay, lesbian and transgender community that has come under attack by DeSantis.DeSantis, who has declared Florida is \"where woke comes to die\", recently passed a law banning classroom discussion of sexuality and gender identity with younger children, dubbed by critics as the \"don't say gay\" bill.\"I have read and heard about some of decision made in government here and I do not agree with it and I do not support it,\" flatly stated Hamilton during a media scrum on Thursday. \"I continue to stand with the LGBTQ community.\"Whilst I'm here I'm just going to continue to be supportive just by being here and having that on my helmet hopefully that speaks more.\"Hamilton has used his global platform and celebrity to campaign for everything from diversity and racial equality to LGBTQ+ rights.He has urged Formula One to do more to push for human rights, saying the issue was a \"massive problem\" in some of the sport´s host countries such as Saudi Arabia and Bahrain, and has worn Black Lives Matter T-shirts in support of that movement.",
        "\"I'm wearing the Rainbow Flag on my helmet this weekend and I just really want to continue to support the community here and let them know I stand with them and I hope they continue to fight against it,\" said the Briton.\"This isn't the people of Miami making these decisions, it's the people in government and that's the issue. (Reporting by Steve Keating in Miami; Editing by Stephen Coates)"
    ]
}