{
    "articleURL": "/wires/reuters/article-12042111/Syria-touts-Gulf-tourists-amid-emerging-Arab-rapprochement.html",
    "content": [
        "By Lisa Barrington and Yousef Saba",
        "DUBAI, May 3 (Reuters) - Overlooked by a portrait of President Bashar al-Assad and offering sticky sweets, a Syrian tourism booth in Dubai is trying to seize on an emerging rapprochement with Arab states to win back Gulf tourists it lost during more than a decade of war.\"We are now aiming to regain the tourism income from (Gulf Cooperation Council countries) to Syria. We used to have millions of our friends and brothers from GCC countries in Syria, especially in summer,\" Nedal Machfej, Syria's deputy tourism minister, told Reuters at the Arabian Travel Market exhibition in Dubai.Some Arab states, including GCC members the United Arab Emirates and Saudi Arabia, are increasingly rebuilding ties with Damascus, reversing years of isolation over Assad's crackdown on protests in 2011 and the ensuing civil war.Assad in March visited the UAE and sources have told Reuters that Saudi Arabia plans to invite Assad for a visit soon.Machfej said Syria had 1.5 million visitors last year, a third of which were tourists. Around 10% of those tourists were from western Europe, he added.This year Syria is aiming for 3 million visitors, he said. Tourism ministry data shows 385,000 visitors came to Syria in the first quarter this year, 40,000 of which were non-Arab foreigners.",
        "Tourism dried up with the outbreak of war, which has killed hundreds of thousands of people and badly damaged cultural sites including Aleppo's old city and the ancient ruins of Palmyra.Syria's economy is also in a bad way, including a dramatic fall in the currency's value since 2019.Machfej said the country wants to use tourism to increase foreign currency inflows, but named Syria's wartime allies as its main future markets.\"We are aiming to open new markets especially in Iran, Russia, China and in neighbouring countries also,\" he said.Syria is building new hotels in seaside locations to cater to GCC family tourism, a website for electronic visas is coming soon and the private sector is talking to tour operators in Jordan and Lebanon to re-instate previously popular multi-country package tours, he said.\"We have to deal with each other, with neighbouring countries to benefit all,\" he said.Gulf states along with Egypt, Iraq and Jordan have been discussing Syria's possible return to the Arab League, but no agreement has been reached.Although fighting has largely stopped, some territory remains out of Assad's control and Israel still carries out strikes in Syria against what it says are Iran-linked targets.\"After 10-11 years of war, Syria is a very safe country for tourism,\" Machfej said, although acknowledging the Israeli strikes.",
        "\"(Israel is) trying to target the Syrian economy,\" he said. \"Disrupting the movement of relations that have started, the diplomatic openness that has begun for Syria.\" (Reporting by Lisa Barrington and Yousef Saba; Additional reporting by Kinda Makieh in Damascus; Writing by Lisa Barrington, Editing by Angus MacSwan)"
    ]
}