{
    "articleURL": "/wires/ap/article-12056661/Big-lunch-follows-big-coronation-celebrating-King-Charles.html",
    "content": [
        "LONDON (AP) - A day after a gilded coronation ceremony watched by millions, King Charles III and Queen Camilla let others take the center stage Sunday as they took in a star-studded concert featuring Katy Perry, Lionel Richie and others at Windsor Castle.",
        "The newly crowned monarch and his wife appeared to enjoy the show as Richie performed \"All Night Long,\" at one point getting up on their feet and swaying to the music. Other members of the royal family, including 8-year-old Princess Charlotte and Prince George, 9, waved Union flags along with a crowd of some 20,000 gathered on the castle's east terrace.Charlotte and her mother, Kate, the Princess of Wales, sang along as Perry, dressed in a gold foil ball gown, performed her pop hit \"Roar.\"\"Top Gun\" star Tom Cruise appeared in a recorded video message, saying: \"Pilot to pilot. Your Majesty, you can be my wingman any time.\" The mixed program also saw performances by the Royal Ballet, Nicole Scherzinger from the Pussycat Dolls, opera singer Andrea Bocelli and British band Take That.Even Miss Piggy and Kermit the Frog made an appearance, joking with host Hugh Bonneville.The entertainment was interspersed with more serious moments. A message from Charles on the importance of environmental conservation was played, and the show was accompanied by a light and drone display with a nature theme.",
        "Prince William, heir to the throne, took to the stage to pay tribute to his father's dedication to service. \"Pa, we are all so proud of you,\" he said.",
        "Concert goers sang \"God Save the King\" as landmarks around the U.K. were lit up in colorful lights.Earlier Sunday, thousands of picnics and street parties were held across the U.K. in Charles' honor. The community get-togethers, part of a British tradition known as the Big Lunch, provided a down-to-earth counterpart to the gilded spectacle of the king´s crowning Saturday.The events were intended to bring neighbors together to celebrate the crowning even as support for the monarchy wanes. Critics complained about the coronation's cost at a time of exorbitant living expenses amid double-digit inflation.But plenty others took the opportunity to enjoy a party with friends and family. In Regent´s Park in London, Valent Cheung and his girlfriend showed up to cheer the new king with the neighbors who embraced them when they moved from Hong Kong. They dolled up their loyal and \"royal\" fluffy white dog, Tino, with a tiny purple crown for the occasion.\"This is a new era for U.K,\" Cheung said. \"We didn´t have these things in Hong Kong. Now, we are embracing the culture. We want to enjoy it, we want to celebrate it.\"Charles and Camilla didn't drop in on any of the picnics, leaving that duty to other members of the royal family.",
        "William and his wife, Kate, surprised people picnicking outside the castle before the concert. Dressed far more casually than the day before, they shook hands and Kate embraced a crying girl in a hug.The king's siblings, Prince Edward and Princess Anne and their spouses took on lunch duty for the royal family at events across England. The king's nieces, Princess Beatrice and Princess Eugenie, the daughters of Prince Andrew, joined a lunch in Windsor.Prime Minister Rishi Sunak hosted U.S. first lady Jill Biden and her granddaughter Finnegan Biden at the Big Lunch party held in front of his office. Other guests included Ukrainian refugees and community activists.Like the picnic in the park, Downing Street and Sunak's spread - even his teapot - were festooned in the nation's colors of blue, white and red.Sausage rolls and salmon were served along with coronation chicken - a dish cooked up for Queen Elizabeth II's coronation 70 years ago - and coronation quiche, which was picked to suit Charles' taste and has been the buzz of social media, often for the wrong reasons.The lower-key events followed regalia-laden pageantry that saw the king and queen crowned together in Westminster Abbey. They were presented with centuries-old swords, scepters and a jewel-encrusted golden orb symbolizing the monarch's power in a medieval tradition celebrated with liturgy, song and hearty cheers of \"God save the king.\"",
        "The couple then paraded through the streets in a gilded horse-drawn carriage led by the largest ceremonial military procession since the coronation of Charles' mother. Some 4,000 troops marched in formation through the streets, their scarlet sleeves and white gloves swinging in unison to the sound of drums and bugles from marching bands, including one group of musicians on horseback.Hundreds of thousands of spectators lined the route in the rain to see it in person. Nearly 19 million more watched on television in the U.K., according to ratings released by Barb, a research organization. That's about 40% fewer viewers than had watched the funeral of Queen Elizabeth II in September.Charles and Camilla said Sunday in a statement that they were \"deeply touched\" by the celebration and \"profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support.\"Not everyone was there to celebrate, though, and criticism continued Sunday over arrests of more than 50 protesters, including members of a republican group shouting \"Not my king\" and environmentalists aiming to end the use of fossil fuels.The Metropolitan Police said officers detained 64 people Saturday, with four suspects charged with offenses including a religiously aggravated public order offense and drug possession.",
        "Graham Smith, leader of Republic, a group advocating for abolishing the monarchy, said he was arrested as he planned a peaceful protest and spent 16 hours in police custody.\"These arrests are a direct attack on our democracy and the fundamental rights of every person in the country,\" Smith said. \"Each and every police officer involved on the ground should hang their heads in shame.\"The Metropolitan Police acknowledged concerns over the arrests, but defended the force´s actions.\"The coronation is a once-in-a-generation event and that is a key consideration in our assessment,\" Commander Karen Findlay said.At Regent's Park, celebrants talked about the novelty of what they had witnessed. But the coronation was nothing new for Rosemary McIntosh, 95, just a lot more vivid than the one she saw televised while living in Zimbabwe in 1953.\"We didn´t have TV all day and it was black and white, so it wasn´t as wonderful as has been this one,\" she said. ___Helena Alves contributed to this report."
    ]
}