{
    "articleURL": "/wires/ap/article-12055407/Tovar-Gomber-lead-Rockies-5-2-win-slumping-Mets.html",
    "content": [
        "NEW YORK (AP) - Maybe it was fitting Austin Gomber pitched so well on Mental Health Awareness Day at Citi Field.",
        "After opening up about some anxiety he was feeling, Gomber has found his groove.The left-hander won his third straight outing since a terrible start to the season and rookie Ezequiel Tovar had three hits, including a two-run homer, as the Colorado Rockies beat the slumping New York Mets 5-2 on Saturday.Gomber recently disclosed he's felt pressure to meet expectations because Colorado acquired him from St. Louis in a very unpopular trade for star third baseman Nolan Arenado on Feb. 1, 2021.\"I think once I got that off my chest, felt like I was able to get to a spot where I'm just more free, mentally, and I think better physically,\" Gomber said. \"And then having the support from the organization and all the guys in this room was the other piece of that. So, I feel good about where I'm at.\"Elias Díaz had a pair of two-out RBI singles, boosting his batting average to .452 (14 for 31) with runners in scoring position, and the last-place Rockies won for the fifth time in six games. The catcher is hitting .343 overall with 18 RBIs.",
        "Tylor Megill (3-2) got into trouble with three walks in 4 2/3 innings during another shaky performance by a Mets starter.Pete Alonso and Francisco Lindor each had an RBI groundout, but the Mets have mustered only four runs in four games. With a major league-record $355 million payroll, New York (17-17) has lost 10 of 13 since winning eight of nine.",
        "\"We have gotten outside of what we do best, including myself,\" Lindor said. \"We're going to go through stretches like this. We just have to keep on pushing, fight the fight, and stay within ourselves.\"Tovar doubled, singled and scored twice during his first three-hit game in the majors. The 21-year-old shortstop, rated among the top 25 prospects in baseball before the season, was the youngest player in Rockies history to start on opening day.His sixth-inning drive off reliever Stephen Nogosek following a leadoff walk to Harold Castro gave Colorado a 5-2 lead. It was Tovar's third career homer and second this season.\"The at-bats are progressively getting better. Cut down the chase, cut down the strikeouts. But, love the opposite-field double, love the homer, and love the defense,\" Rockies manager Bud Black said. \"There's a self-assurance and a self-confidence to his game and who he is, and that's a really good thing for a young player.\"Charlie Blackmon delivered an early sacrifice fly, and the Rockies won for just the third time in their past 12 games at Citi Field.Helped by Randal Grichuk's diving catch in left, Gomber (3-4) allowed two runs and five hits in six innings for his second win at Citi Field. He had a 12.12 ERA after losing his first four starts this season but has permitted only three runs over 17 innings in his past three.",
        "\"I think his confidence is back. He got a little bit derailed confidence-wise, which can happen when you don't get the results. But he's turned it around,\" Black said.\"There's a little bit of fight-back that I like. You get in the corner, when you're in a boxing match and you're in the corner and you're rope-a-dopin', and you fend off some blows and then you come back with a vengeance - that's what's sort of happening. And I love that. He's not gonna let it happen.\"Jake Bird worked two scoreless innings and Pierce Johnson struck out two in the ninth for his fifth save.\"Guys are pushing, sometimes to a fault. You can want something too much,\" Mets manager Buck Showalter said. \"Certainly, a lot of things (are) being considered. You try to have faith in the people that have done it in the past. And it´s about more than just a batting order. But sometimes that is warranted, I understand that.\"TRAINER´S ROOMMets: RHP Carlos Carrasco (right elbow inflammation) is sick with flu symptoms and the team isn't sure when he'll be able to make a minor league rehab start, delaying his return to the rotation. ... 2B/OF Jeff McNeil was rested before striking out as a pinch hitter with two on to end the eighth. Eduardo Escobar made his first start at second base since 2021 with Arizona, though it was his 141st major league game at the position.",
        "UP NEXTShowalter said the team is leaning toward starting LHP Joey Lucchesi (1-0, 3.86 ERA) on three days' rest Sunday in the series finale. Lucchesi was lifted after throwing 46 pitches over four innings Wednesday in Detroit, partly to keep him an option for Sunday. RHP Ryan Feltner (2-2, 4.45) goes for Colorado.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}