{
    "articleURL": "/news/article-12040069/Lego-gender-neutral-toys-forcing-woke-ideology-Australian-children-experts-say.html",
    "content": [
        "Lego to release new 'gender inclusive' setsExperts have said it'll confuse kidsIt's also been labelled a cash-grabLego has been accused of forcing 'woke' ideology onto Australian children after the company revealed its new line of gender neutral toys. ",
        "The toy giant will release their Lego Dreamzzz collection that will include a Pegasus horse, a blue and pink bunny called 'Bunchu' and a 'nightmare shark ship'.A new TV show will also be launched on May 15 and feature the new 'gender inclusive' characters. Professors Dr Kevin Donnelly AM and Reverend Peter Kutri claimed the new products will push ideologies onto naïve children who aren't old enough to comprehend the complexities of gender theory.",
        "The Lego Company announced in October 2021 they intended to remove gender bias from their products after a survey showed gender roles caused shame among children. Senior Fellow at Australian Catholic University's PM Glynn Institute Dr Donnelly said people shouldn't be persecuted for who they are and that erasing gender roles isn't the way to counteract it.'I don't believe that people should be discriminated against or attacked for being LGBTQI+, but at the same time human biology is pretty binary - it's not a social construct,' he told Daily Mail Australia.'A lot of this gender theory is very abstract and very confusing, and I would argue - as a lot of parents have that I talked to - just let children be children.  'My fear is that it's not just Lego, there's a significant movement globally towards what I call \"radical gender theory\".'",
        "Dr Donnelly said the sensitive stages of development for young children and teenagers isn't the time to introduce questions of sexual identity.'I would suggest 8, 10, or 12 year old children normally wouldn't have any concept of LGBTQI+, and adolescents go through a period of uncertainty in terms of their own identity,' he said.LEGO Group's Head of Product Marcia Marks Laursen told the Herald Sun that hefty research prompted the company's push towards inclusivity.'We wanted to invite both genders equally to this franchise so it's important that everything we developed would resonate with boys and girls equally,' she said.  Fellow ACU Associate Professor Laura Scholes said ditching 'stereotypes' is a good thing that could lead to toy departments in stores being rearranged to erase binary structures.'It's actually often grandparents who stick to stereotypes, because that is what they are used to,' she said.Ms Laursen said the the team's main question prior to development was: 'Where do we place these products? Who are they for?'",
        "Director of the culture, prosperity and civil society program at the Centre for Independent Studies, Reverend Peter Kurti said the answer was simple.'They’re aiming it at parents who are themselves wanting to play down gender stereotypes and impose non-conformity on their kids,' Rev. Kurti said.",
        "'Lego is doing this because they see there’s money in it. They’re not a charity, they’re a company and they think that there is money to be made in exploiting this market.' Rev. Kurti said that nothing about the new range of toys gave an impression of gender fluidity.'I didn’t think that they were a non-binary toy, I can’t see why anyone would quite see why they would be,' he said.'The unicorn, the bunny or the ship don’t seem non-binary quite frankly.''What actually is a gender-neutral toy? Why is Bunchu the Bunny a gender neutral toy? 'Looking at the construction bits that go with Lego, why is it not gender neutral already? 'I think it is part of the woke culture, Lego has seen there is a market statement that we can get into here and we can pitch products to parents and I guess kids who are receiving this kind of ideology at school.'The action figures are part of a bigger push for the Lego Dreamzzz brand, which Rev. Kurti says goes beyond a cash grab.",
        "The animated series features a group of friends that use their imagination to go into a Dream World and defeat the Nightmare King. 'The TV series is actually promoting the non-binary ideology, the evil Nightmare King is obviously a binary figure,' Rev. Kutri said of the YouTube show. ",
        "'My sense is that the visual images and the storylines are going to be what fills children's minds and imaginations and that will have an important impact on kids.'They will be playing with the toys when they’re not watching TV, so they’ll continue to have the images and ideas in their minds that reinforce the ideology that's being promoted in the TV series.'In some ways that seems to make what Lego is doing more powerful.'A LEGO Group spokesperson said: 'Our new theme, LEGO® DREAMZzz™, does not explicitly feature any gender-neutral characters or toys. We hope it can hold universal appeal for all kids. 'LEGO® DREAMZzz™ is the first ever theme from the LEGO Group based on and inspired by the limitless creativity of children’s dreams – that invites all kids to bring their wildest dreams to life. 'At the LEGO Group we strive to create characters and storylines within our playsets that represent real people. It's important to us to showcase a wide variety of traits and characteristics so that children can see themselves represented in the toys that they play with.'"
    ]
}