{
    "articleURL": "/wires/ap/article-12054939/Ex-FCC-chief-public-TV-advocate-Newton-Minow-dead-97.html",
    "content": [
        "CHICAGO (AP) - Newton N. Minow, who as Federal Communications Commission chief in the early 1960s famously proclaimed that network television was a \"vast wasteland,\" died Saturday. He was 97.",
        "Minow, who received a Presidential Medal of Freedom in 2016, died Saturday at home, surrounded by loved ones, said his daughter, Nell Minow.\"He wanted to be at home,\" she told The Associated Press. \"He had a good life.\"Though Minow remained in the FCC post just two years, he left a permanent stamp on the broadcasting industry through government steps to foster satellite communications, the passage of a law mandating UHF reception on TV sets and his outspoken advocacy for quality in television.\"My faith is in the belief that this country needs and can support many voices of television - and that the more voices we hear, the better, the richer, the freer we shall be,\" Minow once said. \"After all, the airways belong to the people.\"Minow was appointed as FCC chief by President John F. Kennedy in early 1961. He had initially come to know the Kennedys in the 1950s as an aide to Illinois Gov. Adlai Stevenson, the Democrats' presidential nominee in 1952 and 1956.",
        "Minow laid down his famous challenge to TV executives on May 9, 1961, in a speech to the National Association of Broadcasters, urging them to sit down and watch their station for a full day, \"without a book, magazine, newspaper, profit-and-loss sheet or rating book to distract you.\"",
        "\"I can assure you that you will observe a vast wasteland,\" he told them. \"You will see a procession of game shows, formula comedies about totally unbelievable families, blood and thunder, mayhem, violence, sadism, murder, Western bad men, Western good men, private eyes, gangsters, more violence and cartoons. And, endlessly, commercials - many screaming, cajoling and offending.\"As he spoke, the three networks were just about all most viewers had to choose from. Pay television was barely in the planning stage, PBS and \"Sesame Street\" were several years away, and HBO and niche channels such as Animal Planet were far in the future.The speech caused a sensation. \"Vast wasteland\" became a catch phrase. Jimmy Durante opened an NBC special by saying, \"Da next hour will be dedicated to upliftin' da quality of television. ... At least, Newt, we're tryin'.\"Minow became the first government official to get a George Foster Peabody award for excellence in broadcasting. The New York Times critic Jack Gould (himself a Peabody winner) wrote, \"At long last there is a man in Washington who proposes to champion the interests of the public in TV matters and is not timid about ruffling the industry's most august feathers. Tonight some broadcasters were trying to find dark explanations for Mr. Minow's attitude. In this matter the viewer possibly can be a little helpful; Mr. Minow has been watching television.\"",
        "CBS President Frank Stanton strongly disagreed, calling Minow's comments a \"sensationalized and oversimplified approach\" that could lead to ill-advised reforms \"on the ground that any change is a change for the better.\"For the criticism over his speech, Minow said he didn´t support censorship, preferring exhortation and measures to broaden public choices. But he also said a broadcasting license was \"an enormous gift\" from the government that brought with it a responsibility to the public.His daughter, Nell Minow, told The Associated Press in 2011 that her father loved television and wished he would have been remembered for championing the public interest in television programming, rather than just a few words in his much broader speech.\"His No. 1 goal was to give people choice,\" she said.Among the new laws during his tenure were the All-Channel Receiver Act of 1962, that required that TV sets pick up UHF as well as VHF broadcasts, which opened up TV channels numbered above 13 for widespread viewing. Congress also passed a bill that provided funds for educational television, and measures to foster communications satellites.In a September 2006 interview on National Public Radio, Minow recalled telling Kennedy that such satellites were \"more important than sending a man into space. ... Communications satellites will send ideas into space, and ideas live longer than people.\" On July 10, 1962, Minow was one of the officials making statements on the first live trans-Atlantic television program, a demonstration of AT&amp;T's Telstar satellite.",
        "Children's programming was a particular interest of Minow, a father of three, who told broadcasters the few good children's shows were \"drowned out in the massive doses of cartoons, violence and more violence. ... Search your consciences and see if you cannot offer more to your young beneficiaries whose future you guide so many hours each and every day.\"Minow resigned in May 1963 to become executive vice president and general counsel for Encyclopedia Britannica Inc. in Chicago.Nell Minow said her father also was instrumental in getting presidential debates televised, starting with Kennedy and Richard M. Nixon, after watching Stevenson struggle to use the new medium during his 1956 presidential run.\"Minow was appalled by ... the whole charade of having to image-make on television,\" said Craig Allen, a mass communications professor at Arizona State University who wrote a 2001 book about Minow.In 1965, Minow returned to his law practice in Chicago, and later served as board member at PBS, CBS Inc. and the advertising company Foote Cone &amp; Belding Communications Inc. He was director of the Annenberg Washington Program in Communications Policy Studies of Northwestern University.He also gave Barack Obama a summer job at the law firm, where the future president met his wife, Michelle Robinson. Minow also was one of Obama´s earliest supporters when the then-Illinois senator considered running for president, Nell Minow said.",
        "Television is one of our century's most important advances \"and yet, as a nation, we pay no attention to it,\" Minow said in a 1991 Associated Press interview.He continued to push for reforms such as free airtime for political ads and more quality programming while also praising advances in diversity in U.S. television.\"In 1961, I worried that my children would not benefit much from television. But in 1991 I worry that my grandchildren will actually be harmed by it,\" he said.___Former Associated Press writer Polly Anderson in New York contributed to this story."
    ]
}