{
    "articleURL": "/wires/ap/article-12040413/Rising-turmoil-making-Feds-rate-decisions-perilous.html",
    "content": [
        "WASHINGTON (AP) - The Federal Reserve reinforced its fight against high inflation Wednesday by raising its key interest rate by a quarter-point to the highest level in 16 years. But the Fed also signaled that it may now pause its streak of 10 rate hikes, which have made borrowing for consumers and businesses steadily more expensive.",
        "In a statement after its latest policy meeting, the Fed removed a sentence from its previous statement that had said \"some additional\" rate hikes might be needed. It replaced it with language that said it will now weigh a range of factors in \"determining the extent\" to which future hikes might be needed.Speaking at a news conference, Chair Jerome Powell said the Fed has yet to decide whether to suspend its rate hikes. But he pointed to the change in the statement's language as confirming at least that possibility.Having raised their key short-term rate by a substantial 5 percentage points since March 2022, Powell said, Fed officials can step back and assess the impact of higher rates on growth and inflation. He said the Fed would also monitor other factors, including the turmoil in the banking sector, to determine whether to pause its rate hikes. In doing so, he said, the central bank would set its rate policy on a meeting-to-meeting basis.The Fed chair stressed his belief that the collapse of three large banks in the past six weeks will likely cause other banks to tighten lending to avoid similar fates. Such lending cutbacks, he added, will likely help slow the economy, cool inflation and lessen the need for the Fed to further raise rates.",
        "When asked whether the Fed's key rate was now high enough to restrain the economy and curb inflation, Powell said, \"We may not be far off - or possibly even at that level.\"",
        "James Knightley, chief international economist at ING, suggested that \"with lending conditions rapidly tightening in the wake of recent bank stresses, we think this will mark the peak for interest rates.\"Still, if inflation were to accelerate, the Fed \"won´t hesitate to resume hiking interest rates because they´re determined to break inflation´s back,\" said Ryan Sweet, chief economist at Oxford Economics. \"As such, there is a risk that the pause is temporary.\"The Fed's rate increases since March 2022 have more than doubled mortgage rates, elevated the costs of auto loans, credit card borrowing and business loans and heightened the risk of a recession. Home sales have plunged as a result. The Fed´s latest move, which raised its benchmark rate to roughly 5.1%, could further increase borrowing costs.In its statement and at Powell's news conference, the Fed made clear Wednesday that it doesn't think its string of rate hikes have so far sufficiently cooled the economy, the job market and inflation. Inflation has dropped from a peak of 9.1% in June to 5% in March but remains well above the Fed's 2% target rate.",
        "\"Inflation pressures continue to run high, and the process of getting getting inflation back down to 2% has a long way to go,\" Powell said.The three banks that collapsed had bought long-term bonds that paid low rates and then rapidly lost value as the Fed sent rates higher. At his news conference, Powell noted that a Fed survey found that mid-sized banks were already tightening credit before the banking upheavals and have done so even more since the failures.Fed economists have estimated that tighter credit resulting from the bank failures will contribute to a \"mild recession\" later this year, thereby raising the pressure on the central bank to suspend its rate hikes.Even if the Fed imposes no further increases, many economists have said they expect the central bank to keep its benchmark rate at its peak for a prolonged period, likely through year's end.The Fed is now also grappling with a standoff around the nation´s borrowing limit, which caps how much debt the government can issue. Congressional Republicans are demanding steep spending cuts as the price of agreeing to lift the nation´s borrowing cap.Earlier this week, Treasury Secretary Janet Yellen warned that the nation could default on its debt as soon as June 1 unless Congress agreed to lift the federal borrowing limit. A first-ever default on the U.S. debt could potentially lead to a global financial crisis.",
        "Powell reiterated his warning that \"no one should assume that the Fed can protect the economy from the potential short and long-term effects of a failure to pay our bills on time.\"The Fed´s decision Wednesday came against an increasingly cloudy backdrop. The economy appears to be cooling, with consumer spending flat in February and March, indicating that many shoppers have grown cautious in the face of higher prices and borrowing costs. Manufacturing, too, is weakening.Even the surprisingly resilient job market, which has kept the unemployment rate near 50-year lows for months, is showing cracks. Hiring has decelerated, job postings have declined and fewer people are quitting jobs for other, typically higher-paying positions.Goldman Sachs estimates that a widespread pullback in bank lending could cut U.S. growth by 0.4 percentage point this year. That could be enough to cause a recession. In December, the Fed projected growth of just 0.5% in 2023.The Fed´s latest rate hike comes as other major central banks are also tightening credit. European Central Bank President Christine Lagarde is expected to announce another interest rate increase Thursday, after inflation figures released Tuesday showed that price increases ticked up last month.Consumer prices rose 7% in the 20 countries that use the euro currency in April from a year earlier, up from a 6.9% year-over-year increase in March.",
        "In the U.S., several factors are slowing inflation. The rise in rental costs has eased as more newly built apartments have come online. Gas and energy prices have fallen. Food costs are moderating. Supply chain snarls are no longer blocking trade, thereby lowering the cost for new and used cars, furniture and appliances.Still, while overall inflation has cooled, \"core\" inflation - which excludes volatile food and energy costs - has remained chronically high. According to the Fed´s preferred measure, core prices rose 4.6% in March from a year earlier, scarcely better than the 4.7% it reached in July."
    ]
}