{
    "articleURL": "/wires/ap/article-12049793/Sudan-migrants-Israel-worry-future-fighting-home.html",
    "content": [
        "TEL AVIV, Israel (AP) - Omer Easa is watching the violence roiling his native Sudan with deep trepidation. The further Sudan sinks into chaos and violence, he fears, the longer he is likely to remain an unrecognized asylum-seeker in Israel, where he has few protections.",
        "Backers of migrants like Easa say their rights will likely come under greater threat if Israel´s government, its most right-wing ever, moves ahead on a contentious plan to overhaul the judiciary.The plan, if it passes in its original form, could lead to legal measures that would embitter the everyday lives of the migrants and, critics say, make their stay in Israel intolerable.\"My heart is there. My head is there. It is just that my body is here,\" said Easa, 31, who said he fled the war-torn region of Darfur in 2012 over concerns for his life. \"We live here often thanks to the graces of the Supreme Court.\"Proponents of the legal overhaul say the migrants are a main reason the plan must move ahead.African migrants, mainly from Sudan and Eritrea, began arriving in Israel in 2005 through its porous border with Egypt.",
        "Israel initially turned a blind eye to their influx and many took up menial jobs in hotels and restaurants. But as their numbers swelled to a high of about 60,000, there was a backlash, with growing calls to expel the new arrivals. After years of attempts to push them out, they now number about 25,000, according to the Israeli Interior Ministry.Easa is one of thousands of Sudanese migrants in Israel who live a precarious existence. Israel recognizes very few as asylum seekers, seeing them overwhelmingly as economic migrants and says it has no legal obligation to keep them. Talk of repatriating them emerged when Israel and Sudan signed a normalization agreement in 2020, but the turmoil there has slowed progress on the deal.",
        "Violence in Sudan between forces loyal to two warring generals erupted last month, pushing the nation to the brink of collapse. The fighting, which began as Sudan was expected to start transitioning from last year's military coup to civilian rule, already has killed hundreds of people and left millions trapped in urban areas, sheltering from gunfire, explosions and looters.With Sudan's cellphone network all but dead, Easa and others in Israel have struggle to reach their loved ones.Israel's African migrants say they are asylum-seekers who fled for their lives and face danger if they return. Those from Sudan see the renewed conflict at home as another reminder of why they cannot go back and why their status should be settled, especially at a time of uncertainty over the future of Israel´s judicial system.Under international law, Israel cannot forcibly send migrants back to a country where their life or liberty may be at risk. Critics accuse the government instead of trying to coerce them into leaving.Israel has used various tactics that have made their lives more difficult, from detaining them in remote desert prisons to holding part of their wages and making the money available to them only after they agree to leave the country. It has left thousands of asylum requests open and offered cash payments to those who agreed to move to a third country, somewhere in Africa.",
        "Israel also has built a barrier along the border with Egypt to stop the influx and agreed with the United Nations to resettle thousands of migrants in Western countries while allowing thousands of others to remain in Israel. That deal, however, was quickly scrapped under pressure from anti-migrant activists and hard-line legislators.The Supreme Court has also blocked some of those efforts, striking down some anti-migrant laws deemed unconstitutional, including those dealing with their detention and their salaries. Those rulings have made the migrant issue a rallying cry for supporters of the legal overhaul, who say the court has overstepped in its rulings.In March, before he paused the overhaul under intense pressure, Prime Minister Benjamin Netanyahu cited the migrant issue as an example in which \"the court intervened unjustly.\"The overhaul plan would weaken the Supreme Court and limit judicial oversight over government decisions. If it moves ahead in its proposed form, the government could re-legislate laws the court invalidated or enact new ones and override any future court decisions on them.Migrants will face \"a much greater risk\" if the plan goes through, said Sigal Rozen, public policy director for the Hotline for Refugees and Migrants, a rights group.A weakened Supreme Court would not be able to stand in the way of a proposed law planned by an ultranationalist coalition member who seeks to incarcerate migrants indefinitely, withhold part of their salary and restrict their movement within Israel, she said.",
        "The migrants´ presence has long divided the country. Their supporters say Israel, a country founded upon the ashes of the Holocaust and built up by Jewish refugees, should welcome those seeking asylum.Opponents claim the migrants have brought crime to the low-income southern Tel Aviv neighborhoods where they have settled. Some Israeli politicians have labeled them infiltrators, with one calling them \"a cancer\" threatening the country´s Jewish character.Proponents of the legal changes say the Supreme Court is oblivious to the problems posed by the migrants´ presence.\"It's not the role of the court to decide our immigration policies,\" said Sheffi Paz, a prominent anti-migrant activist. \"That's what we elect our lawmakers to do.\"The fighting in Sudan hasn't softened her opposition, she said.Since fleeing Sudan, Easa, the migrant, has had a tough existence in Israel. He was shot at by Egyptian forces as he tried to cross into Israel, was detained in an Israeli prison and now ekes out a living as a deliveryman.All the while he has been hoping that Israel might one day recognize him as an asylum seeker with proper rights and an insurance policy against deportation.\"I hope they will ... let people live with dignity,\" he said, speaking in fluent Hebrew. \"And we hope there will be peace.\"",
        "___This story has been corrected to show that the name of the migrant rights group is the Hotline for Refugees and Migrants, not the Hotline for Migrant Workers."
    ]
}