{
    "articleURL": "/news/article-12041895/Moment-two-armed-robbers-five-feet-tall-rob-New-Jersey-Best-Buy.html",
    "content": [
        "Surveillance footage shows the suspects inside the store trying to swipe iPads and iPhonesPolice have not yet arrested the two suspected criminals  after the incident on April 30 Police in New Jersey are hunting two short suspected robbers who held Best Buy employees up at gunpoint.",
        "The pint-sized criminals, described as both being under five feet tall, tried to steal several iPhones from the store in Nixon Drive, New Jersey.Mount Laurel Police Department was called to the robbery in progress on April 30 at around 1.30pm. It's unclear if the robbers managed to steal any goods. Both suspects fled the store in an early 2000's model silver Acura TL which had a temporary registration and dark-tinted windows before police arrived on the scene.Surveillance footage shows the suspects inside the store trying to swipe iPads and iPhones before an employee intervened.",
        "A suspect in a blue jumpsuit then started to point his Glock 9mm handgun at staff members, but they did not make any verbal threats.Both men fled the store before police got there, and officers have now released images and are appealing for help in identifying the suspects.A Best Buy spokesman said: 'Nothing is more important to us than the safety of our customers and employees, and we're grateful that no one was injured at our mount laurel store n Sunday.'We're focused on supporting our employees and are working closely with law enforcement during their investigation.'During a press conference, Lieutenant Ryan Orange said: 'To do something like this in the middle of the day on a Sunday when people are shopping is incredibly bold and that's why we're going to do everything in our power to catch them. ",
        "'If you see the suspects contact 911 immediately we consider them armed and dangerous.",
        "Authorities are appealing for any information on the small-statured criminals, and confirmed they are looking into the possibility that they have targeted other stores.In a statement Mount Laurel Police Department said: 'On Sunday, April 30, 2023, at approximately 1:30 PM, Officers responded to Best Buy on Nixon Drive for an armed robbery in progress.'Upon arrival the suspects had left the location in an older silver Acura TL bearing an unknown temporary registration. The vehicle has dark tint on all windows.'The suspect in the blue jumpsuit pointed a firearm at multiple employees while attempting to retrieve iPhones off the display. 'Both suspects are described to be under 5 feet tall.'If anyone knows the identity of these suspects or has any information, you are kindly asked to contact Mount Laurel Police Department at 856-234-8300 or the confidential tip line 856-234-1414 Ext. 1599."
    ]
}