{
    "articleURL": "/money/comment/article-12038741/ALEX-BRUMMER-JP-Morgan-boss-Jamie-Dimon-leading-pack.html",
    "content": [
        "Among the key roles of a central bank is to be lender of last resort. It is the go-to institution for troubled banks, as seen in the great financial crisis. They also rescued the whole economy in the pandemic.",
        "JP Morgan Chase chief executive Jamie Dimon is single-handedly changing that narrative.He has been the grand controller throughout the current earthquake in US banking, providing advice on the rescue of Silicon Valley Bank (SVB), and has emerged as saviour in the battle to bail out San Francisco’s First Republic. His status in global finance has never been higher.In contrast, Jay Powell, chairman of real US central bank, the Federal Reserve, finds himself under fire over the way that regulation of the US’s second-line regional banks has been eased since the financial crisis.",
        "Powell is also under attack over the aggressive way that the Fed has hiked interest rates – to kill inflation – placing large swathes of the US financial system under duress.The Fed is expected to raise its key federal funds rate range of 4.75 to 5 per cent by a further quarter of a percentage point today.In allowing JP Morgan to snap up First Republic, US regulators broke the rules. The American banking system has been operating under the principle that no bank should control more than 10 per cent of deposits. The rule was regarded as both necessary for competitive reasons and for preserving the pretence that no bank is ‘too big to fail’. ",
        "In propping up First Republic by committing to a further £10billion of support, in addition to £18billion already spent on SVB and Signature, the authorities have run roughshod over regulations.Use of the Fed’s discount window, where it exchanges illiquid or loss-making assets for cash, have shot up. Recent data suggests that borrowings are running at £93.6billion on average each day. This exceeds the peak of £89billion seen in the 2007-08 peak of the financial crisis. Such numbers give lie to the assurances coming from Dimon and the regulators that with the First Republic overhang settled, all is rosy in the garden.In the middle of unseen bank runs, with cash fleeing to safe harbours, such as money market funds, that is impossible to say.Proposals by the Federal Deposit Insurance Corporation to raise the limit on insured deposits above $250,000 (£200,000) and to extend cover to certain categories of businesses show fundamental fissures. Academics at Stanford University estimate unrealised losses in the American banking system to be £1.3 trillion.First Republic gives JP Morgan access to a whole new layer of wealthy customers in California and Florida. Wealth management is an area where JP Morgan lags behind rival Bank of America, which owns Merrill Lynch and Morgan Stanley.If Dimon still fancied a shot at politics he would be a mere stripling at 67, and an intellectual leap above those tired old warhorses Joe Biden and Donald Trump. Dream on . ..",
        "Riposte to ChinaHSBC is Britain’s equivalent of JP Morgan. The bank’s profits tripled to more than £10bn in the first quarter, bolstered by the reversal of past provisions and its strength in a higher interest rate climate.The opportunistic purchase of SVB’s British arm, which was bought for £1, contributed a £1.2billion boost. Coming just days before a showdown annual general meeting in Birmingham, where Chinese interests are seeking a break-up of the group, the restitution of the dividend and a share buyback of £1.25billion should keep much of the rest of the share register onside.Chief executive Noel Quinn plans for simplifying the enterprise have encountered regulatory delays in France and Canada, and the current turmoil in global banking won’t help. Breaking up the UK’s largest bank is a very bad idea.Tax boostWill they ever learn? The claque led by those two knights, Keir Starmer and Lib Dem leader Ed Davey, has renewed calls for higher windfall taxes after BP reported first-quarter profits of £4billion.What they neglect to say is that the tax rate on BP’s North Sea operations has reached 75 per cent and has already resulted in a £800million take for the exchequer, including £520million in the latest quarter.What climate change warriors never mention is that BP is committing £18billion to carbon-free investment – much of it in the UK – by 2030. ",
        "Greenwashing maybe, but given budgetary constraints, the next government could struggle to match that.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}