{
    "articleURL": "/tvshowbiz/article-12046585/Maya-Jama-strips-skimpy-pink-bikini.html",
    "content": [
        "She's gearing up to host the summer season of Love Island after a successful presenting debut. ",
        "And Maya Jama looked like she could be one of the contestants as she showcased her incredible figure in a skimpy pink bikini on a luxury getaway. The TV personality, 28, sizzled in a tiny two-piece that highlighted her taut stomach and cleavage as she danced around. Allowing her natural beauty to shine through she went makeup-free, while her raven locks were swept back into a bun.Maya - who shared the snaps on her Instagram Story on Thursday - completed the look with a pair of white cat eye sunglasses. ",
        "Later in the day, Maya changed into a pink crochet dress as she hopped on a bycycle and cycled around the tropical surroundings. The presenter - who has not disclosed where she is holidaying - quipped 'Been here two days and think I'm Jane of the jungle.' Maya's holiday comes after it was revealed that Love Island will return to screens in just over four weeks on June 5.She will be back as the host following her huge success on the winter version of the show, which saw Sanam Harrinanan and Kai Fagan be crowned the winners.The summer version will see a new host of singletons travel to Majorca and stay in a luxurious villa for two months.",
        "Maya took over from Laura Whitmore to present series nine of the reality show.A TV source told The Sun: 'ITV have already lined up the islanders who will be heading to the show's villa in Majorca.'The cast will fly out late next month ready for the show to begin in just eight weeks.'",
        "They continued: 'Maya [Jama] is chomping at the bit to get to work on this series too. Having her on board has given Love Island a real boost and it's expected that ratings will soar.'According to the source the series is set to last eight weeks, meaning the finale will be taking place in early August.However, a second source claimed: 'This is speculation as no dates have been confirmed at this point.'Love Island currently airs twice a year on ITV2 and they are also preparing to air a middle-aged version of the show - dubbed The Romance Retreat."
    ]
}