{
    "articleURL": "/tvshowbiz/article-12040539/Alexander-Ludwig-wife-Lauren-announce-child-arrived-four-weeks-early.html",
    "content": [
        "Alexander Ludwig and his wife, Lauren, welcomed their first child last Thursday.",
        "On Tuesday, the Vikings alum, 30, and his wife announced the birth in a joint Instagram post and revealed that their baby girl arrived four weeks before her expected due date.In the adorable snap, Alexander had his arms wrapped about Lauren, 31, as she held their baby and took the photo.The caption also revealed the couple — who announced they were expecting earlier this year in February — had named their daughter Leni.'Leni James Ludwig decided to come on her own schedule 4 weeks early,' the new parents had written.",
        "In the caption, they also shared that Alexander 'was in another state filming and made it back just in time'.The pair wrote that it was memorable experience and 'a labor story for the books.' The parents were seen grinning widely as they welcomed their child into their home. On his Instagram Story, the new father also shared a photo of himself — taken by Lauren — holding onto their sleeping baby as she laid on his chest.He wrote over the photo: 'Dad mode activated'. A few months ago, Alexander and Lauren had announced they were expecting their first child together. Nine months earlier, the pair had opened up about experiencing their third miscarriage.In the joint Instagram post, he could be seen standing behind his wife of over two years as he gently cradled her growing baby bump in an adorable mirror selfie.",
        "Previously, the lovebirds — who eloped in Utah only one month after becoming engaged in November 2020 — revealed the tragic news last year in May that they had experienced a third pregnancy loss.Following a difficult journey, the couple happily expressed to their followers: 'Baby Ludwig coming May 2023.'The talented actor penned in the caption, 'It’s been a long road, and we wanted to wait until things were looking promising this time around.'The Hunger Games star added that both he and his wife are 'grateful' for the flow of 'support' they have continuously received. Alexander humorously added that their dog, Yam, 'is stoked.' The actor also included the caption his wife had typed out on her own Instagram page, which read, 'As a lot of you know it’s been a long road for @alexanderludwif and myself.' She then revealed, 'We suffered 3 losses before this one but each one of those losses taught us about ourselves and each other.' ",
        "Lauren then added a motivational message to her followers by writing, 'To everyone out there who has suffered miscarriages before, there is light on the other side of your journey. You are not alone.' Social media users swiftly flooded the comment section to send their congratulations and well wishes to the parents-to-be. ",
        "Twilight alum, Ashley Greene, who welcomed her own first child last year in September, excitedly penned, 'Yay yay yay!!! So happy for you both.' Underneath Lauren's post, the actress also wrote, 'Congratulations beautiful angel. You are going to be such an amazing mother,' and kindly added, 'call me with allllll your questions because I'm in the thick of it hehe. Sending love to you both!' Alexander's sister, Natalie, added a strew of red heart emojis to wish her brother and sister-in-law a heartfelt congratulations.  In the photo shared on both the actor's and his wife's account, the Heels star could be seen wearing all-black in a plain, long-sleeved sweater and a pair of black pants. His wife and business owner donned a short-sleeved, brown shirt that was slightly lifted upwards to give a quick glimpse of her baby bump. She opted for comfort by also wearing a pair of loose-fitting, cream-colored sweatpants. Alexander's right hand lovingly cradled his wife's bump as she held up her smartphone towards the mirror to snap the selfie in what appeared to be a spacious entryway. Their cute pup, Yam, could be seen in front of the happy pair while gazing up at the two.  Last year in May, Lauren sadly revealed to her Instagram followers that she had experienced her third miscarriage. ",
        "In the photo, she was resting on a hospital bed while sharing a kiss with Alexander as he sat by her side for support. 'I have gone back and forth on whether or not to post anything about this but decided we all need to start talking about the truth more,' she emotionally began. 'Last week @alexanderludwig and I had our 3rd miscarriage. I decided I wanted to share because I don’t think it’s a shameful thing to talk about,' adding that she wanted other women to know that miscarriages were 'common' and not 'something to be embarrassed about.'  She continued, 'Going through this has made me realize, I definitely am not alone. It’s so common and yet, I feel its not talked about nearly enough. If more of us talked about these things, maybe we would feel less alone and at fault. Information is power and I want to start sharing more of it.' The Theirs Is Ours jewelry founder movingly concluded with, 'This will forever be a part of our story. My hope by sharing this, if for no other reason, is for that one person reading this to know they are not alone.' Alexander had responded to her message in the comments at the time, and wrote, 'I’m so proud to call you my wife, you amaze me every day with your resilience strength and just love of life. We got this baby ❤️' ",
        "The Canadian-born actor also shared the post, and other celebrities sent their love to the couple, such as film director, Eli Roth, and his Vikings co-star, Katheryn Winnick. In November 2020, Ludwig and Lauren became engaged, and the star shared a cute photo as his then-fiancee held up her hand to flash the diamond ring. ",
        "'Goldilocks and Bambi live happily ever after,' he wrote in the caption. The couple announced on Instagram they had eloped one month after their engagement and shared romantic snaps as they posed in classic wedding attire with snow-capped mountains in Utah sprawled out behind them. Lauren donned a sleeveless, sleek white gown that flowed down with a train behind her. He donned a black tuxedo complimented with a white dress shirt and black bow tie.  Alexander explained, 'Life is too short And i didnt want to spend another day without calling this beautiful woman my wife,' while humorously adding that their dog, Yam, was their 'witness.'  "
    ]
}