{
    "articleURL": "/wires/ap/article-12050565/How-watch-King-Charles-coronation-US.html",
    "content": [
        "King Charles III's coronation Saturday will mix a thousand-year tradition with the streaming age.",
        "The pomp and ceremony will be unmissable for U.K. residents, but what about royal watchers across the Atlantic? There are plenty of options to watch the regalia-heavy event that serves as a formal confirmation of King Charles' dual role as head of state and titular leader of the Church of England - for those willing to wake up early enough.While it might seem odd that Americans might want to tune in, there have been large audiences for previous royal milestones, such as the wedding of Charles and Diana in 1981 and the weddings of their children, William and Harry.The longevity of the king's mother, Queen Elizabeth II, means that many people alive have never seen a coronation.WHAT TIME DOES THE CORONATION START?Well, first King Charles and his wife Camilla have to get to the ceremony. That begins with a procession to Westminster Abbey, which will get started at about 5 a.m. EDT, 2 a.m. for West Coasters.",
        "The Associated Press will livestream the procession beginning at 5 a.m. Eastern and provide ongoing coverage throughout the day on www.apnews.com.Broadcast networks ABC, CBS and NBC as well as cable channels CNN and Fox News all plan live coverage starting at 5 a.m. EDT. The outlets will also feature coverage on their digital platforms and streaming like Hulu+ Live TV.",
        "WHAT SHOULD I KNOW AHEAD OF TIME?The day will be filled with pageantry - the handing over of a rod, sceptre and orb, all medieval symbols of power - and loads of other traditions. Despite that, Charles has slimmed down the event, shortening the procession route and the Westminster Abbey ceremony.More than 100 heads of state will be in the audience, but President Joe Biden will keep with U.S. tradition and not attend. Instead, first lady Jill Biden will be there.The celebration continues on Sunday with the Coronation Concert, but U.S. audiences won't be able to watch headliners Lionel Richie and Katy Perry. That will be shown on BBC's iPlayer, which isn't available outside the U.K.___For more coronation coverage, visit: https://apnews.com/hub/king-charles-iii"
    ]
}