{
    "articleURL": "/news/article-12060285/Woman-sued-Subway-tuna-salad-asks-judge-dismiss-case.html",
    "content": [
        "Plaintiff Nilima Amin asked that her lawsuit against Subway be retracted, saying that her pregnancy made it too difficult for her to continue with the litigationAmin sued Subway in 2021 claiming she had tested the franchise's tuna salad and found it was 'made from anything but tuna,' which Subway sharply deniedShe later dialed her claims back, and instead said her tests simply couldn't determine exactly which species of tuna was in the ingredientsThe California woman suing Subway for claiming its tuna products contain ingredients other than tuna wants to end her lawsuit because she is pregnant, prompting Subway to demand her lawyers be sanctioned for bringing a frivolous case.",
        "Nilima Amin said her 'severe' morning sickness and 'debilitating' conditions as she prepares for a third child have left her 'unable to proceed with the obligations as plaintiff,' and require her to focus on her health and family.Amin wants to dismiss the case in San Francisco federal court without prejudice, which would let her sue again when she feels better.In a May 4 filing in response, Subway said Amin's excuse flunked the 'straight-face' test, and her lawyers likely realized it would not 'simply pay the windfall settlement that they hoped to get by constructing a high-profile shakedown.'The lawsuit made headlines in 2021 when Amin claimed she'd conducted tests on the chain's tuna salad and found it was 'made from anything but tuna,' but instead a composite of other ingredients intended to imitate the fish. Subway vehemently denied the claims, telling DailyMail.com at the time they were 'meritless' and there was 'simply no truth' to them.",
        "In its latest filing, Subway also said the 'media frenzy' from the lawsuit caused severe harm, and faulted Amin's 'ever-changing' theories to debunk its claim that its tuna sandwiches, salads and wraps contained '100% tuna.'The chain wants Amin's proposed class action dismissed, and her seven lawyers to pay at least $618,000 of its legal bills.",
        "Amin's lawyers did not immediately respond on Monday to requests for comment.The plaintiff claimed to have ordered Subway tuna products more than 100 times before suing in January 2021.She accused Subway of using other fish species, chicken, pork and cattle in its tuna products, or no tuna at all.But the plaintiffs later dialed back their claims, saying in a later filing they simply couldn't determine whether the tuna in Subway's salad was '100% sustainably caught skipjack and yellowfin tuna,' according to the New York Times. Last July, U.S. District Judge Jon Tigar in San Francisco let Amin's case continue but rejected her claim that 'reasonable consumers' would expect only tuna and nothing else, calling it a 'fact of life' that ingredients such as mayonnaise were okay.Subway has nearly 37,000 restaurants in more than 100 countries.",
        "In the initial lawsuit, Amin wanted her claim certified as a class action, which would have allowed thousands of other potentially dissatisfied customers to join in the legal action.Anyone wishing to join the lawsuit would have had to purchase a tuna sandwich or tuna wrap sometime after January 21, 2017.Amin, along with a co-plaintiff who helped with the testing Karen Dhanowa, sued Subway for fraud, intentional misrepresentation, unjust enrichment, and other civil violations.",
        "They claimed they 'were tricked into buying food items that wholly lacked the ingredients they reasonably thought they were purchasing' based on Subway's advertising and marketing of the product.Their attorney, Shalini Dogra, told the Washington Post 'We found that the ingredients were not tuna and not fish.'Dhanowa and Amin alleged Subway 'is saving substantial sums of money in manufacturing the products because the fabricated ingredient they use in the place of tuna costs less money.'They claimed they were being cheated out of the health benefits they thought they were getting by buying tuna sandwiches. The lawsuit sought unspecified damages as well as attorneys' fees."
    ]
}