{
    "articleURL": "/wires/pa/article-12044353/Call-better-awareness-communicate-people-deaf.html",
    "content": [
        "One in 10 members of the public would actively avoid communicating with a deaf person for fear of not knowing how to engage with them, a new poll suggests.",
        "The survey, conducted on behalf of the hearing loss charity RNID, also found that 59% of people would not feel confident communicating with someone who is deaf or has hearing loss.Almost half (48%) of the 2,095 UK adults surveyed by YouGov said they do not know how to communicate with someone who is deaf or has hearing loss. We want to open up conversations about deafness and hearing loss during Deaf Awareness Week, build the public’s confidence in communicating, and highlight the support available  Teri Devine, RNID  The RNID has launched a new campaign to mark Deaf Awareness Week to encourage people who have not been diagnosed with hearing loss to communicate with people who are deaf or have hearing loss.Teri Devine, director for inclusion at RNID; “These findings lay bare just how much everyday stigma and misunderstanding the 12 million people who are deaf or have hearing loss in the UK face in daily life.“We want to encourage everyone to practise our simple communication tips during Deaf Awareness Week, shared by deaf people and people with hearing loss, so that everyone is included in conversation.",
        "“Despite the majority of people saying they lack experience talking to deaf people and people with hearing loss, hearing loss affects one in five adults, so the chances are there is someone in your family, your friendship group or at work.",
        "“We want to open up conversations about deafness and hearing loss during Deaf Awareness Week, build the public’s confidence in communicating, and highlight the support available. The most important thing is just to ask someone how you can help.”The charity is urging the public to use the acronym EAR to help communicate with people with hearing loss. This includes:– Environment – making sure the environment is appropriate by reducing background noise or moving to a quieter area while making sure the room is well lit for someone who lip reads.– Attention – use simple gestures such as pointing, waving or a light tap on the shoulder to get someone’s attention, face the person you are speaking to so they can lip read, and speak to them, not their interpreter or anyone else with them.– Repeat and rephrase if someone does not understand. If this does not work, you could write it down, or speak to a friend or relative if they ask you to.Meanwhile, charity Auditory Verbal UK (AVUK) has launched a campaign calling for more early support for deaf children.The charity said that only 8% of deaf children under five in the UK have access to an auditory verbal therapy programme.Anita Grover, AVUK chief executive, said: “When children and their families have access to effective, early support, deaf children can get an equal start at school and their opportunities are transformed.",
        "“This is critically important whether a child uses sign language, spoken language or both. There is not one approach that works for all families of deaf children.”“That is why we are asking for Government investment to ensure all deaf children can access early and effective support with no cost barrier, close to their homes.”Jo Campion, deputy director of campaigning and advocacy at the National Deaf Children’s Society, said: “Deaf children and young people often tell us they feel isolated and lonely, and when one in 10 people say they would actively avoid talking to them, it’s not hard to see why.“Deaf Awareness Week is a great time to get started with learning more about deafness and how to support deaf children.“If everyone took the time to pick up some tips, become a little more deaf aware and make a bit of extra effort, it would make an incredible difference.“Every child deserves to be included in the fun and games happening around them – and that includes deaf children.”"
    ]
}