{
    "articleURL": "/news/article-12059063/BBC-faces-backlash-Adjoa-Andoh-Paddy-OConnell-said-apologise-for.html",
    "content": [
        "Paddy O'Connell claimed Adjoa Andoh had not 'upset anyone' on BBC Radio 4Speaking yesterday, Adjoa said that she 'didn't mean to upset anybody' on radio It comes after the Bridgerton star said Buckingham Palace looked 'terribly white'The BBC today faced a backlash from angry listeners after a Radio 4 presenter told Bridgerton star Adjoa Andoh she 'had nothing to apologise for' when she said the Royal Family was 'terribly white'.",
        "Twitter has been flooded with comments following yesterday's programme amidst claims that Adjoa 'tried to backtrack' on 'racist' comments surrounding Buckingham Palace.Adjoa said the Buckingham Palace balcony was 'terribly white' on Coronation Day when she appeared on live ITV coverage at the weekend.Defending her statement on BBC Radio 4 yesterday, the actress said she 'didn't mean to upset anybody'. The Netflix star told the show: 'I think I upset a few people yesterday I was talking about the day and how marvellous it was and then looking at the balcony at the end. And I suddenly went \"oo it's so white\" - because the day had been so so mixed. I didn't mean to upset anybody, I just was..'Paddy then interjected, suggesting she had 'nothing to apologise for' by adding: 'You haven't upset anyone.'One twitter user said: 'Bridgerton star Adjoa Andoh has just tried to back track on @bbcradio4, about her comment that the Buckingham Palace balcony was \"terribly white\". And then the presenter Paddy O’Connell tells her that she’s got nothing to apologise for. Please don’t speak for me!'",
        "Numerous commenters then chimed into the conversation, adding 'nor me' and 'she does need to apologise'.  One person tweeted that her comments were 'outrageous' and create 'division' while another said: 'Paddy O’Connell is an enabler. Where is the impartiality @BBCRadio4?'",
        "MailOnline has approached the BBC for comment. This backlash also comes as Ofcom has allegedly been bombarded with complaints following the Bridgerton star's comments on ITV.",
        "One commenter slammed Adjoa's ITV comments as 'ridiculous', tweeting: 'How can she get away with that? Anyone of white colour would have to make a public apology. Ridiculous, just shows she's a racist though.'Another said: '@ITV after the racist comment by Adjoa Andoh yesterday, I have now put in my complaint to Ofcom.'As millions tuned in to watch the newly crowned King and Queen wave down to crowds on The Mall with the rest of the Royal Family, Adjoa left her ITV co-stars stunned with her comments which have been described by some as 'appalling'.The star, whose father was of Ghanaian origin, was commentating for ITV on their live Coronation coverage hosted by Tom Bradby and Julie Etchingham when she said of the event: 'We have gone from the rich diversity of the Abbey to a terribly white balcony.'I am very struck by that.",
        "'I am also looking at those younger generations and thinking: 'What are the nuances that they will inhabit when they grow?'Adjoa, 60, who plays Lady Danbury in Bridgerton, left fellow pundit Myleene Klass – who was sitting next to her – appearing bewildered as she made her comments.",
        "A spokesman for Ofcom told MailOnline: 'Any complaints we receive on this issue will be assessed against our broadcast rules, before we decide whether to investigate or not.'The details of any incident attracting more than 50 Ofcom complaints are published every Wednesday.Adjoa, who played Dr Isaacs in the psychological thriller Fractured, as well as DI Nina Rosen in BBC's Silent Witness, has enjoyed a successful career in TV, film and on the stage. She made her Hollywood debut in 2009 in Clint Eastwood's hit-film Invictus alongside Morgan Freeman and Matt Damon.Ten years later, she co-directed, and played Richard II at Shakespeare's Globe Theatre, in the UK's first all women-of-colour production."
    ]
}