{
    "articleURL": "/health/article-12057501/GPs-given-240-million-new-phone-systems-ease-chaos-lengthy-waits-patients.html",
    "content": [
        "GPs to get £240m for new phone systems to reduce wait times when callingPractices will not be allowed say 'phone back later' and must offer same-day helpGP practices will be given £240million for new phone systems so patients no longer face engaged tones or lengthy waits during the 8am scramble for appointments.",
        "Receptionists will also receive more training to direct callers to the medic best suited to their needs.Practices will not be allowed to tell patients to phone back later and must offer an appointment or assessment on the same day or refer them to the likes of a pharmacist or A&amp;E.It comes after surveys revealed public satisfaction with GPs has hit an all-time low, with patients particularly frustrated by difficulties accessing a doctor and getting through on the phone.An average-sized practice of 10,000 patients often receives more than 100 calls in the first hour every Monday but many patients could be seen by someone other than a family doctor.",
        "The digital phone systems will add callers to a queue, inform them of their position and allow them to request a call back.Online tools will offer patients an alternative way of finding the right professional for their needs, such as a pharmacist, and allow them to book appointments. The changes will feature in the Government's GP access recovery plan published tomorrow.It also expected to create a greater role for pharmacists to help ease the strain on doctors.Health Secretary Steve Barclay said: 'We are already making real progress with 10 per cent more GP appointments happening every month compared to before the pandemic. I want to make sure people receive the right support when they contact their general practice and bring an end to the 8am scramble for appointments.",
        "'To do this we are improving technology and reducing bureaucracy, increasing staffing and changing the way primary care services are provided.'",
        "The Government will fund 6,500 so-called care navigator training places – one staff member per practice – who will be expected to pass on the training to colleagues.Professor Kamila Hawthorne, of the Royal College of GPs, welcomed the investment but said more must be done.'We await further details of the full access recovery plan, but ultimately the best way to improve access to GP care and address the intense workload and workforce pressures GP teams are working under is to increase numbers of fully trained, full-time equivalent GPs through effective recruitment and retention schemes,' she added.Labour health spokesman Wes Streeting said: 'The reason people can't get a GP appointment is the Conservatives have cut 2,000 GPs. Better hold music isn't going to change that.'Nothing in this announcement will train more doctors, allow patients to choose a face-to-face appointment, or bring back the family doctor so patients see the same GP each time.'"
    ]
}