{
    "articleURL": "/wires/reuters/article-12048061/Lebanon-central-bank-chiefs-brother-questioned-European-fraud-probe-hearing.html",
    "content": [
        "BEIRUT, May 4 (Reuters) - The brother of Lebanon's central bank governor appeared on Thursday at a hearing in Beirut with European investigators probing whether the siblings embezzled and laundered hundreds of millions of dollars in public funds over more than a decade, a judicial source said.",
        "Governor Riad Salameh is being investigated alongside his brother Raja in Lebanon and in at least five European countries over allegedly taking more than $300 million from the central bank by collecting commissions as a fee from bond buyers then transferring the funds to Forry Associates, owned by Raja.The brothers deny wrongdoing.In a nearly five-hour session in which Raja was questioned about his brother's wealth, he told investigators that Forry was solely owned by him. He said $155 million in funds he amassed came from investment profits made over ten years from accrued interest and foreign exchange transactions.The governor, 72, has previously denied embezzlement, saying the collected commissions were not public funds.According to French court documents seen by Reuters, French prosecutors say money from Forry was used to make \"numerous\" real estate purchases across Europe and the United Kingdom.The documents say prosecutors suspect Riad used fake banking documents in Raja's name to cover up illicit sources of wealth.European investigators questioned the governor in Beirut over two days in March, asking about the central bank's links to Forry, his assets abroad, the source of his wealth and transfers he made to associates and relatives.The European investigators are also set on Friday to question caretaker finance minister Youssef el-Khalil , who still serves as the central bank's head of financial operations.",
        "French prosecutors have informed Riad that they intend to press charges of fraud and aggravated money laundering during a planned hearing in France on May 16.Last spring, Raja was held in Lebanese custody for nearly two months over charges of \"complicity in illicit enrichment\" that also involved his brother.Raja was released on a record bail of 100 billion Lebanese pounds, or around $3.7 million at the market exchange rate at the time. (Reporting by Laila Bassam Editing by Alexandra Hudson)"
    ]
}