{
    "articleURL": "/wires/reuters/article-12056519/Former-FCC-Chair-Newton-Minow-called-1960s-TV-vast-wasteland-dies-97.html",
    "content": [
        "In 2011 said TV had improved because it offered more choices",
        "S.S. Minnow in \"Gilligan's Island\" was named for himLiked \"Mary Tyler Moore,\" \"Downton Abbey,\" \"Mad Men\"By Bill TrottMay 7 (Reuters) - Former U.S. Federal Communications Commission Chair Newton Minow, who lambasted television as a \"vast wasteland\" more than 60 years ago and challenged the broadcast world to come up with imaginative alternatives, died on Saturday at the age of 97, his daughter Nell Minow said on Twitter.Minow in 2011 said television had indeed improved through its multitude of choices.The chair of the FCC usually falls into the category of faceless, seldom-heard-of Washington bureaucrat but Minow earned a spot in contemporary U.S. history in his first major appearance in the job. On May 9, 1961, he addressed the National Association of Broadcasters convention and had some stark criticism for television executives.Minow started his speech with a bit of praise - singling out \"The Twilight Zone,\" shows by Fred Astaire and Bing Crosby and some news programs - before raising his complaints.\"When television is good, nothing - not the theater, not the magazines or newspapers - nothing is better,\" Minow said. \"But when television is bad, nothing is worse.\"He bemoaned the parade of game shows, violence, \"formula comedies about totally unbelievable families\" and \"screaming, cajoling and offending\" commercials that viewers were subjected to and \"most of all, boredom.\"",
        "He challenged the executives to set aside a day to do nothing but watch television in order to get a better idea of what they were giving the American public.\"I can assure you that what you will observe is a vast wasteland,\" he said.And that was decades before any Kardashians, real housewives, Jersey Shore denizens or other reality show characters had made their way to television.The \"vast wasteland\" phrase that Minow was so closely identified with came from his speechwriter, John Bartlow Martin, who actually had watched 20 consecutive hours of television as part of research for a magazine story. The speech draft had referred to a \"vast wasteland of junk\" but Minow excised \"of junk\" so as not to offend his audience too deeply.'GILLIGAN'S ISLAND' BOATTelevision producer Sherwood Schwartz still did not like Minow's criticism and named the ill-fated boat in his low-brow sitcom \"Gilligan's Island\" the S.S. Minnow in a mock tribute that Minow said actually thrilled him.Minow's speech, coming at a time when television viewing was generally limited to three networks, challenged broadcasters to come up with \"excellence, not mediocrity.\"While many of his criticisms of formulaic sitcoms and offensive commercials still apply, in interviews in 2011 marking the 50th anniversary of his speech, Minow said television had improved - primarily because it offers so many options through public television, news shows and cable channels.",
        "Minow admitted to being a television junkie, saying he mostly watched sports and news with a special affinity for CBS's \"Sunday Morning\" show and PBS's \"NewsHour.\" His favorite scripted shows included \"The Mary Tyler Moore Show\" from the 1970s and more recent fare such as \"Downton Abbey\" and \"Mad Men.\"As FCC chief, Minow also was a powerful proponent of communication satellites, pushing federal programs and legislation that would lead to the network of satellites that now carry broadcasts, phone calls and data all over the planet.Minow, who was born Jan. 17, 1926, was a clerk at the U.S. Supreme Court and worked in Illinois Governor Adlai Stevenson's unsuccessful presidential campaigns in the 1950s before joining the 1960 campaign of John F. Kennedy, who chose him for the FCC job.Minow headed the FCC for two years and in 1965 became a partner at the Chicago law firm of Sidley Austin. It was at that firm in the summer of 1989 that Barack Obama, an intern, met future wife Michelle Robinson, who was a lawyer there. Minow was so impressed with the young Obama that he offered to help him in public endeavors and would become one of the earliest supporters of Obama's presidential aspirations.In 2016 Obama presented Newton a Presidential Medal of Freedom in a White House ceremony.",
        "Minow and his wife, Josephine, had three daughters who all became attorneys. (Writing and reporting by Bill Trott; Editing by Diane Craft and Lisa Shumaker)"
    ]
}