{
    "articleURL": "/wires/ap/article-12052691/Frankie-Muniz-Malcolm-Middle-racing.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - It's been a long time since Frankie Muniz was \"Malcolm in the Middle.\"",
        "These days, he's more like \"Malcolm in the Front.\"The multitalented actor-turned-race car driver is leading the standings in the ARCA Series, one of the lower rungs on the NASCAR feeder system, through the first three races in his first full season. His goal is to reach the Cup Series eventually, but the 37-year-old Muniz harbors no misconceptions about just how difficult it will be to climb that ladder.Especially given he's still trying to learn what all the switches do in his current car.\"I'm so focused on all that I need to learn right now in ARCA,\" said Muniz, who was eighth-fastest in practice Friday at Kansas Speedway, where the series will race Saturday. \"This is the fourth race of 20 this season. I thought I'd do OK; I didn't know I'd be in the points lead at this point. But I'm focused on continuing that and learning.\"Muniz has always been fascinated by racing. He saw some in Charlotte growing up and went to the Daytona 500, where he drove the pace car in 2001, the year Dale Earnhardt was killed in a last-lap wreck. And during his younger days, when he was starring as the titular character on the Fox sitcom \"Malcolm in the Middle,\" he dabbled in competitive racing.",
        "Muniz entered 14 races in 2006 in the Formula BMW USA series, and the following year, moved up to the Champ Car Atlantic Series. He continued racing until 2009, when a crash left him with injuries that led to him stepping away.He focused primarily on acting, though by that point \"Malcolm in the Middle\" had long finished its seven-year run on Fox and was fast becoming a cult classic, and began moonlighting as the drummer in the indie rock band Kingsfoil.Muniz's comeback, so to speak, began in late 2021 when he drove a late model at Kern County Raceway Park in Bakersfield, California. Next came an ARCA Series test at Daytona last year, and in January, Rette Jones racing announced that Muniz would be behind the wheel for the No. 30 Ford full-time this season.\"I love my past. I love everything I've done,\" Muniz said, \"but I don't remember ever saying I wanted to be an actor. I wanted to be a garbage man, honestly, and acting took over my life. This chance in racing was me saying: `What do I want to do? What do I want to accomplish in my life?´ And here I am. I chose this. And when I put my helmet on and leave pit land, as much as I don't know, I feel like I'm exactly where I'm supposed to be.\"",
        "Turns out that's at the front of the pack.While he's yet to win through three ARCA Series races, Muniz has been the model of consistency. He's the only driver to finish all 316 laps, and that's why he leads 18-year-old Jesse Love by the narrowest of margins in the points race.\"It´s a great achievement for Frankie to be leading in the ARCA Racing Series championship point standings as a Rette Jones Racing driver, but it is very early in the season,\" said the team's co-owner, Mark Rette. \"Still, Frankie is incredibly focused and he knows that if he just focuses on his craft behind the wheel, the points will follow.\"One thing Muniz has going for him is the support of Ford. The racing powerhouse recently had him at its world headquarters for some events, and his car this weekend is carrying the \"Built Ford Proud\" banner on it.\"Obviously that's an integral part of making those leaps,\" Muniz said, \"the fact that I'm in with an amazing manufacturer.\"That will only take Muniz so far, though. He also understands that showing enough ability to rise through the ranks is of the utmost importance, and he doesn't have a whole lot of time to do it. Muniz is basically getting his start in stock car racing at the same age that many drivers are beginning to think about what comes next.",
        "That's an added bit of pressure that many of his peers don't have.\"There's good and bad, obviously, with being my age,\" Muniz said. \"I've been through a lot in my life - a lot of good, a lot of bad. I have experienced some things, even racing in the past. I feel like I pushed hard in racing, but I always felt like I could have pushed harder, tried harder. I have this opportunity now here I get a second chance to do it the right way.\"___More AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}