{
    "articleURL": "/femail/article-12047911/My-daily-horoscope-5th-bring-star-sign-Oscar-Cainer-tells-all.html",
    "content": [
        "Here comes the Coronation Eclipse: a moment of potential breakthroughs. Eclipses are often considered to be bad omens for royalty, but this celestial event links to the Sun in Charles’s birth chart, so it could play into his hands positively. ",
        "For everyone (not just the royals), success depends on how much control we feel the need to exert. The skies are promoting faith and optimism. By showing kindness, progress can be made. Aries Mar 21 - Apr 20 Although we’re not supposed to look at life through rose-tinted spectacles, it’s what we all do. How else can we explain our odd choices? We’re all wearing invisible self-designed glasses. Which is why what looks rosy and exciting to one person looks pale and insignificant to someone else. This weekend, if you find yourself looking at something unacceptable, try adding an extra pink filter to your frames. It will make things easier to deal with, and you might find it changes your views. How will the Coronation Eclipse transform your life? There’s inspiring news in your latest forecast. Call 0906 751 5601.",
        "Taurus Apr 21 - May 21 The idea of spending a night under the stars seems romantic. What could be more evocative than watching the constellations and marvelling at the enormity of the cosmos? Yet, most of the time, we sleep surrounded by bricks and mortar, sheltered from the rain, wind and cold. We want to feel safe, especially when we’re asleep. Your ability to enjoy life doesn’t depend on the actions of those around you (or on your material circumstances). You have a warm and welcoming place to retreat to whenever you wish. It’s in your heart. ",
        "Let the power of the Coronation Eclipse inspire you. Call your four-minute forecast: 0906 751 5602.Gemini May 22 - June 22 Although there’s a difference between ‘acting without thinking’ and ‘thinking without acting’, it’s difficult to say which is better (or worse). There are times when we have to trust our instincts and let impulse take us where intellect won’t go. There are times, too, when it’s better to ruminate than to rush. Ideas that don’t lead to action can be better left in our imaginations. If something doesn’t work as planned this weekend, it’s because there’s something better in the offing. Maximise the energy available to you. The Coronation Eclipse can transform your world. Call 0906 751 5603.Cancer June 23 - July 23It’s hard to avoid nostalgia when looking back at the past. Our memories are selective: we forget the bad bits and struggles, and paint the rest with a golden hue. If you find yourself reminiscing this weekend, remember that you’re embellishing the good and overlooking the not-so-good. Which is anxiety-producing. It makes it look as if the future is an ocean of doubt dotted with islands of uncertainty. Yet you’ve sailed across such seas before. The Eclipse brings positive change. Just trust. The path ahead is right and good. ",
        "Use the energy of the Coronation Eclipse change your life. For your key to the future, call 0906 751 5604. Leo July 24 - Aug 23‘If it wasn’t for bad luck, I wouldn’t have no luck at all’ is a line from the blues song Born Under A Bad Sign. Since the lyrics don’t contain any astrological references, it seems unlikely that it refers to a specific sign of the zodiac. But I mention it because it’s a great example of how negative thinking can affect our lives. Under the influence of the Coronation Eclipse, you’re able to see how something that seemed negative is transforming. Think positive and watch how the weekend evolves and gives you reasons to sing! The Coronation Eclipse can change your life for the better. There’s valuable news when you call 0906 751 5605.",
        "Virgo Aug 24 - Sep 23 Picture yourself as a rocket waiting to be launched. The countdown has begun. If you’re feeling tense, it’s only because you’re aware of the enormity of what’s about to happen. But tension isn’t the same as fear. Anticipation only proves how much you want this. It’s a moment to relish. Even though you can’t predict how far you’ll get, take pride in knowing how hard you’ve worked to get to this position. The weekend brings a boost of energy. You can use it to make a significant move towards fulfilling a dream. This is an exceptional week. ",
        "The Coronation Eclipse brings potential for transformation. For good news, call 0906 751 5606.Libra Sep 24 - Oct 23 They say that two wrongs don’t make a right, but if something’s really right, no amount of wrongs will change it. And if something’s really wrong, a right can make it more palatable. And, since there’s one really right thing going on in your world, it’s cancelling out some negatives. The Eclipse highlights a positive development. It has been around for a while, but its effects are starting to materialise. By focusing on it, you’ll disempower a difficulty and right a wrong. Give yourself the best Coronation Eclipse present ever: four minutes of priceless insight and support. Call 0906 751 5607.Scorpio Oct 24 - Nov 22 You need a relaxing weekend. You’ve had more than your fair share of stress and strife. Just because you haven’t managed to achieve everything doesn’t mean you can’t take some time out. Life is more like a marathon than a sprint. If you know that, you stand an excellent chance of getting to the finish line you can afford to slow down. Actually, pacing yourself is essential. The Eclipse provides a delightful distraction. Enjoy. You can soon get back on track . . . and finish in style. ",
        "Wonderful opportunities arise as the Coronation Eclipse energises your life. For great news, call 0906 751 5608.Sagittarius Nov 23 - Dec 21 Will this weekend be tricky? Do you need to rally the troops? If you’re harbouring such fears, you need to jettison them before they infiltrate your fortifications and corrode your hope. Expecting the best will help good things find their way to you. Under the powerful Coronation Eclipse, the ‘invaders’ you’re worrying about will turn out to be generous supporters. It’s time to lower your defences. By offering a generous welcome you’ll create connections that bring joy. The Coronation Eclipse brings powerful positive change! There’s great news in your forecast. Call 0906 751 5609.Capricorn Dec 22 - Jan 20 We learn more from our so-called enemies than we do from our friends. Our critics challenge us to improve. When life just flows along it brings fewer opportunities to evolve. As a Capricorn you’re always prepared to roll up your metaphorical sleeves and get on with the tough stuff. And why should this weekend be any different? Well . . . the Coronation Eclipse is why. You’ve done more than enough. You deserve some time away from the stress and strain. And that’s exactly what you’ll get. Capture the transforming energy of the powerful Coronation Eclipse. Call your in-depth forecast: 0906 751 5610.",
        "Aquarius Jan 21 - Feb 19Our cosmos is so vast it defies understanding. We trust astronomers who say that some stars are 4,000 light years away, but that doesn’t mean we can wrap our heads around the facts. Sometimes, it’s by accepting that things are the way they are, and not trying to understand them, that we discover new ways of being in our world. Don’t focus on an abstract goal this weekend. It’s the journey that brings moments of joy. There are lots of those destined to come your way. The Coronation Eclipse brings potential for positive change! There’s great news in your forecast. Call 0906 751 5611.Pisces Feb 20 - Mar 20 Just because accidents are more likely to happen at home doesn’t mean we need to wear protective helmets around the house. It just confirms the obvious: that both troublesome and good things happen to us wherever we spend most time. Wherever you find yourself this weekend, be confident that good things are heading your way. Under the influence of the Coronation Eclipse, a series of positive developments are winging towards you. Your task is to stop being so defensive, and welcome them in. It’s the Coronation Eclipse week! Be guided to the future you’re dreaming of. For great news, call 0906 751 5612.Calls cost 80p per minute plus your phone company’s access charge. To report a phone line problem, call 0800 138 9789. Go to cainer.com and join the 5 Star Service for personalised messages, audio, video, discounts on full readings, and more! "
    ]
}