{
    "articleURL": "/tvshowbiz/article-12046935/Molly-Mae-Hague-totes-9k-Chanel-bag-teamed-700-Loewe-shirt-800-Prada-trainers.html",
    "content": [
        "She insisted last year that she no longer splashes the cash on 'really expensive clothes' following the £800k burglary at her former flat. ",
        "Yet Molly-Mae Hague proved she still had enough designer items to choose from as she stepped out in a very pricey ensemble for a business meeting on Thursday. The Love Island star, 23, was recently accused of trying to 'humble the working class' with her display of wealth but appeared to have moved on from the drama as she met with her agent in Manchester. The mother-of-one looked stylish in an oversized Loewe shirt with an embellished pocket that currently retails for £663. She teamed the garment with a pair of grey tapered trousers that skimmed over her £790 chunky nude Prada trainers with a thick white sole. ",
        "To complete the look the vlogger donned a pair of cat eye sunglasses and slipped a £8,530 classic Chanel handbag over her shoulder. While Molly-Mae looked comfortable in her pricey ensemble, she was recently divided her social media followers, who accused her of flaunting her wealth by posing in an airport terminal surrounded by her £4,000 designer luggage. Having just returned from a lavish family holiday in Dubai, the star cut a casual figure in a black T-shirt, matching leggings and an oversized blazer as she sat outside a Hermes boutique in a post shared on Sunday.  She styled her long blonde tresses pulled back in a claw clip leaving strands to frame her face as she leaned on her hand. ",
        "The reality star seemed less than impress in the picture as she sat next to her £2,200 Louis Vuitton suitcase and her matching £1,790 travel bag.Molly-Mae looked ready for her flight as she kept her AirPod Max headphones, which are worth over £500, around her neck. Referencing her surroundings in the accompanying caption, she wrote: '5 star airport shopping.'However the post, shared in the midst of a cost-of-living crisis, prompted an inevitably divided response from followers. ",
        "Replying to her latest update, one  quipped: 'If there ever was a caption to humble the working class.'Elsewhere a second quickly added: 'Thanks for reminding me to work harder,' while a third remarked: 'the caption is a little controversial ha…' Another simply added: 'Read the room.'  However others defended the influencer, with one fan writing: 'she isn't pictured with Hermes shopping bags though. She's saying 5* shopping and has a tiny paper bag from purchases... working class can walk round all shops at an airport too... people have a choice how they spend their hard earned money.' While another added: 'Stop taking offence ffs.' Last year, Molly revealed she would no longer be spending as much on luxury items after suffering a horrific break in at her former flat in Manchester. The influencer hosted a candid Q&amp;A via her YouTube channel as she shed light on the ordeal and her 'negative start to the year.'",
        "Wearing a £285 Alexander Wang turtle neck top, the blonde beauty responded to the question, 'Have your views on having nice things changed since the robbery?'She confessed: 'It's something I've been thinking about a lot recently. The answer to that is 100% yes.'In regards to the jewellery I used to buy, watches, nice bags, really expensive clothes and stuff, I think most definitely, definitely, the interest in that for me has just disappeared since the robbery. 'Why would I ever want to own something that could compromise mine and Tommy's safety? It is absolutely not worth it in my eyes.' "
    ]
}