{
    "articleURL": "/news/article-12043173/Donald-Trump-blasts-Meghan-Markle-disrespecting-Queen.html",
    "content": [
        "Donald Trump told Nigel Farage he had high hopes for the big day on SaturdayHe said he was a fan of King Charles as the new monarch 'loves the country' Donald Trump has blasted Meghan Markle over her treatment of the Queen, raging that she was 'very disrespectful' to Her Majesty.",
        "The former US President said he was 'surprised' Prince Harry was invited to his father's Coronation after the public falling out between the Sussexes and the rest of the Firm.Speaking to former UKIP leader Nigel Farage on GB News, Trump revealed he had high hopes for the big day on Saturday and gave King Charles his full backing saying the monarch 'loves the country'.The businessman and politician paid tribute to the late-Queen Elizabeth II, calling her 'incredible' and praising her for going through 'years and decades without controversy'.He also blasted Joe Biden for not attending the Coronation, calling him 'incompetent' and claiming the current US president would be 'sleeping' when the event took place.The 76-year-old had been pictured on his Scottish golf course yesterday ahead of filming for the interview with his friend and political ally.",
        "In a clip of the sit-down, which aired at 7pm on GB News tonight, Trump questioned the treatment of Her Majesty by Meghan.",
        "He said: 'I think she [Meghan] has been very disrespectful to the Queen. How can you be so disrespectful to the Queen?'She [the Queen] was incredible, for decades and decades she never made a mistake. I cannot think of a mistake she made, she was never controversial.'",
        "He added: 'You cannot be disrespectful to her and I think Meghan was very disrespectful to her, very disrespectful.'He went on to say he agreed with Farage when he said the Queen was 'the most popular human being in the world'.  In a clip released ahead of the interview, Trump also said he had high hopes for the Coronation itself and the reign of King Charles. He said: 'I think it's going to be a great day, I think they will do a great job and he [Charles] loves the country. I got to know him [Charles] quite well and he loves the country, really loves the country and he loved his mother. 'That's why I thought she was treated so disrespectfully by Meghan and [there was] just no reason to do that. 'I was actually surprised that Harry was invited, to be honest.'It's not the first time Trump has lashed out at Prince Harry and his wife - in 2021 he said the Duke had been 'used horribly' by Meghan and said he wasn't a fan of the former actress.He said: 'I'm not a fan of hers. I wasn't from day one. I think Harry has been used horribly and I think some day he will regret it. I think Harry's been used and been used terribly. I think it's ruined his relationship with his family, and it hurts the Queen.'",
        "Speaking of the duchess, he added: 'I think she's been very disrespectful to the Queen, who's such a great woman, such a great person, a historic person. I think she's very disrespectful to the Royal Family and most importantly to the Queen.'",
        "In the interview Trump also blasted current US President Joe Biden for not attending the Coronation - he will be represented by his wife Jill, despite other world leaders such as French President Emmanuel Macron being there.Trump suggested his 80-year-old political rival is not up to it 'physically', and said if he was president he would have gone.He said: 'I think that it's hard for him to do it physically. I think, getting over here for him.'He's got a lot of things going and a lot of strange things happen. But certainly he should be here as a representative of our country. I was surprised when I heard that he wasn't coming. 'You would think he would be here, he'll be in Delaware where he spends a lot of time, he spent a lot of time there during the election. 'So I don't know, but I was very surprised to see I think it's very disrespectful for him not to be.'He added: 'That man is incompetent, and it's a shame. ",
        "'He can't even come to your Coronation as a country, and your Coronation's a big event. 'When you have somebody that's going to be sleeping instead of coming to the coronation as president of the United States, I think it's a bad thing. 'The reason is he's sleeping. It shouldn't happen. It’s disrespectful. When asked by Farage whether he would have attended if he was president, Trump said: 'I would.'He added: 'I think it's a very important event. I think it's a great thing. A lot of people talk about the monarchy should you have it, should you not, I think it's a fantastic thing. It holds your country together largely.'Last night Trump and Farage were pictured smiling together after the ex-president met up with the former UKIP leader for today's interview.",
        "Trump - wearing his trademark red 'Make America Great Again' cap - then teed-off again at his Turnberry golf course in South Ayrshire today as his short trip to Scotland nears to an end.Trump, dressed in his golfing attire, laughed and joked with a suited Farage ahead of the GB News interview this evening where the two are set to discuss 'court cases in America', the Coronation, and the state of Scottish politics.Trump's golfing trip across the pond to Turnberry came as he opened a new course on the Scottish east coast which he named after his late mother. It came as Scottish lawmakers are also revisiting a probe into how he was able to purchase the two resorts.",
        "Back home, Trump is also facing mounting legal troubles after being indicted by a Manhattan district court for his alleged role in the payment of 'hush money' to a porn star during the 2016 presidential election, as well as an ongoing New York City rape case.Trump and Farage were all smiles as the two reunited on the picturesque west coast of Scotland.The two, who appear to have struck up a tight friendship through their political support for one another, had a brief discussion, which could not be heard, before opening up to the rest of the room.'Does everyone know Nigel?' Trump asked, addressing what seemed to be a buzzing packed out chandelier-lit hall.'I'm doing a little minor interview tomorrow,' the embattled ex-president joked - suggesting he may use the opportunity to divulge his thoughts on several key issues amid his run for the Republican nomination in 2024.A photographer then steps in and gestures as if to ask if he could take an image of the two men together.Farage has been a very vocal supporter of the former president, appearing several times at his rallies and defending many of the controversies that have surrounded the businessman-turned-politician."
    ]
}