{
    "articleURL": "/femail/article-12053643/Repair-Shop-handyman-Jay-Blades-looks-smart-Coronation.html",
    "content": [
        "The handyman met the King when the royal appeared on the BBC programmeREAD MORE:  King Charles Coronation LIVE - latest updates How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk The coronation guest list has thrown up  some surprises - with some of the expected attendees missing, and some unexpected faces making the cut.",
        "One of the guests whose invitation surprised some - and delighted many - is Jay Blades.The handyman, who is based in Ironbridge, Shropshire, initially met Charles when the royal appeared on BBC programme Repair Shop, which Jay presents. He arrived at the coronation this morning in a cream coloured waistcoat, a blue shirt, a navy tie, a black blazer and matching smart trousers. Jay was among the hundreds of guests who had to be seated inside Westminster Abbey by 9am. ",
        "Stephen Fry, Lionel Richie, Nick Cave, and Dynamo were also among the guests arriving today.The slimmed down ceremony will see 2,000 guests witness Charles and Camilla be crowned in-person while the rest of the world watches via broadcast. The presenter and the team visited Dumfries House in Scotland for a one-off episode to mark the BBC's centenary filmed when Charles was still the Prince of Wales and initially aired back in October. In The Repair Shop: A Royal Visit, Charles needed help with an 18th-century bracket clock and a piece made for Queen Victoria's Diamond Jubilee by British ceramics maker Wemyss Ware. He said the damaged 19th century ceramic piece fell over when someone was opening a window - 'they didn't own up', he joked. People at the time took to social media to speak about how much they loved their bromance.  ",
        "Jay revealed on Loose Women the king had even invited him round for a sleepover. ",
        "Speaking on the ITV show, Jay explained: 'I had no opinion on him, but went to meet him and we just hit it off and spoke about craft. 'The funny thing is I was suppose to go up there because I'm an ambassador for his charity and he had invited me three times to go up there, have a look around, spend the night and have a sleepover at the then Prince's house.'I went there on the fourth attempt after turning him down three times and I said to the Mrs I said I best go, or I'll get kicked out of the country.'"
    ]
}