{
    "articleURL": "/wires/reuters/article-12047037/Gold-firms-banking-woes-sustain-stellar-run.html",
    "content": [
        "Gold about $27 below all-time high",
        "Weekly jobless claims up 242,000 vs est of 240,000Fed Funds target rate stands in 5%-5.25% range(Updates prices)By Seher DareenMay 4 (Reuters) - Gold made another run toward record highs on Thursday as U.S. banking concerns accelerated a flight to the safe-haven asset and sustained its stellar rally driven by bets for a pause in U.S. rate hikes.Spot gold was up 0.3% at $2,045.79 per ounce by 1:40 p.m. EDT (1740 GMT) after climbing earlier to $2,072.19, shy of a record high of $2,072.49.U.S. gold futures settled 0.9% higher at $2,055.70.The melt-up in prices overnight associated with the banking stress revealed that traders are willing to deploy some of their dry powder, said Daniel Ghali, commodity strategist at TD Securities.And although trend-following commodity trading advisors seem to be at their maximum long-position sizes, \"discretionary traders still have a horde of dry powder to deploy, and this is the cohort we think is engaging in gold today\", Ghali added.Wall Street's main indexes fell after PacWest's move to explore strategic options deepened concerns about the health of regional banks, countering optimism from the Federal Reserve signalling a likely pause in interest rate hikes.\"The same flight to safety buying that pushed us over $2,000 is still in this market,\" said Bob Haberkorn, senior market strategist at RJO Futures.",
        "Economic uncertainty and lower rates boost demand for zero-yield bullion.The Fed Funds target rate stands in the 5%-5.25% range, with markets expecting rate cuts in the second half of the year.\"Inflation's going to remain stubbornly sticky for some time and is not necessarily going to allow them (the Fed) to ease rates any time soon,\" said David Meger, director of metals trading at High Ridge Futures.In physical markets, lofty prices have tarnished gold demand in top Asian retail hubs.Silver rose 1.4% to $25.94 per ounce, platinum dropped 0.9% to $1,040.58, while palladium gained 2.5% to $1,458.34.(Reporting by Seher Dareen, Deep Vakil and Arpan Varghese in Bengaluru; Editing by Kirsten Donovan, Shilpi Majumdar and Maju Samuel)"
    ]
}