{
    "articleURL": "/wires/afp/article-12052629/UN-reaffirms-commitment-stay-Afghanistan.html",
    "content": [
        "The UN reaffirmed its \"commitment to stay\" in Afghanistan on Friday, in a review assessing its operations in the country in light of the Taliban banning women from working for the world body.",
        "The United Nations announced on April 4 that the Taliban had barred Afghan women from employment in UN offices countrywide, a prohibition that had previously only affected NGOs but spared the UN.The UN mission in Afghanistan, UNAMA, subsequently launched the review, and concluded Friday that it was committed \"to stay and deliver on behalf of the men, women and children of Afghanistan,\" Farhan Haq, a spokesman for the secretary-general, told reporters.It also launched an appeal \"to our donors to keep funding this assistance people need,\" he said.In a statement issued from Kabul, UNAMA reiterated its condemnation of the ban, which \"seriously undermines our work, including our ability to reach all people in need.\"However \"we cannot disengage despite the challenges,\" it said, noting that it had conducted \"extensive consultations with multiple Afghan stakeholders, including civil society and women's groups, member states and donors.\"\"We continue our focused, principled and constructive engagement with all possible levels of the Taliban de facto authorities to obtain a reversal of this ban and ensure the safety of all UN and aid personnel,\" it said.UN entities on the ground in Afghanistan will \"continue to discuss appropriate working modalities,\" Haq said, adding that \"humanitarian operations continue to be undertaken.\"Since the ban, UNAMA has asked all of its Afghan staff, both men and women, to work from home, but other agencies in the country \"have had different ways of handling the situation,\" he noted.",
        "Since ousting a foreign-backed government in 2021, the Taliban authorities have imposed an austere version of sharia law that the United Nations has labelled \"gender-based apartheid.\""
    ]
}