{
    "articleURL": "/wires/reuters/article-12044677/Tigers-drub-Mets-8-1-complete-sweep-twin-bill.html",
    "content": [
        "Michael Lorenzen pitched seven solid innings, Matt Vierling hit a two-run homer and the host Detroit Tigers completed a doubleheader sweep by pounding the New York Mets 8-1 on Wednesday.",
        "Lorenzen (1-1), who signed with Detroit as a free agent in the offseason, earned his first win this season by holding the Mets to one run and four hits. He entered the game with a 7.07 ERA.Eric Haase, who had five RBIs as the Tigers took the first game 6-5, hit a solo homer in the nightcap and scored two runs. Andy Ibanez had three hits and drove in two runs, while Riley Greene and Spencer Torkelson each added two hits, a run and an RBI.Mets starter Max Scherzer (2-2) was battered for six runs, including two homers, and eight hits in 3 1/3 innings. Scherzer was making his first start since serving a 10-game suspension for having a foreign substance on his pitching hand in his last start.Dan Vogelbach drove in the lone Mets run with a double. New York has lost eight of its last 10 games.The doubleheader was scheduled after Tuesday's game was postponed due to inclement weather.Detroit took a 2-0 lead in the first.Zach McKinstry walked, moved to second on Greene's infield hit and advanced to third on a long fly ball. Nick Maton's sacrifice fly brought McKinstry home. Torkelson then smashed a double to left-center to knock in Greene.Haase made it 3-0 the next inning when he hit a hanging slider over the left field wall.",
        "The Mets got on the board in the fourth when Pete Alonso walked and Vogelbach doubled to right.Detroit made it 6-1 in the bottom of the inning.Akil Baddoo led off with a single and Vierling followed with his two-run blast over the left-center wall. Ibanez and McKinsty had one-out singles to end Scherzer's night. Greene greeted Zach Muckenhirn with an RBI single.The Tigers increased their lead to 8-1 in the eighth when Torkelson singled, Haase doubled and Ibanez slapped a two-out, two-run single.--Field Level Media"
    ]
}