{
    "articleURL": "/wires/reuters/article-12060585/Republicans-ask-watchdog-assess-US-oil-reserve-management.html",
    "content": [
        "WASHINGTON, May 8 (Reuters) - Two Republicans on Monday asked a congressional watchdog to assess the Biden administration's management of the Strategic Petroleum Reserve and audit its modernization program, saying sales from the SPR have undermined U.S. energy security.",
        "Senator John Barrasso, ranking member of the Senate energy committee, and Representative Cathy McMorris Rodgers, head of the House energy committee, asked the Government Accountability Office (GAO) to evaluate the Department of Energy's management of the Strategic Petroleum Reserve after the administration oversaw sales of about 250 million barrels from the facility last year.The sales have pushed levels of the reserve to the lowest since 1983.\"DOE's mismanagement of the SPR has undermined America´s energy security, leaving the nation more vulnerable to energy supply disruptions, and increasing the ability for OPEC and Russia to use energy as a geopolitical weapon,\" the lawmakers wrote to Gene Dodaro, the U.S. comptroller general and head of the GAO.The DOE did not immediately respond to a request for comment.Over about six months last year, the Biden administration conducted a record sale of 180 million barrels of oil to combat high gasoline prices after Russia's invasion of Ukraine.The Republican lawmakers said they were concerned that the SPR sales may have caused structural damage to its pipelines and caverns, compromising its ability to meet its energy security mission in the event of a supply disruption.The Biden administration wrote to lawmakers last month, saying the sales did not damage the SPR. The national lab that monitors the sites even said the record drawdown may extend the longevity of the underground storage caverns.",
        "Energy Secretary Jennifer Granholm has said purchases to replenish the SPR could begin late this year after life extension work is complete at two of the reserves' four sites on the coasts of Louisiana and Texas and after a congressionally mandated sale.The lawmakers said they were concerned about delays and cost overruns in the SPR modernization program authorized by Congress in 2015.(Reporting by Timothy Gardner Editing by Bill Berkrot)"
    ]
}