{
    "articleURL": "/tvshowbiz/article-12042453/Chris-Pratt-holds-Guardians-Galaxy-Volume-3-action-figure.html",
    "content": [
        "Chris Pratt was spotted outside of Good Morning America's studio in New York City on Wednesday.",
        "The 43-year-old performer flashed a peace sign as he took a short walk and showed off an action figure of his longtime character Peter Quill, also known as Star-Lord, whom he plays in the Guardians of the Galaxy franchise.The actor, who spoke about how he was initially turned down for the superhero role, used his time on the program to promote the release of the upcoming third installment in the superhero franchise.Pratt began the interview by revealing that his son Jack, aged ten, was present at the movie's premiere and instantly loved the flick. The actor stated: 'He loved it. He really loved it, and he's a tough critic. He's not just effusive because dad's in a movie, if he doesn't like it, he'll tell me.'",
        "The former Parks and Recreation cast member also expressed that his wife, Katherine Schwarzenegger, told him after the premiere that Jack had been greatly distressed when Quill was facing dangerous situations. 'Katherine said that there's a couple moments where...my character's in dire straits and he was watching and eating popcorn and then looking over at me and looking up at the screen and looking back at me,' he recalled.  Pratt was then asked about how he would introduce his daughters Lyla and Eloise, aged two and eleven months, to his filmography. ",
        "'They're a little young now...I'll probably start off with the really heavy stuff,' he stated.The Jurassic World star shares Jack with his former wife, Anna Faris, and his daughters were both born to Schwarzenegger, whom he married in 2019.The actor went on to discuss the prospect of portraying Star-Lord in the future.'It's Marvel, so there's all kinds of things can happen, you never know. They've got various timelines and alternate universes and they can always orchestrate a way to bring somebody back,' he said.The performer did state, however, as longtime director James Gunn will not be working on any further Guardians movies, 'it's tough to imagine doing it again.'",
        "Pratt also remarked that he took home several keepsakes from the set of the third Guardians movie.He recalled: 'I took it all. I got past the point where it would be more expensive for them to fire me than just let me take everything. That's a dangerous position to put a man in.'The first Guardians of the Galaxy movie was previously released in 2014 and featured performances from Zoe Saldana, Dave Bautista and Bradley Cooper.All of the movie's principal cast members returned for the feature's sequel, which premiered in 2017.The Guardians went on to make appearances in both Avengers: Infinity War and Avengers: Endgame.",
        "Guardians of the Galaxy Volume Three is currently set to be released to the public on Friday. The actor also briefly spoke about working on The Super Mario Bros. Movie, in which he voiced the titular plumber, and remarked that he was grateful to have been offered the role.'This whole thing's a dream come true. Being the voice of Mario, I loved it, absolutely. I grew up playing Super Mario Bros. as a kid. It was the soundtrack of my youth, playing Nintendo,' he said.",
        "Pratt shared several images to his Instagram Story prior to his appearance on Good Morning America. The performer struck a heroic pose while standing in front of one of the program's main displays.The actor also showed off his action figure in the snaps, and he expressed that his private room was also to be shared with his superhero persona.He went on to add a text graphic to one of his posts that read: 'Did ya really think he wasn't gonna go everywhere with me?'"
    ]
}