{
    "articleURL": "/tvshowbiz/article-12048995/Julianne-Hough-exudes-glamour-attends-New-York-City-Ballet-Spring-Gala.html",
    "content": [
        "Julianne Hough was every inch the golden girl while attending the New York City Ballet Spring Gala at the David H. Koch Theater on Thursday.",
        "The Dancing with the Stars beauty, 34, dazzled in a strapless form-fitting metallic gold gown, which she paired with a matching clutch.The Utah-born star wore her dark blonde tresses parted on the side and cascading down in light curls. Julianne - who recently divulged why she initially turned down DWTS - accessorized her show stopping look with a pair of dangling earrings and a golden bangle.As for glam, she opted for a soft bronze eyeshadow, a touch of mascara, and nude lipstick. ",
        "Also on the red carpet were a number of the dancers.Hannah Corbin opted for a plunging black romper and a shimmering black clutch. The beauty paired her look with brown strappy heels.She wore her brunette tresses in voluminous waves cascading down her shoulders.Ava Sautter showed off her incredible dancer's physique in a bustier style black dress with a sizzling thigh-high slit.The Ballerina paired the look with nude heels and wore her brunette strands halfway pinned back for the occasion.Gilbert Bolden III - who is part of the New York City Ballet’s corps de ballet - wore a very unique plunging white romper with elbow-high fingerless gloves.The San Diego-born dancer paired the outfit with a black hat featuring a veil that shielded half of his face.",
        "Olivia Boisson looked incredible in an off-shoulder vivid orange gown with a midriff cutout. Georgina Pazcoguin stunned in a colorful gown with a long train, and wore her tresses in a high ponytail. Victoria Berk, Felicity Strauss and Meredith Strauss made a stylish trio in stunning Spring friendly gowns. Ballet legend Mikhail Baryshnikov, 75, also was in attendance along with his wife Lisa Rinehart, who is a former dancer with American Ballet Theatre. ",
        "Mikhail looked dapper in a black suit, while Lisa added a spring look in a red floral print dress.The Spring Gala was sponsored by Porsche and Chopard, as well as The Macallan.Guests were treated to a cocktail reception followed by the performance and later dinner.The gala program featured new works by choreographer and director Christopher Wheeldon and Canadian choreographer Alysa Pires and raised funds for the organization. "
    ]
}