{
    "articleURL": "/wires/ap/article-12060799/Chiefs-rookies-started-trying-live-expectations.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The rookie class that Chiefs general manager Brett Veach and coach Andy Reid brought to Kansas City last season set the bar mighty high for each group of first-year players that is expected to follow them.",
        "The Chiefs had 10 draft picks and all of them appeared in at least one game. Many of them, such as first-round picks Trent McDuffie and George Karlaftis, became starters or regulars by the midpoint of the season. And others, such as seventh-round pick Isiah Pacheco, played important roles in the Chiefs beating the Philadelphia Eagles in the Super Bowl.\"The job that (Veach) did with his guys was second to none,\" Reid acknowledged.The first shot at following up that performance began in earnest over the weekend, when the Chiefs brought in their latest draft class along with a group of undrafted free agents and select players for a three-day minicamp. Little could be gleaned from a series of workouts in shorts, particularly given the brutally hot conditions not unlike those that will greet the Chiefs at training camp, but it was nonetheless the first step for many of them toward an NFL career.Felix Anudike-Uzomah, their first-round pick from Kansas State, was somewhat limited in what he could do after having surgery on his thumb before the draft. But even Anudike-Uzomah had a helmet on for the final workout Monday.Asked what he wanted to see from the newcomers, whether it be effort or ability or something else, Reid replied: \"All of the above.\"",
        "\"Getting into the huddle on the offensive side to these long play calls to the amount of work you're going to end up getting,\" Reid continued, \"and just the magnitude of it. You're going against real good people, the best player you've played against, and every day you're doing it. You have to up your game a bunch.\"The Chiefs went into last season banking that their rookie class would be able to fill some significant holes.Karlaftis wound up having six sacks and carving out a regular role. McDuffie was the ring leader for a group of first-year defensive backs that included Jaylen Watson and Joshua Williams, all of whom were active in the Super Bowl. Second-round pick Skyy Moore had a crucial punt return that helped Kansas City set up the go-ahead field goal against the Eagles, and Pacheco took over the lead running back duties from the injured Clyde Edwards-Helaire and never let them go.As for this year's rookie class?The Chiefs cut Frank Clark to save salary cap space, and Carlos Dunlap hit free agency, leaving Anudike-Uzomah to fill a big role in the pass rush. The local defender played down the road at Kansas State, where he was the Big 12 defensive player of the year.",
        "\"To start off now, I just want to learn the playbook and I just want to be present and learn from the guys that already won a Super Bowl,\" he said. \"And if I have the opportunity to play or start, anything like that, I´ll be gladly appreciative. But as of right now, I want to work on learning the playbook and work on getting tips from the older guys.\"Rashee Rice, their second-round pick, will be counted on to catch some of the passes that went to JuJu Smith-Schuster and Mecole Hardman last season. The Chiefs still have Marquez Valdes-Scantling, Kadarius Toney and Moore to go with newcomer Richie James, but there are still plenty of balls available for the rookie wide receiver.\"I know I´m in for a lot, to be honest,\" Rice said. \"I´m ready for it.\"The rest of the draft class could also seeing playing time early. Third-round pick Wanya Morris could push for playing time at offensive tackle, fourth-rounder Chamarri Conner could get reps in the secondary and on special teams, while linebacker B.J. Thompson, defensive tackle Keondre Coburn and cornerback Nic Jones will have a chance to earn some playing time.They took their first steps toward it this past weekend.Now, they have a few weeks of voluntary workouts ahead of them before the Chiefs congregate for a mandatory minicamp the second week of June.",
        "\"I just want to show that I can belong,\" Jones said. \"I feel like this is step one to showing that I belong, and I really just want to take it one moment, one day at a time, so I feel like every day I´m here, that´s another step toward showing I belong.\"___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}