{
    "articleURL": "/wires/ap/article-12048251/Ex-governor-candidate-pleads-guilty-child-porn-charges.html",
    "content": [
        "ELLSWORTH, Maine (AP) - A wealthy attorney who made a name for himself in the nation´s capital before returning home to Maine to run for governor vowed to seek redemption Thursday after he pleaded guilty to possession of thousands of images of child sexual abuse.",
        "Eliot Cutler, who came close to being elected governor in 2010, sat stone-faced at times in court, but his voice cracked with emotion when he addressed the judge. He apologized first to the victimized children and their families.\"My behavior helped to support an industry built upon their abuse, and I hope with all my heart that they can find healing and dignity,\" Cutler said.The plea agreement, accepted by the judge, calls for Cutler to serve nine months in jail for four counts of possessing sexually explicit material of a child under 12.It marked a remarkable fall for a man who once served as an aide to the late Sen. Edmund Muskie, as the top energy and environmental adviser to then-President Jimmy Carter, and launched a powerful environmental law firm in Washington, D.C.His attorney, Walter McKee, said all of Cutler´s life achievements will now be nullified in many people´s opinions because of his possession of so many images of children being hurt - a punishment that goes beyond the jail term.",
        "The 76-year-old Cutler, meanwhile, made no excuses for his addiction and said he would devote his remaining years to redemption.He told the judge that he had opportunities to reach out for help but neglected to do so and was \"embarrassed, ashamed, and deeply, deeply sorry\" for his actions. \"I failed to meet my obligations to myself, to my family, to my friends and to civilized society,\" he added.",
        "Afterward, Hancock County District Attorney Robert Granger acknowledged many people outraged by Cutler's actions will be unhappy with the sentence, but he said the penalty falls in line with similar cases over the past decade.\"There´s a lot of commentary from folks in the public that are enraged by the conduct. But unfortunately, we just can´t jump to a maximum sentence in these types of situations,\" Granger told reporters afterward.Law enforcement officials said they found thousands of images of children under 12 on Cutler's electronic devices, and his lawyer said Cutler acknowledged downloading hundreds of images at a time of children being sexually assaulted.After his arrest, Cutler spent some time in a residential treatment center for sex offenders, and his attorney said Cutler never engaged in inappropriate conduct with children. His attorney said the likelihood of recidivism was \"virtually nil.\"But advocates for child sexual abuse victims were having none of any attempt to downplay Cutler's crimes.Paul Kendrick, a critic of the Roman Catholic Church during clergy abuse scandal, said Cutler's actions supported sexual violence against children. \"The otherwise healthy lives of victims of child pornography are wrecked forever,\" he said.Cutler used his personal wealth to bankroll two campaigns for governor as an independent. He narrowly lost - by less than 2 percentage points - to Republican Paul LePage in 2010 and lost again by a much larger margin in 2014.",
        "In 2021, Cutler sold his oceanfront mansion in Cape Elizabeth for $7.55 million to a nephew of former President George H.W. Bush. After his arrest, he sold another home that he owned in Portland, Maine´s largest city.Cutler was freed after his arrest last year at his waterfront home in Brooklin, a coastal community 130 miles (210 kilometers) from Portland.The terms of probation prevent Cutler from possessing sexually explicit materials, require his online activities to be monitored and limit his ability to be around children. He also must register as a sexual offender for life.Judge Robert Murray said he is hopeful that something good could still come from the shame that has accompanied Cutler´s fall from grace.\"The good which comes from this shame depends entirely upon you and how you respond. You´ve alluded to that in your remarks. I can´t measure your sincerity in that regard. That will only be proven with the passage of time,\" Murray said.___Follow David Sharp on Twitter @David_Sharp_AP"
    ]
}