{
    "articleURL": "/tvshowbiz/article-12046329/GBBOs-Laura-Adlington-goes-topless-SLAM-fancy-spas-excluding-plus-sized-guests.html",
    "content": [
        "Great British Bake Off star Laura Adlington hit out at 'fancy spas' for failing to provide for plus-size guests by using 'one-size' robes. ",
        "Taking to Instagram on Wednesday, the star, who was a runner-up on the 2020 series of the Channel 4 show, posed topless in an ill-fitting robe which failed to close over her chest while adding an impassioned caption. She wrote: 'Dear fancy spas... Bigger people want to enjoy treatments too. Please make your robes inclusive. It really ruins the experience for us when they don't fit.' Alison Hammond responded to the post writing: 'So true I take my own now however I did go to @champneysspas and they gave me a 3 XL . I felt so happy'. Laura has been candid about her weight and body image and revealed last year that she had been ordered to lose 14st by doctors to be able to embark on IVF. ",
        "On Wednesday, Laura made the candid point about the lack of inclusivity at spas and showed how she was struggling to cover up. She added a caption on the snap reading: 'When the label says ‘One size fits all’ #plussize #plussizeproblems #selflove #bodyconfidence'. After Alison made her point, another supportive follower detailed the same issues in hospital, writing: 'Can you add hospital gowns too Laura please? I was so embarrassed recently when my gown didn’t meet at the back x'.Extending her sympathies, Laura replied: 'Oh no! I didn’t know they came up small as well. So sorry you had to experience that xxx'. ",
        "Last year, Laura revealed she was told she would have to lose 14st to become pregnant and has now decided she will not have children.She tried to conceive for three years with her husband Matt before doctors said her only chance was to try IVF and she would have to lose weight first to qualify.Speaking to Fabulous magazine, she said: 'Unless you've gone through infertility and that heartache of really wanting it and it not happening . . . it's the hardest thing I've ever gone through.'",
        "Laura also said she struggled with her mental health during this period and not being able to conceive was made worse by many of her friends welcoming babies.  She told how she had always wanted to be a mother and thought, 'what's the point?' if she couldn't have a child.She said: 'I've never thought, \"I want to take my own life\", but I definitely have had thoughts that I didn't want to be here any more. And I have phoned Samaritans on a few occasions and really benefitted from it.'Laura said she tried to lose weight after speaking to her doctors and even considered bariatric surgery before deciding it wasn't for her."
    ]
}