{
    "articleURL": "/wires/ap/article-12048615/Pistons-ex-exec-Murphy-named-sex-harassment-lawsuit.html",
    "content": [
        "DETROIT (AP) - A female former employee of the Detroit Pistons has filed a sexual harassment lawsuit against the team and its now-fired assistant general manager.",
        "The Pistons announced Thursday that Rob Murphy \"no longer works for the Detroit Pistons or Motor City Cruise, in any capacity.\"\"Mr. Murphy was recently terminated for violation of company policy and the terms of his employment agreement,\" the team said in a statement. \"The facts that gave rise to his termination surfaced during a review, assisted by a national law firm, of allegations made by a former employee.\"The team said Murphy was placed on leave immediately after the allegations surfaced and did not return to the workplace before his termination.The lawsuit was filed Thursday in Wayne County Circuit Court in Detroit. It alleges that after Murphy persuaded the woman to take an entry-level position in 2021, he became her supervisor. She worked as his executive assistant.Murphy made sexual comments about her body, repeatedly pressured her to engage in a sexual relationship with him, groped her buttocks and breasts and promised professional and personal advancement if she acquiesced to his demands, according to the lawsuit.She \"consistently and unequivocally rejected Murphy´s sexual advances, employing tactics to discourage him and avoid future harassment,\" the lawsuit said, adding that Murphy groomed her, \"periodically apologizing for his improper conduct and resuming the role of mentor and professional adviser, sometimes for weeks at a time.\"",
        "The woman, 32, left the Pistons in June 2022.The lawsuit filed by Pitt McGehee Palmer Bonanni &amp; Rivers PC is seeking an order that awards the woman economic and emotional damages, as well interest, costs and expenses.The Pistons said they would have no further details on Murphy's firing because it was a personnel matter.The Associated Press was attempting Thursday to reach Murphy for comment.Murphy was hired by the Pistons in 2021 as senior director of player personnel. He was promoted to assistant general manager and president of the Motor City Cruise, the Pistons' G League-affiliate.Murphy previously was the men´s head basketball coach at Eastern Michigan University. He also was an assistant coach at Syracuse and Kent State.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}