{
    "articleURL": "/health/article-12043401/Dangers-horse-riding-revealed-death-Venice-Florida-teen.html",
    "content": [
        " A 15-year-old girl from Florida died last week after her horse fell on top of her Recent research suggests that horseback riding has the greatest risk of injury Common horseback riding injuries are of the head, neck, chest, and anklesWhen you think of dangerous sports, you may picture skydiving, mountain climbing, or off-road racing. ",
        "Even football has made headlines in recent years for causing injuries such as traumatic brain injuries.   However, research suggests that horseback riding could be among America's most dangerous sports, resulting in at least 100 deaths per year - and by some estimates, as many as 700.  The danger was highlighted this month when a teen horseback rider from Florida died due to her horse tripping and falling on top of her. Hannah Serfass, 15, was competing in an event in Venice, Florida, when the accident occurred. The 12-year-old horse, named Quaxx, tripped and suffered a rotational fall. ",
        "Following Ms Serfass' death, the United States Equestrian Federation (USEF) said it 'takes every accident very seriously and will be reviewing the accident thoroughly to learn what we can do to minimize risk and increase safety in equestrian sport.' A 2021 study from researchers at the University of Texas Rio Grande Valley (UTRGV) concluded that riding a horse was the most dangerous sport in America. 'The risk of hospital admission from equestrian injuries is higher than football, motor vehicle racing, and skiing,' wrote the authors of the paper, which was published in the journal Trauma Surgery &amp; Acute Care Open. A 2014 report from the US Consumer and Product Safety Commission found that the rate of hospitalization for horse riding injuries was 16.6 percent higher than the next activity- rising all-terrain vehicles (ATVs) or motorcycles. ",
        "Football, long considered highly dangerous due to the high percentage of professional players found to have had traumatic brain injuries, doesn't even measure up.A 2021 survey by the National Center for Catastrophic Sport Injury Research found an average of 20 deaths among football players of all levels that season. Only four were directly related to injuries sustained on the field. ",
        "Additionally, a study from the National Athletic Trainers' Association looked at deaths among middle school basketball players between 2007 and 2015. The researchers found 11 deaths in 2015 and an average of five per year overall. Horseback riding has also been shown to cause severe damage. Last December, eight-year-old Stefan Keryan from Denver was seriously injured after he fell off his horse and was dragged across pavement for two miles. He suffered third-degree burns, a skull fracture, and a bruised brain.'I heard yelling and I looked over and as [the horse was] running past, I see that the saddle is flipped and that my son is being dragged by his foot,' Stefan's mother. Heidi Keryan, told Good Morning America. 'My older daughter and I started yelling and screaming and running as fast as we could to get to him but that horse was really fast.'",
        "Though it's believed the boy survived his injuries, he needed intense medical intervention. ",
        "The UTRGV researchers looked at data from the National Trauma Data Bank, the country's largest database of trauma-related medical information. They found that between 2007 to 2016, 45,671 patients visited a trauma center with injuries from horseback riding.About 88 percent of these patients in the database who went to the hospital had injuries serious enough for them to be admitted. Chest injuries were most commonly reported, followed by injuries to the head, arms, and legs. The researchers also said that nearly 75 percent of deaths were from head or neck injuries. Injuries are prevalent in the equestrian community. For example, a 2021 study from Ohio State University found that 81 percent of horse riders had experience an injury at some point in their riding career. About 21 percent of those participants had suffered a serious injury. The researchers concluded that of all sports in the US, equestrian sports are the most common cause of sports-related traumatic brain injury in adults.Additionally, the National Electronic Injury Surveillance System (NEISS) estimates that more than 48,000 people were treated in the hospital emergency room for horseback riding injuries in 2017.Some of the most common injuries sustained in horseback riding are of the head, ankles, chest, and wrists.A 2019 study in the journal Sports Medicine found that 70 percent of reported equestrian falls caused a head injury. The researchers also noted that wearing a properly fitting helmet could lower the chance of serious injuries, such as skull fractures. ",
        "A 2018 study from the journal Cogent Food &amp; Agriculture found that the number one cause of death is from riders falling off their horses. This accounted for 83.4 percent of incidents. The American Academy of Orthopaedic Surgeons recommends that all riders wear appropriate helmets and properly fitting boots to reduce the risk of injury. The organization also cautions riders to try rolling to the side if they feel themselves falling off the horse. "
    ]
}