{
    "articleURL": "/wires/aap/article-12045001/Carlton-ready-ante-bumper-Lions-clash.html",
    "content": [
        "Coach Michael Voss has urged Carlton to replicate the intensity of their 108-point drubbing of West Coast when they face a far sterner test against the Brisbane Lions.",
        "The Blues (4-1-2) received a timely confidence boost, with Charlie Curnow kicking nine goals as they feasted on the Eagles in Perth last weekend.But fourth-placed Brisbane (5-2) are on a four-game winning streak ahead of Friday's bumper clash at Marvel Stadium.\"That's probably the challenge; how do we replicate that same level of effort around the ball?\" Voss told reporters on Thursday.\"Playing Brisbane, and the formidable opponent that they are, they've got some genuine threats and challenges in their own team that'll ask some questions.\"So we certainly know what's coming. We're aware of the task that's ahead of us.\"We're pretty determined to be able to execute the same way that we went about it last week.\"Charlie Cameron (22 goals), Joe Daniher (16) and Eric Hipwood (12) are the main threats in a potent Brisbane attack.\"Sometimes you can narrow in on one or two but the reality is, not only do the individual match-ups need to execute their own roles but our system needs to be able to stand up,\" Voss said.\"When you look at their forward threats, they have plenty of those.\"So it's going to be a job to ensure that any ball that does get down there is pressurised and gives us half a chance.\"",
        "Ruck-forward Tom De Koning (concussion) is sidelined but Jesse Motlop will return from suspension and Matt Owies is in the mix to return from a hamstring injury.Voss relished the opportunity of having his full complement of midfielders available to face Brisbane's star-studded on-ball division, including the likes of Lachie Neale, Josh Dunkley and Will Ashcroft.Adam Cerra and skipper Patrick Cripps have been the only constants in Carlton's midfield, with Sam Walsh, George Hewett and Matt Kennedy all having interrupted seasons.\"Clearly a strategy has been for Brisbane to expand that midfield depth,\" Voss said.\"They've added Dunkley, obviously Ashcroft as well, who's come through as a young talent.\"So we're going to have to be on our game around the middle of the ground, there's no doubt about that. We feel like we've got our group largely together.\"Last week was probably the first time we had them all playing together, that I can remember. So it'll be a good challenge through the middle of the ground.\"Every coach talks about that's where it starts - well it certainly will start there for us on Friday night, no doubt.\""
    ]
}