{
    "articleURL": "/femail/article-12058903/Who-Heather-Dorak-Meghan-Markles-friend-pilates-instructor.html",
    "content": [
        "Heather Dorak has been The Duchess of Sussex's devoted friend for many yearsRead More: Meghan Markle hikes without Prince Harry near Montecito mansionHeather Dorak has been the Duchess of Sussex's devoted friend for many years and the pair are often spotted out and about together in LA.",
        "The Pilates and yoga instructor originates from San Antonio, Texas but is now based in California where she owns six Pilates Platinum studios.The blonde beauty attended Prince Harry and Meghan's wedding in May 2018 with her husband Matt Cohen.Heather was spotted hiking with Meghan near the Sussex's Montecito mansion after they celebrated Archie's fourth birthday.The pair often featured on Meghan's social media before she took down her accounts after marrying Prince Harry.   ",
        "Who is Heather Dorak?The Pilates instructor moved to LA with aspirations of a professional career in dance.However an injury inspired her move towards Pilates after a doctor recommended it. In an interview with Voyage LA she said: 'My doctor recommended that I try out Pilates, I fell in love immediately with the Megaformer method that people know today.'She previously revealed on the Mindbodygreen website that she suffered with an eating disorder after the pressure of the dance industry became too much in LA. She married Matt Cohen, who is the founder and CEO of the money-saving app Grand, in 2017.How did she meet Meghan? ",
        "Heather became Meghan's coach many years ago when she worked on the TV show Suits.In a social media post from 2015 Heather said she was celebrating ten years of friendship with Meghan, adding that she was 'one of my first clients'. ",
        "The pair have shared holidays and days out together, including a trip to a Vancouver Canucks hockey game in 2015. Heather also attended Meghan's 2015 speech at the UN Women's 20th anniversary of the Fourth World Conference of Women in Beijing event in New York City with Meghan's mother Doria Ragland. Heather contributed fitness expertise to Meghan’s former lifestyle blog The Tig before she closed it down. She has been a key part of Meghan's North American inner circle since Megxit, visiting the royal couple in Canada in January 2020 shortly after they left the UK after stepping back as senior royals.",
        "Heather has remained a member of the Duchess' close-knit girl squad, and is understood to have masterminded Meghan's secret hen do ahead of her wedding to Prince Harry.Heather celebrated the 4th July, with the Sussex's and their young son Archie in 2021 as they watched a local parade in the trendy mountain town of Jackson Hole, Wyo.Photos shared on social media, which have since been deleted, showed Heather standing with Prince Harry and Meghan at the local parade with their son.In 2021 Heather took to social media in defense of the Duchess in light of the increased tabloid scrutiny.She wrote: 'It’s hard for me to watch her go through all that she has to as the Meghan the press can love to hate…. ",
        "'Mostly because it’s so far from the Meghan that I know. Sweet. Kind. Always showing up! 'Two weeks ago, she was the first to surprise me with a gift after my knee surgery. 17 years ago, she walked into my fledgling Pilates studio and instantly became my rock in all things early 20s - career, love, figuring out how to adult. 'Since that day, she has never stopped being one of my brightest sources of light. It may be hard to see, but she lives for the little, thoughtful things – flowers for no reason, a random sweet, handwritten note. She’s always been truly wonderful ... M, I love you.' How popular is her pilates studio? ",
        "Heather opened her first Pilates Platinum studio in Hollywood in 2006. She now shares the business with her sister Sarah Dorak and they have expanded to six locations in total, in both Los Angeles and Texas. The Pilates Platinum classes are billed as an 'inventive and aggressive' approach to full-body fat burning and conditioning.Heather's classes are designed around the Megaformer machine, which like a classic Pilates reformer machine uses spring-loaded platforms and pulleys to challenge the body as different poses are adopted - but with the option to ramp up the intensity level. In interviews published before her relationship with Prince Harry became public, Meghan gushed about her 'amazing' and 'inspiring' friend Heather.",
        "Meghan once told Women's Health Magazine: 'There are so many workouts that you try out once and never go back to; Heather's studio is the complete opposite.'You keep coming back for several reasons: first off, your body changes immediately... give it two classes and you will see a difference; second, Heather is amazing - as an instructor, as a friend, she is inspiring in every way.'Lastly, the people in class are cool, unpretentious, and motivating... and that is a testament to Heather's energy.'Heather also trains actress Eva Longoria and Victoria's Secret Angel Alessandra Ambrosio, who was recently spotted at a Pilates Platinum studio. She has partnered up with Popsugar Fitness, creating several different workout videos for the publication over the years.Does she have children?",
        "Heather and Matt have two sons, the eldest being born in 2017. The couple's youngest son was born in February 2019.Meghan and Heather were also both pregnant at the same time in late 2018, and the royal sought pre-natal workouts tips from her friend. Heather documented her pregnancy journey on her Instagram account, sharing pictures of herself 'lunging into the weekend' as she hit the 17-weeks mark, and even sliding into the splits - undeterred by her blossoming baby bump."
    ]
}