{
    "articleURL": "/wires/pa/article-12056403/Ruben-Neves-It-need-catastrophe-Wolves-now.html",
    "content": [
        "Wolves captain Ruben Neves admits only a catastrophe can send them down now.",
        "Toti Gomes’ early header earned a 1-0 win over Aston Villa on Saturday – a fourth straight home victory – and moved Julen Lopetegui’s men onto 40 points.They are 13th, 10 points clear of the Premier League’s bottom three, and depending on other results could be mathematically safe by Monday night.It comes after Wolves were bottom at Christmas and Neves knows their job is virtually done.He told the club’s official site: “It’s not a secret for anyone, with 40 points we are pretty much there. A catastrophe needs to happen. It was really important for us and we can breathe a bit better now.“It’s a big relief to come out of this fight and to enjoy the three games left in the league. We knew if we won this game, we’d be really close to our goal. It’s really hard to go down on 40 points.",
        "“We had a bad start and changed coach, then the World Cup and we changed coach again.“A lot of injuries, a lot of players out, but we wanted to achieve our main goal.”Villa’s European hopes took a hit to keep them eighth and a point behind Brighton, having played three more games.They host the Seagulls on the final day of the season and also face Tottenham and Liverpool, the other two sides immediately above them before the end of the campaign.",
        "Successive 1-0 defeats could prove fatal in their quest to return to Europe for the first time since 2010-11 and midfielder John McGinn revealed his frustrations.“We lost a goal from a set-piece, which is never nice, and you give yourselves a tougher task. We created a lot of chances to go and equalise and get more from the game,” he told the club’s official site.“It’s definitely frustrating. There are a lot of things we could have done better, but overall, we controlled a lot of it.“We’ve got to be a lot smarter in the final areas with our decision-making like we have been over the last few months.“As much as when we were winning we weren’t getting carried away, it’s important we don’t let two defeats hamper what could be an exciting end to the season.“We’ve made it extremely difficult for ourselves now but the challenge is still there for us. We’ll be aiming for three wins in the last three games.”"
    ]
}