{
    "articleURL": "/tvshowbiz/article-12042011/Country-legend-Willie-Nelson-90-2023-Rock-Hall-inductees.html",
    "content": [
        "Country music icon Willie Nelson, who celebrated his 90th birthday last weekend with a star-studded concert at the Hollywood Bowl, is among the performers who will be inducted into the Rock &amp; Roll Hall Of Fame this year, organizers announced on Wednesday.",
        "A first-time nominee for the rock honor, Nelson joins country legends Dolly Parton, who was inducted into the Hall of Fame in 2022, Hank Williams and Johnny Cash.The other performer inductees in the class of 2023 are late pop singer George Michael, rapper Missy Elliott, singer Sheryl Crow - all on the ballot for the first time.Rounding out the list are singer Kate Bush, rock band Rage Against the Machine and R&amp;B vocal group The Spinners.They were chosen from 14 nominees by more than 1,000 artists and members of the industry as well as fans votes.",
        "The 38th induction ceremony will take place November 3 at Barclays Center in the New York borough of Brooklyn.'We are honored that this November's Induction Ceremony in New York will coincide with two milestones in music culture; the 90th birthday of Willie Nelson and the 50th anniversary of the birth of hip hop,' said John Sykes, chairman of the Rock &amp; Roll Hall of Fame Foundation.Nelson has been in the music business for over 60 years. He released the first of 73 solo studio albums in 1962 and scored his first No. 1 hit with Blue Eyes Crying In The Rain in 1975.Michael formed the pop duo Wham! and hit fame with Wake Me Up Before You Go-Go before going solo. He died in 2016.",
        "Elliot made her mark with her debut album Supa Dupa Fly in 1997, introducing a production rife with distortion and her rap style. As a producer and label executive, she is credited with forging new paths for women in the music industry.",
        "Crow started as a backup singer but emerged as a solo artist in 1993 with her debut album Tuesday Night Music Club, which spawned the Grammy winning record of the year, All I Wanna Do.With numerous collaborations, she has bridged rock, pop, country, folk and blues.Bush tapped lush soundscapes and radical experimentation to carve out a unique space in rock. Her 1985 song Running Up That Hill (A Deal with God) emerged again as a runaway hit in 2022.",
        "The Los Angeles quartet Rage Against the Machine broke onto the scene in 1991 with a raucous mix of hip hop, punk, metal and rock. Also known for their rebellious politics, they recorded hits like Killing in the Name about racism and police brutality.The Spinners emerged from Detroit's Motown in the 1960s and later came to define Philadelphia soul with lush harmonies and a dynamic stage presence. They became an R&amp;B hit machine with songs I'll Be Around, Could It Be I'm Falling in Love and Then Came You."
    ]
}