{
    "articleURL": "/tvshowbiz/article-12053059/Alex-Scott-recalls-cheeky-One-Direction-encounter-refuses-chatted-up.html",
    "content": [
        "Alex Scott has hinted at a cheeky encounter with a member of world famous pop band One Direction.",
        "The TV host, 38, made the revelation on the latest episode of The Lateish Show with Mo Gilligan but refused to name which member of the group 'chatted her up'.However despite her protestations, she did seemingly drop hints by saying she liked Watermelon Sugar and 'a bit of Pillow Talk' which are solo songs by Harry Styles, 29, and Zayn Malik, 29, respectively.The band was made up of Harry, Niall Horan, 29, Liam Payne, 29, Louis Tomlinson, 31, as well as Zayn before he left the group in 2015 - a year before the band officially went on hiatus.Host Mo, 35, asked: 'What about you, Alex? Because I've heard you've been chatted up by one of the One Direction members. Is this true?'.",
        "Only for Alex to reply cool as cucumber: 'What band? What? I do like a bit of Watermelon Sugar… A bit of Pillow Talk… A bit of Slow Hands…'.Thinking he was on to a winner, Mo exclaimed: 'It was Harry! Was it Harry?' but Alex refused to divulge any more information.The comedian went on to say: 'Harry's got those white boy hips, y'know. Wearing the platform shoes.'To which Alex smiled: 'Harry's got it going it on a little bit.'Mo then changed tack and asked: What about Niall? 'Yo, they call me Niall, you get me.'",
        "He pleased: 'C'mon, We're not getting any juice out of you, is there anything?'Only for Alex to say: 'I can't reveal that!'Alex's TV appearance comes after she revealed last month that she is 'struggling' to look for a partner and has taken advice from Jamie Redknapp in the hope of finding her perfect match.",
        "The former Arsenal player admitted she is 'single and ready to mingle' as she candidly spoke about her attempts to find a 'connection' with someone. She explained that she is 'open' to getting to know both men and women and 'never closes herself off' when it comes to dating.Alex has never publicly confirmed her sexuality but previously spoke about dating fellow footballer Kelly Smith, who was her teammate at Arsenal, in her memoir.After 'struggling' with some dating apps, Alex said her pal and former footballer Jamie told her about the app Raya, which is commonly used by celebrities.Speaking about her dating life, she told Grazia magazine: 'Its really hard [to find someone] cause people have a load of preconceptions. I struggle with apps. 'For me, it's all about connection that instant connection with someone and conversation and I'm like 'Oh wow.'The Lateish Show with Mo Gilligan on Channel 4 Fridays at 10 – stream or watch live."
    ]
}