{
    "articleURL": "/wires/reuters/article-12048241/Rays-sweep-Pirates-Zach-Elfins-7-inning-gem.html",
    "content": [
        "Zach Eflin threw seven shutout innings to help the Tampa Bay Rays to a 3-2 win and a three-game sweep of the visiting Pittsburgh Pirates on Thursday afternoon.",
        "Eflin (4-0) allowed three hits, struck out 10, including seven looking, and didn't walk a batter.Taylor Walls, Randy Arozarena and Yandy Diaz provided all the run support with solo home runs for Tampa Bay, which has won six of seven and held the Pirates to four runs in the series.Vince Velasquez (4-3) pitched three innings for the Pirates before departing with soreness in his throwing elbow. He allowed one run and two hits, striking out two and walking one.The Pirates have lost a season-high four in a row.Walls homered down the right-field line on a 2-2 pitch with one out in the second to give the Rays a 1-0 lead.Jose Hernandez replaced Velasquez to start the fourth and surrendered a leadoff homer to Arozarena to stretch the lead to 2-0.Diaz went deep with one out in the eighth to make it 3-0.Eflin retired the first six batters before Ke'Bryan Hayes led off with a single in the third. The Rays escaped with an inning-ending double play.After giving up a one-out single to Bryan Reynolds in the fourth, Eflin retired the next 10 in a row before Carlos Santana doubled with two outs in the seventh.Ryan Thompson replaced Elfin after he threw 80 pitches and retired the side in order in the eighth inning.",
        "Jason Adam pitched the ninth and gave up a two-out two-run double to Carlos Santana to cut the lead to 3-2 before getting the final out with two runners aboard to earn his second save.Velasquez was shooting for his fifth consecutive start after not allowing a run in three of his previous four outings, including an 18-inning scoreless streak heading into Thursday.He surrendered a leadoff double to Diaz in the first inning and then walked Wander Franco, but got Arozarena to hit into a double play before Josh Lowe struck out to end the early threat.The home run to Walls was the only base hit Velasquez allowed in the second and third innings.--Field Level Media"
    ]
}