{
    "articleURL": "/wires/reuters/article-12042765/Icahns-investment-firm-sinks-40-Hindenburg-attack.html",
    "content": [
        "By Niket Nishant and David French",
        "May 3 (Reuters) - Carl Icahn's empire took another hit on Wednesday when his holding company's shares plunged further in the aftermath of a critical report from short seller Hindenburg Research, bringing the valuation drop since the short seller attacked it to more than $6 billion.Hindenburg on Tuesday accused Icahn Enterprises LP (IEP) of over-valuing its holdings and relying on a \"Ponzi-like\" structure to pay dividends. Icahn called the report \"self-serving\" and he stood by IEP's statements about its finances. He did not respond to a request for comment on Wednesday.IEP shares hit an intraday low of $31.78 - their lowest in more than a decade. The company is now worth $11.5 billion, 35% less than its value on Monday before Hindenburg published its report.Icahn owns about 85% of IEP and has pledged over 60% of his stake as collateral for personal loans. The Hindenburg report has wiped $7.5 billion off Icahn's fortune, leaving him with a net worth of $10.8 billion, according to Forbes.IEP is scheduled to report its first-quarter earnings on Friday, restricting its ability to comment in detail on its finances in advance.\"Activist short attacks a few days before an issuer reports earnings are common because regulatory quiet periods can limit the issuer's ability to respond and catch them off-guard,\" said Josh Black, editor-in-chief of Insightia, which provides data on shareholder activism and corporate governance.",
        "Jefferies Financial Group Inc, the only major Wall Street brokerage that covers IEP, declined to comment on Wednesday on whether it had plans to revise its \"buy\" rating. Its analyst Daniel Fannon has consistently provided this positive rating on IEP since 2013. Fannon did not respond to requests for comment.The attack has landed Icahn in uncharted waters. Known for his face-offs with industry heavyweights such as AIG and McDonald's Corp, the billionaire has never seen his firm become a target of activist investing.Hindenburg has taken on several high-profile targets in recent months, including India's conglomerate Adani Group and Jack Dorsey-led digital payments platform Block Inc.William Ackman, a hedge fund veteran who famously feuded with Icahn over their opposing takes on supplements company Herbalife, called the Hindenburg report a \"must-read\".\"There is a karmic quality to this short report that reinforces the notion of a circle of life and death,\" he tweeted on Tuesday.(Reporting by Niket Nishant in Bengaluru and David French in New York; Editing by Saumyadeb Chakrabarty and Lisa Shumaker)"
    ]
}