{
    "articleURL": "/tvshowbiz/article-12046235/Loose-Women-stars-gutted-following-shock-exit-panellist-Carol-McGiffin.html",
    "content": [
        "Loose Women stars have admitted they are gutted' following the shock exit of fellow panellist Carol McGiffin on Wednesday, after a 'contract issue'. ",
        "The presenter, 63, originally joined the talk show in 2000 and returned in June 2018 after five years away.After two months off screen, Carol shared an update to Instagram announcing her departure after she slammed ITV for 'forcing' her decision to step away. Her fellow panelists shared showed their support in the comments section and said they would miss their co-star.  Denise Welch wrote: 'Gutted Mcgiff truly,' while Frankie Bridge added: 'Gutted Carol xx.'",
        "Brenda Edwards penned: 'Carol, I always enjoy when you are on as we have such a laugh, but you of course must always do what is best for you! 'I really hope I get to see you again love you lots lovely lady. Keep Smiling.''Miss you smelly poo! Even though we disagreed on most things you’ve always made me laugh my head off! As I’ve always said thank god we weren’t at school together it would have been #carnage !! Big hugs x,' Nadia Sawalha added. Charlene White said: 'I really miss you, and am so gutted xx''Oh Carol I’ll miss you so much! But you’re right , you shouldn’t be dealing with stress! Love you loads xx,' Coleen shared. Kelle Bryan posted: 'Mate Mcgiff, I love working with you. You're funny. Never take yourself too seriously and always stand by your opinions.' ",
        "Carol's departure comes after she previously revealed that her future on ITV's Loose Women could be in jeopardy after a 'difficult contract issue'.After an 'unjust' contract request, the star has remained off-screen for the past two months - indicating that her time on the show could be coming to an end.",
        "Speaking to Best Magazine, she explained: 'I haven't been on the show for two months now because I've had to step away from it. It was causing me too much stress, which was mostly down to a difficult contract issue I'd been challenging since January.'The problem was, ITV were insisting, for the first time since I went back in 2018, that if I wanted to carry on doing the show, I would have to sign a contract that was totally unjust and unworkable for me, so I had to say \"no thanks\".Carol, who is a favourite for her fiery opinions on the show, was quick to emphasise her current situation.She added to the publication: 'I feel quite upset about it, if I'm honest, because although it is my decision, I felt like it was one I was being forced to make. No one in their right mind would have signed that contract. And I can't see a way back from it.'"
    ]
}