{
    "articleURL": "/travel/article-12050775/From-Japans-bullet-trains-Cunard-cruises-Travel-experiences-change-FOREVER.html",
    "content": [
        "Game-changing experiences can also be had in Hungary and AfricaWe'll also tell you where to find the best martini on the planetREAD MORE: The top 10 most annoying things that people do on holidaySometimes holiday experiences become life-changing events. ",
        "But if you feel like you're missing out on them, here are some suggestions from the Mail's globe-trotting travel writers - game-changing experiences that will make your next holiday less stressful, more memorable and more mouthwatering.Scroll down for the lowdown on the world's best trains, jaw-dropping airport transfer services and the best crisps in Ireland...JAPAN'S BULLET TRAINS",
        "Japan isn't the only country with high-speed trains, but its bullet train services are like no other. Not only are they jaw-droppingly fast – the H5/E5 and E6 series hit 199mph – but they're run with military precision timing-wise. You can set your watch by their arrivals and departures. And the white-gloved conductors lean out of a window and salute as the train leaves the station. Amazing.AIRPORT LOUNGESOnce you've experienced lounge life, with its free food and drink and other perks such as showers, high-speed internet and quiet nooks for meetings - it is hard going back to the brow-furrowing throng of the main airport. A good way to gain access to them all is with Priority Pass. The annual 'prestige' membership - which costs £339 ($430) - allows unlimited visits to airport lounges all over the world.HELICOPTER AIRPORT TRANSFERS",
        "Want a 'taxi ride' that's super-fast and comes with a gargantuan dollop of wow factor? Upgrade to a helicopter transfer. We've trialled the Blade helicopter service in both New York and Los Angeles and were bowled over both times. The New York transfer from JFK to a downtown waterfront landing pad takes no more than 10 minutes. This journey could take up to two hours by taxi if the traffic is horrific. In LA we flew just 300ft above the freeway from LAX to a car park helipad, where Blade had erected a chic pop-up bar. And the cost? To charter the helicopter up to around $1,800 (£1,400) each way, but on a pay-per-seat basis it's around $185/£145 each way. Not cheap, but feeling like a Hollywood star? Priceless.",
        "CHAUFFEURED LIMO TRANSFERSHelicopter not available? Try the next best thing - a chauffeured limo service, such as Blacklane. The best feature ultra-polite drivers and executive cars stocked with bottled water. We've used Blacklane in London, New York and Paris and its service jettisons several layers of stress.AIRPORT HOTELSThe holiday should start from the moment you leave your house - but that's hard when it's dark, you've only managed a couple of hours sleep, the taxi driver is chatty and you're not sure if the roads will be clear. That's why staying at an airport hotel the night before or after a flight makes sense. It gives you time to relax into holiday mode, check you don't need to pick up any forgotten items at the airport shops and stroll at a decent hour to the departure gates. If after your return flight you've got a long journey home – why not stay overnight at a hotel and hang on to that holiday feeling? Enjoy a decent night's sleep and set off again the next day after a hearty breakfast.FIVE-STAR SKI HOTELS",
        "Once you've experienced luxury mountainside pampering - with staff taking your ski/snowboard to the slope for you, and bringing it back in again – it's tough to downgrade. ",
        "EUROSTAR TRAINSUse Eurostar just once to reach Paris, Brussels or Amsterdam from London and you'll probably ditch flying to these cities for good. End to end, the Eurostar can match the plane for speed and if you upgrade to standard premium or business premiere, you'll get a decent meal, too. What's more, when you arrive, you step from the train straight into the action.FLYING BUSINESS CLASS",
        "Flying business class for the first time is a total revelation.There's getting served fizz on arrival, digging through a high-end amenity kit, receiving a printed menu ahead of your meal, having a tablecloth laid out before you, using proper cutlery and glassware, eating restaurant-standard food – the list goes on.It feels wonderfully alien to stretch out in a fully lie-flat bed at 38,000ft if you're only used to feeling relative discomfort for the majority of a flight. There's none of the backache, the cramped leg room and the butting elbows that you're accustomed to in economy.The only drawback? It raises the bar too high - returning to budget seats at the back of the plane after a stint in business is landing back to reality with a thud.LIVE COMEDY IN NEW YORKIf you're a fan of live comedy, then the Comedy Cellar in Manhattan is a must-visit – with other comedy clubs around the world paling in comparison.",
        "It's a revered comedy institution on MacDougal Street, a Greenwich Village strip that's famous for its many comedy clubs.America's most famous comedians have performed there, often taking to the stage unexpectedly to test out new material – we've seen filmmaker and comedian Judd Apatow and the comic Amy Schumer step up for impromptu sets.Even if you can't get a ticket for the shows (they're in hot demand), if you simply stand outside you're in with a good chance of seeing popular comics walk past on their way to perform and hang out in other venues around the street.CUNARD CRUISES",
        "Cunard is like The Ritz at sea – just as tea at The Ritz is a popular special birthday and bucket list destination, so are the Cunard ships. Anniversaries and birthdays are celebrated in style and the backdrop of the ship gives it that special grandeur that's hard to find elsewhere. That's because each ship combines history with luxury so that as you step aboard you can imagine the great and the good of yesteryear doing the same thing. There's no getting down with the kids here – Cunard is traditional and proud, like a grand old aunt who won't use a mobile phone.BARGAIN HUNTING IN BUDAPESTIf you love bargain hunting for clothes and trinkets on holiday, then Budapest should be on your radar.",
        "The Hungarian capital is a treasure trove for second-hand and antique finds, from its flea markets and its vintage boutiques to its many charity shops.The Hungarian arm of the Humana Vintage chain of shops - which has thrift stores in several mainland European countries - is a particular standout. In the Karoly krt venue, for instance, clothes are reduced to just a few pounds in their sales each month – we found a vintage DKNY skirt that cost the equivalent of 70p.SAFARIS IN THE MASAI MARA",
        "No self-respecting bucket list should be without a safari in Africa's Masai Mara - the acacia-peppered Africa you're probably thinking of when you think of Africa. Sightings of leopards, cheetahs, lions, hippos, crocodiles, elephants and giraffes are guaranteed, and in a landscape that drops the jaw at every turn.TRAVELLING BY SCOOTEROne of the most thrilling ways to explore a place is by rented scooter - you see the destination in a new light as you zip in and out of traffic, take fun detours and trundle up poky lanes.We found this out in Vietnam, riding scooters with a guide from the city of Hoi An along the coast to Hue, zig-zagging along the winding Hai Van Pass and stopping for a swim in Elephant Springs. It felt like a real adventure, and the views trumped those we would have had from the bus window by a mile.",
        "GREEK SALADS IN GREECE",
        "Think you've had a 'proper' Greek salad? You haven't unless you've had one in Greece, where they aren't just a sideshow, but most definitely the main act – a salad that's always a full meal, with slabs of feta and mouthwatering handfuls of the freshest olives, cucumber slices and tomatoes.DUKES' MARTINIS",
        "Perfectly chilled and slightly frosted glasses, a rinse of vermouth, a generous free pour of vodka and a spritz of lemon juice. Oh, and beautifully buttery olives... The martinis at Dukes Bar in London's Dukes hotel are simple in design but remarkably hard to repeat. No martini is a match for the ones rustled up at Dukes. This spot was frequently visited by James Bond author Ian Fleming and is said to be the inspiration for the classic line 'shaken, not stirred.'ICED COFFEE IN VIETNAMVietnamese iced coffee puts Starbucks and Pret A Manger iced coffees to shame.With coffee made from the robusta bean and sweetened with a layer of syrupy condensed milk, it's almost like a dessert - albeit with a huge kick (it has double the amount of caffeine that a run-of-the-mill coffee would have).You can pick it up in cafes and restaurants all over Vietnam, but if a trip is off the cards, Vietnamese restaurants worldwide often offer Vietnamese iced coffee on their menus.",
        "IRELAND'S TAYTO CRISPSIf you're partial to a packet of crisps, then it's essential to try a bag of Tayto, the unofficial national crisp of Ireland.They have just the right level of cheese and onion, the perfect thickness, and blow Walkers' and Lays' cheese-and-onion crisps out of the water. You'll recognise the bright red packet by the 'Mr Tayto' cartoon on the front - he's a potato dressed in a fancy suit, and he's a minor celebrity in Ireland.Every corner shop sells them, and most decent pubs across the country stock them behind the counter, so you can enjoy them over a pint.",
        "The quickest and easiest way to save money on travel insurance and compare the best policies is to use a comparison site.While results will broadly be the same across most comparison sites, they may slightly differ, so it is worth checking a couple. We suggest: MoneySupermarketCompare deals from 35 leading providersConfused.comSee how much you can save from a few days to an annual policy Also check insurers such as Direct Line that does not appear on comparison sites and if you have previous serious medical issues consider a specialist insurer or broker.Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. "
    ]
}