{
    "articleURL": "/wires/reuters/article-12053179/Rays-edge-Yankees-contentious-series-opener.html",
    "content": [
        "Randy Arozarena and Yandy Diaz hit home runs, and Wander Franco's RBI double in the seventh inning lifted the Tampa Bay Rays to a 5-4 win over the New York Yankees on Friday night in St. Petersburg, Fla.",
        "Jason Adam closed out the ninth inning for his third save, and the first-place Rays have opened a 10-game lead over the cellar-dwelling Yankees in the American League East.Drama arose in the fifth inning after Arozarena was struck by a pitch for his second straight plate appearance. In the third inning, Yankees starter Jhony Brito clipped the Rays' slugger. Albert Abreu plunked him two innings later.After warnings were issued, Rays manager Kevin Cash was ejected by first-base umpire Lance Barksdale.Kevin Kelly (3-0), the Rays' third pitcher, picked up the win.Franco's go-ahead double off came against Jimmy Cordero (1-1) and scored Diaz from first. Initially, Diaz was called out at the plate, but the call was reversed after Tampa Bay challenged it.Rays lefty Colin Poche escaped a second-and-third, one-out situation in the eighth inning. He got Harrison Bader to pop out to shortstop and then struck out Isiah Kiner-Falefa in a nine-pitch showdown.The Rays struck quickly on Arozarena's homer with two outs in the first. While rounding the bases, Arozarena did his folded-arms pose at third base.In the second inning, Tampa Bay manufactured a run to go up by two. Isaac Paredes walked to open the inning, and he moved to second on Taylor Walls' single. Paredes ended up scoring on Jose Siri's sacrifice fly.",
        "Tampa Bay inched further ahead in the third. Diaz homered to lead off the inning, and after Franco doubled, Brito hit Arozarena with a pitch. Harold Ramirez collected an RBI on his fielder's choice ground ball.The Yankees broke through against Rays starter Yonny Chirinos in the sixth inning. Anthony Rizzo singled and scored on Gleyber Torres' double. After DJ LeMahieu walked, Bader launched a three-run homer off reliever Garrett Cleavinger to make it 4-4.Chirinos was charged with three runs on three hits and four walks in 5 1/3 innings.--Field Level Media"
    ]
}