{
    "articleURL": "/news/article-12054807/Glamorous-racegoers-arrive-Churchill-Downs-Kentucky-Derby.html",
    "content": [
        "The annual horse race held in Louisville, Kentucky, is set to take place later today drawing a crowd of around 155,000Images captured of racegoers at the Churchill Downs course show some of the weird and wacky outfits on displayIt will be the 149th running of the popular race, which is the first leg of the American Triple CrownGlamorous racegoers have been pictured turning up for the Kentucky Derby ahead of the 149th running of the race later today. ",
        "While the majority of revelers went for a more traditional dress code, other individuals opted for costumes and hilarious headwear.One man was seen sporting a Fred Flintstone outfit, as well as a large blue furry hat with horns protruding from it.  Two men wearing purple and pink tinged suits where spotted wearing horses heads for hats at the racecourse. ",
        "Hats are a major part of the event and have become part of the history of the derby, which always takes place on the first Saturday in May every year.As it stands, Tapit Trice and Angel of Empire remain co-favorites for tonight's race, with odds shared at 9-2.Last year, Rich Strike was added to the field late and won the race in a shock 80-1 longshot. After a few horses had to be pulled out of the race, Mandarin Hero (21-1), Cyclone Mischief (31-1) and King Russell (32-1)  will now be running, and bettors will be keeping a close eye on those longshots after last year's results.'Riders Up!' is the traditional command from the Paddock Judge for jockeys to mount their horses in advance of the upcoming race. Since 2012, Churchill Downs has reserved that special honor for a dignitary or celebrity attendee when it comes to the Kentucky Derby.",
        "Last year, rapper Jack Harlow had the honor and previously actor Jeff Bridges stepped in to say the command in 2017.This year two-time Super Bowl MVP and quarterback for the Kansas City Chiefs Patrick Mahomes will have that honor.",
        "After the Kansas City superstar makes that call, the riders will be off to the races in what has been dubbed 'The Most Exciting Two Minutes in Sports'. The 20 horses racing in the Kentucky Derby must first travel along the Road to the Kentucky Derby, which is a series of 35 races taking place at tracks across the country and the world. Points are awarded to the top 4 horses that finish in each of those 35 races, and the 20 horses with the most points earn a spot in the starting gate in the Kentucky Derby race. At the finish line awaits a $3 million purse for the winner, and a place amongst the history books. The race kicks off this year's Triple Crown of races for three-year-old horses, followed by the Preakness Stakes on May 20 and the Belmont Stakes on June 10."
    ]
}