{
    "articleURL": "/sport/afl/article-12039981/Tassie-great-says-no-Devils-new-team.html",
    "content": [
        "Tasmania will be the AFL's 19th team News was confirmed on WednesdayBut what will the team be called? One of Tasmania's greatest AFL exports, Matthew Richardson, says any fight over naming the 19th team the 'Devils' could be avoided as a battle for the naming rights heats up with an entertainment giant.",
        "Confirmation of the new team came on Wednesday afternoon, when AFL CEO Gillon McLachlan travelled to Hobart to sign the finalised paperwork alongside Tasmanian Premier Jeremy Rockliff.But with so many details yet to be confirmed about the AFL's 19th franchise, debate is raging over what the club should be called when it joins the league in 2028.In the original business case, which began in 2019, it was originally planned that the side would be called the 'Tasmanian Devils'.The name is used by the state's under-18 side, after registered it as a trademark through the Australian government.",
        "But it is understood the commercial trademark is owned by Warner Bros Entertainment for 'Tas, the Tasmanian Devil': the cartoon character that has been made famous across the world, and the AFL could be in for a fight to use the name.A 'shocked' Foreign Affairs Minister Penny Wong pledged to see 'what we can do' to reclaim the national icon. Tasmanian devils are only found in Tasmania (though a very small breeding population has recently been introduced to NSW), and the carnivorous marsupial has one of the most powerful bites in the world, pound-for-pound; something emblematic of a state that feels it punches well above its weight. It's exactly why Wong was in disbelief that an Aussie isn't the one with the naming rights. ",
        "'I have to say like most Australians I was pretty shocked to realise that Tassie devils was not a name that we had the rights over,' she told 2GB Radio on Wednesday.She ruled out speaking to US President Joe Biden about the matter - saying he likely has 'no control' over the Warner Bros business, but she did see the value in returning the name to the Australian public.'I think most Australians would think that Tasmanian devils was something that we could use. We'll see what we can do,' Wong said. But Richardson, who was drafted to Richmond from his native Hobart, doesn't want the name at all. ",
        "He said the decision that the AFL would consult Tasmanians on what the nickname, logo, guernsey and song would look like could avoid the problem, but regardless, he thinks a fresh slate is needed. 'I think we should go for something new,' Richardson told RSN Radio.'But you know what, I recommend that people should decide ... throw it out there and let the people of Tasmania come up with some names and some ideas and then let them let them vote on it.'I did mention the Islanders the other day ... Tassie is an island. There are other teams called the Islanders. That's one that immediately came to mind.",
        "'We've done the Devils, we've done the Mariners.'Fans, both Tasmanian and otherwise, have piled into public forums to voice their thoughts, with wildly differing opinions. Footy legend Robert Shaw implored Rockliff and the AFL to remain true to the game's humble roots in Tasmania.  'Tasmania is authentic, original and has its own unique identity. One chance here @JeremyRockliff @AFL. Its symbol, originality/tune of team song and simplicity of its jumper design must reflect those values. No 'americanisation' name or copied graphic hieroglyphics on jumper,' he said.One suggested that Islanders was a perfect way to ensure the team united all Tasmanians, not just those in the capital city: ' Every person in Tasmania is an Islander. Would be a unifying name for the north and south.'For his part, McLachlan is firmly in the 'Devils' camp.'I think the Tasmanian and broader football community will get involved in that,' he told reporters at the official announcement of whether the nickname should be the Devils.'If I'm pushed, the Devils seems to make sense to me. I know there is debate around the legalities and copyright issues, they can be worked through.'I know there will be broad-minded people at Warner Bros, but that will be for other people to decide. I imagine there will be a big push for that type.",
        "'Big companies work through that stuff all the time. The bigger issue will be what the Tasmanian people want and the process that is run.'",
        "At the official announcement confirming Tasmania's inclusion in the AFL, a proud Rockliff declared his great state 'will never be the same again'.'This is a proud and ground-breaking moment in our history,' he told reporters.'After more than a century, the AFL will finally be complete and recognised as a truly national competition.'We have fought hard to deliver this and I couldn't be prouder to deliver our own team, that will take the field in our own colours, and sing our own song.'For everyone who has backed us and believed - thank you for sticking with us, as we've brought this home.'Tasmania's time has come.'Rockliff's state government will stump up $12million-per-year over 12 years towards a team, plus $60million for a high-performance centre.It will spend $375million on the new 23,000-seat roofed stadium on Hobart's waterfront, with the AFL is contributing $15 million and the federal government coughing up $240million."
    ]
}