{
    "articleURL": "/wires/ap/article-12040939/In-coronation-King-Charles-carries-medieval-tradition.html",
    "content": [
        "LONDON (AP) - The United Kingdom's royal family turns the page on a new chapter Saturday with the coronation of King Charles III - a spectacle that echoes medieval times but features modern flourishes.",
        "The pomp, pageantry and symbolism date back more than 1,000 years, but the crowning of this king will feature new twists on the tradition and changes from the coronation of his mother, Queen Elizabeth II, 70 years ago.Plans for the ceremony at Westminster Abbey call for a more toned-down affair than the last one, even though royals from other nations, heads of state and most of Charles' family will be there, and the monarch plans to wear the same vestments as Elizabeth did.Here are some things to know about the coronation:WHY HAVE THE CORONATION IF CHARLES IS ALREADY KING?Charles automatically ascended to the throne when Elizabeth died Sept. 8, and he was officially proclaimed the United Kingdom's monarch two days later in an ascension ceremony broadcast for the first time on television.",
        "Charles said he was \"deeply aware of this great inheritance and of the duties and heavy responsibilities of sovereignty which have now passed to me.\"There is no legal requirement for a coronation, and other European monarchies have done away with the ceremonies.But the deeply religious and regalia-heavy event is a more formal confirmation of his role as head of state and titular head of the Church of England and was intended to show the king's authority was derived from God.",
        "During the service conducted by the church's spiritual leader, the archbishop of Canterbury, Charles will be anointed with oil, receive the traditional symbols of the monarch - including the orb and scepter - and have the St. Edwards Crown placed on his head for the first time. Charles´ wife, Camilla, will be crowned as queen consort.WHAT WILL BE DIFFERENT FROM THE LAST CORONATION?The coronation ceremony dates back to the medieval period, and much of it remains unchanged.Westminster Abbey has been the setting of the ritual since William the Conqueror was crowned in 1066.Elizabeth II's coronation in June 1953 was the first to be televised live. The broadcast in black and white drew an audience of tens of millions in the U.K. and was later played to a worldwide audience. In the age of streaming and social media, people will be able to watch Charles' crowning live - and in vivid reds, blues and golds - from virtually anywhere on the planet and post their hot takes with a crown emoji created for the occasion.Charles has said he plans to slim down the monarchy. His coronation is expected to reflect that with a ceremony shorter than his mother's three-hour extravaganza and no more than 2,800 guests in the audience - far fewer than the 8,000 who assembled to see Elizabeth crowned.",
        "In a nod to the change in the religious makeup of the United Kingdom, Buddhist, Hindu, Jewish, Muslim and Sikh religious leaders will play a role at the coronation. That reflects Charles' vow to be \"the defender of faiths,\" as opposed to the \"defender of the faith.\"The procession after the ceremony also will be decidedly shorter than the 5-mile (8 kilometer) route that Elizabeth and her husband, Prince Philip, took around London in 1953. Charles and Camilla plan to take a more modern set of horse-drawn wheels for the 1.3-mile (2-kilometer) route from Buckingham Palace to the abbey. Once crowned, they will step back in time and retrace the journey in the 260-year-old carriage - notorious for its rough ride - used in every coronation since William IV´s in 1831.WHO´S ON THE GUEST LIST?A hundred heads of state are expected to attend along with royalty ranging from Japan's Crown Prince Akishino and his wife, Kiko, to Spain´s King Felipe VI and Queen Letizia.The U.S. will keep alive its streak of a president never attending a British royal coronation, although first lady Jill Biden is set to attend.William, Prince of Wales and heir to the throne, is expected to kneel before his father and pledge his loyalty in what's known as the Homage of Royal Blood.",
        "His younger brother, Prince Harry, the disgruntled Duke of Sussex, is not expected to take part in the service. His explosive memoir \"Spare,\" which became a bestseller early this year, made unflattering claims about the royal family.Until three weeks ago, there was a question of whether Harry and his wife, Meghan, would attend the crowning after leveling charges of racism and media manipulation at the royal family.While Harry will be there, the duchess is to remain at the couple's Southern California home with their two young children, Prince Archie and Princess Lilibet.The coronation is just a few days before the first of Harry's lawsuits against the British tabloid press goes to trial. The case could reveal more family secrets.During a hearing in a similar case last week, Harry said in court papers that Buckingham Palace, with the approval of the queen, had an agreement with Rupert Murdoch's English newspapers to settle phone hacking allegations without a lawsuit. Harry said he was directed by palace staff to drop his litigation because his father wanted to curry favor with the press.The family drama doesn't end there. Charles' brother, Prince Andrew, is also not expected to play any role in the ceremony. Andrew gave up royal duties and was stripped of military titles and patronages after revelations of his friendship with convicted sex offender Jeffrey Epstein. Andrew settled a lawsuit with a woman who said she was forced to have sex with him when she was a teenager.",
        "WHAT IS THE IMPORTANCE OF THE CORONATION?With opinion polls showing support for the monarchy has weakened in recent years, this is the chance for Charles to seek and showcase the public's embrace.Crowds are expected to line the streets to cheer the new king, and throngs will stand outside Buckingham Palace waiting for him to appear on the balcony after the procession.While criticism of the crown was relatively muted in recent years out of respect for the queen and her decades of service to the country, there is likely to be much more discussion of whether the United Kingdom still needs this antiquated institution or if it should become a republic with an elected head of state.The leader of the anti-monarchist group Republic said it plans to have more than 1,000 protesters clad in yellow chanting, \"Not my king\" as the royal procession passes by.For the vast majority, though, it will be an opportunity to celebrate being British - or show their support for an institution that is the subject of fascination for so many around the world.Streets will be lined with union flags, spectators will dress in red, white and blue, and military jets will fly overhead streaming plumes of smoke in the national colors. The pomp and circumstance of the ceremony itself is also a reminder of a time when Britain was the most powerful nation in the world.",
        "WHO IS PICKING UP THE TAB FOR THE CELEBRATION?The public is footing the bill for the coronation. There is no official estimate yet of what it might cost. Some reports estimate it could top 100 million pounds ($125 million).A Buckingham Palace spokesperson said Tuesday that some estimates were \"more fanciful than others\" and that the true cost would be shared later.The celebration comes as the U.K. weathers a bruising cost-of-living crisis that left many struggling to heat their homes this winter and put food on their tables.But plenty of people stand to profit from the hoopla.Officials are expecting to see a tourism boost and there is no shortage of coronation-themed events and commemorative products that could ring up additional sales taxes.Fans looking to remember the historic event can find everything from fine china to souvenir coins or even cardboard masks of Charles and Camilla. Coronation themed biscuits, chocolates and beers are likely to be quickly forgotten.___Danica Kirka contributed to this report."
    ]
}