{
    "articleURL": "/tvshowbiz/article-12041431/Marco-Pierre-White-pays-tribute-Jock-Zonfrillo.html",
    "content": [
        "Michelin-star chef Marco Pierre White has paid tribute to the late Jock Zonfrillo after receiving criticism online for his silence following the MasterChef star's death. ",
        "Zonfrillo, 46, was found dead in a Melbourne hotel on Sunday. He previously attributed British chef White with saving his life, after he gave him a job and accommodation when he was a homeless heroin addict in London in the 1990s.Tributes began to pour in for the Scottish chef when the news of his death broke on Monday, but White maintained a deafening silence, opting to post a photograph with his son Luciano in Bangkok the day after Zonfrillo's death was announced. On Wednesday evening, two days after the chef's death was announced, White posted a tribute to his Instagram page. ",
        "He shared a photo of him and Jock in their chef uniforms with the caption: 'RIP, my love and my condolences to the family. MPW x'. Despite criticism, the post of Pierre White and his son in Bangkok remains on his page. Before he posted his tribute to Jock, one user commented on the photo: ''I'm shocked! This is as insensitive as it gets. What poor timing to post this!'While another said: 'Where's the comment on losing Jock'. The Scottish chef began working with White in 1994 in the UK when he landed a role in his kitchen. He was suffering with a heroin addiction at the time, and he claimed in his memoir Last Shot that he told his boss about this addiction and his homelessness.  ",
        "In his memoir, Zonfrillo said: 'He didn't fire me. Instead, he picked up the phone, put in a call to the hostel and asked them to fast-track me on the waiting list and find a bed for me.",
        "'In the meantime, he put me in touch with a couple of boys from Canteen, the other restaurant he owned, and arranged for me to sleep on their sofa until I could get my shit together. He even advanced me some cash to tide me over.'  However, White said that 'almost everything' he wrote about him was untrue and that the pair actually had very little to do with each other, despite the Brit being referred to in the book 157 times.'I never saw much [Zonfrillo], and he worked in my kitchen for a very short time,' he told Good Weekend.Jock is survived by his third wife, Lauren Fried, and his four children: Ava and Sophia, from his first two marriages, and Alfie and Isla, with Ms Fried. His death comes as MasterChef's fifteenth season, featuring Jamie Oliver as a guest judge, was due to premiere on Monday night.",
        "However, it was postponed due to his death and Channel 10 announced on Wednesday that it will be airing this Sunday, May 6, at 7.30pm, with permission from his family.",
        "The statement read: 'With the full support of Jock Zonfrillo’s family, MasterChef Australia will air at 7.30pm on Sunday, 7 May.'MasterChef Australia Judge Jock Zonfrillo took great pride in challenging and coaching the contestants and of course inspiring a nation of home cooks.'It is with Jock in our hearts that we cherish this season and remember the charismatic and big-hearted Judge and Chef who we knew and loved. 'Jock will be remembered in the MasterChef Australia kitchen for years to come.'",
        "Jamie Oliver paid tribute to the judge as he shared a photo of them together online.He wrote: 'In total shock to hear of the sudden death of chef Jock Zonfrillo. Had the best time working with him for this year's MasterChef Australia. Jock was very generous with his time and spirit in the show and will be so very missed. Sending heart felt love and condolences to all of his family, friends and the MasterChef team and contestants'.Gordan Ramsay tweeted on Monday: 'Saddened by the devastating news of Jock Zonfrillo's passing. I truly enjoyed the time we spent together on MasterChef in Australia. Sending all my love to Lauren and the family in this difficult time Gx'."
    ]
}