{
    "articleURL": "/wires/reuters/article-12042817/How-US-debt-crisis-standoff-cause-recession--bad-one.html",
    "content": [
        "By Ann Saphir and Dan Burns",
        "WASHINGTON, May 3 - A fight between Republicans and Democrats over the debt limit ceiling could send the U.S. economy into a recession even if the standoff doesn't actually trigger a debt default, analysts say - and a much worse downturn with perhaps 7.5 million people thrown out of work if it does.Already some corners of the vast market for U.S. debt are feeling a sharp pinch after Treasury Secretary Janet Yellen on Monday said that by early June the government may run short of the money to stay current on its bills - whether they are payments owed to foreign or domestic investors in Treasuries, federal employees and contractors or Social Security pensioners.Total government spending on average is about $525 billion a month. A big chunk of that, about $225 billion on average in the first quarter, is deficit spending.Hitting the debt ceiling would mean the government could no longer run that budget shortfall, delivering an immediate blow to millions of Americans who rely on government money directly or indirectly.The market swoon from what would be an unprecedented U.S. default would bludgeon away billions more in wealth.And while analysts have floated a few workarounds to keep money flowing, including invoking a constitutional provision that would likely face challenges in court, all are untested.",
        "Investors are taking the risk seriously. Yields on as much as $650 billion of Treasury securities maturing in the first half of June rocketed to record highs after Yellen's announcement, reflecting the increased chance that they may not be paid off on schedule.The cost to insure U.S. government debt against default has shot to the highest since the 2007-2009 financial crisis.\"I don´t think there are a lot of people in the market who would bet heavily that there will be a default. Most people I speak to think there will be a compromise between the Republicans and the White House,\" said Lou Brien, an analyst at DRW Trading. \"But the odds are not zero, so the market is pricing in the possibility that they will be too late to prevent some sort of funding problem.\"All of this is occurring as the economic outlook is dimming anyway.TAKING THE AIR OUTNationwide Chief Economist Kathy Bostjancic was already expecting a recession later this year, as the Federal Reserve's rapid-fire interest-rate hikes aimed at battling inflation raise borrowing costs for households and businesses and slow bank lending. All of that takes air out the economy's tires and could start to push up the unemployment rate, now at a historically low 3.5%.",
        "Some top economic policymakers like those at the Fed had predicted as early as last December that the unemployment rate would be roughly 1 percentage point higher by the end of 2023.A debt crisis and a default, even if only on some of the interest payments due each day, would move it forward, Bostjancic said. To make what payments it could, the government would need to cut spending on whatever it could.\"It immediately hits the cash flow that goes to individuals or businesses,\" she said. \"That's going to feed directly into GDP; it does reinforce the recession scenario.\"Indeed, the soft 1.1% annualized growth rate in U.S. gross domestic product logged in the first quarter was already seen as the likely high-water mark for the year.How deep and long-lasting the effects would be, she and others said, depends a lot on how long any non-payments last, which in turn will be shaped by how financial markets react - strongly, she and others said.In the 2008 financial crisis, for instance, Congress at first voted down the Treasury's proposed bailout fund for banks, but the ensuing record collapse in stock prices and rise in bond yields changed minds quickly. Lawmakers approved the plan just days later.Should even that reaction not stir Congress to lift the debt cap quickly, a prolonged breach of the so-called \"X-date\" could catapult a relatively mild recession - with between 1 and 2 million lost jobs and the unemployment rate topping out around 5% - into something far more painful, Mark Zandi, chief economist at Moody's Analytics, estimated in a report in March.",
        "In his worst-case scenario of a prolonged breach, with the government forced to slash spending for an extended period and consumer and business sentiment crushed by the political standoff and resulting financial chaos, unemployment rockets to above 8% - a loss of between 7.5 million and 8 million jobs - and is slow to recover.With the U.S. credit standing likely permanently impaired, \"The economy's long-term growth prospects are also weakened,\" Zandi wrote.Between those two scenarios, Zandi said the next-harshest economic outcome would be for the House Republican plan calling for drastic spending cuts to prevail. A recession would be slower coming - likely not until 2024 - but unemployment in that case peaks near 6% and recovers even more slowly than under a prolonged breach.(Reporting by Ann Saphir and Dan Burns; Editing by Andrea Ricci)"
    ]
}