{
    "articleURL": "/sport/othersports/article-12040901/Wrestler-Kristen-Miami-Mitchell-dies-aged-36.html",
    "content": [
        "Influential Australian wrestler Kristen Mitchell has died aged 36 The South Australian helped shape the futures of a number of top stars Daily Mail Australia provides all the latest international sports news Top female Australian wrestler Kristen 'Miami' Mitchell has died aged 36.",
        "In a statement, Wrestling Radio Australia said: 'She will be deeply missed by all of those who ever had the privilege of knowing and working with her.'Her kind heart and bubbly positive attitude are how we will all remember her and the world is a less brighter place today because of this loss.'Mitchell paved the way for South Australia's women's wrestling and has been remembered as an 'irreplaceable friend and mentor' to the Australian wrestling community.WWE star Rhea Ripley also shared a tribute for Mitchell, writing: 'Thank you for the memories... rest peacefully.' ",
        "Australian Wrestling is saddened by the loss of Kristen Mitchell aka Miami.The impression she has left on the industry both from her work in ring and behind the scenes on the future of the business is immeasurable and she will be missed deeply by all of those who ever had the privilege of knowing and working with.Her kind heart and bubbly positive attitude are how we will all remember her and the world is a less brighter place today because of this loss.Our condolences go out to all of her family and friends during this time.Rest in Peace Kirsten and thank you for being you.",
        "Mitchell was an in-ring competitor in Adelaide's Riot City Wrestling before moving to Melbourne, where she worked at Melbourne City Wrestling, during which time she competed against some of women's wrestling's biggest names - including Ripley (Demi Bennett), KC Cassidy (Cassie Lee), Shazza McKenzie and Toni Storm. ",
        "She has been described as a 'fierce, formidable and fearless' competitor whose work away from the big stage was integral in shaping the future of women's wrestling.'Behind the scenes, Kristen's contributions were irreplaceable,' Melbourne City Wrestling said in a statement. 'Leading the MCW Academy wearing many hats, a trainer, a mentor, she encouraged the next generation of talent to never give up and to follow their dreams. 'Our business, the entire Australian wrestling community, have lost a friend, a mentor, an irreplaceable person with an infectious smile, never ever giving up – 'it's a beautiful day to go after your dreams.' "
    ]
}