{
    "articleURL": "/news/article-12040197/Izabella-Nash-killed-Slacks-Creek-factory-fire-Brisbane-breathing-apparatus-failed.html",
    "content": [
        "Female firefighter has died after factory fire in BrisbaneIt's feared Izabella Nash's breathing apparatus failed A female firefighter has died after she became 'trapped' and 'ran out of air' when her breathing apparatus apparently failed in a factory fire at Slacks Creek, Brisbane.",
        "Izabella Nash, 46, suffered serious injuries after entering the inferno with a colleague about 2.30am on Tuesday before the pair were feared lost in the flames.Her fellow firie was rescued from the flames but it is believed Ms Nash ran out of oxygen.She is understood to have fallen unconscious inside the blazing building before being discovered and carried out by other firefighters. Ms Nash was rushed to the Royal Brisbane and Women’s Hospital, but was declared dead at 9.15pm on Tuesday. ",
        "The second firie, senior firefighter Lia Drew, remains in hospital in a serious but stable condition, suffering burns and smoke inhalation. Both were described as veteran firefighters with around 25 years of experience between them. A third male firefighter also in the fire managed to escape without injury.The two women are said to have been trapped on the second storey of the building as they tried to tackle the inferno.'They were upstairs for a while. The crews went to rescue them, they had to find them,' United Firefighters Union Queensland secretary John Oliver told the Courier-Mail.'We will look into every aspect of what went wrong - communications, whether the breathing apparatus failed or not, the types of areas that were posted to them.'It will all come out. I’m concerned for the firies that have gone down. I’m very concerned for the firefighters that rescued those firefighters.'",
        "Premier Annastacia Palaszczuk has promised a full investigation into the blaze and called Ms Nash’s death 'absolutely horrific'.",
        "'There’ll be an investigation about what caused that and how the tragedy happened,' said the Premier on Wednesday.'Our thoughts and prayers go out to her family and loved ones. It’s an absolute tragedy.'I know that her family came up from NSW to be with her and she was an experienced firefighter.' She added: 'It took 30 or 40 fire trucks to actually put out that blaze. Of course there will be more investigation.' Prime Minister Anthony Albanese said the tragedy was devastating.'Firefighter Izabella Nash’s tragic death is a cruel reminder of the risks and dangers firefighters confront every day,' he posted on Twitter.'Along with all Australians, I offer my deepest sympathies to Izabella’s family, friends and crew members in this time of grief and sorrow.'My thoughts are also with Lia Drew. We must never forget the bravery of firefighters who work to keep us all safe.'",
        "QFES Assistant Commissioner John Cawcutt said that the state's firefighters were made aware of her death via a broadcast over fire stations PAs.Flags will fly at half-mast at stations across the Queensland.Asst Cmsr Cawcutt revealed Ms Nash had been in the military prior to becoming a firefighter, based at Duntroon in Canberra. ",
        "'(She was) incredibly fit, (a) really, really fit person, very strong. She was always the first person out to check over equipment,' he told reporters.'You get junior firefighters who come to the station and she’d be the first person out showing them over (the equipment). She always had a good sort of smile about her, could take a joke and give it out as well. The crew she was attached to is really broken up.'She is outstanding. It is a true loss for us, one of those sorts of people who would walk into a station and the people would be attracted to her.'Tributes have been posted to the fallen firefighter online, with one commenting: 'RIP Izzy, your shift is over.' Another added: 'Rest easy Izabella, thank you for your service.'Former colleague Rob Boniwell revealed he had met Ms Nash when she was bidding to become a firefighter in 2014.'I interviewed Izzy for her role as a permanent firefighter and was proud to see her graduate from the school several years ago,' he posted on Facebook. 'In my 29 years of service I have never experienced a fellow firefighter from my own agency or service pay the ultimate sacrifice to protecting their communities. 'Until now.  My thoughts and prayers are with our Fire and Rescue friends, families and colleagues today and the immediate future. We are all feeling this sad loss. ",
        "'Rest in peace Izzy. You will be sadly missed.'",
        "An investigation has now been launched into the condition and operation of Ms Nash's breathing apparatus, while a probe is also underway into the cause of the fire.'It is very rare that our firefighters are injured in this way,' Queensland Fire and Emergency Service Deputy Commissioner Michael Wassing said. 'That's because of the enormity of the training and professionalism of our firefighters.'Ms Nash joined the Fire and Rescue Service in 2014 and served as a First Class Firefighter.'The thoughts of all QFES members are with Izzy's and Lia's families, friends and fellow crew members,' said a QFES spokesman.Queensland Premier Annastacia Palaszczuk said the tragedy brought home the dangers faced by emergency services personnel every day.'She was clearly devoted to her job, on the front line supporting her fellow Queenslanders,' said the premier. 'Izabella's passing is a terribly sad and poignant reminder of the dangers our front-line staff face on a daily basis.'Federal Treasurer and local MP Dr Jim Chalmers also paid tribute to Ms Nash, calling her an 'incredible young woman'.He added: 'The news has come through this morning that Isabella Nash lost her life protecting our community in that horrible fire in Slacks Creek.",
        "'This is another reminder of the courage, the selflessness and the commitment of people who are first responders.",
        "'That fire two nights ago was a dangerous fire. We've lost an incredible young woman. Selfless, committed and courageous.'Her loved ones and her work mates will be incredibly sad today and our community is heartbroken too.'State fire and emergency services minister Mark Ryan added: 'So sad to hear of the passing of firefighter Izabella Nash. With Izzy's passing, Queensland has lost a hero.'The thoughts of our entire state are with her family, friends and the broader fire and emergency services family,' Mr Ryan posted on Twitter.The cause of the fire at an event planning business, A Noble Event, is yet to be determined. "
    ]
}