{
    "articleURL": "/sport/football/article-12047069/Michail-Antonio-Callum-Wilson-left-STITCHES-Richarlisons-bad-luck.html",
    "content": [
        "The podcast co-host were in fits of laughter as they discussed Sunday's incidentIn reality, Richarlison's shirtless celebrations are few and far between Liverpool seal incredible 4-3 victory over dogged Spurs with Jota's late winner Michail Antonio and Callum Wilson could barely contain their laughter as they discussed Richarlison's over-the-top shirtless celebration after believing he has scored the equaliser for Tottenham at Anfield – moments before a goal from Diogo Jota saw the home side waltz away with the win. ",
        "Tottenham pulled off an impressive fightback after going 3-0 down against Liverpool on the road but even the Brazilian's late strike failed to secure a share of the points for the visitors. Spurs' £60million summer signing's goal was remarkably his first in the Premier League, having previously had two chalked off for offside against Fulham in September and Nottingham Forest in March. Discussing Sunday's incident on The Footballer's Football Podcast, the West Ham and Newcastle forwards couldn't help themselves from gently teasing their counterpart's exploits. Antonio did tip his hat to the Brazil international's confidence, however, saying that he 'rated' his commitment to a lavish goal celebration. ",
        "'He's scored four times this season,' Antonio began. 'Three of the times he's been offside [and] he's taken his top off four times this season. 'He's got four yellows – he's almost on a suspension,' Wilson added, before the pair dissolved into giggles. But neither Antonio nor Wilson is spot-on with their assessment of Richarlison's form. Although he has previously been handed a yellow card for removing his shirt after a disallowed goal, this only happened once, in the 2-1 home win against Fulham early in the season. Ryan Sessegnon was offside in the build-up to the goal that Richarlison scored in added time. ",
        "His ruled-out goal against Forest saw the forward shush the crowd in celebration, a move that was met with mass derision after VAR's intervention. Neither of his two goals against Marseille in the Champions League saw the player whip his jersey off, and the third booking that the player received this season came from an argument with the referee when Spurs faced West Ham in late August. 'I need to know,' Antonio continued, still in high spirits. 'Even his goal the other day was so close to being offside. This man, I swear to you, I rate him. Because he doesn't care. He doesn't care at all.  'Those moments there I understand taking your shirt off,' the Jamaica international went on, referencing the last-gasp nature of Richarlison's goal. 'I fully get it like. those moments there you have to take it off, you've got to run around.'But if Antonio had the 25-year-old's luck, he admitted that he would 'need to see – need to know, if I'm onside before I go nuts'. ",
        "The West Ham forward has had two goals struck from the scoresheet this season, with strikes against Nottingham Forest and Southampton overturned by VAR. Wilson had one disallowed for offside against Southampton on Sunday, but could console himself with a quick brace scored in an impressive cameo in the second half as his tremendous form for the Magpies rolls on. ",
        "Tottenham remain in dire need of a win as they look to regain form at the last an ensure European competition next season. They currently sit sixth in the Premier League table but Aston Villa in seventh are level with the side on points and Brighton are only two points behind, but with three games in hand over the north London outfit. "
    ]
}