{
    "articleURL": "/sport/football/article-12038129/David-Moyes-praises-Erling-Haalands-incredible-start-life-Premier-League.html",
    "content": [
        "Erling Haaland is one strike away from breaking the all-time goal scoring record David Moyes was full of praise for the Norwegian striker's physical attributes Pep Guardiola admits that even Man City are 'surprised' by Haaland's goals David Moyes labelled Erling Haaland as the icing on the cake for Manchester City as West Ham brace themselves to face the Premier League leaders on Wednesday.",
        "Haaland's penalty during City's 2-1 win over Fulham on Sunday made him the first player in top-flight English football since 1931 to score 50 goals in all competitions during a season.The Norwegian's brace in City's 2-0 win over the Hammers in August is fresh in the memory of Moyes who anticipates another challenging task when the sides meet.'They have got a great team and I think that's topped off by Haaland,' Moyes said.'He's the icing on the cake for them. I think they've got so many good players who can create chances, he's such a good finisher and if you get him in those right positions he's capable of scoring.'",
        "Haaland's debut Premier League season has seen him score a record-equalling 34 goals with six games still to go.Moyes lauded the 22-year-old's wide range of physical and technical attributes which have contributed to his success since his move from Borussia Dortmund last summer.'I think anybody can come into the Premier League and do well, but as well as that... it's incredible,' Moyes said.'I think they've got a team which can give this player great opportunities.'He's a terrific finisher, whether it's his head or his feet, running in behind or scoring inside the box, he certainly has all the attributes as a really top goalscorer.",
        "'He's got a team behind him that quite often try to make it easy for him to score.'Moyes is hoping VAR decisions are kinder to his side in the run-in after admitting recent decisions had seem him lose some faith in the system.The Hammers boss questioned why his side were not awarded a late penalty during their 2-1 defeat at home to Liverpool last week where it appeared Reds midfielder Thiago handled the ball in the box.",
        "And his frustrations doubled after Nayef Aguerd's challenge on Eberechi Eze saw Palace given a contentious penalty during their 4-3 victory over West Ham on Saturday.'I'd have to say yes on that (losing faith in VAR) but I would say I hope it doesn't all go one way and it changes around a little bit by the decisions going in your favour,' Moyes said'The last couple have been difficult to take I must say.'Prior to those setbacks against Liverpool and Palace, the Hammers had gone on a five-match unbeaten run that boosted their survival hopes and earned them a place in the Europa Conference League semi-finals.And Moyes, whose side sit four points above the relegation zone, said: 'Recently we've had a very good run.'The players have been trying to get back at it, they're doing a good job.",
        "'A week or so ago we had one of the best weeks we've had for a while so we're trying to build and continue on that. Overall I've been pleased with how the players are performing.'Following Wednesday's clash with City, Moyes and Co will take on Manchester United and Brentford in a difficult 15-day period - in which they will also play AZ Alkmaar in their Conference League semi-final. The Hammers will then conclude the season with games against relegation rivals Leeds and Leicester. Leeds travel to East London on Sunday May 21, before the Hammers make the trip to the KP Stadium to take on the Foxes, in a pair of games that will likely see all three sides fight for their Premier League survival. "
    ]
}