{
    "articleURL": "/tvshowbiz/article-12044969/Morena-Baccarin-rocks-colorful-look-New-York-City-special-screening-Guardians-3.html",
    "content": [
        "Actress Morena Baccarin took a mid-week break by attending the New York City special screening of Marvel's Guardians of the Galaxy Vol. 3.",
        "The 43-year-old actress hit the red carpet solo for the screening, held at iPic Theater in New York City on Wednesday.The outing comes just weeks after Baccarin's 2017 comments about her sex scene with Ryan Reynolds in Deadpool re-surfaced.The actress stepped out in a stunning pink sweater with a thin necklace with small pendants dangling from her neck.She accessorized with pearl earrings and rings on both hands as she walked the red carpet. ",
        "The Gotham star stepped out in a multi-colored short skirt that fell to her mid-thigh with black pantyhose.She completed her look with black boots for the red carpet appearance on Wednesday evening.Baccarin stepped out solo, and was not spotted with her husband, actor Ben McKenzie, who she celebrates her sixth wedding anniversary with in early June.The actress is no stranger to the Marvel Comics world, starring in the 20th Century Fox superhero adventure Deadpool, which broke box office records in 2016 as the highest-grossing R-rated movie worldwide ($782.6 million).She played Vanessa, the girlfriend of Wade Wilson (Ryan Reynolds), whose experimental cancer treatments gives him superhuman healing abilities, leading him to take up the superhero moniker Deadpool.During a 2017 interview with Conan O'Brien, Baccarin revealed she had a great time filming the movie as a whole... though she did not enjoy two days of sex scenes with Reynolds.",
        "'It was really fun... minus the two days of sex scenes, it was wonderful, the whole experience.'She added, 'It took two days to shoot the sex scene, because I think it was us making sweet love for an entire calendar year. So it was all the holidays, you know. So we dressed differently for every one.'",
        "Reynolds felt nearly the same way, opening up in a 2016 interview with The Fix about the sex scenes.'It's not as titillating as it is just sort of funny and horrifying at times,' Reynolds said, adding the filming of those scenes were, 'horrifying.''It was a year's worth of sex in one day. Which sounds a lot more romantic than it is, trust me,' he added.She is slated to return as Vanessa in Deadpool 3, which is currently in production. "
    ]
}