{
    "articleURL": "/tvshowbiz/article-12056893/Queen-Charlotte-Bridgerton-Story-creator-speaks-new-series.html",
    "content": [
        "The creator of Netflix's Queen Charlotte: A Bridgerton Story, Shonda Rhimes, has addressed the possibility of a second season of the series.",
        "A prequel of Bridgerton, the programme stars India Amarteifio as a Young Queen Charlotte, Corey Mylchreest as George and Arsema Thomas as a young Agatha.On a return for the show, Shonda, 53, told EW: 'There have been questions, but I’m not having conversations about it yet.'I could live with Charlotte and George forever, but we told a very specific, closed-ended story that I think is a complete tale of this complicated, imperfect love. But I’m not ruling anything out because I never know.'Actress Arsema, 28, also spoke about the possibility of a comeback: 'I never thought I could love like this until I had my own child. I feel like I gave birth, and Shonda Rhimes is her daddy. I am the mommy. It would be amazing to inhabit that space again.",
        "'But also where we’ve left her off now, she’s a good space. If that’s the last time I get to be her, she’s empowered and she’s ready to walk on her own two feet. But if I do get a call for doing it again, I will take it.'The spin-off series of Bridgerton charts Charlotte's rise to power and pivotal marriage to the king. The show its debut on streaming service Netflix May 4.‘This Bridgerton-verse prequel tells the story of how the young Queen’s marriage to King George sparked both a great love story and a societal shift, creating the world of the Ton inherited by the characters in Bridgerton,’ the description states.",
        "It comes after it emerged Kylie Minogue is among the actors who have been added to the ensemble cast of Shonda's upcoming Netflix series, The Residence.Created by Paul William Davies and inspired by the book The Residence: Inside The Private World Of The White House by Kate Andersen Brower, the series revolves around a murder scandal involving service staff of the White House.Kylie, 54, will be playing a version of herself in the murder-mystery drama, according to a number of publications such as Variety.The Melbourne, Australia native is just one of a number of stars that were added to an already stellar cast that includes Jane Curtin, James Babson, Eliza Coupe, Izzy Diaz, Paul Fitzgerald, Ros Gentle, Juliette Jeffers, Sumalee Montano, Brett Tucker, Nathan Lovejoy, E. L. Losada, Julieth Restrepo, Mel Rodriguez and Rebecca Field.They join previously announced main cast members Uzo Aduba, Andre Braugher, Susan Kelechi Watson, Jason Lee, Ken Marino, as well as Edwina Findley, Molly Griggs, Al Mitchell, Dan Perrault, Bronson Pinchot, Isiah Whitlock Jr., Mary Wiseman, Randall Park, Matt Oberg, E.L. Losada, Alexandra Siegel, Ryan Farrell and Barrett Foa. ",
        "The official logline reads: '132 rooms. 157 suspects. One dead body. One wildly eccentric detective. One disastrous State Dinner. The Residence is a screwball whodunnit set in the upstairs, downstairs, and backstairs of the White House, among the eclectic staff of the world's most famous mansion, according to Deadline.",
        "The Residence is part of a nine-figure deal between Netflix and Shonda Rhimes' production company Shondaland.Shonda will also serve as executive producer with Betsy Beers under the Shondaland banner.Along with creating the show for the streaming giant, Davies will also executive produce, on top of his duties as showrunner.The eight-episode series is currently in production, but so far there's no official word on when it will make its premiere on Netflix.Minogue most recently starred in the computer-animated adventure comedy film Back To The Outback (2021), while her last on-screen role was in the Australian comedySwing Safari, alongside Guy Pearce, Radha Mitchell, Julian McMahon, Asher Keddie and Jeremy Sims, among others.  While many fans around the world know her for her acclaimed singing career, Ther Spinning Around star actually got her start in show business as a television actress, beginning with period drama series The Sullivans (1979).She would eventually achieve recognition for her role in the Australian soap opera Neighbours (1986-1988), and then make her film debut in the coming-of-age drama The Delinquents (1989).",
        "The Melbourne, Australia native gained prominence as a recording artist in the late 1980s and released four dance-pop-influenced studio albums, starting with her debut Kylie (1988). Taking more creative control over her music in the 90, the The Can’t Get You Out Of My Head singer has continually shown the ability to reinvent her image while experimenting with a range of musical genres on her subsequent albums.",
        "Her last studio album, Disco (2020), was a commercial success, debuting at number one on record charts in her native Australia, the UK, Scotland and Ireland. It was also in the top ten in Germany, Switzerland, France, Spain, and New Zealand.As of 2020, Minogue is the highest-selling female Australian artist of all time, having sold over 80 million records worldwide."
    ]
}