{
    "articleURL": "/news/article-12041525/What-Stone-Destiny-used-King-Charles-Coronation.html",
    "content": [
        "MailOnline reveals all you need to know about the Stone of Destiny The Stone of Destiny has been the subject of intense speculation in the build-up to the coronation, over whether it will be used for King Charles' coronation. ",
        "Charles will be officially crowned as King on Saturday, 6 May, 2023, in a ceremony that will also see Camilla crowned Queen. Also known as the Stone of Scone, the Stone of Destiny has been an ancient symbol of Scotland's monarch for centuries. What exactly is the Stone of Destiny? Will the Stone of Destiny be used for the coronation of King Charles? Where is it located?Read on below for everything you need to know about the Stone of Destiny.  ",
        "What is the Stone of Destiny?The Stone of Destiny is an ancient symbol of Scotland’s monarchy. Also referred to as the Stone of Scone, it has been used for centuries in the inauguration of its kings. Seen as a sacred object, its earliest origins are now unknown. It has been stored in the Great Hall of Edinburgh Castle since 1996. Back in 1296, King Edward I of England seized the stone from the Scots, and had it built into a new throne at Westminster. From then on, it has been in the coronation ceremonies of the monarchs of England and Great Britain.Will the Stone of Destiny be used for the coronation?There has been much anticipation over the potential use of the Stone of Destiny at Charles' coronation, so deep are its historical ties to the monarchy. For the first time in over 25 years, the stone has left Scotland. It will be used at the coronation ceremony of King Charles, situated under the Coronation Chair. ",
        "The relic weighs nearly 20stone (125kg) but the team of six who carried it were lifting around 26stone (164kg) given the equipment needed to transport it from its current location in the Great Ja. The Coronation Chair was specially built with the stone underneath, and getting it back in will be a challenge.Where is the Stone of Destiny? The stone is more fragile than it appears, thanks to the fact that it was dropped when it was stolen from Westminster Abbey on Christmas Day in 1950 and had to be repaired. It was taken in a daring raid by Scottish nationalists Ian Hamilton, Gavin Vernon, Kay Matheson and Alan Stuart.Unprepared for its hefty weight, the group dropped it during the theft and it split in two.Amid a huge manhunt that led to the closure of the England-Scotland border, the two parts were spirited back north separately before being repaired.",
        "The police tracked the gang down when they discovered that Mr Hamilton had taken out books about the Stone and Westminster Abbey from Glasgow Mitchell Library.He later admitted: 'I'd researched the whole business there. They checked the records and found I had borrowed every book on Westminster Abbey.'The stone was finally found safe in April 1951. It had been placed on the altar at Arbroath Abbey, draped in a Saltire.",
        "The thieves were not prosecuted and the stone was back at Westminster Abbey in time for the Queen's Coronation in 1953.It remained there until 1996, where it returned to Scotland in a historic ceremony."
    ]
}