{
    "articleURL": "/news/article-12048123/Biden-demands-end-violence-Sudan-threatens-warring-factions-sanctions.html",
    "content": [
        "It is almost three weeks since two rival generals went to war in SudanOn Thursday, Biden signed an executive order preparing the way for sanctions 'The violence taking place in Sudan is a tragedy,' he said and called for ceasefirePresident Joe Biden moved closer on Thursday to issuing sanctions on Sudan's warring generals, saying they had 'betrayed' the Sudanese people and their demand for democracy.",
        "Regional experts have criticized Washington's role for failing to impose penalties after a 2021 coup, and accused the Biden administration of adding fuel to the fire with a Western-backed plan to reorganize the country's armed forces.On Thursday, Biden signed an executive order paving the way for future sanctions after almost three weeks of bitter fighting.'The violence taking place in Sudan is a tragedy — and it is a betrayal of the Sudanese people's clear demand for civilian government and a transition to democracy,' he said. 'I join the peace-loving people of Sudan and leaders around the world in calling for a durable ceasefire between the belligerent parties.'",
        "It came as South Sudan's foreign ministry announced a week-long ceasefire. But at least five other truces have come and gone without easing a growing humanitarian emergency. National Security Council spokesman John Kirby told reporters at the White House that the executive order was not so much a warning as an authorization for the Treasury to consider whether sanctions would be appropriate.'If these two military factions, the leaders of them, really desire for peace and security, if they really have the Sudanese people at their heart, then they should stop fighting,' Kirby said. 'They should put the arms down, abide by the ceasefire as they've committed to, and start to get back to the table so we can see a transition to civilian authority.'",
        "Shelling rocked the capital Khartoum again on Thursday, disrupting efforts to deliver much need humanitarian aid to war-weary residents.The fighting pits the head of the Sudanese Armed Forces (S.A.F.) Gen. Abdel Fattah al-Burhan against his former ally Gen. Mohamed Hamdan Dagalo, better known as Hemedti, who leads the Rapid Support Forces (R.S.F.) paramilitary outfit.Each has blamed the other for violating ceasefires. And each claimed their forces had been targeted by attacks on Thursday.The sanctions announcement was greeted as opportunity missed by some analysts who say that local reporting suggests that the R.S.F. is implicated in more attacks on hospitals, aid agencies and civilian infrastructure than the S.A.F.",
        "'The instinct in these sanctions announcements, and US diplomacy generally, is to give the illusion of even-handedness in a vain and, ultimately, self-defeating attempt to preserve access to both sides,' said Cameron Hudson, of the Center for Strategic and International Studies, on Twitter.'But again, the crimes being committed and the conduct of the forces are qualitatively different, from what I see. 'Only one side that I can tell is destroying civilian infrastructure like hospitals or water stations. Only one side is committing sexual assault. Only one side has targeted diplomatic staff. 'And only one side is trying to protect people in areas they control.'",
        "At least 100,000 people have already fled to other countries.And there is no end in sight, according to Director of National Intelligence Avril Haines, who appeared before the Senate Armed Services Committee.Both sides, she said, had little interest in peace talks when both believe they can win on the battlefield. 'The fighting in Sudan between the Sudanese armed forces and the Rapid Support Forces is we assess likely to be protracted as both sides believe they can win militarily and have few incentives to come to the negotiating table,' she said. "
    ]
}