{
    "articleURL": "/news/article-12042275/Fatter-cats-Americas-CEOs-earn-288-times-employees.html",
    "content": [
        "Big stock awards helped the elite club of top CEOs bank more cash last year  Private sector workers only saw a 3.6 percent pay bump, losing out to inflation The widening pay gap will 'be scrutinized in the public eye,' researchers warn The bosses of America's top firms are getting pay bumps — but you're not.",
        "The average pay for top CEOs jumped 7.7 percent last year to a record $22.3 million, new research shows, as big stock awards helped the elite club stay ahead of inflation while American workers' pay fell behind.Among those getting the biggest pay bumps were the CEOs of Jefferies Financial Group and Prologis, according to the study released on Wednesday by Equilar, which tracks corporate titans.The top earners overall were Barry McCarthy, who took over the money-losing exercise bike maker Peloton last year, with a $168 million package, and Apple's Tim Cook, who nets close to $100 million.The study reviewed the 100 highest paid CEOs at US public companies with revenue of $1 billion or more that reported compensation as of March 31.",
        "A similar review last year showed a 31 percent pay increase for CEOs for 2021.Pay among the CEOs also rose faster than for US workers in 2022 despite a tight labor market.According to the US Bureau of Labor Statistics, the average private sector worker earned $1,132 per week in December — an annual salary of roughly $58,864 — which was up only 3.6 percent from a year earlier.That means CEOs were beating inflation, which saw consumer prices rise by 6.5 percent last year, while the average workers watched their earnings shrink.",
        "Some workers even thought twice about buying everyday basics, like eggs, which jumped in price by about 70 percent.The CEOs' higher gains increased the 'pay ratio' between the bosses and their employees.The CEOs in the study ended the year earning 288 times the average pay of their workers. That's up from 254 times in 2021.Controversially, those pay gains came in a year when the total return of the S&amp;P 500 was down 18 percent as the Federal Reserve's rate hikes slowed economic growth.The companies featured in this study fared slightly better — their valuations fell by 11 percent.'With CEO compensation continuing its upward climb, the ratio will continue to be scrutinized in the public eye,' Amit Batish, an Equilar content director, wrote in the report.Boosting the CEOs' pay gains were stock awards that have become a centerpiece of US executive compensation — but not as much for employees.The median value of a CEO's stock awards rose 20 percent to $13.8 million for 2022.One of the biggest pay increases went to Jefferies CEO Richard Handler, whose $56.9 million received last year was nearly double his total compensation in 2021.Most of the pay, $25 million, reflected a one-time 'leadership continuity grant' of restricted stock, Jefferies' proxy states. ",
        "At the company's March 29 shareholder meeting, only a slim majority, 59 percent, of votes cast backed the pay.",
        "The company has said this was in response to shareholder feedback.Another big gain went to Hamid Moghadam, CEO of logistics real estate company Prologis, whose $48.2 million total compensation last year was 93 percent more than the year before, driven mainly by stock awards.A Prologis spokesperson said this was 'performance based' and reflected the business exceeding three-year goals, creating value for investors. Founder Moghadam for years took a salary of just $1.This growing divide between the pay of top executives and regular wage slaves has sparked outrage among many Americans, who say it spotlights broader inequality and unfairness across society.Some argue that such vast differences in pay are not only unjust, but also hurt the economy, as massive CEO salaries take away cash that could be spent on research and development or staff training.Defenders of the system argue that CEO compensation reflects America's brutally competitive market.They say that companies must offer top salaries to attract the best talent, and that the high salaries of CEOs are necessary to incentivize them to make the tough decisions required to grow the business.Reuters contributed to this report. "
    ]
}