{
    "articleURL": "/wires/pa/article-12059927/For-certain-I-want-job--Rochdale-interim-boss-Jimmy-McNulty.html",
    "content": [
        "Interim manager Jimmy McNulty is hoping to take charge of relegated Rochdale on a permanent basis next season.",
        "Dale ended 102 years as an EFL club with a 1-1 draw at Harrogate, with Jimmy Keohane’s first-half goal cancelled out by a Toby Sims effort after the break.But the Lancashire outfit have at least been relegated with a semblance of pride under McNulty, who oversaw three wins and three draws during the final eight fixtures of the campaign.On his hopes of staying at the Spotland helm in the National League next term, McNulty said: “The club want to go through a thorough recruitment process and I think that’s good. It’s what should be done.“It’s partly my doing too because, every time the club have wanted to speak to me about the situation, I’ve just wanted to concentrate on the players and the next game. But I know the club want a head coach and, for certain, I want the job.“We’ve got six results from the last eight games, which no-one would have said we could have done, so I’m happy with how it’s gone and when it’s my turn, I’ll be speaking to the club in the next few days about how we move forward.”",
        "Delivering his verdict on the game, McNulty added: “It was a good away point and I’d like to know how many passes led to our goal, because I really enjoyed watching it.",
        "“We just looked a bit tired in the second half and it showed how short we are as a squad because we had no real options to help out.”Harrogate finished nine points clear of the bottom two, having lost just one of their final 10 fixtures after flirting with relegation for long periods of the campaign.Boss Simon Weaver said: “I’m hoping the form we’ve been on can launch us into next season because we had gone through some hardship and the eye of a storm.“Lessons will need to be learned but this group of players have shown now that they can hold their nerve under pressure. Our supporters have also stayed loyal and they realise the journey that we’ve been on.“It’s been difficult at times because we’ve had a series of bad runs but that’s when you find out the most about your friends and fans and they have stood by us.”He also praised right-back Sims, who scored his first goal in the English pro game having made the unlikely switch from US second-tier outfit Pittsburgh Riverhounds in January.“It’s easy to think that a move won’t work because he’s 25 and hasn’t played at this level before,” Weaver acknowledged.“But I think we’ve got a gem in Toby and there’s no player I would have wanted more to score our final goal of the season.”"
    ]
}