{
    "articleURL": "/wires/pa/article-12042617/Yousaf-dismisses-Salmond-s-Stone-Destiny-standoff-plan.html",
    "content": [
        "Humza Yousaf has dismissed Alex Salmond’s suggestion that police should have been used to prevent the Stone of Destiny being moved from Edinburgh Castle.",
        "The First Minister said the ancient stone is “all (Mr Salmond’s) been talking about” recently.The Alba Party leader had said that Scottish police should have staged a “standoff” outside Edinburgh Castle, preventing the historic artefact from being moved to London for the King’s coronation.He said such a move could have been used as a bargaining tool in the push for a second independence referendum.",
        "The stone was taken to London last week to be used in the coronation, with Mr Yousaf attending a ceremony during which it was removed from its resting place at Edinburgh Castle.The stone has been used to crown monarchs of Scotland – and later the UK – in a tradition dating back centuries.Mr Yousaf was asked about the former first minister’s comments as he spoke to journalists at an anti-poverty summit in Edinburgh on Wednesday.He said: “Alex Salmond should remember of course that operational matters are for Police Scotland.“It’s not for the First Minister to tell the police what to do, but of course it wouldn’t have been the right thing to do even if those powers did exist.“Alex Salmond can sit there and talk about the Stone of Destiny all day long.",
        "“It seems it’s all he’s been talking about over the last few weeks.",
        "“I’m committed to talking about reducing poverty, the cost-of-living crisis, investing in our public services.”Mr Salmond, a former SNP leader who is now a vocal critic of the party, said he would be speaking at a pro-independence rally on Saturday – the day of the coronation.He told Andrew Marr on Tuesday: “You don’t command very much as first minister of Scotland, but you do command the Scottish police force, you could have put a ring of policemen around Edinburgh Castle.“Have a standoff on the Esplanade and politely explain to the world that Scotland should not sacrifice its symbol of sovereignty until that sovereignty is at least recognised by Westminster.”"
    ]
}