{
    "articleURL": "/wires/reuters/article-12058501/Reuters-Sports-News-Summary.html",
    "content": [
        "Following is a summary of current sports news briefs.",
        "Tennis-Alcaraz set to reclaim number one spot in Rome after Madrid triumphCarlos Alcaraz is raring to get to Italy next week to compete in the Rome Masters for the first time in his career and reclaim the world number one spot from Novak Djokovic. After retaining his title in Madrid on Sunday by beating lucky loser Jan-Lennard Struff 6-4 3-6 6-3, Alcaraz only has to show up and play in Rome to leapfrog Djokovic.Rugby-Wallabies flyhalf Cooper returns as Gordon, Lolesio go head-to-headWallabies flyhalf Quade Cooper played his first meaningful minutes of rugby for more than nine months in Japan at the weekend, while coach Eddie Jones watched two other contenders for the gold number 10 shirt go head-to-head in Melbourne. Jones has made it clear since his return as coach that Cooper is very much in his plans for the World Cup later this year, but which other flyhalves will be in his squad for France is a matter of some conjecture.Boxing-Top fighters unwilling to put legacy on the line - PaulJake Paul said top boxers are too focused on protecting their undefeated records and should be more willing to sign up for high-profile fights. Britain's Tyson Fury and Ukraine's Oleksandr Usyk agreed late last year to a heavyweight unification title fight but the talks broke down in March.",
        "Motor racing-Drivers unimpressed by F1 plans for more splashy introsFormula One has decided that a big show needs a big introduction and the Miami Grand Prix opened with a bang on Sunday as drivers appeared through a line of pompom-waving cheerleaders and a 30-piece orchestra provided a musical backdrop. That over-the-top scene seemed to go down quite well with fans but left drivers unimpressed, with some looking unsure of what to do beyond wave and smile.Chinese premier urges IOC to oppose politicization of sportsChina wants to work with the International Olympic Committee (IOC) to oppose the politicization of sports, Premier Li Qiang said, amid demands on the sporting body to exclude athletes from Russia in the wake of its invasion of Ukraine. Premier Li made the comments at a meeting with IOC head Thomas Bach in Beijing over the weekend, according to the state-run Xinhua news agency.MLB roundup: Down 6, Rays stun Gerrit Cole, YanksIsaac Paredes hit an RBI single with one out in the 10th inning to lift the Tampa Bay Rays to an 8-7 comeback win against the New York Yankees in the rubber game of their three-game series on Sunday in St. Petersburg, Fla. Paredes hit an opposite-field line drive to right off Albert Abreu (1-1) to score Brandon Lowe from second base.",
        "Tennis-Nadal missing French Open would be 'brutal' for the sport - FedererRoger Federer said he hopes Rafa Nadal will recover in time for the French Open and that it would be a \"brutal\" blow for tennis if the 14-time Roland Garros champion is absent this year. Nadal has been dealing with a hip injury he suffered at the Australian Open in January, and fears that the Spaniard may miss the Paris Grand Slam grew after he pulled out of this week's Italian Open.NBA-Harden says 76ers taking confidence on the road after leveling seriesThe Philadelphia 76ers hit the road to Boston with \"huge confidence\" this week after winning Game 4 116-115 against the Celtics on Sunday to level their conference semi-final series courtesy of another clutch three-pointer from James Harden. The 10-times NBA All-Star pushed the game into overtime with a floating jump shot and sealed it with 18 seconds left in overtime with a 24-foot jumper off an assist from newly minted MVP Joel Embiid.Soccer-Ten Hag backs De Gea after his error hands West Ham 1-0 winManchester United manager Erik ten Hag said he has full belief in goalkeeper David de Gea despite the Spaniard's error handing West Ham United a 1-0 victory in the Premier League on Sunday. De Gea let a tame first-half effort from Said Benrahma slip into the net as United suffered their second straight league defeat. They remain fourth and a point above Liverpool, who have played a game more.",
        "Soccer-Chelsea ease Australian fears over Kerr injuryChelsea manager Emma Hayes has moved to ease Australian fears over the fitness of Sam Kerr ahead of the Women's World Cup after the Matildas striker was withdrawn after half an hour of the London club's Women's Super League match on Sunday. Kerr is crucial to Australia's hopes of going deep in the tournament, which the country is co-hosting with New Zealand from July 20 to Aug. 20 this year."
    ]
}