{
    "articleURL": "/wires/aap/article-12049231/Why-Sydney-celebration-fair-game-Nieuwenhof.html",
    "content": [
        "There's an unwritten rule in football that you don't celebrate against your former club.",
        "But for Western Sydney midfielder Calem Nieuwenhof the joy of scoring against Sydney FC in the most recent derby was too much to handle.The 22-year-old unleashed a powerful 25-yard rocket past Andrew Redmayne as the Wanderers smashed their bitter rivals 4-0 back in March.The fact Nieuwenhof, who grew up as a Sydney supporter and came through their academy, was assisted by Milos Ninkovic and celebrated with a triumphant scream would have made it extra hard for Sky Blues fans to stomach.The two sides renew their rivalry in Saturday's A-League Men elimination final but Nieuwenhof said the thought of a muted celebration never crossed his mind.\"I just took a chance and I was lucky enough that it went in so I couldn't be happier with how that went,\" Nieuwenhof told AAP.\"I think it's a bit different, maybe me celebrating against Sydney compared to Ninkovic or someone else celebrating.\"I wasn't exactly a massive part of the club when I was there.\"But I was just really happy in the moment and I couldn't have been happier to score for the Wanderers, it was an awesome moment for me.\"Goals are becoming an increasing part of Nieuwenhof's repertoire, with the midfielder playing in an advanced role since the arrival of former Manchester United and Everton midfielder Morgan Schneiderlin.",
        "It's why Wanderers boss Marko Rudan, who usually errs against hyping his young players up, said without prompt that the midfielder deserved to be in the conversation for a maiden Socceroos call-up.\"It means a lot to get high praise from him,\" Nieuwenhof said.\"He's spoken to me throughout the season and said how much trust and belief he has in me.\"I couldn't be more grateful to have a coach that really believes in me and wants me to do well.\"This is my first real consistent season at A-League level and I feel I can add so much more to my game.\"Just six days before Saturday's derby, Nieuwenhof was at CommBank stadium watching his partner Rachel Lowe win the grand final with Sydney's A-League Women side.Now he wants to end Sydney's final hopes in the A-League Men and push the Wanderers a step closer to silverware of their own.\"It's a massive game, the fact that it's Sydney derby gives it so much more (meaning) for not only us but the fans,\" he said.\"We know how much this game means to them all and we know this isn't just any normal game.\"This is more than just a game.\"We're really pumped to go out there and give it our all this weekend.\""
    ]
}