{
    "articleURL": "/wires/ap/article-12048269/Research-monkey-shortage-undermines-US-readiness-panel-says.html",
    "content": [
        "There´s a shortage of monkeys available for medical research and the U.S. should expand its breeding programs rather than rely on international suppliers to solve it, an influential scientific advisory panel said Thursday.",
        "Studies using nonhuman primates, especially monkeys, have been critical to lifesaving medical advances - including creating vaccines against COVID-19 - because of their similarities to people. The U.S. funds colonies at national primate centers but supplies were tight and more animals were regularly imported even before the pandemic.Then China, once a leading supplier, ended exports of research monkeys in 2020, as scientists everywhere needed more for coronavirus studies. And last fall, the U.S. filed charges to stop a Cambodian smuggling ring accused of shipping endangered wild monkeys in place of those bred for research, further constraining supplies.Thursday's report examined only research funded by the National Institutes of Health, deemed key to responding to public health emergencies - not drug company or other publicly or privately funded research with monkeys.The nation´s preparedness is undermined by having to depend on imports of these animals, which are especially important for infectious disease research and neuroscience, said a panel of the National Academies of Sciences, Engineering and Medicine. Highlighting that vulnerability, the U.S. experienced a 20% drop in imports of one species, cynomolgus macaques, when China suddenly stopped shipping.The panel also called for more development of alternatives to monkey testing - and in the meantime urged better scientific collaboration to make the best use of each research animal.",
        "\"If the U.S. is to produce high-impact biomedical research and have a research infrastructure capable of responding to the next public health crisis, now is the time to strengthen the systems we need for nonhuman primate research,\" said committee chairman Dr. Kenneth Ramos of Texas A&amp;M University.Use of animals in biomedical research, especially nonhuman primates, is controversial. Under pressure, the NIH already retired chimpanzees, humans´ closest relatives, from invasive research but has maintained there´s still need for monkeys. Nonhuman primates represent 0.5% of all the animals used in biomedical research in the U.S., the report said.In a survey of NIH-supported researchers, the National Academies panel found 64% reported challenges in getting nonhuman primates required for their work, including increased wait times and cost. In 2021, the National Primate Research Centers had such a shortage of monkeys never used in previous studies that it couldn´t meet two-thirds of researcher requests, the report said.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}