{
    "articleURL": "/news/article-12048539/AOC-calls-Jordan-Neelys-subway-death-public-execution.html",
    "content": [
        "Jordan Neely, 30, was choked to death on Monday on the New York City subway by a U.S. Marine veteran, who restrained Neely when he became agitatedNeely's death was ruled a homicide on Wednesday, and now activists are calling for those responsible to be chargedEric Adams said it was 'irresponsible' for Neely's death to be called murder, but his fellow Democrat, Alexandria Ocasio-Cortez, said it was 'a public execution' Alexandria Ocasio-Cortez has described the death of a man on the New York City subway as 'a public execution', as calls mount for the person responsible to be criminally charged.",
        "Jordan Neely, 30, died on Monday on the subway after being put in a chokehold by a U.S. Marine veteran.Neely, who was well known as a Michael Jackson impersonator entertaining passengers on the train, was in the midst of a mental health episode, and was reportedly marching up and down the train carriage ranting.Neely had autism and schizophrenia and had been arrested 42 times in the past, including for punching a 67-year-old woman in the face. On Wednesday, Neely's death was ruled a homicide, and the Manhattan district attorney is now weighing up whether to bring charges.Ocasio-Cortez has led the outrage over Neely's killing, and tweeted on Thursday: 'Leaders want to raise his record as if that warrants a public execution on the subway? What have we come to?'",
        "The New York congresswoman was criticized by New York City's mayor, Eric Adams, who said it was 'irresponsible' of her to describe Neely's killing as murder, before an official inquiry was completed.Yet Ocasio-Cortez on Thursday continued to demand justice for Neely.'I have yet to hear a real explanation from any official hesitating to condemn the killing of Jordan Neely about what makes condemning this violence so 'complicated',' she tweeted.'Killing is wrong. Killing the poor is wrong. Killing the mentally ill is wrong. Why is that so hard to say?'",
        "Juan Alberto Vasquez, who was on the train and filmed the chokehold, said Neely yelled: 'I don't have food, I don't have a drink, I'm fed up. I don't mind going to jail and getting life in prison. I'm ready to die.' Ocasio-Cortez tweeted: 'Neely's last words were literally about how going to jail was easier than accessing the social safety net support to get back on his feet and lead a life. Yet leaders want to raise his record as if that warrants a public execution on the subway? What have we come to?'She added: 'I represent Rikers. 'I cannot tell you how many times I've heard from both COs and the incarcerated that there are people who commit petty crimes because their easiest way to get a bed and doctor. For many vulnerable communities - especially the mentally ill - we make living in jail easier than living out of it. 'That's what happen when we defund everything but the carceral state.'The Manhattan district attorney's office said in a statement: 'As part of our rigorous ongoing investigation, we will review the Medical Examiner's report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records.'Governor Kathy Hochul on Wednesday addressed the video saying it was 'deeply disturbing' - but declined to say if the state would be investigating it as a criminal matter. ",
        "Witnesses say Neely was yelling at fellow passengers and throwing garbage at them at 2.30pm on Monday while traveling on an F train heading towards Broadway Lafayette station. A fight between him and other passengers ensued, which led to the Marine putting him in a chokehold to restrain him. A video that begins once their train is already in the station shows the men restraining him for two minutes and 20 seconds. ",
        "Neely is writhing on the ground, but does not make any audible pleas for help. In addition to the Marine, two other men are standing over him, and two women are watching nearby. None of those standing around him raised concern about his breathing or his neck.At the end of the video, one of the men asks: 'Did somebody call the cops?' Neely was taken to Lenox Hill hospital where he was pronounced dead. His family say he was troubled after the murder of his mother.  ",
        "Neely's father told the New York Daily News in an interview that his son became a 'complete mess' after his mother was strangled to death by his stepfather in 2007. Earlier, Mayor Adams said that Neely's death was 'tragic' adding 'there's a lot we don't know about what happened here.''However, we do know that there were serious mental health issues in play here, which is why our administration has made record investments in providing care to those who need it and getting people off the streets and the subways, and out of dangerous situations,' the mayor went on.  ",
        "The homeless man's father Andre Zachery said: 'Jordan was a good man. 'He was a good person. He grew up good. He always had a (temper), but he never used to hurt anyone... He wasn't bad. He was beautiful.' Zachery said that his son began mimicking Michael Jackson at the age of four or five. 'He looked just like him. He used to perform on the block. One day, people were loving him. Michael!,' he said. Zachery went on to say that he had not seen his son for four years, adding that his son was autistic, rarely taking his medication, making it difficult for him to find work and was a high school drop out. The last contact he had with Neely was a letter that his son sent him from prison. It read in part: 'Dad, I disobeyed you. And I'm sorry.' After Neely's mother was killed by his stepfather, Shawn Southerland, Zachery said his son 'didn't care anymore.''Once his mother died ... They were very close. He loved her so much that he just lost it. 'After we buried her, he just wasn’t the same anymore,' he added. ",
        "Neely's aunt Carolyn echoed his father's statements in an interview with the New York Post. 'My sister Christie was murdered in ‘07 and after that, he has never been the same.",
        "'It had a big impact on him. He developed depression and it grew and became more serious. He was schizophrenic, PTSD. Doctors knew his condition and he needed to be treated for that,' Carolyn Neely said. 'The whole system just failed him. He fell through the cracks of the system,' she added. A family friend told the newspaper that Neely 'suffered so much because of what happened to his mother. She was his sole support. His father sure wasn't.' That friend said that Neely attempted to live with his father on multiple occasions but the pair did not get along. In 2012, Neely was called to testify in the murder trial against the man who murdered his mother in Bayonne, New Jersey, reported NJ.com at the time.According to the testimony, Neely attempted to say goodbye to his mother one morning before going off to school. He said that Southerland blocked him from going into the bedroom, padlocking it. The following day, Neely said Southerland moved out of the home and he never saw him again. He was 14 at the time. The suspect was on the run for two years between 2007 and 2009 until he was finally arrested hiding out in a suburb in Philadelphia. Christie Neely's body was found on the shoulder of a Bronx highway in a suitcase.  Her cause of death was strangulation. ",
        "'The relationship had been crazy...a fight every day... Like I say, it was every day,' Neely testified. During the trial, Southerland, who attended law school for a time, represented himself and even cross-examined the teenage Neely. In his questioning, Neely insinuated that the boy's mother had been unfaithful. ",
        "Southerland was found guilty and sentenced to 30 years in prison. His most recent appeal failed in January 2022, according to NJ.com.  A Daily News article from the time of her death referred to Christie Neely as an 'ageless beauty' who grew up in Manhattan's Washington Heights section and had since moved to New Jersey. The piece described Shawn Southerland as a jealous partner who had been working as a golf caddie in Bayonne. At the time of her death, Christie had been working as a telemarketer. Her mother, Clara Neely, told the Daily News that her grandson had told her before Christie's body was found: 'I know he killed my mother. I can't take it.' Her father, Clarence said: 'She was beautiful. She didn't age.' ",
        "Two years after his mother's death, Neely's Michael Jackson act was covered by the Daily News. 'He means everything to me. When he died it was one of the saddest days since 9/11. I just want to see him do it one more time.'Video of the altercation that killed Neely posted online showed the 24-year-old Marine lying beneath the homeless man, holding him in a headlock position for several minutes as Neely tried and failed to break free.A second passenger pinned Neely's arms while a third held down his shoulder. It was unclear why the group had moved to restrain him. Neely lost consciousness and was pronounced dead at a Manhattan hospital shortly afterwards.The subduer was taken into custody and released without charges. His name has not been released publicly. A spokesperson for the Manhattan district attorney said an investigation was ongoing. On Wednesday, protesters began assembling at New York City's Broadway-Lafayette subway station, where Neely was taken to the hospital from, to protest his death. Chants of 'black lives matter,' 'justice for Jordan Neely,' 'F*** Eric Adams' and 'the homeless matter' could be heard.NYPD officers could be seen entering the subway platform carrying bundles of zip-ties.Contacted by the New York Daily News on Wednesday, the Marine refused to answer questions.'I'm not answering any questions. I appreciate it, but I'm not answering any questions,' he said.Neely's death comes amid a period of heightened public attention to both homelessness and mental illness on New York City's streets and subways.Following several high-profile incidents, including a shooting on a subway that left 10 people wounded last year, Mayor Adams promised to deploy additional police officers and mental health workers throughout the transit system."
    ]
}