{
    "articleURL": "/wires/ap/article-12059121/Tanked-Biden-pick-highlights-escalation-dark-money-forces.html",
    "content": [
        "WASHINGTON (AP) - When President Joe Biden nominated Gigi Sohn to serve on the Federal Communications Commission, the longtime consumer advocate expected to face criticism over her desire to expand free internet access and improve competition among broadband providers.",
        "Instead, Sohn found herself the target of an aggressive campaign funded by a conservative group that doesn´t have to disclose its donors. The American Accountability Foundation called Sohn too partisan, anti-police and soft on sex trafficking. The attacks landed - to the point that even some Democrats abandoned her. Sohn withdrew her nomination, ditching her fight for a five-year term as an FCC commissioner.\"Look, I´m not naive. I´ve been a consumer advocate my whole career. I knew I was going to get some opposition,\" Sohn told The Associated Press. \"Now, did I expect what was to come - the dark money, the lies, the caricatures? No.\"The battle over the nomination is the latest example of how organizations with political and financial agendas have been able to sway public opinion by deploying donations that are impossible to trace. It is also emblematic of how nominees' missteps - even on matters wholly unrelated to their prospective jobs - can become fodder for attacks.In Sohn´s case, the stakes were high. Her confirmation would´ve ended a 2-2 split on the commission, enabling Biden's administration to pursue its agenda of making communication networks more equitable. Sohn has been a vocal advocate of such regulations, which have been aggressively opposed by the telecom industry.",
        "Sohn was not likely to coast to confirmation. Moderate Democrats were going to have trouble justifying their support for a nominee who had assisted controversial liberal groups, seemed to endorse tweets critical of police and accused Fox News of being \"state-sponsored propaganda.\"",
        "When Sen. Joe Manchin of West Virginia announced his opposition to the nomination in March, the moderate Democrat cited Sohn´s \"partisan activism, inflammatory statements online, and work with far-left groups.\"Even so, outside groups left nothing to chance. Just two of those organizations spent at least $420,000 on ads seeking to torpedo Sohn's confirmation, a sum that is likely a fraction of the total spent.Central to the advertising offensive was the American Accountability Foundation, which produced an advertising blitz assailing the nominee on Facebook, as well as in newspapers and on billboards.Another group, co-founded by a former Democratic senator, said it spent \"six figures\" on ads arguing that Sohn was \"the wrong choice for the FCC and rural America.\" The National Fraternal Order of Police also joined the fray, chastising Sohn over endorsing social media posts that were critical of law enforcement.Opposing nominations is hardly new in American politics. But a 2010 ruling by the Supreme Court freed corporations and unions to spend unlimited amounts on political campaigns and nomination fights. The Citizens United ruling also opened the door to an influx of untraceable donations, known as \"dark money,\" to special interest groups seeking to influence policy, elections and nominations.",
        "Norman Ornstein, a senior fellow emeritus at the American Enterprise Institute, said such dark-money groups are growing so powerful that they can \"hamstring or stymie an entire administration\" by discouraging qualified people from accepting nominations.Sohn´s nomination was meant to be historic. If confirmed, Sohn would have been the FCC´s first openly LGBTQ+ commissioner. When the White House announced her nomination in October 2021, it hailed her trailblazing biography and called her a consumer advocate who would \"defend and preserve the fundamental competition and innovation policies that have made broadband Internet access more ubiquitous.\"When Congress failed to confirm Sohn during its last term, Biden didn´t give up. In January, he renominated her to the post.Sohn was a favorite of progressives and had served as a top adviser for Tom Wheeler, the Obama-era FCC chair who enacted net neutrality rules that were jettisoned during the Trump administration. Such regulations would have required AT&amp;T, Comcast, Verizon and other internet providers to treat all web traffic equally. The telecommunications industry has battled such rules, arguing they are illegal and overly burdensome.Some business groups pounced at the possibility of Sohn joining the FCC. The U.S. Chamber of Commerce, the world´s largest business federation, said this year that it opposed Sohn´s confirmation \"due to her longtime advocacy of overly aggressive and combative regulation of the communications sector.\"",
        "Telecommunications companies and their trade organizations took a less combative approach, at least in public. Some even congratulated her on her nomination.It is not known whether those companies donated dark money to groups that attacked Sohn. A spokeswoman for USTelecom, a national trade association on broadband, said the group and its \"members did not take a position on Ms. Sohn´s nomination.\"Behind the scenes, however, the industry´s lobbyists worked hard to kill the nomination, according to Sohn and her allies. Telecom companies are among the nation's biggest spenders on lobbyists, with the industry shelling out $117 million last year to influence lawmakers and administration officials, according to OpenSecrets.In her withdrawal letter, Sohn blamed her failed nomination on \"legions of cable and media industry lobbyists, their bought-and-paid-for surrogates, and dark money political groups with bottomless pockets.\"\"It was a perfect storm of, you know, industry interests,\" Sohn told the AP in an interview last month at Georgetown Law School, where she is a fellow at its Institute for Technology Law &amp; Policy.At least three Democratic lawmakers agreed with Sohn´s assessment, describing her nomination as a proxy fight over the future of free broadband.\"If affordable broadband gets deployed anywhere, then somehow more affordable broadband might get deployed everywhere,\" Sen. Maria Cantwell, D-Wash., the chair of the Senate Commerce Committee, said at Sohn´s February confirmation hearing. \"So I think there´s probably billions of dollars at stake here, and that is why the vitriol is coming at you.\"",
        "Sohn took particular umbrage with the campaign waged by the American Accountability Foundation. The nonprofit boasted it spent \"hundreds of thousands of dollars\" on advertising to \"educate the American people how wrong she was for the position.\"The AAF dished out more than $320,000 on Facebook advertising, according a review of advertising data by the AP. Such ads blasted Sohn over her connections to two liberal groups and suggested she opposed stiffening sex-trafficking laws. An ad alleged she was a \"complete political ideologue.\"The organization targeted most of its advertising in states where moderate Democratic senators are up for reelection next year, including Nevada, Arizona and Montana. In the closely divided Senate, nominees have little margin for error. They can lose only one Democratic vote if all Republican senators oppose them.It is unknown how much AAF spent on traditional advertising, which included ads in newspapers and on billboards. One of those billboards was on the Las Vegas Strip, looming above an illuminated sign of two showgirls replete with feathered headdresses.The billboard called Sohn \"too extreme\" for the FCC and provided information for people to contact AAF. The likely target of that ad was not tourists but Sen. Jacky Rosen, a moderate Democrat seeking reelection next year.AAF also promoted criticism of Sohn over Twitter posts in 2020 that suggested she supported the \"defund the police\" movement and agreed with a tweet that alleged police were \"armed goons with tear gas.\"",
        "Tom Jones, the group's executive director, declined an interview request. In an email, he declined to name the the organization's donors, noting only that they are \"G-d fearing Patriots!\"\"We´re guided by traditional American values,\" wrote Jones, a veteran Republican operative who led opposition research for Sen. Ted Cruz, R-Texas, during his failed 2016 presidential run. His group has led similar campaigns against other nominees who later withdrew from such posts as Federal Aviation Administration administrator, vice chair for supervision of the Federal Reserve Board, director of the Bureau of Alcohol, Tobacco, Firearms and Explosives and the comptroller of the currency.Jones´ group was joined in its campaign against Sohn by other organizations, including one led by Heidi Heitkamp, a former Democratic senator from North Dakota.Heitkamp's advocacy group, the One Country Project, announced in 2022 it was spending at least $100,000 on a campaign to oppose Sohn´s nomination by highlighting her purported disregard for rural broadband.The former senator, who lost her reelection bid in 2018, did not respond to requests for comment about the source of her group´s funding. Heitkamp collected more than $106,000 in donations from the telecommunications industry during her last Senate campaign, according to OpenSecrets, a nonpartisan nonprofit that tracks U.S. election spending.The National Fraternal Order of Police also opposed the nomination, a move that surprised Sohn and her allies because the police union has no business before the FCC. Citing Sohn´s social media posts about police, the group said in February that a vote for Sohn \"would show a complete disregard for the hard-working men and women of law enforcement.\"Jim Pasco, FOP´s executive director, acknowledged it was unusual for his organization to take sides on an FCC nominee. But he said Sohn´s Twitter presence was too incendiary to ignore. He said no telecom companies influenced the union's decision to oppose the nomination.\"You know, we don´t - we don´t oppose people lightly,\" Pasco said. \"The more we looked into it, the more we saw that this person is really, vocally opposed to just basic public safety efforts in the United States.\"Sohn said she knew her nomination was dead at her February confirmation hearing. That's when Rosen, the Nevada Democrat, said police concerns about the social media posts \"do give me pause.\" Other Democrats, Sohn said, put little effort into parrying Republican attacks.\"It was a bloodbath,\" Sohn said.Three weeks later, she withdrew from the fight."
    ]
}