{
    "articleURL": "/news/article-12060117/Buckingham-Palace-releases-official-portrait-King-Charles-resplendent-Coronation.html",
    "content": [
        "Buckingham Palace has released first official portrait of King Charles s Coronation weekend draws to a close CORONATION LIVEBLOG: Click here to follow live updates throughout today Buckingham Palace has released official portraits unveiling King Charles III resplendent in his royal regalia to round off the monarch's extraordinary Coronation weekend.",
        "The King and Queen pledged to rededicate their lives to service as Charles called the nation's support throughout the historic celebrations 'the greatest possible Coronation gift'. As the weekend of festivities draw to a close, Charles issued a written message, saying: 'We thank you, each and every one.'The special Bank Holiday weekend to mark the King's Coronation was the first in 70 years, since the crowning of his mother, the late Queen Elizabeth II in 1953.Among the official portraits was one of the King was captured in his full regalia, wearing the Imperial State Crown, holding the Orb and Sceptre with Cross.",
        "The official portraits show King Charles III and Queen Camilla in all their majesty in the Throne Room at Buckingham Palace, and surrounded by their fellow 'working royals'.The King and Queen can be seen both separately and together, both the very picture of calm dignity despite the strain of the day.Echoing the famous 1953 coronation portrait of his late mother, Queen Elizabeth II, Charles is seated and wearing the Imperial State Crown. In his right hand he hold the Sovereign's Sceptre with Cross featuring the magnificent Cullinan I diamond and in his left The Sovereign's Orb, representing that his power is derived from God.The Imperial State Crown, the centrepiece of the crown jewels, is formed from an openwork gold frame, mounted with three very large stones, and set with 2868 diamonds, 17 sapphires, 11 emeralds and 269 pearls. ",
        "The Orb, which weighs a staggering 1.3kg, usually sits in the Tower of London as part of the Coronation Regalia and has played a central part of the crowning of monarchs for hundreds of years. Meanwhile, the Sovereign's Sceptre with Cross dates back to 1661 and comprises a gold rod and huge drop-shaped diamond, Cullinan I, or the Star of Africa, which weighs 530.2 carats.The King also is wearing his Robe of Estate, made of purple silk velvet and embroidered in gold that was first worn by his grandfather King George VI in 1937.He has his collar of the Order of the Garter and the historic diamond-set 'Lesser George' suspended from it first worn by George III. St George's helmet is defined in sapphires and his cloak and dragon with rubies.On his purple Coronation Ede and Ravenscroft tunic he wears a 1893 Garter Star set with diamonds. The final part of his outfit are his Royal Naval Trousers.His Majesty is seated on one of a pair of 1902 throne chairs that were made for the future King George V and Queen Mary for use at the Coronation of King Edward VII.These throne chairs were also used in the background of the 1937 Coronation of King George VI and Queen Elizabeth and by His Majesty The King Charles III and Queen Camilla at Westminster Hall to receive addresses from the Speakers of both Houses of Parliament last year.",
        "In her sloop portrait, taken in the Green Drawing Room, Her Majesty is wearing the Queen Mary's crown with her Robe of Estate, hand embroidered with the national emblems of the United Kingdom, as well as flora and fauna reflecting Their Majesties love of nature and flowers of personal significance to them.It is now possible to see clearly the astonishing level of detail on her stunning Bruce Oldfield dress which includes embroidered depictions of her two Jack Russell Battersea Dogs and Cats Home rescue dogs, Beth and Bluebell, and the names of her children and grandchildren.For the first time many of the senior royal women - the Princess of Wales, The Duchess of Edinburgh, Princess Alexandra and the Duchess of Gloucester - have removed their mantles to display their exquisite white gowns.It means we can now also see for the first time the spectacular George VI Festoon Necklace worn by the Princess of Wales that was previously hidden under her cloak.A great favourite of Queen Elizabeth's, it was created in 1950 by her beloved father King George VI, using 105 loose collets that were among the Royal Family's private collection of gems.It was originally strung across three strands, suspended between two diamond triangles, by Garrard, the royal jewellers and given to the then Princess Elizabeth.",
        "In 1953 she removed ten of the diamonds to shorten the length and was subsequently seen wearing it on dozens of occasions including state occasions.The new photographs come as the King released a statement through Buckingham Palace vowing that he and his wife would now 'rededicate their lives' to this nation, his Realms and the Commonwealth.He said: 'As the Coronation weekend draws to a close, my wife and I just wanted to share our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion.'We pay particular tribute to the countless people who have given their time and dedication to ensuring that the celebrations in London, Windsor and further afield were as happy, safe and enjoyable as possible.'He added: 'To those who joined in the celebrations - whether at home, at street parties and lunches, or by volunteering in communities - we thank you, each and every one.'To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible Coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the Realms and Commonwealth.'",
        "The photographs were taken by celebrated society photographer Hugo Burnand at Buckingham Palace shortly after the Coronation ceremony on Saturday.",
        "Camilla was pictured alongside the King, and also in a solo portrait, wearing Queen Mary's Crown which is set with 2,200 diamonds including the Cullinan III and IV, with the train of her lengthy embroidered Robe of Estate spread in front of her. ",
        "The King has issued a coronation message at the end of the weekend's celebrations.Here is his message in full:'As the coronation weekend draws to a close, my wife and I just wanted to share our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion.'We pay particular tribute to the countless people who have given their time and dedication to ensuring that the celebrations in London, Windsor and further afield were as happy, safe and enjoyable as possible.'To those who joined in the celebrations - whether at home, at street parties and lunches, or by volunteering in communities - we thank you, each and every one.'To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the realms and Commonwealth.' ",
        "Another portrait released showed the working royal family made up of the the Prince and Princess of Wales, the Edinburghs, the Princess Royal and Vice Admiral Sir Tim Laurence, the Duke of Kent, the Gloucesters and Princess Alexandra - stood alongside the King and Queen.",
        "Neither the Duke of York nor the Duke of Sussex were included as they are no longer working members of the royal family. It comes after a weekend of national celebrations which saw up to two million people line The Mall on Saturday, May 6 for the King's Coronation, a day full of pomp and pageantry.A few minutes past midday on May 6, Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, the nation's Coronation church since 1066, as Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.The historic moment, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.The Coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the abbey's high altar and receiving homage from his son and heir the Prince of Wales.William's interaction with his father where he touched St Edward's Crown then kissed his father on the right cheek appeared a poignant moment for the King.The King and Queen were then joined by working members of the royal family, plus their pages of honour and the Queen's ladies in attendance on the balcony of Buckingham Palace.The newly crowned couple, who emerged to cheers from tens of thousands of onlookers below, were joined by Charles's heir, Prince William, his wife Catherine, and their three children.Charles's youngest brother, Prince Edward, his wife Sophie, and their two children were also there. His only sister, Princess Anne, also made an appearance.However, the King's younger son Prince Harry and eldest brother Prince Andrew, were notable absentees from the line-up, with the balcony appearances restricted to working royals only.",
        "Those present were treated to a ceremonial Red Arrows flypast, which had to be scaled back due to the wet weather.It featured an assortment of Royal Air Force helicopters, followed by its Red Arrows display team trailing red, white and blue smoke over the palace and central London.After the display had ended and the royals departed the balcony, they reappeared for a briefer second appearance, again to cheers from the crowds.The King and his wife were crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. The historic two hour service was marked by several poignant moments including Prince William kissing his father with his estranged brother Harry yards away.",
        "The 2,300-strong congregation bowed as the monarch, the 62nd in history, and his wife processed out of the Abbey. Charles and Camilla both smiled as they left and then entered the Gold State Coach, drawn by horses to take them past 2million in the streets and 7,000 servicemen and women marching through the capital with them.Princess Anne followed their carriage on horseback with senior royals following in other state carriages. A smiling Prince Harry left in a luxury car, as did a much more sombre Prince Andrew.  Amid rumours Harry planned to be in and out of Britain in 24 hours, his car was seen leaving London, not going to Buckingham Palace.Queen Elizabeth II's eldest son was crowned King having prayed to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain and around the globe.Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. ",
        "As William knelt before Charles, who held his son's hand between his palms, the future monarch said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.'The King's estranged son Harry was among the congregation, sitting two rows behind his brother with the Duke of York's family, and he was seen intently watching the crowning.And when a few minutes later the congregation was invited pay homage to the new monarch, Harry was seen, along with the other royals around him, speaking the words: 'God save King Charles. Long live King Charles. May the King live forever.'Charles delivered a King's Prayer, the first time a monarch has spoken words to God aloud during a coronation, and he prayed to be a 'blessing' to people of 'every faith and conviction'.Before the crowning the archbishop delivered a sermon to the 2,300 guests, a gathering of world leaders, celebrities, UK politicians, foreign royalty, everyday heroes and the royal family.Mr Welby began by telling the congregation: 'We are here to crown a King, and we crown a King to serve.'What is given today is for the gain of all. For Jesus Christ announced a kingdom in which the poor and oppressed are freed from chains of injustice. The blind see. The bruised and broken-hearted are healed.'Speaking to Charles and Camilla, Mr Welby said: 'The weight of the task given you today, Your Majesties, is only bearable by the spirit of God, who gives us the strength to give our lives to others.'With the anointing of the Holy Spirit, the King is given freely what no ruler can ever attain through will, or politics, or war, or tyranny: the Holy Spirit draws us to love in action.'",
        "In the stillness of the Abbey, Mr Welby held St Edward's Crown high above Charles and, after placing it on his head at 12.02pm, said 'God save the King' - words loudly repeated by the congregation.The archbishop had adjusted the position of the crown for several seconds before it sat comfortably, and even crouched down to briefly check it was positioned properly on the King's head.A fanfare was played and the abbey's bells rang for two minutes after the crowning, with gun salutes fired from nearby Horse Guards Parade, the Tower of London and saluting stations across the nation and from warships at sea.Volleys were heard at Hillsborough, Cardiff and Edinburgh castles, Stonehenge and HMS Lancaster, which had sailed to Sudan to help British citizens and others escape the fighting in Khartoum.The Queen was crowned with Queen Mary's Crown, with Camilla having been anointed in public in a break with tradition.During the crowning the Queen was seen adjusting her hair out of her face.Earlier, Charles and Camilla's Diamond Jubilee Coach arrived at the abbey, following a procession from Buckingham Palace, in the midst of a Sovereign's Escort provided by the Household Cavalry's Blues and Royals and Life Guards with their shining breastplates and plumed helmets and led by the Household Cavalry Mounted Regiment band.The monarch and his wife's entrance through the west door was heralded by a fanfare from four State Trumpeters of the Household Cavalry and the abbey congregation stood as one.A large ceremonial procession was lined up before the King and Queen with representatives of all elements of the nation's ceremonial and spiritual life.There were recipients of Orders of Chivalry and Gallantry, Heralds from the College of Arms in their colourful tunics, senior clergy associated with the monarchy and the glittering coronation regalia carried by leading figures.St Edward's Crown was carried by General Sir Gordon Messenger, Lord High Steward of England.With their lavish and unwieldy robes, the King and Queen walked single file along the nave of the abbey with Camilla ahead of Charles as the hymn I Was Glad As They Said Unto Me was sung.The coronation service began with a new element when the King was greeted by 14-year-old Samuel Strachan, the longest-serving chorister of the choir of the Chapel Royal, St James's Palace.The chorister, who attends the City of London School, welcomed the monarch in the name of the 'King of Kings' - a reference to Jesus Christ - and Charles replied: 'In his name, and after his example, I come not to be served, but to serve.'Before the King took the Oath - making a succession of promises, including to maintain in the UK the Protestant Reformed Religion established by law - the archbishop delivered a preface to Charles's declaration - another first.He told the congregation the Church of England, which is headed by the King, will seek to foster an environment where 'people of all faiths and beliefs may live freely' - echoing the words of the late Queen and Charles.",
        "Charles was anointed with holy oil away from public view, shielded by the Anointing Screen.The Dean of Westminster will have poured oil from the ampulla - an eagle-shaped vessel - into the coronation spoon - the oldest object in the coronation regalia.Using his fingers, the archbishop will then have anointed the King on his hands, breast, and head.The King and Queen left Westminster Abbey in the Gold State Coach shortly after 1pm for a procession back to Buckingham Palace.Thousands of royal fans had braved the rain to line the procession route through central London."
    ]
}