{
    "articleURL": "/tvshowbiz/article-12054639/Janice-Dickinson-talks-experience-Im-Celeb-forced-quit-show.html",
    "content": [
        "Janice Dickinson has spoken about being forced to quit I'm A Celebrity South Africa following a horror fall which left her 'whole chin gashed open'.",
        "The former model, 68, insisted she could have gone on to win the series as she opened up about her experience of what it was like to be back in the jungle.She revealed she was 'sad' that her experience in the jungle had come to an end after tripping and falling on her face while trying to find the toilet in the middle of the night.In her exit interview, Janice backed herself as she insisted she could have gone on to be crowned the first ever All Stars 'Legend'. She said: 'I could have been the one to be second runner up or even win this series because I was just so steadfast and physiological with it. ",
        "'I was just waiting and biding my time with it all. I did my fair share in standing up, falling down. Getting my face in the dirt.'She also revealed that she initially felt production could have cleaned her wounds and sent her back into the jungle, but agreed that they had made the right decision in sending her home.'I felt like they could have possibly cleaned my wounds and set me back on my path in there. But Production made the right decision, in the end, to not send me back in,'s he said.",
        "She continued: 'I'm just sad it ended that way. I think I could have gone back in and gone on further.'Janice was also questioned on her thoughts on the entire experience and revealed she had an 'epiphany' after completing a food trial.She said: 'My experience in camp on the complete whole was transformation. I feel that some epiphany came over me after I ate that food trial. That I was able to do it for other people instead of doing it for myself.'She continued: 'I wasn't doing it for the sake of 'Janice is winning a trial', it really was to put food on the table for the other campmates. That's why I was finally able to see the glory of these trials.'Janice also touched on how 'glorious' it was to see Ant McPartlin, 47, and Declan Donnelly, 47, again and revealed she was 'crushing on them big time'.'It was glorious to see Ant and Dec again. I have a fondness for them that my husband shouldn't know about. I was crushing on them big time,' she confessed.",
        "During her time in the jungle, Janice bonded immediately with her campmates, particularly Jordan Banjo after the horrendous epic eating food trial she had to face.And when asked which camp members she bonded the most with Janice responded with Jordan, 30, Gillian McKeith, 63, and Myleene Klass, 45.",
        "She said: 'At first, it was Jordan during the trial with the food. I've never met Jordan before and I'd never heard of his group. I'm not that up on Britain's sub-culture and he's really part of that with Diversity.''It's a great thing, in America we don't have anything like it. I wish he'd take his tour to America. So first Jordan, then I think I bonded with Gillian because she kept coming over to my cot [bed] and telling me she loved me.'She also revealed that she let her guard down as she spoke of Gillian and making friends in camp.'After a while, you just have to let down your guard. She was very sweet. I found her very compelling, even when she was divulging the fact that she'd smuggled all of this contraband into her granny panties,' she explained.'I mean, can you imagine? She was wearing three separate pairs of granny panties that missed the checks that we went through to get in. She's a very clever and ingenious woman!'She also touched on her bond with Myleene by saying: 'I bonded with Myleene. Every day she was like my daughter, she'd say 'Come on Jan, let me fix your hair'. Without pretension.'",
        "'I got to meet the real Myleene Klass which is a comfortable, wonderful, down to earth female. I got to meet the pure Myleene which is friendly, very generous and very giving.'",
        "During the exit interview, Janice also touched on how she felt while having to complete the epic eating trial.'It was the most vile, disgusting, horrific, I repeat horrific, thing. Having to chew on fish eyeballs and lamb testicles. Having to shove a lamb testicle into my mouth and chew it, which took about five minutes, and then having to swallow it. It tasted awful.'Janice was forced to make an early exit from the ITV show after sustaining a horror injury.Janice opened up about the terrifying ordeal which saw her rushed to hospital after the accident which will not air on TV.Viewers will also get to see the campmates told of Janice's exit during Monday's episode.She told The Sun's TV Mag: 'I was feeling very insecure because the campfire had gone out and it was as dark as it could be. So I thought: Right, I'll make it to the dunny from memory.''I walked a couple of steps and tripped, flying flat on my face – hair all over my forehead, my nose was bloody and my whole chin was gashed open.'Blood was gushing from all these areas, and there was dirt and stones embedded in my face from the fall.'She added: 'All I could feel was an intense head pain – from one to ten it was about a nine – and I was just lying there, moaning. It was a freak accident that happened so quickly.'",
        "Luckily, Janice was found by Fatima Whitbread and Phil Tuffnell, who quickly picked her up off the floor and helped her back to the campsite.",
        "The US star, who was 'moaning and crying' with pain, was then helped to her bed before a medic came into camp to assess her.Janice recalled that she was taken to the medical hut where she was cleaned up and given pain relief.She was then transported via ambulance, in which she was given a compress for her head and chin, to a 'tiny hospital in the middle of nowhere', while her husband Robert Gerner - who was already in South Africa - was called.In the interview, Janice told how she was in 'agony' as medics cleaned her wounds and were given a morphine shot to help ease her pain.I'm A Celebrity...South Africa continues Monday at 9pm on ITV1, catch up on the full series on ITVX."
    ]
}