{
    "articleURL": "/wires/reuters/article-12045883/Inside-Kenyan-starvation-cult-tragic-end-forest-death.html",
    "content": [
        "101 bodies exhumed from Kenyan forest graves",
        "Cult leader had predicted the end of the worldLong history of isolating followers from societyRejected state authority, schools, hospitalsBy Duncan MiririMALINDI, Kenya, May 4 (Reuters) - Kenyan cult leader Paul Mackenzie lived with hundreds of followers in makeshift homes of polythene sheeting and thatch in a remote forest camp that he divided into areas with biblical names like Jerusalem and Judea, relatives of his adherents say.He told them the world as they knew it was going to end on April 15 and Satan would rule for 1,000 years, according to the relatives and a senior police investigator. He ordered them to starve themselves and their children to death so they could meet Jesus in heaven ahead of that date, they said.\"I heard the voice of Christ telling me that the work I gave you to preach end-time messages for nine years has come to an end,\" Mackenzie said in a video posted on YouTube in March. \"I followed the voice that told me that I had finished the work.\"Weeks later, his cult became the focus of national horror with the discovery in late April of more than 100 bodies - mostly children - in mass graves in the Shakahola forest of southeast Kenya, home to his Good News International Church.",
        "Mackenzie, 50, is in police custody and has yet to be required to enter a plea to any charge related to the mass graves, which are still being exhumed. Two lawyers acting for him declined to comment.Reuters has pieced together a comprehensive picture of Mackenzie and his cult from court records and interviews with 10 people with knowledge of the group, including relatives of victims, medical workers who treated dozens of survivors and the police investigator, who is involved in the ongoing case.Mackenzie planned the mass starvation of cult members in three phases: first children, then women and young men, and finally the remaining men and he himself, according to six of the people including the investigator, who declined to be named due to the confidential nature of the details.The investigator also said Mackenzie was denying that he told anyone not to eat, adding that the cult leader had said he himself had been eating.A police spokesperson didn't immediately respond to a request for comment for this article.Four grieving relatives of starvation victims portrayed Mackenzie as an imperious man who had cut off his followers from their families and society through his extreme teachings.He forbade them from sending their children to school and from going to hospital when they were ill, branding such institutions as Satanic, they said. Women were under orders to crop their hair very short and shun make-up.",
        "\"Education is evil,\" Mackenzie said in the March video, one of several of his online sermons. \"Children are being taught lesbianism and gayism in school curriculums.\"Rebecca Mbetsa held two photos of her 31-year-old daughter Mercy Chai as she searched for her remains at the hospital mortuary in Malindi, a resort town near the forest. The first, taken before Chai joined Mackenzie's group, showed her with long braids, while in the second her hair was shorn short.\"There was a time she got ill and she refused to go to hospital, saying her faith did not allow her to,\" Mbetsa said.HUNDREDS STILL MISSINGThe death toll stands at 109 so far, with 101 found in mass graves and eight people found alive who later died. Authorities warn the toll could rise further, with more than 400 people missing in the surrounding area.The tragedy has taken on a political dimension, with Kenyan President William Ruto saying the government will form a judicial commission of inquiry to establish why Mackenzie's alleged activities had not been detected earlier.The plight of followers began to emerge in mid-March, weeks before the mass graves were found, when a local man told police that his brother and his wife had starved their children to death in the forest on Mackenzie's orders, according to court records.",
        "Officers went to the forest, and found two of the couple's sons buried in shallow graves, the documents show. They rescued a third son, who was weak and emaciated.Mackenzie was arrested and police asked a Malindi court to detain him pending murder investigations, but a magistrate freed him on 10,000 shillings ($73) bail, according to the court records, which document the bail hearing and preceding events.After he was freed, Mackenzie returned to the forest and brought forward his predicted world's end date - which had previously fallen in August - to April 15, according to relativesStephen Mwiti, who fears his wife and six children died in the mass starvation after joining the cult two years ago, said another former member of the group had related to him the moment that Mackenzie returned to the forest camp.\"The moment he got back, he called a meeting, said the world was ending and therefore we the chosen ones needed to go ahead before the world ends and problems come,\" said Mwiti, citing the account of the former cult member who he said had been cast out for drinking water when he was supposed to be fasting to death.\"As your leader Mackenzie, I will be the last one. I will close the door, you chosen ones will proceed before me and we will all meet with Christ,\" Mwiti added. Reuters was unable to independently confirm the account.",
        "On April 13, police acting on a tip-off returned to the forest and found 15 emaciated people lying in the forest, according to police who said four of them were so weak they died before reaching hospital.The following day, Mackenzie was arrested again and police began combing through the forest more systematically. On April 21, they began exhuming mass graves.'THANK GOD MY FAMILY LEFT'Mackenzie grew up in rural Kwale County in southeastern Kenya. In the early 1990s, he moved to Malindi, a coastal town in neighbouring Kilifi County, where he worked as a taxi driver, according to fellow driver Japheth Charo.Charo said Mackenzie was unusually confrontational towards authorities, adding that once he went to court to dispute a fine over a minor traffic violation.\"He hated losing,\" Charo recalled. \"He always stood his ground.\"Mackenzie became increasingly focused on religion, attending a Baptist church for a few years before quitting the taxi business to start his own church in Malindi in 2003, according to Charo who said he and his family joined his church for two years, until Mackenzie's sermons became alarming.\"He started attacking other faiths like Muslims and Catholics,\" he said. \"His preaching started becoming extreme.\"In March 2017, police searched Mackenzie's compound in the Furunzi neighbourhood of Malindi and found 43 children living there without attending school, according to court documents at the time.",
        "He was charged with offering education at an unregistered facility, but after a plea bargain continued his teachings.In 2019, the authorities ordered Mackenzie's church to shut down, police said, and that was when he relocated to the Shakahola forest, about an hour and a half away by car.Charo said he was horrified last month when he learned about the mass graves found in the forest.\"Maybe if I had stayed longer in that church, the same fate would have befallen me,\" he said. \"But thank God that I and my family left in good time.\" (Reporting by Duncan Miriri; Editing by Estelle Shirbon and Pravin Char)"
    ]
}