{
    "articleURL": "/wires/ap/article-12056747/Alleged-killer-prominent-Iraqi-analyst-sentenced-death.html",
    "content": [
        "BAGHDAD (AP) - An Iraqi police officer was convicted and sentenced to death Sunday in the killing of a prominent security analyst and frequent critic of powerful militias. The ruling came nearly three years after the analyst was gunned down outside his Baghdad home following militia threats.",
        "The family of the victim, Hisham al-Hashimi, said it supported the verdict, but expressed concern it could be overturned on appeal. A relative of al-Hashimi, speaking on condition of anonymity for fear of reprisals, alleged that those who ordered the killing remain at large.The defendant, Ahmed Hamdawi al-Kinani, was convicted on a terrorism charge and sentenced to death by a criminal court, according to Iraq's Supreme Judicial Council. The case was referred to an appeals court. A video of his purported confession was released after his arrest two years ago.Al-Hashimi, 47, was gunned down in July 2020 in front of his home in Baghdad by two attackers on a motorcycle after receiving threats from Iran-backed militias. His killing was captured on a surveillance camera. The images stoked a climate of fear among activists who have accused the government of failing to rein in the powerful armed groups.Al-Hashimi had become well-known as an expert on the Islamic State group and advised the U.S.-led coalition during its years-long battle against the extremists.Following the territorial defeat of IS in December 2017, he became an outspoken critic of the growing influence of Iran-backed militias that helped to defeat IS. Al-Hashimi reportedly received multiple threats from such groups in the period before his death.",
        "Al-Kinani identified himself as a police officer with the rank of first lieutenant in the video aired on state media in 2021. Shortly after his arrest, two security officials speaking on condition of anonymity told The Associated Press that he was connected to a militia but did not specify which one.His purported confession did not acknowledge any links to armed groups.Successive governments have been criticized for allowing militias to operate with impunity. Critics say many government and security officials have ties to such militias.The killings of activists and other critical voices became more frequent in Iraq during a crackdown on a mass protest movement that erupted in 2019, with many blaming Iran-backed militias.Mosimann reported from Irbil, Iraq."
    ]
}