{
    "articleURL": "/tvshowbiz/article-12041967/Rupert-Grint-dotes-daughter-Wednesday-enjoy-family-outing.html",
    "content": [
        "Rupert Grint was every inch the doting father on a recent outing with his daughter Wednesday and his girlfriend Georgia Groome in north London.",
        "The Harry Potter actor, 34, was spotted carrying his little girl, two, in his arms as the adorable family stopped off at a local cafe on Monday.The star of Apple TV's Servant looked almost unrecognisable during the outing, sporting a bushy ginger beard and a thick mop of hair under his cap.Rupert wore a black sweatshirt underneath a green corduroy overshirt, which he teamed with a pair of black sweatpants and trainers.The family arrived in their £60,0000 Porsche Macan before heading into the coffee shop together, with Rupert carrying little Wednesday in his arms.",
        "Georgia could be seen following beside wearing a khaki jacket and her brunette hair swept back into a low bun.Rupert, who played Ron Weasley in the wizarding franchise, reportedly had to keep coming out the alarm on his flashy car kept triggering due to passing traffic. A passerby said: 'I hardly recognised him at first. His red hair is distinctive but with that long beard he looked much older. 'He went in a cafe but his alarm kept going off because of the passing traffic. He kept having to come out and click it off with his key fob.'Rupert was the first of the core three Potter child stars to welcome a child. They welcomed their daughter Wednesday in May 2020. Six months after their baby's arrival, Rupert then joined Instagram to reveal they had named their daughter Wednesday.",
        "Harlow native Rupert wrote in an accompanying caption: 'Hey Instagram....only 10 years late, but here I am.'Grint on the Gram! Here to introduce you all to Wednesday G. Grint. Stay safe, Rupert.' (sic)",
        "Rupert and Georgia, who is famed for her role in Angus, Thongs and Perfect Snogging, have been together since 2011.His co-star Daniel Radcliffe recently became a father for the first time after welcoming a child with his long-term partner Erin Drake.The Harry Potter actor, 33, who has been dating the American actress, 38, for over a decade, stepped out with the new arrival in New York City last week.The actor looked every inch the doting dad as he pushed the newborn in a pram while Erin followed closely behind.Daniel's new arrival means he has now joined several of his former Harry Potter child stars in becoming a parent.Bonnie Wright, who played Ginny Weasley in the films, announced on Friday that she is expecting her first child with her husband Andrew Lococo. "
    ]
}