{
    "articleURL": "/sport/nfl/article-12044785/Jackson-Mahomes-refuses-respond-leaves-jail-following-aggravated-sexual-battery-arrest.html",
    "content": [
        "Jackson Mahomes was accused of forcibly kissing a woman back in FebruaryHe was released after posting bail and making his first court appearance DailyMail.com provides all the latest international sports newsJackson Mahomes, brother of Super Bowl winner Patrick Mahomes, remained in stoic silence as he left jail after posting $100,000 bail Wednesday afternoon. ",
        "Mahomes was arrested for aggravated sexual battery in connection with an incident in February on Wednesday morning. The 22-year-old - known for his outlandish behavior at NFL stadiums - was previously accused of forcibly kissing a 40-year-old female owner of a bar just outside Kansas City.He was released in the afternoon after he posted his bail and made his first court appearance, according to KMBC News, but refused to acknowledge the media as he left jail.As he hurried towards a vehicle from the entrance of the facility in Johnson County, Kansas, members of the press attempted to speak with him. ",
        "However, Mahomes, who is known for being rather loud when attending his brother's games, was silent. He was asked, 'What would you like to say to the victims of these crimes you've been charged with?' To which, Mahomes had no response. The alleged incident has been under police investigation since March, and Mahomes was booked into jail at 7.42am Wednesday. Mahomes was initially scheduled to appear in court for the first time on Friday but the appearance was brought forward to 1.30pm Wednesday, where he entered a plea and paid his bail, the report adds. How Mahomes pleaded is not currently publicly available. Court filings show that defense attorney Brandon Joseph Davies the social media influencer, who is reportedly next slated to appear in court on May 11. ",
        "According to a Kansas City Star report, the alleged incident took place on February 25 at Aspens Restaurant and Lounge in Overland Park, KS.Owner Aspen Vaughn accused Mahomes of trying to kiss her twice and grabbing hold of her neck, with video emerging from the incident as well.",
        "'He forcibly kissed me out of nowhere,' she told The Star. 'And I'm telling him, pushing him off saying \"what are you doing?\"'Then he proceeded to do it two more times where the last time I was pushing him off and I can see on the cameras that somebody was outside the office door and I was yelling for them to come help because he's big and massive.'\"It's disgusting,\" Vaughn reportedly said to Mahomes at the time. 'Like you're a child and he was trying to say \"we should be a power couple,\" and I'm like \"clearly you're out of your mind right now.'''A lawyer for Mahomes, Brandan Davies denied the allegations at the time.'Jackson has done nothing wrong,' the attorney told the outlet. 'Our investigation has revealed substantial evidence refuting the claims of Jackson's accuser including the statements of several witnesses.'We have reached out to law enforcement to provide the fruit of our investigation so that they may have a complete picture of the matter.'",
        "The younger Mahomes has been in the spotlight for viral behavior on TikTok, but has also stirred up some controversy with his antics on the sidelines at his brother's games. In 2021, he poured water on a Baltimore Ravens fan after a Chiefs loss in an incident that was caught on video. He then tweeted: 'They were thirsty.'A month later, just after the Chiefs played the Washington Commanders, Jackson shared a video of himself dancing on a tribute to late Washington player Sean Taylor, who died in 2007.He was called out on social media and he apologized for the incident on Twitter, writing, 'I want to sincerely apologize for accidentally being on the Sean Taylor #21 at FedEx Field. We were directed to stand in that area and I meant absolutely no disrespect to him or his family.'In addition, he was accused of shoving a 19-year-old male waiter on several occasions.The teenage waiter, who chose to remain unnamed, said Mahomes would not let access the staff office. ",
        "'I was going into our office downstairs where the employees are in the employee area, and he's downstairs for I don't know what reason,' the waiter said.'I'm trying to get to the office, and he's like, pushing me out. … And he's like, 'No, get out, get out.''",
        "Mahomes quietly made a return to social media last week almost two months after being accused of assault and sexual assault.Mahomes, who has a big following on TikTok and Instagram, had been unusually quiet across social media platforms in the weeks following the allegations but began posting again last week. Last Wednesday, he posted on his Instagram story appearing to be mingling with NFL fans who came into Kansas City for the NFL Draft.He also made his first TikTok in about two months as he lip-synced the lyrics, 'I've been losing friends and finding peace.'He also posted a photo of him beaming alongside his brother Patrick to his profile on Saturday."
    ]
}