{
    "articleURL": "/sport/nrl/article-12040701/Footy-icon-Willie-Mason-lifts-lid-NRL-stars-HUGE-night-drinking-Wallabies-France.html",
    "content": [
        "Kangaroos and Wallabies crossed paths one night'Wild' evening unfolded in France back in 2004Willie Mason partied with likes of Stirling MortlockWendell Sailor and Lote Tuqiri also in attendanceFormer NRL cult hero Willie Mason has recalled the 'wild' night in France during his playing days which saw the Kangaroos party with the Wallabies.",
        "Far from disliking one another, the players from rival codes met in the same European bar back in 2004 - and Mason said it was one of the best nights out he's ever had.Speaking on his Levels podcast with co-host Justin Horo, Mason confirmed many drinks were had with the likes of Stirling Mortlock, plus rugby converts Wendell Sailor and Lote Tuqiri.'I remember in 2004 we're in France and the Wallabies and the Kangaroos were in the same pub and it was f***ing on. It was on,' Mason recalled. 'So if you say that rugby league players hate rugby union players you're kidding yourself. ",
        "'We had one of the wildest times of our f***ing lives. I'm not even going to go any further, anyone who was on that 2004 tour, enough said.'But we locked horns - the Stirling Mortlocks, the Wendells and Lotes were over there already, they were playing for the Wallabies and mate we had the best f***ing night of all time. 'So like those guys who played in the 2000s, I got nothing but love and respect for all you players.'At the time Mason was in Europe with the Kangaroos playing in the Rugby League Tri-Nations tournament.Australia won the final 44-4 against Great Britain - and while abroad, Wayne Bennett's squad also travelled to France for a Test match against the hosts in Toulouse.",
        "Despite fears the clash would be one-sided, France held their own, with Australia eventually running out 52-30 winners.",
        "It capped off a memorable year for Mason, who won a premiership with the Bulldogs and also the Clive Churchill Medal after his man of the match performance against the Roosters.Following a decorated career at a number of NRL clubs, Mason eventually retired in 2016 after a stint abroad with the Catalans Dragons.These days in addition to his highly successful podcast, the former prop works with the Bulldogs, helping nurture the club's emerging stars at Belmore. "
    ]
}