{
    "articleURL": "/sport/nba/article-12039499/76ers-Joel-Embiid-works-Tuesday-head-coach-Doc-Rivers-expects-remain-doubtful.html",
    "content": [
        "Embiid missed Game 1 of the series and due to a sprained LCL in his right knee  A decision on his status will be made based on how his knee reacts WednesdayDailyMail.com provides all the latest international sports newsPhiladelphia 76ers head coach Doc Rivers gave an update on the status of center Joel Embiid, saying he expects the MVP winner to remain listed as doubtful for Game 2 of the series despite the workout Embiid completed on today.",
        "Embiid missed Game 1 of the series and due to a sprained LCL in his right knee, that he suffered against Brooklyn.'There's no change in his status,' Rivers said before the team conducted a film session at its hotel Tuesday afternoon.'But he's working out today. He is over there with some of our guys right now, and I'll get the report when he gets back. But the fact that he is doing that is a step forward, for sure.' Despite his absence, James Harden was able to lead the 76ers to a surprising victory in Game 1.",
        "Harden scored a playoff career-high 45 points on 17-30 shooting.'It's just health-based,' Rivers said. 'If he can play, he plays. If he can't, he can't. And if it's 50-50, we would probably err on other side [and not have him play], because we've done that all year.'I thought [in Game 1], even though we had a whole week of playing off and playing, I thought the first five minutes of the game we were gassed, which if you don't play playoff basketball for a week, then you get in, they're flying, you're exhausted.'So when he does come back -- if that's Game 2, Game 3, whenever he comes back -- he's going to be tired, and we're going to have to monitor that as well. That'll be a new thing to throw in.' ",
        "Through 66 games in the regular season Embiid averaged 33.1 points, 10.2 points, and 4.2 assist.His status going forward will be based off how his body responds to the workouts going forward, specially the swelling in his knee.'That's the whole key,' Embiid said. 'That's why we're doing it, because you have to do it the day before to see if the next day, if there's increased swelling, then even if he feels good, it's a no. So that's what we'll find out tomorrow.' Philadelphia will try to build on their 1-0 lead in the series heading into the next game in the series at TD Garden on Wednesday."
    ]
}