{
    "articleURL": "/wires/pa/article-12054989/Princess-Wales-shows-parenting-skills-amid-coronation-pageantry.html",
    "content": [
        "The Princess of Wales combined parenting with pageantry during the King’s coronation.",
        "While the Prince of Wales had a formal role paying homage to his father during the service, Kate focused on caring for the couple’s younger children, Princess Charlotte and Prince Louis.Charlotte, eight, showed focus and composure throughout the formal service, but Louis, who turned five less than two weeks ago, needed a little more attention.",
        "While William focused on the service, knowing that the next coronation will likely be his own, Kate took time to calm and reassure Louis when he became a little fidgety.Although William, Kate, Charlotte and Louis arrived later than planned for the service, they showed no signs of being flustered and were seen chatting as they waited to go inside.The family appeared composed as they joined the procession through Westminster Abbey behind the King and nine-year-old Prince George, the couple’s oldest son, who was one of his grandfather’s pages of honour.",
        "Kate, who wore a deep blue Royal Victorian Order mantle edged in scarlet over an Alexander McQueen embroidered ivory silk crepe dress, looked every inch the polished princess.The outfit was topped with a silver bullion, crystal and silver thread work three-dimensional leaf embroidery headpiece by Jess Collett x Alexander McQueen.The princess’ pearl and diamond earrings belonged to Diana, Princess of Wales so were a touching tribute to William’s late mother.",
        "Kate also wore Queen Elizabeth II’s George VI Festoon Necklace, which George VI commissioned for his daughter Princess Elizabeth in 1950.Charlotte, who exchanged affectionate smiles with her mother during the service, was a mini-me version of Kate, with a similar headpiece by the same milliner and an ivory silk crepe Alexander McQueen dress which featured the same rose, thistle, daffodil and shamrock motifs as her mother’s.Despite the formality of the occasion, Kate looked relaxed and gave a beaming smile as she listened to the performance of Alleluia by the Ascension choir – a gospel choir handpicked for the occasion.",
        "Kate smiled down at Louis, seated to her right, when the five-year-old struggled to stay still during the formal ceremony, often glancing at his mother.The princess was seen bending down to talk to Louis when the congregation stood for a hymn, shortly before the five-year-old left the front row of the abbey for a short time.George joined his family for the carriage ride back to Buckingham Palace and all five were seen smiling and waving to well-wishers.",
        "The prince then stood happily with the King’s other pages of honour for the royal family’s appearance on the palace balcony while Louis and his sister Charlotte joined their parents.Kate, with some help from the Duchess of Edinburgh, encouraged Louis and Charlotte to move along so they were closer to her.",
        "She kept a close eye on the young prince, placing a reassuring hand on Louis’ shoulder and encouraging him to look up when the aircraft approached for the flypast."
    ]
}