{
    "articleURL": "/wires/reuters/article-12038975/LIBOR-successor-home-stretch-transition-giant-US-swaps-market.html",
    "content": [
        "By Gertrude Chavez-Dreyfuss and John McCrank",
        "NEW YORK, May 2 (Reuters) - A decade after a manipulation scandal turned global regulators and investors against the London Interbank Offered Rate (LIBOR) as the global interest rate benchmark, major clearing houses are in the final weeks of the nearly $50 trillion transition of the U.S. rate swaps market to its successor.The U.S. interest rate swaps market, with daily turnover of about $1 trillion, is in the last phase of its conversion into the risk-free rate called the Secured Overnight Financing Rate (SOFR), from dollar LIBOR, which is set to expire at the end of June.Interest rate swaps, a measure of the cost of exchanging fixed rate cash flows for floating rate ones over a specific period, give businesses a way to manage interest rate risk and are used by investors to express views on where borrowing costs will go.Since its introduction in 1986, LIBOR grew to become the dominant reference rate on loans and derivatives. Regulators, however, mandated LIBOR's termination after fining the banks that set the rate billions of dollars for rigging it.In contrast, SOFR is a broad measure of the cost of borrowing cash overnight collateralized by U.S. Treasury securities in the repurchase (repo) market.The two main derivatives clearing houses, the CME Group and LCH, have started converting cleared U.S. dollar LIBOR swaps into cleared SOFR swaps this year. LCH will finish this month and the CME by July.",
        "CME's and LCH's conversion followed successful transitions of Swiss franc, euro, sterling and yen LIBOR-listed derivatives in 2021.LCH, which clears more than 90% of global rate swaps, converted the first part over April 22 to 23, with an aggregate notional value of $1.5 trillion worth of contracts. The total value of contracts for conversion by LCH is $45 trillion.\"What we did was a contractual conversion of a portion of LCH's U.S. dollar LIBOR-linked cleared swaps,\" said Phil Whitehurst, head of service development and rates at LCH.\"We made an explicit change to those contracts, about 50,000 of them. We explicitly changed the floating rate benchmark on those contracts from U.S. dollar Libor to U.S. dollar SOFR.\"LCH's second conversion will take place on May 19.The CME, meanwhile, converted some LIBOR swaps on March 24, as well as 7.5 million contracts in Eurodollar open interest and $4 trillion in cleared U.S. LIBOR swaps to corresponding SOFR derivatives in April.It will then convert zero-coupon swaps on July 3 along with any U.S. LIBOR swaps cleared after the primary conversion.\"The conversion of Eurodollar futures, options, and USD LIBOR cleared swaps was successfully completed according to fallback procedures incorporated into the products' respective Rulebooks, and after extensive consultation across market participants,\" said Agha Mirza, CME's global head of rates and over-the-counter products.",
        "Eurodollar futures, which tracked short-term funding rate expectations over several years, was one of the most heavily-traded assets in the world. Investors hedged interest rate risk in this market.Eurodollar futures last traded on April 14, with the CME converting those contracts into SOFR units. The April, May and June 2023 eurodollar futures and options will still be available to trade until their contract's expiration.\"The conversion was well-telegraphed, but is still meaningful given the importance of eurodollars in curve construction and interest rate risk hedging,\" wrote TD Securities analysts in a research note.\"Trading activity has mostly transitioned across to SOFR. So 94%-95% of risk changing hands in swaps these days are being pegged to SOFR as a benchmark already,\" said LCH's Whitehurst.SOFR swaps have consistently accounted for more than 85% of daily volumes on average of interest rate risk traded in the outright swaps market since June 2022.LIBOR swaps, on the other hand, have accounted for less than about 10% of the overall volume, according to a report from the Alternative Reference Rates Committee (ARRC), a group of private-market participants convened to help with the transition from USD LIBOR to SOFR. (Reporting by Gertrude Chavez-Dreyfuss and John McCrank; Editing by Alden Bentley and Josie Kao)"
    ]
}