{
    "articleURL": "/wires/ap/article-12049025/US-tighten-foreign-land-sales-8-military-bases.html",
    "content": [
        "WASHINGTON (AP) - Foreign citizens and companies would need U.S. government approval to buy property within 100 miles (160 kilometers) of eight military bases, under a proposed rule change that follows a Chinese firm´s attempt to build a plant near an Air Force base in North Dakota.",
        "The Treasury Department's Office of Investment Security is set to propose the rule on Friday. The rule would give expanded powers to the Committee on Foreign Investment in the United States, which screens business deals between U.S. firms and foreign investors and can block sales or force the parties to change the terms of an agreement to protect national security.Controversy arose over plans by the Fufeng Group to build a $700 million wet corn milling plant about 12 miles (19 kilometers) from the Grand Forks Air Force Base, which houses air and space operations.As opposition to the project grew, North Dakota Gov. Doug Burgum and U.S. Sens. John Hoeven and Kevin Cramer, all Republicans, raised questions about the security risks and asked the federal government last July for an expedited review.CFIUS told Fufeng in September that it was reviewing the proposal and eventually concluded that it did not have jurisdiction to stop the investment.The plans were eventually dropped after the Air Force said the plant would pose a significant threat to national security.",
        "The new rule would affect Grand Forks and seven other bases, including three that are tied to the B-21 Raider, the nation´s future stealth bomber. The Pentagon has taken great pains to protect its new, most-advanced bomber from spying by China. The bomber will carry nuclear weapons and be able to fly manned and unmanned missions.",
        "Six bombers are in various stages of production at Air Force Plant 42, located in Palmdale, California, while the two other bases will serve as future homes for the 100-aircraft stealth bomber fleet: Ellsworth Air Force Base in South Dakota and Dyess Air Force Base in Texas.Also on the list were Lackland Air Force Base in San Antonio and Laughlin Air Force Base in Del Rio, Texas, both training bases. The others selected for greater protection are the Iowa National Guard Joint Force Headquarters in Des Moines, Iowa, and Luke Air Force Base in Glendale, Arizona.The locations were selected for a variety of reasons, including the sensitivity of either current or future missions that would be based there, if they were near special use airspace, where military operations would be conducted or whether they were near military training routes, said a defense official who spoke on the condition of anonymity to discuss sensitive matters.CFIUS, a committee whose members come from the State, Justice, Energy and Commerce departments among others, already had the power to block property sales within 100 miles of other military bases under a 2018 law.Hoeven said the CFIUS process for reviewing proposed projects needed to be updated.\"Accordingly, China´s investments in the U.S. need to be carefully scrutinized, particularly for facilities like the Grand Forks Air Force Base, which is a key national security asset that serves as the lead for all Air Force Global Hawk intelligence, surveillance and reconnaissance operations and has a growing role in U.S. space operations,\" he said.",
        "In February, Andrew Hunter, an assistant secretary of the Air Force, said in a letter to North Dakota officials that the military considered the project a security risk but did not elaborate on the kinds of risks Fufeng's project would pose.The letter prompted Grand Forks officials, who had initially welcomed the milling plant as an economic boon for the region, to withdraw support by denying building permits and refusing to connect the 370-acre (150-hectare) site to public infrastructure.Fufeng makes products for animal nutrition, the food and beverage industry, pharmaceuticals, health and wellness, oil and gas, and others industries. It´s a leading producer of xanthan gum. It denied that the plant would be used for espionage.Lawmakers have also called for a review of foreign investments in agricultural lands. Earlier this year, Sens. Jon Tester, D-Mont., and Mike Rounds, R-S.D., introduced legislation aimed at preventing China, Russia, Iran and North Korea from acquiring U.S. farmland.\"Countries like China who want to undermine America´s status as the world´s leading economic superpower have no business owning property on our own soil - especially near our military bases,\" Tester said in a statement Thursday.___Stafford reported from Liberty, Mo."
    ]
}