{
    "articleURL": "/sport/football/article-12046463/PSG-orders-extra-security-Neymar-Lionel-Messis-homes-boost-protection.html",
    "content": [
        "PSG were forced to condemn supporters for protesting outside Neymar's home A group of fans called for the board to resign and Lionel Messi to leave the clubThe French champions have reportedly sought to boost security arrangements Paris Saint-Germain have reportedly ordered extra security to protect their players after disgruntled supporters targeted Neymar and Lionel Messi.",
        "A group of fans were recorded outside Neymar's home on Wednesday, with the protestors chanting for the Brazilian to leave the club.Messi was also believed to be the target of frustration, with supporters also demanding the World Cup winner moves on, having recently jeered the Argentine in home matches.The 35-year-old has been suspended by the reigning French champions for two weeks, following an unauthorised trip to Saudi Arabia.Messi made the trip in the aftermath of PSG's 3-1 defeat against Lorient, with the result allowing second placed Marseille to close the gap to five points in the Ligue 1 title race.",
        "According to AFP, PSG have now ordered extra security to the club's training ground as well as both Messi and Neymar's homes.The move follows the French champions issuing a statement to condemn the actions the supporters, who chanted for the chanted for the board to resign outside club headquarters and travelled to Neymar's home.'Paris Saint-Germain most strongly condemns the intolerable and insulting actions of a small group of individuals that took place on Wednesday,' a PSG statement read.'Whatever the differences of opinion, nothing justifies such actions. 'The club gives its full support to its players, its staff and all those targeted by such shameful behaviour.'Neymar appeared to respond to the protests outside his home in an Instagram post, with the Brazilian forward writing: 'Don't let people put you in their storm, put them in your peace.'",
        "He also appeared to hit back at the supporters by 'liking' a social media post decrying the club's stature and claiming that PSG are 'lacking'.The 31-year-old is a somewhat divisive figure in Paris, having received plenty of backlash from the PSG ultras in his period at the club, frequently being booed on the pitch.",
        "Reports suggest Messi will leave Parc des Princes at the end of the campaign following two seasons in Paris.He is reportedly of major interest to the Saudi Arabian government, who are said to be preparing the biggest offer in football history to try and lure the World Cup winner to the Middle East. Messi posed with his wife Antonella in photos released of their visit in Saudi Arabia this week, that prompted his two week suspension.The Argentine had pre-arranged a visit for one of his commercial commitments as an ambassador for tourism.The World Cup winner signed a £25m-a-year deal with Saudi Arabia last year to become a tourism ambassador.Messi remains determined to move back to Barcelona despite the club's financial problems.David Beckham's Inter Miami have also been linked with a move for the 35-year-old."
    ]
}