{
    "articleURL": "/wires/pa/article-12054609/Harry-Kane-keeps-alive-Spurs-Europa-League-hopes-Crystal-Palace-winner.html",
    "content": [
        "Harry Kane’s first-half header helped Tottenham earn a 1-0 win over Crystal Palace that keeps alive their faint Europa League hopes.",
        "Kane’s 28th goal of the season in all competitions settled a drab contest and also moved him ahead of Wayne Rooney into outright second on the Premier League’s all-time leading scorer list with 209 goals.It was enough for Ryan Mason to secure a first victory in his second spell in charge of Spurs, who have jumped up to sixth but seventh-placed Brighton have three games in hand and are only two points off the London club.While most eyes pre-match were on the coronation of the King, Tottenham sprung a royal surprise with their line-up.Emerson Royal started and Yves Bissouma was on the bench despite both being sidelined with injuries that were expected to keep them out for another couple of weeks, while Eric Dier was dropped with the hosts in a 4-3-3 system.Palace were unchanged having won four of their six fixtures under Roy Hodgson, who had given opposite number Mason his solitary England cap in 2015.Given both clubs were involved in seven-goal thrillers last weekend, action aplenty was anticipated but the majority of the first half was played at a subdued pace.",
        "Cristian Romero hit the crossbar with a near-post header from Pedro Porro’s 17th-minute corner before Pierre-Emile Hojbjerg fired over on the turn from Kane’s pass but Spurs were experiencing teething problems in their new system.",
        "When Joachim Andersen scooped over for Palace under pressure from Ben Davies, it seemed the opening 45 would end goalless – but Kane had other ideas.Spurs’ stand-in captain sprayed the ball out wide to Porro, who whipped in a wonderful cross for Kane to head home.It moved the England skipper above Rooney into outright second amongst the Premier League’s record goalscorers, where Alan Shearer sets the pace on 260.",
        "Kane’s goal helped increase the intensity from the two teams after half-time and Eberechi Eze dragged a shot wide for the visitors early into the second period after fine work by Wilfried Zaha, who had clipped over minutes before.Spurs responded with Porro firing well off target when Son Heung-min was in space, but Zaha’s influence started to grow.Zaha turned Emerson inside out before his cross deflected onto the roof of Fraser Forster’s net and Tottenham’s back-up goalkeeper saved well from Cheick Doucoure on the hour mark.After Tottenham had weathered the Palace storm, Mason’s side went in search of a second and Porro looked the most likely scorer for the hosts.",
        "The January recruit tested Sam Johnstone with a firm effort from the right before his free-kick from the touchline sailed inches wide.Son should have wrapped the game up soon after when Romero’s excellent pass sent the Spurs attacker through but Johnstone stood up well to save his low effort.",
        "Tempers boiled over late on and referee Darren England handed out nine yellow cards in total but Tottenham held on to end their four-match winless run and keep a first clean sheet since February 26."
    ]
}