{
    "articleURL": "/tvshowbiz/article-12049011/Cillian-Murphy-desperate-land-lead-role-Christopher-Nolan-film-Oppenheimer.html",
    "content": [
        "Since making his debut in film in 1997, Irish actor Cillian Murphy has had his fair share of lead roles.",
        "Most notably the Peaky Blinders star, 46, has topped the cast billing in the post-apocalyptic horror film 28 Days Later (2002), the romantic comedy Watching the Detectives (2007), the horror thriller Retreat (2012), and war tale Anthropoid (2016).Over the course of much of his career, Murphy - who was recently spotted enjoying a drink in Soho - had appeared in five Christopher Nolan films, but it wasn't until the most recent sixth, in the upcoming Oppenheimer, that he finally landed the lead role in a Nolan production.'I have always said publicly and privately, to Chris, that if I'm available and you want me to be in a movie, I'm there.''I don't really care about the size of the part,' Murphy revealed in an interview with the Associated Press. 'But deep down, secretly, I was desperate to play a lead for him.' ",
        "And over the years, Nolan did in fact take Murphy to task on his promise, hiring him to play Dr. Jonathan Crane/Scarecrow in the three Batman movies with Christian Bale as the caped crusader in Batman Begins (2005), The Dark Knight (2008) , The Dark Knight Rises (2012), as well as Inception (2010) and Dunkirk (2017).It turns out Murphy didn't have a clue about getting the lead role in Oppenheimer until Nolan called him up out of the blue and offered him the part.",
        "'He's so understated and self-deprecating and, in his very English manner, just said, \"Listen, I've written this script, it's about Oppenheimer. I’d like you to be my Oppenheimer,\"' Murphy recalled, before adding, 'It was a great day.'He went on to reveal that they have 'this long-standing understanding and trust and shorthand and respect. It felt like the right time to take on a bigger responsibility. And it just so happened that it was a huge one.'in the film Murphy plays J. Robert Oppenheimer, an American theoretical physicist credited with being the 'father of the atomic bomb' for his role in the Manhattan Project - the World War II undertaking that developed the first nuclear weapons.And interesting change of fate, much of the supporting cast consists of actors who have already been lead actors in Hollywood, some of them many times over.Along with Murphy, the cast also includes such big stars as Emily Blunt, Robert Downey Jr., Matt Damon, Rami Malek, Florence Pugh and Kenneth Branagh, along with the likes of Benny Safdie, Josh Hartnett, Michael Angarano, Dane DeHaan, Dylan Arnold, David Krumholtz, Alden Ehrenreich and Matthew Modine.The story focuses on the physicist as he wrestles with the creation of the atomic bomb during World War II. Instead of focusing on the science of the atom bomb and what it entails, Murphy decided to focus his pre-shoot preps on learning more about J. Robert Oppenheimer and what inventing the atomic bomb does to the individual, the actor told The Guardian last year.",
        "'You realize this is a huge responsibility. He was complicated and contradictory and so iconic,' Murphy said of Oppenheimer the man, adding, 'But you know you're with one of the great directors of all time. I felt confident going into it with Chris. He’s had a profound impact on my life, creatively and professionally. He’s offered me very interesting roles and I’ve found all of them really challenging. And I just love being on his sets.'Nolan wrote and directed Oppenheimer with a budget of at least $100 million, according to Screen Rant.And like his previous works, the London, England native extensively used practical effects and minimal computer-generated imagery.'I think people will be very surprised and wowed by what he does. Anything I say will just seem a bit lame as compared to seeing this in an IMAX theater,' Murphy said of Nolan.Oppenheimer is scheduled to premiere in theaters in the U.S. and UK on July 21."
    ]
}