{
    "articleURL": "/femail/beauty/article-12040363/Kendall-Jenners-exact-LOreal-Met-Gala-makeup-look-budget-lipstick-12.html",
    "content": [
        "Kendall Jenner wore L'Oreal Paris makeup to the Met GalaHer lipstick was $12 and is available form Big WThe rest of her makeup is available for less than $40 Beauty lovers can recreate Kendall Jenner's Met Gala beauty look without breaking the bank after the star's makeup artist revealed she used an ultra-affordable brand.",
        "Proving beauty doesn't need to cost an arm and a leg, makeup artist Mary Phillips said she used all L'Oreal Paris products to glam up Kendall for the star-studded event on Monday. While not all the beauty buys are available in Australia, Big W is slinging the exact lipstick Mary applied to give Kendall a chic nude lip for just $12. L'Oreal's Color Riche Intense Volume Matte Lipstick in Nude Admirable is currently on special at the budget retailer at more than half price for just $11.97 down from $24.99. Shoppers who miss out on the deal need not fret as Kendall's lipstick is also Chemist Warehouse for $20.99. ",
        "In an Instagram post, Mary said Kendall's surprisingly simple yet sophisticated look was inspired by the seventies with an emphasis on the eyes. The Colour Rich lipstick isn't the only one of Kendall's beauty buys Aussie shoppers can get their hands on. To create a flawless complexion Mary used the L'Oreal Paris Infallible 24 Hour Fresh Wear Foundation in shade 425 and 455.The 24 hour Fresh foundation is available at Big W for half price between $15.97 - $18.50 as well as Priceline for $22.19 down from $36.99. ",
        "For enviably long lashes, Kendall wore L'Oreal's viral Telescopic Lift Mascara which was applied to the upper and lower lash line and complimented by a classic winged liner. ",
        "The winged liner was created using L'Oreal's Infallible Grip Precision Felt Waterproof Liner in 600 Black which can be bought from Big W for $12.99 or Chemist Warehouse for $21.99.Beauty lovers can find the Telescopic Lift Mascara from Big W, Chemist Warehouse, Priceline or Adore Beauty. The Telescopic Lift Mascara caused a stir among makeup enthusiasts when it launched in Australia following online controversy. The affordable beauty buy that claims to 'dramatically lift' your lashes was caught up in controversy after prominent influencer, Mikayla Nogueira, was accused lying about her rave review.",
        "L'Oreal Paris Color Riche Intense Volume Matte Lipstick in Nude AdmirableBig W: $11.97 - salePriceline: $14.99 - saleChemist Warehouse: $20.99L'Oreal Paris Infallible 24 Hour Fresh Wear Foundation in shade 425 and 455Big W: $15.97 - $18.50 salePriceline : $22.19 - saleASOS: $28L'Oreal Paris Infallible Grip Precision Felt Waterproof Liner in 600 Black Big W: $12.99Priceline: $15.59 - saleChemist Warehouse: $21.99 L'Oreal Paris Telescopic Lift Mascara Big W: $15.99 - salePriceline: $19.19 - saleChemist Warehouse: $26.99Adore Beauty: $31.99 ",
        "Viewers were up in arms over Mikayla's review as they thought she was wearing false lashes to exaggerate the mascara's effect but the drama sparked a rush in sales overseas with people eager find out if the product really worked. Jess, who works for Chemist Warehouse and shares insider tips, said the much-hyped mascara is available at the retailer for $26.99. She said the mascara, which hit the shelves in Australia back in February, is on special at Chemist Warehouse for $5 less than its original price. ",
        "Beauty lovers said they were shocked the buy was available in Australia so soon after being launched internationally in January.",
        "L'Oreal claims the Telescopic mascara gives 'long-lasting volume and curl and offers thicker, fuller eyelashes'.In another TikTok clip, Chemist Warehouse worker Mija did her own review of the viral mascara saying it lived up to the hype.'This mascara is meant to give you up to five millimetres of visible length,' she saidMija applied the mascara on one eye and said she saw a 'dramatic difference'.'This product is honestly one of those products that is viral for a reason,' she said.Viewers said they couldn't wait to try the popular mascara and another said they are 'running' to get it for themselves.However, not everyone was convinced the lift mascara was worth buying as one said: 'It gives me panda eyes - all black underneath my eyes every time I've worn it.'Another reviewer said it was 'fine' but no different to any other budget mascaras."
    ]
}