{
    "articleURL": "/wires/ap/article-12058403/My-career-280-years--Biden-jokes-2024-age-concerns.html",
    "content": [
        "WASHINGTON (AP) - Joe Biden served in the Senate for 270 years. He used to be three years older than his sister Valerie, but now has 20 years on her. And the fourth U.S. president - whom Biden affectionally calls \"Jimmy\" Madison - is a good friend.",
        "All kidding aside, the 80-year-old Biden will tell you, he is at the end of his career, not the beginning. He´s been doing this for a long time. And he's gotten a \"hell of a lot of wisdom\" over those years, making him deserving of a second term.As Biden, the oldest president in U.S. history, embarks on his reelection campaign, he is increasingly musing aloud about his advanced age, cracking self-deprecating jokes and framing his decades in public life as a plus, hoping to convince voters his age is an asset rather than a vulnerability.In short, he's trying to own it.\"I stand here humbled being the first sitting president of the United States to have an opportunity to speak at Ebenezer Sunday service,\" Biden said in January at the historic Atlanta church where Martin Luther King, Jr. was the co-pastor. \"You´ve been around for 136 years. I know I look like it, but I haven´t.\"The octogenarian president´s comments about his age can be serious, woven into broader remarks and often used to underscore a broader point.",
        "When Biden told the Irish parliament last month that he has never been more optimistic about the future, he notably added, \"And I´m at the end of my career, not the beginning.\"",
        "\"The only thing I bring to this career after my age - as you can see how old I am - but is a little bit of wisdom,\" Biden continued to the approving crowd. \"I come to the job with more experience than any president in American history. It doesn´t make me better or worse, but it gives me few excuses.\"Other times, Biden - his mood buoyed by a crowd full of supporters, whether among Democratic lawmakers or at a lively union hall - is often speaking off-the-cuff, eager to make the audience laugh by poking a little fun at himself. At the annual White House Correspondents´ Dinner on April 29, Biden made his age an early - and frequent - punchline.\"You guys were founded 122 years ago - that´s not when I got endorsed,\" Biden told a crowd of machine operators and engineers with the International Union of Operating Engineers in Accokeek, Md., in April. He referenced \"my career of 280 years here\" at a Black History Month reception before being interrupted by laughter, and at an Air Force event last month, Biden noted that President Dwight Eisenhower addressed the first class of the Air Force Academy more than six decades ago but that \"I wasn't there ... no matter what the press says.\"",
        "Whether deliberate or candid, it´s nonetheless a strategy that evokes how Ronald Reagan defused questions about his age - then 73 - during the 1984 campaign. In a debate against 56-year-old Democrat Walter Mondale, Reagan pledged he would not make age an issue nor \"exploit, for political purposes, my opponent´s youth and inexperience.\"Biden is \"doing exactly what he should be doing. He´s embracing it, he´s having fun with it, he´s doing exactly what Ronald Reagan did - injecting humor and self-deprecation into it,\" said Michael LaRosa, a former press secretary for first lady Jill Biden who also worked on the president´s 2020 campaign. \"By saying the quiet part out loud, everyone is in on the joke. He knows his age, and he´s not pretending to be somebody he´s not. And that´s the most important quality in a candidate.\"The president could also find himself with a general election challenger nearly as old as he is, potentially neutralizing the issue of his own age. Donald Trump, the leading Republican candidate, is 76 years old, although voters have shown less concern about his age and sharpness compared to that of Biden, according to some polls. Trump, for his part, insists the issue is \"not age\" - it's Biden´s mental acuity.Former South Carolina Gov. Nikki Haley, struggling to gain traction in the still-forming GOP primary field, has consistently made Biden´s age a centerpiece of her campaign - even going as far as saying he may not make it to the end of his second term, when he´ll be 86 years old.",
        "Biden´s personal doctor said after the president´s most recent physical exam in February that Biden \"remains a healthy, vigorous 80-year-old male, who is fit to successfully execute the duties of the Presidency.\"Still, the public remains wary about Biden´s capacity to do his job. A majority - 57% - of voters in last year´s midterm elections said they did not think Biden \"has the mental capability to serve effectively as president,\" according to AP VoteCast, an extensive survey of the 2022 electorate. Forty-one percent of voters said Biden did.About 9 in 10 Republicans, along with about 2 in 10 Democrats, said they thought Biden doesn´t have the mental capability to serve as president. Among Democrats, though, voters under 45 were roughly twice as likely as older voters to say they thought Biden doesn´t have the mental capability, 27% vs. 13%.An April poll by The Associated Press-NORC Center for Public Affairs Research showed a notable chasm between the percentage of Democrats who approve of Biden´s job performance - 78% - and those who wanted him to run again, which was at just 47%. Interviews with poll respondents suggested that the gulf was due in big part to the president´s age.Biden´s aides have long dismissed such concerns. To counter the age questions, his reelection campaign is likely to stress his accomplishments to highlight his fitness to do the job, while underscoring the with-age-comes-experience argument that Biden himself likes to make.",
        "\"Part of President Biden´s argument for reelection is that he has decades of experience,\" said Sen. Chris Coons, D-Del. \"I think if he can balance the occasional self-deprecating joke with showing the kind of agility, engagement, casual approach to this issue that he did at the correspondents´ dinner, that he did in the State of the Union, that he has in meetings with small groups of senators in public and in private, I think that´s an asset.\"In a new MSNBC interview last week, Biden again dismissed concerns about his age, saying, \"I have acquired a hell of a lot of wisdom and know more than the vast majority of people.\"Biden's advisers also note that his age surfaced as an issue in the 2020 campaign and did not derail his path to the White House. Some of his more nominal challengers in that year´s Democratic presidential primary, such as former Housing and Urban Development secretary Julian Castro and former Ohio Rep. Tim Ryan, made veiled references to Biden´s age and mental acuity, but that did not gain traction among other candidates. (One of them, Sen. Bernie Sanders, I-Vt., is older than Biden.)Biden has conceded in the past that his age is a legitimate issue for voters, and said shortly after his reelection announcement that he took a \"hard look\" at that before he formalized his decision to run for a second term.",
        "\"If I guess how old I am, I can´t even say the number. It doesn´t -- it doesn´t register with me,\" he said at a news conference with South Korean President Yoon Suk Yeol last month. \"But the only thing I can say is that one of the things that people are going to find out - they´re going to see a race, and they´re going to judge whether or not I have it or don´t have it.\"___Associated Press writer Hannah Fingerhut contributed to this report."
    ]
}