{
    "articleURL": "/news/article-12044467/George-Calombaris-plots-new-venture-former-Masterchef-judge-failed-pay-staff-8million.html",
    "content": [
        "George Calombaris plotting his comebackHe opened new Greek restaurant last monthGeorge Calombaris is planning to launch a new venture in a bid to repair his reputation after the celebrity chef became embroiled in a $7.8million wage scandal. ",
        "The former MasterChef judge is currently scoping out a piece of land on a retail strip in Rye, a seaside town in Melbourne's Mornington Peninsula. Calombaris will be financed by business partner Philipe Hatzikourtis and plans to design the mystery business with local builder Ivo Baldari. ",
        "The trio recently collaborated on a new Greek-Australian restaurant The Hellenic House Project which opened in Highett, in the city's southeast, last month. The venue offers Greek classics like pita, souvlakia and spanakopita with diners able to purchase a signed copy of Calombaris's book 'Just George' for $50.Daily Mail Australia contacted Calombaris for comment. The new venture comes after the former Masterchef judge, who co-hosted with Matt Preston and Gary Mehigan until 2020, was caught underpaying over 500 employees.In 2019, Calombaris was ordered to repay $7.8million in unpaid wages to 515 current and former members of staff.He was fined $200,000 for underpaying his staff between 2011 and 2017 and lost his hospitality company Made Establishment, to liquidators. MAdE, which had 22 companies, collapsed in February 2020 after being ordered by the Fair Work Ombudsman to pay workers millions in unpaid penalty rates.Calombaris was personally hit with a $200,000 penalty for the wage rorts but always insisted the underpayments were simply a mistake he blamed on inexperience.",
        "He said the payment error was detected after the company made a self-report, but the publicity that followed made it impossible to keep his businesses afloat. 'We apologise to all our affected team members, past and present — as it is our people that make our restaurants great, and it is our priority to ensure all of our employees feel respected, rewarded and supported in their roles,' he said in a statement.",
        "'We are committed to acting as a force for change in the industry and leading by example when it comes to building and promoting supportive, healthy and compliant hospitality workplaces.'His reputation was further damaged when he was caught on camera attacking a 19-year-old at an A-League grand final between Sydney FC and Melbourne Victory.Calombaris was convicted of assault and fined $1,000, but the damage to his name was so bad his conviction was later overturned.The Masterchef star admitted he had hit 'rock bottom' and had been drinking heavily to dull the pain of his company's failures.'There was months of tears, anger and I was drinking a lot to take away the pain but then I snapped out of it and and went 'no',' he told Channel 10 in 2021. Calombaris admitted he thought he was 'invincible' in the candid interview. ",
        "'I thought I was invincible and I could get through everything because I was taught as a young kid never say you've tried and work bloody hard,' he said.",
        "'I probably needed good management as soon as I went on the television.'In the fallout of the assault charge, the celebrity chef relocated his family to the Mornington Peninsula, the same location he is now planning a new venture. In 2020, Calombaris was named the culinary director at the recently redeveloped Sorrento Hotel, and is in the running to return to the job this year. Calombaris joined the family business, owned by Rob and Anne Pitt after being acquainted by a famous mutual friend, Eddie McGuire. "
    ]
}