{
    "articleURL": "/news/article-12055299/Melbourne-comedian-Brett-DSouza-real-estate-agent-sell-three-bedroom-Brunswick-house.html",
    "content": [
        "Comedian tries to be DIY real estate agent Brett D'Souza to do all his own advertising Selling a three-bedroom Melbourne house A comedian has ditched real estate agents and announced he will try to sell his home on his own. ",
        "Brett D'Souza is cutting out real estate agents altogether as he sells his house located at 6 Walton Street in Melbourne's inner northern suburb of Brunswick.D'Souza is hoping to fetch $1.8million for the property and he has promised to launch 'Australasia's greatest house sale' ever.Calling on 20 years of experience in advertising and film-making, the 46-year-old is hoping to turn his DIY real estate venture into a TV show for the ABC.",
        "D'Souza has dedicated a website to his project explaining why he made the drastic decision to go it alone. 'I hate real estate agents,' he said.'I think they are shiny-suited charlatans. It only takes six weeks to get your real estate licence and then they want two to three per cent of your house price. What?'In the video, D'Souza says he lives in an 'amazing house in an amazing area' but he just can't afford it any more after the Reserve Bank's rapid rate hikes.'My interest rates are about to go through the roof and when they do… eek,' he said.He explained his nine-year-old son goes to school in Footscray, a 25 minute drive away, and D'Souza wants him 'to be close to his mates' and able to walk to school.D'Souza said he will put the two to three per cent commission that would normally go to a real estate agent into putting a team together to sell his house. ",
        "'You don't shake up an industry by walking the same road as them,' he said.'I am going to have to be bold, innovative. I am going to have the greatest house sale this country has ever seen.'The campaign, which he has been planning since December, will run across social media sites Instagram, LinkedIn, Facebook and also on Campaign Brief, an advertising agency's site. D'Souza is recruiting actors to perform skits about real estate and other property related issues, which he hopes the ABC will turn into a series.  'As much as it is about selling my house, it's also about finding my career or deciding what I want to do when I grow up. I want to make stuff that is fun and makes people happy,' D'Souza told news.com.au.'I don't want to make commercials, I hate it.'In the first video, which dropped on Saturday, he describes the property ' as an amazing house in an amazing area'.He says the area's attractions include 'tons of bars and cafes' a pool and a Bunning's all within walking distance.'There's like 47 gyms around here,' he says.'Lot's of barber shops, I don't know why but there is.'D'Souza says because the house is a on a dead-end street there is no through traffic making it quiet and even allowing the road to be blocked off for street parties. ",
        "'I'm very, very lucky to live here,' he said. The promotional video includes a skit where two purported real estate agents express their awe and indignation that the house is being sold without them.'This is one of the tightly held and highly sought after pockets in all of Brunswick,' one exclaims'This early Victorian has been beautifully reimagined.'Fanning off a central hallway are three great-sized bedrooms and a central bathroom.'She notes the house has a European laundry, parking for multiple cars and even a cricket pitch in the back garden. Using real estate app Homesta D'Souza has placed free listings in Domain and realestate.com.au, which would normally cost $750 with an agent.In the listings the advertised price is $1,800 000.'Tucked away at the end of a small dead end street, right in the middle of Sydney Road and Lygon Street, is a beautiful renovated workers cottage,' the listing states.'Stunning hardwood floorboards lead to a polished concrete living dining area and a north facing backyard. 'Zoned and ducted, heating and cooling, central bathroom, off street parking and one of the northern suburbs largest avocado trees make this an opportunity, not to be missed!'"
    ]
}