{
    "articleURL": "/tvshowbiz/article-12039625/Bam-Margera-says-never-legally-married-Nicole-Boyd-files-legal-separation.html",
    "content": [
        "Bam Margera says he was never legally married to former partner Nicole Boyd amid her filing for separation from him months back.",
        "The 43-year-old TV personality submit documents to a California court reviewed by People Tuesday, that asked court officials to dismiss the separation attempt on the basis of his claim.'Boyd and I have never been married, legally or otherwise,' the embattled celeb told the court, noting that his ex, 39, has never used his legal name.The Viva La Bam star told the court, 'To my knowledge, Boyd has never legally changed her name in any state to \"Nicole Margera.\" Every driver's license or other form of identification I have seen Boyd possess bears the name \"Nicole Boyd.\"'The Jackass alum and Boyd - who are parents to son Phoenix, five - took part in a wedding ceremony on October 5, 2013 in Reykjavik, Iceland that Margera went on to post to YouTube.",
        "It was not immediately clear if the former duo acquired a wedding license in the U.S.Margera told the court that he and Boyd, on 'numerous occasions,' spent time away from one another amid their 'turbulent and unstable' relationship.Said Margera: 'During these breaks Boyd would leave my home and go stay with her family in California. However, Boyd would always come back to Pennsylvania soon thereafter and we would resume our dating relationship.'Margera said in legal docs that both he and Boyd 'knew and understood' that they were not married following their Icelandic ceremony, as she verbally acknowledged such to him at one point.",
        "Boyd's lawyer David Glass told Page Six that 'it was not until just recently that Nikki had ever heard Bam's claim that they were never married.'She was told that the wedding would occur in Iceland and that it was all taken care of. She had a wedding ceremony, and then returned to the U.S. and lived like a married couple with Bam for years.'Boyd was under the impression that all of the legal paperwork had been 'taken care of' part and parcel to the ceremony in Europe.Glass told the outlet that in 'good faith,' Boyd thought she was wed to Margera and 'at the very least' falls under the classification of a 'putative spouse' under legal statutes in California, where she filed for the separation.",
        "Boyd is 'entitled to division of property and spousal support, in addition to child custody and support,' her lawyer told the outlet.Boyd filed in Los Angeles to legally separate from Margera this past February, saying the cause was irreconcilable differences, and requesting the court award her spousal support.Glass told TMZ in February that Boyd had concerns about Margera's conduct around their young son, saying he could act 'inappropriately' when he was under the influence of substances.Boyd 'made the hard choice' to pursue the separation from Margera 'to protect herself and their son.'",
        "Boyd and Margera split up in 2021, and in September of that year, Boyd went to court to request full custody of their son.In the recent docs he filed, Margera said that Boyd relocated to California 'to take advantage of the putative marriage laws that exist in California but not Pennsylvania.'Boyd's lawyer Glass told Page Six 'the plain facts are that the parties, together, moved to California and lived here for months before Bam was placed into rehab by his parents,' as she 'continued to live in California with Phoenix while Bam has bounced around - living in Florida, living in California, and for a few weeks, being back in Pennsylvania.'He added that 'California is the only venue for this divorce action.'Margera has made headlines in recent weeks amid a spate of legal issues, including an altercation with his brother, who has accused him of drug use. Margera has denied the accusations."
    ]
}