{
    "articleURL": "/wires/pa/article-12056433/Steve-Borthwick-returns-Leicester-strengthen-England-s-coaching-staff.html",
    "content": [
        "Steve Borthwick has returned to Leicester to recruit yet another member of his England staff with Tom Harrison to join as scrum coach ahead of the Rugby World Cup.",
        "Harrison will join on June 1 to replace the Montpellier-bound Richard Cockerill and follows Richard Wigglesworth, Aled Walters, Kevin Sinfield and Borthwick himself in leaving Leicester for England.The RFU announced in February that Wigglesworth and Walters would join at the end of the Gallagher Premiership season, and Harrison’s arrival was confirmed on Sunday as Borthwick finalised his coaching staff for the World Cup.Wigglesworth will lead the attack coaching and kicking strategy while Sinfield will continue as defence coach. England men’s sevens head coach Tony Roques will work as contact and skills coach during training camps, while Walters will be the strength and conditioning coach.Harrison is the Tigers’ assistant coach, leading on scrum coaching, and was part of the team that won the Premiership title in 2022.“Tom is an excellent coach and will have a real impact in area that will be fundamental to us as a team,” Borthwick said.",
        "“Leicester’s scrum is renowned across Europe and Tom has played a leading role in that success. I have full confidence in him and I am very happy that he will be joining England.” Leicester’s scrum is renowned across Europe and Tom has played a leading role in that success. I have full confidence in him and I am very happy that he will be joining England  Steve Borthwick  ",
        "Leicester chief executive Andrea Pinchon wished Harrison well in his new role while acknowledging the continuing challenge the Tigers have faced considering the number of staff that have left for England.“Since coming into Leicester Tigers, Tom has been an exceptional contributor to the club on and off the field,” Pinchen said. “While obviously disappointed to be losing him at the end of the season, we wish him all the very best for this next chapter in his career.“Tom is a great reflection of our club’s ability to produce coaches as well as players through the pathway programme at Leicester Tigers and while it has been another challenge for us this year, with coaches being poached by the national side, we continue to see it as a badge of honour for the level at which we are viewed within the game.”Roques will again lend his expertise during the build-up to the summer, having previously worked with the England squad as part of the preparations for the 2019 Rugby World Cup. We know this World Cup will be highly competitive, but we are genuinely excited by what this group of coaches and players can achieve in France  Steve Borthwick  Borthwick added: “As a group, we know each other well and we know the areas we will focus on to continue developing and building this team and be the best prepared team that we can be.",
        "“We know this World Cup will be highly competitive, but we are genuinely excited by what this group of coaches and players can achieve in France.”England are due to hold training camps in mid-June before taking part in a Summer Series in August with fixtures home and away against Wales, a trip to Dublin to face Ireland and a clash with Fiji at Twickenham.The Pool D World Cup campaign then begins against Argentina in Marseille on September 9."
    ]
}