{
    "articleURL": "/wires/reuters/article-12045177/Feds-hiking-pause-not-signal-clear-US-stocks.html",
    "content": [
        "By Lewis Krauskopf and David Randall",
        "NEW YORK, May 4 (Reuters) - The end of a market-punishing rate hiking cycle may be in sight, but uncertainty over stock valuations and the economic outlook is keeping investors on alert for more turbulence ahead.The Federal Reserve on Wednesday signaled it may pause interest rate increases after raising rates by 500 basis points over the last 14 months to fight inflation in its most aggressive monetary policy tightening since the 1980s.In theory, that should be welcome news for stocks and other so-called risk assets, which wilted under the barrage of hikes last year. Yet some investors worry this year's 6.5% rebound in the S&amp;amp;P 500 has made equities expensive. Many are also wary that the Fed's rate hikes may precipitate a recession later this year.\"The Fed getting ready to move to the sidelines is one step but it won't be a cure all,\" said Angelo Kourkafas, an investment strategist at Edward Jones.Stocks fell on Wednesday, with the S&amp;amp;P 500 ending down 0.7%, after the Fed's latest policy decision in which the central bank also raised rates by 25 basis points, as markets expected.Still, equities have risen in recent weeks, with the S&amp;amp;P 500 up 6% since mid-March despite a tumult in U.S. regional banks and worries over a looming showdown over raising the country´s debt limit.",
        "The gains pushed the S&amp;amp;P 500's forward price-to-earnings ratio up to 18.2 times, compared with a historic average P/E of 15.6 times, according to Refinitiv Datastream - a level some investors say may be too pricey.\"The market has moved up, the valuation is full, you could say,\" said Matt Peron, director of research at Janus Henderson Investors. \"I think the market is a bit vulnerable to a shock here.\"Peron has kept his equity positioning below typical levels, while allocating more heavily to stocks in the healthcare sector, which some see as an area of the market better able to weather turbulence.At the same time, many investors also think the Fed´s rate hikes are only starting to weigh on U.S. growth and an economic downturn lies ahead - though Fed Chairman Jerome Powell said on Wednesday that he believes the United States was likely to avoid a recession, while various gauges such as employment and retail sales have pointed to a relatively robust economy.\"I have become... over the past few months much more concerned because I do think a recession is an eventuality even if they are pausing now,\" said Brent Schutte, chief investment officer at Northwestern Mutual Wealth Management Co, who has been pulling back on stock exposure and moving toward bonds in recent months.",
        "In fresh signs of stress, shares of U.S. regional lenders collapsed in extended trade on Wednesday, with PacWest Bancorp losing over half its value after reports the California bank is exploring strategic options, including a sale.A Wednesday report from Citi projected a \"mild and shallow\" U.S. recession in the fourth quarter of 2023 along with a list of stocks the bank's analysts believe will outperform in a downturn, including Google-parent Alphabet, Amazon and Walmart.Of course, stocks have rebounded this year from a 19.4% drop in 2022 despite a range of investor concerns and may continue to do so.Jason Draho, head of asset allocation, Americas, at UBS Global Wealth Management, believes risks to equities are \"skewed to the downside.\" Nevertheless, he said investors have already lightened up on stocks in preparation for a recession, leaving a pile of money on the sidelines that could return to equity markets.Friday's U.S. employment report and next week's consumer price index data may give investors a sense of how deeply the Fed's rate hikes have seeped into the economy. Signs that the Fed is making progress on reducing inflation without badly hitting growth could be encouraging to investors, Draho said.\"At this point it will be about how the data comes in,\" Draho said.",
        "(Reporting by Lewis Krauskopf and David Randall; Editing by Ira Iosebashvili and Sam Holmes)"
    ]
}