{
    "articleURL": "/femail/food/article-12059761/Why-Five-Guys-dish-extra-portion-fries.html",
    "content": [
        "Five Guys are known for pouring extra fries into the bag when servingREAD MORE: I've found the ultimate menu hack for the best burger at Five Guys If there's one food that fast food lovers can eat continuously, it's fries - and Five Guys is always ready to fulfill that desire.",
        "Servers will pour an extra portion of fries into the paper bags containing a meal - and customers are now starting to learn the reason behind the generosity. LADBible reported that the extra fries are dished out so that customers leave feeling they have been given more food for the money they spent.However, the 'topper' of fries is factored into the cost of a Five Guys meal, which is more expensive than other chains such as McDonald's and Burger King.Speaking to Food Republic, Chad Murrell, one of the Five Guys founder Jerry Murrell’s sons, said: 'I won’t name names, but other restaurants just don’t give a satisfying amount of fries. ",
        "'We always give an extra scoop. I say load 'em up and make sure they get their money’s worth.'In a further bid to give customers value for money, Five Guys offers free toppings, including bacon, peanut butter and strawberry for its milkshakes.Social media star Darren Dowling from Glasgow, is well-known on TikTok (@yerboidazza) for posting about his crazy takeaway antics and left followers baffled when he added all the available toppings to his Five Guys chocolate milkshake.The Scottish influencer braved the ingredient-laden delight, which including added bacon, explaining it only cost him £5.95 and he was able to add the extra toppings for free.",
        "Examining his creation, he said in the video: 'It does just look like a chocolate milkshake though.' He used a spoon to scoop out the bottom of the drink, adding: 'Oh no, there's like hundreds of crispy bits.'Darren tasted the drink before he continued: 'Normally I love bacon right - but in a chocolate milkshake?'",
        "Making sure he tried bacon bits with his drink, he added the extra toppings to a spoon and concludes: 'So I don't hate it.'I think what we're going to need to do is people need to just go to Five Guys and try this.'I don't know what my opinion is to this, it's a weird one.' The influencer shared why he decided to make such a strange order, saying: 'I had seen that all the toppings were free to add to a Five Guys milkshake and I couldn't say no to that opportunity.'But then I saw bacon at the bottom of the list of potential things to add and I didn't know if I was excited or absolutely terrified, but I ordered it anyway.'Cause all the toppings were free to add in, it was surprisingly only £5.95.'I feel like I was scamming the system when it's legal to order a milkshake for less than £6 and get all those bonus extras.",
        "'It was so strange, I am not sure if I hated it or loved it.'The bacon bits at the bottom were weird, I think that's what flung me into the deep pits of not knowing if I liked it or not.'I couldn't finish it after that, knowing that at any point I could get a piece of bacon and Oreo in the same bite.'"
    ]
}