{
    "articleURL": "/femail/article-12054193/Royal-fans-left-baffled-spotting-secret-notes-Coronation-ceremony.html",
    "content": [
        "Royal fans were baffled by the use of cue cards at Westminster Abbey today CORONATION LIVEBLOG: Click here to follow live updates throughout today Royal fans are baffled after seeing cue cards at today's Coronation ceremony at Westminster Abbey, with many questioning the need for them.",
        "Taking to social media, those tuned in to the historic event noticed the constant turning to the boards being held up as King Charles III officially became Britain and the Commonwealth's monarch today.The royal, 74, was pictured glancing down for his 'lines' throughout the festivities this morning.'He's got cue cards for about three sentences,' one observer tweeted. 'You've had a lifetime to memorise it mate.' 'All the theatre kids I know could do this entire ceremony without all these cue cards, I'll tell you that much,' a second added.",
        "A third slammed the new king, writing: 'Oohh slightly concerning that Dull King Chas had to read the cue cards for his few words for the Coronation.''How does Charles need cue cards for this,' one baffled fan added. 'YOU'VE HAD 74 YEARS TO PRACTICE.' And it wasn't just the monarch who seemed to need a little bit of stage support, with the Prince of Wales and Archbishop of Canterbury Justin Welby seen glancing at the placards as well.'See they're all at the cue card thing. It's not like they didn't have any notice they were going to have to do this,' one commented.Another added: 'I think it's slightly weird all the cue cards, and glancing at them at the coronation, surely it can't be that difficult to memorise a few words.",
        "'Just seen one priest look at a cue card and then say Amen.''Oh my god the cue cards at the coronation!' one remarked. 'William reading a cue card to pledge allegiance to his father! Members of the clergy reading scripture from cue cards! Have they not had enough decades to practice?'",
        "Meanwhile, some even felt King Charles's son reading off the cards made the ceremony feel less sincere.One said: 'It was probably just him reading off the cue card, but William looked like he was intentionally avoiding eye contact with his father during that (thoroughly anachronistic) pledge of loyalty.' It comes as this morning King Charles III's day of destiny has arrived as the world enjoys the historic first coronation of a UK monarch in 70 years at Westminster Abbey - where Britain and the Commonwealth hailed its new monarch today.The royal had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.On the the streets of London today - including on a packed Mall - there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning.She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.'She loves him unconditionally and always wants him to shine,' a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.",
        "'The calm before the storm – perhaps metaphorically as well as literally', a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953.The Coronation bank holiday weekend will conclude on Monday with The Big Help Out, when members of the Royal Family will join volunteers working with local community organisations as part of an initiative to create a lasting legacy from the celebrations. Charles and Camilla, however, will leave for their Sandringham estate in Norfolk for a well-earned break.",
        "The Duke of Norfolk, who is organising the ceremony, said: 'The Coronation is an opportunity to bring our great nation, the realms and the Commonwealth closer together, plugging into the power of the past and promoting our shared values to the wider world with all that we have to offer.'Mr Sunak said the weekend would be a chance to reflect on the 'enduring nature of monarchy' and urged the nation to celebrate its history and culture.The Prime Minister added: 'Let's celebrate this weekend with pride in who we are and what we stand for. Let's look to the future with hope and optimism. And let's make new memories, so we can tell our grandchildren of the day we came together to sing God Save The King.'"
    ]
}