{
    "articleURL": "/wires/pa/article-12046475/Trainline-shrugs-strike-impact-ticket-demand-booms.html",
    "content": [
        "Trainline has hailed bumper train ticket sales for the past year as the booking platform shrugged off the impact of UK rail strikes.",
        "Shares in the company shot higher in early trading after sales leapt by almost three-quarters.Net ticket sales rose by 72% to £4.3 billion for the year to February 28, which it added was 16% above pre-pandemic levels.It brought group revenues to £327 million, up 74% year-on-year, amid growth in the UK and international markets.Jody Ford, chief executive of Trainline, told the PA news agency that it has also enjoyed “really strong demand” over more recent weeks as traveller numbers continue to recover.He said: “We have seen commuters coming in more frequently, people more regularly travelling through the weak as cities have become busier after Covid.",
        "“I think people are also considering the sustainability of train travel instead of using their car for journeys and I think that will continue.“But I think people are specifically using the platform because we’ve invested in it to make it has helpful to customers as possible, giving them all the information they need for journeys and getting a good deal on tickets.”Nevertheless, growth comes amid continued pressure from rail strikes which had an impact upon travellers throughout the financial year and is set to continue.Members of the Rail, Maritime and Transport union (RMT) will walk out on May 13, the date of the Eurovision Song Contest final, in its next planned strike.",
        "Mr Ford said the group estimates that strike action hits net ticket sales by “£5 million to £6 million” a day.The company swung to an operating profit of £28 million for the past year, rising from a £10 million loss.Mr Ford added: “Trainline is building great momentum, delivering a record operating performance this year, selling about 200 million train tickets across Europe, and expecting further strong growth in the year ahead.”Brokers at Peel Hunt upgraded Trainline stock as a result on Thursday.James Lockyer, technology analyst at Peel Hunt, said: “The uncertainty of Great British railways, strikes, and commission rates has weighed on the share price for too long.“Trainline is resolutely executing its strategy, providing innovative tech for clients to power the railway revolution of the 21st century.”Trainline shares were 31.2% higher at 270.5p on Thursday."
    ]
}