{
    "articleURL": "/wires/afp/article-12056805/Yellen-warns-chaos-US-fails-raise-debt-ceiling.html",
    "content": [
        "US Treasury Secretary Janet Yellen warned Sunday that unless Congress acts soon to raise the nation's debt ceiling, \"financial and economic chaos would ensue.\"",
        "Republicans have been pressing President Joe Biden to strike a deal to provide spending cuts in exchange for lifting the national borrowing limit, but Yellen insisted the onus remains on US lawmakers.\"It simply is unacceptable for Congress to threaten economic calamity for American households and the global financial system as the cost of raising the debt ceiling,\" she told ABC talk show \"This Week.\"Yellen had warned on Monday that the United States could run out of money to pay its financial obligations as early as June 1.The ceiling on US public debt is legally fixed and can be raised only by passage of congressional legislation signed into law by the president.The Republican-led House of Representatives, positioning itself for a showdown with Biden, voted in late April to lift the borrowing limit but only with drastic cuts to rein in what that party sees as excessive spending.The bill has no chance of being adopted in the Senate, with its Democratic majority.Biden has so far refused to negotiate, noting that the debt ceiling has routinely been raised scores of times over the years -- including under former Republican president Donald Trump.But Republicans insist Biden's refusal to talk is the principal obstacle.\"The president has refused to negotiate,\" Senator James Lankford, a Republican on the Senate Appropriations Committee, told ABC. \"That has been the most stunning part about this.\"",
        "Biden is set to meet on Tuesday with the leaders of both parties in Congress.\"I know he wants to set up a process in which spending priorities and levels are discussed,\" said Yellen, \"but these negotiations should not take place with a gun pointed at the head of the American people.\"She sidestepped questions about the possibility Biden might use a novel interpretation of the US Constitution to simply keep paying the nation's bills, saying that in the absence of congressional action, \"there are simply no good options.\"The impasse has raised the possibility of the country's first-ever default, with profound implications for the US and global economies.Analysts say markets would be shaken and interest rates would lastingly rise, causing households and businesses to pull back on spending.A default, Biden's economic advisors warn, could cause the loss of eight million jobs and send GDP plunging by six percent.Since the United States hit its $31.4 trillion borrowing limit in January, the Treasury has taken extraordinary measures to allow it to continue financing the government's activities.But as Yellen said Monday, those measures will soon be exhausted."
    ]
}