{
    "articleURL": "/sport/tennis/article-12057747/Tennis-stars-fans-outraged-womens-doubles-players-barred-speaking-Madrid-Open.html",
    "content": [
        " Women's doubles players prevented from speaking Fans and players are incensed by the incident Madrid Open has been mired in controversies All four players who competed in the women's doubles final at the Madrid Open on Sunday were prevented from speaking after the match - leaving both fans and players furious.",
        "The Spanish tournament has attracted more controversy this week by barring winning duo Victoria Azarenka and Beatriz Haddad-Maia and runners-up Coco Gauff and Jessica Pegula from giving a speech after receiving their trophies.Finalists in the singles and men's doubles were all allowed to make the customary addresses to the crowd after their respective matches.The issue immediately caught fire on social media with former players like Australian great Rennae Stubbs calling the tournament a 'disgrace'.'So for a tournament to deny players a speech after they win a @WTA 1000 is a DISGRACE!! I hope the WTA never allow this to happen again. What was the reason @MutuaMadridOpen and @WTA???,' Stubbs wrote on Twitter.",
        "World No. 4 Ons Jabeur labelled the incident 'sad' and 'unacceptable'.A furious Gauff took to social media when she got off the court and shared the speech she'd intended to give.'Wasn't given the chance to speak after the final today,' she wrote.'But thank you to the fans for supporting us and women's tennis this week! Thanks (Jessica Pegula) for always keeping it fun on the court and hitting unreal clutch shots hahahaha Lastly, big congratulations Vika and Bia.'Also thanks to my team and Jess's team of course!'Also for the ball kids, tournament staff, and everyone else who works hard behind the scenes.",
        "'Twitter format doesn't allow me to say everything I would've said during the speech if we had one. But just wanted to say I'm thankful.'Top tennis reporter Ben Rothenberg wrote, 'The Mutua Madrid Open choosing to silence the women's doubles finalists (ie not letting them speak during the trophy ceremony) because they're butthurt over Cakegate and some glancing criticisms yesterday is truly one of the wilder miscalculations I've seen in tennis lately.'",
        "Tournament officials have given no reason why the stars were prevented from speaking, but the incident comes after other recent controversies that have put the tournament in the firing line.The Open was criticised last week for replacing ball kids with female models for some matches, which was branded a sexist move that objectifies women purely for ratings.Days later, a debate broke out among fans about gender equality after it was pointed out that Aryna Sabalenka and Carlos Alcaraz - who share a birthday - were treated very differently by tournament organisers.Men's world number two Alcaraz was handed an impressive multi-tier cake, while Sabalenka appeared to be short-changed with her single-tier offering.World No.1 Iga Swiatek also slammed tournament organisers over the weekend after being defeated in the final by Aryna Sabalenka.Swiatek complained that she had to finish multiple games after midnight on her way to the title match. ",
        "'It's not fun to play at 1am though,' she said after the match.'I'm happy anyway I was able to get past this experience and survive and be in the final.'Tournament director Feliciano Lopez, who was standing near Swiatek, looked visibly unimpressed by her remarks."
    ]
}