{
    "articleURL": "/news/article-12046197/Mother-nine-wear-electronic-tag-threw-coffee-sister-law-wedding-row.html",
    "content": [
        "Halima Ahmed and Zainab Ahmed got into a row at a family event in BirminghamInjuries from the incident have left Zainab partially disabled, the court heardHalima was also made the subject of a seven-year restraining orderA mother-of-nine has been forced to wear an electronic tag as punishment for a 'revenge' attack on her sister-in-law at a wedding.",
        "Halima Ahmed, 55, and Zainab Ahmed, 57, got into a row at the family occasion in Small Heath, Birmingham, after having fallen out several years before. Birmingham Crown Court heard that the pair had a tussle during an event at Bia Lounge Wedding Hall on Golden Hillock Road on June 16, 2019.It was heard that Zainab threw a biscuit, but in retaliation Halima launched a flask of coffee, which missed, before then tossing a plate at her sister-in-law's face. Zainab then lifted her arm and blocked it, but this resulted in a deep cut to her muscle that has now left her partially disabled. Following a trial Halima, from London, was cleared of causing grievous bodily harm with intent but she had already admitted an offence of unlawful wounding.",
        "She was spared immediate imprisonment on April 28, partly because she is in poor physical health and also because it would have a significant impact on her two remaining dependent children, ruled Judge Paul Farrer.Instead, she was sentenced to 12 months suspended for 18 months - which included a 16-week electronically monitored curfew between 8pm and 6am. In an emotional statement, Zainab said: 'I used to be a person who had two hands and I have become a person who has use of only one hand.'",
        "She continued to explain the long lasting effects the injuries have caused her - including pain, numbness, sleepless nights and an aversion to the heat.  The mother continued to list the day-to-day tasks she now struggles to do. These include washing, cooking and gardening, as well as struggling to look after her daughter and elderly mother.  In summing the case up Judge Farrer said: 'You and Zainab Ahmed were sisters-in-law and at one time had been close friends. That changed in 2016 when you and she had a falling out.'The details are in dispute but in my judgement, they simply don't matter. It's clear from that time onwards there was ill-feeling between you and you ignored one another as and when you met at family events.'Against that background on June 16, 2019, you both attended a wedding reception in Birmingham. Something happened between you and it's common ground you both ended up swearing at one another.'Judge Farrer added: 'Following that exchange Zainab threw a biscuit at you and you responded by throwing a flask of coffee at her. You denied doing that at your trial but you acknowledged the truth of this to a probation officer. Zainab managed to avoid being struck by the flask whereupon you picked up a plate and threw it at her face.",
        "'She reacted to that by raising her left arm and thereby successfully deflected the plate away. In consequence, she suffered a deep and extensive laceration to her arm.'The judge stated that Zainab had been left with a 'large and conspicuous' scar as well as 'significant and ongoing disability to her left arm'. ",
        "He concluded: 'Zainab threw a biscuit at you. Plainly there was no element of self-defence from you to that happening. Instead, you reacted in anger and essentially launched a revenge attack.'James Dunstan, defending, stated that Halima 'mistakenly interpreted the situation' by thinking Zainab was coming to attack her.' He added: 'Halima is truly sorry for her unlawful actions.'She continues to consider Zainab as her sister or like her sister. It's clear she was defending herself from a position of remorse.'Halima was made the subject of a seven-year restraining order banning her from direct contact with Zainab. She was also ordered to pay £535 costs.Judge Farrer did not award any compensation after enquiring with Zainab who, via an interpreter, said: 'I don't want to take money from her pocket.'"
    ]
}