{
    "articleURL": "/sport/cricket/article-12047847/Saudi-Arabia-Prince-negotiations-buy-cash-strapped-Yorkshire.html",
    "content": [
        "A Saudi Arabia Prince is interested in buying Yorkshire County Cricket ClubHe is in negotiations with the club who owe £15m to their ex-chairmanThe club may not be able to pay their players if they fail to get additional fundingYorkshire are in negotiations with a Saudi Arabia Prince and government official about buying into the cash-strapped club. ",
        "Mail Sport has learned that chief executive Stephen Vaughan has held talks with Badr bin Abdullah bin Mohammed bin Farhan Al Saud about a remarkable deal that would see the Saudi businessman buy out the £15million debt that Yorkshire owe to former chairman Colin Graves.Yorkshire are desperate for outside investment, with Mail Sport revealing last month that if the club fail to secure additional funding they may be unable to pay player and staff salaries before the end of the season. It is understood that the offer on the table from Prince Badr would see him take on Graves’ debt without injecting any equity into Yorkshire, which may be attractive to the membership as it would enable them to remain a members club.Badr is believed to have pledged to charge Yorkshire less than the four per cent interest the club are currently paying to the Colin Graves Trust, who have agreed to push back a £5m repayment they are owed until October to enable them to complete the season. ",
        "A further cash injection from Badr into Yorkshire could follow at a later date, with the Saudi government encouraging investment from wealthy individuals into all sports following their own huge spending on acquiring football clubs such as Newcastle, Formula One races, world championship boxing bouts and the rebel LIV golf tour.",
        "Badr has been involved in some of those projects after being appointed Saudi’s first minister of culture in 2018 with the primary task of working on Saudi Vision 2030, which aims to reduce the their dependence on oil by promoting the country as a major cultural, sporting and tourist destination. The 37-year-old was previously chairman of the Saudi Research and Marketing Group, a media company that has done several deals with American and UK firms including launching Bloomberg’s first Arabic-language news channel, Bloomberg Al Arabiya.Saudi have been looking to add cricket to their growing sports portfolio for some time and recently held talks with the owners of several IPL franchises about setting up a new T20 competition. According to reports last month the proposed new tournament in the Middles East feature teams that are linked to the existing IPL franchises with offered 12-month contracts in a potential threat to international cricket, although the Board of Control for Cricket in India remain reluctant to release Indian players to play in any overseas league.",
        "Yorkshire have been seeking a £20m loan to pay off the £15m owed to Graves and a further £5m needed to get through the season since last December, but as Mail Sport revealed last month their pitch to investors has failed due to concerns over the club's financial forecasts. ",
        "Several banks are understood to have queried Yorkshire's claims in their pitch to investors about the money they can pull in through naming rights deals, pop concerts and compensation from the ECB.Any decision on whether to accept Badr’s debt funding offer would have to be ratified by Yorkshire’s members.A Yorkshire spokesperson said: 'Stephen Vaughan is currently overseas and was unable to be reached for comment.'"
    ]
}