{
    "articleURL": "/sport/boxing/article-12044329/Ryder-vows-ruin-Canelos-homecoming-undisputed-world-super-middleweight-champion.html",
    "content": [
        "Ryder takes on Canelo for undisputed world super middleweight championshipCanelo is fighting on home soil for first time in 12 years at the Akron StadiumSign up here to watch the fight exclusively on DAZN John Ryder almost lost the fight of his life before he arrived here to challenge Canelo Alvarez for the undisputed world super middleweight championship.",
        "Had the Chivas, Guadalajara's biggest football team, not won here last weekend they would have had to play an extra home game this Friday night.That would have made it impossible to prepare the Akron Stadium in time for Saturday night's big fight. With there being no alternative venue, Ryder's chance of a lifetime and Canelo's great homecoming after 12 years boxing in the US would been off.Chivas needed three points to be sure of qualifying for the play offs for the Apertura, the title for topping the Mexican Premier League at the half way point of the season.",
        "Fortunately their opponents last Saturday night were lowly Mazatlan, who they defeated 4-1.Thus enabling Ryder to depart for Mexico from his training camp across the border in Los AngelesThe key issue involved the necessity for suspending the ring canopy from the futuristic roof of the impressive new stadium. There is only time to do that if work begins early on Friday.Which it will now, allowing the 34-year-old contender from Islington to focus on the mountainous task confronting him here.Ryder told a huge press conference in Canelo's home city that he is 'ready to put up a great fight' and believes 'he has a chance pulling off an underdog surprise.'",
        "He was accorded polite applause before the roars went up for Mexico's national hero.Canelo Alvarez v John Ryder for the undisputed world super-middleweight title will be televised live on DAZN late this Saturday night. Sign up here to watch the fight."
    ]
}