{
    "articleURL": "/sport/football/article-12061047/Nottingham-Forest-4-3-Southampton-Steve-Coopers-men-edge-thriller-three-points-drop.html",
    "content": [
        "Taiwo Awoniyi scored twice in the space of three minutes to put Forest in controlCarlos Alcaraz pulled one back before Morgan Gibbs-White netted from the spotRe-live the action as Nottingham Forest beat Southampton in seven-goal thriller A drenched Ruben Selles trudged over to the away end with a look of guilt and a resignation that his work has not been good enough to keep Southampton in the Premier League.",
        "Barring a miracle in the final weeks, their 11-year stay in the top division will end and Selles’ players, some of them looking on the verge of tears, know their days at this level are numbered and the only thing missing now is the big, fat R next to Saints’ name in the league table.They were picked apart by Nottingham Forest in a 100-minute match that might look like an even thriller on paper but, in reality, was a convincing and well-deserved home win. Taiwo Awoniyi scored his first brace for the club, Morgan Gibbs-White and Danilo added the others.Saints’ away following stayed long after the final whistle to applaud their team who stood in the rain with an apologetic look on their faces. They’ve spent 196 days in the bottom three so fans have had time to process the blow but now the equation is simple. Win every game or go down.It would be unfair to blame the Spanish boss for this monumental mess of a season but his appointment would stand out as one of the worst in Premier League history if not for the second of three men to occupy his seat this season, Nathan Jones, who won just one league game.",
        "So as one 11-year stay in the Premier League comes to an end, another team made a case to extend their status at the top level. Forest played with pace, vigour and belief in the first half to roar into a 3-1 lead, then showed an uncommon valiant defensive steel to see out the win.",
        "The City Ground was rocking before kick-off, with fan group Forza Garibaldi urging supporters to hold scarves aloft during a deafening rendition of Mull of Kintyre. It is hard to think of a better atmosphere in English football than this place at its raucous best.Saying that, though, most in here were a nervous wreck in the opening 10 minutes. From an eavesdropping mission across the Trent Bridge, the general verdict was ‘do or die’ for Forest, who have two tricky away games in their final three.‘We’re so lucky to play in front of these supporters,’ said Cooper, who walked into his press conference drying himself with a red towel. ‘They don’t half drag us over the line.‘We talk openly about the relegation battle, we don’t want elephants in the room. But we always bring it back to what we can do to influence it. We knew what went on (Everton winning 5-1) but never lost focus of what we needed to do.’But any early Forest anxieties were soon calmed as Awoniyi opened the scoring on 18 minutes after a fantastic counter-attack started by a perfect Danilo pass and finished with Brennan Johnson squaring to the Nigerian to fire home.It was Awoniyi’s first league goal since January 4, also against Saints, which was also Forest’s only away win of the season, with a staggering 27 of their 33 points this season coming at home. With two away games to come, that stat underlined the importance of this game.",
        "They gave themselves a good chance and found themselves two goals up just three minutes after Awoniyi’s opener. ",
        "NOTTINGHAM FOREST (4-3-1-2): Navas 7.5; Aurier 7 (Worrall 64, 6.5), Niakhate 7, Felipe 7, Lodi 6 (Toffolo 81); Mangala 6.5, Yates 7 (Kouyate 70, 6), Danilo 8; Gibbs-White 8.5; Johnson 7.5 (Boly 81), Awoniyi 7.5 (Surridge 81).Subs not used: Hennessey, Lingard, Freuler, Ayew.Booked: LodiManager: Steve Cooper 7SOUTHAMPTON (4-2-3-1): McCarthy 4; Walker-Peters 5, Bednarek 5, Bella-Kotchap 4 (Lyanco 38, 6), Maitland-Niles 3; Ward-Prowse 6.5, Lavia 6.5; Walcott 5 (Sulemana 61, 6), Alcaraz 5 (A Armstrong 76), S Armstrong 6 (Edozie 76); Adams 6.5 (Onuachu 76).Subs not used: Bazunu, Caleta-Car, Mara, ElyounoussiBooked: NoneManager: Ruben Selles 5Referee: Michael Oliver 7.5Attendance: 29,154",
        "After perhaps getting lucky with the finish for the first, the brace was emphatically volleyed past Alex McCarthy.Those Garibaldi scarves were soon being swirled above heads. Even animated Greek owner Evangelos Marinakis slouched back in his seat and relaxed until Saints pulled a goal back, with Charly Alcaraz finishing off a tidy move that left one wondering why Saints are rock bottom.Those thoughts were wiped away after sloppy decisions led to Ainsley Maitland-Niles conceding a penalty, which Gibbs-White finished.‘We need to be more robust and competitive,’ said Selles. ‘I can’t speak for Ralph and Nathan’s time but there are many different factors (why we are in this position).",
        "‘My job is to keep fighting and giving my very best every day. (My future) is a decision for the club, I will be happy to be here for the next 10 years.’The pattern of this game turned drastically after the break. Forest looked nervous and Lyanco thumped home a header not long after the restart and the away team sensed a comeback.Cooper’s side are haunted by a couple of second-half capitulations this season. They have dropped 23 points from winning positions this term, more than any team in the league but Leicester, and a league-high 15 of those coming at home.James Ward-Prowse bombarded Forest’s six-yard box with fizzing set-pieces but Keylor Navas, a three-time Champions League winner, showed his experience to deal with the aerial onslaught.",
        "But just as anxieties seemed to reach boiling point, Forest ventured forward - a rarity in the second half - and Danilo scored a fourth, after a clever flicked assist from £42.5million man Gibbs-White. From a long list, the former Wolves man is their best business since promotion.The folks at Stockley Park had a busy end to the game, first ruling out Danilo’s goal for offside then awarding Saints a questionable penalty, which Ward-Prowse fired home. Was that his last goal for the club? Selles roared with belief as he told his team there were five minutes to get an equaliser but time soon ran out. Just like it is for Southampton as a Premier League club."
    ]
}