{
    "articleURL": "/sport/afl/article-12044269/North-Melbourne-Kangaroos-AFL-star-Jaidyn-Stephenson-slams-club-betting-suspension.html",
    "content": [
        "Stephenson has slammed his own club Says switch from Magpies was 'tough' Almost paid huge sum for shock reason Kangaroos star Jaidyn Stephenson has slammed the environment at the club during sacked coach David Noble's tenure - and revealed the eye-watering sum he was almost forced to part with for his favourite number.",
        "The 24-year-old exploded onto the footy scene after being drafted with pick No.6 in the 2017 by Collingwood, going on to win the Rising Star award in his first season. But despite his prodigious skill, it has been a rollercoaster ever since, with the Magpies eventually shoveling him off to North Melbourne in 2021.After playing at arguably the biggest club in the league, Stephenson then endured two years under David Noble, with the team winning just five of 38 matches in that time.The club continued to sink to new lows after a horror decade, and Stephenson explosively laid the blame for that squarely at the feet of Noble and his coaching team in a withering spray. ",
        "'It's hard going from a successful team, I'd played eight finals in three years and a grand final; to go to the bottom of the ladder is a big difference,' he told ex-AFL player Tom Sheridan on his podcast, Ausmerican Aces.'When you're winning you can get away with anything.'I did start losing my passion for footy ... but Clarko (current coach Alastair Clarkson) has certainly brought it back because he rewards role players. 'In the past few years, I could go 20 disposals and two goals, which is a reasonable game - but a key message in the review would be \"(you've) got to pressure more\". ",
        "'So next week I go \"got to pressure, got to pressure\" and get 10 touches and no goals - and it will be \"Stevo, what are you doing, you've got to kick two goals\".'There was too much going on. Every week there seemed to be something I was doing wrong, or wasn't doing, rather than looking at the things I was doing well.'This year has been a massive change.' North Melbourne, despite sitting 15th on the ladder, have improved ever so slightly this year under four-time premiership coach Clarkson; but players definitely do appear to be playing with more happiness and freedom - even if the results aren't ideal. It's certainly been an up-and-down few years for Stephenson, who has often found himself under intense criticism from greats of the game and AFL pundits, including fracturing his hip in 2021 during a drunken bike accident.But much of it began back in 2019, when Stephenson sent the footy world into meltdown after being suspended for 10 matches for betting on games he was playing in. ",
        "He placed same-game multis on three Magpies matches, which was only uncovered after he made an offhand comment to then-teammate Jeremy Howe about one of their teammates costing him a multi win. The bets themselves only cost $36, but Stephenson conceded at the time he placed them because a friend of his 'was doing the same thing' and that he would check the scores in the dressing rooms immediately after a game to see if they won. ",
        "Stephenson is still holding onto some animosity from the whole affair and believes the situation 'should've been handled differently' - though it is not clear what part he disagrees with.'The betting suspension was hard to take,' he said of the 2019 affair.'I stuffed up but I think the situation could've been handled differently and might not have had the same ramifications.' At the time, many critics actually believed a 10-game ban was too light - with another suspended 12-match ban to come into force if he bets again on AFL games at any time in his career. For example, multiple NFL players have been handed down season-long and indefinite suspensions for similar or lesser offenses than Stephenson.The charismatic forward also revealed he was almost forced to part with an eye-watering $10,000 sum just for wearing his favourite number, 16, while at the Magpies.",
        "Traditionally, to honour cult hero Simon Prestigiacomo for selflessly ruling himself out of the club 2010 grand final win, Collingwood's first pick in every draft wears his old number, 35. This included Stephenson, who wore it in his first year before he passed it to Isaac Quaynor. Nick Daicos, the son of club legend Peter, will now keep it to honour his father - but all Stephenson was concerned with was the ex-teammate who denied him the actual jersey number he coveted. ",
        "'I always had No.16 on my back growing up, for Jonathan Brown; loved him, mad Brisbane supporter,' Stephenson said. 'And then after I obviously had my first year in 35, I knew I had to change numbers, and Chris Mayne was in 16.'I said to Mayney, \"C'mon, mate, your career's nearly done, how about you give me 16, and you can just move to another number for your last couple of years?\".'He (Mayne) goes, \"Stevo, if I see an envelope with $10,000 cash in my locker, you can have 16\".'",
        "Through gritted teeth, Stephenson thought it was just a bit too steep for a number, and begrudgingly chose no. 1 instead. It's inconceivable for many Aussies to imagine parting with so much cash just for a jersey number - but it is actually reasonably commonplace in the NFL. For example, ex-Bucaneers superstar Gerald McCoy had to fork out $250,000 when he joined Carolina to get himself his favoured no. 93.Stephenson then aimed a little drive-by at the Kangaroos fanbase - or lack thereof - when he discussed what number he picked, with the idea of using Lions legend Johnathan Brown's number now gone.  'When I moved to North, they said, \"You can keep your No.1 if you want\",' he explained. ",
        "'Obviously, you don't sign as many things when you're at North, but when I was at Pies, (I was) signing all the time ... and the little 1, it's this thick, so it's so hard to get a tiny little signature on (the number).'So, I've gone for the no. 2 (at North) and it's allowed me to do big, massive signatures. That's the thought process behind it.'",
        "Stephenson is an interesting character who's never shy of voicing his opinions - though he has claimed that his ability to do so is stifled as an AFL player.A devotee of highly controversial podcast host Joe Rogan, Stephenson has been inspired to start a podcast of his own so he can speak his mind. 'I've been listening to a lot of Joe Rogan podcasts, your podcast (Ausmerican Aces) .... as AFL footballers get a lot of time off and I've been struggling to find things to fill in my time,' he said.'As footy players, during the week we generally have to straight bat it and you can't really express your opinion ... so getting out there and getting to know ... athletes at their inner core, rather than face value, is something that intrigues me.' That being said, when he expressed his opinion that the Covid pandemic was simply overblown by the media and wasn't a 'big thing' he ignited a storm of controversy as Australians grappled with a disease that has killed more than 19,000 in this country. ",
        "Stephenson and his Kangaroos teammates will look to reverse a patch of very poor form this Sunday afternoon when they take on St Kilda at Marvel Stadium.  "
    ]
}