{
    "articleURL": "/tvshowbiz/article-12054887/BGTs-Ant-Dec-choose-French-singer-GOLDEN-BUZZER-choice-baffles-judges.html",
    "content": [
        "Britains Got Talent hosts Ant and Dec chose singer MB14 as their golden buzzer act after he left judges baffled by his bizarre and unique vocals on Saturday.",
        "The Geordie duo, both 47, ran from the wings to push the all-important button that guarantees acts a place in the live semi-finals after being blown away by the French performer. However, viewers were quick to slam the ITV talent show as a 'fix' after it was revealed the contestant already has a successful career and once appeared on The Voice in his home country.MB14, real name Mohamed Belkhir, 28, took to the stage and after flirting with Bruno Tonioli, 67, said Britain's Got Talent had 'inspired' him and he had always dreamed of appearing.Then with only his voice, he mimicked dozens of instruments and beatboxed, leaving the judges mouths gaping.",
        "Alesha Dixon, 44, asked: 'Is that really him doing that?' before Ant and Dec stormed the stage to push the gold buzzer.As confetti fell from the ceiling Bruno said: 'Literally I was hypnotised by your music, thats the power of music!'While Simon Cowell, 63, added: 'I don't know where you have been, we should have heard of you by now because this was phenomenal!'. Before declaring: 'This was one of the great great auditions you will never forget.'However unhappy fans were left unimpressed by the star's CV with one writing on Twitter: 'Yes he is the winner of many beat box competitions and a film star in France MB14 again a fix'.",
        "While a second added: 'He's brilliant i agree but just bit of a fix'And a third wrote: 'Just googled him. He has been on The voice France as a runner up. Obviously scouted'. Someone else commented: 'Buzzed after 3 seconds ...fix'. When approached by MailOnline, a BGT spokesperson said: 'Naturally performers who want to take their career to the next step, will take every opportunity they can to showcase their act. 'Fix' headlines are false and misleading to viewers.  'We encourage BGT viewers to continue showing their support to our incredible contestants on the show, regardless of any previous experience. 'BGT has always made it clear that anybody can apply for the show irrespective of their previous experience as all acts audition on the same basis and contestants are auditioned on merit only. Therefore, there is no 'fix', and such false claims are treated seriously'. ",
        "After his appearance on the French singing competition in 2016 he went on to sign a contract with Polydor, a record company he later left. With 35,000 monthly listeners on Spotify he was invited back to compete in The Voice All Stars.  It comes after Britain's Got Talent fans were left in shock after finding out what REALLY happens when the judges press the Golden Buzzer.",
        "A clip was posted to Twitter by someone who was in the audience when 11-year-old Olivia Lynes got judge Amanda Holden's buzzer on Saturday night's show.The video was filmed from the circle level of the theatre and showed three men on stage after Amanda chose to send her straight through to the semi-finals.",
        "One was holding up a machine to spray out the golden confetti onto Olivia's head, while another is crouched down filming the little girl, supported by a third member of crew.And after seeing the clip fans were shocked that the confetti didn't in fact fall down automatically from the ceiling but was actually done by a crew member stood in front of the act. The BGT fan wrote on Twitter alongside the video: 'Golden Buzzer reshoots aren't as cool looking in real life than all the slow-mo stuff you see on the TV...'It's just a guy blowing confetti onto the contestant while cameras film in slow motion...'One then said in reply: 'They did shoot all this in real time. They just want slow motion shots of the contestants and judges and you need cameras with high frame rates set so they can slow-mo it, so re-record it all now. It's becoming too AGT with the fakeness.'",
        "Someone else said: 'And the golden confetti doesn't come from the ceiling?? Magic spoiled.'Another agreed: 'It's true. A huge anticlimax.'",
        "Someone else replied: 'I mean it is telly, so of course not. I have no massive issue unless what they're trying to get shots that didn't happen in real time. I would prefer if they didn't but clearly they're wanting to make it more like AGT.'Amanda said she was 'blown away' by 'amazing' Olivia after she encouraged the schoolgirl to audition for Britain's Got Talent. The judge  pressed her Golden Buzzer for the schoolgirl during last weeks episode after her incredible rendition of Defying Gravity from Wicked, left fellow panelist Bruno fighting back tears. Speaking exclusively to MailOnline after the show, Amanda admitted that she 'had no idea Olivia could sing' when she met her the previous day to tell her that her mum and nan had signed her up for her contest. Despite not knowing if she 'was allowed to push the button,' the TV personality pressed the Golden Buzzer after her performance received a standing ovation. Amanda explained: 'So I didn't know if I was allowed to press it for her because I'd actually met her the day before as part of our golden moments and encouraged her to come down and audition.'",
        "Britain's Got Talent airs on Saturday nights, ITV "
    ]
}