{
    "articleURL": "/femail/article-12043141/Why-doesnt-society-second-mums-like-credit-love-hard-work.html",
    "content": [
        "A second mum takes on the chores which meant co-parenting my nephewsREAD MORE: I'm a parenting expert and these are my top 5 tips for what you should say instead of telling kids 'no'We hear a lot, these days, about the rise of childless - or, following a timely rebrand, child-free - women. At 59, I am technically one of them, since despite longing for a baby I never had one of my own.",
        "But I'm also a member of another group that is less talked about. I am one of the legion of women who put our lives on hold to help our relatives or friends raise their families after divorce, separation or widowhood.I am a second mum.This is nothing like the 'Pank' (professional aunt, no kids) who appears laden down with lavish treats and gifts, plays with the children for an hour or so and just as swiftly disappears again.A second mum takes on the everyday chores. For me, that has meant co-parenting my two nephews, George and Oskar, since my younger sister Louise's separation when they were four and eight, and her divorce five years later. ",
        "I have cleaned up spilt drinks and crisps from down the back of sofas, broken up fights, got up bleary-eyed at 3am to soothe a nightmare, mopped up tears from scraped knees, cancelled dates for babysitting and put holidays on hold to be at the school gates.At the same time, I know that my laughing claim to the title 'second mum' is a mask of sorts, hiding the lingering pain that I'll never know the love of my own child.My role means everything to me, but nothing to most of the world. At family events, I am still the childless auntie. There are no badges, no days of Second Mum celebration or membership of the swim mums WhatsApp group.",
        "The role started by accident 13 years ago, when Louise and her husband split. Up until that point, although we all lived in the suburbs of London, apart from Sunday family lunches and the odd walk in Richmond Park, I rarely saw George and Oskar.But Louise didn't want to disappoint her sons by cancelling their holiday to Marbella, so she begged me to come in place of her ex. I was working on a book, but was so excited at the prospect of time with the children, I jumped on a plane. It wasn't an easy time, but it was the best holiday I've ever had.Carrying the boys on my back in 90-degree heat, and being dive-bombed in the swimming pool as I tried to breaststroke, was a lesson in Buddha-like patience. It also made me feel like I could have a significant role in the children's lives, especially since their father travelled a lot with work. They hardly saw him now they were living apart.When we returned to London, I told Louise I wanted to help, properly — and she agreed. I haven’t tried to replace Louise as their mum  Like most lone parents, Louise coped because she had no choice, but I could see the weight of responsibility and bone-aching tiredness etched on her face.",
        "I'm Louise's big sister, and I've always looked after her, so it seemed natural to step in.I would cook in the evenings when Louise had been working four days a week as a studio manager for an interiors company, and I'd give her a chance to rest when she was getting up at 4.30am to take an 11-year-old Oskar to swimming — he was in the Surrey County Squad.Divorce is often unavoidable, but repeated studies show its fallout can be devastating for children. I was adamant my nephews would not be those children.Gillian McCallum, founder of co-parenting network Creating Parents, says our type of arrangement is booming in popularity, with 'single parents, siblings and even friends' coming together to give children the 'care and love' they need. It seemed to work, too.",
        "There were frequent tears in the early days, when something triggered a memory of their father. But one Saturday afternoon in July, several months after the split, as the boys and I sat gobbling crisps and fizzy drinks at Whole Foods in London's Kensington - they could pick whatever they wanted to eat on Katie Days - something shifted.I pulled a funny face and they began laughing hysterically. My goodness, the palpable relief. Even though they missed their father terribly, they seemed happy. It was the vindication I needed that Louise and I were doing the right thing.",
        "I had been desperate for my own children, but after two miscarriages in my late 30s, it just never happened. I found myself single, childless and the wrong side of 40.A brief engagement to the man I hoped to spend happy-ever-after with broke down - and then I was 47 and the window of baby opportunity was well and truly shut. But being so involved with my nephews meant I got a ready-made family of my own. And, admittedly, an overnight introduction to the sharp end of parenting.I had been blissfully unaware what it means to look after two hyperactive boys. At the beach on that first holiday, I was so terrified of losing one of them that I contemplated chaining them to the sun lounger.On a sleepover, I proudly presented them with spaghetti in a rich ragu. The boys refused to eat it, preferring to fling tomatoey strands at each other and all over the table.'Small children are not partial to fancy food,' Louise later pointed out, laughing. At first, they didn't understand my shift to co-carer, rather than co-conspirator. They just looked at me strangely after I told them in an imperious voice to 'stop banging each other on the head' or 'put the biscuits back in the cupboard'.",
        "Factor in the squabbling and whining that were suddenly aimed at me, and it did cross my mind to throw in the towel.But picking them up on Mondays and Thursdays became a doddle once I discovered a nearby Tesco and plied them with sweets. This was a second mum privilege; if I was looking after them all day every day, those sweets would have had to go.The freewheeling life I once took for granted was put on hold. It was pretty full-on; three days of childcare a week (including Saturday) and the monthly sleepover. Not to mention the babysitting.I shall never forget the time I was dating a charming man named Jeremy in 2015. It was his birthday and he had invited me to a lavish weekend at a country house hotel. I longed to go, but I said no as it would mean missing my Saturday with the children.Louise said they would be fine. But I didn't want to let the boys down. Jeremy was disappointed, but forgave me . . . until it happened several more times. In the end, he left.Still, I believe wholeheartedly that I did the right thing.I swapped sophisticated restaurants for kiddie eateries, mopping up bits of food and trying to talk over the horrendous din.",
        "Spontaneous late-night parties were scratched off the to-do list. I was too tired for a start — when Oskar, then five, woke me up with a cup of imaginary tea at 5.30am one day, I realised why sleep deprivation is categorised as a form of torture.More importantly, knowing Louise and the boys needed me gave my life meaning.I remember prepping Oskar for an English exam and telling him to 'start the story in the middle of the action'.'How did it go?' I asked the following day as he rushed in. 'I started the story in the middle of the action, Katie,' he replied proudly. I could have cried with joy.When people thought I was their mother — usually at the swings in Hyde Park — I would beam with pride, and tell them laughingly, 'No I'm just their second mum'.Now they're older I can share more with them. They have a fascination with my dating life.'Let me,' they argue, grabbing my iPhone and laughing at the faces of prospective dates as they swipe right on Tinder. Little did I know they had also been sending cheeky messages — until a curt missive pinged back from one disgruntled suitor.While I have an incredibly close bond with the boys, I never tried to replace Louise as Oskar and George's mum. I am well aware that the weight of responsibility, the sleepless nights and all the other everyday, teeth-gritting bombs that fall on real motherhood never really touched me.I have learnt my lesson: her children, her rules. Whatever I thought about Louise's parenting style, I learnt to restrain myself from offering tips. I may have seen my advice as constructive; she saw it as undermining her, even suggesting she was a bad parent. Like the summer afternoon in Hyde Park when the boys were playing up and Louise was telling them off. I chipped in.'Oh come on, Louise, let them enjoy themselves.' She snapped back: 'When you look after them 24/7, then tell me what to do'. She was right, but I stood my ground and we were soon at each other's throats. It shook us both, and after that, we tried hard to curb our tongues. Anyway, on the rare occasions Louise and I did have a fall-out, the boys would always side with their mum.Nevertheless, Louise often says she wouldn't have been able to cope through those first hard years without me.Oskar, now 18, says: 'You put us first. To be honest, not all aunts would do what you did for us.'When I got Covid in March 2020 and had to spend an evening in hospital, George sent me a text. 'Don't worry, Katie,' he said, 'nothing will happen to you, you're one of the loveliest people.'I would have burst into tears if the coughing hadn't stopped me.It's not easy being 'just' a second mum. But be in no doubt, I would do it all again in a nanosecond.LOUISE'S VIEWI love being a mum, and although I didn't ask Kate for help, when she offered, I was over the moon.She has always been there for me, especially when I was younger and it felt soothing to have that support back.It was the perfect solution to enable me to go to work, safe in the knowledge that the boys were with someone they loved and who loved them unconditionally. Kate has always been there for me  I don't think I could have managed without Kate's help in those early days. When I separated, it was a shock to the system - it all felt so daunting, suddenly alone bringing up two little boys.I am fine about getting up early and working hard, but I appreciated Kate picking up the slack of childcare - it gave me that much-needed break.More importantly, just having someone there who I could trust and chat to if I was concerned about something was vital.To me, second mums do the soft parenting: never scolding the children or getting up at dawn (that is a first mum job), but still performing all the day-to-day mum tasks including cooking, picking them up from school and giving them baths.Plus, of course, devoting their time and care to making the children feel special and loved.And a second mum can spoil the children without impacting their upbringing. It's the first mum who has to set the example and bring in the boundaries."
    ]
}