{
    "articleURL": "/femail/article-12050833/Jill-Biden-granddaughter-Finnegan-meet-Prime-Ministers-wife-ahead-King-Charles-coronation.html",
    "content": [
        "Jill, 71, and her granddaughter, Finnegan, met with Akshata Murthy on Friday Finnegan - the daughter of President Biden's scandal-ridden son Hunter - wore a chic navy suit and beige heels for the engagement Jill and Finnegan are due to attend King Charles' coronation ceremony at Westminster Abbey on Saturday, while President Joe will remain in the US First Lady Jill Biden put on a very colorful display to brighten up a grey day in London on Friday, when she and her granddaughter Finnegan met with the British Prime Minister's wife ahead of their attendance at King Charles' coronation on Saturday. ",
        "Jill, 71, donned a hot pink coat and sweater for the occasion, which she paired with some $1,150 Christian Dior floral-print slingback heels and a clear umbrella to guard herself against the drizzle. Meanwhile University of Pennsylvania graduate Finnegan opted for a more toned-down outfit, arriving at Downing Street in a chic navy blue suit and beige heels. Finnegan, who is the daughter of President Joe Biden's scandal-ridden son Hunter, traveled to London with her grandmother as the First Lady's official plus one for King Charles' coronation ceremony on Saturday - after her grandfather sparked furious controversy by opting to skip the historic event. ",
        "Meanwhile, Akshata Murthy, the wife of Prime Minister Rishi Sunak, flew the flag for British designers by sporting a patterned blue silk midi dress from London-based brand Rixo, which she paired with some pointed-toe heels from UK label LK Bennett - which is a favorite of the Princess of Wales. Upon their arrival at Number 10 Downing Street, Jill and Finnegan received a very warm greeting from Akshata, who kissed the First Lady on each cheek, before shaking hands with her granddaughter. While the three women happily posed for photos, their meeting - which comes less than 24 hours before Finnegan and Jill are due to join 2,000 other select guests at Westminster Abbey for the coronation - took place behind closed doors with no press granted access. ",
        "In honor of the historic royal occasion this weekend, the exterior of Number 10 Downing Street - the official residence and office of the Prime Minister - was decked out in Union Jack and coronation-themed bunting.After heading into Number 10 for their private meeting, Jill and Akshata made their way into the residence's pillared room where they met with a group of veterans who are taking part in a health and wellness program called The Fighting Chance, which provides boxing training and employment support to former members of the military. The veterans who are involved in the program took part in some sparring together while the two women watched on, joined by Jane Hartley, the US Ambassador, and Johnny Mercer, the Minister for Veterans' Affairs. Jill asked the Minister to 'show me what you are doing', before being led round the room and introduced to several of the veterans - including Maurillia Simpson, a gold medal winner in the Invictus Games, who stood up from her wheelchair to give the First Lady a hug. After thanking Maurilla and her fellow former military members for their service, Jill and Akshata departed Downing Street, waving for the photographers before climbing into the back of a waiting SUV.  ",
        "From there, the women traveled to Charles Dickens Primary School in London, where they met with a group of students who are taking part in a variety of coronation-themed activities. ",
        "The school's principal, Michael Eggleton, accompanied Jill, Finnegan, Akshata, and Ambassador Hartley on a tour of the school, which was guided by several student leaders. At one point, the four women stopped by a music class, where they were treated to a student performance of Lovely by Billie Eilish. 'It was incredible,' Jill remarked after the children - many of whom were wearing paper crowns in Charles' honor - had finished the song. 'This was a treat, thanks for having us!' She then thanked the children for 'sharing your talent with us', before the group departed the school - with Jill now heading to a meeting at the US Embassy. Jill seemed in her element at the school - where she also had a chance to chat with the kids about her own decades-long career as a teacher. Most recently, she has been serving as a professor of English and writing at the Northern Virginia Community College, where she taught throughout the eight years that her husband spent as Vice President. During Biden's campaign for the White House, Jill made clear her desire to maintain her own career, telling CBS back in August 2020: 'If we get to the White House, I'm gonna continue to teach. It's important, and I want people to value teachers and know their contributions, and lift up the profession.'",
        "In keeping her job as a community college professor into her husband's Presidency, Jill became the first presidential spouse to maintain an independent career outside of the White House. However, while her London trip gave her an opportunity to share her love of the teaching profession, she appears solely focused on her duties as First Lady while in the UK, which will see her completing a busy schedule of events and meetings, with the help of Finnegan. This evening, Jill is due to attend a reception at Buckingham Palace, which will be hosted by King Charles. It is thought that Finnegan will be by Jill's side at the event, although her attendance has not been confirmed.Finnegan's trip to London was only announced by the White House on Thursday in a statement shared via the East Wing which read: 'There is no official U.S. delegation. Finnegan is a plus one. 'As we’ve noted before with other family travel, historically, family members of Presidents have frequently joined them during travel. Current practices are consistent with those used by prior Administrations.'Meanwhile, Jill expressed her excitement about the trip.'Headed to the U.K. for the Coronation of King Charles III – the first in 70 years!' Jill tweeted on Thursday as she left Joint Base Andrews. ",
        "'It's an honor to represent the United States for this historic moment and celebrate the special relationship between our countries.'President Biden called the King in April to tell him that Jill would attend the coronation on behalf of the United States.And former President Donald Trump said it was 'very disrespectful' for Biden to turn down the invite and send his wife instead.'I was very surprised to see that. I think it's very disrespectful for him not to be here,' Trump said in an interview with British commentator Nigel Farage.'I don't think he can do it physically, actually. I think it's hard for him to do it physically,' Trump said. 'Certainly, he should be here. He's our representative of our country.'The White House has noted that no sitting U.S. President has ever attended the coronation of a British monarch.During the last such event, when Charles' late mother Queen Elizabeth was crowned in 1953, then-President Dwight Eisenhower sent a delegation of envoys to represent him. President Biden did accept an invitation from the King for a state visit to the UK, however no date has yet been set for that trip.This London trip is by no means the first time that Finnegan has served as an official representative of her grandfather's administration, having also been by his side for much of his Presidential campaign back in 2020.  ",
        "Although she has kept her private life largely away from the public eye - unlike her sister Naomi whose Instagram account is open and regularly updated - Finnegan made several appearances alongside Biden during his quest for the White House. The first granddaughter has also been on several other presidential trips, including a trip to Spain last June, where Biden was attending a meeting of NATO countries. She is due to be by her grandmother's side at the coronation ceremony at Westminster Palace tomorrow, and it is thought that she will also accompany Jill to an evening reception hosted by Ambassador Hartley later on in the evening - as well as the Coronation Big Lunch at Downing Street on Sunday, which will be hosted by the Prime Minister and his wife. The grandmother and granddaughter will then return to Washington, D.C. that evening. Jill's visit to the UK comes after new research revealed that she is actually a distant cousin of King Charles. The monarch and the First Lady both descend from 16th century noble couple Philippe III de Croÿ and his wife Johanna, making them 13th cousins once removed. Philippe III, who died in 1595, served as a knight under Spain's King Philip II, the husband of Queen Mary who sent the Spanish Armada to invade England in 1588. The research by genealogy website MyHeritage has also shown that the King is a 12th cousin of Canadian PM Justin Trudeau, who will also be at the Coronation. "
    ]
}