{
    "articleURL": "/tvshowbiz/article-12053541/Michelle-Yeoh-leads-stars-one-shoulder-gown-TAAF-Heritage-Heroes-Awards-Dinner.html",
    "content": [
        "Michelle Yeoh led the arrivals at the TAAF Heritage Heroes Awards Dinner at The Glasshouse in New York City on Friday.",
        "The Oscar winner, 60 - who is currently starring in the film adaptation of Broadway's Wicked - looked elegant in a sleek black one-shoulder gown with a sweeping white train.The Asian American Foundation's inaugural Heritage Heroes dinner celebrated the achievements of AAPI leaders across different industries.Executive Vice Chairman of Alibaba, Joe Tsai joined Michelle onstage as he presented her with the Culture Award during the prestigious event attended by fashion designer Vera Wang, comic book artist Annie Wu, professional golfer Michelle Wie West, and business reporter Hope King. In March, Yeoh made history as the first person of Asian descent to win the Academy Award for Best Actress for her performance as Evelyn Wang in Everything Everywhere All at Once. ",
        "Daniel Dae Kim looked sharp in an all-black suit and turtleneck as he walked the black carpet. The South Korean-born actor has been seen on Hawaii Five-O and Lost and has also been a producer on the ABC hit series The Good Doctor.Comic book creator Annie Wu looked lovely in a gold maxi dress with voluminous tiers and a large bow adorning her sweetheart neckline.Professional golfer Michelle Wie West showed off her chic style in a black puff-sleeve belted midi dress paired with strapped heels.Reporter Hope King looked elegant in a black halter neck dress with a high slit up the side and strappy heels. ",
        "King tied a fuchsia flower around her neck and carried a pink Gaia Nala shell-shaped mini clutch purse. Other awards given during the ceremony included the Art &amp; Design award, which was accepted by House of Slay founders Phillip Lim, Tina Leung, Prabal Gurung and Ezra William.Bain &amp; Company CEO Manny Maceda received the Corporate Award, while Congresswoman Grace Meng was bestowed with the Public Service Award.Harpreet Singh accepted the Community Award on behalf of The Sikh Coalition. On Saturday, TAAF will host an All-Star basketball game benefiting Apex for Youth. ",
        "The Asian American Foundation (TAAF) aims to foster a permanent and irrevocable sense of belonging for the 23 million Asian American Pacific Islanders (AAPIs) living in America. TAAF launched amidst surging anti-AAPI hate during COVID-19, and aimed to address the drastic underinvestment in AAPI communities. Only 3% of top grossing films made since 2007 featured AAPIs, and only 0.2 percent of philanthropic giving from foundations goes to AAPI nonprofits.For these reasons, TAAF partnered with the AAPI-owned production company Enfranchisement Productions, and the branding house FutureFriends, to create a special film event, AAPI Heritage Heroes to spotlight AAPI stories and work towards dispelling hateful stereotypes."
    ]
}