{
    "articleURL": "/news/article-12047707/ATHEY-Drag-queens-NOT-answer-Navy-recruitment-crisis.html",
    "content": [
        "Eat your heart out, Top Gun.",
        "The U.S. Navy has chosen a particularly unexpected approach to the current military staffing crisis – and it’s sparked an all-out war.Former Navy SEAL Robert J. O’Neill, who took part in the 2011 mission to kill Osama Bin Laden, hit out on Twitter at the Navy’s recent decision to hire an active-duty drag queen to boost recruitment.‘China is going to destroy us… I can’t believe I fought for this bull****,’ O’Neill raged over the November appointment of non-binary Yeoman 2nd Class Joshua Kelley, who moonlights as cross-dressing performer ‘Harpy Daniels’.And can you blame him?The Navy says the Digital Ambassador program – a pilot scheme which has since ended – was an attempt ‘to attract the most talented and diverse workforce.’Excuse me – the most talented?O’Neill and his team seemed to manage fine without wigs, fake breasts and garish makeup. What an insult!",
        "Now, of course, our servicemen are welcome to do whatever they like for entertainment in their free time – no matter how tacky I may personally find their choice of pastime. But this seems a particularly misguided attempt by Navy bosses to address staffing problems, which cannot be overstated.The Navy already expects to fall short of its current fiscal year recruitment target by 6,000.",
        "And it’s not just sailors. All our armed forces are suffering from denuded ranks.The Army will likely miss its hiring goal this year by 10,000. Last year they fell short by a shocking 15,000.Why? There are numerous cultural conditions which mean young Americans are less likely than ever to join the military.Not least among them is the shameful fact that, as a study by the Pentagon found last year, 77 per cent of 17 to 24-year-olds would fail to qualify for service because they are overweight, abuse drugs, or suffer from mental and physical health problems.Some experts have also pointed to the Biden administration’s botched withdrawal of troops from Afghanistan in August 2021 – during which 13 U.S. servicemen died – as a demotivating factor.Meanwhile, patriotism is at an all-time low among woke millennials and Gen-Z.Just 25 per cent of citizens aged 18 to 34 say they are ‘extremely proud’ to be an American, compared to 51 per cent of people aged 55 and over, according to polling firm Gallup.",
        "In other words, the U.S. military – the very thing that secures our place as the leader of the free world – is facing a full-blown existential crisis.And yet, top brass would seemingly rather spend their brain power – and public cash – virtue signaling by pinning their colors to the latest ultra-liberal fad.",
        "How pathetic.These are the men and women charged with our protection. Who are supposed to rise above the cultural noise and make confident, well-judged decisions in the national interest – not the interests of a tiny, but vocal minority.The Left might have you believe that ‘queer’ identification is the new normal. But it’s not.Still only 5 per cent of adults under 30 – surely the most progressive – identify as transgender or non-binary.And how many of them, would you guess, are likely to want to serve in the military?It doesn’t take a genius with decades of experience in complex battlefield strategy to see that something doesn’t add up here.So the question has to be asked: who on Earth is making these marketing decisions?Is it the same over-paid bosses who have recently dragged our armed forces into disrepute over repeated embarrassments on the international stage?",
        "I mean the Afghanistan withdrawal, the current debacle over the evacuation of Americans from war-torn Sudan, the recent Pentagon intelligence leaks.It’s no wonder young Americans don’t want to entrust their lives to these people’s care.This hasn’t emerged from a vacuum.Consider the recent rows over so-called ‘Drag Queen Story Hours’ for children in libraries, dangerous puberty blocking drugs for minors, the new corporate obsession with ‘Diversity, Equality and Inclusion’ in the workplace – or even the Bud Light fiasco which saw the company’s stock price tank after partnering with TikTok trans activist Dylan Mulvaney.",
        "That all makes the Navy’s decision to hire Joshua Kelley even more tone-deaf.Politically divisive issues should have no place in matters of national security.Indeed, one would hope that our military leaders are less concerned with fighting the culture wars than holding off the threat from terrorist states.But somewhere along the way, the aptitude for sound judgment has been eroded.Last June, the Navy came under fire after releasing a risible training video urging sailors to create ‘safe spaces’, and use ‘inclusive language’ and ‘preferred pronouns’.The year before, it had emerged that the U.S. Military Academy at West Point, New York, was offering trainees an elective course focusing on critical race theory, named ‘Politics of Race, Gender, and Sexuality’.",
        "But people are losing patience with this kind of petty politicking. And, if the Navy truly hope to tackle their flagging recruitment, they would do well to take heed of the Mulvaney row.Bud Light executives are learning the true meaning of ‘go woke, go broke’, as sales have continued to plummet since hiring the controversial TikToker. There was a staggering 26 per cent decline in the final week of April – and overall sales for the year are down 8 per cent.In a groveling call to investors on Thursday, Bud Light CEO Michel Doukeris was forced to row back on the misguided partnership, claiming it was ‘not a campaign’.",
        "So, as the battle against Russia in Ukraine drags on, and the cold war for supremacy with China reaches new heights, it’s time to get some priorities straight.A congressional war game last month prompted calls for ‘decisive action’ after a simulated Chinese invasion of Taiwan proved the U.S. was wholly unprepared for such a conflict.Before it’s too late, we must cut the woke posturing and focus on what our suffering armed forces sorely need."
    ]
}