{
    "articleURL": "/wires/aap/article-12058205/Irishman-Keane-frame-make-AFL-return-Crows.html",
    "content": [
        "Irishman Mark Keane is in contention to play his first AFL game in two years as Adelaide are forced into a reshuffle of key defensive posts.",
        "Keane has not featured in the AFL since May 15, 2021, when he played the last of his five games with Collingwood.Despite being contracted to the Pies last year, he stayed in Ireland amid the COVID-19 pandemic and continued his Gaelic football and hurling careers in County Cork.Keane, delisted by the Magpies at the end of last season, was signed by the Crows in January as a pre-season supplemental selection and returned to Australia.The 23-year-old looms as a potential replacement for Crows defender Nick Murray, who will miss Sunday's home clash against St Kilda because of concussion.Murray was substituted after copping a head knock in the second quarter of Adelaide's away loss to Geelong on Saturday.\"Match committee will sit down tomorrow to go through that (replacement) a little bit more,\" Adelaide assistant coach Scott Burns told reporters on Monday.\"There's options there for us ... that discussion will be pretty intense.\"The Crows fell to a 26-point loss in Geelong which Burns said contained some positives for his club, who were within two goals of the Cats late in the final quarter.\"There's a lot of things we did quite well,\" he said.\"We were playing against a team that is the premiership team from last year that have found some form over the last month.",
        "\"And on their home deck, they play that ground very, very well.\"They had us at arms-length for most of the game ... but it was pleasing to the extent that with three minutes to go we were a chance to get within a goal again.\"But we couldn't quite finish a couple of plays off and then they finished off with a couple of late goals themselves.\"It's going to be pretty hard for any team to get four points against them down there.\"So there were a lot of positives but it just shows us, if we want to be a top team in this league there's still little steps to make.\""
    ]
}