{
    "articleURL": "/wires/reuters/article-12051075/US-STOCKS-Wall-Street-eyes-higher-open-investors-cheer-Apple-earnings.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers add 253,000 jobs in AprilLyft slumps as lower fares stoke margin concernsFutures up: Dow 0.67%, S&amp;amp;P 0.82%, Nasdaq 0.67%(Updates prices, adds non-farm payrolls data in paragraph 4, replaces analyst comment)By Ankika Biswas and Sruthi ShankarMay 5 (Reuters) - U.S. stocks were set to open higher on Friday as Apple's upbeat results underscored resilience in corporate earnings, while a stronger-than-expected jobs report tempered expectations of interest rate cuts from the Federal Reserve.Apple Inc gained 2.7% in premarket trading on better-than-expected results, helped by strong iPhone sales and notable inroads in India and other newer markets.Investors appeared to take in stride data that showed U.S. employers boosted hiring in April while raising wages, pointing to sustained labor market strength that could prompt the Federal Reserve to keep interest rates higher for some time.The Labor Department's report showed non-farm payrolls increased by 253,000 last month, higher than economists' expectations of 180,000.Meanwhile, wages increased 4.4% year-on-year in April after climbing 4.3% in March, and the unemployment rate fell to 3.4%.\"This is a strong report and shows that the labor market is resilient. It bails out the Fed for raising another quarter point,\" said Peter Cardillo, chief market economist at Spartan Capital Securities.",
        "\"It's been a tough week for the stock market, the regional banking problems have raised the fear factor, but Apple earnings came in strong. Stocks are coming up from near-term oversold condition.\"Traders are currently betting the Fed will start easing the policy rate by September, according to CME Group's FedWatch Tool, compared with July before the release of the data.The Fed raised its benchmark interest rate by 25 basis points as expected on Wednesday, but Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Wall Street fell on Thursday after PacWest Bancorp's move to explore strategic options deepened concerns about the health of regional banks, pulling down shares of peers and big banks such as JPMorgan Chase and Wells Fargo &amp;amp; Co.PacWest rebounded on Friday with a 25.0% gain, while Western Alliance Bancorp bounced back 21.8%. Western Alliance on Thursday denied a report that it was exploring a potential sale.The S&amp;amp;P 500 has gained nearly 6% so far this year, while the S&amp;amp;P 500 Banks index and KBW Regional Banking index have lost 17% and 31%, respectively.Following upbeat results from megacap companies, analysts expect profits for S&amp;amp;P 500 companies in the first quarter to decline 0.9% from a year earlier, according to Refinitiv data, compared with a 5.1% drop expected at the start of April.",
        "At 8:50 a.m. ET, Dow e-minis were up 222 points, or 0.67%, S&amp;amp;P 500 e-minis were up 33.5 points, or 0.82%, and Nasdaq 100 e-minis were up 87 points, or 0.67%.Used-car retailer Carvana Co jumped 47.1% as it expects to post a profit in the current quarter and plans to further bring down excess used-car inventory.Lyft Inc slumped 15.4% as the ride-hailing company's strategy to claw back market share from rival Uber Technologies Inc with lower fares stoked concerns about a hit to its profit margins.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Additional reporting by Stephen Culp in New York; Editing by Shounak Dasgupta and Subhranshu Sahu)"
    ]
}