{
    "articleURL": "/news/article-12054307/Lillian-Ips-heartbreaking-letter-family-spending-five-days-stranded-Mitta-Mitta-bush.html",
    "content": [
        "Lillian Ip, 48, was lost in Mitta Mitta bushland Stranded for 5 days, wrote family a letter A woman who spent a terrifying five days lost in the bush with only a bottle of wine and a bag of lollies had written a farewell letter to her family before she was found.",
        "Lillian Ip, 48, found herself stuck in deep bushland in Mitta Mitta, in northeastern Victoria, on April 30 after taking a wrong turn during an afternoon road trip to Lake Dartmouth.She'd been attempting to do a U-turn upon realising the hilly highlands she was driving on may be too steep when one of her front wheels became bogged.Unable to free her tires, Ms Ip became stranded in her car and spent the next five days in the bush before being found by an air police search team.On her fourth day lost in the bush, Ms Ip feared she wasn't going to make it and made the heartbreaking decision to write her family a final letter saying goodbye.",
        "'If you don't find by this time I could be dead by frozen cold,' she wrote in the letter, Ms Ip told the Herald Sun.'I love you all. Don't cry for me.'Ms Ip's car was spotted the next day following a mass rescue with crews scouring the Mitta Mitta, Wodonga, Bright and Albury areas.'I thought I was going to die there,' she said. A police vehicle was directed to where she was with aerial footage showing Ms Ip standing on a dirt track in a big checkered coat while frantically waving at a police helicopter.",
        "Despite being allergic to alcohol, Ms Ip had to drink the bottle of wine she'd bought as a gift for her mother on the third day when she became too thirsty.Along with the wine, she had a juice box and some lollies.Ms Ip decided to camp next to her car instead of walking the 60km back to town due to health concerns and fears she'd get lost.'I thought, how on earth am I going to get out of here? I had no reception… I tried calling about 50 times,' she said. Thankfully she had two blankets with her and after being taken to hospital for dehydration, Ms Ip is now safely back in her Cheltenham home.Ms Ip was on a solo holiday at the time but says her family have now banned her from setting off alone. "
    ]
}