{
    "articleURL": "/wires/pa/article-12046609/Crystal-Palace-boss-Roy-Hodgson-wary-Harry-Kane-threat.html",
    "content": [
        "Crystal Palace manager Roy Hodgson remains wary of the threat posed by Harry Kane and his Tottenham team-mates, despite their London rivals’ recent struggles.",
        "Spurs, under interim boss Ryan Mason, host Palace on Saturday looking to end a four-match winless run which has included three defeats.Hodgson in contrast has won four of his six games since returning to Palace, including a thrilling 4-3 win over West Ham last time out.Tottenham were on the wrong end of the same scoreline against Liverpool in their last game, conceding a stoppage-time winner moments after equalising, but Hodgson, who gave Kane his England debut in 2015, is not reading too much into their poor form.“I think the danger for all teams that go to (Tottenham Hotspur Stadium) is that you’re up against a good team with very good players,” he said. “I think Harry Kane is very close to world class, if not in my opinion fully deserving of it.“There’s a lot of players in their team as well who have got incredible ability. They’re still vying for a Champions League place, we know how difficult a game it will be.",
        "“Crystal Palace when I was at the club didn’t go to Tottenham and win matches, so if we do that it will probably be a first for me I should think.”Palace’s win over West Ham saw his team hit the 40-point mark and Hodgson wants his players to maintain their drive and ambition.",
        "“I’m hoping more from my point of view to finish the season well,” he said. “I think it’s been a very good six games and 13 points is an excellent reward from six games, but I’d like that to be a good reward now after 10 games and that would be dependent on how much drive and ambition players have.“I can’t guarantee the players will maintain their desire, but they’ll be given every opportunity“We need to keep winning and to win you need the lot. You need the desire, the attitude, focus, preparation, quality of attacking play, quality of defending play. You need to be switched on at all times over the course of the game, you need to defend set-plays well, you need to use your own set-plays very well and then you need that little bit of luck.”Hodgson was full of praise for his side’s attacking players.The four goals against the Hammers meant Palace have now scored 13 times in his six games at the helm.“The attacking talent we have in that front six is good without a shadow of a doubt,” he said.“We’re talking about playing at the highest level (in the Premier League). I am full of praise and admiration for them and I can only hope that they will go on for even more success as the seasons go by.”"
    ]
}