{
    "articleURL": "/wires/reuters/article-12054065/Versatile-Ezequiel-Duran-Rangers-face-Angels-again.html",
    "content": [
        "The Los Angeles Angels will host the Texas Rangers on Saturday night in Anaheim, Calif., with the teams continuing to get their first look at each other this season in the three-game series.",
        "The Rangers have been in first place in the American League West for most of the season, with Bruce Bochy bringing his impressive managerial resume to the organization. But the club also has benefited from the performance of some of its younger talent.Third baseman Josh Jung was named the AL Rookie of the Month for April and has gotten much of the attention, but the Rangers have seen the emergence of Ezequiel Duran as well. Duran has started games at shortstop, third base and in the outfield this season, and also has seen time at second base.He started at shortstop for the sixth consecutive game in Friday's 5-4, 10-inning loss to the Angels, going 0-for-4 with a run scored. He figures to get most of the starts at shortstop until Corey Seager returns in the next week or so. Seager has been out since April 11 with a strained hamstring.Duran, who will turn 24 on May 22, is hitting .307 with three homers, 14 RBIs and an .822 OPS this season.\"He's got a gift, and that's getting the barrel on the ball consistently -- that's pretty much it,\" Bochy said. \"Just consistently hard contact. And he's a smart hitter. I think he sees what pitchers are trying to do. He's adjusted on the fly, which you like to see from a young kid. He has shown good discipline up there, and he's using the whole field. He's just mature beyond his years.\"",
        "Bochy indicated he'll be able to find a way to keep Duran in the lineup when Seager returns.\"We'll cross that bridge when we get to it,\" Bochy said. \"These things have a way of working themselves out, but it's hard to keep this kid out. He's playing such good baseball, and he's got the speed to play anywhere. So it's a very workable situation once we get to that point.\"The Rangers have lost two games in a row after riding a four-game winning streak, and the Angels have five straight victories.Right-hander Nathan Eovaldi (3-2, 3.93 ERA) will make his seventh start of the season for Texas on Saturday and is coming off his best start of the year last Saturday against the Yankees. He threw a three-hit shutout in the Rangers' 2-0 victory, striking out eight and walking none.Eovaldi is 3-2 with a 4.50 ERA in 11 career games (nine starts) against the Angels.Left-hander Reid Detmers (0-2, 4.85) will make his sixth start of the season for the Angels and is coming off his worst performance of 2023 last Saturday in a 7-5 loss to the Milwaukee Brewers. He gave up seven runs (four earned) on four hits and three walks, with six strikeouts, in 4 1/3 innings.",
        "\"All I can think of is right now (I'm) just leaving too many pitches out over the plate,\" Detmers said. \"It's frustrating.\"Detmers is 1-1 with a 5.19 ERA in five career starts against the Rangers.--Field Level Media"
    ]
}