{
    "articleURL": "/news/royals/article-12047473/How-young-Jewish-woman-escaped-Nazis-person-hold-King-Charles.html",
    "content": [
        " Ingelore Czarlinksi was 15 when she  escaped Nazi persecution in GermanyShe helped as Charles was born at Buckingham Palace on November 14, 1948For all the latest Royal news, pictures and video click here A young Jewish woman who arrived in the UK as a teenage Kindertransport refugee became the first person to hold King Charles after his birth, it has been revealed.",
        "Ingelore Czarlinksi was aged 15 when she and her sister Marion, 11, escaped Nazi persecution in Germany just eight weeks before the start of World War Two.The teenager who became known as Susan followed in the footsteps of two of her aunts and trained to become a nurse as she built a life for herself in the UK.She ended up working for obstetrician Sir William Gilliatt, who was chosen by the young Princess Elizabeth to attend the birth of her first baby.Susan who had coincidentally changed her surname to Charles helped out as the late Queen's oldest son was born by caesarean at Buckingham Palace on November 14, 1948.",
        "She became the first person in the world to briefly hold the future King Charles in her arms before handing him over to the Queen Mother, according to a report by journalist Louisa Walters in the Jewish News.Susan was chosen for the role at the Royal birth because she was known to be discreet, and incredibly she kept it a secret from members of her own family for 25 years.Her historic handling of the 7lbs 6oz baby prince happened less than nine years after the sisters left their home in Berlin and arrived on July 5, 1939, in the port of Harwich, Essex.",
        "Marion recalled her sister's role in an article in the Association of Jewish Refugees magazine in September 2005.She wrote: 'On 14 November 1948 I invited my sister to tea at my flat in Clapham. The phone rang and an official voice asked her to ring a Whitehall number immediately.'Soon after a car came for her. When she arrived at Buckingham Palace she prepared the princess for delivery.'The senior nurse assisted Sir William with the operation and Susan waited in an ante room with Prince Philip, who told her she reminded him of the beautiful Greek girls he had known when he was young.'Eventually she was called into the delivery room and given Prince Charles to hold until his grandmother, the Queen Mother, took him from her.'The touching moment happened soon after Charles was born at 9.14pm in the music room at Buckingham Palace which had been converted into an operating theatre, under the auspices of Sir William, fellow obstetrician Sir John Peel and midwife Helen Rowe.Marion revealed that Susan was chosen for the role 'because not only was she a dedicated nurse, she was also incredibly discreet'Susan's two daughters, Rebecca and Debra, knew nothing about her attendance at the Royal birth until she and their father were invited to Princess Anne's wedding in 1973.",
        "Debra said: 'We were naturally surprised and very curious as to why our parents were invited to a royal wedding, so our mother sat us down and explained.'Following Susan's death in 1994, her daughters told some of her friends about her special royal role and discovered that that they had never known about it.Debra added that her mother always had a keen interest in the royal family, saying: 'I definitely think she felt a connection.'When asked if she believed Charles had been named after her mother, she laughed as she replied: 'Maybe! I never thought of that!'Marion was invited to a reception for Kindertransport children hosted by the then Prince Charles at Clarence House on July 5, 2005.She recalled her conversation with the future King, saying 'I told him I was lucky to arrive in England 66 years earlier, but that my sister was even luckier as she was the first person in the world to hold him.'He seemed fascinated, so I told him the whole story. At the end of the reception he said, 'What a small world it is. Here is the sister of the nurse who looked after me when I was born. She even saw me being bathed. What a sight I must have been!'",
        "Susan was also called upon to be at the birth of Princess Anne on August 15, 1950, but in the end, she was not needed as it was a natural delivery.Debra told the Jewish News how her mother was only just within the age limit to join the 10,000 Jewish children admitted to the UK in the months before the outbreak of the war.She said: 'If she was any older (than 15), she would not have been allowed to come in on the Kindertransport. She would have had to come over as domestic help, which would have been a totally a different mechanism.'",
        "Susan and her sister were separated on their arrival in the UK and were sent to live with different families in Cambridge, but they were still able to keep in in touch.Debra said: 'We have lots of documentation from World Jewish Relief of communication between our aunt and our mother.'As our mother was older, if anything needed to be decided for our aunt, Susan was always contacted.'Susan's other daughter Rebecca said: 'Our grandfather was wounded in the First World War. And then sadly, because he had to say goodbye to his both his daughters, who were his life, he died of a broken heart.",
        "'Our grandmother was hidden by a German family but somehow she still managed to go out and about in Berlin.'She dyed her hair blonde, so she didn't look Jewish, and she dressed up as a nurse. Eventually she came to the UK in 1947. She lived until she was 85.'Susan rarely spoke about the Nazi takeover in Germany and why she had to leave. Debra said: 'She didn't want to talk about it but she gave us snippets over the years.'Her daughters revealed that she was dating their father and her future husband Manny at the time of Charles' delivery.Rebecca said: 'Our father always tells the story that he went to the Palace gates to meet her when she came out.'She later went for tea with the queen and the physician, and they just sat in the palace having sandwiches.'",
        "Rebecca recalled her own connection with the royal family, saying 'I am a caterer and once catered a private event for Prince Andrew.'I told him that my mother had been at the birth of his brother, which he thought was a real coincidence.'Susan gave up nursing to look after her daughters when they were young, but later started working as a location nurse in the film industry when they were old enough to go to school.",
        "She often worked on set with her stunt man husband, and was sometimes called upon to be an extra, once appearing in her nurse's uniform in The Omen.Rebecca and Debra were both invited in September last year to the unveiling of the Kindertransport memorial statue in Harwich, named 'Safe Haven'.The statue pays tribute to Harwich's role, featuring children descending from a ship's gangplank on to dry land.Debra said: 'It's an amazing statue. It's so moving. It features five children, each facing a different way so they represent the coming, the going, the happiness, the sadness.'Read more here: https://www.jewishnews.co.uk/call-the-jewish-midwife-kindertansport-nurse-was-the-first-to-hold-the-king-when-he-was-born"
    ]
}