{
    "articleURL": "/news/article-12050337/Sienna-Weirs-cause-death-Australian-Miss-Universe-finalist-died.html",
    "content": [
        "Australian Miss Universe finalist dies aged 23Sienna Weir suffered horse riding accident Do you know more? tips@dailymail.com An Australian Miss Universe finalist has tragically died following a horse riding accident that left her on life support for several weeks.",
        "Sydney model Sienna Weir, 23, had been riding at Windsor Polo Grounds on April 2 when her horse fell, leaving the young woman with serious injuries.She was rushed to Westmead Hospital in a critical condition and sadly passed away on Thursday.Friends, family and modelling colleagues have since flooded social media with tributes to the budding influencer and alumni of SCEGGs Darlinghurst.'We loved with a love that was more than love,' her heartbroken partner Tom Bull said. ",
        "Ms Weir's last post to Instagram was a mirror selfie in April, with many leaving their condolences in what would be her last ever post.A friend wrote: 'Heaven has gained the most beautiful angel today. I'll miss everything about you Siena, I love you.'The same friend said Ms Weir's smile had 'lit up every room'. 'I'm so lucky to have known you. Thank you for everything,' she said. ",
        "Ms Weir's modelling agency, Scoop Management, shared several photos of the 23-year-old, writing: 'Forever in our hearts'.  Photographer Chris Dwyer posted his own tribute to the budding model.'You were one of the kindest souls in the world, you lit up the room and the world is a lot darker now that you are gone.'Hope wherever you are, you're being the gremlin we all know and love.",
        "'Miss you so much already.' Ms Weir was one of 27 finalists of Australian Miss Universe in 2022, and was interviewed by Gold Coast Magazine about the experience last September. ",
        "She graduated with a double degree in English literature and psychology from Sydney University.Ms Weir was planning to move to London in the coming years to spend time with her family as well as expand her professional and social networks. When asked what set her apart from the other Miss Universe contestants, she pointed to her wide range of interests.Ms Weir revealed she had been riding horses since she was just three-years-old. 'My family aren't quite sure where this passion came from, but I've been horse-riding since I was 3 years old and can't imagine my life without it,' she said. 'I travel to rural Sydney 2-3 times a week to train and compete around New South Wales or broader Australia every other weekend.'The model said she was also passionate about English literature, namely poetry, and said it was an incredible way to connect with others. 'I love to represent myself in the best way possible through writing my own poetry, but I also find it fascinating to find a commonality of experience with people from completely different walks of life,' she said. "
    ]
}