{
    "articleURL": "/tvshowbiz/article-12049133/Pete-Davidson-shares-heartbreaking-family-news-beloved-dog-Henry-passed-away.html",
    "content": [
        "Pete Davidson announced that his beloved dog passed away in a new post shared by his close friend Dave Sirus.",
        "The 29-year-old comedian said that his dog Henry 'got very sick very fast' and passed away at the age of two, according to the message posted by the fellow comedian and writer. In the 'message from Pete', the actor — who ran into his ex-girlfriend, Kim Kardashian, at the 2023 Met Gala on Monday — also opened up about how Henry had saved his life.'Hey guys,' Davidson — who does not have a social media account on Instagram —had written. 'I know today is the Bupkis premiere day but I wanna use today to remember my dog Henry.' Earlier on Thursday, his action comedy television series Bupkis premiered on Peacock.",
        "He shared various images of Henry in the carousel post with himself as well as his sister, Casey. 'Yesterday we lost a key member of the Davidson family,' the Bodies Bodies Bodies star had shared. 'Henry was only 2 years old but unfortunately got very sick very fast.'My mom, sister, and I got Henry at the beginning of the pandemic and he saved our lives,' he shared in the sentimental post. 'Not sure I'd even be around without him.' The New York native continued: 'He was the happiest and sweetest dog ever. He used to get excited when he saw me and would pee everywhere.' ",
        "In the post, the former cast member of Saturday Night Live revealed that he never watches any of his work with anybody with the exception of Henry.'When I was working at SNL my mom would send me videos of him watching, smiling and making noise when I came on screen,' he shared. 'I don't ever really watch any of my stuff with anyone as I'm far too scared but I didn't mind watching with Henry. He was truly the best,' Davidson gushed.'My mom, sister, and I are broken and will miss him forever,' he shared. 'We love you Henry. Thank you for making our lives fuller and reminding me what actually matters.'",
        "Previously, Davidson talked about his beloved pooches on The Tonight Show Starring Jimmy Fallon In November 2021.'I got three dogs during the pandemic because it was hard,' he told the talk show host. The devastating news comes days after his return to Saturday Night Live was cancelled due to the Writer's Guild of America strike.Davidson was set to make his hosting debut on the now scrapped episode that had rapper Lil Uzi Vert slated for the musical guest. "
    ]
}