{
    "articleURL": "/femail/article-12039257/How-Uniqlo-got-SPELLING-mistake.html",
    "content": [
        "Uniqlo's fascinating video has been watched more than 1.9 million timesThe firm informs viewers that it started out as the 'Unique Clothing Warehouse' It was decided to shorten the name to 'Uniclo' but there was a blunder madeREAD MORE: Chocolate fans delight after learning secret drama behind M&amp;M'sWhat's in a name?",
        "In some case more than meets the eye, as clothing brand Uniqlo recently revealed.In a video uploaded to TikTok - which has been watched more than 1.9 million times - the company explains that its name is actually due to a spelling error. In a series of overlaid captions, the firm informs viewers that it originally started out as the 'Unique Clothing Warehouse.'Then in a bid to shorten the name, the company decided to combine the two words and register the brand under 'Uniclo.' ",
        "However, in 1988 the staff in charge of registering the brand name misread the 'C' for a 'Q' and so 'Uniqlo' was born. The TikTok goes on to explain that the error was never corrected, 'the name stuck! And now we're Uniqlo.' Thousands of commenters have applauded the mistake.One commenter wrote: 'Q is more eye catching than C. Soooo! That's a good mistake.' While another added: 'I love it, def ahead of their time on that word play even if it was initially a mistake. 'Now so many companies be having names that play with similar letters/sounds.'Other viewers said the member of staff who made the mistake should have got a raise or promotion.  Uniqlo originally started out as a textiles business and was founded in 1949 in Yamaguchi, Japan.",
        "After being acquired by entrepreneur Tadashi Yanai, it went on to open its first clothing store in June 1984. Today the company has more than 2,300 stores in 25 markets including Japan. The company was the first component of Mr Yanai's multi-billion dollar Fast retailing group and it now owns several other fashion brands such as Helmut Lang and Theory.Like the Uniqlo story, a recent TikTok about the origin of the M&amp;M brand name also went viral.Claire Dinhut, who is from the US but living in London, took to TikTok to explain the M&amp;M 'family drama'.She revealed the chocolates' name stands for Mars and Murrie after chocolate heirs and business collaborators Forrest Mars Sr. and Bruce Murrie.",
        "Bruce was the son of Hershey executive William Murrie, while Forrest was the son of Mars founder, Frank C. Mars.In a clip, which racked up nearly 9,000 likes, she revealed that the story started when Forrest E. Mars fell out with his dad, the original owner of Mars.She went on to explain that the son visited Europe where he reportedly spotted people enjoying chocolate covered in candy coating.Not wanting to share his idea with his dad when he planned to bring the idea to the US, he turned to his family's rival, Hershey's.",
        "Claire went on to reveal that together with the son of Hershey executive he created M&amp;M's, and the pair decided to name the brand after themselves. She also claimed: 'The reason it all popped off is they created it right before World War Two and in World War Two they made this deal with the government that in every soldier's bag were M&amp;M's.'M&amp;Ms didn't have their signature 'M' stamp until 1950 and customers were encouraged to 'Look for the M on every piece' to ensure they were getting the real thing. Many were fascinated with the history of the popular chocolate."
    ]
}