{
    "articleURL": "/news/article-12058901/Dramatic-photos-wrecked-Vauxhall-Corsa-dangling-edge-bridge.html",
    "content": [
        "Mangled red Vauxhall Corsa left half hanging off a bridge near Wolverhampton Dramatic photographs show a crashed car dangling over the edge of a bridge after a passenger was forced to jump out of window into the canal below to escape.  ",
        "The red Vauxhall Corsa was left partially hanging after it struck a wall on Langley Road near Wolverhampton at 2am on Saturday morning.Images show the crumpled vehicle teetering perilously over the edge, with only two wheels touching the ground.The crash managed to completely destroy the bridge's wall, and both of the air bags in the car had been deployed.One person who was on the passenger side - which was almost parallel to the water - was reportedly forced to open the door and jump into the canal to escape.  ",
        "West Midlands Police had to seal the road off to the public, while specialist teams worked to recover the wedged car in the early hours of the morning.Both passengers of the hatchback were reported as unharmed.This is despite one passenger being forced to dive into the canal below to escape.Narrow boat owner Stephanie Hardman was surprised to see the vehicle dangling off the bridge when her boat passed under it.Speaking about her shock when she saw the vehicle, Ms Hardman said: 'They crashed at approximately 2am Saturday morning. Both occupants were fine, but the passenger opened the door and fell into the canal.",
        "'That's what the police officer on the scene that I spoke to said.",
        "'When I stepped out of the back of the boat I saw it and then walked closer to have a look.'A spokesperson for West Midlands Police told MailOnline that their 'officers assisted in the recovery of the vehicle but this incident is being managed by Staffordshire Police.'Staffordshire Police have been contacted by MailOnline.West Midlands Ambulance Service have also been contacted for comment by MailOnline."
    ]
}