{
    "articleURL": "/wires/reuters/article-12040601/Yanni-Gourdes-OT-tally-lifts-Kraken-Stars-Game-1.html",
    "content": [
        "Yanni Gourde scored the overtime winning goal as the visiting Seattle Kraken recovered from blowing a two-goal, third-period lead to claim a 5-4 victory over the Dallas Stars in Game 1 of their Western Conference second-round series on Tuesday.",
        "Jordan Eberle and Oliver Bjorkstrand each collected one goal and one assist, while Jaden Schwartz and Justin Schultz added a goal apiece. Goaltender Philipp Grubauer made 31 saves for the Kraken.Joe Pavelski scored four goals for the Stars in his first game back after sustaining a concussion in his team's playoff opener. Goalie Jake Oettinger stopped 39 shots and Max Domi notched three assists.Amid a scramble while the Kraken were buzzing the net, Gourde chipped home a loose puck at 12:17 of overtime for his second goal of the playoffs.Game 2 of the best-of-seven series will be played Thursday in Dallas.After Pavelski opened the scoring at the 2:25 mark on his first shift of the game, Schwartz kicked off a wild stretch in which both teams combined for five goals in a 3:55 spell by netting his third goal of the playoffs at 11:25.Pavelski replied 53 seconds later with a deflection tally, but Schultz tied the score again with shot from the right faceoff dot for his second of the playoffs.Bjorkstrand put the Kraken ahead 11 seconds later with his third goal of the playoffs, and Eberle made it a 4-2 game at 15:20 of the opening frame with a deflection for his third of the postseason.",
        "Pavelski cued a comeback when he deposited a rebound just before the midway point of the third period, his second career playoff hat trick, and then forced overtime by bunting a waist-high puck into the net with 6:37 remaining in regulation.Pavelski, 38, is the oldest player in NHL history to score four or more goals in a game. He tied the Stars/North Stars franchise record for most goals in a postseason contest. Denis Gurianov established the mark in 2020.--Field Level Media"
    ]
}