{
    "articleURL": "/sport/football/article-12052183/Tottenham-hold-talks-Julian-Nagelsmann-taking-summer.html",
    "content": [
        "German Julian Nagelsmann was sacked as manager of Bayern Munich last monthIt came as a major shock with various clubs in Europe said to be interestedTalks with Tottenham are reported to have taken place in the last few days Talks have reportedly taken place in the last few days between Tottenham and the out-of-work Julian Nagelsmann over the Premier League club's managerial position.",
        "They follow preliminary discussions which were said to have taken place in April. Nagelsmann, 35, was sacked as manager of Bayern Munich last month after less than two years in the job with the club citing the team's poor performances and style of play in their reasoning.He was replaced by Thomas Tuchel immediately, though the German giants have not experienced the uptick in results they were hoping.According to Sky Germany, talks have taken place for Nagelsmann to take over the helm at Spurs this summer.",
        "It is said that Nagelsmann is interested in the job though wishes to take some time to consider and ponder his options. He had looked set to take over at Chelsea before the club decided to continue the recruitment process without him.Nagelsmann, it is believed, views the Tottenham job as a big opportunity and somewhere he could do well, with a club that has the potential to challenge for major honours.Their season has been thrown into chaos in recent weeks and months, with the Antonio Conte sacking in late March now seemingly a springboard for the carnage that has wrought the club since.Cristian Stellini, Conte's long-time assistant, took over the managerial duties until the end of the season but departed the job last month following a 6-1 defeat at Newcastle.",
        "The report claims that it is Daniel Levy who is pushing for the club to hire Nagelsmann. Last month, following Tottenham's defeat to Newcastle, Levy put out a statement in which he accepted responsibility for the failings of the team and club.Ryan Mason has since taken over first team duties, though is yet to win a game in his second stint in the role, having first performed as interim in 2021. Having been blamed for a number of missteps the club have made in the post-Mauricio Pochettino years, it remains to be seen how involved Levy will remain on the football side.Tottenham's fourth search for a permanent manager since they sacked Pochettino less than four years ago was thrown into further complication by the upholding of Fabio Paratici's worldwide ban from football.Paratici, who had been expected to lead the search and general footballing operations at the club, left his role at Tottenham with immediate effect. A number of other candidates have been linked with the role, including Sporting's Ruben Amorim and Burnley's Vincent Kompany.Kompany has refused to comment on speculation linking him to the job on various occasions.However, Ralf Rangnick, who was at RB Leipzig with Nagelsmann, encouraged him to take over at Tottenham.'I think Tottenham is an exciting club in many ways,' Rangnick told Sky Germany.",
        "'They probably have one of the most modern, beautiful stadiums in the world at the moment. They have one of the best training centres, that is there at the moment and Daniel Levy, who has been leading the club for many, many years.'Although he is not a big spender, he knows the football business and would not put himself in the centre of the cameras.'It can be a very, very exciting story. There is room for improvement, a lot of room for improvement and yet this is not a club where the house expects you to be in the top one or two right away.'Nagelsmann began his career at Hoffenheim before joining RB Leipzig, taking them to the Champions League semi-finals in 2020.His move to Bayern Munich in 2021 seemed the culmination of a prophecy for one of Germany's brightest young coaches, however rumours and reports of discontent among the playing squad and hierarchy never made it seem the most comfortable of marriages.",
        "The sacking of Nagelsmann in April came as a shock, though the club were open regarding their reasons.'When we signed Julian Nagelsmann for FC Bayern in the summer of 2021, we were convinced we would work with him on a long-term basis – and that was the goal of all of us right up to the end,' the club's CEO Oliver Kahn said at the time.",
        "'Julian shares our aspiration to play successful and attractive football. But now we have come to the conclusion that the quality in our squad – despite the Bundesliga title last year – has come to the fore less and less often.'After the World Cup we have played less successfully and less attractively. The big fluctuations in performance have cast doubt on our goals for this season, but also our goals for the future. That is why we have acted now.'"
    ]
}