{
    "articleURL": "/news/article-12038045/Biden-sparks-backlash-telling-Muslim-military-serviceman-hush-boy.html",
    "content": [
        "Joe Biden sparked backlash after telling an interrupting White House attendee to 'Hush up, boy'The awkward interaction came during an celebration to mark the Islamic holiday Eid-al-FitrThe event previously came under fire after New Jersey's Muslim mayor was blocked from the celebration after being denied entrance by the Secret ServiceJoe Biden sparked backlash after telling a White House attendee to 'hush up, boy', during an event celebrating Islamic holiday Eid-al-Fitr. ",
        "The awkward exchange came as the audience member, who is believed to be a Muslim man, interrupted the president as he marked the occasion before a packed crowd.  'You want to come and make a speech?' Biden responded after he was heckled from the audience.'Hush up, boy, as my mother would say' he continued in a mimicked Southern drawl, a remark which was met with laughter from the other attendees. The president has previously come under fire for using the term 'boy' in other racially-charged remarks, most recently in February, when he used the phrase while referring to the first black governor of Maryland, Wes Moore. ",
        "According to reports, the incident erupted after a member of the audience heckled Biden for failing to mention the first Muslim federal judge in attendance. The office of judge Zahid Quraishi, the first Muslim American federal judge, declined to comment when contacted by DailyMail.com. 'Hey, judge, how are you?' Biden said after initially being interrupted. 'I don’t know why you wanted the job, man... I appoint all the federal judges, but, you know, thank you for serving.' As the attendee continued to speak over him, Biden called him 'boy' in his response. The gaffe quickly sparked backlash due to the historic connotations behind the word 'boy', which has been used as a racist slur against black people. ",
        "Footage of the encounter was quickly circulated online, including by Texas state delegate Sarah Fields, who slammed the president's off-the-cuff remarks and claimed the individual was a servicemember. 'Imagine if another president referred to someone as \"boy\"', she said. 'Especially someone in our armed forces'. The outburst was also condemned by RNC Research, a GOP activist account managed by the Republican National Committee. 'Is Biden a racist? You tell us', the organization added in a follow-up tweet, accompanied by a video showing the president's various gaffes. Biden has faced similar controversy in recent years after making other racially-charged comments, including telling rapper Charlamagne tha God: 'If you have a problem figuring out if you're for me or Trump, then you ain't black'. The president, who recently announced he is launching his 2024 re-election campaign, again came under fire for a separate, cringe-inducing comment during the White House's Eid celebration event. Speaking to Congresswoman Ilhan Omar, one of the first Muslim women to serve in Congress, Biden said: 'God love you... I'll get in trouble for saying this, but you look beautiful tonight.' The White House has been contacted by DailyMail.com for comment.  ",
        "The event was previously plunged into controversy after New Jersey's Muslim mayor Mohamed Khairullah said he was 'baffled' after being blocked entrance to the celebration by the White House Secret Service. ",
        "Shortly before he was set to arrive at the White House, Mayor Khairullah said he received a call stating that he had not been cleared for entry by the Secret Service and could not attend. He said the White House official did not explain why the Secret Service had blocked his entry.'It left me baffled, shocked and disappointed,' Khairullah said. 'It's not a matter of I didn't get to go to a party. It's why I did not go. And it's a list that has targeted me because of my identity. And I don't think the highest office in the United States should be down with such profiling.'"
    ]
}