{
    "articleURL": "/wires/reuters/article-12058351/Angels-pitching-struggling-Astros-come-town.html",
    "content": [
        "The Los Angeles Angels look to rebound from a pair of lopsided losses over the weekend when they face the Houston Astros on Monday in the opener of a three-game divisional series in Anaheim, Calif.",
        "The Angels surrendered 10 runs on Saturday in a nine-run loss, and 16 in an eight-run loss to close out the series with American League West rival Texas on Sunday.Los Angeles manager Phil Nevin said that struggles on the mound, including Sunday's starter Jose Suarez exiting before he could finish three innings due to unspecified injury, impact the Angels heading into the series with Houston.\"When any of my players get injured, I'm concerned about it,\" Nevin said. \"In particular, our starting rotation. Where we go from here, I'm not sure.\"The bullpen worked more than five innings on Sunday and was led by Chase Silseth (3 1/3 innings) and Chris Devenski, who struck out three but gave up three runs in two innings.\"The game should not have been where it got to,\" Nevin said. \"To have to go to use (Devenski) in a situation like that in two innings was not good for us.\"On Monday, lefty Patrick Sandoval (3-1, 2.93 ERA) gets the start for the Angels, seeking his third win in as many outings. Sandoval struck out four and allowed one run in five innings his last time out, a 5-1 Angels defeat of St. Louis last Tuesday.Sandoval has struggled historically against the Astros. In seven career appearances (six starts) against Houston, Sandoval is 0-4 with an 8.03 ERA. He allowed five runs on eight hits through five innings in his most recent start against the Astros, a loss on July 2, 2022.",
        "Houston comes in having dropped its last three series, including its weekend visit to divisional counterpart Seattle. The Astros have also lost four of their last five games.In those four losses, the Astros mustered a combined eight runs with Sunday's 3-1 defeat. However, Houston could get some needed reinforcements back for the Angels series, as reports indicated that outfielders Michael Brantley and Chas McCormick could return to the lineup in the coming days.Brantley, a five-time All-Star, has yet to play this season due to a right shoulder injury that sidelined him prematurely last season and required surgery last August. McCormick hit .275 in 11 games before being moved to the injured list with lower back tightness last month.Former MVP and six-time Silver Slugger Jose Altuve (fractured right thumb) is also nearing his return. He took batting practice before Sunday's game.\"We are close to getting some guys back,\" Astros manager Dusty Baker told reporters on Sunday. \"You've still got to play regardless of who you have out there. ... We just wanted to stick around .500.\"Right-hander Hunter Brown (3-1, 2.60) will make the start for the Astros. He is looking to bounce back from his first loss of the season, last Tuesday's 2-0 decision against San Francisco.",
        "Brown allowed two runs and four hits over 4 1/3 innings, but that was enough for the Giants to hand Houston its only shutout loss of the season.Monday marks Brown's first career matchup with the Angels.--Field Level Media"
    ]
}