{
    "articleURL": "/femail/article-12054313/Princess-Anne-warms-royal-fans-hearts-look-pride-King-Charles-direction.html",
    "content": [
        "Princess Anne, 72, beamed with pride during ceremony at Westminster AbbeyREAD MORE: King Charles' Coronation LIVE blog Princess Anne and Prince Edward warmed the hearts of royal fans with their 'supportive' behaviour towards their older sibling, the King, during his Coronation. ",
        " Charles and Camilla were crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry at Westminster Abbey. The historic two hour service was marked by several poignant moments. A Twitter account called The Royal Watcher highlighted the moment the Princess Royal and the Duke of Edinburgh appeared to beam with pride as they watched their brother being crowned.  Wearing her military uniform, the Princess Royal, 72, looked particularly moved, sending royal fans into a frenzy. 'Ok but look how proud Anne looks of Charles', the account said, sharing a picture. ",
        "In the touching snap, the Princess Royal smiled warmly as she looked at her brother fulfilling his destiny. Close by was her husband, Vice Admiral Sir Timothy Laurence. Standing in the second row, her brother Prince Edward, 59, sported an equally moved expression. On social media, one person said: 'Edward looks proud and slightly sad. It's wonderful to see his siblings be so supportive. Anne looks just so pleased for him.''Gosh that made me a bit teary seeing the look on her face. They've been such a team for so long,' another said.  'Must be thinking how their parents would have been proud,' one suggesting, in reference to the late Queen Elizabeth II and the late Prince Philip. ",
        "'I love this,' one gushed. 'Both Princess Anne and Prince Edward proud young siblings,' one said.  Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.",
        "Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The newly-crowned King and Queen later appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering patriots.",
        "The royal couple waved to gargantuan crowds before a RAF flypast, which had to be scaled back to just just helicopters and the Red Arrows because of the heavy rain in London.The Mall was a sea of people, many of whom sprinted to get close to the Palace and catch a glimpse of the King and Queen following their historic coronation watched by 100million people on TV worldwide.Charles and Camilla were joined by the Prince and Princess of Wales, their children, the Duke and Duchess of Edinburgh and Princess Anne. Once again Prince Louis and Princess Charlotte stole the show with some enthusiastic waving and pointing as the jets flew over the Palace to roars.But their uncle Prince Harry decided to dodge the event amid reports he planned to jet home after a 24-hour stay in the UK to get back to California on his son Archie's fourth birthday today. His limousine was spotted at Heathrow this afternoon, less than two hours after the Coronation service ended."
    ]
}