{
    "articleURL": "/femail/article-12057241/Wider-royal-family-support-King-Charles-Coronation-concert.html",
    "content": [
        "Lady Sarah Chatto looked elegant as she led the minor royals attending concertREAD MORE: For all the latest Royal news, pictures and video click here Lady Sarah Chatto was sophisticated in a blue ensemble as she led the minor royals attending the star-studded Coronation concert on Sunday night.",
        "Princess Margaret's daughter, 59, appeared effortlessly elegant when joining the King, Queen and other Royal Family members to celebrate the historic event at a music extravaganza at Windsor Castle. She was seated between her artist husband Daniel, and their son Samuel, 26, at the concert, which was also attended by Princess Alexandra's granddaughter Flora Vesterberg.Flora was elegant in a black and white gown as she stepped out at the occasion alongside her brother Alexander Ogilvy, the grandson of the late Queen's cousin, Princess Alexandra.Some members of the wider royal family missed out on invites to the coronation at Westminster Abbey on Saturday - but several attended Sunday's event as they showed their support for the new King and Queen. ",
        "Lady Sarah Chatto was one of the minor royals who did in fact attend the coronation, oozing elegance in a cream dress and matching hat.She joined her artist husband Daniel, and their son Samuel, 26, at the historic event at Westminster Abbey in London.Lady Sarah added a touch of glamour to her sophisticated outfit by wearing her mother Princess Margaret's Greville pearl earrings. She also donned a pearl necklace and a diamond bracelet.The mother-of-two is the only daughter of the late Princess Margaret and her former husband, Antony Armstrong-Jones, who passed away in 2017. The late Queen was described as a 'surrogate mother' to Margaret's children and was particularly close to Lady Sarah, who is believed to have reminded her of her late sister.",
        "Both her parents passed on their artistic eye to their children as Sarah, now a painter, and her brother David were taken around galleries in their youth.Sarah went on to complete a foundation course at Camberwell School of Arts and Crafts, followed by a printed textiles course at Middlesex Polytechnic, paving the way for her training at the Royal Academy Schools.Working as a painter under the professional name Sarah Armstrong-Jones, she has since exhibited at galleries including The Redfern Gallery in London.",
        "Her wedding to Daniel Chatto in July 1994 was such a short, simple affair that chauffeurs were caught by surprise: the Queen, Prince Philip and Princess Diana waited at the City church of St Stephen's Walbrook after the service for their cars to come back.While the Chatto's are not at the centre of the working royals, they have attended major royal events over the years, including the late Queen Elizabeth II's funeral last September, Royal Ascot, Trooping the Colour, as well as the Platinum Jubilee celebrations.The concert came after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.",
        "'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.The King, Queen and royal family have joined around 20,000 members of the public at the musical extravaganza.",
        "Heir to the throne William took to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, saw Hollywood star Tom Cruise and adventurer Bear Grylls appear via video message.The series of pre-recorded sketches revealed little-known facts about the monarch. There were also performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood - whose grandson Arthur Eliot was one of Camilla's pages of honour - and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang performed too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art all came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.",
        "Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.Meanwhile, Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles' favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said."
    ]
}