{
    "articleURL": "/sport/racing/article-12048755/Top-Aussie-jockeys-Ryan-Hurdle-Sheriden-Tomlinson-punters-despicable-Dean-Holland-messages.html",
    "content": [
        "Racing community mourning the death of Holland Vile messages sent by disgruntled gambler Took abuse to next level by involving Holland Two Australian jockeys have been subjected to horrific online abuse with a punter sending them messages that included savage references to deceased hoop Dean Holland. ",
        "Holland tragically died after falling from his horse in a race in country Victoria on April 24.Daily Mail Australia has chosen not to publish the name of the person who sent the abusive messages.South Australian jockey Ryan Hurdle was sent the message:\" 'Oi c*** hang yourself for me!! You f***ing cost me $220 with wiley west.'When the hoop playfully told the person they were a 's***house punter' and offered to reimburse them, the worst of the messages came through.'I hope you f***ing fall off on your future race and die like dean holland the useless c*** … the f***wit that die cost me 250.'",
        "Hurdle shared the messages on social media with the caption 'name and shame'.If that wasn't vile enough, the same punter then targeted 23-year-old South Australian jockey Sheriden Tomlinson.'Oi c*** I hope u fall on your next race like Dean Holland,' he told the rising racing star.Tomlinson also shared the message he received, posting: 'There is seriously some low breed humans out there. 'It’s 1 thing to go out of your way and find a jockeys account and send them an abusive message but to wish death and show 0 respect for a passed away jockey is disgusting. 'The racing community is still mourning. Has to stop.'",
        "Holland had been riding the Tony McEvoy gelding Headingley in the first race at Donald, 280km north-west of Melbourne on April 24 when tragedy struck.As the field entered the top of the straight, the three-year-old gelding made a sudden move towards the inside rail, causing Holland to be thrown to the turf before the horse fell in an incident witnesses described as 'sickening' The incident escalated when Alana Kelly and her mount Time to Rumble also fell and the weight of both horses landed on Holland.Medical personnel provided on-course treatment to Holland before he was airlifted to a Melbourne hospital in critical condition. Victoria Police confirmed his passing shortly after 4pm. Holland is survived by his wife and four children. Race fans were quick to rally around Hurdle, Tomlinson and the family of Holland to condemn the abusive punter.'These are the people that should be restricted from betting and ever attending a race track,' one replied to Tomlinson.'I'm so sorry you have to go through this. What a disgusting piece of work that person is. That is as bad as it gets,' added another.Tomlinson has reported the offender through social media and said 'people higher up are investigating it'. 'You have absolutely done the right thing here calling this one out, completely unacceptable on all levels,' a supporter replied.",
        "'That's as bad as I've seen! Sickening! I'll always stick to for you guys and girls and I'll continue to defend you on social media,' another posted. Athletes being abused online by disgruntled gamblers has become a red button topic across a range of sports.",
        "In late 2022, NRL players Latrell Mitchell and Jai Arrow came out to defend young winger Jaxson Paulo who was subjected to a barrage of online abuse because he had a poor game.'All I hear is about multis and whatnot and to be honest I don't really want to hear about it … if you're going to put your money on the line, you take your own risk,' Mitchell said.'Now it's about keeping your opinions to yourselves and shutting up.''It makes me pretty angry mainly because I've had backlash like that before. With Jackson, he didn't deserve what he got,' Arrow added.'They're a bunch of cowards.'",
        "The abuse has also been occuring in the AFL, with Geelong champion Patrick Dangerfield previously revealing it was happening every week. 'Unfortunately, the majority of players experience this on a weekly occurrence,' Dangerfield said.'It's not always reported, but whether they see one message or a couple, it does get to you as a player. We've got to remember players are people. They have feelings just like anyone else and these gutless keyboard warriors shoot off late at night after being on the punt or on the p*** or whatever it might be. ",
        "'It's just unacceptable. If you're not willing to say it to someone's face then what gives you the right to abuse, death threat, whatever it might be to people that you don't even know. It's hugely concerning and something that's been going on for a while.'For help in a crisis call 000. If you or anyone you know needs support, you can contact Lifeline 13 11 14, or Beyond Blue on 1300 224 636."
    ]
}