{
    "articleURL": "/wires/reuters/article-12040975/Malaysia-c-bank-surprises-raising-policy-rate-3.html",
    "content": [
        "BNM raises policy rate to 3%",
        "Headline, core inflation to average 2.8%-3.8% in 2023Strong growth expected in Q1 2023BNM unlikely to tighten further - analysts(Adds details, analyst comments)By Rozanna LatiffKUALA LUMPUR, May 3 (Reuters) - Malaysia's central bank unexpectedly raised its benchmark interest rate on Wednesday, as it looks to manage persistent inflation amid strong domestic demand.Bank Negara Malaysia (BNM) lifted its overnight policy rate by 25 basis points to 3%, confounding economists expectations for an extended pause.Some economists now see the move marking the end of the current tightening cycle as price pressures ease along with slowing global growth that will likely hurt the export-driven economy.BNM had kept rates unchanged at its two previous meetings this year, as it sought to assess the impact of four consecutive hikes totalling 100 basis points in 2022.The Southeast Asian economy has bounced back strongly from a pandemic-induced slump, with growth hitting a 22-year high of 8.7% in 2022, but slowing global demand has clouded the outlook for the exporter of oil, commodities and high tech goods.BNM said in a statement that latest developments point towards further expansion in economic activity in the first quarter of 2023, driven by strong domestic demand, household spending and better labour market conditions.",
        "While inflation was expected to moderate, core inflation would remain at elevated levels amid firm demand conditions, it said.\"With the domestic growth prospects remaining resilient, the MPC judges that it is timely to further normalise the degree of monetary accommodation,\" the central bank said, referring to its monetary policy committee.The Malaysian ringgit was up 0.3% against the U.S. dollar, extending gains after the move.Wednesday's hike marks the return of borrowing costs to pre-pandemic levels and comes ahead of planned reforms to Malaysia's subsidy programme, which could add to inflationary pressure.The government has said it was looking to do away with broad subsidies that have squeezed government coffers, aiming to target aid towards vulnerable and low-income groups.BNM said the balance of risk to the inflation outlook was \"tilted to the upside and remains highly subject to any changes to domestic policy including on subsidies and price controls, financial market developments, as well as global commodity prices\".On Tuesday, Australia's central bank also stunned markets by raising its cash rate 25 bps, citing inflationary pressures.A Reuters poll of 25 economists had largely expected Bank Negara Malaysia to hold its overnight policy rate at 2.75%, with just four forecasting a rate hike.The central bank on Wednesday maintained its headline inflation forecast of between 2.8%-3.8% in 2023. Inflation was at 3.3% last year.",
        "Capital Economics and Oxford Economics said BNM was unlikely to hike rates further following Wednesday's decision, with inflation and growth expected to moderate in the coming months.Malaysia's economy was expected to expand 4%-5% this year, BNM has said. Consumer prices in March rose 3.4% from a year earlier, its slowest pace in nine months, data showed.\"With inflation set to fall back further and the economy likely to struggle over the coming months, we expect today's rate hike to mark an end to the tightening cycle,\" Capital Economics said in a note. (Reporting by Rozanna Latiff; Editing by Jacqueline Wong)"
    ]
}