{
    "articleURL": "/wires/afp/article-12057189/Fast-rising-Teqball-crashes-Southeast-Asian-Games.html",
    "content": [
        "As teqball continues its fast growth with its debut at the Southeast Asian Games, the young sport has drawn resentful glances from similar sports in the region that feel it is treading on their turf.",
        "Invented in Hungary in 2012, teqball is a non-medal exhibition sport at this year's SEA Games in Phnom Penh, Cambodia, being played over three days with the finals on Monday. It is also on the schedule for the European Games in Poland in June and July.Teqball already has more than 140 national federations, leading its backers to call it \"the fastest-growing sport in the world\".Top international football teams including Spain and Portugal bond over games of teqball during downtime, and stars such as Brazilian footballer Ronaldinho have become ambassadors for the game.Played on a curved table, it melds elements of football, volleyball and ping-pong. Players -- alone or in pairs -- trade shots without using their arms. The catch is they cannot use the same body part twice consecutively.\"In Europe, North America, South America, it's more developed than in Asia,\" said Marton Keresztury, from governing body Fiteq. \"So here, it's just starting slowly.\"",
        "On Sunday, the much-fancied Thai men's doubles team ruthlessly saw off their Cambodian opposition, the affront to their hosts compounded by Phakpong Dejaroen's acrobatic winning shots repeatedly bouncing up and scudding into the home fans.That set the Thais up for a final on Monday against another Cambodian duo.In the women's doubles, the Thai duo of Suphawadi Wongkhamchan and Jutatip Kuntatong also swatted away the opposition on their way to the final.",
        "One reason Thailand excels at the sport is a pre-existing love for the game of sepak takraw, a similar sport popular around the region, played on something more resembling a volleyball court.Fahrish Khan, of the Singapore men's doubles team who beat Brunei in their last group game, but did not progress, noted the overlap.\"We play football. So, if you see a lot of them are sepak takraw players. It's very different,\" said the 27-year-old.\"The difference is they know how to kill,\" he said, referring to the bouncing winners that the Thai team reeled off with elan.Keresztury said teqball had more tournaments coming in Asia soon, in China, Thailand, \"and maybe Indonesia\".He noted that the sport risked butting heads with sepak takraw.\"The players who are here, they come from (sepak takraw). Sometimes you have clashes with sepak takraw federations because they don't want to let their players play teqball. That's why it's developing slowly in Asia.\"\"I think 80 percent of the players come from sepak takraw, from all nations.\"But he added: \"It's easy to get some skills from sepak takraw, but if you want to have all the skills you have to play more teqball.\""
    ]
}