{
    "articleURL": "/wires/aap/article-12049197/US-Australian-military-aid-Ukraine-table.html",
    "content": [
        "Further assistance for Ukraine is on the cards ahead of the federal budget amid speculation Australia and the United States could announce a joint support package as soon as the end of the month.",
        "The two nations are reportedly working together on an assistance package that could mirror Canberra's agreement with Paris to jointly supply ammunition to repel the Russian invasion.The appetite for a joint military package, first reported by the Australian Financial Review and verified by AAP, comes ahead of President Joe Biden visiting Australia.Treasurer Jim Chalmers said Australia would continue to support Ukraine.\"We are a big supporter of the Ukrainian efforts to repel the Russian invaders and that will be represented in the budget,\" he told reporters in Canberra on Friday.\"We salute the quite remarkable courage and commitment of the Ukrainian people.\"The Quad summit brings together leaders from Australia, Japan, India and the US in Sydney in the coming weeks to focus on peace and stability in the Indo-Pacific.Ukraine's ambassador to Australia Vasyl Myroshnychenko said he wouldn't speculate on any upcoming package but welcomed any assistance.\"It's too early to talk about it but it would be good if something like that came because that would help Ukraine a lot,\" he told AAP.The NATO security summit in July, which Prime Minister Anthony Albanese will also attend, is another opportunity to unveil a joint aid package.Kyiv has submitted a wish list of aid ahead of the federal budget on Tuesday, which includes Hawkei armoured vehicles, artillery and ammunition.",
        "Hundreds of Ukrainian-Australians rallied around Australia on Saturday, calling for the government to provide Hawkeis to help defend their homeland.Amid concerns about aid fatigue with the war entering its second year, Mr Myroshnychenko said it was important democratic nations continued to stand up to Russia and protect against rising authoritarianism.\"It is extremely important to protect democracy. We need to make sure we create the deterrence, and the deterrence we need is to make sure Ukraine wins,\" he said.\"We need to make sure we don't embolden other authoritarian leaders to do something similar in the region.\""
    ]
}