{
    "articleURL": "/wires/reuters/article-12047119/CANADA-STOCKS-TSX-set-snap-three-day-losing-streak-Shopify-miners-jump.html",
    "content": [
        "TD Bank Group gains on calling off First Horizon buyout",
        "Shopify gains on layoff plansCanadian Natural Resources falls on profit missBy Shristi Achar AMay 4 (Reuters) - Canada's main stock index rose on Thursday, led by Shopify following its layoff plans and Toronto-Dominion Bank after calling off the First Horizon acquisition.At 10:08 a.m. ET (1408 GMT), the Toronto Stock Exchange's S&amp;amp;P/TSX composite index was up 33.59 points, or 0.17%, at 20,388.27, rising for the first time in four days.Shopify Inc jumped 25.1%, hitting a one-year high, after announcing plans to lay off 20% of its workforce and selling its logistics arm. The company also posted a surprise first-quarter profit.The gains in the e-commerce company lifted the technology sector up 5.5%.Toronto-Dominion Bank Group added 0.8% after the lender called off its $13.4 billion acquisition of U.S.-based First Horizon Corp, citing a lack of clarity on when they would get regulatory approvals.\"Regional banking is exploding all over the place in the United States and TD probably got cold feet about buying a U.S. regional bank,\" said Brian Madden, chief investment officer at First Avenue Investment Counsel.\"The cover of the regulators taking too long to approve the deal gives them good reason to break the deal.\"The materials sector, which includes precious and base metals miners, was up 0.9%, as gold prices firmed.",
        "The TSX is set to snap a three-day losing streak, with markets redirecting their attention from major central bank interest rate decisions to corporate updates in Canada and the U.S.Canadian Natural Resources Ltd lost 2.0% after the oil and gas producer narrowly missed first-quarter profit estimates.Enbridge Inc said it has reached a toll agreement with shippers for its Mainline system. The shares of the crude oil transporter, however, were down 0.6%.Healthcare limited gains, down 2.8%, dragged by a 13.3% fall in Bausch Health Companies Inc after its quarterly results. (Reporting by Shristi Achar A in Bengaluru; Editing by Shilpi Majumdar)"
    ]
}