{
    "articleURL": "/tvshowbiz/article-12045957/How-Matty-Healy-forged-rock-star-career-son-two-British-TV-stars.html",
    "content": [
        "He has shot to stratospheric stardom across the globe as the frontman of rock band 1975 and is now believed to be dating pop icon Taylor Swift.",
        "However it is scarcely known anywhere outside of the UK, that Matty Healy is in fact the offspring of two British television stars, Denise Welch and Tim Healy.While fans from across the pond are aware of Matty's on-stage antics, including kissing fans and eating raw meat, they are less acquainted with this little known fact.His mother Denise, 64, is best known for her roles on UK soap Coronation Street as well as BBC drama Waterloo Road and comedy Down to Earth.She now co-hosts British daytime panel show Loose Women, alongside a selection of other TV presenters and personalities.",
        "Meanwhile, Tim's most memorable roles are as Dennis Patterson in Auf Wiedersehen, Pet, as well as starring as Lesley Conroy in Benidorm.Denise and Tim were married for 24 years between 1988 and 2012, during which time they welcomed Matty and his brother Louis, 22.Louis' has also been dipping his toe into the showbiz industry and has appeared in a number of TV shows including period drama Hotel Portofino and soap Emmerdale.The couple welcomed their first child Matty in 1989 and Denise has previously spoken about how she suffered postnatal depression after his birth.The 1975 hit She Lays Down was written by Matty about her struggles and drug use.In January, Denise admitted she was upset recently by a U.S. news story about a woman suffering with puerperal psychosis and postnatal depression. ",
        "Puerperal psychosis or postpartum psychosis is a serious mental health illness that can affect someone soon after having a baby and affects around 1 in 500 mothers after giving birth.Denise revealed that on her podcast at the time she would be discussing the 'huge impact postnatal depression had on her life after having oldest son.In a clip shared to Twitter, she said: 'I was really upset by a US story about a lady who took the lives of her three children who was suffering with puerperal psychosis and postnatal depression.",
        "'I've been speaking out for over 30 years now since I had Matty of the origin of my major depressive disorder which is postnatal depression.'We don't talk enough about it and about postnatal psychosis. I over the years have spoke to thousands of woman and the psychosis side of it is absolutely horrendous because people completely lose their minds. 'I'm not justifying anything. I'm just saying I think its approach for me to tell you my journey of my horrors and experiences with postnatal depression and I do touch on puerperal psychosis.'Denise's TV career began eight years before Matty's birth, when she made her debut in 1981 in British children's television series, Barriers.The series starred Benedict Taylor as Billy Stanyon, a teenager facing up to the loss of his parents in a sailing accident only to discover that he was adopted.",
        "In the coming years, Denise appeared in a string of series that were based in the North East of England, including Auf Wiedersehen, Pet, where she met Tim.The show followed the trials and tribulations of seven men from Britain who, faced high unemployment and low work prospects in the UK.Hoping for a better future, they head for West Germany in search of construction jobs where they forge friendships and make the best of their circumstances.Denise went on to appear in several other TV projects including Byker Grove, a drama series about a group of people who frequent a youth centre in Newcastle, which kick started the careers of presenters Ant McPartlin and Declan Donnelly.However Denise's big break came in 1993 when she appeared as Marsha Stubbs in Soldier, Soldier, which focused on the working and home lives of the officers of the King's Own Fusiliers regiment.Like her son, Denise also had a stab at a music career, releasing You Don't Have To Say You Love Me/Cry Me a River, peaking at No. 23 in the UK charts.Arguably Denise's biggest role to date came in 1997, when she joined the cast of Britain's longest running soap, Coronation Street, as Natalie Horrocks.The Granada Television soap opera has been on British TV screens since 1960 and  centres on a cobbled street in the fictional Weatherfield.",
        "Denise's character proved to be a big hit with viewers and she was offered a regular contract on the show, where she became a barmaid and later a landlady. She left the series at the end of 2000 after being offered a storyline where she suffered a miscarriage, but she declined due to the traumatic nature of the plot.Denise fell pregnant with her second child around the same time, her pregnancy was written into the series and she left with the offer of one day returning.After welcoming her second child, Denise returned to acting with parts in several UK dramas, but her present day high profile is likely thanks to her role on Loose Women.",
        "Denise featured on the panel between 2005 until 2013, before returning in 2018 until current day.Loose Women is a British talk show that broadcasts on ITV weekdays from 12:30 pm to 1:30 pm and discusses topical issues and interviews guests.During an episode of Loose earlier this year, Denise argued that it is 'fundamental' to ask a child's partner if they plan to have a family one day.This could mean that Taylor will be in for a grilling with Denise, after she admitted  the girlfriends of her son Matty if they would like to have children one day.",
        "Speaking on the show about the topic of asking couples if they intend to have children, Denise said she does like to ask her son's partners.The actress is now married to Lincoln Townley, 47, while Tim tied the knot to Joan Anderton in 2015. Denise and Lincoln tied the knot in July 2013 in Portugal, after becoming engaged in August 2012.While Tim married Joan in 2015, he proposed during a romantic getaway to Turkey in 2014.The family now enjoy a blended dynamic as Denise previously revealed she spent Christmas with her current husband Lincoln and  her ex-husband Tim.The panellist explained that her youngest son Louis was also with them for the festive season, while her eldest son Matty was in LA.",
        "'I had a lovely Christmas with the three wise men. Yeh, so we had the blended family: Me hubby, me ex-hubby and one of me sons. The other son was in LA (sic).'They were the chef and the commis chef in the kitchen.'  Matty's father Tim has previously said his son's music brought him back to 'the land of the living' when he fell into a coma while shooting Benidorm.The actress took to Instagram on Christmas Eve to share a snap of her youngest son Louis, 19, sitting with his father Tim Healy, and her current husband Lincoln Townley. ",
        "The actor was taken ill while filming the upcoming ninth series of the show in Spain last year, and was in a coma for several days, fighting for his life.The actor's cross-dressing character Les/Lesley was written out while he fought the mystery illness.He now no longer smokes as a result of his illness, and said he has also gone off alcohol. It was reported at the time that Tim 'briefly died' due to the condition while being treated in a Spanish hospital.Tim was a stalwart of the comedy-drama series, having played his well-loved character since 2009.Previously best known for his part in television series Auf Wiedersehen, Tim was taken on as a regular in the fourth series of Benidorm in 2011.Denise and Tim split in 2012 - when she broke down in tears on live television as she confessed her 24 year marriage was over. She revealed the news on Loose Women.She has discussed their private life on many occasions on the panel show, previously admitting there had been infidelity on both sides.In August 2020, Tim shared his fury after Denise aired their dirty laundry and claimed that there were 'infidelities on both sides' during their marriage. Denise also admitted that they 'hung on too long' to their relationship and made each other 'miserable'.",
        "The chat came about after the TV personality was shown a past clip of herself debating with Sherrie Hewson about cheating.In the footage, Denise claimed that 'emotional infidelity' is worse than 'sexual infidelity', she said: 'A sexual infidelity could just be behind a bike shed or something when you are a little bit drunk.'I'm not condoning it, I am just saying I'd rather that than if my partner had met someone privately and got feelings for that person.'Tim was left furious over the discussion and took to Twitter after the episode aired to share his anger in a now-deleted tweet. Lashing out at his ex-wife Denise, he wrote: 'Just watched yesterday's loose Women. Denise in her day was talking about how it was ok to have casual sex behind the bike shed even though married. 'Day after day year on year she discussed our private life. Long suffering Tim Healy I am no more xx.' Denise spoke candidly about her lengthy marriage to Tim and their private life.Denise said of the throwback clip aired: 'I was in a dark place, it may not appear that I was, but I was. It's not an excuse but it's a reason for some behaviours.'And I think my husband and I both agree we held on far too long and we were making each other miserable and thankfully we've now got a great friendship.  'I genuinely used to think that being unfaithful wasn't the worst thing you could do in a relationship. There were infidelities on both sides... which you girls know about.'",
        "She added: 'I didn't use to think that there was anyone I could meet that would give me everything and stop me wanting to cheat, I really didn't... and then I met Lincoln and we took alcohol out of our lives. 'And I know people will go \"yeah we know you don't drink\" but it does affect so many areas of your life. Drink and drugs ruin your moral compass... basically you don't have one and I realise that now.'Talking about her new marriage, Denise continued: 'I now have a husband I trust 100%. It would kill me if I even saw any text messages.'I can still appreciate people's attractiveness but I have found a man I love and he does me and I am a completely different person now.'"
    ]
}