{
    "articleURL": "/wires/reuters/article-12041493/Last-place-Yankees-seek-win-Guardians.html",
    "content": [
        "Last place is a decidedly unfamiliar place for the New York Yankees to reside, even in the first week of May.",
        "An unexpected face helped ensure the Yankees didn't slip to another rare spot on Tuesday.The Yankees will look to build off their late-inning comeback when they host the Cleveland Guardians on Wednesday in the rubber match of a three-game series.Clarke Schmidt (0-3, 6.84 ERA) is scheduled to start for the Yankees against Shane Bieber (2-1, 3.11) in a battle of right-handers.Willie Calhoun hit his first homer as a Yankee on Tuesday, when his seventh-inning solo shot snapped a tie as New York ended a four-game losing streak with a 4-2 win.While the Yankees remained in last place in the AL East by virtue of the Boston Red Sox's 7-6 win over the Toronto Blue Jays, the victory over the Guardians lifted New York back over .500 at 16-15. The Yankees haven't been under .500 after May 1 since the 2016 season.The Yankees appeared as if they were going to slip under the break-even mark when they got just one runner beyond first base against Guardians starter Tanner Bibee over the first five innings.However, Anthony Volpe began the comeback from a 2-0 deficit with a one-out homer in the sixth inning, and Gleyber Torres doubled to chase Bibee before Anthony Rizzo laced a game-tying single against James Karinchak.",
        "Calhoun, pressed into playing time with Aaron Judge (right hip) and Giancarlo Stanton (left hamstring) sidelined, homered with one out in the seventh. It was his first round-tripper since April 11, 2022, when he was a member of the Texas Rangers.\"It was especially fun in the stretch that we're going through right now,\" Calhoun said. \"To come out and get a win right there -- especially after being down two -- it was cool.\"The loss continued a lengthy skid for the Guardians, who are 5-10 since starting the season 9-6. Cleveland has scored three runs or fewer 10 times in the past 15 games.The Guardians mounted plenty of threats on Tuesday against Yankees starter Gerrit Cole, who entered with a 1.11 ERA. The All-Star right-hander had just one 1-2-3 inning but stranded seven runners, including five in scoring position.Cleveland forced Cole to throw 69 pitches in the first three innings before he tossed 39 pitches over his final three frames.\"It kind of just shows you how good a pitcher he is, that even though I think he was at (69 pitches) after three innings, he's still able to go as far as he did and he still gave up two (runs),\" Guardians manager Terry Francona said.",
        "Schmidt took a loss in his most recent start, when he gave up five runs on 10 hits over five innings as the Yankees fell 5-2 to the Rangers on Friday.He is 0-0 with a 7.50 ERA in two career regular-season games (one start) against the Guardians. He also went 0-1 with a 6.75 ERA in two relief appearances against Cleveland in last year's AL Division Series, which the Yankees won in five games.Bieber won on Friday after surrendering two runs in seven innings as the Guardians beat the Red Sox 5-2.Bieber is 2-1 with a 4.76 ERA in four regular-season starts against the Yankees and 0-1 with a 7.84 ERA in two career playoff starts against New York dating back to 2020.--Field Level Media"
    ]
}