{
    "articleURL": "/tvshowbiz/article-12053381/Rihanna-shows-bare-baby-bump-jaw-dropping-fur-coat-alongside-AP-Rocky-NYC.html",
    "content": [
        "Rihanna proudly bared her growing baby bump on Friday night when she attended a billionaire's birthday party in a jaw-dropping fur coat.",
        "The 35-year-old Fenty mogul showed up with her dapper other half A$AP Rocky, 34, who kept it cool and casual in a black bomber jacket, white shirt and gray shorts.They arrived at Cipriani Soho to celebrate the 31st birthday of billionaire scion Alexandre Arnault – joining forces with a very sexy Kim Kardashian.Rihanna's eccentric ensemble combined multiple types of fur into a patchwork show-stopper that touched the concrete.She also donned a gray fur crop top and a brown leather skirt that featured a random attachment of gray fur on the right side of her hemline.",
        "The hitmaker kept her eyes covered in futuristic white shades and sported a pair of jungle stilettos with sultry straps that went up to her knees.Rihanna walked with her typical confidence and attitude, rocking her prehistoric coat and bringing a Flintstones playfulness to the glitzy soiree. The pair were attending the bash of Alexandre Arnault – the son of french tycoon Bernard Arnault, who is estimated to be worth somewhere in the realm of $230 billion. The Arnaults own many of the world's most iconic luxury goods, from liquor brands like Moet &amp; Chandon champagne and Hennessy cognac, to legendary fashion houses such as Louis Vuitton, Christian Dior and Fendi, just to name few.",
        "Through their conglomerate LVMH, the family also control jewelry powerhouses Tiffany &amp; Co and Bulgari, and have amassed one of the largest private art collections in the world.Rihanna has a close history with the Arnaults; they financially backed the launch of her luxury fashion brand Fenty in 2019, helping her to become 'the first woman of color at the top of an LVMH maison.'Taking to social media at the time, Rihanna wrote: 'Big day for the culture. thank you Mr. Arnault [LVMH chairman] for believing in this little girl from the left side of an island, and for giving me the opportunity to grow with you at LVMH. This is proof that nothing is impossible. Glory be to God.'Falling revenue eventually caused her upstart fashion house to shutter two years later, paving the way for her to make a colossal comeback with her Savage X Fenty lingerie brand. ",
        "Earlier in the day, Rihanna went makeup-free under a pair of frameless sunglasses, baring her baby bump in a cropped gray henley shirt.She teamed it with low-slung medium-wash blue jeans kept herself warm in a purple-blue jacket.The pop star sported a pair of Gucci loafers and flaunted a long, square-shaped nude manicure.Rihanna and A$AP Rocky's glitzy evening with one of the richest heirs on the planet comes after comes they fueled marriage rumors with her latest posts on social media.",
        "The Diamonds singer shared photos of herself posing with her rapper beau at the 2023 Met Gala and wrote: 'shout outz 2 the bridal party' and 'here comes the bride.'At the lavish event, the Anti music artist sparked marriage rumors after stealing the show in an extravagant, wedding-inspired white dress.The record producer — who sported a button-up and blazer on top paired with a kilt over jeans on the bottom — was seen holding her hand in every shot of the photo series.The couple welcomed their son last May and are currently expecting their second child together.",
        "Along with the four images, the Fenty Beauty founder wrote on Twitter: 'shout outz 2 the bridal party….here come de bride #idoKARL#METgala2023'. She used the same caption for her latest Instagram post.In the seemingly candid photos, the lovebirds were seen holding each other's hands as they arrived at the star-studded event and walked the red carpet.Rihanna looked ethereal in a white Valentino gown with a voluminous and long, floor-sweeping train.As she walked hand-in-hand with Rocky, various people assisted her by holding up the lengthy skirt.Over the bridal-esque garment, the billionaire mogul donned a cape adorned with camellia flowers — an ode to the emblem of the Chanel fashion house.",
        "She also rocked a pair of white framed sunglasses decorated with dramatic false eyelashes.By her side, Rocky sported an eclectic version of the conventional tuxedo with a high-low kilt worn over bedazzled denim jeans, a nod to late designer Karl Lagerfeld.He wore a classic white button-up top with a black thin leather tie teamed with a black blazer on top.",
        "With their show-stopping ensembles, fans quickly took to social media and started speculating that the pair had already exchanged vows.Rihanna and Rocky started dating in 2020 after years of longtime friendship and musical collaboration.Two years later they welcomed their first child, whose name they haven't shared.Earlier this year the entrepreneur announced her second pregnancy by showing off her baby bump during her Super Bowl halftime show."
    ]
}