{
    "articleURL": "/wires/reuters/article-12059257/KKR-posts-26-drop-Q1-earnings-beating-expectations.html",
    "content": [
        "By Chibuike Oguh",
        "NEW YORK, May 8 (Reuters) - KKR &amp;amp; Co Inc said on Monday its after-tax distributable earnings fell 26% year-on-year in the first quarter due to a sharp drop in asset sales from its private equity portfolio and lower transaction fees. KKR and other private equity firms cashed out on fewer investments during the quarter as inflation, higher interest rates, geopolitical tensions and financial market volatility weighed on dealmaking.After-tax distributable earnings, which represents the cash available for paying dividends to shareholders, fell to $719.3 million, down from $974 million posted a year. That translated to after-tax distributable earnings of 81 cents per share, which exceeded the average analyst estimate of 74 cents per share, according to Refinitiv data.KKR said its profit from asset sales fell 70% to $172.7 million. That result was in line with its peers, Blackstone Inc and Carlyle Group Inc, which also reported slower asset divestments in the first quarter.Transaction fees from KKR's capital markets division slumped by more than 60% to $102 million because of fewer deals across its portfolio companies.KKR reported 18% growth in management fees to $738.2 million, up from $624.9 million a year earlier as the firm accumulated more assets. KKR's earnings from investing the assets of its insurance franchise, annuities provider Global Atlantic, rose 43% to $205.1 million.",
        "For its quarterly fund performance, KKR said its private equity portfolio gained 2%, infrastructure funds added 7%, leveraged credit funds grew 4%, while opportunistic real estate funds fell 3%. In comparison, the private equity funds of Blackstone and Carlyle appreciated by 2.8% and 1%, respectively.Under generally accepted accounting principles, KKR posted net income of $322.7 million in the first quarter due to strong growth in revenue from its insurance and asset management businesses. That compared with a net loss of about $10 million in the same quarter a year earlier.KKR raised $12 billion of new capital and made $10 billion of new investments in the first quarter. It declared a dividend of 16.5 cents per share.(Reporting by Chibuike Oguh in New York; Editing by Jacqueline Wong)"
    ]
}