{
    "articleURL": "/wires/ap/article-12039333/Editorial-Roundup-United-States.html",
    "content": [
        "Excerpts from recent editorials in the United States and abroad:",
        "April 26The Washington Post on a U.S. Supreme Court code of ethicsIt was never realistic to expect that Chief Justice John G. Roberts Jr. would go before Congress for a clobbering over Supreme Court ethics rules. But citizens are entitled to expect more from him than what they got this week after he decided not to testify before the Senate Judiciary Committee: a \"statement on ethics principles and practices\" he released, which amounts to an insistence that existing rules are sufficient.The chief justice would do well to reassure the public that his institution is taking ethics concerns seriously following revelations about his colleague Justice Clarence Thomas´s repeated failures to file full financial disclosure forms. Texas billionaire Harlan Crow, ProPublica reports, purchased properties in Savannah, Ga., from Justice Thomas and his close relatives, and he treated the justice to luxury trips, private jet and superyacht travel, and other gifts. The transactions undermine faith in the court when it´s already struggling to keep the people´s trust. Transparency and reform are in the court´s best interest, as well as the country´s.This is only more important in light of a Politico article finding that the chief executive of one of the nation´s biggest law firms purchased a tract of land partly owned by Justice Neil M. Gorsuch. The deal rings far fewer alarm bells than the Thomas-Crow affair: The buyer has said he has never interacted with the justice - and didn´t even realize he was a party to the sale until it was well on its way to closing - at which point he referred the matter to his firm´s ethics department. What´s more, it looks as if Justice Gorsuch followed the filing instructions for the year in question. The issue, then, isn´t rule-breaking but rather how much justices should be obligated to report.",
        "A request to investigate Justice Thomas´s more concerning alleged lapses has been referred to the U.S. Judicial Conference´s Committee on Financial Disclosure, consisting of 16 federal judges. Now it is their responsibility to ask for an accounting from the justice of all his reports, amended to add anything he previously neglected to include. Then they can determine whether to refer the matter to the Justice Department. But that´s a narrow answer to a much broader problem: The current system ensuring the Supreme Court´s integrity is inadequate.Justice Elena Kagan told Congress four years ago that a code of conduct for the justices was under discussion. Yet nothing has emerged, and the principles and practices all nine justices signed on to this week is a poor substitute. Without such a set of standards, drawing distinctions between situations such as Justice Gorsuch´s land sale and Justice Thomas´s yearly lavish excursions is far more difficult. Answers to questions such as from whom justices should accept perks, how they should indicate they´ve accepted them and when they must recuse themselves from related cases remain unclear.If the Supreme Court refuses to hold itself to account with a code of conduct, someone else will have to step in. Congress would encounter real separation of powers concerns in writing the judiciary´s rules for it. But a proposal from Sens. Angus King (I-Maine) and Lisa Murkowski (R-Alaska) has promise: The legislation tells the Supreme Court it has to come up with rules within the year, without dictating what those rules should be.",
        "Chief Justice Roberts and other justices have said in the past that they can´t be bound by all the same rules as lower court judges because of the Supreme Court´s unique constitutional role as the nation´s final decision-maker. Yet that´s the very reason its members should be held to exacting standards.ONLINE: https://www.washingtonpost.com/opinions/2023/04/26/supreme-court-ethics-reform-clarence-thomas/___April 29The New York Times on Guantanamo BayLast week, Said bin Brahim bin Umran Bakush was released from detention at Guantánamo Bay, Cuba, and returned to Algeria, his home country. Suspected of being a low-level fighter for Al Qaeda, at age 52 he was in his 21st year of detention in the prison, had no charges filed against him and stopped speaking to lawyers about five years ago. Mr. Bakush´s release leaves 30 men, of the 780 held there over the years since 2002, still imprisoned at the U.S. naval base whose name has become synonymous with American shame.President Biden said at the outset of his administration that he would seek to have the detention center closed, and he directed the Defense Department to study how best to do so. But at the rate these cases are moving, resolving them could take several more years. Mr. Biden wisely avoided the kind of highly public pledges to close down the prison that President Barack Obama made and could not keep. But to achieve the goal of finally ending the extrajudicial detention of prisoners at Guantánamo - and its disgraceful violations of fundamental human rights and abandonment of the right to due process - requires more of Mr. Biden.",
        "Clearing out the remaining prisoners requires cutting through a tangle of laws, policies, procedures and bureaucratic secrecy. These are not simple tasks, but they are well within the power of the White House to accomplish if the process is given a far higher priority. Mr. Biden can use his authority to order the Departments of Defense, Justice and State, the intelligence agencies and other agencies involved to coordinate their efforts and direct their resources to make it happen, as quickly as possible.The moral imperative and the ethical case for doing so have only gotten stronger with time. As long as there are people held in detention at Guantánamo, America´s condemnations of brutal detention centers in China and Syria will ring hollow. And there is a particular cruelty inflicted by time. On April 21, a senior official of the International Committee of the Red Cross issued a rare public call for the U.S. military to provide better care for the prisoners, because they are \"experiencing the symptoms of accelerated aging worsened by the cumulative effect of their experiences and years spent in detention.\"The window for this administration to act may be closing. As the 2024 presidential campaign season begins, Republicans are more likely to label any efforts to close Guantánamo as soft on terrorism. Victory by Donald Trump or a like-minded candidate could well end any such efforts, as Mr. Trump did when he was in the White House.",
        "There are two concrete and urgent tasks before Mr. Biden´s government: The first is to find countries willing to take 16 men who, like Mr. Bakush, are deemed to pose no terrorist threat and have been cleared to leave but have not, usually because their home countries are in chaos and no other country has been found to take them.The second is to clarify the \"policy principles\" that would open the way for plea bargains for those cases in which convictions are no longer possible. There are 11 men who still have active cases before special military commissions, including five charged with having roles in the Sept. 11 attacks. None of them can be convicted, because they were subjected to torture and other maltreatment in detention. With three other detainees, the government simply needs to decide what it wants to do.The president has full authority to clear these hurdles and either repatriate the remaining prisoners or get them to a plea bargain. He has already appointed a special envoy for Guantánamo´s closing, Tina Kaidanow; Mr. Biden needs to ensure that the task has the highest priority.The Biden administration has also made some efforts to reach plea agreements with the remaining prisoners. But the plea bargain talks with the five prisoners accused in connection with Sept. 11 - including Khalid Shaikh Mohammed, who is accused of conceiving the plot - are bogged down. Since the plea talks opened more than a year ago, the military judge has canceled every scheduled session while the administration evaluates its policy principles guiding the terms under which the men would continue to be held at Guantánamo once they accept a plea bargain. Those terms include clearly defined rights to health care, lawyer visits and other conditions. Rather than allowing federal agencies to continue to discuss the policy principles, Mr. Biden could direct them to reach a consensus, speeding up the resolution of the remaining cases.",
        "Congress imposed a ban on allowing any of the Guantánamo detainees to ever enter U.S. territory, whether for trial, detention or even medical treatment. So there is virtually no other place to imprison those who do reach plea bargains, and while their cases drag on, and the prisoners´ health deteriorates, teams of doctors and surgeons must regularly be flown out to the island to treat them.If Congress lifted the ban, these prisoners could serve out their sentences after a plea bargain in a maximum-security prison in the United States. As long as the ban is in place, the only option is to keep the detainees on Guantánamo at a cost of $13 million per man per year, multiples of what it would cost to hold them on American soil. Once these cases are at last resolved, Guantánamo as a legal black hole would cease to exist.The ability to function outside the normal constraints of law and human rights is why this legal black hole was devised in the first place. The prison was established after the Sept. 11 attacks as a secret detention camp for especially dangerous prisoners, and the U.S. government at first deemed that it operated outside U.S. legal jurisdiction. This gave the C.I.A. and other agencies the legal cover to conduct \"enhanced interrogations\" that amounted to torture and to subject prisoners to cruel, inhumane and degrading treatment.There is little evidence that these interrogations yielded much intelligence, but they ensured that a lot of evidence against captives would be declared inadmissible in court, even if military prosecutors allowed their torture to be openly discussed in court.George W. Bush, whose administration set up the detention center, declared by the end of his second term that he would \"very much\" like to end Guantánamo. Barack Obama made a public commitment on entering the White House that he would shut down the camp, but proved unable to. By contrast, his successor, Donald Trump, thought Guantánamo was a great way to deal with \"bad dudes\" and signed an executive order to keep it open. Some lawmakers, notably Senator Lindsey Graham, Republican of South Carolina, continue to demand that Guantánamo remain open as a detention center for those suspected of terrorism.Because of the torture, and a slew of other legal problems - including allegations of clandestine governmental eavesdropping on conversations between prisoners and their lawyers - there is little chance the men could ever have gotten a fair trial; special military commissions set up to try prisoners have put very few on trial.\"At the heart of the commissions´ problems is their original sin, torture,\" Brig. Gen. John Baker of the U.S. Marine Corps, who was chief defense counsel at Guantánamo for six and a half years before his retirement in December 2021, testified before the Senate Judiciary Committee.The time to expect justice through the legal process has passed. As General Baker testified, \"The best that can be hoped for at this point, more than 20 years after the crimes were committed, is to bring this sordid chapter of American history to an end. And that end can only come through a negotiated resolution of the cases.\"Mr. Biden has the power to help reach that end and an obligation to do so.ONLINE: https://www.nytimes.com/2023/04/29/opinion/guantanamo-bay-prison-biden.html___April 28The Wall Street Journal on federal mortgage feesChanges to the Federal Housing Finance Agency´s mortgage pricing are creating a stir in the marketplace, not that the bureaucracy wants to admit it. The changes, which took effect Monday, raise costs for some good-credit borrowers while making mortgages cheaper for low-income borrowers.We highlighted the changes in a recent editorial, and FHFA Director Sandra Thompson objected to our characterization that the plan will socialize mortgage-lending risk. Ms. Thompson says the new policy \"won´t impose higher fees on higher-credit-score borrowers than on lower-credit-score borrowers, all else equal.\" She says some borrowers with higher credit scores may even pay less.We wonder how she defines \"all else equal.\" The new rules add fees for many borrowers with high credit ratings and large down payments and use them to reduce the cost of borrowing for those with worse credit and smaller down payments.According to calculations by Evercore ISI, buyers with strong credit scores between 720 and 739 who make 15%-20% down payments will see their rates increase by 0.750%. Borrowers who put down 20%-25% will see rates increase by 0.500%.The winners are borrowers with weak credit scores - that is, riskier borrowers. Under current FHFA policy, a borrower with a weak credit score below 620, who is borrowing more than 95% of the value of their home, pays 3.750%. Under Ms. Thompson´s new plan, those borrowers will see their fees decrease by 1.750%.Ms. Thompson, who regulates Fannie Mae and Freddie Mac, says the federal mortgage guarantors \"don´t subsidize borrowers based on their credit scores.\" But the new FHFA numbers will reduce fees for all borrowers with credit scores below 680 and all borrowers who have a down payment of 5% or less.These numbers matter because this is how the mortgage market prices risk. When the cost of loans is disconnected from the likelihood of default, bad things happen.The American Enterprise Institute looked at default rates of Fannie/Freddie owner-occupied 30-year fixed rate purchase loans acquired in 2006-2007 and found that among borrowers with credit scores between 720 and 769 and 20% down payments, the default rate was between 4.2% and 8.8%. Among borrowers with less than 4% down payments and credit scores between 620 and 639, the default rate was between 39.3% and 56.2%.Ms. Thompson says the loan fee changes will support lower-income home buyers who \"nonetheless have the financial capacity and creditworthiness to sustain a mortgage.\" But Ms. Thompson ignores that the FHFA has also slashed fees for borrowers who have small down payments and poor credit.Lowering fees on higher-risk mortgages doesn´t enhance Fannie and Freddie´s \"safety and soundness.\" Divorcing price from risk creates dysfunction in the mortgage market, sometimes in unpredictable ways, and taxpayers are on the hook. The fees may not even make housing more affordable because increasing demand without more supply will result in higher prices.The rule is finally getting noticed in Congress, which may also have Ms. Thompson´s attention. House Financial Services Committee Chair Patrick McHenry and Housing and Insurance subcommittee Chair Warren Davidson said they´ll try to repeal the fee changes if they take effect as planned.The FHFA is trying to make housing more affordable for some buyers by charging others more. Sounds like socializing credit risk to us.ONLINE: https://www.wsj.com/articles/federal-housing-finance-agency-sandra-thompson-mortgages-credit-e66fd493___April 28The Los Angeles Times on the House federal debt ceiling billHouse Republicans narrowly passed a bill this week that would increase the federal government´s debt ceiling in exchange for $4.8 trillion in spending cuts over 10 years that show what the GOP cares about.It´s not our nation´s youth. Republicans propose slashing funding for critical education programming that would affect low-income students, students with disabilities and students who need mental health support. These plans would also shrink the Pell Grant program, which helps low-income students attend college. In addition, the bill would block President Biden´s student debt relief plan before the Supreme Court has a chance to rule on its legality this year. Republicans are proposing these cuts at a time when students are still recovering from pandemic-induced learning setbacks and suffering high rates of mental health difficulties.Thankfully, this bill is not likely to pass the Democrat-controlled Senate, and Biden has promised to veto it if it does. The Limit, Save, Grow Act of 2023, which passed on a 217-215 vote, would also trim funding to programs for veterans, enact work requirements for government aid recipients starting in 2024, rescind funding for 87,000 Internal Revenue Service agents and end tax credits for companies investing in green energy.In California, the bill would remove $463 million in funding for schools that serve more than 4 million low-income children, reducing its funding to its lowest level in 10 years, according to the U.S. Department of Education. The bill would also cut $119 million in mental health support for students, reduce programming for students with disabilities, and make college more expensive for Pell Grant recipients by reducing the amount of gift aid, in addition to reducing the number of grant recipients by more than 9,500 students in the state.The bottom line is that these proposals would hit the most vulnerable students, cutting programs that can help young people do better in school and thrive. In contrast, the Department of Education says that Biden´s $6.9-trillion budget proposal would add funding to low-income schools and expand teacher training programs to address the shortage of teachers, which is affecting schools nationwide.Education funding proposals from either party should be scrutinized to ensure that students´ needs are met and that young people are prepared for the workforce without wasteful spending.But the cuts proposed by the GOP are hardly carefully considered trims as part of a measured analysis of programs. The 320-page plan spearheaded by House Speaker Kevin McCarthy (R-Bakersfield) simply calls for slashing 22% from funding without considering what students need. Balancing a budget this way is akin to a bull in a China shop breaking things. Republicans had no qualms in the past raising the debt ceiling while supporting programs that benefit the wealthy, such as Trump-era tax cuts.Congress needs to grapple with balancing the budget, but lawmakers shouldn´t sacrifice our youngest, most vulnerable to do so.ONLINE: https://www.latimes.com/opinion/story/2023-04-28/house-republicans-debt-ceiling-budget-cuts___April 30The Guardian on the U.S.-China chip warsRishi Sunak is readying a billion pounds to subsidize the U.K.´s fledgling microchip industry. It sounds big. But the British government is merely reacting to U.S. economic warfare against China. Behind the talk of \"friendshoring\" and resurgent industrial policy is a struggle to avoid collateral damage in the battle between China and the U.S. for tech supremacy.The E.U. plans almost to match the U.S. promise of $52bn (£42bn) in chip subsidies. India is spending $30bn (£25bn) on its semiconductor mission. Mr. Sunak looks to be bringing a peashooter to a gunfight. But Britain does not have a complete end-to-end chip supply chain nor does it aspire to have one. Instead, it is following the slipstream of U.S. power. Washington´s strength is that almost all chip factories contain critical tools from U.S. suppliers. The U.S. has isolated Beijing with export control powers that ban transactions between foreign countries and China. Washington´s legislative arsenal was first deployed against China´s Huawei, whose products Britain has also decided to ban.Microchips are the lifeblood of an advanced economy. COVID saw shortages when working from home meant demand for computers shot up just as chip supply dried up. This was exacerbated when skirmishes between Beijing and Washington turned into a \"zero-sum\" war on Chinese chipmakers. President Joe Biden sees China´s rise as a threat to the United States. Allies have taken note. Mr. Sunak´s government last November blocked the Chinese takeover of the U.K.´s biggest chip plant on national security grounds. Washington´s bans have seen Chinese chip imports plunge.The U.S. says it does not want to block China´s modernization - except in every area the foreign policy establishment thinks it should. Jake Sullivan, the U.S. national security adviser, said last year that the U.S. would stymie China´s attempts to attain \"foundational technologies\" such as artificial intelligence - by cutting off access to the high-speed processing power required. Some wryly note that this is \"Trumpism with a human face\".China isn´t sitting still. Beijing is spending $220bn to become self-sufficient in microchips, with some success. Trade is a two-way street: Berlin denied it would enforce a ban on key chemical exports after the news hit shares in its top companies. James Cleverly, the U.K. foreign secretary, last week suggested that China´s pride at its economic success might be short-lived. Britain clearly won´t be far behind if the U.S. bans the social media platform TikTok, owned by Beijing-based ByteDance. Evidently, the web will only be \"open\" as long as U.S. companies - or those of Washington´s allies - are superior enough to maintain market dominance.The U.S. treasury secretary, Janet Yellen, said last month that \"China´s economic growth need not be incompatible with U.S. economic leadership.\" In short, Beijing ought to nurture strategic industries that don´t challenge the U.S.´s dominant role. This is about tech prowess - not different models of government - in a competition for power. But innovative development is tricky to predict. The risks of geo-politicizing technology are that international cooperation in critical areas like clean energy and drug discovery will suffer - and the whole world will lose out.ONLINE: https://www.theguardian.com/commentisfree/2023/apr/30/the-guardian-view-on-us-china-chip-wars-no-winners-in-zero-sum-battles"
    ]
}