{
    "articleURL": "/wires/reuters/article-12044699/Shane-McClanahan-earns-MLB-best-6th-win-Rays-Pirates.html",
    "content": [
        "Shane McClanahan became the majors' first six-game winner, Josh Lowe and Wander Franco each hit solo homers, and the Tampa Bay Rays beat the Pittsburgh Pirates 8-1 on Wednesday in St. Petersburg, Fla.",
        "McClanahan (6-0) remained unbeaten after yielding one run on five hits with two walks and nine strikeouts over six innings. The left-hander has allowed two runs or fewer in each of his seven starts.Lowe and Franco had two RBIs apiece for Tampa Bay, which has won 25 of its first 31 games and leads the majors with 64 home runs. Chase Anderson tossed three scoreless innings for his first career save.Pittsburgh, which had won 11 of 13 entering the series, went 0-for-7 with runners in scoring position and has lost three straight games for the first time this season.The Pirates claimed a brief lead with two outs in the third on Andrew McCutchen's solo homer to left field. The 357-foot shot was his fifth homer in 15 career games at Tropicana Field.Tampa Bay answered with a two-out rally in the bottom of the third against Mitch Keller (3-1). The Rays put runners at the corners before Franco's grounder snuck under the glove of shortstop Rodolfo Castro, an error allowing Yandy Diaz to score. Tampa Bay capitalized further when Brandon Lowe followed with a two-run double.Pittsburgh's defense came into play again in the bottom of the fifth, when the Rays added two runs. Francisco Mejia hit a leadoff double, moved to third on Diaz's groundout and scored on Ji Hwan Bae's throwing error on Franco's grounder to second base. Harold Ramirez followed with a run-scoring single for a 5-1 advantage.",
        "Keller was lifted after giving up five runs (one earned) on five hits over five innings. He walked one and struck out eight.Lowe added to Tampa Bay's lead with a 455-foot homer to lead off the bottom of the sixth. Franco belted a leadoff homer in the seventh, and Luke Raley delivered an RBI double in the eighth.Pirates center fielder Bryan Reynolds doubled in the first inning to extend his streak with at least one extra-base hit to six games, which is tied for longest in the majors this season.--Field Level Media"
    ]
}