{
    "articleURL": "/wires/aap/article-12058389/New-hope-children-fighting-deadly-brain-cancer.html",
    "content": [
        "A breakthrough discovery by Australian scientists is offering hope for children suffering from a rare and deadly brain tumour.",
        "Researchers studying immunotherapy for inoperable cancers at the Walter and Eliza Hall Medical Research Institute in Melbourne say the treatment is effective at treating Diffuse Intrinsic Pontine Glioma (DIPG).DIPG is an aggressive type of brain tumour that affects 20 children in Australia every year.It impacts the part of the brain responsible for vital functions like breathing, swallowing and movement - meaning it cannot be surgically removed.The aggressive cancer affects children between the ages of about five to seven and has previously been untreatable, with patients unlikely to survive a year after diagnosis.Researchers have now discovered a new form of immunotherapy treatment, called CAR T therapy.Head researcher, Associate Professor Misty Jenkins, says it offers hope for the devastating illness by boosting a patient's existing immune cells.CAR T cell therapy isolates a patient's immune cells, engineering them to become \"super killer cells\" and then re-infusing them into the patient to fight the cancer.It trains the body to fight the cancer with its own cells, which means if the cancer returns, the cells will have a memory of their previous battles.\"These genetically-modified white blood cells act as a 'living drug', which means the patient will retain a living memory in their body of the anti-tumour response that may also work to kill the tumour again if it ever returns,\" she said.",
        "\"The way these cells can completely eliminate the tumours and persist in the body into the future is what is so exciting about CAR T cell therapy, and why immunotherapy is the future of precision medicine,\" she said.The treatment involves CAR T cells that recognise a cancer-specific protein called HER2.Once in the brain, the CAR T cells recognise this protein and signal the T cells to kill the tumour cells.Unlike radiation, which kills cancerous as well as healthy brain tissue, CAR T cell therapy uses a patient's own immune cells and engineers them to recognise and kill the tumour.\"CAR T cells offer a possibility of cure, with no long-term side effects,\" Prof Jenkins said.The study's preclinical models showed the use of CAR T cell therapy had effectively eliminated the DIPG tumours, with the research published in the open access journal Neuro-Oncology Advances.The researchers said the finding lays the groundwork for thousands more potential therapies to combat DIPG.The study shows the treatment is safe for children, with hopes it will be available in a clinical setting soon."
    ]
}