{
    "articleURL": "/wires/afp/article-12042613/Truce-ends-Gaza-cross-border-fire-sparked-prisoner-death.html",
    "content": [
        "An uneasy truce between Israel and Gaza militants was holding Wednesday following a major exchange of cross-border fire sparked by the death in custody of a Palestinian prisoner on hunger strike.",
        "Violence flared from Tuesday after the inmate, Khader Adnan, 45, from the Israeli-occupied West Bank, died following an 87-day hunger strike after his arrest by Israel over ties to the armed group Islamic Jihad.More than 100 rockets were fired from the blockaded Gaza Strip at Israel through the day and overnight, while the Israeli army struck targets in the enclave, killing at least one man, Hashel Mubarak, 58, and wounding several more.",
        "The Israeli army said Wednesday it had detected 104 rocket launches in total, with most intercepted by Israeli air defences or hitting open ground without causing any casualties.Islamic Jihad early Wednesday announced a truce following overnight talks involving Qatari, Egyptian and United Nations mediators, sources in Islamic Jihad and fellow militant group Hamas told AFP.The Israeli army said the last warning sirens sounded in areas near Gaza at around 5:30 am (0230 GMT). AFP journalists later reported schools and shops open as normal on both sides of the Gaza border area.",
        "\"We managed to reach a calm, with both sides responding to it from this morning,\" an Egyptian security source told AFP on condition of anonymity. Israel did not immediately confirm any agreement.Islamic Jihad declared that \"one round of confrontation has ended, but the march of resistance continues and will not stop\".",
        "\"Our brave fighters have proven their loyalty and commitment to defending their people,\" group spokesman Tariq Salmi said in a statement.- Prisoner's body -Adnan had become a resistance hero to many Palestinians through a string of high-profile hunger strikes during at least 13 stints in Israeli custody.",
        "In a statement, UN rights experts said Wednesday his death \"must be accounted for\", calling it \"a tragic testament to Israel's cruel and inhumane detention policy and practices\".The experts, who are appointed by the UN Human Rights Council but do not speak on behalf of the UN, lamented that he had not been given \"adequate\" treatment even as his health deteriorated.Hamas chief Ismail Haniyeh demanded Israel return the body to Adnan's family.",
        "\"We stress -- as we have informed all the mediators who intervened -- the necessity of handing over the body of the martyr Khader Adnan to his patient family,\" Haniyeh said in a statement.Qaddura Fares, head of the Palestinian Prisoners' Club advocacy group, said Palestinian authorities had asked Israel for Adnan's body on Tuesday but were yet to obtain a response.Adnan's widow, Randa Mousa, after hearing of his death on Tuesday morning, had urged against any rocket fire from Gaza, saying she did not want \"a drop of blood to be shed\".",
        "But the rocket fire soon started, with around 100 launched from Gaza towards Israel according to Islamic Jihad -- a barrage that sparked an initial Israeli response with tank fire.- 'Proportionate' response -Israel said Wednesday it had carried out pre-dawn air strikes targeting Gaza \"weapons manufacturing sites, outposts, military complexes and an underground terror tunnel\" belonging to Hamas.",
        "One strike north of Gaza City killed a Palestinian man, the 58-year-old Mubarak, and wounded five others, the Hamas-run health ministry said.Dozens of mourners later waved the green flag of Hamas as they gathered for Mubarak's funeral.European Union foreign policy chief Josep Borrell expressed concern over the violence after talks Tuesday with Israeli Foreign Minister Eli Cohen in Brussels.Borrell condemned recent attacks against Israelis and stressed the EU's commitment to Israel's right to defend itself, while warning \"any response must be proportionate and in line with international law\".Israel generally holds Hamas -- which has controlled Gaza since 2007 -- responsible for all rocket fire from the enclave, regardless of who launches it.In August 2022, three days of fighting between Islamic Jihad and Israel left 49 Palestinians dead, including 12 militants, according to the United Nations."
    ]
}