{
    "articleURL": "/news/article-12048151/Purple-coiffured-American-royal-fan-reveals-Princess-said-shed-look-coronation.html",
    "content": [
        "William and Kate were visiting a pub in Soho ahead of the ceremony on Saturday The couple told how their son Prince George is excited for his role as pageAre YOU the lucky fan in this selfie? Email elizabeth.haigh@mailonline.co.uk The Princess of Wales delighted one royal fan in London today when she took a selfie and promised to look out for her at the Coronation on Saturday as she and husband Prince William met fans on a trip to a pub.",
        "The Prince of Wales and Kate Middleton arrived outside the Dog and Duck pub in Soho, central London on Thursday and met dozens of royal enthusiasts, before getting behind the bar and pulling pints ahead of their family's historic weekend.But the meet-and-greet was especially exciting for one fan of the pair, whose engagement ring was remarkably similar to Kate's own sapphire ring - which was once owned by Princess Diana.The enthusiast, a young American woman with bright purple hair, showed off her ring alongside Union Jack-themed nails in a selfie taken with Kate this afternoon.In the same trip Prince William told well-wishers he is hoping for good weather on the weekend as the final touches are made to preparations for King Charles III's Coronation ceremony. Are YOU the lucky fan who took this selfie with Kate? Email elizabeth.haigh@mailonline.co.uk ",
        "After meeting the Princess, the fan told Greatest Hits Radio London how Kate had promised to 'look out' for her at the Coronation on Saturday.She said: 'We were talking about how I have a ring like hers, how my nails are painted.'She asked me if I did them myself and I said 'No, I don't have that steady of a hand - I wish!'.'The fan said she told the Princess: 'I just can't believe I'm meeting you and I'm so excited to be here.'",
        "The Princess of Wales then asked the fan: 'What are you doing on Saturday?'The woman said she replied: 'Well, coming to see you!'The Princess is said to have told her: 'I'll be looking for you, I'll be looking for the hair.'Describing the experience, the woman said: 'I was freaking out. I totally left my body.'Kate, 41, leaned into the frame for a candid snap with the purple-haired fan, who beamed as she showed the Princess her ring and held her hand up in the photo.Meanwhile William, 40, also enjoyed some photos and made easy banter with the crowd as he quipped the family has a 'quiet weekend' ahead with 'nothing at all' planned.Onlookers laughed as the prince waved the question off in jest while accepting some flowers.King Charles's son also told supporters that he's 'praying for good weather' with the coronation just days away.The pair were also seen holding hands with people in the crowd as they chatted with excited bystanders looking forward to this weekend's festivities.",
        "The couple made the trip to the Dog and Duck pub in Soho using the Elizabeth Line to pull pints and chat to hospitality staff ahead of the Coronation.Londoners were left shocked to spot the couple on public transport as they boarded the train and got off at Tottenham Court Road.",
        "The Prince and Princess met Transport for London (TFL) workers who will be working throughout the coronation weekend.Asked about the royal family's preparations for Saturday during the engagement, Kate said: 'Yes, it's going to be a very busy time. We're getting there. I still feel like we're trying to get ducks in a row.'After being handed their Oyster cards by an aide and welcomed to Acton station by Andy Lord, TFL's commissioner, the couple met with Carinne Spinola, a train driver and Cameron Finch, a customer service assistant, and talked about their career aspirations.Once on board the train, they sat with a group of TFL workers, including David Pearce, a fleet manager, Liam Grindley, a service and infrastructure manager and Maria Serco, a maintenance engineer.Speaking about her conversation with Miss Spinola, Kate told the group: 'It's nice to meet a female train driver, obviously a profession women are keen on getting into. She said the job was advertised on Mumsnet.'The trip follows the late Queen Elizabeth II's visit to the Elizabeth Line when it first opened ahead of the Platinum Jubilee. While in the pub itself, the royal couple were accompanied by pub managers Chris Watts and Maria Sojkova behind the bar, where William poured a 'perfect pint', according to waitress Bernie Kidson.",
        "It was the first pint of Kingmaker, a pale ale brewed to celebrate the coronation, ever poured.During the visit, William told Mr Watts he likes to visit pubs 'out in the sticks' to enjoy watching football in a quieter atmosphere.Speaking after the visit, which hundreds of fans lined the streets to watch, Mr Watts said William was 'enjoying his drink' and 'didn't want to go'.",
        "He added: 'When we were sat down he said he was happy to sit here a little bit longer.'He was saying he likes to go to the pub - he said he goes out into the sticks where it's a bit quieter and enjoys watching football, chatting to people and talking.'I don't think he could do that here - it'd be quite busy.'Kate also said their eldest child Prince George was 'excited' about the upcoming coronation and had been taking part in rehearsals.She said the atmosphere in the area was 'wonderful' and that excitement for the coronation was 'already starting to build'.The royal visit came as London prepared for the historic event on Saturday when the King will be crowned.Tens of thousands of people are expected to line the streets to see a grand procession to and from Westminster Abbey.",
        "The ceremony itself will take place in front of around 2,000 guests in the Abbey itself, lasting for two hours. "
    ]
}