{
    "articleURL": "/wires/ap/article-12055877/MTV-Movie--TV-Awards-ditches-live-event-due-strike.html",
    "content": [
        "NEW YORK (AP) - A host-less, pre-taped and muted MTV Movie &amp; TV Awards on Sunday became the first big awards show to air during the screenwriters' strike, offering a commercial-heavy broadcast featuring lots of past recycled live clips.",
        "\"Scream VI\" won the trophy for best movie, holding back competition from \"Avatar: The Way of Water,\" \"Black Panther: Wakanda Forever,\" \"Elvis,\" \"Nope,\" \"Smile\" and \"Top Gun: Maverick.\" In a pre-taped response, the killer Ghostface was humble: \"To all the fans that voted, you finally answered my question: What´s your favorite scary movie?\"\"The Last of Us\" was crowned best TV show, beating the likes of \"Stranger Things,\" \"The White Lotus,\" \"Wednesday\" and \"Yellowjackets.\" Pedro Pascal accepted the award and said he and the cast and creators were standing in solidarity with the striking writers.Tom Cruise took home the best performance in a movie for \"Top Gun: Maverick,\" beating Austin Butler, Florence Pugh, Michael B. Jordan and Keke Palmer. In a pre-taped response, Cruise was seen piloting a jet and thanking the fans, while also plugging his next \"Mission: Impossible\" film.Jenna Ortega won best performance in a TV show for \"Wednesday,\" beating Aubrey Plaza, Christina Ricci, Riley Keough, Sadie Sink and Selena Gomez. \"Stranger Things\" won for best kick-ass cast.\"The Kardashians\" won best docu-reality show, the best breakthrough performance went to Joseph Quinn of \"Stranger Things,\" and Pascal won for best hero for \"The Last Of Us.\" Pascal also won half the best duo prize with co-star Bella Ramsey.",
        "Best comedic performance went to Adam Sandler, for \"Murder Mystery 2,\" and \"Scream VI\" won for best fight, with Ghostface again thanking the voters: \"It's about time someone finally appreciated my work.\"Host Drew Barrymore had dropped out in solidarity with the Writers Guild of America - later winning best host - and the show´s red carpet was rolled up. Faced with a picket from the guild, MTV scrapped the live event entirely.While Barrymore wasn´t there, she left plenty of sponsored bits, one with Cheetos popcorn and another pretending to play younger sister Skipper in the upcoming movie \"Barbie.\" She was also in a commercial for Pluto TV and a spoof of \"Wednesday.\" She kicked off the show reprising her role as Josie Grossie from \"Never Been Kissed,\" trying to smooch several nominees in carefully edited comedic moments.Jennifer Coolidge received the Comedic Genius Award on tape and gave a shoutout to striking writers, saying almost all great comedy starts with great writers.\"I stand here before you tonight side by side with my sisters and brothers from the WGA,\" she said. Coolidge also later won for best frightened performance for \"The White Lotus.\"\"RuPaul´s Drag Race All Stars\" won for best competition series, and the recipients urged protection for drag acts, while the best kiss award went to Madison Bailey and Rudy Pankow from \"Outer Banks.\" Many awards produced no winner's response.",
        "MTV filled the show with dozens of old clips, like an all-star 2001 performance of \"Lady Marmalade,\" Lizzo belting out her hit \"Juice\" in 2019 or Rihanna in 2002 singing \"Umbrella,\" as well as other genius award speeches from previous winners like Melissa McCarthy, Kevin Hart and Jack Black. There was also a sneak peek from an upcoming episode of \"Yellowjackets\" and a clip from \"Transformers: Rise of the Beasts.\" It was sometimes hard to determine what was new and what was old.\"Selena Gomez: My Mind &amp; Me\" was named best music documentary, \"Come Back Home\" in \"Purple Hearts\" was voted best musical moment, and Taylor Swift's \"Carolina\" won best song. Elizabeth Olsen in \"Doctor Strange in the Multiverse of Madness\" was named best villain.___Mark Kennedy is at http://twitter.com/KennedyTwits"
    ]
}