{
    "articleURL": "/sport/football/article-12055381/Wanderers-star-Milos-Ninkovic-confronts-Sydney-FC-coach-Steve-Corica-League-finals-derby.html",
    "content": [
        " Ninkovic dragged away from Sydney FC dressing rooms Wanderers star tried to confront coach Steve Corica Sydney claimed a 2-1 win against Western SydneyWestern Sydney Wanderers star Milos Ninkovic had to be dragged away from the Sydney FC dressing rooms after confronting former manager Steve Corica after an explosive Sydney derby.",
        "Sydney claimed a 2-1 win at CommBank Stadium on Saturday to set up a double-legged A-League semi-final against Melbourne City and knock their bitter rivals out of the finals in the process.It was the first finals encounter between the two clubs in the competition's history.On the field it was a nervy affair, and the tension spilled into the aftermath as Ninkovic made a beeline for the Sydney dressing rooms.Sydney say Ninkovic, who was quickly frog-marched out of their inner sanctum in view of the media, had gone to confront Corica.",
        "The Serb played for the Sky Blues for seven years before switching to the Wanderers after a fallout over his status as a visa player.Western Sydney coach Marko Rudan, who did not refer to Corica by name, claimed the Sydney boss had laid the foundation for the post-game spat while aiming a barb at the veteran midfielder during Saturday's game.'Milos went in there to congratulate his old teammates, and their coach didn't appreciate him being in there,' Rudan said.'Something occurred between those two, which wasn't pleasant, it was quite fiery.'I haven't seen Milos yet, I haven't spoken to him about that.'But I think it all started in the game where I think their coach said something not very nice on the sideline to Milos, I think that's where it started.",
        "'That's football, these things kind of happen.'Ninkovic, who continued to shout after being thrown out of the Sydney dressing rooms, had been involved in a running battle with former teammate Luke Brattan all evening.",
        "'He's just upset with losing the game,' Corica said.'We have issues with him, obviously, but that's between me and him.'Ninkovic was booked in the second half before being substituted off by Rudan.After his substitution his former roommate Adam Le Fondre scored the goal which knocked the Wanderers out of the final.'I thought surely not. Ninko's very calm and I had heard there was kerfuffle,' Le Fondre said.'There is always niggle in a derby, you expect that sort of enemy, siege mentality from both teams.'",
        "The Wanderers had the better of the chances in the first half, skipper Marcelo flashing a close-range header wide and Ninkovic forcing Andrew Redmayne into a fingertip save.Calem Nieuwenhof helped get the breakthrough when he burst upfield in the 39th minute and attempted to send a low cross into the Sydney box.Luke Brattan was able to block it with his foot but the ball cruelly bounced up and glanced Alex Wilkinson's upper arm.Referee Chris Beath pointed to the spot and after consultation with VAR the decision stood.",
        "Redmayne brought out his Wiggles-inspired theatrics but Schneiderlin remained calm and slotted it past the Sydney No.1 to hand the home side a 1-0 leading heading into the break.It was a complete contrast in the second half, the Wanderers like punch-drunk boxers hanging on for life.Eventually their defensive wall crumbled with Mak capitalising on a sloppy Adama Traore clearance to draw the Sky Blues level.The loss of defender Tomislav Mrcela forced the Wanderers into a reshuffle and even though they pushed forward, it was Le Fondre who broke the deadlock.The shortest man on the field for the Sky Blues, Le Fondre fizzed a header beyond the reach of goalkeeper Lawrence Thomas to knock the Wanderers out."
    ]
}