{
    "articleURL": "/wires/pa/article-12045721/Local-elections-2023-Timetable-key-results-events.html",
    "content": [
        "Here is a guide to when to expect the key results and events after polls close in the local elections on Thursday.",
        "All declaration times are estimates and could change.– Thursday, 10pm: Polls close in the 230 local authorities across England holding elections. Counting begins for 64 councils.– Friday, from 12.30am: First results expected. Hartlepool is a target for Labour and the Conservatives, with both parties hoping to make enough gains to take overall control. The result from Castle Point will be an early test of the fortunes of independent candidates, who currently have a majority on the council.Sunderland will provide a measure of Labour’s popularity in one of its traditional heartlands. The result of the Middlesbrough mayoral election is also due, with the independent Andy Preston seeking a second term in office.– From 2am: In Brentwood, the Conservatives are defending a slim majority and face a strong challenge from the Liberal Democrats, who are hoping to take control. Labour is hoping for signs of a recovery in Thurrock, though it would be a major upset if the Tories lost control. In Portsmouth, the Lib Dems are keen to remain the largest party, while the Tories hope to do likewise in Worcester.– From 3am: Independent candidates could prevent the Tories gaining full control in Boston. The Lib Dems hope to increase their slim majority in Cotswold and cling on to their tiny majority in Hull.",
        "Colchester has seen the Tories, Labour and Lib Dems almost level-pegging in recent years and the outcome of this year’s contest – with a third of its seats in play – could impact the current Labour-Lib Dem-Green coalition.",
        "– From 4am: Bolton is a key battleground with every council seat up for grabs and both Labour and the Conservatives hoping to win overall control. Plymouth is another Labour target and was visited early in the campaign by Sir Keir Starmer.The Lib Dems have their sights on Dacorum, where leader Sir Ed Davey launched his party’s campaign by driving a yellow tractor through a “blue wall” of painted hay bales.– From 5am: Independents currently hold almost every seat in Ashfield and will be looking for a comfortable win. Stoke-on-Trent will be another big measure of Labour’s fortunes, with the party hoping to become the largest party in what was once a stronghold.– By 9am: Most results from the overnight counts should be in, with at least one council, East Lindsey, not likely to finish until late morning.– After 9am: Counting begins for the remaining 166 councils in England and the mayoral contests in Bedford, Leicester and Mansfield.– From 12pm: Results likely to resume in England. Labour will want to increase its majority in Worthing while the Tories hope to see off the Greens and Lib Dems to keep their slender majority in Solihull. The Lib Dems are keen to deny the Tories a majority in Stratford-on-Avon.",
        "Labour is looking for comfortable wins in places like Gateshead, Manchester and North Tyneside. Labour and the Tories both hope to do well in the ultra-marginal council of Crawley. The result of the Mansfield mayoral election is due around this time, with Labour’s Andy Abrahams looking for a second term.– From 2pm: In Torbay, the ruling coalition of Lib Dems and Independents could be at risk if the Tories do well. The Forest of Dean may be fertile ground for the Greens and independents.",
        "– From 3pm: Labour is keen to retake control of Middlesbrough and needs only two gains. A strong showing in Darlington would also point to a good performance in an area where the party needs to make ground at a general election.Both the Conservatives and Labour hope to make progress in Milton Keynes, which is currently run by a Labour-Lib Dem coalition despite the Tories having the most seats. There may be signs of a Lib Dem advance in places like Surrey Heath and Wokingham. The results of the Bedford and Leicester mayoral contests are due, with the Lib Dems’ Dave Hodgson and Labour’s Sir Peter Soulsby respectively hoping to stay in office.– From 4pm: The Greens could become the largest party in Mid-Suffolk, where they launched their election campaign. The Tories will hope to recover ground in West Oxfordshire, where they lost control in 2022 after 22 years.",
        "The Lib Dems are keen to make progress in the “blue wall” council of Woking, where they won a slim majority last year. Sir Keir launched Labour’s campaign in Swindon, but the party needs a very strong performance to win control.– From 5pm: Derbyshire is home to several key contests, including Derby, where every seat is up for grabs and where Labour is hoping to oust the minority Tory administration. South Derbyshire could end up another two-way tussle between the Tories and Labour.In Brighton &amp; Hove, the Greens will want to maintain their status as the largest party in the face of a possible Labour advance. Southampton could be a two-way battle between Labour, which currently has a small majority, and the Conservatives. In Lancaster, the Greens are looking to overtake Labour to become the largest party.– Friday evening: Labour will hope to make progress at Cheshire West &amp; Chester and will be disappointed if it misses out on winning a majority of seats. Waverley finds the Conservatives trying to unpick a Labour-Lib Dem-Green-independent coalition.The final result could come from York, where all seats are in play and Labour is hoping to do enough to end the current Lib Dem-Green coalition, while the Tories will want to increase their tally of just two seats."
    ]
}