{
    "articleURL": "/tvshowbiz/article-12060543/Kelly-Brook-joins-Big-Narstie-rapper-showcases-incredible-weight-loss-transformation.html",
    "content": [
        "Kelly Brook has joined Big Narstie as he showcased his slimmed down figure for a new SlimFast campaign.",
        "The rapper, 37, revealed he collapsed following a 2019 appearance of Celebrity Bake Off which led to a major weight loss transformation.He told The Mirror: 'I collapsed after Celebrity Bake Off and that's when I began on my fitness journey and got into mixed martial arts.' 'I come from a poor background, healthy food should not be expensive and I only noticed [how expensive it was] when I started to live that way'. Before adding: 'SlimFast is not a pocket breaker and a big thing about changing your lifestyle is being able to afford it.'",
        "Big Narstie, real name Tyrone Lindo, showcased his trimmed physique in a pastel sweatshirt and matching tracksuit bottoms for the new campaign images. He rocked a chunky gold chain necklace and white trainers while playfully posing with model Kelly on a sofa.  Meanwhile the brunette beauty looked nothing short of sensational in a stylish burgundy jacket which she teamed with matching trousers for the campaign shots. She opted for a black scoop neck top beneath and kept casual in a pair of coordinated trainers. Accentuating her features with a light dusting of make-up she swept her brunette tresses into a high ponytail with strands framing her gorgeous face. To celebrate the collaboration the duo released an energetic new song, Oomph for your Boomph, to showcase how the meal replacement brand helps to power up their day. ",
        "The high octane track features in SlimFast's brand new TV ad which is set to air later this month.Big Narstie is the latest ambassador for SlimFast and as part of his well-documented journey to improved health and enhanced energy. ",
        "He previously explained to Radio Times that he had been overworking himself between his TV and music careers which led to his collapse.'So f***ing nine days with only 24 hours sleep… I f***ing collapsed, you get me? I went to hospital. That was a wake up that I really needed to slow down.'He explained that he realised that opportunities are worthless if one is unhealthy.   'If I haven't rested or I haven't slept or had food or done the normal basic things as a human being, how could I stand in front of a camera and do stuff, you know what I mean? It's mad!' 'When my body just gave up it was crazy! At night I just felt a bit f***ed up and then it all went downhill,' he added.Big Narstie competed in the tent with athlete Katarina Johnson, MP Jess Phillips and comedian Johnny Vegas.Half way through the competition, he was forced to leave after becoming ill and was replaced by host Sandi Toksvig."
    ]
}