{
    "articleURL": "/tvshowbiz/article-12040453/The-star-Bella-Ramsey-checks-Mark-Hotel-New-York-City.html",
    "content": [
        "Just under 24 hours after making her Met Gala debut, The Last of Us star Bella Ramsey was spotted checking out.",
        "The 19-year-old actress - who identified as non-binary in January - was spotted getting into a vehicle after checking out of The Mark Hotel in New York City on Monday morning.Ramsey will return as Ellie Williams in Season 2 of The Last of Us, though it's currently unclear when filming will begin on the new season. The actress stepped out of The Mark Hotel wearing a green hoodie with the hood pulled up over her head donning a black baseball cap from the 2023 Met Gala.She had her John Lennon-style sunglasses dangling from the neck of her hoodie, with a multi-colored jacket over the hoodie.",
        "They also had a blue backpack strapped to their back while carrying a small bottle of water and a small plastic bag.Ramsey completed her look with black sweat pants and white sneakers as they headed to their vehicle. The actress made her professional debut at just 11 years of age in the sixth season of Game of Thrones, portraying the fierce Lyanna Mormont.They recently opened up about their first day on the set meeting Kit Harington, who played the iconic Jon Snow, which the actress said was one of the best days of their life.'One of my first memories was getting over there and meeting Kit Harington, who plays Jon Snow, for the first time. And I knew that he was Jon Snow, I knew that he was one of the big parts in it. And he just was so cool and so kind,' Ramsay recalled. ",
        "'And I remember him telling me that he liked my Dr. Martens. They were blue and red with white spots; they were my favorite things. And he complimented them, and he called me dude, and it was like the best day of my life,' they said.Ramsey revealed in a January interview with The New York Times that they identified as non-binary.'I guess my gender has always been very fluid. Someone would call me she or her and I wouldn’t think about it, but I knew that if someone called me he it was a bit exciting,' Ramsey admitted.",
        "While they admit they will check the 'non-binary' option if it exists on any sort of official form, Ramsey isn't terribly concerned with pronouns.'I’m very much just a person. Being gendered isn’t something that I particularly like, but in terms of pronouns, I really couldn’t care less,' they said.Ramsey will next be seen in the BBC series Time, which debuts later this year and they also voice Molly in Chicken Run: Dawn of the Nugget.The actress is attached to star in Romola Garai's (Amulet) new film Monstrous Beauty alongside Dominic West, Ruth Negga and Fiona Shaw. "
    ]
}