{
    "articleURL": "/wires/reuters/article-12050427/Smoldering-Iran-nuclear-crisis-risks-catching-fire.html",
    "content": [
        "By Arshad Mohammed, John Irish, Jonathan Landay and Parisa Hafezi",
        "WASHINGTON/PARIS/DUBAI, May 5 (Reuters) - Even as the United States and its European allies grapple with Russia's invasion of Ukraine and rising tensions with China, the smoldering crisis over Iran's nuclear program threatens to reignite.In a sign of European concern, Britain, France and Germany have warned Iran they would trigger a return of U.N. sanctions against Tehran if it enriched uranium to the optimal level for a nuclear weapon, three European officials said.The threat, made last year in a previously unreported letter sent by the countries' foreign ministers, underscores Western fears that Iran could produce bomb-grade uranium of 90% purity.Those concerns intensified in February after U.N. inspectors revealed their discovery of uranium particles of 83.7% purity at an Iran nuclear facility built deep underground to protect it from air strikes.A renewed crisis over Iran would come at a bad time for U.S. President Joe Biden who is focused on maintaining allies' support for the war in Ukraine and on rallying Western countries to push back on China's military and diplomatic ambitions.But while some White House aides may prefer to keep Iran off the president's desk, officials and analysts suggested they may not have that luxury.\"They are busy with Ukraine, Russia and they don't want, for the time being, to open another front,\" said a Western diplomat on condition of anonymity. \"Therefore, they want to do everything in their power to prevent this (90%) from happening.\"",
        "'SNAPBACK' OF U.N. SANCTIONS?Western officials fear a nuclear-armed Iran could threaten Israel, Gulf Arab oil producers, and spark a regional arms race.Iran denies seeking nuclear weapons.U.S. and European officials have been searching for ways to curb Tehran's program since the breakdown of indirect U.S.-Iranian talks on reviving the 2015 nuclear deal between Iran, Britain, China, France, Germany, Russia, and the United States.The accord, aimed at keeping Iran from developing a nuclear weapon, required Tehran to accept restrictions on its nuclear program and more extensive U.N. inspections, in exchange for an end to U.N., U.S., and EU sanctions.The deal, which had capped Iran's uranium enrichment at 3.67%, was abandoned in 2018 by then-U.S. President Donald Trump, who argued it was too generous to Tehran.Trump reimposed broad U.S. sanctions, many of which have the secondary effect of forcing non-U.S. firms stop dealing with Iran or risk losing access to the U.S. market, but UN sanctions were not reactivated.The deal had set out a procedure for the veto-proof \"snapback\" of the U.N. sanctions on Iran - including an oil embargo and banking restrictions - in response to Iranian violations. Any of the states who signed onto the original deal can trigger the snapback.U.S. sanctions - even with their secondary effects - have failed to keep Iran from producing ever-purer levels of uranium and China has flouted them by buying Iranian oil, making it unclear if the U.N. measures would be any more effective.",
        "But Iran might refrain from enriching to 90% to avoid the public rebuke implicit in the return of U.N. sanctions.A senior Iranian nuclear official said Tehran would not take the revival of U.N. sanctions lying down.\"If the other parties under any pretext trigger it, they will be responsible for all the consequences,\" he told Reuters. \"Iran's reaction could range from leaving the NPT (Nuclear Non-Proliferation Treaty) to accelerating our nuclear work.\"Leaving the NPT would free Iran to develop nuclear arms.The Iranian official's threat was more explicit than comments by an Iranian foreign ministry spokesman, who on Monday said only that Iran had told Western powers how it would react.It remains unclear if the 83.7% particles were created deliberately. But Western officials and analysts say that Iran's production of 90% uranium would demand a significant response.A U.S. State Department spokesman said Biden \"is absolutely committed\" to making sure Iran never obtains a nuclear weapon.\"We believe diplomacy is the best way to achieve that goal, but President Biden has also been clear that we have not removed any option from the table,\" the spokesperson added, hinting at the possibility of military action.'FACE A CRISIS AT SOME POINT'While Western officials want to leave the door open for diplomacy, tensions with Russia and China make that harder.",
        "Divisions over the Ukraine war, which has seen Iran provide military aid to Russia, and rising Sino-U.S. tensions further reduce the odds of resurrecting the deal because it is unclear how hard Moscow or Beijing might push for its revival.If the deal is dead, the West has three broad options: deterrence, military action, or a new negotiated arrangement.Deterrence has a downside: it could give Tehran time to creep toward a nuclear weapons capability.Dennis Ross, a veteran U.S. diplomat now at the Washington Institute for Near East Policy think tank, suggested Biden may have to do more to make Iran fear the consequences of enriching to higher levels.\"If you don't do enough to persuade the Iranians of the risks they are running, you will face a crisis at some point because they will go to 90%\" or move toward weaponization, he said. \"What you are seeing is an effort to walk that tightrope.\" (Reporting By Arshad Mohammed and Jonathan Landay in Washington, John Irish in Paris and Parisa Hafezi in Dubai Editing by Don Durfee and Alistair Bell)"
    ]
}