{
    "articleURL": "/wires/ap/article-12051215/Ford-recalls-vehicles-air-bag-inflator-installation.html",
    "content": [
        "Ford Motor Co. is recalling certain 2004 to 2006 Ranger vehicles because replacement front passenger air bag inflators may have been installed incorrectly.",
        "The National Highway Traffic Safety Administration said in a letter that the recall includes 231,942 vehicles.The vehicles had received replacement front passenger air bag inflators under a previous recall. The NHTSA said that an incorrectly installed inflator may not properly inflate the passenger air bag, increasing the risk of injury during a crash.Dealers will inspect and reinstall the front passenger air bag inflator, if needed, for free.Notification letters are expected to be mailed to owners of the impacted vehicles on May 22.Ford recalled about 98,000 Rangers for the same problem in February, and the recent action adds about 133,000 of the pickups.",
        "Vehicle owners may contact Ford customer service at 1-866-436-7332 or the NHTSA at vehicle safety hotline at 1-888-327-4236 (TTY 1-800-424-9153).Ford recalled about 98,000 Rangers for the same problem in February, and the recent action adds about 133,000 of the pickups.A day earlier, BMW warned the owners of about 90,000 older vehicles in the U.S. not to drive them due to an increasing threat that the air bags might explode in a crash.The warning covers vehicles from the 2000 through 2006 model years that previously had been recalled to replace faulty and dangerous air bag inflators made by Takata.The company used volatile ammonium nitrate to inflate the air bags in a crash. But the chemical can deteriorate over time when exposed to heat and humidity and blow apart a metal canister, hurling shrapnel that can injure or kill drivers and passengers.",
        "Since 2009, the exploding air bags made by Takata have killed at least 33 people worldwide, including 24 in the United States. Most of the deaths and about 400 injuries have happened in U.S., but they also have occurred in Australia and Malaysia."
    ]
}