{
    "articleURL": "/wires/reuters/article-12045175/Global-gas-markets-rebalancing-remain-tight-2023-IEA.html",
    "content": [
        "By Marwa Rashad",
        "LONDON, May 4 (Reuters) - Global gas markets are gradually rebalancing but are expected to remain tight in 2023 amid lower Russian pipeline gas deliveries to Europe, the International Energy Agency (IEA) said on Thursday.The European and global gas markets suffered a major supply shock in 2022 when Russia reduced its pipeline gas deliveries to the European Union by 80%, triggering a global energy crisis.Mild weather, an increase in liquefied natural gas (LNG) exports and a strong decline in gas demand helped to cushion the shock leaving Europe's storage 60% full.\"The reduced market strains and relatively well-stocked storage sites ahead of the summer are reasons for cautious optimism for supply security,\" the IEA said in its quarterly gas market report.\"The improved outlook for gas markets in 2023 is no guarantee against future volatility...global gas supply is set to remain tight in 2023, and the global balance is subject to an unusually wide range of uncertainties,\" the report said.The risks, which include adverse weather, such as a dry summer, lower availability of LNG, and the possibility of a further decline in Russian deliveries to Europe, could renew market tensions and price volatility.In Europe, gas consumption fell by a record 16%, or 55 billion cubic meters (bcm), during the 2022/23 heating season.",
        "The report said that the EU only needs half of the storage injection level seen in summer 2022 to reach its 90% storage target by the start of the 2023/24 heating season.LNG now accounts for two-thirds of Europe's gas imports, meeting around one-third of its gas demand during the 2022/23 heating season. European LNG imports rose by 25%, or 20 bcm during the heating season, with the United States supplying over 45% of incremental supply.But global LNG supply is forecast to increase by just 4% (or over 20 bcm) in 2023, which would not be sufficient to offset the expected reduction in Russia´s piped gas supplies to Europe.Meanwhile, China's LNG imports, which declined by 20% in 2022, enabling higher LNG flows to Europe, recovered in March, supported by higher domestic demand.LNG inflows to China are expected to increase by 10-15% compared with 2022, but will remain below 2021 levels, IEA said.(Reporting by Marwa Rashad; Editing by Sharon Singleton)"
    ]
}