{
    "articleURL": "/wires/reuters/article-12050709/Polish-ruling-party-proposes-bill-unblock-Constitutional-Tribunal.html",
    "content": [
        "WARSAW, May 5 (Reuters) - The number of judges constituting a full court in Poland's Constitutional Tribunal would be cut under a bill published by ruling party lawmakers on Friday, in a bid to overcome a row that threatens to block access to European Union funds.",
        "The court has been split by a dispute over whether the term of its president Julia Przylebska has expired, raising doubts over whether the required 11 judges will attend a key May 30 hearing on the judicial reform the country needs to pass to access EU funds.The bill would reduce the number of judges constituting a full court to nine.\"The proposed law will streamline the work of the Tribunal and enable faster examination cases of key importance - it will ensure the continuity of the court's operation in situations where the gathering of the appropriate number of judges will be difficult or objectively impossible,\" the justification of the bill reads.\"The Act will also prevent any intentional obstruction that may be destructive both from the perspective of the institution itself and the entire Republic of Poland.\"In February Poland's parliament passed legislation the government hopes will unblock billions in EU funds, but President Andrzej Duda said he doubted the constitutionality of changes to the judicial system and he decided to refer them to the Constitutional Tribunal.It is not clear when the bill published on Friday will be debated in parliament and whether the ruling Law and Justice (PiS) party will have a majority to pass it due to differences with its junior coalition partner, Sovereign Poland.",
        "Sovereign Poland is fiercely critical of any concessions to Brussels on the rule of law.In February, the European Commission sued Poland in the EU's top court over violations of EU law by the Constitutional Tribunal. The lawsuit is part of a wider clash over the rule of law, which has resulted in the suspension of EU funds for Warsaw. (Reporting by Anna Wlodarczak-Semczuk and Alan Charlish, Editing by Emelia Sithole-Matarise)"
    ]
}