{
    "articleURL": "/tvshowbiz/article-12049821/Jesinta-Franklin-shows-gifted-4k-designer-outdoor-lounge-new-9m-Gold-Coast-mansion.html",
    "content": [
        "Jesinta Franklin has showed off her new free outdoor lounge set that she has placed in her $9million Gold Coast home.  ",
        "The model, 31, recently bought the glamorous hinterland home with her AFL star husband Buddy Franklin. Last week, she gave her over 300k followers a video tour of their new home and on Friday she posted a photo of her new outdoor couch. The almost $4,000 white lounge set was gifted to Jesinta by MCM House. Posting a photo of the sofa in her back garden to her Instagram story, Jesinta wrote: 'The outdoor lounge of my dreams @mcmhouse #gift'. ",
        "The Franklin's new home was only on the market for six days before they decided to snap it up. It boasts seven bedrooms, eight bathrooms and sweeping views of the city. Last week, Jesinta shared a video of herself setting up a floral display in the stone kitchen, which features a curved island bench, all-black cabinetry and a butler's pantry.The mother-of-two walked through a light-filled hallway featuring floor-to-ceiling arched windows and sheer white curtains, then into the kitchen and living room.",
        "The home features high ceilings throughout, white-washed walls, dark hardwood floors and striking archways.Gold is used for the lights and taps, adding a touch of elegance.'Slow, rainy days,' Jesinta captioned her post showing off her lavish home.Buddy, 35, and Jesinta, 31, fell in love with the extravagant seven-bedroom, eight-bathroom Mediterranean property and recently finalised the purchase. ",
        "The architecturally designed estate features modern touches, including a glamorous terrace and swimming pool, and traditional trappings, such as a stone fireplace.The lavish residence is the perfect place for the couple to raise their two children, Tullulah, two, and Rocky, one.The pair are reportedly selling their luxury pad in Sydney's eastern suburbs to complete their move to the Gold Coast, where Jesinta is originally from.The AFL power couple purchased the prestige property, situated in The Carlisle apartment complex, in 2020 for $5million.",
        "The news fuelled speculation Buddy was considering fleeing Sydney with his family.Franklin left Hawthorn to join Sydney in 2014 on a nine-year deal worth $10million.He re-signed with the Swans for another season earlier this year.According to realestate.com.au, the footy star and Jesinta have been eyeing up properties in Sydney and Queensland for some time."
    ]
}