{
    "articleURL": "/wires/ap/article-12055293/Clark-shoots-63-leads-Schauffele-2-shots-Wells-Fargo.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - Wyndham Clark has never won on the PGA Tour.",
        "He aims to change that Sunday.Clark shot an 8-under 63 at the Wells Fargo Championship on Saturday, giving him a two-shot lead over Xander Schauffele going into the final round. The Denver, Colorado, native is at 16-under 197 for the tournament.Schauffele, the world´s fifth-ranked player, shot 64 at Quail Hollow while playing alongside Clark. He is at 14 under.Adam Scott and third-round co-leader Tyrrell Hatton are tied for third at 11 under, five shots behind Clark. Tommy Fleetwood, Harris English and Sungjae Im are six shots off the pace.Defending champion Max Homa shot 68 and is 8 under for the tournament.",
        "Clark is within striking distance of the tournament´s 72-hole scoring mark (in relation to par) of 21-under 267 set by Rory McIlroy in 2015. That was when Quail Hollow played to a par 72; it is now a par 71.But right now, Clark would gladly settle for his first win on tour.\"I´m excited to see how I handle the pressure,\" Clark said. \"It´s going to be a fun challenge. Obviously it´s going to be tough, I have one of the best players in the world right behind me and a bunch of other good players. I´m just really looking forward to the challenge tomorrow.\"",
        "At one point Saturday, there were 11 players tied for the lead.Then Clark stepped on the course and shot 31 on the front nine and posted birdies on Nos. 13, 14 and 15. He hit his first 17 greens before his approach shot on No 18 landed on the fringe, less than two inches off the green. He needed just 28 putts on Saturday, best in the field.Still, Schauffele wouldn't let Clark pull away.Schauffele put his 260-yard approach shot on No. 15 to within 27 feet to set up an eagle, and then added a birdie on 16 to cut Clark lead to two.He said watching Clark playing so well only inspired him to play better.\"Once these guys out here see someone do it, they just end up doing it,\" Schauffele said. \"Like when it´s really cold and rainy, you feel like, man, I feel like 3 under would be a good score, then someone shoots 7 under and then all of a sudden 3 under is like 30th. So guys are really good out here. Monkey see, monkey do is definitely a thing that happens out here.\"While he has never won, Clark's ascension on the leaderboard doesn't come as a huge surprise given his recent play. He has finished in the top six in three of his last five tournaments and hasn't missed a cut since last October's Shriner's Open.",
        "The closest Wyndham came to winning was in 2020 when he lost to Brian Gay in a playoff at the Bermuda Championship. He said he's a much better golfer now because he's much stronger mentally.Wyndham credits meditation and reading books to improve his mental focus for his improved play.\"I´d say it´s one of the parts of my game that I´ve worked on in the past, but this time I kind of went all in and said, `This is kind of the last straw for me,´\" Wyndham said. \"So I kind of went all in on working on the mental game.\"One of the books he has read is called \"The Energy Bus\" by Jon Gordon.\"It was all about self talk, positive self talk and what that can do to your life and just perspective,\" Wyndham said. \"I had a lot of other books that I´ve read thus far. I mean, really it´s just more of making an effort to put in a lot more time on it and off the golf course.\"Scott, who has won 14 times on the PGA Tour and 11 more on the European tour, knows the pressure Clark is feeling and how winning the first tournament can seem like a daunting task.Scott said the key is to keep your nerves under control.",
        "\"I know that´s easier said than done, but that´s kind of what it felt like,\" Scott said of his own first career win. \"You´ve got to just do the same stuff that got you to that position through three days.\"Brendon Todd was one of the big movers Saturday, shooting a 65 to get to 9 under.McIlroy's bid for a fourth win at Quail Hollow is essentially over after the world's third-ranked player failed to make a move on Saturday, shooting an inconsistent 71 that left him at 1 under for the tournament. McIlroy had previously won the event in 2010, 2015 and 2021.___More AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}