{
    "articleURL": "/wires/ap/article-12048841/Kari-Lakes-lawyers-penalized-failed-election-lawsuit.html",
    "content": [
        "PHOENIX (AP) - Republican Kari Lake´s lawyers were sanctioned $2,000 Thursday by the Arizona Supreme Court in their unsuccessful challenge of her defeat in the governor's race last year to Democrat Katie Hobbs.",
        "In an order, the state´s highest court said Lake´s attorney made \"false factual statements\" that more than 35,000 ballots had been improperly added to the total ballot count. They have 10 days to submit the payment to the court clerk.The court, however, refused to order Lake to pay attorney fees to cover the costs of defending Hobbs and Secretary of State Adrian Fontes, also a Democrat, in Lake´s appeal.Chief Justice Robert Brutinel said Lake´s challenge over signature verification remains unresolved.Hobbs and Fontes said Lake and her attorneys should face sanctions for baselessly claiming that over 35,000 ballots were inserted into the race at a facility where a contractor scanned mail-in ballots to prepare them for county election workers to process and count.When the high court first confronted Lake´s challenge in late March, justices said the evidence doesn´t show that over 35,000 ballots were added to the vote count in Maricopa County, home to more than 60% of the state´s voters.",
        "Lawyers for Hobbs and Fontes told the court that Lake and her lawyers misrepresented evidence and are hurting the elections process by continuing to push baseless claims of election fraud. Attorneys for Fontes asked for the court to order Lake´s lawyers to forfeit any money they might have earned in making the appeal, arguing that they shouldn´t be allowed to benefit from their own misconduct.",
        "Lake´s lawyers said sanctions weren´t appropriate because no one can doubt that Lake honestly believes her race was determined by electoral misconduct.Lake, who lost to Hobbs by just over 17,000 votes, was among the most vocal 2022 Republican candidates promoting former President Donald Trump´s election lies, which she made the centerpiece of her campaign. While most other election deniers around the country conceded after losing their races in November, Lake did not.In her challenge, Lake focused on problems with ballot printers at some polling places in Maricopa County.The defective printers produced ballots that were too light to be read by the on-site tabulators at polling places. Lines backed up in some areas amid the confusion. Lake alleged ballot printer problems were the result of intentional misconduct.County officials say everyone had a chance to vote and all ballots were counted because those affected by the printers were taken to more sophisticated counters at election headquarters.The state Supreme Court declined on March 22 to hear nearly all of Lake´s appeal, saying there was no evidence that 35,000 ballots were added to vote totals.Still, the high court revived Lake's claim that challenged the application of signature verification procedures on early ballots in Maricopa County. The court sent the claim back to a lower-court judge to consider. This latest order will allow a trial court to resume litigating the matter.",
        "In mid-February, the Arizona Court of Appeals rejected Lake´s assertions, concluding she presented no evidence that voters whose ballots were unreadable by tabulators at polling places were not able to vote.Lake´s attorneys said the chain of custody for ballots was broken at an off-site facility where a contractor scans mail-in ballots to prepare them for processing. The lawyers asserted that workers put their own mail-in ballots into the pile rather than returning them through normal channels, and that paperwork documenting ballot transfers was missing. The county disputes the claims."
    ]
}