{
    "articleURL": "/tvshowbiz/article-12044601/Tommy-Little-reveals-truth-relationship-Carrie-Bickmore-amid-dating-rumours.html",
    "content": [
        "Tommy Little has confirmed he is single amid speculation he's dating his radio co-host Carrie Bickmore.",
        "Little, 38, and Bickmore, 42, have co-hosted the Carrie &amp; Tommy show for the Hit Network for years, and are known for their on-air chemistry.Rumours have been circulating that Bickmore has been growing close to Little, who is also single following his break-up with ex-girlfriend Natalie Kyriacou in 2021.But Little has shut down the claims, confirming on 2DAY FM’s Hughesy, Ed &amp; Erin that he is still very much looking for love and even signed up to the celebrity dating app, Raya.On Thursday morning, the comedian told the hosts he's been kicked off all other dating apps because people keep reporting his profile as 'fake'.",
        "'I just can't keep telling the apps that it's me because it's so desperate saying, \"Hey, Tinder, that's actually me,\"' he explained.When Erin questioned Little on whether he was single, he replied: 'Yeah, of course.'In January, Little rushed to Bickmore's side when she confirmed her split from Chris Walker, leading insiders to speculate their friendship could evolve into something more.In recent months, Little has shared several gushing tributes to Bickmore on Instagram, and in one post called her the 'best in the business' who 'lifts up everyone around her and makes them look good'.",
        "Ahead of her last day on The Project last November, Little treated her to a private helicopter ride across Melbourne.",
        "He is often seen close to her at glitzy events, including the 2022 Australian Commercial Radio Awards (ACRAs) last October, where he didn't leave her side even as guests got up from their tables and mingled with others. The duo are regularly seen posing for cosy selfies on social media, which has prompted curious fans to question whether romance is on the cards. 'You guys make a lovely couple,' one recently commented on a photo of the pair.",
        "'Get a room already, you two,' another said.It's not hard to see why fans are hoping for love to blossom, as Little and Bickmore are already known for their electric chemistry.Their professional relationship began in 2016 when Little joined Bickmore on the panel of The Project.A year later, the pair began co-hosting Hit Network's Melbourne drive show in 2017, and immediately gained a cult following thanks to their entertaining and organic banter.",
        "In November 2022, it was confirmed the show had been renewed for another four years. Bickmore announced her split from her longtime partner Walker in January this year via Instagram, saying the pair are focused on co-parenting their three children.Almost a year earlier, in February 2021, it was reported that Little had split from his ex, social media manager Natalie.",
        "At the time, the couple vanished from each other's social media feeds and he was spotted on dating app Tinder.",
        " "
    ]
}