{
    "articleURL": "/money/investing/article-12037999/SMALL-CAP-IDEAS-Creo-Medical-powers-profitability.html",
    "content": [
        "'We know what we've got to do.' These are the words of Creo Medical chief executive Craig Gulliford following what he described as the Wales-based medical device company’s final fundraising round. ",
        "'We know how to get people to use the current products that we've got [and] we know what the outlook looks like for the products.'Creo Medical, armed with its host of minimally invasive surgical devices and an already-established European distribution network, turned heads in February as it pulled in £33.7million through a significantly oversubscribed share placement. ",
        "It had aimed to raise £25million, as it eyed the road to cash flow breakeven and profitability by 2025. 'There's a lot of businesses in med-tech and life sciences that fail well before [they] get to this point in time,' Gulliford explained. '[This is] often because lack of access to the capital needed to get through the regulatory landscape.'Having successfully navigated the stringent regulatory landscape to get its devices approved, not to mention the added challenges of the pandemic followed by global economic challenges, Creo is ready to kick on commercially. And of course, the financial headwinds are dying down as it invests less in research and development. Creo was set up in 2010 after a chance meeting in Bath between postgraduate housemates Craig Gulliford and Chris Hancock, the company’s founder and chief technology officer. ",
        "Now reacquainted, the pair set their sights on commercializing Hancock's invention - a range of products that use both radiofrequency to shrink growths and microwaves to stem bleeding. ",
        "This technology offers clinicians new tools for minimally invasive surgery in the fields of gastroenterology, interventional pulmonology and soft tissue ablation. Essentially, this means the diagnosis and treatment of diseases around the bowel area, the lung region and in soft tissue, using heat to minimise damage caused by surgery. Creo’s instruments can be used to treat early-stage or pre-cancerous growths, known as polyps, for instance, simplifying the process to do so and are the result of years’ worth of study by founder Hancock. Unlike rivalling endoscopic devices, Creo’s patented system can earth the flow of electricity used to cut tissue, preventing the need for currents to be passed through patients. What sets Creo apart though, is the vast amount of time and resources its products can save hospitals, given the technology’s yet-to-be-matched sophistication. 'The difference is night and day,' Gulliford commented. When a patient is treated with Creo’s technology, they may have an endoscopic procedure lasting up to an hour and a half and be home within 24 hours, Gulliford explained. 'The alternative would have been with those patients, three or four hours of surgery in the operating theatre, with probably three to four days in hospital', he said.According to Creo, the use of its flagship Speedboat Inject device could save the NHS £5,000 per procedure, since the method is quicker and less damaging than conventional surgery. ",
        "This in turn means less strain on bed space and operating theatres. Over 1,000 procedures have already been carried out using Creo’s Speedboat Inject - a tube-like device able to film, cut and reseal wounds, used for internal procedures called endoscopy. Speedboat is already enjoying 'increased adoption,' analysts at the research house Edison said in early April, adding commercialisation of this and other core products will be key financially for Creo as it targets that 2025 break-even landmark. Creo’s acquisition of distributor Albyn Medical in 2020 has provided it with an already-functioning distribution network in Europe. Fifteen months on from the initial purchase, Albyn is now fully integrated with Creo, Gulliford confirmed. Trials and regulatory scrutiny of Creo’s other products continue, meanwhile, including its MicroBlate Flex device for ablating tissue, which will be tested in humans in the coming months. These and other products from Creo boast the company’s patented ‘Kampative’ technology, incorporating radiofrequency and microwaves using its CROMA Advance Energy platform. Creo, given it is already equipped with this solid portfolio of devices and a means to sell them, ultimately rests its future success on attracting clinicians to its training platform. Over 80 clinicians were confirmed to have adopted Creo’s products by January, up from 20 in December 2021, with 450 having gone through its training programme last year. ",
        "'We've got the fundamental training centres up and running globally,' Gulliford said.'The next step now is to scale the funnel to increase […] regionalised mentoring and practice., he added.Combined, clinicians have performed 1,500 operations using Creo’s devices. The additional funds secured in February will help fund further training and drive market adoption. Creo has already been selling a range of products made by Albyn with the acquisition upping the parent company’s sales and marketing presence tenfold, Edison calculated. Gulliford said this lower-margin Albyn range 'sits nicely' alongside its ‘tier-one’ advanced energy products, also effectively ensuring exposure to a wider range of markets. Given the largely untouched field that Creo’s products are looking to break into, offering a new type of surgery following open and then keyhole, its peer group is relatively small.'When you think about the actual technology of putting advanced energy into instruments of this type, you see very, very little in the way of that level of innovation coming into this space,' Gulliford said. Though Gulliford named Microtech and Boston Scientific among its closest rivals, he says the actual sophistication and compact nature of Creo’s technology is yet to be truly matched. So, armed with its thus-far unrivalled products, the comfort of not having to splash out on further research and a hefty roll of cash in the back pocket, Creo is now on the journey to profitability – and with the destination in sight. ",
        "'We don't need to go out and invent anything or prove anything,' Gulliford reiterated. He added: 'We’ve just got to continue grinding and doing our work.'Creo Medical shares currently trade at 24.5p.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}