{
    "articleURL": "/news/article-12046671/Nearly-HALF-Americans-worried-safety-money-bank-turmoil.html",
    "content": [
        "A poll shows 48 percent of people are either moderately or very worried about the cash they keep in banksThe findings were published on Thursday as shares in PacWest Bank tanked following the collapses of First Republic and Silicon Valley BankMore people are worried about their deposits than during the financial crash of 2008 and Republicans are more concerned than Democrats, the poll foundNearly half of Americans are worried about the safety of their bank deposits following turmoil in the industry that's led two institutions to collapse and left others teetering on the bring.",
        "A poll shows 48 percent of people are either moderately or very worried about the cash they keep in banks - a higher proportion than during the financial crisis of 2008.The findings, from leading polling firm Gallup, were published on Thursday as shares in another bank tanked following the collapses of First Republic on Monday and Silicon Valley Bank in March.Shares in PacWest, the Beverly Hills, California-based bank, fell by 50 percent in after hours trading as it revealed rescue talks are underway to try and prevent total failure.Gallup's poll of 1,013 adults, conducted between April 3 and April 25, found 19 percent of Americans are 'very worried' about their deposits, while 29 percent are 'moderately worried'.",
        "Nearly a third (30 percent) said they are 'not too worried' and one in five said they are 'not worried at all'.The results also indicate Republicans are more concerned than Democrats. The opposite was true during the crash of 2008, when George W. Bush was president and Republicans had more confidence in the system than their counterparts.In a conclusion of the findings, Gallup's report said: 'After several recent high-profile bank failures in the U.S., about half of Americans are concerned about the safety of the money they have in banks or other financial institutions.",
        "'This is on par with the level of worry measured during the financial crisis in 2008 when financial institutions previously believed to be “too big to fail” collapsed.'PacWest has hired Piper Sandler, the investment bank, to help find a solution to its crisis. The bank is looking at 'all options to maximize shareholder value', which could include a sale to another institution.Shares in PacWest were $3.83 in after hours trading on Thursday, compared with $6.43 when the market closed.",
        "On March 1, before the current industry crisis took hold, the bank's stock was trading at $27.99 a share.PacWest's woes are closely linked to those which triggered the downfall of Silicon Valley Bank. It is exposed to the turbulent tech sector, holds large amounts of uninsured deposits and has investments that have lost value due to rising interest rates.A further breakdown of Gallup's findings shows 54 percent of Republican voters are now moderately or very worried about their deposits. For Democrats, the figure is 36%In September 2008, shortly after the collapse of Lehman Brothers contributed to the global financial crisis, 45 percent of US adults said they were very or moderately worried about the safety of their money.At that time, 34 percent of Republicans were worried about the safety of their deposits, compared to 55 percent of Democrats."
    ]
}