{
    "articleURL": "/wires/pa/article-12052587/Dundee-promoted-epic-eight-goal-title-decider-against-Queen-s-Park.html",
    "content": [
        "Dundee secured their return to the cinch Premiership with a 5-3 win over nearest challengers Queen’s Park in a breathless Championship decider at Ochilview.",
        "A point would have been enough for the Dens Park side to claim automatic promotion but they ended their campaign on a high as second-half strikes from Lyall Cameron and Luke McCowan killed off the challenge of the brave Spiders following an astonishing first half in which six goals were shared.Both sides went into the much-hyped showdown in unconvincing form, with Queen’s – aiming to get back into the top flight for the first time since 1958 – having lost four of their previous six matches and Dundee on a run of one win in five.Any notion that a lack of confidence within both sides allied to the pressure of the occasion might lead to a cagey affair was emphatically banished by an incredible start that brought four goals within the opening 17 minutes.Dundee signalled their intent in the third minute when Cameron shot just wide after being teed up by Alex Jakubiak on the edge of the box.The same players combined just a minute later as the visitors took the lead when Cameron took advantage of a slip by Malachi Boateng inside the box and cut the ball back for Jakubiak to slot home from eight yards out.",
        "The hosts tried to find a response and Dominic Thomas saw an inswinging free-kick from the right pushed behind by goalkeeper Adam Legzdins in the ninth minute.",
        "The resulting corner led to an equaliser as centre-back Charlie Fox seized on a bouncing ball 25 yards out and unleashed a sensational dipping half volley that looped over Legzdins and into the net.And Queen’s edged themselves ahead in the 12th minute when Connor Shields fired home a superb angled volley from the edge of the six-yard box after Grant Savoury’s shot had been blocked.The frenetic start continued as Dundee levelled things up once more in the 17th minute when defender Lee Ashcroft volleyed in from six yards after Dan Sweeney headed McCowan’s cross back across goal.The visitors almost struck again five minutes later when Barry Maguire crashed a shot off the crossbar.Dundee restored their lead in the 34th minute when Zach Robinson forced the ball home from close range after Queen’s made a mess of trying to clear a Jakubiak ball across the box.The first-half scoring was not finished, however, and Spiders defender Fox netted his second of the night in stoppage time when he powered home a header from another Thomas corner to make it 3-3.Queen’s went close to taking the lead three minutes after the interval when Shields’ shot from just inside the box was brilliantly tipped behind by Legzdins.But it was Dundee who took control of the title race in the 54th minute when Cameron kept his cool to tuck home a low shot from 15 yards out after good work by McCowan and Jakubiak to create the opening.",
        "McCowan then sealed the deal in the 81st minute when he curled in a superb shot from just outside the box to consign Queen’s to the play-offs. The final whistle was greeted by a pitch invasion from jubilant Dundee fans."
    ]
}