{
    "articleURL": "/news/article-12055711/Australia-Weather-Coldest-weekend-year-temperatures-hit-NSW-Victoria-South-Australia.html",
    "content": [
        "Cold weekend for south-eastern AustraliaNSW, Victoria, ACT and Tasmania affectedHigh winds along NSW coast to come Australians are shivering through the coldest weekend of the year with snow, rain, hail and strong winds pegging temperatures up to eight degrees below average.",
        "Melbourne, Sydney, Canberra, Adelaide and Hobart were in the grips of a cold front on Saturday and Sunday, with temperatures struggling to get past 14 degrees anywhere in the south-east.In some places the mercury was much lower with freezing conditions felt right across the country. Severe weather warnings have been issued across NSW with wind gusts possibly reaching speeds of up to 90km/h and waves reaching six metres later on Sunday. ",
        "Central Tasmania was one of the coldest areas, with minus 6C recorded at Liawenee and Ouse. A thousand kilometres north, the same giant cold front saw Alpine areas including Mount Hotham, Thredbo and Falls Creek hover around minus 5C.Both those areas, hills around Canberra and parts of inland southern New South Wales, saw light snowfalls.Canberra also had heavy rain and hail, while snow fell south at Bombala, Cooma and Nimmitabel.The heaviest snow in the south-east came in eastern Victoria at Mount Donna Buang, two hours east of Melbourne. It copped 15cm of snow on Saturday.The wintry weather continued through Sunday, with snow falling more widely across the region.Bureau of Meteorology senior meteorologist Dean Narramore said the snow extended from Victoria to Canberra and beyond.'We're looking at snow from alpine areas of Victoria up through the Snowy Mountains and throughout higher terrain around Canberra, possibly up to the central tablelands,' he said.",
        "'Today and tomorrow much of south eastern Australia is looking at temperatures four to eight degrees below average.'Most of the south-east saw only occasional showers, but Melbourne had more persistent rain with falls of between 20 and 25 millimetres around the city, Surrey Hills and Preston.East Gippsland saw slightly more rain with around 30mm recorded. Hopes for a warmer change were dashed with the weather office warning of 'damaging winds', which will keep the weather feeling wintry.",
        "Mr Narramore, said to expect 'treacherous' seas right along the central-to-southern NSW coast, from the Central Coast south.'When it's windy the air takes all the heat from the body that’s why it feels colder than it is,' he said.Wollongong and the Illawarra region will be blasted by wind gusts of up to 90 kilometres an hour, he said.The affected areas will include Wollongong, Bulli, Port Kembla, Albion Park, Kiama and Huskisson.Further north gusty winds will make the beach or on the sea similarly unpleasant.'Much of southern central NSW coast will be windy tonight and tomorrow with winds between 50 to 70km an hour,' Mr Narramore.'There are warnings out for hazardous and damaging surf for much of the NSW coast,' he said.'That means dangerous conditions for fishing, boaties and swimmers, it's gonna be bad: windy cold with big seas and big swells.'",
        "Mr Narramore said wave heights will reach up to six metres at times.Brisbane and south east Queensland was out of reach of the cold snap and warm on Saturday, but that won't last.Mr Narramore said the cool air will reach Brisbane on Monday.Even in the west cooler weather is expected.A cold front is expected to bring showers, rain storms and strong winds to southern parts of WA from Wednesday.That will see showers over a huge part of the state, from Geraldton to Margaret River.",
        "PERTH Sunday: Max 24. Shower or two.Monday: Min 15, Max 25. Possible shower.Tuesday: Min 15, Max 25. Showers increasing.Wednesday:  Min 15, Max 21. Showers.Thursday: Min 8, Max 19. Partly cloudy. ADELAIDESunday: Max 24. Possible shower.Monday: Min 8, Max 17. Shower or two.Tuesday: Min 15, Max 25. Showers increasing.Wednesday:  Min 15, Max 21. Showers.Thursday: Min 8, Max 19. Partly cloudy. MELBOURNESunday: Max 24. Shower or two.Monday: Min 15, Max 25. Possible shower.Tuesday: Min 9, Max 19. Shower or two.Wednesday:  Min 9, Max 19. Partly cloudy.Thursday: Min 10, Max 21. Mostly sunny. HOBARTSunday: Max 12. Possible shower.Monday: Min 3, Max 15. Shower or two.Tuesday: Min 8, Max 15. Shower or two.Wednesday:  Min 7, Max 15. Cloudy.Thursday: Min 6, Max 16. Mostly sunny. CANBERRASunday: Max 9. Rain.Monday: Min -1, Max 13. Frost, mostly sunny.Tuesday: Min -1, Max 15. Frost, partly cloudy.Wednesday:  Min 0, Max 16. Sunny.Thursday: Min 1, Max 16. Partly cloudy. SYDNEYSunday: Max 17. Shower or two.Monday: Min 9, Max 18. Shower or two, windy.Tuesday: Min 10, Max 20. Mostly sunny.Wednesday:  Min 10, Max 20. Possible shower.Thursday: Min11, Max 21. Shower or two. BRISBANESunday: Max 26. Shower or two.Monday: Min 10, Max 22. Sunny.Tuesday: Min 7, Max 23. Sunny.Wednesday:  Min 11, Max 24. Mostly sunny.Thursday: Min 13, Max 23. Shower or two. DARWINSunday: Max 33. Sunny.Monday: Min 24, Max 34. Sunny.Tuesday: Min 24, Max 34. Mostly sunny.Wednesday:  Min 22, Max 33. Sunny.Thursday: Min 22, Max 33. Sunny. Source: Bureau of Meteorology"
    ]
}