{
    "articleURL": "/tvshowbiz/article-12060003/Lionel-Richie-says-wont-plastic-surgery-uses-SEX-stay-young.html",
    "content": [
        "The coronation crooner spoke to DailyMail.com about his anti-aging routine He claimed he will never go under the knife because he prefers a natural look Lionel, who is in a long-term relationship with Lisa Parigi, shared how he maintains his appearance by avoiding too much red meat and having sex Lionel Richie's coronation performance stirred up quite the controversy after he was blasted as 'disappointing' by viewers of King Charles' celebratory concert on Sunday - but now the famed crooner is set to spark serious debate for a very different reason entirely: his stance on anti-aging techniques. ",
        "The 73-year-old singer has managed to maintain the same youthful appearance for many years now - but despite the pressure stars face to stay young, Lionel insists you will never catch him going under the knife in an attempt to preserve his looks. Speaking to DailyMail.com, the father-of-three revealed why he won't ever go down the same surgical route as many of his Hollywood contemporaries, explaining that he would hate not being able to return to his natural appearance after getting plastic surgery. '[Plastic surgery] locks you in for that year [while you recover] - and after that you can't go naturally, you're staying right there... You try and go back to reset, and you can't,' he said, adding: '[And] that s*** goes wrong!'",
        "And there's one other very important reason why the All Night Long singer wants to avoid undergoing an aesthetic procedure: 'God might not recognize me, so I want to make sure he knows me.' Instead of surgery, Lionel - who has been in a relationship with Swiss-Caribbean model Lisa Parigi for more than a decade - said he prefers to focus on a much more natural approach to anti-aging, combining traditional methods like plenty of sleep and lots of water with another rather more risque activity: sex. ",
        "'Water, sleep, and sweat, not too much red meat,' he said when asked how he takes care of himself at the eighth annual Hollywood Beauty Awards. 'I know it's real boring. [Sex] will work also and it's good for your heart.' Lionel's seemingly ageless appearance became the source of much interest once again this past weekend after he performed alongside the likes of Katy Perry and British boyband Take That at a Sunday night concert held to celebrate the coronation of King Charles.  The performance sparked a slew of debate online after critics spoke out to blast what they viewed as a 'ropey' and 'awful' performance at Windsor Castle. However social media users also took notice of his on-stage appearance for a very different reason, calling attention to how young Lionel still looks after more than five decades in the spotlight. 'How is Lionel 73, he looks so young?' one person questioned on Twitter, while another joked: 'He's been dancing on the ceiling since the 80s gravity in reverse.' Another user suggested: 'A lot of surgery.' ",
        "While Lionel might have eschewed all surgery, there are plenty of male celebrities who have opted to go under the knife - or turned to injectables like Botox - in order to maintain their looks over the years. ",
        "One such person is Simon Cowell, who previously served as a judge on American Idol, the talent show that Lionel now helps to helm alongside his coronation co-star Katy. Simon, 63, has opened up in April 2022 about his regrets over taking his obsession with injectables too far, telling The Sun that he was left 'unrecognizable' and like 'something out of a horror show'. 'There was a phase where everyone was having their faces pumped full of this and the other,' he said, adding that his drastically changing looks had even left his young son Eric breaking down in tears. 'I saw a picture of me from \"before\" the other day and didn't recognize it as me first of all.'",
        "At the time, the America's Got Talent star, who shares his son with partner Lauren Silverman, 45, revealed that he no longer had any filler in his face, adding, 'Eric was in hysterics. Enough was enough.' But Simon is far from the only high-profile star to take their love of aesthetic procedures too far. Actor and boxer Mickey Rourke, 70, has also come under fire over the years for what critics perceive to be an excess of plastic surgery - however he insists that the only reason he's had work done to his face was in order to fix injuries from his boxing days. ",
        "In 2009, he told DailyMail.com that he'd already had six surgeries, but he insisted that he only started going under the knife to repair an injury. 'Most of it was to mend the mess of my face because of the boxing, but I went to the wrong guy to put my face back together,' he said.'I had my nose broken twice. I had five operations on my nose and one on a smashed cheekbone.'"
    ]
}