{
    "articleURL": "/money/markets/article-12054095/Investors-owed-2m-Bollywood-bond-deal-drama.html",
    "content": [
        "A row over a bond deal offered by one of India's biggest Bollywood film groups has escalated after it failed to pay UK investors more than £2million of interest the business owed to them.",
        "Eros has also admitted that the complex restructuring of a £50million bond issue has been hit by delays.Bondholders are up in arms after the Indian firm – run by the ultra-wealthy Lulla family, one of the country's best-known business dynasties – has repeatedly missed payment deadlines, citing problems sending money to the UK. The group also revealed that negotiations are ongoing with the Bank of India and other organisations about debts it owes elsewhere.Eros launched a £50million bond on the Stock Exchange in 2014.The Lullas restructured the deal in 2021 and, in March of this year, asked bondholders if they could do the same again, offering to buy up to half the bonds back at 60p in the pound, hiking annual interest from 8.5 per cent to 9 per cent and postponing repayment of the bonds from April of this year to 2026.Bondholders agreed to the new terms under which they stand to receive up to £15million.But they have yet to discover how many bonds Eros will buy back and when they will receive their cash. An initial deadline of April 12 has been and gone, a second deadline of April 28 has also been missed and investors now fear that, even though the company has promised to pay bondholders by May 15, that deadline will not be met either.",
        "Many have been calling on the trustee, M&amp;G, for answers, as the investment firm's role involves liaising between investors and the Indian business and ensuring that communication between the two sides is 'effective and efficient'.The firm, which took up the trusteeship last month, is understood to be in talks with Eros.The Financial Conduct Authority (FCA) has also come under fire.Some believe Eros should never have been allowed to list its bonds here in the first place.The FCA would not comment on the Eros bond, but it is aware of the issues raised by investors and may investigate the issue if it believes rules have been broken. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}