{
    "articleURL": "/sport/formulaone/article-12046365/F1-fans-react-Fernando-Alonsos-rumoured-girlfriend-Taylor-Swift-linked-Matty-Healy.html",
    "content": [
        "F1 fans have reacted to the latest Taylor Swift news The American was linked with F1 star Fernando Alonso However, it appears she is now dating Matty Healy Devastated Fernando Alonso fans have taken to Twitter after his rumoured girlfriend Taylor Swift was linked with English musician Matty Healy.",
        "This week, rumours were rife that the Formula One star was the American singer's new beau after she split up with long-term partner Joe Alwyn. The Spaniard did little to dispel the rumours and played along, much to the delight of fans on social media.He posted a TikTok of himself listening to her music and avoided questions about their rumoured relationship, while Sky F1 pundits eagerly dropped Swift-related puns throughout their coverage of the Azerbaijan Grand Prix.However, any hope of seeing Swift in the Aston Martin garage this season have been quashed after reports emerged claiming that the 33-year-old is set to go public with Healy, frontman of The 1975. Unsurprisingly, fans of the 41-year-old have not taken the news well, and posted their disappointment on Twitter.",
        "'Taylor Swift and Matty Healy are dating???' one fan posted. 'Fernando Alonso must be so sad...'Another said: 'Wait wait... Taylor Swift and Matty Healy are dating? Wasn't there rumours about Taylor and Fernando Alonso just less than 24 hours ago' alongside a crying emoji. A third fan posted: 'I JUST FELL ON MY KNEES.''I refuse and I refuse to allow and accept Taylor Swift dating anyone other than Fernando Alonso,' a fourth fan said.Healy is not the first Brit to date Swift, with the American pop star also enjoying romances with Harry Styles, Tom Hiddleston and Calvin Harris. ",
        "Swift is said to be 'madly in love' with Healy - who is the son of Loose Women star Denise Welch and Benidorm actor, Tim Healy. An insider told The Sun: 'She and Matty are madly in love.'It's super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out.'The source went on to insist that there was no crossover in Swift's love life, despite news of her split from Joe emerging last month, insisting that the pair actually broke up in February.Swift is currently in the middle of the US leg of her The Eras Tour while The 1975 are on their At Their Very Best concert tour, but the source insisted they have kept in constant communication by texting and Face Timing.",
        "The source added: 'As two international megastars, they understand the pressures of one another’s jobs better than anyone, and are incredibly supportive of their respective careers.'They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.'Taylor just wants to live her life, and be happy. She’s told pals Matty is flying to Nashville over the weekend to support her on the next leg of her tour.'"
    ]
}