{
    "articleURL": "/tvshowbiz/article-12041223/What-music-star-Jamal-Edwards-cause-death.html",
    "content": [
        "Jamal Edwards sadly passed away on February 20 2022 leaving his friends and family - including his Loose Women star mother Brenda - devastated. ",
        "An inquest in August that year revealed died from a cardiac arrest after a late night cocaine and drinking session.On the night he became paranoid and began throwing objects around the room before falling unconscious.Three small snap bags containing the remnants of white powder were found on the 31-year-old after he collapsed at his west London home.At the inquest assistant West London Coroner Ivor Collett ruled that Jamal died after a cardiac arrest brought on by taking cocaine and drinking alcohol. Jamal was close friends with the singer Ed Sheeran who spoke about the grief he felt at his loss on his Disney+ documentary which was released on Wednesday. ",
        "His heartbroken mother, Brenda, described him as 'a beautiful and selfless person' in a statement read to the inquest. Earlier that year she said she wanted his death to 'help drive more conversation about the unpredictability of recreational drugs'.The DJ and founder of online R&amp;B/Hip-Hop platform SB.TV had returned to his home in Acton after 4am after playing a set in north London before he sat up drinking with a friend, Nick Hopper, who was living in an annex of the house. Mr Hopper said that 'he appeared to be his normal self' and they 'began to chat, smoke some weed and drink' - but his famous friend then spoke about the pressure he was under.",
        "After a while Mr Edwards became erratic and paranoid and began throwing objects around the room before collapsing, the inquest was told. Despite the best efforts of Mr Hopper and later his uncle, Rodney Artman, as well as paramedics, Mr Edwards did not wake up and was declared dead at 10.36am on Sunday February 20.",
        "Mr Hopper said in a statement read to the inquest by the coroner: 'When he came in he appeared to be his normal self and it appeared that he had just been out.'We began to chat, smoke some weed and drink. He told me he was under a lot of pressure. There were periods of talking followed by silences.'Over time Jamal became quite paranoid and was saying I had things in my hands when I didn't. Anytime I moved he began panicking. I told him to calm down, but he became increasingly irate.'He was grabbing things, throwing them around the room. He was panicking and sweating, I spent ages trying to get him to open the door.'Mr Hopper said that he kept trying to open a window, but Mr Edwards wouldn't let him and he eventually collapsed unconscious by the bathroom door.After 9.30am Mr Edwards's uncle arrived and he said he performed CPR for about 10 minutes until paramedics arrived and took over, but they were unable to resuscitate them.",
        "The inquest heard that police treated the death as non-suspicious, but found three small snap bags with the remnants of white powder in Mr Edwards's pocket.Toxicology tests found cocaine and alcohol in his system, but no cannabis.There was also MDMA in Mr Edwards' urine but not blood, indicating that he had taken the drug recently - but not on the night of his death.In a statement, Met Police Detective Sergeant Luke Taylor said: 'There were no signs of trauma to either party.'Three small snap bags were found in his pocket with remnants of a white powder and bloody tissues, associated with the taking of Class A drugs.'He suffered a cardiac episode from taking recreational drugs and alcohol.'Mr Edwards's GP confirmed that while he had traits of sickle cell disease, he was not on any regular medication.Summing up at West London Coroner's Court, Mr Collett said: 'He had worked as a DJ at a venue in Islington.'At around 4.30am he arrived at home and joined his close friend.'They had some drinks and had arranged to smoke cannabis. Although he appeared normal at first his behaviour changed and he exhibited signs of anxiety, paranoia and irritation.'Despite his friend's efforts to calm him down he began throwing things around the room before collapsing on the floor.",
        "'The police found drug paraphernalia, the toxicology tests found recent evidence of drug use.'The insinuation is that Jamal had taken cocaine in sufficient quantity to cause an adverse reaction brought about by cocaine toxicity. This then caused cardiac arrhythmia which resulted in his death.'Mr Edwards was awarded an MBE in 2014 for his services to music and he was an ambassador for the Prince's Trust.In a statement read to the hearing, Brenda Edwards said: 'Jamal was a beautiful and selfless person.'Since growing up with his family in Acton he made it his personal mission to open doors for others to walk through.'To help people through life, to love and to laugh. And most importantly, to just make people happy.'She added: 'Jamal helped so many, working tirelessly to give a platform to people.'His charitable work stretched near and far, from working at homeless shelters to giving back to his roots in St Vincent and the Grenadines.'We are so proud of everything Jamal achieved over the course of his 31 years and how he impacted others' lives. We miss him so much.'In March Ed Sheeran revealed that he faced suicidal thoughts after the death of his best friend Jamal.Ed, 32, detailed feeling like he was 'drowning', when another close friend, Australian cricketer Shane Warne passed away the following month.",
        "In a raw interview with Rolling Stone, the singer explained he felt shame around his suicidal thoughts as they seemed 'selfish'. Meanwhile in the same chat, Ed also admitted that he'd developed an eating disorder as he compared himself to other pop stars including Justin Bieber. Speaking about his depression, he said in the interview: 'My best friend died. And he shouldn't have done.'I've always had real lows in my life. But it wasn't really till last year that I actually addressed it.'I felt like I didn't want to live anymore. And I have had that throughout my life.… You're under the waves drowning. You're just sort of in this thing. And you can't get out of it.'Ed added being depressed seemed 'selfish, especially as a father. I feel really embarrassed about it.'With the aid of his wife Cherry Seaborn who told him to seek help, Ed started seeing a therapist.He explained: 'No one really talks about their feelings where I come from. People think it's weird getting a therapist in England.... I think it's very helpful to be able to speak with someone and just vent and not feel guilty about venting.'",
        "He continued: 'The help isn't a button that is pressed, where you're automatically OK. It is something that will always be there and just has to be managed.'",
        "He also vowed never to take drugs again as it would be 'disrespectful' to late pal Jamal's memory.And after opening up how Jamal's death affected him and detailing the extent of his own past drug use in the candid interview with Rolling Stone magazine, the singer told how he would 'never touch anything again.'He said: 'I would never, ever, ever touch anything again, because that's how Jamal died.'And that's just disrespectful to his memory to even, like, go near.'",
        "Jamal was 15 when his mother Brenda bought him extra special Christmas present – a £200 video camera. YouTube had just been launched and Jamal, who like most teenagers spent hours in his bedroom online, decided to upload some footage of foxes in his back garden. 'I thought I was Steve Irwin,' he said in an interview with MailOnline.",
        "But when the footage got 1,000 views, he realised he was on to something. He went out on to the estate and made some clips of his friends, most of whom were into grime – the music style now defined by stars such as Dizzee Rascal and Skepta. 'Back then, there was no place to showcase our sort of spitting and rapping, so I thought, OK, I want to create that platform,' he said. He took his own rap moniker 'Smokey Barz' to coin his brand name and SBTV was born.Jamal began his Topman career as a shop assistant but at the same time started hanging out at the BBC, sneaking into raves and messaging record labels to beg for interview time with their artists. His big break came three years later when he secured his first non-grime interview with Kelly Rowland.From that, Bruno Mars, Nicki Minaj, Trey Songz and countless other A-listers followed. In 2011, he was invited to 10 Downing Street to interview the prime minister after being appointed a Spirit of London Awards ambassador.Jamal was still hands-on with both filming and editing at SBTV, and had big plans to expand the brand into sport, comedy and fashion. Away from work his great passion was Chelsea FC. "
    ]
}