{
    "articleURL": "/wires/aap/article-12057681/Latrell-test-awaits-boom-Wests-Tigers-rookie-Bula.html",
    "content": [
        "Breakout Wests Tigers fullback Jahream Bula is itching for the most significant test of his young career to date: The chance to come up against South Sydney danger man Latrell Mitchell.",
        "Bula has been nothing short of revelatory for the struggling Tigers, who went through three other fullback options this season before settling on the 21-year-old late last month.His ascent into first-grade has coincided with the Tigers' spike in form; Wests threatened to upset Manly in Bula's first game on April 23 and won his next two against Penrith and St George Illawarra to put an 0-7 start to the season behind them.In both of those wins, the one-time high-school basketball star made try-saving tackles that were crucial to denying the Tigers' rivals at the death.At Penrith, he knocked the ball out of State of Origin representative Nathan Cleary's hands in wet conditions, while against the Dragons he slid over in cover defence to stop Moses Suli and Mikaele Ravalawa in the corner.A graduate of esteemed rugby league nursery Keebra Park High School on the Gold Coast, Bula joined the Tigers' Jersey Flegg team last year.He admitted he was surprised at his sudden rise to the big league, which followed a brief stint with Western Suburbs in the NSW Cup.\"I'm having so much fun. The boys make me feel welcome,\" he said.\"Only three games in Cup, I never thought I'd be here in this moment.\"",
        "The Tigers travel to South Sydney on Saturday, and Bula's opposite man in that clash will provide him with another early test of his NRL credentials.Mitchell was at his electrifying best in the Rabbitohs' Magic Round defeat of Melbourne, setting up two tries with his boot to seal a fifth-straight win for South Sydney.Bula is only too aware of Mitchell's capabilities, having grown up idolising the Rabbitohs player's predecessor Greg Inglis - a man to whom South Sydney's No.1 is frequently compared.\"They're two similar players,\" Bula said. \"I'm ready for the challenge. This is what I've trained my whole life for.\"Especially (against) a guy with his physicality and skill. It'll be good.\"The last few games he's been playing amazing.\""
    ]
}