{
    "articleURL": "/femail/article-12055093/Sarah-Ferguson-offers-sincerest-congratulations-King-Queen.html",
    "content": [
        "Sarah Ferguson has offered her 'sincerest congratulations to Their Majesties'READ MORE:  Sarah Ferguson shares stories of the late-Queen’s grieving corgisSarah Ferguson has congratulated the newly crowned King and Queen on social media - after missing out on an invite to today's historic event.",
        "The Duchess of York, commonly known as Fergie, marked the moment on Instagram, sharing a sweet snap of the royal couple from the day's celebrations. She posted a picture of King Charles and Queen Camilla waving at royal fans as they left Westminster Abbey with a short and sweet message of congratulations. Meanwhile, Sarah's two daughters, Princess Beatrice, 34, and Princess Eugenie, 33, were invited to the event, and attended with their respective husbands Edo Mapelli Mozzi and Jack Brooksbank. Sarah's ex-husband Prince Andrew was also present at the ceremony, though he held no official role in King Charles' coronation. ",
        "'Sincerest congratulations to Their Majesties, the King and Queen,' Sarah wrote in an Instagram post shared today. Her daughters made a glamourous entrance as they arrived at today's ceremony,  with her eldest wearing a pair of ornate £37,000 earrings for the occasion. The royal, 34, lit up the room in a hot pink gown from Beulah, worth £695. The belted ensemble accentuated King Charles III's niece's figure for an elegant and stylish display. Garrard's pricey Blaze Pink Sapphire, Rubellite and Pink Opal Hoop Earrings made the perfect complement to her look, as did the subtly peachy smokey eye of her make-up.Beatrice wore her auburn tresses down in elegant waves and toned the magenta tones down with a chunky bronze headband and beige-hued clutch.",
        "Meanwhile Princess Eugenie showed off her baby bump in an all-navy ensemble as she joined her family in London for the historic festivities.Yesterday Sarah revealed how she has been celebrating King Charles III’s coronation - after she missed out on an invite to the historic event.The Duchess of York, 63, shared adorable photos to her Instagram and Twitter accounts showcasing the 'tea fit for a King' that she assembled for the residents at the Manor Care Home in Windsor 'to help them celebrate'. ",
        "In one of the images, a corgi could be seen sitting at the table, with a delicious looking cake in front of him. It's thought the pet could be one of the late Queen Elizabeth II's two surviving corgis, Muick and Sandy.Sarah, alongside her ex-husband Prince Andrew, care for the two beloved dogs following the Queen's death.In April, the Duchess broke her silence on her Coronation snub, telling ITV's Good Morning Britain that she was not offended, citing her divorce from the Duke of York. Next to the set of five adorable snaps of her 'tea fit for a King', she wrote: ‘I hope you have got the bunting out ready for the Coronation tomorrow. I certainly have.‘Today I assembled a tea fit for a King which I shared with the residents at the Manor Care Home in Windsor to help them celebrate. Enjoy the weekend!’",
        "In addition to the corgis, Sarah and her team had put together a beautifully prepared selection of sandwiches, a menu offering 'Camilla's tea' with lemon, ginger or green, and a huge cake that had been named 'Charles' Crunchy Cream Cake'. Sarah's followers on social media were quick to comment on the sweet post with many addressing the fact that the Duchess will not be attending the crowning of King Charles and Queen Camilla tomorrow at Westminster Abbey.  One person wrote: 'So glad you’re taking good care of the Queen’s corgis.''That’s truly selfless and dignified!! I personally think you should be there but I hope you have a wonderful day x,' added another fan of Fergie. While a third follower commented: 'Looks amazing... personally our Duchess of York should be in attendance tomorrow. 'Beautiful. Looks amazing. And you should be there,' penned a fourth fan. 'Awww nicely done,' wrote one person, while another follower added 'Sarah Big Heart'.",
        "Instead Sarah will be a 'VIP attendee' at the coronation concert to celebrate King Charles being officially crowned the following day, according to reports.The Duchess of York recently spoke out about the snub while speaking on ITV's Good Morning Britain, insisting she's not offended and citing her divorce from Prince Andrew as the reason.",
        "She told presenters Kate Garraway and Adil Ray: 'I'm not [going], it's a state occasion, and being divorced I don't think you can have it both ways.'I am divorced and I'm really loving being divorced to my ex-husband, not from him but to him, it's important to differentiate.'She added that just because she's 'not there on the state occasion', she can still 'be there' in private.'That's a lovely feeling to be part of, it really is,' she continued, 'and as I said you can't have it both ways. You mustn't sit on the fence. You're either in or out, don't muck around.'",
        "She added: 'The great thing about this moment in time is the unity of family, and I think that Charles and Camilla are doing an exceptional job at unifying the family.'It was previously reported that the Duchess was not expected to attend the Coronation – despite the fact that her daughters Princesses Beatrice and Eugenie were there.Royal commentator Tom Bower previously told MailOnline that Sarah had excluded herself because of her previous 'conduct'.He added that her presence would 'provoke critical comment, which King Charles doesn't need'.Expert Richard Fitzwilliams praised the 'extremely wise' decision from the King because she has been an 'embarrassment to the Royal Family for many years'.",
        "Speaking about the absence of Sarah, Mr Bower said she will be left out 'because she is not a member of the Royal Family'.He added that she had excluded herself 'by her past conduct', saying: 'Her presence would provoke critical comment which Charles doesn't need.'"
    ]
}