{
    "articleURL": "/femail/fashionfinder/article-12047285/holly-willoughby-blue-shirt-dress.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Fashion Finder article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "Holly Willoughby’s outfit choices often leave us in awe. Unsurprisingly, the presenter’s latest look is no exception – check out her beautiful LK Bennett dress.While hosting This Morning, Holly exuded elegance in the ‘Valerie’ midi, styled by Danielle Whiteman with complementary sandals from the coveted brand.  LK Bennett Valerie Blue and Cream Graphic Diamond Print Shirt Dress  Renowned for their shirt dresses, LK Bennett has hit the mark with this number. Made from a lightweight fabric, the classic fit-and-flare silhouette is elevated by a Peter Pan collar and short puff sleeves. On closer inspection, you’ll also notice a charming diamond print, rendered in a summery sky blue colour palette. Holly paired the dress with white LK Bennett 'Florance' Sandals. Equally stylish and comfortable, the buckle detailing and block heel will boost any look.   £299 Shop",
        "Renowned for their shirt dresses, LK Bennett has hit the mark with this number. Made from a lightweight fabric, the classic fit-and-flare silhouette is elevated by a Peter Pan collar and short puff sleeves. On closer inspection, you’ll also notice a charming diamond print, rendered in a summery sky blue colour palette.The best thing about this design, however, is its versatility. It could easily be dressed up or down depending on the occasion, making it a must-have for everyone.We recommend teaming it with a trench coat and trainers for an effortless daytime look, switching to heeled sandals and metallic accessories after dark.",
        "Since everything Holly wears tends to sell out, you will have to act quickly if you want to bag her exact outfit.Don’t fret if it exceeds your budget; with so many options to choose from to suit all budgets, you're sure to find a shirt dress that will become a staple in your wardrobe for years to come. We've got you covered with a selection of similar dresses below.The best blue shirt dresses to wear this spring   Mango Shirt Dress at Brand Alley Why not make a sartorial statement in Mango’s graphic print number? The eye-catching motif is guaranteed to receive compliments.  £25 (save £24.99) Shop  New Look JDY Floral Shirt Dress  This breezy design by JDY will look especially great with flats. What’s more, the ditsy floral print is completely timeless.  £30 Shop  Yumi Heart Print Shirt Dress Wear your heart on your dress with the help of Yumi. Not only does it look the part, but this design is also made from recycled fabrics.  £30 (save £20) Shop  Hush ‘Kensington’ Shirt Dress With its handkerchief hem and uplifting geometric print, this Hush dress is a perfect choice for a sunny day.  £85 Shop  Rixo ‘Izzy’ Shirt Dress  Rixo’s ‘Izzy’ style is a worthy investment thanks to its vintage-inspired shape and polka dot pattern. The blouson sleeves are ultra-flattering too.  £245 Shop"
    ]
}