{
    "articleURL": "/news/article-12060957/King-BBC-cameraman-thrown-Coronation-rehearsals-tried-film-anointment.html",
    "content": [
        "A BBC cameraman allegedly thrown out of rehearsals for the King's coronation A senior BBC employee was allegedly banned from the King's Coronation after the monarch spotted him 'trying to record one of the secret parts of the ceremony' during rehearsals.",
        "King Charles III is said to have seen the cameraman out of the corner of his eye on Friday secretly filming the walkthrough for the sacred anointing. Security then intervened and removed the cameraman, who was suspended from duty throughout the weekend, The Sun reports.The man had wandered from his officially assigned spot and was seen loitering near the four-panelled screen - behind which the sacred anointment takes place - with his mobile phone out.Courtiers looked on in bemusement as the man was frogmarched from the premises.",
        "The BBC's on-site manager is then said to have torn up the man's accreditation on the spot.Calling it a 'humiliating' gaffe for the broadcaster, a source said: 'Charles spotted the cameraman trying to film him during the run-through for the most sensitive part of the ceremony.'The BBC guy was looking shifty as he lurked in view of the screens holding his mobile phone. He had no business being there whatsoever. He had an accredited spot in the Abbey.'It is highly irregular for any journalist to leave their set position in such circumstances. And it’s deeply concerning to think he would be trying to film precious moments deliberately hidden from public view.'The anointing of the sovereign is the most sacred part of the coronation ceremony. Indeed, it is so sacred that it is hidden from public view. ",
        "As was the case with his mother's Coronation in 1953, the King's anointment by the Archbishop of Canterbury was also concealed from onlookers. ",
        "At a ceremony in Jerusalem in March 2023, the anointing oil used for the coronation was consecrated by the Orthodox Patriarch of Jerusalem, His Beatitude Patriarch Theophilos III,The holy oil was blended from olives which were freshly picked alongside the grave of Prince Philip's mother in Jerusalem, where she is buried on the Mount of Olives. To ensure the utmost privacy during this sacred occurrence, a screen was used during the Kin's Coronation to ensure the anointing is appropriately respected. Depicting a tree with 56 leaves representing the Commonwealth nations, the hand-sewn design on the front of the screen bears the King’s cypher at the base of the trunk showing the sovereign as a servant of the ‘family of nations’.Another source described the potential breach of privacy as 'horrendous' and added it was a 'stressful, anxious time for everyone concerned'.Buckingham Palace and the BBC have been approached for comment."
    ]
}