{
    "articleURL": "/wires/pa/article-12039965/Royal-fanatics-line-Mall-early-morning-Coronation-rehearsal.html",
    "content": [
        "Royal fanatics have been treated to a first glimpse of the Coronation as rehearsals take place down the Mall.",
        "Soldiers dressed in bright yellow and red military uniforms paraded past Buckingham Palace towards Westminster Abbey just after 12.20am on Wednesday.Crowds ran through St James’ Park to find the best spots along the Mall with many trying to spot their relatives in their military outfits.A brass band in yellow uniforms on horseback started the parade after a recording of the national anthem.",
        "Onlookers skipped along next to a band and ran after the regiments of mounted soldiers that followed.At least 15 tents are already positioned along the Mall and royal fans got to test out what view they will have of the King when a carriage was pulled along the Mall by white horses.John Loughrey, 68, claimed to be the first person to set up his tent on the Mall on April 27, nine days before the Coronation.He told the PA news agency: “We like the build up, the rehearsals and seeing people throughout the day.",
        "“There are a lot of tourists and they come and say they wish they had something like this in their country.”Mr Loughrey explained he had been camping outside royal events for 26 years and spent a month camping out after Princess Charlotte was born.He added: “We did a lot of research. We (picked this spot) because there are no trees so you can see the Red Arrows.”",
        "While the carriage and regiments of horses made their way past Downing Street, soldiers and military bands practiced protocols on the Mall.",
        "Soldiers also lined the streets of Whitehall with many holding standards marching in Parliament Square and practised chanting position as Big Ben chimed.Drumming could be heard across Westminster as different parts of the parade sprung into action.The rehearsal took place hours after a man was arrested outside Buckingham Palace after throwing suspected shotgun cartridges into the palace grounds.",
        "The Metropolitan Police said he was detained at around 7pm on Tuesday after he approached the palace’s gates in central London and threw a number of items.He was held on suspicion of possession of an offensive weapon after he was searched and a knife was found, but he was not carrying a gun.Cordons were put in place and Scotland Yard said a controlled explosion was carried out as a precaution as the man had a “suspicious bag”."
    ]
}