{
    "articleURL": "/tvshowbiz/article-12043113/Minka-Kelly-wows-vibrant-green-ensemble-stops-View-promote-latest-memoir.html",
    "content": [
        "Minka Kelly turned heads wearing an all-green ensemble as she stopped by The View in NYC on Wednesday to promote her new memoir, Tell Me Everything.",
        "Among many shocking revelations in the book, Minka recently revealed that she starts off which a story about her working in a 'peep show' at the age of 17. 'I start the book with the story of working in a peep show because that is the story that I carried the most shame about,' she said on the show. 'That was the thing that I was the most afraid to ever share with anyone.' The Friday Night Lights alum, 42, talks about traumatic childhood in the book, and is currently doing the rounds to promote it.The star slipped into a pair of lime green, high-waisted trousers along with a mint green, knit sweater that kept her warm in the cooler temperatures. The beauty, who has been romantically linked to Imagine Dragons singer, Dan Reynolds, layered her colorful outfit with a green and white plaid coat, which she was seen donning earlier Tuesday while exiting GMA. She slipped into a pair of open-toed, tan-colored heels to allow the clothing to be the main focal point for her outing. ",
        "Her voluminous brunette locks were parted to the side, and effortlessly flowed down past her shoulders in light curls. She kept her accessories minimalistic for the day, and donned a pair of gold earrings for a flashy touch to her fashionable look. ",
        "Minka's makeup was classically done, and comprised of a layer of mascara to her lashes, along with a bronze shadow around her eyes. A lighter blush and highlighter was added to her cheekbones, while a dark pink, glossy tint was worn on her lips for a finishing touch. The Roommate actress opted to not carry any heavy purses or handbags as she strolled into the building before appearing on The View. As she joined the hosts for the Wednesday episode, Minka revealed that she had worked on a peep show at just 17-years-old before landing a successful role on Friday Night Lights years later, which is where the book also opens up, per Decider. 'I start the book with the story of working in a peep show because that is the story that I carried the most shame about,' she explained. 'That was the thing that I was the most afraid to ever share with anyone.' At one point, the actress had made the decision to tell a person close to her about her past, but the individual only made her 'feel bad' about it. ",
        "She added that therapy has had a positive impact on her life and explained, 'A lot of times women don’t have a choice but to do what they have to do to survive and put a roof over your head and food in your mouth.' ",
        "The star then gushed that her tell-all book was meant to be a 'love letter' to her late mother who did all she could to help them 'survive.'  Her memoir was officially released on Tuesday, May 2, and the star stopped by Good Morning America to further discuss the book. The author said the memoir started as a project for herself, but then realized it could be something bigger.'I am certainly not the only one who was raised by a single mother who struggled with addiction,' she said.In her new memoir, Minka details her traumatic childhood with her mother, Maureen, who supported them by working as an exotic dancer, and would sometimes take her to work with her.Unfortunately, her mom's struggle with drug addiction meant they sometimes experienced hunger and homelessness. Her father, former Aerosmith guitarist, Rick Dufay, 71, was not around during her childhood, but the two did reconnect as Minka got older and have a good relationship now.The Beach House actress credits therapy with helping her see her life more clearly and explained that she was able to understand moments from her past. Minka and her mother were able to reconcile before she died of cancer in 2008. ",
        "She expressed that she has been able to connect with other women who have had similar experiences and that she hopes her book will help others.",
        "'I want people to feel seen. I want people to get more comfortable with the idea of grace and forgiveness. Grace is not for people you might necessarily think deserve it, that's why it's called \"grace.\"' Minka also details her 'toxic' relationship with her then Friday Night Light co-star, Taylor Kitsch, in excerpts per The Daily Beast. The two not only had an on-screen relationship, but were also together in real-life. She explained that her focus on set revolved around Taylor rather than other castmates, and stated, 'So when my relationship with Taylor became toxic, I had no one to turn to.' Kelly admitted that she had 'shacked up' with her co-star, although a producer on the show, Peter Berg, had warned her to do otherwise.The actress explained that both she and the actor had broken up and gotten back together 'more times than [she] [could] count.'",
        "She also added, 'Life became very difficult both on and off set whenever we broke up. We were young and had very few tools to handle our emotions and personal grievances.'Minka recalled when she was not dating Taylor, the two couldn't use the same trailers on set and also 'couldn't ride in the same van together...' The beauty added that Kitsch was more open about his 'feelings' with other castmates than she was. ",
        "'My co-workers weren’t taking me out for drinks after work to mend my broken heart,' and added that, 'they were taking him out.'Minka had starred on the series for the first three seasons, and only briefly appeared in the fourth season. Taylor, on the other hand, remained on the series for five seasons.",
        "Later on Wednesday, the actress had a second outfit change and donned a chic, brown suit that comprised of loose-fitting slacks and a matching blazer that she chose to leave unbuttoned. The beauty chose to wear a plain, white shirt underneath that added a bit of contrast to the overall look as she exited ABC Studios in the heart of New York City. She slipped into the same tan-colored heels that she had worn earlier in the day which perfectly coincided with the color scheme of her ensemble. Minka was seen flashing a small smile as she greeted fans as she prepared to head to the next destination during her busy schedule.  "
    ]
}