{
    "articleURL": "/news/article-12050419/BBC-presenter-Nihal-Arthanayake-reports-pub-racial-abuse-police.html",
    "content": [
        "The 51-year-old was waiting for his wife outside the pub in Greater Manchester He said he was out to ensure no other person was forced to endure vile race hateBBC presenter Nihal Arthanayake has reported to police how he was racially abused in a pub, MailOnline has learned.",
        "The star visited Stretford police station in Manchester yesterday to tell officers how an unidentified drinker called him the P-word and N-word.The veteran broadcaster, who is being supported by Great British Bake Off winner Nadiya Hussain, said he was out to ensure no other person of colour was forced to endure the vile race hate of the man who insulted him outside a pub last week.The BBC Radio Five afternoon talk show host was allegedly racially abused outside a pub in Altrincham on Friday evening.The Radio 5 Live host, 51, was waiting for his wife outside the unnamed pub in Greater Manchester, following an evening out together watching a friend's band.",
        "On his Twitter video he said: 'I don't really know what just happened. I was in a place called Altrincham, which is a bit of a hole.'I was outside this pub, which I'd been in with my wife, dancing around, jumping around etcetera. It was fun. Covers band, they were very good.'I saw this man sitting outside, I was waiting for my wife to come out, so I said \"Can I come and sit with you, can we talk?\" and he was like \"Yeah, yeah absolutely.\" Little, kind of drunk man.'We got talking and he said \"oh are you a doctor?\" So I started laughing because it's a question as an Asian you might get asked. And I went \"Well why would you ask that?\"",
        "'And he said \"Well, because you're a p***\". And then he went \"oh I guess I can't say p***\" then he said the n-word! Then he kind of looked at me and was like \"oh sorry, you're offended aren't you?\" And I said \"well why did you say that word?\" He said \"I'm sorry I'm a massive...\" and used the c-word.'I said \"You're not a massive c-word, you're just an average one. Dictators are massive c-words, you're just an average one.\" It was so weird.'But you know when you come to some of these areas, I think there's just some people who still think they can say that word.'Nihal later told MailOnline he would not back off against his bid to get the racist arrested - but has subsequently been further shocked by an outpouring of fresh racist abuse from strangers online since he posted about the pub incident.",
        "He said: 'A small group of racists have begun to gaslight me online and said it never happened, with some amateur human behaviourists claiming that my body language in the video proved that I was lying.'They then started to accuse me of being an anti-white racist. From there it escalated to being told I don't belong in the UK and I am an invader and part of a great conspiracy to replace white people with \"invaders\" from \"s***holes\".",
        "'Then came the anti-Semitism which accused Jewish people of masterminding this influx of immigrants to supplant the \"indigenous Brits\", myself being one of them.'The veteran broadcaster, who was recently a guest panellist on TV's Michael McIntyre's The Chase and has his own afternoon BBC talk show from Salford's Media City, said he tried to engage with the angry brigade.But after keyboard hate from a Twitter usre with the name Tech One Two, Nihal replied: 'Your mum would be very upset that you have turned out this way. She has also said she will switch off the wi-fi if you carry on being a nasty little man on social media.'The abuser responded: 'Ever talk about my mother again and I will come to Media City and you can say that to my face.' He then made anti-Jewish remarks.Another attacker called Angie Bexley wrote: 'I absolutely accept people for who they are. I wish them well in their own countries, not ours.'Some of the abusive accounts have been deleted, but Nihal revealed the sickening insults have not only been delivered by fellow Britons, but from abroad too.'Bigots from mainland Europe and the US have joined in talking about black on white violence, racial purity, and a strange obsession with men with beards wearing chainmail.",
        "'It is difficult to tell the difference between bots and real humans and it has been a strange few days.'But even with the abuse I still believe profoundly that this ragtag bunch of sad, lonely and disgruntled racists are an eccentric minority who have been encouraged by anti-immigrant sentiment and Twitter, which seems to have allowed some of these people back onto the platform.'He said he had been encouraged by Greater Manchester Police who are hunting the pub racist and would discuss the Twitter abuse with cops.Nihal added that he had received 'a huge amount of love and support from friends, colleagues and lots of people across social media'."
    ]
}