{
    "articleURL": "/sport/afl/article-12040529/Tasmania-officially-gets-AFL-team-one-major-mystery.html",
    "content": [
        "League's 19th licence formally awarded Agreement signed with state government Roofed stadium 'part of the deal' Tasmania will finally have its own side in the AFL after being formally awarded the league's 19th licence by chief executive Gillon McLachlan.",
        "The state, which has for decades pushed for inclusion in the national competition, got across the line with the recent finalisation of funding for a new Hobart stadium - the AFL's last sticking point.Tasmania's men's team is slated to join the AFL competition in 2028, while the timeline for a women's team entering the AFLW is being worked on but remains up in the air.'Today is about the AFL continuing to live out our purpose of progressing the game so that everyone can share in its heritage and in its possibilities,' McLachlan said on Wednesday.",
        "'Everyone - and today we close the loop.'Today is about recognising that Tasmania belongs in our AFL and AFLW competitions, belongs in the national football conversation and belongs in the national fixture.'The licence was unanimously backed by the 18 existing club presidents on Tuesday and promptly signed off on by the league commission.Hobart's proposed new stadium and its design - in particular whether it would have a roof - had been sticking points.McLachlan said a roof was part of the agreement signed with the state government on Wednesday morning.'We signed binding commitments with the Tasmanian government that committed delivering on those conditions, including partnering with the federal government for a 23,000-seat roofed stadium at Macquarie Point,' McLachlan said.",
        "Tasmanian Premier Jeremy Rockliff said the island state 'will never be the same again'.'This is a proud and ground-breaking moment in our history,' he said.'After more than a century, the AFL will finally be complete and recognised as a truly national competition.'We have fought hard to deliver this and I couldn't be prouder to deliver our own team, that will take the field in our own colours, and sing our own song.'For everyone who has backed us and believed - thank you for sticking with us, as we've brought this home.'Tasmania's time has come.'He posted a photo to Twitter of the historic moment the agreement was signed with McLachlan, accompanied by the words: 'Games will be played in the North, the South and the North-West to ensure this is a truly Tasmanian team. I wouldn't have it any other way.'Rockliff made an embarrassing mistake when he appeared on TV to discuss the announcement, calling McLachlan 'Gillion'. ",
        "May 3 holds a significant place in Tasmania's football history.Devonport-born Richmond great Matthew Richardson played his last game on the date, while Ian Stewart reached 100 games and Peter Hudson kicked 16 goals in a VFL match.The federal government on Saturday announced it would chip in $240 million towards the contentious $715 million stadium project at Macquarie Point in Hobart.",
        "Tasmania will be the first expansion team since GWS were awarded a licence in 2010 and entered the AFL in 2012.Unlike the Giants and Gold Coast, the AFL's latest two additions, the Tasmanian team will be born into one of Australian Rules football's heartlands.",
        "Richardson, Stewart and Hudson are among the island state's most famous footballers and they all had to move to the mainland for their careers to flourish.Stewart, Hudson, Darrel Baldock and Royce Hart are Tasmania's Australian football Hall of Fame legends.There is already speculation that the team's probable name, the Tasmanian Devils, would breach a commercial copyright.The state government will contribute $12 million per year over 12 years towards a team, plus $60 million for a high-performance centre.It will spend $375 million on the new 23,000-seat roofed stadium, which opponents have labelled a waste of money amid a housing and health crisis.The AFL is contributing $15million towards the stadium."
    ]
}