{
    "articleURL": "/sport/football/article-12052383/Manchester-City-Pep-Guardiola-claims-Rico-Lewis-player-Premier-League-title-charge.html",
    "content": [
        "Pep Guardiola revealed the secret to Man City's revival is defender Rico Lewis, 18City lagged behind Arsenal in the table but have since overtaken the Gunners Guardiola hailed him for helping others to understand the inverted full-back rolePep Guardiola revealed the secret to Manchester City's re-energised Premier League title charge has been Rico Lewis.",
        "Lewis has made 12 starts in all competitions in his debut season - the majority coming during an intense period just after the World Cup when City struggled for rhythm.The teenager, in line for a new contract, operated in a dual role between right back and central midfield as Guardiola found ways of reshaping City amid ongoing problems with Joao Cancelo, who subsequently left for Bayern Munich.Lewis made a major impact, particularly when altering the course of a slender one-goal victory at Chelsea after a half-time introduction at Stamford Bridge.'It's thanks to Rico - he helped us to understand what we had to do to play better and better,' Guardiola said. ",
        "'The last 10 games he didn't play much but without Rico this season, the step we made as a team would have been more difficult. That I'm pretty convinced about that.'The movement he does makes many things fluid. After that Kyle [Walker] realises, John [Stones] playing in that position has been exceptional. 'But the other players have things Rico doesn't have - experience. This is why the team grows in many cases.'Stones has been a revelation alongside Rodri, who Guardiola is considering offering a rest for Saturday's game against Leeds United ahead of the Champions League clash at Real Madrid on Tuesday.",
        "Kalvin Phillips, yet to start a Premier League game since leaving Leeds last summer, has been offered no guarantees over his future role at the Etihad Stadium.'We are not thinking for one second about next season. In some things he needs to adapt a little bit more but what happens next season, I'm not concerned for one second now.'We will see at the end of the season. We'll sit with the players. Maybe they want more minutes or maybe they are not happy with the situation. 'But right now I'm not going to discuss anything. The reason why he didn't have the minutes that we expect is a question of tactics, movements.'"
    ]
}