{
    "articleURL": "/news/article-12039367/How-Labour-mayor-Sadiq-Khans-hated-ULEZ-tax-cost-Starmer-ANDREW-PIERCE-reports.html",
    "content": [
        "On the campaign trail in his west London constituency, an ebullient Boris Johnson was swamped by well-wishers as he staged an impromptu walkabout.Marching up and down residential streets, knocking on doors, shaking hands, and posing for selfies, he was armed with piles of Tory election pamphlets. They all bore the same message: ‘ULEZ driving charge notice. Do not ignore.’In other words, car owners will face punitive charges under Labour London Mayor Sadiq Khan’s hated Ultra Low Emission Zone (ULEZ).In tomorrow’s English local elections, ULEZ has turned into a major issue on the doorstep – and the Tories believe it could play into their hands.The scheme was introduced in central London in 2019. Under it, older vehicles considered excessively polluting – typically pre-2015 diesel cars and pre-2006 petrol vehicles – are charged £12.50 each day for driving within the zone.",
        "Failure to pay can result in fines of up to £2,000, and these penalties have already netted Labour-controlled City Hall a windfall of almost £100million. The expansion of the zone – due to be introduced from the end of August – means it will soon cover all 32 boroughs in inner and outer London and take in millions more drivers.Crucially, research shows the impact of the charge will resonate well beyond the capital and affect more than 1.5million who drive into London. And it is these drivers in boroughs bordering the city who are among those voting tomorrow.Khan insists the expansion is vital to cut the number of lives lost each year to air pollution. But Boris says his successor as London Mayor is using ULEZ as a fig leaf to cover up a financial crisis at Transport for London (TfL) which administers the scheme. ‘There is a £740million black hole in the finances of TfL. Khan is using ULEZ to plug the gap. How is Khan able to impose this tax on working people? This scheme was never intended for outer London. Khan must be stopped.’Boris and fellow Tory MPs have been campaigning on the issue in Bedfordshire, Berkshire, Buckinghamshire, Essex, Kent, Hampshire, Hertfordshire, Surrey and East and West Sussex where drivers will be hit by the expansion.In Kent, where Labour has only one MP, research by the Driver Vehicle Licensing Agency (DVLA) estimates more than 250,000 vehicles are likely to be non-compliant with ULEZ. In Dartford a Tory petition against ULEZ has attracted more than 35,000 signatures.",
        "Gareth Johnson, the local Tory MP, says: ‘It’s regrettable Keir Starmer has backed Khan’s plan to expand ULEZ to Dartford. He could have chosen to back working people. No one here wants or supports ULEZ. The Mayor of London and Labour Party are not listening to what people are saying here.’Jeremy Kite, the Tory leader on Dartford Council, says: ‘It’s a cruel and unfair tax on people who don’t have the benefit of being able to chop and change vehicles at will just because Sadiq Khan tells them what they must drive.’ In Essex, where around 240,000 cars could be non-compliant, Brentwood Tories passed a motion with Essex County Council refusing to co-operate with the installation of detection cameras. They say in their election leaflets: ‘We will continue to do everything legally available to us to frustrate its introduction.’ Pointedly the Labour and Lib Dem councillors abstained rather than oppose the Tory motion.In Crawley, West Sussex, Labour appears equally ambivalent. When local Tories tabled a motion demanding the Labour-run town hall oppose the ULEZ extension, the response was to delay things. Councillor Duncan Crow, Tory group leader, says: ‘This means Labour councillors conveniently avoid having to vote on ULEZ expansion before Crawley’s elections on May 4.’In Buckinghamshire, Tory councillor Steve Broadbent argues that rather than cutting air pollution, ULEZ will have the opposite effect. ‘We are concerned about the potential increased number of vehicles redirecting on to our local roads to avoid entering the ULEZ. It also has the potential to see more polluting vehicles on our roads.’At Hertsmere Council, which covers Borehamwood, Bushey and Potters Bar, Morris Bright, the Tory group leader, says: ‘It might be the case that ULEZ is going to be forced through and, if it is, we are going to make sure it is with as much noise as possible from residents and councillors in this borough.’",
        "The Tories are not just fighting it on the doorstep. Last month five Conservative controlled local authorities, Bexley, Bromley, Harrow, Hillingdon and Surrey, won the right to challenge the scheme in the High Court in July. At the weekend thousands of protesters took to the streets in different towns in high-visibility jackets with ‘Free our Streets’ placards and mock registration plates reading ‘No to ULEZ’. They were also holding placards that read ‘Get Khan Out’ and ‘Take Back Democracy’.Yet rather than listen politely to his critics and try to engage them in debate, Khan instead smears them as conspiracists. At a public meeting in London last month he mocked the hundreds of noisy protesters outside saying: ‘Let’s call a spade a spade; some of those on the outside are part of the far-Right, some are Covid deniers, some are vaccine deniers, and some are Tories.’Khan wasn’t just offensive, he was also ignoring an uncomfortable truth. One of the loudest protests against ULEZ is from the Unite trade union, which is Labour’s most generous benefactor. Unite has 20,000 members at Heathrow Airport which is within the expanded ULEZ. Many Unite members including cleaners, caterers and airport cabin crew can’t afford to change their older cars. Joe McGowan of Unite said: ‘We want the mayor to delay ULEZ expansion. The outcome of this is profoundly anti-worker.’The GMB trade union also warns the expansion will threaten many of their members at Heathrow. Trevlyn McLeod, a GMB regional organiser, said: ‘GMB understands how important it is to tackle air pollution, but the ULEZ extension will affect our Heathrow members who aren’t earning huge great salaries, who are struggling to support their families, and now face being financially penalised for going to work.’But Labour leader Sir Keir Starmer is still enthusiastically backing ULEZ, as is shadow foreign secretary David Lammy who suggested in a radio interview that plumbers who can’t afford to change vehicles should use public transport. He said: ‘We have got fantastic buses, fantastic tubes.’ He couldn’t explain where they would store their ladders and toolboxes on a bus.",
        "Many Labour MPs such as Siobhan McDonagh, who represents Mitcham and Morden, are open in revolt. ‘What I’m concerned about is how do you get cleaner air and not make it so very hard for so many people who are key workers. I would say Sadiq: “Please think about this. Please delay it”.’Seema Malhotra, the shadow business minister, says: ‘I’m concerned it will have a disproportionate effect on lower income families, residents, and small businesses.’Labour-run Hounslow Council, which supports ULEZ, is hypocritically seeking an exemption for 400 of its own cars because they may not be compliant by the August deadline. Yet the council has no such worry about its residents. There are already 37 ULEZ cameras installed in the borough.Retailers are also demanding a rethink with Hamish Mansbridge, chief executive of Heal’s furniture store, a landmark of London’s Tottenham Court Road for 200 years, warning ULEZ is creating ‘ghost towns in the centre of London’. He adds: ‘It’s like they’re actively trying to discourage people coming into the centre of London.’But Khan is pressing ahead, installing some of the 2,750 cameras across the capital even before July’s High Court confrontation with the five Tory-controlled councils.This week, it emerged a secret activist army dubbed Blade Runners has vowed to remove every single camera being used to catch drivers using high-polluting vehicles across the capital. Some cameras have been ripped from their bases, others have had their wires cut or bags placed over them.Khan insists his scheme is vital to protect lives. He says: ‘Around 4,000 Londoners are dying prematurely every year due to air pollution. The ULEZ is cleaning up London’s toxic air.’ He points to a study by Imperial College London which shows air pollution can also stunt lung growth. ‘From evidence of lowering sperm count to impacting foetal development, air quality can even have a major impact pre-birth. Taking action must be an absolute priority.’Ironically, by continuing to roll out the scheme, Khan may be offering Boris an unexpected lifeline. The privileges committee inquiry into whether Boris knowingly misled Parliament over Partygate will soon deliver its report. If the seven-strong committee, chaired by Labour’s Harriet Harman, rules against Boris and they suspend him for ten days or more he will face a perilous by-election in his Uxbridge and South Ruislip constituency.If that comes to pass, Boris has a plan – he will turn the by-election into a referendum on ULEZ and Mayor Khan which would unite the Tories behind him and give him a strong chance of another election victory.The truth is that ULEZ could both deliver a better than expected result for the Tories in the local elections and ensure Boris emerges triumphant from partygate. Quite an achievement for London Mayor Sadiq Khan."
    ]
}