{
    "articleURL": "/tvshowbiz/article-12052883/Diana-Vickers-SLAMMED-disrespectful-video-mocking-Queen-Camilla-Princess-Diana.html",
    "content": [
        "How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Diana Vickers has been slammed after posting a 'disrespectful' video where she seemingly mocked Queen Camilla and late Princess Diana hours ahead of Saturday's Coronation.",
        "The X Factor star, 31, donned a crown as she and fellow podcast host Chiara Hunter tastelessly sang about the royals.They cruelly alleged that the new Queen 'played the long game' to bag the throne, following her secret love affair with the King.The singer also scrawled the words 'waste of time' of a picture of the late Princess in her iconic revenge dress.Their self penned song began: 'Ladies, this is a lesson for all of you side pieces out there, stay focussed'.",
        "Before ending with: 'C-A-M-I-L-L-A - what does it spell? Diana's worst nightmare.'Outraged followers raced to the comment section to blast the singer with one even describing the post as 'evil'.One wrote: 'Um yeah but the woman you call the “loser” died horrifically in a car crash, so wtf is this'. A second said:  'Don't get why this is funny ...I find it disrespectful'.With someone replying: 'Agree. Extremely disrespectful to Princess Diana. Not funny'. Another added: 'This is incredibly distasteful' and a third added 'genuinely abhorrent'.Meanwhile someone else slammed the star saying: 'The lengths you're willing to go to for a viral moment'. While another said: 'I find it evil' and 'You are an evil sad little girl I pity you'",
        "However other fans seemed to lap up the humour with one commenting: 'his is so brilliant I cannot haaaa'.",
        "A second said: 'Absolute genius' and another enthusiastic fan wrote: 'When I saw I howled [with laughter]. The King entered into a secret affair with his now-wife during his marriage to Diana, having been old friends after first meeting in 1970.  The late Princess famously wore the sleek black mini 'revenge' dress in June 1994 for dinner Serpentine Gallery in Kensington Gardens on the very day her husband admitted his adultery. It comes after it was revealed Dame Judi Dench had been invited to King Charles' Coronation at Westminster Abbey along with a whole host of stars.Dame Judi, 88, won an Oscar for her performance as Queen Elizabeth I in Shakespeare In Love and last year condemned The Crown for its 'unjust' depictions of the Royal Family.",
        "As former spy chief 'M' in the James Bond films, perhaps Dame Judi can help Special Branch keep an eye on another national treasure due to be at Westminster Abbey - Rowan Atkinson.The Mr Bean star, 68, once sabotaged a coronation, snatching the crown in spoof spy film Johnny English.Absolutely Fabulous star and OBE Dame Joanna Lumley, 76, has also received her invitation as a guest of Charles and Camilla. David and Victoria Beckham - the former of whom met the late Queen on multiple occasions - are also rumoured to be on the list, but have yet to be confirmed.",
        "One of the biggest stars at the coronation will be US singer Katy Perry, who will be performing for the King and his dignitaries.  ",
        "And the 38-year-old's husband and Pirates Of The Caribbean star Orland Bloom, 46, and their two-year-old daughter Daisy will be there to cheer her on. It comes after Katy was appointed ambassador of The British Asian Trust, a charity founded by Charles, in 2020. Perry, who will be staying at Windsor Castle, told Extra's Melvin Robert: 'I'm an ambassador to one of his foundations for the British Asian Trust, which primarily focuses on ending child trafficking, which is a huge issue of our time that people don't talk enough about, and it just aligned with all my values… He asked me to sing and it all aligned.' Judi's invitation to the Coronation comes after she accused Netflix hit The Crown of being 'cruelly unjust' to the Royal Family.In a letter to The Times newspaper in October, she called on Netflix to display a disclaimer at the start of each episode to say it is 'fictionalised drama'.She said it would also show respect for the bereavement suffered by the Royal Family and the nation, she said."
    ]
}