{
    "articleURL": "/wires/pa/article-12041367/Troop-keeping-alive-centuries-military-tradition-coronation-day.html",
    "content": [
        "A ceremonial military troop will keep centuries of tradition in Royal Hillsborough alive when it takes part in events in the Co Down village to mark the King’s coronation.",
        "As part of Saturday’s celebrations, Andrew Carlisle, bugler with the Hillsborough Fort Guard, will play a fanfare he composed for the proclamation of Charles last year.The Fort Guard, a troop of 20 warders, dates back to 1660, when a royal warrant was first issued by Charles II.The troop has taken part in every coronation since then in Hillsborough, the home of the royal residence in Northern Ireland.The warders will be at Hillsborough Castle, where a 21-gun salute will be sounded as the King is crowned at Westminster Abbey in London.",
        "Mr Carlisle told the PA news agency: “The guard will be on parade and will flank the dignitaries at the salute.“Then, later on, there is a feu de joie (fire of joy), where instead of the guns going off every 30 seconds, the guns will fire off nine in quick succession.“That will be signalled by me sounding the Royal Hillsborough Flourish, which was the fanfare I composed for the proclamation of the King.“After that there is a beating of the retreat and the guard will form an escort for the saluting officer and I will be playing with the Royal Irish band.“It will be a very special day for the guard.”He added: “We have been busy doing our research and, as far back as we can trace, the guard have always been present at proclamations and coronation festivities in Hillsborough.",
        "“It makes it right that we are there on the day, representing the village. We are proudly held in the village as the custodians of tradition. We are extremely excited and pleased to be part of it.”Mr Carlisle said there is excitement in the Co Down village.",
        "He said: “The proceedings from London will be shown on a big screen on the church green. Everybody will be coming with their picnics.“On Sunday, we’ll have a brass band coming to play. Hopefully the weather is good and we have a memorable weekend for everyone.“The build-up is the buzz. There is a lot has to come together on the day.“Within the guard, we are just pleased that we have managed to hold this tradition together.“Hopefully this will encourage the tradition to remain into the future.“It is through big days like this that provide memories for the kids and hopefully that will catapult the tradition on for another generation.“That is what the tradition depends on, people championing it and pushing it on.”The guard went into decline in the 20th century, when no new warders were recruited, but is now being returned to its full strength of 20 warders."
    ]
}