{
    "articleURL": "/wires/reuters/article-12038443/Soccer-Englands-Kirby-latest-undergo-knee-surgery-miss-World-Cup.html",
    "content": [
        "May 2 (Reuters) - England were handed another devastating blow after forward Fran Kirby said on Tuesday she will undergo knee surgery and miss the women's World Cup, adding to a growing list of players sidelined with knee injuries.",
        "England captain Leah Williamson was the latest to be ruled out last month with a ruptured anterior cruciate ligament (ACL) while European Championship Golden Boot winner Beth Mead, who also ruptured her ACL in November, has not returned to action.The injury is also a blow to Chelsea, who are third in the Women's Super League, seven points behind leaders Manchester United with three games in hand.\"Unfortunately after a few months of rehab the decision has been made that I will require surgery on my knee. I have been trying my best to not have to undergo this but unfortunately my progress has been limited due to the issue in my knee,\" Kirby said in a statement.\"I'm absolutely gutted to announce that this means my season is over and I will not be able to make the World Cup in the summer.\"I'm going to be doing everything possible to be ready for the start of next season and want to wish my team mates at Chelsea the best of luck for the rest of the season and my Lioness team mates the best of luck for the summer.\"Chelsea, who are also in the FA Cup final where they will face United later this month, said Kirby -- a two-times player of the year award winner -- would be out for a \"significant period\".",
        "England are in Group D along with Haiti, Denmark and China at the 32-team World Cup which kicks off on July 20 and will be held in Australia and New Zealand.England were one of the favourites after winning the Euros last year.RECURRING THEMEKnee injuries have been a recurring theme in the past year with Ballon d'Or winner Alexia Putellas missing a chunk of Barcelona's season after tearing her ACL on the eve of the Euros in July. She did not return to the squad until last month.Arsenal forward Vivianne Miedema's campaign also ended due to an ACL injury in December, with the Netherlands' record goalscorer saying she wouldmiss the World Cupafter undergoing surgery.Chelsea and England centre back Millie Bright, meanwhile, was ruled out for several more weeks with the knee injury she suffered in March.Reeling from injuries to key players, both Arsenal and Chelsea were knocked out of the Champions League in the semi-finals.England defender Lucy Bronze also underwent surgery on her right knee last week but is expected to return before the end of the season after Barcelona coach Jonatan Giraldez said she would be out for \"just a couple of weeks\".Simone Magill of Northern Ireland and France striker Marie-Antoinette Katoto have also damaged ACLs in the past year.",
        "With the list of knee injuries -- particularly ACLs -- only growing, there have beencalls for better researchinto the prevalence of injuries in women's soccer. (Reporting by Rohith Nair in Bengaluru; Editing by Christian Radnedge)"
    ]
}