{
    "articleURL": "/news/article-12040675/RAF-Typhoons-intercept-Russian-spy-plane-British-fighters-scrambled-shadow-aircraft.html",
    "content": [
        "The aircraft flew in international airspace and at no point entered UK airspaceRAF fighter jets were scrambled to intercept a Russian spy plane near UK airspace last weekend. ",
        "The anti-submarine aircraft Tu-142, also known as a Bear-F, was detected over the Norwegian Sea and North Atlantic Ocean north of Scotland on Sunday. Jets were scrambled from RAF Lossiemouth to shadow the plane and Norwegian F-35A fighter jets were also launched to monitor it as part of a Nato response. The aircraft did not enter UK airspace, the RAF said. It comes as tensions between Russia and the West continue to simmer following Moscow's invasion of Ukraine.",
        "The Typhoons shadowed the Russian aircraft closely while keeping an eye on their movements.An RAF spokesperson said air-to-air refuelling support was provided by RAF Brize Norton, and RAF High Wycombe. RAF Boulmer also assisted with the operation. Bear planes are used in anti-submarine and maritime patrol missions. An RAF Typhoon pilot said the operation 'demonstrated the close working relationships we have with our Nato colleagues'.They added: 'After scrambling to intercept the Russian aircraft, we were in close contact with RAF Battlespace Managers, who directed us towards the aircraft and relayed orders throughout. Ensuring we could confirm where they were and what they were doing at all times.'Quick Reaction Alert procedures involve the RAF holding aircraft and crews at continuous high readiness to take off within minutes and intercept unidentified aircraft flying in the UK's area of interest to protect UK sovereign airspace if required. ",
        "British and German warplanes were scrambled to intercept two Russian jets and a spy plane last week, after they were close to encroaching on Nato airspace over the Baltic Sea.",
        "On April 25, The UK and Germany sent Eurofighter Typhoon jets from Amari Air Base in Estonia to identify the two Sukhoi Su-27 fighter aircraft escorting an Ilyushin Il-20 Coot-A intelligence plane, the RAF said.The Russian jets and spy plane were flying over the Baltic Sea close to Estonian airspace when they were intercepted.'RAF and German Air Force Typhoon fighters scrambled together from Ämari Air Base in Estonia yesterday against unidentified aircraft over the Baltic Sea close to Estonian airspace,' a RAF spokesperson told MailOnline.'The aircraft, operating as part of Nato's Baltic Air Policing (BAP) Mission intercepted a Russian military IL-20 jet that was being escorted by two Sukhoi Su-27 Flankers.'The Ilyushin Il-20 Coot-A intelligence planes are designed to soak up enemy communications and signals for analysis."
    ]
}