{
    "articleURL": "/tvshowbiz/article-12058175/Chris-Brown-appears-deny-altercation-allegedly-left-friend-Usher-bloody-nose.html",
    "content": [
        "Chris Brown appears to have spoken out about a reported altercation at his birthday party on Friday night that involved Usher.",
        "In an Instagram comment that was apparently from Brown, 34, and reposted by a Twitter fan account, he appeared to deny that anything had happened between him and 44-year-old singer.Brown and Usher had been seen appearing to have a tense argument at a skating rink in Las Vegas, Nevada, according to a video obtained by TMZ.Video obtained by the outlet also appeared to show another incident involving Brown backstage at Missy Elliotts set for the Lovers &amp; Friends music festival, where both he and Usher performed separate sets the night after the incident that allegedly left Usher with a bloody nose.DailyMail.com has reached out to representatives for both Usher and Brown for comment. ",
        "In his comment, Brown wrote, '.yall been geeked all weekend , y'all dragging it now. It was mad people backstage and security was trying to clear everyone off the stage. People started pushing back.. I INTERVENED To let them know MY CHILD WAS BACK THERE. So y'all can keep ya narrative.' His first sentence appeared to allude to the alleged confrontation with Usher, as it indicated an earlier point of contention.The latest footage of Brown from the festival, obtained by TMZ, appears to show him shouting at security team members and trying to push forward even as a line of them try to keep him from advancing.",
        "It's not clear what he says in the video, as several other people are also shouting and jostling around him.However, he does seem to be pointing toward something or someone behind the line of security guards, which would seem to support his claim that he was trying to reach one of his children as the guards attempted to clear the area.Brown has three children: Royalty, eight, whom he shares with Nia Guzman; Aeko, three, whom he shares with Ammika Harris; and one-year-old Lovely, whom he welcomed with Diamond Brown.Despite the alleged altercation that led witnesses to claim Usher suffered a bloodied nose, he was still in good enough shape to perform on Saturday night.He wore sunglasses for much of the performance, though he did remove them at times, and he also posted a clip of his face in closeup to social media, indicating that he had no obvious lacerations or significant swelling.",
        "However, he has not explicitly denied the claims that he suffered a bloody nose. The alleged conflict at Brown's birthday party seemingly came out of nowhere, as Usher had been hosting the party for his friend. Insiders stated that the No Guidance singer became incensed after he attempted to speak to Teyana Taylor, who was also present at the event, and she chose to ignore him completely.",
        "A source spoke to Hollywood Unlocked, where the news about the incident was originally revealed, and expressed that the performer was 'disrespectful' to the actress during the party.The insider also remarked that Brown was 'intoxicated' when he initially approached the 32-year-old singer.Several sources spoke to lovebscott.com and expressed that the singer was upset about how his planned Michael Jackson tribute at the American Music Awards was canceled at the last minute.Taylor was reportedly involved with the planned performance and ended up pulling out not long before the show, which caused the project to fall apart.After she was approached by Brown, the singer remarked that he was 'on one' in an apparent reference to his intoxication, and he responded by asking Usher to make her leave his birthday party. When the U Got It Bad singer reportedly attempted to mediate the situation, the rapper allegedly called him a 'coward' and exited the roller rink with his entourage.The performer was said to have then followed his friend to the venue's parking lot in order to discuss the situation and calm him down.However, a source spoke to lovebscott and expressed that 'CB [Chris Brown] and his crew beat Usher's a**.'",
        "The performer was said to have been left with a bloodied nose and bruised ribs following the incident.",
        "According to TMZ, it was unknown if Usher was admitted to a hospital following the alleged beatdown or if police had been contacted.The media outlet reached out to the Las Vegas Metropolitan Police Department, although no incidents resembling the supposed encounter had been reported as of late.Neither Brown nor Usher have made any public comments about the alleged incident as of yet. Taylor, who was once a friend of Brown, has since unfollowed him on Instagram. Usher has since confirmed that he will appear at the Lovers &amp; Friends festival, which is scheduled to take place later today.Sources spoke to TMZ and stated that the hitmaker would perform while recovering from the alleged attack.Lovebscott's sources also expressed that Brown, who was also scheduled to appear at the festival, would go on with his performance as planned. ",
        "The pair have previously collaborated on several tracks, including New Flame, which was released in 2014, and Party, which debuted two years later. The My Way singer was featured in Welcome to My Life, a documentary focused on the life and career of his friend. Usher also brought out Brown during a show that took place as part of the former's residency in Las Vegas last year and embraced him on stage before presenting him with flowers.",
        "He also told his friend via Hollywood Unlocked: 'You a great. You're a legend. We love you and we gonna continue to keep lifting you up, bro.' "
    ]
}