{
    "articleURL": "/wires/reuters/article-12048775/Horse-racing-Kentucky-Derby-goes-four-horse-deaths-facility.html",
    "content": [
        "May 4 (Reuters) - A series of horse deaths at Churchill Downs cast a shadow over the 149th running of the Kentucky Derby, which kicks off the prestigious Triple Crown thoroughbred racing series on Saturday.",
        "The Louisville racetrack said it was working with regulators to investigate after four horses died at their facility in the lead-up to the 1 1/4-mile race, including one that was entered to run the derby, Wild On Ice.Churchill Downs on Thursday handed an indefinite suspension to Saffie Joseph, Jr., who trained two of the horses that died, Parents Pride and Chasing Artie.The suspension forced another derby entrant, Joseph-trained Lord Miles, to scratch from Saturday's race.\"We have reasonable concerns about the condition of his horses, and decided to suspend him indefinitely until details are analyzed and understood,\" Bill Mudd, the president and COO of Churchill Downs Incorporated, said in a statement.\"The safety of our equine and human athletes and integrity of our sport is our highest priority.\"The grim incidents cut a contrast to the usual tone of the jovial, bourbon-drenched affair, that attracts celebrities and high rollers in their finest millinery.The Run for the Roses will see league and Super Bowl MVP Patrick Mahomes call \"riders up\" this year, with Saturday's race expected to run under partly cloudy conditions with temperatures hovering around 74 degrees Fahrenheit (23.3°C).Trainer Todd Pletcher will be in focus with three of his horses running, including the two favorites, Forte and Tapit Trice, who were are 3-1 and 5-1, respectively, in Thursday's morning line odds.",
        "Forte charges into Louisville on a five-race winning streak, though could have some extra work cut out for him after drawing the 15th post.Tapit Trice, a gray colt known for his ability to break late, runs out of the fifth gate, next to the third of Pletcher's horses, the 12-1 Kingsbarns, who drew the sixth post.\"The key for both of them is that first step, to get away cleanly,\" Pletcher said in remarks to race organizers.\"And then Tapit Trice isn't super quick but hopefully he can get into the first turn, save some ground, get in a good position. Kingsbarns (will be) probably somewhat more forwardly placed.\"The field also features a descendant of racing royalty, Verifying, who was sired by the most recent Triple Crown winner, Justify. The bay colt will run out of the number-two spot and was 15-1 in the morning-line odds.Practical Move, who had been one of the favorites, scratched on Thursday due to an elevated temperature and was replaced in the field by Cyclone Mischief.The post time for the Kentucky Derby is 6:57 p.m. ET (2257 GMT) on Saturday. (Reporting by Amy Tennery in New York; Editing by Josie Kao)"
    ]
}