{
    "articleURL": "/wires/reuters/article-12040895/Will-Ecuadors-illegal-mining-crackdown-protect-Indigenous-people.html",
    "content": [
        "Illegal gold mining declared a national security threat",
        "Indigenous communities in the Amazon fear for health, landEcuadorian government criticized for 'lacking' responseBy Kimberley BrownQUITO, May 3 (Thomson Reuters Foundation) - Kayaking down the Napo River in Ecuador's Amazon rainforest, environmentalist Matthew Terry bemoaned how the once-lush riverbanks are now barren and full of dredges, excavating machines and bulldozers as illegal gold mining spreads across the region.In certain areas, miners have completely rerouted the river channel, while some smaller tributaries of the Napo and other rivers have been obliterated, threatening biodiversity and water sources for local communities, according to Terry.\"(Illegal mining) used to happen in isolated sites,\" said the executive director of the Ecuadorian Rivers Institute (ERI), a non-profit that monitors the country's whitewater rivers.\"Now we're starting to see ... mining activity throughout (entire rivers),\" Terry added.Ecuador's illegal gold mining problem stretches far beyond the northern Napo region - the government has identified illegal mining camps in 21 of the country's 24 provinces since 2000.But it has recently become a major worry for conservative President Guillermo Lasso. His administration in January declared illegal mining a national security threat, and said it has links to money laundering, and drug and arms trafficking.The government is seeking to build its mining sector and reduce its financial dependence on crude oil exports - and security secretary Diego Ordonez has said Ecuador will back international companies that have legal mining concessions, and fight illegal mining.",
        "Mining exports rose 32.6% to $2.76 billion in 2022, and the government has said it expects at least $4 billion by 2025. The increase is driving increasing competition for land - and new threats to forests, biodiversity and Indigenous people.While Ecuador is just starting to tackle illegal mining, illegal gold prospecting is a longstanding and growing concern across Latin America as the price of the precious metal rises and its limited traceability embolden miners.That is endangering forests and Indigenous communities in nations such as Brazil, Colombia and Peru, analysts and activists warn.Ecuador's authorities carried out about 350 operations against \"irregular mining activities\" in 2022 - including a major raid in February 2022 where some 900 security forces expelled hundreds of illegal miners from two rivers in Napo.But Patricio Meza, leader of the CONAIE national Indigenous organization, criticized Ecuador's crackdown as ineffective and intended solely to protect the legitimate mining sector, which he said also threatens local communities and the environment.Neither the Ministry of Energy and Mines nor the Government Ministry, which oversees Ordóñez's office, responded to numerous requests for an interview about the issue.Ecuador's former vice minister of mining, Fernando Benalcazar, said illegal mining used to be a problem in certain pockets of the country but has become \"almost uncontrollable\".",
        "Benalcazar blamed this on a lack of state resources for enforcement, which he said has given illegal miners a level of impunity, as well as on corrupt officials who he said benefit from the trade through money laundering and bribes.In trying to police illegal mining, \"there is no structure, there are no special units that have the right capacities, there are no basic resources for the regulation and control agency to be effective,\" he said in an interview in the capital Quito.\"All this is lacking,\" added Benalcazar, who is now a mining and energy consultant working in the private sector.SPIKING ILLEGAL MININGRecent studies say illegal mining has spiked across Ecuador.For example, the Monitoring of the Andean Amazon Project (MAAP) has used satellite images to measure tree loss due to mining in five key areas of the country's Amazon region.In February, MAAP said more than 4,000 acres (1,620 hectares) - the equivalent of about 2,325 football fields - of rainforest had been destroyed due to mining - both legal and illegal - just in those areas since 2018.An Organization of American States (OAS) report in 2021 also found illegal gold mining and the marketing of the gold had increased significantly in Ecuador in recent years.",
        "Meza of CONAIE said illegal mining has put the lives of Indigenous peoples at risk by contaminating rivers and forests.A recent health study published in the journal Integrated Environmental Assessment and Management found that exposure to toxic metals in some areas in the Napo basin was 352 times above permissible limits, increasing cancer risk for local people, especially children.While Indigenous communities mainly oppose illegal mining, Meza said some had resorted to joining the trade to get by because Ecuador's development model - focused on oil and mineral extraction - has upended traditional land rights and ways of life.The CONAIE leader highlighted that evictions of illegal miners have tended to occur in areas where mining concessions have been sold, which he said was an example of the state's interest in protecting the industry over local communities.Maria Eulalia Silva, president of the Ecuadorian Chamber of Mining, said illegal mining could put the legal mining industry at risk, deterring investors due to security concerns.The chamber has been working with the government to develop a plan to improve security in mining regions, she added.\"It is no secret that the Ecuadorian state does not have sufficient capacity to deal with this (illegal mining in general),\" said Silva.Separately, the legal mining sector's guild last month said opposition from Indigenous communities was holding up about $1 billion of investment for construction of three mining projects in Ecuador.",
        "CONAIE asked Ecuador's top court in March to annul a decree that sets parameters for community consultations on mining proposals. It instead wants earlier input on approvals for mining projects.CONCERNS OVER ILLEGAL MINING CRACKDOWNEcuador's illegal mining crackdown echoes similar raids in Brazil, where President Luiz Inacio Lula da Silva has declared illegal gold mining in Indigenous Yanomami territory a humanitarian crisis and in February launched evictions.In Ecuador's case, Gaston Schulmeister of the OAS said labeling illegal mining as a national security threat was \"very important, especially ... (for) the allocation of resources\".\"It's one more tool to give (the problem) visibility, awareness,\" said the director of the Department Against Transnational Organized Crime at the OAS.Ecuador, Colombia, Peru, Guyana and Surinam are part of an OAS project to tackle illegal mining regionally. It provides cash and expertise, and aims to create a cross-border taskforce.Benalcazar, the ex-official, said Ecuador needed a taskforce of its own, backed with international support and adequate technology, to properly monitor illegal mining in the country.But Terry of the ERI said he was skeptical of the state's ability to tackle the trade through force, saying that illegal miners in Napo had ultimately been undeterred by recent raids.The government must do more to monitor and regulate illegal and legal mining, he said, calling for better environmental controls - particularly around rivers - and stronger regulations on the sale of gold to track illicit activity.",
        "\"I don't see anyone complying with any of the laws and regulations\" Terry added. (Reporting by Kimberley Brown; Editing by Kieran Guilbert and Laurie Goering. The Thomson Reuters Foundation is the charitable arm of Thomson Reuters. Visit https://www.context.news/)"
    ]
}