{
    "articleURL": "/wires/ap/article-12052519/Saleh-says-Rodgers-fire-eyes-win-Jets.html",
    "content": [
        "FLORHAM PARK, N.J. (AP) - Robert Saleh has seen all he needs to know that Aaron Rodgers is all in with the New York Jets.",
        "For one, the four-time NFL MVP has been practicing with the team during voluntary workouts, something Rodgers hadn't done his last few offseasons with Green Bay.But there's something else. And it goes far beyond the football field.\"You just see a fire in a guy´s eye when you´re sitting and talking to him,\" Saleh said Friday after the team's first rookie minicamp practice. \"He´s coming to win. You can just feel it in his voice. You can see it in his eyes and the way he´s going about his business.\"Rodgers was acquired last week by the Jets, who got a player they believe will help them snap a 12-year playoff drought that is the longest active slump in the NFL - and lead them deep into the postseason.But these are the early days of that journey, and there were some who wondered about Rodgers' commitment to the process - especially since he stayed away from the Packers the past few years until mandatory practices. At his introductory news conference last Wednesday, the 39-year-old quarterback said he intended to be around the Jets often throughout the offseason.",
        "That has been the case so far. Rodgers has also been taking in his new town with his Jets teammates, attending two Knicks playoff games and a Devils-Rangers postseason showdown at Madison Square Garden.",
        "\"As a coach, you want them all here all the time, but I just felt like for him, he´s a very smart individual, very deep and very thoughtful,\" Saleh said. \"So I was never worried about whether or not he was going to be here. I always felt like if he did want to be here, he was going to be here, if he decided to be a Jet.\"Because he is so competitive and he does understand that he has to get acclimated to the new building. He´ll have to get the receivers acclimated to him and he´ll have to get the verbiage and get everybody in to help him get everybody on the same page.\"The Jets are holding rookie minicamp this weekend with their draft picks, including first-rounder Will McDonald, taking the field along with undrafted free agents. But Rodgers and the veterans practiced and held meetings earlier in the week, and the quarterback made an immediate impression.\"I´ve never been around a quarterback quite like him, personally,\" Saleh said. \"All his experience, his communication. ... He practically is another coach out there. He's pretty impressive.\"Saleh and a contingent of Jets representatives, including owner Woody Johnson and general manager Joe Douglas, flew out to Rodgers' home in Southern California to court him in March, and then waited for the quarterback to make his decision on his playing future. It was reported Rodgers also provided the Jets with a \"wish list\" of players he'd like to play with if he came to New York.",
        "Saleh dispelled the widely circulated notion it was a list of demands by Rodgers, calling it \"a silly narrative.\"\"It's very common for new faces to want old faces to be able to come in and help accelerate the installation of a program,\" Saleh said.The Jets coach said he had players he wanted to join him when he took over in 2021, including Solomon Thomas, Marcell Harris, D.J. Reed, Kwon Alexander and Laken Tomlinson. Saleh cited what Tom Brady did when he went to Tampa Bay and gave his input on players who could help the Buccaneers win.New York has six players who were teammates of Rodgers in Green Bay, including four signed in free agency: wide receivers Allen Lazard and Randall Cobb, backup quarterback Tim Boyle and offensive linemen Billy Turner. But Saleh also attributed that influx of former Packers players to offensive coordinator Nathaniel Hackett, who served in the same role in Green Bay from 2019 to 2021.\"So of course, you´re going to surround a coach with people who he feels will be able to plant the flag,\" Saleh said. \"So that whole narrative of what people are trying to put on the quarterback, I think it´s tired. But it´s common practice in the NFL.\"NOTES: Four of the Jets' seven draft picks signed their rookie deals: fifth-round RB Israel Abanikanda, sixth-round LB Zaire Barnes and DB Jarrick Bernard-Converse, and seventh-round TE Zack Kuntz. ... The Jets signed 13 undrafted free agents before rookie camp: DE Deslin Alexandre (Pittsburgh), WR Jason Brownlee (Southern Mississippi), LB Claudin Cherelus (Alcorn State), S Trey Dean (Florida), RB Travis Dye (USC), WR Xavier Gipson (Stephen F. Austin), LB Maalik Hall (Southeastern Oklahoma State), TE E.J. Jenkins (Georgia Tech), LB Caleb Johnson (Miami), OL Brent Laing (Minnesota-Duluth), CB Derrick Langford (Washington State), WR T.J. Luther (Gardner-Webb) and S Marquis Waters (Texas Tech).",
        "___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}