{
    "articleURL": "/wires/pa/article-12042439/Former-world-100m-champion-Tori-Bowie-dies-aged-32.html",
    "content": [
        "American former world 100 metres champion Tori Bowie has died at the age of 32.",
        "Bowie was also a three-time Olympic medallist and won gold for the United States in the 4x100m relay at Rio 2016.She won individual 100m gold at the 2017 World Championships in London.Her agency Icon Management said in a statement: “We’re devastated to share the very sad news that Tori Bowie has passed away.",
        "“We’re truly heartbroken and our prayers are with the family and friends.”On Instagram, World Athletics said: “World Athletics is deeply saddened by the passing of Tori Bowie, the 2017 world 100m champion and multiple Olympic medallist.“Condolences go out to her family and friends.”Bowie won bronze in the 100m at the 2015 World Championships before qualifying for the US Olympic for Rio.There she won silver in the 100m and bronze in the 200m before teaming up with English Gardner, Allyson Felix and Tianna Bartoletta to take gold in the relay, running the anchor leg.In London the following year she took the 100m world title as well as 4x100m gold.Bowie raced at the 2019 World Championships in Qatar but was not in the US squad for the delayed Tokyo Olympics that took place in 2021.Responding to the news, two-time world 200m champion and US record holder Noah Lyles wrote on Twitter: “This breaks my heart to hear and I will keep the family in my prayers.”",
        "Jamaica’s three-time Olympic champion Shelly Ann Fraser-Pyrce wrote: “My heart breaks for the family of Tori Bowie. A great competitor and source of light. Your energy and smile will always be with me. Rest in peace.”International Olympic Committee president Thomas Bach said in a statement on Twitter: “(I am) shocked and deeply saddened to learn of the sudden passing of Olympic gold medallist Tori Bowie.“In this moment of grief, let me express my heartfelt condolences to her family and friends. The sports world has lost a true champion.”"
    ]
}