{
    "articleURL": "/wires/pa/article-12044769/Photo-ID-compulsory-voters-England-s-local-elections.html",
    "content": [
        "The local elections will mark the first time it has been compulsory for all voters in England to have to show photo identification when arriving at polling stations.",
        "The much-criticised change was piloted regionally before the national roll-out for Thursday’s elections.Those turning up at polling stations will be required to show a form of photo identification, such as a passport, driving licence or blue badge.Other forms of identity that will be accepted include biometric residence permits, defence identity cards, and national identity cards issued by the European Union, Norway, Iceland or Liechtenstein.Critics of the move argue it could deter young people and ethnic minorities from voting.",
        "There have been questions raised about why bus and travel passes for older and disabled people are being accepted as photo IDs, but that young people’s travel cards will not be permitted.Professor Sir John Curtice, a polling expert, told the BBC there was “perhaps… a little bit of a partisan shadow about the way in which it has been implemented” given young people are “more inclined to vote Labour these days”.The policy is opposed by Labour, with the party encouraging voters to register for a postal vote which is not subject to the same voter ID regulations, the Liberal Democrats and the Green Party.Ministers have argued the change is required to reduce electoral fraud.The voter ID rules apply to England as of Thursday and will come into force for UK general elections from October.",
        "Voters in Northern Ireland are already required to present photo ID at elections.",
        "The UK Government estimates that around 2% of the population do not have an accepted form of voter ID.In the lead up to the elections, those affected were encouraged to sign-up for a voter authority certificate, a free form of photographic identification supplied by the Government which will be accepted by polling station staff.While the deadline for such certificates has passed, a Conservative MP highlighted that those included in that 2% of the electorate could still vote by proxy.Lichfield MP Michael Fabricant said: “If you’re one of the 2% who doesn’t have suitable ID and forgot to apply for a free voter authority certificate, you can still vote by appointing a proxy — who must have the correct photo ID.“As late as 5pm on Thursday, polling day, you can appoint a proxy to vote on your behalf.“There really is no excuse to give up your democratic rights.”Labour leader Sir Keir Starmer said that it was the responsibility for the Government to ensure voters knew about the changes to voter ID requirements.",
        "He told broadcasters on Wednesday: “I don’t want to see anybody turning up not knowing that they needed ID, because the Government bore full responsibility for making sure that everybody who can vote knows they have got to bring that ID.",
        "“We will be watching very carefully tomorrow to see where responsibility lies.”The Electoral Commission reminded voters on the eve of polls opening to remember to bring with them their identification.Craig Westwood, director of communications at the commission, said: “Anyone voting at a polling station in England will need to show photo ID before they can be given their ballot paper.“Before you head to the polling station, don’t forget to check your bag, wallet, or pocket to make sure you have the ID you need to vote.“Polling stations will be open from 7am to 10pm. If you don’t remember your ID when you arrive at a polling station, you can return with it later in the day.”",
        "Peter Stanyon, chief executive of the Association of Electoral Administrators, indicated that polling station staff would have limited scope to give voters leeway when it comes to new ID requirements.“The only leeway is they have got to be satisfied that the photo is a likeness. If someone turns up at the polling station without the ID or the wrong type of ID, they are duty bound to actually say we cannot give you the ballot paper unless you return with the correct form of ID before close of poll,” he told BBC Radio 4’s Today programme.",
        "But he said it was not “one hit and you have lost out”.“If you haven’t got the ID with you, you will be advised what you need to actually bring back later on.”More than 8,000 council seats in England are up for grabs on Thursday across 230 local authorities, ranging from small rural areas to some of the largest towns and cities.Polls are also taking place to choose mayors in Bedford, Leicester, Mansfield and Middlesbrough."
    ]
}