{
    "articleURL": "/sport/football/article-12044469/Pep-Guardiola-lauds-Erling-Haaland-broke-Premier-Leagues-single-season-goal-record.html",
    "content": [
        "Manchester City beat West Ham 3-0 to go top of the Premier League tableErling Haaland scored one, taking him to a record 35 in the league this season  Pep Guardiola has now challenged the 22-year-old to break his own recordPep Guardiola challenged Erling Haaland to break his own Premier League record after the Manchester City forward rewrote the history books last night.",
        "Haaland's deft clip to take this game away from West Ham United was his 35th league goal of the season - surpassing a record shared by Andrew Cole and Alan Shearer.The Norwegian now has the most goals in a top-flight season since Southampton's Ron Davies scored 37 times in 1967.Haaland was given a guard of honour by City's entire squad and backroom staff as he made his way down the tunnel after the 3-0 victory that took them back to the summit.'It was special - he deserved it,' Guardiola said. 'Without the team he couldn't do it but he is a special striker.",
        "'This record will be broken sooner or later, maybe by him in the future. We're very pleased for him because it's a joy to work with him and everyone is happy to have him.'Guardiola revealed that the idea of forming a guard of honour was pre-planned.'We thought about it,' he added.'In football with a special occasion you have to show how special it is. To overcome Cole and Shearer, incredible strikers, is special.'Shearer tweeted: 'Couldn't have wanted it to go to a nicer guy. It's only taken 28 years! He's the best.'",
        "Haaland, who has 51 in all competitions and needs 12 more to equal Dixie Dean's record, joked that he was left bruised after the celebrations.",
        "'It was really painful, everyone hit me on the back,' he said.'I don't think of these records, I'll sleep tonight and then I think about three points against Leeds. I will go home now and play some video games. I cannot say which, it's too embarrassing.'David Moyes was left frustrated by City's opening goal, scored by Nathan Ake just after the break. 'To concede from a set piece was galling,' Moyes said. 'We'd done a really good job until then.'"
    ]
}