{
    "articleURL": "/wires/ap/article-12040169/Benintendi-stars-White-Sox-Twins-3-2-10-innings.html",
    "content": [
        "CHICAGO (AP) - White Sox manager Pedro Grifol was on the coaching staff in Kansas City when Andrew Benintendi played for the Royals.",
        "Grifol thinks Benintendi is best appreciated over time.\"We're not going to really, really appreciate everything he can do until Game 162,\" Grifol said, \"and then everybody's going to see how much he really brings to the table.\"Benintendi made a pair of big plays on Tuesday night, robbing Carlos Correa of a homer and hitting a game-ending single to help the White Sox to a 3-2 victory over the Minnesota Twins.Hanser Alberto opened the 10th inning on second as the automatic runner and advanced on Elvis Andrus' sacrifice. After Tim Anderson bounced to shortstop, Benintendi lined a clean single into left against Caleb Thielbar (0-1).\"I was just trying to put it in play, put a good swing on something and, at the worst, make them make a play,\" Benintendi said.",
        "It was Benintendi's first start since he was hit on the right elbow by a pitch on Friday night.\"It's going to be sore for a while. That's the first time I've ever been hit on the elbow,\" he said. \"But it's good enough to get out there and play.\"Eloy Jiménez homered and Michael Kopech pitched six effective innings as the White Sox earned their second straight win after a 10-game losing streak. Kopech got some help from Benintendi, who made a leaping grab in left on Correa's drive in the first.",
        "Jimmy Lambert (2-1) pitched a scoreless 10th for the win, which came hours after the White Sox made 11 roster moves.\"We dug ourselves a hole and now we probably are going to have to take our time to get back to where we want to be,\" Grifol said. \"I´m not going to let anyone get too far ahead.\"Minnesota wasted another stellar performance by Joe Ryan, who pitched six scoreless innings. Nick Gordon hit his first homer of the season, and Trevor Larnach had a sacrifice fly.The AL Central-leading Twins had won six of eight.Ryan allowed one hit, struck out seven and walked two, lowering his ERA to 2.37. The right-hander is 8-0 with a 1.87 ERA and 70 Ks in 62 2/3 innings over 10 starts dating to last season.\"Just trying to go out there, fill up the zone and get outs,\" Ryan said. \"We got a really good defense.\"Ryan threw 60 of his 87 pitches for strikes. A 12-pitch walk to Anderson in his final inning played a role in the decision to take him out.\"He had an inning where he had to work a little bit,\" manager Rocco Baldelli said. \"He pitched great. His (velocity) was definitely at a low point in that last inning, and I didn't want to send him back out there if he wasn't feeling strong.\"",
        "Minnesota had a 1-0 lead when Jorge López replaced Ryan in the seventh. Andrew Vaughn greeted the reliever with a leadoff single and Jiménez connected for his third homer, sending a drive into the left-field stands.But Minnesota tied it at 2 on Gordon's first career pinch-hit homer, a leadoff drive against Alexander Colomé in the eighth.Colomé was promoted from Triple-A Charlotte as part of a flurry of pregame changes by the White Sox. Anderson was reinstated from the 10-day injured list, and rookie outfielder Oscar Colás was sent down.Anderson went 0 for 4 in his first major league game since he sprained his left knee on April 10 at Minnesota.TRAINER'S ROOMTwins: Byron Buxton has served as the team's regular designated hitter this season, but Baldelli said he could return to center field at some point. Buxton has been hampered by injuries throughout his career. \"He's just an incredibly consequential guy,\" Baldelli said.White Sox: Closer Liam Hendriks likely will begin a minor league rehab assignment by the end of this week. Hendriks is coming back from non-Hodgkin lymphoma. \"Just watching him be healthy and strong and a smile on his face and be here where he loves to be, just makes anybody´s day,\" Grifol said. ... RHP Reynaldo López (biceps fatigue) had some testing done, and Grifol said the reliever is going to take a day or two off before trying to throw again.",
        "UP NEXTWhite Sox right-hander Dylan Cease (2-1, 4.15 ERA) takes the mound on Wednesday night. He is 0-1 with a 7.07 ERA in his last three starts. Right-hander Louie Varland (0-0, 4.50 ERA) is expected to make his second start of the season for the Twins, stepping into the rotation after Tyler Mahle was sidelined by an elbow injury.___Follow Jay Cohen at https://twitter.com/jcohenap___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}