{
    "articleURL": "/news/article-12050573/SNP-MP-claims-struggling-party-use-elections-Scotland-votes-independence.html",
    "content": [
        "Pete Wishart was branded 'desperate' by unionists over newspaper columnClaimed the plan mooted by Nicola Sturgeon had been 'quietly parked'All elections where SNP wins more than half the vote should count as Indy RefA senior SNP MP has demanded that the party use every election in Scotland as a de-facto vote on independence, saying the referendum route to splitting the United Kingdom is 'dead'.",
        "Pete Wishart was branded 'desperate' by unionists after using a newspaper column to attack the stance of new leader Humza Yousaf.He said that the plan mooted by the First Minister's predecessor Nicola Sturgeon had been 'quietly parked'.Writing in the independence-backing National newspaper he said that every election in Scotland where the SNP won more than 50 per cent should be treated as a vote for the country to leave the UK.But even if re-adopted the idea could backfire on the party. Amid a police probe into its finances and the change of leadership the SNP is losing support ahead of the next vote, a general election expected late next year. Pamela Nash, chief executive of Scotland In Union, said: 'The party is now divided from top to bottom and becoming increasingly desperate in how it wants to achieve the only thing it really cares about.'The idea that elections can be used as referendums has been roundly trashed by experts and the wider public. Instead of trying to find new routes to constitutional chaos, the SNP should be finding a route to governing responsibly.'",
        "Mr Wishart, 61, a former musician, has been MP for Perth and North Perthshire since 2001, and is chairman of the Scottish Affairs Committee at Westminster. ",
        "He spoke out after successive UK prime ministers refused SNP demands for a second vote on independence. The 'once-in-a-generation' vote in 2014 saw Scots back remaining in the UK by 55 per cent to 45 per cent. Writing in The National, he said: 'The referendum route to independence is now dead. The UK Government have repeatedly said that they will not grant the necessary order or powers for an agreed process to take place. If anything they have become even more assertive in that view.'He went on:  'What I believe should now happen is that we contest every election with the first line of each successive manifesto stating that ''if the Scottish National Party secures 50 per cent plus of the vote this will mean Scotland will become an independent nation''. 'Every election will therefore become a verdict on independence and every vote secured for the SNP a vote to ensure our nation becomes sovereign.'It came as Ms Sturgeon committed to staying in the Scottish Parliament until the next election. Speaking on the Nicola Sturgeon Podcast, she said resigning as first minister was the 'biggest life change' she had gone through, leaving her having to 'almost rewire how my brain works'.Ms Sturgeon, 52, said on the sixth episode of the series that she had 'not been pursuing other opportunities' when co-host Glenn Campbell put to her rumours about her getting a job somewhere like the United Nations.",
        "'You know as well as I do, if I had been away touting myself for other jobs, you would know about it because these things would never be secret, and I haven't. I have been focused on this job, I don't know what I want to do next,' she told the podcast.It follows weeks of turmoil for the SNP after police arrested Ms Sturgeon's husband Peter Murrell, raided the home she shared with him and her party's headquarters, seized a campervan, and then later arrested the then party treasurer Colin Beattie as part of an investigation into how more than £600,000 in donations to the party earmarked for an independence referendum had been used.Both Mr Murrell and Mr Beattie were released without charge.Ms Sturgeon, who joined the SNP at 16, was among the first MSPs elected to the Scottish Parliament in 1999, and became first minister in November 2014 after her predecessor Alex Salmond stood down in the aftermath of the independence referendum that year.She told the BBC that she would remain in the Scottish parliament, but had not yet decided if she would fight to remain in Holyrood at the next election.'And who knows what the future holds? I've said before I would probably choose to write down the last 30 years, whether anybody will ever want to read it is another matter but I would probably choose to do it for therapy,' she said.",
        "Ms Sturgeon announced her resignation at Bute House in February.And she told the podcast that since then it had 'become much more obvious' to her that there was 'a process of decompression' that she had to go through.'This is the biggest life change I've ever gone through,' the former first minister said.'I don't think it will always be easy, I think I'm going to go through a period of adjustment and having to adapt to a different way of life that at times, I guess, I will find difficult.'I am going to have to, I was thinking about this just the other day, almost rewire how my brain works.'And none of that is going to happen overnight. And I think I'm just going to have to take it as it comes for a while and see how it all goes.'"
    ]
}