{
    "articleURL": "/wires/aap/article-12045633/Slater-Premature-make-Ponga-Origin-call-just-yet.html",
    "content": [
        "Queensland coach Billy Slater says it would be premature to make a call now on whether Kalyn Ponga will play in the No.1 jersey in the State of Origin series opener.",
        "Slater and fellow selectors Gene Miles and Darren Lockyer will name the Maroons side for the May 31 clash in Adelaide in just under three weeks and incumbent fullback Ponga's place in the team will cause plenty of discussion.The 25-year-old has played two games since returning from a six-week break after suffering a fourth concussion in 10 months. He struggled in Newcastle's 43-12 loss to Parramatta last week with NRL statistics listing him as missing eight tackles and he was uncharacteristically tentative while playing in the five-eighth position.Slater was asked whether Ponga would be selected if he gets through his next two games against Gold Coast and Cronulla.\"We will make that decision in three weeks. It is premature to make it now,\" Slater said.\"A lot of things can happen in the next three weeks, like they have in the last three weeks. In three weeks' time we will sit down as selectors and coaches and get all our cards on the table and we will build our best hand.\"We have a duty to Queensland to give them the best possible team that we think will go out and play their best footy. That (Ponga decision) will have to wait.\"Ponga has been outstanding in his seven Origin games for Queensland and was man of the match in the 22-12 series decider last year playing at fullback.",
        "Slater said incumbency \"counts\" at the selection table, but other factors come into play.\"Everyone talks about loyalty and there are a few things that go into that,\" he said.\"It is not just about playing. It is about doing the job in the past and it is also about instilling the habits in your current game, whether it is a month or two months of football, where Queensland can trust they are the habits you are going to bring into (Origin).\"You can't just flick a switch and turn it on. It is important to be playing well.\"Slater said he just wants Ponga to enjoy his football.The Dolphins' Hamiso Tabuai-Fidow and Brisbane's Reece Walsh have both had outstanding starts to the season and are in the mix to play fullback for the Maroons. Tabuai-Fidow can also play wing and centre.Walsh has impressed Slater with his development.\"We see all the shiny, bright stuff that Reece does. I can see underneath that and the development he is putting into his game and the position he plays,\" Slater said.\"He is building that capability in his game to play Origin but he has got to be capable when the opportunity is there as well.\""
    ]
}