{
    "articleURL": "/wires/aap/article-12048853/Dutton-weighs-intervention-troubled-Victorian-Libs.html",
    "content": [
        "The Victorian Liberals are resisting any intervention by the federal party which says a dispute involving an exiled Victorian MP is \"a whole mess\" that needs sorting out sooner rather than later.",
        "Moira Deeming was suspended from the parliamentary party for nine months in late March after attending an anti-transgender rally in Melbourne where neo-Nazis performed the \"sieg heil\" salute.She has threatened to legally challenge her suspension from the state party.Opposition Leader Peter Dutton said he was considering stepping in to deal with the growing issue.\"The whole mess needs to be sorted out sooner rather than later,\" Mr Dutton told ABC Radio on Friday.\"It doesn't help our brand. It doesn't reflect on the broader party movement.\"State deputy leader Matt Bach rejected the suggestion an intervention was required and said he understood it was not being seriously considered.\"I simply don't think that that's the right course of action,\" Mr Bach told reporters on Friday.In an email, Ms Deeming demanded Victorian Opposition Leader John Pesutto agree to a media statement exonerating her of being a Nazi or Nazi sympathiser by 2pm on Thursday or face legal action.Ms Deeming confirmed she would make good on her threat in a follow-up email to colleagues, saying the leadership was unwilling to work on a solution because of her setting a deadline.Mr Pesutto denied he ever said Ms Deeming was a Nazi or a Nazi sympathiser.He confirmed it was \"on the table\" for her to be expelled from the party over her planned legal action.",
        "\"This is a very serious step if it's taken but there's already a number of things that the partyroom is considering,\" Mr Pesutto told ABC News Breakfast on Friday.\"I will consult with them. I'm not going to air those publicly.\"Mr Pesutto said any federal intervention constituted \"organisational matters\" for the party, but he was confident he was the right person to lead the Victorian division.\"As hard as it is and as difficult as it looks right now ... this reform process will result in a strong party that is a good opposition and can become the government in 2026,\" he said.\"It's not going to be easy. I'm asking for time and patience.\""
    ]
}