{
    "articleURL": "/tvshowbiz/article-12059399/Olly-Murs-says-wishes-Coronation-concert-performance.html",
    "content": [
        "Olly Murs said he wishes he 'could have done more' in his performance at King Charles III's Coronation concert at Windsor Castle on Sunday evening. ",
        "The former X Factor star, 38, took to the stage to perform his classic hit Dance With Me Tonight in front of the Royal Family. He belted the high-energy number while looking effortlessly cool in a cream blazer and a pair of matching trousers.Murs reflected on his performance as he left the concert's after party later on Sunday, calling it an 'honour' to have performed - but wishing he 'could have done more' at the same time. Posting to his Instagram stories to his 4.4million followers, he said: 'Just leaving Windsor Castle after party, mingling with the royals. ",
        "'It was fantastic. Got to meet some absolute legends. Honestly thank you all for all your kind messages - I've seen it all, I've just been on social media now and just thank you for all your lovely messages about my performance.'I loved it! Wish I could have done more,' he shrugged, 'But what an honour it was!'The star went on to share his upcoming plans as he continued: 'I am off now for the next couple of weeks and I'm going to enjoy myself at home with Amelia and the dog and just have some me time!'But what a way to end the last couple of weeks by doing this. I loved every minute of it and I'm proud.'",
        "Twitter users said he was 'the best' of the star studded line up which also included Lionel Richie and Katy Perry. But despite the incredible show, some BBC viewers were left confused by the Essex singer's American accent. One wrote: 'What's with Olly Murs and the bizarre American accent??''I love Olly and I know he sings in an American accent but he's at the KING OF ENGLAND'S Coronation guys', said a second.",
        "The singer also revealed earlier on Sunday that he was holding back in his performance as he had to keep his shirt on to be 'professional'. Murs was interviewed before taking to the stage in front of King Charles III and Queen Camilla, as well as a crowd of 20,000 people.While Murs was happy to display his toned physique backstage, he insisted earlier in the day that he would not be whipping off his top during his performance. On being invited to perform, he said on BBC Radio 2: 'It's a bit surreal but I am so honoured. I am on tour at the moment so only yesterday I saw the stage. It's the biggest thing of my career.'It has the eyes of the world on it. This is something people will remember. It is really special. It's crazy. We just got an email asking me to do it!'",
        "When host Dermot O'Leary joked he looked muscly, Olly replied: 'I won't be taking my top off - I have to be professional.' "
    ]
}