{
    "articleURL": "/news/article-12042281/Who-involved-Kings-Coronation-procession.html",
    "content": [
        "For all the latest Royal news, pictures and video click hereSovereign's Escort of the Household Cavalry Mounted Regiment can be seen Royal Watermen and Yeomen of the Guard also involved in overnight rehearsalThe first glimpses of the Coronation procession seen during a rehearsal overnight have given an insight into what the pageantry will look like and who will be involved.",
        "MailOnline has analysed a photograph of the procession returning to Buckingham Palace down The Mall which shows the Gold State Coach centre stage - where King Charles III and Queen Consort Camilla will sit as they are greeted by crowds.The Sovereign’s Escort of the Household Cavalry Mounted Regiment - which is made up of the Life Guards and Blues and Royals - can be seen behind the coach.In front of the coach are Windsor Grey horses which are the only horses allowed to draw the Gold State Coach and only pull the carriages of the Royal Family.Seen next to the coach were the Royal Watermen - a 24-strong group who operate tugs and launches on the River Thames under the King's Bargemaster’s command.",
        "Next to them were Yeomen of the Guard - who can be distinguished from Yeomen Warders of the Tower of London by their cross belts, worn from the left shoulder.",
        "The photograph also showed the crowd barriers where spectators will stand behind on both sides of The Mall, which are well behind the guardsmen lining the route.It came as hundreds of soldiers, many on horseback, marched down from Buckingham Palace past Trafalgar Square and Downing Street to Westminster Abbey.The Diamond Jubilee State Coach was accompanied by hundreds of soldiers on horseback as it travelled along the Mall, setting off shortly after 12.20am today.",
        "Royal fanatics waited for over three hours for the parade to make a return journey down the Mall.Crowds ran through St James' Park to find the best spots near the palace with many trying to spot their relatives in their military outfits.Hundreds of soldiers from the military, navy and RAF marched through central London before stopping along Whitehall and standing in silence.Many carried a wide range of instruments such as saxophones, trumpets, horns and cymbals but only the drums were played by marching soldiers until they returned down the Mall after 3am.The parade had begun when soldiers dressed in bright yellow uniforms began the short journey and the brass band on horseback practised as they accompanied the stage coach as it passed through Westminster.",
        "Onlookers skipped along next to the stage coach and ran after the regiments of mounted soldiers that followed.Soldiers from a wide variety of regiments marched down the Mall after 1am.Buckingham Palace remained mostly silent with soldiers quietly maintaining protocol until a regiment playing the bagpipes brought the area to life shortly after 2.30am.Other soldiers were spotted parading in Parliament Square and practised changing position as Big Ben chimed.Artillery regiments rehearsed moving cannons on horseback and soldiers were seen pretending to fire the ceremonial weapons.",
        "The procession returned to Buckingham Palace shortly after 3am with bands in full swing.The Gold State Coach was spotted passing Buckingham Palace shortly after 3.20am."
    ]
}