{
    "articleURL": "/sport/football/article-12057257/Gary-Neville-credits-Arsenal-growing-2-0-win-Newcastle-Sunday.html",
    "content": [
        "Arsenal put in a strong performance on Sunday as they beat Newcastle 2-0Martin Odegaard scored the first goal before Fabian Schar's late own goalGary Neville felt the Gunners 'grew up' during the win at St James' Park Gary Neville lauded Arsenal for 'growing up ' in their 2-0 win over Newcastle on Sunday.",
        "Mikel Arteta's side put in an impressive display at a bouncing St James' Park as they handed Eddie Howe's side just their second league loss at the ground this season.Captain Martin Odegaard opened the scoring with a classy effort from outside the box, before a Fabian Schar own goal confirmed the three points.For Neville, the result was a big moment for the young Gunners' side, as he told Sky Sports: 'I thought they could get eaten alive today. When I saw the atmosphere and the first five minutes, nothing changed my mind. It was ferocious. 'Arsenal grew up a lot today. Arteta deserves credit for picking Jorginho as a lot of people would have said get  [Thomas] Partey back in midfielder. Odegaard showed a lot of class and Jorginho composed them. ",
        "'They’ve lacked that in the last few weeks. Martinelli and Saka still weren’t at their best but they had composure today.'The win moved Arsenal within a point of league leaders Manchester City, although Pep Guardiola's side do have a game in hand.Mikel Arteta said he felt the title race was not over after the win, but Neville pointed to a couple of results that he felt had cost them the league.'I think they will look back at that Southampton game at the end of the season, West Ham and Southampton,' he said. ",
        "The Gunners found themselves 3-1 down before rescuing a draw against Southampton last month, and threw away a 2-0 lead over West Ham in their next game.On Man City's prospects for the rest of the season, Neville added: 'The Real Madrid games are events in themselves, because those games come around once, twice, three times in your life time.",
        "'Pep Guardiola is here to win the Champions League. He knows what they're going to have to do to win those matches against Real Madrid.''City make a lot of games look easy, but Everton away next weekend is tough. Something could happen, it's that kind of stadium. 'The main thing is, I think it's still alive for Arsenal. The main thing is they recovered today, because they wobbled over the past few weeks.'Pep Guardiola's side face an important week as they travel to the Bernabeu for their Champions League semi-final on Tuesday, before facing Everton away on Sunday."
    ]
}