{
    "articleURL": "/wires/ap/article-12038819/Oregon-secretary-state-resigns-marijuana-job.html",
    "content": [
        "SALEM, Ore. (AP) - Oregon Secretary of State Shemia Fagan announced her resignation Tuesday amid sharp criticism from both Republicans and Democrats for having moonlighted as a highly-paid consultant to a marijuana business.",
        "Fagan, a Democrat, apologized on Monday for working for the marijuana company, but she indicated that she intended to serve out the remaining 20 months of her term. Making matters worse: Fagan worked for two months as a paid consultant for the marijuana business, which has a sketchy financial record, while her office was wrapping up an audit of the Oregon Liquor and Cannabis Commission.Fagan's consulting job, first reported on April 27 by Willamette Week, paid $10,000 per month, with bonuses three times that amount if she helped the company get licensed in other states. The secretary of state's salary is $77,000 annually - established almost a decade ago.In a virtual press conference Monday, Fagan apologized for taking the outside job and attributed it to \"poor judgment.\" She told reporters that she quit the moonlighting job. On Tuesday, she bowed to pressure to leave her elected office too.\"It is clear that my actions have become a distraction from the important and critical work of the Secretary of State´s office,\" Fagan said.Democratic Gov. Tina Kotek will appoint a successor to Fagan, whose last day is next Monday. No Oregon secretary of state has completed their four-year term for a decade, due to the resignation of a governor who was replaced by a secretary of state and a death in office from cancer of another secretary of state.",
        "Despite its low salary, it is an important job, tasked with overseeing elections and audits of state entities.The audit released Friday called for Oregon´s marijuana regulatory agency to \"reform\" some rules for marijuana businesses, saying they´re \"burdens,\" combined with federal restrictions. Fagan was absent during a Zoom news conference timed with the audit´s release.Her spokesman told that news conference that Fagan had recused herself from the audit, but it was too much for politicians across the political spectrum to swallow. Senate Republican Leader Tim Knopp and House Republican Leader Vikki Breese-Iverson immediately called for her to resign. On Tuesday,Kotek said she supported Fagan's decision.\"It is essential that Oregonians have trust in their government. I believe this is a first step in restoring that trust,\" Kotek said.Democratic leaders in the Legislature, where Fagan had served before being elected in 2020 to the state's second-highest office, issued a joint statement minutes after Fagan announced her resignation, saying she needed to go.\"Secretary of State Fagan´s severe lapses of judgment eroded trust with the people of Oregon, including legislators who depend on the work of the Audits Division for vital information on public policy,\" said House Speaker Dan Rayfield, Senate President Rob Wagner, House Majority Leader Julie Fahey and Senate Majority Leader Kate Lieber.",
        "\"This breach of trust became too wide for her to bridge. Her decision to resign will allow the state to move on and rebuild trust,\" they said.Fagan noted Monday that ethics guidelines allow outside employment. She said the consultancy for an affiliate of marijuana retailer La Mota didn´t represent a conflict of interest because any action taken as a result of the audit would be by the governor, Legislature or cannabis commission; and because a wide range of businesses would be affected by any regulation changes, not just her client.La Mota´s co-owner has hosted fundraisers for top Democratic Oregon politicians, including Fagan, while the co-owner, her partner and their business allegedly owed $1.7 million in unpaid bills and more in state and federal taxes, according to Willamette Week.At Monday´s news conference, Fagan fought back tears as she said she is \"deeply honored to serve as Oregon Secretary of state, regardless of the compensation.\"\"I owe the people of Oregon an apology,\" Fagan said. \"I exercised poor judgment by contracting with a company that is owned by my significant political donors and is regulated by an agency that was under audit by my audits division.\""
    ]
}