{
    "articleURL": "/wires/pa/article-12042029/Starmer-criticises-Tory-record-mortgages-housing-ahead-local-elections.html",
    "content": [
        "Sir Keir Starmer said millions will pay the price of Tory “recklessness” in higher mortgages and a shortage of homes as the party leaders clashed in their final exchanges before local elections in England on Thursday.",
        "The Labour leader put the focus on the fallout of Liz Truss’s short stint as prime minister and higher mortgage rates, while claiming Conservative councillors “simply don’t want to build the houses local people need”.But Prime Minister Rishi Sunak said Labour represented “higher council tax, higher crime, and a litany of broken promises”, accused them of failing to build enough homes in London and Wales, and said last time Labour were in power “there was no money left for the country”.The latter remark was a reference to Labour former minister Liam Byrne, who in 2010, as outgoing chief secretary to the Treasury, left a note for his Liberal Democrat successor which read: “I’m afraid there is no money. Kind regards – and good luck! Liam.”",
        "Sir Keir responded to the reference in the Commons, saying: “Debt doubled since 2010, growth down, tax up, the economy crashed. They’re going to need a bigger note.”But the retort prompted laughter and heckles from the Tory benches.The Labour leader opened the final Prime Minister’s Questions before local elections in some areas in England on Thursday by asking: “How many mortgage payers are paying higher rates since the Tory Party crashed the economy last autumn?”Mr Sunak replied: “Our record on homeownership is crystal clear – because of our tax cuts, 90% of first-time buyers now don’t pay any stamp duty at all.",
        "“Last year, we saw the largest number of people buying their first home in 20 years.“That is a Conservative Government delivering on people’s aspiration to own their own homes.” By the end of this year, nearly two million homeowners counting the cost of the Tories’ economic vandalism with every mortgage payment they make  Labour leader Sir Keir Starmer  Sir Keir said: “The answer that the Prime Minister avoided giving is 850,000.“Nearly a million people paying more on their mortgage each month because his party used their money as a casino chip.”He asked: “Does the Prime Minister know how many more people will be joining them on higher mortgage rates by the end of this year?”Rishi Sunak replied: “We know that our plans will deliver lower inflation and lower interest rates, but we know that his plans just mean more debt, and I quote ‘year after year after year’.“Those aren’t my words, that is the assessment of the former Labour shadow chancellor.”Sir Keir responded: “By the end of this year, nearly two million homeowners counting the cost of the Tories’ economic vandalism with every mortgage payment they make. Now he (Sir Keir Starmer) wants to impose top-down housing targets, he wants to concrete over the greenbelt and ride roughshod over local communities  Prime Minister Rishi Sunak  ",
        "“It’s not just those who already own their home that are counting the cost of Tory recklessness, the average deposit for a first-time buyer is going up to £9,000.”Mr Sunak replied: “That’s why we’ve introduced a 95% mortgage guarantee scheme, it’s why we’re helping people in social housing own their own home through our first homes and our shared home ownership schemes.”Sir Keir said: “£9,000 would take four years, they think it’s funny … roughly the annual bill to heat his swimming pool, but for most people, four more years of scrimping is a hammer blow to their ambitions.“And now he’s kicking them when they’re down, because his decision to scrap housing targets is killing the dream of homeownership for a generation. Why doesn’t he admit he got it wrong and reverse it?”Mr Sunak said: “I promised to put local people in control of new housing and I’m proud that that’s what I’ve delivered within six weeks of becoming Prime Minister.“Now he wants to impose top-down housing targets, he wants to concrete over the greenbelt and ride roughshod over local communities. Now previously he did say, he’s on record as saying, local people, local communities should have more power, more control. Now he’s U-turned, just another in a long list of broken promises.”",
        "Sir Keir responded: “His councillors simply don’t want to build the houses local people need, so he’s given them a way out.”He added: “Why doesn’t he stop the excuses, stop blaming everyone else, and just build some houses instead.”Mr Sunak said: “Our memories aren’t that short. We all know what happened last time when they were in power, there was no money left for the country.”He criticised Labour’s record on housebuilding, saying: “In London, the former Conservative mayor built 60,000 affordable homes in his first five years in office, how many did the current Labour mayor manage – half of that.“In Wales, we need 12,000 new homes a year, how many have Labour built in the last year? Half of that. Labour talk and the Conservatives deliver.”Mr Sunak said Labour stood for “higher council tax, higher crime, and a litany of broken promises”, adding: “Meanwhile, we’re getting on with delivering what we say, with lower council tax, lower crime and fewer potholes.”"
    ]
}