{
    "articleURL": "/tvshowbiz/article-12057943/Coronation-Concert-viewers-stitches-Miss-Piggy-Kermit-Frog-gatecrash-event.html",
    "content": [
        "A star-studded concert in honour of King Charles and Queen Camilla's Coronation took place in Windsor Castle on Sunday.",
        "And viewers were left in 'stitches' after iconic characters Miss Piggy and Kermit The  Frog gatecrashed the proceedings.In the hysterical sketch the duo bumped into host Hugh Bonneville, 59, as they made their way to the Royal box, with delighted viewers declaring the puppets royalty in their own right.Upon seeing the Downton Abbey star Piggy exclaimed: 'Look Kermit, it's him a Lord a real Lord'.Only for Hugh to mutter: 'No, I only played one on Television'.",
        "However the man hungry hog had her eyes well and truly set on the famous actor saying: 'Can you believe Moi is not yet a lady?'.She then enquired if 'Lord' Hugh was single, before throwing herself at him - right in front of her poor beau Kermit. Racing to Twitter one viewer wrote: 'Kermit and Miss Piggy are the kinda royalty I can get along with seeing'.A second commented: 'Miss Piggy and Kermit possibly one of the highlights which is saying something... well done Hugh though'.While another added: '@Hughbonneville Fantastic presenting on the King's Coronation was great to see you look well, loved the comedy between you Kermit The Frog and Miss Piggy was in Stitches. Followers also it 'The best bit' of the entire evening'. Someone else teased: 'Piggy, you are more of a queen than Camilla will ever be'. ",
        "Later fans rejoiced as Kermit 'brought some serious groove' to the Concert while dancing to Take That with Prince Edward in the Royal box. ",
        "He show as he waved a Union jack flag and threw his arms in the air as the band took to the stage.Much to the amusement of the Duke of Edinburgh and Baroness Scotland, Kermit belted out the lyrics to the 1995 smash hit Never Forget. Viewers were left in stitches at the scenes, claiming it was the 'highlight' of the concert seeing the character give it his all. Sharing their thoughts on Twitter one person wrote: 'The best part of the #coronationconcert was Kermit in the Royal Box.'Another added: 'Kermit The Frog doing the ‘armography’ to Take That’s Never Forget surrounded by royals is my hands down highlight of The #Coronation.''The best part of the #coronationconcert was Kermit in the Royal Box,' a third penned, while another shared: 'Kermit The Frog in the royal box bringing some serious groove!''Not a great fan of Katy Perry but she looked and performed wonderfully. Kermit stole the show singing along with Take That though,' one viewer stated. Another fan posted: 'Loved the #CoronationConcert so many great acts. Fantastic finale and Kermit dancing to Take That!''We were all Kermit at that moment. Banger of a classic tune to end the night. Amazing show,' a viewer wrote.",
        "King Charles took to his feet to dance alongside the Queen at the Coronation concert as they got carried away with their family to the music of Lionel Richie, Katy Perry and a spectacular Take That finale.Prince George and Princess Charlotte led the royals in a singalong during the final performance from the British boy band at Windsor Castle.Charles III and his wife Camilla also laughed uproariously at Miss Piggy and Kermit the Frog, who even appeared in the royal box with them before the stage and Windsor Castle were turned a patriotic red, white and blue.The couple were roared throughout by the 20,000-strong crowd, who did three cheers for the King and Queen when they arrived as the sun set for the show beamed into homes in 100 countries around the world.And as night fell, the royals donned their glowstick wristbands, got to their feet and started dancing to Lionel, as he sang All Night Long. Katy Perry belted out hits including Roar before Take That closed the spectacular show that included Shakespeare, ballet and a drone show reflecting the monarch's love of the environment, culminating in a blue whale soaring over the castle.At the finale, choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's song Never Forget, which gave the show an uplifting finale."
    ]
}