{
    "articleURL": "/wires/ap/article-12045655/Israelis-block-roads-protest-against-Netanyahu-legal-plan.html",
    "content": [
        "TEL AVIV, Israel (AP) - Israelis blocked roads and demonstrated on Thursday against a contentious government plan to overhaul the judiciary, hoping to ramp up pressure on lawmakers after parliament reconvened this week following a month-long recess.",
        "Prime Minister Benjamin Netanyahu paused the overhaul in March after intense pressure and the opposing sides are trying to reach a compromise agreement. But in a sign of the mistrust of his intentions, tens of thousands have continued to protest every Saturday night since.Thursday's midweek protest was smaller, but demonstrators are hoping to remind legislators of their presence and their past ability to disrupt the country over their opposition to the overhaul.Dozens of protests under waves of Israeli flags choked off major roads and intersections in seaside Tel Aviv, including briefly its main highway. Demonstrations took place outside the homes of Israel's ceremonial president and the country's National Security Minister Itamar Ben-Gvir, who in exchange for the plan being paused demanded Netanyahu grant him authority over a new national guard, which critics say would amount to his own personal militia.Police said several protesters were arrested for causing disturbances.Protest leaders have billed Thursday's events a call for \"equality,\" expanding their criticism to the rising cost of living in Israel and the military draft exemptions granted to most ultra-Orthodox Jews. Protesters dyed white a pool of water in the square of Israel's national theater in Tel Aviv, to symbolize a recent milk price hike.",
        "The plan to overhaul the country's judiciary, advanced by Israel's most right-wing government ever, plunged Israel into one of its worst domestic crises, ripping open longstanding societal rifts and creating new ones. While the freeze in the legislation eased tensions somewhat, Netanyahu's allies are pushing him to move ahead on the overhaul. The talks underway, meant to forge a path out of the crisis, do not appear to have produced any results.",
        "Netanyahu, who is on trial for corruption, faced a barrage of criticism over the legal plan from a broad swath of Israeli society, including business leaders, the booming tech sector and military reservists, who threatened not to show up for duty if the plan was approved. He relented only when a burst of spontaneous protests erupted after he fired his dissenting defense minister, a decision that was later reversed.Proponents of the plan, which would weaken the Supreme Court and limit judicial oversight on legislation and government decisions, say it is necessary to rein in what they say is an interventionist court and restore power to elected lawmakers.Opponents say it would upset Israel's delicate system of checks and balances and imperil its democratic fundamentals."
    ]
}