{
    "articleURL": "/wires/pa/article-12054851/Diverse-coronation-represents-new-era-British-history-guest-says.html",
    "content": [
        "The coronation was hailed as a diverse, inclusive ceremony that represents a new era in British history by academics, celebrities and members of the public.",
        "For many, the events have shown just how much Britain has changed in the years since the late Queen was crowned in 1953.The coronation ceremony featured female clergy members for the first time and a Bible reading from the practising Hindu prime minister Rishi Sunak.",
        "The coronation is a “watershed moment” for people to move on from the pandemic, said Rhys Mallows, 27, from Cardiff, who was a guest at the coronation.Mr Mallows repurposed his family-run gin distillery to produce more than a million bottles of hand sanitiser for emergency services during the Covid pandemic and was awarded a British Empire Medal in 2022.The coronation “symbolises moving on from where we were with the virus into that brave new future,” he told the PA news agency.“This coronation is very different from past ones and represents a more inclusive, more diverse future,” he added.Historian David Olusoga told BBC News the coronation has been a “huge effort to show the diversity of faith within Britain”.",
        "Dr Olusoga, professor of public history at the University of Manchester, was made an OBE in 2019, and recently provided commentary on the royal family’s relationship to the British Empire for the Duke and Duchess of Sussex’s Netflix documentary.“Today we’ve been reminded of the deep religious history of the country,” he said, adding the ceremony had “echoes of the mediaeval age”.",
        "“That sense of continuity, that sense of tradition, as a historian is absolutely fascinating.“I think what you saw today was a strong representation and a huge effort to show the diversity of faith within Britain, one of the things that’s very different between the Britain of today and the Britain of 1953.”The King has long made efforts to showcase and praise Britain’s diversity, and he ensured representatives of a number of faiths took part in the coronation, with Buddhist, Hindu, Jewish, Muslim and Sikh leaders all playing an active role.However, it has drawn criticism in some Commonwealth countries, with Rev Sean Major-Campbell, an Anglican priest in Kingston, Jamaica, saying the coronation is “only relevant in so far as it kicks us in the face with the reality that our hHead of state is simply so by virtue of biology”.",
        "British-Australian author Kathy Lette said on Saturday the King understands how “painful” Britain’s colonial heritage is.Speaking on Sky News, the writer, who has been described as a friend of Queen Camilla, said: “I think he [the King] understands that the colonial heritage is so painful and so fraught, and of course the world is moving on.”Ms Lette said while young Australians “don’t have an allegiance” to the royal family, the King “might connect” with young people “through the environment”.",
        "“Boomers and zoomers alike are so worried about climate change, and he was so ahead of his time, so prescient in those concerns, so he might actually resonate with young people and find a whole other connection,” she said.The ceremony had been adjusted up to the last moment to avoid controversy and a planned “homage of the people” was toned down shortly before the King was crowned, after the addition was criticised as too divisive.Jonathan Dimbleby, the King’s friend and authorised biographer, said the King would find the idea of a call for members of the public to pledge their allegiance “abhorrent”.Instead, Archbishop of Canterbury Justin Welby “invited” a show of support from the congregation."
    ]
}