{
    "articleURL": "/news/article-12044465/Launch-jab-help-weight-loss-paused-suppliers-fear-demand-high.html",
    "content": [
        "Weight loss services in Britain had expected Wegovy to hit shelves this weekBut now they have been told of a possible indefinite delay due to demand issues The launch of a 'game-changing' jab to help weight loss has been paused because suppliers fear demand will be too high.",
        "Weight loss services in Britain had expected Wegovy to hit shelves this week but have now been told there might be an indefinite delay.The weekly jabs were approved by the NHS and the National Institute of Health and Clinical Excellence (Nice) had recommended the drug to tens of thousands of overweight Brits.More overweight people in the UK were thought to be looking to take the injections privately.There have been suggestions it could be up to a year before the weight loss drug is seen in British stores.",
        "Wegovy manufacturer Novo Nordisk said it hoped the drug would be on shelves 'as soon as possible' but did not put a definitive time frame on availability, The Telegraph reported.The UK had also negotiated far cheaper rates for the jab than in the US, where it has been available for around two years.In America, it can cost up to $1,300 (£1,000) every month but in the UK was set to be priced at around £125-a-month.Last October, Elon Musk tweeted that the secret to his weight loss was 'fasting and Wegovy,' fuelling interest in the drug, known by the generic name, semaglutide.",
        "Semaglutide mimics a natural hormone released when food is eaten that regulates appetite.It also mimics a hormone that regulates insulin levels – making it a critical medication for diabetics.",
        "But the 'miracle' drug was found to be leaving patients with jowls, sparking a surge in demand for facelifts.Cosmetic doctors based in London reported an influx of patients demanding tightening of their saggy skin after taking Ozempic or Wegovy, with such rates having tripled within months. Both once-a-week injections contain semaglutide, a hormone-mimicking drug that tricks the body into thinking it is full, prompting people to eat less and lose weight.But the flab-busting drug doesn't discriminate which weight it targets, meaning as well as slimming down the waist it also eliminates facial fat.This leaves some patients complaining that they are left looking ill, exacerbating wrinkles, and causing skin to sag.The trend has been dubbed 'Ozempic face', with social media users posting dramatic before and after images of the effects of the drug. One medic, who took the drug himself, described how people thought he looked like a 'chemo patient' due to how it melted away his facial fat.And in March, US research on mice and rats suggested semaglutide could raise the risk of medullary thyroid cancer (MTC). Novo Nordisk, the Danish pharmaceutical giant that makes the weekly injection, is probing whether it may have the same effect in humans. Another study run by the firm itself is looking at whether semaglutide may lead to pancreatic cancer. ",
        "Both diseases are listed as being 'important potential risks' by European Medicines Agency (EMA) bosses. But no evidence yet proves they are definitely side effects — even in extremely rare cases.It means that Novo Nordisk does not have to list either disease as being a potential consequences in leaflets tucked inside the packaging of either Wegovy or its sister Ozempic, a slightly weaker version licenced for type 2 diabetes. A spokesperson for Novo Nordisk told MailOnline: 'We continuously collect and analyse data on the use of our medicines post marketing authorisation, and follow international pharmacovigilance standards to report and analyse any adverse events experienced by people taking our medicines.' They added: 'We work closely with the Medicines and Healthcare products Regulatory Agency (MHRA) to ensure that healthcare professionals have a thorough and full understanding of the safety profile of our medicines.' Thyroid cancer is already listed in the 'most important information' patients should know about Wegovy on the product's own website. Other rare side effects include diabetic retinopathy complications — damage to the blood vessels at the back of the eye."
    ]
}