{
    "articleURL": "/tvshowbiz/article-12047179/Candice-Swanepoel-sizzles-orange-bikini-swimwear-brand-Tropic-C.html",
    "content": [
        "Candice Swanepoel, 34, sizzles in three new snaps promoting her swimwear line Tropic of C.",
        "The Victoria's Secret Angel showed off her slim and trim figure in a bright orange bikini, baggy olive green pants and chunky black boots. She accessorized the sexy look with thick chains around her neck and a silver bracelet on her wrist.'That feeling when you just launch one of your favorite sets. introducing the sculpting infinity top + bottom in persimmon. the latest addition to our compression collection. discover more colors like blue crush,' one caption read.The model's voluminous blonde hair was straight and looked like she stepped right off the beach and into the photoshoot.",
        "'Inspired by nature’s beautiful natural colors, our latest silhouette comes in persimmon. our new triangle style featuring a twist design in the front,' a caption on another photo read.The final caption said, 'bright, bold and beautiful, our latest drop features this eco-friendly sculpting compression set in our freshest color, persimmon.'The model recently made an appearance on Gigi Hadid and Tan France's series Next in Fashion as a guest judge for the swimwear competition.In an interview with V Magazine, Candice got candid about that experience and whether or not she has a future on television. 'I would probably enjoy being part of filming a show of some sort, I had such a great time filming, I was honored to be invited by the team, and bring my expertise to that segment of the show. Gigi has always been a wonderful supporter of my career and filming with her was especially fun,' she said.",
        "She continued: 'As a young girl, I was obsessed with watching American idol and talent shows that enabled new artists to have their moment in the spotlight, there is something so beautiful to me about the raw emotion of it all. I love a success story. It always touched me.'The mom of two sons also explained why she was inspired to create an eco-friendly and sustainable swimwear line.'Having children makes you think about your impact on a much greater level too. I wanted to do something that wasn’t being done where there is a will there is a way, and now it is becoming the norm, which is a huge leap in the right direction.'",
        "'I have always been passionate about nature, and being connected to a greater consciousness, so I have a great respect for it. Anyone that has followed my journey would know that’s a huge part of my essence,' she said.'I grew up understanding that we are all energy and that whatever you put out in the world comes back around. 'I always asked myself how we can better live as part of one big ecosystem, it’s definitely much bigger than we can comprehend but as long as I’m doing what I can do to be better or inspiring other brands to do the same, it makes me happy,' she continued.",
        "'It was only natural for me to find a way to be proud of what the continuation of my story would be,' she concluded. "
    ]
}