{
    "articleURL": "/wires/reuters/article-12046759/India-amends-power-policy-draft-halt-new-coal-fired-capacity--sources.html",
    "content": [
        "By Sarita Chaganti Singh and Sudarshan Varadhan",
        "NEW DELHI/SINGAPORE, May 4 (Reuters) - India plans to stop building new coal-fired power plants, apart from those already in the pipeline, by removing a key clause from the final draft of its National Electricity Policy (NEP), in a major boost to fight climate change, sources said.The draft, if approved by the federal cabinet chaired by Prime Minister Narendra Modi, would make China the only major economy open to fresh requests to add significant new coal-fired capacity.India and China account for about 80% of all active coal projects as most developing nations wind down capacity to meet climate targets. As of January 2023, only 20 countries have more than one coal project planned, according to E3G, an independent climate think tank.\"After months of deliberations, we have arrived at a conclusion that we would not need new coal additions apart from the ones already in pipeline,\" one of three government sources said.The sources declined to be identified as they are not authorised to speak to the media. India's power ministry did not respond to requests seeking comment.The new policy, if approved, would not impact the 28.2 GW of coal-based power in various stages of construction, the sources said.China and India have together been lobbying for freedom for countries to choose a roadmap to cut emissions.",
        "India, whose proposed coal power capacity is the highest after China, had repeatedly refused to set a timeline to phase out coal, citing low per-capita emissions, surging renewable energy capacity and demand for inexpensive fuel sources.Coal is expected to be the dominant fuel in generating electricity in India for decades, but activists have pressed for a halt to new coal-fired plants, arguing this would at least help to reduce the share of the polluting fuel in overall power output.The draft, India's first attempt at revising its electricity policy enacted in 2005, also proposes delaying the retirement of old coal-fired plants until energy storage for renewable power becomes financially viable, the sources said.So far, old coal-fired power plants with a cumulative capacity of 13 GW have been earmarked for functioning post retirement deadline to meet high power demand, they said.CHANGE IN STANCEIn the first draft of the NEP in 2021, India had said it may add new coal-fired capacity, though it proposed tighter technology standards to reduce pollution.The Central Electricity Authority, an advisory body to the federal power ministry, had said last year India might have to add as much as 28 GW of new coal-fired power in addition to the plants under construction to address surging power demand.",
        "However, the final draft, which will guide India's policymaking on energy over the next decade, features no references to new coal-fired power, the sources said.In contrast, China's National Development and Reform Commission said in a March 2022 document that outlined its energy policy, that the world's largest coal user \"will rationally build advanced coal-fired power plants based on development needs.\"China plans to build some 100 new coal-fired power plants to back up wind and solar capacity, which analysts said goes against Beijing's stated intention to reduce the role of coal.The policy revision could also impact long-term coal prices and miners in Indonesia, Australia and South Africa, as India is the world's second-largest coal importer.(Reporting by Sarita Chaganti Singh in New Delhi and Sudarshan Vardhan in Singapore; Additional reporting by Muyu Xu in Singapore; Editing by Sharon Singleton)"
    ]
}