{
    "articleURL": "/wires/ap/article-12057367/Analysis-Wembys-farewell-tour-French-celebration.html",
    "content": [
        "Victor Wembanyama´s first basket on Sunday night looked so easy. He deflected a pass, ran it down, dribbled twice and dunked the ball with his left hand.",
        "And 15,000 people - about four or five times the size of the usual crowd at his home games - roared.He´s called a generational talent, though really, there´s never been one in France quite like Wembanyama. The 7-foot-3, 19-year-old, soon-to-be No. 1 pick in the NBA draft is on his farewell tour of his homeland, playing his final pro games there before he comes to North America and accepts the challenge of trying to truly become the game´s next superstar.His final numbers for Boulogne-Levallois in its 93-82 win over Bourg-en-Bresse on Sunday: 25 points, 10 rebounds, four assists.A fine night, for certain, but nothing that´s out of the ordinary for this extraordinary kid. He´s that good, he's proven it every time he takes the floor - and as the enormous hype surrounding his move to the NBA continues to grow, he´s showing no signs that it´s getting to him in any way whatsoever.\"I'm excited for the NBA,\" said Pau Gasol, who'll be inducted into the Basketball Hall of Fame later this year after a stellar career both in the NBA and internationally for his native Spain. \"And I'm excited for this kid.\"",
        "As most people should be.San Antonio, Detroit, Houston, Charlotte and a bunch of other places are crossing their fingers even more than usual these days. The NBA draft lottery is May 16 in Chicago. That means in about a week, we'll know where Wembanyama is going to play next season. There will be no mystery. The team that wins the lottery isn't trading the pick, or isn't going to need five weeks to figure out what to do. There hasn't been a sure-fire No. 1 pick like this one since LeBron James in 2003. That worked out pretty well; he only became the all-time leading scorer in NBA history.",
        "\"Ten days before knowing my future team,\" Wembanyama tweeted on Saturday, in French. \"It´s really a crazy thing.\"Indeed, the new chapter is nearing and nearing fast. He's leaving France soon - and this good-bye, evidently, will not be a sad one. Wembanyama only has a few games remaining left in his French season, and if Sunday was any indication the basketball fans in his homeland are going to send him off in style.They cheered when Wembanyama ran onto the floor Sunday night for pregame introductions. They cheered again when he took his first shot, even though it missed. They cheered much louder when he scored his first points on a transition dunk. And they kept cheering pretty much all game long - except, well, when Wembanyama asked them not to.He got called for his fourth foul (they only get five per game in France, unlike the six players get in the NBA), with 5:19 left when a defender - we're just being honest here - flopped and a referee fell for the acting job. Wembanyama got called for the offensive foul, heard some whistles of disbelief from the crowd and waved his arms as if to ask the crowd to whistle some more.Naturally, they obliged.\"I have the impression that the people here were real basketball fans who bought their tickets in advance,\" Wembanyama said after the game. \"It´s nice.\"",
        "Even the venue on Sunday night was part of the farewell plan. Wembanyama´s home games for his Boulogne-Levallois team in Paris are typically played before something like 4,000 fans, inside an arena that resembles the types of gyms that many NBA players had at their disposal in high school.It´s a tough ticket, to put it mildly.So a few months ago, someone had the brilliant idea to move one of the club´s late-season home games into Accor Arena - basically an NBA-sized building. He starred there in December in the French All-Star game. He got tons of attention there in January when he showed up to watch an NBA game between Chicago and Detroit. He got mobbed just as he walked to his courtside seat that night, the crowd around him spilling a few feet onto the floor and being totally oblivious to the actual NBA players who were warming up before them in that moment.\"The demand for seats for the games has been constantly growing, which has led the club´s management to look for a solution to be able to offer as many people as possible the opportunity to attend a Metropolitans game led by Victor Wembanyama,\" his team said in a statement announcing the venue change.Demand was overwhelming, as expected. Sunday morning, a few hours before tipoff, tickets were available on the secondary market for about $285 apiece. Seats in the same area of that arena for Tuesday night's Arctic Monkeys concert were going for $79.",
        "Most people stayed until the end, hoping to catch one of the autographed T-shirts that Wembanyama tossed into the crowd after he saluted them with applause of his own - while acknowledging that he was thinking ahead - not to the NBA lottery, but the French playoffs and a chance to win a title before he moves on.\"With a team like this, with teammates like this, everything is possible,\" he said.Wemby's farewell tour is underway. It may last a few weeks, depending on how far his team goes in the playoffs. This much is clear: It'll be a celebration, and that's exactly what it should be.___AP Sports Writer Samuel Petrequin contributed to this report.___Tim Reynolds is a national basketball writer for The Associated Press. Write to him at treynolds(at)ap.org.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}