{
    "articleURL": "/wires/ap/article-12057869/Miller-Topa-lead-Mariners-slumping-Astros-3-1.html",
    "content": [
        "SEATTLE (AP) - Bryce Miller gave up two hits over six shutout innings for his first major league win, Justin Topa worked around a leadoff single in the ninth for his first big league save and the Seattle Mariners beat the Houston Astros 3-1 Sunday to take two of three from the World Series champions.",
        "First baseman José Abreu made a run-scoring error in a two-run third inning and Matt Gage committed a bases-loaded balk when he relieved in the fifth.Held to five singles and a double, the World Series champions lost for the fourth time in five games. The Astros have lost three straight series and are 17-17.Julio Rodríguez, in a 1-for-18 slide, hit his sixth home run of the season for the Mariners, who have won six of seven.A week after becoming the third player in major league history to strike out 10 with no walks in his debut, the 24-year-old Miller (1-0) struck out five with a walk and held the Astros to two singles over six innings.He induced eight swings and misses among 37 swings at his fastball, which averaged 95.8 mph.",
        "\"His fastball is very unique,\" Mariners manager Scott Servais said. \"It´s got a ton of ride on it. How he comes off the mound, how it comes out of his hand, I'm super-impressed with the command of it. He threw a lot of really good fastballs on the inside part of the plate, which is kind of a step down the road.\"Miller said he got his second clubhouse celebration in a week that included mustard, mayonnaise, beer and other mysterious substances.",
        "\"My eyes were closed and I went straight to the shower,\" he said.Topa, a 32-year-old right-hander, got his first save since 2019 with Class A Carolina. Yordan Alvarez singled on his first pitch, but Topa got Abreu to ground into a double play and threw a called third strike past Kyle Tucker.\"We played really good baseball all weekend outside of a late home run in game one,\" Servais said.Rodríguez´s 454-foot homer to left-center, the longest of his big league career, put Seattle ahead in the third inning. Eugenio Suárez doubled and scored when Abreu flubbed Cal Raleigh´s routine grounder.Astros manager Dusty Baker pulled starter Brandon Bielak (0-1) with the bases loaded in the fifth, and Gage was called for a balk for lifting his foot off the rubber twice before throwing a pitch.Tucker followed Abreu´s one-out double in the seventh with an RBI single against Gabe Speier.Asked if he might consider giving some players selective rest as they continue to struggle, Baker said it's possible.\"There's a lot of guys that could benefit, but like I said, we're off every six days,\" Baker said. \"And it's like they don't seem fatigued. They may be mentally fatigued, but the roster is what we have at this moment.\"",
        "BENCHES CLEAREDBoth benches and bullpens cleared in the fourth when Seattle's José Caballero and Astros catcher Martín Maldonado squared off at home plate. The two appeared to be at odds after Caballero called time on the previous pitch. After a swing and miss, Caballero faced off with Maldonado and the two exchanged words as their teammates streamed onto the field.BAKER AND BLUEBaker mourned the death of his friend and former competitor Vida Blue.\"That´s my partner,\" Baker said. \"I didn´t hit him very well. ... I´ve been talking to Vida on and off for the last couple of months and he didn´t call back the other day, so I figured something was wrong. ... I knew he was sick, but it´s a tough day.\"TRAINER´S ROOMAstros: 2B Jose Altuve took batting practice for the second consecutive day. Baker said he has not yet spoken with Altuve about a timeline for a return, but that he would need a rehab assignment before rejoining the lineup. Altuve broke his right thumb during the World Baseball Classic.Mariners: 2B Kolten Wong (wrist) was out of the lineup after rolling his wrist while making a diving stop Saturday night in the 7-5 win over the Astros. ... Servais did not have an update on SS J.P. Crawford, who fouled a pitch off his knee but stayed in the game.",
        "UP NEXTAstros: Rookie RHP Hunter Brown (3-1, 2.60), coming off his first big league loss, starts Monday's series opener at the Los Angeles Angels and LHP Patrick Sandoval (3-1, 293).Mariners: RHP Logan Gilbert (1-1, 4.01) brings a streak of six games with six or more strikeouts into Monday´s start against the Texas Rangers and RHP Jon Gray (1-1, 4.40). ___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}