{
    "articleURL": "/sport/football/article-12038951/Prolific-hitman-Haaland-better-season-warns-Man-City-boss-Guardiola.html",
    "content": [
        "Prolific Haaland has scored 50 goals for in all competitions this seasonMan City have moulded the 22-year-old into a more rounded centre forwardGuardiola believes his quest for improvement makes him an even greater threat Pep Guardiola has warned that Erling Haaland will be even better next season as the Norwegian stands on the verge of smashing Premier League records.",
        "Manchester City host West Ham with Haaland one goal from surpassing Alan Shearer and Andrew Cole’s tallies of 34, both set when the division comprised 22 teams.Haaland has a half-century in all competitions this season and Guardiola believes the 22-year-old’s constant quest for improvement makes him an even greater threat, likening his hunger to Lionel Messi’s.‘His game can improve a lot,’ said the City manager.‘He has the desire to get better — as long as he has that, he can do it. To go to work knowing you can do something better is the way. He has that feeling of, “Is that enough?” ‘When you talk with him he is open-minded, saying, “Yeah, I have to do it, I can do it better”. That’s so positive for his career.",
        "‘It’s not arrogance. It’s self-confidence to say I am going to score. To arrive in his first season and score 50 already, equalling the record for two legends in Cole and Shearer, that’s so big.‘No one can compare with Messi, it will not help Erling, but in terms of goals and mentality yes. He has got to the same level in terms of goals. It’s almost every game, he scores a goal. One or two every game but Messi is the most complete player I have seen.’",
        "City have moulded Haaland into a more rounded centre forward. Only eight players — including Kevin De Bruyne, set to miss on Wednesday night with a knee problem — have provided more assists in the Premier League this season and there has been a noticeable willingness for the striker to become more involved in their build-up play.‘We have the feeling every game he will score a goal and that helps a lot,’ Guardiola added. ‘But it’s not just about that. He gives us many things, pressing, defensively. He is involved in long balls and before we didn’t have that.",
        "‘How he helps us to keep the ball, link with him and after runs with the other players. He helps to give us an extra issue that we maybe didn’t have in the past. Gabriel Jesus was exceptional but now we have Erling’s presence. We have to use it.’Guardiola said that it took City’s midfielders time to get used to having a proper striker to hit. He used video sessions to hammer home how to engineer the best from Haaland.‘Many times in the beginning he made movements between the central defenders and we didn’t pass the ball because we were not used to those type of balls,’ he said. ",
        "‘One game I remember having 25 clips and we said, “Look at Erling, the movements he has”.‘Everyone said if you give him the ball he is in front of goal, so why did you not give it to him? That’s why everyone said it would be difficult to adapt.’"
    ]
}