{
    "articleURL": "/sport/football/article-12048243/Fans-baffled-Moises-Caicedo-wore-unnecessary-bodycam-Brightons-clash-Man-United.html",
    "content": [
        "Brighton beat Manchester United 1-0 thanks to a 99th minute penaltyFans were confused by a stunt that saw Moises Caicedo wear a bodycamSupporters compared the stunt to Ben Fosters' filming antics with Watford Fans have been left baffled by Moises Caicedo's 'unnecessary' bodycam worn ahead of Brighton's 1-0 win over Manchester United on Thursday night.",
        "The highly-rated midfielder provided POV coverage of his handshakes before the game, but removed the camera before kick off.It comes as part of a stunt by Sky Sports to give a 'behind the scenes' view of the Brighton side, which has also featured cameras in the dressing room showing Roberto de Zerbi's passionate team talks.The bodycam did not go well down with fans, with many questioning just 'why' Caicedo had been asked to wear it.Others felt it was 'unecessary' and compared the 21-year-old to Wrexham goalkeeper Ben Foster, who famously places a camera in the corner of his goal to record matchday vlogs.",
        "There were also those who felt the footage was reminiscent of a 'Nike advert' as most fans seemed confused as to what the stunt added.Some fans did enjoy the half-time insight, as one tweeted: 'That bodycam on Caicedo is just insane.'We've also got a glimpse into Brighton's halftime team-talk and it's actually good stuff. We need more of the same across the Premier League. Inside the dressing room cams are actually a great thing.'Aside from off-pitch controversies, Brighton put in a typically impressive performance against United.After being the better side all game, they snatched the three points with a penalty from Alexis Mac Allister in the 99th minute.",
        "It came after a late VAR call spotted a handball from Luke Shaw in the box, as United once again lost on the road.The win moves Roberto de Zerbi's side into sixth place, four points off Liverpool having played two games less. "
    ]
}