{
    "articleURL": "/sport/football/article-12054665/THE-NOTEBOOK-Haaland-draws-blank-rollicking-Walker-follows-one-game-time-mantra.html",
    "content": [
        "Manchester City survive late scare as they beat Leeds 2-1 to go four points clearHosts were 2-0 up through a Gundogan brace when they were awarded a penaltyHaaland handed the ball to Gundogan but his spot kick rebounded off the post Manchester City went four points clear of Arsenal at the top the Premier League on Saturday, beating Leeds United 2-1 with a pair of near-identical goals from Ilkay Gundogan, stretching their winning league run to 10 games.",
        "City's prolific striker Erling Haaland graciously handed the ball to Gundogan to take a penalty kick in the 84th minute for what would have been a hat trick, but his effort rebounded off the post.City had run circles around Leeds with numerous excellent scoring chances before Gundogan struck in the 19th minute from the edge of the 18-yard box off a pass from Riyad Mahrez. Mahrez teed up Gundogan again eight minutes later in a carbon copy of his first goal.Rodrigo Moreno pulled one back for Leeds in the 85th minute.Mail Sport's RICHARD TANNER looks at some of the things you may have missed. ",
        "Haaland draws a rare blankErling Haaland had a frustrating afternoon, drawing a rare blank and earning a rollicking from Pep Guardiola.Haaland sportingly handed over the chance to increase his tally by passing penalty-taking duties to Ilkay Gundogan who had the opportunity to complete his hat-trick.",
        "41 Jimmy Greaves 1960-61 Chelsea38 John Charles 1956-57 Leeds37 Jimmy Greaves 1962-63 Spurs37 Ron Davies 1966-67 Southampton37 Dennis Westcott 1946-47 Wolves36 Bobby Smith 1957-58 Spurs35 Erling Haaland 2022-23 Man City35 Jimmy Greaves 1963-64 Spurs",
        "But the City skipper smashed his effort against the post - and Haaland was angrily rebuked by Guardiola for not taking it, especially as Leeds pulled one back moments later to set up an anxious final few minutes for the leaders.",
        "Haaland may have set a new record for a Premier League campaign with 35 goals he still has a bit to do to to match Jimmy Greaves' post Second World War record of 41 League goals in a top flight season.The legendary Greaves hit an incredible 41 for Chelsea in the 1960-61 season. In fact he appears three times in the top eight list. He also notched 37 for Tottenham in 1962-63 and 35 for the North London club the following season.Walker follows 'one game at a time' mantraKyle Walker has not enjoyed the easiest of seasons.An early season injury came close to costing the defender the chance to play for England in the World Cup in Qatar.And in recent months he been in and out of the City team with Pep Guardiola also using youngster Rico Lewis, John Stones, Nathan Ake and Manuel Akanji in the right back slot.Guardiola even went so far to say Walker couldn't play the 'inverted' right back role in which he has used Stones and Lewis so successfully.Lewis was the preferred starter against Leeds but in an interview in the match programme Walker is clearly in no mood to rock the boat with any public complaints.'I've been round the block,' he said. 'When I signed at Tottenham [from Sheffield United] there were seven right backs in front of me so I do like a challenge.",
        "'If the manager doesn't think my performances are up to scratch then I shouldn't play because we're at a fantastic club and you know whoever comes in is going to perform.'At other clubs it's probably 12 or 13 players [in contention for first team starts] but here everyone is so good. Defending one versus one is what I bring to the team.'With the prospect of City matching neighbours Manchester United's 1999 treble of Premier League, FA Cup and Champions League edging ever closer, Walker is following the familiar but understandable 'one game at time' mantra.'This is what you live for as a footballer - to be competing at the highest level,' he said. 'I'm not even concentrating on the treble. It's just the next game. We have great sights and ambitions but we have to go one game at a time. Every game is a cup final and we need to make sure that the players don't have an off day.'More frustration for Phillips The frustrating times continue for Kalvin Phillips.Even with usual midfield nachor man Rodri rested ahead of the Champions League semi-final first leg against Real Madrid on Tuesday, the England international was left unused on the bench against his former club.Pep Guardiola rotated his squad and made seven changes form the midweek win over West Ham, selecting Ilkay Gundogan - who marred a superb game by missing a penalty chance to complete his hat-trick - and energetic youngster Rico Lewis as his midfield two.",
        "It means Phillips is running out of time to make his first Premier League start for City since his move from Elland Road last summer. City have four League games left.His last League start was actually FOR Leeds against Brentford when they sealed their survival in their final day of last season at Brentford.Phillips could pick up three medals at the end of the season but deep down surely he won't feel as if he's earned them.Watch out for treble wreckersAs talk of the treble intensifies, Manchester City will no doubt take note that their neighbours United - quite apart from achieving the treble themselves in the 1998-99 season - have also wrecked the trophy treble hopes of both Merseyside clubs back in the day.In 1977 they stopped Liverpool from adding the FA Cup to the League and European Cup Bob Paisley's side won that season.And in 1985 they did the same to Howard Kendall's Everton, who had won the domestic title and the European Cup Winners' Cup.Allardyce makes big early call",
        "A big early call from Sam Allardyce to drop goalkeeper Illan Meslier, who has been an ever-present in the Leeds goal this season but has been guilty of a few errors in recent weeks.",
        "Wigan and Everton goalkeeper Joel Robles came for his first Premier League appearance for Leeds and did well enough to suggest he will keep his place for the final three games.Meslier was one of four changes made by Big Sam makes from the team that lost 4-1 to Bournemouth in Javi Gracia's final game in chargeThe others saw Junior Firpo and Max Wober come into defence and Adam Forshaw return in midfield. Robin Koch, Liam Cooper and Crysencio Summerville were the outfield players to make way.."
    ]
}