{
    "articleURL": "/wires/aap/article-12058211/Review-details-benefits-exclusive-Sam-Smith-concert.html",
    "content": [
        "A controversial and exclusive concert in South Australia featuring British singer Sam Smith generated $32 million in advertising value, the state government says.",
        "But the government has overhauled how it will deal with social media influencers in the future after widespread criticism of the event.The concert at a winery south of Adelaide in January was open only to about 200 invited celebrities and social media influencers along with about 100 people who won tickets through interstate radio promotions.Those influencers were not paid to attend but their travel and accommodation expenses were covered, drawing criticism over their worth as a promotional exercise.The state government defended the cash it spent to bring Smith to SA, but revealed only that it was much less than the $1 million figure suggested by the Liberal opposition.On Monday, Tourism Minister Zoe Bettison released a review of the event which showed TV coverage reached 8.3 million people and influencer content reached 2.4 million.It also resulted in more than 150 pieces of global media coverage in outlets such as the magazines Rolling Stone and Billboard.\"The opportunity to partner with a multi-Grammy award-winning artist such as Sam Smith provided the opportunity for South Australia to not only garner global recognition but also take precedence over other states who often get these kinds of opportunities offered to them first,\" Ms Bettison said.\"We delivered a multimillion-dollar advertising benefit and millions of people around the world were introduced to South Australia through their screens and on their radios.\"",
        "However, the minister said as a result of the review the state's tourism commission had revamped how it would select social media influencers for such promotions and had introduced a platform to monitor their performance.It will also implement a new contractual agreement for those social media stars.Opposition tourism spokeswoman Jing Lee said the government's claims in relation to the concert were a case of \"pulling numbers from thin air\".\"It's crystal clear that the numbers being pushed by the government are bogus,\" Ms Lee said, adding that the event was another example of the Labor government getting its priorities wrong.Smith's next Australian concert tour will open in Adelaide in October before moving to Melbourne, Sydney and Brisbane."
    ]
}