{
    "articleURL": "/sport/football/article-12059005/DANIEL-MATTHEWS-Jorginhos-leadership-pivotal-vs-Newcastle-bought-games-like-this.html",
    "content": [
        "Jorginho's leadership helped Arsenal beat Newcastle 2-0 at St James' Park The Italian midfielder's poise and control was vital to helping the Gunners winWhile Odegaard scored the first goal, he handed his MOTM award to the Italian St James' Park was shedding all of the colour and noise of the previous 90 minutes when Mikel Arteta wandered towards the tunnel to continue the Arsenal celebrations. He wore a beaming smile and his arm was draped around the shoulders of Jorginho.",
        "It was no coincidence and no surprise that, as the Gunners celebrated three points that kept their title hopes alive, Arteta sought out the midfielder.Martin Odegaard will rightly take the plaudits for his goal and the way he dragged his side into a game that looked set to overwhelm them for a second straight season. At full-time here, however, the Arsenal captain handed over the man-of-the-match award to Jorginho. This was the 31-year-old’s second start in a week. A second fine performance, too, in a second vital win for Arsenal’s lingering title chase. ",
        "It is days like this that prove quite how shrewd his £12million January signing was. Yes, the control and physicality offered by Thomas Partey has been one of the pillars of Arsenal’s season. Recently, though, as Partey’s performances have nosedived, Jorginho has proven that he can play a different but no less vital role. He ended this match with more touches, more completed passes, more recoveries and more clearances than any of his team-mates.‘We are two different players that can adapt for the coach in different games,’ the Italy international said. ‘I think the coach has two good choices and depending on what game, and what type of players he wants on the pitch.’ In the black-and-white heat of St James’ Park, his leadership and poise was pivotal. ",
        "Always happy to receive the ball under pressure. Always dishing out advice and instructions. Always conducting play and organising Arsenal’s shape. Jorginho was bought for challenges like these – to provide control amid the chaos. He shone against Chelsea in midweek, when Arsenal controlled the ball and picked off Frank Lampard’s side. He excelled here, too, in rather more taxing circumstances. During those early minutes, when Newcastle threatened to drown the visitors, it seemed Jorginho’s frailties would be laid bare.That the likes of Joelinton and Joe Willock would expose his lack of dynamism and physicality. ",
        "But Odegaard’s opening goal changed everything. It laid the foundations for a Jorginho masterclass and proved once more the value of squad depth. When form or fitness deserts one key player, Arsenal need others to fill those holes. Now, heading into their final three games, Jorginho has cemented himself as first choice. Will Arteta live to rue not bringing him in earlier?Gunners reshuffled defence gets the plaudits  A first clean sheet in nine games for Arsenal. On one of the Premier League’s toughest away days, too.For that, their reshuffled backline deserve immense credit and particular praise should go to Jakub Kiwior, who helped shackle Callum Wilson and shut out Newcastle.The Poland international has looked raw and rather rash on his rare outings since arriving in January for £21.",
        "The 23-year-old thought he’d given away a penalty when Chris Kavanagh decided he had handled Bruno Guimaraes’ early shot. But then VAR intervened, Arsenal turned the tide and Kiwior kept Wilson quiet.No mean feat given the striker had scored eight goals in seven games – a run that included only two starts.William Saliba won’t be fearing for his place. But this was an encouraging afternoon nonetheless.Isak and Wilson fail to galvanise GeordiesEddie Howe’s decision to unleash both Wilson and Alexander Isak didn’t hurt Arsenal in the way the manager would have hoped.Wilson struggled to influence the game, while Isak looked threatening but didn’t see enough of the ball on the left flank. ",
        "By starting both of them, Howe solved one selection dilemma.But he also created a problem, too: with both of them on from the start, the manager robs himself of the chance to introduce one late on as Newcastle try to lay siege. Normally, when trailing with time running out, Howe would want to bring on a goal threat to galvanise their attack and to lift the crowd.Instead, a tiring Wilson was brought off with 12 minutes to play, replaced by Anthony Gordon - who has yet to open his Newcastle account That’s the risk you run."
    ]
}