{
    "articleURL": "/wires/ap/article-12043639/United-plans-hire-7-000-adding-surge-airline-jobs.html",
    "content": [
        "DALLAS (AP) - Airlines expecting a hectic summer travel season are planning to hire thousands of new workers this year, lifting a job market that has been hit by layoffs in technology and turmoil in the banking industry.",
        "United Airlines said Wednesday that it hired 7,000 new workers in the first four months of this year and plans to hit 15,000 new hires by year-end, matching the number it hired last year.By 2026, United projects adding 50,000 workers to a workforce that was about 93,000 at the start of this year.\"We are in hiring mode here at United Airlines,\" Kate Gebo, the company's executive vice president of human resources, told reporters. Airline officials said they already have enough pilots to operate the peak summer schedule.Airlines have been in a hiring frenzy since being caught understaffed when air travel bounced back from the depths of the pandemic more quickly than anticipated. Shortages of pilots and flight attendants contributed to a jump in the rates of canceled and delayed flights last year.The nation's passenger airlines received $54 billion in taxpayer money to keep people on the payroll through the pandemic, and they were prohibited from making layoffs, but they got around that prohibition by paying workers to quit or take early retirement.",
        "Since bottoming out in November 2020, airline-industry jobs have jumped by more than 117,000 - an increase of 32% - to more than 480,00 as of this February, the latest figures available from the Transportation Department. That is a 5% increase over the pre-pandemic peak.",
        "Delta Air Lines hasn't disclosed its 2023 hiring plans, but CEO Ed Bastian has said the airline has hired nearly 20,000 workers since the start of 2021.Southwest Airlines planned to hire 7,000 workers this year, but executives said last week they will reduce that number because the airline hasn´t received as many new Boeing jets as it expected.Some of the new hires at United will replace retiring employees. United executives said they plan to hire 2,300 pilots this year and expect nearly 500 to retire, after first giving a lower range of 250 to 300 retirements. Federal law requires airline pilots to retire by age 65.A pilot shortage has been especially severe at smaller, so-called regional airlines that operate flights for bigger carriers under the United Express, American Eagle and Delta Connection brands.Gebo said the next bottleneck is expected to involve aircraft technicians. While there is no federal age limit for aircraft mechanics, Gebo said 40% to 50% of United's technicians are already eligible to retire under the airline's guidelines.United is using career fairs, including a big one in Houston on Thursday, and other tactics to find workers. The tight labor market is causing United to offer higher wages for non-union jobs, Gebo said, and the airline faces higher rates in contracts it is negotiating with pilots and other union workers.",
        "United said 3,800 of its new jobs this year will be in Chicago, where the company is headquartered and runs a big operation at O´Hare International Airport. Airline executives said they will add another 2,300 in Denver, 2,100 in Houston, 2,000 in Newark, New Jersey, and 1,600 in San Francisco. United has hub airports in each of those cities."
    ]
}