{
    "articleURL": "/wires/reuters/article-12056539/Reuters-World-News-Summary.html",
    "content": [
        "Following is a summary of current world news briefs.",
        "IAEA warns of dangers around Zaporizhzhia nuclear plant as evacuations under wayThe head of the U.N.'s nuclear power watchdog warned on Saturday that the situation around the Russian-held Zaporizhzhia nuclear station has become \"potentially dangerous\" as Moscow-installed officials began evacuating people from nearby areas. Rafael Grossi, director general of the International Atomic Energy Agency (IAEA), called for measures to ensure the safe operation of Europe's largest nuclear plant as evacuations were under way in the nearby town of Enerhodar.Fighting in Khartoum as mediators seek end to Sudan conflictFighting could be heard in south Khartoum on Sunday as envoys from Sudan's warring parties were in Saudi Arabia for talks that international mediators hope will bring an end to a three-week old conflict that has killed hundreds and triggered an exodus. The U.S.-Saudi initiative is the first serious attempt to end fighting between the army and the paramilitary Rapid Support Forces (RSF) that has turned parts of the Sudanese capital Khartoum into war zones and derailed an internationally backed plan to usher in civilian rule following years of unrest and uprisings.Wagner group appears to U-turn on Bakhmut withdrawal, Russia keeps up missile attacksRussia's Wagner mercenary group appeared on Sunday to ditch plans to withdraw from Bakhmut in eastern Ukraine, saying they had been promised more arms by Moscow and suggesting they may keep up their assault on what Russia sees a stepping stone to other cities in the Donbas region. Elsewhere, Russian missiles targeted an industrial site in the Mykolaiv region of southern Ukraine, while Ukrainian and Russian media reported multiple explosions across Russian-occupied Crimea. Russia's defense ministry said its air defenses had detected and destroyed 22 Ukrainian drones over the Black Sea overnight.",
        "Japan's PM tells South Koreans his 'heart hurts' over pain caused by occupationJapan's Prime Minister Fumio Kishida told South Koreans on Sunday his heart hurts when he thinks of suffering and pain during Japanese colonial rule, in a nod to historical disputes that have soured relations between the two U.S. allies. Kishida was in Seoul for the first visit to the South Korean capital by a Japanese leader in 12 years, returning the trip South Korean President Yoon Suk Yeol made to Tokyo in March where they sought to close a chapter on the historical disputes that have dominated Japan-South Korea relations for decades.Arab League readmits Syria as relations with Assad normalizeArab League foreign ministers adopted a decision to readmit Syria after more than a decade of suspension on Sunday, a League spokesperson said, consolidating a regional push to normalize ties with President Bashar al-Assad. The decision said Syria could resume its participation in Arab League meetings immediately, while calling for a resolution of the crisis resulting from Syria's civil war, including the flight of refugees to neighboring countries and drug smuggling across the region.Anti-monarchists criticize 'heavy-handed' arrests at King Charles' coronationAnti-monarchists on Sunday criticized the policing of the coronation of King Charles as heavy-handed, saying there was no longer a right to peaceful protest in Britain after dozens of protesters were arrested and detained into the night. Police arrested Graham Smith, leader of the Republic group, and 51 others in central London as thousands of royal fans gathered in the capital for the event on Saturday, saying their duty to prevent disruption outweighed the right to protest.",
        "World Food Programme to suspend aid to Palestinians due to funding shortageThe World Food Programme (WFP) will suspend food aid to over 200,000 Palestinians from next month due to a \"severe\" shortage of funds, the group's senior official for the Palestinian territories said on Sunday. \"In light of the severe funding shortages, WFP is forced to make painful choices to stretch the limited resources,\" Samer Abdeljaber, the WFP's country director, he told Reuters by phone from Jerusalem.Turkey's Erdogan doesn't flinch in fight for political lifeWith his two-decade rule in the balance, Turkish President Tayyip Erdogan has pulled out all the stops on the campaign trail as he battles to survive his toughest political test yet and shield his legacy from an emboldened opposition. Erdogan, the son of a sea captain, has faced stiff political headwinds ahead of a May 14 election: he was already facing blame over an economic crisis when a devastating earthquake in February left saw his government accused of a slow response and lax enforcement of building rules that may have saved lives.Iraqi court sentences police officer to death for murder of government adviserAn Iraqi court on Sunday sentenced to death a police officer blamed for leading a group that gunned down well-known analyst and government adviser Hisham al-Hashemi three years ago in Baghdad. Hashemi, who had advised the government on defeating Sunni Muslim Islamic State militants and curbing the influence of the pro-Iran Shi´ite militias, was shot dead outside his Baghdad family home in July 2020 by men on a motorbike.",
        "Britain celebrates with street parties and a concert after King Charles' coronationNeighbourhoods around Britain will hold street parties and King Charles will attend a concert featuring the likes of singers Lionel Richie, Katy Perry and Andrea Bocelli at Windsor Castle on Sunday in celebrations to mark his coronation. Amid scenes of pomp and pageantry, Charles and his wife Camilla were crowned at London's Westminster Abbey on Saturday in Britain's biggest ceremonial event for 70 years."
    ]
}