{
    "articleURL": "/tvshowbiz/article-12039975/Jessica-Biel-cuts-stylish-figure-leaving-lunch-San-Vicente-Bungalows-West-Hollywood.html",
    "content": [
        "Jessica Biel rocked a stylish look while heading out on a lunch date with a friend in Los Angeles.",
        "The 41-year-old actress was spotted leaving a lunch at the exclusive celebrity hotspot San Vicente Bungalows with friend and jewelry designer Jennifer Meyer.The Candy star - who was spotted with husband Justin Timberlake at SZA's last tour stop in Los Angeles in March - was all smiles while leaving the lunch.Biel stepped out in a white sweater tucked into a pair of light blue button-fly high-water jeans for the lunch outing.She also wore a thin tan overcoat that fell to her knees, while also rocking a navy blue beret with white lettering that read, 'Solidarity.' ",
        "She accessorized with gold earrings and a thin necklace while rocking stylish black sunglasses.The actress and mother of two completed her look with chunky black dress shoes while carrying a brown polka dotted tote bag to her vehicle.The lunch came just a few days after a celebrity mom outing at Monster Jam at SoFi Stadium in Los Angeles.Biel was joined by her 7th Heaven co-star Beverley Mitchell along with Crystal Kung Minkoff, Sarah Michelle Gellar and Amanda Kloots.She also posted a touching tribute to her three-year-old niece Zaya for World Down Syndrome Day in late March.'For #WorldDownSyndromeDay this year, I’m wearing FUN SOCKS to support my amazing niece @lovelyzayab and to celebrate the whole incredible community. Post yours to send love to our friends and family all over the world.'",
        "Zaya, three, and her family explained the significance of Biel's 'fun socks' in Biel's Instagram story.The actress' niece revealed, 'chromosomes look like mismatched socks,' representing the chromosome abnormalities that cause Down syndrome.",
        "Earlier in March, Biel also celebrated her 41st birthday, with her husband Timberlake taking to Instagram with a sweet message.'Let me tell y’all about this human… she is the most badass, most graceful, most gorgeous DREAM of a partner I could have ever wished for,' Timberlake began. 'And today is her bday! I’m so glad you were born, my love. And, I’m so lucky that you are choosing to do this thing called life with me,' he added Timberlake concluded that his wife was, 'Aging like a FINE!!!! I love you to the moon and back.'"
    ]
}