{
    "articleURL": "/sport/football/article-12052365/KEOWN-TALKS-TACTICS-wanted-knock-Big-Sam-played-against-Bolton-side.html",
    "content": [
        "Allardyce will lead Leeds for the first time against Manchester City on SaturdayHe will look to make his side hard to beat first and foremost before buildingIt's going to be a monumental survival act but Big Sam is capable of doing it At Arsenal, we didn’t like facing Allardyce’s teams. There was a feeling that, as Sir Alex Ferguson’s mate, he loved tripping us up more than anyone else. I still remember Big Sam’s big grin in April 2003 after my own goal secured Bolton a 2-2 draw at the Reebok Stadium.",
        "That cost us with Manchester United ultimately winning the title. I used to visualise a sliding tackle on an opposing player by the sideline that would also wipe out Allardyce in his technical area, too! When I later got to meet Allardyce and work with him for a UNICEF charity match, I gained an appreciation for why players worked so hard for him.His vast experience is why Leeds have gone with him now. They’ve looked at his entire career — not what happened at West Brom in 2020-21 when he was relegated for the first time — but a trip to City is the most challenging start he could ever have envisaged.Big Sam talks the talkBig Sam burst through the Elland Road doors with the biggest of statements, declaring: You will not find a better Premier League manager than me. Not Mikel Arteta. Not Jurgen Klopp. Not Pep Guardiola, who he faces on Saturday. ",
        "It created a great sense of theatre to his return, alongside his supporting actors in Karl Robinson and Robbie Keane, and sent a clear message to a Leeds dressing room full of players from all around the world: If you didn’t know me before today, you certainly know me now.Anyone who wasn’t aware of his reputation woke up on Thursday morning hearing how Guardiola had endorsed Allardyce’s opinion of himself. Big Sam talks a good game. Anyone who can convince a World Cup winner in Youri Djorkaeff to sign for Bolton must have the gift of the gab!",
        "But he needs to be crystal clear in his message to Leeds’ players if he is to turn this team around. This has been a Premier League season unprecedented in its managerial changes — 15 in total — and Leeds are now on to their third appointment in Allardyce. For all their good work in harrying and hurrying opponents under Jesse Marsch and Javi Gracia, they have not been taking enough care of the ball. The statistics say they have regained possession more times than any other Premier League team this season but have also given it away more than anyone else. Looking back through the 23 goals conceded in April, it is clear to see that on too many occasions, Leeds’ midfielders and attackers are not taking care of the ball.They lose it and the team are then punished on the counter.The back four looks vulnerable, lacks pace and does not deal well enough with direct balls into the box. Their marking has been questionable and now their 23-year-old goalkeeper Illan Meslier is making basic errors as the pressure builds.Allardyce will have been studying all of these shortcomings with a view to making them hard to beat, first and foremost.Against City, Leeds might want to follow what West Ham tried on Wednesday. David Moyes’ men pressed high but once City broke through, the whole team dropped to protect their box. It was enough to frustrate City until West Ham eventually conceded from a poor set-piece in the second half.",
        "Allardyce will want Leeds’ back four to be protected by a midfield line staying in close proximity and I expect him to return to a 4-2-3-1 set-up, because the players looked unsure of their roles in the 3-4-3 formation used in Gracia’s final game in charge.They possess a good threat in the wide areas from Wilfried Gnonto and Crysencio Summerville, and Patrick Bamford needs supplying as he looks to recapture his confidence for this four-game shootout.Leeds are in a perilous position. They’re out of the Premier League’s relegation zone on goal difference but given they lost 7-0 at City last season, that could soon be eradicated. Especially if Kevin De Bruyne — or Kevin De Brilliant as we could call him — is back to feed Erling Haaland, the lethal marksman who has already scored the most goals in a Premier League season.After City, Leeds face Newcastle and West Ham — two of Allardyce’s former clubs — and then Tottenham. This is going to take a monumental survival act. If Leeds stay up, that press conference unveiling will live long in the memory. But if they do not survive, quite like the accusations levelled at Marsch whenever he made excuses, Allardyce will be accused of talking codswallop."
    ]
}