{
    "articleURL": "/wires/reuters/article-12046227/Indian-LGBTQ-groups-push-widen-access-HIV-prevention-pill.html",
    "content": [
        "India has one of the world's highest HIV caseloads",
        "Activists say stigma, cost hold back access to PrEPOutreach projects aim to reach at-risk LGBTQ+ groupsBy Rushati MukherjeeKOLKATA, May 4 (Thomson Reuters Foundation) - Every morning, Neharika Ravalkar takes a pill that stops her joining the millions of Indians who are HIV-positive.As a trans woman, Ravalkar is among the groups at highest risk of HIV.But she is among a lucky minority taking pre-exposure prophylaxis (PrEP) medication as cost, lack of awareness and stigma all hamper access in the South Asian nation.\"PrEP is like a bodyguard for me,\" said Ravalkar, who primarily scrapes a living from begging in Pune, western India.\"I've been helping people in my community to take it and busting fake news about it.\"PrEP - usually taken as a once-daily pill - is highly protective against HIV. But global takeup is well below targets and remains concentrated in a relatively small number of countries, according to the U.N. agency for HIV and AIDS.UNAIDS estimates about 38.4 million people are HIV-positive worldwide. Key populations at risk include gay men, sex workers, intravenous drug users and trans people.India has the second-largest HIV caseload in the world, with more than 2.3 million people living with the virus in 2020, said the National AIDS Control Organisation (NACO), a government organisation.",
        "Though the number of new cases has dropped sharply from a peak in 1996, tens of thousands of people are infected with the virus nationwide each year, according to UNAIDS data.Access to PrEP is patchy, and it is not offered through government-funded healthcare programmes.Although several brands are available for sale for between 1,500 rupees ($18) and 2,200 rupees per month, the price is too steep for many who are potentially at risk.The average wage in a salaried job was about 18,500 rupees per month in 2022, according to the statistics ministry, and about one in 10 people live in extreme poverty.Many people on the medication access it through non-profits, said medical student and LGBTQ+ activist Vignesh Dhananjayan. But such charities are usually based in urban hubs, he said, bypassing vulnerable people in smaller towns and rural areas.\"Professors and doctors here don't even know about the medicine, let alone prescribe it,\" said Dhananjayan, who posts information about how to access PrEP on social media.\"The government needs to urgently subsidise the cost of PrEP across the country via legislation, make it available free of cost in government centres and create a central database of dispensaries, clinics and hospitals where it can be accessed.\"India's Ministry of Health did not respond to multiple requests for comment.",
        "CAMPAIGNERS TARGET PrEP STIGMAActivists pushing to increase PrEP access said take-up is limited by stigma and stereotypes linking it to promiscuity.When Delhi-based communications professional Abhishek Desai attempted to run a community campaign to raise awareness about PrEP, he discovered it was hard to find LGBTQ+ people who were willing to talk about it.Desai also experienced discrimination over his own PrEP use.\"I was asked awkward questions even in major cities like Delhi or Mumbai: 'How many partners have you had?' 'Why are you getting tested again so soon?' 'Why are you on PrEP at all?,\" he said.\"The implication is that if you're on PrEP, you're a condomless slut.\"For sex workers, PrEP can be the only way to stay safe as most are in no position to refuse sex without condoms, said Abhishek, an outreach worker at the nonprofit India HIV/AIDS Alliance. Abhishek goes by only one name.Widespread discrimination against hijras - an umbrella term that includes crossdressers, trans women and intersex people - forces many into begging or sex work to survive. But trans people are often reluctant to take the medication, according to Rie Raut, a diversity and inclusion consultant who previously worked for the National AIDS Research Institute.\"Often, trans people in India, especially those from the hijra community, don't have a lot of hope for living a long, healthy life,\" Raut said.",
        "\"Some trans women literally say ... they don't really care about their health, as their lives are so difficult anyway.\"However, community outreach schemes are making progress. Trans woman Adhya, who goes by only one name, only learned about PrEP recently but says the daily pill which she gets through an LGBTQ+ healthcare clinic is a blessing.\"I know now that if I'm interested in someone, I will be protected,\" said Adhya, from Hyderabad in the southern state of Telangana.\"It makes me feel proud that I've taken this step to look after myself.\" ($1 = 81.7830 Indian rupees) (Reporting by Rushati Mukherjee; editing by Sonia Elks and Hugo Greenhalgh. Please credit Openly, the LGBTQ+ news website from the Thomson Reuters Foundation, the charitable arm of Thomson Reuters. Visit https://www.openlynews.com)"
    ]
}