{
    "articleURL": "/sport/football/article-12046511/Ian-Wright-claims-Mikel-Arteta-unfair-Rob-Holding-dropped-against-Chelsea.html",
    "content": [
        "Rob Holding struggled for minutes before William Saliba's saw him returnInjuries have prevented Mikel Arteta from shifting Ben White to centre back Follow Mail Sport's dedicated LIVE blog for all the latest updates from Arsenal Ian Wright believes Mikel Arteta's treatment of Rob Holding has been 'unfair', after the English defender was dropped for the Gunners' clash with Chelsea. ",
        "Arsenal beat the Blues 3-1 at home to put an end to their torrid April that saw them go four games without a win and hand over the momentum in the title race to Manchester City. Part of the arrest in their charge for a first Premier League title in 19 years has been attributed to the loss of William Saliba, who has been absent since picking up a back injury against Sporting in the Europa League in March. With the Frenchman sidelined, regular third-choice centre back Holding had deputised alongside Gabriel Magalhaes, with back-up right back Takehiro Tomiyasu's injury preventing a shift of position for Ben White. The former Arsenal record goal scorer felt that Holding had been hard done by, after being replaced by January signing Jakub Kiwior on Tuesday. 'I think [Arteta] has been a bit unfair on Rob Holding,' Wright said on Premier League Productions. ",
        "'He is somebody who hasn't had a lot of minutes. He was someone who came in to replace William Saliba – and he is fantastic.'Yes, in certain instances, Rob has been done for pace. We have seen him isolated and it has caused a bit of a problem.Holding's return to the starting XI began with back-to-back victories before a four-game winless run, although he scored the Gunners' only goal of the game in their 4-1 defeat to City. ",
        "Kiwior made his first Premier League start against Chelsea following a £21million move from Serie A side Spezia, having twice come off the bench. He has found opportunities to make his mark at his new club few and far between given their ongoing title race, but the injury to Saliba and Holding's struggles to cover his absence could hand him an opportunity to do just that. The Polish international impressed at the Emirates despite a slight mistiming of an early header, although he came up against a largely lack lustre Chelsea side. The Gunners have four games left this season, and will be targeting maximum points in order too keep up the pressure on Man City, who have a game in hand and sit a point clear at the top. As such, Kiwior will have plenty of chances to shine, with games against Newcastle, Brighton, Nottingham Forest and Wolves to come. ",
        "And Wright remained confident that he will be up to the task, having spent several months now at the Gunners getting to grips with Arteta's demanding style of play. 'I think it has been unfair, some of the stick (Holding) has got,' continued Wright. 'But seeing Kiwior coming in.'He has been there long enough to see what's going on and to see what we are capable of. ",
        "'I think it's good to bring him in. These are the games you want to see him in.' "
    ]
}