{
    "articleURL": "/sport/football/article-12041019/Frank-Lampard-vows-one-Chelsea-player-lot-opportunities.html",
    "content": [
        " Lampard has promised more minutes to one of Chelsea's January signings The Blues fell to a 3-1 defeat against Arsenal, but one player impressed LampardChelsea interim head coach Frank Lampard has promised an improved role for one of his players until the end of the season after an impressive performance against Arsenal on Monday.",
        "The Blues were poor as they went 3-0 down in the first half before netting a consolation in the second half of their 3-1 defeat at the Emirates.Winger Noni Madueke was a threat throughout and shone with direct running at Arsenal defenders despite a poor team performance from Lampard's Blues.Speaking to Sky Sports after the match, Lampard made a promise of more minutes to the January signing as he said: ‘If I want to talk about an individual it’s Noni, who scored the goal, plays how he’s been training.‘He’ll get a lot more opportunities.’ ",
        "After making a move from Eredivisie side PSV in the January transfer window, Madueke has only made seven apperances for Chelsea, scoring his first goal on Monday night.After failing to make the squad in Lampard's first two matches back at Chelsea, defeats to Wolves and Brighton, he came on as a substitute in a 2-0 loss to Brentford.The English youngster was then handed a start at the Emirates, where he impressed on the right-wing despite Chelsea once again disappointing.Lampard continued to admit that he expected more from his side, who were 'too nice to play against'. He said: ‘We weren’t good enough, we were too nice to play against, too passive. In possession we weren’t playing balls over their press, or winning second balls.",
        "‘Chelsea have been a big success for 20 years domestically and in the Champions League, at the moment we’re not in that position. But from the moment I’ve been here it’s been evident we’re too nice as a team.‘We can’t change things overnight but we better get their quickly because we have another game at the weekend and games to come.'The Blues face Bournemouth in the Premier League on Saturday, with the Cherries aware that a victory over Lampard's side will see them climb as high as 11th, while Chelsea could end the weekend as low as 14th."
    ]
}