{
    "articleURL": "/tvshowbiz/article-12057961/Larsa-Pippen-Marcus-Jordan-stylish-pair-attend-star-studded-HUMMER-House-event.html",
    "content": [
        "Larsa Pippen was seen with her boyfriend, Marcus Jordan, at the HUMMER House in Miami, Florida on Saturday.",
        "The 48-year-old Real Housewives of Miami reality star looked dazzling in a plunging, iridescent, and sequined minidress for the exclusive event during Formula One Miami Grand Prix weekend.The socialite — who sparked marriage rumors with the son of NBA legend Michael Jordan after going Instagram official earlier this year — paired the sparkling dress with clear vinyl heels and a pastel pink Birkin.Posing next to her, the former college basketball player put on a casual display in a short-sleeved gray flannel and dark denim jeans. In photographs taken by World Red Eye, other stars attending the event included: DJ Khaled, Meek Mill, Maluma, Anitta, Isabela Grutman, Chantel Jeffries, and Foodgod.",
        "For the special occasion, Larsa slicked back her long, straight tresses into a polished ponytail to show off a pair of statement earrings.She also sported a diamond-encrusted watch and bracelet for an additional touch of glamour.Like his girlfriend, Marcus donned a flashy watch to jazz up an otherwise casual, cool ensemble.The founder and CEO of TROPHY ROOM STORE styled the flannel button-down over a gray T-shirt and also sported a pair of Travis Scott x Air Jordan 1 sneakers. At the event, DJ Khaled, 47, was seen posing with a HUMMER EV Edition 1 SUV before giving a performance at the event.",
        "The rapper and DJ donned a light blue, short-sleeved button-up shirt adorned with colorful graphics all-over. He wore the matching shorts as well as a pair of bright red Nike sneakers with white laces and details. The record executive and producer accessorized his look with a luxurious silver watch.",
        "Meek Mill, 36, also made an appearance ahead of his performance at the event.The rapper looked effortlessly stylish in a green polo with a navy blue collar and cuffs.He teamed the look with tan cargo shorts and a cream baseball cap with a green bill. He also sported a pair of white and brown high-top Nike sneakers. The Trials &amp; Tribulations hitmaker accessorized with layers of eye-catching chains around his neck as well as a gold bracelet and watch.Maluma, 29, was also seen at the event posing with Anitta, 30.The Colombian singer-songwriter put on a casual display in a white tank and blue button-up paired with black trousers. The Hawaii crooner accessorized with a pair of oversized, blue-tinted aviator sunglasses and a striking diamond chain.  ",
        "The Envolver songstress put on a sultry display in a black, cutout crop top and a long skirt with a sexy thigh-high slit.The Brazilian actress flaunted her curves in the halter-style top with a keyhole cutout in the middle. ",
        "She also wore a low-waisted skirt with a revealing slit to show off her toned abs and legs.Anitta wore a pair of black heels with thin straps tied around her calves and accessorized with a pair of gold hoop earrings.Outside of the event, she was also seen posing with Isabela Rangel Grutman.The wife of the host of the event — entrepreneur David Grutman — donned a plunging jumpsuit with padded shoulders and figure-hugging pantlegs.She slicked back her dark brunette tresses into a sleek bun and accessorized with statement stud earrings and layers of tennis necklaces decorating her neck.Chantel Jeffries, 30, looked mesmerizing In a figure-hugging, mock-neck minidress with a sexy, cleavage-baring keyhole cutout.",
        "The DJ teamed the taupe, rhinestoned dress with a silver flap bag and sandal heels with diamond-lined straps.The model and influencer styled her hair back into a sleek ponytail with money pieces left out to frame her face.Foodgod also attended the event in a black graphic T-shirt with the White Zombie design emblazoned across the front. The reality TV personality sported a pair of Chrome Hearts jeans and various flashy pieces of gold jewelry.Later, he was seen posing with Maluma, Anitta, and Isabel for a charismatic group photo at the event."
    ]
}