{
    "articleURL": "/wires/pa/article-12059843/Crazy-finish-summed-Newport-s-season--Graham-Coughlan.html",
    "content": [
        "Newport manager Graham Coughlan admitted the frantic finale at Rodney Parade summed up his side’s season as they threw away two points to draw 2-2 with Crewe.",
        "Striker Omar Bogle thought he had bundled in the winner in the first minute of time added on after cancelling out Rio Adebisi’s stunning opener with a penalty 13 minutes from time.But County were caught napping at the other end in the 93rd minute and allowed Lachlan Brook to earn Crewe a deserved share of the spoils.“Omar has been very good for us. He should have been on a winning team today,” said Coughlan, who replaced James Rowberry in October with the Exiles only two points above the relegation zone.“Defensively, we conceded two sloppy goals. It was a real disappointment, the manner in which we conceded the goals. But that’s been there all season.“We weren’t great, we looked a little bit flat, and it was a typical end-of-season performance.",
        "“The same mistakes are happening too often, so that needs sorting out. Today summed up our season – moments of madness, moments of brilliance, sloppiness.“Since we’ve come in, we’ve done brilliant to climb the table and put that amount of points on the board. I think we’ve done exceptionally well to dig ourselves out of a bit of a mess that we found ourselves in.”Coughlan’s men end the season in 15th place on 57 points – 14 clear of the bottom two and with plenty to build on for next season.",
        "“I know what needs fixing and it’s my job to get that done over the summer,” he said.“I’m hopeful of getting one or two (players) in, and one or two will leave, but I don’t expect wholesale changes.”Crewe finish one point and two places better off than their final-day hosts and boss Lee Bell is also encouraged as he looks ahead to August.“It was a good end-of-season game. I thought we were unlucky – we could have scored another couple,” said Bell, who took over from Alex Morris in November.“But it was a good response from a good bunch of players with good character.“That’s what they’ve done a lot since I’ve been in charge, and were unlucky not to get three points to take us up another couple of places.“We were able to get some younger players onto the pitch, which we’ve done a lot in the past few weeks, and that will give them more experience for next season.“There’s plenty to build on, particularly in the last six weeks. We’re optimistic for next year, but we know we’ve got to work hard to get the right players in.”"
    ]
}