{
    "articleURL": "/news/article-12047525/Child-prodigy-11-IQ-higher-Einstein-earning-masters-degree.html",
    "content": [
        "Adhara Pérez Sánchez grew up in the low-income neighborhood of Tláhau, Mexico City She finished elementary school at the age of five, then finished middle and high school a year laterShe is now working with the Mexican Space Agency to help promote space exploration among young girls A 11-year-old child prodigy, who has an IQ higher than Einstein, is receiving a master's degree in engineering and hopes to one day be an astronaut for NASA. ",
        "Adhara Pérez Sánchez, of Mexico City, grew up in the low-income neighborhood of Tláhauc and was often bullied in school for being autistic. She was diagnosed with the developmental disability at the age of three after her speech significantly regressed. She was found rocking herself in her high chair, and she began to crawl very quickly. After enduring years of apathetic teachers and bullying from her classmates, which led to her changing schools three times, Adhara began to isolate herself, her family told Marie Claire Mexico. 'The teachers were not very empathetic, they told me that I wish she would finish an assignment,' her mother, Nayeli Sánchez, told the magazine. 'She began to exclude herself, she did not want to play with her classmates, she felt strange, different. 'She could be at school for a while but then she couldn't, she fell asleep, she didn't want to do things anymore,' she continued. 'She was very depressed, people did not have empathy, they made fun of her.' She noticed her daughter had already taught herself algebra and had memorized the periodic table, but Nayeli blew it off, thinking her daughter must have been bored. ",
        "To help with her daughter's depression, she enrolled her in therapy and was soon advised to send her to the Center for Attention to Talent (CEDAT), a school for gifted children. Here, her IQ was confirmed to be a mind-blowing 162 - higher than Albert Einstein and her muse Stephen Hawking, who both had an IQ of 160.  ",
        "She was first introduced to Hawking when she visited one of her doctors, who had an office full of artwork displaying the scientist, who is famous for his discovery that black holes emit radiation. 'He was very intelligent, he manifested with his mind and through the computer,' her doctor told her, according to Marie Claire Mexico, and so her fascination with the British physicist and space exploration was born. She finished elementary school at the age of five, according to Goalcast, then finished middle and high school a year later.  ",
        "The 11-year-old has also already received a bachelor's degree in systems engineering from CNCI University and is currently studying a master's program in mathematics at the Technological University of Mexico, according to Marie Claire Mexico. She hopes to one day catch the sights of NASA and dreams of exploring Mars. She is often spotted wearing gear with the space company's logo on it on her Instagram, with a broad smile on her face. 'My name is a star from the Canis Major constellation,' she said, according to Goalcast. 'Wezen is right above Adhara. Aludra is right below Adhara.'I want to go to space and colonize Mars,' she continued. 'If you don’t like where you are, imagine where you want to be. I see myself at NASA, so it’s worth a try.'  ",
        "Her post-secondary education began after her mother accidentally enrolled her in a contest she thought was for children. A teacher had advised Nayeli to send in an application for her daughter and there Adhara discovered she wanted to be an astronaut. ",
        "The young girl hopes to continue her education at the University of Arizona, where she can study astrophysics. The school had offered her a scholarship, but it was deferred due to visa issues. When Adhara isn't studying hard to become an astronaut, she is working with the Mexican Space Agency to help promote space exploration and mathematics to other young girls. She is also currently working toward finishing her G-tests that will allow her to man flights through an agency that has connections to NASA that supports young scientists. When she passes, she'll be around 17 and the first autistic person to fly, according to Marie Claire Mexico. "
    ]
}