{
    "articleURL": "/news/article-12050117/Heartbroken-San-Diego-Zoo-staff-forced-euthanize-gentle-59-year-old-Asian-elephant-Mary.html",
    "content": [
        "It followed a 'decline' in her mobility after she began experiencing joint issuesThe 'uniquely dominant' but 'gentle' pachyderm, had been under veterinary careHeartbroken San Diego zoo staff euthanized an Asian elephant after age-related joint deficiencies began affecting her quality of life.",
        "The 59-year-old geriatric elephant, named Mary, was put down compassionately after the decision to do so was made by her health and care specialists following a 'decline' in her mobility.The 'uniquely dominant' but 'gentle' pachyderm, had been under veterinary care, which included hydrotherapy and physical therapy to relieve her joint ailments for 'quite some time', according to the Zoo's officials. Mary had lived at the San Diego Zoo Safari Park from 1980 until 2009, at which point she was transferred to San Diego Zoo, just over 35 miles south of the safari park. 'Wildlife care specialists described her as having a uniquely dominant personality but also a peaceful presence that was a comfort to other elephants,' the zoo wrote.",
        "'As an ambassador for her species, Mary helped educate guests on the difference between Asian and African elephants, the threats they face, and how we adapt our care for aging animals. Mary's physical therapy and palliative care also made her a relatable presence for humans experiencing similar ailments.'Mary's gentle presence will be greatly missed,' they shared on their official Instagram account.The animal lived at the zoo's Elephant Odyssey habitat, which is equipped with a care center to help aging elephants.  'After Mary had passed, Shaba, who lived with Mary, had the opportunity to see her and make her goodbyes,' the zoo added. ",
        "'Shaba will have her choice to socialize with neighboring elephants Nipho and Sundzu.' According to the Zoo, the average life expectancy for a female Asian elephant is 47 years. Asian elephants are seen as endangered species, according to the International Union for Conservation of Nature Red List. "
    ]
}