{
    "articleURL": "/sport/nba/article-12055719/LeBron-James-Anthony-David-help-L-Lakers-DESTROY-Golden-State-Warriors-127-97-Game-3.html",
    "content": [
        "Anthony Davis, LeBron James and D'Angelo Russell combined for 67 points Game 4 is again in Los Angeles at the Crypto.com Arena Monday night at 10p ET DailyMail.com provides all the latest international sports news Anthony Davis rebounded from an awful Game 2 performance as both he and LeBron James hauled the Lakers to a 127-97 blowout win vs. the Golden State Warriors. ",
        "The dynamic duo torched the Warriors -- combining for 46 points -- so much so, they sat out the majority of the fourth quarter of Game 3 Saturday night.  James and Co. now lead the Western Conference semifinals series 2-1 with another game in southern California before Game 5 in San Francisco.  After a zero-point first quarter, James poured on 21 points (6-of-11, 2-4 from three-point range) in the second and third, before sitting out the entirety of the fourth. James made a great hustle play to deny the Andrew Wiggins a layup despite being up 12 points late in the third, before hurdling into the spectator area. Thankfully, he avoided an injury as he slowed his 6-foot-9, 250lb frame successfully to great applause from the home faithful.",
        "It seemed to spark the Lakers into life amid a Warriors fightback - James added a basket and immediate rejection on the next possession -- with the home team putting a 10-2 run together to end the third, ahead 86-68.Davis responded from yet another barrage of criticism following a poor performance last game, dominating the Warriors as he had in Game 1. The former Pelicans superstar had 13 rebounds and shot 7-of-10 FG to go with 11-12 FT en route to 25 points. He also had a +28-point differential.",
        "L.A. started hotter of the two teams as Russell scored the Lakers' first 11 points of the game. After opening up an early lead, the Warriors went on an 18-4 run to lead at the end of the first, 30-23. Thompson started hot, pouring in 11 points on 3-for-5 shooting from deep. James and Davis were sat on the bench as the quarter closed out, earning well-deserved rests with an 18-point advantage going into the final 12 minutes.Andrew Wiggins added 16 points with nine rebounds for the defending champion Warriors, who also trailed 2-1 in their first-round series against the Sacramento Kings before advancing in seven games.Thompson finished 15 points for the Warriors, who shot 39.6 percent from the field and had 19 turnovers. Golden State was 29.5 percent from 3-point range after going 50.0 percent from distance in Game 2.The Warriors removed Curry, Thompson and Draymond Green from the floor with 9:11 remaining and the Lakers up 98-72. 'The Brow' returned for the opening two minutes of the fourth before rejoining James to watch the collateral damage they both masterminded."
    ]
}