{
    "articleURL": "/sport/football/article-12056157/Jasper-Cillessen-endures-HORROR-blunder-Dutch-club-NEC-Netherlands-goalkeeper-fails-dive.html",
    "content": [
        "Jasper Cillessen made serious blunder in NEC's loss to Heerenveen on SaturdayThe Dutch goalkeeper failed to dive as the ball bounced towards his near postA frustrated Cillessen headbutted the goalpost after the ball crossed the line Netherlands goalkeeper Jasper Cillessen endured a serious blunder during NEC's clash with Heerenveen on Saturday.",
        "After the visitors took the lead, NEC struck back with goals from Magnus Mattsson and Landry Dimata before Kees van Wonderen's side equalised through Sydney van Hooijdonk.With the game heading into the closing stages, substitute Antoine Colassin latched onto a lofted pass and found himself through on goal.The 22-year-old struck first time but his shot lacked any real force and appeared to heading innocuously towards the goalkeeper's near post.However, Cillessen appeared to misjudge where the ball was headed and made no attempt to stop it as it bounced into the net to put the visitors into the lead.",
        "A frustrated Cillessen headbutted the goalpost and was later consoled by his teammates as Colassin wheeled away in celebration.Heerenveen held on to secure the three points and the clip of Cillessen's error later began gaining traction on social media.The 34-year-old returned to his boyhood club at the start of the current campaign, after spending six years in La Liga with Barcelona and Valencia.Cillessen also served as Louis van Gaal's No 1 during the World Cup in 2014, with the then-Ajax star famously being substituted for Tim Krul before a penalty shootout against Costa Rica which the Dutch went on to win.Despite Van Gaal returning as Netherlands boss prior to the World Cup in Qatar, Cillessen was not selected for the side that would go on to reach the last eight, with the former Man United boss preferring the inexperienced trio of Andries Noppert Remko Pasveer, and Justin Bijlow.",
        "However, Cillessen has returned to the national team under Ronald Koeman, playing 90 minutes in EURO 2024 qualifiers against France and Gibraltar."
    ]
}