{
    "articleURL": "/tvshowbiz/article-12049285/Former-Selling-Sunset-star-Maya-Vander-pregnant-suffering-miscarriage-stillbirth.html",
    "content": [
        "Former Selling Sunset star Maya Vander is celebrating very happy news.",
        "The reality TV star, 39, is pregnant again, after suffering a stillbirth followed by a miscarriage in the last year and a half.Fans began to question whether the star was expecting after she posted her most recent Instagram video on Thursday, where she appeared to sport a baby bump. The happy news was later affirmed by People, with a source confirming to the publication that Maya was pregnant.Last year, Vander shared the heartbreaking news that she had suffered a miscarriage at 10 weeks. It came just six months after she went through a stillbirth in December of 2021. ",
        "A week prior the star honored her late son Mason on Instagram, as she posed with her businessman husband David Miller in front of a playground they donated in his memory. 'Today was very emotional morning! Our playground donation was completed and opened up for the children. This playground will bring joy to so many children.''Our stillborn Mason will be in our heart forever! In every tragedy we can try to find a little light and learn how to navigate through hard times. Thank you Child Care Center for letting us create such a fun area for the kids!' The couple already share two children, Aiden, four, and Elle, three. Last year the star took to her Instagram Stories to say she still questions why the stillbirth happened to her 'perfect baby.'",
        "In her post to mark a year since his death she said she wasn't sure how she would feel on the day before explaining that his death was 'basically bad luck' due to a compressed placenta cord.She penned: 'Today exactly a year ago I marked one year since I lost my son Mason at 38 weeks (9 months) and had a vaginal stillbirth. I wasn't sure how this day will be. He would have been one years old and possibly taking his first step.'I still have questions on why?? He was a perfect baby and the autopsy report came back with no conclusion.",
        "'Dr Kliman from Yale university looked at my placenta and was almost sure the cord was compressed. Basically bad luck.'She continued: 'I decided to just spend my day with the kids and be thankful for them. At the end of the day, sitting in bed and crying will not bring him back.''Approaching the holiday season which was grey and gloomy last year gives me hope that I can enjoy it again. Life goes on... and you learn to deal with grief in different ways...'At the time of her loss Vander shared the sad news on Instagram. 'Yesterday was the hardest day of my life. I had a stillbirth at 38 weeks. I always heard of it but never imagined I'll be part of the statistics,' she wrote.",
        "'Instead of delivering a baby, I get to go home with a memory box… I do not wish this on anyone.''What was a regular weekly checkup turned into a nightmare that I never imagine will happen to me,' she went on.'Given I share my pregnancies in the show I knew I'll have to post about this and avoid the \"when is your due date\" question. You will always be in our heart baby Mason.' ",
        "Six months after her stillbirth she shared she had miscarried in June of 2022.Maya, who announced in 2021 that she was leaving Selling Sunset after five seasons to focus on her family, confirmed she had suffered a miscarriage while 10 weeks pregnant in June - just six months after her heartbreaking stillbirth. She wrote on Instagram: 'I had a very crazy week. Miscarriage after 10 weeks... following my stillbirth. But my kids and my husband are absolutely my blessing and I am so lucky to be their mother!!''They bring joy and happiness to my life!! Hug and love the people you care about. Don't take things for granted!' "
    ]
}