{
    "articleURL": "/wires/ap/article-12047929/Horse-racing-poised-new-antidoping-medication-rules.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Horse racing´s new antidoping and medication control program has stumbled out of the starting gate, delayed multiple times for nearly a year amid lawsuits by those opposing the new rules and frustration from those eager for national uniform standards in the sport.",
        "The Horseracing Integrity and Safety Act (HISA) took effect on July 1, 2022, with two major components: racetrack safety and antidoping and medication control.The safety rules, including limits on how many times a jockey can whip a horse, began last year. Still, they have not prevented horse deaths. Four horses died in five days at Churchill Downs in the days leading up to the Kentucky Derby on Saturday.The Antidoping and Medication Control (ADMC) program was supposed to start at the same time as the safety program.Instead, it was pushed back to Jan. 1. Then that date got scrapped when the Federal Trade Commission, which oversees HISA, didn´t give clearance because of legal issues. The FTC eventually gave the OK for a March 27 start and the ADMC went into effect for four days.But a federal judge suspended the program for 30 days until this past Monday, the start of Kentucky Derby week. Then the FTC last week delayed the start until May 22 - two days after the Preakness, the second leg of the Triple Crown.",
        "\"Like everyone, I´m anxious to have everything set in place and get a consistent working order in progress,\" said trainer Todd Pletcher, who will saddle three horses, including the two early favorites, in the Kentucky Derby on Saturday.",
        "\"It´s going to be a learning curve for everyone,\" he said.The ADMC program covers drug testing, drug samples, out-of-competition testing, rulings and penalties. Labs will test for the same substances and at the same screening levels as opposed to different states testing at differing levels. The new rules replace the patchwork system of standards in the 38 U.S. racing states that can vary by racetrack and location.\"This program is about having a legacy, setting the foundation for the future,\" HISA CEO Lisa Lazarus told The Associated Press by phone. \"This program is going to be around, I believe, for years and years.\"Under the ADMC program, she said, there will be far greater emphasis on out-of-competition testing and not just post-race testing.\"That will be very new for the industry,\" Lazarus said.Southern California-based trainer Tim Yakteen notes that tracks in his state have already been adhering to rules that hew closely to those of the ADMC.\"I don´t see it really changing a whole bunch on my end. My team has already been working under the assumption that we´re working under the HISA program,\" he said. \"That´s a big part of our jobs, is to stay within the guidelines.\"The National Horsemen´s Benevolent and Protective Association has pushed back against HISA and it, along with Louisiana, Oklahoma, Texas and West Virginia, have filed multiple lawsuits challenging the new governing body´s constitutionality. The HPBA represents about 30,000 owners and trainers in the U.S. and Canada.",
        "The states argue HISA is doing away with state regulation of the sport in favor of rules set by a private entity rather than elected state officials working with horsemen.HISA was ruled constitutional Thursday in a decision from the Northern District of Texas.\"We plan an immediate appeal of this decision and we remain confident in our legal arguments,\" said Daniel Suhr, lead attorney for the national HBPA and 12 of its affiliates. \"Congress cannot abdicate its authority to a private corporation. Challenging this law is critical to protecting democratic accountability enshrined in our constitution.\"Eric Hamelback, CEO of the national HBPA, vowed, \"We will fight to protect horsemen and their constitutional rights all the way to the Supreme Court if needed.\"In a statement HISA said, \"We appreciate the federal district court´s re-affirmation of HISA´s constitutionality. The urgent need for nationwide, uniform rules to enhance the safety and integrity of Thoroughbred racing has never been clearer.\"HISA had responded to horsemen´s concerns that they had little to no input in the rules by creating a Horsemen´s Advisory Group. It´s comprised of 19 owners, trainers and veterinarians, along with representatives of racing offices, backstretch employees, blacksmiths and aftercare groups.\"When I took on the job I thought this is going to be running a national governing body for horse racing,\" Lazarus said.",
        "Instead, she´s been surprised by how it has evolved into a political debate on states rights versus federal rights.\"That can become a real challenge,\" Lazarus said. \"What I try to tell people is let´s put all that aside and do what´s best for the industry. Getting folks to work together is really important.\"Ron Hillerich, a Louisville attorney who owns and breeds racehorses, said his small stable can´t afford the recordkeeping and reporting that HISA is mandating. The expense of additional testing and veterinary exams will cause trainers to pass more costs to owners he believes.\"The long and short of all of this is that HISA, through its zealousness to regulate, will negatively impact smaller stables, forcing them out of business,\" he wrote in a recent op-ed piece.Mike Repole, who co-owns early Kentucky Derby favorite Forte, said, \"HISA can be part of the answer, but it´s a spoke in the wheel. We always have to try to do more.\"Pletcher calls the ADMC rules \"very labor intensive.\" He said his large stable, which runs horses in multiple states, will have to hire someone to be in charge of recordkeeping and data.\"In some ways it won´t be as easy,\" he said, \"but hopefully, the net gain on the other end is something the entire industry will benefit from.\"",
        "___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}