{
    "articleURL": "/news/article-12059363/Two-Texas-women-sued-friends-husband-helped-abortion-countersue-him.html",
    "content": [
        "Two women who were sued earlier this year for allegedly helping facilitate a friend's abortion, have filed a countersuit against the woman's ex-husband The pair are not facing criminal charges, but are being sued for $1million each for helping Marcus Silva's wife Brittni obtain a common abortion pillSilva's suit against the women is the first of its kind after the landmark Supreme Court decision last July that overturned Roe V. Wade Two women in Texas are countersuing a man who filed a wrongful death suit against them for helping his now-ex-wife obtain an abortion via pill last year.",
        "Jackie Noyola and Amy Carpenter hit back at the $2million suit this week, arguing that Marcus Silva invaded their privacy by going through his spouse's phone without her consent.They also argue that Silva found the abortion medication and texts before Brittni Silva underwent the procedure and did nothing to stop her.Noyola and Carpenter's lawyer, Rusty Hardin, told The New York Times: 'They’re being thrust into the public arena, with their financial well-being at risk ... They believed strongly that they were helping a friend at a time of dire need.'Silva's suit against the women is the first of its kind after the landmark Supreme Court decision last July that overturned Roe V. Wade, which allowed state abortion bans to go into effect. His suit argues that a self-managed abortion in tantamount to murder under Texas law.",
        "Noyola and Carpenter's countersuit states that Silva was aware that Brittni was making arrangements to get an abortion but did nothing to intervene.'Rather than talking with [his ex-wife] about what he found or disposing of the pill, Silva took photos of the texts and surreptitiously put the pill back,' reads the suit.'He wasn’t interested in stopping her from terminating a possible pregnancy.'Instead, he wanted to obtain evidence he could use against her if she refused to stay under his control, which is precisely what he tried to do.' ",
        "Several months back, Silva filed suit in Galveston against three women who allegedly helped facilitate his ex-wife's abortion. His suit argues that a self-managed abortion in tantamount to murder under Texas law.He is suing each of the defendants - including Aracely Garcia - for $1million. None of the women are facing criminal charges.The lawsuit accuses three women of helping Brittni Silva obtain abortion pills and then convincing her to conceal their 'murderous actions.'Further complicating the case is provision that, in Texas, it is a crime to provide an abortion to someone else, but not to self-administer one. And the abortion at issue in Silva's case took place before the state's six-week abortion ban went into effect.Silva's attorney, Jonathan Mitchell, a former Texas solicitor general, has advocated for the tactic of using private lawsuits to deter abortions.He was responsible for the bulk of the 2021 Texas law that led clinics in the Lone Star state to stop providing abortion after six weeks, by empowering citizens to sue for cash judgements of up to $10,000 per procedure.   The original suit cites a text exchange between the women and Silva's ex-wife about Aid Access - an organization which send abortion pills through the mail.According to the filing, the women said getting pills in the mail might be 'murky' and instead opted to find them in Houston - two of the friends offering their homes for the abortion.",
        "It also alleged that on Halloween of 2022, Noyola, Carpenter, and Brittni 'celebrated the murder by dressing up in Handmaid’s Tale costumes for Halloween.'",
        "The countersuit includes screenshots of the text exchanges that also show the ex-wife worrying about Silva's response to the abortion.'I know either way he will use it against me,' she wrote, adding that he might use it as a reason to stay together or 'to act like he has some right to the decision.'Brittni Silva claimed her now-ex had a history of emotionally abusive behavior, including burning the couple's wedding photos and threatening the family dog. Ms. Silva once told her friends that she called the police because he was harassing her. The women also expressed concern about Silva in the text messages.'I just worry about your emotional state, and he'll be able to snake his way into your head,' one said.'Delete all conversations from today,' another wrote. 'You don't want him looking through it.'The filing also includes a police report he filed in which he admitted to going through his wife's phone, which is a clear violation of Texas law. Additionally, there appear to be screenshots of a police report Silva allegedly made to the League City Police Department on July 17 of last year, claiming he found a pill labeled MF in his ex-wife's purse nearly a week prior.",
        "He identified the pill as mifepristone, a common abortion-inducing medication. Silva did not confront his ex-wife for two weeks following his discovery, during which time she took the medication. Silva, who divorced his wife in February 2022 and has two other children with her, is not pursuing legal action against her. "
    ]
}