{
    "articleURL": "/wires/afp/article-12050909/King-Charles-helps-chief-rabbi-respect-Shabbat-coronation.html",
    "content": [
        "Britain's chief rabbi will join other faith leaders at Saturday's coronation of King Charles III but faces a unique problem -- how to ensure his attendance does not breach the Jewish Shabbat.",
        "Ephraim Mirvis on Friday praised the \"respectful, sensitive\" way that King Charles's office had handled the situation -- even inviting him to spend the night with his wife Valerie at St James's Palace.That will enable the chief rabbi to walk to the nearby Westminster Abbey on Saturday morning, rather than breaking Shabbat rules by using motorised transport.A Kosher caterer has been brought in to prepare their Friday night dinner of coronation chicken, Mirvis told Sky News television.After the Christian coronation service, the chief rabbi will join British Muslim, Hindu, Sikh and Buddhist leaders in making a spoken declaration in unison towards their newly crowned monarch.\"It will be quite brief, but exceptionally powerful,\" Mirvis said, while stressing that he was not required to speak into an electronic microphone in the abbey, again to respect the Jewish holy day.The unprecedented joint declaration from the religious leaders reads: \"Your Majesty, as neighbours in faith, we acknowledge the value of public service.\"We unite with people of all faiths and beliefs in thanksgiving, and in service with you for the common good.\"- 'Defender of faith' -Mirvis consulted judges from Britain's Beth Din Jewish court who agreed it was permissible to enter a Christian church on this Shabbat, out of respect for an invitation from the sovereign.",
        "\"This is a wonderful feature of 21st-century Britain, and our king wants to champion the rights of members of all faiths to practise their religion,\" the chief rabbi added.\"He did this marvellously while he was prince of Wales. He's continuing now as the king,\" he said.\"And it's not just within the Jewish faith. I know that members of other faiths as well hugely appreciate this. And now to be included in the coronation service, it's very special.\"The service at Westminster Abbey will be overwhelmingly drawn from the Christian liturgy as Charles takes an oath to serve as \"Defender of the (Protestant) Faith\" and to protect the established Church of England.But the king has a long interest in bridging religious divides and spoke about acting as a \"defender of faith\" in general, as Britain grew more multi-cultural under the 70-year reign of his late mother Queen Elizabeth II.The other faith leaders attending the coronation include Aliya Azam, interfaith coordinator at the Islamic Al-Khoei Foundation, and Radha Mohan from the Bhaktivedanta Manor Hindu temple.The manor house, northwest of London, was donated to the Hare Krishna movement in 1973 by former Beatles guitarist George Harrison.- 'Non-religious society' -Also attending are Indarjit Singh, a Sikh member of the House of Lords, and The Most Venerable Bogoda Seelawimala, the chief monk of one of London's main Theravada Buddhist temples.",
        "But Andrew Copson, head of Humanists UK, which campaigns for the rights of non-religious people, argued the Anglican service \"is not representative of the diverse and mostly non-religious society in which we live today\".He added: \"All state occasions would be more representative of our nation if they reflected our shared values rather than unshared beliefs.\"Separately during the abbey service, ethnic minority members of parliament's upper House of Lords will present non-Christian regalia to Charles, such as gold bracelets and the royal robe.In another coronation first, Charles will pray aloud during the service, to ask God that \"I may be a blessing to all thy children, of every faith and conviction\".However, those of no faith represent a growing proportion in Britain.In the 2021 census, some 27.5 million people, or 46.2 percent in England and Wales, described themselves as Christian, down 13.1 percentage points from 2011.Those listing \"no religion\" rose by 12 points to 37.2 percent.Muslims represented 6.5 percent of the population, followed in order by Hindus, Sikhs, Buddhists and Jewish people."
    ]
}