{
    "articleURL": "/wires/reuters/article-12061371/Soccer-Everton-Forest-boost-survival-hopes-Southampton-down.html",
    "content": [
        "Forest and Everton move out of the relegation zone with wins",
        "Leicester suffer 5-3 hammering at FulhamTwenty-one goals scored on manic Bank Holiday MondayBy Martyn HermanLONDON, May 8 (Reuters) - Everton and Nottingham Forest gave themselves renewed hope of survival as the Premier League relegation dog-fight witnessed an extraordinary goal-rush on Monday.Everton ended a 13-match run without an away league victory with a stunning 5-1 win at Brighton and Hove Albion to move out of the relegation zone with three games remaining.Nottingham Forest then sent Southampton to the brink of relegation with a thrilling 4-3 win at the City Ground that also lifted the two-time European champions out of the bottom three.Leicester City were the big losers as a 5-3 hammering at Fulham meant they ended the day third from bottom and with games against Liverpool and Newcastle United next they are now in grave danger of sliding out of the top flight.The 21 goals that hit the net on a manic Bank Holiday Monday was the most ever on a day of three Premier League games.Everton had managed only 27 goals from 34 games before travelling to Brighton for a match they dared not lose if they were to retain real belief in extending their 69-years stay in the English top flight.",
        "They responded with a stunning display of counter-attacking football to score five times from 22% possession.Abdoulaye Doucoure scored after 34 seconds from Dominic Calvert-Lewin's cross and another quick Everton break saw Dwight McNeil cross for Doucoure to volley a superb second.Sean Dyche's side were three-up in the 35th minute when McNeil's low cross went in off the foot of Brighton keeper Jason Steele.McNeil added two more after the break either side of Alexis Mac Allister's effort for the shell-shocked hosts whose hopes of qualifying for the Europa League suffered a blow.Everton have 32 points in 17th place, two more than 18th-placed Leicester and Leeds United.'FEEL-GOOD FACTOR'\"They're very high, feeling the feel-good factor. But it's only another step,\" Dyche, whose side host leaders Manchester City next weekend, said.Forest began the day in the bottom three and knew only a win against Southampton would do.Steve Cooper's side went 2-0 up with a brace by Taiwo Awoniyi's before Carlos Alcaraz pulled a goal back.Morgan Gibbs-White's penalty just before halftime restored Forest's two-goal cushion but Lyanco's header gave Southampton renewed hope early in the second half.Gibbs-White's sublime flick allowed Danilo to make it 4-2 but Southampton captain James Ward-Prowse's stoppage-time penalty ratcheted up the tension.",
        "The final whistle was greeted by a huge roar of relief as Forest moved up to 16th place with 33 points.\"It was a very important win and now's not the time to pick the bones out of it,\" Forest boss Cooper said.\"It was always going to be a rollercoaster on a night like this but we stuck together.\"Forest are away at Chelsea next while Southampton (24 points) will be relegated if they do not win at home against Fulham next weekend.Leicester had taken five points from their last three games to ease their fears but the wheels came off in spectacular fashion at Fulham for whom Willian and Tom Cairney scored twice.Fulham never really looked to be in danger with Leicester playing catch-up throughout the contest after a dismal first-half display, which was criticised by playmaker James Maddison.\"We were not hungry enough to want to win the game. We need to do the basics well,\" Maddison said.\"We can't defend like we did, that is why we are where we are but it not just the defence, it is the team. The team needs to be watertight and that comes from the front too.\"With Fulham in 10th place, Bournemouth all but safe and Forest out of the bottom three it could be only the fourth Premier League season in which the three promoted teams all avoid going down, the last occasion being in 2017-18.",
        "(Reporting by Martyn Herman Editing by Toby Davis)"
    ]
}