{
    "articleURL": "/tvshowbiz/article-12049153/Bad-Boys-4-casting-shakeup-Tasha-Smith-replace-Theresa-Randle.html",
    "content": [
        "With Bad Boys 4 continuing production, the highly-anticipated sequel has made a surprising casting change.",
        "Theresa Randle - who has played Theresa Burnett, the wife of Martin Lawrence's Marcus Burnett in the first three Bad Boys movies - has been replaced in Bad Boys 4 by Tasha Smith, reports Variety.Plot details on the sequel have been kept under wraps, and it's unclear why Randle was ultimately replaced by Smith.Will Smith - who was spotted filming the sequel earlier this week in Atlanta - will return as Burnett's partner, Mike Lowrey.They will be joined by three stars from 2020's Bad Boys For Life - Vanessa Hudgens (Kelly), Alexander Ludwig (Dorn) and Paola Nunez (Captain Rita Secada). ",
        "Both Smith and Lawrence appeared in a video from the set that played for CinemaCon attendees in Las Vegas last week, where Smith revealed they had been filming for roughly four weeks.Newcomers to the franchise include Eric Dane, who joined the cast in April and is said to be playing the new villain, with Ioan Gruffudd signing on as well.Bad Boys For Life directors Adil El Arbi and Bilall Fallah are returning to direct from a script by Chris Bremmer (Bad Boys For Life, The Man From Toronto), based on characters created by George Gallo.Jerry Bruckheimer is returning to produce, alongside Will Smith through his Westbrook company and Doug Belgrad.",
        "Martin Lawrence, James Lassiter, Chad Oman, Mike Stenson, Barry Waldman and Jon Mone will also be serving as executive producers.The franchise kicked off in 1995 with Michael Bay's directorial debut Bad Boys, which opened at $15.2 million en route to $65.8 million domestic and $141.4 million worldwide from a $19 million budget.That movie - along with 1996's Independence Day - solidified Smith as a bona fide box office star, though it took several years for the first sequel to move forward.Bad Boys II was finally released in 2003, with Smith and Lawrence returning and the sequel introducing Syd as Marcus' sister... who Mike was secretly dating.",
        "The sequel - directed by Michael Bay from a script by Cormac and Marianne Wibberley - opened at $46.5 million and took in $138.6 million domestic and $273.3 million worldwide from a $130 million budget.While a third movie had been discussed for years, it took 17 years for the third movie - Bad Boys For Life - to finally see the light of day, debuting in January 2020, just months before the COVID-19 pandemic shuttered theaters around the world.The sequel - which brought back Smith and Lawrence - debuted with a franchise-best $62.5 million with $206.3 million domestic and $426.5 million worldwide from a trimmed budget of $90 million.",
        "Tasha Smith started her career as an actress with roles in The Whole Ten Yards, ATL, Why Did I Get Married, The Longshots and more, perhaps best known for playing Carol Hardaway in Fox's Empire, while also branching out as a director. She has directed episodes of Star, Black Lightning, 9-1-1, Big Sky, BMF and most recently Mayor of Kingstown and Bel-Air. "
    ]
}