{
    "articleURL": "/wires/reuters/article-12049941/CEE-ECONOMY-Fears-deeper-Hungarian-recession-industry-shrinks-retail-sales-fall.html",
    "content": [
        "WARSAW, May 5 (Reuters) - Hungary's industrial output fell much more than expected in March while retail sales plunged, statistics office data showed on Friday, raising the spectre of further contraction in an economy that tipped into technical recession in 2022.",
        "Central European economies have taken a hit from double-digit inflation that has sapped demand and created problems for companies as they struggle to pass on costs to shoppers with increasingly stretched budgets.Hungary's industrial output fell by an annual 4.1% in March based on preliminary unadjusted data, a bigger drop than the 1.2% forecast in a Reuters poll. It follows a decline of 4.6% in the previous month.Meanwhile, Hungarian calendar-adjusted retail sales fell by an annual 13.1% in March following a 10.1% drop in February, as inflation, running above 25% in annual terms, eroded purchasing power.\"Looking at the industrial output and retail sales results for the first quarter we can be sure that the technical recession has continued in Hungary,\" said Peter Virovacz, senior economist at ING in Budapest. \"I think that the first quarter will bring another quarter-on-quarter contraction (in GDP).\"Hungary, together with the Czech Republic, entered technical recession, showing two quarterly contractions in a row, at the end of 2022.However, the Czech economy probably pulled out of recession in the first quarter with slight growth driven by trade, preliminary data indicated on Tuesday.Nevertheless, Czech consumers still looked to be feeling the pinch from high inflation as statistics office data showed retail sales falling 8.1%, more than the 6.6% drop forecast in a Reuters poll.",
        "The reading marked the eleventh straight month that retail sales have declined.Although economists believe inflation in central Europe has peaked, it remains high - at 15% in the Czech Republic in March.The Czech National Bank (CNB) came close to raising interest rates on Wednesday, with a slim majority backing continued policy stability.However, the National Bank of Hungary (NBH) slashed the top of its interest rate corridor by 450 basis points to 20.5%, paving the way for potential cuts in the 18% rate on its one-day deposit facility in coming months. (Reporting by Alan Charlish in Warsaw and Jason Hovet in Prague Editing by Mark Potter)"
    ]
}