{
    "articleURL": "/money/saving/article-12047519/How-lost-inflation-value-cash-homes-investments-fallen-2020.html",
    "content": [
        "Savers, homeowners and investors will have all seen gains in nominal termsBut buying power of £10,000 in cash since Jan 2020 will have fallen to £8,394We dig into how inflation has impacted your savings and assets in recent years It's all too easy for people to consider the increasing value of their home, see the rising interest they're earning on their savings, or the gains from their investments, and feel richer.",
        "In nominal terms at least, that's true. Money held in property, investments and savings by and large does tend to rise over time, though to varying degrees.Over the last three years, the average UK home has risen in value by about 24 per cent, according to the Land Registry. ",
        "In nominal terms that means the typical homeowner is £56,897 richer than they were merely three years ago - based on the average UK house price.Many investors will also be feeling better off than three years ago. The average stocks and shares Isa is up 23.61 per cent on May 2020, according to data provided by Moneyfacts and sourced from analytics firm Lipper, although it has fallen by 1.5 per cent over the past year.Savers have also seen rates surge since the start of last year, though admittedly from rock bottom levels. A saver can now secure up to 5 per cent interest with a fixed savings account. So far, so good. But the picture is very different when we look at what's happening in real terms, taking into account inflation.Inflation is the rate at which costs rise. For example, if the average pint of milk rises from 60p to 66p over 12 months, then milk inflation is 10 per cent.",
        "The consumer prices index measures the average change in prices of core goods and services over time, including transport, food, and medical care.To do this, every month, a team of roughly 300 analysts visit 20,000 shops in 141 different locations recording around 180,000 price quotes in the process.The UK's CPI inflation rate has risen by 19.1 per cent since the start of 2020. Over the past 10 years inflation has risen by 31.4. per cent, while it is up 71.2 per cent over the past 20 years.You can check how prices have changed over the years with This is Money's inflation calculator.Thanks to some number crunching by the investment platform AJ Bell, it is possible to see the impact that inflation has had on our cash and assets in recent times. We look at how different groups have been affected by inflation, from savers and investors to those just keeping their money in their current account. ",
        "Money sitting in a current account If someone had kept £10,000 in their current account since the start of 2020, earning no interest, they would have seen the purchasing power of that cash fall to £8,394 as of March this year.Money in a typical savings account Those using interest-paying savings accounts won't have fared much better since the start of 2020 either. Although rates have improved, with the average easy-access account now paying 2.1 per cent, over the last five years the typical rate has only been 0.55 per cent, according to Moneyfacts. ",
        "That's £5.50 back per year for every £1,000 saved - certainly not enough to keep up with inflation.AJ Bell estimates that since the start of 2020 the average easy-access saver will have seen the purchasing power of £10,000 fall to £8,480 in real terms.  ",
        "With inflation currently at 10.1 per cent in the 12 months to March and the best easy-access savings rate paying 3.71 per cent savers are essentially seeing their wealth decimated in real terms.If the rate of inflation was 10.1 per cent this time next year, what someone can buy with £1,000 now would cost £1,101.Stashing £1,000 in the best paying easy-access deal paying 3.71 per cent today would reduce their loss - but they would still end up worse off.Money invested in a typical global equity fund Investors will have likely fared much better, although a significant proportion of the gains they've made will still have been eroded by inflation over the past three years.A typical investor holding £10,000 in a global equity fund would be up 25.3 per cent in nominal terms since the start of 2020, according to AJ Bell.This means that in real terms they will be up 5.2 per cent, with that £10,000 now having the equivalent buying power of £10,521.",
        "PGRpdiBkYXRhLW1vZHVsZS12ZXJzaW9uPTEuNC4wIGRhdGEtbW9sLWZlLXhwbW9kdWxlLXNhdmluZ3MtbmV3c2xldHRlciBkYXRhLXBsYXRmb3JtPWlvcyBkYXRhLW5ld3NsZXR0ZXI9InNhdmluZ3MiIGRhdGEtY29sb3ItdGhlbWU9cHVycGxlIGRhdGEtZm9ybS1hY3Rpb24tdXJsPSJodHRwczovL2xpbmsubmV3cy50aGlzaXNtb25leS5jby51ay9zL1RoaXMrSXMrTW9uZXkrLStTYXZpbmdzK0FsZXJ0cyIgZGF0YS1wcml2YWN5LXBvbGljeS11cmw9Imh0dHBzOi8vd3d3LnRoaXNpc21vbmV5LmNvLnVrL2hvbWUvYXJ0aWNsZS03NzU5MjczL1ByaXZhY3ktQ29va2llcy1Qb2xpY3ktUG9saWN5Lmh0bWwiPjwvZGl2Pg==",
        "Money invested in a typical  UK equity income fundHowever, some investors may have actually lost ground. For example, a typical investor with £10,000 in a UK equity income fund will only be up 7.7 per cent in nominal terms since the start of 2020. In real terms, they'd be down 9.6 per cent. In other words that £10,000 would have the equivalent purchasing power of £9,039 today.The owner of an average-priced UK home The typical homeowner should have fared better thanks to the pandemic-induced property boom. But once again, inflation means they may not have gained as much as they might think.The average homeowner has seen their house price rise by 24 per cent since the start of 2020.But although the typical homeowner would be roughly £57,000 richer today than they were at the start of 2020 - based on the average UK house price - were they to sell up in order to realise that gain, that £57,000 would have the same purchasing power today as £47,845 had at the start of 2020. Taken together alongside moving fees, such as stamp duty, estate agents, lawyers, surveyors and removals firms, then it's unlikely a typical homeowner will be walking away quite as rich as they may have thought.",
        "Looking back over a decade shows brighter picture With inflation reaching 40-year highs in recent months, the pain people have felt has been concentrated into an unusually short amount of time.Inflation was at 10.1 per cent in the 12 months to March, according to the most recent figures. It means there will be few people who aren't poorer in real terms compared to this time last year.But looking back over the most recent decade, the impact of inflation on people's finances will be less severe. Over the past 10 years the average global equity fund has risen by 132.6 per cent, according to AJ Bell.",
        "There are none that beat inflation this month, however, make sure you shop around for the best returns possible.Easy-access: Chip - 3.71%Limited-Access: Yorkshire BS - 3.85%Notice account: Investec 90-day - 4.25% One-year fixed-rate: Allica Bank- 5%Two-year fixed-rate: DF Capital - 4.95% Easy-access cash Isa: Cynergy Bank - 3.5%",
        "During that time, inflation has risen by 31.4 per cent meaning that a £10,000 investment in a global equity fund will still be up 77.1 per cent in real terms compared to 10 years ago.It's a similar story for property. Over the past 10 years the typical UK home has risen 71.5 per cent in nominal terms. Ignoring the impact of mortgages and leverage to keep things simple, this means someone who purchased a property for £100,000 10 years ago will have, on average, seen a 30.5 per cent rise in real terms when taking into account the rising cost of living. ",
        "A property that was worth £100,000 a decade ago will on average now be worth £171,460. However, at the same time the cost of living has also risen, meaning in real terms the property has only risen to £130,490 in real terms, according to AJ Bell. While housing wealth and investments will have largely outpaced inflation over the last 10 years, the same cannot be said for the wealth of the typical saver.The average easy-access savings account has returned just 0.55 per cent per year over the past 10 years, according to Moneyfacts.Even a saver who has managed to record an average 1 per cent return over the past decade will be much poorer in real terms, based on AJ Bell's analysis. Over 10 years, a saver earning 1 per cent will have seen £10,000 grow to £10,525 in nominal terms. However, adjusted for inflation, that £10,000 will have declined 15.2 per cent in value and be worth £8,480 in real terms.Where is inflation going next, and how can you beat it?There is much debate at present over future inflation. Some believe it will begin falling and soon return to normal levels - in other words the Bank of England inflationary target of 2 per cent.The Bank of England expects inflation to fall to around 5 per cent by the end of this year. It expects it to then fall to under 2 per cent over the next two years.However, some believe inflation will prove to be stickier, more volatile and longer lasting.If the latter is true, inflation could wreak havoc on our finances. For example, £1,000 of cash (earning no interest) would have dropped in value to £858.73 after five years, with real inflation at 3 per cent. But if inflation were to remain at 10 per cent, that £1,000 would only be worth £590.40, after five years.",
        "Rob Burgeman, investment manager at wealth manager RBC Brewin Dolphin suggests investing for the long term is the most effective way to mitigate the effects of inflation.He says: 'Whilst interest rates on cash savings have increased, a good way to shield your investments in the long-term, from the ravages of inflation is to maintain a diversified portfolio that invests your money across a range of asset classes, including stocks and bonds.  'Although the stock market is volatile and investing comes with risks, history shows that over long periods it tends to perform more strongly than cash  'Cash has very little ability to grow over time – and certainly not in real, inflation adjusted terms. 'Although the stock market is volatile and investing comes with risks, history shows that over long periods it tends to perform more strongly than cash and above the rate of inflation.'Although rising interest rates are typically considered negative for investments, because higher interest rates tend to negatively affect earnings and stock prices, this doesn't alter the long-term case for investing. 'The economy tends to go through different interest rate cycles – sometimes they are relatively low and sometimes they are relatively high – and the timing of these cycles can vary from one country to another. 'In addition, different sectors perform differently in changing economic conditions.'He adds: 'Companies have the ability to pass on over time price increases in the form of higher rents or higher prices for their goods and services which, in turn, gives them an inherent element of inflation protection. 'There is, however, a lag effect to this and, inevitably, there is a greater of volatility in owning equity types of investment. 'Nevertheless, history has shown that few other assets can match these type of assets ability to preserve their value over time.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}