{
    "articleURL": "/news/article-12055595/Anthony-Albanese-wears-South-Sydney-Rabbitohs-socks-King-Charles-Coronation.html",
    "content": [
        "Anthony Albanese wore NRL-themed socks to coronationHe is a diehard fan of the South Sydney RabbitohsAnthony Albanese has shown his undying support for the South Sydney Rabbitohs by donning a pair of the team's socks to the Coronation of King Charles III.",
        "The Prime Minister was forced to miss his favourite team's Magic Round win against the Melbourne Storms on Saturday night because he had to be in London for the historic event.Photos showed Mr Albanese dressed in a navy suit and red speckled tie outside Westminster Abbey alongside partner Jodi Haydon and other world leaders.",
        "As he walked, flashes of green and red - the team's signature colours - could be seen around his ankles.South Sydney chief executive Blake Solly said it was a sign of 'Albo's true passion for our club'.'He is a Rabbitoh to the core,' Mr Solly told News Corp on Sunday.'Hopefully our performances make home proud of the club, and wearing those socks on such an important occasion gives us great pride too.'The Prime Minister's passion for the club dates back about 20 years, when he was one of 80,000 South Sydney Rabbitohs supporters who took to the streets of Sydney to protest their expulsion from the newly formed NRL competition.He also famously stood in federal parliament in 1999 and tabled a range of motions including calling upon the NRL to include South Sydney in the 2000 competition.'Like the working-class people who support them, South Sydney have always paid their way,' he said.",
        "'Unlike teams such as Melbourne and Cronulla who would be insolvent were it not for News Limited.",
        "'And people from this proud tradition know how to fight, in parliament, in the streets and in the court. Mr Albanese still wears his weathered scarf and battered, vintage Rabbitohs jersey regularly.At the coronation on Saturday, he was joined by fellow Australians singer Nick Cave, comedian Adam Hills, former foreign minister Julie Bishop, and Matildas captain Sam Kerr - who was Australia's flagbearer.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.At Saturday's coronation, he and Queen Consort Camilla will be officially crowned by the Archbishop of Canterbury, Justin Welby."
    ]
}