{
    "articleURL": "/wires/reuters/article-12056551/Reuters-US-Domestic-News-Summary.html",
    "content": [
        "Following is a summary of current US domestic news briefs.",
        "At least 8 people killed by gunman at Texas mall; shooter killed by policeA gunman shot and killed eight people and wounded at least seven others at a busy mall north of Dallas on Saturday, police said. The gunman, whom authorities said they think acted alone and whose motive was not yet known, was killed by a police officer after he began firing outside of the Allen Premium Outlets mall in Allen, Texas, the city's police chief Brian Harvey said at a press conference.Georgia fake elector defendants accept immunity in Trump probe -lawyerProsecutors for Georgia's Fulton County have granted immunity to at least eight people under investigation for conspiring to overturn Georgia's vote in the 2020 presidential election, according to a court filing on Friday. Fulton County District Attorney Fani Willis is expected to disclose this summer whether former President Donald Trump and others will be charged with crimes related to interfering with the 2020 election.Man who pepper-sprayed police gets 14 years in longest Jan. 6-related sentenceA Pennsylvania man found guilty of felony assault and other charges for pepper-spraying police officers outside the U.S. Capitol was sentenced on Friday to 14 years behind bars, the longest prison term to date for anyone convicted in the riot of Jan. 6, 2021. Peter J. Schwartz, 49, was convicted last December at a trial in federal court where evidence showed he was in the vanguard of a mob attacking police at the lower west terrace of the Capitol and boasted later that he had \"started a riot\" by \"throwing the first chair.\"",
        "U.S. Supreme Court halts execution of Oklahoma inmate GlossipThe U.S. Supreme Court on Friday halted the scheduled execution of Oklahoma death row inmate Richard Glossip, whose cause drew support from the state's Republican attorney general after an investigation shed new light on evidence relating to the 1997 murder Glossip was convicted of commissioning. The justices acted after a divided Oklahoma state panel on April 26 voted against recommending clemency for Glossip, 60, who was scheduled to be executed on May 18 for his role in the murder of motel owner Barry Van Treese.U.S. to finalize rule to limit asylum access at Mexico border by May 11The U.S. will finalize by May 11 a new regulation that will deny asylum to many migrants caught crossing the U.S.-Mexico border illegally, the same day sweeping COVID-19 restrictions at the border are set to end, Homeland Security Secretary Alejandro Mayorkas said on Friday. Under the new regulation, migrants will be presumed ineligible for asylum if they passed through another country en route to the U.S. without seeking protection or if they failed to use other legal pathways to the United States.Justice Department seeks 25-year prison sentence for Oath Keepers founder RhodesThe U.S. Justice Department asked a federal judge on Friday to sentence Oath Keepers founder Stewart Rhodes to 25 years in prison for his conviction on seditious conspiracy and other charges over the 2021 attack on the U.S. Capitol by supporters of former President Donald Trump. The Justice Department is also seeking a sentence of 21 years for another Oath Keepers leader, Kelly Meggs, who was also found guilty in November of seditious conspiracy by a Washington, D.C., jury.",
        "Fox asks Dominion Voting to probe leaks of Tucker Carlson messagesFox News on Friday asked lawyers for Dominion Voting Systems to investigate whether they leaked controversial internal messages from ousted Fox host Tucker Carlson that were provided in evidence for their recent defamation lawsuit. The requests, which were made in letters released by Fox, came after multiple news outlets published racist and sexist remarks by Carlson contained in leaked internal messages and recordings.Horse racing-Kentucky Derby favorite Forte scratched from raceEarly favorite Forte has been scratched from the Kentucky Derby hours before post time for the first leg of U.S. thoroughbred racing's Triple Crown due to concerns about a bruised front foot, Churchill Downs said on Saturday. The Todd Pletcher-trained dark bay colt had brought a five-race win streak to the 1-1/4-mile Kentucky Derby at Churchill Downs and was installed as the early 3-1 favorite.Senate Republicans oppose vote just to raise US debt ceiling, push for other prioritiesA group of 43 Republicans in the U.S. Senate said they oppose voting on a bill that only raises the U.S. debt ceiling without tackling other priorities, in a letter to Democratic Senate Majority Leader Chuck Schumer, showing they could block such a plan by Democrats. Citing an economy \"in free fall,\" the Republicans, led by Senator Mike Lee and including Minority Leader Mitch McConnell, said \"substantive spending and budget reforms\" need to be \"a starting point\" for negotiations.",
        "DeSantis signs bill allowing Florida board to cancel Disney dealsFlorida Governor Ron DeSantis on Friday signed a bill into law that gives a new board he controls the power to void development agreements its predecessor body signed with Disney - the latest episode in a feud between the conservative governor and the entertainment giant. Under the bill, which passed the Republican-controlled legislature largely along party lines, the Central Tourism Oversight District Board - whose members are appointed by DeSantis - can cancel any deals signed up to three months before the board's creation."
    ]
}