{
    "articleURL": "/tvshowbiz/article-12039379/Freddie-Flintoffs-BBC-shows-CONFIRMED-recovers-Gear-horror-crash.html",
    "content": [
        "Freddie Flintoff will reportedly be off air until at least 2024 as he continues to recover from a Top Gear crash that left him 'lucky to be alive'.",
        "The former England cricket ace was airlifted to hospital with facial injuries and broken ribs after a collision at the Dunsfold Aerodrome in Surrey last December. Production on the motoring series had already been halted by the corporation and now it's believed another show the 45-year-old is involved in has been shelved. The unnamed BBC2 series, in a similar vein to The Repair Shop, was set to show vehicle owners bringing in their old bangers to be repaired by Freddie and his team.A source said: 'It was hoped that the restoration show might have been an easy way back into making television for Freddie, who's clearly been shaken up by the accident.'",
        "'And the fact that he could have been making it this spring meant there was a chance we could see him back on our screens by the end of the year.'But it's not a good sign that the filming has been called off at such a relatively late stage, and viewers will be gutted that such a popular star has been off air for so long.' MailOnline have contacted Freddie's representatives and the BBC for comment. Last month Freddie was seen for the first time since his horror smash which left him seriously injured four months earlier. ",
        "He had been driving an open-topped three-wheel 130mph Morgan Super 3 car when the vehicle flipped at an aerodrome.He was left with broken ribs and serious facial injuries after the accident and has been resting up since, cancelling his work commitments. It was later said he was 'lucky to be alive' following the incident.But Freddie was spotted with his face covered and wearing a bucket hat while sitting in the passenger seat of his car while his wife Rachael drove, in pictures published by The Sun on Sunday.An onlooker told the publication: 'He was reading something on his phone, and stayed in the car while Rachael popped into a shop.",
        "'It was good to see him out and about in public, and apparently doing well after what he has been through.'He did look as though he had lost a bit of weight, though.'It comes after a BBC chief said it would be 'really inappropriate' to resume filming Top Gear as Freddie recovers from his horror crash. At a Broadcasting Press Guild (BPG) event last month, Charlotte Moore – the corporation's chief content officer – was asked if the BBC is committed to Top Gear returning.She said: 'My priority at the moment is supporting Freddie through his recovery so I think it would be really inappropriate for us to resume filming now.",
        "'I think when we get to the point where he feels ready... and we'll get to thinking about getting him back.'",
        "She added: 'I think we've got to talk about what Freddie wants to do. When someone's in recovery, I don't think we would push that ... I think that would be really inappropriate, I wouldn't be happy.'I think you've got to be really human about this and do the right thing.'A statement from the BBC earlier this year said there will be a health and safety review of the show, 'in line with our procedures', following the December 13 crash. It is understood that a decision about resuming filming will be made later in the year.Freddie has taken time off from all work to recover and Top Gear will reportedly not return.The Morgan Motor Company was known for making three-wheel cars before the war before bringing them back into production in the 2000s."
    ]
}