{
    "articleURL": "/wires/reuters/article-12038769/EU-plans-boost-ammunition-production-aid-Ukraine.html",
    "content": [
        "BRUSSELS, May 2 (Reuters) - The European Union's executive wants to set aside more than 500 million euros ($550 million) to increase ammunition production to help Ukraine and replenish the stocks of EU member countries.",
        "Under a plan to be presented by the European Commission on Wednesday, the EU would give subsidies to European arms firms for investments that increase production of ammunition and missiles.\"When it comes to defence, our industry must now switch to war economy mode,\" Thierry Breton, the commissioner for the EU's internal market, said in remarks released before the official announcement.The plan will need approval from EU governments and the European Parliament to become reality.The scheme is the third part of a broader EU effort to get more ammunition and arms to Ukraine, particularly 155 millimetre artillery shells, which Kyiv is pleading for as the fight against Russia's invasion has become a war of attrition.As part of the push to supply 1 million shells to Ukraine within 12 months, the EU has already agreed to set aside 1 billion euros ($1.10 billion) for ammunition and missiles that its members send to Ukraine from stockpiles.It has allocated another 1 billion euros for the joint procurement of such munitions - although that part of the plan has been held up by wrangling over the extent to which they should be produced in Europe.The latest element of the ammunition drive aims to give arms firms incentives to increase their production.",
        "It would set aside 500 million euros from the EU budget to part-finance projects that increase capacity. It would also allow EU regional development cash, known as cohesion funds, and coronavirus pandemic recovery funds to be used for such projects.Breton said the EU had a substantial industrial base for the production of ammunition but \"it does not have the scale today to meet the security needs of Ukraine and our Member States\".\"We can and must revitalise it to adapt it to the needs of high-intensity conflict,\" Breton said.($1 = 0.9092 euros) (Reporting by Andrew Gray; editing by Grant McCool)"
    ]
}