{
    "articleURL": "/sport/football/article-12059435/USA-striker-Haji-Wright-attracting-Southampton.html",
    "content": [
        "USMNT striker Haji Wright has impressed Premier League side SouthamptonThe 25-year-old scored USA's goal in their 3-1 last-16 World Cup loss to Holland DailyMail.com provides all the latest international sports news Southampton has checked on USA international striker Haji Wright after impressing in Turkey club soccer.",
        "The speedy frontman featured in all of the USA's games at the World Cup and scored their only goal against Holland. With the Dutch two goals to the good, Wright pulled one back in the 76th minute in their last-16 clash in Qatar.He was a surprise inclusion in Gregg Berhalter's 26-man roster for the showpiece tournament last November.The 25-year-old was chosen ahead of Ricardo Pepi following his form in the Turkish Super Lig. ",
        "He has grabbed 16 goals in 26 games for Turkish side Antalyaspor this season and that has alerted Southampton who are looking to bolster their attack. Wright's last goals came in a 3-3 tie with Istanbulspor on April 19, in which he grabbed a brace.In the group stage, Wright made his only start of the tournament against England - playing 83 minutes before being taken off for Josh Sargent. He was brought on in the 67th minute of the Holland game - scoring a wild, looping goal in just nine minutes off an assist from Christian Pulisic. Wright has been making his way around Europe after growing up in Los Angeles and playing in the LA Galaxy academy. He moved to Schalke's academy - joining future USMNT teammate Weston McKennie.In Gelsenkirchen, he logged seven appearances with the first team over two seasons - grabbing one goal. With the second team, he put up 14 goals in 22 appearances. ",
        "For the 2017-18 season, he was loaned to 2. Bundesliga side SV Sandhausen and only managed one goal in 15 appearances. Wright then moved to VVV-Venlo of the Dutch Eredivise and couldn't score a goal, leading to a pandemic-year move to SønderjyskE of the Danish Superleague.",
        "In Denmark, Wright found his scoring touch - bagging eleven goals in 29 appearances. The following year, he was loaned out to Antalyaspor - a move that became permanent as SonderjyskE were relegated.In the loan season as well as this current one, Wright proved to be a valuable scorer.Meanwhile, Fenerbahce is keen to take Southampton misfit Mislav Orsic. "
    ]
}