{
    "articleURL": "/wires/ap/article-12044921/Russia-unlikely-face-criticism-Central-Asian-meeting.html",
    "content": [
        "PANAJI, India (AP) - Russia is unlikely to face backlash over its war in Ukraine at an upcoming meeting of Central Asian foreign ministers and instead could flex its influence with the regional group.",
        "The meeting of the Shanghai Cooperation Organization ministers Friday in India´s picturesque state of Goa is the latest avenue for the host nation to burnish its geopolitical credentials as it seeks to cement itself as a consequential global player.It won´t have to contend with an East-West split over the war in Europe, which caused frustration for New Delhi as the chair for this year's meetings of the Group of 20 leading economies. But India will be looking to secure its own interests in the region, especially as Russia relies more deeply on India's rival China as Moscow´s invasion drags on, analysts say.India will also be hosting archrival Pakistan´s foreign minister in the first visit from a high-ranking official in nearly a decade.\"Russia needs friends. And in the SCO, it finds no enemies and quite a few friends,\" said Michael Kugelman, director of the Wilson Center´s South Asia Institute. The country is at risk of becoming a global pariah, beset by Western sanctions as it confronts resistance in other multilateral forums, he added.Russia and China founded the SCO in 2001 as a counterweight to U.S. alliances across East Asia to the Indian Ocean. The group includes the four Central Asian nations of Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan, where Russia enjoys economic and political sway. In 2017, India and Pakistan became new members and Iran is set to join this year.",
        "\"Moscow would have a strong interest in ensuring that it continues to play a big enough role in the SCO so it doesn´t risk losing ground in one of the few regional groupings where it can comfortably engage with other member states,\" Kugelman said.The SCO countries have either voted to abstain or not vote at all in past U.N. resolutions condemning Russia. Both India and China have offered to contribute towards peace efforts in Ukraine, but have stopped short of directly accusing Moscow.For New Delhi, the meeting comes as relations between Beijing and Moscow take on greater significance. China is the closest thing Russian President Vladimir Putin´s government has to a major ally as Beijing ramps up purchases of Russian oil and helps offset Western sanctions.Beijing gaining more leverage over Moscow could irk New Delhi in the long run. India enjoys strong ties with Russia but is embroiled in a long-running border standoff with China, which the country sees as one of its biggest security concerns.\"If you´re India, this is a problem because it thought it had Russia as a stronger power to help manage its China challenge,\" said Derek Grossman, an analyst focused on the Indo-Pacific at the RAND Corporation.India´s relationship with its Cold War ally hasn´t been affected yet - it´s seeking to deepen trade with Moscow, from whom it has continued to buy record amounts of crude. It also depends on Russia for 60% of its defense equipment.",
        "\"This is a longer term trend we have to keep an eye on,\" Grossman added.Observers say it´s highly unlikely India will bring this up at the meeting itself, since the SCO doesn´t discuss bilateral issues between member countries, but Jaishankar could raise it with his Russian counterpart Sergey Lavrov on the sidelines.Another anticipated and possible meeting is between Jaishankar and the Chinese Foreign Minister Qin Gang, after a meeting last week between their defense ministers underscored just how differently the two countries view the tense situation along their disputed border. While India accused its neighbor of eroding ties by violating bilateral agreements, China said the border conditions were \"stable overall.\"Meanwhile, chance of talks between Jaishankar and Pakistan´s top diplomat Bilawal Bhutto Zardari appear slim, said C Rajamohan, a foreign policy expert at the Asia Society Policy Institute.Still, the news has fanned speculation of a possible thaw in strained relations between the two nuclear-armed Asian rivals, who have a history of bitter relations, mainly over Kashmir, a disputed Himalayan region which is split between them but claimed by both in its entirety. India and Pakistan have fought two wars over Kashmir since gaining independence from British colonial rule in 1947.Analysts say the SCO remains important for access to Central Asia, which Moscow considers its backyard and is uneasy about competition from China. India and Pakistan are also vying for more influence in the region.",
        "Interest in SCO membership has grown in recent years, from Saudi Arabia to Myanmar, but analysts caution the group is at risk of being overshadowed by competing interests within its own members. \"It could lose its coherence over all these internal conflicts, which it hasn´t been able to handle,\" Rajamohan said.\"When you have a number of countries that don´t get along, it can be challenging to get substantive outcomes or progress,\" added Kugelman.Instead, the group's value could come from simply being an alternative to the West's security groupings. \"One could argue if that's the broader goal, then the outcomes don't matter as much. It's all about continuing to exist and showing solidarity - and that may be enough,\" he said.___See more of AP's Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}