{
    "articleURL": "/wires/pa/article-12043133/Royal-supporters-make-sacrifices-bag-prime-spots-procession.html",
    "content": [
        "Royal enthusiasts often go to great lengths and travel long distances to make sure they get the best view of major ceremonial events at Buckingham Palace.",
        "But not many will have made a decision like 34-year-old Bartley Graham, who arrived at The Mall on Wednesday after discharging himself from hospital.He has joined dozens of people gathered in front of the Palace ahead of the King’s coronation, with tents set up to enable them to get a prime spot.",
        "Mr Graham, from County Durham, said: “I should have been here earlier, but the hospital scenario made it impossible.“I self-discharged this morning purely so I could be here.“It’s important I’m here to get a good view of the procession, as I did for the Jubilee.",
        "“I came out for Prince Phillip’s funeral even though there was a risk I might be fined at the time.“I queued for 30 hours at Balmoral to see the Queen’s coffin a first time, and I queued 30 hours a second time at the Houses of Parliament.",
        "“Then I passed out and had a stroke, and all I could blame was exhaustion.“If it happens again, I’m in the right place, London’s hospitals are the best in the country.“I love being out here.”Mr Graham came wearing a suit printed with Union Jacks and carrying a cardboard cut-out of Charles, who he thinks will be “a fantastic King”.“I like King Charles, and I definitely like Lady Camilla,” he said.",
        "“Charles will be a fantastic King and will do a great job, he has some really strong values, and I think Lady Camilla has fallen into the role very well.”Kerry Evans, 58, from Gainsborough, Lincolnshire, who also arrived at The Mall on Thursday said she “would rather die” than miss the King’s Coronation.“I can’t camp out like I used to, I’ve got a heart condition and small vessel disease,” she said.“Every time I come out to an event like this I end up in casualty, because I just exhaust myself, but I’ve really paced myself this time.“Nothing would stop me, I would rather die supporting the Royal Family than not be part of all this,” she continued.“I’ll probably suffer for three or four months after an event like this.”",
        "Ms Evans, who is a writer and a full-time carer, says that she hopes the King will be a champion for diversity.“The King is being very quiet at the minute, I think he’s waiting to see what people want,” she said.“I hope he’ll be a strong King in terms of change and diversity, race, disability.”Other fans of the Royal Family have travelled from further afield to see the coronation.Carol Bush, 62, who comes from California but now lives in London, and Ardis Ryburg, 61, from Arkansas, came out to The Mall together “to support” the late Queen.",
        "“We loved her, and she wanted her boy to do this, so we want to support her,” Ms Bush said.“The Queen just gave and gave and gave, and really took her job as a monarch seriously.“We’re going to come back in 20 years for her grandson, we’ll be old in our wheelchairs and we’ll be here for William,” she continued.“I can’t wait for the carriage, I want to see the golden carriage come back out again.”",
        "Celebrations for the King’s coronation will take place over the course of this weekend.The ceremony itself will take place in Westminster Abbey on Saturday, with the Coronation Big Lunch and Coronation Concert happening on Sunday.Members of the public have been encouraged to take part in The Big Help Out on Bank Holiday Monday by volunteering for organisations in their local areas."
    ]
}