{
    "articleURL": "/news/article-12046525/EasyJet-plane-flying-300mph-missed-drone-just-16ft-near-miss-Sussex.html",
    "content": [
        "The close call happened at 5,000ft after the Airbus A320 took off from GatwickIt is believed that the 'drone' may have been flown illegally by a rogue operator An easyJet plane flying at more than 300mph missed a suspected drone by as little as 16ft over the Sussex countryside, an official report has revealed.",
        "The incredibly close call happened at a height of 5,000ft just three minutes after the Airbus A320 had taken off from Gatwick on a flight to Basel, Switzerland.A report by the UK Airprox Board, the official body for assessing near misses, revealed that the pilots initially thought the object was a bird before concluding it was a drone being flown illegally.The pilots immediately informed air traffic controllers who put out a warning to other planes departing from Gatwick.It is believed that the drone may have been flown by a rogue operator wanting to get dramatic video footage of an airliner flying past.",
        "There could have been catastrophic consequences if the device had gone into one of the jet’s engines or smashed the cockpit screen.Drones are normally limited to flying at up to 400ft, meaning that the suspected drone was potentially at more than 12 times the maximum legal altitude.Investigators were unable to confirm that the object was a drone due to a lack of evidence other than the account of the two pilots.If a drone operator had been identified, they could have been convicted of endangering an aircraft and jailed for up to five years.The incident happened at 3.21pm on February 24 while the jet was climbing to its cruising height in an area just north of Uckfield, East Sussex.",
        "The UK Airprox Board recorded it as a Category A incident - the highest level, which involves a serious risk of collision.The report said: ‘The A320 pilot reports climbing through 5,000ft when the First Officer (PF) exclaimed that there was a bird ahead.‘They looked and caught sight of a dark-coloured object that passed very quickly down the left side, within 5-10m of the left wing.",
        "‘It did not look like a bird but like a fairly compact “package” that glinted in the sun. It was hard to tell but looked stationary as they flew past, i.e. no relative motion.‘They both concluded that it was possibly a drone as it seemed to move up and then manoeuvred to the left out of the way. They reported it immediately.’The air traffic controller at Gatwick confirmed to investigators that the pilots had made an immediate report of a near miss with a drone.The controller said that the pilot described it as ‘silver in colour and definitely not a bird’. They added: ‘Details were passed to Gatwick Tower to warn following departures.’National Air Traffic Services (NATS) confirmed that the pilot ‘reported that they had just passed what they believed to have been a drone’ shortly after leaving Gatwick.NATS added: ‘Details were passed to another aircraft in the vicinity and to Gatwick Tower, who alerted following departures.",
        "‘Analysis of the radar indicated that there were no associated primary or secondary contacts visible on radar at the approximate time of the event.’The UK Airprox Board concluded that ‘the pilot’s overall account of the incident portrayed a situation where providence had played a major part in the incident and/or a definite risk of collision had existed’.",
        "But it added: ‘In the Board’s opinion the reported altitude and/or description of the object were such that they were unable to determine the nature of the unknown object.’The incident follows a series of other reported near misses between drones and passenger aircraft in UK airspace.It is believed that most cases involve rogue operators flying their devices to illegal heights after bypassing the software that limits drones to a maximum altitude so they can get dramatic videos of aircraft flying by.Pilots have repeatedly warned of the danger of small drones smashing cockpit windows or damaging jet engines, especially during critical times when aircraft are coming in to land or have just taken off.An easyJet spokesperson said: ‘We are aware of the report and will always fully support any investigation.‘Safety is always easyJet’s highest priority and our flight crew acted in accordance with our standard operating procedures to ensure the safety of the flight was not compromised at any time.’",
        "A spokesperson for the UK Civil Aviation Authority said: 'Airprox incidents are assessed by the independent UK Airprox Board (UKAB). 'The Board does not investigate incidents and these published reports are intended to enhance civil and military aviation safety, and the UK Civil Aviation Authority supports and endorses this important contribution to flight safety. We do not add further commentary or analysis to individual airprox reports.'"
    ]
}