{
    "articleURL": "/travel/article-12047073/The-10-annoying-things-people-holiday-revealed-rude-airline-staff-No-1.html",
    "content": [
        "A survey asked people to rank experiences on an ‘annoyance scale’ out of 10Being rude to airline staff is deemed the most annoying thing that people doREAD MORE: Amazing facts about the Smithsonian Institution in Washington DCThe 10 most annoying things that people do on holiday have been revealed in a survey - and it's being rude to airline staff on a plane that's the No.1 irritation.",
        "The list was generated by those polled being asked to rank irksome holiday behaviours on an 'annoyance scale', with being rude to cabin crew receiving an ‘annoyance score’ of 9.1 out of 10.Following closely in second place is people leaving litter on the beach or around the pool at the holiday destination, scoring 8.9 out of 10.Ranking third, meanwhile, is being disrespectful to restaurant or hotel staff - it earned an annoyance score of 8.8 out of 10.The survey – conducted by Swansea-based budget cruise holiday retailer Cruise Nation - found that the general public tends to be more annoyed at people being drunk and rowdy on the plane (8.7/10, fourth) rather than people being drunk and rowdy at the destination (8/10, seventh).",
        "Fifth place goes to kids kicking your chair on the plane, which has earned an annoyance rating of 8.5 out of 10.Travel companions wanting to get to the airport 'too late’, meanwhile, ranks sixth (8.1 out of 10).Sliding into eighth place is hogging hotel loungers in the morning with a towel – it has an annoyance rating of 7.8 out of 10.Playing loud music in the hotel or holiday accommodation is ninth (7.6 out of 10).And tenth place? That goes to leaving rubbish behind on tables in eateries, which has a score of 7.5 out of 10.",
        "The survey, which polled more than 1,000 Britons, also found that holidaymakers aged 18 to 39 seem to be the least annoyed on holiday. Their annoyance scores averaged 5.9 out of 10. Respondents aged 75 and over are the most annoyed on average, with the scores they gave out averaging 6.9 out of 10.Elsewhere, the survey found that Britons from the North West and the South East are the 'most annoyed regions' while on holiday, with respondents from both regions giving out scores that averaged 6.5 out of 10.In general, holidaymakers are most annoyed while on the plane, with average annoyance scores of 6.7 out of 10, compared to an average of 6.1 while at the airport and six at the destination.Cruise Nation notes that this is 'perhaps because people are more chilled out once they eventually reach their holiday destination and switch off into relaxation mode'. "
    ]
}