{
    "articleURL": "/sport/racing/article-12058325/Horse-racing-community-rallies-jockey-Dean-Hollands-funeral-Flemington-Racecourse.html",
    "content": [
        "Holland was farewell on Monday Family and friends paid tribute Lauded as 'humble and magnetic'Hundreds of mourners flocked to Flemington Racecourse to mourn top jockey Dean Holland at an emotion-charged service that highlighted just how loved and respected he was in the tight-knit racing fraternity.",
        "The 34-year-old died after a sickening fall in country Victoria on April 24, leaving behind wife Lucy and four children under five: Harley, Luca, Frankie and Lily.It threw the entire racing world into mourning, with the two-time Group 1 winner at the peak of his powers, and ready to reap the rewards of years of toil that began as a 15-year-old in his native South Australia. Tears were flowing at the service, but there was also plenty of muted laughter for the cheeky man; and the funeral was fittingly held at the same track he nabbed the best win of his career just weeks before his death: the Newmarket Handicap. Racing icon Bryan Martin OAM hosted the service, with Holland's uncle Scott, sister Kirstie Arnel, mentor and ex-jockey James Winks and family representatives for both Holland and wife Lucy's parents, reading touching tributes to a man taken far too soon. ",
        "Riding 1080 winners in a glorious career as a incredibly lightweight jockey, Martin, one of the sport's biggest names Down Under, lauded Holland's stunning Group 1 win to set the service off on both a tragic and inspiring note.'Going up there (Donald, country Victoria) for four rides, and being with his mates, his jockeys, trainers and horses at 34 years of age, he went to work and never returned home,' he said to open the service, which was streamed live on Racing.com.",
        "'It’s fitting we come here to this famous racecourse at Flemington today. Here on March 11, Dean celebrated his greatest victory as a jockey. 'He gained the ride in extraordinary circumstances after his fellow rider, Jamie Kah, crashed heavily earlier in the day.With only one hour’s notice he was aboard In Secret for one of the world’s biggest owners, Godolphin, and he produced a masterclass ride and won.'(But) In superb sportsmanship, he deflected praise for the ride to Jamie, who at that stage was lying unconscious in hospital. 'His demeanour won our hearts at the races that day, as he has done so often: Cheerful, humble, magnetic.'But it was when Des O'Keeffe, chairman of the Australian Jockeys Association, spoke on behalf of Holland's parents Belinda and Darren (himself a former jockey), that the emotions really began to spill over.",
        "The pair thanked their daughter-in-law for making Holland 'the happiest he has ever been', in a touching tribute. 'Everything changed when he (Holland) met the love of his life, Lucy. He was 28 and it was like he grew up overnight,' they said of his beloved wife, Lucy. 'He met Lucy when she was travelling in Australia, and when she went back to the UK, he quickly took a break from riding and chased her all the way over there and somehow got her to agree to settle with him in Melbourne.",
        "'With Lucy, we saw Dean in his happiest place, and Lucy, we love you so much and thank you for making our boy the happiest he has ever been ... Proud and happy, he was thriving being dad.'With the heartbreaking tributes that were enough to turn even the hardest to tears came the anecdotes that described how special the cheeky jokester was.  'It won’t come as a surprise that Dean weighed in at just 5 pounds, 11 ounces. Small and special, we were beside ourselves with happiness. His zest for live gave us so much joy in his early years,' O'Keeffe said, on behalf of Holland's parents about the day he came into the world. 'The ultra-competitive side of Dean first came to light at five years old when he was a member of his local karate club. 'After showing great early promise, his future as a potential martial arts gold medallists came to a sudden halt after we got a call from a concerned Sturt Public School, who said he was using his powerful karate moves on all the kids in his prep class, starting with the biggest kids down.'The parents, both prominent members of the racing industry in South Australia, spoke of how proud they were when he emphatically declared he wanted to be a jockey aged 14, despite 'barely patting a horse in his life, let alone riding one'. ",
        "They then described a somewhat surprising career change for the pocket rocket.'Dean also had a love for extreme sports … early in 2017, he somehow ended up a charity rodeo in Whittlesea and decided it was a great idea to enter the bull-riding contest,' O'Keeffe said on their behalf. 'The bull was at least 700kg and it must have had a very bad day prior to meeting Dean, because he made it very clear he was none too happy about a 46kg Dean with all his riding gear on bouncing around like a fly on its back. 'He (Holland) didn’t last long, and that was the start and end of his rodeo career.' Holland's uncle Shane choked back tears as he described Lucy 'changing Dean's life for the better', while sister Kirstie Arnel explained how the relationship she had with her brother was a thorn in the side of their father. 'As kids I remember fighting like cats and dogs, and then Dad would lose his s**t. Then we’d be best buddies upstairs in our room chatting about how Dad was such a meanie,' she joked.'You were the typical jockey; work hard, play even harder … I remember multiple Christmas Days where you would sleep the whole day on my couch because you were too hungover to deal with any of us.'",
        "Holland's mentor and coach, ex-jockey James Winks, cut an emotional figure, describing how one of his best mates became one of the best jockeys in the country.'He (Holland) was naturally gifted, and rarely made a mistake. His assets were, he never doubted his ability and he was always willing to learn and apply his trade. 'He was five foot nothing, 45kg wringing wet – but strong as an ox.'I genuinely believe he stamped his authority that day (after winning the Group 1 Newmarket), showing the racing world what he was capable of.'Winks also described how his mate was chasing his dream of riding in Hong Kong just two hours before his tragic death, reminding everyone in the room of what a bright light the industry has lost. ",
        "But it was when Lucy's parents, Keith and Jane Clampin, told the story of the time he proposed, that sent the crowd into fits of laughter - followed by the heartbreak of knowing he was no longer here to enjoy the story.Keith admitted 'it required much alcoholic ingestion to calm down after the event'. The event being one of the most special moments of his life: proposing to Lucy.'Dean came over to the UK … and during the visit he asked if he could have a word in private. He was very nervous, I noticed, unusual for him – but he ploughed on,' Racing Victoria’s Jockeys Assistance Program consultant Lisa Stevens said on behalf of Keith. ",
        "'He asked if he could have Lucy’s hand in marriage. I was overjoyed, but having trouble stopping myself from laughing that this cheeky chappy thought to even ask me, and we sealed it with a glass of malt whiskey. 'Dean explained that he wanted to propose at Tower Bridge in London … and when it was in a good position in the background I was supposed to get my phone out and that was the signal for him to get down on his knee, while I would take pictures for evidence. 'Unfortunately, while still 200m away from the ideal spot, I thought: “This is a nice spot to take a picture of Tower Bridge!”. 'Dean, seeing my move, went down on one knee and in a flash asked Lucy to marry him. This was outside a not very attractive café, and hardly the backdrop we had planned. 'But Lucy’s face was a picture. There was Dean on his knee asking her to marry him, and there was her Dad shouting: \"No Dean, not there!\". 'To the man, who my wife and I love deeply, vale, Deano.'The fundraiser for Holland's family continues, and has now raised more than $1.8million for his wife Lucy and their four young children. You can donate here.",
        "Dean Holland, 34, began his career in his native South Australia as a 14-year-old, born into a prominent racing family in the state, thanks to mother Belinda (CEO at Penola Race Club) and father Darren (a former jockey himself). His first race was in December 2005, nabbing his first winner in Ceduna just a month later.Riding across country and metropolitan tracks all across South Australia, before later moving to Victoria, Holland racked up an incredible 1080 winners, totally $32.4million in prizemoney for connections.An extremely lightweight rider, Holland won his first Group 1 race in Adelaide in 2010, taking out the Australasian Oaks with the John Thompson-trained Small Minds. He nabbed feature wins in his home race - the Adelaide Cup - in 2015 and 2019, aboard Tanby and Surprise Baby respectively, as well as the 2015 Mornington Cup (Banco Mo), 2021 Geelong Cup (Tralee Rose) and 2022 Wodonga Cup (Night Passage). The well-travelled jockey also won a number of country cups.",
        "Prior to his tragic passing, Holland was in brilliant form, riding 82 winners for the season, and was in the process of securing a dream gig in Hong Kong.Undoubtedly though, his career highlight came just weeks before his untimely death, when he secured his second Group 1 win in the Newmarket Handicap aboard In Secret.In a tragic twist of fate, that win only came because superstar rider Jamie Kah was in hospital with a very serious brain injury incurred earlier in the day after a shocking fall. As the only lightweight rider similar to Kah, Holland picked up the ride and promptly piloted it to a memorable victory at Flemington, in one of the most popular Group 1 wins in recent memory.As a sign of the man he was, his first thoughts were not for his drought-breaking win, but for his colleagues in hospital. 'The last thing I want to do is yahoo too much about me winning the race when Jamie should’ve been on to start with, but look: it is an emotional win for myself,' he said on Channel 7 at the time.Vale, Dean Holland. A life and career well lived. "
    ]
}