{
    "articleURL": "/sport/football/article-12046111/Which-records-Erling-Haaland-break-season.html",
    "content": [
        "Erling Haaland swept aside Alan Shearer's single-season record on WednesdayThe Norwegian previously made history for his club and in Champions League Here, Mail Sport takes a look at the remaining records the striker will be chasingErling Haaland's formidable debut in the Premier League hit new heights on Wednesday after the Norwegian behemoth shattered Alan Shearer's 28-year record with his 35th goal of the season. ",
        "Finding the back of the net in Manchester City's 3-0 win against West Ham, the striker's team-mates lined up to give him a guard of honour at the Etihad against the backdrop of a standing ovation from supporters, all entirely aware they were seeing something exceptional. To say Haaland has a taste for rewriting the history books is no understatement: his bombastic first season in England has seen him break two records prior to his latest. The 22-year-old slipped five past luckless RB Leipzig goalkeeper Janis Blaswich in under an hour during the second-leg of the two sides' Champions League round-of-16 run-in that (of course) saw the Austrian side knocked out as City's treble chances began to blossom on a March evening at the Etihad. Haaland is the third person in history to achieve the feat – only Lionel Messi and Luiz Adriano have reached that total in Europe's most prestigious competition. ",
        "Earlier that evening, he became the club's highest goalscorer in a single season, breaking the 94-year record set by Tommy Johnson with his 39th goal of the season on Wednesday. But with eight matches left this season – and possibly nine if they reach the Champions League final – Mail Sport assesses which other records Haaland could still break in the 2022-23 campaign.   ",
        "Most Champions League goals in a single season (17) As City set their sights on chasing a historic treble – which Haaland freely admits he would trade his Premier League goal haul to attain – all eyes have turned to the competition's current single-season record.It was set by Cristiano Ronaldo during the 2013-14 campaign, where the Portuguese star scored 17 goals during their successful European run.He scored a penalty during the final against rivals Atletico Madrid, where Los Blancos eventually won the match 4-1 after extra-time. Haaland currently has 12 in the competition and stands a chance at levelling – or even breaking – Ronaldo's record.But Haaland's hopes depend on getting a number past their opponents in the semi-final. Should the Premier League outfit progress, the Norway international will have just three matches to find the back of the net five times.  ",
        "Most hat-tricks in a Premier League season (5)The Norwegian already has four Premier League hat-tricks to his name since completing his £51million move to the Etihad in the summer.He's managed to bag three goals in outings against Crystal Palace, Nottingham Forest, Manchester United and Wolves this season, putting him well within touching distance of the single-season record.This is another set by Alan Shearer, in the 1995-96 campaign where the English talisman scored five hat-tricks.",
        "Tottenham's Harry Kane has come the closest to matching Shearer's tally, after his blistering campaign in 2016-17, where he scored four hat-tricks, before Haaland's impressive season this year.The Man City star needs one more hat-trick to level Shearer's record and with games against Southampton, Leeds and Everton still to come, Haaland may well overtake the Newcastle legend.Most goals in an English club's top-flight season (63)He couldn't... could he?  The current record for the most goals in a single-season across all competitions in the English top-flight stands at 63 goals and is held by Everton legend Dixie Dean.Dean wrote his name into football history after reaching the staggering tally in the 1927-28 season.In order to match the incredible record, Haaland would have to score 12 goals in the eight or nine matches for City.",
        "The record looked nigh-on impossible to break in March, but now? Almost nothing should be ruled out. And one he can't...Dean's mammoth achievement had an interesting quirk: only three of the goals scored by the Everton forward came in the FA Cup, and outside the English First DivisionThat makes the player's league record a whopping 60 goals in only 39 games. Haaland is some way off from breaking that – but there's no harm in setting a target for next season. "
    ]
}