{
    "articleURL": "/tvshowbiz/article-12039593/Colin-Fassnidge-Manu-Feildel-break-filming-drink-honour-Jock-Zonfrillo.html",
    "content": [
        "For confidential support call the Lifeline 24-hour crisis support on 13 11 14 Celebrity chefs Colin Fassnidge and Manu Feildel have both said that they're struggling to come to terms with the death of their late friend, Jock Zonfrillo.",
        "And during a break from filming the upcoming season of their show My Kitchen Rules this week, the pair enjoyed a shot of whiskey in honour of MasterChef judge Jock, who died this week at the age of 46. Colin, 48, shared a black and white shot of himself and Manu, 50, sipping from a flask on Instagram on Tuesday, alongside a tribute to Jock and his MasterChef co-stars. 'Late night filming having a whiskey for our late but forever friend. Love from our My Kitchen Rules team to our MasterChef team,' Colin captioned his post, alongside a heartbroken emoji. Fassnidge had been friends with Zonfrillo for 20 years. He told Daily Mail Australia earlier this week that he and the 'entire community' is struggling to process the tragic news. ",
        "A Victoria Police spokesperson told Daily Mail Australia they found Zonfrillo's body at about 2am on Monday after they were called to a hotel on Lygon Street in Carlton for a welfare check.No cause of death has been disclosed, but police say his death is not being treated as suspicious. 'It's so shocking. I'm sitting on a rock right now trying to take it in, I don't know what to say. I'm floored,' Colin said. ",
        "'I've had to call my wife straight away when I heard.'",
        "Fassnidge said there was no indication anything was wrong for Zonfrillo, and the news was a complete surprise.The pair would speak to each other regularly, but their last in-depth conversation was six months ago.'He was flying, he was doing a great job, he had a great show, he was on top of the world,' Colin explained.'Jock was normal, he was healthy and he was living a good life.'I just feel so sorry for his other half.'",
        "Manu previously told 7News he was devastated for the Scottish-born chef's wife and children.'I just turned fifty and I'm still feeling young so I'm telling you, forty-six... it's far too young to go,' Feildel said.'I feel really sorry for his wife and his kids... I've got kids myself and I'm finding it hard to find my words right now.",
        "'He's had a really successful career and suddenly it's all stopped. You just wonder how and why.'Jock's family announced his shock death in a statement released on social media on Monday.A report will be prepared for the coroner after Zonfrillo's body was found at about 2am on Monday.'With completely shattered hearts and without knowing how we can possibly move through life without him, we are devastated to share that Jock passed away yesterday,' his family said in a statement on Monday.",
        "'So many words can describe him, so many stories can be told, but at this time we're too overwhelmed to put them into words.'For those who crossed his path, became his mate, or were lucky enough to be his family, keep this proud Scot in your hearts when you have your next whisky.'They continued: 'We implore you to please let us grieve privately as we find a way to navigate through this, and find space on the other side to celebrate our irreplaceable husband, father, brother, son and friend.'The Scottish-Australian chef and restaurateur became a host of the popular Channel 10 cooking show in 2019 alongside Andy Allen and Melissa Leong.",
        "Zonfrillo is survived by his third wife, Lauren Fried, and his four children: Ava and Sophia, from his first two marriages, and Alfie and Isla, with Fried.The hotel where he died is metres away from his former inner-city home in Carlton.He and his family had moved out of the four-bedroom townhouse to start a new life in Rome three weeks earlier.Their old home went back on the rental market in April for $3,000 a week.Before he died, Zonfrillo had come back to Australia to promote the fifteenth season of MasterChef, which was due to premiere at 7:30pm on Monday night but has since been postponed."
    ]
}