{
    "articleURL": "/wires/reuters/article-12042473/UniCredit-CEO-says-no-M-A-targets-make-sense-current-prices.html",
    "content": [
        "By Valentina Za",
        "MILAN, May 3 (Reuters) - UniCredit Chief Executive Andrea Orcel on Wednesday said buying back the banks' own shares was the best use of its money, with no merger and acquisition deal offering a valid alternative.A 40% rise in UniCredit's share price this year has fuelled speculation that Orcel, who built his career in investment banking first at Merrill Lynch and then UBS, could consider an acquisition.\"We see today a much greater value to be created by repurchasing our stock at these levels than doing any M&amp;amp;A,\" Orcel told a media call after the bank reported bumper quarterly earnings.With its roots in Italy's industrial heartland where it has twice the market share of UniCredit, Banco BPM is widely seen as the most obvious domestic target for Orcel, who in 2021 walked away from a proposed acquisition of state-owned Monte dei Paschi di Siena.Last month an Italian investor in both UniCredit and Banco BPM said that a merger would have \"strategic value\".Speculation about an eventual takeover has fuelled gains in Banco BPM's shares, with France's Credit Agricole seen as another potential buyer after it became the single biggest shareholder last year with a stake it recently raised to 9.9%.\"I do believe that a number of targets are powered by speculation and at those levels they just don't make any sense,\" Orcel said.",
        "\"If ... the value proposition were to change, we would consider differently. But for the time being, it is what it is.\"Banco BPM has a market capitalisation of around 5.5 billion euros ($6.1 billion), while the figure for UniCredit is some 36 billion euros.Orcel has repeatedly said he would consider M&amp;amp;A deals provided they made strategic sense and did not derail capital distribution plans while boosting value for shareholders.\"There are a number of opportunities we see across Europe ... but financially we still represent the best value proposition for our investors.\" ($1 = 0.9066 euros) (Reporting by Valentina Za Editing by Keith Weir)"
    ]
}