{
    "articleURL": "/sport/football/article-12041505/Javi-Gracia-DEFENDS-record-Leeds-manager-following-sacking-just-12-games-charge.html",
    "content": [
        "Javi Gracia's Leeds conceded 28 goals in just 11 games and won just three timesThe Whites suffered heavy defeats of four goals or more on three occasionsFollow Mail Sport's LIVE blog for all the latest as Sam Allardyce is appointeed Javi Gracia has released a statement following his dismissal as Leeds interim boss defending his record in charge of the club. ",
        "The Whites confirmed the appointment of Sam Allardyce as their new manager until the end of the season just three days after Leeds' disappointing 4-1 defeat to relegation rivals Bournemouth. The ex-England boss inherits a side sitting just above the relegation zone, ahead of Nottingham Forest on goal difference, heading into the last four games. Yet Gracia insists that his spell in charge of the club was a success in that he gave Leeds a 'good chance' of achieving their objective of resisting the drop. He wrote in his first statement since being sacked: 'The coaching staff and I took over the team in 19th position, with a run of 10 games without a win.",
        "'Today after 11 games (in the Premier League) played and four left in the league, the team is out of the relegation zone and with a good chance of achieving the objective. 'It has been a very intense period for many reasons. A busy schedule, injuries, and a young but skilled team. 'However, we managed to position ourselves better than our rivals and this is shown by the results. Compared with our direct rivals since we were hired, we are the team with the most points - 11 in total - compared to our main competitors.'",
        "Gracia managed positive results against the likes of Southampton, Wolves and Forest - as well as a creditable draw against high-flying Brighton. However, it was his side's defensive record that ultimately contributed to his demise, with the Whites conceding 28 goals in his 11 league games and keeping just one clean sheet. Additionally, as the club headed for a decisive run-in that would decide their fate as a Premier League team, he was without a win since beating Forest 2-1 in early April - a winless run of five in which the club conceded four or more three times.As a result, Leeds made the decision to axe Gracia in favour of survival specialist Allardyce.'Big Sam's' four games to save the club see them take on three of the league's top six, with a trip to Manchester City next up, followed by the visit of Newcastle and a clash with Tottenham on the final day. ",
        "They must also successfully negotiate a tie with relegation rivals West Ham in their penultimate fixture, with the club up against it in the battle for survival. 'I know it's in a lot of trouble, but I've seen a lot of trouble before,' Allardyce said after his appointment. 'I could've done with more time, but we've got four games and hopefully I can keep this fabulous club in the Premier League.",
        "'I was shocked. I never thought at this stage of the season… I thought there would be no jobs.'The phone popped up with a name I knew fairly well, I knew what it was, and it took me two seconds to say yes.'"
    ]
}