{
    "articleURL": "/tvshowbiz/article-12057553/Charlize-Theron-Jesse-Eisenberg-appear-Drag-Isnt-Dangerous-telethon.html",
    "content": [
        "Charlize Theron and Jesse Eisenberg are among the celebs who will be taking place in the online telethon Drag Isn't Dangerous Sunday.",
        "The event, which is aimed at combatting legislation against the LGBTQ+ and drag communities, will be streamed at 7 p.m. ET/ 4 p.m. PT Sunday at dragisntdangerous.com for a $20 fee.The telethon will showcase live and pre-taped appearances from entertainers from Hollywood, and within the drag community.Notable names of drag stars scheduled for the event include Bob the Drag Queen, Divina De Campo, Jinkx Monsoon, Trixie Mattel, Peppermint and Eureka O’Hara.Among the celebrities scheduled to join Theron and Eisenberg include Elizabeth Banks, Margaret Cho, David Cross, Whitney Cummings, Billy Eichner, Marcia Gay Harden, Leslie Jones, Adam Lambert, Melissa McCarthy, Kelly Osbourne, Orville Peck, Amy Schumer, Sarah Silverman, Amber Tamblyn, and Ali Wong.",
        "Eisenberg said in a statement that 'the recent demonization of drag culture has been greatly upsetting and completely shocking to' him.The Oscar-nominated actor added, 'I have had the pleasure of getting to know many drag performers, including one of my idols, the incomparable Trixie Mattel, over the past several years.'Silverman said in a statement, 'The nerve of these disingenuous politicians is unfathomable. The number one killer of children is guns and these NRA pawns deflect it with a completely fabricated problem that puts the drag community in danger. The hypocrisy is astounding.' Jacob Slane, cofounder of the production company Producer Entertainment Group, which is putting on the event, said in a statement, 'We are sick of it.'",
        "Slane continued: 'These bans are not just about trans people or drag performers. It is a systematic subjugation of LGBTQ people.",
        "'Through the Drag Isn’t Dangerous campaign, we want to show that drag performers are not dangerous groomers, sexual deviants, criminals or whatever is the latest evangelical slur du jour.'Slane noted, 'We want to raise awareness and funds to make a difference in the lives of LGBTQ people who are under attack.' Peppermint and comedian Justin Martindale are slated to cohost the event. "
    ]
}