{
    "articleURL": "/news/article-12050403/Are-DIY-stores-open-Coronation-day-B-Q-Wickes-Homebase-opening-times-revealed.html",
    "content": [
        "Opening hours revealed for DIY stores over coronation weekend, Bank Holiday Shop opening hours across the UK are set to be affected by the Bank Holiday weekend, which is taking place to mark the coronation of King Charles III.",
        "Major DIY store brands including Wickes, Homebase and B&amp;Q are primed to operate with altered operating times on the upcoming Bank Holiday, which will fall on Monday, 8 May, 2023. The extra Bank Holiday has been called by the government to allow Brits to celebrate King Charles' coronation. Ahead of the next Bank Holiday, which comes just a week after May Day, here are the opening times for all major DIY and home improvement shops. ",
        "Is B&amp;Q open on Coronation day?DIY and home improvements store B&amp;Q will be open as normal and close at 8pm in stores across the UK.To check any change in timings, view your local B&amp;Q store's hours here.  Is Wickes open on Coronation day?On Saturday, 6 May, Wickes will operate between the hours of 7am and 7pm across the UK. Sunday, 7 May will see stores in England and Wales open at 10am and shut at 4pm. In Scotland, branches will be open to visit from 9am until 6pmWickes' shops will open from 7am to 8pm on the Bank Holiday Monday. Is Homebase open on Coronation day?In the UK, Homebase opening times may vary depending upon the size and location your nearest store. The brand will operate normal trading hours in Ireland. To check if your nearest Homebase branch is open, click here. Is Screwfix open on Coronation day?Screwfix stores will open between the hours of 7am and 6pm on Saturday, 8 May  across most stores in the UK.",
        "On Sunday, 7 May, branches will open at 9am and shut at 4pm in England, Wales and Scotland.Stores in Northern Ireland will open from 1pm to 6pm. To check the exact opening hours of your local Screwfix tool, you can use the brand's store locator tool. "
    ]
}