{
    "articleURL": "/sport/formulaone/article-12042595/F1-Miami-Grand-Prix-race-qualifying-start-times-TV-channel-watch.html",
    "content": [
        "Sergio Perez will be looking for his third win this season at the Miami Grand Prix The Red Bull driver won last weekend's race ahead of Max Verstappen Verstappen currently tops this season's drivers' standings with 93 pointsSergio Perez will be looking to pick up his second win in a row at the Miami Grand Prix this weekend.",
        "The Red Bull driver came out on top at the Azerbaijan Grand Prix last weekend, finishing above team-mate Max Verstappen and Ferrari's Charles Leclerc. Verstappen is currently top of the drivers' standings with 93 points, six points ahead of second place Perez.Aston Martin's Fernando Alonso currently sits third in the standings, 33 points behind Verstappen.Mail Sport breaks down everything you need to know ahead of the Miami Grand Prix including qualifying and race start times.",
        "When is the Miami Grand PrixThe Miami Grand Prix takes place this weekend, with the race on Sunday, May 7.There will be two practice sessions on Friday - with it taking place at 7pm in the UK. The second practice session will get underway at 10.30pm.On Saturday, there will be a third practice session, which is due to get underway at 5.30pm. Qualifying for the race will also take place on the same day and is due to start at 9pm.Full scheduleFriday, May 5First Practice Session - 7pm BST / 2pm ET / 1pm CTSecond Practice Session - 10.30pm BST / 5.30pm ET / 4.30pm CT Saturday, May 6Third Practice Session - 5.30pm BST / 12.30pm ET / 11.30am CTQualifying - 9pm BST / 4pm ET / 3pm CTSunday, May 7 Miami Grand Prix 2023 - 8.30pm BST / 3.30pm ET / 2.30pm CTHow to watchThe Miami Grand Prix is set to be shown live on Sky Sports F1 and Sky Sports Main Event - with coverage starting at 7pm on Sunday.Fans will also be able to stream the race on the official Sky Go app.Highlights of the action will be uploaded to the official Formula One YouTube channel after the race.",
        "Channel 4 will also be showing highlights of the Miami Grand Prix at 1.25am on Monday.Mail Sport will also be providing live coverage of the Miami Grand Prix, so you can keep up-to-date with all the latest developments here.",
        "What's been said?Speaking after his win in Azerbaijan, Perez was asked to give his thoughts on the battle with Verstappen in Baku.‘It really worked out today for us. I think it was very close between us, we pushed to the maximum today, we both clipped the wall a few times,' Perez told Sky Sports.‘It’s a track where you require a lot of confidence, a lot of corners, and you see that a lot of drivers clip walls during the race. It’s all about confidence, lap after lap and making sure you’re on top of your car.’",
        "Despite Verstappen being a big favourite to win the title this season, Perez is confident he can push his team-mate all the way. ‘Having three kids at home I wouldn’t be travelling around the world if I didn’t believe I could be a world champion. I’m working towards that, there’s so much you can talk about outside the car, it’s important to deliver on the track.‘I think with all the issues we had in qualifying in Melbourne we should be leading the championship, definitely there is everything to believe we can do well this year.’"
    ]
}