{
    "articleURL": "/wires/reuters/article-12059769/Gold-claws-softer-dollar-US-inflation-data-radar.html",
    "content": [
        "U.S. banks report tighter lending standards - Fed survey",
        "U.S. CPI for April due on WednesdayPalladium up more than 4%(Updates prices)By Deep Kaushik VakilMay 8 (Reuters) - Gold edged higher on Monday, regaining some ground after a retreat in the previous session and ahead of inflation data this week that could provide clues on the outlook for U.S. interest rates.Spot gold rose 0.2% to $2,021.37 per ounce by 3:15 p.m. ET (1915 GMT). U.S. gold futures settled up 0.4% at $2,033.20.\"Markets are really just discounting the aftermath of last Friday's payrolls report,\" Daniel Ghali, commodity strategist at TD Securities, said, referring to a selloff that has left prices nearly 3% below near record levels reached last week before the data.It showed U.S. job growth accelerated in April, pointing to persistent labour market strength.Ghali added, however, the prospect of recession was likely to make markets price in future Fed rate cuts, which should lead \"discretionary traders to deploy their capital in gold\". Non-yielding gold has greater appeal to investors when interest rates fall and reduce competition from other assets.Markets saw an 85% chance of the Fed holding rates at their current level in June, and a 31% chance of a rate cut in July, according to CME's FedWatch tool.U.S. banks tightened credit standards over the first months of the year and saw weakness in loan demand from businesses and consumers, the Fed's senior loan officer opinion survey showed.",
        "Chicago Fed chief Austan Goolsbee said in an interview with Yahoo Finance that he was getting \"vibes\" a credit squeeze is beginning.\"If the woes among regional banks are thrust back into the spotlight, that could trigger another leg up for this safe-haven asset,\" said Han Tan, chief market analyst at Exinity.Along with the U.S. consumer price index (CPI) due on Wednesday, traders are also monitoring any developments surrounding the debt ceiling.Spot silver fell 0.4% to $25.54 per ounce, platinum rose 1.3% to $1,072.99, while palladium jumped 4.3% to $1,554.35. (Reporting by Deep Vakil and Arundhati Sarkar in Bengaluru; Editing by Christina Fincher, Barbara Lewis and Shounak Dasgupta)"
    ]
}