{
    "articleURL": "/wires/reuters/article-12048601/Soccer-Napoli-revive-memories-Maradona-Serie-A-title-win.html",
    "content": [
        "By Tommy Lund",
        "May 4 (Reuters) - Napoli clinched the Serie A title on Thursday with five games to spare as they ended a 33-year drought stretching back to when Diego Maradona led them to the Scudetto in 1990.At the start of the season it would have been difficult to envisage Napoli becoming champions ahead of heavyweights such as Juventus and the two Milan clubs not to mention AS Roma.During a close season of discontent, fans grumbled as key players like captain Lorenzo Insigne, Napoli's all-time top scorer Dries Mertens, Arkadiusz Milik, Fabian Ruiz and Kalidou Koulibaly all left for pastures new.But after an exceptional transfer window and with Luciano Spalletti at the helm, Napoli dominated the title race while their main rivals all suffered slumps during the season.They are currently 16 points clear of second-placed Lazio.In Spalletti, the Naples club have an Italian manager who discarded traditional tactics and allowed talented players to flourish after a quick rebuild in the close season.While Napoli's last two Serie A triumphs were focused around Maradona's greatness, this season's triumph can be attributed to a solid all-round squad guided by a shrewd manager.Kim Min-Jae arrived from Fenerbahce to replace Koulibaly as the lynchpin at the back while Andre Frank Zambo Anguissa's loan move from Fulham was made permanent as he completed a three-man midfield alongside Stanislav Lobotka and Piotr Zielinski.",
        "KVARADONA SUPREMEBut it was their 22-year-old Georgian winger from Dinamo Batumi who made heads turn in Europe.Khvicha Kvaratskhelia was a relatively unknown quantity when he arrived in Italy but he has scored 12 goals and provided 10 assists in 28 Serie A appearances to guide Napoli to the title while earning the nickname 'Kvaradona'.With his vision and playmaking abilities, he formed a deadly duo with Nigerian striker Victor Osimhen who flourished this season to lead Serie A with 22 goals, becoming one of the hottest prospects in the transfer market.Napoli thrilled fans with an exhilarating style of football as they topped the scoring charts, with Spalletti saying the key to unlocking their potential was not sticking to standard tactical systems.\"Systems no longer exist in football. It's all about the opposition's spaces,\" he said. \"You must be quick to spot them, know the right moment to strike and have the courage to start the move even when pressed.\"CONTENDERS FALTERAs Napoli surged ahead, suffering just one loss by the end of February, the other title contenders withered away as injuries plagued their squads.Romelu Lukaku's hamstring issues saw Inter struggle at the start of the season and they never recovered despite their run to the Champions League semi-finals where they face Milan.",
        "Juventus, on the other hand, were without midfielder Paul Pogba, with the Frenchman yet to start a game and playing only 42 minutes since his return from knee surgery which kept him out of the World Cup.Juve's 15-points deduction, which hung over them for much of 2023 before the punishment was suspended, also made it difficult for their manager Massimiliano Allegri to decide which competition to prioritise.Milan also tried to keep pace with Napoli but Stefano Pioli's side went five straight games without a win in January, allowing Napoli to build a substantial lead while putting the defending champions out of contention by the spring.Lazio capitalised on their rivals travails and they are on course for one of their best seasons in years having beaten all of the top six clubs this term.But Maurizio Sarri's side could only watch as Napoli became the fourth different team to win Serie A in as many years. (Reporting by Tommy Lund in Gdansk; Editing by Ken Ferris)"
    ]
}