{
    "articleURL": "/wires/ap/article-12045143/Golden-Knights-overcome-Draisaitls-4-goals-beat-Oilers-6-4.html",
    "content": [
        "LAS VEGAS (AP) - Ivan Barbashev scored two goals, including one that put Vegas ahead for good, and the Golden Knights overcame Leon Draisaitl´s four goals to beat the Edmonton Oilers 6-4 in Game 1 of the second-round series on Wednesday night.",
        "It was the second night in a row a team had won despite allowing an opposing player to score four goals. Seattle beat Dallas 5-4 on Tuesday even with Joe Pavelski scoring four goals for the Stars. Teams with a player scoring four goals had been 36-3 before that game in the playoffs, and it had been 30 years since a team had overcome such a performance.The Knights also received goals from Chandler Stephenson, Michael Amadio, Mark Stone and Jack Eichel. Eichel´s goal was an empty netter from deep in his zone, and he and Stone also each had an assist. Zach Whitecloud had two assists.Evan Bouchard, Mattias Ekholm, Zach Lyman and Connor McDavid each had two assists for the Oilers.Game 2 is Saturday in Las Vegas.HURRICANES 5, DEVILS 1",
        "RALEIGH, N.C. (AP) - Carolina got goals from Brett Pesce and Seth Jarvis alongside a suffocating defensive performance in the opening period to jump quickly on New Jersey in the opener of their second-round playoff series.Jesperi Kotkaniemi, Brady Skeji and Jesper Fast also scored for the Hurricanes, who used a swarming effort to take control that took the Devils completely out of any type of first-period flow. New Jersey managed a single shot on goal for the period compared to both Pesce and Jarvis finding the net, then Kotkaniemi followed early in the second for a 3-0 lead that chased Devils rookie goalie Akira Schmid to the bench.",
        "The Hurricanes went back to Frederik Andersen in net over Antti Raanta after Andersen got his first start of the playoffs in the Game 6 clincher against the New York Islanders. He finished with 18 saves.Nathan Bastian scored for the Devils, who played this one without trade-acquisition Timo Meier following his huge hit from New York Rangers forward Jacob Trouba during Monday´s Game 7 win.Schmid was pulled after surrendering three goals on 11 shots. Vitek Vanecek had 10 saves on 11 shots in relief.Game 2 is Friday night in Raleigh.___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}