{
    "articleURL": "/wires/afp/article-12050349/Fleeing-Sudanese-rely-strangers-generosity-survive.html",
    "content": [
        "Hungry, terrified Sudanese families fleeing deadly urban warfare rely only on the generosity of strangers who line the stretch of road between the capital Khartoum and Sudan's southern borders.",
        "In three weeks of fighting between rival generals that has plunged the impoverished country into turmoil, thousands have rushed to escape, often only having had the time to grab their most basic essentials.On the long and arduous journey out of the war-scarred country, scores may have starved were it not for the generosity of strangers volunteering to hand out food and drink despite the perilous conditions.\"The food is ready, come out, you won't be delayed,\" Abubakr Hussein shouts from the side of the road that leads from Khartoum to his small village in Jazira state 130 kilometres (80 miles) south.In a country that prides itself on its generosity, this scene is repeated at almost each of the villages that punctuate the roads leading out of Sudan.",
        "The rivalry between army chief Abdel Fattah al-Burhan and his former deputy Mohamed Hamdan Daglo, commander of the paramilitary Rapid Support Forces (RSF), erupted into armed conflict on April 15, during the Muslim fasting month of Ramadan.The battles in the capital and other regions have killed hundreds and displaced hundreds of thousands.- 'Unprepared' -Across the country there are reports of rampant looting.\"At least some of the looting... is driven by the fact soldiers need to eat,\" said Aly Verjee, a researcher at the University of Gothenburg.",
        "\"There are lots of reports of people finding the RSF in their houses having dinner,\" he told AFP.",
        "\"The RSF forces, whether implicitly or explicitly, have been told to fend for themselves, feed themselves and organise themselves.\"Even before the war began, Jazira residents had already been mobilised to hand out food to travellers -- a common practice during Ramadan that Muslims believe will help earn them a place in heaven.But as the fighting drags on and food supplies dwindle in Khartoum, which has borne the brunt of much of the fighting, the volunteers continue to line the roads well beyond the holy month.\"People left unprepared,\" Hussein told AFP. \"We began providing them with water then people joined, bringing food from their homes.\"\"As the situation continued, we began collecting donations from village residents and making the food ourselves,\" he said.The Norwegian Refugee Council has meanwhile reported the doubling of food prices in Jazira.- 'In every village' -The turmoil is likely to exacerbate the humanitarian crisis in a country where 15 million people -- a third of the population -- were already in need of aid to stave off famine even before the conflict, according to the United Nations.",
        "Nearly 450,000 civilians have fled their homes, the International Organization for Migration said, including more than 115,000 who have sought refuge in neighbouring countries.",
        "People across Sudan have come together to offer life-saving nourishment to those fleeing the worst of the war.Mohammed Issa, who has shuttled people on buses across the country during the conflict, has witnessed this first hand across countless villages.\"I have seen this scene everywhere,\" from White Nile in the south to the Red Sea in the east all the way to Northern state, he said.Mirghani Hassan, who with his family fled Khartoum to the city of Atbara 350 kilometres north, expressed gratitude for the help they had received.\"In every village, they insisted that we stop to eat and drink, even if the distance between one village and the next was no more than a kilometre,\" he said."
    ]
}