{
    "articleURL": "/wires/aap/article-12040443/New-electric-car-races-Australia-en-route.html",
    "content": [
        "After months of tyre-kicking, poring over car reviews, memorising charging spots and waiting, Sydney driver Sue Hogan has finally hopped behind the wheel of her own electric vehicle.",
        "The businesswoman became one of the first Australians to take delivery of a Cupra Born electric hatchback on Wednesday, collecting the vehicle after pre-orders almost sold out early this year.The battery-powered car is one of 19 electric cars launching in Australia between now and the end of 2023 in what could be a record-breaking period for the next-generation transport.And industry experts say more automakers could accelerate plans to bring the latest electric vehicles to the country if the government sets an ambitious fuel-efficiency standard.Ms Hogan, from Sydney's lower north shore, said she pre-ordered her Cupra vehicle shortly after its December launch after thoroughly researching small electric cars on the market.\"I decided if I was going to get a new car I was definitely going to go electric,\" she said.\"I might as well do do my bit for the environment and look after the next generation as much as I can.\"She chose the first electric vehicle from Volkswagen's Spanish subsidiary for its 511 kilometre range, \"progressive, zippy and fun\" appeal, and because it qualified for the federal government's fringe benefits tax exemption.\"The tax rebates made a massive difference,\" she said.\"It became a bit of a no-brainer, really.\"Cupra Australia director Ben Wilks said demand for the vehicle had been high in Australia, leading the brand to allocate another 200 vehicles to the country after selling almost 400 within two months.",
        "\"As far as Cupra is concerned, we're moving with what our customers have asked us for, which is fully electrified cars,\" he said.\"We'll continue to bring those cars in and push hard to get those cars for Australia.\"Another 18 electric vehicle models are expected to launch in Australia during 2023, including the GWM Ora due later this month, the Fiat 500e in July, the MG4 in October, and the highly anticipated Ford Mustang Mach-E and Volkswagen ID.4 due in the last quarter of the year.Electric Vehicle Council chief executive Behyad Jafari said the new models were likely to find an eager audience but the country would need an ambitious, mandatory fuel-efficiency standard to secure greater supply from some car brands yet to launch models in Australia.\"What we're seeing quite regularly is when car companies release electric vehicles in Australia, they sell out almost right away,\" he said.\"How we get more here so the supply is closer in line with demand is through stronger targets.\"The federal government launched a six-week consultation for a fuel-efficiency standard with its National Electric Vehicle Strategy in April.A draft of the standard, which will set a pollution cap for vehicle fleets in Australia, is expected to be released before the end of the year."
    ]
}