{
    "articleURL": "/wires/reuters/article-12056937/Knicks-Heat-set-Game-4-throwback-series.html",
    "content": [
        "The New York Knicks and Miami Heat in the playoffs -- a shoving match, tight defense, poor offense ...",
        "What's this, the 1990s?It feels like it.The Miami Heat lead the New York Knicks 2-1 in their best-of-seven Eastern Conference semifinal series. Game 4 is set for Miami on Monday night.These two teams met in the playoffs for four straight years, from 1997-2000. Those games were tightly contested slugfests, and there was a little bit of that flavor in Game 3 on Saturday as Miami won 105-86.The Heat prevailed despite shooting just 38.9 percent from the floor and 21.9 percent on 3-pointers (7-for-32).\"To win by half a point, one point, 20 points ...\" Heat guard Kyle Lowry said. \"It's about winning the game, however it happens.\"To tie the series on Monday night, the Knicks likely will need to shoot much better than they did on Saturday, when they made just 34.1 percent, including 20.0 percent on 3-pointers (8-for-40).In addition, the Knicks who never led, were outscored in the paint 50-36 on Saturday. They were outrebounded 50-48.The Knicks on Monday will try to slow down forward Jimmy Butler, who has scored at least 25 points in nine straight playoff games.Butler missed Game 2 in this series due to a sprained right ankle. New York won 111-105. In the two games he has played, he is averaging 26.5 points, 7.5 rebounds and 3.5 assists.",
        "\"You can't put an analytic to it,\" Heat coach Erik Spoelstra said of Butler's presence. \"It's the confidence level your team has that you can always get the ball to him, and you will get something efficient.\"New York's Josh Hart has drawn the defensive assignment of guarding Butler. Hart has worked hard, but he hasn't been able to keep Butler out of the paint or off the foul line.In his two games, Butler has gotten to the foul line 22 times, making 19 free throws (86.4 percent). In addition, he has shot 45.9 percent on 2-pointers (17-of-37).Butler is also 0-for-3 on 3-point attempts, but nobody on the Heat is complaining.The Knicks may have another issue as Immanuel Quickley left Saturday's game due to a left ankle injury. Quickley averaged 14.9 points in the regular season, finishing second in the voting for NBA Sixth Man of the Year.\"(My ankle) hurt a lot,\" said Quickley, who added he doesn't know if he will play on Monday. \"It's a little sore.\"Another problem for New York on Saturday was the poor shooting of its top three stars as Julius Randle, Jalen Brunson and RJ Barrett combined to make 16-for-51 overall, including 2-for-17 on 3-pointers.In addition, Miami center Bam Adebayo dominated his two Knicks counterparts. Adebayo had 17 points and 12 rebounds in 36 minutes on Saturday. Mitchell Robinson and Isaiah Hartenstein combined for two points and eight rebounds in 40 minutes.",
        "\"He was more physical,\" Hartenstein said of Adebayo. \"(Miami) got all the 50-50 balls. We were always a step slow.\"To have a chance on Monday, the Knicks will have to get back to their Game 2 form, when they shot 40 percent on 3-pointers (16-for-40).\"Hopefully, we can get back on the right track,\" Randle said of Monday's game. \"Hopefully, we can make some shots and get a win.\"--Field Level Media"
    ]
}