{
    "articleURL": "/sport/football/article-12043031/Sam-Allardyce-calls-journalist-phone-went-press-conference-Leeds-boss.html",
    "content": [
        "Sam Allardyce replaced Javi Gracia as Leeds manager on Tuesday He will lead the struggling side in their last four games of the seasonThe manager called for a fine from a reporter whose phone went off  Sam Allardyce demanded a £10 fine from a journalist after their phone went off in his first press conference as Leeds manager.The 68-year-old, who was appointed on Tuesday following Javi Gracia's sacking at Elland Road, was answering a question when he was cut off by a ringing phone.",
        "He may not have matched Roy Keane's famous rant at a similar incident during his time as Ipswich manager, but Allardyce was unwilling to let it go.'That's a fine by the way,' he said without pausing for breath for from his previous answer, '10 quid to charity.'He then enquired as to what the local charity was, before thanking the offending journalist for agreeing to a £10 donation to the Leeds United foundation.",
        "While he seemed relaxed while joking with the media, Allardyce has inherited a tough situation at Elland Road.Leeds are currently out of the relegation zone on goal difference, but will be low on confidence after losing 4-1, 6-1, 5-1 and 4-1 in their past seven games.In theory, Leeds could stay up without picking up another point, but it looks a tough ask with games against top six sides Manchester City, Newcastle and Tottenham as well as the potentially relegation-threatened West Ham in their final four games.Allardyce exuded confidence on Wednesday in spite of the situation facing him.",
        "'People think I'm old and antiquated. It's so far from the truth,' Allardyce said.'There is no one ahead of me in football terms - not Pep [Guardiola], not [Jurgen] Klopp, not [Mikel] Arteta.'They do what they do, I do what I do. But in terms of depth of depth of knowledge, I am up there with them. I am not saying I am better than them, but I am as good as them.'",
        "Allardyce will be assisted by former MK Dons and Oxford manager Karl Robinson, with his long-time No 2 Sammy Lee unable to join him due to being on jury service. Former Leeds striker Robbie Keane will also join the staff."
    ]
}