{
    "articleURL": "/news/article-12041449/US-Navy-reveals-footage-Tehrans-vessels-surrounding-oil-tanker.html",
    "content": [
        "The US Navy's 5th Fleet identified the vessel as Panama-flagged NioviIran seized a Panama-flagged oil tanker in the Strait of Hormuz on Wednesday, the second-such capture by Tehran in recent days, the U.S. Navy said.",
        "The Navy's Bahrain-based 5th Fleet identified the vessel as the Niovi. It said Iran's paramilitary Revolutionary Guard seized the ship at 6am local time.The Navy published pictures of a dozen Guard vessels surrounding the tanker. Those ships 'forced the oil tanker to reverse course and head toward Iranian territorial waters off the coast of Bandar Abbas, Iran,' the Navy said.'Iran's actions are contrary to international law and disruptive to regional security and stability,' the 5th Fleet said in a statement. 'Iran's continued harassment of vessels and interference with navigational rights in regional waters are unwarranted, irresponsible and a present threat to maritime security and the global economy.'Iran's semiofficial Tasnim news agency, believed to be close to the Guard, reported the paramilitary force had seized a tanker it described as a 'violator,' without elaborating.",
        "Shipping registries show the Niovi as managed by Smart Tankers of Piraeus, Greece. A woman who answered the phone at the firm declined to immediately comment on the seizure.The Niovi had been travelling from Dubai to the United Arab Emirates' Fujairah port when it was forced to change course towards Iranian territorial waters.",
        "The ship's last-recorded position was at 2:31am off the coast of Oman in the Strait of Hormuz with Fujairah as its destination, according to Refinitiv ship tracking data.",
        "Roughly a fifth of the world's crude oil passes through the Strait of Hormuz, between Iran and Oman.  Last week, Iran seized a Marshall Islands-flagged oil tanker carrying crude for Chevron amid wider tensions between Tehran and the U.S. over its nuclear program.The Advantage Sweet had 23 Indians and one Russian on board.Wednesday's seizure by Iran was the latest in a string of ship seizures and explosions to roil the region.The incidents began after then-President Donald Trump unilaterally withdrew the United States from Iran's nuclear deal with world powers, which saw Tehran drastically limit its enrichment of uranium in exchange for the lifting of economic sanctions.Also, the U.S. Navy has blamed Iran for a series of limpet mine attacks on vessels that damaged tankers in 2019, as well as for a fatal drone attack on an Israeli-linked oil tanker that killed two European crew members in 2021.Tehran denies carrying out the attacks, but a wider shadow war between Iran and the West has played out in the region's volatile waters. Iranian tanker seizures have been a part of it since 2019. The last major seizure before recent days came when Iran took two Greek tankers in May and held them until November."
    ]
}