{
    "articleURL": "/sport/racing/article-12055025/Kentucky-Derby-Sixth-horse-dies-Churchill-Downs.html",
    "content": [
        "Chloe's Dream and Freezing Point were euthanized after injuries on SaturdayChurchill Downs is already conducting an investigation into recent horse deathsDailyMail.com provides all the latest international sports newsTwo horses died on Kentucky Derby day at Churchill Downs, taking the number of horse fatalities at the track to seven prior to the $3million race.",
        "The latest deaths are a further blow to a sport already reeling from a series of doping suspensions and breakdowns.Three-year-old gelding Chloe's Dream got hurt in the second race of Saturday's premier event.The horse was taken off in an equine ambulance with a right front knee injury and was euthanized, trainer Jeff Hiles confirmed to The Associated Press. 'He just took a bad step out there,' Hiles said. ",
        "'They could do the same thing running in the field as they could on the track. So it's very unfortunate. That's what we deal with.' Then, Freezing Point, a three-year-old colt, was euthanized, after pulling up in the Pat Day Mile Stakes.Dailymail.com has reached out to Churchill Downs for comment.PETA Senior Vice President Kathy Guillermo told Dailymail.com before news of Freezing Point's death: 'The pre-Derby death toll is still mounting. It's now six and counting. 'Although PETA appreciates that the Kentucky state veterinarian exercised caution by scratching the Derby favorite, we called for the closure of the track so stronger protocols could be put in place. 'Churchill Downs should have listened.'A statement from Churchill Downs on Wednesday read: 'Transparency is an important component of our commitment to safety and accountability in horse racing. 'We share the concern of our fans who have questions about the recent equine fatalities at Churchill Downs Racetrack and we extend our sincere condolences to those who love and cared for these horses.",
        "'While a series of events like this is highly unusual, it is completely unacceptable. 'We take this very seriously and acknowledge that these troubling incidents are alarming and must be addressed.'We feel a tremendous responsibility to our fans, the participants in our sport and the entire industry to be a leader in safety and continue to make significant investments to eliminate risk to our athletes. 'We have full confidence in our racing surfaces and have been assured by our riders and horsemen that they do as well.'New antidoping and medication rules enforced by a central governing body of the sport are scheduled to take effect May 22.'There's something going on,' said Pat Murtha, who was attending his first Derby. 'They need to find out, and set some rules and regulations to protect these animals.'Hall of Fame trainer Bob Baffert, a two-time Triple Crown winner, is nearing the end of a two-year ban issued by Churchill Downs Inc. One of his horses, Medina Spirit, crossed the finish line first in the 2021 Derby and failed a post-race drug test. The horse was disqualified and Baffert was punished.In 2019, over 30 horse deaths occurred at California's Santa Anita racetrack, rattling the industry and leading to safety reforms. Kentucky Derby-winning trainer Rick Dutrow had his license revoked in 2011 for 10 years by New York officials. ",
        "Regulators found syringes loaded with unauthorized medication in a desk in his barn. Dutrow re-opened his stable last month.",
        "Pre-race favorite Forte was scratched just hours before the highly-anticipated Kentucky Derby on Saturday, reducing the field to 18 hours for the 1 1/4-mile race.A crowd of about 150,000 descended on Churchill Downs to wager and watch the Derby with post time 6.57pm ET.The horse deaths included Derby contender Wild On Ice. Two of the horses were trained by Saffie Joseph Jr. He was indefinitely suspended by the track, although investigators have yet to determine a cause for the deaths of his horses.Four horses were scratched - Practical Move, Lord Miles, Continuar and Skinner - earlier this week. Practical Move and Skinner had fevers, while Continuar wasn't in peak condition, according to his Japanese trainer. Lord Miles was Joseph's Derby horse."
    ]
}