{
    "articleURL": "/wires/reuters/article-12046073/Impact-Nano-chip-materials-startup-wins-funding-Intel-Goldman-Sachs.html",
    "content": [
        "By Jane Lanhee Lee",
        "OAKLAND, California, May 4 (Reuters) - Impact Nano, a Massachusetts-based startup that makes specialty chemicals for the semiconductor industry and others, said on Thursday it raised $32 million in funding from investors including Intel Capital and Goldman Sachs Asset Management.It also said Intel Capital's managing director, Sean Doyle, will join the board of directors.As the U.S. tries to bring back semiconductor manufacturing with the CHIPS and Science Act, it will need to invest in building up the broader supply chain in addition to the multibillion-dollar chip fabrication facilities.The war in Ukraine has exposed several choke points on the chemical side of the chip industry that need to be fixed. That is because Ukraine is a major producer of neon gas, a key material used in the production of chips.\"Many of the chemicals that we've been asked to synthesize so far are not currently made in North America. And they are made in regions of political instability,\" said Matthew Stephens, CEO and co-founder of Impact Nano.Stephens said Impact Nano is inventing new ways to produce chemicals that chip makers use. Among the company's focus areas, he said, are increasing the purity of the chemicals, finding raw materials that are more abundant and comply with ethical guidelines, and making the process more environmentally friendly.",
        "He declined to identify current customers but said the chemicals produced are key materials for the extreme ultraviolet lithography process (EUV) which is how today's most advanced chips are made.The funding will be used to expand the Massachusetts factory. Stephens also said Impact Nano is looking to apply for some of the CHIPS Act funding that will support the suppliers for semiconductor manufacturing.Goldman Sachs Asset Management is part of Goldman Sachs Group Inc and Intel Capital is the investment arm of U.S. chip giant Intel Corp. (Reporting by Jane Lanhee Lee in Oakland, California Editing by Matthew Lewis)"
    ]
}