{
    "articleURL": "/wires/ap/article-12045123/Why-did-Oregon-GOP-senators-stay-home-A-look-tension.html",
    "content": [
        "PORTLAND, Ore. (AP) - Partisan tensions in Oregon skyrocketed this week because Republican state senators haven't shown up to work since Tuesday, meaning the Democrats who control the chamber don´t have enough people to lawfully convene. The move is casting doubt on planned votes set for this week on legislation about gun control, abortion rights and gender-affirming health care.",
        "Here's what to know about where Republicans and Democrats are divided and what´s at stake.WHAT'S HAPPENING AT THE OREGON LEGISLATURE?Republican state senators skipped a Senate floor session Wednesday and Thursday.According to the office of Democratic Senate President Rob Wagner, 10 Republicans and the chamber's lone independent were absent both days.In Oregon, two-thirds of the state House and Senate members need to be present to conduct business, or 20 of the 30 current members. Currently, 17 senators are Democrats, 12 are Republicans and one is an independent.Two bills on gun control and access to abortion and gender-affirming health care were scheduled for floor votes in the Senate this week. Because Democrats control the Legislature, the bills were expected to pass, but now their fate is unclear because there may not be enough lawmakers present in the chamber to begin proceedings.WHAT DO REPUBLICANS SAY?Republicans said they were protesting over bill summaries not being written in plain language.They based their boycott on a 1979 state law that requires the summaries of bills to be readable by those with an eighth- or ninth-grade education - measured by a score of at least 60 on something called the Flesch readability test.GOP Senate Minority Leader Tim Knopp says a Republican staff member discovered the existence of the law last month. Knopp couldn't say when the law has previously been followed, if ever.",
        "Asked whether the Republican boycott was due to the bills on gun control and abortion and gender-affirming care, Knopp said: \"It´s about every bill. But those bills specifically also don´t qualify under this law, and they refuse to fix them.\"He didn´t say how long Republicans planned to continue their protest. The Senate will try to reconvene Friday afternoon.WHAT IS THE FLESCH READABILITY TEST?The Flesch readability test was designed in the 1940s to measure how easy it is to read and understand a text. It takes into account factors like word and sentence length to determine the grade level of a text.Scores range from 1 to 100, with 100 being the easiest to read and 1 being the most difficult. A score between 60 and 70 indicates an eighth- or ninth-grade reading level.Oregon's 44-year-old law says bill summaries must have a score of 60 or above.WHAT DO DEMOCRATS SAY?Democrats say they don't believe the Republicans left because of the readability of bill summaries, but rather to obstruct the passage of legislation they oppose.Senate President Wagner says it's no coincidence the walkout began when state lawmakers were about to consider the bills on flashpoint topics like abortion, transgender health care and gun control.Democratic Senate Majority Leader Kate Lieber said that Republicans appear to be \"weaponizing\" an old law for political gain.",
        "WHAT'S AT STAKE?If Republican senators deny a quorum for the rest of the legislative session, which doesn´t end until late June, they could kill the bills on gun control, abortion rights and gender-affirming care.However, a new ballot measure approved by Oregon voters in November bars lawmakers who have 10 or more unexcused absences from running for reelection.The two bills are central to Democrats' legislative agenda this session.The wide-ranging bill on abortion and gender-affirming care would implement a series of measures, including shielding patients and providers from lawsuits originating in states where such care is now restricted. It would also require public universities and community colleges with student health centers to provide medication abortion and emergency contraception.Additionally, it would expand insurance coverage for gender-affirming health care by barring insurers from defining as cosmetic procedures that are prescribed as medically necessary for treating gender dysphoria, among other things.The parts of the proposal that have proved to be the most contentious have to do with minors. Under the legislation, doctors would be allowed to provide an abortion to anyone regardless of age, and it would bar them in certain cases from disclosing that to parents.Democratic lawmakers have said such scenarios are rare. But critics said this could exclude parents from key aspects of their child´s health care.",
        "The gun control measure would increase the purchasing age to 21 for AR-15-style rifles and similar weapons, impose penalties for possessing undetectable firearms, and allow for more limited concealed-carry rights."
    ]
}