{
    "articleURL": "/wires/ap/article-12059305/Citys-Haaland-takes-Madrids-attacking-trio-CL-semis.html",
    "content": [
        "MADRID (AP) - Two of the best attacking teams in Europe face off in the Champions League semifinals this week, with Manchester City´s record-seeking Erling Haaland going against Real Madrid´s red-hot trio of Vinícius Júnior, Rodrygo and Karim Benzema.",
        "Tuesday's first leg at Santiago Bernabeu Stadium will be a rematch of last year's semifinal, when Madrid got the better of a City team that didn´t have Haaland. City fell short of European success yet again, while Madrid went on to win a record-extending 14th title.The addition of Haaland could be the difference-maker for Pep Guardiola's team. The Norwegian has 12 of City´s 26 goals in the league this season. He is five short of Cristiano Ronaldo´s single-season record of 17 for Madrid in 2013-14.\"If you have a player like Haaland, you have to take advantage,\" Guardiola said Monday. \"We will play for him. When we didn´t have him we had to play differently. Now we have to take advantage of having a player like him.\"Haaland added a new dimension to a City attack that played most of last season without a striker. Instead of focusing on always dominating possession, Guardiola has been happy to use Haaland as a weapon on the counterattack at times. The striker has an English Premier League-record 35 goals this season, and 51 across all competitions.\"Haaland is very dangerous, we know it,\" Madrid coach Carlo Ancelotti said. \"But it's not only him. City has a complete team that plays very well. We will try to stop a team that seems unstoppable, but we will have our chances and we can compete.\"",
        "Madrid will stick to the formula that has worked well in recent years, with Vinícius, Benzema and Rodrygo taking turns to lead an attack that scored 25 times in the Champions League this season - 15 of them coming from the trio. They have eight of the team´s 10 goals in the knockout stage alone.Last season, Vinícius, Benzema and Rodrygo combined for all six of Madrid´s goals as it advanced past City 6-5 on aggregate in the semifinals. Rodrygo scored the two late goals that took the second leg to extra time at the Santiago Bernabeu.Rodrygo is coming off another two-goal performance against Osasuna that won Madrid the Copa del Rey final on Saturday. Vinícius had an assist. In the previous Spanish league round, Benzema had a hat trick in a 4-2 win against Almeria.With the Copa title secured and La Liga out of reach, Madrid can fully focus on the matchup against City.City enters the semifinals still in the middle of a tight title race in England. Guardiola had to play some of his top players - including Haaland and Kevin de Bruyne - for the full 90 minutes on Saturday in a 2-1 win over Leeds.Madrid eliminated two other English clubs in the Champions League - Liverpool in the round of 16 and Chelsea in the quarterfinals. City advanced past Leipzig in the last 16 and Bayern Munich in the last eight.",
        "Madrid is making its 11th semifinal appearance in 13 seasons and is trying to win its sixth title in 10 seasons.City played in its first Champions League final two seasons ago, losing to Chelsea.'We were prepared last year, too. We are the same manager, mainly the same players but completely different games. The difference is the second leg is at home,\" Guardiola said. \"The way we are playing is really good. We are not here for revenge, just another opportunity. One day we will win it. We come here this season to do it.\"___AP Sports Writer Steve Douglas contributed to this report.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}