{
    "articleURL": "/sport/nba/article-12055249/Miami-mauls-New-York-105-86-2-1-series-lead-Knicks-fail-handle-Heat.html",
    "content": [
        "The New York Knicks did not lead at any point during the comprehensive rout Game 4 is once more in Miami at the Kaseya Center before a return to New YorkDailyMail.com provides all the latest international sports news Jimmy Butler returned after missing Game 2 with an ankle injury, not that he needed to.",
        "Miami crushed the Knicks 105-86 in its first home game of the best-of-seven series to establish a 2-1 lead ahead of Game 4 at the Kaseya Center. Butler dropped 28 points (9-21 shooting) returning to an already-dangerous Heat group which almost stole Game 2 at The Garden Tuesday.Fast forward to the present, Miami took control from the tip and never looked back in a complete performance filled with contributions from the starters and bench. Its roster, which includes seven undrafted players, outperformed a Knicks team not ready for the home onslaught.The No. 8 seed Heat are now just within two wins away from yet another Eastern Conference Finals berth. 'We gotta protect home court, honestly,' Butler told ESPN postgame. 'Our fans were great, loud. We got into a couple of scuffles and we like that.'Is this a rivalry? I think whatever it is, it's two teams that play incredibly hard and both guys want to win.'Jalen Brunson led all Knicks scorers with 20 points in a largely inadequate team performance. After ostensibly tweaking his left ankle late in the game, Brunson was asked about it postgame. 'I'm all good. I'll be ready for Game 4,' Brunson said in his typical no-nonsense manner.",
        "'You've got to give them credit... for us, we got to bounce back for Game 4. For me, I've got to be better and we'll go from there.'",
        "Cody Zeller and Julius Randle added an extra element to the otherwise mundane affair with the Heat up big in the final seconds of the third. After becoming entangled several plays earlier, the two engaged after an Immanuel Quickley bucket. More specifically, Zeller pushed Randle over, who ended up against the post padding.Tech fouls were issued to Zeller, Isaiah Hartenstein and Caleb Martin for their roles in the scuffle. Randle was chuckling while seated against the padding as a mini-fracas continued in front of him. What followed wasn't so funny for the Knicks and the smattering of New Yorkers who grew quieter as the game went longer.",
        "Randle was resultantly given a free throw, which he missed -- much to the pleasure of the home crowd Heat fans. It summed up Saturday for New York who failed to consistently compete with a Heat team who capitalized on the lethargic and fundamentally unequipped Knicks. So much so, Jimmy Butler took a break from terrorizing the New York franchise immediately following the scuffle to spin the ball on his finger in a show of skill and context as to the significance of the remaining minutes. Still, a quarter was to be played out in which Miami continued the status quo, maintaining a healthy double-digit lead. ",
        "The way Quickley went down was anything but. The spirited rotational piece was having a positive impact off the bench - scoring 12 points - before his ankle got caught underneath a sprawling Bam Adebayo while fighting for a loose ball halfway through the fourth. ",
        "He writhed in pain on the hardwood with Tom Thibodeau even coming out to check on the third-year guard, adding another blow to an already dismal afternoon in South Beach. It wasn't bad for all with Miami native DJ Khaled assuming his usual courtside seat, while La Liga royalty in Antoine Griezmann, Koke and Eric Garcia took in the action from the front row.Miami Dolphins coach Mike McDaniel and offseason acquisition Jalen Ramsey were courtside alongside celebrity boxer Jake Paul and entrepreneurs Daymond John and Gary Vaynerchuk.  To the Knicks' credit they didn't quit but could not recover from a slow start. So slow that the road team never led in Miami. Before returning to a ravenous Madison Square Garden, New York have an opportunity for redemption Monday night in the 305.  "
    ]
}