{
    "articleURL": "/sport/football/article-12058639/West-Ham-captain-Declan-Rice-delights-tearful-young-fan-win-Man-United.html",
    "content": [
        "Declan Rice spotted a young supporter crying after West Ham's win on Sunday The midfielder gave the fan his shirt which he'd promised to Marcus Rashford It comes after Leeds and Arsenal players were criticised for 'snubbing' fans Premier League players have recently come under fire for ignoring fans, but West Ham captain Declan Rice showed how it should be done after their victory over Manchester United.",
        "Rice had originally intended to hand his shirt to opponent and England team mate Marcus Rashford, after the Hammers took a giant stride towards safety with a 1-0 victory.However, the 24-year-old showed his class by giving an overjoyed young supporter his match-worn shirt.The delighted young fan was tearful during the exchange at meeting his hero, and Rice's kind gesture left him a memory that he will treasure.It comes after Arsenal stars were branded 'rude' for 'snubbing' an eight-year-old as they signed her shirt, and following criticism thrown at Leeds players who ignored fans who were waiting to greet them at a hotel in Bournemouth.",
        "Rice spotted the youngster crying in the stands and said: 'Are you alright, brother? Why are you crying?'He then held out his hands to the young fan before giving him a hug.The young Hammer then asked for Rice's shirt to which he replied: 'You know what, I did promise it to Rashford.'Don't show them lot (other fans) because I've just told them I'm going to give it to Rashford, but I'll give him another one.'Rice then handed the youngster his shirt before giving him another hug and telling him: 'I love you mate.'Unfortunately, the West Ham fan didn't have a pen for Rice to sign the shirt, though the midfielder is willing to sign it at a later date.",
        "He tweeted: 'Seeing your boy made my night. This is what it's all about. Would be a pleasure to sign it for you.'The footage has gone viral on social media, with scores of fans applauding the West Ham captain for his generous act.",
        "One person commented: 'Love this @_DeclanRice. I'm not a West Ham fan but I’m a fan of decent human beings with big hearts. Class act mate.'Martin Sanders wrote: 'Absolute class! After what we saw with Leeds players a few weeks ago this is an absolute breath of fresh air. You can see Rice is a role model for any player.'Scott Walsh also tweeted: 'Top man. He realises he’s in a position to give back and it means so much to some.'",
        "Last month, Arsenal players faced criticism after the club posted a video which showed players signing a mascot's shirt, without acknowledging the young fan as they walked past.The video prompted criticism from celebrities including Laura Woods, Piers Morgan and Nick Knowles, who told Arsenal to 'give your players another go at being decent human beings'. The father of mascot Olivia Murray did go on to defend the club as he tweeted: 'My daughter had a lovely time as Mascot for @Arsenal. There was only a small window to meet the players and she enjoyed it very much. Odegaard is her favourite player so to hold his hand onto the pitch was very special.'",
        "Woods, who is an Arsenal fan, admitted she felt uncomfortable watching the footage and reached out to the club afterwards. Speaking on talkSPORT, she explained their response.'To add a little bit of context, I actually messaged the club because I think they thought \"they all stopped and signed the shirt, this is great\", Woods said.'Maybe that in itself is the problem that there’s now a disconnect between what you’re meant to do for those kinds of mascots. The club did say it’s part of a matchday experience so that’s not the only interaction she had with the players.'She was a mascot, she went out on the pitch with them, she would have been on the pitch with them during warm-ups.''I think there’s a lot of things we don’t see, but that’s not excusing that video because I watched it a couple of times over and in my head thought \"oh wait, was it cut off afterwards, maybe they did [acknowledge her]?\"'And I went back and watched it, and they didn’t.'Meanwhile another clip posted on social media showed members of the Leeds first team blanking supporters who had waited in the hotel lobby to say hello. ",
        "The players were filmed walking towards the hotel's entrance in complete silence, despite numerous supporters trying to get their attention.",
        "The majority of the Leeds team were wearing headphones and avoided eye contact as they headed for the door.A younger member of the small crowd gathered to greet the team was seen waving at the departing Leeds players, but nobody even looked in his direction.Morgan led the criticism of the Leeds squad, labelling the players 'selfish arrogant p****s.'Leeds' players later apologised in a statement on the club's website and admitted 'there's no excuse' for the way they ignored their fans. "
    ]
}