{
    "articleURL": "/tvshowbiz/article-12059633/Denise-Austin-66-fits-swimsuit-wore-30s.html",
    "content": [
        "Workout guru Denise Austin says that she feels just as fit now as she did in her 20s.",
        "In a post shared this weekend, the fitness icon was wearing the exact same pink swimsuit she modeled in the 1990s.She was on the beach with her blonde hair down as she looked phenomenal in both images - on the left she is seen in her thirties and on the right she was in her sixties.The star - who was seen making a margarita on Cinco de Mayo -  said that she is just as confident now about her look as she was 30 years ago, which is an empowering statement.'WOW!! what an incredible memory to look back on!' she began her Instagram caption.",
        "'This Then and Now brings back such nostalgia,' added the California resident.'I wore this suit back in the ‘90s while shooting my TV show!'How many of you remember watching? I still feel as confident and fit as ever and love that I have this suit to remind me how far I’ve come!'Austin then added, 'Longevity baby!! Thank you to everyone that has always supported me.. THEN and NOW!!!!xoxo.'The exercise queen spoke to DailyMail.com last year about her figure.The svelte star has told DailyMail.com that one of the ways to maintain a flat belly is to skip 'sugar substitutes.' She said that women over 50 need to try different foods. Foods high in fiber are a must, she noted. ",
        "'Our 50s is when staying regular can become a challenge, so in addition to fiber-rich whole grains, begin to incorporate other fiber-rich foods such as beans and legumes, broccoli, berries and avocados,' she said.She also recommends inflammation-fighting foods. 'Help minimize inflammation with the addition of turmeric, salmon, olive oil and even dark chocolate... these foods can also help to promote heart health and a healthy weight, when eaten in moderation!'And her last tip is to consume plant-based protein. 'To help keep your heart healthy, at this point in your life you may want to begin to substitute in plant-based protein for animal protein, such as red meat. Consider a meat-free bean chili, tossing lentils into your salads, or fajitas with tofu instead of steak.'As far as food, she told DailyMail.com she watches what she eats but keeps it delicious. And her portions are just right for shedding the pounds.",
        "'I eat smaller portions,' Denise told DailyMail.com. 'For dinner I may have salmon and veggies. A snack is flax seed with yogurt. I love avocadoes and eggs for breakfast.'I cook really healthy for my family. There are a lot of salads, chicken tacos, vegetable lasagnas, casseroles with less cheese.' But she is not always careful: 'I eat well 80 percent of the time and the other 20 percent I am bad.'",
        "She is referring to the popular 80/20 diet method which allows for cheat days. Some of the things she loves to cheat with: carbs and sugar. And she also talked working out.         The exercise proponent's answer to battling the bulge is by taking baby steps.",
        "'I have been doing this for 40 years and am not a fitness nut,' she clarifies straight away during the interview. 'But I am consistent.'That means working out every day in some form.'If you can do 10 minutes of working out at a time and do that three times a day, you will have worked out 30 minutes in one day,' noted the star.And she added that it is important to keep moving all day long: 'It is all about blood circulation and moving. I even stand up and walk in place when I watch TV just to keep it flowing.'Sounds like smart math, and an easy way to lean into exercising.'The consistency pays off,' added the affable pinup who is very active on Instagram."
    ]
}