{
    "articleURL": "/tvshowbiz/article-12054229/Jules-Robinson-continues-weight-loss-attends-Kate-Waterhouse-launch.html",
    "content": [
        "Married At First Sight star Jules Robinson turned heads as she was photographed at a Mother's Day event. ",
        "The mother, 40, wore a stunning full-length floral yellow and pink gown to the launch of Kate Waterhouse's new fashion range on Friday. Jules, who met her husband Cameron Merchant on Married At First Sight in 2019, looked very glamorous at the glitzy afternoon tea event. Her floor-length wraparound dress featured multicoloured flowers that complimented her pale complexion perfectly. She kept her red hair down and in a loose wave as she opted for a natural makeup look with a nude pink lip. ",
        "On her feet, Jules wore a pair of nude sandals and she kept her accessories to a minimum with a pair of brown sunglasses. The event took place to launch new 'Mini Me' collaboration with Wanderluxe Sleepwear. On the day, there was a crafting station for the guests' children to make loving homemade gifts for their mothers. Jules, who appeared in season six of the dating series, legally married her co-star Cam in 2019. They welcomed their son Oliver in October 2020. ",
        "While the pair have found success in Australia, Jules revealed that she's considering a move to the UK after being offered work in London.'The UK has really been there with open arms for me from day one,' she told Stellar magazine at the end of last year.",
        "'I always looked at London as a city of so much opportunity, and I do, to this day, feel that way. I just returned from a work trip [there]'. Jules has not discounted a move to England, specifically London, a city she says she loves.'If the right opportunity arose, my family would definitely move to the UK' she said, adding that she's already had offers.'MAFS aired in the UK, where it was extremely popular, and I've already extended work opportunities there. 'I've been in talks with some UK TV stations as presenting is something I'd like to explore.' "
    ]
}