{
    "articleURL": "/wires/pa/article-12053991/Labour-win-outright-general-election-says-senior-MP.html",
    "content": [
        "A Labour frontbencher has predicted his party will win outright at the next general election, despite local election results suggesting there could be a hung parliament.",
        "Labour gained 635 seats and took control of another 22 local authorities, while the Tories suffered heavy losses.Vote share analysis by the BBC found that, while Labour would be by far the largest party if the results were replicated at next year’s general election, it could fall short of a majority. We are going to win decisively, we are going to win outright  Labour MP Peter Kyle  But shadow Northern Ireland secretary Peter Kyle rejected suggestions Labour would need to go into coalition.“All the extrapolations people are making from the local elections include a status quo in Scotland; we know the status quo in Scotland is not going be the result that comes out in a general election.“Whereas all these parties from the Tories to the SNP and others are clinging to the hope that they can ride on the coattails of the Labour party, it will not be the case,” he told BBC Radio 4’s Today programme.“If you look at the current polling when it comes to people’s attitudes towards the general election, we are going to win decisively, we are going to win outright, and we will get into a programme of government that will tackle the priorities we set out in this local election.”",
        "Mr Kyle denied the results were a mid-term anti-Government vote rather than a resounding endorsement for Labour.",
        "“We’re winning votes from the Tories, we’re uniting the left where we need to, and we’re deepening our connection with voters in those key places that we absolutely need to, not just in those areas that turned their backs on us in 2019 that we’re winning back, like Stoke, but in those places that are signals of a party that’s moving towards government, like in Kent.”Sir Keir Starmer on Friday was celebrating wins in key battlegrounds as an indication he was on course to enter No 10.He said the “fantastic” results combined with a hoped-for recovery in Scotland would give him a majority in Westminster after a national poll.“Make no mistake, we are on course for a Labour majority at the next general election,” the Labour leader said in Medway, one of the councils his party seized from the Tories.Labour also said the results amounted to “a clear rejection” of Prime Minister Rishi Sunak.",
        "Rachel Wolf, who co-authored the 2019 Conservative manifesto, said the outcome was “very, very bad for the Government”.She told Today: “It was good but not great for Labour and what is clear is that people are rejecting the Conservatives at least at this election rather than jumping for an alternative, but that is often enough at this stage.",
        "“There is a lot that the Government has to do – a lot – to be competitive again at a general election.”She blamed the “ruckus of last year and Liz Truss” and the fact that “most people across the country feel poorer” and do not believe “the basic machinery of Government is working”.With almost all authorities having declared, Mr Sunak’s party shed 48 local authorities and 960 councillors, near the 1,000 worst-case prediction senior Tories had floated to manage expectations ahead of the poll.The Liberal Democrats had what leader Sir Ed Davey hailed as the “best result in decades”, taking 12 local authorities and 416 seats."
    ]
}