{
    "articleURL": "/wires/ap/article-12043123/3-Colorado-teens-charged-murder-rock-throwing-death.html",
    "content": [
        "DENVER (AP) - Three teens accused of killing a 20-year-old woman while throwing large rocks at passing cars have been charged with murder and other crimes, prosecutors said Wednesday.",
        "Nicholas \"Mitch\" Karol-Chik, Joseph Koenig and Zachary Kwak, all 18, each face identical charges of first-degree murder, attempted first-degree murder, second-degree assault and attempted second-degree assault in the death of Alexis Bartell - and alleged attacks on six other cars in suburban Denver, First Judicial District Attorney Alexis King announced.Two other drivers suffered minor injuries, according to investigators.The office of Karol-Chik's lawyer, Holly Gummerson, and Koenig's lawyer, Tom Ward, declined to comment. A messages left for Kwak's lawyer, Emily Boehne, was not immediately returned. During a brief afternoon court hearing, the lawyers all declined to have the charges read.According to the Jefferson County Sheriff´s Office, Bartell was talking on the phone with a friend when she was hit by the rock on April 19. After the call went silent, the friend tracked Bartell´s location with a phone app and found the woman dead in her car, which had crashed into a field.Karol-Chik told investigators that Koenig slowed down so Kwak could get a photo of Bartell's car after it crashed into a field. He said all three got excited every time they hit a car with landscaping rocks taken from a Walmart parking lot, but acknowledged he felt \"a hint of guilt\" passing by her car, according to court documents.",
        "Kwak said he took the photo because he thought that Karol-Chik or Koenig would want to have a \"memento\" of what had happened, according to the arrest affidavits.Karol-Chik told investigators with the Jefferson County Sheriff´s Office that he and Koenig had thrown rocks and even a statue at passing cars on at least 10 other days before Bartell was killed. Kwak heard about what they had been doing and asked to join them, according to Karol-Chik's account in the affidavits.Karol-Chik and Kwak offered different accounts about who threw the fatal rock. Koenig did not speak to investigators after he was arrested, according to the arrest affidavits."
    ]
}