{
    "articleURL": "/wires/ap/article-12047577/Victims-families-Oklahoma-question-offender-free.html",
    "content": [
        "Questions mounted Thursday about why an Oklahoma sex offender who authorities say shot to death his wife, her three children and their two friends and then killed himself was freed from prison early, despite facing new sex charges in a separate case.",
        "Those questions include how he was released on good behavior when the new charges were for solicited nude images from a teen while he was imprisoned, why was he released on $25,000 bond, and how was a man convicted of raping a teenager able to live with teenage girls?If things had gone differently in the Oklahoma criminal justice system, family members of the victims said, maybe their loved ones would still be alive.Jesse McFadden, a 39-year-old convicted rapist, was scheduled to be in court on Monday for the start of a jury trial on charges that while in prison for rape he used a contraband cell phone to solicit a 16-year-old girl and exchanged nude photographs with her.Those new felony charges were filed in 2017, more than three years before McFadden was released from prison in 2020.\"That's plenty of time to prosecute any criminal case on the face of the earth,\" said Brett Chapman, a former Tulsa County prosecutor who now works as a defense attorney who reviewed McFadden's case. \"What happened here? That should have kept him in.\"",
        "Chapman also said the $25,000 bond McFadden was released on was too low.Muskogee County District Attorney Larry Edwards, whose office was prosecuting the 2017 charges against McFadden, has not returned multiple telephone messages seeking comment. But McFadden's defense attorney, Rex Earl Starr, said the death of McFadden's first attorney and the COVID-19 pandemic led to long delays in the prosecution.",
        "Still, Starr said he spoke to McFadden on Sunday, the day before he and the six victims were found dead on his rural property east of Henryetta, a town of about 6,000 about 90 miles (145 kilometers) east of Oklahoma City, and didn't suspect anything was wrong.\"There was no indication whatsoever we wouldn´t be ready to select a jury at noon,\" Starr said.But, in a series of ominous messages with the teenager whom he had allegedly been texting while behind bars, McFadden vowed not to return to prison. According to screen grabs of the messages, forwarded to KOKI in Tulsa, McFadden said his \"great life\" was crumbling and blamed the teenager for the latest set of charges against him that could put him back in prison for decades.A solicitation conviction can mean a 10-year sentence; the pornography charge could mean 20 years behind bars.\"Now it´s all gone,\" he texted. \"I told you I wouldn´t go back.\"\"This is all on you for continuing this,\" he said.A spokeswoman for the Oklahoma Department of Corrections said in a statement McFadden was able to earn credits for things like good behavior and completing program and education assignments that were then applied after he served 85% of his sentence.Spokeswoman Kay Thompson added that registered sex offenders are allowed to live with their own children and stepchildren as long as they are not a victim of the offender. McFadden was not given probation or parole upon his release, but he did have to register as a sex offender and check in every 90 days with the sheriff´s office, which Okmulgee County Police Chief Joe Prentice said McFadden had done.",
        "McFadden´s prison record shows he had at least 10 misconduct offenses during his 17 years in prison, including consensual sexual activity with other offenders, positive drug tests and possession of tobacco.The DOC did not address why McFadden was released despite facing new felony charges, but his attorney, Starr, said there was no legal mechanism to keep him incarcerated when he had finished serving his sentence.\"The simple answer is that he is innocent until proven guilty, it´s a basic constitutional provision,\" Starr said.After McFadden was released from prison, he was arraigned in Muskogee County on the new charges of soliciting a minor and possessing images of child sexual abuse, but was released on $25,000 bond.Relatives of the victims were in disbelief by McFadden's early release, especially in light of the seriousness of the new charges against him.\"And they rushed him out of prison. How?\" asked Janette Mayo of Westville, whose daughter, Holly Guess, 35, and her grandchildren, Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13, were among those killed.\"Oklahoma failed to protect families. And because of that my children - my daughter and my grandchildren - are all gone,\" Mayo said.The other victims were 14-year-old Ivy Webster and 16-year-old Brittany Brewer. Justin Webster, who said he allowed Ivy to join a sleepover at the McFadden home not knowing anything about the man's past, raised similar concerns.",
        "\"There needs to be repercussions and somebody needs to be held accountable. They let a monster out,\" Webster said.Prosecutors in his original rape case objected to any early release from prison, noting that McFadden had tied a 17-year-old´s hands and feet to bedposts, cut her shirt off and raped her at knifepoint. At one point, he threatened to use the knife on her if she \"did not shut up,\" court records show.McFadden married Holly Guess in May 2022; what she knew of his record isn't clear. Mayo said the family didn´t learn about her son-in-law's criminal history until a few months ago.\"He lied to my daughter,\" Mayo said. \"He convinced her it was all just a huge mistake.\"Shawna Cleary, who teaches several courses on criminal justice at the University of Central Oklahoma and who wrote a book titled \"Sex Offenders and Self-Control: Explaining Sexual Violence,\" said it's common for sex offenders like McFadden to charm and manipulate those around him.\"Either she was unaware of what he did or she believed what he was selling ... and she was willing to marry him,\" Cleary said.Cleary said there is a need in Oklahoma for closer supervision and treatment for people convicted of crimes - particularly sex offenses - after their release from prison, although she acknowledged there often isn't treatment available in much of the state.",
        "\"It's not available in all 77 counties, and very few people want to do that kind of work,\" Cleary said.___Follow Sean Murphy on Twitter: @apseanmurphy"
    ]
}