{
    "articleURL": "/news/article-12050203/Woman-mauled-border-collie-walking-dog-park-attack.html",
    "content": [
        "WARNING, GRAPHIC CONTENT. Jucena Ali was savagely attacked by a dog outside a cafe at a park in Swansea The dog bit her twice and then shook its head while her arm was still in its mouth A woman has described the horrific moment she was mauled by a border collie while she walked her own dog.",
        "Jucena Ali, 27, was attacked by the dog outside a busy café in Cwmdonkin Park, Swansea on Saturday, April 29. She was queuing up for ice cream with her puppy Reggie, who is a short-haired border collie, when she noticed another dog approaching them. Despite having a lead attached to its collar, there was no one holding it at the time.Following this, she decided to bend down and put her own dog on a lead. While she was doing this, she said she used a 'baby voice' to greet the long-haired border collie.But the 27-year-old said the other dog's hackles went up, and as soon as she moved her 'emotional support dog' Reggie out of the way the long-haired border collie then shockingly attacked her in an attack which she says left 'blood squirting everywhere'. ",
        "The dog bit her once on the arm, and then proceeded to bite her again a second time - leaving her with gaping wounds and the fatty tissue of her arm 'hanging out'. Ms Ali recalled the dog shaking its head from side to side slightly, while her arm was in its mouth, before it decided to let go.She said: 'Because I screamed in pain, I think that's when the owner decided to take the dog off me. The owner's used to it because of the amount of times that dog has come up to me and my dog to try and attack him.",
        "'I felt something warm trickling down my arm so I lifted up my sleeve and there was blood squirting everywhere.' The horror incident left Ms Ali with two bite marks on her arm.One was small, but while the second one was 'not wide but very deep' it has caused her sharp pain. She added: 'The fatty tissue of where it bit me was hanging out and it was gross.'She continued to add that an onlooker grabber her arm following the attack and applied pressure on it to stop the bleeding, as she explained: 'There was blood dripping down my arms and down my fingers and my poor dog was covered in my own blood.'Ms Ali, who experiences anxiety, then started hyperventilating from the 'sheer shock' of the incident but says she was supported by kind strangers, saying: 'The amount of people who came to aid me, I was so touched by how loving this community is.'The 27-year-old says that a witnesses confronted the owner of the dog who had attacked her, but things went from bad to worse when the owner began to swear at them.",
        "She adds that the owner is responsible for the attack, explaining: 'It's not the dog's fault. It's the owner's responsibility. Border collies are very smart and they need a lot of attention and a lot of activities. If you're failing to provide the amount of activities they need, they get agitated and angry.",
        "'Could you imagine if a child had been bit, it would have been way worse. It could have been a broken arm or a ruined face and as a child when you witness something like that it creates fear. 'I don't want anyone to be scared of dogs because they're such loving, loyal companions. But if you don't give them the requirements they need, they can become nasty.'Following the attack, Ms Ali says she felt sick and dizzy and went to the Minor Injuries Unit in Neath Port Talbot on Saturday evening.She was then referred to Morriston Hospital. However, she went home to look after Reggie overnight and visited the hospital again the following morning.And following a check up on Tuesday, she was informed that there is no infection to the area, however states that it now feels numb. But following the incident, Ms Ali has been left afraid of dogs, saying: 'I'm really scared to go to Cwmdonkin now and I'm currently really scared of any dogs coming up to me or my pup. 'I don't want people to say all dogs should be on leads. You just need to be closer to your dog and pay more attention to its body language.'"
    ]
}