{
    "articleURL": "/wires/reuters/article-12040931/Fresh-morale-boost-Giants-chase-series-win-vs-Astros.html",
    "content": [
        "By retiring 19 of the first 20 Houston Astros batters with breathtaking ease, San Francisco Giants right-hander Anthony DeSclafani earned the right to stay on the bump when things got a bit dicey in the seventh and eighth innings on Tuesday.",
        "Clinging to a two-run lead in the middle game of a three-game set, DeSclafani worked around Yordan Alvarez's double with one out in the seventh and his own throwing error in the eighth that put Yanier Diaz in scoring position with two outs.By completing a season-high eight innings on a season-high 109 pitches, DeSclafani defeated the Astros 2-0 and also set the table for the Giants to have their entire bullpen ready for the series rubber match on Wednesday.\"That's always something we're looking for from our starter,\" Giants manager Gabe Kapler said. \"Just give us a chance to let you go. So we needed that. It was big for the club. Big morale boost for sure.\"Logan Webb (1-5, 4.10 ERA) will start the series finale for the Giants.The right-hander has recorded a decision in each of his six starts this season. On Thursday, he took a loss against the St. Louis Cardinals, allowing two runs on seven hits and one walk with seven strikeouts over 6 2/3 innings. Webb lost his first four starts, pitching to a 4.94 ERA, before beating the New York Mets on April 22.Webb is 1-1 with a 3.86 ERA over two career starts against the Astros. In his latest appearance against Houston, a 5-3 home victory on Aug. 1, 2021, he allowed two runs on seven hits and one walk with three strikeouts over six-plus innings.",
        "Left-hander Framber Valdez (2-3, 2.54 ERA) will start the rubber match for Houston. He has logged five consecutive quality starts, most recently allowing three runs on eight hits with three strikeouts over seven innings in a 3-1 loss to the Philadelphia Phillies on Friday. Valdez has alternated losses and wins over his past five starts.Valdez has faced the Giants once previously, allowing two runs on four hits and three walks while striking out six over five innings in a 9-6 road victory on July 30, 2021.For the second time in as many nights on Tuesday, the Astros turned to a reliever who had joined the club earlier in the day. In the series opener, right-hander Brandon Bielak worked four innings after starter Luis Garcia departed after eight pitches due to right elbow discomfort.The Astros placed Garcia on the 10-day injured list on Tuesday, and his roster replacement, left-hander Matt Gage, was first out of the bullpen after starter Hunter Brown departed with one out in the fifth inning. Gage rallied from a 3-0 count to retire Wilmer Flores and leave the bases loaded in the fifth. He then worked around Joey Bart's single in the sixth to cap a scoreless outing.\"My assessment was he looked good, he looked very good,\" Astros manager Dusty Baker said. \"He had a good slider, and then, when he fell behind 3-0 with the bases loaded, he came back and got the hitter. So he threw the ball very well.\"",
        "With starters Jose Urquidy and Garcia landing on the IL over consecutive days, the Astros will need the likes of Bielak and Gage to deliver when they are called upon.--Field Level Media"
    ]
}