{
    "articleURL": "/news/article-12045711/Boy-6-shot-killed-played-video-games-bed-gunmen-ambushed-family-home.html",
    "content": [
        "Kingston Campbell was shot through the window of his home in Lynchburg, VAPolice are still trying to identify assailants seen firing guns in surveillance video A six-year-old boy was shot and killed as he played video games on his bed, with gunmen firing through the window of his home before fleeing on foot, police have said.",
        "Kingston Campbell was shot on Monday night, with shocking surveillance footage appearing to show the moment the unidentified people shot at his family home in Lynchburg, VA.The little boy was dead by the time police arrived and a manhunt is now underway to track down the assailants, local media reports.Kingston's mother, Shay Fowler, said in a statement that his young sisters were 'right beside him' when the senseless shooting took place, and will now need time to heal.Paying tribute to her son, who she said loved video games and singing, Ms Fowler said: 'He was my weakness. My only son. My youngest child. I will never be the same again'.",
        "Chilling CCTV footage, which appears to have been filmed across the street from Kingston's home, shows crackles of gunfire towards the property.After firing a few shots, the group then quickly makes off on foot down the road.Community members are now mourning the killing of the young boy in his own home, saying they have been left 'frustrated, 'angry' and 'frightened'.Antonio Davis, a board member with One Community One Voice, said such a shooting 'could happen right beside anybody in the community.'Shawn Hunter, the president of local anti-violence group Peacemakers, said the killing should mark a turning point for the community.",
        "'Everybody is feeling this. We have a duty as parents because what is being seen out in the streets is coming from inside the home,' Hunter said. 'We got a lot of work to do because everybody is tired of this.'Kingston's stepfather Hugh Oulds, who knew the boy since he was one, told reporters he is struggling to come to terms with what happened to his beloved stepson.'How would you feel if that was your son? If you had woke up in the middle of the night, you don't have power, and you didn't even know that your own son was laying in the house, suffering?' Oulds said. ",
        "Speaking to local TV station WWYNTV, the heartbroken stepdad said he didn't know how to keep going.'I'm still trying to figure out what I'm going to do tomorrow whenever I go to sleep and I don't hear him say my name,' Oulds said. 'Or when I come through the house and he's not there to ask me to turn on Fortnite.' Kingston, also known by his loved ones as Kingster, was an avid gamer and spent much of his time on his Nintendo and Fortnight, his family said. His mother's youngest child, Ms Fowler said she was excited to be having a son after two girls and 'fell in love with him' as soon as he was born.",
        "She said Kingston 'knew God and I know that’s exactly who he’s with now. Up there singing his big heart out.' ",
        "'I’m hurt that it had to be my child but I pray that no one else has to go through this pain that I have to,' she added.A police search warrant reportedly showed that others inside the duplex home on Floyd Street suffered minor injuries from the shooting.In a released statement, Lynchburg police called Kingston's death a 'senseless tragedy stemming from a violent criminal act that has no place in our community.' Police attempted to reassure the public on Tuesday that there is no active threat to them.No arrests have been made at this time and police urged anyone with information on the killing to come forward. "
    ]
}