{
    "articleURL": "/tvshowbiz/article-12038839/Simu-Liu-teases-details-incredible-Barbie-live-action-movie.html",
    "content": [
        "The actor, 34, stars as an iteration of Ken in the highly-anticipated movie  Margot Robbie takes on the role of the iconic Barbie doll for the comedy flick Liu opened up to DailyMail.com about the film at Monday's Met GalaSimu Liu has claimed that the upcoming Barbie movie will 'break the zeitgeist' as fans eagerly await the release of the highly-anticipated film.",
        "So far, fans have only been given teasing previews about the Greta Gerwig-directed feature, which sees Margot Robbie take on the role of the iconic doll for what appears to be a fish-out-of-water comedy.The Shang-Chi and the Legend of Ten Rings actor, 34, stars as one of the 'Kens' who lives in a hyper-real Barbie-inspired world - dubbed 'Barbieland' - where there are many iterations of the iconic dolls in existence.Speaking to DailyMail.com at the Met Gala on Monday night, the Marvel star gushed: 'I don’t think the world is ready for just how much this movie will break the zeitgeist because it truly is impactful. ",
        "'It's smart, it's subversive, and Greta is just a generational filmmaker and getting to be one of her Kens is just such an honor.'Explaining that he had just been given the chance to see a cut of the film, he added: 'Filming it was an incredible experience. They just screened the film for me last week and I got to watch it and it is so incredible'.The Kim's Convenience star's teasing came days after the release of the first official trailer.Following an initial teaser that paid homage to Stanley Kubrick's 2001: A Space Odyssey, fans were finally given a look into dazzling world of 'Barbieland' with actors Margot Robbie and Ryan Gosling playing Barbie and Ken respectively. ",
        "The trailer sees Margot's Barbie is seen having fun with Ryan's Ken in 'Barbieland'. Playing on the quirky premise of what the Mattel dolls would get up to if left to their own devices, the teaser features a comical scene between Ryan, 42, and Margot, 32, about spending the night together. 'I thought I might stay over tonight,' Ryan's Ken asks Margot's Barbie. 'To do what?' she replies innocently. After a brief awkward pause he responds: 'I'm not actually sure.'  ",
        "However, their plastic-fantastic lives are turned upside down (quite literally) when they are seen traveling to the 'real world' in a car that spins up into the air.  Will Ferrell is also seen playing the CEO of the toy company as he somehow brings his figures to life, welcoming them into civilization. During the opening of the trailer, Barbie appears on the beach to soak up the sun in the idyllic landscape of Barbieland.Her boyfriend Ken - the version played by Ryan - tries to get her attention by waving and calling her name, and she cheerfully responds.However, much to Ken's chagrin, Barbie gets distracted by greetings from several of her friends, including President Barbie (Issa Rae) and another Ken (Simu Liu).The group all live happily in a world where all the women are called Barbie and all the men Ken, leading to a chorus of 'Hi Barbie!' when Margot's character hits the beach. ",
        "To a throwback Beach Boys soundtrack, Margot's Barbie cruises through Barbieland, a candy floss city done in bright bright pastels. Huge frisbee games take place between adults on the beach, where Simu's Ken flips his hair back after a particularly good throw.Even the president's office appears to be a place where the staff - a whole phalanx of Barbies - is in a constant state of good humor. President Barbie at one point calls out: 'Okay, ladies, let's do this!' and her whole office erupts into a dance party. The only visible source of tension in Barbieland is that the two Kens played by Ryan and Simu appear to be competing with one another for Margot's Barbie.",
        "Meanwhile she is happily oblivious, to the point that when Ryan's Ken asks to spend the night at her home, she has no idea why.'Because we're girlfriend-boyfriend,' says Ken, but when Barbie asks with a smile 'what' he wants to do at her house all night, he admits: 'I'm actually not sure.'The Kens played by Simu and Ryan wind up coming face to face for a confrontation on the beach, with Ryan's Ken apparently hurt during the frisbee game.'Looks like this beach was a little too much beach for you, Ken,' says Simu's character, prompting Ryan's to retort: 'If I wasn't severely injured, I would beach you off right now, Ken.'",
        "In full view of a crowd that includes Ken's sidekick Allan (Michael Cera), the two men begin repeatedly threatening to 'beach you off' until Margot's Barbie plants herself between them and declares: 'Come on, Kens, nobody's gonna beach anyone off.'",
        "Eventually she decides to strike out on her own and cross dimensions into the 'Real World,' screaming as her car hurtles through the air and lands on the other side.Only after arriving in the Real World however does Margot's Barbie realize that Ryan's Ken is sitting behind her in the car, having decided: 'I'm coming with ya.' Exasperated, she says: 'Did you bring your roller blades?' and gives a look of weary recognition when he holds them up and says: 'I literally go nowhere without them!' Based on the Barbie fashion dolls by Mattel from Ruth Handler, the film is the first ever live-action Barbie film to hit the big screen and features a screenplay that Greta co-wrote with her husband Noah Baumbach.The comedy is set for release on July 21 this year.  "
    ]
}