{
    "articleURL": "/femail/article-12042707/Im-dating-man-earns-TEN-TIMES-dont-care-people-say-dump-him.html",
    "content": [
        "Anonymous woman took to British forum Mumsnet to discuss her earningsREAD MORE: My husband gave me a wedding ring after 25 years - I want to leave because he didn't get down on one knee, but people say I'm overreactingA woman has divided opinion after discovering that a man she is dating earns a lot less than her - prompting some of her friends to say the relationship would never work.",
        "The anonymous mother took to British parenting forum Mumsnet, where she revealed that the wage discrepancy does not bother her, but said she has worried it could pose 'logistical issues' in the future.In her post, she wrote: 'Just started dating a man and it turns out I earn 10 times what he earns.'Now, I should start by saying that in theory, this doesn't bother me AT ALL. I come from very working class stock. 'We grew up on a council estate. Both my brothers are still living there with their families. I was just lucky to be studious and got on a good path.",
        "'I've been divorced for a decade and all the men I've dated have earned less than me and it's never really been an issue.'However, this is the first time the gap has been this big.'She added that the man 'still insists on paying for everything' when they go out, and that he is quite old fashioned, and more generous than anyone else she's dated.Her post continued: 'With the exception of the salary, we have tons in common. 'We both have three kids around the same ages, both have similar long term dreams and interests and just get on brilliantly.'A couple of my friends have insisted it could never work though. The concern is how it could work logistically in the long term. ",
        "'I have a really nice lifestyle (all self-funded) and although I'm not into designer brands or fancy restaurants, do like to travel to nice places, or to be able to enjoy some of the things a higher salary allows, like being able to jump in a taxi home rather than taking public transport, that kind of thing.'The woman said while she thinks it is 'lovely' that he insists on paying, she feels guilty, as it will put much more of a financial strain on him than on her.Concluding the post, she wrote: 'So unsure what to do. I couldn't care less how much a man earns. He's a hard worker and s great person and a great dad.",
        "'I do see that logistical issues may surface in future though and I'm not sure what to do about that.'In a later post, she added: 'He does have assets. He has a nice home actually. He's owned it for a long time.'[He has kids who are] in their teens and seem pretty happy (I haven't met them but he tells me a lot about them).'I haven't asked too much about how he manages [on his small salary] as I don't want to make him uncomfortable.'Numerous posters felt that the massive discrepancy in earnings could become an issue in the future.",
        "One wrote: 'Hmmmm… I dated someone who earned at least 50% less than me, no desire to do anything more to earn more.'He was lovely and it was nice whilst it lasted, but I quickly realised I would need to make either sacrifices and not do what I would like, or pay the lion’s share always- in terms of holidays, activities, dates etc. I wasn’t comfortable with either option and knew I would resent him for this.'How into him are you? Could you see yourself getting married and him having half if it didn’t work out?'Another agreed, writing: 'It's nice that he pays and he sound lovely but think about long term. Your planning a holiday you want to go 5** star long haul for three weeks but his budget is 3 star Europe for a week. 'What do you do? Do you subsidise him? What if he says no do you get use to sub par holidays. 'What if he says yes? Are you happy to subsidise him? 'Are you happy to pay more of household income if you move in together, it could work but more likely you will end up sacrificing in some way and will you resent that.'And a third added: 'Maybe my opinion is skewed by a lifetime of relationships with low earning, low ambition men who seemed lovely to begin with but end up thoroughly taking the p*** and wringing me dry financially. Maybe he is lovely. But just be careful op.' ",
        "However, a number of other posters felt that money isn't everything, and that if she likes the man, she should continue to see him.One wrote: 'I would, in your position. Money shouldn't dictate everything. I'd far rather take the bus with a man I love than go home alone in a taxi. 'You might have to make some adjustments and compromises but that's true in any relationship. And he'll have to learn to let you treat him.'Another added: 'Money is just money. If you like him for him that's what matters here surely?'And a third said: 'This is probably skewed by the fact I’m not a high earner, but this sounds completely bonkers to me. 'There are literally no red flags about this man, I can’t work out what the issue is. He is solvent, a homeowner, pays his way (and yours), has a great relationship with his kids and has loads in common with you and is respectful. 'Any problems are currently fictitious.' "
    ]
}