{
    "articleURL": "/sport/football/article-12047399/Micah-Richards-claims-Emmanuel-Adebayor-pulled-joining-Aston-Villa-minute-2015.html",
    "content": [
        "Micah Richards joined Aston Villa from Manchester City in June 2015He has revealed that Villa were also set to sign Emmanuel Adebayor at the timeRichards claims Adebayor was convinced not to join after a having a 'dream' Micah Richards has opened up on how close Aston Villa came to signing Emmanuel Adebayor ahead of their disastrous 2015-16 season.",
        "After falling out of favour at Manchester City, Richards arrived at Villa Park in June 2015 after the club had narrowly avoided relegation the previous month.Established stars including Fabian Delph and Christian Benteke moved on to Manchester City and Liverpool, respectively, when Richards joined, but the club were still in the market looking to bolster their squad ahead of their next campaign.Richards has revealed that one name who was due to join him at Villa was Adebayor, and the deal to looked to be done, only for the former Arsenal and Tottenham striker to decide against signing at the last minute for a bizarre reason.'We had Adebayor there as well at the training ground,' Richards told the Filthy Fellas YouTube channel as he reflected on moving to Villa eight years ago.",
        "'He was signing his shirt and everything. He came to the training ground, he took his picture in the Villa shirt.'Then he said he had a dream or something. This is real talk, I'm not lying! He said he had a dream or some sort of vision to say \"don't sign!\"'Adebayor became known for his controversial antics during his 10 years in England between 2006 and 2016, with his most memorable moment coming in 2009 when he ran the length of the pitch to celebrate in front of the Arsenal fans after scoring for City against his former club.",
        "His decision to opt out of signing for Villa may have been the right one in the end, though, given how badly their season went.",
        "The Midlands club finished rock bottom of the Premier League that year, picking up just three wins all season.Adebayor would go on to join Crystal Palace the following January, but was released by the Eagles at the end of the season.After spells in Turkey, Paraguay and his homeland of Togo, Adebayor announced his retirement from football in March with an unusual video that featured that iconic goal against Arsenal in it.Meanwhile, Richards would remain at Villa until 2019, the year they returned to the Premier League, before he called time on his career due to a long-term knee issue. "
    ]
}