{
    "articleURL": "/wires/pa/article-12051461/Tory-losses-deepen-Starmer-says-Labour-course-general-election-win.html",
    "content": [
        "Sir Keir Starmer was celebrating wins in key battlegrounds as an indication Labour is on course to win the next general election, as Rishi Sunak remained defiant despite heavy losses.",
        "The Prime Minister was under pressure as the local election results being declared on Friday showed both Labour and the Lib Dems seizing control of Tory councils across England.The Labour leader said the “fantastic” results combined with a hoped-for recovery in Scotland would give him a majority in Westminster after a national poll.",
        "With nearly three quarters of authorities having declared, the Conservatives have shed 35 local authorities and more than 600 councillors.Sir Keir’s party was projected to have won a nine-point lead over the Conservatives if all of Britain had gone to the polls, as the Tories slid backwards.Labour seized councils in Tory MPs’ seats that would be hotly contested at a general election – including in Swindon, Medway, Dover and East Staffordshire.",
        "Mr Sunak conceded the results were “disappointing”, but said he was “not detecting any massive groundswell of movement towards the Labour Party or excitement for its agenda”.But the Tories will be concerned by Labour wins in the North, South and Midlands and a resurgent Lib Dems, as the prospect of a general election in 2024 looms.Vote share analysis by the BBC put Labour on 35%, the Tories on 26% and the Lib Dems on 20%. That was the same for Labour last year, but the Conservatives had sunk from 30%.",
        "The broadcaster said the projection would make Labour by far the largest party but it would fall 14 seats of an outright majority, though voters are likely to act differently in a general election.A day of celebration for Sir Keir started with a visit to Medway, where he welcomed “fantastic results across the country” in “places we need to win”, citing victories in Plymouth, Stoke and Middlesbrough, where his party won the mayoralty.“Make no mistake, we are on course for a Labour majority at the next general election,” Sir Keir said.“We’ve changed our party. We’ve won the trust, the confidence of voters, and now we can go on to change our country. Change is possible. A better Britain is possible.”His party will run the Kent authority for the first time since 1998, with the outgoing Conservative council leader telling No 10 to “get their act together” on several fronts.Both Swindon in Wiltshire and Erewash Council in Derbyshire had been controlled by the Conservatives for 20 years until the results of Thursday’s local elections. Dover had been controlled by the Tories since 2007.",
        "North Swindon Tory MP Justin Tomlinson said the Conservatives had to take the “dreadful” results as a “wake-up call”.The Lib Dems won Windsor &amp; Maidenhead, Dacorum in Hertfordshire, Stratford-on-Avon and South Hams in Devon from the Conservatives.",
        "In central London, Mr Sunak was understood to have thanked staff for their efforts, and said the results were always going to be tough but that the state of play has improved since he took over six months ago after the leaderships of Boris Johnson and Liz Truss.The Prime Minister told broadcasters it was “hard to draw firm conclusions” from the initial results.“It’s always disappointing to lose hardworking Conservative councillors, they’re friends, they’re colleagues and I’m so grateful to them for everything they’ve done,” he said.“But in terms of the results, it’s still early. We’ve just had a quarter of the results in, but what I am going to carry on doing is delivering on the people’s priorities.”",
        "Mr Sunak cited his priorities as halving inflation, growing the economy, reducing debt, cutting NHS waiting lists and “stopping the boats”, adding: “That’s what people want us to do. That’s what I’m going to keep hard at doing.”The Prime Minister said the Tories are “making progress in key electoral battlegrounds like Peterborough, Bassetlaw, Sandwell”.The inroads for the Tories are debatable. In Sandwell, they have gained two of 24 seats, while Labour has gained four and held 18 more.In Hertsmere, where Deputy Prime Minister Oliver Dowden is MP, the Tories have lost control of the council, with 13 councillors voted out, while Labour has gained seven and the Lib Dems six.",
        "The Conservatives lost control of Welwyn Hatfield, represented in Parliament by Energy Secretary Grant Shapps, where both the Lib Dems and Labour made gains.The Tories also lost overall control in North West Leicestershire, Brentwood, East Lindsey and Hertsmere, as Labour won Blackpool.Polling expert Professor Sir John Curtice told the PA news agency the “jury is still out” on whether Labour has made progress as a party and said it is not experiencing the level of success seen ahead of Sir Tony Blair’s 1997 landslide.“Labour are going to have their biggest lead over the Conservatives in terms of votes than at any point since 2010, but it’s going to be as much to do with the Conservatives being down as much as it is Labour being up,” he said.Veterans minister and local MP Johnny Mercer said Labour gaining control of Plymouth, where the Tories had run a minority administration, was “terrible”.",
        "Stoke-on-Trent North Tory MP Jonathan Gullis told Sky News councillors have “suffered because, at the end of 2022, the Conservative Party as a brand was certainly damaged”.",
        "But Labour’s attempts to regain Hull from the Lib Dems failed, with Sir Ed Davey’s party tightening its grip on the authority, and Labour lost control of Slough to the Tories.",
        "With full results from 171 of the 230 councils where elections were held:– The Tories have lost 35 councils and suffered a net loss of 602 councillors.– Labour has gained control of 15 councils and added 395 councillors.– The Liberal Democrats have gained seven councils and 244 councillors.– The Green Party has gained 139 councillors and took overall control of its first UK authority in Mid Suffolk.Sir Ed said it has been a “groundbreaking night” for the Lib Dems.“We are exceeding all expectations. We have delivered a hammer blow to the Conservative Party in the blue wall ahead of next year’s general election,” he said.But the elections were described as a “dark day for British democracy” by campaigners opposed to the introduction of photo ID, who claimed thousands of people were denied their right to vote.The contests were the first to be held under new rules requiring voters to carry photographic ID and the elections watchdog said some people were turned away from polling stations.An Electoral Commission spokesman said: “We already know from our research that the ID requirement posed a greater challenge for some groups in society and that some people were regrettably unable to vote as a result.“It will be essential to understand the extent of this impact, and the reasons behind it, before a final view can be taken on how the policy has worked in practice and what can be learned for future elections.”"
    ]
}