{
    "articleURL": "/wires/ap/article-12049047/Biden-dispatching-aide-meet-Saudi-crown-prince.html",
    "content": [
        "WASHINGTON (AP) - President Joe Biden is dispatching one his top advisers to Saudi Arabia to meet with Crown Prince Mohammed bin Salman, the de facto leader of the oil-rich kingdom, later this week.",
        "White House national security adviser Jake Sullivan said Thursday he will travel to Saudi Arabia on Saturday for talks with Saudi officials and will also meet with his counterparts from the United Arab Emirates and India during his visit.Sullivan said he would \"discuss new areas of cooperation between New Delhi and the Gulf, as well as the United States and the rest of the region.\" India and UAE last year signed a comprehensive economic partnership aimed at improving ties between the two countries.Sullivan is expected to meet with the crown prince, who is often referred to by his initial MBS, during the visit, according to a person familiar with Sullivan's travel plans who was not authorized to publicly discuss that element of them.Sullivan spoke by phone with MBS last month amid signs that the Saudis and Iran-allied Houthis in Yemen are making remarkable progress toward finding a permanent end to their nine-year conflict.He said the Yemen war will be a \"significant topic of conversation\" during his upcoming Saudi visit.Sullivan's planned visit is the latest sign of warming relations between the kingdom and the Biden administration that have been strained by Biden´s criticism of Saudi Arabia's human rights record and oil policies.Last October, after the OPEC+ alliance cut oil production, Biden said there would be consequences for the kingdom, which is a leading member. The administration saw the oil production cut - which boosted oil prices - as softening the financial blow on another OPEC+ member, Russia, caused by U.S. and Western sanctions imposed on Moscow for its war in Ukraine.",
        "Sullivan spoke of his plans during wide-ranging remarks on the Biden administration´s Middle East policy at an event hosted by the Washington Institute for Near East Policy."
    ]
}