{
    "articleURL": "/wires/reuters/article-12043237/Cantlay-did-not-speak-Woods-hiring-caddie-LaCava.html",
    "content": [
        "May 3 (Reuters) - World number four Patrick Cantlay said on Wednesday that he did not speak to Tiger Woods before hiring the 15-time major champion's longtime caddie Joe LaCava.",
        "In need of a change, Cantlay recently split with caddie Matt Minister and tried his luck with LaCava given Woods is sidelined for the foreseeable future after having ankle fusion surgery two weeks ago.\"I reached out to Joe, he said it was possible and ended up working out and I'm really happy about it,\" Cantlay said ahead of this week's Wells Fargo Championship in Charlotte, North Carolina where LaCava will be on his bag.\"I haven't spoken to Tiger,\" he added.The duo worked together at a tournament in August 2021 when LaCava filled in while Minister was out with COVID-19 and Woods was still recovering from a near-career-ending car accident in February of that year.LaCava served as Woods' caddie since 2011, and enjoyed 12 triumphs with him.Their most notable win came at the 2019 Masters where a 43-year-old Woods, after years of surgeries and personal problems that convinced many that the best golfer of his generation was done, won his first major championship since the 2008 U.S. Open.\"He's just a steady hand on the steering wheel. I know he's been in every moment a caddie could be in and he's just a good guy,\" said Cantlay. \"So I've enjoyed the limited time that I've spent with him and feel confident that we'll be a good team out there.\"",
        "Cantlay, who has six top-10s in 11 PGA Tour starts this season, had worked with Minister since 2017 and were together for all of his eight career wins on the U.S-based circuit.\"We accomplished a lot together and I'm really proud of all we accomplished,\" said Cantlay. \"He's a great friend of mine and we had a lot of good finishes together and a lot of wins. So I'm incredibly grateful to him, just needed a change.\" (Reporting by Frank Pingue in Toronto Editing by Toby Davis)"
    ]
}