{
    "articleURL": "/tvshowbiz/article-12042383/Wicked-Cynthia-Erivo-seen-time-character-Elphaba.html",
    "content": [
        "Cynthia Erivo has been pictured on the set of the Wicked adaptation for the first time since filming began on the hotly-anticipated movie.",
        "The actress, 36, who plays the film's main character Elphaba, was easily recognisable due to her painted green skin, which was reminiscent of the iconic witch.Filming took place over the weekend on Hankley Common in Surrey and will become the backdrop for Munchkin Country.Munchkin Country is the fictional eastern region of the Land of Oz and home to the famous Yellow Brick Road, which members of the crew were seen building.While they laid the yellow bricks, Cynthia and her body double were pictured filming a flight seen where the character flies through the air.",
        "Cynthia, 36, was wearing a tall black witches hat teamed with long robes and a leather trench coat, while her long wig cascaded down he back.At one stage she could be seen wielding a broomstick, which was likely being used for the scene where she flies through the air.Cynthia or her body double were then strapped into a harness and suspended from two supportive ropes in order to safely shoot the scene.The role of Elphaba was originated by Idina Menzel in the 2003 Broadway production, while Tony winning actress Carole Shelley played Madame Morrible.It also starred Kristin Chenoweth in Ariana's role of Galinda/Glinda.Excitement on the movie has been building after it was revealed that early scenes were shown at CinemaCon in Las Vegas, wowing audiences - however, it is not scheduled to be released until November next year.",
        "The film is based on Gregory Maguire's best selling novel and the hit Broadway musical adaptation, which debuted in 2003.It is a prequel to the The Wizard of Oz in which the storyline proceeds Dorothy and details the one-time friendship between the Elphaba and Glinda characters. ",
        "It also stars Jonathan Bailey as Fiyero, as well as Bowen Yang, Adam James, Keala Settle and Bronwyn James.Wicked, which is being adapted into a two-part series, has kept details of its shoot under wraps.Wicked Part 1 was originally set for a Christmas Day, 2024 release but it has been moved up to November 27, 2024, with the second installment set to arrive December 25, 2025.Last month, Jeff Goldblum let it slip that he had been cast in the film while appearing on Jimmy Kimmel Live.'I was just on the set of Wicked. I'm not supposed to talk about that. But it's been out and about,' he said. 'You should see our witches, Cynthia Erivo and Ariana Grande, very good.'Recently, the stars of the film, Ariana and Cynthia, posted first look images from their upcoming movie.",
        "Ariana posted an image of her character, the good witch Glinda, donning a pink gown while making her way up a long staircase.",
        "Cynthia, 36, shared a shot of her character, wicked witch Elphaba pictured with her hat and broom.The film's director Jon M. Chu posted both of shots with the caption, 'You weren't told the whole story. What happens when you veer off the Yellow Brick Road? FIRST LOOK of the #WickedMovie … currently in production in Oz.'Cynthia responded in the comments, 'It’s been wonderful making magic with you.'Chu also took to Twitter to praise his leading ladies and their performances in the upcoming movie.'I’ve already been changed for good by these two women… #CynthiaErivo &amp; #ArianaGrande as the Witches of Oz,' he said. 'They will lift ur spirits, break ur heart and leave you speechless with their voices. So excited to introduce you into our world… SO much more to come…'",
        "Meanwhile, original Broadway star Kristin has said she is 'so proud' of Ariana for taking on her role of Glinda.The actress revealed the 29-year-old pop star was 'really scared' at the idea of taking on the role in the upcoming two-part movie adaptation.Speaking on The Kelly Clarkson Show, she said this week: 'She didn't call me for advice but she was really nervous. She said she wanted to pay homage to me but said 'I'm really scared, I wanna make you proud'. Well, she's already made me proud. Done. Check.\"",
        "The former Pushing Daisies actress - who has known Ariana since she met her backstage at Wicked as a young fan almost 20 years ago - urged the Thank U, Next hitmaker to make the role her own and recalled their shared excitement when the singer called her to tell her she'd got the part.She added: 'I said 'What I want to encourage you do, Ariana, is make Glinda your Glinda. I want you to do you.' I've known her since I was 10, and now I see the full circle.'She called me [crying] like 'I got it!' I went 'Oh my God, what?!' We sounded like dogs! But I'm so proud of her. 'Ariana regularly calls Kristin about her ideas for her character and the 'West Wing' star \"can't wait\" to see her on the big screen.She said: '[Ariana] calls me and says 'This is what I got to do, what do you think?' I can't wait to see her do it. I can't wait. She just said 'Kristin, I'm gonna be freaking out on the night of the premiere''So I said 'Stop, you're gonna be great!'\""
    ]
}