{
    "articleURL": "/sport/football/article-12052791/Jurgen-Klopp-admits-willing-switch-transfer-targets-clubs-inflate-prices.html",
    "content": [
        "Liverpool missed out on Jude Bellingham but are set to sign other targetsMason Mount and Alexis Mac Allister are among those on the Reds' wanted listKlopp insisted Liverpool won't overpay for players in the transfer market Liverpool are primed for a summer of significant change. Roberto Firmino, Alex Oxlade-Chamberlain, Naby Keita, James Milner and veteran goalkeeper Adrian are all out of contract and Klopp is determined to bring in a raft of new faces.",
        "Having pulled out of the race to sign Real Madrid-bound Jude Bellingham, Klopp was determined that Liverpool would maximise their ability to invest and they have formulated plans to get the targets they need on board as quickly as possible.Chelsea's Mason Mount is a prime target. The England international is held in high regard within Anfield and he would be keen to work under Klopp, given his style and character fit in in perfectly with how the Liverpool manager sees the game.Alexis Mac Allister, Brighton's Argentine World Cup winner, figures prominently on the wanted list along with Ryan Gravenberch of Bayern Munich - though the Germans are reluctant to let him leave - and Matheus Nunes from Wolves, in whom Liverpool's interest goes back 12 months.None of this will come cheap and it begs the question whether selling clubs will put a 'tax' on for Liverpool, knowing how desperate they are to sign midfielders. Klopp, though, is unperturbed and will have no issue switching targets if a premium is put on to a price when they come calling.",
        "Asked what would happen if transfer fees are inflated for LIverpool, Klopp replied: 'We cannot buy the player then. If they are overpriced we cannot do it. We will bring in players. I am pretty sure we will bring in the players we want and those who will help us. I am pretty confident of that.",
        "'You never know 100 per cent until they are signed, but that is not new that some clubs might try (to inflate prices). Let me say it like this: you identify a position and you have not only one option on the position. That means they should all be good, to be honest really good, you might have a favourite.'But if the other club doesn't want to sell or someone else will pay the price that we cannot go with it, but usually we got the players we wanted. ",
        "'The one thing is can we afford them and then they are here. I don't think too much about that to be honest.' Liverpool's recent revival has seen them reel off five straight wins but Klopp is not convinced that four more victories will carry his side into the Champions League places - he expects Manchester United and Newcastle United to get the points they require.But he does see a long-term benefit to this good run of form and believes it will show potential targets that Liverpool can recover to compete for the top prizes next year. In an ideal world, he would like the bulk of business done before the squad return on July 8.'These five games I like the reaction in moments,' said Klopp. 'It is not full games and I am thinking we couldn't have played better, but the signs I saw are really promising and I am happy with that. Another four games, a break then a proper pre-season and we will be strong.'"
    ]
}