{
    "articleURL": "/wires/ap/article-12060145/Simulation-suggests-2020-census-missed-fifth-noncitizens.html",
    "content": [
        "New results from a U.S. Census Bureau simulation indicate a significant number of noncitizens were missed in the 2020 census, a national head count during which the Trump administration tried to prevent people in the United States illegally from being tallied at all.",
        "Some civil rights groups pointed to the bureau's latest findings as evidence that, despite the Trump administration's failure to exclude residents in the country illegally from the 2020 count altogether, the former president's push contributed to an undercount for some racial and ethnic minorities.A simulated head count by the statistical agency utilized 31 types of administrative records from government agencies and third-party sources to produce estimates of the U.S. population on April 1, 2020 that could be compared to the survey-like responses used in the last official tally of every U.S. resident. The simulation was an experiment which doesn't change the results of the once-a-decade count of every U.S. resident that helps determine political power and the distribution of $1.5 trillion in federal funding in the U.S.Almost a fifth of noncitizens found in the administrative records had addresses that couldn´t be matched in the 2020 census, suggesting that \"a significant fraction of noncitizens\" were missed, according to the U.S. Census Bureau report released Friday. By comparison, that same figure was 5.4% for citizens.Using administrative records from government agencies that have records on immigration, welfare programs, motor vehicle registrations and other data, the test tallied 2.3% more people than in the actual census in 2020 that produced a head count of 331 million U.S. residents, primarily because the simulation captured more noncitizens residing in the U.S., the report said.",
        "The simulation was a test to see how good a job administrative records perform in counting historically undercounted groups like racial and ethnic minorities, renters and young children. Its results actually bumped up the numbers for Hispanic and Black residents, two groups who were undercounted in the 2020 census, respectively, by 8.3 million people and 2.8 million people, the report said.",
        "The administrative records census produced estimates of 11.6 million people in the U.S. with an unknown legal status.Opponents have said Trump administration policies in 2019 and 2020 created a chilling effect which likely deterred immigrants, Hispanics and others from participating in the 2020 census.In 2019, the Trump administration attempted to add a citizenship question to the 2020 census questionnaire, but the U.S. Supreme Court blocked it. In the middle of the 2020 census, President Donald Trump directed the Census Bureau to exclude people in the country illegally from numbers used for divvying up congressional seats among the states. An influential GOP adviser had advocated excluding them from the apportionment process in order to favor Republicans and non-Hispanic whites. Trump's memo was rescinded when President Joe Biden arrived at the White House in January 2021, before the census figures were released.The Black population in the 2020 census had a net undercount of 3.3%. The undercount was almost 5% for Hispanics, 5.6% for American Indians and Native Alaskans living on reservations and 0.84% for children under age 18. Those undercounts were higher than in the 2010 census, though only the Hispanic count and tally of children had statistically significant differences from 2010 to 2020.",
        "\"The Census Bureau simulation strongly indicates that Donald Trump´s attempt at a race-motivated manipulation of the decennial census, despite being largely blocked in court, had a significant impact on noncitizen participation, which also may explain, in significant part, the substantial Latino undercount in 2020,\" said Thomas Saenz, president and general counsel of the Mexican American Legal Defense and Educational Fund.Saenz added that the simulation points to the need to study and confront the reputational harm to the Census Bureau in the Hispanic community due to the \"manipulation\" by the Trump administration.\"Failure to do so now risks long-term and serious damage to future Census data-collection efforts,\" he said.Using administrative records produced lower population estimates in rural areas, mainly because of the more common use of post office boxes and rural route addresses rather than physical addresses, according to the simulation results. Counts from administrative records also were lower than the 2020 census figures for people between ages 65 and 74, Asians and people who identified as being two or more races. Among the reasons is that these populations were more likely to be double counted in the 2020 census.Along with noncitizens, Blacks and Hispanics, the administrative records produced higher counts for males, working-age adults, children under age 15 and non-Hispanic whites.",
        "At the state level, Minnesota and several other Midwestern states had the highest match rates between a person identified in an administrative record and a 2020 census record, while Hawaii had the lowest. Minnesota also had the highest rate of residents who answered the census questionnaire on their own without needing prompting from a census taker visiting their home.___Follow Mike Schneider on Twitter at @MikeSchneiderAP"
    ]
}