{
    "articleURL": "/wires/reuters/article-12052457/Revolution-unbeaten-run-against-Toronto-FC.html",
    "content": [
        "The New England Revolution look to extend their unbeaten streak to eight games when they visit Toronto FC on Saturday.",
        "The Revolution (6-1-3, 21 points), who are tied atop the Eastern Conference with FC Cincinnati, are 4-0-3 since March 18. They have conceded one goal or fewer in each game in that span, including a pair of shutouts and have allowed just nine goals against through the first 10 games, seventh fewest in the league.Four of those nine goals allowed came in their lone loss of the season, a 4-0 defeat to Los Angeles FC on March 12, bust before the unbeaten run began.Already without several players due to injury, New England will be without promising midfielder Dylan Borrerro for the rest of the season after the 21-year-old sustained a torn ACL against FC Cincinnati last week.Despite the injuries, players have stepped up, notably veteran midfielder Emmanuel Boateng, who has started each of the past two games after being a substitute for the first eight.\"He's performed each game so far,\" Revs midfielder Matt Polster said of Boateng. \"He was probably our best player in the first half, maybe in the entire game, against Cincy. ... I think it's going to take everybody, especially now dropping more players, so we just need to focus and go now on the road and find ways to get points.\"Toronto (2-2-6, 12 points) will be looking to build off a 1-0 win against New York City FC last Saturday. The victory was its first since defeating Inter Miami 2-0 on March 18.",
        "Newly acquired forward C.J. Sapong made a good first impression with his new club, scoring the lone tally against NYCFC. He lined up between Lorenzo Insigne and Federico Bernardeschi in his club debut.\"They're always threats, guys that you know at any moment can make something happen,\" Sapong said. \"It's motivation and inspiration to want to be in positions to allow their quality to show. It's going to help me out and it's going to help the team out.\"Toronto has lost just once to the Revolution over their past nine matchups, going 4-1-4 in that stretch. New England's lone win in that run came on Aug. 14, 2021 at Toronto.--Field Level Media"
    ]
}