{
    "articleURL": "/tvshowbiz/article-12055551/MAFS-Elizabeth-Sobinoff-confirms-rumours-shes-expecting-child.html",
    "content": [
        "Married At First Sight's Elizabeth Sobinoff has confirmed rumours she's expecting to welcome her first child with husband Alexander Vega.",
        "The TV star announced the exciting news with a cryptic post shared to her Instagram on Sunday.'Looking at some of these comments in the last few posts I've done. Always so much focus on a woman's body (I've had more than my fair share). I'm navigating my body right now, so many changes, especially internally (I've been pretty sick),' she began.'I also understand so many people are excited. So am I!!!! It's an exciting time in our (my partner) lives right now.'She continued: 'I'll talk about my experience with it in the future. Mama bear is just nesting right now.'",
        "Many of her celebrity friends and fans congratulated her on the exciting news.'Ohhhh my goodness!!! YAY!!! Congratulations my beautiful friend… such fabulous news! You are going to be a wonderful mother xx,' MAFS' Sarah Roza wrote.'Congratulations sending you all blessings,' Jackie Gillies commented.'The most cryptic pregnancy announcement ever!. Congratulations! Our bodies are miraculous, hope you start to feel less sick soon,' another person said.One person commented: 'Biggest Congratulations to you Liz. You're going to be the most incredible mother.'",
        "Lizzie sparked pregnancy rumours earlier this month after she posted a photo of herself wearing an oversized cardigan.Many speculated the TV star was pregnant as she positioned her hands across her midsection.",
        "The makeup artist also posted a picture of herself holding a box of coconut-flavoured Raffaello chocolates and a bouquet of colourful flowers, which many believed were congratulatory gifts.It comes after Lizzie recently married her longtime boyfriend Alexander Vega.  The reality TV star and her engineer fiancé walked down the aisle in front of family and friends in January.She looked stunning in an abstract wedding dress with gold sequin detailing and a dramatic collar as well as sheer panels.",
        "Lizzie wrote in one caption on Instagram: 'Best. Day. Of. My. Life.' while adding in another, 'Some moments from the happiest day of my life'.Lizzie, who has been dating Alexander since late 2021, kept her beau's identity secret for months - eventually revealing it at Easter last year.In November, Lizzie sent fans into a frenzy when she shared a black-and-white photo on Instagram of herself locking lips with a mystery man.Daily Mail Australia later revealed the man in the photo was Vega, a field service engineer based in Sydney.",
        "'As a whole, I'm incredibly private, I did reality TV a lifetime ago. I'm so protective over my partner and there are so many negative, gossiping people out there, that go out of their way to talk trash,' she wrote on Instagram at the time.",
        "Lizzie rose to fame when she 'married' Sam Ball on Married At First Sight in 2019.  The army recruit was public enemy No. 1 during MAFS' sixth season when he body-shamed his 'wife' on their wedding day. Lizzie returned for another go and 'married' Seb Guilhaus on MAFS in 2020 and they dated for a year before splitting."
    ]
}