{
    "articleURL": "/news/article-12042565/Sainsburys-shoppers-outraged-barriers-force-scan-receipts-leave.html",
    "content": [
        "Sainsbury's shoppers were outraged by the supermarket's new security barriers Has receipt scanning appeared local to you? E-mail louis.goss@mailonline.co.ukSainsbury's shoppers have reacted with outrage after the supermarket giant expanded its installation of new security gates in stores that force customers to scan their receipts in order to leave.",
        "MailOnline revealed the rising anger this morning as Twitter users hit out at the new system, that they say leaves them feeling like common shoplifters. The barriers block customers from exiting Sainsbury's stores until they scan their receipts, while customers must ask security to let them out if leaving the supermarket empty-handed. Many more shoppers have since contacted MailOnline to express their outrage at Sainsbury's barriers and air their concerns about the inconveniences they cause.They include shoppers who said they were made to feel like criminals after being prevented from leaving Sainsbury's stores, and others who said the supermarket had failed to consider young families and disabled people.  ",
        "The first howls of outrage were heard in December when shoppers first noticed the new barriers in place. But now more are voicing their anger online as the system is rolled out to more branches across the country, including in Balham in South London and Winnersh in Berkshire. Shoppers told MailOnline the security gates have been installed in Sainsbury's supermarkets across the country, in towns and cities including Glasgow, Redhill, and Northampton. ",
        "E-mail louis.goss@mailonline.co.uk ",
        "Lesley Pinchbeck, from Enfield, said she 'felt like a criminal' after her self-service checkout till ran out of paper. She said the experience was 'doubly disconcerting' as she is 'over 70 and also registered disabled due to profound deafness'.",
        "'I had no idea what the security guard was shouting at me from the other end of the checkouts or why.'In the end he just released the barrier and let me go. It was a while before I had the confidence to return,' Ms Pinchbeck said.Glasgow shopper Peter Richards said the barriers are a 'pain when you have three young kids and a buggy with you' as he suggested the supermarket is now treating its customers as 'guilty until proven innocent.'Lisa Penney, from Biggleswade in Bedfordshire, said she became separated from her daughter due to the barriers, after the young girl followed another customer out before being blocked by the gates from returning. 'My daughter was with me and wanted to go play on the ride on car in the corner of the back wall,' Ms Penney said. 'She walked out with someone else during a gap but wasn't able to get back through to me and she got upset.'Biggleswade councilor Jonathan Woodhead told MailOnline he thought many residents of the Bedfordshire town 'feel annoyed at the lack of innocent until proven guilty implicit in this.'",
        "The barriers have also been deployed in other major shops and supermarkets, including Aldi, Morrisons, and Primark.They first started appearing in British shops at the end of last year, having previously bee installed in shops in Europe. ",
        "A Swedish shopper contacted MailOnline to say the barriers had been installed in his local supermarket in the northern city of Umeå, which is located around 600km north of Stockholm and has a population of just 130,000 people.  Shoppers also hit out at the supermarket giant over claims the gates have slowed down their shopping trips, as they complained about struggling to find and scan their receipts to exit. Christine Hanley, from Enfield, said: 'Half the time it doesn't work so the self service area gets congested until people are let out.''They haven't thought about disabled people either. I have to hold my stick in one hand, shopping bag in the other, plus my receipt and somehow try and scan to go out,' Ms Hanley added. Sainsbury's customers also took to the internet in expressing their opposition to the supermarket's new barriers, as they claimed the gates put 'all of us under suspicion of stealing'.  ",
        "A Sainsbury's spokesperson told MailOnline the gates are used in a 'small number' of its store's 'self service checkout areas' The supermarket, however, refused to give over information as to the total number of gates it has installed across the country. The Sainsbury's spokesperson noted the exit barriers form part of a 'range of security measures.' ",
        "In response to MailOnline's inquiries about the possible inconveniences caused to families and disabled people, the supermarket spokesperson said: 'We have dedicated colleague support for customers who need assistance.' Sainsbury's decision to install the exit barriers comes as shoplifting has surged over the previous year in the face of Britain's cost-of-living crisis. Shoplifting increased by 22 per cent in the year ending in September 2022, figures from the Office for National Statistics show. UK food costs also soared at their fastest rates since 1977, over the past 12 months, as record inflation pushed up prices. This saw cucumber prices jump 52%, olive oil prices surge 49%, and cheese costs increase by 44% in a single year.  Customer theft in turn cost UK retailers £953 million in the year running from 1 April 2021 to 31 March 2022, data from the British Retail Consortium show. Shop owners responded by spending £722 million on tackling customer theft over the same period of time, the figures from the BRC's 2023 Crime Survey show. Has receipt scanning appeared local to you? E-mail louis.goss@mailonline.co.uk"
    ]
}