{
    "articleURL": "/wires/afp/article-12040315/Number-child-marriages-falling-slowly-UNICEF.html",
    "content": [
        "Child marriages are declining -- but at a rate that would not eliminate the practice for another 300 years, while a perfect storm of crises could yet reverse the trend, the United Nations childrens' agency said Tuesday.",
        "\"We definitely have made progress in the abandonment of the practice of child marriage, particularly in the last 10 years. Unfortunately, this progress was not enough,\" Claudia Cappa, lead author of the UNICEF report published Tuesday, told AFP.According to UNICEF estimates, 640 million girls and women today were married when they were under 18. At present, an estimated 12 million girls are becoming child brides each year.But over the past 25 years the rate at which such marriages take place has been slowing: in 1997, 25 percent of young women aged 20-24 were married before 18. By 2012 that figure had dropped to 23 percent, and by 2022 it was at 19 percent.Still, that means some nine million girls are expected to be married off in 2030, the report said.\"At current pace, we might have to wait 300 years to eliminate child marriage,\" Cappa warned, adding that the majority of these marriages involve girls aged 12 to 17.And even that fragile progress is under threat -- UNICEF also fears that the convergence of the Covid-19 pandemic, global conflicts and the growing impacts of climate change could reverse the hard-won gains.Covid-19 alone could be responsible for an additional 10 million underage marriages between 2020 and 2030, it said.",
        "\"The world is engulfed by crises on top of crises that are crushing the hopes and dreams of vulnerable children, especially girls who should be students, not brides,\" said UNICEF boss Catherine Russell in a statement.Such crises can see families feel forced to marry children off as a means of security.\"Although child marriage is a clear violation of children's rights, it is often seen by families as a 'protective' measure for girls, providing financial, social or even physical protection,\" the report notes.It is also a way to have one less mouth to feed.Geographically, South Asia is the driving force behind the decline in girls' marriages.However, the region still accounts for about 45 percent of the 640 million women today who were married as children. India alone accounts for a third.UNICEF is particularly concerned about the situation in sub-Saharan Africa, which appears to be bucking the trend.\"Girls there now experience the highest risk of child marriage in the world, with one in three marrying before age 18,\" the report said.It expects the number of child brides there to increase by 10 percent by 2030."
    ]
}