{
    "articleURL": "/tvshowbiz/article-12054465/Jai-Courtney-says-live-tattoo-Suicide-Squad-star-Margot-Robbie-gave-him.html",
    "content": [
        "Jai Courtney has a permanent remined of his time working with Margot Robbie on the set of Suicide Squad. ",
        "The Australian actor had the letters 'QLD' for the state of Queensland inked on his arm after losing a bet during filming. And the 37-year-old admitted to this week's issue of Stellar Magazine that it's not his most beloved memento. 'I was very lucky to have someone as friendly and talented as Margot put one on me. I've got to say, though, it's not my favourite tattoo' Jai said. 'It was the result of [losing] a bet and says 'QLD' for Queensland [where Margot grew up], and I'm a proud New South Welshman. ",
        "'It was all to do with the State of Origin [football tournament] not going my way, and now I have to live with that.'Jai added that several stars working on the 2016 film tattooed each other as a reminder of their time together.    Margot previously told Network Ten's The Project that the two Australian actors made a wager on the result of the annual rugby league competition.The proud Gold Coast girl explained: 'Jai and I had a bet that if Queensland won he'd have to get 'Queensland' tattooed on him, and if New South Wales won I'd have to get 'NSW' tattooed on me.'After journalist Carrie Bickmore asked if Jai followed up his promise, Margot replied: 'Queensland won. He's got a Queensland tattoo on his arm.' ",
        "Margot revealed the pair were getting everyone on set involved, explaining the rules of the game in between takes in one of the bar scenes.The Hollywood darling said she and Jai were marking out the field and rules on the back of a pizza box to bring their American and English co-stars - including Will Smith and Cara Delevingne - up to speed. Jai, who plays Captain Boomerang in the super-villain movie did post to Instagram r to reveal another tattoo he got during the shoot.It read 'SKWAD' across his forearm, which was something many of the cast were tattooing on each other as a memento from the film.",
        "Margot's character, Harley Quinn, owns a tattoo parlour, so the actress stayed in character during breaks on-set and practised her tattoo gun skills on her castmates.The former Neighbours star even etched the design onto the film's director David Ayer's arm, with a snap of the moment shared on Instagram by her co-star Joel Kinnaman. Joel, who plays Rick Flagg in the film, shared a photo of himself sporting the same design, with co-star Will Smith by his side, having actually done the honours of applying the ink. 'Got my #skwad tattoo:) Will has many many talents, tattooing is not one of them. It was like watching a drunk baby fly a helicopter,' Joel captioned the photo."
    ]
}