{
    "articleURL": "/tvshowbiz/article-12056143/Matty-Healy-watches-Taylor-Swift-perform-Eras-Tour-Nashville.html",
    "content": [
        "Taylor Swift's girl squad pals Gigi Hadid and Lily Aldridge seemingly approve of her rumoured boyfriend Matty Healy. ",
        "The 1975 singer, 34, joined Gigi, 28, and Lily, 37, to watch Taylor, 33, storm the stage on Saturday night as her Eras Tour hit Nashville. And it seemed Matty has made a great impression on the models, with Gigi pictured throwing her arms around him in a warm embrace while they watched the Love Story hitmaker perform. Getting Taylor's inner circle on his side is a huge achievement for Matty, as members of her loyal squad have reportedly unfollowed her now-ex Joe Alwyn after their shock split.During the gig, Matty could be seen holding his heart as he sang along with her friends in a celebrity-filled VIP booth after taking to the stage. ",
        "Earlier in the night, he arrived on stage to perform with Phoebe Bridgers. The songster donned a black and white skeleton ensemble while showcasing his guitar-playing skills in a video shared on Twitter. In the short clip, the venue was nearly filled to capacity with the sun just starting to set, as the British-born star performed for the excited crowd moments before his rumored girlfriend, 33, stepped onto the stage to officially kick off her concert. In a separate reel uploaded on the social media outlet, Phoebe shared a quick kiss with Healy amid the performance.Only last month, Taylor's inner circle - including her brother Austin, Gigi and the Haim sisters - reportedly unfollowed her now-ex Joe.",
        "Many Swifties — her loyal and eagle-eyed fans — claimed that some of the songwriter's besties reportedly broke ties on Instagram just shortly after being spotted hanging out with the star and perhaps learning what really happened.The bold moves on social media appeared to suggest that there may be more to the breakup than the public is aware of.Just after catching up over dinner with longtime friends Blake Lively and her husband Ryan Reynolds, for instance, the Deadpool actor allegedly immediately unfollowed Alwyn.The obvious snub was a shocking move considering Ryan had previously gushed about the British actor and their six-year-long friendship in a TIME100 Next article published in September 2022. (His wife does not currently follow Alwyn.)",
        "The multi-Grammy winner's younger brother, Austin Swift, unfollowed Joe. The Conversations With Friends star still follows him.A few others who were quick to click unfollow were some of Taylor's gal pals after they were spotted hanging out in New York City on Thursday.Before dating rumors emerged around Swift and The 1975 singer, Taylor had dated British actor, Joe Alwyn, for six years until their split was confirmed last month in April.Shortly after being spending time with the Midnights singer, supermodel Gigi as well as the three Haim sisters reportedly all unfollowed The Favourite star.",
        "It is hard to confirm if they ever followed Joe in the first place, but Taylor's observant and perceptive fans shared screenshots of the Victoria's Secret Angel's following list less than 24 hours later.Reports also show that the three sisters making up the rock band HAIM — Alana, Danielle, and Este — allegedly all followed suit.Joe still follows Alana and Danielle, but it is unclear if he and Este ever followed each other initially.The three sisters reportedly even unfollowed Joe on their official HAIM band account.Supermodels and Victoria's Secret Angels Martha Hunt and Lily unfollowed him too.Matty's appearance on stage during Taylor's Eras Tour comes shortly after The Sun reported earlier Thursday that the rumored couple had plans to confirm the romance over the weekend during her Nashville stop. ",
        "According to the outlet, Healy is slated to perform two of her popular songs, with a source stating, 'Taylor and Matty have been planning their ‘coming out’ for a few weeks now, and are really excited just to go public with their love.'The insider further revealed, 'Neither of them want any secrets, or to hide away. The plan is for Matty to walk out on stage mid-show and play two songs.''They will chat to the audience and, at present, the idea is for them to confirm their romance with some kind of PDA — public display of affection. It won’t be anything remotely cheesy though.'",
        "And on Saturday, Matty strummed on his guitar as he made an appearance with Taylor's supporting act during the show. Whether he will hop onto the stage once again to perform with the Blank Space hitmaker has yet to seen. Taylor and Matty's rumored romance first came to light earlier this week on Wednesday, with a separate source telling The Sun, 'She and Matty are madly in love.''It’s super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out,' the insider added.In regards to her ex, the source informed the publication, 'Taylor and Joe actually split up back in February, so there was absolutely no crossover.''Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of Face-Timing and texting but she cannot wait to see him again,' and added that the two stars, 'are incredibly supportive of their respective careers.'",
        "'They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.'While Taylor focuses on her Eras Tour, which is slated to conclude later this year in August, Matty is also in the middle of touring with his band, The 1975.",
        "Before making a surprise appearance to join the opening act, the Robbers musician was seen making a quick Starbucks run after reportedly spending time at Taylor's Nashville condo earlier Friday night.As the British-born singer exited the popular coffee shop chain on Saturday, he carried a warm drink in his hand while also looking through his smartphone as he was led by a security guard to a sleek, white SUV parked near the coffee shop.After grabbing a drink to get a boost of energy, Healy was later seen arriving at Nissan Stadium in the heart of Nashville ahead of Taylor's Saturday night performance in the city.Earlier on Friday, he was seen dancing along to Swift as she sang her hit track, Shake It Off, amongst fellow concert-goers in a secured area on the floor section of the venue.The video was posted on Twitter and quickly went viral amid rumors that Matty and Taylor have started a budding romance. Despite the speculation that the two have entered a relationship, both singers have yet to publicly confirm they are dating.Fans also were sent into a frenzy when the Karma songstress appeared to relay a message in code to her rumored boyfriend as he watched her concert from the audience in footage uploaded onto social media. ",
        "At one point, she mouthed the words, 'This is about you, you know who you are. I love you' which is what Matty had also said amid his concert earlier this month on May 3 in the Philippines. Before night two of Taylor's Nashville stop, devoted fans of the Grammy winner were seen arriving to Nissan Stadium just hours before the concert commenced. Near the outdoor stadium that is located in the heart of the bustling city, concert goers were seen dressed up for the event and also took a few photos near a large sign that read 'TSWIFT.' Nissan Stadium notably has a capacity of nearly 70,000, and the singer-songwriter has been performing for sold-out crowds. She is slated to perform in Nashville through Sunday May 7, with her tour coming to an end later this year in August in Los Angeles. During night one of the festivities on Friday, Taylor made a surprise announcement that her Speak Now (Taylor's Version) album will be released later on July 7, per Variety.  "
    ]
}