{
    "articleURL": "/wires/pa/article-12059057/Jorginho-proud-fight-Arsenal-showed-win-Newcastle.html",
    "content": [
        "Arsenal midfielder Jorginho has praised his team-mates for mixing it with Newcastle to keep their Premier League title hopes alive.",
        "The Gunners blended a streetwise tenacity with moments of quality to secure a 2-0 victory which avenged a damaging defeat by the same score at St James’ Park last season.In the process they dragged themselves back to within a point of leaders Manchester City and while Pep Guardiola’s side have a game in hand, the Gunners came through unscathed from what appeared to be their toughest remaining fixture.",
        "Jorginho told the club’s official website: “It’s a massive win. We knew it was a tough game, to come here and win the way we did.“There are some times you know you have to fight a lot to get the three points, and I’m just so proud of the team the way we did, the way we fought until the end, the way we pushed. It’s just so nice.“We knew it was going to be tough and it was just realising that sometimes you can’t play just beautiful football.“Sometimes you need to adapt and that’s why I am saying that I’m really proud of the team, because when you realise that and you adapt and you do what maybe everyone doesn’t expect you to do, it’s just really, really good for our team.”Having been frustrated by Newcastle’s game-management in the reverse fixture, a 0-0 draw at the Emirates Stadium in January, Arsenal arrived in the north-east determined to serve up a dose of their own medicine to Eddie Howe’s men.",
        "They were fortunate to emerge unscathed from a testing start during which Jacob Murphy hit a post and the Magpies saw a penalty for handball awarded and then rescinded by referee Chris Kavanagh after Bruno Guimaraes’ goal-bound shot had been blocked by Jakub Kiwior.However, the Gunners took a 14th-minute lead through the excellent Martin Odegaard before they withstood an onslaught during which goalkeeper Aaron Ramsdale and the woodwork kept the home side at bay.And they cemented the win 19 minutes from time when Gabriel Martinelli’s driven cross flew off Fabian Schar into his own net.",
        "“And when you had the emotions that we had last year in that dressing room, you have to make sure you feel them again to realise how difficult, how nasty and how unpleasant they are.“Then you have to find a way to approach the game in a different way because demands were going to be different from last year. The boys did that extremely well so I’m really proud of them.” It can be a really memorable season for us.  Newcastle head coach Eddie Howe  For Newcastle boss Howe, who had seen his Champions League-chasing side win eight of their previous nine games to sit third in the table, the task is to re-group for a testing trip to struggling Leeds on Saturday with Liverpool closing fast.",
        "Howe said: “It can be a really memorable season for us. It’s in our hands. If anyone had said at the start of the season we could be in this position, you would definitely have wanted to be in our position.“But getting over the line will probably be the hardest thing we have to do. That’s the challenge in front of us.”"
    ]
}