{
    "articleURL": "/money/bills/article-12038029/HMRC-says-offer-critical-services-staff-strike.html",
    "content": [
        "Customer services advisers will walk out on 10 May for three daysUnion predicts walkouts will cause 'significant problems'Further walkouts planned throughout May and start of June HMRC has claimed it has 'robust plans' in place to mitigate any disruption caused by hundreds of its staff going on strike from next week.",
        "The Public and Commercial Services (PCS) Union last week confirmed 432 HMRC workers will go on strike for 18 days in May and June amid a campaign over pay, pensions, job security and redundancy terms.The union said members working as customer service advisers in Glasgow and Newcastle-upon-Tyne will walk out on 10 May for three days. They will also walk out between 15 and 19 May, 22 and 26 May and 29 and 31 May, as well as 1 and 2 June.",
        "It comes just days after 133,000 civil servants in 132 government departments walked out amid claims of bullying and an 'ideological war' on the workforce. PCS general secretary Mark Serwotka said: 'Our hard-working members in HMRC are fed up with being treated with disdain by a government that doesn't seem to care about its own staff.'If they did, ministers would be able to stop this strike action… by making a fair offer to help our members through the cost-of-living crisis and beyond.' The union predicts the walkouts will cause 'significant problems' for businesses across the UK, with HMRC's helpline, student loans unit, PAYE registrations and employment allowance all set to be affected.Penalties, expenses and benefits, as well as one of the Government's flagship small business policies, Employment Allowance, are also expected to be impacted. ",
        "An HMRC spokesman told This Is Money: 'Discussions are continuing between HMRC and the civil service unions. 'We have robust plans in place to ensure we continue delivering critical services for our customers during any industrial action.'HMRC did not respond to a request for clarification on what 'critical services' it was prioritising or whether its call centres would be affected.It could be another frustrating wait for many small businesses, who have been facing delays as HMRC takes months to secure basic tax details.It comes as HMRC seen huge cuts to its customer service workforce, from 25,000 to 19,500 over five years.In February, the Institute of Chartered Accounts of England and Wales said understaffing at the tax office was causing delays and hindering economic activity.One accountant called the service 'diabolical', although HMRC said it was responding to most correspondence within 15 days.Michael Izza, chief executive at the ICAEW, said: 'We're calling on ministers to set up an emergency taskforce to identify steps to eliminate HMRC's backlog and improve its service standards, so that in the future it supports, not inhibits, business growth and maximises the tax receipts needed to fund public services.' ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}