{
    "articleURL": "/wires/pa/article-12059951/Closing-arguments-way-Trump-rape-trial.html",
    "content": [
        "A lawyer has told a jury in the US that Donald Trump should be held accountable for sexually attacking an advice columnist in 1996 because even a former president is not above the law.",
        "Roberta Kaplan delivered the first closing argument in the federal civil trial, showing jurors video clips of Mr Trump from his October deposition and replaying the Access Hollywood video from 2005 in which he said into a hot mic that celebrities could grab women’s genitals without asking.Closing arguments were expected to last all day in the case as the jurors in Manhattan heard final remarks from lawyers about the claims writer E Jean Carroll has brought against Mr Trump.Ms Kaplan recalled Mr Trump’s comment that “stars like him can get away with sexually assaulting women”.“That’s who Donald Trump is. That is how he thinks. And that’s what he does,” Ms Kaplan said.“He thinks he can get away with it here.”She told jurors that it was not a “he said, she said” case but rather one in which jurors should weigh what 11 witnesses, including Ms Carroll, said versus what they heard from Mr Trump in his video deposition.“He didn’t even bother to show up here in person,” Ms Kaplan said. In a very real sense, Donald Trump is a witness against himself. He knows what he did. He knows that he sexually assaulted E Jean Carroll  Lawyer Roberta Kaplan  She told jurors that much of what he said in his deposition and in public statements “actually supports our side of the case”.",
        "“In a very real sense, Donald Trump is a witness against himself,” she said.“He knows what he did. He knows that he sexually assaulted E Jean Carroll.”Mr Trump, who has not attended the trial, has insisted in public statements and in the deposition that Carroll made up the claims to boost sales of a 2019 memoir.Carroll, 79, who is seeking compensatory and punitive damages, testified for more than two days during the trial, which is entering its third week.She said she had been leaving a Bergdorf Goodman store through a revolving door in spring 1996 when Mr Trump was entering the store and stopped her to help him shop for a gift for a woman.Ms Carroll said they eventually took escalators to the store’s sixth floor, where they teased each other about trying on a piece of see-through lingerie.She said she entered a dressing room with Mr Trump before the flirtatious outing turned violent, with Mr Trump slamming her against a wall, pulling down her tights and raping her.She said she kneed him after an encounter that lasted several minutes and fled the store.Judge Lewis A Kaplan, who is unrelated to Ms Kaplan, told jurors they would begin deliberations on Tuesday after he spent about an hour reading them the law that would pertain to battery and defamation, the two allegations they must decide."
    ]
}