{
    "articleURL": "/sport/football/article-12043481/Erling-Haaland-BREAKS-record-goals-Premier-League-season.html",
    "content": [
        "Erling Haaland has broken record for the most goals in a Premier League season The Norwegian passed Andrew Cole and Alan Shearer's 42-game season recordsBroke record for the most goals in a 38-game season against Arsenal last weekErling Haaland was given a guard of honour by his Manchester City team-mates after breaking the single-season Premier League goal-scoring record.",
        "The Norwegian ran through and made it 2-0 against West Ham with an impudent finish over Lukasz Fabianski, ensuring he went past Andrew Cole and Alan Shearer in the single-season scoring stakes. Before leaving the pitch at the end of the 3-1 win over the Hammers, Haaland was given a standing ovation by the entire Etihad crowd while his team-mates lined up to give him a guard of honour. The scenes further evidenced Haaland's popularity among his City peers, with the Norwegian said to be a humble and personally admired member of Pep Guardiola's imperious squad. The full array of players and staff members slapped him on the back of the head and back as he headed off with an enormous grin etched across his face. When he reached the end, he could be seen rubbing his back as if to will away the pain, though the smile remained.Speaking to Sky Sports after the game, Haaland made public his pride at his achievement, calling it a 'special night'.",
        "'Special night, and a special moment,' he said. 'I’m really happy and proud. Of course I knew about it, but we tried to create the chances to score goals, we struggled a bit in the first half, but second half Nate (Ake) scored and I scored, as an important win.'",
        "A mistake by Danny Ings shortly after City had taken the lead allowed Haaland to run through and score the all-important second, and he revealed Jack Grealish, who laid on the assist, had said before the game that he wanted to be involved in the crowning moment. 'My first thought is to run towards the goal, me and Jack spoke before the game and he said he wanted to give me the assist for the record,' he said. 'It was the perfect ball. It was the really perfect bounce as I chip the ball, I didn’t think of it, but then it was there so I did.'It was nice feeling [the guard of honour], especially to win the game is also really important. It was really painful, everyone hit me on the back.'Haaland's 51st goal of the season brought him ever closer to Dixie Dean's seemingly unbeatable record of 65 goals in the 1927-28 campaign. No player in England has ever come much closer to beating it, or indeed matching the feat.'I don’t think of this, I sleep tonight and then I think about three points against Leeds,' Haaland admitted. 'I will go home now and play some video games and then speak. I cannot say [what video game] it's too embarrassing.'",
        "Lauding his player afterwards, Guardiola described Haaland as a 'unique and special' person and footballer.'It's unbelievable how many goals he has scored and all the important goals he has scored to help us win games and all the things like that... he is a unique person,' he said.'Player of course, but the person is also so special. It was nice - he deserves the guard of honour we have done for him because of his incredible milestone.''Maybe one he will break his record or another player will break his record, but he would have to score a lot of goals.'Nathan Ake reaffirmed how 'humble' Erling Haaland had remained throughout the season in the face of achievements that any player in history would be proud of.Ake, who had given City the lead on the night, added that he hoped he was not done with finding the back of the net for the season. 'He deserves everything he gets, he works so hard, he's a top player, he stays so humble,' he said. 'Hopefully he can score even more. We have to keep on pushing, Leeds on Saturday will be tough.'Meanwhile, praise for him was not scarce on social media.Shearer, whose record of 34 goals in the 1994-95 campaign, a feat shared with Cole who notched the same number the season prior, Haaland broke said he couldn't have wished it to happen to a 'nicer guy'",
        "'Couldn’t have wanted it to go to a nicer guy,' he said. It’s only taken 28 years! He’s the best.'His social media post came in response to his Match of the Day colleague jokingly offering his condolences to Shearer.'A Premier League record for Erling Haaland. 35 goals. That’s nuts,' he wrote. 'Thoughts are with Alan Shearer at this difficult time.'It marks yet another achievement in a remarkable first campaign in England for Haaland, who has scored a half-century of goals in all competitions for City this season, becoming the first player to do in England in just under 100 years. ",
        "A sense of foreboding was abound for West Ham from the start of the evening, with Haaland having scored his first goal in English football against them back in August. Irrespective of his terrorising of Ben Johnson and Kurt Zouma that day, few would have backed him to go and score a further 50 goals - and counting. A natural born goalscorer with an unprecedented instinct for finding the back of the net, perhaps, but Haaland claimed afterwards that he would swap every one of his strikes for the treble this season.Underlining his attitude that the team comes first and personal accolades a very lowly second, the Norwegian said that the treble was the ultimate prize.",
        "'Yes, yes [would swap goals for the treble]. It's the most important thing,' he said. 'Everyone knows it's possible but we can't think of the FA Cup final now. We just have to think of Leeds. Every one of the last nine games now is a cup final.'"
    ]
}