{
    "articleURL": "/news/article-12039531/Cannabis-ease-cancer-pain.html",
    "content": [
        "Patients reported more than 40 per cent better ability to go about their daily lifeResearchers found people were able to reduce their use of opioid painkillersResults may partly have been due to ‘placebo effect’ and other research differsMedical cannabis may reduce the need for pain relief in cancer patients, a study has found. ",
        "Researchers looked at 358 patients, all of whom were taking the drug because conventional painkillers did not fully work for them.They reported a reduction of more than 40 per cent in how much pain affected their ability to go about daily life. However, the study from McGill University in Montreal, published in the journal BMJ Supportive &amp; Palliative Care, did not compare those using medical cannabis to those taking conventional painkillers alone. And the results may partly have been due to the ‘placebo effect’ - where people feel better because they expect a treatment to work. ",
        "The majority were taking cannabis by swallowing cannabis oil, with 13 per cent smoking it. The researchers found people were able to reduce their use of opioids, which are linked to side effects such as nausea and vomiting. Meanwhile the most common side effects seen in the study by volunteers taking medical cannabis were drowsiness, fatigue and a dry mouth.Dr Antonio Vigano, senior author of the study, from McGill University in Canada, said: ‘This study showed medical cannabis was both safe, effective and could help people reduce their use of conventional painkillers.’ Currently, there is a licensed form of medical cannabis in the UK, called Epidyolex, which is used for three types of childhood epilepsy.",
        "Hospital specialists can also prescribe a licensed cannabis-based spray called Sativex on the NHS for muscle stiffness caused by multiple sclerosis. A type of medical cannabis called nabilone can be prescribed to adult cancer patients to reduce nausea and vomiting, but only when conventional medicines do not work. The new study, published in the journal BMJ Supportive &amp; Palliative Care, found significant reductions in people’s pain while they were taking medical cannabis. ",
        "The patients in the study mainly took opioids but were also on other drugs including anti-inflammatory and anti-convulsant medications. Despite the results, however, other studies have found medical cannabis does not reduce cancer patients’ use of opioids, and the researchers note that medical cannabis products’ effectiveness can vary if the dosage and type is not closely matched to the patient using them. People may also suffer more side effects when they are not closely monitored by doctors, as volunteers were in the study. More than half of patients undergoing cancer treatment, and two-thirds of those with advanced or terminal disease experience pain.The UK’s medical watchdog, The National Institute for Health and Care Excellence (NICE), has recommended trials to establish if medical cannabis can help with pain in cancer patients, to reduce their use of opioids and allow them to live at home without needing to be kept in hospital. ",
        "However, when it published its guideline on medical cannabis products in 2019, it said there was not enough evidence it could effectively treat cancer-related pain. "
    ]
}