{
    "articleURL": "/wires/pa/article-12054125/Katy-Perry-Dame-Emma-Thompson-champion-British-fashion-coronation.html",
    "content": [
        "Celebrities including singer Katy Perry and actress Dame Emma Thompson championed British fashion at the King’s coronation service.",
        "Perry, who will perform at Sunday’s Coronation Concert at Windsor Castle, wore a bespoke lilac skirt suit by Vivienne Westwood.",
        "The outfit was made from leatherette taken from the brand’s fabric archives and featured a purple silk flower corsage.Perry paired the suit with matching opera gloves, the granny frame purse (retailing at £170) and Westwood’s signature pearl and diamond choker.One of British fashion’s most influential figures, Dame Vivienne died on December 29, 2022, aged 81.She was known for her love of corsetry, which is reflected in Perry’s outfit, and was a vocal supporter of the King.Perry arrived with British Vogue editor Edward Enninful, who wore a bespoke single-breasted morning suit by head cutter and creative director Campbell Carey from Savile Row tailoring house Huntsman.Charles is a long-time fan of the craftsmanship of Savile Row tailors, who have helped make the red and gold military uniforms for coronation day.",
        "Wearing a traditional morning suit with a dove grey tie, Hello singer Lionel Richie brought glamour with accessories from British brand Garrard, which was established in London in 1735.The fanfare symphony diamond and mother of pearl cufflinks retail at £18,500, and he teamed them with the white rose high jewellery diamond brooch from the brand’s high jewellery collection – price upon request.",
        "Garrard has a longstanding relationship with the royal family – the brand made the late Diana, Princess of Wales’s engagement ring, which is now worn by the Princess of Wales.The jeweller has also been responsible for other important royal pieces, including Queen Victoria’s Small Diamond Crown and the Girls of Great Britain and Ireland Tiara, worn by the late Queen in her accession photographs.Other key pieces featured in the coronation – including the Imperial State Crown worn by Charles, and Queen Mary’s Crown worn by Camilla – were either created or significantly remodelled by Garrard, the jewellery house said in a statement.",
        "Dame Emma was regal in red, wearing a red patterned coat emblazoned with roses, a nod to the national symbol of England. The coat was by London-based designer Emilia Wickstead.The Princess of Wales often chooses Wickstead’s classic designs for engagements – last year one of her sartorial highlights was a pale yellow dress worn to the service of thanksgiving for the platinum jubilee celebrations.Dame Emma teamed the coat with a simple black knee-length dress.Alexandra Wood, Savile Row’s first female tailor, told the PA news agency the look was “modest yet stylishly understated”.",
        "First Lady of the United States Dr Jill Biden attended with her granddaughter, Finnegan Biden.",
        "Both were in monochromatic outfits, Dr Biden in a cornflower blue suit with matching gloves and a delicate ribbon in her hair, and Ms Biden opting for a pale yellow caped dress with a floral headpiece.“These are super chic and representative of Ukraine colours, which is clever,” Wood said.Both outfits are by American designers – Dr Biden was wearing heritage brand Ralph Lauren, and Ms Biden was in New York-based brand Markarian.",
        "Dame Joanna Lumley wore a nautical-style navy blue coat dress with white lapels, gloves and a hat.The mod-style shift coat could be seen as a nod to the late designer Mary Quant’s signature sixties style.",
        "Former Spice Girls singer Mel B wore a green gown with a jewelled neckline from American label Badgley Mischka, which is particularly known for its bridalwear and red carpet outfits, as she was interviewed by ITV outside the Abbey.",
        "Wood said TV presenters Ant McPartlin and Declan Donnelly were “looking fantastic, respecting the traditional morning dress code”.",
        "Mayor of London Sadiq Khan wore a sharp bright blue business suit.“I think there’ll be a divide between the two all day, which is fascinating,” Wood added of the men’s outfit choices.",
        "First Lady of Ukraine Olena Zelenska did not wear a fascinator or hat for the occasion, just a midi-length pale blue coat with a simple matching dress underneath.",
        "South African soprano Pretty Yende performed inside Westminster Abbey for the coronation, wearing a sunshine yellow gown by French fashion house Stephane Rolland.With statement shoulders and long sleeves, the dress was set off by a yellow and white diamond necklace and matching earrings from Graff, featuring more than 138 carats.For the dress code, women were asked to wear day dresses, with hats and fascinators optional, while for men morning coats, lounge suits and uniforms were acceptable.Both can wear national dress and decorations such as insignia for an MBE or knighthood."
    ]
}