{
    "articleURL": "/wires/pa/article-12038401/Yousaf-ordered-police-stop-Stone-Destiny-says-Salmond.html",
    "content": [
        "First Minister Humza Yousaf should have ordered police to have a “standoff” at Edinburgh Castle to stop the Stone of Destiny being taken to Westminster, Alex Salmond has said.",
        "The stone was taken to London last week to be used in the coronation of the King this weekend, as it has been used for centuries, but the former first minister said it could have been used to barter for another referendum on Scottish independence.Speaking to Andrew Marr on LBC on Tuesday, Mr Salmond said there should have been a “ring of policemen around Edinburgh Castle”, claiming that such a show of force would have “commanded worldwide attention”.The Alba Party leader, now an outspoken critic of the SNP – the party he led for two decades – also announced he would not attend the coronation, but instead speak at a pro-independence march in Glasgow on Saturday.",
        "“The opportunity was there to make a simple statement in defence of the country and the realm,” he said.“And I’m sure it would have commanded worldwide attention – you don’t command very much as First Minister of Scotland, but you do command the Scottish police force, you could have put a ring of policemen around Edinburgh Castle.“Have a standoff on the Esplanade and politely explain to the world that Scotland should not sacrifice its symbol of sovereignty until that sovereignty is at least recognised by Westminster.”Police Scotland is operationally independent of the Scottish Government, meaning it cannot be directed by the First Minister.",
        " I'm going to be at the Glasgow march and speaking on independence  Alex Salmond, Alba Party  He added: “It would be, politically, an important gesture to bring to worldwide attention the plight that Scotland is now in.“As First Minister you don’t have many political cards to play when you’ve got an obdurate Westminster Government saying you’re not going to be able to exercise your democratic rights, so when you’re presented with this amazing opportunity, then your duty, your absolute duty much greater than your duty to the monarch, your duty to the people, is to use that and to try and use it in Scotland’s benefit.”Mr Salmond went on to describe the First Minster as looking like a “pet poodle” as he saw the stone off on its journey to London.Asked if he would be attending the coronation, Mr Salmond said he would be attending an event organised by independence group All Under One Banner in Glasgow.“I know I’m criticising Humza Yousaf for not seizing the opportunity that the symbolism of the Stone of Destiny is, I’m not particularly criticising him for going to the coronation, I don’t think he should have said to people he was going to the independent march,” he said.“That’s where I’m going to be. I’m going to be there and speaking on independence.",
        "“But I can’t understand the attraction of other key members of the SNP who got invitations to attend to attend a ceremony in London, when they should be attending an independence march in Glasgow.”He went on to say he believed Charles would be “the last king of Scots”."
    ]
}