{
    "articleURL": "/news/article-12038181/I-striking-teacher-dare-come-seven-week-term-feel-afterwards.html",
    "content": [
        "Thousands of teachers went on strike today in a dispute over pay and conditions Is YOUR child's school shut today? Full list of closures revealed hereMoaning teachers who have plunged schools into chaos by going out on strike have defended their actions, with some challenging those who disagree to spend a term doing their jobs.",
        "Members of the National Education Union (NEU) walked out of their jobs today as part of their ongoing dispute over pay and conditions, and union bosses have  warned three more strike days planned for late June and early July will 'likely' go ahead.Teachers have been blasted for the 'unfair' industrial action after they rejected a 4.5 per cent pay rise in England - with opponents saying it is 'penalising children' just weeks before GCSE and A-level examsHowever, those on the picket line say they have been supported by their students - many of whom got the day off today as a result - and have come out swinging.One secondary school teacher went so far as to challenge critics to 'come and do a seven or eight week term and see how they feel afterwards'.",
        "Adam Robinson, a media studies, English and drama teacher at Wilmington Grammar for Boys in Kent had strong words for those who disagree with strikes referencing teachers' long holidays.He said: 'On the face of it we do get long holidays but we don't get paid for them. About four weeks are paid and then the rest are not. 'I would challenge anyone who says we get long holidays to come and do a seven or eight week term and see how they feel afterwards. ",
        "'If teaching is so easy, why are there so many vacancies and problems with hiring and keeping staff?'The 51-year-old hit out Government's pay offer to teachers, calling it 'embarrassingly poor'. He added: 'It was a joke. It almost felt worse than offering nothing. I don't know what they really thought.' But the decision to strike was not an easy one, given the impact school closures have on pupils. He said: 'It's difficult, I almost didn't strike today as it's a real moral problem. 'We're into exam season now and the students are in fact working really hard for all their upcoming exams so it is true the timing doesn't look particularly good and that did worry me.' But it was his students that ended up persuading him to join the protest, Mr Robinson said. He added: 'I had a long conversation with my Year 13s about it on Friday and that is what gave me the strength to do it. 'They were really supportive and wanted me to do it as they see everyday that schools and teachers need help. 'They see everyday that there is a lack of teachers and a lack of resources and all those things. They want to see an improvement as much as us.'Despite the apparent support of children, parents slammed teachers on social media today, while one retired teacher told Radio 5 Live that teaching 'is a vocation' and 'children should not suffer for any reason at all'. ",
        "In a heated exchange with NEU General-Secretary Kevin Courtney today, Roberta, from Sheffield, thundered: 'You can think of other things to do that will make the government sit up and think rather than by refusing to do things, rather than penalising the children that you refuse to teach.'",
        "Mr Courtney responded: 'The point is, the children are being penalised everyday by the shortage of teachers.'He pointed out the government is going to miss its target for secondary teacher recruitment this year by 'maybe by 50 per cent'. The union boss also highlighted there are 'classes around the country where the children aren't being taught'.He spoke of an A-level physics class in which students are taught for only half of the timetabled lessons. 'The other half is self-study,' he continued.Roberta strongly disagreed, and said: 'you're letting these children out of school, and you don't know who's looking after them. Parents have to work too.",
        "'I know that certain children from certain backgrounds will probably end up in trouble because they've got days off school.'She explained she does believe in strike action, but not in this circumstance as 'it is not fair on the children'.Many secondary schools in England are expected to prioritise Year 11 and Year 13 students during the strikes, as dates for GCSE and A-level exams draw closer. ",
        "The Government previously offered a £1,000 one-off payment for the current school year and an average 4.3 per cent pay rise for staff next year, but this was rejected and then withdrawn.Picket lines were mounted outside schools in England on Tuesday morning, while a protest outside the Department for Education (DfE) and a rally outside Downing Street in London are due to be held. More than half of England's 22,000 schools were either closed or partially closed on previous days of industrial action as teachers demand improved pay and working conditions amid the cost of living crisis.The NEU issued guidance saying it will support arrangements during the strikes that 'provide the minimum level of teaching staff needed' so GCSE and A-level students can attend school for revision activities or exam practice. School closures are expected to vary across England, some counties have provided lists of school closures, whilst others advise parents to check with individual schools. Unions are seeking above-inflation increases, plus extra money to ensure any pay rises do not come from schools' existing budgets.",
        "Four education unions, the NEU, the NASUWT teaching union, the National Association of Head Teachers (NAHT) and the Association of School and College Leaders (ASCL), rejected the last pay offer.Cabinet minister James Cleverly said a 'good offer' has been made to teachers over pay and workload reduction.",
        "The Foreign Secretary told LBC Radio: 'The best way of minimising disruption to students is for those teachers to be in the classrooms.'Many, many students have had a very, very disrupted last couple of years because of Covid and I think everything we can do to help them start their lives better through education is really, really important.'",
        "A DfE spokesperson said: 'For unions to co-ordinate strike action with the aim of causing maximum disruption to schools is unreasonable and disproportionate, especially given the impact the pandemic has already had on students' learning.'Children's education has always been our absolute priority and they should be in classrooms where they belong.'We have made a fair and reasonable teacher pay offer to the unions, which recognises teachers' hard work and commitment as well as delivering at additional £2 billion in funding for schools, which they asked for.'Last year, classroom teachers were paid an average of £38,982 in the 2021-22 school year in England, £39,009 in Wales and £40,026 in Scotland.The average head teacher salary in England for the same period was £74,095, and £57,117 for other senior leaders.The majority of state school teachers in England had a 5 per cent rise last year.But after taking inflation into account, teachers' salaries in England fell by an average of 11 per cent between 2010 and 2022, the Institute for Fiscal Studies says.",
        "On further strikes, joint general secretary of the NEU Kevin Courtney said: 'At that stage that would be just the NEU. All the unions are balloting, we are reballoting, but the timescales that will lead to will be the autumn term.'But we want the Government to settle this before the autumn term, so we want to maintain pressure on the Government before the autumn term.' He told PA that striking NEU members can teach GSCE and A-level classes.",
        "He said: 'We have put in place a dispensation at a national level, which is negotiated at a school level, to say that the teachers that are teaching the GSCE and the A-level years... We can let them off the strike to go in and teach those classes, and reach an arrangement with the head teacher to do that.'You'll find that some school teachers are on the picket line on strike in the morning and going in to teach their A-level class in the afternoon.' He added: 'We don't want to disrupt education, we apologise for the disruption that is caused.''You should be getting Gillian Keegan [Education Secretary] on asking her how she justifies the disruption every week.'Ahead of the strikes last week, a Department for Education spokesperson said: 'Any strike action is hugely damaging. We have made a fair and reasonable pay offer to teachers recognising their hard work and commitment.'Thanks to the further £2 billion pounds we are investing in our schools, next year, school funding will be at its highest level in history.'The NEU is considering three further days of strike action in the summer term in England."
    ]
}