{
    "articleURL": "/wires/afp/article-12056781/In-America-gun-lobbys-nightmare-named-Shannon-Watts.html",
    "content": [
        "Having traveled across the United States for a decade to campaign against the ceaseless round of shootings that have claimed thousands of lives, Shannon Watts believes she has heard a very clear message.",
        "\"Americans want the gun violence to stop,\" she said during a recent stop in Washington.One of the country's most prominent faces in the fight against gun violence, Watts met with AFP journalists in her hotel room in an interview sandwiched between a live Instagram talk and lunch with Hillary Clinton and other influential women.While the battle to reduce firearm deaths has exacted a price -- amid furious responses from some far-right gun lovers she often travels under an alias -- this 52-year-old mother of five remains undeterred.And after devoting countless hours to her cause, she insists that \"we are winning.\"It doesn't always feel that way. On Saturday, a man armed with an assault rifle killed eight people in a shopping center near Dallas, Texas.\"We are not numb,\" Watts tweeted afterwards. \"We are traumatized.\"By now, she told AFP, even Republicans, traditionally fierce defenders of the right to own arms, \"are scared their kids aren't safe.\"",
        "It was that sort of fear that prompted Watts to found Moms Demand Action. The galvanizing spark was the Sandy Hook massacre of December 14, 2012 -- when a disturbed young man opened fire in an elementary school in Newtown, Connecticut, killing 26 people, including 20 children aged six and seven.",
        "That night, Watts said, she went to bed \"devastated,\" in tears but also \"full of rage\" and overwhelmed by \"this feeling of needing to do something.\"The next morning she went to work. Scouring the internet, she found a few anti-gun violence groups, but all were headed by men. That wasn't for her: \"I wanted to be part of a badass army of women,\" she said.So she set out to create one.From humble beginnings as a small Facebook group, Moms Demand Action has grown into a powerful organization with chapters in all 50 US states and claiming some 10 million supporters.The association -- part of the umbrella group Everytown for Gun Safety -- enjoys key financial support from billionaire and former New York mayor Michael Bloomberg.- Red T-shirts -The red T-shirts worn by MDA members have become a familiar sight at demonstrations or outside state capitols, where many legislators have firsthand experience with the group's influence at the ballot box.A master of social media, Watts claims the group has scored 500 legislative victories on the local or national level, nearly always in opposition to the country's powerful pro-gun lobby, the National Rifle Association.",
        "There have also been setbacks, which can fuel a sense of fatalism: Mass shootings have become so common, so unexceptional, that they no longer prompt big demonstrations across the country.",
        "But according to Watts it takes more than individual protests to \"change legislation and culture.\" What's needed, she said, is \"what I call the unglamorous heavy lifting of grassroots activism.\"So she keeps pressing for ambitious federal actions -- even if those seem doomed by Republicans' current control of the House of Representatives.A key goal is a nationwide requirement for potential gun buyers to undergo background checks -- to weed out those with criminal records or serious psychiatric problems.Watts also wants to see a ban on military-style assault weapons of the type so frequently used in mass shootings. President Joe Biden, a Democrat, shares that goal but has been unable to push a ban through Congress.- 'Not anti-gun' -But there is one step Moms Demand Action will not take: seeking an outright ban on private gun ownership.\"There are a variety of different reasons you may want or need a gun,\" she told AFP. Her father owned one, as do many members of her organization, Watts said.And countries like Israel and Switzerland have \"high rates of gun ownership, but low rates of gun violence,\" she noted. \"Those two things can co-exist.\"This year, after 10 years heading Moms Demand Action, Watts will pass the reins of leadership to Angela Ferrell-Zabala.",
        "Watts, for her part, would not say what her next act might be -- though she wouldn't rule out a future in politics.Given the national prominence she has earned through her MDA work, that would seem a logical move.But her high profile has also made her a target, in a country where love of guns is deeply visceral for many.From her earliest days of activism she has been marked with threats. Heavily armed men have been expelled from events where she appeared.She travels with \"someone who specializes in security,\" whose responsibilities include always knowing the location of \"the nearest hospital to take me to if there's a shooting.\"But Watts insisted she will not be silenced.\"If we lose our children,\" she said, \"we have nothing left to lose.\""
    ]
}