{
    "articleURL": "/news/article-12046809/I-100k-investing-recession-proof-designer-handbags-like-Hermes-Chanel-Heres-how.html",
    "content": [
        "Handbags are now better investments than art or jewelry, experts say Chanel and Hermès purses are among the labels offering the biggest returns on the resale market Meet the women who claim to have made up to $100k on their bag collections As America plunges deeper into a financial crisis and households grapple with the soaring cost of living, a designer handbag might seem like a frivolous purchase. ",
        "But for Beth Silverberg, handbags aren't just a luxury they're an investment - which she insists are just as lucrative as real estate, art and even stocks. Silverberg, a former professional poker player, estimates she has made more than $100,000 by buying and selling purses from brands including Chanel, Hermès and Louis Vuitton since she started her collection aged 16. And her earnings are only set to grow after a report by wealth manager Credit Suisse projected handbags to be one of the best 'collectible' investments of 2023 - outranking jewelry and art in terms of resale value.'My first ever bag was a Louis Vuitton 30 Speedy which I bought for $150 from the tips I made waitressing,' the 55-year-old, from Pennsylvania, told Dailymail.com.",
        "'I flipped mine for around $600 years ago - but they're worth $1,500 now. 'I've always invested in stocks and shares but my bags have far superseded anything I've made the traditional way.' In today's money, the $150 Speedy she bought in her teens would be the equivalent of around $550 - still way below what they sell for now.Analysts at Credit Suisse found that the average value of designer purses had shot up 92 percent in the last decade. While you might think the trend would be dampened by economic uncertainty sparked by red-hot inflation and several bank failures, experts insist this is not the case. ",
        "Last year, a report by management consultancy Bain &amp; Co., found that the US luxury goods industry was 'recession-proof' due to its enduring popularity.More recently it emerged a host of designer brands had raked in billions more profit this year - despite many increasing the cost of their products. But investors have to be savvy as not all designer bags are guaranteed to go up in value. Traditionally, Birkin and Kelly bags from Hermès have commanded the biggest prices, in part because they're frequently photographed on the arms of celebrities such Kim Kardashian, Sarah Jessica Parker and Emma Watson. Victoria Beckham is even said to own around 100 Birkins - worth around $2 million. But they are also considered ultra-exclusive because they can't simply be bought off the shelf. ",
        "Hermès implements strict rules around who can buy one of their purses, leaving some customers on waiting lists that can stretch up to six years. Even after they get the call-up, clients are not guaranteed the exact color and model they desire. It has led to a booming second-hand market where fashionistas pay way above the retail price to get their hands on their preferred design.For example, a Togo leather Birkin 25 purse currently costs $10,400 brand-new.But Dailymail.com found a cream, pre-loved version of the bag being sold for $53,050 on the resale site Farfetch. ",
        "It means in theory a customer could buy the accessory at its retail price and flip it for five times its value in a matter of days - though the exact profit would vary between models.In comparison, the average investor makes a 10 percent return each year on the S&amp;P 500 stock market, according to comparison site NerdWallet. Some bags can command much larger returns - depending on the leather, condition and hardware. In general the rule for handbag investing is: the rarer the bag, the bigger the resale value.For example, Hermès produced a Himalayan Birkin which originally sold for $25,000 and was worn by both Kardashian and Beckham. Now versions of the bag can sell for up to $300,000. One iteration is listed at $250,000 on resale site Madison Avenue Couture.",
        "For Silverberg - who now runs her own resale boutique Exceptional Finds -  selling her Himalaya Birkin too soon is among her biggest mistakes. 'I bought it for $25,000 and sold it for $75,000. I really regret that, I would get at least $250,000 for it now,' she said.Another Birkin to attract huge sums on the resale market is the Shadow Birkin by French designer Jean Paul Gaultier - one of the many coveted designs he created when he headed up the label. ",
        "The purse was produced in 2009-2010 and was reissued in limited quantities in 2019 - but it remains highly rare.The Shadow Birkin has all the same features as a regular Birkin but they are embossed from the inside - making it different from all other designs.Demand is so high that even auction house Sotheby's is in on the action and has begun selling Hermès bags. But customers don't have to wait for an auction - they can now buy second hand purses direct from Sotheby's. More brands have been taking note from Hermès's example and implementing their own purchasing restrictions.In 2021 Chanel announced that its customers could buy only one bag a year in its classic flap and Coco Handle designs.And on its small leather goods, Chanel customers can buy no more than two of the same items each year. ",
        "At the same time the fashion house has been steadily increasing its prices year-on-year - boosting the value of its goods. Chanel's chief financial officer Philippe Blondiaux said the brand had to increase its retail costs in 2023 'to account for currency fluctuations and inflation.'The price of a Chanel classic small flap bag went up by 17 percent this year, from $8,200 to $9,600.Meanwhile the cost of a Chanel Reissue Large Bag increased from $9,500 to  $11,000.",
        "It means that their return-on-investment is only going up over time. Analysts at Credit Suisse noted that specifically Chanel handbags 'offered the best inflation protection'.While handbag investing is nothing new, it has increased in popularity thanks to younger generations taking note.Last year Generation Z - those aged between 10 and 25 - and Milennials - between 26 and 42 - accounted for 72 percent of the luxury goods market.And now they are sharing their tips on TikTok.Among them is influencer Steffie Price who keeps a careful eye on designer bag costs and frequently posts videos explaining the investment value of purses. The 29-year-old New Yorker knows all too well how useful these investments can be after she was forced to sell four of her purses during the pandemic when her income all but dried up overnight.She made $5000 each on two of her Chanel classic flap bags - which she had bought for $2,000 and $3,000 respectively.",
        "On top of that she also sold a small Dior bag for $800 and a Louis Vuitton for $2,000. She had bought the latter for $1,500. Price told Dailymail.com: 'When lockdown happened, a lot of brands stopped spending money on marketing so I suddenly found myself without an income.'It's nice to know that if I'm ever desperate for money I'm sitting on around $30,000 worth of bags.'",
        "But Price agrees that handbag investors should be careful. She says Chanel, Hermès and Louis Vuitton purses are generally guaranteed to go up in value - though she would steer clear of other brands.She adds that it's imperative owners look after the bags carefully and keep them in pristine condition. 'If you're buying a bag for investment purposes then always check the resale market first,' she said.'You can find out pretty quickly which bags are selling for the most amount of profit.'"
    ]
}