{
    "articleURL": "/wires/ap/article-12038745/Column-Sargeant-returns-home-F1s-great-American-hope.html",
    "content": [
        "The first driver to be shown in the opening video for every Formula One race broadcast in the United States is not reigning champion Max Verstappen or seven-time champion Lewis Hamilton or even resurgent Fernando Alonso.",
        "No, it is a 22-year-old part-time surfer with four F1 races on his resume. He has never won a championship at the elite level and only secured the Super License needed to compete in the global racing series last November.It is Logan Sargeant, a rookie for Williams Racing and the first American since Alexander Rossi in 2015 to earn a seat on the F1 grid. His breakout comes this weekend at the Miami Grand Prix, a true home race for Sargeant, who grew up in Fort Lauderdale.He's quiet and a bit introverted, still adjusting to being one of only 20 drivers in the world to race on the biggest stage in motorsports. Despite heavy promotion by both Williams and race organizers throughout South Florida, his team keeps him in a tight bubble outside of mandatory media obligations.Jenson Button, the 2009 F1 champion and a Williams ambassador, said Sargeant just needs time to adapt to the spotlight.\"He´s a very down to earth individual and he really listens,\" Button told The Associated Press. \"Which is great because he´s like a sponge and that´s what you want at the start of your career. He´s young. A young individual. And I remember when I arrived in F1, I was so worried about saying or doing the wrong thing.",
        "\"Logan has good character and when you actually sit down with Logan, he's got a good sense of humor,\" he added. \"The important thing for him, though, is that he focuses on his racing and I think that's what he is doing. Once he gets some more confidence in himself, I do believe you will see some of his character come out.\"Sargeant's social media accounts sometimes show a lighter side: a recent post of him playing beach volleyball was captioned \"I ain't worried about it right now.\" It included a smiling, sunglass-wearing emoji.Kyle Kirkwood, a childhood friend from Florida who won his first IndyCar race last month, has watched Sargeant in interviews this year and believes he´s seen some of his surfing buddy´s big personality come out. Kirkwood is part of a close-knit group of former karters who still hang out today.\"If he knows you. If he's comfortable around you,\" Kirkwood told AP. \"He just needs time to get comfortable, but from what I've seen, he's becoming a bit more open.\"Well, this is his weekend to shine.Sargeant will be still seeking his first F1 points as he heads to Miami and is tied for last in the series standings with fellow rookie Nyck de Vries. His best starting spot was 14th and his best finish 12th, both in the season-opening Bahrain Grand Prix.",
        "Sargeant crashed out of last weekend's sprint race and in a rare show of emotion, accused Ferrari drivers Charles Leclerc and Carlos Sainz Jr. of poor racing etiquette leading to his crash.\"When two cars want to play games on the hardest corner of the track, it makes my life extremely difficult,\" Sargeant said. \"Obviously, it´s my job to not put it in the wall... but I feel like the people in front of me could have helped me out a little bit.\"In an interview with AP a month ago, Sargeant said he wasn't sure what to expect this weekend in terms of fanfare or local support. He was on a promotional tour of New York City at the time of the interview - his first ever trip to the Big Apple, and he played tourist by attending a Brooklyn Nets game and taking pictures of himself eating pizza in various locales.Asked if he was being pushed out front as the great American hope for a motorsports series that has captivated the North American audience, Sargeant gave a nervous laugh.\"Not quite,\" he said. \"We're doing a lot of media. But it's good.\"F1 has exploded in popularity since the release of its Netflix behind-the-scenes docuseries during the height of the pandemic and thes series has found a new audience in the United States, which will host three races this year.",
        "That's an astonishing number of stops in the U.S. - there will now be five total North American races with Montreal and Mexico City - but now Las Vegas joins Miami as newcomers on the schedule. Miami debuted last season and the event was marketed and catered to a very non-NASCAR crowd.The clean-cut Sargeant should be a marketing dream. He downplayed his newfound stardom, even though Kirkwood says Sargeant has been recognized everywhere from local bars to NHL games.\"Away from the track, yeah, I get recognized here and there,\" he told AP. \"Nothing too crazy. I wouldn't say it is anything to get too worked up about, but Kyle has seen it.\"It's going to be all eyes on Sargeant all weekend while he waves the red, white and blue. He is hoping for balance.\"I am going to need to balance everything to the best of my ability, and make sure I still have enough mental capacity for when the driving comes around,\" he told AP.He's never driven the circuit and is expecting a hot, humid weekend.\"It's going to be a lot of work but I want to make it one of my best,\" Sargeant said. \"I want to come home and have a strong weekend. It's a massive privilege to be able to come back home as a Formula One racer.\"",
        "___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}