{
    "articleURL": "/news/article-12048451/Two-boys-aged-14-die-drunk-driver-drove-wrong-way-Long-Island-freeway-crashed.html",
    "content": [
        "Drew Hassenbein and Ethan Falkowitz died near Jericho late Wednesday Amandeep Singh was the driver; he faces vehicular homicide charge Two other boys aged 16 and 17 who were in the car suffered internal injuries Two 14-year-old boys died after their Alfa Romeo car was struck by a suspected drunk driver who was traveling the wrong-way on a Long Island expressway. ",
        "Drew Hassenbein and Ethan Falkowitz died near Jericho late Wednesday night after Amandeep Singh, 34, crashed his Dodge Ram into them, the New York Post reported.They were pronounced dead at the scene, while two other boys, aged 16 and 17, who were in the car suffered internal injuries. They were in a stable condition in hospital. Hassenbein and Falkowitz were both considered stars on their school's tennis team, with Hassenbein even being nationally ranked, according to NBC New York. After being struck by the Dodge, the Alfa Romeo sedan careened into a Volvo XC90 SUV with a 49-year-old woman and 16-year-old boy inside.Both suffered minor injuries. ",
        "'It was probably one of the most catastrophic scenes I have seen in a long time,' Capt. Stephen Fitzpatrick, commanding officer of the Nassau homicide squad said. 'If you had been there, you would have seen the debris field, it was almost like the car exploded.' Fitzpatrick added Singh - who registered a blood alcohol level of double the legal driving limit - was so impaired, he assumed that he was in New Jersey when Long Island detectives questioned him. 'He asked the officers, 'what are you doing here? It's New Jersey.'Singh was filmed being perp-walked in a white hazmat suit Thursday. He faces charges including aggravated vehicular homicide, first-degree vehicular manslaughter and second-degree manslaughter. ",
        "Singh's attorney, James Kousouros, told Newsday his client is a US citizen and has a criminal history dating to 2006. ",
        "'He has very strong ties to his community,' Kousouros argued in court, noting the presence of his wife and two young children in the courtroom and that he is a business owner. ' … Obviously this is an unmitigated tragedy.' District Court Judge Joseph Nocella ruled Singh a flight risk given his criminal past - including an underaged DUI - and suggested he be placed under protective custody.He was eventually remanded to a Nassau County jail without bail Thursday. Dozens of community members applauded the decision. Roslyn Board of Education president Meryl Waxman Ben-Levy said the Falkowitz and Hassenbein were returning from a victorious tennis match.'It was a big win,' Ben-Levy said. 'They were celebrating the way they should, as a team.' ",
        "Melissa Wright, a mother of a fellow youth tennis player, described both Falkowitz and Hassenbein as good kids. 'And they had great families who were really supportive of their kids and developed their talents,' Wright said. Roslyn Schools Superintendent Allison Brown announced that crisis teams will be on campus to assist students in the wake of the tragedy in a note to parents.'Our community has suffered a devastating loss with the passing of two of our students in a tragic car accident. Our hearts are broken, and we are struggling to come to terms with this tragedy,' Brown added. "
    ]
}