{
    "articleURL": "/wires/reuters/article-12060925/Writers-strike-freezes-Game-Thrones-spinoff-shows.html",
    "content": [
        "By Lisa Richwine and Dawn Chmielewski",
        "LOS ANGELES, May 8 (Reuters) - The writing of a coming \"Game of Thrones\" prequel for Warner Bros. Discovery's Max streaming service was halted as a nearly week-long strike by thousands of film and television writers rippled across Hollywood.\"Game of Thrones\" author George R.R. Martin, in a blog post on Monday, said the writer's room for \"A Knight of the Seven Kingdoms: The Hedge Knight\" was \"closed for the duration of the strike\" by the Writers Guild of America (WGA).The WGA went on strike May 2 after failing to reach a new labor agreement with higher pay from Hollywood studios such as Netflix Inc and Walt Disney Co. The studios have said they made a \"generous\" offer to boost compensation.Late-night talk shows immediately went dark, and some TV series and movies have followed. The final season of Netflix hit \"Stranger Things\" was paused. Marvel movie \"Blade,\" starring Mahershala Ali, shut down just before filming was set to start.\"The Hedge Knight\" was touted by Warner Bros. executives last month as one of the marquee shows in development for Max, the new name for what had been HBO Max.The series is set 100 years before the events of \"Game of Thrones,\" a time when the Targaryen line holds the Iron Throne, and focuses on a young knight and his squire.",
        "Warner Bros. has not announced a release date for \"The Hedge Knight.\"Martin said the second season of \"House of the Dragon,\" another \"Game of Thrones\" prequel, began filming in April and would continue in London and Wales.All eight episodes have been already been written and revised, he said.Martin also expressed his \"full and complete and unequivocal support\" of the WGA.It is unclear how long the strike will last. No new talks have been scheduled between the WGA and the Alliance of Motion Picture and Television Producers (AMPTP), the group negotiating on behalf of studios.\"Maybe the AMPTP members will come to their senses tomorrow and offer some meaningful concessions, and the whole thing can be wrapped up next week,\" Martin said. \"I would not bet the ranch on that, however ... I have never seen the Guild so united as it is now.\"(Reporting by Lisa Richwine; Editing by Aurora Ellis)"
    ]
}