{
    "articleURL": "/news/article-12051873/Coronation-weather-Showers-cancel-royal-flypast.html",
    "content": [
        "RAF Air Chief Sir Michael Wigston said there was a '50/50' chance of the flyoverIt comes as 'thundery' downpours are forecast for rest of Bank Holiday weekendA flypast to mark King Charles's Coronation could be cancelled due to a high chance of showers, according to the RAF.",
        "Air Chief Marshal Sir Michael Wigston said there was a '50/50' chance of the flyover going ahead over The Mall and Buckingham Palace tomorrow due to a 70 per cent chance of heavy rain.It comes as 'heavy' and 'thundery' downpours are expected in some parts of England over the rest of the Bank Holiday weekend.Sir Michael said: 'The weather isn't looking brilliant, but there's nothing we can do about it.'We have to be safe, we have to make sure that we aren't taking any unnecessary risks.'",
        "He added: 'We'll make a weather call one or two hours before the actual moment, but if there's rain and low cloud then it will be almost impossible to get it through.'It's 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we're hoping for the best.'The King and Queen Consort's procession will set off from Buckingham Palace at around 10.20am, when there is likely to be light wind and rain.Temperatures will then reach highs of 17C by the afternoon, which is around average for the time of year and 5C warmer than Queen Elizabeth II's 1953 Coronation.After the service at Westminster Abbey ends, Charles and Camilla are expected to enter Buckingham Palace through the centre arch at 1.33pm.",
        "Met Office meteorologist Alex Deakin said: 'There will be outbreaks of rain in London from 8am onwards, nothing too heavy, it's just going to be a bit grey, damp and drizzly.'It won't rain all morning, just a bit on-and-off with some drizzle, it may stop for half an hour or so and come back again, that kind of thing.'It will probably stay like that into the afternoon before it perhaps gets a little brighter but generally staying drab for most of the day.'",
        "King Charles and Queen Consort Camilla will receive a salute from the military in the palace gardens at 1.45pm and the flypast, which will include 60 aircraft from the Royal Navy, British Army and Royal Air Force, is expected at around 2.15pm.Mr Deakin added: 'All the different aircraft have different criteria based on the cloud so it's obviously a call for the RAF to make, but it does look a little bit brighter come the afternoon compared to the morning.'The cloud will be a little higher and there is a better chance of a drier spell, but the chances of sunny weather is almost zero and the chances of showers at that time is around 70 per cent.'A Ministry of Defence (MoD) spokesman also said: 'The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.",
        "'If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.'Sunday will start off as 'dry and bright' in many western parts of Britain but rain is expected to break out into 'slow moving heavy and locally thundery downpours' across east and southeast England, according to the Met Office.The 'murky' weather in eastern areas will continue into Monday with 'heavy rain' and 'showers' forecast for most places throughout England.Meanwhile, dry weather is expected in western parts of Britain later in the day with some rain and drizzle forecast.On Friday, royal superfans were soaked by torrential downpours as the heavens opened up over London just a day before the Coronation.A soaked but smiling Trisha Hollis, 71, said: 'It's history and I think at my age it's a once-in-a-lifetime opportunity. 'I think I was two when the Queen was crowned but obviously I have no recollection of that. I admire the royal family, I'm glad we have them. I think the Queen did a sterling job.'She added: 'What will be will be. It's 24 hours in my life. I will get dry and warm again sometime so I'll grin and bear it. If you come back to me at 2am I might not be saying it with such a smile. Maybe we'll have a nice day tomorrow but it did rain for the Queen in '53.'",
        "Joan, 70,  has been camping out since Wednesday and burst into tears after shaking King Charles' hand, she said: 'Charles stepped out of the car and walked towards us and he said has anybody over nighted and he was shaking a few hands.'I said yes I did and he looked and he could see that my hair is really sticking up, and yes I am sleeping one the pavement, he leaned forward purposefully and shook my hand.'It was just so beautiful, I am proud of being here today. I burst into tears afterwards.'I have been here for William’s wedding, Harry’s wedding, the jubilee and now I’ve come for the coronation. I wish himself and Camilla the very best. I think they’re both good people.'"
    ]
}