{
    "articleURL": "/sport/football/article-12045051/Ex-LaLiga-player-accepts-six-year-prison-sentence-pleads-guilty-leading-drug-trafficking-gang.html",
    "content": [
        "Sergio Contreras, aka Koke, played for Houston Dynamo, Malaga and MarseilleHe was accused of buying large amounts of drugs that were smuggled in lorries DailyMail.com provides all the latest international sports newsFormer MLS and LaLiga player Sergio Contreras, also known as 'Koke,' pleaded guilty to leading a gang of drug traffickers and accepted a six-year prison sentence at a court in Malaga Tuesday. ",
        "The 40-year-old, who also played for Houston Dynamo and Malaga as well as Marseille and Sporting Club, agreed to a plea deal after being warned prosecutors had initially requested a 16-year prison sentence.The sentence will be handed down in the next few days and cannot be appealed.The ex-striker was one of 17 defendants accused of buying large amounts of drugs that were then smuggled in lorries into different European countries. Koke had previously been described in a pre-trial indictment as the gang leader. The ring, which the ex-soccer star has now admitted he led, mainly bought marijuana and cannabis resin but also cocaine. ",
        "The gang was dismantled in November 2019 after an intense investigation by Spanish police in an operation codenamed Operation Vinculada. One of the drug runs linked to the ex-soccer player's gang was said to have consisted of vacuum-packed marihuana and cocaine hidden inside a cargo of garlic, and was valued at £350,000 ($440,430). 16 of the defendants attended a trial at Malaga's Provincial Court on March 27 but it was suspended after the 17th and final female defendant, who the police are still tracking down, failed to show up.All 16 who showed up to the initial trial, admitted their guilt at a brief hearing on Tuesday. ",
        "As part of the plea bargain deals they struck, they have agreed to accept prison sentences of between two and six years. ",
        "Koke started his football career at his Spanish home club Malaga, where he made his senior debut in 2002. He made seven appearances in MLS for Houston in the 2011 season, before returning to Spain where he joined Rayo Vallecano for a brief stint.His best seasons were at Aris where he scored 31 goals in 141 appearances during his two stints with the Greek side before retiring in 2016.The first of his two stints with the Greek team included a brief cameo in a 3-0 Europa League defeat to Manchester City back in 2011. "
    ]
}