{
    "articleURL": "/news/article-12044335/Australias-National-Electric-Vehicle-Strategy-attacks-wrong-priority-says-new-Adiona-Tech-report.html",
    "content": [
        "Government strategy focuses on EV carsBut trucks are biggest polluters per kmStudy demands action to electrify them The government is going in the wrong direction with its electric vehicle strategy - and should transform Australia's truck fleet before tackling cars, argues a new report.",
        "Turning just one road train electric is equal to taking 50 petrol cars off the road, while converting a single delivery truck has the same positive impact as six EV cars.But energy minister Chris Bowen last month unveiled Labor's National Electric Vehicle Strategy to fast track more battery-powered cars onto the road instead.Now a report by Sydney-based logistics software firm Adiona Tech says the government's priorities are wrong.'Australia must prioritise the electrification of vehicles that are on the road most, travel the longest distances, and are the least fuel efficient,' warned Adiona CEO Richard Savoie.'The new National Electric Vehicle Strategy is a start, but it doesn't go far enough to help Australia catch up to other developed nations. 'It is also geared entirely towards passenger vehicles, at the expense of the biggest polluters on the road.'",
        "The average car in Australia produces 2.84 tonnes of CO2 a year, according to Australian Bureau of Statistics data.That compares to one delivery truck which produces 16.2 tonnes of CO2, and a road train or semi-trailer which belches out an annual 111 tonnes of the greenhouse gas.Haulage vehicles account for 39 per cent of the nation's transport pollution - but have been largely ignored in the government's electrification strategy.",
        "'Australia is on track to purchase 50,000 EVs in 2023, up from 33,410 in 2022,' said Mr Savoie.'If purchased by consumers, this would reduce emissions by 142,000 tonnes of CO2. 'If split between rigid trucks and light commercial vehicles, it would reduce emissions by 527,500 tonnes of CO2.'",
        "The government announced new fuel emission standards in April which will force car manufacturers to meet new pollution limits across the full range of their new models.It's hoped the move will kickstart the EV market in Australia which has been restricted by a lack of choice available Down Under compared to Europe and the US.Car showrooms will be able to balance gas-guzzling SUVs with eco-friendly zero emission EVs in a move it's hoped will encourage car makers to import more EV cars.European car buyers have access to many more electric car models, and at a lower price, than are available in Australia, including EVs from VW, Honda, Ford and others.But in Australia there is just a handful of cars available in a market dominated by Tesla - which had two models in the top 10 best-sellers in Australia last month - and to a lesser extent, EVs from Chinese-made MG, Polestar and BYD.",
        "1. FORD RANGER: 3,567 sales (made in Thailand)2. TOYOTA HILUX: 3,526 sales (made in Thailand)3. TOYOTA RAV4:  2,198 sales (made in Japan)4. TESLA MODEL Y: 2,095 sales (made in China)5. HYUNDAI I30:  2,029 sales (made in South Korea)6. MITSUBISHI OUTLANDER: 1,829 sales (made in Japan)7.  ISUZU D-MAX: 1,809 sales (made in Thailand)8. HYUNDAI TUCSON: 1,678 sales (made in South Korea)9. MG ZS: 1,588 sales (made in China)10. TESLA MODEL 3: 1,581 sales (made in China)Source: Federal Chamber of Automotive Industries ",
        "Adiona says the government's new policy is misguided and is ignoring the 'low-hanging fruit' of converting haulage vehicles ahead of passenger cars.'Not only do commercial vehicles travel more, they also create more emissions per km travelled,' said Adiona co-founder Mr Savoie.'This underscores the need to electrify fleet and freight vehicles urgently. 'Ideally, we would start by electrifying the least fuel-efficient vehicles, which spend the most time on the roads.'He added: 'Electrifying fleets is by far the most efficient way to reduce vehicle emissions. 'Every battery we put in a truck or van counts for 5 to 50 households buying an EV, and businesses often have hundreds of vehicles.'By 2025, all urban deliveries of groceries, parcels, furniture, and other goods should be done by an electric vehicle.'But just as the car market has a limited choice of EVs in Australia, the range of battery-powered trucks is even more restricted, as is the infrastructure to support them.Pepsi in the US took delivery of its first 36 Tesla Semi electric trucks before Christmas, with another 64 on order to the soft drink giants by the end of the year.But questions have already been raised about range issues when fully laden with cola.The Tesla Semis carrying potato crisps by PepsiCo subsidiary Frito-lay can travel a staggering 684km and still have 20 per cent left in the batteries.",
        "But once the same Semis are loaded up with Pepsi, they are travelling just 160km, according to PepsiCo Vice President Mike O’Connell.",
        "However it's claimed his comments have been taken out of context and don't refer to range but refer to the distance the trucks need to travel between Pepsi distribution centres.Electric trucks also require different support infrastructure to recharge them.The massive batteries required to haul up to 40 tonnes would take hours to recharge even on the fastest current superchargers.Another option though is to simply swap out rundown batteries for a new set of fully charged cells at special truck stops. The depleted batteries can then be recharged and returned to another truck. Cost is also another huge issue for the electrification of haulage vehicles, with battery-powered vehicles costing two or three times the price of diesel equivalents.Fuel costs are slashed by a move to electric power - with dramatically reduced servicing costs too - but it requires huge upfront costs to buy the vehicles, with the savings only realised over the lifetime of the truck.The Australian Trucking Association has joined the call for greater action and a national strategy on converting haulage fleets to battery power.'Zero emission trucks will deliver lower costs, lower emissions and more choice,' says the ATA.",
        "'Without a national electric vehicle strategy. trucking operators have been locked into existing vehicle technology, with higher running costs and higher emissions. 'Existing regulatory, financial and infrastructure barriers are preventing a faster adoption of zero emission trucks.'They add: 'We know that Australia’s trucking industry can reduce emissions whilst driving a growing economy because we have done it before. 'Australia has achieved a considerable reduction in noxious emissions at the same time as the size of the truck fleet and the kilometres travelled have increased substantially. 'This has been made possible by the investment decisions of industry – often well ahead of government regulation – to deliver both cleaner air and economic growth.'",
        "The other issue facing Australia is the requirements of the local market, such as right-hand drive and restrictions on truck width and axle size.The ATA say they want to see a National Electric Vehicle Strategy which includes reforms to Australian Design Rules, including increased width and massa zero emission truck purchase price incentive, investment in electric recharging and hydrogen refuelling infrastructure for trucks and national reform on road user charging. Just as with the problems facing electric cars - and especially electric utes - Australia remains a niche market and EVs are a niche product within that market.Overseas manufacturers so far have little incentive to convert existing products for the Australian market until sales take off, meaning choice - and competition - is limited.'We need drastic intervention from the government to make electrification more appealing to businesses, deploying both the carrot and the stick,' say Adiona.",
        "'Federal and state leaders must prioritise urban spaces and last-mile delivery, combining financial incentives with emission caps. 'An emissions limit on new commercial cars sold that would decline to zero by 2035 would effectively give businesses 12 years to phase out all petrol vehicles.'They have called for state government to lead the way, but are dismayed by the lack of action and branded it 'farcical'.'Local governments need to do more to compensate businesses,' says the report. 'A small delivery business with five petrol or diesel vans would need to be fully compensated to switch to EVs, with a far bigger sum than just $3,400 per vehicle.'It adds: 'Currently, there is little consensus on a state level, and that needs to change fast.'It’s farcical that New South Wales has earmarked $105million for fleet electrification, while Victoria has only allocated $5million. 'Others are yet to implement schemes for fleet electrification schemes at all.'"
    ]
}