{
    "articleURL": "/wires/ap/article-12052833/Acu-lineup-Braves-make-flurry-moves.html",
    "content": [
        "ATLANTA (AP) - After a painful week, Ronald Acuña Jr. was back in the lineup for the Atlanta Braves on Friday night as they opened a weekend series against the Baltimore Orioles.",
        "The slugging right fielder left a victory at Miami the previous day after fouling a ball off his left knee. On Monday, he was plunked in the back of the left shoulder with a pitch against the New York Mets, also forcing him out of the game.Acuña is off to a dazzling start, hitting .355 with six homers, 20 RBIs, 29 runs and 15 stolen bases.While Acuña was good to go in leadoff spot, the Braves made a flurry of moves before facing the Orioles.Atlanta bolstered its bullpen by activating right-hander Raisel Iglesias, who had been the projected closer until he was shut down in the final week of spring training with shoulder inflammation.Iglesias made three rehab appearances with Triple-A Gwinnett, allowing one run in three innings with five strikeouts and no walks. A.J. Minter has been handling the closer duties, recording seven saves but also getting hammered in several outings, leaving him with a 7.47 ERA.",
        "In another move, the Braves placed utility infielder Ehire Adrianza on the 10-day injured list, retroactive to Tuesday, with right elbow inflammation. Braden Shewmake was recalled from Gwinnett to make his big league debut as the starting shortstop.In spring training, Shewmake and Vaughn Grissom battled to be Dansby Swanson's successor until the Braves surprisingly sent both to the minors, installing Orlando Arcia as the starter.",
        "Grissom was recalled after Arcia sustained a microfracture in his left wrist. Now, Shewmake is getting a shot after Grissom made five errors in 18 games.\"It's very surreal. Turned the corner, and just seeing the ballpark, I think that's when it set in the most,\" Shewmake told reporters before the game. \"It was kind of a whirlwind of emotions.\"Outfielder Michael Harris II, last season's NL rookie of the year, was not in the lineup for the second straight game because of a jammed right knee, though the injury wasn't considered serious. He worked out before the game and was listed as day to day.Finally, the Braves announced that catcher Travis d´Arnaud was beginning a rehab assignment with Gwinnett.D'Arnaud hasn't played since he sustained a concussion on April 8.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}