{
    "articleURL": "/wires/reuters/article-12061039/Vanguard-overcomes-Republican-challenge-US-utility-stakes.html",
    "content": [
        "By Ross Kerber",
        "May 8 (Reuters) - Vanguard Group, the largest provider of mutual funds, has secured regulatory approval to continue to own big stakes in U.S. power utilities, overcoming Republican concerns over its environmental, social and governance (ESG) policies.Various Republican politicians and officials had questioned the company's application to the Federal Energy Regulatory Commission (FERC), including a group of 13 state attorneys general who sought a hearing on whether granting Vanguard's request to renew its right to own more than 10% of voting securities of publicly listed power utilities would be in the public interest.Regulators had previously allowed Vanguard to exceed that antitrust limit on the basis that this would not interfere with the utilities' operations.In a notice posted on its website on Monday, FERC said Vanguard's request for a three-year extension of \"a blanket authorization\" to acquire securities of U.S. utilities had been granted. The notice did not refer to the Republican concerns.While the extension simply preserves the status quo, it was an important test for the ability of the investment giant, which oversees some $7.6 trillion in assets, to limit the fallout of a growing backlash against ESG. The backlash has been fueled by Republican politicians arguing against the private sector taking a strong stance on issues such climate change and diversity.",
        "An adverse decision could have forced Vanguard to sell down stakes in companies such DTE Energy Co and Eversource Energy, of which it owns 11.9% and 12.95%, respectively.In a filing with FERC in November, the Republican attorney generals had cited Vanguard's \"environmental activism\" and suggested it could lead to the shutdown of fossil-fueled power plants in their states.Vanguard countered that its funds do not exert control over the decisions of the utilities. It also quit in December one of the climate change alliances in the crosshairs of Republicans, the Net Zero Asset Managers initiative.Vanguard reiterated in a statement on Monday that it leaves \"management decisions to companies and policy decisions to policymakers.\"A representative for Indiana Attorney General Todd Rokita, one of the leaders of the group challenging the FERC extension, said he would comment in coming days. Representatives for FERC did not provide further comment. (Reporting by Ross Kerber in Iowa City Editing by Greg Roumeliotis and Marguerita Choy)"
    ]
}