{
    "articleURL": "/wires/reuters/article-12059955/Jordan-strikes-Iran-linked-drugs-factory-southern-Syria--sources.html",
    "content": [
        "Strike comes days after veiled threat by Jordan",
        "Jordan says it is growing impatient with Iran-backed drug warBy Suleiman Al-KhalidiAMMAN, May 8 (Reuters) - Jordan carried out rare air strikes on southern Syria on Monday, hitting a Iran-linked drugs factory and killing a smuggler allegedly behind big hauls across the two countries' border, local and intelligence sources said.The sources said one strike hit an abandoned drug facility in Syria's southern Deraa province linked to the Iran-backed Lebanese group Hezbollah, which is allied to Syria's government.Another strike on the village of Shaab, in the adjacent province of Sweida near the Jordanian border, killed Syrian drug kingpin Marie al-Ramthan and his family while they were at home.\"Both Ramthan's home and the facility were left in ruins,\" said Ryan Marouf, a Syrian researcher tracking the drug trade.The drugs factory in the Deraa town of Kharab al Shahem was believed to have been a meeting point for Hezbollah paid smugglers, Marouf said, corroborating accounts by local sources familiar with the matter.Ramthan, a major drug dealer in southern Syria, has recruited hundreds of Bedouin transporters who join the ranks of Iran-linked militias that hold sway in southern Syria, Jordanian and regional intelligence sources say.He had been sentenced to death on several occasions in recent years in absentia by Jordanian courts for drugs trafficking, judicial sources say.",
        "Two regional intelligence and a Western diplomatic source who tracks the situation in southern Syria confirmed that Jordanian war planes had hit the two drug related targets in a rare raid inside Syria since the over decade-old conflict.Jordan is both a destination and a main transit route to the oil-rich Gulf countries for captagon, a cheap amphetamine that Western and Arab states say is produced in and exported by war-ravaged Syria.Syrian President Bashar al-Assad's government denies involvement in drug-making and smuggling. Iran says the allegations are part of Western plots against the country.Hezbollah also denies involvement in the drugs trade and says Jordan's allegations echo Washington's campaign to undermine Iran's influence in the region.The incident comes only days after Jordanian Foreign Minister Ayman Safadi threatened to strike inside Syria if Damascus would not rein in smuggling. The Iran-linked drug war posed a threat not only to Jordan's national security but also to Gulf countries, Safadi said.The strikes were a message to Damascus that it should not mistake Amman's resolve at time it was leading an Arab effort to end Syria's estrangement, two officials said, speaking on condition of anonymity.Jordanian officials say their concerns about the rise in drug smuggling had been raised in recent months in security meetings with Syrian authorities, where they received pledges but had not seen any real attempt to clamp down on the trade.",
        "(Reporting by Suleiman Al-Khalidi; Editing by Angus MacSwan)"
    ]
}