{
    "articleURL": "/wires/ap/article-12046931/Pavelski-Draisaitl-score-4-goals-NHL-playoff-games.html",
    "content": [
        "Edmonton's Leon Draisaitl and Dallas' Joe Pavelski made some history in the NHL playoffs, even if they couldn't really celebrate it.",
        "Draisaitl and Pavelski became just the second pair of players to each score four goals in a playoff game on back-to-back days and the first in 35 years. They're the first to do so with their teams each losing.\"It´s pretty crazy amazing to get four,\" Ray Ferraro, the last player to score four goals in a playoff game his team lost, said by phone Thursday. \"And then you lose and you´re like, `What the hell just happened?´\"Asked after the Oilers' 6-4 loss at Vegas on Wednesday night in their series opener if he took any joy in scoring four goals, Draisaitl replied: \"No. Nope.\"Stars coach Peter DeBoer after his team's 5-4 overtime loss in Game 1 against Seattle called Pavelski's performance epic and added, \"Ashamed we wasted it.\"Told of DeBoer's comments, Edmonton coach Jay Woodcroft put the focus on the rest of his team that didn't keep pace with Draisaitl.",
        "\"Leon had a great effort,\" Woodcroft said. \"He´s been good all playoffs here. But our team can do things a lot better.\"There's no better than Draisaitl this postseason. The 27-year-old German leads all players with 11 goals and 15 points.\"He´s a tremendous hockey player,\" Oilers teammate Mattias Ekholm said. \"He shows it night in and night out. He's the one driving the bus for us right now, and it's great to watch.\"",
        "A four-goal game has happened in the playoffs 41 times.The last players to score four goals on consecutive days were St. Louis' Tony Hrkac and Buffalo's John Tucker on April 9-10, 1988. The Blues and Sabres won.\"Obviously it´s pretty hard,\" Hrkac, now a scout with Tampa Bay, said by phone. \"You´ve got to be in the right place at the right time and get yourself open and just have one of those nights that everything seems to go in.\"Dallas and Edmonton are the first teams to lose with a player scoring four goals since Ferraro's game for the New York Islanders in 1993, when he was 4 for 4 on shots in a 6-4 loss to the Washington Capitals. Ferraro scored OT goals in each of the previous two games that series.\"For me that was the tale end of probably the greatest week I was ever going to have,\" Ferraro said. \"Every time I turned around, the puck just fell on my stick somewhere.\"Teams are 36-5 in league history when a player scores four goals. Before Ferraro's Islanders, the only other losses were Chicago to Toronto in 1986 when Denis Savard had four and Toronto to Philadelphia in 1977 when Lanny McDonald did it.\"You want to win the game,\" Hrkac said. \"You´re in a playoff game, so you´re trying to win the series and win the game. But at the end of the night, they went in for you that night. That´s about it. You´re not going out there to score four goals. You´re just going out there to help the team win.\"",
        "Ferraro acknowledges it's a strange deal to accomplish that feat and lose, knowing exactly how Draisaitl and Pavelski feel.\"Whether you say it at the time or not, as you look back there´s a personal satisfaction to it,\" he said. \"At the time, you want to win. You´re doing everything you can to win. It just happened to be your night, and it doesn´t feel great because you still lost.\"___AP Sports Writers Stephen Hawkins in Dallas and Mark Anderson in Las Vegas contributed to this report.___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}