{
    "articleURL": "/news/article-12053041/Broadchurch-star-calls-inquiry-doctor-saved-baby-sacked-raising-safety-concerns.html",
    "content": [
        "Obstetrician and gynaecologist Dr Martyn Pitman sacked from Royal HampshireColleagues and patients including Broadchurch star Sarah Parish show supportA star of hit TV crime drama Broadchurch has called for an inquiry into why the doctor who saved her baby's life was sacked after 'raising safety concerns'.",
        "Dr Martyn Pitman, a 'dedicated and brilliant' obstetrician and gynaecologist, had worked at the Royal Hampshire County Hospital in Winchester for more than two decades until he was let go last month.But colleagues and hundreds of his former patients, including actor Sarah Parish, who has appeared in Broadchurch, Peak Practice and Bancroft, have made their support for Dr Pitman known over social media.They claim managers had their sights set on him since he raised concerns over safety more than three years ago - when he got an electric shock from a piece of equipment in the operating theatre.Ms Parish said that 'there needs to be an inquiry, without a shadow of a doubt'.",
        "The reason for Dr Pitman's dismissal have not yet been made public and Hampshire Hospitals NHS Foundation Trust have said they cannot discuss cases relating to individual employees, The Times reports.The paper understands that no concerns over his competency as a doctor were raised and there have been no suggestions of improper behaviour.Dr Pitman is reportedly expected to challenge his sacking at an employment tribunal.Ms Parish was looked after by Dr Pitman through her two pregnancies - firstly with her daughter Ella-Jayne, who was born with a congenital heart defect after a 'dramatic' emergency caesarean section.",
        "Ella-Jayne sadly passed away when she was eight months old.The actor's second pregnancy with her daughter, Nell, resulted in a complicated birth when she was taken in five weeks early.She said nobody could help but Dr Pitman rang 'every single hospital in the country' to get the people she needed to deliver the baby at midnight on a Saturday.Ms Parish said he got a team together who managed to deliver her daughter in theatre 'in the nick of time', saving her daughter's life.Consultant obstetrician and gynaecologist Alexander Taylor, who was an adviser for the Ockenden review on safety at maternity wards, said Dr Pitman's sacking left a 'huge gap' in the safety of maternity services for women in Winchester.The doctor who trained with Pitman from 2004 to 2012 told the Times that local services would not be able to deal with his absence given the crisis in maternity staffing.Dr Pitman and his family are not able to comment because of legal advice they have taken. An employment tribunal is reportedly scheduled for this year.On social media, one mother said it was thanks to Dr Pitman that they had their son. She said: 'Martyn has looked after me for 20 years now, without him we may not have had our beloved Jake and I am horrified to learn more and more of the way he has been treated.",
        "'Described in the paper by one of his patients as a Superhero and talking to a few of my friends, I can see that there are many of you who feel the same.'A spokesman for the trust told the Times: 'Hampshire Hospitals NHS Foundation Trust takes all complaints, including grievances and whistleblowing made by its staff, extremely seriously.'Each is handled impartially, professionally and in line with robust policies. In certain cases, this includes the commissioning of independent reports/reviews by outside experts to ensure the highest levels of scrutiny. In addition, every effort is made to support the health and wellbeing of those involved in what can be a challenging process.'We do not comment on cases relating to individual employees or former employees, particularly where there are ongoing processes.'At Hampshire Hospitals we actively encourage all of our staff to speak up when they have concerns – no matter what they are – and actively support those who do. This can be done in a number of ways, including anonymously and in complete confidence via our Freedom to Speak up Guardians or using the Speak in Confidence System.'"
    ]
}