{
    "articleURL": "/femail/article-12043131/We-paid-150-000-debt-two-years-using-7-baby-steps-method.html",
    "content": [
        "Brittany and Anthony Xavier, both 36, opened up about their finances on TikTokThey took one of Dave Ramsey's finance classes after they got engaged The couple used the debt snowball method to pay off their bills  An influencer couple has revealed how they paid off $150,000 in debt in two and a half years after learning how to budget in a financial class. ",
        "Brittany Xavier, 36, rose to fame as one of the original fashion influencers when she launched her now-defunct blog 'Thrifts and Threads' in 2013 — the same year she married her husband, Anthony Xavier. The social media star, who has since shifted her blog posts to an eponymously named website, has more than 5.2 million followers on TikTok, where she shares daily vlogs about her life. In a recent viral video, Brittany and her husband opened up about how they paid off their debt early on in their marriage, saying they still have monthly budget meetings.",
        "'When we got married, we had about $120,000 in student loan debt and about $30,000 in credit card debt,' Anthony, 36, explained. Brittany was already mom to her now-16-year-old daughter Jadyn when they met over a decade ago, and she knew financial problems were one of the top reasons for a divorce. After they got engaged, they took one of Dave Ramsey's financial courses because they 'wanted to be on the same page with finances' and felt their 'spending was a little out of control.' 'We didn't really come from money, and we weren't really taught how to manage our money, so we kind of carried that into our marriage,' Anthony said. 'We both had jobs starting at 16, but I feel like every time I got a paycheck I would just spend it that weekend,' Brittany added. ",
        "The couple was living paycheck to paycheck, but they knew they needed to change their spending habits before they started taking more money. Otherwise, they would end up spending their extra income. Brittany and Anthony followed Ramsey's '7 Baby Steps,' starting with saving $1,000 for their emergency fund. When that was in the bank, they focused on paying off all their debt by following the debt snowball method. They listed all of their student loan and credit card debts and put them in order by balance from smallest to largest, regardless of the interest rate. ",
        "After setting their budget, they paid the minimum payments on everything but the smallest debt, which they worked on paying off as quickly as possible. 'What you want to do is give yourself motivation when you start paying things off to keep going,' Anthony explained of the technique. Once they paid off their smallest debt, they took that payment and put it towards their second-smallest debt while they continued to make the minimum payments on their other bills. ",
        "Save $1,000 for your starter emergency fundPay off all debt (except your mortgage) using the debt snowball methodSave 3–6 months of expenses in a fully funded emergency fundInvest 15% of your household income in retirementSave for your children’s college fundPay off your home earlyBuild wealth and give Source: Ramsey Solutions  ",
        "'We were really strict. We didn't go out to eat. We were on a clothing budget. We were on a gas budget,' Anthony recalled. 'All of our money each month was accounted for. So our budget totaled zero at the end. Every dollar had a name before we even got our paycheck,' Brittany chimed in. 'So that was really helpful because it helped us not overspend. ",
        "'We said no to our friends going out. We truly sacrificed during that time because we knew that it was going to get us into the direction we wanted to go.'Anthony noted that they were also motivated to find other streams of income because they wanted to make more money to attack their debt. In addition to his full-time job at a food ingredients company, he picked up freelance SEO work. Brittany, who was working at a CPA firm, sold paper flowers on Etsy. They also shopped at Big Lots and resold the items online for a profit. The TikTok star stressed that this wasn't easy, but they knew that once they paid off their debt, they would have that money to use as disposable income. Brittany recalled how excited they are when they paid off their first credit card bill, saying they lived like college students to keep up the momentum. 'We did not spend how we saw some of our other friends' spending,' she explained. 'We were like, \"Aww, I wish we could do that, but, no, we need to stay focused.\"'Anthony said receiving that last email from Sally Mae after fully paying off his student loans was 'one of the most liberating feelings' he ever had. ",
        "'We are still debt-free, except for our mortgage, which has allowed us to be able to give our 10 per cent to charities,' he added. 'It laid the foundation to be able to purchase our first home and now our second home.'",
        "The couple welcomed their one-year-old daughter Poppy in 2021 and moved into their 'forever home' in Pasadena, California, last year.  Brittany noted that they still follow the spending habits that helped them get out of debt and continue to have monthly budget meetings. 'Our mindset has shifted to investing and making sure our kids are set up with their savings and also teaching them those money skills that we truly didn't have,' she said.Brittany and Anthony went into more detail about their budgeting in a follow-up video, saying they followed the envelope system. They would withdraw their money from the bank and physically put the allotted amounts per their budget in envelopes that were labeled by category. The couple had nine categories: groceries, restaurants, gas, medicine/pharmacy, haircare/makeup, car maintenance, personal, entertainment, and gifts.Once they spent the money, it was gone.    'The idea with the cash envelopes is that mentally you don't want to spend as much when you see the cash going out versus a debit card where you see the amount but are not really feeling it go away,' Brittany explained. ",
        "During their monthly budget meetings, they would look at their spending and adjust where needed.  'The budgeting brought us closer together,' she said, 'because we had this common goal and each month were excited to sit down and be like, \"Okay, how did we do?\"'"
    ]
}