{
    "articleURL": "/news/article-12060823/Minnesota-Burger-King-boss-facing-redundancy-hits-117m-Chairman-slams-lazy-stores.html",
    "content": [
        "Chairman Patrick Doyle said last week branches weren't working hard enoughHis words angered a manager at a store in Minnesota, who said he 'didn't agree' Doyle was lured out of retirement by the burger chain last year with a $117m deal A Burger King manager facing redundancy has slammed the fast-food giant's multi million pound chairman after he blamed lazy franchisees for a string of closures.",
        "The boss at a Minnesota store - one of hundreds being axed by the restaurant chain - insisted 'we're busting our a**** off' as he hit back at accusations some were not pulling their weight.Up to 400 outlets will be shuttered across the country this year as the iconic burger chain culls underperforming stores in a bid to keep pace with its rivals.Last week, Patrick Doyle, chairman of Burger King's parent company Restaurant Brands International, implied those who face the chop only have themselves to blame.'There will always be a minority [of franchisees] who aren't dedicated, enthusiastic operators', he said. 'We'll work with them to leave the system and move on to do something else.",
        "'There simply is no room for franchisees who are not willing or able to work hard to operate restaurants that are better than the system average over the long term.'But the Minnesota store manager - who did not give his name - said he 'didn't agree' with Doyle's assessment.'I don't know about the businesses that aren't trying, but we certainly are,' he told DailyMail.com. 'Our business, we're busting our a**** off every day. I feel like we're doing a good job.'Worryingly, he appeared oblivious to the fact that his store was on a list released by one franchisee as facing closure.",
        "'I have no clue. I've never heard about this,' he said.Doyle, 59, who was CEO of Domino's from 2010 to 2018, was lured out of retirement by the burger chain last year as it attempted to transform its business.As chairman, he won't receive a salary, but he was paid $117million in stock and option awards, according to Restaurant Business Online.The home of the Whopper has already said it expects to close a record number of stores in 2023, with 124 already shut in the year to March.Two of its franchisees, representing more than 140 locations, have gone bust: Meridian Restaurants and Toms King.",
        "Another, EYM King, announced it was closing 26 restaurants in Michigan, with 424 employees set to lose their jobs.One analyst told DailyMail.com last month that the chain could enter a 'death spiral' if it failed to turn its fortunes around.But in its first quarter results, the company reported that despite store closures, its comparable sales rose 8.7 percent.The brand will be hoping that its $400 million 'Reclaim the Flame' turnaround plan may be starting to work.The plan, launched in September 2022, aims to accelerate sales growth, drive franchisee profitability, revive run-down restaurants and streamline overly complicated menus and operations.",
        "Michigan2155 Gratiot Ave9871 Livernois 8201 Woodward Ave18021 Kelly Rd20200 Grand River Ave13600 W. McNichols Rd15500 W. Seven Mile20240 Plymouth Rd12661 Mack Ave9239 Gratiot Ave17440 E. Warren16245 Livernois Ave3863 W. Jefferson Ave. 10336 W. 8 Mile Rd3625 South Dort Hwy3801 Clio Rd13324 Woodward Ave28203 Plymouth Rd34835 Plymouth Ave31456 Woodward Ave23660 Telegraph Rd30711 Southfield Rd1113 E. West Maple Rd2411 E. 8 Mile Rd9774 E. M-36Minnesota 209 Nokomis Street, Alexandria 926 Central Avenue Northeast, East Grand Forks  528 Western Ave, Fergus Falls 21 Depot Street, Litchfield 205 Lake Street, Long Prairie 586 Southwest 1st Street, Montevideo 516 East Bridge Street, Redwood Falls 100 21st Street North, Moorhead 1611 US-12, Willmar Montana1422 West Main Street, Lewistown520 North 27th St, Billings1211 9th Street West, Columbia FallsKansas   2201 East Kansas Ave, McPhersonNebraska3627 South Lincoln Avenue, York2504 O St, Lincoln4230 North 27th Street, LincolnNorth Dakota 3765 Gateway Drive, Grand ForksUtah171 East Gateway Dr, Heber7810 South 1300 E, Sandy 10235 South State Street, Sandy729 North Main St, Clearfield1466 East 3500 North, Lehi119 East Crossroads Blvd, Saratoga Springs147 East Bangerter Highway, Draper5390 South 1900 West, Roy1660 West North Temple St, Salt Lake CityWyoming 1902 Mountain View Drive, Cody "
    ]
}