{
    "articleURL": "/sport/football/article-12053023/Neil-Warnock-ranks-Huddersfield-great-escape-biggest-achievement.html",
    "content": [
        "Warnock and Huddersfield secured Championship survival on Thursday nightThe 74-year-old will now leave the club after completing what he set out to doHe referenced the usefulness of experience for managers such as Roy Hodgson 'It will be good for the oldies,’ said 68-year-old Sam Allardyce when asked what it would mean to steer Leeds United clear from relegation.",
        "Roy Hodgson, 75, has kept Crystal Palace in the Premier League while Neil Warnock, 74, secured Huddersfield Town’s Championship status with a win against his boyhood club Sheffield United on Thursday.‘He’s right — look at what happened with Neil Warnock at Huddersfield,’ said Pep Guardiola after Allardyce sang the praises of older coaches and put himself up there with the likes of the Manchester City manager, plus Jurgen Klopp and Mikel Arteta.Warnock’s great escape act in West Yorkshire has been nothing short of remarkable, as Guardiola pointed out. He has achieved safety with a game to spare.Since he cut short his holiday to take the job in February with Huddersfield only off the bottom on goal difference, only four teams have won more points in the Championship and his side have played 11 of the top 13 in those 14 games in charge.",
        "And Warnock’s first port of call when he eventually made way from the celebrations and strolled into the press conference room on Thursday evening was to thank one of the local reporters, as he turned to Steven Chicken of the Huddersfield Examiner.‘Can I thank you Steven for picking the team? My team was different and then I read your column in the paper this morning and decided to go a little bit more defensive,’ Warnock said. On Thursday morning, he opted for Rarmani Edmonds-Green at right wing-back and played Josh Koroma up front, instead of Joseph Hungbo.",
        "‘Where do you want your statue (for saving Huddersfield) then?’ asked Chicken. ‘There’ll be a few pigeons happy about that, all over the country,’ responded Warnock in typical fashion.Huddersfield may have been 90 minutes away from the Premier League this time last year, when they were beaten by Nottingham Forest in the play-off final, but the euphoria from the 20,000-plus in West Yorkshire after a 1-0 win to secure their Championship status showed just how much survival meant — as did the adulation for Warnock around the ground. Warnock himself ranked it as the biggest achievement of his 43-year managerial career.‘Right at the top — I’ve not had anything more difficult,’ he told Mail Sport. ‘I don’t think I’ve been any prouder. I think it’s a massive achievement.‘When (assistant) Ronnie Jepson phoned after the Stoke City game (which Huddersfield lost 3-0), I was in New York and he said to me, “Gaffer, are you sure? It’s the worst team I’ve ever seen in the Championship.”‘So to come and then have two 4-0 defeats and still get out, it’s just fantastic. I can’t be any prouder to be the man in charge when we’ve done something like this.‘And I like to think we’ve had a bit of humour and a laugh along the way. I try to take all the pressure off the players by being a little bit humorous and even at half-time, I said a couple of funny things just to break it up.",
        "‘I didn’t swear too much. You’ve got to get a dressing room that wants to do it for you, that wants to die for three points.’ From seven wins in 31 games before Warnock’s arrival to six wins in 14 under him and Jepson, they have transformed the fortunes of the Terriers. The pair were even given a guard of honour by Huddersfield’s squad.‘That’s the first time I’ve ever had one of them,’ admitted Warnock. ‘It was quite emotional all the way around the ground. It’s been an amazing rollercoaster ride. I think this will have converted youngsters to be Huddersfield Town fans for years to come.‘I remember going to Bramall Lane one night and it was amazing. I think it was Arsenal we were playing, in floodlights, and I just remember, “Wow — Joe Shaw, Doc Pace”, how brilliant they were, and that just did me. I had to be Sheffield United and I hope this will have created a few more Huddersfield Town fans.‘You can’t replicate an evening like this when that whistle goes — no matter what you say. As old as I am, it’s still the same when that whistle goes and you know how much it means. It’s just a fantastic feeling.’Asked why himself and Hodgson have had such success since answering their SOS calls, Warnock stressed the importance of experience.",
        "‘But he has some good players doesn’t he, Roy? Wilfried Zaha, Ebere Eze, Michael Olise and all them. B***** hell, I’d have that job,’ joked Warnock.‘When you get older, I think it’s the calmness and the confidence you bring. You look at what Roy’s done and he’s just given them freedom. Like Jaheim Headley here. At half-time, I gave him a roasting telling him, “I’d have played somebody else if I’d known you were going to cut back inside all the time. Take him on. I’m not bothered if you lose it”.‘In the second half he was superb and it’s just directing them really.’As the questions kept on coming, he laughed: ‘I could stop here with you lot all night but I want a Negroni now!’‘Anyone else?’ asked Warnock, before noticing former Sheffield United striker Carl Asaba, who played under him at Bramall Lane, in among the dozen or so journalists.‘Sarbs, I didn’t b***** recognise you with your hat on! I’ve only just seen you now. B***** hell, are you all right? Is your family all right?’ said Warnock. He was like a child buzzing with excitement — more than 1,600 matches into his managerial career but still in love with the game.",
        "Monday’s home clash against Reading will be a survival party now for Huddersfield fans at the expense of the opposition, who were sent down as a result of Thursday’s win.",
        "Warnock will also say goodbye to the fans as his short-term contract expires. For now, he has no plans of extending his deal.‘I couldn’t do 10 months of this. I’ll be back next February somewhere. I’m sure she (wife Sharon) will get fed up of me at home,’ joked Warnock. ‘But I think the job’s done here for me. I’ve really enjoyed it.’Now those a few miles up the M62 will be hoping that another managerial veteran in Allardyce will lead them to their own great escape."
    ]
}