{
    "articleURL": "/sciencetech/article-12060635/YOU-eat-pigs-genetically-modified-using-CRISPR.html",
    "content": [
        "The FDA approved the first sale of generically edited pork in restaurants The sausages come from pigs that were altered to pass down elite DNA READ MORE:  Would you eat meat from a gene-edited animal?The US Food and Drug Administration (FDA) approved the sale of genetically modified pigs at restaurants and grocery stores.",
        "The altered pork, made as German-style sausages, was developed by scientists at Washington State University who used CRISPR to improve genetic traits in livestock.The team used the gene-editing tool to pass elite DNA from one breeder to several others, which let more males pass on desirable traits and improve food production.This process could produce livestock that can thrive in harsh conditions – and still provide adequate nutrition for people. ",
        "Jon Oatley, a professor at Washington State University(WSU), led the research and worked closely with the FDA to gain approval.Oatley and his team used CRISPR on five pigs to demonstrate that food made from the animals is safe and that an academic institution can achieve this type of FDA authorization.The two-year-old pigs were processed at the WSU Meat Lab, and the US Department of Agriculture inspected the meat as it does with all meat products. The team edited the pigs to let them pass traits from another male down to other pigs. Known as surrogate sires, this technology first gene-edits male animals to be sterile by knocking out a gene called NANOS2 specific to male fertility. These animals can then be implanted with another male's stem cells, creating sperm with that male's desired traits to be passed on to the next generation.",
        "Essentially a high-tech form of selective breeding, surrogate sire technology can greatly expand the dissemination of valuable genetics in livestock.It has the potential not just to improve meat quality but the health and resilience of livestock in the face of changing environmental conditions, a critical goal for increasing protein sources in developing nations. ",
        "Environment Secretary George Eustice insisted that gene-edited products would not need to be advertised as such because they are 'fundamentally natural.' ",
        "Piglets born from the surrogate sires have not been approved for sale as of yet but will be reviewed by the FDA for possible inclusion in the food chain. Approving the initial work took about two years and hundreds of thousands of dollars. 'The original intent in making these animals was to try to improve the way that we feed people,' Oatley said. 'And we can't do that unless we can work with the FDA system to get these animals actually into the food chain.' WSU is the first organization to receive FDA approval for genetically altered pork, but a company named Acceligen obtained approval in 2020 for products made from 'Slick-Haired Cattle,' which are gene-edited to have coats that increase the animals' resilience to higher temperatures. Oatley said that the public often holds many misconceptions about gene editing and hopes the WSU example will help dispel misinformation and improve perceptions of this technology.",
        "'There's a trust that comes with university-based research,' Oatley said. 'At WSU, we're all about the science. 'We just want to ensure the research is valid and the animals we produce are healthy.'"
    ]
}