{
    "articleURL": "/news/article-12058841/The-Peoples-Princess-Royal-experts-hail-Kate-Queen-waiting-Coronation-weekend.html",
    "content": [
        "Kate was one of the stars of the whole Coronation weekend, say royal experts The Princess of Wales secured her place in the nation's hearts over the Coronation weekend and showed herself to be the new 'Queen-in-waiting', royal experts said today.",
        "Kate Middleton, 41, was the epitome of charm during multiple walkabouts with the public which saw her hugging children and posing for selfies. Royal author Phil Dampier told MailOnline how the mother-of-three engineered a perfect 'balancing act' that saw her shine just enough to not 'overshadow Charles and Camilla'.'It was the weekend when Kate really looked like a Queen-in-waiting,' he said today.'She was one of the stars of the whole event, not just in the Abbey but at all the outside events.",
        "'She showed her caring side when she gave a hug to a girl who was overwhelmed to meet her and touched hearts everywhere.'Both she and William are showing they are in tune with modern Britain and that bodes well for the future of the monarchy.' He added: 'Kate looked great in her own right but didn't do anything to overshadow Charles and Camilla, which is how it should be.'And as a mother it was lovely to see her taking Charlotte and little Louis into the service.'She knows they will have important roles in years to come, and so by introducing them to public events at a young age she is preparing them.'Mr Dampier said the image of the Waleses riding together back to Buckingham Palace in the Diamond Jubilee Coach on Saturday showed how they were a 'tight family, but also the future of the institution.' ",
        "He described it as a 'delicate balancing act' that both she and William pulled off, which he believes will have given the monarchy a 'boost'.He continued: 'Young people might not be so keen on the royals, but as they get older they sometimes change their minds and Kate will be a massive influence, not just as a mother, but as a wife, fashion and social influencer in the age of Tik Tok.'We will see much more of them and a lot rests on their shoulders now that Harry and Meghan have left.",
        "'All hopes are on them and so far they are showing they are up to the task.' Royal expert Richard Fitzwilliams branded the bank holiday weekend a 'triumph' for the Princess of Wales. He said both Catherine and William have 'star power' when it comes to performing walkabouts. The couple delighted flag-waving fans with their impromptu appearance in Windsor yesterday, smiling for selfies and warmly greeting members of the public who had turned up ahead of this evening's concert.One little girl was so overwhelmed at meeting Kate, that she was comforted with a royal hug in front of cheering onlookers.The princess, who had crouched down to speak to her, continued chatting to the girl, who nodded her head and gave a small shrug as Kate patted her back.",
        "The duo's 40-minute walkabout in Windsor's famous Long Walk saw them sip cocktails before they were shown a special coronation ale dedicated to the King. Mr Fitzwilliams told MailOnline: 'Whether greeting those lining the Mall the day before the Coronation and visiting a Soho pub or greeting some of the crowds at Windsor yesterday, they were clearly very popular and much sought after. 'For a few of those who met Catherine, a selfie or a hug was something they will always remember. 'Her skill as a photographer has kept us up to date with important anniversaries in the lives of her children too. ",
        "'On their trips abroad they have always mixed the formal and informal with considerable success.' When the couple stopped to talk to royal fan Sue Watson and her friends in Windsor yesterday, they offered the future King a homemade cocktail, which he sipped and complimented.The prince was also fascinated by cans of Return Of The King coronation ale which the group had brought, and holding one asked: 'That's from Windsor?'One woman in the crowd complimented Kate on the headpiece by Jess Collett x Alexander McQueen, which she wore for the coronation, telling her: 'I loved your headpiece.'The item featured silver bullion, crystal and silver thread work three-dimensional leaf embroidery, and in response Kate touched the woman on the shoulder as if to say 'thank you'.",
        "Speaking to MailOnline today, Mr Fitzwilliam agreed, adding: 'Kate and William have a unique worldwide profile and are the most glamorous of all royal couples. 'She looked especially stunning at the eve-of-Coronation reception at Buckingham Palace. 'Catherine also looked supremely beautiful wearing an Alexander McQueen dress under her robes with an exquisite headpiece at the Coronation. ",
        "'Her outfit was a tour de force and it was hard to look elsewhere when she was in view. She and William have earned the soubriquet of the world’s most glamorous royal couple.' Mr Fitzwilliams said the Waleses will no doubt be taking part in more royal tours, noting how Camilla, 75, has a 'well known aversion to flying.' He added: 'The Waleses are much younger and it is not possible to predict when the King and Queen will feel the need to slow down. 'Also William and Catherine may well increase the number of royal patronages they take on. They already do invaluable work for those they have.' "
    ]
}