{
    "articleURL": "/tvshowbiz/article-12040577/Jock-Zonfrillos-cause-death-revealed-MasterChef-star-died-aged-46.html",
    "content": [
        "Jock Zonfrillo, 46, found dead in Melbourne hotel room on MondayPolice sources reveal what they believe was cause of death Neighbour Scott Ayer tells what he knows about Zonfrillo familyJock Zonfrillo is believed to have died of natural causes and nothing unusual or suspicious was discovered in the hotel room where he was found dead, Daily Mail Australia understands.",
        "The MasterChef star, 46, was found dead by police at Zagame's House hotel in Melbourne at about 2am on Monday, just metres away from his former inner-city home in Carlton. The Glasgow-born chef had left his family behind in Italy, where they had recently emigrated, to return to Australia for the launch of the new season of the hit cooking show.Daily Mail Australia can reveal that when the police entered the hotel room to conduct a welfare check, officers believed that Zonfrillo had died of natural causes and didn't find anything that suggested otherwise. There was also no drug paraphernalia found in the hotel room, sources said.It will now be for the Coroner to determine the celebrity chef's specific cause of death. ",
        "On Tuesday, Daily Mail Australia revealed that Zonfrillo had secretly battled bowel cancer for years.A source said he kept his health problems from most friends and colleagues, usually receiving treatment when the Network Ten cooking program was not filming.It is not suggested Zonfrillo died of cancer, only that he had told very close friends he was suffering from the disease.It comes as the Ten Network announced that MasterChef's 15th season will premiere on Sunday, with the full support of the chef's grieving family. The network and sponsors had been determined to respect the will of Zonfrillo's grieving wife Lauren.",
        "A close friend and neighbour of Zonfrillo has since revealed that the celebrity chef sometimes opened up to him about his 'demons' over a glass of scotch.Stuart Ayer told Daily Mail Australia he and his wife struck up a close relationship with the TV star's family during the three years they were next-door neighbours.'I was a bit choked up when I found out he died, and I still am,' Mr Ayer said.'We used to sit and talk about our demons - he was open about his demons in his book, but I have my own and we'd chat about them over a scotch.'I found it really helpful - he was a great guy.'",
        "Zonfrillo opened up about his battle with heroin addiction, his rise to the top of the culinary world, and about his relationship struggles in his 2021 memoir, Last Shot.In the book, he spoke candidly about how he began working for celebrated British chef Marco Pierre White at 17, when he was homeless and addicted to heroin.When his boss realised he was sleeping in the restaurant, he found him accommodation and lent him cash.Zonfrillo moved to Australia aged 20 in 1996 and gained work at Forty One in Sydney's central business district. He was using cocaine, pills, LSD and cannabis, but kept a raging heroin addiction hidden from everyone.",
        "He went back to the UK when his visa ran out in 1997. Two years later he took his last shot of heroin in the toilets at Heathrow airport before returning Down Under, and used the experience as inspiration for his book title.Arriving in Sydney, he stayed at his then girlfriend Kelly's parents' house as he went cold turkey, a process he describes as 'horrific'.'For 10 days I was vomiting and screaming and s**ting all over the place before the fever finally broke,' he wrote.",
        "'I've always said, \"If it wasn't for food, I would've died\".' Speaking with Daily Mail Australia on Wednesday, Mr Ayer said they kept each other company during Melbourne's lengthy Covid lockdowns, and would pop their heads over the fence to ask how the other was going.'Then after lockdown, Jock would say \"I've made some food, do you want to come round?\" and we'd have dinner or something.'Speaking about Zonfrillo's relationship with his wife, Mr Ayer said 'they were a really solid couple'.'The kids were the light of his life,' he said. 'They're great kids and it's such a tragedy.'Mr Ayer gushed about the Zonfrillo family and talked about how they were 'wonderful people' and good neighbours.The Zonfrillo's moved out of their two-storey $3000-a-week rental and moved to Italy a few weeks ago. ",
        "A source told Daily Mail Australia the chef 'wanted to live in Italy for a while', but his wife was initially reluctant.'It was something he was planning, then she changed her mind,' the source said. 'She wanted change.'Zonfrillo was just settling into their new life when he had to return to Melbourne to undertake promotional work for the new season of MasterChef, which was supposed to start airing on Monday evening.Zonfrillo was also in the early stages of planning a new restaurant and had started working on a cookbook prior to his shock death. His wife and kids stayed in Rome and were expecting Zonfrillo to re-join them once his work with Channel 10 this week was complete. The family are understood to have returned to Melbourne on Tuesday night."
    ]
}