{
    "articleURL": "/wires/pa/article-12060871/Ex-England-boss-Fabio-Capello-labels-Manchester-City-best-team-world.html",
    "content": [
        "Fabio Capello reckons Manchester City are “the best team in the world” as Pep Guardiola’s side prepare for their Champions League semi-final against Real Madrid.",
        "The tie is a rematch of last year’s last-four clash, where City were knocked out in dramatic circumstances at the Bernabeu as Real mounted a stunning comeback to win after extra time.A Champions League trophy is the one piece of silverware that has so far evaded Guardiola during his nearly seven years with City.Speaking at the Laureus Awards on Monday, former England boss Capello highlighted the difference prolific striker Erling Haaland has made to City and his belief they are now the finest team on the planet.",
        "He said: “I think City is the best team in the world. This year makes the difference.“Last year, (they) missed the forward and this year you have a really important forward. Not only this – you have 24 players.“When you make the substitution, always a fantastic player is entering. Real Madrid, I think (have) 14, 15 players.“They probably will be a little bit tired (after winning the Copa del Rey on Saturday evening), but they have the best coach in the world, Carlo Ancelotti.”Two-time former Real Madrid boss Capello added: “Carlo knows everything about the openings, and we prepare the games really, really well. I hope, Carlo, we will win.”Ex-Inter Milan and Real Madrid winger Luis Figo echoed Capello’s sentiments about City’s improvement, but warned that they had their work cut out against the 14-time European Cup winners.",
        "“I think (Manchester City) are one of the best teams in the world now,” the former Portugal star said.“They are playing very good football, and in the last years, they are always in the competition, they have the experience already, they know already what to do so they don’t lose like last year.“But they play against the best club in the history of the Champions League.“Sometimes I think the history of the competition, that helps you in different kinds of moments and important moments in this competition, and everyone, I think they think that Manchester City is now a favourite for the games against Real Madrid.“But you have to count the history and count that Real Madrid is always alive until the last second of the game.“It will be nice to see, but I think for sure they are more than ready to win this beautiful competition.”Figo is hoping another of his former clubs, Inter Milan, can get the better of rivals AC Milan in the other semi-final.He said: “I expect that Inter can win, and probably that will happen, I hope!“I think Italy have to be proud this year that they have two teams in the semi-final. Fantastic performance in the Champions League.",
        "“You know anything can happen, but it’s beautiful in the same time that you have the chance to see two big games of the best club competition in the world in the same city.”:: Fabio Capello and Luis Figo were speaking at the Laureus World Sports Awards. Find out more at www.laureus.com"
    ]
}