{
    "articleURL": "/wires/ap/article-12061507/Israeli-aircraft-strike-Islamic-Jihad-targets-Gaza-Strip.html",
    "content": [
        "GAZA CITY, Gaza Strip (AP) - Israel launched targeted airstrikes in densely populated areas of the Gaza Strip early Tuesday, killing three senior commanders of the Islamic Jihad militant group in their homes and at least 10 civilians, Palestinian health officials said. Two of the commanders' wives, several of their children and civilian neighbors - including a hospital director, his wife and son - were among the dead.",
        "The attacks set the stage for what is likely to be a new round of fighting a week after an exchange of fire between Israel and Islamic Jihad. Tuesday's airstrikes targeted an apartment and house in Gaza City and a third house in the southern town of Rafah. The Palestinian Health Ministry said 20 people were wounded.Israel also targeted Islamic Jihad training sites before the airstrikes halted at daybreak. After an hourslong lull, the military said it struck a vehicle carrying anti-tank guided missiles to a launchpad in enclave's southern city of Khan Younis. Two people were killed in that attack, the Palestinian Health Ministry said, without providing their identities. No militant group immediately claimed the two as members.At midday, tens of thousands of people rushed into the streets for two giant funerals, with at least 10 bodies carried on stretchers in a mass procession in Gaza City. Children's coffins were carried next to those of their parents.Such targeted killings are rare, and in the past, Palestinian militant groups have retaliated with intense barrages of rocket fire.In a prime-time televised address, Prime Minister Benjamin Netanyahu said the country would need to be patient in the coming days and that he had instructed the army \"to prepare for every possible scenario of escalation,\" including the likelihood that this could be on multiple fronts. \"Tonight I say to our enemies, every escalation by you will be answered with an overwhelming response,\" he said.",
        "In anticipation of rocket fire, the Israeli military advised residents of communities within 25 miles (40 kilometers) of Gaza to stay close to designated bomb shelters. Israel's Home Front command ordered the closure of schools, beaches and highways in cities and towns in southern Israel, and limited public gatherings. Defense Minister Yoav Gallant approved the call-up of reserves.The Israeli military alleged that the three militants it targeted had been responsible for recent rocket fire toward Israel. It identified them as Khalil Bahtini, the Islamic Jihad commander for northern Gaza Strip; Tareq Izzeldeen, the group's intermediary between its Gaza and West Bank members; and Jehad Ghanam, the secretary of the Islamic Jihad's military council.Rear Adm. Daniel Hagari, Israel's chief military spokesman, described the three militants as \"a source of instability.\" He alleged that Izzeldeen, for instance, had been trying to establish a rocket-manufacturing operation in the West Bank.The Palestinian Health Ministry said the 13 killed in the predawn strikes included four women and four children. That included Bahtini's wife and 4-year-old daughter and Izzeldeen's two young children. In the southern city of Rafah, Ghanam and his 62-year-old wife were killed in their home, according to the Palestinian Center for Human Rights in Gaza.Other uninvolved civilians who happened to live nearby were also killed. The strike on Izzeldeen's home killed three members of a family living upstairs - Jamal Khaswan, a prominent local dentist and chairman of Al-Wafaa Hospital, his wife and his 19-year-old son, Yousef, who was studying to be a dentist like his father, the rights group reported. Russian diplomats in the West Bank said Khaswan had Russian citizenship. A widely shared video showed their distraught young daughter, Miral, arriving alone at Gaza's main hospital and crying out for her father.",
        "A simultaneous airstrike on Bahtini´s home in eastern Gaza City killed two teenage sisters living in the apartment next door, the rights group said.\"Dania´s blood was on her desk and bed. Eman was covered in debris,\" said their cousin, Ihab Adas. She said the sisters had gone to sleep shortly after Dania´s fiancée left the apartment. \"The girls' room was destroyed,\" she added.Hagari expressed regret over the civilian casualties, but said they were impossible to avoid because Islamic Jihad operates inside residential areas.From Israel´s perspective, Hagari added, the operation was over. But he said it would react to further attacks by Islamic Jihad or any other militant group. \"We have achieved our goals,\" he said. \"Now the ball is on the other side.\"The Israeli airstrikes drew condemnation from the Palestinian Authority, Jordan and Egypt, which often mediates between Israel and Palestinian militant groups in Gaza. The Arab League denounced the airstrikes as \"atrocious.\" The European Union said it was \"gravely concerned.\" France issued a stronger statement, saying it \"condemns all attacks that target civilians, and specifically those ... in which several Palestinian civilians were killed.\"Palestinian militants in Gaza vowed revenge. Dawood Shahab, an Islamic Jihad official, said there would be a \"unified Palestinian response\" to the strikes at a time and place of the group's choosing.",
        "Hamas leader Ismail Haniyeh warned that Israel will \"pay the price\" for the killings. \"Assassinating the leaders with a treacherous operation will not bring security to the occupier, but rather more resistance,\" said Haniyeh.Islamic Jihad and Hamas are both Iranian-backed groups that oppose Israel's existence and possess large arsenals of rockets and other weapons. Over the past year, the larger and more powerful Hamas has stayed mostly on the sidelines, while allowing Islamic Jihad to carry out attacks.Islamic Jihad bombarded Israel with over 100 rockets last week after one of its senior members in the West Bank died from an 87-day hunger strike while in Israeli custody. The Israeli military responded with airstrikes and the exchange of fire ended with a fragile cease-fire.Hagari said Israel had been planning the operation for the past week following Islamic Jihad's rocket fire but waited until Tuesday for what he said were the right conditions.If Hamas joins the fighting, it would likely trigger an even heavier Israeli response. Two years ago, Israel and Hamas fought a brief war that killed over 250 Palestinians and 13 people in Israel.The sudden airstrikes come at a time of heightened tensions between Israel and Palestinians, particularly in the occupied West Bank, where Israel has been conducting near-daily raids for months to detain suspected Palestinian militants, including many from Islamic Jihad. Israel says the raids in the West Bank are meant to dismantle militant networks and thwart future attacks.",
        "The Palestinians see the attacks as further entrenchment of Israel´s 56-year, open-ended occupation of lands they seek for a future state. So far, 105 Palestinians, about half of them affiliated with militant groups, have been killed by Israeli fire in the West Bank and east Jerusalem since the start of 2023, according to an Associated Press tally. At least 20 people have been killed in Palestinian attacks in Israel.Tuesday's airstrikes recalled Israel's similar targeted attacks that killed Islamic Jihad commanders in Gaza in the summer of 2022. The surprise strikes set off a three-day blitz that led to the deaths of the militant group's two top commanders and other militants. Some two dozen Palestinian civilians - who have paid a high price over the years in Israeli attacks on Gaza - were also killed.___Associated Press writers Isabel DeBre, Josef Federman and Ilan Ben Zion in Jerusalem contributed to this report."
    ]
}