{
    "articleURL": "/tvshowbiz/article-12051085/Cinco-Mayo-celebrated-Blanca-Blanco-bikini-exclusive.html",
    "content": [
        "Hollywood actress Blanca Blanco was celebrated Cinco de Mayo by a swimming pool.",
        "Cinco de Mayo is a yearly celebration held on May 5, which commemorates the anniversary of Mexico's victory over the Second French Empire at the Battle of Puebla in 1862, led by General Ignacio Zaragoza. The brunette beauty wore a skimpy yellow bikini that made the most of her assets as she worked on her California suntan while on a colorful blanket.The Tale Of Tales actress - who was last in Beverly Hills over Oscar weekend - also sipped on a Corona from the can as she tried to unwind on a Friday morning.The author of the heartbreaking memoir Breaking The Mold wore her dark hair back and had on pink lipstick as she posed for Filip Shobot.The star, who will next play therapist Alma Gomez in the movie Ash And Bone 2 -  also shared with DailyMail.com her top tips for staying slim as we head into bikini weather. ",
        "She also has posed for the Swedish brand Chiquelle with ads appearing in Elle magazine Sweden for May issue 2.Blanca said that staying slender has a lot to do with consistent exercise even if the routine is light.'I try to exercise five days a week for one hour a day,' said the Mission: Possible star.'Cardio and weight training are key. I use weights to stay toned. Ten pound dumbbells are great for toning. ",
        "'Some weeks are challenging to keep up with the routine, I try to be kind to myself when I can't do routine, and know even one day or five minutes of training a day is 100% better than nothing.'I sometimes just walk around my neighborhood for 15 minutes when I don't have time to go to the gym. 'I have a walk app too so walking to the car or going to the gas station helps, all add up.'And she has some diet tricks too. 'I eat grilled food over fried food. It is healthier for the heart and it lowers cholesterol. ",
        "'High cholesterol runs in my family gene. So I try to work on what I can that is within my control. I love French fries so it's not easy sometimes.'And she rules out meat and sugar.'For two months now, I decided to go on a pescatarian lifestyle, which is a temporary change.'That means no meats, no chicken, and only seafood. I love fish so this works for me. I often order the grilled salmon at restaurants with a side of vegetables.'Also I don't eat sugar, so no desserts, no cake, no ice cream, not thank you! It's just not worth it for me. Every time I eat a dessert I have to work out another hour and it's too much time.",
        "'I only eat sugar from fruits which is great because I love apples and strawberries.'I feel it is important to detox the body every once in a while plus it also shock the metabolism. I feel less bloated, more regular and more energy.'And she says the advice to drink more water really works. 'Not only it's beneficial to our organs but I notice it helps with my skin too. Bye bye zits. The best way to know if we are drinking enough is take your body weight and divide it by two, the result is the amount of ounces we need for the day.'And she also shared that lowering stress is also very helpful to weight loss. 'Take it one day at a time,' said the star who grew up in Washington state.'Stress can get in our way but every little step we take makes a difference. Keep it simple! Be kind to yourself.'"
    ]
}