{
    "articleURL": "/news/article-12051557/Brazilian-man-survives-fall-harness-broke-pendulum-jumping.html",
    "content": [
        "Rafael Tostas suffered fractures to his face, neck, back and lumbar in FebruaryThe 22-year-old had finalized his divorced and joked with his cousin and friend about performing the jump to celebrate the end of his marriage The harness wrapped around Tostas broke midair and sent him crashing into the shallow end of the pondA Brazilian man who sought to lighten his mood after a divorce and attempted a pendulum jump is fortunate to be alive after the rope snapped and sent him crashing into the shallow end of a pond.",
        "Rafael Tostas, 22, had joked with a cousin and childhood friend that he was looking to alleviate the sorrow that came with the end of his marriage when they accompanied him to a popular tourist spot in Campo Magro, Curitiba, on February 11.Two days before the jump he was scolded by his mother when he opened up about the daredevil jump.What he wasn’t aware of was that the pendulum jump, pretty identical to bungee jumping, would almost cost him his life.",
        "Footage filmed by a friend shows Tostas, who was three days away from turning 22, diving off the platform as two men looked on before the safety harness snapped midair.“After the divorce I wanted to enjoy it in every way,” Tostas told Brazilian outlet G1. “I was doing a lot of crazy things. I wasn’t valuing my life at all.”The young man was airlifted to a local hospital where he doctors found fractures to his face, neck, back and lumbar. However, the lumbar fracture did not extend to his spinal cord area.Tostas recalled watching several other people jumping without any issues before it was his turn to. Moments before his leap, he was joking that the rope was not sturdy enough to withstand is weight.",
        "He remembered opening his eyes and being surrounded by strangers who advised him not to move.He attempted to get on his feet but felt “a very strong pain.”Tostas has spent the last three months attending physiotherapy sessions. The accident has caused lingering problems such as lifting heavy objects and left him with pain and weakness in different parts of his body.The near-death experience has given Tostas a new outlook on life going forward.“You start to see life and everything. Not that I didn’t care before, but I didn’t look at it with that look,” he explained. “My life will never be the same. I don’t want to be that Rafael I was before.”"
    ]
}