{
    "articleURL": "/wires/reuters/article-12055283/Japan-PM-Kishida-visits-Seoul-forge-closer-ties-amid-North-Korea-threats.html",
    "content": [
        "TOKYO/SEOUL, May 7 (Reuters) - Japan's Prime Minister Fumio Kishida visits Seoul on Sunday to meet South Korean President Yoon Suk Yeol, facing a sceptical public there as the leaders seek deeper ties amid nuclear threats from North Korea and China's increasing assertiveness.",
        "Kishida's bilateral visit, the first by a Japanese leader to Seoul in 12 years, returns the trip Yoon made to Tokyo in March, where they sought to close a chapter on the historical disputes that have dominated Japan-South Korea relations for years.Yoon is facing criticism at home that he has given more than he's received in his efforts to improve relations with Japan, including by proposing that South Korean businesses - not Japanese companies as ordered by a court - compensate victims of wartime labour during Japan's 1910-1945 colonial occupation.South Korean officials are hopeful that Kishida will make some kind of gesture in return and offer some political support, although few observers expect any further formal apology for historical wrongs. Yoon himself has signalled he doesn't believe that is necessary.The focus of the summit instead will likely revolve around security cooperation in the face of North Korea's nuclear threats, said Shin-wha Lee, a professor of international relations at Seoul-based Korea University.\"Within the framework of the 'Washington Declaration,' which outlines plans to strengthen extended deterrence, Korea will explore ways to enhance the collaborative efforts with Japan,\" she added.\"We have a lot of opportunities to cooperate when it comes to addressing the threat of North Korea\" and securing a free and open Indo-Pacific, a Japanese foreign ministry official said.",
        "Tensions have simmered between Washington and Beijing as China becomes more assertive in its territorial claims over Taiwan and in the South China Sea, while the U.S. shores up alliances across the Asia-Pacific.But the historical differences between South Korea and Japan also threaten to cast a shadow over the blossoming ties between its two leaders.The majority of South Koreans believe Japan hasn't apologised sufficiently for atrocities during Japan's 1910-1945 occupation of Korea, Lee said. \"They think that Prime Minister Kishida should show sincerity during his visit to South Korea, such as mentioning historical issues and expressing apologies,\" she added.On the other hand, Japan is taking it slow, said Daniel Russel, former U.S. assistant secretary of state for East Asia and the Pacific.\"Kishida is being careful not to go faster than his domestic politics permit,\" he added, pointing to the unilateral abrogation by the previous Korean government of a settlement on 'comfort women' as a source of Japan's wariness.In 2015, South Korea and Japan reached a settlement under which Tokyo issued an official apology to \"comfort women\" who say they were enslaved in wartime brothels, and provided 1 billion yen ($9.23 million) to a fund to help the victims.But then-South Korean President Moon Jae-in decided to dissolve the fund in 2018, effectively scrapping the agreement as he said it did not do enough to consider victims' concerns.",
        "Still, South Korea is an \"important neighbour that we must cooperate with on various global issues,\" Japan's foreign ministry has said.Kishida has invited Yoon to the Group of Seven summit set for later this month in Japan and will hold trilateral talks with the U.S. on the sidelines.Kishida will also urge for trilateral talks with China as early as this year, Kyodo reported on Friday, citing multiple unnamed diplomatic sources. (Reporting by Seoyun Kang, Josh Smith, and Hyonhee Shin in Seoul, Sakura Murakami in Tokyo, and David Brunnstrom in Washington; Editing by Raju Gopalakrishnan)"
    ]
}