{
    "articleURL": "/tvshowbiz/article-12057327/Nicole-Scherzinger-looks-sensational-Royal-blue-velvet-gown-Coronation-Concert.html",
    "content": [
        "Nicole Scherzinger looked sensational in a Royal blue velvet gown during her performance at the Coronation Concert on Sunday.",
        "Fans praised singer's incredible rendition of Reflection from the classic Mulan as she took to the stage on the East Lawn of Windsor Castle. The singer, 44, channelled her inner Disney Princess in the stunning dress that featured a floral mesh corset and dramatic train.  Her long brunette hair was worn in an elegant half-up half-down style that tumbled down in loose curls. Nicole accessorised her look with a dazzling bespoke diamond choker, matching earrings and chunky silver rings from Aariya Diamonds. ",
        "Following her performance, viewers of the show shared their thoughts on Twitter, claiming Nicole was 'insanely talented' and looked 'gorgeous.'One person wrote: 'Blimey Nicole Scherzinger can hit a note.'Another added: 'Nicole Scherzinger's gown for the Coronation Concert is gorgeous and she sounds really good.''Miss Nicole Scherzinger reminding everyone that she is a vocalist!' A third penned. Someone else shared: 'Nicole Scherzinger, take a bow, what a voice!' 'Nicole Scherzinger is still criminally underrated,' another fan wrote. The King and Queen took centre stage for the Coronation Concert - and got into the spirit by waving the Union Flag, dancing and singing to Lionel Richie and laughing at Miss Piggy and Kermit the Frog.Charles III and his wife Camilla walked into the royal box to roars from the 20,000-strong crowd who did three cheers for the couple who waved and grinned back as the sun set over Windsor Castle.",
        "The King and Queen, crowned at Westminster Abbey yesterday, sat next to Prince George, Princess Charlotte and the Prince and Princess of Wales, however, it was past the bedtime of Prince Louis, five, who has stayed at home.Sat next to their proud parents, George and Charlotte also appeared to be having a fantastic night dancing and clapping to the songs.Stars including Nicole and Amanda Holden are also in place for tonight's spectacular show on a Union Flag-shaped stage where pop icons including Katy Perry, Lionel Richie and Take That will perform.The royal box is full. The Duke and Duchess of Edinburgh and their children have arrived, waving madly to friends. Prince Andrew and his ex-wife Sarah Ferguson, Duchess of York, are also in place. Princess Eugenie, her husband Jack as well as Peter Phillips and his partner Lindsay Wallace have also taken their seats."
    ]
}