{
    "articleURL": "/news/article-12061605/I-Biden-tells-crowd-AAPI-Heritage-event-alongside-Ke-Huy-Quan.html",
    "content": [
        "President Biden said he can't 'act worth a damn' or 'do much of anything' Came during remarks at a White House event for Asian American Pacific Islander Heritage Month that showed Biden followed-up introduction remarks from Academy Award winning actor Ke Huy Quan before a showing of the new series American Born ChineseJoe Biden was self-deprecating Monday evening after being introduced by Academy Award winning actor Ke Huy Quan during a special White House showing of the first episode of American Born Chinese.",
        "During an Asian American, Native Hawaiian, and Pacific Islander (AAPI) Heritage Month event at the White House, Biden said he can't sing, dance or 'do much of anything.'Notably, when Biden hosted South Korean President Yoon Suk Yeol for a State Dinner at the White House last month, he did not join the world leader in singing American Pie in front of the crowd.Attendees in the East Room on Monday evening were shown an exclusive first-look at the new Disney+ comedy series American Born Chinese, which premiers later in May. ",
        "The president spoke after Quan got emotional talking about this being his first-ever visit to the White House.'You know, I thought it would take me a very, very long time before I got emotional again,' the Everything Everywhere All At Once star said in reference to his tear-jerker Academy Award winner speech.'But as I was entering the White House to the east entrance, and as I was walking up those steps, with that orchestra playing this beautiful music, I couldn't help but tear up, because I was telling myself I'm going to the White House, I'm going to the White House.''I've never been here before,' the Vietnamese-born actor said to massive cheers. 'And you know, now this is the way to go to the White House.'",
        "He concluded enthusiastically: 'And I never thought I would get a chance to say this but now it is my distinct pleasure to introduce the President of the United States.'",
        "Biden followed-up with a dry joke.'My name is Joe Biden,' the president down-played, but received a roaring laugh.'I've never won an Academy Award. I can't act worth a damn. I can't sing, can't dance. Can't do much of anything,' he said.The last bit made the crowd give a sympathetic 'aww' to Biden before he said: 'And it's good to be with all of you.''Good evening everyone,' Biden said Monday as Quan watched on. 'So this is the largest Asian American Native Hawaiian Pacific Islander Heritage celebration ever held in the White House.'The president joked with Quan about how they both were big in the 1980s and got a revival in their career even though everyone 'counted us out.'"
    ]
}