{
    "articleURL": "/tvshowbiz/article-12050137/Dame-Joan-Collins-opens-King-Charles-saucy-words-book.html",
    "content": [
        "Dame Joan Collins performed a cheeky impersonation of King Charles on Friday and teased details of his alleged comments about her ahead of his Coronation. ",
        "Speaking to Kate Garraway and Ben Shephard on Good Morning Britain, she revealed: 'I'd met him a few times. In fact, he wrote about me in his book - I can't say what it is on morning TV because it's a bit naughty.'She appeared to allude to the claims in Christopher Anderson’s book The King: The Life of Charles III, that the monarch once wrote in a letter that Dame Joan had ‘an unbelievable cleavage… all raised up and presented as if on a tray'. Meanwhile, on the show, Joan also chatted about the moment Charles gave her a Damehood and said how charming he was as she discussed the ceremony in 2015.The star went on to mimic his voice, adding: 'He has such a deep voice. He said 'and about time too.'",
        "The legendary actress, who is playing a part in Saturday's Coronation festivities, revealed she has met Charles a few times.The Dame then shared her own hopes for the Coronation Day, saying: 'I hope we all have a wonderful time and that it doesn't rain.'As the royal discussion continued, Ben asked Joan if she thought Charles could have followed in her acting footsteps.Joan replied: 'I think he could have. He certainly has the looks for it and let's face it the royals certainly have to do a lot of acting.'",
        "The screen star has been busy in other aspects of her life, speaking to Kate and Ben about writing her memoir which she released in 2022.She admitted that it had been a very fun project to do as she looked back over her eventful life. Dame Joan said: 'It's been hilarious I've been combing my memory for funny things that happened.",
        "She continued: 'I was talking to Biggins the other day and he reminded me about the time we got trapped on an island in Corfu with Stella and no water.'Ben quipped that she could write another memoir with more of her wild stories in it but she replied: 'No! It's in there now! I had to change it.'It comes after Joan gushed about her Damehood the day before she met with Charles in 2015.She said: 'Only one more day before my investiture as Dame ! I'm super excited.'"
    ]
}