{
    "articleURL": "/wires/ap/article-12041715/Edmunds-Genesis-G80-Electrified-vs-BMW-i4-M50.html",
    "content": [
        "It seems like there´s a new electric luxury SUV introduced every couple of months. But if you´re seeking old-school opulence, a luxury sedan might be more your speed. Luckily, automakers haven´t completely forsaken that category. Two recently introduced electric luxury sedans worth looking into are the Genesis G80 Electrified and the BMW i4. Both are based on existing conventionally powered models - the G80 and 4 Series Gran Coupe, respectively - and have much to offer the luxury-sedan shopper in their all-electric guise. Which extra-posh EV should you splurge on? The car specialists at Edmunds compare the two electrified four-doors to find out.",
        "PERFORMANCE AND RANGE There are three versions of the BMW i4: the eDrive35, eDrive40 and M50. In this article, we´re using the top-line M50 for our comparison. It comes standard with dual electric motors and all-wheel drive. Combined, its two motors produce 469 horsepower and 538 lb-ft of torque, and that can temporarily be increased to 536 horsepower and 586 lb-ft for about 10 seconds using Sport Boost mode. At the Edmunds test track, the i4 M50 accelerated from 0 to 60 mph in just 3.6 seconds, which is impressively quick. Around turns, the i4 feels composed and grippy but lacks the playful feel that BMW sedans typically offer.The Genesis G80 Electrified only comes with dual motors and all-wheel drive. This setup is good for 365 horsepower and 516 lb-ft. It´s not as quick as the i4 M50, posting a 0-60 mph time of 4.5 seconds, but acceleration should be more than adequate for most. From a handling standpoint, it´s not as enjoyable to drive as the BMW. The G80 Electrified is better suited as a luxurious cruiser.The BMW i4 M50´s range estimate varies depending on what size wheels you choose. With 19-inch wheels, the i4 M50 gets an EPA-estimated range of 271 miles on a single charge. But opt for the 20-inchers and that estimate drops to a disappointing 227 miles. Thankfully, your real-world experience could be better; Edmunds ran an i4 M50 with the 20-inch wheels on its real-world range test and it went 268 miles. Picking the smaller wheels or the less powerful i4 versions should net even more range. But in this straight-up comparison, the Genesis edged out the i4 with its higher EPA estimate of 282 miles. It also outperformed that number in Edmunds´ testing, covering 309 miles on a single charge.",
        "Winner: tieINTERIOR AND TECH The BMW i4 M50´s cabin is highlighted by a fully digital instrument panel that flows seamlessly into an extra-wide 14.9-inch central touchscreen. That screen runs the latest version of BMW´s iDrive operating system, which comes with wireless Android Auto and Apple CarPlay smartphone integration. The G80 Electrified´s interior, for better or worse, looks almost exactly the same as the gas-powered version. It´s handsomely styled and features high-quality materials, and in general, will feel familiar to most luxury-car shoppers. The touchscreen is nearly as large as the BMW´s, but it´s not as intuitive and doesn´t offer wireless connectivity for Apple CarPlay and Android Auto.",
        "The i4 is technically a size down from the G80, but it doesn´t give up that much interior space to the larger Genesis. Front seat space is comparable and less than 2 inches separates them when it comes to rear legroom. Despite the i4´s more dramatically sloped rear roofline, both cars boast identical rear headroom. One clear advantage the i4 has over the G80 is its rear hatch. It´s fairly shallow and won´t fit much more than your groceries beneath the luggage cover, but the rear seats fold down, unlike in the G80 Electrified, so you´ll have an easier time fitting bulkier items.",
        "Winner: i4 M50PRICING AND VALUEPriced just under $69,000, the BMW i4 M50´s starting price is about $10,000 less than the G80 Electrified´s. However, the Genesis comes fully loaded with no packages or options to add. To get a comparably equipped i4 with all the same advanced driver aids, convenience features and in-car tech, you´ll have to spend closer to $75,000. That´s still cheaper than the G80 Electrified, but the Genesis also comes with a generous 10-year/100,000-mile powertrain warranty (compared to four years/50,000 miles for the BMW). BMW covers the i4´s battery separately for eight years/100,000 miles. In addition to the better warranty, Genesis also offers three years of free 30-minute charging sessions at Electrify America stations, or one year more than what BMW provides.Winner: G80 ElectrifiedEdmunds says: The BMW i4 M50 delivers on nearly all of the expected qualities of a BMW sedan. It just so happens to be electric. But in this comparison, it´s edged out by the Genesis G80 Electrified, which provides a slightly more compelling mix of performance, comfort, range and luxury features for the price._____This story was provided to The Associated Press by the automotive website Edmunds. Alex Nishimoto is a contributor at Edmunds."
    ]
}