{
    "articleURL": "/femail/fashionfinder/article-12042079/Refresh-spring-wardrobe-Princess-Eugenie-approved-dresses.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Fashion Finder article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "Mum-to-be Princess Eugenie has worn three different Whistles dresses in the last few weeks - here's why you need some of the high street store's summer collection in your own wardrobe.In the last month, we’ve spotted her wearing no fewer than three dresses from the high street store for special occasions, such as joining the rest of the Royal Family at church on Easter Sunday, and attending birthday parties.  Whistles Wood Tiger Print Dress  The print on this dress is super distinctive and unusual. Plus, if it’s good enough to wear for Easter Sunday with the Royal Family, it’s good enough for us!The second time around, Princess Eugenie relies firmly on Whistles for her maternity style.  £89 (save £70)  Shop",
        "We certainly see the appeal. Prints seem to be something of a specialty for Whistles at the moment, with Eugenie opting for florals, dalmatian spots and tiger stripes. They’re all blue as well… read into that what you want!Although they’re not maternity styles, two of Eugenie’s looks feature shirred bodices, which means they’re super stretchy. Spot on whether you’re expecting your own bundle of joy or just like a looser fit in the warmer months.With sizes ranging from four to 18, and loads of discounts on the site to make the most of, Whistles is the way forward if your wardrobe is in need of an update.",
        "Holly Willoughby, Coleen Rooney, and of course, the Princess of Wales have all worn Whistles too, so Eugenie is in good company.You can buy her three dresses now, and we’ve also rounded up our top new season must-haves, ranging from tortoiseshell shades to a linen trouser suit.The swimwear is worth your attention too. It’s a one-stop holiday shop!Refresh your wardrobe for spring   Whistles dalmatian print dress You’ve probably already got some leopard spots and tiger stripes in your wardrobe, so this dalmatian print dress is guaranteed to mix things up a bit. Did we mention it has pockets too?  £119.20 (save £29.80) Shop  Whistles blurred floral dress  The loose trapeze shape and high neckline make this mini dress very easy to wear. Style it with tights and chunky boots on colder days, switching to bare legs and trainers when the sun comes out.  £79 (save £60)  Shop  Whistles floral sunburst dress Square neck, button down front, shirred bodice, delicate daisy print… it’s the perfect summer dress.  £119.20 (save £29.80) Shop  Whistles Isle of Eden sunglasses This oval shape will win out over cat eyes or aviators this summer, plus tortoiseshell is a little softer than black frames.  £115 Shop  Whistles ‘Lucy’ linen blazer and trousers, £258 (now reduced to £206.40)  A linen suit is the ideal summer investment, and at just under £200, the ‘Lucy’ suit will work really hard in your wardrobe.  £206.40 (save £51.60) Shop"
    ]
}