{
    "articleURL": "/sport/football/article-12061157/The-key-battles-Real-Madrid-host-Manchester-City-semi-finals-Champions-League.html",
    "content": [
        "Real Madrid take on Man City in the semi-finals of the Champions League The three key battles between the two sides ahead of the first leg in Madrid OLIVER HOLT: Pep Guardiola must find a way to ransack the house of the enemy Manchester City will continue their quest for a historic treble this week when the clash with Real Madrid in the first leg of their Champions League semi-final. ",
        "Pep Guardiola's side are point clear of Arsenal at the top of the Premier League and have a date with Manchester United in the FA Cup Final next month, but it's the Champions League that remains the trophy that has eluded the club so far. In 2021 they reached the final only to be bested by Chelsea, while Pep Guardiola's last triumph came with Barcelona back in 2011. In contrast, their Spanish opponents have won five of the last ten Champions League and are the current holders - knocking City out of the competition on route to beating Liverpool in last year's final. Ahead of the huge meeting between the two, here are three key battles between Guardiola's side and Carlo Ancelotti's reigning champions. ",
        "VINICIUS JUNIOR v JOHN STONESVinicius is Real Madrid’s most dangerous player with 22 goals and 21 assists in all competitions and I cannot see Carlo Ancelotti changing his approach to games. But will Pep Guardiola? Manchester City send their right back into midfield — something Stones has been superb at — but can they afford to use that tactic against Vinicius? To leave this wondrous winger on his own would be asking for trouble.",
        "ANTONIO RUDIGER v ERLING HAALANDHow do you stop Haaland? Plenty of people say you have to get physical with him, and Eder Militao is a defender who embraces that side of the game. ",
        "However, he is suspended for this game and that is a huge blow for Madrid. Rudiger is set to step in and the former Chelsea centre back will need to get tight and tough with Haaland until Militao can return for the second leg at the Etihad Stadium.",
        "DANI CARVAJAL v JACK GREALISHGrealish was rested against Leeds on Saturday (he is in my Fantasy Football team, too, so thanks for that, Pep) but he is one of the first names on the teamsheet when it matters. He could have scored at least twice in that iconic Bernabeu clash between these teams last season but it was Carvajal’s cross in stoppage time that scuppered City. Another tasty tussle awaits in Spain."
    ]
}