{
    "articleURL": "/wires/ap/article-12055723/Kevin-Pillars-pinch-hit-homer-rallies-Braves-past-Orioles.html",
    "content": [
        "ATLANTA (AP) - Kevin Pillar hit a pinch-hit two-run home run in the eighth inning to rally the Atlanta Braves to a 5-4 win over the red-hot Baltimore Orioles on Saturday night.",
        "Pillar's shot came off Danny Coulombe (1-1) and scored Austin Riley, who opened the eighth with a single.\"He's always ready,\" said Braves manager Brian Snitker. \"He can sense a situation and get himself ready. He's been awesome to have.\"A.J. Minter (1-3) pitched a perfect eighth and closer Raisel Iglesias got the save in his first appearance of the season. Iglesias, who missed the first 32 games of the season with a strained right shoulder, struck out two in a perfect ninth.\"His stuff is unbelievable,\" said Spencer Striger, who struck out 10 in five innings, giving up two runs. \"He is a legit competitor. We are a much better team with him.The Braves are 7-0 in Strider's starts this season.",
        "Adam Frazier had three RBIs for the Orioles, who lost for just the fifth time in 21 games.The Orioles did not use their normal set up man Yennier Cano in the eighth inning, who has been almost unhittable this season. Batters are 2-for-42 against him this season, but he pitched two innings Thursday and manager Brandon Hyde wanted to give him some rest.\"Unfortunately, that's just part of the game,\" Hyde said. \"Other guys have to pitch in those spots and Danny's done a great job for us this year. Just one bad pitch.\"",
        "Braves shortstop Vaughn Grissom's sixth error in 18 games this season led to a costly run in the sixth inning. His failure to secure a ground ball put runners on first and third in a 3-3 game, and a Frazier fielder's choice gave the Orioles a 4-3 lead.Ryan Mountcastle had two hits and scored two runs and Anthony Santander had a pair of doubles and two runs scored for the Orioles.Baltimore's Kyle Bradish limited the Braves to three runs over five innings while striking out four.Marcell Ozuna crushed a leadoff home run to right field in the third inning to open the scoring. Ozuna had been off to a slow start this season, hitting .085 in April, but he has hit four home runs in the first week of May.A FIRST AT FIRSTRamón Urías played first base for the first time in his four-year Major League career. Urías won a Gold Glove at third base last season and has seen time at second base and shortstop in the majors. Everyday first baseman Ryan Mountcastle was the designated hitter and the Orioles sent backup first baseman Ryan O´Hearn back to Triple-A Norfolk. Urías used Montcastle´s glove and made a great catch and tag on a wide throw from pitcher Kyle Bradish to end the fourth inning.",
        "TRAINER´S ROOMBraves: CF Michael Harris II returned after missing two games with a jammed knee. He is playing with a large knee brace under his uniform. ... RHP Kyle Wright´s MRI showed no structural damage on his strained shoulder. There is no timetable for his return. ... Catcher Travis d´Arnaud (concussion) played in his second rehab game with Triple-A Gwinnet. He went 0-for-3 with a walk as a designated hitter.TID-BITSThe Braves wore their new City Connect uniform for the third time. The uniform is an updated version of the Braves´ home jerseys from the 1970s and is intended as a tribute to Hank Aaron. ... The Orioles have just seven quality starts this season. ... Mountcastle saw a streak of eight consecutive hits being good for extra bases with a single in the fourth inning. ... Strider struck out at least eight hitters for the 11th straight game, the longest current streak in the majors. ... Ronald Acuña has reached base 25 straight games. ... The pinch-hit home run was the second of Kevin Pillar´s career.UP NEXTRHP Tyler Wells (2-1, 3.34 ERA) gets the start for the Orioles in the series finale Sunday morning against Braves RHP Bryce Elder (3-0, 1.75 ERA).___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}