{
    "articleURL": "/wires/aap/article-12044799/Mulga-Bore-brings-red-centre-glam-rock-Melbourne.html",
    "content": [
        "Members of the Mulga Bore Hard Rock don't mind wearing glam rock make-up first thing on a weekday morning.",
        "The band, from the tiny community of Mulga Bore, 180km northeast of Alice Springs, will play the opening gig at Melbourne's Indigenous arts and culture festival Yirramboi, which starts on Thursday.\"We put Mulga Bore on the map - if you search google we are on there,\" frontman Alvin Manfong told AAP.The youngest member is 14 and the oldest is 18. They started as a school band in January 2022, and soon afterwards won a battle of the bands competition.By September, the Anmatjere musicians found themselves playing in front of a crowd of thousands as the opening act for the Kiss stadium concert on the Gold Coast.\"That was a lot of eyeballs watching us,\" Manfong said.Most of Mulga Bore, population 40, travelled to the Gold Coast to see the show, and the band even briefly met Kiss.The members are massive Kiss fans and among their top covers are I Was Made for Loving You, Detroit Rock City, War Machine and Rock And Roll All Nite.But they are also writing original songs, among them a tune called Fame not Shame.\"That's the message song for the young ones, even the adults,\" Manfong said.\"Don't do crazy stuff, just go and enjoy your life, be who you are and play the game.\"",
        "Alice Springs has recently been a flashpoint for First Nations politics, with Opposition Leader Peter Dutton visiting to speak about crime in the Northern Territory city.But Manfong says the future of the region lies in focusing on its rich culture.Yirramboi means \"tomorrow \" in the local languages of the Boonwurrung and Woi-wurrung people.The 10-day festival will feature more than 300 artists with 170 performances, most of them debut shows.The festival hub at the North Melbourne Meat Market has been named after Uncle Jack Charles, in tribute to the actor, who died in September.Yirramboi is being held in Melbourne's city streets from May 4-14."
    ]
}