{
    "articleURL": "/news/article-12047811/Metal-detectorists-jailed-five-years-trying-sell-766-000-Anglo-Saxon-coins.html",
    "content": [
        "Craig Best, 46, and Roger Pilling, 75, tried to sell £766,000 of Anglo-Saxon coinsBest and Pilling were jailed for more than five years at Durham Crown CourtTwo metal detectorists who hatched an illegal plot to sell abroad Anglo-Saxon coins of great historical significance have been jailed for more than five years.",
        "Craig Best, 46, and Roger Pilling, 75, were convicted of conspiring to sell criminal property worth £766,000, namely 44 9th-century coins believed to have been buried by a Viking and which have never been declared as treasure, and have not been handed to the Crown.Judge James Adkin, sitting at Durham Crown Court, said a further two coins remained outstanding and had been 'hidden away'.He said he was confident, having heard evidence during a trial last month, that the coins were part of a larger undeclared find known as the Herefordshire or Leominster Hoard.The coin enthusiasts were convicted of conspiracy to convert criminal property and a separate charge of possession of criminal property and were jailed for five years and two months.",
        "The judge told them their offending was aggravated by their plan to sell the coins abroad, saying: 'Had they left this country, they would have been likely to be lost to this nation for ever.'He accepted that Pilling, having run an engineering business, was a man of good character and Best had a young family who relied on him.Best, of Bishop Auckland, County Durham, was arrested with three coins at a Durham hotel in May 2019 during a police sting operation.",
        "June 2015: West Mercia Police recover 29 Anglo-Saxon coins from larger hoard that had been found at a farm in Leominster, Herefordshire, as part of Operation Helix.September 2018: Craig Best contacts a US professor who has a passion for ancient coins and tries to interest him in buying some of the 44 coins somehow acquired by Roger Pilling. These coins are believed to be from the same undeclared find in Leominster known as the Herefordshire Hoard.May 2019: Undercover police carry out a sting operation and arrest Best at a Durham hotel, where he believed he was meeting a contact of a potential buyer. Pilling is arrested at his Lancashire home later.November 2019: George Powell, 41, and Layton Davies, 54, found guilty of theft, conspiracy to conceal criminal property and conspiracy to convert criminal property at Worcester Crown Court after they failed to report their find and tried to sell the items. They were jailed for more than 18 years.August 2021: Best and Pilling are charged with conspiracy to convert criminal property.April 2023: The pair stand trial at Durham Crown Court, where they are found guilty of hatching an illegal plot to sell the coins abroad. They were jailed for more than five years.",
        "Best thought he was meeting a metals expert employed by a broker working for a wealthy US buyer. But he was in fact speaking to an undercover detective.Pilling, who according to the judge acquired the collection from the 'black market', was arrested at his home in Loveclough, Lancashire, and a further 41 coins were seized.These 44 coins originated from the Herefordshire Hoard, discovered in 2015, worth millions of pounds, and which was also not declared.The undercover police operation was set up after Best tried to sell coins to the American collector, who then contacted UK experts about the apparent availability of extremely rare and valuable examples, and the authorities were alerted.It was believed the coins were made between 874AD and 879AD and were buried by a Viking during this particularly violent period of English history.They included two extremely rare examples of two-headed coins, showing Alfred of Wessex and Ceolwulf, a figure who was discredited by Saxon writers as a Viking puppet ruler.Experts have said the two-headed coins demonstrate a financial and political alliance between the two kings, showing Ceolwulf was more important than reports from Alfred's court later stated.Sharon Watson, defending Pilling, told the court he had been a 'hard-working industrious family man and a kind person' who delayed his retirement after his factory burned down to ensure his employees had jobs.",
        "Stephen Garbett, defending Best, said he was also hard-working, and runs a business with three employees.He said: 'His family are devastated by what has happened. He now has to deal with it.'"
    ]
}