{
    "articleURL": "/sport/football/article-12039627/Sydney-FC-fans-boycott-entire-League-finals-series-hated-postseason-change.html",
    "content": [
        "Many Sydney FC supporters won't attend Saturday's finals gameFollows 2022 decision from Australian Professional LeaguesMen and women's grand finals to be hosted in Sydney until 2025Fans from the Cove will instead watch derby clash at The StarHundreds of disillusioned Sydney FC fans will boycott Saturday's elimination final against the Western Sydney Wanderers in a defiant message to the Australian Professional Leagues and Football Australia.",
        "The boycott follows the APL's controversial decision last December to sell the A-League grand final to Destination NSW until 2025 for a reported $12million.Previously, A-League men's and women's clubs who excelled in their respective finals series won the right to host deciders.Taking to Facebook on Tuesday, fed-up supporters from the Cove - the Sky Blues' largest gameday supporter base - confirmed they will instead watch the Sydney derby action from the Star casino in Pyrmont.'This week should feel so different,' the post began.'What could have been a build up to possibly the biggest finals match in our history is tainted by the inaction of our game's administrators. ",
        "'To reaffirm, the Cove will be following through with our promise to our members and the Australian football public by boycotting the entire finals series.'The post went onto state 'there will be no organised active support, no banner, no drums or flags' at Commbank Stadium and that 'this is not a choice we take any joy in making, however the actions (or inactions) of the APL and FA leaves us with no choice but to fight'.The majority of Cove supporters are also said to feel 'taking no action ourselves after failed promises by this administration would send a message that we are nothing more than a doormat that can be walked on and used forever.",
        "'No more. Supporter groups across the country have been put in a situation that no volunteers should face. This is meant to be our release, our place of worship, an outlet. 'Instead, we are forced yet again to make difficult choices and feel conflicted.'The passionate supporter message went onto stress victim blaming is pointless - and the APL and Football Australia need to be accountable for their decisions.",
        "'It is entirely on the APL and the FA that we are in this situation. Supporters are not to blame for the choices they make around this finals series - there would be no difficult decisions had those in charge simply delivered what they promised. 'Had they communicated properly or considered the impact of their decisions on supporters. This is on them.'To our own members and the wider Sydney supporter base, we ask with the utmost respect, regardless whether you agree with our choice or not, please, leave the active bays empty this weekend. Let our message have the impact it deserves in silence.'The Cove is only as good as you, the people who are a part of it, make it.'Veteran Sydney FC defender Alex Wilkinson was left downcast by the development.'As a club and as players we want them there,' he said. ",
        "'We are disappointed that they are not going to be there for what is the biggest game of the season to date.'Their support throughout the year has been unbelievable. Without a doubt they can give you an edge.'Being such an important game and with everything on the line, it would be fantastic if we could have both sets of (active) fans there creating that atmosphere which would just add to the occasion and make that game that little bit more special.'We've had the biggest average crowd out of any team this year and a lot of that's got to do with their (The Cove's) support and the atmosphere they create at games, so not having them there is going to make our job a little bit harder on Saturday night.'",
        "In contrast, the Wanderers chief fan base - the RBB - will descend on Commbank Stadium in large numbers. Meanwhile, the APL's planned 'Festival of Football', featuring Barcelona's FC's women's squad, has collapsed.A match against an A-League All Stars Women's XI was due to be played on June 4 - but is now off the table.Additionally, the A-League Men's All Stars clash with German giants Bayern Munich - scheduled for June 2 - has also fallen over, due to reported budget cuts from the NSW Government.",
        "It is understood the newly elected government led by Chris Minns felt Bayern Munich's multi-million dollar appearance fee - believed to be between $6.5million to $8million - would be better spent elsewhere.Last year's All Stars clash against Barcelona's men saw a record post-pandemic crowd of 70,174 at Sydney Olympic Park."
    ]
}