{
    "articleURL": "/wires/reuters/article-12049369/Yankees-try-make-ground-set-vs-Rays.html",
    "content": [
        "The New York Yankees have plenty of ground to make up on the Tampa Bay Rays in the American League East standings.",
        "A good time to start would be Friday night in the opener of a three-game series in St. Petersburg, Fla.Despite having the second-highest payroll in the majors, the Yankees enter the series last in the division, nine games behind the MLB-best Rays, who have the 28th-ranked payroll.\"We have time to make up ground,\" New York general manager Brian Cashman told reporters on Wednesday. .\".. Don't count us out. Don't give up on us.\"The Yankees helped their cause with a 4-3 victory in 10 innings against the visiting Cleveland Guardians on Wednesday night, giving New York two straight wins following a four-game losing streak.The Yankees should start moving up the standings once they get some of their injured players back.Giancarlo Stanton, Aaron Judge, Luis Severino, Frankie Montas and Carlos Rodon are among those currently injured.\"They're elite players when they're healthy, and we just need to get them healthy,\" Cashman said. \"Whether it's an over-reliance on them or not, they're our players and I know what I can get when they're healthy, and I'm looking forward to getting them healthy.\"Judge is dealing with a hip/oblique strain that landed him on the injured list, despite his objection. The reigning AL MVP hoped to sit out a couple games and be ready for the series against Tampa Bay, but the IL stint will keep him sidelined until early next week.",
        "The Yankees plan to send Jhony Brito to the mound in the series opener. Brito (2-3, 5.56 ERA) won his first two starts this season but has dropped his past two, and three straight decisions overall.He allowed two runs and four hits in five innings on Saturday at the Texas Rangers but failed to get any run support in the 2-0 loss.Brito, who made his major league debut this season, has never faced the Rays in his career.Yonny Chirinos will make his first start of the season for the Rays.Chirinos (1-0, 0.64) has been exceptional in his four appearances out of the bullpen this season, allowing just one earned run in 14 innings with eight strikeouts and two walks.His last two appearances came against the White Sox. Across 7 2/3 innings, he combined to hold Chicago to one run and three hits, helping the Rays win both games.Chirinos began his MLB career in 2018 by not allowing an earned run in his first 14 2/3 innings, but he's had to overcome Tommy John surgery in 2020 and a fractured throwing elbow in 2021.\"It's been a difficult process, for all the surgeries and things I've been through, but here we are,\" Chirinos said through an interpreter. \"God willing, everything's going to be smooth sailing now moving forward. I'm healthy and looking forward to taking advantage of the opportunity.\"",
        "Chirinos has made eight appearances against the Yankees in his career, including five starts, going 2-3 with a 3.57 ERA.--Field Level Media"
    ]
}