{
    "articleURL": "/wires/pa/article-12048153/Everton-talks-possible-investors.html",
    "content": [
        "Everton are in discussion with possible investors as owner Farhad Moshiri seeks an injection of revenue for the Premier League strugglers, the PA news agency understands.",
        "The team are second from bottom of the table and a point adrift of safety as Sean Dyche looks to mastermind an escape from relegation and preserve the club’s near 70-year stay in the top flight.It is understood that MSP Sports Capital and 777 Partners are the parties being spoken to, after Moshiri said in February that he was in talks with “top investors of real quality” to invest in Everton’s new stadium, which is currently under construction at a cost of £760million.",
        "The club’s most recent accounts showed a loss over a five-year period of £430m, significantly above the £105m that the Premier League allowed for across any three years.Those figures include £170m of losses rocked up during the Covid pandemic, which can be written off.Figures from New York-based MSP were present at Goodison Park when the team lost 2-1 to Southampton in January, with reports suggesting it is likely to want to be represented in the boardroom should an investment be made.777 has already invested in several clubs in European football, including La Liga’s Sevilla and Bundesliga outfit Hertha Berlin. It also owns Genoa in Italy and Belgium’s Standard Liege.Meanwhile, manager Sean Dyche has given his backing to Michael Keane amid criticism of the defender’s performances.",
        " A lot of noise grew in the Newcastle game. I thought (Keane) was our best player until the second goal - that's how it canchange very quickly  Sean Dyche  Keane, 30, has displaced Conor Coady to become a regular again in Everton’s back four since Dyche – his former manager at Burnley – arrived at Goodison Park.However, fans have not necessarily been happy with the result as the relegation-battling Toffees have shipped 20 goals in the 10 games Keane has started.But Dyche said he retains full faith in a player capped 12 times by England.“I have faith in all the players,” he said. “I can only pick 11 so I have faith in all of them. At the end of the day, it’s the ups and downs of a footballer, the ups and downs of teams, the ups and down of careers – it all goes into the melting pot.",
        "“These are things the players have to work through, how to handle the goods, bads and indifferents.“A lot of noise grew in the Newcastle game (a 4-1 defeat on April 27). I thought (Keane) was our best player until the second goal – that’s how it can change very quickly.“He is a very good player amongst many good players here. Sorting the best 11 at any time, form related at any time, that’s the key to it.”",
        "Coady, a loan signing from Wolves last summer, was a regular alongside James Tarkowski in the first half of the season, but has not featured since February 25, while fellow defender Yerry Mina is available again after injury but has not played since January.“All the players need to keep doing what they are doing until we pick them, you can only pick 11,” Dyche said. “I make that clear to the players, you can question it and I am happy to speak about it, but you can only pick 11 players.“Everyone has to stay fit, sharp and committed to the cause and that is what we are looking to do for when the team has to change or does change.”With Monday’s rip to Europe-chasing Brighton on Monday followed by the visit of reigning champions and title favourites Manchester City, Dyche added: “Defending correctly, attacking correctly, you have to find a balance somewhere. Some games just pan out like that.“Palace (a 0-0 draw at Selhurst Park on April 22) was the complete opposite, that was a slow, methodical game.“Maybe the intensity of it, the feel of it, the fact it was a big game, sometimes that can bring an openness to a game and sometimes it stays tight but you can’t define a game until it starts and you see it in front of your eyes.”"
    ]
}