{
    "articleURL": "/wires/ap/article-12044731/Chiefs-coach-cool-Australias-Super-Rugby-draft-proposal.html",
    "content": [
        "WELLINGTON, New Zealand (AP) - The coach of the top-performing team in Super Rugby Pacific this season has rejected an Australian proposal to introduce a player draft to bolster under-performing teams.",
        "Rugby Australia chairman Hamish McLennan this week outlined the draft proposal which would allow players who are eligible for All Blacks selection to play for Australian clubs and players eligible for the Wallabies to play in New Zealand franchises.\"Why couldn´t a New Zealand player come and play for us and also play for the All Blacks?\" McLennan said. \"I think that´d enhance Super Rugby and let key Rugby Australia players do the same.\"For example (scrumhalf) Nic White could go to an NZ team and still play for the Wallabies.\"McLennan would like the draft instituted quickly, saying it \"would lead to better ratings and better broadcast performance.\"\"I think we should be doing a draft now to create more innovation around the game and keep eligibility within Super Rugby Pacific and move different players to different clubs,\" McLennan said.McLennan´s plan has been met with skepticism in New Zealand, where it has been seen as a device to boost Australian teams to compensate for a lack of investment in player development.Much of Rugby Australia´s recent focus has been on recruiting players from the National Rugby League, most recently the young Sydney Roosters star Joseph Suali´i for a multi-million dollar deal.McLennan appeared to acknowledge that in discussion of the proposed draft.",
        "\"In truth, historically a lot of this is probably RA´s fault from the last cycle,\" he said. \"It´s a lack of strategy over a long period of time.\"We´ve been poached by the NRL (clubs) for too long. We need sustained investment back at grassroots and (to) get the players back. That´s why we settled on the (Super Rugby) competition through to 2030. Now we know what we need to do.\"Clayton McMillan, coach of the Hamilton-based Chiefs who have won their first nine matches in Super Rugby this season, has no enthusiasm for a proposed draft.The Chiefs won the Super Rugby title in 2012 and 2013 but went through many lean years before rebuilding their squad this season.Their win over the defending champion Crusaders last Saturday confirmed their top place in the tournament this season and left little doubt the Chiefs are the title favorites.McMillan conceded there are too many uncompetitive matches in Super Rugby and that has become a turn-off for fans. After 10 rounds this season, nine points separate the Christchurch-based Crusaders in fifth place and the Queensland Reds in sixth.\"I think we all want to see a competition where the teams go out there and every game is a battle and I suppose you could argue over the last couple of years there´s still a little bit of a gap between the top teams and the bottom teams,\" McMillan said. \"Players being shared over to Australia, I´m not sure I agree with that, and that´s a decision for people at a higher level than me.\"",
        "\"All I´d say is that we´ve been in the situation not too long ago ... where we were losing a lot of games and we had a young squad. We´ve had a really deliberate plan over the last three or four years around going through that pain and building a squad that can be really competitive and have ongoing success.\"New Zealand teams currently occupy four of the top five spots on the Super Rugby standings, with the Canberra-based Brumbies in second place.The Chiefs likely will stretch their winning streak to 10 matches when they play the Dunedin-based Highlanders on Friday. The Highlanders have won only three of nine matches this season but, in a mark of the overall tournament, still are in eighth place and in line for a quarterfinal spot.The Crusaders will play the 10th-place Western Force, based in Perth, Western Australia, on Saturday but their effort to force their way into the top-four likely will be barred by the Auckland-based Blues, who currently are fourth and will play last-place Moana Pasifika.The 11th-place Fijian Drua will host the Wellington-based Hurricanes in Suva on Saturday, the Reds are at home to the New South Wales Waratahs and the Brumbies will travel to Melbourne for Sunday's match against the Rebels.",
        "___More AP rugby: https://apnews.com/hub/rugby and https://twitter.com/AP_Sports"
    ]
}