{
    "articleURL": "/femail/article-12059873/We-crime-scene-cleaners-worst-places-seen.html",
    "content": [
        "WARNING: GRAPHIC CONTENT Tom DeSena, 23, and Junior Lallbachan, 26, have lifted the lid on their wild jobThe crime scene cleaners told DailyMail.com how their murder-filled jobs beganJunior and Tom shared the most gruesome crime they have come acrossA pair of crime scene cleaners have lifted the lid on the gruesome job that sees them scrubbing blood, pieces of brain, and more from murder and suicide locations.",
        "Disinfecting technicians Tom DeSena, 23, from Long Island, New York, and Junior Lallbachan, 26, from Guyana, South America, have shared the ins and outs of their unusual and 'crazy' job. The duo is known for documenting the shocking fatalities they come across on their TikTok account, where they boast more than 250,000 followers. Speaking to DailyMail.com, Tom and Junior revealed the most gory scenes they had encountered, how they entered the criminal justice industry, and how they coped with the 'devastating' sites. ",
        "From murder-suicides to unattended deaths, there is nothing that the pair hasn't seen. And while you may never even give a thought to those who clean crime scenes while watching TV, Tom and Junior have put in the work to get to where they are today. Tom told DailyMail.com he graduated from Farmingdale State College in New York, with a Bachelor's Degree in criminal justice: law enforcement and computer technology, with a minor in legal studies. After graduating, he had no luck for a short period of time until he applied to his current company - which he doesn't name -  and instantly got a call back. 'I never particularity had an interest in the field of gore and gruesomeness, but I never had a weak stomach either. This job, simply put, just sounded cool and different. And I think I'm pretty cool, and I am definitely different,' Tom told DailyMail.com.",
        "Junior was referred to the job by a 'family friend' and had been working for the company for eight to nine years.The duo has gone viral on TikTok, where they detail some of the craziest crime scenes they have encountered.Prior to entering a crime scene, the duo receives a paper that gives a description of the brutality of the crime. ",
        "'The paper usually contains: an address, a contact name, and their contact number, a brief description of what to expect, and what time to arrive at the location. That's all,' Tom told DailyMail.com.Although the power duo can 'handle anything,' there are a few topics they make sure they ask about before taking on a job - including the type of drugs involved.The pair revealed they ask: 'Are/were there any drugs (fentanyl)? Are/were there any animals? Are/were there any weapons?' He added: 'We rarely will receive pictures of the scene, but regardless, pictures only do so much. It's almost better to walk into these jobs not knowing too much because it keeps us fully alert - it keeps us on our toes, proactive, and ready for anything.' Recalling the most gruesome crime scene he has come across, Tom said: 'A man had his friend over to hang out at his house at night with him and his wife. ",
        "'There was either alcohol or drugs involved, but something led to the friend finding and grabbing a hammer, and assaulting not only his friend, but his wife. 'Both the man and his wife were left for hours in different parts of the home, in critical condition, until one of the two had presumably called 911.' ",
        "He told DailyMail.com that he believed the two were 'still alive' and 'wouldn't want to explain any further' for that reason. Meanwhile, Junior described a nightmare of a crime that saw him opening a truck filled with dead bodies.'During 2020, Junior had to do a job at a hospital in New York where he had to essentially, sanitize and disinfect 4 tractor trailers from COVID. While on the way to the job, Junior said he was not aware these trailers were actually containing unalived (sic) people.'So when he went into the trailers and saw all the white body bags, he immediately felt and knew something was off. 'Long story short, Junior used one of our sanitization-spraying machines, didn't look down, and disinfected all of the trailers,' Tom said of Junior's experience. In addition to the few distinct crimes that stick in their minds, the pair said they struggled to deal with grieving family or friends of those that died.",
        "'Having to deal with a grieving, broken, lost, confused person is very difficult,' Tom said. 'Although I treat every single person and situation equally, nothing hits my soul harder than seeing a confused mother or father who just lost their child, or a broken child coping with the loss of their parent(s).  ",
        "'I do handle it very well, but it is my least favorite part of my job - seeing such devastating hurt in someone's eyes.' Meanwhile, Junior revealed he often has to pretend the crime wasn't reality. 'Of course every now and again something comes to mind, but I just remind myself that it was not me, or my life. I convince myself that it was not even real, in a way,' he told DailyMail.com.In addition to dealing with the devastation and gruesome scenes the duo who drive to crime sites across the country to clean the scenes, revealed that 'driving is more difficult than the job itself.' 'The smell of cat poop and cat hair, and the smell of rotten (and I mean, rotten) meat, are both worse (to me) than any smell from any bio, decomp, or any crime scene situation,' Tom added.Although the pair chose to keep their pay private, they did reveal that they get paid a salary, and their pay didn't vary based on the crime. ",
        "However they did reveal the many things they loved about their unique career. ",
        "'I love that I am mentally, physically, emotionally, and psychologically strong enough to handle this lifestyle, and not have it negatively affect me in any way. I love that we get to help people in serious need,' Tom told DailyMail.com.'I love that we get to travel all over the country. I love that I work a hard job, which makes me feel tired and accomplished after every single day.' Although they have created quite a fanbase, many people are shocked by their ability to handle the gory scenes so well. 'Many people couldn't believe what I was doing, or how I was able to do it... and many still don't fully understand this,' Tom told DailyMail.com.'While most people would hear things such as \"No way you do that, that is crazy,\" and \"I could never do what you do Tom,\" and shy away, those comments actually made me more interested in the job.'I'm not sure why, but doing something that I know most other people would never do, try, or be able to handle, really made me enjoy this job so much more.' "
    ]
}