{
    "articleURL": "/tvshowbiz/article-12039133/Im-Celeb-South-Africa-Amir-Khan-person-evicted-shock-secret-ballot.html",
    "content": [
        "Amir Khan has claimed he begged his campmates to vote him off I'm A Celebrity... Get Me Out of Here! after he became the third person on Tuesday following a secret ballot.",
        "In Monday's episode, the campmates learned that, in a dramatic first for the series, they'd be choosing who was voted out of camp next.And it was the former boxer, 36, who ended up losing his place after getting the most votes from his fellow famous contestants.However, the sportsman insists he instructed the other celebrities to get rid of him as he did not want to be seen on screen doing anything controversial, like when he cheekily ate a box of strawberries he'd won for the whole group during his first stint on the show in 2017.He told the Mirror: 'I didn’t want to see anyone else go to be honest with you. I hope people at home say, \"Amir has made a massive difference to the first time.\"",
        "'I thought, I’ll be the one to put my hand up. It’s best to leave on a good note than do something silly… which I think was coming!'Speaking to hosts Ant and Dec after he left the camp, Amir told how he was proud of himself after overcoming his fears, noting how he'd handled a snake in his last trial. He also gushed over his second stint on the ITV show, remarking that it was one of the 'best experiences I've ever had',  adding that it was 'even better than Australia'.xf",
        "The sportsman's vote was no doubt influenced by the fact he'd earlier declared that he was ready to leave as he was missing his children.After the vote was revealed, Georgia Toffolo said that she felt so 'distraught' that her buddy had left. While Janice Dickinson called him a 'good egg', with Paul Burrell adding he was a 'trooper'. After each voting in a secret ballot, the campmates woke up unhappy about the prospect of having a hand in who is leaving that morning.Helen Flanagan said of voting: 'It makes you feel like s***', while Georgia Toffolo adds: 'I'm not happy about my decision. I just felt I had to vote for someone.'",
        "Myleene Klass said: 'I'm now thinking, did I do the right thing?'Amir noted: 'This is not a holiday, it's a competition and there has to be one Legend, one winner.'While Jordan Banjo concurred: 'At the end of the day there's only going to be one winner.'In a post-exit interview, Amir opened up about his time on the show, explaining: 'It was one of the best experiences I’ve ever had. It’s like I got to be with a new family in South Africa. 'I’m always going to compare it with my first time in Australia but this one, for me, was way better. Great camp, the campmates were amazing.",
        "'Even though I would have loved to have stayed in a little bit longer, sometimes what can happen is, if you stay longer, you can outstay your welcome. It was just a great experience and I’m just glad I had the opportunity.'On what made him love his latest experience more, he added: 'I think it’s the camp and the people in the camp. I had no clue before about the show. 'I had to go in there this time and put my thinking cap on and be strong. I couldn’t give up on the Trials this time. It was a bit of a test for me, too. I’m scared of spiders, snakes, heights – and I managed to get through a lot of things.'Amir also opened up about suggesting he was ready to leave ahead of the secret ballot, stating that he wanted to leave 'on a good note'.He shared: 'I didn’t want to see anyone else go to be honest with you. We were all having such a great time in there. I was enjoying it, too. I gave myself the confidence that I can do the Trials. 'I thought, \"I’ve got no fear now. I can do these.\" I’d impressed myself. I hope people at home say, \"Amir has made a massive difference to the first time [in camp].\" ",
        "'I’ve overcome what I wanted. I didn’t want to vote anyone else out. I thought, I’ll be the one to put my hand up. It’s best to leave on a good note than do something silly… which I think was coming! Anything could have happened, you can’t be good for that long! 'I’ll end up doing something silly, pulling a stunt, I’m just that kind of guy. I’m just so glad in a way I didn’t do anything silly, like Strawberry-Gate, and hopefully people will now remember me for going to the jungle and saying, \"He’s a good man\". ",
        "Amir's exit comes after Shaun Ryder and Gillian McKeith became the first stars to leave the camp.Shaun, Phil Tufnell and Andy Whyment left the Savannah Scrub and headed into Main Camp, only to discover they would take part in the first survival Trial of the series.Each picked another celebrity to do it with them, and the losing pair would leave camp for good - with Shaun choosing former nemesis Gillian.The trial saw the pairs handcuffed together and had to remove spanners and wrenches from three boxes - filled with creepy crawlies - in a bid to free themselves.",
        "However Gillian refused to put her into the first box as she was scared of the snakes inside, resulting in her and Shaun being the first to leave camp and fans exclaiming the nutritionist 'didn't even try' to win the task.",
        "After each voting in a secret ballot, the campmates woke up unhappy about the prospect of having a hand in who is leaving that morning.Helen Flanagan said of voting: 'It makes you feel like s***', while Georgia Toffolo adds: 'I'm not happy about my decision. I just felt I had to vote for someone.'I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}