{
    "articleURL": "/sport/wwe/article-12050039/WWE-star-Sara-Lee-died-October-committing-suicide-autopsy-confirmed.html",
    "content": [
        "Former Tough Enough winner Lee suddenly passed away in October 2022An autopsy report has confirmed the 30-year-old died after committing suicideReports claim that Lee consumed a 'lethal combination of alcohol and pills'Former WWE star Sara Lee died after committing suicide, a new autopsy report has confirmed.",
        "The 30-year-old, who in August 2015 won the sixth season of WWE's reality show competition Tough Enough, passed away in October. TMZ Sports have reported the Bexar County Medical Examiner's Office documents claim Lee consumed a 'lethal combination of alcohol and pills', while also explaining there were 'letters of intent at the scene' before her death.Lee reportedly had bruises and abrasions on her body and her head when she died, but officials suspected this may have been as a result of multiple falls while she was intoxicated.At the time of her death seven months ago, there was an outpouring of emotion from across the wrestling world.",
        "WWE said in a statement: 'As a former \"Tough Enough\" winner, Lee served as an inspiration to many in the sports-entertainment world. WWE offers its heartfelt condolences to her family, friends and fans.' Lee was married to Cory Weston, who went by the wrestling name Wesley Blake, and the couple had three children.After she passed away, Weston posted an emotional note on his Instagram that read: 'You were a motivator, a best friend, a sister, a daughter, an aunt, the backbone of our family, and (my favorite), my wife. 'I can’t promise that I will stop grieving but I know now, that you’re free. I can’t thank you enough for giving me the best years of my life so far.'",
        "Born in Hope Township, Michigan, Lee was a competitive powerlifter in high school and went on to study medical sonography at Delta College in Bay City, Michigan.She entered the WWE reality TV show and was declared the winner by a fan vote, with the prize of a $250,000 (£198,000) contract for a year with the franchise.",
        "In 2016 she left the WWE and trained in Orlando, Florida, with Team Vision Dojo.Lee and Weston married in December 2017, and together they had daughter Piper, aged five, three-year-old son Brady, and a baby boy born in August 2021.In the UK and Ireland, Samaritans can be contacted on 116 123, or email jo@samaritans.org or jo@samaritans.ie. Alternatively you can visit samaritans.org to find your nearest branch.In the US, 988 Suicide &amp; Crisis Lifeline (formerly known as the National Suicide Prevention Lifeline) can be contacted via call or text on 988 or online at 988lifeline.org "
    ]
}