{
    "articleURL": "/wires/ap/article-12039281/California-hotline-provide-legal-help-related-abortion.html",
    "content": [
        "LOS ANGELES (AP) - California has joined with law firms and advocacy groups to create a hotline that provides access to information and pro bono services for people who need legal help related to abortion, as the state seeks to become a safe haven for reproductive rights since Roe v. Wade was overturned.",
        "State Attorney General Rob Bonta and officials with the Southern California Legal Alliance for Reproductive Justice made the announcement Tuesday, one year since the U.S. Supreme Court draft decision reversing Roe was leaked.Calling it a \"dark anniversary,\" Bonta said that in the ensuing year the national legal landscape surrounding abortion has become \"confusing, and frankly, scary.\"He said the new coalition seeks to put patients and care providers at ease by providing a wide range of legal services to people in places where abortion is restricted - including pro bono representation for anyone facing civil or criminal penalties for seeking, providing or assisting in reproductive care.\"They aren´t alone. We´re here. We have support. We have resources. We have guidance, we have counsel for you,\" Bonta said at a news conference.In addition, legal experts will offer guidance about compliance amid shifting restrictions in various states, advice about protecting sensitive health data and support for amicus briefs to advance reproductive rights.",
        "\"Unforgiving abortion bans and the devastating health consequences that follow are galvanizing advocates, providers and law firms,\" said Lara Stemple, director of the Legal Alliance for Reproductive Justice.Threats of jail time, fines or protracted legal battles have already caused providers to deny critical care and forced patients to turn to unsafe measures, officials said.",
        "The state and the legal alliance will get support from groups including Planned Parenthood, Access Reproductive Justice, the National Women´s Law Center and the University of California, Los Angeles, Law Center on Reproductive Health, Law, and Policy.The California coalition will align with the Abortion Defense Network, a national nonprofit that provides similar advice, representation and funding to help pay legal expenses related to abortion care, Stemple said.\"So the network is vast and growing,\" she said. \"I´m confident that we would be able to connect any abortion provider in any place in the United States with lawyers who would be willing to help.\"Last June, the Supreme Court overturned Roe v. Wade, the 1973 decision that had provided a constitutional right to abortion. The ruling has led to abortion bans in roughly half the states.In anticipation of the decision, California and other states led by Democrats have taken steps to protect abortion access. The high court's decision also set up the potential for legal fights between the states over whether providers and those who help women obtain abortions can be sued or prosecuted."
    ]
}