{
    "articleURL": "/femail/article-12059539/Queen-Maxima-Netherlands-radiant-yellow-floral-dress.html",
    "content": [
        "Maxima greeted the Kenyan officials alongside King Willem-AlexanderREAD MORE: Máxima of the Netherlands stuns in white satin dress Queen Maxima stunned as she welcomed Kenya's president William Ruto and the First Lady Rachel Ruto to Noordeinde Palace in The Hague today. ",
        "Maxima, 51, looked elegant as she greeted the Kenyan officials at the palace alongside her husband, King Willem-Alexander of the Netherlands, 56.The Queen donned a floral patterned mustard maxi dress with an asymmetrical hem and puffy sleeves.The dress - which ties at the waist - was decorated with brown patterns and she accessorised her look with mocha coloured beaded earrings. She sported some stylish brown leather heeled boots to complete her outfit.",
        "The King looked smart in a navy suit with a handkerchief in his blazer pocket, along with a yellow tie - matching with his wife. President Ruto and his wife also donned similar colours, as she wore a white dress with blue and purple patterns and he sported a lavender tie.The couple sat down with the president and first lady for a meeting in the palace, as pictures show them in conversation.It's been a busy week for the Dutch royals as they also attended the Coronation of King Charles and Queen Camilla at Westminster Abbey over the weekend. It was a historic and also significant event as it was the first Coronation in 70 years. King Willem-Alexander is distantly related to King Charles - he was the Queen's fifth cousin once removed thanks to an ancient connection in their family tree.",
        "Willem-Alexander is a descendant of Princess Carolina of Orange-Nassau, who was the daughter of William IV, Prince of Orange, and his wife Anne, the eldest daughter of King George II of Great Britain and his consort Caroline of Ansbach.The pair looked regal as they arrived at the Abbey, with Maxima wearing a stunning white dress which she paired with matching gloves and a large hat.The top half of the dress was sheer mesh with a floral pattern and it tied at the waist. ",
        "She paired the look with nude coloured heels and a cream clutch bag.The King looked dapper a black blazer with pinstriped trousers, polished shoes and a grey waistcoat and tie. In 2018, the royal couple last visited the UK in 2018 - when Maxima greeted the late Queen with a friendly peck on the cheek. The Queen and the Duke of Edinburgh also paid a state visit to Queen Juliana and Prince Bernhard of the Netherlands in March 1958. "
    ]
}