{
    "articleURL": "/wires/reuters/article-12058015/Japans-service-activity-grows-record-pace-April--PMI.html",
    "content": [
        "TOKYO, May 8 - Japan's services activity grew at a record pace in April, a private-sector survey showed on Monday, helped by a boost in consumer spending following the end of COVID-19 pandemic restrictions.",
        "The final au Jibun Bank Japan Services purchasing managers' index (PMI) climbed to a seasonally adjusted 55.4 last month from March's 55.0.It was also higher than the flash reading of 54.9 and well above the 50-mark that separates expansion from contraction for a seventh straight month.\"Strong increases in travel, leisure and tourism spending underpinned another month of swift recovery for the Japanese economy as the impact of COVID-19 continued to fade,\" said Tim Moore, economics director at S&amp;amp;P Global Market Intelligence.\"There were also many reports citing a boost to sales from the recovery in international tourist arrivals and subsequent improvement in new business from abroad,\" he said.Japan ended strict COVID-related border control measures that required vaccination certificates or negative tests on Saturday, in hopes of easing congestion at airports before the start of a week-long holiday.The government also decided to reclassify COVID-19 as an infectious disease level on par with the seasonal flu.Visitors to Japan surged to 1.82 million in March, the highest since the COVID-19 pandemic.New orders expanded at the fastest pace on record, the survey showed, citing a sharp return of spending for travel and tourism.Business confidence for the coming year also remained strong, with the subindex hitting a record high.",
        "\"Around four times as many service providers expect an increase in activity as those that forecast a decline,\" Moore said.The subindex for employment expanded for a third month and at the fastest pace in four years, helped by stronger demand and confidence.The composite PMI, which combines the manufacturing and services figures, grew at the fastest pace since June 2022. The index was unchanged in April from the previous month's 52.9, staying above the break-even 50 mark for four consecutive months. (Reporting by Eimi Yamamitsu; Editing by Sam Holmes)"
    ]
}