{
    "articleURL": "/sport/football/article-12038639/Arsenal-3-1-Chelsea-Martin-Odegaards-brace-Gabriel-Jesus-effort-secure-win.html",
    "content": [
        "Arsenal cruised to a 3-1 London derby victory over a hapless Chelsea side after scoring three first half goalsMartin Odegaard tucked away two Granit Xhaka crosses before Gabriel Jesus struck from close rangeNoni Madueke grabbed a consolation goal in the second half for the Blues who otherwise barely threatened Arsenal raged against the dying of their title dream at the Emirates last night but the truth is they did not have to rage very hard. Humbled by Manchester City last week and on a run of four games without a win, they were a side in need of an easy night and a confidence boost. Chelsea obliged on both counts.",
        "As good as Arsenal were, as much as their play provided happy reminders of the wonderful season they have had, the startling part of this London derby was just how bad Chelsea were in a first half when they were an embarrassment to their club and to their fans.Mauricio Pochettino is said to be close to agreeing a deal to take over at Stamford Bridge next season but the former Spurs boss posted a picture of a walk on the beach with his dog Sansa and if he was watching this, he must have wondered whether Sansa might be a lot easier to train.Arsenal's 3-1 win victory took them back to the top of the table, two points ahead of City, who have two games in hand on them and remain strong favourites to win their third title in succession. Chelsea remain in 12th position, nine points clear of the relegation zone. They will not go down but they are playing like the dregs of the division.This was their sixth successive defeat since caretaker manager Frank Lampard took over and their £600m collection of superstars looked like a rabble. The club has become a bloated, over-entitled mess since Todd Boehly bought it. His players played like misfits, not the elite group they are supposed to be.",
        "Arsenal were superb in the opening 45 minutes and scored twice through skipper Martin Odegaard with a third from Gabriel Jesus but it was embarrassingly easy for Mikel Arteta's side. 'Everyone was so hurt after City,' Odegaard said. 'We used that anger and disappointment to bounce back in this game.'Chelsea had no bounce at all. They looked devoid of motivation, devoid of spirit, devoid of pride, devoid of composure, devoid of confidence, devoid of defiance, devoid of determination. The Arsenal fans had fun ridiculing them.Arteta had reacted to the City defeat by dropping Thomas Partey, who has been struggling for some time, Rob Holding, who may still be chasing Erling Haaland somewhere, and Gabriel Martinelli. Jakub Kiwior was handed a full debut at the back.Both managers went into the game desperately searching for a spark to ignite faltering form. Lampard looked for it by giving a starting berth to Pierre-Emerick Aubameyang, gambling on the law of the ex. It didn't work.",
        "ARSENAL (4-3-3): Ramsdale 7; White 5.5, Kiwior 6.5, Gabriel 6.5 (Holding 85min), Zinchenko 6 (Tierney 73, 6); Odegaard 8.5, Jorginho 7 (Partey 86), Xhaka 7.5; Saka 7 (Nelson 74, 6), Jesus 7.5, Trossard 7 (Martinelli 59, 6.5).Scorers: Odegaard 18, 31, Jesus 34. Booked: None.Manager: Mikel Arteta 7.CHELSEA (4-3-3): Arrizabalaga 5; Azpilicueta 5, Fofana 5 (Chalobah 86), Silva 6, Chilwell 6; Kante 6, Fernandez 5.5 (Mudryk 71, 6.5), Kovacic 6.5; Madueke 6.5 (Ziyech 79), Aubameyang 4 (Havertz 46, 6), Sterling 6 (Gallagher 71, 6).]Scorer: Madueke 65.Booked: Kovacic, Gallagher.Manager: Frank Lampard 5.Referee: Robert Jones 6.5. Attendance: 60,144.",
        "Aubameyang has got plenty of previous with Arsenal. He was stripped of the captaincy and moved on to Barcelona. Lampard might have imagined he would be keen to impress. It didn't look that way. Aubameyang was anonymous in the first half. Almost the only time he touched the ball was to squander a rare opening with a heavy touch.Chelsea had only scored once in their previous seven games but they are not short of weaknesses at the back, either, and a defensive mistake inside the opening five minutes nearly allowed Arsenal to take the lead.When the ball was allowed to bounce in the area, Cesar Azpilicueta tried to head it back to Kepa Arrizabalaga but left it woefully short. Granit Xhaka stole on to it and volleyed it towards goal but Kepa blocked it at point-blank range.Ten minutes later, Kepa kept out a looping header from Bukayo Saka with a last-ditch dive but it was not long before Arsenal's pressure told. ",
        "A square pass from Xhaka was allowed to roll across the edge of Chelsea area to Odegaard, who had time and space to curl a shot over the Chelsea keeper. Kepa got his fingertips to it but it went in off the underside of the bar.'You're going down, you're going down,' the Arsenal fans sang at their Chelsea counterparts but it took a fine save from Aaron Ramsdale to keep out a shot from Ben Chilwell. It was only a brief reprieve.",
        "Just after half an hour, Arsenal scored a second goal that was a carbon copy of the first. The ball was worked to Xhaka on the left, he drilled it across the box, Odegaard peeled away from Raheem Sterling and forced his shot past Kepa.Two minutes later, Arsenal were three up. Chelsea's defending was appalling. Ben White floated a cross to the back post, Gabriel Jesus chested it down, Chelsea could not clear it and when it rebounded to Jesus, he rammed it past Kepa. Chelsea were shambolic.Aubameyang had nine touches in the first half. None of them were any good. So it was hardly a surprise when he did not reappear after the interval, replaced by Kai Havertz.",
        "It didn't seem to help.Arsenal started the second half with a blizzard of chances. Thiago Silva juggled a header from Gabriel on the line before he hacked it clear, Kepa saved from Xhaka, Jesus lifted a back post volley over the bar from close range when he should have scored and Saka pulled a shot inches wide from the edge of the area.In the circumstances, it was a surprise when Chelsea pulled one back midway through the half. Noni Madueke lost Oleksandr Zinchenko to run on to a fine ball from Mateo Kovacic, shrugged off the attentions of Gabriel and steered the ball past Ramsdale. It was Madueke's first league goal since his £29m move from PSV Eindhoven in January.",
        "The rest of the game lapsed into a stalemate. Arsenal kept their opponents at arm's length without too much difficulty. They have resumed the title race with renewed hope. Chelsea have no hope left."
    ]
}