{
    "articleURL": "/wires/pa/article-12046033/Lee-Westwood-accuses-DP-World-Tour-fully-bed-PGA-Tour.html",
    "content": [
        "Lee Westwood has accused the DP World Tour of being “fully in bed” with the PGA Tour after announcing his resignation from the European circuit.",
        "Westwood and fellow Ryder Cup stars Ian Poulter and Sergio Garcia have resigned their membership and are therefore no longer eligible for the biennial contest against the United States.The trio were among the players fined £100,000 and suspended for two tournaments after playing the first LIV Golf event last year without permission.Westwood and Poulter were also among the 12 members of the Saudi-funded breakaway who lost an appeal against the sanctions last month and were deemed to have committed “serious breaches” of the DP World Tour’s code of behaviour by a three-man arbitration panel.Westwood confirmed he has paid the fine and is keen to “move on”, but reiterated his criticism of the way the PGA Tour and DP World Tour have reacted to the emergence of LIV Golf.“I’ve been a dual member of the European Tour and PGA Tour, but always said I was a European Tour member first and foremost and that I had fears about the US circuit basically being bullies and doing everything it could to secure global dominance,” Westwood told The Telegraph.“Check my old quotes, it’s all there.",
        "“But now, in my opinion, the European Tour has jumped fully in bed with the PGA Tour and even though Keith (Pelley, the chief executive) says he hates to hear it, it is now a feeder tour for the PGA Tour.",
        "“The top 10 players on the tour, not already exempt this year, have a pathway to the PGA Tour – that’s giving our talent away. That was never the tour’s policy before this ‘strategic alliance’.“Sorry, I don’t want to play under that sort of regime.“I mulled it over and just didn’t like the thought of the tour continuously hitting us with more fines and bans that would have been hanging over me.“I’ve paid my fine out of respect for the arbitration panel and have then taken the decisions out of the tour’s hands. I honestly want to move on.”"
    ]
}