{
    "articleURL": "/news/article-12057003/California-homeowner-comes-face-face-coyote-wandered-Los-Angeles-home.html",
    "content": [
        "Video shows a man and his housecat encountering a coyote in their homeThe scary face-to-face run in occurred in a suburb of Los Angeles, CaliforniaIncident comes just months after coyote attack on young girl in same area A man and his housecat came face-to-face with a wild coyote in their home after the animal entered the house through a doggie door. ",
        "The scary incident occurred in the Woodland Hills neighborhood of Los Angeles on Friday and security camera footage captured the moment the two parties met. Homeowner Mia Shoshan said her brother heard the doggie-door swing open despite both of their dogs being in his room and a commotion in the living room.'Our cat, Lily, started meowing and screaming, she was terrified and calling for us to help,' said Shoshan. ",
        "In the video, the cat was seen darting around furniture and fearlessly facing the wild animal that intruded on the home. The coyote looks around and saw the cat, only to turn and dance back and forth with the domestic animal. Seconds later, Shoshan's brother walks in and sees the animal, which sent the coyote scattering. The animal fled back out into the yard through the doggie door. 'As soon as the coyote saw him, he ran right back out the doggie door and left,' Shoshan said. 'No one and no pet was harmed thank God.' While no one was injured, the woman said her cat was shaken up.  'Our cat is 14 years old and took it very hard,' Shoshan said. 'She used a lot of energy and she has been resting and spending time with us. I have two very small dogs and they would've been an easy target for that coyote,' she continued. ",
        "The Los Angeles-area resident is now warning other residents to be weary when walking their pets or leaving their doggie doors open. 'Usually, we leave the door open for them throughout the day and sometimes at night too, but we will no longer be doing that unless we are going outside with them,' said Shoshan.One resident who spoke with KTLA said coyote encounters are far too common.'A six-foot fence, they'll just jump right over it,' said Ron Lauer. 'They can get in the backyard. They will definitely find a way.'",
        "According to wildlife experts, the coyote population in the Los Angeles area is expansive. Some estimate there could be as many as 750,000 coyotes throughout California.In 2022, a young girl in the same neighborhood was dragged by a coyote in a shocking incident that was also caught on camera.In the video, the family appeared to be getting out of their car when the coyote approached the girl on the lawn and began to draw her by her legs. The 2-year-old girl's father was able to chase after the coyote and the animal let her go. The girl was rushed to the hospital with non-life-threatening injuries. "
    ]
}