{
    "articleURL": "/sport/nba/article-12048707/Bucks-head-coach-Mike-Budenholzer-FIRED-seeded-Milwaukee-fell-round.html",
    "content": [
        "The Bucks entered the playoffs with the best record in the Eastern Conference Giannis Antetokounmpo criticized Budenholzer's coaching after the series DailyMail.com provides all the latest international sports news Mike Budenholzer has been dismissed as head coach of the Milwaukee Bucks after the team's first-round loss to the eighth-seeded Miami Heat. Budenholzer, 53, guided the Bucks to their second NBA title in 2021. ",
        "ESPN was the first to report the decision on Thursday.Bucks star Giannis Antetokounmpo missed multiple games against the Heat due to a lower back injury. Following the series, Antetokounmpo was critical of the team's coaching - particularly on defense, where the Bucks struggled to control Heat star Jimmy Butler.'I don't know, double-team him more, try to make him pass the ball,' Antetokounmpo said, as quoted by ESPN.'Maybe switch the matchup for a little bit, give Jrue [Holiday] a break. I don't think as a team we made the right [adjustment] or we didn't make as many adjustments as we could have against him.",
        "Budenholzer coached the last two games of Milwaukee's season with a heavy heart, as one of his brothers died in a car crash prior to Game 4. He did not disclose the tragedy during the series, but Lakers coach Darvin Ham - who worked as an assistant under him in Milwaukee - revealed the news ahead of LA's Game 6 win on Friday night.'Coach Bud is going through a lot on a personal level,' Ham said. 'He just lost his brother, so, my apologies Bud if I wasn't supposed to let anybody know. He and I've been texting. I love those guys.' The Bucks announced their decision on Thursday evening.  ",
        "'The decision to make this change was very difficult,' Bucks general manager Jon Horst said in a statement Thursday. 'Bud helped lead our team for five incredible seasons, to the Bucks' first title in 50 years, and into an era of sustained success. We are grateful for the culture of winning and leadership that Bud helped create in Milwaukee.'This is an opportunity for us to refocus and reenergize our efforts as we continue building toward our next championship season.'The Bucks won 58 games during the regular season under Budenholzer and entered the playoffs as the No. 1 seed in the Eastern Conference.",
        "'We have our best defender on him, but obviously there's conversation, whenever he gets tired, I can take him. ... At the end of the day, I wish I could've guarded him more.' Budenholzer was responsible for turning the Bucks into the perennial contender. In 2021 he guided the team to its first NBA championship since 1971.During his tenure, the Bucks went a highly impressive 271-120 which amounted to the best record in the league across that span. Budenholzer's job status had previously come under question after the 2020 playoff loss to Miami but he was instead giving a three-year extension following the NBA Finals victory the following year. "
    ]
}