{
    "articleURL": "/news/article-12059659/National-Park-Service-offering-chance-rent-eight-1920s-Cape-Cod-dune-shacks.html",
    "content": [
        "Applications for the shacks are due by July 1, and tours will be held on June 15The leases are being offered on 10-year terms through a public bidding processLessees will be chosen based on their ability to maintain the shacks and occupy them in a manner than embraces the local environment and culture of the dunes The National Park Service is offering a chance to lease eight historic and very off the grid dune shacks in remote Cape Cod.",
        "Located just outside of Provincetown on the Atlantic-facing tip of the cape, the shacks are half-buried in the shifting sands dunes that stretch down the coastline into neighboring town of Truro, and are accessible only by foot or with a 4x4 capable of navigating the sandy trails.Fresh water in the simple structures is spare, electricity next to non-existent, cellular service a distant dream, and many of the shacks have just one room and are useful for little more than sleeping, sitting, or staring out the windows at the surrounding landscape. Outhouses prevail as the common form of plumbing.Constructed on public land as far back as 1920 by fishermen or local Coast Guardsmen, the shacks have since become the property of the National Parks Service and been leased out to willing residents over the years.The parks service is now opening public biddings on the eight available shacks for ten-year lease terms starting at annual prices from $2,000 to $16,000. They are being offered 'as is with all faults,' and lessees would be required to maintain the homes up to historic and environmental standards, and barred from operating any sort of business out of them.",
        "The available shacks are just eight of 19 that dot the dunes at the tip of Cape Cod as a part of the Peaked Hill Bars Historic District. Many of those are leased by non-profits which host residency programs through the parks department for artists and scientists to immerse themselves in their craft in solitude.",
        "Applications for the eight available shacks must be submitted by July 13, and the park service is offering tours by appointment on June 15.Potential tenants will be 'evaluated on overall merit,' the parks service wrote in its announcement. 'Evaluation criteria include compatibility of the proposed use of the property with respect to preservation, protection, and visitor enjoyment of Cape Cod National Seashore.'Beyond just evaluating bidder's ability to pay for their lease throughout its term, the service said their 'ability and commitment' to properly participate and preserve the dune's unique lifestyle 'in an environmentally enhancing manner' was paramount.Use of the shacks will be allowed from Memorial Day through Labor Day, with renters being given access for seasonal opening and closing preparations beginning in April and ending around November.The cheapest shack is asking $2,107, while one of the larger shacks - the Adams Shack, which includes a guest building - is going for $16,000. The parks service said prices are likely to go higher amidst competitive bidding. Those starting prices were determined by a market analysis conducted for the parks service, and which found they reflected market value.Lessee will be required to pay for and carry out any and all repairs or maintenance projects the shacks need, and those repairs will need to be done within the standards of the Secretary of the Interior’s Standards for Treatment of Historic Properties.",
        "'The dune shacks are small, weathered, and often built on pilings to adjust for the ever-moving sand dunes surrounding these properties. The houses are remote, with no paved roads leading to them,' the parks service said. 'Access is required by foot or by 4x4 vehicle along the park’s Oversand corridor. There is limited running water, plumbing, and electrical fixtures in most of the shacks.'",
        "Over the years the shacks have been occupied by artists including Tennessee Williams, E.E. Cummings, Harry Kemp, and Jackson Pollock. Earlier, Henry David Thoreau stayed in shacks in the same dunes during his travels in the mid-1800s.   'Historically, these dune shacks have been used to foster a deeper connection with the natural world, promote solitude and inspiration, and to support the creative process for writers and artists within the local community,' the park service said in its announcement. 'The dune shack structures are rustic in design and were intentionally designed to promote a simpler way of life.'According to photographer Jane Paradise, who has thoroughly documented the area in a book about the homes, the shacks are 'home for those of us who want to be (t)here, who are lost without the endless vista of sand, the crashing Atlantic Ocean waves, the whales, the seals, the sand, the night sounds, the night skies.'",
        "'Coyotes will howl in the night, foxes will cry or scream; numerous animal tracks will envelope the sand around your shack in the morning. You wonder where all those tracks came from and how you didn’t hear a sound. Solitude abounds with the sound of the sea ever present.'"
    ]
}