{
    "articleURL": "/wires/pa/article-12047199/Rent-cap-legislation-discriminates-against-private-landlords-court-told.html",
    "content": [
        "Private sector landlords are being “discriminated” against as a result of an “unlawful” Scottish Government cap on their rent increases, Scotland’s highest civil court has heard.",
        "Landlords across Scotland have mounted a legal challenge against the Government after a rent freeze was passed at Holyrood and implemented last year.In April 2023, private sector landlords were once again able to increase rents, but only by a maximum of 3% without justification and by 6% with justification.At a hearing at the Court of Session in Edinburgh, Lord Neil Davidson KC represented several respondents including the Scottish Association of Landlords, Scottish Lands and Estates, and the Church of Scotland.Lord Davidson argued private landlords have faced increased costs including, in some cases, interest rate hikes of around 127%.He suggested the Scottish Government’s actions did not take into consideration the financial difficulty private landlords were facing regarding increases in overall costs. The social sector gets what is acceptable to them. The private sector does not  Lord Davidson  In a submission on behalf of the Church of Scotland, Lord Davidson told the court the move had had a negative impact on many congregations across Scotland as they are choosing not to rent out vacant manses which they would generally do to raise income.He argued this meant many congregations felt they had no option but to sell their manses.Landlords also believed, Lord Davidson argued, the freeze was not “temporary” because the loss in income they experienced was, in many cases, permanent.",
        "He also compared the treatment of private landlords to the social housing sector, telling the court: “The social sector gets what is acceptable to them. The private sector does not.”Social landlords are able to increase rent by a maximum of £5 per week.Lord Davidson argued the Scottish Government’s difference in approach resulted in “discriminatory” and “unlawful” treatment.",
        "Responding on behalf of the Government, James Mure KC urged Lord Harrower to reject the submission.He said the move did not stop landlords from increasing rent yearly.He told the court: “Rent increases can take place every 12 months. There has been no change to that.“It also has no effect on rent between tenancies,” he said, as landlords remain able to increase rent when one tenancy ends and another begins.Mr Mure also argued there is some element of risk involved with being a landlord and profit is not guaranteed.“All of them are involved in a commercial venture with some risk,” he told the court.He also argued while landlords had a right to seek to derive profit, they did not have a right to make a profit."
    ]
}