{
    "articleURL": "/wires/reuters/article-12042185/Reuters-Health-News-Summary.html",
    "content": [
        "Following is a summary of current health news briefs.",
        "US fentanyl-related deaths more than tripled over 5 yearsThe rate of drug overdose deaths involving the synthetic opioid fentanyl more than tripled in the United States from 2016 through 2021, according to a report by the U.S. Centers for Disease Control and Prevention (CDC) released on Wednesday. Fentanyl is up to 50 times stronger than heroin and 100 times stronger than morphine, and has increasingly been mixed with other illicit drugs often with lethal results.WHO says risk 'moderate' after laboratory in Sudan seized by fightersThe World Health Organization said on Tuesday it had found after a risk assessment that there was a \"moderate risk\" related to the seizure of a public health laboratory in Sudan's capital Khartoum by one of the warring parties. \"The situation and the risk are being seen as moderate,\" WHO spokesperson Tarik Jasarevic told reporters at a briefing in Geneva.Amgen sues Novartis to block generic osteoporosis, bone cancer drugsAmgen Inc sued Novartis AG's Sandoz in New Jersey federal court Monday, accusing Sandoz's proposed versions of its multibillion-dollar bone-strengthening drugs Prolia and Xgeva of infringing several patents. Amgen asked the court to block Sandoz's biosimilars of the drugs until its patents expire. One of the patents named in the complaint does not expire until 2037.",
        "Gilead, US square off in billion-dollar HIV drug patent trialGilead Sciences Inc is headed to trial in Delaware federal court this week to fight claims that it owes the U.S. government a share of multibillion-dollar profits from its HIV-prevention drug regimen. The government is seeking more than $1 billion from Gilead for allegedly failing to compensate the Centers for Disease Control and Prevention (CDC) for discovering that Gilead's HIV-treatment drug Truvada could help prevent the disease.Haleon not surprised by Pfizer stake sale plans, says CFOPfizer's plan to sell its Haleon stake is not a surprise, the consumer health company's finance chief Tobias Hestler told Reuters on Wednesday. London-listed Haleon was carved out as an independent company in July and comprises consumer health assets once owned by GSK and Pfizer.Pfizer leans on COVID products to top estimatesPfizer Inc on Tuesday reported higher-than-expected first-quarter revenue and profit, buoyed by demand for its COVID-19 products, and reaffirmed its 2023 earnings forecast as it banks on newer drugs to contribute to growth later this year.The company has said it expects 2023 to be a low point for COVID product sales, before potentially returning to growth in 2024. But sales of both its vaccine and oral antiviral treatment came in above Wall Street estimates.",
        "Lilly drug slows Alzheimer's progression by 35% in trialAn experimental Alzheimer's drug developed by Eli Lilly and Co slowed cognitive decline by 35% in a closely watched late-stage trial, the company said on Wednesday, raising hopes for a second effective treatment for the brain-wasting disease. The drug, donanemab, met all goals of the trial. It slowed progression of Alzheimer's by 35% to 36% compared to a placebo in 1,182 people diagnosed with early-stage disease based on scans showing brain deposits of amyloid protein and intermediate levels of tau protein, Lilly said.CVS Health profit beats estimates on strength in pharmacy businessesCVS Health Corp beat estimates for first-quarter profit and revenue on Wednesday, as a steady recovery in medical procedures in the wider healthcare sector boosted sales of prescription drugs, helping its pharmacy businesses. Hospitals are seeing a recovery in non-urgent medical procedures as a pandemic-induced staffing crisis eases and as people return for routine health checkups, driving demand for medicines and tests.Straumann confirms 2023 outlook after slight Q1 sales growthSwiss dental implant maker Straumann Holding on Wednesday reported organic sales growth of 3.4% for the first quarter, helped by robust demand across most of its markets.The dental healthcare company confirmed its outlook of organic sales growth in the high-single-digit percentage range in 2023, and profitability at around 25% including growth investments.",
        "South Korea community doctors launch strike in protest over nursing lawMore than 10,000 South Korean community doctors and certified nursing assistants went on strike on Wednesday, protesting a nursing bill they fear would hurt their jobs even as it improves nurses' pay and working conditions. The bill, passed in parliament last week, was primarily designed to help nurses, who have been suffering from burn-out and a shrinking talent pool while fighting on the frontlines against COVID-19."
    ]
}