{
    "articleURL": "/news/article-12050367/Heads-Hydra-Russian-propagandists-hand-picked-Vladimir-Putin.html",
    "content": [
        "Putin and the Kremlin rule over the media landscape in Russia with an iron fistThe despot has a team of hand-picked propagandists to indoctrinate the nationMailOnline takes a look at the leading figures in Putin's propaganda drive Maintaining a vice grip over the flow of information always has and always will be a vital pillar of control for any authoritarian regime.",
        "But ever since Russian tanks rolled across the border and into Ukraine on February 24, 2022, the role of state media channels and Kremlin press representatives in shaping public opinion of warmongering president Vladimir Putin has been more important than ever. Moscow enjoys near total control of the media landscape, with all of Russia's largest newspapers and broadcasters either fully or partially funded by the state. This has allowed Putin to enlist a team of hand-picked propagandists, beaming into television sets, phone screens and inboxes across Russia to whip up support for his 'special military operation'.  Here, MailOnline takes a closer look at the leading figures tasked with indoctrinating Russian citizens and cultivating loyalty to the Kremlin as their armed forces continue to rain missiles down on Ukraine.",
        "Vladimir SolovyovVladimir Solovyov is one of the most recognisable faces on Russian television - and arguably Putin's most outspoken mainstream propagandist. He marked himself out as one of the despot's darlings in 2018 when he hosted a weekly show named 'Moscow, Kremlin, Putin' which offered a roundup of all the great and good performed by the Russian president across the country each week.But his broadcasts, which typically feature rambling monologues interspersed with fiery panel discussions, have become increasingly hawkish since Putin launched the invasion of Ukraine in February 2022.",
        "Solovyov, 59, gained worldwide notoriety thanks to countless outbursts on his nightly talk show 'Evening with Vladimir Solovyov', in which he regularly unleashes tirades about how Russia should wipe out its enemies with devastating attacks.He has threatened Ukraine's Western allies with nuclear warfare, famously declaring that 'London will turn to dust and burn in hell', and has called for Putin to 'plunge Ukraine into the dark ages', earning the moniker 'Putin's voice' for his unwavering allegiance to the Kremlin. But Solovyov's past belies his stature as a true Putin fanatic.",
        "In 2008, the man who now routinely calls for the bombing of Ukraine stood on stage and delivered a passionate speech to a packed audience in which he claimed that 'there will never be a war between Russia and Ukraine, and anyone who commits such an act is a criminal'. He described the people of Ukraine as 'fraternal in spirit, blood and common history' and declared that a war with them would be 'the worst crime you could think of'.It is possible that Solovyov has since undergone a radical ideological transformation and now believes Russia must conquer Ukraine. But others believe he simply sold his soul for a handsome pay packet and to avoid being marginalised or persecuted under Putin's regime. ",
        "Olga Skabeyeva and Yevgeny PopovDubbed Putin's 'Iron Doll' for her steely looks and hardline stance on the war in Ukraine, Olga Skabeyeva stands alongside Solovyov as one of the most prominent figures in Russia's state-controlled media.But perhaps unlike Solovyov, Skabeyeva appears to be a true believer in the Kremlin and a staunch follower of Putin and his regime. The 38-year-old broadcaster is a lifelong journalist, having studied at the Faculty of Journalism at Saint Petersburg State University from which she graduated with honours in 2008 before quickly rising through the ranks of Russian state media.Along with her husband Yevgeny Popov, 44, Skabeyeva has spread baseless conspiracy theories, overstated Moscow's war successes, parroted Kremlin lies about 'Nazis' in Ukraine and issued dire warnings of World War Three and threats against the West.Skabeyeva first rose to prominence in 2012 and 2013 for her coverage of the Pussy Riot trials and the ensuing criminal investigation into Russian opposition groups, taking a strong pro-Kremlin stance.Then in 2018, she was a linchpin in Moscow's campaign to discredit the British investigation into the Novichok nerve agent poisoning of Sergei and Yulia Skripal in Salisbury.Sergei Skripal was a former Russian military officer and double agent for the British intelligence agencies, and it is widely accepted that Russian agents were commanded to assassinate him on British soil.",
        "But Skabeyeva insisted the case was nothing more than 'an elaborate British plot to smear Russia'. ",
        "Skabeyeva's talk show '60 minutes' - first launched in 2016 - is now one of Russia's leading news segments and acts as a platform for various nationalist to spit venom and call for the destruction of Ukraine. Putin's 'Iron Doll' is the show's leading presenter, while Popov appears on a regular basis as an in-house panellist.The programme has alleged that Malaysian Airlines flight MH17 - widely understood to have been shot down by a Buk surface-to-air missile launched from pro-Russian separatist-controlled territory in Ukraine - was actually destroyed by a Ukrainian jet.It has also claimed that genocide has been carried out in Ukraine's eastern Donbas region against Russian speakers - a lie that the Kremlin has pushed in order to justify Putin's brutal and illegal invasion.Skabeyeva and Popov are proof that allying with Putin pays - the pair rank among Russia's richest propagandists whose fortune was estimated at around £4 million in 2021, despite their combined yearly media salaries supposedly totalling just over £200,000.Their fortune was unveiled in an investigation carried out by the Anti-Corruption Foundation (FBK) founded by jailed opposition figure Alexei Navalny, highlighting that much of their vast wealth is unexplained. ",
        "Margarita SimonyanMargarita Simonyan is the editor-in-chief of Russia Today (RT), a state-funded news network that has not only become one of the country's most successful domestic media outlets, but until the war in Ukraine had considerable international exposure.Simonyan, 43, was born in the southern city of Krasnodar in 1980 and like Skabeyeva is a lifelong journalist who throughout the early 2000s earned plaudits for her gritty, on the ground coverage of the Second Chechen War and the Beslan school hostage crisis in Russia's southern Caucasus region. Her journalistic exploits and allegiance to the Kremlin saw her become one of Putin's favourites and she skyrocketed to the top at an early age when she was appointed editor-in-chief of RT upon its creation in 2005. At just 25, Simonyan commanded a newsroom of hundreds of journalists, but under her guidance the organisation thrived as she set about portraying RT as a moderate alternative to more overtly pro-Kremlin media.Despite criticism, RT was able to build up a significant English language operation - it became a mainstay in the British media landscape and was for a time accepted as one of the few Russian media organisations not blatantly spouting the Kremlin's official lines. But the war in Ukraine saw Simonyan change her tack, and RT's coverage quickly transformed from news with a Russian spin to all-out Putin-approved propaganda. ",
        "Simonyan has since gone on to allege that Russia is not actually at war with Ukraine and is instead battling against the West, accusing Ukrainians of 'treason' in siding with NATO over Moscow.  She has also made her reverence of Putin clear, claiming that every meeting she shares with him is like 'a psychotherapy session'.",
        "However, Simonyan has proven herself to be somewhat more restrained than the likes of Solovyov and Skabeyeva who have openly called for the destruction of Ukrainian people. Late last year, she suspended one of her directors at RT, Anton Krasovsky, after he declared that Ukrainian children should be exterminated via drowning and burning during a live broadcast. 'Perhaps Anton will explain what kind of temporary insanity it was caused and how it broke from his tongue,' Simonyan tweeted.'It is hard to believe that Krasovsky sincerely believed that children should be drowned. 'For now, I'm stopping our collaboration, as neither I nor the rest of the RT team can afford to even think that any of us are capable of sharing such sentiments.'Krasovsky later apologised to Simonyan - but never retracted his comments.  Dmitry Peskov and Maria ZakharovaWhile the likes of Solovyov, Skabeyeva and Popov are tasked with the mass indoctrination of the Russian people via news and entertainment media, Dmitry Peskov and Maria Zakharova serve Putin from within the Kremlin as his loyal mouthpieces.Peskov, 55, is Putin's long-serving press secretary, and for all intents and purposes is the despot's primary representative responsible for communicating Putin's thoughts to the media and the public. He has worked directly for Putin since 2008, and as such is tasked with invariably supporting and justifying every statement, action and decree given by the President, including his suppression of political opponents, erosion of democracy and, of course, the brutal war in Ukraine.Peskov is known for his calm and measured demeanour, seemingly able to absorb criticism and inquiries from abroad - though he is often criticised for not providing substantive answers to journalists' questions, and has a habit of making serious statements that court more controversy. His disdain for anti-Kremlin activities is well documented and he has on several occasions called for Russian police to beat protesters.  In recent months, one of the most challenging tasks for Peskov has been to dispel rumours about President Putin's health. The press secretary frequently deflects and denies inquiries into the state of his boss' physical shape, particularly with regard to reports that claim he is battling Parkinson's or cancer and uses body doubles for public appearances.Jailed Putin foe Navalny claims Peskov's loyal service to Putin sees him handsomely rewarded far beyond his state-declared salary. In 2015, for example, he was pictured wearing a luxurious gold watch thought to be worth around £600,000, despite officially being paid less than £150,000 a year at the time. ",
        "Zakharova meanwhile is considered Putin's propagandist-in-chief over Ukraine, having occupied the position of Director of the Information and Press Department for Russia's foreign ministry since 2015. While Peskov represents Putin directly, the 47-year-old Zakharova controls Moscow's distribution of information across all aspects of foreign policy, up to including its clashes with Kyiv and the West.She once described Russian annexed Crimea as an 'unloved child', claiming the peninsula was not forced to join Russia but instead 'got up and left by itself like a stepson leaving a family where he was never loved'.And earlier this year she accused Britain of 'facilitating genocide' of Russian speakers by sending depleted uranium tank ammunition to Kyiv. 'The use of ammunition with depleted uranium is a manifestation of genocide of the population against which it is used and the people who use them,' she declared - conveniently leaving out that depleted uranium cannot be used to manufacture any kind of nuclear device and has also been used by Russia. US think tank Institute for the Study of War said Zakharova was framing the 'provision of depleted uranium ammunition to Ukraine as a significant escalation in order to bolster Russia's information operations' and was looking 'to place the onus for negotiations on the West'.Prominent personalities… and selfies with Elon Musk Almost all of Russia's media is controlled by the state, so there is no shortage of media personalities peddling Putin's propaganda on the airwaves.Dmitry Kiselyov, 69, is among Russia's most vocal propagandists and occupies several top positions in Moscow's media landscape. He was already working as a correspondent for the Vremya news service in the Soviet Union in the 80s, and is now the CEO of Rossiya Segodnya and the deputy director of VGTRK - the All-Russia State Television and Radio Broadcasting Company. But despite his lofty position, Kiselyov remains eager to get in front of the camera and is a regular contributor to the Russia-1 channel, often appearing in panel shows hosted by Solovyov and Skabeyeva.  Meanwhile, prominent radio and television host Anna Shafran has been described as the 'female version of Vladimir Solovyov' for her hardline views. The pair have worked together on several projects, co-hosting the 'Full Contact' morning talk show, and Shafran is a regular guest on Solovyov's debate show 'Who is against?'",
        "Aside from her work with Solovyev, Shafran hosts several of her own divisive talk shows and is known for her outspoken condemnation of Ukrainian, Western and Russian opposition groups.  Finally, Nailya Asker-Zade, a host at VGTRK, has been marked out as one of Russian media's rising stars.Born in Azerbaijan, Asker-Zade was chosen in 2021 to host the annual 'Direct Line' event - a marathon live Q&amp;A session which sees Putin spend hours fielding questions from members of the public but has been cancelled ever since the invasion of Ukraine. She is also believed to be in a relationship with Andrey Kostin, a chairman at Russia's VTB bank who has been described as Vladimir Putin's private banker.Asker-Zade courted controversy last year when she snapped a selfie with Tesla, Twitter and SpaceX CEO Elon Musk at the World Cup final in Qatar.  "
    ]
}