{
    "articleURL": "/tvshowbiz/article-12040081/Influencer-trolled-mispronouncing-common-Italian-dish.html",
    "content": [
        "Her finances already leave much to be desired, but it turns out Christie Swadling's grasp of the Italian language isn't much better.",
        "The fitness influencer, 27, has been mocked online for mispronouncing the word 'carbonara' in a sponsored video for Youfoodz ready meals.She posted a clip on Instagram of her latest Youfoodz delivery, but suffered a gaffe when she pulled out a packet of creamy chicken carbonara.Swadling pronounced it 'cabonara', missing the first r.This would no doubt offend Italians even more than pairing carbonara with chicken, when the traditional meat used is guanciale.",
        "It comes after Swadling was caught last month pretending she had been doing the weekly food shop, when in fact she had been in court having her finances examined.The YouTuber, who declared bankruptcy in December, had arrived at the Toronto Local Court in Lake Macquarie with her boyfriend Joel Price at 9:30am on April 20, and left just after 10:20am.The photographer who saw them outside court then followed the couple to a pharmacy, where Swadling bought protein powder, before the two headed home.That afternoon, Swadling shared a short video on Instagram, where she has 117,000 followers, announcing she had spent the day running errands.She made no mention of her court appearance and gave her fans the impression she had just gone grocery shopping before coming home to look after her stepchildren.",
        "Swadling filmed herself in the mirror wearing a little black dress - the same one she had worn to the Toronto courthouse - and panned the camera over to Price reclining on the couch while his children played video games in the background.",
        "'Working from home in the school holidays can be challenging,' she wrote.'After this morning's food shop then coming home doing kids' and dog's food. Only just starting work now,' she wrote, adding the timestamp of 1:29pm.",
        "Swadling filed for bankruptcy last year, and her day in court was to evaluate her property and financial circumstances as a means of satisfying the judgement debt.Arriving at the courthouse, she carried a Louis Vuitton handbag worth $2,840 as she prepared for the examination to determine her ability to repay her debts.Clutching a vape in one hand, she was supported by her heavily tattooed boyfriend as she rocked up in an LBD with a perilously high thigh split.The social media personality tried unsuccessfully to protect herself from the rain by holding a book over her head.",
        "It was revealed in February that Swadling was bankrupt after an anonymous user on the Tattle Life forums paid $15 to obtain the paperwork on her bankruptcy filing.She listed her job as an 'advertising and marketing professional' in the paperwork filed on December 29.The status of her bankruptcy was 'undischarged', which meant she would still need to pay back particular debts.It also meant she would not be able to borrow again from financial institutions without the disclosure of her bankruptcy.",
        "The release of the debtor's petition did not specify the outstanding debts, and the results of her financial examination on April 20 are unclear. ",
        "Swadling's courthouse appearance came days after she was mocked online for sharing her 'money-saving tips' despite filing for bankruptcy.She shared advice on Instagram on how to save money in a video advertisement for a cashback company.Influencer watchdog account Dutch Minty reposted the video alongside her bankruptcy filing and the caption: 'Bankrupt Christie giving out savings tips!'Swadling was roasted in the comments section, with followers pointing out the 'irony' of the partnership."
    ]
}