{
    "articleURL": "/news/article-12051989/Paedophile-28-Googled-lure-child-car-jailed-eight-years.html",
    "content": [
        "Zeshaan Tariq, 28, was driving in Peterborough when he pulled up to first victimWhen she escaped he coaxed girl, 12, into car, giving her drink that tasted funny Sentenced today to eight years and nine months in prison at Cambridge CourtA paedophile who Googled 'how to lure a child to a car' has been jailed for eight years.",
        "Zeshaan Tariq was branded 'every parent's worst nightmare' for kidnapping and sexually abusing a schoolgirl after first victim escaped.The 28-year-old was driving in  Peterborough on 7 July last year when he pulled up to his first victim, a 10-year-old girl, who was walking to her mum's workplace at about 3.30pm.When sentencing, Judge Mark Bishop said: 'Your internet search history was an alarming insight into what you intended to do.'Society rightly worries about the fact that children do not play outside, you are the reason for that change of concern. ",
        "'This proves it is rare, but real. You are an extremely dangerous individual.'Sick Tariq told the child to get in his car and, when she refused, he got verbally aggressive and she ran away. But he followed her until she came across a group of people, crying and asking for help. Just half-an-hour later, he apprached a 12-year-old girl as she got off a bus.He told the victim not to walk along Redmile Walk - because there were 'bad people' there.He told her she would be safe in his car and, despite knowing he was a stranger to the child, saying: 'Come with your uncle, I'm your uncle'.Evil Tariq parked up and went to the back of the car to gave the victim a fizzy drink - which she later described to officers as 'tasting funny'. ",
        "He then touched her inappropriately before sexually assaulting her.The victim told him she wanted to get out of the car but he refused to let her go.",
        "After a struggle, the girl managed to escape, but he continued to follow the distressed victim until he saw her crying to a member of the public who had dialled 999.Using CCTV checks police caught Tariq in his VW Golf in Welland Road where he was found to be driving while disqualified and without insurance two days after the offences.He was arrested and, on his phone, officers discovered recent Google searches on 'how to lure a child to a car'. They also found a bottle of fizzy drink and a bottle of vodka in the back of his car.Tariq found guilty of kidnap, attempted kidnap and sexual assault at Cambridge Crown Court in March and sentenced today to eight years and nine months in prison, with an extended licence period of three years and made subject of an indefinite Sexual Harm Prevention Order (SHPO).He admitted two counts of driving while disqualified and has had six points added to his licence and been disqualified from driving for a further eight years and eight months.DC Claire Atkinson, who investigated, said: “Tariq has proven to be a very dangerous man who poses a clear risk to children. The victims have been very brave in reporting their ordeals.",
        "“I am pleased he has faced justice and will be closely monitored for the rest of his life.”"
    ]
}