{
    "articleURL": "/wires/ap/article-12053207/Senga-goes-6-innings-Nimmo-homers-Mets-Rockies-1-0.html",
    "content": [
        "NEW YORK (AP) - Kodai Senga pitched six innings of two-hit ball after a long layoff and the New York Mets beat the Colorado Rockies 1-0 on Friday night to avoid falling under .500 for the second time this year.",
        "Brandon Nimmo homered and made a diving catch in center field after committing a costly baserunning blunder Thursday in Detroit.Drew Smith worked the seventh and David Robertson caught a break to strand two in the eighth when Ryan McMahon´s line-drive single hit pinch-runner Brenton Doyle on the leg between first and second for the final out of the inning.Colorado put a runner on third with one out in the ninth, but Adam Ottavino struck out pinch-hitter Mike Moustakas and retired Charlie Blackmon on a liner to right field for his fourth save.Colorado had its four-game winning streak snapped and was blanked for the second time this season in a game that took just 2 hours, 10 minutes.Pitching for the first time in nine days, Senga (4-1) worked around four walks and struck out four. The rookie right-hander got three strikeouts on his \"ghost fork\" and threw the pitch 24 times.",
        "\"Good, good. Well-rested,\" New York manager Buck Showalter said. \"I thought he had better command of his fastball. Just a solid (outing). His split was there some, not quite where it can be, but he's got enough secondary pitches. I thought he got a little better as the outing went on.\"Senga threw a career-high 101 pitches and became the first Mets starter to complete six innings since Joey Lucchesi on April 21 in San Francisco. It was the most pitches thrown by a New York starter this year.",
        "\"Mechanically, I thought it was very good,\" Senga said through a translator. \"I was ready to compete and velocity was there, and I was just determined to hold them to zero and to be able to do that is a big upside.\"The Mets moved to 17-16 after getting swept in a three-game series at Detroit, where Max Scherzer and Justin Verlander both pitched. New York, which won for only the third time in 12 games, has only been under .500 once since Showalter took over last season.\"We wanted to win really bad today,\" Ottavino said. \"Kodai did a great job. We didn´t want it to be for nothing.\"Before the game, general manager Billy Eppler expressed confidence in his $355 million roster by saying: \"I believe in this team and the players that are here. There´s too much track record.\"Antonio Senzatela (0-1) allowed one run and three hits over five innings in his season debut. Senzatela had not pitched since Aug. 18 last year, when he tore his left ACL. The right-hander had a 9.95 ERA in two rehab starts for Triple-A Albuquerque.\"It´s huge for me to be back in the game and throw a good game,\" Senzatela said. \"I just made one mistake and it cost me a game.\"",
        "After Senzatela retired his first nine hitters, Nimmo hit the first pitch of the fourth into the right-field seats.Senga gave up his first hit when Randal Grichuk singled with one out in the fourth.Nimmo raced in and made a headlong dive to catch Ezequiel Tovar´s sinking liner to open the fifth. Senga raised both arms and pumped his fist after Nimmo completed the catch.\"He just kind of got the barrel there and hit it to center field,\" Nimmo said. \"I felt like it was staying up long enough for me to be able to get underneath.\"AWARDS NIGHTMets injured closer Edwin Díaz walked up and down the dugout steps without crutches to receive his 2022 NL Reliever of the Year trophy before the game. Díaz, who is recovering from a torn patellar tendon in his right knee, was presented with the award by pitching coach Jeremy Hefner while his teammates gave him a standing ovation.ROCKIES MOVESBesides activating Senzatela, the Rockies added C Austin Wynns to the roster. They also optioned C Brian Serven to Triple-A Albuquerque and designated OF Yonathan Daza for assignment.TRAINER´S ROOMMets: RHP Carlos Carrasco (right elbow inflammation) had his rehab start pushed back to Saturday or Sunday due to a stomach bug. ... LHP Brooks Raley (left elbow inflammation) will throw a simulated game Wednesday.",
        "UP NEXTColorado LHP Austin Gomber (2-4, 7.57 ERA) opposes Mets RHP Tylor Megill (3-1, 4.11) on Saturday afternoon.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}