{
    "articleURL": "/news/article-12056315/Is-King-Charles-stance-softening-Prince-Andrew.html",
    "content": [
        "Andrew wore his robes despite not having an official role in the CoronationPrince Andrew was allowed to wear his Garter robes to the King's coronation reflecting an apparent softening of Charles' stance towards him.",
        "Andrew, who stepped back from royal duties after a controversial Newsnight interview and the furore over his friendship with paedophile financier Jeffrey Epstein, wore the ceremonial robes to Saturday's service at Westminster Abbey.The Duke of York, who stopped using the title His Royal Highness in an official capacity in January 2022, was given permission to wear the robes despite being banned by the late Queen from wearing them in public for her last Garter Day at Windsor Castle. Last June, Andrew did not appear alongside senior members of the family at the annual Order of the Garter despite being a Knight of the Garter. His absence was notable at the time and Buckingham Palace had described it as a 'family decision'.But while Andrew did not have any official role in yesterday's events, he still wore his Order of the Garter robe which holds special significance for the royals.",
        "Meanwhile, it is understood Prince Harry wore what he was asked to wear, which consisted of a dark morning suit and tie. The Mirror yesterday reported that they were informed by the Palace two weeks ago that Andrew would not be in Garter robes. The Order of the Garter is the oldest and most senior Order of Chivalry in Britain.According to the royal family website, in medieval times King Edward III was so inspired by tales of King Arthur and the chivalry of the Knights of the Round Table that he set up his own group of honourable knights, called the Order of the Garter.",
        "Today, the order includes the King, who is Sovereign of the Garter, 'several senior members of the royal family, and 24 knights chosen in recognition of their work', according to the website.The Order of the Garter robes are made of dark blue velvet and can be accompanied by a cap.The robe has a white satin lining, white silk bows on the shoulders, an attached red velvet hood and tasselled cordons.While Andrew donned Garter robes, Prince Harry, who served in Afghanistan, was wearing a morning suit with his medals.Harry is a Knight Commander of the Royal Victorian Order after being made so by the late Queen in 2015.This means he would be entitled to wear the order's vivid blue mantle.",
        "Yesterday's ceremony was a Collar Day meaning the Windsors could wear morning dress with mantles appropriate to the most Senior Order to which they belonged - the Order of the Garter, Thistle or Royal Victorian Order.The royal family wore an array of intricate gowns and grand velvet cloaks signifying their membership of historic orders of chivalry at the King and Queen's coronation. On the morning of the Coronation, as Andrew was driven down The Mall in a state car towards Westminster Abbey, of small group in the crowd in a grandstand in front of Buckingham Palace booed as he went past.",
        " Andrew took part in events surrounding Queen Elizabeth II's funeral but, beyond mourning his mother, Charles has shown no sign of allowing him a return to public life.Andrew stepped away from public life after a controversial Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein.Virginia Giuffre sued Andrew for allegedly sexually assaulting her when she was 17 after she was trafficked by Epstein.Andrew denied the claims but paid millions in an out-of-court settlement in the US civil case.In March it emerged that Prince Andrew does not want to move into Frogmore Cottage because he views it as a 'downgrade' from his 30-room Royal Lodge - even though is is thought King Charles evicted Harry and Meghan to hand him the keys.The Duke of York does not want to leave his mansion in the grounds of Windsor Castle despite telling friends he fears he will be unable to afford its upkeep if the King cuts his £250,000-a-year grant.Andrew currently pays a reported £250-a-week for a state-subsidised 30-room mansion complete with 98 acres of land and a swimming pool - and is not keen to leave it after 20 years.The Duke of York is set to lose £250,000-a-year in funding from the King as part of a shake-up of private royal finances and has had to sell off assets including a £19million ski chalet to cover the costs of settling the sex scandal case with Virginia Roberts Giuffre."
    ]
}