{
    "articleURL": "/wires/pa/article-12054295/The-Penny-mightier-sword-Twitter-reacts-coronation-ceremony.html",
    "content": [
        "A politician’s “Olympic” effort carrying a sword and a yawning Prince Louis were among the lighter highlights for social media users watching the King’s coronation across the world.",
        "The coronation at Westminster Abbey was the top trend worldwide on Twitter on Saturday, with more than half a million tweets posted with the hashtag #Coronation by 1pm.Among the more unorthodox highlights, many social media users commended Lord President of the Council Penny Mordaunt after she became the first woman to carry the Sword of State into the abbey.The honour required her to carry the large golden weapon as she walked through Westminster Abbey, before being presented with a second, smaller sword – the Jewelled Sword of Offering – which she presented to the King as part of the service, becoming the first woman to do so.“What a shift from Penny Mordaunt,” tweeted television presenter Dan Walker.“Finally she gets to put the sword down. Get her in the Olympics.”",
        "Fellow Twitter user @garius posted: “Penny Mordaunt has now been holding that sword longer than Liz Truss was Prime Minister.”Among many to make the same joke, Labour MP Chris Bryant tweeted: “The Penny is mightier than the sword.”Prince Louis, who captivated viewers with his behaviour at the Platinum Jubilee last year, was also closely watched by many.Images taken in Westminster Abbey showed the five-year-old yawning and staring at the ceiling, and later television footage showed he had disappeared from alongside his parents the Prince and Princess of Wales and sister Princess Charlotte.",
        "“Assume Prince Louis reached tipping point… He vanished a while ago,” tweeted Twitter user @Fyrishsunset.“Either that or he’s crawling around tying shoelaces together.”He reappeared alongside his family a short while later.“To be fair Prince Louis behaved a lot better than the last time a Prince Louis occupied London during the crowning of a king,” historian Dan Snow tweeted, referencing the actions of the future Louis VIII of France at the beginning of Henry III’s reign in the 13th century.“He didn’t fill the breach at Dover Castle with corpses for a start.”Celebrities were also a hot topic, with the appearance of Australian musician Nick Cave, of Nick Cave and the Bad Seeds, inspiring jokes after he took a seat at the back of Westminster Abbey.“Nick Cave and the Back Seats,” posted user @GoldenVision90.Other viewers felt the ceremony was longer than necessary, with columnist Ian Dunt tweeting: “They could’ve shaved 30 minutes off this bad boy.“Everything after the crown bit is a bit Hobbits-on-the-bed.”TV critic Scott Bryan went further, posting: “This could have been an email.”Many watching the ceremony were reminded of the finale of Rowan Atkinson’s 2003 spy comedy Johnny English, in which the protagonist snatches the crown during the coronation of antagonist Pascal Sauvage, played by John Malkovich.",
        "User @Ben_Hinch10 tweeted: “Anyone else watching the #Coronation to see if Johnny English pops up and accidentally becomes king?”While other broadcasters were showing the coronation ceremony, Channel 4 broadcast the 2018 comedy sequel Johnny English Strikes Again."
    ]
}