{
    "articleURL": "/wires/pa/article-12048345/George-Russell-says-moved-Max-Verstappen-spat.html",
    "content": [
        "George Russell has told Max Verstappen he is ready to draw a line under their X-rated row at the recent Azerbaijan Grand Prix.",
        "Verstappen called Russell a “d***head” following a heated confrontation after they collided on the opening lap of the sprint race.Verstappen also labelled Russell a “Princess” in a subsequent interview with Dutch media.But speaking ahead of this weekend’s race in Miami, Russell said: “I will continue racing the same way as I always would.“A lot has been said about that coming together, but from my side it was very straightforward.“I went for a move, I got the move done, and moved on. Obviously he was pretty upset about it, but that is racing and these things happen. We are all here to fight. That is what F1 is all about.”Russell revealed he has not spoken to Verstappen since they clashed in Baku.However, the British driver continued: “There is no air to be cleared. I will welcome, and say ‘hello’ to him if he passes by. I am sure we will shake hands when we bump into each other.",
        "“For me, it is history now and it is behind us. My views are still the same. I respect him and think he is a great driver. Things are said in the heat of the moment, but we move on.”Asked about his relationship with Russell, Verstappen sarcastically said: “It is terrible”, before adding: “No, it is absolutely fine.”",
        "F1 is back in the Sunshine State for the second time, and the first of three races to be staged in the United States this year.A debut event on the Las Vegas strip will take place in November, while Austin’s grand prix at the Circuit of the Americas has been a permanent fixture on the F1 schedule since 2012.“It is a dream for us to be in Miami and in the United States,” said Lewis Hamilton.“They have the Miami Heat and the Miami Dolphins, too.“They are massive sporting fans here so to be in such an important city like Miami where sport is huge – and now Formula One is part of that – it is great to see.“For such a huge country, it is amazing that we finally have three races here. The difficult thing with Formula One is that you usually visit a country once a year. But the growth has been huge and it is such a big market for the sport.”Hamilton finished sixth in Azerbaijan last weekend and he is already 45 points behind championship leader Verstappen.The 38-year-old’s contract with Mercedes expires at the end of the season but there are suggestions from both camps is that Hamilton will agree a new deal.",
        "Hamilton’s former McLaren team-mate and 2009 world champion Jenson Button said this week that he cannot envisage his compatriot walking away from the sport.“I just want to get back to the front,” continued seven-time world champion Hamilton.“That is what I am working on – trying to get this team back to the front.”"
    ]
}