{
    "articleURL": "/news/article-12049699/Port-Hedland-mum-stabbed-strangled-suffocated-three-kids.html",
    "content": [
        "Margaret Dale Hawke, 36, sentenced to life She killed her two sons and her daughter, 10A mother who stabbed, strangled and suffocated her three children before burning their bodies in a house fire will spend at least 25 years behind bars.",
        "Margaret Dale Hawke, 36, pleaded guilty to three counts of murder after killing her 10-year-old daughter and two sons, aged seven and four months, in the family's Port Hedland home on July 19, last year.Sentencing her on Friday, Justice Michael Lundberg said it was a sad and distressing case and Hawke had failed her fundamental duty as a parent to protect her children.'It is almost impossible to fathom how you reached a point where you knowingly ... killed your three only children in your own home at such young ages,' he told her at the Supreme Court in Perth.",
        "'It is impossible for any person to understand what you were thinking at the time and indeed, it appears you aren't entirely clear why you came to engage in such serious and brutal attacks.'The court heard Hawke strangled her daughter with an electrical cord and stabbed her eight times in her chest and heart.She also strangled and stabbed her seven-year-old son. He was found with three stab wounds to his chest and wounds on his neck.Hawke tried to drown her infant son but failed and instead smothered the child before walking to a beach where she disposed of the knife.After she returned to the family home where her dead children lay, she lit two fires and walked out into the street as it was engulfed by flames.",
        "A witness described her as 'really calm' as she watched it burn.Another heard her say: 'He's taken everything from me'.Hawke then screamed and cried, saying: 'My babies, my babies ... You don't have to suffer anymore'.Members of the public tried to enter the home and save the children but it was too dangerous.Hawke told police she didn't know of any other way to help her children before admitting to lighting the fire.'My three babies ... I hurt my babies. I did it to my babies,' she said.",
        "Firefighters put the blaze out. Hawke's elder son's body was found on a mattress in a room at the front of the property. Her daughter and other son were found in a room at the back.Hawke was taken to hospital and later admitted she had murdered her children.'I don't know why I did what I did. Maybe to stop the pain in all of us,' she told police in an interview after the incident, the court previously heard.An arson investigation found the fire was deliberately lit with two ignition points in the house.None of the children were found with soot in their respiratory systems indicating they died before the fire was lit.Hawke was sentenced to life in prison with a minimum non-parole period of 25 years for each of the three murders and two years and eight months' jail for the criminal damage by fire, to be served concurrently.",
        "1800 RESPECT (1800 737 732)Lifeline 13 11 14"
    ]
}