{
    "articleURL": "/sport/football/article-12045665/Trent-Alexander-Arnold-admits-mood-little-low-Liverpool-despite-five-straight-wins.html",
    "content": [
        "Liverpool continued their strong end to the season with a 1-0 win against Fulham The fifth consecutive victory strengthened their hold of a Europa League spot Alexander-Arnold admits Liverpool's form has not boosted the mood in the campTrent Alexander-Arnold has revealed the mood at Liverpool remains low despite their recent upturn in form boosting hopes of European football next season.",
        "Liverpool recorded their fifth consecutive Premier League win on Wednesday, as Mo Salah's penalty proved enough to beat Fulham 1-0 at Anfield.The result strengthened Liverpool's hold on fifth place in the Premier League, which would earn a Europa League spot.Alexander-Arnold admitted the late season form has not raised the mood after a difficult season, with Liverpool out of title contention and facing the prospect of missing out on Champions League.The 24-year-old admitted the victory over Fulham was typical of the season, after the Reds were unable to maintain a strong start to the match.",
        "'We won the game and that's all that matters,' Alexander-Arnold told the BBC. 'They are a good side and have performed well this season.'We dominated a lot of the first half and they had counter-attacks but then they grew into the second half.'It's becoming a bit of a pattern. We haven't been able to sustain our good starts. It's something we probably need to look at.'It reflects where we are in the league and what we have to play for left. 'It's not where we want to be and that's as a club as players, staff and fans. 'We want to be in title races at this stage of the season or in genuine top four races. We're not in that right now and that might be why the mood is a little low.'",
        "Liverpool have only a faint hope of qualifying for the Champions League after moving to within four points of fourth placed Manchester United.United still have two games in hand on their rivals, meaning Europa League qualification looks Liverpool’s likeliest prospect.",
        "Jurgen Klopp’s side are five points clear of sixth placed Tottenham in the race for a Europa League spot.Liverpool will host Brentford and Aston Villa at Anfield in their final four games.The Reds also have away trips to relegation threatened Leicester and Southampton."
    ]
}