{
    "articleURL": "/tvshowbiz/article-12052845/Noel-Gallagher-lingerie-model-Charlotte-Carter-Allen-enjoy-date.html",
    "content": [
        "Noel Gallagher reportedly enjoyed a 'double date' with a stunning lingerie model this week following the announcement of his divorce from his wife Sara MacDonald in January.",
        "The former Oasis rocker, 55, hit the town in London with his good pal James Cook on Thursday, stepping out to upmarket members' club Maison Estelle before heading to celebrity haunt Chiltern Firehouse.And musician Noel was joined on the night out by actress and lingerie model Charlotte Carter-Allen, who has appeared in music videos for Kanye West and a record with Eurythmics star Dave Stewart.The trio were joined by another female pal and it was claimed they all arrived in a Range Rover before heading off together later.A source told The Sun: 'Noel and James are close mates — and both recently single — and were with two very attractive women when they arrived at Chiltern Firehouse.",
        "'It looked very much like a double date and everyone was clearly having a great time.'There's no getting away from it, Charlotte is absolutely stunning, so if they are close, it's not hard to see the instant attraction.'MailOnline has contacted a representative for Noel for comment. It comes after it was reported Noel had split from his author lover Dorothea Gundtoft after a short-lived romance.It is claimed the pair drifted apart after struggling to find the time to go on dates.Musician Noel was said to have enjoyed a date with the Danish writer last month at London's Chiltern Firehouse.",
        "A source told The Sun: 'Noel and Dorothea enjoyed some dates but it never got off the ground.'His schedule promoting his new album is gruelling and it's been hard for them to see each other, let alone go on another date.'",
        "After Noel and Dorothea's date last month, an onlooker told The Sun the pair 'looked like a couple' and appeared 'affectionate' during their reported night out together.They told the publication: 'They looked like a couple, and there wasn't any effort to hide the fact they were there together.'Noel is a Firehouse regular and is always photographed coming and going, so for him to go there with a female companion suggests he's quite happy for them to be seen.'Dorothea has contributed to high-end magazines including Vogue Italia, Harper's Bazaar and Dazed, as well as design publication Icon.She speaks languages including Danish, Spanish and English while she also published books - Real Nordic Living, New Nordic Design and Fashion Scandinavia.It comes after it was revealed in January that Noel is set to divorce his wife Sara MacDonald after nearly 12 years of marriage.Noel is said to have moved out of their £8million South Downs mansion in Hampshire - and now fans are wondering if the Oasis brothers will heal their feud and reform, after Liam previously claimed Sara was the one stopping them reunite.",
        "Noel and Sara are parents to two sons, Donovan, 15, and Sonny, 12. The rocker is also father to his eldest daughter Anais, 22, from his previous relationship with ex-wife Meg Mathews.",
        "A spokesperson for Noel and Sara confirmed the split to MailOnline with a joint statement, sharing: 'Noel Gallagher and Sara Macdonald has confirmed that the couple are to divorce.'Noel and Sara will together continue to look after their children who remain their priority. Noel and Sara ask the media to respect their privacy and that of our family at this time.'While a source told The Sun: 'It is a great shame but they are trying to keep it civilised.''Noel has moved out, but in time Sara might want to move back to London. They're working everything out steadily to minimise the disruption.'Noel and Sara have been living in an £8M South Downs mansion near Hampshire's town of Petersfield since 2019, with their two young children.  But the Don't Look Back In Anger hitmaker is now said to be living apart from his wife in North London.Noel met Sara back in 2000 at an Ibiza club named Space - a year before his divorce from his first wife Meg.The rocker was married to Meg for four years.",
        "The former couple were notorious for a party-hard lifestyle as they lived it up during rowdy nights with Kate Moss and Sadie Frost.But following their split, it was reported the rocker had an affair with Sara during his relationship with Meg.Noel and Sara have strongly denied this claim, with the star releasing a statement in 2001 which shared that he didn't cheat and 'left Meg because I could no longer tolerate her behaviour'.Noel and Sara tied the knot in 2011 at the Lime Wood Hotel in the New Forest in a £60,000 ceremony, with guests including Russell Brand watching on - but Liam said he wasn't invited.'He goes on about how he wasn't invited to my wedding. No one was at my wedding but Nic's [wife Nicole Appleton] mum and my mum. Get over it, mate. I've not been invited to his wedding,' Liam told the Chicago Sun Times.Liam famously doesn't get along with Sara and has had a slew of public rows with the PR exec in the past.He even hinted that she was the reason that an Oasis reunion wouldn't be happening, with Noel furious over Liam's name-calling about Sara.",
        "Back in 2020, a fan tweeted him, asking: 'Hi Liam, do you know why Noel hates oasis reunion so much??????'",
        "While he responded suggesting that it was her fault, penning: 'I've told you before he's rite up for it but you know who won't let him as she doesn't like oasis music [sic].The brothers themselves have had little contact in the last ten years, after Noel publicly quit the band in 2009.But fans are now wondering if there may be hope in the future for the band to get back together again. "
    ]
}