{
    "articleURL": "/tvshowbiz/article-12049069/Laura-Byrne-shares-never-seen-photos-wedding-outrageous-4-400-outfit.html",
    "content": [
        "Laura Byrne shares never-before-seen pictures of a dazzling outfit she wore to her wedding with Matty 'J' Johnson in November last year.",
        "The former Bachelor star, 37, shared the throwback to Instagram on Friday as she gushed over the stunning gold KYHA Studios pants she wore to her reception. Paired with a strapless, white KYHA Studios corset, the shimmery ensemble came to a total of $4,395 with the palazzo-style slacks the most expensive at $3,100.Laura was all smiles in the sweet pictures of her big day, packing on the PDA with her new husband after they said 'I do' at the stunning Cupitt's Estate near Mollymook. 'I just came across these photos from our wedding and I realised I never shared any pics from our reception, and by reception I really mean - of these PANTS!' she captioned the reel.",
        "She continued: 'I put a poll up asking if I should wear pants to my wedding and the overwhelming response from y’all was no.'So I decided to do both. As much as I loved wearing my beautiful wedding dress, these pants were me to my core and the incredible KYHA Studios just makes the most insanely magnificent designs.'The mum-of-two went on to say she 'turned that dance floor into dust' as she took a few spins with her beloved at their reception, feeling 'like a disco ball all night'. ",
        "Laura and Matty, 35, who share daughters Marlie-Mae, three, and Lola, two, finally tied the knot five years after meeting on The Bachelor. ",
        "The happy couple wed at the stunning Cupitt's Estate near Mollymook on the NSW South Coast at 3:30pm on November 11 in front of friends and family.Proudly displaying their love to the world, the pair wrapped their arms around each other and enjoyed a passionate kiss after saying 'I do'.The blushing bride dared to bare in a custom gown from KYHA Studios, which had sheer material around the midriff to highlight her toned midsection. "
    ]
}