{
    "articleURL": "/sport/football/article-12045757/How-Englishmen-got-Real-Madrid-Jude-Bellingham-nears-move.html",
    "content": [
        "Real Madrid have housed a number of elite-level English players over the yearsMichael Owen was stuck on the bench but David Beckham was a Galatico buy READ MORE: Real Madrid are closing in on an agreement for Jude Bellingham Jude Bellingham - one of the most in-demand players in world football - is closing in on a move to Real Madrid.",
        "The Spanish giants have pursued the English star with interest for months and had numerous meetings with his father Mark and Borussia Dortmund officials to steal a march on the likes of Man City and Man United.Bellingham was the star of England's World Cup campaign last year and won't come for anything below £100million when the deal is finally sorted.But it raised questions as to how other Englishmen who have headed to Santiago Bernabeu have fared.Mail Sport takes a look at the trailblazer who was the first from England to make his mark, why it didn't work out for Michael Owen and Jonathan Woodgate's disastrous debut. ",
        "Laurie Cunningham, 1979-1984",
        "The trailblazer for Englishmen that would follow years later to the Spanish capital, Cunningham was electric in Madrid.Cunningham, described as an 'elegant, skilful and pacy' winger for the Spanish side, signed from West Bromwich for £950,000 in 1979 - a club record for both teams.He was known as 'The Black Pearl' in Spain and starred in his role as he went on to win the league and cup double in his first season. Much like Bellingham there was plenty of interest in Cunningham after he burst on the scene as a youngster with West Brom.Former Spain manager Vicente del Bosque, a one-time team-mate of Cunningham's, has since described him as 'the Cristiano Ronaldo of his era'. ",
        "He made the move to Spain and became a cultural icon; one of only a handful of Real Madrid stars to get a standing ovation at Barcelona's Nou Camp, as he did in a 2-0 win in February 1980.Cunningham lit up that Clasico and it remained one of his most iconic displays in the white of Real. He made 66 official appearances for the Spanish giants, scoring 20 goals, but sadly died years later in a car accident in July 1989.Steve McManaman, 1999-2003",
        "To the current generation of fans, McManaman may well be best known for his punditry and commentary work.But in his playing days he won the hearts of Madrid fans, a fanbase notoriously difficult to please, across four seasons.McManaman would go on to win two Champions Leagues, two LaLiga titles, one Super Cup, one Spanish Super Cup and one Intercontinental Cup, playing 158 games and scoring 14 goals.He had come through Liverpool's academy but was snapped up by Real in 1999 and took Spain by storm in a short stint. Despite conceding since that he felt 'a bit of a fraud' during celebrations of the first Champions League during his time there, fans really took to McManaman, not least after he scored the opening goal in that European Cup final to down Valencia. ",
        "It remains an iconic goal in Real Madrid history. His versatility across midfield made him a key part of the puzzle and while others on this list will be derided, not so McManaman. Following Cunningham's footsteps was no mean feat and he did just that.David Beckham, 2003-2007",
        "No sooner was one Englishman walking out the door was another walking through it to sign. McManaman departed but in came David Beckham, the Galactico that Real Madrid were itching to parade like a show pony after getting him from Manchester United. The England international was a superstar talent from the moment he arrived and has been viewed as one of the poster boys of Florentino Perez's Galactico approach to swoop up the best players in the world in the past two decades.Trophy-wise this wasn't to be, as he only won one LaLiga title and one Spanish Super Cup in his time there - with the league title arriving in his final season.Nonetheless fans were in awe of Beckham's passing and the skill he possessed and he remains fondly thought of in the Spanish capital.Michael Owen, 2004-2005",
        "Owen exploded onto the footballing scene at Liverpool - so much so a queue of teams were eager to prise him away from Anfield.In 2004 that was Real Madrid - a hard club to say no to - and he was joining a super team effectively.",
        "Zinedine Zidane was there, so was Beckham, Luis Figo and star striker Ronaldo.His £8m transfer fee wasn't headline-grabbing and with Ronaldo and Robinho as options up front he wasn't generating a whole lot of attention.The 2001 Ballon d'Or winner would be blighted by injury problems that would eventually lead to his exit in 2005 with Newcastle taking him on.He made his Real Madrid debut away to Mallorca and scored his first goal for Los Blancos in the Champions League at home to Dynamo Kiev.He made 45 appearances in his one season at the club but only 26 of those were starts.Owen finished the campaign with 16 goals. Jonathan Woodgate, 2004-2007 Draw up the worst possible debut and this is pretty much it. The £13m capture from Newcastle United arrived injured, then scored an own goal and was sent off on his debut. Signing then-England international Woodgate did raise some eyebrows but to those who believed in him he was viewed as one of the best centre back prospects of his generation after coming through at Leeds. At this point Madrid's eyes appeared locked on England: Beckham arrived a year prior and Owen pitched up in the same summer. For Woodgate the move was a no brainer.'I don't blame Jonathan in a way because he's going to arguably the biggest club in the world, I think, at this moment,' then-Newcastle manager Sir Bobby Robson once told the BBC. ",
        "'The power of Figo and Ronaldo, Zidane, then Beckham and now Owen. If you were in his shoes, what would you do? This is an extreme, exceptional offer which basically we had to take. 'No one is pleased that he's gone because we know what we've lost. At his best, he's the best in the country.'Woodgate would arrive injured and it took a long time for his debut - against Athletic Bilbao - to arrive.First he scored an own-goal past goalkeeper Iker Casillas, but worse would follow when he picked up a second yellow card for a block on Joseba Etxeberria.Fans in the Bernabeu that day heard some cheers when he trudged off. 'I just can't believe I got sent off. I didn't think the second yellow card was right, but it's the referee's decision,'' Woodgate said after the game. 'I want to thank the public, who were brilliant when I was walking off. They were all clapping and cheering.'Woodgate was later voted Madrid's worst signing of the 21st century by fans. Ouch."
    ]
}