{
    "articleURL": "/sport/football/article-12059713/New-York-Red-Bulls-Gerhard-Struber-mutually-agree-ways-seven-games-without-win.html",
    "content": [
        "New York Red Bulls currently languish in last place of the Eastern Conference Struber received criticism for his handling of the racism scandal involving NYRBDailyMail.com provides all the latest international sports news Gerhard Struber will no longer be in charge of New York Red Bulls after the two 'mutually agreed to part ways' Monday. ",
        "The MLS club released a statement announcing the departure of head coach Struber, and his assistant Bernd Eibler. Troy Lessene, an assistant coach under Struber, will take over for the remainder of the season.According to the statement put out, Struber intimated he was the initiatory party as it relates to his departure.'It was also clear for me that I wanted to return to Europe at the end of this season, at the latest It was extremely difficult for me to live here, completely without my family,' Struber said in the release. 'I informed the club early enough about my wishes and we came to the agreement to part ways. I wish the organization and the players the best of luck moving forward.'",
        "The Red Bulls have struggled to say the least under Struber this season. Through 11 games, the team has one just once - on March 18 - and are presently on a seven-game winless streak, punctuated by a 1-0 loss to Philadelphia Saturday night.  'We thank Gerhard and Bernd for their work and commitment to our club and wish them well in their next endeavors,' Head of Sport Jochen Schneider said.'I want to especially thank Gerhard for his dedication to this club and for the personal sacrifices that he made, especially being away from his family. He led our players through a difficult time, keeping everyone in good spirits while continuing our playoff streak,' he continued. ",
        "'After many discussions with Gerhard over the past few weeks, we mutually came to the agreement that a change now would be beneficial for both parties.' Last month, Struber received criticism from some quarters for his handling of an incident where star striker Daniel Vanzeir used racist language during a game vs. San Jose. Vanzeir was not taken off immediately following the 64th minute clash and instead stayed on until Struber subbed him in the 87th. A statement from the club directly apologized for the incident, calling the words and inaction on Struber's part 'inexcusable'.Struber said in a statement days following the controversy that he 'made a decision that I thought was best given the information I had at that moment' and admitted he should've 'immediately' subbed Vanzeir. ",
        "Three days thereafter Struber publicly apologized. NYRB front office called supporters groups to organize meeting this week, with Vanzeir and Struber also present.New York Red Bulls' three supporter groups staged a walkout moments before kickoff of the team's eventual 1-1 draw with the Houston Dynamo on April 15. The particular section of fans stayed for the national anthem before exiting, displeased with the length of suspension and coach Gerhard Struber's handling of the delicate situation. Before exiting, the South Ward fans repeatedly chanted 'Fire Struber' in unison.",
        "Struber led the Red Bulls franchise to the playoffs in 2021 and 2022, alongside a run to the semifinals of last season's US Open Cup tournament. "
    ]
}