{
    "articleURL": "/news/article-12057315/Labour-refuses-rule-coalition-Liberal-Democrats.html",
    "content": [
        "Senior Lib Dems yesterday opened the door to a post-election deal with LabourRead more: BBC backlash after presenter caught saying 'I like Wes Streeting'Labour refused to rule out a coalition with the Liberal Democrats yesterday after experts warned that Sir Keir Starmer has not convinced voters he is ready to govern.",
        "The party’s health spokesman Wes Streeting ducked questions over whether it would be prepared to cut a backroom deal with the Lib Dems and other minor parties in return for propping up Sir Keir.It comes after last week’s local election results where Labour overtook the Conservatives as the largest party in local government.Senior Lib Dems yesterday opened the door to a post-election deal with Labour – and indicated they would demand an end to Britain’s first-past-the-post electoral system in return.The SNP has already indicated it would be prepared to prop up Sir Keir’s party in return for another independence referendum.",
        "Westminster leader Stephen Flynn has said his party was in ‘prime position to pull the strings of a minority UK government’.Today he will urge Labour and Lib Dem voters in Scotland to vote SNP to block the Tories and ‘ensure Scotland holds the balance of power at Westminster’.Experts have argued that the local election results suggest Sir Keir’s party has not done enough to secure an overall majority.Elections experts Colin Rallings and Michael Thrasher said the results equated to a seven-point lead for Labour over the Conservatives – enough to make it the largest party in a hung Parliament but ‘still short of a majority’. Polling guru Peter Kellner said it was ‘by no means clear’ the party was heading for a majority, despite Sir Keir’s boast last week that he was ‘on course’ for No 10.",
        "Lib Dem leader Sir Ed Davey yesterday ruled out a coalition deal with the Conservatives as he cosied up to Labour.",
        "Sir Ed said his party’s priority was getting rid of Tory MPs – and even claimed he had ‘spent my life fighting the Conservatives’, despite serving with them for years in a coalition cabinet. But he left the door open to a deal with Labour and said changing the voting system to proportional representation would have to be ‘on the table’ in any talks.Former leader Sir Vince Cable said there could be a tacit understanding between the Lib Dems and Labour not to fight each other hard at the next election in order to maximise damage to the Tories. He told the BBC’s World This Weekend show that this could create a position where Labour would have to ‘depend on support from outside’ to form a government.Mr Streeting said a Lib Dem recovery was a ‘path to a Labour victory’ but his party was ‘not even entertaining’ the idea of a coalition at this stage.He added that Labour was ‘confident but not complacent’ about securing an overall majority at next year’s general election.The developments came as the Tory inquest continued over last week’s bombshell election results, which saw the party lose more than 1,000 council seats.",
        "Culture Secretary Lucy Frazer acknowledged voters were ‘frustrated and angry’ with the Conservatives after 13 years in power.During a round of interviews she said the fallout from the pandemic and soaring inflation following Russia’s invasion of Ukraine had dented the party’s popularity.She insisted that Rishi Sunak was focused on the public’s priorities and was ‘starting to deliver in a quiet way’.However, other senior Conservatives called for major changes in approach. Sir John Redwood said many Tory voters had ‘gone on strike’ last week in protest at high taxes and soaring immigration."
    ]
}