{
    "articleURL": "/wires/reuters/article-12038237/Man-City-mental-strength-home-stretch-says-Guardiola.html",
    "content": [
        "May 2 (Reuters) - Manchester City have the mental strength to endure their packed schedule in the final stretch of the season as they target a possible treble of trophies, manager Pep Guardiola said on Tuesday.",
        "The reigning Premier League champions are one point clear of Arsenal with a game in hand, they have booked a place in the FA Cup final on June 3, and they are gearing up for a Champions League semi-final first leg away at Real Madrid next week.In all, Guardiola's side have eight games over the next 25 days but the Spaniard said it was not the first time they have been battling on three fronts at this stage of the season.\"The players have one month and one week to fight... We have played the last six or seven years in this situation,\" Guardiola told reporters ahead of Wednesday's home game against West Ham United.\"We've done it a lot, this is not the first time. Everything is here, the mental strength, the best period we can live and we are not tired.\"We have positive thoughts, so we are not tired. Now, it's another opportunity. We have to recover and go for it.\"City went top of the league for the first time in two months with their 2-1 win at Fulham on Sunday as Erling Haaland scored his record-equalling 34th Premier League goal in a quite extraordinary debut season in England.When asked if Haaland could break Dixie Dean's long-standing record of 63 goals in a season in England, Guardiola suggested he would not put it past the 22-year-old Norwegian, who has so far scored 50 in all competitions.",
        "\"All (records) will be broken one day. I'm pretty sure he'll score more in the Premier League before the end of the season,\" Guardiola added.\"I don't know what is going to happen. It is a surprise for us, but maybe not for him to do what he's done in this difficult league. The way he behaves is for the success of the team.\"Guardiola said midfielder Kevin De Bruyne is a doubt for the game after he missed the weekend trip to Fulham but Dutch defender Nathan Ake has returned to training after recovering from a hamstring injury. (Reporting by Pearl Josephine Nazare in Bengaluru; Editing by Hugh Lawson)"
    ]
}