{
    "articleURL": "/debate/article-12044485/CRAIG-BROWN-hail-Master-Hobnobs-complete-guide-Coronation.html",
    "content": [
        "10.20am: Traditionally proclaimed by the Father of the Household, the cry will go up — ‘Quick! Quick!’ — that the Coronation is about to commence. This cry will be repeated three times, at increasing volume. Traditionally, it is met with silence.",
        "10.35am: The Father and the Mother of the Household ritually go round each bedroom door, proclaiming: ‘Come on! Come on! It’s about to start!’The correct response, proclaimed in quick succession by each Junior Member of the Household goes: ‘You watch it if you like but I have got better things to do.’Following this response, each Junior Member of the Household will turn up the volume on his or her iPad or headphones to the maximum ten.Any further admonition to celebrate will be met by the response: ‘I can’t hear you!’",
        "11am: Following their arrival into the living room, the Father and Mother of the Household process to their individual seats. In their hands, each will hold a cup of tea, signifying authority. They also bear a copy of the Radio Times, traditional symbol of continuity, knowledge and wisdom.Then, to the question: ‘Who has taken the wotsit?’The cry will go up: ‘Where did you see it last? It will be where you last saw it.’This heralds the age-old ritual of Searching for the Remote, in which all the assembled Members of the Household are expected to kneel down and look beneath chairs and sofas for the sacred TV remote control.11.05am: When the sacred handset is retrieved from beneath a cushion, the Father of the Household presses the red button ten times. At each pressing, he will be met with no response, and will issue a solemn curse. At this moment, Junior Members of the Household are expected to chant: ‘That is the wrong wotsit. It is for the DVD player that we got rid of five years ago.’",
        "11.55pm: As King Charles III announces on television: ‘I have come not to be served but to serve.’The Father of the Household should respond: ‘Which reminds me. When are you serving those Hobnobs?’To which the Mother of the Household will reply: ‘Get them yourself.’12 noon: The Recognition. As the Archbishop of Canterbury says: ‘I here present unto you King Charles, your undoubted King. Wherefore all you who are come this day to do your homage and service: are you willing to do the same?’",
        "The most Junior Member of the Household, the Master of the Slouch, will put his head around the door. Dressed in the age-old uniform of T-shirt, jeans and socks, all dating back to the month before last, he will say: ‘How long will this be going on for?’Before adding: ‘Some of us have better things to do. And, by the way, what’s for lunch?’This invocation will be answered with the cry: ‘Quiet! The King is about to take the Oath!!’12.10pm: The Anointing. For the anointing, the Daughter of the Household retires to her bedroom, ritually slamming the door, thus shielding her from view.She pours ancient oil — St Tropez Fake Tan Natural Glow by Kozmetix — on her face and shoulders. The origins of the Ancient Order of the Bronze can be traced back centuries, to the faraway days of Clodagh Rodgers, Tony Blair and Des O’Connor.",
        "12.20pm: The Orb. Symbolising the sovereign’s power, the Orb is divided into three sections, each band of jewels symbolising the continents known in the medieval period. The Orb is placed in the monarch’s right hand. At that same moment, the Junior Members of the Household make the Solemn Declaration of the Orb But. Thus:‘Orb But there must be something better on!’‘Orb But we’ve all had enough of this!’The Father of the Household then rises to his feet and instructs the juniors that the time has come to shut their traps: ‘So help me God.’1pm: The Departure. The ceremony concludes with a procession to the kitchen, for the ritual Rootle Around in the Frigidaire. Then the Father of the Household will take up his rightful seat and proclaim: ‘It’s what the British do best. That’s what I always say.’Meanwhile, the other Members of the Household will make their rapid departures, and once again, peace will return to the land."
    ]
}