{
    "articleURL": "/news/article-12055601/Australian-student-Alex-Shorey-ingested-rat-poison-Taiwan-speaks-Brisbane-hospital-bed.html",
    "content": [
        "Alex Shorey, 24, ingested rat poison in TaiwanStudent thanked people who helped bring him home 45-year-old woman being investigated over poisoningAn Australian exchange student who unknowingly ingested rat poison in Taiwan has thanked people who helped bring him home.",
        "Alex Shorey, 24, was flown to Brisbane on Wednesday, where doctors confirmed he had 'very high levels of toxins' in his body after ingesting superwarfarin - a highly toxic poison that stops blood from clotting - just before Easter.In a video shot by his family inside the Princess Alexandra Hospital in Queensland, the student thanked those who had donated over $200,000 on a GoFundMe to fly him back on a specialist medical evacuation plane. ",
        "'Thank you everyone who helped me get home,' Mr Shorey said in the video obtained by the ABC. The University of Queensland exchange student had been in Taiwan for a year and was weeks away from returning home to Australia when he started experiencing  black skin spots and unusual bleeding. He was admitted to Taipei Medical University Hospital's intensive care on April 18.After days of hemorrhaging Mr Shorey went into hypovolemic shock, meaning his organs were at risk of failing due to lack of blood. A severe allergic reaction to a vitamin K treatment in hospital saw him go into cardiorespiratory collapse six days later. His father, Stephen, said his son had suffered another anaphylactic reaction shortly before leaving Taiwan. 'I believe his medical repatriation actually saved his life,' Dr Shorey said.'While Alex still has a long road ahead, in terms of his recovery, his condition is improving.",
        "'He has a partially collapsed left lung, pericardial effusion, and adrenal insufficiency from the steroids he was getting to help manage his reactions to the injectable vitamin K1.'",
        "Dr Shorey said his son was looking forward to returning to the family home in Toowoomba, 130km west of Brisbane, to 'sit in the garden and pat his little puppy, Barney'.It comes as police in Taiwan are investigating a 45-year-old woman - reported in local media as Mr Shorey's girlfriend - over the suspected deliberate positioning. Local media are reporting that rat poison was found at the woman's house, similar to what was in Mr Shorey's system.The woman is now the sole suspect of a criminal investigation and is barred from leaving the country.Dr Shorey said the family were 'aware that the Taiwanese authorities are looking closely at the circumstances surrounding Alex's illness'.'We don't want to prejudice any police initiation by making any further comment in this matter, beyond saying that we are so grateful that our son is alive and we are eager to hear the outcome of the investigations,' he said."
    ]
}