{
    "articleURL": "/femail/article-12043531/Man-given-25-chance-survival-hit-van-marks-10-years-accident.html",
    "content": [
        " Harry Davies, 21,  was cycling home from school when he was hit by a vehicleRead More: I have two children with my half-brother - trolls say we should burn in hell but we're desperate to get marriedA man who was given a 25 per cent chance of survival after being hit by a van on the way home from school has celebrated 10 years since his life-changing accident.",
        "Harry Davies, 21, from Haddington, East Lothian, was in a coma for two weeks in 2013 when he was knocked off his bike at the age of 11. Paramedics - who had only recently undergone a head injury refresher course days before - found Harry unresponsive on the side of the road and rushed him to the Royal Hospital for Children and Young People in Edinburgh. In the days following the accident, Harry underwent emergency surgery to tackle a bleed on his brain and was then fitted with a bolt to relieve the pressure inside his skull. Doctors told Harry's father Nick that the helmet saved his son's life - but warned that there was only a 25 per cent chance of making a full recovery from this kind of head trauma. ",
        "Describing the moment he first saw his son in hospital, Nick said: 'It's only in the past couple of years I've been able to talk about this without crying. 'When I first saw Harry he was wired up to machines and monitors... it was just shocking.' Fortunately, Harry defied the odds - but says he couldn't process just how lucky he had been at first.He said: 'I didn't really understand the severity of everything until a few months after I woke from the coma when the specialists told me there was a real chance I could have died.",
        "'The odds were something like a 75% chance of dying - talking about that now feels weird when I think about how well my recovery has been.'What's more, the aspiring musician says the accident had a lasting impact on his teenage years too.When he returned to school, Harry was a given a minder to walk with him in the corridors and was also banned from participating in PE. He explained: 'My friends, school and people outside my family were very delicate with me for a long time during my teenage years.'",
        "'I had to tell them \"Look, I'm fine - you don't need to hover around me like I'm made of glass.\"'Some people thought I was more outgoing as a child before the accident and then after I was more withdrawn - but it's impossible to say if that was because of the crash or because it was normal teenage angst.'However, Harry took comfort in music during this difficult time and says playing guitar and the drums was 'therapeutic'. He said: 'I play guitar and drums and I've always loved that but it's in music production where I hope to progress and something I'd very much like to get serious about. ",
        "'It provides a great creative outlet for me, a bit therapeutic as well, but it's definitely more than a hobby and I'm already creating music and hope to build more projects there.'",
        "His father added: 'There were times we did wonder if the Harry we have now is the Harry he was always meant to be even without the crash?'The way Harry recovered has been incredible and we are under no illusion with the luck we have - he was wearing a helmet at the time of the crash so when we think about how much that helped as well it should offer an important reminder.'Even the crash - Harry was hit on a rural road yet received immediate help from an off-duty firefighter who happened to be passing and it turned out that firefighter just had head injury refresher training the week before.'"
    ]
}