{
    "articleURL": "/sport/afl/article-12045055/Geelong-Cats-skipper-Patrick-Dangerfield-radical-plan-new-Tasmanian-AFL-team.html",
    "content": [
        "Tasmania are joining the AFL in 2028 Dangerfield has radical proposal Would give access to all club rosters AFL Players Association (AFLPA) president Patrick Dangerfield believes the new Tasmanian side should have access to at least one player from each current club - even if they are contracted. ",
        "Yesterday a fairytale came true for Tasmania, when AFL boss Gillon McLachlan announced the state, where footy is like a religion, would finally be getting their own team from 2028. There are still plenty of unanswered questions in regards to the league's 19th franchise - such as what the team will be called - and one of those is what recruitment and drafting concession Tasmania will receive. The Geelong skipper, who heads up the powerful AFLPA union, has a radical suggestion for how it could potentially work when the first team since GWS in 2012 joins the league.Conscious of ensuring the team won't be flogged by 100 points every week like the Giants were when they joined, Dangerfield proposed that even contracted players at other clubs should be fair game. ",
        "'My view is that the Tasmanian team should have access to contracted players,' the Cats captain told SEN Radio on Thursday morning. 'One from every club, regardless of contract, if they choose to join Tasmania, then they should be able to do that. 'I think if we're going to do this and do this properly, then Tasmania should have access to not only the best talent, but the best possible people in order to create something that's truly unique and truly special.",
        "'Quite clearly generating a really strong culture is part of that.'So I think having the ability to choose whoever you like, regardless of contract status would be a really important part of that.'",
        "The outspoken Dangerfield will no doubt have ruffled the feathers of some of the club's bosses around the league - though it does highlight the point that there is still much to figure out ahead of their historic first season in five years time.Some insist there is not enough of a talent pool to accommodate 19 teams, while others say it will allow the sport to grow far better talent across the Tasman, because after all, you cannot be what you cannot see.Dangerfield, who will almost certainly be retired by the time the Tasmanian team joins in 2028, has a different take entirely. 'I think you probably keep it the same (the overall number of AFL players),' he said.'What you might do is reduce (list sizes) from every club in order to try and maintain that talent pool … it can get shallow towards the end.He surmised that then clubs would also have access to reserves players from leagues like the SANFL and WAFL, who would be aligned with a national second-tier competition.   ",
        "For those club bosses and coaches who are concerned about the amount of talent they will lose to the new club, Dangerfield, who left Adelaide to move home to the Geelong region in 2015, says it will be partially their fault for not fostering a culture players want to stay at.'Your level of protection is providing an environment for your players that they don't want to leave,' he said.'So I think what it does is promote clubs to provide the best possible environment, so they don't want to leave because the environment they're in is successful.'I think it generates competition with the existing clubs to provide a great framework for their players to enjoy and not want to leave.'That is what I would say would make sense.'"
    ]
}