{
    "articleURL": "/wires/ap/article-12044721/McClanahan-improves-6-0-Rays-beat-Pirates-8-1.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Shane McClanahan became baseball's first six-game winner and the Tampa Bay Rays routed the Pittsburgh Pirates 8-1 on Wednesday night.",
        "In a matchup of small-budget teams off to big starts, the major league-best Rays topped the NL Central-leading Pirates for the second consecutive day.McClanahan (6-0) gave up one run on five hits over six innings, striking out nine and lowering his ERA to 2.03.\"Throwing strikes, kind of mixing everything, being a little unpredictable, and trusting my defense behind me,\" McClanahan said.Josh Lowe and Wander Franco homered off Pittsburgh relievers as the Rays improved to 25-6. Since 1961, only the World Series-winning 1984 Detroit Tigers (26-5) had more wins through 31 games.Tampa Bay has outscored its opponents 207-94. The Rays lead the majors with 64 home runs.",
        "Pittsburgh manager Derek Shelton was ejected in the fourth. He was yelling from the dugout at plate umpire Quinn Wolcott before coming out to talk with crew chief and third base umpire Adrian Johnson. First base umpire Manny Gonzalez joined the discussion and followed Shelton down the foul line toward the plate before it appeared he redirected the manager back toward the bench.\"I had a disagreement with how the clock was being run,\" Shelton said. \"I had a disagreement with how the clock was being run yesterday. This is an issue I discussed with MLB this morning, and I´m sure we´ll probably discuss it tomorrow. In that situation, the 30-second clock runs, it stopped. I asked why it was stopped, and the umpire disagreed with my assessment of it, and then we had a conversation about it.\"",
        "The Pirates felt the umpires missed a number of calls in Tuesday night's 4-1 loss to the Rays, including a pitch-clock violation and a balk.Overall, Shelton thinks the new pitch clock has worked well.\"I thought they´ve done a really good job of it this year,\" Shelton said. \"It´s been paid attention to, it´s been extremely consistent. And that´s what I told MLB this morning. I thought it´s been consistent. I did not think it was consistent the past two days.\"Andrew McCutchen homered for the Pirates (20-11), who have their first three-game losing streak of the season.Despite the skid, the Pirates are still off to their best start since opening 20-11 in 1992 - the last time they won a division title.Pittsburgh went 0 for 7 with runners in scoring position and is hitless in 17 at-bats in those situations during the series.Yandy Díaz got the first Rays hit off Mitch Keller (3-1) with a two-out single in a three-run third. Díaz scored when shortstop Rodolfo Castro was charged with an error after misplaying Harold Ramírez's grounder.Brandon Lowe made it 3-1 with a two-run double.McCutchen hit a solo homer in the top of the third. He is from Fort Meade, about 75 miles away, and has five homers in 15 games at Tropicana Field.",
        "Tampa Bay went ahead 5-1 in the fifth when Franco was credited with an RBI when second baseman Ji Hwan Bae was given an error for booting a grounder and Ramírez had a run-scoring single.Bae had two hits and a walk, and also stole his 12th and 13th bases.Keller allowed five runs - one earned - and five hits in five innings.Josh Lowe had a sixth-inning solo homer, and Franco went deep in the seventh.LONG AND SUCCESSFUL DAYNew Rays right-hander Chase Anderson was acquired from Cincinnati on Wednesday and allowed two hits over three innings to get his first major league save.The 35-year-old Anderson had been scheduled to start a morning game for Triple-A Louisville at Omaha but instead got up around 4:30 a.m. to fly to Florida, and arrived at the ballpark at 2 p.m. He made his 200th big league appearance, and 17th in relief.Anderson spent time with his family afterward - with game ball in hand.\"It was awesome,\" McClanahan said. \"The guy didn´t miss a beat. Good stuff.\"TRAINER'S ROOMRays closer Pete Fairbanks went on the 15-day injured list with forearm inflammation near his right wrist.UP NEXTPirates RHP Vince Velasquez (4-2) and Tampa Bay RHP Zach Eflin (3-0) are Thursday's starters.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}