{
    "articleURL": "/wires/ap/article-12050719/Pope-seeks-encourage-abuse-prevention-board-amid-turmoil.html",
    "content": [
        "ROME (AP) - Pope Francis sought to encourage his embattled child protection advisory board Friday, following weeks of turmoil sparked by the latest resignation of a founding member and fresh questions about its direction.",
        "Francis urged his Pontifical Commission for the Protection of Minors to pursue a \"spirituality of reparation\" with abuse survivors and build a culture of safeguarding to prevent priests from raping and molesting children.In particular, he praised the commission's efforts to establish church child protection programs in Asia, Africa and Latin America, where there is less funding than in the U.S. and Europe.\"It is not right that the most prosperous areas of the world should have well-trained and well-funded safeguarding programs, where victims and their families are respected, while in other parts of the world they suffer in silence, perhaps rejected or stigmatized when they try to come forward to tell of the abuse they have suffered,\" Francis said.Francis announced the creation of the commission in 2013 to provide best-practices advice on combatting abuse in the church. The commission has gone through several iterations in the decade since, most significantly with resignations of members frustrated by the resistance of the Vatican bureaucracy to its recommendations and exasperated about the commission's unclear mandate and model.The latest departure was the Rev. Hans Zollner, a German Jesuit who runs a child protection institute at the Pontifical Gregorian University in Rome. In a blistering statement March 29 announcing his resignation, Zollner identified a series of internal problems in the commission that he said made it impossible for him to remain.",
        "He cited a lack of financial accountability, lack of transparency about decision-making and lack of clarity about what members are supposed to do and how they're appointed. Zollner´s criticisms underscored broader questions about the purpose and direction of the commission, which has never found its place in a Vatican bureaucracy inherently resistant to change and defensive in particular about the abuse dossier.Francis recently moved the commission under the auspices of the Vatican´s Dicastery (department) for the Doctrine of the Faith in a bid to give it institutional legitimacy. But even that has created problems. Critics note that placing the commission under the Dicastery, where all abuse cases are processed, was akin to putting a victim´s advocacy group inside a federal court.The commission, headed by Boston Cardinal Sean O´Malley, has recently moved into new, fancy quarters in a downtown Rome palazzo which it hopes will be used as a place for victims to be heard and welcomed.In addition, O´Malley told Francis on Friday that the commission had created a fund of 3 million euros to provide safeguarding resources to poorer churches in the developing world.The bulk of that funding, some 2.5 million euros, has come from the Italian Bishops´ Conference, which has been criticized repeatedly for its own failures to punish predator priests in Italy and the bishops who shield them.",
        "Francis acknowledged the sex abuse scandal had undermined the church´s ability to do its core job of spreading the Gospel.\"A culture of safeguarding will only take root if there is a pastoral conversion in this regard among the church´s leaders,\" he said."
    ]
}