{
    "articleURL": "/sport/football/article-12038581/Real-Sociedad-2-0-Real-Madrid-Kubo-Barrenetxea-goals-prove-decisive.html",
    "content": [
        "Real Sociedad secured a 2-0 victory against Real Madrid on Tuesday evening Takefusa Kubo scored against his former club before Ander Barrenetxea nettedThe result sees Los Blancos fall 14 points behind league leaders, rivals Barcelona Real Madrid go stumbling into their biggest two games of the season after losing away at Real Sociedad and probably surrendering second place in LaLiga to Atletico Madrid.",
        "They had Dani Carvajal sent off in the second half but, red card aside, they were second best to the Basque side who look set to finish fourth in LaLiga and go into next season's Champions League.Madrid play the Spanish Cup final on Saturday night against Osasuna. And three days later they host Manchester City in the first leg of the Champions League semi-final at the Santiago Bernabeu. This was not the best way to prepare.They were knocked out of their stride by their aggressive rivals who had David Silva starring in midfield and Norwegian striker Alexander Sorloth causing them problems in attack.",
        "If Sorloth unsettled them then it bodes well for his compatriot Erling Haaland. Madrid fans will take refuge in the fact that the team will have its big-game head on by then. This was certainly a big game for Real Sociedad and they rose to the occasion. ",
        "Real Sociedad (4-3-3): Remiro; Gorosabel (Elustondo 63), Zubeldia (Pacheco 64), Le Normand, Munoz; Merino, Zubimendi, Silva (Illarramendi 89); Kubo (Barrenetxea 74), Sorloth (Fernandez 74), Oyarzabal.Subs not used: Zubiaurre; Sola, Cho, Rico, Guevara, Navarro, Mendez.Goals: Kubo 47, Barrenetxea 85.Yellow cards: Gorosabel 22.Manager: Imanol Alguacil.Real Madrid (4-3-3): Courtois; Carvajal, Militao, Rudiger, Nacho; Ceballos, Tchouameni, Kroos (Vazquez 63); Asensio (Arribas 82), Diaz (Alvaro 59), Rodrygo.Subs not used: Lunin, Lopez; Vallejo, Hazard, Valverde, Odriozola, Dotor, Paz.Red cards: Carvajal 61. Yellow cards: Carvajal 53, 61, Ceballos 75, Nacho 87, Rodrygo 90+2.Manager: Carlo Ancelotti. ",
        "They had the chances to take the lead in the first half but Silva was somehow denied by Thibaut Courtois.The Belgian stood tall to block the former Manchester City midfielder when he shot from close range after connecting with Sorloth's cross.From even closer in, Martin Zubimendi had sent one effort on to the bar. Real Sociedad also felt they should have had a penalty for Eder Militao's challenge on Mikel Oyarzabal.Madrid also had their chances with Alejandro Remiro saving well from Rodrygo. In the second half it was the home side who finally broke the deadlock.Militao had endured a rough first half with a late tackle from Mikel Merino slowing him down. It was Courtois' pass out to him that put him under pressure and with Sorloth looming he tried to play the ball back to his goalkeeper and allowed Take Kubo to ghost in and send the ball over the line. The Japan international tried not to celebrate as a former Real Madrid player.But in the end the emotion took over and sent him running towards jubilant fans.Carlo Ancelotti had left Karim Benzema resting in Madrid and was also without Eduardo Camavinga and Luka Modric.Both are expected to be fit by the weekend.",
        "It was Mariano Diaz' first start for a year and he had not taken his chance.So he was replaced on the hour by the 18-year-old Uruguayan forward Alvaro Rodgriguez.No sooner had he come on and Madrid's task was made even more difficult when Carvajal saw his second yellow card. He had been booked for asking for a yellow for Oyarzabal. And he then got his marching orders for a challenge on Aihen Muñoz. It was harsh. ",
        "He got the ball, only making contact with Muñoz on his follow through.Against 10 men a second goal from Real Sociedad always looked more likely than an equalizer and it took a brilliant save from Courtois to keep out a deflected free-kick from Ander Barrenetxea.It was the Real Sociedad winger who eventually doubled the advantage. He cut in from the left and sent a fierce right footed shot past Courtois to send the Reale Arena into raptures. For them the Champions League beckons – for Madrid there will be a battle to finish second this season. Atletico can overtake them tomorrow by beating Cadiz. "
    ]
}