{
    "articleURL": "/femail/article-12048407/JAN-MOIR-King-Charles-wants-right-historical-wrongs-look-closer-home.html",
    "content": [
        "For all the latest Royal news, pictures and video click here On the night before his Coronation, what must King Charles be thinking? What will be running through his mind as he falls asleep hours before stepping up to embrace his destiny in front of the world?Will he be like a child before Christmas, full of excitement and optimism? One sleep till crown time! Or will his thoughts be darker, filled with trepidation for the future and regret for the past? For the road less travelled, the unlived life, the discarded wife?Charles waited nearly 74 years to become King, so he’s had enough time to think about it all. And it is noticeable that he spent his first six months on the throne being a busy, caring-sharing royal bee.He rubbed noses with Maori leaders; he sat cross-legged on the floor of a Sikh prayer hall in Luton; he opened the royal archives to researchers investigating the crown’s links to slavery.When he addressed the nation for the very first time as King, he said he was proud to head a nation where values ‘have remained and must remain constant’, and promised to ‘uphold its constitutional principles’.",
        "No one can say King Charles is slacking in his attempts to make the monarchy relevant in a modern, multi-cultural nation. He wants to be a unifying force, connecting with ethnic minorities and disadvantaged groups.He wants to right historical wrongs — jolly good for him. But can I suggest that if he is sincere about rectifying past injustices, he is looking in the wrong place?For there are some long-suffering people much closer to home who could use his help; two groups whose treatment shames us all, not just the King. People whose mistreatment is historical but also ongoing, whose misery has been compounded by official obstruction, government barriers, wanton disregard and utter callousness. I’m talking about the two great outrages of our time: The Post Office Scandal and The Blood Contamination Scandal.Victims of both these travesties are still seeking justice and compensation, years after the event, and that is a national disgrace.The Post Office Scandal involves the wrongful civil and criminal prosecutions of British sub-postmasters for theft, fraud and false accounting — but it was a faulty software system that was the culprit, not them.These honest, decent people were financially and emotionally devastated, stripped of their jobs, shamed in their neighbourhoods.Some were sent to jail, some committed suicide because of the disgrace, many had their lives and those of their families ruined.As an independent inquiry rumbles on this week, it remains the biggest miscarriage of justice in British history — shouldn’t a king worth his crown have something to say about that?Meanwhile, The Blood Contamination Scandal has had a belated public inquiry, but results will not be made available until the end of this year — well over four decades after the worst NHS treatment disaster in history began.Back in the 1970s and 80s, men, women and children were treated with blood and blood products infected with hepatitis and HIV. Until last year, only scant compensation but no apology had been paid to the thousands of victims.Even when interim compensation payments of £100,000 were handed out in October — begrudgingly is the word — many were excluded, including bereaved parents, siblings and the children of victims. And, of course, those who had already conveniently died.The judge in the inquiry has suggested there could be more than 2,500 attributable deaths.What is so terrible about both these scandals is not just that innocent people were wronged, but that this injustice was further compounded by the way they were treated in the aftermath.",
        "It is hard to escape the conclusion that if the Post Office and the NHS — both accountable to Parliament — could have swept everything under the carpet, that is just what they would have done.The King talks a big game about British values and principles, but where are they in this bubbling bog of immorality and shirked responsibility?Of course, none of this is his fault, but like many people in public life, King Charles is in such a rush to embrace woke international causes that he overlooks something rotten right under his nose.It is hard to think of two more worthwhile causes for a monarch to embrace — or at least dignify with a keen interest — than these twin scandals. They are not chic or in vogue, but they matter.I don’t want to be part of a country or a culture where victims who, through no fault of their own, have been wronged so badly, overlooked so terribly, let down so comprehensively — and find themselves still fighting and begging for the justice they deserve years later.And King Charles, if he means what he says, should not want to be king of such a country, either.Is Kev’s wife mad not to want what he’s still got?Pop the prosecco, ladies, let’s open the potato-based snacks. News reaches my gossip gal-pal group that Kevin Costner’s wife is divorcing him because he ‘works too hard’.",
        "My friend Susie ventures that he could ‘work too hard’ around her place any time, which most of us thought was rather forward of her.All agreed we could put up with Kevin staying late on set if he came home in his Navy Seal uniform (No Way Out, peak Kev 1987) or pushed the breakfast dishes off the kitchen table because he had loving on his mind (Bull Durham, 1988). ‘I’ve never felt quite the same about cornflakes and milk,’ whimpered Bea. And let’s not get started on The Bodyguard (1992), except to say this ideal of the close personal protection officer has yet to be surpassed. ‘I’m here to save your life, not to help you shop,’ Kevin tells Whitney Houston in one emotionally charged changing-room scene.Even today, at the age of 68, striding across his Montana ranch in the TV series Yellowstone, playing patriarch John Dutton in a cowboy hat and tight jeans, the collective agreed that: ‘Kev has still got it.’ But is his wife mad not to want it?Tennis star Emma Raducanu has been photographed in her hospital bed with her arm in a cast following an operation on her wrist.",
        "This means that the 20-year-old is out of Wimbledon, out of the French Open and will miss the whole grass-court season. And have you ever seen her look happier? Get well soon, Emma, in every way you can. Nighy time this pair fell in loveNever have two people seemed more right together than Anna Wintour and Bill Nighy. Incorrigible romantics were thrilled when they appeared arm-in-arm at the Met Ball earlier this week, looking utterly perfect together.",
        "At the mutual age of 73, had Cupid struck in the right place at last?It seemed so deliciously romantic to live a life and finally to end up with the person you were meant to be with all along, just before the final curtain. After a long, cold, lonely Wintour, the time was Nighy for them to . . . but wait! Official sources are now claiming the couple aren’t an item after all. What? Stop wasting our time, Anna and Bill! Fall in love, before it’s too late. Or else.If your past speaks louder than your future, if where you have been matters just as much as where you are going, what does the affection of his exes say about Brad Pitt? It is no secret Brad remains on good terms with his ex-wife Jennifer Aniston, despite leaving her for Angelina Jolie. Now ex-fiancee Gwyneth Paltrow reveals that she still thinks of him fondly, too. ‘He’s a great guy. He’s wonderful,’ she said on a podcast this week. No, ahem, you are correct. Angelina does not speak of him quite so kindly. But two out of three suggests some heroic qualities, don’t you think? My thoughts are with the McCannsCan it really be 16 years since Madeleine McCann disappeared from a family holiday in Portugal? It seems like 100 years ago, yet it also seems like yesterday.Time bends for most of us, but for Madeleine’s parents, Kate and Gerry, it must be a torture. At a ceremony to mark the anniversary this week, every single day of each of those years was etched on the tormented face of Kate McCann, while at her side husband Gerry still practically oscillated with tension.The one positive outcome is that their marriage has survived — because few do, under the pressure of such tragedy.Yet both of them still look utterly haunted. This poor family, battling on with their lives in the shadow of the dreadful unknown. My thoughts are with them. If your past speaks louder than your future, if where you have been matters just as much as where you are going, what does the affection of his exes say about Brad Pitt?It is no secret that Brad remains on good terms with his ex-wife Jennifer Aniston, despite leaving her for Angelina Jolie. Now his ex-girlfriend Gwyneth Paltrow reveals that she still thinks of him fondly, too. ‘He’s a great guy. He’s wonderful, I really like him a lot,’ she said on a podcast this week. No, ahem, you are correct. Angelina does not speak of him quite so kindly. But two out of three suggests some heroic qualities, don’t you think?Now Richie’s dancing on the ceilingHow cheering to see Lionel Richie in top hat and tails at the Buckingham Palace Garden Party this week. He’s clearly thrilled to be here, particularly as he also has a ticket to the actual Coronation ceremony.Meanwhile, lots of glum aristos are wondering why, after a devotion to the Crown stretching back centuries, they didn’t make the cut.Lord and Lady Carnarvon, for example, were part of the select group at the Queen’s committal service just seven months ago, but even they failed to secure an invitation. ‘We just haven’t received anything,’ said George Herbert, the 8th Earl. Lionel sings that it’s time to let the music play on. That may be so, but will King Charles come to regret freezing out the long-standing allies and friends of the Royal Family? The ones who are not going to party, karamu, fiesta, for ever any time soon."
    ]
}