{
    "articleURL": "/wires/afp/article-12046785/Pakistan-foreign-minister-says-happy-rare-visit-India.html",
    "content": [
        "Pakistan's foreign minister arrived in India Thursday to take part in an international conference, the first official visit by a senior Pakistani official to the country's eastern neighbour since 2016.",
        "The South Asian neighbours have fought three full-fledged wars since they were created at the partition of the Indian subcontinent in 1947, and relations between the nuclear-armed countries have remained tense in recent years, mainly over the disputed territory of Kashmir.Pakistani Foreign Minister Bilawal Bhutto Zardari is in the Indian coastal resort state of Goa for a Shanghai Cooperation Organisation (SCO) meeting of foreign ministers, along with counterparts from China and Russia.\"I am very happy that today I have arrived here leading the delegation of Pakistan,\" he told reporters.Bhutto gave no indication whether he would hold one-on-one talks with his opposite number in India, but said he hoped the SCO meeting would be \"very successful\".Pakistan suspended trade and diplomatic ties with India in 2019, when New Delhi imposed direct rule on the part of Muslim-majority Kashmir it controls and enforced a heavy security lockdown.Both countries withdrew their top diplomats and several consular staff were expelled or withdrawn in tit-for-tat measures.That development came after a military standoff earlier in the year -- also centred over Kashmir -- that saw both countries launch air strikes and an Indian fighter jet shot down.The most recent visit to India by a high-ranking Pakistan diplomat was in 2016, when Sartaj Aziz -- then the senior foreign affairs adviser to the prime minister -- travelled there.",
        "India currently holds the rotating presidency of the SCO, a forum established in 2001 that also includes several Central Asian states, rivalling Western institutions.S. Jaishankar, India's foreign minister, met with his Russian counterpart Sergey Lavrov ahead of Friday's meeting to discuss ties and \"current global and regional agenda topics\", a statement from Moscow said.India's security ties with Russia have put it in an awkward diplomatic position following Moscow's invasion of Ukraine.Prime Minister Narendra Modi's government has walked a tightrope between India's increased security cooperation with Western countries and its reliance on Russia for defence and oil imports.Jaishankar also sat down with Chinese Foreign Minister Qin Gang on Thursday, a week after the defence ministers of both nations met in New Delhi to discuss military deployments on their disputed Himalayan frontier.\"Focus remains on resolving outstanding issues and ensuring peace and tranquillity in the border areas,\" Jaishankar tweeted after the meeting."
    ]
}