{
    "articleURL": "/femail/article-12054161/Royal-fans-speculate-Prince-Harry-STOPPED-singing-God-Save-King-father-walked-past-him.html",
    "content": [
        "Prince Harry appeared to bow his head and stop singing the national anthem as King Charles walked byHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Read more: King Charles Coronation LIVE - follow the latest updates from Westminster AbbeyEagle-eyed royal fans have speculated that Prince Harry may have stopped singing the National Anthem as his father passed him following his Coronation.",
        "Television footage of the Duke of Sussex, whose face was partially obscured by the Princess Royal's military hat, appeared to show him break off from the National Anthem as his father's Coronation procession exited Westminster Abbey.Prince Harry's return to the Royal Family, following a series of blockbuster interviews and his tell-all memoir, Spare, saw him appear awkward and uncomfortable, according to a body language expert watching today's ceremony, and a professional lip reader suggested the day was all about polite conversation for the royal. Body language expert Carole Railton said the Prince, 38, was 'out of step with the others around him' as he twisted and bent his body while entering Westminster Abbey for his father's Coronation. Royal fans watching the service from home took to social media this afternoon to speculate whether the Prince appeared to pause when singing God Save the King as his father passed him. ",
        "One Twitter user said: 'Harry not singing National Anthem as King processes out.'Another wrote: 'As the King left the cathedral I noticed that Harry was not singing the National Anthem.' A third wrote: 'Harry neither pledged allegiance to the King nor sang the national anthem - so what was his point of being there?' It was clearly a difficult day for the Prince, returning to the capital without the Duchess of Sussex and with continued strained relationships with his father and brother. Prince Harry sat two rows behind his brother and was spotted looking across to where the Prince of Wales was sat. ",
        "Body language expert Ms Railton said the Duke's body language suggested that the day was proving difficult for him. ",
        "She said his nervous walk into King Charles III's ceremony was a 'sure sign he was on his own', and was 'with his own thinking'.However, he then stepped in line and started smiling broadly which showed him being more comfortable and warming to the day ahead. The pro added that his hand holding the edge of his jacket may signal the need for a 'small hug' to make himself feel better in what is bound to be a tense reunion with his family.Carole also remarked that the twisting and turning of Harry’s body would indicate discomfort, which is an 'unusual pose' which we 'do not normally see this with the royals'.Prince Harry shared a joke with Jack Brooksbank in Westminster Abbey today, as the Duke of Sussex took his seat at his father's Coronation.  Lip reader Jacqui Press revealed what she thought the Prince, who arrived in the UK on Friday morning from California, said to Princess Eugenie's husband during the exchange.",
        "Press said the conversation appeared light-hearted as they waited for the historic occasion to begin, with Harry possibly discussing an event happening on Sunday. She claimed the Prince, who is alone at the service without the Duchess of Sussex or their two children Archie and Lilibet, smiled at Mr Brooksbank and said: 'That's funny, mmm interesting'.",
        "To an unknown question from Mr Brooksbank, Prince Harry said: 'About quarter to 4?'Mr Brooksbank then replied: 'Oh really, when?' to which the Duke responded: 'I think tomorrow...'Earlier, Prince Harry, who chatted with both Prince Edward and Edoardo Mapelli Mozzi on his way in, addressed the well-wishers and congregation, saying: 'Morning, morning, how are you doing?'One person in the crowd told him, 'You look smart', says Press - referring to the moment the suited and booted prince walked into the Abbey for his father's Coronation. The Duke of Sussex was seated between Princess Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for ten years. They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edoardo Mapelli Mozzi."
    ]
}