{
    "articleURL": "/wires/reuters/article-12060705/Texas-gunman-embraced-white-supremacy-media-reports-say.html",
    "content": [
        "May 8 (Reuters) - The man accused of shooting and killing eight people at a Texas mall appeared to have embraced white supremacist and neo-Nazi ideologies, multiple media outlets reported on Monday.",
        "In social media profiles thought to be linked to the suspect, 33-year-old Mauricio Garcia, investigators found posts targeting racial or ethnic minorities, NBC News reported, citing two law enforcement officials. Police killed Garcia, who was wearing tactical gear and carrying an AR-15 style rifle, during the attack.On a Russian social media platform, a user believed to have been Garcia praised the dictator Adolf Hitler and sympathized with neo-Nazi beliefs, according to the New York Times, citing law enforcement sources. The profile also made hateful comments against women. During the shooting, Garcia wore a patch with the letters \"RWDS,\" an abbreviation for \"Right Wing Death Squad\" advocating violence to achieve political means, the Times reported, citing an official whose identity it did not disclose.Reuters could not independently confirm the reports.Police identified Garcia, a Dallas resident, as the suspect accused of opening fire on Saturday at Allen Premium Outlets mall in Allen, a suburb of Dallas. Officials have not released any further information about him or his motives or the identities of the victims, who ranged in age from 5 to 61.The Allen Police Department, Collin County Sheriff's Office and the Texas Department of Public Safety did not immediately respond to requests for comment on the reports.The massacre is among the latest in at least 202 mass shootings recorded in the United States this year, according to the nonprofit group Gun Violence Archive. The group defines a mass shooting as any in which four or more people are wounded or killed, not including the shooter.",
        "In a statement on Sunday, Biden renewed calls for the U.S. Congress to ban assault weapons and high-capacity magazines, as well as to enact universal background checks and end immunity for gun manufacturers. (Reporting by Tyler Clifford in New York; Editing by Lisa Shumaker)"
    ]
}