{
    "articleURL": "/wires/ap/article-12048025/California-police-detain-person-connection-stabbings.html",
    "content": [
        "DAVIS, Calif. (AP) - A 21-year-old who was a student at the University of California, Davis, until last week was arrested on accusations of fatally stabbing two people and wounding another in attacks that terrified the quiet college community, police said Thursday.",
        "Carlos Dominguez was taken into custody Wednesday after 15 people called in reports of a person who matched the description of the suspect near a city park where he is accused of stabbing the second victim to death, said Davis Police Chief Darren Pytel.Pytel did not disclose a motive for the stabbings, which took place over a span of days starting with the discovery of the first body April 27, and said it was unclear if Dominguez knew the victims. Those killed were a 50-year-old homeless man well loved in the community and a 20-year-old UC Davis student. A homeless woman attacked in her tent Monday night is recovering.\"He was out wandering a neighborhood where the second homicide had occurred. He had a large knife in a backpack, wearing the same clothes from the third stabbing,\" Pytel told a news conference, explaining the circumstances of Dominguez's arrest. \"That's highly unusual and unique.\"The multiple stabbings over the course of less than a week shattered the town´s sense of safety. Some businesses closed early and college students said they were too frightened even to attend daytime classes on campus.\"A murderer is off the streets, and our families will sleep easier tonight,\" Davis Mayor Will Arnold said at the news conference.",
        "It wasn´t immediately clear if Dominguez had an attorney who could speak on his behalf.UC Davis officials said in a statement that Dominguez was a third-year student majoring in biological sciences until April 25, \"when he was separated for academic reasons.\"He enrolled at UC Davis in fall 2020 and previously attended Laney College, a community college in Oakland, California.Davis is a small city about 70 miles (112 kilometers) northeast of San Francisco and 15 miles (24 kilometers) west of Sacramento. There are roughly 67,000 residents in the city in addition to more than 13,000 students who live on the UC Davis campus.The first death was reported Thursday when officers found David Henry Breaux in downtown´s Central Park, hunched over a bench where he often sat or slept. The second victim, Karim Abou Najm, was found Saturday night at Sycamore Park with multiple stab wounds.The stabbings all occurred within a mile of campus. On Thursday, police were searching a residence near campus, where Dominguez lived with housemates.Pytel said police started receiving calls Wednesday afternoon about a person who matched the description of the suspect. Officers discovered a \"large fixed blade knife\" in his backpack and took him in for more questioning with his consent.Dominguez was booked into Yolo County Jail early Thursday on a weapons violation related to the knife but was not arrested on two counts of homicide and one count of attempted homicide until shortly before Thursday's news conference.",
        "Pytel said they were zeroing in on the suspect based on other evidence, \"but the tips certainly expedited finding him and an arrest, there´s no doubt about that.\"___This story has been updated to correct that the suspect was taken into custody Wednesday."
    ]
}