{
    "articleURL": "/wires/pa/article-12050611/A-closer-look-Man-Utd-s-poor-away-record-against-Premier-League-s-best.html",
    "content": [
        "Manchester United’s wretched record away to the Premier League’s best continued with Thursday’s late loss to Brighton.",
        "The Red Devils have failed to win any of their away games against the current top nine teams, drawing one and losing the other eight.Here, the PA news agency looks at that poor record as Erik ten Hag’s first season in charge edges towards a conclusion.Brentford (currently 9th) 4 Manchester United 0 – August 13, 2022",
        "Ten Hag’s first away match in charge ended in a 4-0 capitulation, with a mixture of catastrophic defensive ineptitude and Brentford opportunism meaning the Red Devils were four down at half-time. David De Gea gifted the first two to Josh Dasilva and Mathias Jensen, Ben Mee helped himself to a third and Bryan Mbeumo hit a slick fourth on a chastening afternoon for the visitors.Manchester City (currently 1st) 6 Manchester United 3 – October 2, 2022",
        "The phenomenal Erling Haaland and Phil Foden both scored hat-tricks in a Manchester derby humbling that evoked memories of City’s famous 6-1 win at Old Trafford in 2011. Foden began the rout after just eight minutes and United were a distinct second best thereafter, although Antony pulled one back and Anthony Martial also claimed two consolation efforts.Aston Villa (currently 8th) 3 Manchester United 1 – November 6, 2022",
        "United fell to their first Premier League loss at Villa Park since 1995 in what proved to be Cristiano Ronaldo’s final match at the club. The Portuguese wore the armband in Birmingham, where the hosts ended a 9,941-day wait to beat the Red Devils in Unai Emery’s first match in charge. Leon Bailey and Lucas Digne scored inside the opening 11 minutes, with Jacob Ramsey atoning for deflecting in a Luke Shaw strike by scoring a fine effort just after half-time.",
        "Arsenal (currently 2nd) 3 Manchester United 2 – January 22, 2023",
        "Eddie Nketiah flicked home a late winner as title-chasing Arsenal won a five-goal thriller in the capital. In-form Marcus Rashford scored a stunning opener that was cancelled out by Nketiah before Bukayo Saka’s own top-drawer finish had Arsenal ahead. Lisandro Martinez, an Arsenal target last summer, levelled but Nketiah would turn home a wayward Martin Odegaard shot to secure a memorable win.Liverpool (currently 5th) 7 Manchester United 0 – March 5, 2023",
        "Ten Hag fumed at his side’s “unprofessional” display in a loss that equalled United’s record competitive defeat – against Blackburn in 1926, Aston Villa in 1930 and Wolves in 1931. Just a week on from lifting the Carabao Cup, the Old Trafford giants were brought back down to earth with a bump at Anfield. Cody Gakpo’s smart strike had Liverpool ahead at the break and nobody could have foreseen the way United would unravel. Gakpo, Darwin Nunez and Mohamed Salah ended the day with two goals apiece, with substitute Roberto Firmino completing a win that will live long in the memory of both clubs.Newcastle (currently 3rd) 2 Manchester United 0 – April 2, 2023",
        "The loss to Liverpool was called “unprofessional” and United defender Luke Shaw labelled the defeat at St James’ Park “unacceptable”. Boss Ten Hag agreed with the left-back’s assessment that the Magpies were “more determined, more passionate” and had “more desire” as Joe Willock and substitute Callum Wilson secured the hosts a win that was more one-sided than the scoreline suggested.",
        "Tottenham (currently 7th) 2 Manchester United 2 – April 27, 2023",
        "United last week blew a two-goal lead against a Spurs side playing their first match since replacing interim Cristian Stellini with another caretaker boss in the wake of their 6-1 trouncing at Newcastle. First-half efforts by Jadon Sancho and Rashford put United in cruise control, only for Ryan Mason’s half-time message to do the trick. Pedro Porro reduced the deficit and Son Heung-min levelled.Brighton (currently 6th) 1 Manchester United 0 – May 4, 2023",
        "Ten Hag bemoaned Thursday’s “annoying” last-gasp loss at Brighton, where Alexis Mac Allister slammed home from the penalty spot in the ninth minute of added time after Shaw’s inexplicable handball was punished following VAR intervention. Ten Hag conceded his side contributed to their own downfall during a pulsating south-coast clash."
    ]
}