{
    "articleURL": "/wires/reuters/article-12058615/Sudans-stuck-limbo-border-town-en-route-Egypt.html",
    "content": [
        "By Maggie Michael",
        "WADI HALFA, Sudan, May 8 (Reuters) - After sleeping for a week under a tree in the backyard of a mosque in the Sudanese town of Wadi Halfa, Dalia Hassan is torn over whether she should cross the frontier into Egypt, or wait until her 18-year-old son gets a visa.A few paces away in the hot, dusty, desert settlement, a family including three pregnant sisters and a grandmother with an oxygen cylinder take turns on rented beds as they await an Egyptian visa for Mohamed, who is 16.Amid the waves of displacement caused by the war in Sudan, many of the country's well-off have fled the capital Khartoum and embarked on an expensive and gruelling road journey to the border with Egypt, 720 km (450 miles) to the north.While women, children and the elderly can enter Egypt freely, though often after waiting days in testing conditions at a packed border, Sudanese men aged 16-50 must apply for visas.The rule has led to a bottleneck in Wadi Halfa, 25 km south of the frontier and home to an Egyptian consulate, as businessmen, doctors and other well-to-do Sudanese pack hotels, schools and hospitals, and spill onto the streets.\"We left our house where we lived a good life. Look at us now,\" said Hassan, 40, who travelled with her son from the upscale Kafouri neighbourhood, just over the Blue Nile from central Khartoum.",
        "\"If he doesn't get the visa, we will have to go, but how can I leave an 18-year-old who has never traveled alone before?\"Abdel Qadir Abdullah, Sudan's consul in Aswan, said on Sunday that as of five days ago, 6,000 passports were awaiting visas in Wadi Halfa and that Egypt's foreign ministry had sent reinforcements to speed up the process.The ministry said last week in response to questions about the border crossings that authorities had been working to facilitate evacuation of all nationalities from Sudan since the start of fighting, and to provide care for those crossing the frontier.LOOTING AND LAWLESSNESSA power struggle between Sudan's army and the paramilitary Rapid Support Forces (RSF) that erupted into fighting on April 15 threatens to plunge the country into a protracted civil war and a deep humanitarian crisis.It has stirred new unrest in Darfur in Sudan's west - where a conflict that escalated after 2003 has never been resolved - and has sparked clashes and attacks across the nation of 46 million.But the fighting has mostly been focused on Khartoum and its sister cities of Bahri and Omdurman, all of which were largely spared during Sudan's previous wars, waged by the army and allied militias in remote regions.",
        "For three weeks, millions of residents have cowered in their homes from air strikes, artillery battles, marauding fighters and lawlessness, many cut off from power and water and struggling to restock on food.With Khartoum's airport shut, tens of thousands have fled by road to safer areas outside the capital, and across the country's borders.At least 64,000 people have crossed into Egypt, according to government figures, already home to an estimated 4 million Sudanese and a country where many families have connections.To do so they have crammed onto buses and trucks, paying as much as $500 each to be taken to the border posts of Arqeen to the west of Lake Nubia and Qustul just north of Wadi Halfa, and on to Egypt.The sleepy, low-rise town, has become a vast waiting area for adult men seeking visas, and families who do not want to be separated from their kin.'WOKE UP IN HORROR'Many are still processing the trauma of the fighting that drove them from their homes.Dania al-Nasri, 28, who is studying for a doctorate in engineering in London, said she spent 20 hours a day sheltering under her bed before leaving her home in Kafouri on April 30.\"We couldn't sleep at all, at all. When one day I slept for half an hour, I was startled with a massive explosion. I woke up in horror, crawling, and thinking, am I dead?\" she said.",
        "Bullets pierced the walls of her building, where 11 out of 12 apartments were empty by the time she left. She was stopped three times at RSF checkpoints and said she narrowly escaped an exchange of gunfire.When she got to Wadi Halfa the bus driver, who had promised to take her to Egypt, dropped her off with her family and demanded more money.\"We had cars and we lived in good neighbourhoods,\" said Nasri, who had been planning to return to London at the end of last month to continue her studies before the war broke out.\"There are people who can't get out. Why do people die for lack of cash?\"Some of those with the means to escape have left homes and possessions at the mercy of looters.Khaled Ibrahim, a businessman in his 30s, was already in Wadi Halfa when he watched CCTV footage on his mobile phone of fighters rampaging through his house in Omdurman, shooting off door locks and burning cheques worth millions of Sudanese pounds.He went back to collect some belongings and found his dog shot dead. He returned to Wadi Halfa to apply for his visa but was told to wait, so he sent his elderly parents to Egypt alone.\"How would they live and find ways to live without me?\" he said, as he marked time in a coffee shop across the street from the Sudanese passport office, which takes in the documents and passes them on to the Egyptian consulate for processing.",
        "BLACK MARKETWadi Halfa's dirt roads are filled with long queues of buses dropping off travellers and picking up more.The town's handful of cheap hotels are fully booked. Mosques, schools, parks, and hospitals are packed with large families who rent everything from beds to access to toilets.A few teams of volunteers prepare meals and distribute water.One day in late April, some of those applying for visas told Reuters the Egyptian consulate was no longer processing them because they had run out of visa stickers.A black market for visas has also sprung up, with businessman Ibrahim and others saying applicants could pay $400 to fast-track the process.Ahmed Abdel-Rahman, 28, an engineer, fled Omdurman with 14 relatives. Half the group continued on to Egypt while the rest settled in a school in Wadi Halfa, sleeping in a classroom with three other families.Overwhelmed Egyptian consular officials showed little sympathy for their plight, he said. \"They don't listen. They slam the door in your face.\"Egypt's foreign ministry did not respond to a request for comment on reports of a black market for visas, complaints about the behaviour of consular staff or visa stickers running out.In another classroom at the school, an elderly businessman of Syrian origin, George Bashir Hana, said he had been waiting for a week for his son Jimmie to get a visa.",
        "The school gave him and others a warning that they needed the classrooms back this week for end of year exams.\"I have nowhere to go but sleep in the buses parking lot,\" he said.(Reporting by Maggie Michael; Editing by Aidan Lewis and David Clarke)"
    ]
}