{
    "articleURL": "/wires/ap/article-12044443/Jets-sign-former-Packers-WR-Cobb-join-buddy-Rodgers-NY.html",
    "content": [
        "The New York Jets signed veteran wide receiver Randall Cobb on Wednesday, adding another of Aaron Rodgers' former Green Bay Packers teammates to the roster.",
        "The 32-year-old Cobb, who had two stints with Rodgers in Green Bay, adds depth to a suddenly crowded wide receiver room in New York.The Jets also have Garrett Wilson, the AP Offensive Rookie of the Year last season, as their No. 1 receiver to go along with Allen Lazard - another former Packers player - Corey Davis, Mecole Hardman and Denzel Mims. Malik Taylor, who spent four seasons in Green Bay, is also on the roster, along with Diontae Spencer and Irvin Charles.Cobb was mentioned by Rodgers when he met with the Jets in March as someone he'd like to continue to play with. The two walked off the field together in January after Green Bay's season-ending loss to Detroit - which turned out to be both players' final game at Lambeau Field.The Jets acquired Rodgers from the Packers last week and formally introduced him at a news conference last Wednesday.Cobb was a second-round pick of Green Bay in 2011 and played for the Packers for eight seasons before signing with Dallas as a free agent in 2019. He played the next season in Houston before being re-acquired by the Packers - at Rodgers' request - in 2021.",
        "Cobb, who has served primarily as a slot receiver, had 34 catches for 417 yards and a touchdown last season. In 12 NFL seasons, he has 625 receptions for 7,585 yards and 53 touchdowns.",
        "In addition to Cobb, Lazard and Taylor, the Jets have backup quarterback Tim Boyle and offensive linemen Billy Turner and Adam Pankey as players who were teammates of Rodgers in Green Bay. Cobb is also reunited with Jets offensive coordinator Nathaniel Hackett, whose system Cobb played in for the Packers in 2021.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}