{
    "articleURL": "/news/article-12053599/King-Charles-Coronation-Lidia-Thorpe-dresses-royal-anti-Coronation-event.html",
    "content": [
        "Lidia Thorpe held anti-Coronation event in MelbourneSenator wore a black and red Elizabethan-dress and crownShe was joined by a man wearing a King Charles maskLidia Thorpe has bizarrely confronted 'King Charles' while dressed as a royal just days after she demanded the monarch apologise for the effects of colonisation. ",
        "The controversial senator wore a black and red Elizabethan-style dress, lavish jewellery and a crown to an anti-Coronation event dubbed the SovereignTea Party at Melbourne's Fitzroy Town Hall on Saturday.  She lead a conversation on 'Sovereignty, Treaty and Republic' alongside a man wearing a navy suit and a plastic King Charles mask over his head. The senator was pictured throwing her fist in a Black Power salute and lecturing the fake monarch during a high-spirited speech in front of a crowd.'A few of us sat down with the King and let him know we are Sovereign people!' she wrote alongside a photo from the event.",
        "The event was hosted by a group called the Black Peoples Union and attendees were asked to bring along their 'fanciest teacup'.A large Aboriginal flag was hung behind the senator, with Ms Thorpe's uncle Robbie Thorpe, an Indigenous activist, also in attendance. The stunt comes just days after Senator Thorpe, alongside a series of high-profile Indigenous leaders, urged King Charles to formally apologise for the effects of colonisation. Ahead of the Coronation, representatives from 12 countries have written a joint letter calling for reparations, acknowledging the impact of slavery, along with returning the remains of Indigenous people and cultural artefacts.Australian signatories of the letter include Nova Peris, the first Indigenous woman elected to federal parliament and co-chair of the Australian Republican Movement, fellow ARM co-chair Craig Foster. ",
        "'We stand united in engaging a process to right the wrongs of the past and to continue the process of decolonisation,' the letter said.'We, the undersigned, call on the British monarch King Charles III, on the date of his coronation being May 6, 2023, to acknowledge the horrific impacts on and legacy of genocide and colonisation of the Indigenous and enslaved peoples.'Countries represented in the joint letter include New Zealand, the Bahamas, Canada, Papua New Guinea, Jamaica and Saint Lucia.The letter called for the King to start the conversation about 'slavery's enduring impact', as well as 'immediately commit to starting discussions about reparations for the oppression of our peoples'.Ms Thorpe said the effects of colonisation on Indigenous people were still being felt.",
        "'The genocidal project that commenced in 1788 still continues, and neither the British Crown nor the Australian government have been held to account for the crimes they have committed,' she said.'This country has a new king. The parliament and the prime minister are subjugated to someone we didn't elect. We don't need a new king, we need a head of state chosen by the people.'While he is a republican, Prime Minister Anthony Albanese said he was looking forward to being at the monarch's Coronation ceremony on Saturday. ",
        "Mr Albanese is among a contingent of Australians invited to the event, along with Governor-General David Hurley and state governors.The Australian delegation includes Matildas captain and soccer star Sam Kerr, singer Nick Cave, Aboriginal artist Jasmine Coe, comedian Adam Hills and London-based nurse Emily Regan.On Sunday, Australia's Federation Guard will fire a national 21-gun salute from the Parliament House forecourt, followed by a Royal Australian Air Force fly-past. "
    ]
}