{
    "articleURL": "/wires/ap/article-12040217/Stars-Pavelski-2-quick-goals-return-5-missed-games.html",
    "content": [
        "DALLAS (AP) - Joe Pavelski became the oldest player ever with a four-goal game in the NHL playoffs, and did it in his return two weeks after going into concussion protocol.",
        "And that still wasn't enough for the Dallas Stars.\"Epic. Epic. Ashamed we wasted it and didn´t win,\" Stars coach Pete DeBoer said. \"That´s on our group because, you know, he more than do his part. He tried to drag us to a win.\"The 38-year-old Pavelski scored all four of their goals, including two in the third period to force overtime, before the Stars lost 5-4 to Seattle in Game 1 of their second-round series on Tuesday night.\"It's just Joe. I´m not surprised. I should be, everybody should be,\" DeBoer said. \"He's the oldest guy on the sheet of ice tonight and he´s by far the best player on either team. But that's just Joe.\"Pavelski wasn't on the ice when Yanni Gourde scored an unassisted goal 12:17 into overtime. The veteran center was only able to look up in disbelief from the bench when the game ended.",
        "After taking a big hit and banging his head hard on the ice in the opener of the first-round series against Minnesota on April 17, Pavelski missed the last five games of that series. He was set for a return in Game 7 against the Wild, but that wasn't needed when the Stars wrapped up that series in six games.\"I think over the last few days there´s definitely a sense of clarity that kind of came back and I felt confident,\" Pavelski said.",
        "Only 2 1/2 minutes into his first game back, he scored on his first shot - a 25-foot wrister to put the Stars ahead 1-0. He scored on a pass from Mason Marchment, while Max Domi got the secondary assist.\"It was exciting to be back. First lap in warmups, I felt a little shot of adrenaline right there. I was excited,\" Pavelski said. \"Starting the game was just as much fun. We battled all night. It was a good game, and we were right there. It´s a tough loss.\"About 10 minutes after his first goal, with Seattle even at 1-1, Pavelski scored again from about the same distance with a redirect of Thomas Harley's shot. The Kraken then scored three goals in a 68-second span to take a 4-2 lead.Pavelski notched his second career postseason hat trick midway through the third period when he knocked in a rebound after captain Jamie Benn´s shot. He got the tying fourth goal with 6 1/2 minutes left in regulation, when he swatted a puck into the net out of mid-air after Jani Hakanpaa´s shot ricocheted off the stick of Adam Larsson into the air toward the crease.The four goals extended Pavelski´s record for U.S.-born players to 68 career playoff goals.",
        "At 38 years, 295 days old, Pavelski surpassed Maurice Richard's four-goal game at 35 years, 245 days in Game 1 of the 1957 Stanley Cup Final. Pavelski also matched the franchise record for most goals in a playoff game - Denis Gurianov had four in 2020.It was also Pavelski's 170th career postseason game. He is one of only five players to play that many without winning a Stanley Cup.The Stars became only the fourth team to lose a playoff game when having a player score at least four goals. They were the first since the New York Islanders lost to the Capitals in 1993.Pavelski was on the ice for the game's opening shift, though he wasn´t immediately inserted back on the top line. He was with Marchment and Domi, like he was when he went through a full practice Monday.Tyler Seguin, who scored four power-play goals in the six-game series against Minnesota, stayed on the top line with Jason Robertson and NHL playoff scoring leader Roope Hintz. Seguin had moved up to that line after the 38-year-old Pavelski got hurt.___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}