{
    "articleURL": "/news/article-12042141/British-playwright-director-Adam-Brace-dies-aged-43-just-weeks-Broadway-debut.html",
    "content": [
        "Much loved British playwright and director Adam Brace has died age 43 Soho Theatre said Mr Brace died after a 'short illness' in a statement released  British playwright and director Adam Brace has died age 43 just weeks before he was due to make his Broadway debut. ",
        "The sad news was shared by Soho Theatre, where he was an associate director, who paid tribute to his 'unique talent'.Mr Brace's death comes a month after it was revealed he would be making his debut New York's Broadway with Just For Us, starring his longtime colleague Alex Edelman.In a heartbreaking tribute, Mr Edelman said he had been left 'bereft' adding 'I’m not sure what kind of performer - and person - I’m going be without him'.The director and playwright, who died after a 'short illness', is most well known for his play's Stovepipe and They Drink It in the Congo.",
        "The statement released yesterday by the theatre read: 'It is with deep sadness we announce that our much-loved friend, colleague and client Adam Brace died on Saturday 29th April.'Adam was a director, co-creator, dramaturg, script editor and writer. He was a unique talent of our time, working with artists all over the world across theatre, comedy and performance. 'With enormous range and variety, his work won many accolades and awards, though he was fiercely proud of all of his shows and the artists he worked with. He loved working with them, and everyone loved working with him.'It added that he died after a 'short illness' and that there would be an event held in his memory.",
        "Mr Edelman, who had worked with the director on a number of different shows, was set to star in the writer's one-man show on Broadway this summer.The preview performance is planned to begin on June 22 at the Hudson Theater, running until August 19.Writing on Twitter yesterday Mr Edelman wrote: 'Adam Brace passed away on Saturday at the ludicrously unfair age of 43. 'He was my closest collaborator for more than a decade, but more importantly, he was one of my closest friends. 'I don’t feel ready to acknowledge the magnitude of this loss, but I already feel it.'The actor has performed a number of one-man shows in the West End and Off Broadway. ",
        "He continued: 'Adam directed every one of my solo shows - all three of which were conceived over beers with him on the same street in London - including Just For Us. 'Adam’s laugh was distinctive and deep and my favorite sound. I sought it out again and again.'I was lucky to spend so much time with him, especially over the last year and a half, and I am distraught at the prospect of doing the show without him on Broadway. If I’m being honest, I’m not sure what kind of performer - and person - I’m going be without him.' ",
        "Fans and members of the threatre community alike also paid their respects to the director on social media. Fellow British playwright Lucy Prebble said: 'I will miss Adam Brace so much. 'One summer we ran into each other on the street and ended up in a drink in the sunshine through to the same time next day, setting theatre right.   'I always hoped whenever I arrived in a strange room he’d be there. I will still hope that.'West End actress Liz Kingsman said: 'I am heartbroken about the loss of my friend and director Adam Brace.'Adding: 'I am so lucky that I got to create my most meaningful work with Adam. We made a show together. We were really proud of it. And when our show found its audience in ways I could never have imagined, we were thrown together on a mad ride, which I must now crushingly finish without him by my side.' One fan wrote: 'Adam Brace's death feels like a big loss to British theatre. I absolutely loved They Drink It In The Congo, and feel sad thinking about the plays he'll never write.'Another said: 'This is shocking. I did the Soho Theatre labs and he gave me some great advice. In fact he came up-to me after the workshop and recommended me some books and compared me to some comedians that I absolutely love. He didn’t have to but it was great that he did. R.I.P.'"
    ]
}