{
    "articleURL": "/wires/ap/article-12060027/Top-challenger-Cambodian-polls-awaiting-official-approval.html",
    "content": [
        "PHNOM PENH, Cambodia (AP) - Cambodia´s National Election Committee announced Monday that 20 political parties have registered for July´s general election but nine of them still have not been approved, including the Candlelight Party, the sole credible challenger to the governing Cambodian People´s Party.",
        "About 9.7 million Cambodians are registered to vote in the July 23 election to select the 125 members of the National Assembly.Prime Minister Hun Sen and his entrenched Cambodian People´s Party are certain to easily top the polls, holding all the advantages of incumbency. They dominate the field in terms of nationwide organizing, personnel, finances and influence with the mass media.The party has held an iron grip on power for decades and controls almost every level of government. Hun Sen, 70, an authoritarian ruler in a nominally democratic state, has held his position for 38 years. His eldest son, army chief Hun Manet, is widely expected to replace his father as prime minister after the polls.The opposition, led by the Candelight Party, is low on financial resources and subject to constant harassment in the courts initiated by the governing party. Most prominent opposition members are in self-imposed exile to avoid being jailed on various charges they say are trumped up and unfair.The Candlelight Party is the unofficial successor to the Cambodia National Rescue Party, which posed a serious challenge to Hun Sen´s party ahead of the 2018 election. It was disbanded just months ahead of the polls by a controversial court ruling that said it had plotted the illegal overthrow of the government.",
        "The courts are widely believed to be under the influence of Hun Sen´s government, and the party´s disbanding enabled the governing party to win all of the seats in the National Assembly.However, in local elections last June, the Cambodian People´s Party won 74.3% of the votes and the Candlelight Party received about 22.3%.Speaking to reporters Sunday when registering with the National Election Committee, Candlelight Party deputy president Rong Chhun said several party members have been intimidated, threatened and even beaten up, though his party has not publicized the incidents. He also said some government officials who are members of his party were dismissed from their jobs.Rong Chhun appealed to the authorities to treat all political parties fairly, and said he wishes for calm ahead of the election, with people allowed to express their party allegiances without fear.The party said ahead of registration that the election committee had demanded documents it could not provide, even though they had not been needed for last year´s local elections.The committee asked for the party´s original registration papers issued by the Interior Ministry. But the Candlelight Party said the papers were taken in a 2017 police raid on the headquarters of its predecessor, the Cambodia National Rescue Party.If the Candlelight Party is not allowed to contest the July polls, the sole competition for the governing party would be groups aligned with it, or small, obscure parties without a national presence.",
        "By law, parties have seven days to provide any missing information to the election committee, failing which their registration will be rejected. They can then appeal the ruling to the Constitutional Council.This story has been updated to correct number of seats in contention for this year´s election to 125 and Hun Sen´s age to 70."
    ]
}