{
    "articleURL": "/wires/ap/article-12048519/Porn-industry-group-sues-Utah-age-verificaiton-law.html",
    "content": [
        "SALT LAKE CITY (AP) - An adult entertainment industry group filed a lawsuit on Wednesday challenging a new Utah law that requires porn websites to implement age verification mechanisms to block minors from accessing sexually explicit materials.",
        "The law, which took effect Wednesday, made Utah the second state to require adult websites to verify the age of those who want to view their pages - either through an independent contractor or digital ID. Lawmakers likened the requirement to those for alcohol or online gambling and argued that stronger protections were needed to shield kids from pornography, which is ubiquitous online.The Free Speech Coalition - along with an erotica author and companies that manage adult websites and are party to the suit - argues that Utah's new law unfairly discriminates against certain kinds of speech, violates the First Amendment rights of porn providers and intrudes on the privacy of individuals who want to view sexually explicit materials. The plaintiffs have asked a federal judge to bar enforcement of the law until their legal challenge is resolved.They contend that the age verification law \"imposes a content-based restriction on protected speech that requires narrow tailoring to serve a compelling state interest.\"It is currently illegal to show children pornography under federal law, however that law is rarely enforced.Utah´s new law is the conservative state's latest effort to crack down on access to pornography and dovetails with lawmakers´ other efforts to restrict how children use the internet, including social media sites. It comes less than a year after Louisiana enacted a similar law and as additional states consider such policies as filters or age verification for adult websites.",
        "The Utah law builds off years of anti-porn efforts by the Republican-controlled Legislature, where a majority of lawmakers are members of The Church of Jesus Christ of Latter-day Saints. It comes seven years after Utah became the first state to declare pornography a public health crisis and two years after lawmakers passed a measure paving the way to require internet-capable devices be equipped with porn filters for children. Provisions of the law delay it from taking effect unless at least five other states pass similar measures.The age verification law is facing strong pushback, including from one of the biggest porn sites, Pornhub, which disabled access to its site in Utah earlier this week.The Free Speech Coalition has filed similar challenges before. In 2002, its case against a federal child pornography statute made landed before the U.S. Supreme Court, which struck down provisions for overly interfering with free speech."
    ]
}