{
    "articleURL": "/news/article-12037987/Green-lobbyists-plotted-Biden-administration-ban-gas-stoves.html",
    "content": [
        "GOP Sen. Ted Cruz and Rep. James Comer claim that left-wing groups ran 'a hidden pressure campaign' to bring about a gas stove ban The two top lawmakers sent a stern letter to green activists TuesdayUS officials have repeatedly denied that such a pressure campaign ever existedGreen lobbyists tried to force the Biden administration into banning gas stoves across America, according to allegations by two leading congressional Republicans. ",
        "Senator Ted Cruz of Texas and Congressman James Comer of Kentucky claim climate change activists ran 'a hidden pressure campaign' to see them banned.The two lawmakers wrote an angry letter to four groups to warn them they are facing a congressional investigation into the alleged pressure campaign.The lawmakers informed green lobbying groups Climate Imperative Foundation (CIF), Consumer Reports, Rewiring America and Windward Fund that they are seeking information into their contacts and communications with U.S. government officials.'Such lack of transparency with Congress and the American public is unacceptable. We therefore expect a complete written response to the requests for information and documents made in the March 16 letter no later than May 10, 2023,' they wrote. ",
        "Rewiring America hired ex-Georgia Democratic lawmaker Stacey Abrams in March as a lobbyist for the self-styled 'young and energetic nonprofit working to electrify everything.'Senator Cruz and Rep. Comer also singled out CIF because it 'worked hand-in-hand with the Biden administration towards eliminating gas stoves.'The two senior Republicans provided no evidence for their extraordinary claims that have been repeatedly denied by senior U.S. officials. The U.S. Consumer Product Safety Commission makes decisions independently from the executive branch. But a leaked memo from October 2022, first obtained by Fox News, showed the top safety watchdog was considering tightening the rules on dangerous emissions. ",
        "'The gas stove regulation has reached a boiling point,' the Biden-appointed CPSC Commissioner Richard Trumka Jr. wrote.He said the body 'has the responsibility to ban consumer products that emit hazardous substances, particularly, when those emissions harm children.''Emerging evidence is sufficient to conclude that gas stoves in homes emit toxic gasses that cause illness and that lower-cost, safer alternatives are available,' he added.But Trumka fanned the flames of the debate when he gave an interview on product regulation to Bloomberg in January.  'Any option is on the table. Products that can't be made safe can be banned,' he said.He later forced to clarify that he had been speaking about new products, and that a gas stove ban was not being considered.'To be clear, CPSC isn't coming for anyone's gas stoves,' he wrote. 'Regulations apply to new products.'In a statement to DailyMail.com, Consumer Reports denied the claims made by Cruz and Comer. 'To be clear, Consumer Reports is not advocating for a ban on gas stoves. Last year, CR tested gas stoves for emissions, and found high levels of nitrogen oxide in some scenarios. 'We advised people how to reduce the risks with ventilation, like opening a window or installing a range hood. We also offer the pros and cons of going electric.",
        "'Our tests and results are always completely independent from any outside organization or influence.'An estimated 35 percent of US homes have gas stoves that some experts have linked to asthma in children.A peer-reviewed US study on the topic was published in December last year in the International Journal of Environmental Research and Public Health.Experts calculated the risk of developing asthma in homes with a gas stove from a 2013 review of 41 previous studies.Using US census data, it linked 12.7 percent of US childhood asthma cases to gas cooking.But one of the study's main authors Talor Gruenwald is a data scientist at electrification advocacy group Rewiring America - one of the organizations that has drawn the ire of Republicans.He said the findings suggested that around 650,000 children in the US 'are suffering from asthma who might not otherwise if they weren't exposed to gas stoves.'",
        "Approximately 25 million Americans have it, including about six million children It's a common but incurable condition which affects the small tubes inside the lungs.It can cause them to become inflamed, or swollen, which restricts the airways and makes it harder to breathe.The condition affects people of all ages and often starts in childhood. Symptoms may improve or even go away as children grow older, but can return in adulthood.Symptoms include wheezing, breathlessness, a tight chest and coughing, and these may get worse during an asthma attack.Treatment usually involves medication which is inhaled to calm down the lungs.Triggers for the condition include allergies, dust, air pollution, exercise and infections such as cold or flu.If you think you or your child has asthma you should visit a doctor, because it can develop into more serious complications like fatigue or lung infections.",
        "Gas stoves can also emit methane, which can cause a person to have trouble breathing and cause a rapid heartbeat.Benzene may also be leaked from switched off gas stoves. The chemical has been linked to the development of multiple cancers - though experts believe the amount of benzene leaked by stoves is not enough to pose serious danger."
    ]
}