{
    "articleURL": "/wires/pa/article-12060199/Wigan-Rotherham-play-goalless-stalemate-dead-rubber.html",
    "content": [
        "Wigan and Rotherham shared the spoils after a goalless Sky Bet Championship draw at the DW Stadium that lived up to its billing as a dead rubber.",
        "With the Millers already safe and the Latics already relegated, there was little to play for in front of a bumper crowd, boosted by a sell-out contingent from South Yorkshire.All of the pre-match talk had focused on Wigan’s failure to pay their players on time for a fifth time this season.And a number of their first-team ‘regulars’ were absent from the matchday squad named by boss Shaun Maloney.James McClean – one of the players who had not been paid – did play, however, and wore the captain’s armband on what could turn out to be his last appearance for the club.Youngster Sam Tickle was making his league debut in goal, and he had a confidence-boosting first involvement very early on.",
        "Tariqe Fosu danced through the Wigan defence and got in his shot, but the goalkeeper was able to make a fine stop with his body.The home defence parted again as Jamie Lindsay made his way through some non-existent tackling.But this time on-loan midfielder Christ Tiehi – another making his final appearance – stuck out a foot in the nick of time to toe it back to Tickle.As half-time approached, Fosu crossed from the right and the ball flew only just in front of the lunging Jordan Hugill at the far post.",
        "After the restart, a Rotherham break saw them threaten two-on-two, but a great recovery from Tom Pearce and then McClean snuffed out the danger.Tickle was called into action again from a Fosu free-kick before a Charlie Hughes cross found Thelo Aasgaard unmarked at the far post at the other end. His header was straight at Viktor Johansson.The Millers goalkeeper pulled off a stunning save moments later to keep out Omar Rekik’s header from a Callum Lang free-kick.As Wigan looked to end a disastrous campaign on a high, Tiehi sent a half-volley from 20 yards over the top.Lang had one last effort to break the deadlock right at the end but his shot, which was travelling, was superbly gathered by Johansson.There had been suggestions that some home supporters would try to get onto the field in the closing stages to protest at the club’s ownership.Nothing transpired, although the game was halted in stoppage time when the away supporters threw a couple of red flares onto the field."
    ]
}