{
    "articleURL": "/wires/reuters/article-12047087/Flying-high-obesity-success-Novos-appetite-deals-grows.html",
    "content": [
        "By Natalie Grover",
        "LONDON, May 4 (Reuters) - Buoyed by the success of its diabetes and obesity drugs, Novo Nordisk is on the prowl for partnerships and deals to beef up its pipeline, a senior company executive said on Thursday.John McDonald, corporate vice president of global R&amp;amp;D business development, said the Danish drugmaker aims to shed its image of being a company that tends to \"window shop\", but hardly ever presses the trigger on deals.Its interest is largely in areas it has already invested in, including diabetes, obesity, cardiovascular disease and gene therapies, he said on a panel at the LSX World Congress conference.Since launching its popular Wegovy weight-loss drug in the United States in June 2021, Novo's shares have soared by 140%.It overtook Nestle in March to become Europe's second-most valuable listed company worth almost 340 billion euro ($374.5 billion) after LVMH.The company has traditionally taken a wait-and-see approach to deals, often waiting for drugs to have success in later-stage trials before going for a deal.\"We're not doing that anymore,\" McDonald said. \"Instead of waiting and asking for data and trying to see more and more and more, we'll go earlier.\"For instance, the company might in future bet on five early-stage studies, rather than one-mid-stage one, he added.",
        "Since joining the drugmaker in 2018, the company has grown its business development capacity.\"If you look at some of our competitors, there are hundreds of people in business development ... and we probably have 25,\" he said. \"We're growing, but ... we're at the capacity where we can meet the needs and desires of what we see on the horizon today.\"In recent years, the company has bought blood disorders-focused Forma Therapeutics for $1.1 billion, diabetes firm Emisphere Technologies for $1.8 billion and cardiovascular disease specialist Corvidia Therapeutics for $725 million. ($1 = 0.9078 euros) (Reporting by Natalie Grover in London; Edited by Josephine Mason and Christina Fincher)"
    ]
}