{
    "articleURL": "/tvshowbiz/article-12051133/Sharon-Osbourne-70-reveals-lost-2st-controversial-weight-loss-drug.html",
    "content": [
        "Sharon Osbourne stepped out in London on Friday after speaking out about the dangers of using controversial weight loss jabs.",
        "The plastic surgery fan, 70, has said that while she lost over two stone in weight over a four month period, she felt nauseous every day and insisted it's not a 'quick fix'.After her comments, TalkTV host Sharon stepped out in a patriotic outfit ahead of  Saturday's coronation, slipping into a chic cornflower blue trouser suit.The star teamed her stylish two-piece with a large red scarf and white boots, with Sharon looking in good spirits while leaving her hotel. During a discussion on the controversial injections on The Talk, Sharon shared her first-hand experience of the drugs, after it was announced yesterday that WeGovy's launch in the UK had been put on pause.",
        "Fellow panelist Daisy McAndrew explained that weight loss isn't as easy as increasing exercise and changing your diet, saying, 'It doesn't work like that for a lot of people's metabolism.'Sharon replied, 'It doesn't. It is a mental problem. It really is, apart from, you know, when children grow up in a household where they live off chips and pies. 'But I took it. I took it for four months and I lost 30 pounds, but like everything, there's always no quick recipe.'I was very sick for a couple of months. The first couple of months, I just felt nauseous. Every day I felt nauseous, my stomach was upset, whatever. ",
        "'But listen, I took it for four months, I lost 30 pounds. I've just shoved two chips in my mouth, while we had the break, and I eat normally now, and I haven't put on a pound. Nothing.'Sharon has jetted in to the UK for TalkTV's Coronation coverage, and will host a Coronation Watchalong with Vanessa Feltz from 10am to 3pm on TalkTV on Saturday.Sharon isn't the only celebrity linked to the controversial weight loss jabs.Famous users include Elon Musk, who credited Wegovy for his body transformation on Twitter. Kim Kardashian is also rumored to have used the injections. ",
        "Meanwhile, Kyle Richards was recently forced to deny using Ozempic amid photos of her looking very thin. After showing off her toned body in a bikini photo shared earlier this year, internet trolls accused the reality star of using Ozempic - a type 2 diabetes treatment that is used off-label as a weight loss drug.In the comment section of a Page Six Instagram post that linked to a story about her ripped figure, the younger sister of Kathy Hilton responded to a user that wrote: 'I think it's many visits to the plastic surgeon.''I have never tried Ozempic and this is not from plastic surgery,' Richards responded.Wegovy and its sister drug Ozempic, which both use the active drug semaglutide, work by replicating hormones that tell the brain it is full.",
        "These hormones are meant to make a person feel full and reduce cravings.It also slows down the emptying of the stomach and increases the amount of insulin secreted by the pancreas.Ozempic, the first formulation of the drug manufactured by Novo Nordisk, was initially designed to help diabetics manage their condition.Those who used the drug also experienced significant weight loss as well, though.This led to the Danish firm reformulating the drug into the Wegovy, which is approved for weight loss.",
        "Sharon's words come after she revealed she has turned her back on cosmetic surgery after a 2021 facelift left her 'looking like a cyclops'.The TV personality has been fond of going under the knife in the past but now says the most recent procedure's results left her 'frightened'.She told The Sun: 'That [face life] put me off and it frightens me, I really f***ing pushed it with the last facelift and I am now like, no more'.'Time is against me, I cannot have another facelift.'She previously told The Sunday Times: 'I'm telling you, it was horrendous. [To the surgeon] I'm, like, 'You've got to be f***** joking. One eye was different to the other. I looked like a f***** Cyclops. I'm, like, 'All I need is a hunchback,''",
        "'It hurt like hell. You have no idea,' she added of the cosmetic surgery, which took five and a half hours.Her singer-songwriter husband Ozzy Osbourne, 74, apparently concurred that the results were not great and offered to pay to fix it.",
        "'He said, 'I don't care how much it costs, we'll get it redone,'' Sharon - who shares children Aimee, 39, Kelly, 38, and Jack, 37, with Ozzy - said.Osbourne has always been open about the procedures she's undergone over the years, and spoke about up getting a face lift in 2019.She discussed the procedure in an October 2019 appearance on The Kelly Clarkson Show. 'I had this thing where they lifted up my mouth and then for the first week I couldn't feel my mouth, I can hardly feel my mouth now, to be honest with you,' she said.'I couldn't find my mouth. It was numb and it was up on one side and I looked like Elvis. All the kids and Ozzy are going, 'Why are you snarling at me?' And I'm like, 'I'm not snarling; I'm not doing anything!''",
        "In January 2020, husband Ozzy, who is also known as the 'Prince of Darkness,' revealed that he has Parkinson's in an emotional interview with Sharon.",
        "The then-71-year-old sat down with Good Morning America to reveal he could no longer hide his health struggles and that he is on a 'whole host' of medications to treat his nerve pain.It began, he said, when he suffered a fall in 2019 and had to undergo surgery for it. After that, he started experiencing nerve pain and doctors have had a hard time pinpointing whether the fall, the surgery, or his condition are to blame for his condition.Insisting he was 'far from' his deathbed - as had been misreported - he said he wanted to 'own up' to his condition for the sake of his fans.'It has been terribly challenging for us,' he said of the last year. 'I had to have surgery on my neck which screwed all my nerves. I found out that I have a mild form of....' he said before looking to his wife to finish his sentence.Sharon added, 'It's Parkin 2 which is a form of Parkinson's. There are so many different types of Parkinson's.' Michael J. Fox is another celebrity who also suffers from the disorder, which targets the central nervous system and can affect mobility. In June 2022, Ozzy underwent a spinal surgery with Sharon giving an update to fans shortly afterwards. ",
        "'Our family would like to express so much gratitude for the overwhelming amount of love and support leading up to Ozzy's surgery! Ozzy is doing well and on the road to recovery! Your love means the world to him,' the TV personality concluded.Later that same year, the Crazy Train singer jumped to the stage to perform during an NFL performance in September 2022.Watch Sharon live on The Talk tonight at the special earlier time of 6pm. Available on Sky 522, Sky Glass 508, Virgin Media 606, Freeview 237 and Freesat 217 as well as on DAB, Amazon Fire TV, Apple TV, Samsung TV Plus, YouTube, the Talk.TV website and TalkTV iOS and Android apps."
    ]
}