{
    "articleURL": "/wires/pa/article-12052945/King-Queen-spend-night-coronation-dining-privately-Clarence-House.html",
    "content": [
        "The King and Queen Camilla spent the night before their coronation dining together privately at Clarence House.",
        "The pair stayed at their much-loved London base, rather than at monarchy HQ Buckingham Palace, as they prepared for the historic, momentous task ahead of them.Charles moved into Clarence House – the former home of his grandmother the Queen Mother – in 2003.",
        "The residence, built between 1825 and 1827 to the designs of John Nash, is a favourite of the couple and has been their home in the capital for 20 years.It was extensively refurbished and redecorated to their taste, and features many pieces from Charles’s art collection and countless family photos.A short walk from Buckingham Palace, it stands beside St James’s Palace.It will be a welcome place of refuge for the King and Queen as they get ready to take centre stage in front of a global audience of millions at the nation’s first coronation for 70 years.Charles is known for being a reflective soul, and is likely to have spent time deep in contemplation ahead of his historic crowning.",
        "When the health of the late Queen Elizabeth II was failing, Charles, after remaining for a few hours at his mother’s bedside, went foraging for mushrooms as he walked on his Birkhall estate.“He was drawing solace and strength from the trees, the smell of the earth and the murmur of the River Muick,” royal writer Robert Jobson wrote.",
        "The Clarence House garden stretches to half an acre and features swathes of lavender and a sundial in memory of the Queen Mother.The site has featured a garden since the 16th century when a walled privy garden was created for Henry VIII and his family.Buckingham Palace is still undergoing a £369 million reservicing programme spanning 10 years, which includes updating the electrical cabling, plumbing and heating.Charles and Camilla will make their way to the palace in the morning for their final preparations ahead of their departure to the Abbey in the Diamond Jubilee State Coach as part of the King’s Procession."
    ]
}