{
    "articleURL": "/wires/reuters/article-12043853/Giants-outlast-Astros-Logan-Webb-4-2.html",
    "content": [
        "Joey Bart doubled in a run and scored another, Wilmer Flores clubbed a home run, and the San Francisco Giants left Texas with a series win after a 4-2 victory over the Houston Astros on Wednesday afternoon.",
        "Logan Webb (2-5) combined with two relievers on a five-hitter, helping the Giants salvage a 2-3 trip after two losses in Mexico and a series-opening defeat in Houston.Webb and Framber Valdez (2-4) engaged in a scoreless duel before Bart led off the sixth with a single. He was sacrificed to second and scored on a single by Austin Slater.Mitch Haniger made it 2-0 later in the inning with a single that scored Slater.Bart's double, which came with two outs and Michael Conforto on first, increased the advantage to 3-0 in the seventh.Webb took a shutout into the eighth before walking David Hensley and serving up a single to Martin Maldonado, bringing the potential tying run to the plate with no one out.But Webb got former teammate Mauricio Dubon to ground into a double play, which became critical when Alex Bregman followed with a two-run homer to draw Houston within 3-2. The homer was Bregman's fourth of the season.Flores bombed his fifth homer of the year in the ninth, a solo shot, to give the San Francisco bullpen some breathing room.In winning for the second time in his last three starts, Webb was pulled following Bregman's homer. He was charged with two runs on five hits in 7 2/3 innings, with two walks and five strikeouts.",
        "Scott Alexander struck out Yordan Alvarez to end the eighth before closer Camilo Doval worked around a leadoff walk in the ninth for his fifth save.Valdez worked six innings, also allowing two runs and five hits. He walked two and struck out eight.Slater joined Bart with two hits for the Giants, who out-hit the Astros 7-5.Bregman's homer was the only extra-base hit for Houston, which dropped four of six on a week-long homestand.--Field Level Media"
    ]
}