{
    "articleURL": "/wires/aap/article-12054155/Le-Fondre-helps-Sydney-sink-Wanderers-ALM-finals.html",
    "content": [
        "A late goal from Adam Le Fondre has helped Sydney FC claim a spiteful 2-1 win to knock bitter rivals Western Sydney out of the A-League Men finals.",
        "In the first-ever play-off encounter between the two sides, Le Fondre's 80th-minute header was the difference as the Sky Blues advanced to the last four.There was plenty of venom throughout, and the drama spilled over post-game when Wanderers midfielder Milos Ninkovic sought out Sydney boss Steve Corica.Ninkovic left Sydney in acrimonious circumstances last year but was frogmarched out of the Sky Blues' dressing room after confronting his former manager.\"He's just upset, obviously, losing the game,\" said Corica, whose side will host premiers Melbourne City next Friday in the first tie of a two-legged semi-final.\"He came to wish the players all the best for the remainder of the season.\"We have issues but that's between me and him.\"Sydney's victory at CommBank Stadium came despite a boycott from their active supporter group, The Cove, and after the Wanderers had taken a first-half lead through a controversial Morgan Schneiderlin penalty.Slovakian international Robert Mak pulled the visitors level in the 69th minute before Le Fondre escaped the attention of the Wanderers defence to grab a later winner off a corner.Prior to Saturday Marko Rudan's side had lost just once after scoring first in the regular season, but the spirit shown by Sydney was lauded by Corica.\"Derbies are always special and going behind here (and coming back to win) shows great character and passion from the players,\" Corica said.",
        "\"They knew how big that win was, I'm really proud of how we fought back into the game.\"There was only one team playing (in the second half).\"The Wanderers had the better of the chances in the first half, skipper Marcelo flashing a close-range header wide and Ninkovic forcing Andrew Redmayne into a fingertip save.Calem Nieuwenhof helped get the breakthrough when he burst upfield in the 39th minute and attempted to send a low cross into the Sydney box.Luke Brattan was able to block it with his foot but the ball cruelly bounced up and glanced Alex Wilkinson's upper arm.Referee Chris Beath pointed to the spot and after consultation with VAR the decision stood.Redmayne brought out his Wiggles-inspired theatrics but Schneiderlin remained calm and slotted it past the Sydney No.1 to hand the home side a 1-0 leading heading into the break.It was a complete contrast in the second half, the Wanderers like punch-drunk boxers hanging on for life.Eventually their defensive wall crumbled with Mak capitalising on a sloppy Adama Traore clearance to draw the Sky Blues level.The loss of defender Tomislav Mrcela forced the Wanderers into a reshuffle and even though they pushed forward, it was Le Fondre who broke the deadlock.",
        "The shortest man on the field for the Sky Blues, Le Fondre fizzed a header beyond the reach of goalkeeper Lawrence Thomas to knock the Wanderers out.\"I'm disappointed for the players and for our fans,\" Rudan said.\"We obviously wanted to go further, but it wasn't to be.\"These games are about moments and it's a moment Adama hasn't done all season, you give them a sniff and they take it.\"We looked lethargic in the second half.\""
    ]
}