{
    "articleURL": "/news/article-12057635/Sydney-Airport-Strong-winds-cancel-delay-flights.html",
    "content": [
        "Sydney Airport plunged into chaosSome 37 flights cancelled Sydney Airport has been plunged into chaos with strong winds causing flight delays and cancellations.",
        "Some 37 flights have been cancelled with countless others hit by lengthy delays on Monday.A Sydney Airport spokesman blamed strong winds for closing two of the three runways.",
        "Travellers have been urged to check in with their airline to get the latest update on their flight. The Bureau of Meteorology has forecast wind gusts of up to 45km/h. Forecasters have warned that a freezing polar blast that hit Australia over the weekend sending temperatures plunging is here to stay.Melbourne, Sydney, Adelaide, Canberra and Hobart were in the grips of a cold front over the weekend with temperatures struggling to get past 14C anywhere in Australia's south-east.Snow and hail blanketed parts of Victoria, NSW and the ACT, where overnight temperatures dipped below zero.Temperatures plummeted below the May average by as much as 5C in NSW, 8C in South Australia and 10C in Tasmania.Ski resorts welcomed falls of fresh powder a month out from the the start of ski season.The bureau’s weather observations showed the temperature plunged in Sydney overnight.The temperature dropped to 10.5C at Sydney airport at 4am today — but the apparent temperature was a chilly 0.8C as cold winds blasted the Harbour City. At Mount Boyce it was -1C but felt like -8.3C.",
        "Temperatures plummeted below the May average by as much as 5C in NSW, 8C in South Australia and 10C in Tasmania.Ski resorts welcomed falls of fresh powder a month out from the the start of ski season.The bureau’s weather observations showed the temperature plunged in Sydney overnight.The temperature dropped to 10.5C at Sydney airport at 4am today — but the apparent temperature was a chilly 0.8C as cold winds blasted the Harbour City. At Mount Boyce it was -1C but felt like -8.3C."
    ]
}