{
    "articleURL": "/wires/reuters/article-12043373/Germanys-Schwedt-refinery-sees-capacity-improving.html",
    "content": [
        "BERLIN, May 3 (Reuters) - Supplies at Germany's Schwedt oil refinery have improved and a taskforce working on its future expressed optimism on Wednesday that capacity would run at 70% in coming months after a steep drop when Berlin turned its back on Russian oil.",
        "Schwedt has traditionally supplied 90% of the gasoline, diesel, jet fuel and fuel oil used in Germany's capital city. However, the refinery was operating at 50-60% capacity earlier this year after Germany stopped oil supplies from Russia due to the Ukraine warThanks to supplies from Poland and Kazakhstan, the situation has stabilised, said premier of the state of Brandenburg, in which Schwedt is located.\"The situation has clearly improved,\" premier Dietmar Woidke told reporters after a meeting of the PCK Schwedt taskforce.\"There is a well-founded hope that we will reach capacity of up to 70%,\" he said, without giving a precise timeframe.Germany has been working with Poland to try to secure supply for Schwedt and PCK head Ralf Schairer said it would get additional supplies from Poland from around June.\"Even more positive are signals from Rosneft that reliable additional supplies from Kazakhstan will come through,\" he said, adding test quantities had arrived and that 20,000 and 50,000 more tonnes were planned for June and later.Schwedt also aims to upgrade a pipeline from the northern port of Rostock, boosting its capacity to 9 million from 6 million tonnes of oil per year, which would help the refinery.Schairer said he was confident the refinery would be able to submit an application in the second half of May to the government for a grant to finance the pipeline upgrade.",
        "For the longer term, the operators are working on making Schwedt climate neutral and have signed a contract with Siemens Energy to construct an electrolysis plant to produce hydrogen.Berlin took control of the Schwedt refinery last year in the wake of Russia's invasion of Ukraine, and put Rosneft Deutschland under a trusteeship of the German industry regulator. Russian energy group Rosneft still holds 54.17% of the refinery. (Reporting by Madeline Chambers Editing by Mark Potter)"
    ]
}