{
    "articleURL": "/tvshowbiz/article-12061009/Im-Celeb-South-Africa-Father-six-Joe-Swash-breaks-tears-missing-children.html",
    "content": [
        "I'm A Celeb South Africa's Joe Swash said he has the ITV show to thank for 'giving him everything' on Monday.",
        "The former soap star, 40, who won the competition in 2008, met his soon to be wife Stacey Solomon two years later when he presented the series' spin-off and she was crowned Queen of the Jungle.   Joe is father to daughters Belle, three months, Rose, 16 months, and Rex, two, with the Loose Women star. As well as son Harry, 15 from a previous relationship with ex Emma Sophocleous and step-father to Stacey's sons Zach, 15, and Leighton, nine.And in emotional scenes he told his camp mate that he was the 'biggest winner ever' in the series' history after he walked away with a crown as well as a gorgeous family. Joe said that would have been known simply as 'that guy off EastEnders' before quipping he is much prouder to now be 'Stacey Solomon's husband'.",
        "Earlier in the episode the actor broke down following a tense exchange with Supermodel Janice Dickinson, 68, admitting he took the disagreement to heart due to him missing his family. A tearful Joe confided in Myleene Klass, 45, and admitted his second stint on the show was much tougher due to the big family he was leaving behind in the UK.  Mum-of-three Myleene tried her best to comfort her fellow campmate telling him how proud his family would be. ",
        "Joe met Stacey when hosting I'm A Celeb Get Me Out Of Here Now in 2010 and eventually tied the knot in a lavish ceremony last year.  The show also saw Andy Whyment and Georgia Toffolo being the latest celebs to be eliminated on Monday.The Corrie star, 42, and the former Made in Chelsea cast member, 28, from the green pride lost out to yellow pride's Jordan Banjo and Myleene Klass. The group went head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair were sent home. As she left Toff said: 'It's been glorious! It has just been amazing. Doing it twice has been really immense.'",
        "Andy added: 'Thanks for having me back!', before the pair boarded their boats back to civilisation. Viewers were sad to see the pair both leave as they complained that two entertaining and strong contestants were going home. One said: 'WHY YOU ANDY AND TOFF!', while another said: 'I’m sorry but why are all the best ones going home first Shaun and now Toff.'Another said: 'Not Toff and Andy going', while a fourth said: 'Kinda don’t wanna carry on watching Toff was my fave.'",
        "A fifth said: 'toff was carrying the show can’t wait for absolutely dead content now.'Viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of the double elimination.",
        "Fans were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!'",
        "'Making us wait till Monday?!' fumed one person, while another questioned: 'What you mean NEXT TIME ???!''Literally ending it on a cliffhanger like that and we won't even find out until Monday. Nah. Livid' ranted a third.'Leaving it there and making us wait till monday..cruel' fumed a fourth person.Another angry viewer asked: 'WHAT ARE YOU PLAYING AT?!'With an additional person adding: 'Tell us what's happening as cannot wait until Monday as it will do my head in.'",
        "The four had to take part in the Gold Rush trial, in which they had to find gold nuggets buried inside identical mine shafts. The object of the game was to find the nuggets and place them on scales at entrance to the mine, with each team having to find enough nuggets to tip the scales and win a picnic for their team - with the losers going home. It was a closely fought race, with Georgia and Andy initially taking the lead while Myleene struggled to find any nuggets as Jordan ploughed ahead.But things evened up when Myleene began to find her nuggets, with the competition seriously heating up as the stars desperately fought to come out on top.",
        "I'm A Celebrity... South Africa continues on ITV1 and ITVX at 9pm on Tuesday. "
    ]
}