{
    "articleURL": "/sport/football/article-12050169/KIERAN-GILL-Man-United-CRYING-Harry-Kane-wasted-chances-Brighton-defeat.html",
    "content": [
        "Man United supporters taunted Tottenham fans with Harry Kane chants in AprilUnited will end their season against the top-nine with no wins away from homeFollow Mail Sport's dedicated LIVE blog for all the latest updates from United When Marcus Rashford breezed by Moises Caicedo, the Brighton midfielder filling in at right back, only to see Jason Steele stop his shot. When Anthony Martial broke behind the back line, only to blast his attempt straight at the goalkeeper. When Antony could have let loose with his right foot, only to remember he's all left. When Bruno Fernandes created chances, only to see them come to nothing. ",
        "As Manchester United's fans left the Amex Stadium after losing to yet another top-half team, talk turned to how different it could have been if they only had a distinguished centre forward.'If we had Harry Kane…' was a theme of those departing after losing to Alexis Mac Allister's 99th-minute penalty. It may sound obvious, rather like saying if my grandmother had wheels she would be a bike, but that does not take away the truth of it.This is a United team crying out for Kane, a figurehead at the top of the team who would not waste the opportunities that were carved out against Brighton. The 'expected goals' statistic said they should have scored at least once. They scored none.",
        "When United's fans travelled to Tottenham last week, they sang: 'Harry Kane, we'll see you in June.' They have not shied from letting the club know what they need, or their preferred choice.Nor has Erik ten Hag, saying: 'Everyone knows, it's not a secret that over the whole season we have had a shortage of No 9s. We definitely need players in the frontline who strengthen the squad.'Eight times United have played a top-nine Premier League away this season and they've won a grand total of zero of those trips, drawing once and losing seven.",
        "By the end, the Amex atmosphere was carnivalesque, celebrating a European-boosting win for the hosts.The Premier League's fourth position is still in United's hands thanks to a dwindling cushion but they are looking over their shoulders, fearful whenever they travel away to a team with a proper tactical plan.Brighton, it should not be overlooked, were exceptional. They were good before Roberto De Zerbi. Now they are even better. With Fred man-marking Mac Allister, and Fernandes following Billy Gilmour, Danny Welbeck dropped into midfield to help in build-up. Over and over, Brighton passed out from the back, beating United's press to progress up the pitch.It was amid one such passage of play that Antony lost control, lashing out in a challenge on Mac Allister after he had not won a free-kick himself. Brighton were playing piggy in the middle with their frustrated opponents, young players passing it around like old pros.",
        "Luke Shaw, whose handball led to the penalty, summed up the situation afterwards: 'The problem is, we don't score. That's happened a lot this season. It comes down to the chance at the end but the game is different if we score the chances we make.'United must now travel to West Ham, aware that Liverpool and Brighton are hot on their heels. ",
        "Their front three at the Amex consisted of a £86million winger who can only use his left foot in Antony, a striker who has lost pace through injury in Martial, and a forward who is shouldering the burden of scoring in Rashford.This was simply yet another reminder that this summer, United need someone in the shape of Kane."
    ]
}