{
    "articleURL": "/tvshowbiz/article-12057433/Lukas-Gage-husband-Chris-Appleton-Madelyn-Cline-lead-stars-Miami-Grand-Prix-bash.html",
    "content": [
        "Lukas Gage attended a promotional event for Tommy Hilfiger and GQ in Miami Beach on Saturday, where he was joined by his new husband Chris Appleton.",
        "The 27-year-old performer cut a fashionable figure at the event, which was held during the Miami Grand Prix.The White Lotus cast member, whose wedding to Appleton was officiated by Kim Kardashian, was joined by several other figures from the entertainment industry during the event, including Outer Banks star Madelyn Cline.Gage wore a white T-shirt underneath a beige jacket that was paired with matching pants.The Assassination Nation actor added a bit of extra color to his look with a pair of red-and-white sneakers.",
        "The actor was joined by his husband, Chris Appleton, who donned a dark beige jacket and matching slim-fitting pants.He also wore a bright white T-shirt that was paired with matching sneakers while posing with his spouse.Gage and Appleton posed with Madelyn Cline, who wore a leather zip-up jacket on top of a jet-black dress that showcased her toned legs.The Glass Onion actress also sported a pair of high-heeled shoes that matched the dominant color of her outfit.Her beautiful dark blonde locks cascaded onto her shoulders and gave her outfit a bit of extra color.Karrueche Tran showcased her toned midsection while wearing a light brown velour bra top that was paired with a matching maxi skirt.The actress accessorized with a sparkling necklace, and her gorgeous black hair contrasted perfectly with the lighter tones of her clothing.",
        "Madison Bailey opted for an all-denim outfit that was comprised of a light blue patterned button-up shirt and slightly loose-fitting pants.",
        "She also posed alongside Mariah Linney, who wore a tri-tone long-sleeve top, black leggings and Adidas Samba sneakers.Diplo opted for a navy blue button-up shirt jacket worn on top of a patterned yellow T-shirt and brown slacks.Hilfiger himself looked fashionable in a double-breasted jacket that was paired with slim-fitting pants.The fashion industry powerhouse also wore a bright white shirt and dual-tone Nike sneakers. "
    ]
}