{
    "articleURL": "/sport/nfl/article-12052905/Cam-Newton-says-NFL-teams-hinted-dreadlocks-affected-chances-roster-spot.html",
    "content": [
        "Cam Newton has not been in the league since the end of the 2021 NFL seasonThe former MVP has played 11 seasons in the league with the Panthers &amp; Patriots DailyMail.com provides all the latest international sports news Former MVP Cam Newton has revealed NFL franchises have suggested a clean-cut look may have been a better fit, but stopped short of admitting his customary dreadlocks have kept him out of the league.",
        "Newton, who played 11 seasons in the NFL -- 10 with Carolina -- has been a free agent since the end of the 2021 season. He has still maintained a presence on social media, appearing frequently on his own social media channels and occasionally with others, including Josina Anderson.'It's been hinted. I'm not changing,' Newton told Anderson's Undefined podcast.'People have hinted towards to say like, \"Cam, we want you to go back to the 2015 clean-cut Cam.\" But that was a different me. Right now, where I'm at, it's really embracing who I am.",
        "'And the thing that is always mentioned is, \"Cam, you scarin' people with how you look.\" And I would say, \"Yo, like I'm not gonna name names, but there's other quarterbacks that's in the league that don't look like me, but they got long hair.\" They don't scare them, do they?' Newton has often received criticism for his outlandish and individual fashion sense, usually reserved for an NBA star or Hollywood actor, as opposed to a face of an NFL franchise.'I would say look, that's not the reason I'm not in the NFL right now. Needless to say, I hope I'm not being blackballed for that but I don't think that's the situation,' Newton said. His current predicament has been a stellar fall from grace. Less than eight years ago, Newton was the most devastating force in the league, ratified by his 2015 MVP honor. ",
        "With elite quarterbacks such as Aaron Rodgers and Tom Brady playing into their late 30s and 40s respectively, it is telling that 33-year-old Newton is 18 months removed from the locker room. A combination of injuries, poor play and his undeniable star-power have led Newton to the point of now practicing tennis as he waits hopefully for a career-changing call from one of 32.'I'm a situation where I'm not getting no younger, there's guys that are cheaper than me that probably have a step up on me. It's discretionary. I'm in a good space. They can think what they want but the reality of it is, my hair is deeply rooted in my culture and the people who look like me.'Newton made headlines in March for defiantly stating 'there ain't 32 motherf****** better than me,' referring to the league's starting quarterbacks. ",
        "The former Heisman Trophy winner threw at Auburn's Pro Day last month in an attempt to show he still has enough to return to an NFL roster. He then released a video with a list of QBs he'd be willing to back up - leading to criticism and questions of entitlement. Newton revealed he had received calls from an AFC team(s) since posting the video to his YouTube channel. He would not specify which organization(s) he had spoken to. ",
        "'Yeah,' Newton said of receiving calls. 'But I think a lot of stuff was predicated on the Draft. I have spoken with some teams and it was kind of the same sentiment; \"We're going to see after the Draft.\"'It's no reason for me to go to a Los Angeles Chargers - that system doesn't compare to me. Me backing up Patrick Mahomes, that system doesn't feel well with me.'A three-time Pro Bowler, Newton played the first nine seasons of his career in Carolina after he was taken No. 1 overall in the 2011 NFL Draft.",
        "Newton was released in March 2020 by the Panthers following back-to-back injury-riddled seasons. In July of that year, he signed a one-year deal with New England, filling the void left by Tom Brady. He went 7-8 with the Pats, throwing 8 touchdowns and 10 interceptions. Newton was released by the Patriots in August 2011 and was a mid-season pickup for the struggling Panthers less than three months later. He scored two touchdowns on his first two plays, before briefly becoming the starter. Newton lost all five games in which he started prior to being cut once more at season's end."
    ]
}