{
    "articleURL": "/wires/reuters/article-12048197/Oil-settles-narrowly-mixed-smaller-ECB-hike-demand-concerns-linger.html",
    "content": [
        "By Laura Sanicola",
        "May 4 (Reuters) - Oil prices settled nearly unchanged on Thursday after the European Central Bank (ECB) decided to slow the pace of interest rate hikes, with prices still down more than 9% for the week on demand concerns in major consuming countries.Brent futures settled up 17 cents, or 0.24%, to $72.50 a barrel. U.S. West Texas Intermediate (WTI) crude settled down 4 cents, or 0.06 to $68.56.WTI in early trading on Thursday fell to a session low of $63.64 a barrel, the lowest price since December 2021.Oil prices tumbled this week after concerns about the U.S. economy and signs of weak manufacturing growth in the world's largest oil importer China, sliding further after the U.S. Federal Reserve raised interest rates on Wednesday. That capped near-term economic growth prospects.However, the Fed's signal that it may pause further interest rate increases to give officials time to assess the fallout from recent bank failures and to gain clarity on the dispute over raising the U.S. debt ceiling helped support markets.The ECB increased its three policy rates by 25 basis points, the smallest hike since the central bank starting lifting them last summer, and kept its options open on future moves as it fights stubbornly high euro zone inflation.",
        "Along with investor indigestion over central bank messaging, Wall Street stock indexes were under pressure Thursday from another rout in U.S. bank shares, which have reeled from the collapse of a third major regional bank over the weekend.\"The ability of oil to recover today despite a significantly lower stock market attests to some independent price support,\" said Jim Ritterbusch, president of Ritterbusch and Associates in Galena, Illinois.The Organization of the Petroleum Exporting Countries (OPEC) and allies including Russia, a group known as OPEC+, started voluntary output cuts at the beginning of May.Russian Deputy Prime Minister Alexander Novak said on Thursday that Russia was abiding by its voluntary pledge to cut oil output by 500,000 barrels per day (bpd) from February until the end of the year.\"What we're seeing is a combination of economic headwinds and skepticism that OPEC cuts will actually occur,\" said John Kilduff, partner at Again Capital LLC in New York. (Reporting by Laura Sanicola; Additional reporting by Rowena Edwards in London; Sudarshan Varadhan in Singapore and Stephanie Kelly in New York; Editing by Jan Harvey, Mark Potter, Alexander Smith, Paul Simao and David Gregorio)"
    ]
}