{
    "articleURL": "/health/article-12059025/Ive-got-nails-life-barely-use-hands-suffering-reaction.html",
    "content": [
        "Lisa Dewey had been getting regular gel manicures for years without problemsBut after one appointment in February, her nails started to peel away from bedsA mother-of-two has told how she can now barely use her hands after suffering a suspected allergic reaction to nail products.",
        "Lisa Dewey, from Pattishall in Northamptonshire, had got regular gel manicures for years without any issues.But following a routine appointment in February, the 36-year-old's fingers became inflamed and her nails started to peel away. One finger even turned purple, leaving her fearing that she would lose it.Mrs Dewey's doctor diagnosed her with a bacterial infection and gave her a steroid cream and antibiotics to take.However, after receiving another manicure last month, she has been left with 'very aggravated' fingers and is barely able to move her hands due to the pain.Mrs Dewey, who works as an NHS cleaner, now believes that she has an allergy to a product in gel nail polish — a growing problem highlighted by dermatologists last month.",
        "Mrs Dewey, a mother of two girls, aged three and 12, first noticed a reaction after getting gel nails in February.Despite getting the same treatment she had been having for years, within a matter of days her nails had begun peeling up from the nail bed. One even went purple, while the others became itchy and extremely sore.She never suspected her manicure could be the problem.Mrs Dewey said: 'I've been getting my nails done all my life for acrylics or gels.",
        "'So when it first happened after a set of gels in February, I thought it was a bacterial infection.'",
        "She added: 'It happened suddenly - I feared I might even lose a finger when it went purple around the nail.'I feared it might be starved of oxygen. But it ended up being something completely different.'Her doctors prescribed her a round of antibiotics for what seemed to be an infection.   After having the gels removed and taking a break from nail products, she thought it was over.But after getting a set of acrylic nails put on again in April, she had an even worse reaction.Not only did her fingernails begin to lift again, but the skin around her nails became 'like paper', leaving her unable to move her hands due to the pain.She has recently been prescribed a different round of medication to treat it.Mrs Dewey did not share what doctors believe is causing her symptoms but she believes it is an allergic reaction.The British Association of Dermatologists last month warned that medics are treating people for allergic reactions to acrylic and gel nails most weeks.It warned that poorly-trained manicurists and at home gel polish kits were to blame for the reaction, which happens when the UV light that 'cures' the polish isn't used for long enough.This can cause the chemicals in gel nail polishes, known as methacrylates, to leak into the skin and cause nails to fall off, rashes and even breathing difficulties, in severe cases. Sufferers can then have a 'life-long sensitisation' to the chemicals.",
        "Those who suffer such a reaction may be unable to undergo vital operations in the future, such as cataracts, joint replacement or dental work, which involve exposure to the same chemicals. ",
        "Mrs Dewey's hand and nail pain makes everyday tasks tough and she is constantly having to ask for help from husband Lee, 45.She said: 'Washing my daughter's hair is hard because you have to bend your fingers.'Even strapping her in the car — if I catch my finger on the belt, I jolt from the pain because the skin is raw.'It gets so aggravated but wearing gloves doesn't even help because sweaty hands aggravate it too.'Anything scented or fragranced makes it worse — I can't put a conditioning treatment or mousse in my hair.'Now Mrs Dewey has vowed to stay away from nail products for good — and is warning others about the risks.She added: 'People can get their nails done for years with no issues until one day it hits them.'I am going on holiday in August and I was booked to get my hands and toes done. Now I'm not getting them done.'This has knocked my confidence so much. I don't normally care what people think of me, but now I hide my hands away.",
        "'It's just embarrassing to have hands like this. There's a coronation party this week, and if my hands aren't better, I won't be going.'I just want to do my bit in trying to get the word out that things might not be as good as they seem.'  ",
        "The chemicals in gel nail polishes, known as methacrylates, can trigger an allergic reaction if they leak into the skin.This can see nails loosen and the skin develop a severe, itchy rash.At-home gel manicures are the most likely culprit for triggering the painful reaction but even salon nail treatments can pose a risk if the technician is poorly-trained. During gel manicures, methacrylates can enter the skin when the ultraviolet lamps — used to harden each layer of gel — are not used for long enough.It can also occur if the equipment is poorly maintained. If the gel is not sufficiently 'cured' for the correct period of time, a reaction to the chemicals may also occur on the skin around the nails. Each gel polish brand has an exact curing time which should be adhered to, often either 30 seconds, 60 seconds or 90 seconds. But experts warned that nail technicians rushing clients out of salons when the gel is not sufficiently cured can also trigger the allergic reaction. Sufferers can have a 'life-long sensitisation' to the chemicals. "
    ]
}