{
    "articleURL": "/wires/pa/article-12039393/Government-fight-fraudsters-plans-block-scams-source.html",
    "content": [
        "The Government has said it is stepping forward in the fightback against scammers, with action to block fraudulent communications at their source and allow suspect payments to be delayed.",
        "The new fraud strategy will include banning cold calls on all financial products, such as those relating to insurance or sham cryptocurrency schemes, the Government said.It also plans to work with Ofcom to use new technology to further clamp down on number “spoofing”, so fraudsters cannot impersonate legitimate UK phone numbers.Under the plans, banks will also be allowed to delay payments from being processed for longer to allow for suspect payments to be investigated.The Government said it will also ban other devices or methods commonly harnessed by scammers to reach thousands of people at once – such as so-called “sim farms” and review the use of mass texting services to keep these technologies out of the hands of criminals. Scammers ruin lives in seconds, deceiving people in the most despicable ways in order to line their pockets  Prime Minister Rishi Sunak  Sim farms are devices that can be loaded with hundreds of sim cards and are controlled from a computer. Fraudsters use them to send thousands of scam texts at once.",
        "To make it easier for victims to report fraud and rebuild confidence that cases are being dealt with properly, a new system, replacing the current Action Fraud service, the UK’s fraud reporting centre, will be up and running within the year, the Government added.",
        "Backed by a £30 million investment, it will provide a simpler route for reporting fraud online, with reduced waiting times and an online portal to allow victims to get timely updates on the progress of their case, the Government said.The improved service will also ensure victims’ reports are acted upon more effectively, it added.A new National Fraud Squad will overhaul how scams are investigated by taking a proactive, intelligence-led approach, backed by 400 new specialist investigators, the Government said.Seventy per cent of fraud in the UK either starts overseas or has an international link, the Government said, adding that it will work bilaterally to raise fraud as a key priority.Prime Minister Rishi Sunak said: “Scammers ruin lives in seconds, deceiving people in the most despicable ways in order to line their pockets.“We will take the fight to these fraudsters, wherever they try to hide. By blocking scams at the source, boosting protections for people and bolstering enforcement, we will stop more of these cold-hearted crimes from happening in the first place and make sure justice is done.”The Home Office said that while law enforcement is devolved, measures agreed with industry will have a UK-wide benefit. It said it will continue to ensure that collective issues are addressed collaboratively to maintain the UK’s resilience against fraud.",
        " It is vital we adopt a new approach to this threat  Home Secretary Suella Braverman  Home Secretary Suella Braverman said: “Fraud is a blight on our country with ruthless criminals scamming the British public out of their hard-earned cash.“They exploit people’s trust and steal their life savings, shattering their confidence and leaving them feeling vulnerable. It also fuels serious organised crime and terrorism. Meanwhile scammers are adapting, taking advantage of new technology to prey on more victims.“It is vital we adopt a new approach to this threat. The fraud strategy outlines how we will use all levers available to us – through government, law enforcement, industry and international partners – to track down these criminals, intercept their scams and bring them to justice.”A new anti-fraud champion, Anthony Browne MP, has been appointed.Mr Browne said: “The tech sector, phone companies and financial services firms must take responsibility for protecting their users by stopping fraud happening in the first place, and work together to design out fraud.“We can use the technologies fraudsters are exploiting against them to stop them in their tracks, and I will work with industry to make sure that happens.”The Government said it is working with tech companies to make it as simple as possible to report fraud online, whether it be scam adverts or bogus “celebrity endorsements”.",
        " We want fraudsters to feel the same vulnerability they inflict upon their victims, as we target their infrastructure, expose their identities and bring them to justice  Graeme Biggar, National Crime Agency  Martin Lewis, founder of MoneySavingExpert, said: “The measures being planned here are a good first step in the right direction. They should improve prevention and prosecution, but it will be slow going.“Ultimately this is all about putting enough resources in to build a dam to stop the flood. I hope we will see that happen.”Graeme Biggar, director general of the National Crime Agency, said: “We want fraudsters to feel the same vulnerability they inflict upon their victims, as we target their infrastructure, expose their identities and bring them to justice.”Commissioner Angela McLaren, from the City of London Police, said: “Tackling fraud requires a collective effort and we will continue to work with our partners across law enforcement and industry, doing everything in our power to pursue fraudsters and reduce the devastating harm they cause.”Rocio Concha, Which? director of policy and advocacy, said: “Ultimately, consumers will judge the success of this strategy by whether they end up with better fraud detection, prevention, support and redress.”Labour’s Emily Thornberry hit out at the Government plans.The shadow attorney general said: “This has been billed as a fully-integrated blueprint to tackle the entirety of Britain’s fraud crisis, yet it ignores the tens of billions being lost to fraud against businesses and the government, and relies on estimates of the cost of fraud to members of the public that are seven years out of date.”",
        "Yvette Cooper, shadow home secretary, said: “This plan is too little, too late and fails to match the scale of the problem.“All the Home Secretary has delivered is a rebadging of existing national teams, and a re-announcement on the replacement of Action Fraud from almost two years ago.”The Liberal Democrats’ home affairs spokesperson Alistair Carmichael said: “The Fraud Squad is just a drop in the ocean compared to what’s needed to protect fraud victims.”"
    ]
}