{
    "articleURL": "/news/article-12039391/Women-children-suffered-miscarriages-birth-defects-vow-heard.html",
    "content": [
        "Compensation case by 200 people who say they were harmed by Primodos drugThe hormone-based pregnancy test was withdrawn in 1978 amid safety concernsFive-day hearing began yesterday - defendants argue case should be dismissedWomen and children who claim to have suffered miscarriages and birth defects from a pregnancy test drug yesterday said they were determined ‘to be heard’ despite attempts to throw out their case.",
        "Around 200 people who say they have been harmed by Primodos are bringing the compensation case against Bayer Pharma, Schering Health Care, Aventis Pharma and the Government.The hormone-based pregnancy test was introduced in the 1950s, with up to a million women thought to have taken it before it was withdrawn in 1978 amid safety concerns. The five-day hearing began at the High Court in London yesterday with the defendants arguing the case should be dismissed without trial. They argue the claim is ‘wholly speculative’ with a lack of causal evidence meaning it has ‘no realistic prospect of success’.But Marie Lyon, 76, of the Association for Children Damaged by Hormone Pregnancy Tests, said women and children had already ‘died waiting for justice’. Her daughter Sarah was born with a partially formed arm, which she believes was the result of taking the pills. ",
        "Speaking outside court, she said: ‘We want acknowledgment and acceptance that they were able to prevent this from happening and that’s more important to us than anything – to stop it happening again.‘The second reason we want it is to get rid of guilt. Every one of our mums, including me, feel guilt that we took the tablets, that we didn’t ask and we didn’t question.‘As first-time mums, as many of us were, we never dreamed of questioning our GP. That guilt will never go away for all of us. ",
        "'The third reason we need to be heard is redress. We’ve lost three of our children in their late 40s, early 50s, who have died from the effects and that was in the last three months.‘We know that their health is deteriorating. We need to know that they have got security in the future.’The tablets worked by triggering a period if the woman was not pregnant. Schering, now owned by Bayer, has always denied any association between the drug and malformations in babies.The case continues."
    ]
}