{
    "articleURL": "/wires/reuters/article-12045385/Red-Sox-seek-sixth-straight-win-sweep-reeling-Blue-Jays.html",
    "content": [
        "What a difference a year makes for the Boston Red Sox.",
        "After going 3-16 against the American League East rival Toronto Blue Jays in 2022, the Red Sox have already matched that head-to-head win total in 2023 as they aim to complete the sweep of a four-game series on Thursday night.Boston has won a season-high five straight, gone 13-6 in its last 19 and claimed seven of its first 10 series this season.Nick Pivetta delivered six strong innings in Wednesday's 8-3 win, but the Red Sox offense has been a consistent piece to the team's success.\"We knew (Masataka) Yoshida, (Alex) Verdugo, (Justin) Turner all have a great approach and know (Rafael Devers) is going to be OK,\" Red Sox manager Alex Cora told MLB.com this week. \"The young kids -- (Jarren) Duran, (Connor) Wong, (Enmanuel) Valdez are doing a great job. (Christian) Arroyo, Rob Refsnyder, Raimel Tapia, Reese McGuire always contribute. We are solid and grind.\"Yoshida went 2-for-5 Wednesday to extend his hitting streak to 13 games, tied for the longest active run in the majors.Triston Casas is coming off a three-hit night during which he hit two game-tying singles.Righthander Brayan Bello (0-1, 6.57 ERA) takes the mound for his fourth start of the season after allowing just one run and striking out six in five innings Saturday against Cleveland.",
        "Bello was called up from Triple-A Worcester to sub for the injured Garrett Whitlock before his last start.\"I think I can do way better than I did (Saturday),\" Bello said. \"But today was a good example of how I can battle.\"Bello battled through a blister on his index finger in that start.He has issued two or fewer walks in each of his last seven starts dating back to last September.The 24-year-old's stretch of strong control included his last of three outings against Toronto on Oct. 1 of last season. He had a 7.62 ERA in 13 innings and lost two of the three games in the head-to-head series in 2022.The talented Blue Jays have dropped four straight after allowing at least 15 hits for the third time this season and being held to only six in Wednesday's loss.Daulton Varsho has homered in the last two games. Vladimir Guerrero Jr. added one of his own in his second straight multi-hit game.\"We're all trying to get hits when we're going through a bad stretch,\" Varsho said. \"One (unsuccessful at-bat) compounds over the next one. Once you're able to turn it off, it's a lot of fun being able to do it.\"The Red Sox also took advantage of four Toronto errors Wednesday in their MLB-leading 13th comeback victory out of 18 in total.",
        "\"They've been doing that for the majority of the year,\" Blue Jays skipper John Schneider said. \"And I think when you make mistakes, you pay the price.\"Righty Kevin Gausman (2-2, 2.33) looks to pitch Toronto out of its skid after pitching seven shutout innings in consecutive appearances. He has also fanned at least 11 in three of his last four outings.Gausman did not factor into the decision despite a sparkling line Saturday against Seattle. He scattered six hits, walked one and struck out 13 in seven innings in that game.\"It kind of starts with command,\" Gausman said of his recent success. \"If I can pound the zone with my fastball, then they're expecting me to throw strikes and that's why they swing at the split.\"Gausman is 7-8 with a 4.01 ERA in 26 career appearances (21 starts) against Boston, but three of those wins came last season.--Field Level Media"
    ]
}