{
    "articleURL": "/femail/article-12038001/Ultimate-snub-stars-missed-2023-Met-Gala-opted-not-attend.html",
    "content": [
        "Dubbed as the biggest night in fashion, the Met Gala took place last night in NYCBut many people who have become Met Gala staples were no-shows this yearWere they uninvited by Anna Wintour or were they busy? Here's what we knowMany of Hollywood's biggest stars stomped the red carpet at the 2023 Met Gala last night in their most glamorous and exquisite looks - and while the highly-coveted event was attended by a slew of famous faces, some of the most elite names were very-noticeably missing.",
        "Dubbed by some as the biggest night in fashion, every year on the first Monday of May, a series of A-listers gather at the Metropolitan Museum of Art in New York City for a lavish ball hosted by Vogue editor Anna Wintour. Many long for a chance to get onto the guest list of the high-profile ball, and it's been said that it's not an easy feat. According to biographer Amy Odell, 'militant' host Anna controls every aspect of the guest list, ultimately deciding who is 'in' and who is 'out.'",
        "This year, many people who have become Met Gala staples - like Kris Jenner, Justin and Hailey Bieber, Zendaya, Sarah Jessica Parker, Lady Gaga, Blake Lively and Ryan Reynolds, and Katy Perry - were no-shows at the dazzling party, leaving many to wonder if their absence was because they were axed by the famously-icy editor or because they decided not to come. Of course it's likely that some stars weren't at Met Gala due to prior commitments - however, there were many who skipped out on the celebration with wide open schedules.As the soiree comes to a close until next year, FEMAIL went ahead and launched an investigation into why some stars who usually attend the Met Gala decided not to come this year. ",
        "Were they snubbing Anna? Did she uninvite them? Or were they simply busy with another work endeavor? Here's what we know.Kris Jenner, Kourtney Kardashian, and Khloe Kardashian",
        "Kris, 67, has attended every Met Gala since 2015 - except for the one in 2017 - so when this year's kicked off and she was nowhere to seen, many were left scratching their heads. Khloe Kardashian, 38, and Kourtney Kardashian, 44 - who made their Met Gala debut last year - were also suspiciously MIA. It's unclear why the three of them didn't attend this time around, but Page Six previously reported that the Met Gala was going 'Kardashian and Jenner-free' this year - because Anna was 'cracking down on the guest list.'The report came after the editor received criticism in 2022 for inviting a slew of lower tier of celebrities, including numerous influencers and TikTok stars.",
        "However, weeks later, the publication said that sources told them Kim will indeed be attending, adding 'We also hear that the reality star won’t be the only one in her famous family to walk the steps of the Met Museum - though there’s no word on which other sibling has gotten a gilded invite.'In the end, Kim and her sisters Kylie and Kendall Jenner were the only ones from the Kardashian-Jenner clan to make an appearance at the event.",
        "So did Kris, Kourtney, and Khloe not get an invite? Unfortunately, the reason that they missed the party is not known, but it doesn't appear they had any prior engagements that would have kept them from going.Justin and Hailey Bieber",
        "Hailey, 26, has been present at every Met Gala since 2017 - until now, that is. As for her husband, Justin, 29, he attended once in 2015 and then again in 2021 with his wife. ",
        "It seems the couple, who were spotted in Los Angeles together two days before the event, were invited by made the decision to skip the event this time around.A fan shared a screenshot of an alleged DM from Hailey last month, in which she confirmed she would be 'sitting this one out' so she could 'gear up for her next Rhode launch.''I'm not going to the Met Gala this year,. Gearing up for our next Rhode launch so decided to sit this one out but will be back next year,' she promised.",
        "The model has also been open on social media about how difficult this year has been for her, which could be she opted to skip the event.She wrote on her Instagram Stories in April, 'I like to make jokes about how I feel because sometimes it’s easier than admitting I’m having a hard time. ",
        "'But truthfully, since 2023 started, I have had some of the saddest, hardest moments I’ve ever had in my adult life and my mind and emotions have been fragile to say the least. 'And I know woman other people feel the way I feel, so just know you’re not alone.'Zendaya",
        "Zendaya, 26, completely slayed when she attended Met Gala in the past - so many were excited to see what she'd wear this year.However, the actress was not present at the 2023 Met Gala - and while she didn't share any reason for her absence, it's likely that she missed this year due to her busy schedule.Euphoria customer designer Heidi Bivens confirmed that pre-production for the show is underway, which could be why she wasn't at the highly-coveted ball.The actress made her Met Gala debut in 2015, and was there in 2016, 2017, 2018, and 2019. She skipped in 2021 and 2022 because she was busy filming.She told Extra ahead of last year's Met Gala, 'Your girl's gotta work and make some movies. I'll be back eventually.'She echoed the sentiment the year before, explaining during another interview with Extra, 'My fans are very upset with me, but I will unfortunately not be able to attend because I'll be working for Euphoria. I wish I could.'",
        "Lady Gaga",
        "Lady Gaga, 37, never fails to impress with her Met Gala looks.In 2016, she wore a metallic bodysuit and sky-high platform-heeled boots, and when she walked the carpet in 2019, she wore four different dramatic ensembles.Unfortunately, the singer, who also served as the cochairman of the event in 2019, was nowhere to be found at this year's Met Gala.It's not clear why Lady Gaga was a no-show - but she did just finish filming for the upcoming Joker sequel, so she could be catching up on some much-needed rest.Blake Lively and Ryan Reynolds",
        "Blake, 35, has been attending the Met Gala on-and-off for nearly a decade, and over the last few years, she and her beau, 46, have pretty much become staples at the event. Last year, the actress went above and beyond when she wore a stunning gown that transformed colors to match the different areas of the red carpet.But they decided to skip this year, with the Gossip Girl alum confirming days earlier that she would not be in attendance.",
        "She told reporters at the grand re-opening of Tiffany &amp; Co.'s Fifth Avenue store last week that she would instead, be 'watching' from home.It seems that her absence from the event was drama-free, since she recently welcomed her fourth child with Ryan and was busy with mom duties.",
        "After the party kicked off, she shared a photo of herself pumping breast milk to Instagram, which she captioned, 'First Monday in May.' Katy Perry",
        "Katy, 38, attended the Met Gala for the first time in 2009, and since then, she's outdone herself each year with her dramatic and eye-popping ensembles.One time, she dressed up as a chandelier (followed by a burger for the after party), and on another occasion, she walked the carpet with an enormous set of angel wings.Thanks to her epic looks, fans avidly wait to see what she shows up in every time the party rolls around, but many were left disappointed this year when she too was a no-show.So why was the singer not there this year? Well, the explanation for Katy's absence is pretty simple - she was busy filming American Idol. Katy, who is a judge on the show, was present for a live taping on Monday evening, which would explain why she wasn't at the Met Gala. Sarah Jessica Parker",
        "Since Sarah first stepped on the Met Gala red carpet in 1995, she has pretty much become a regular.Aside from missing a few sporadic years due to work commitments, she's been at almost every Met Gala for more than two decades - and she always wows with her outfit choices.Unfortunately, the Sex and the City star, 58, was not at the 2023 Gala, and she has stayed tight lipped about the reason why she skipped it.Beyoncé",
        "While Beyoncé had a heavy presence at the Met Gala throughout the early 2000s and 2010s, she hasn't attended in seven years - and the last time she graced the red carpet at the event was in 2016.Even so, some hoped she'd make her grand return to the party this year, but once again, she was missing in action. As for why she was missing this time, it's been said that the singer, 41, is in the midst of preparing for her upcoming Renaissance Tour, which is set to begin on May 10 in Stockholm, Sweden. Bella Hadid",
        "Bella Hadid has been regular attendee at the Met Gala for a many years now. She was present at the last seven of them - but this year, for the first time in nearly a decade, she opted not to go.The model, 26, has not spoken out about her decision to skip the celebration this year, and it doesn't seem as though she had any prior commitments, so her absence is somewhat of a mystery.She previously gushed over how much she loves attending the even, telling Vogue in 2019, 'It's such a regal event, the Met Gala, so to be able to come here and really show off our fun side and wear things we wouldn't usually wear, it's just fun.'Madonna",
        "Another Met Gala regular who was missing this year was Madonna. The Like A Virgin songstress, 64, has attended the event more than eight times, but was MIA this time around.It's unclear why she opted not to go - however, she did have past beef with Anna.In 2014, she revealed via social media that she was told by the host that she couldn't attend because she wanted to show up in an extremely raunchy look.'What I wanted to wear to Met Ball but Anna said not this year!' she captioned a snapshot that showed the revealing outfit. 'So I'm gonna work on music instead.'The ensemble in question was a dress made only of tape, which left her assets on full display.It seems she and Anna did clear the air, however, because she was back at the Met Gala in 2016 and 2017. "
    ]
}