{
    "articleURL": "/wires/reuters/article-12056017/Fighting-Khartoum-mediators-seek-end-Sudan-conflict.html",
    "content": [
        "KHARTOUM, May 7 (Reuters) - Fighting could be heard in south Khartoum on Sunday as envoys from Sudan's warring parties were in Saudi Arabia for talks that international mediators hope will bring an end to a three-week old conflict.",
        "The U.S.-Saudi initiative is the first serious attempt to end fighting between the army and the paramilitary Rapid Support Forces (RSF) that has turned parts of the Sudanese capital Khartoum into war zones and derailed an internationally backed plan to usher in civilian rule following years of unrest and uprisings.Battles since mid-April have killed hundreds of people and wounded thousands of others, disrupted aid supplies and sent 100,000 refugees fleeing abroad.While mediators are seeking a path to peace, both sides have made it clear they would only discuss a humanitarian truce, not negotiate an end to the war.Confirming his group's attendance, RSF leader Mohamed Hamdan Dagalo, commonly known as Hemedti, said he hoped the talks would achieve their intended aim of securing safe passage for civilians.Hemedti has vowed to either capture or kill army leader Abdel Fattah al-Burhan, and there was also evidence on the ground that both sides remain unwilling to make compromises to end the bloodshed.The conflict started on April 15 following the collapse of an internationally backed plan for a transition to democracy.Burhan, a career army officer, heads a ruling council installed after the 2019 ouster of long-time autocrat Omar al-Bashir and a 2021 military coup, while Hemedti, a former militia leader who made his name in the Darfur conflict, is his deputy.",
        "Prior to the fighting, Hemedti had been taking steps like moving closer to a civilian coalition that indicated he had political plans. Burhan has blamed the war on his \"ambitions.\"Western powers have backed the transition to a civilian government in a country that sits at a strategic crossroads between Egypt, Saudi Arabia, Ethiopia and Africa's volatile Sahel region.White House national security adviser Jake Sullivan was travelling to Saudi Arabia at the weekend for talks with Saudi leaders.(Writing by Michael Georgy; Editing by Mike Harrison)"
    ]
}