{
    "articleURL": "/news/article-12057545/Bunnings-Australia-problem-Aussies-ignoring.html",
    "content": [
        "Old picture prompts flood of nostalgia for old hardware storesPeople criticise modern-day chain equivalents like BunningsDusty, wood-panelled shelves filled with every item you could need. Nails weighed by the pound and wrapped in newspaper. Knowledgeable staff clad in leather aprons with a pencil behind their ear to take your order.",
        "Memories of old Australian hardware stores have prompted a flood of nostalgia, while triggering bitter criticism of their huge, modern-day chain equivalents like Bunnings. A picture of an old hardware store, recently shared on social media, led to hundreds of users sharing their recollections of independent shops that have now mostly become a thing of the past.",
        "The photograph, believed to be taken in the Nock and Kirby store in George Street, central Sydney, shows three men standing behind a glass-fronted counter with row-upon-row of wooden shelves filled with DIY items behind them.The image of a world now all but disappeared prompted users to lament the decline of the 'one-on-one service' they offered and the knowledge their owners had. 'They had everything,' one said.Another added: 'And they knew their stock range and what product was best for the job!''I also loved visiting the hardware shop with my father. You could buy the exact quantity of what you needed. 'You want 8 wood screws you got 8 in a little paper bag, not 20 in a plastic pack that lives for 300 years in landfill.'Had one near me: An old shop run by a nearly as old lovely man. You could buy practically everything you needed. I don’t think he even knew some of the stock he had. ",
        "'It was great fun to go in and find things on the dusty shelves and all the little drawers he had It was the sort of place you’d go to find something Bunning's didn’t have.'One person recalled an old shop their father would visit in Parramatta, western Sydney.'Dad would go there to get odd things and they always had it and knew their trade - not like Bunnings where nobody knows where anything is or what's it used for,' they said.Another blamed Bunnings for the demise of traditional hardware stores.  'Bunnings basically killed all our local hardware stores along with the great service that... (they) had. 'Local hardware stores knew what they were selling unlike Bunnings (where) they can’t event point you to the right aisles,' they added.However, one user defended the retail giant. 'Bunnings staff are awesome, I remember the old places and they were rude half the time,' they wrote. Another user was more circumspect in their criticism and suggested the blame for the demise of these stores also lay with the consumer.",
        "'Well if everybody didn’t go to Bunnings all of those small shops would still be around,' they said.Mike Schneider, Bunnings Managing Director, insisted 'providing great service to customers has always been' at the core of the business.",
        "'While we know there might be times when we don’t always get it right, we have an amazing team made up of passionate experts who work really hard to ensure people have a great experience when shopping with us,' he said. 'Our team members live, work and raise families in the local communities where we operate, and we’re really proud of the way they support their customers and community.'One recalled how the older stores were more environmentally-friendly than those open today.'You want 8 wood screws you got 8 in a little paper bag, not 20 in a plastic pack that lives for 300 years in landfill,' they said. Another wrote: 'I remember a hardware store when you would buy your nails buy weight (lb) and they would wrap them in newspaper.'Trips to these stores were clearly a marked feature of people's childhoods. 'Saturday mornings shopping with Dad!', one wrote. 'Buying the vegetable seedlings for the garden wrapped up in wet newspaper. The earthy smell is unforgettable.' Last month, Bunnings was accused of 'anti-competitive' behaviour over a secret plan to buy up at least seven Mitre 10 stores. Scott Marshall, the outgoing CEO of Metcash's food division, slammed Bunnings in a recent submission to the federal parliament's select committee on the cost of living.",
        "In addition to its grocery wholesale business, Metcash owns the Mitre 10 hardware chain, with stores run by individual owners as part of a national cooperative.  Mr Marshall told the committee major businesses were trying to buy up independent Mitre 10 stores and primarily pinned the 'anti-competitive' practice on Bunnings.'Currently, Metcash is aware of Bunnings writing to at least seven Mitre 10 businesses asking them to consider entering negotiations to sell their store to Bunnings,' he said in his submission.The comments came two weeks after Daily Mail Australia  revealed that an independent Mitre 10 store in Byron Bay was closing its doors for good.Its closure makes it the latest victim of so-called big box business - after a previous report predicted that more than 6000 independent retailers were set to close by 2024 because of bigger firms like Bunnings. The GDC Advisory forecast said Bunnings, as well as Woolworths and Mitre 10, were intensifying competition and warned smaller businesses wouldn't be able to keep up. The Byron Bay store opened in 1991 and has been privately owned by James Mitchell and Lisa Mitchell since 2001.Store manager Richard Gibson wrote: 'The price of progress, have really enjoyed being part of the crew. To our customers who have been Byronites all their lives, to the newest arrivals and those just passing through. What an amazing crowd. You will be missed. Thank you all.'",
        "Andrew Terry, Professor of Business Regulation at the University of Sydney Business School, previously told Daily Mail Australia: 'When Bunnings comes to town, it's bad news for local businesses.'Mr Schneider, Bunnings' managing director, said: 'We’ve opened stores in many regions across Australia and New Zealand, and believe there’s ample room for both larger retailers and speciality providers in all the markets we operate in.'He added: 'There are a number of successful smaller businesses located close to our stores that continue to thrive almost everywhere we operate, including businesses in the home, lifestyle and DIY space.'We’re proud to be able to create jobs and support our 55,000-plus team members and their families, along with the tens of thousands of people who work alongside our team across our supplier and partner relationships.'"
    ]
}