{
    "articleURL": "/tvshowbiz/article-12053595/Leigh-Anne-Pinnock-hits-Kings-Coronation-savage-message.html",
    "content": [
        "How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Leigh-Anne Pinnock shared an anti-establishment post ahead of the King's Coronation on Friday evening.",
        "The Little Mix star, 31, took to her Instagram story to post the message which laid bare some of the feelings shared by a minority of the population about the celebrations amid the cost-of-living crisis in the UK.The message, originally posted by Munroe Bergdorf, read: 'Dear rest of the world. 'Don't be fooled by any propaganda you see coming out of the UK this weekend. The mood here is not jubilant, it is sour.'England is a fascist nightmare, where there are more food banks than branches of McDonalds.The message continued: 'We don't want pageantry, we want affordable food, and rent, and bills.",
        "'The timing of this coronation, with all its gold and bejewelled opulence, couldn't be more distasteful and sickening.'It's unjustifiable and it's unwanted. If we're asking God to save anyone it should be the 14.4million people living in poverty, not the King.'A number of celebrities were asked to perform at the Coronation including Elton John, the Spice Girls and Harry Styles.However, they could not perform due to their busy schedules- and big names including Ed Sheeran, Robbie Williams and Adele also had to decline to be involved due to their commitments.  Elsewhere, Leigh-Anne  was sure to set pulses racing on Tuesday as she flaunted her incredible figure in a skimpy black bikini.",
        "The Little Mix star wowed as she strutted her stuff in a sizzling slow-mo video which allowed her to perfectly display her toned physique in the two-piece.Ever the businesswoman, Leigh-Anne happily showed off the swimwear from her own range In A Seashell, while also displaying the brand's black beach bag.Leigh-Anne oozed confidence as she sultrily flicked her hair and twirled for the camera during a day at an idyllic beach.Accessorising her beach look, she teamed her bikini with a metallic cover-up and added gold-rimmed sunglasses and giant gold hooped earrings.",
        "It comes as Leigh-Anne's debut solo single is 'just around the corner' after she jetted to Turkey to shoot the big-budget video.The singer headed to Istanbul last weekend to shoot footage for the track, which has been described as an 'up tempo pop hit'.A source told The Sun : 'Leigh-Anne's debut is just around the corner. Her talent is undeniable and so is her work ethic.'She's locked in rehearsals now to perfect her moves and to make sure the video is everything and more for her fans.'The combination of the high energy dance routines and the dramatic scenery and buildings in Istanbul will make for a truly stunning video.'"
    ]
}