{
    "articleURL": "/health/article-12051017/New-York-woman-104-reveals-secrets-long-life-glass-BEER-dinnner-makeup.html",
    "content": [
        "Antoinette Inserra, from Staten Island, has revealed her secrets to a long lifeShe enjoys a glass of beer or vermouth every night and eats a balanced dietREAD MORE: Florida woman says dancing helped her reach 100 years old A New York woman who just celebrated her 104th birthday has revealed her secrets to a longer life — and they might surprise you.",
        "Antoinette Inserra, from Staten Island, credited her long years to putting on makeup and making sure she gets out of the house every day.She also enjoys a glass of beer or vermouth every evening and eats a balanced diet, including soft-shell crabs, pepperoni and plenty of spinach.And to keep her mind sharp, she still dedicates time to solving crosswords and word search puzzles.",
        "'I take care of myself. I do what I have to do,' she told TODAY. 'Once you take care of yourself, everything gets done.'Ms Inserra has four children, eight grandchildren and nine great-grandchildren.Her daughter Phyllis Scotto said: 'She got to see my son get married, which we didn't think she would.'She had Covid twice and she survived. And then she got to see [my son] have his first baby. ",
        "Shirley Goodman, who currently lives in Sarasota, Florida, has candidly shared her top tips on how to thrive in old age. ",
        "'So, it's been quite an accomplishment she's made. She surprises everybody.'She was born on April 21, 1919, in the Little Italy neighborhood of Lower Manhattan and was one of four sisters and five brothers, reports SIAdvance.Her father was an immigrant from Bari, southern Italy, while her mother had arrived from Trieste, in the north of the country.",
        "After graduating from eighth grade, she took a job folding laundry and then in a shoe shop before meeting her husband — Vincent Inserra — when she was 18 years old.The pair tied the knot on January 8, 1944, and settled down to start a large family.Mr Inserra died when he was 68 years old, but his wife has now made it over the centenarian milestone.Asked about how she has made it so far, Ms Inserra says he has taken life day by day and always had a positive outlook.'My daughter takes me out. I take the walker, and this is enough for me. I'm happy with that,' she said.On challenges in life, she said: 'What can you do when something happens? You just let it go, you do what you can and that's it.'I just say look nice and make nice friends. Be nice to them, and you'll have good friends. 'That's the way I look at it.'When she was asked about her diet and mentioned beer, her daughter Ms Scotto joked: 'That might be her secret! Who knows?'",
        "On her mother getting out of the house every day, Ms Scotto added: 'She's up every day ready to go out with her makeup on and her shoes.'",
        "There is a growing body of scientific evidence that avoiding loneliness can help someone live a longer and healthier life.The evidence is so compelling that this week America's top doctor Vivek Murthy declared loneliness was an epidemic and as deadly as smoking 15 cigarettes a day. ",
        "Previous research has suggested lonely people are up to 30 percent more likely to suffer heart disease. A paper published last year also suggested that loneliness ages people more quickly than smoking.Scientists say that loneliness may shorten someone's life by raising levels of inflammation in the body, causing damage to cells and vital organs.Lonely people may also go out less and get less exercise, putting them at risk of a whole host of diseases including Alzheimer's and heart problems.There is also some evidence that drinking alcohol in moderation can extend your life compared to not drinking at all.However, many of the studies behind this assertion have now been debunked with researchers pointing out that the teetotallers they included were likely people who previously had a problem relationship with drinking.There is evidence that alcohol may shorten your life. A 2019 meta-analysis published in the Lancet which included 600,000 people found that those who consumed seven to 14 drinks a week had a six-month shorter life expectancy by the age of 40 years than those who drank less often.",
        "The Centers for Disease Control and Prevention (CDC) says it is safe for women to have one alcoholic drink a day and for men to have no more than two. The oldest woman on Staten Island is Lena Vallone Barone, who in January celebrated her 108th birthday.Ms Barone says she still gets her hair and nails done every week and always enjoys a game of cards. She also gathers the family together every Sunday for pasta with freshly made sauce, sausage and meatballs. "
    ]
}