{
    "articleURL": "/tvshowbiz/article-12056559/EXC-TOWIEs-Junaid-Ahmed-targeted-homophobic-attack-swanky-London-bar.html",
    "content": [
        "Junaid Ahmed has been left 'shocked' and 'shaken up' after being targeted in a homophobic attack at a swanky London bar.",
        "The TOWIE star, 27, claimed a group of men in their 40s hurled discriminatory language towards him during a night out with his co-star Dani Imbert, 25, at The May Fair Bar on Saturday.Admitting he wanted to be swallowed up by the ground as the incident took place, Junaid revealed the revellers called him a 'gay c**t' and said they didn't want to be 'anywhere near him' due to his homosexuality.But he insisted members of staff at the glamorous hotspot couldn't have been nicer and rushed to his assistance following the verbal confrontation.The reality star exclusively told MailOnline: 'It was last night. I'm just really shaken up, to be honest. I obviously love going out in Mayfair, I'm there all the time so I'm just really shaken up.'",
        "He went on to explain how a group of men approach him and Dani after recognising them from the ITVBe show and asked for pictures.But it when when one shouted, 'Nah, I don't want him on my table... I don't want him anywhere near me,' Junaid was left feeling confused.The influencer said, 'He was shouting homophobic abuse at me and I was like, \"Oh my gosh, this is actually crazy... in the middle of May Fair Bar, I'm mortified and embarrassed.\"",
        "'He's shouting all this abuse at me and then his mates are all getting involved just hurling the most homophobic abuse at me. I couldn't believe we were in a public setting and they were doing this. I've literally never felt like I wanted the ground to swallow me up more.'After telling the group of men to leave him alone, Junaid was approached by members of staff at the bar who asked if he was okay.But by this point, he'd had enough and wanted to remove himself from the situation so left with Dani and cut the night out short. He said: 'I actually do not need to put myself in a situation like that, I don't need to be around it. I just can't believe it happened in this day and age. I just think it's awful. The world we live in is disgusting!'On how he's feeling today, Junaid confessed he's in a state of shock but doesn't think he will report the incident to the police.",
        "He said, 'Honestly, I'm just shocked because I've never ever had this. Since being in the public eye, I've never really had anything like this.'Obviously, we get trolls on social media, which is so normal but I've never, ever had this sort of abuse face-to-face with people.",
        "'I would not ever think stuff like that. Whereas like a group of grown men in their 40s being homophobic. Seriously?'But defiant Junaid is not letting the horrific experience stop him from enjoying nights out at in the future.He continued, 'I'm a very confident person. I love going out and socialising, I love doing it. So I'm not going to let anything like this stop me.'I think it's crazy. You read stuff online, stuff about homophobic attacks and homophobic abuse. I've always read stuff and thought, \"Oh no, that's just so awful.\"'But I never thought I would ever experience it myself because I'm such a social butterfly, I'm always out and about. I've never had this.'So for me it's just a bit of a shock to the system. But it is what it is. I'm not going to let it stop me. I am a party boy, I love going out and having fun. So this is definitely not gonna stop me.'I'll probably be back in The May Fair Bar in a few weeks' time!'MailOnline has contacted The May Fair Bar for comment. "
    ]
}