{
    "articleURL": "/tvshowbiz/article-12056307/MasterChefs-Andy-Allen-delivers-moving-message-Jock-Zonfrillos-family.html",
    "content": [
        "Andy Allen appeared on The Sunday Project's moving tribute to Jock Zonfrillo and revealed he had been in touch with the late chef's wife Lauren and his family.",
        "Allen, 35, told host Sarah Harris he cooked them a meal last week and they've been overwhelmed by the outpouring of love for the beloved chef who passed away on May 1 at age 46.'They're hurting, but it does help,' Allen admitted in emotionally charged interview that aired before the season premiere of MasterChef Australia. 'They've been overwhelmed with how much support there has been for him and the family... 'They just wanted me to say that they feel it. It's tough. But they feel it,' he continued.",
        "When asked about Lauren's wellbeing, Allen was candid.'She's the strongest woman I have ever known, but... she's lost her best friend,' he said. Zonfrillo and his family had recently relocated to Rome, with the MasterChef judge flying back to Melbourne solo for the show's premiere.Elsewhere during the interview, Andy revealed that Zonfrillo was eager to return to Rome and start a new life with his family.",
        "Andy went on to confess that a part of him felt guilty for not being there with Zonfrillo during his final moments. When asked about what he would miss the most about Zonfrillo, Allen said:  'Everything. I probably spend more time - in the six months that we film - with him than my wife.",
        "'I am gonna miss everything that this guy has brought into my life... He couldn't wait for Alex and I to have kids as well. He always said I was gonna be a great dad. And I just wish he was around to see that.' ",
        "Zonfrillo's long hours in the kitchen and his battles with addiction took a huge toll on his personal life, leaving him with two failed marriages and 'a deep mistrust of most people'.But his pain and torment evaporated on October 21, 2014, when he first met Lauren Fried in the bar of a waterfront hotel in Adelaide.Zonfrillo, who died on Sunday aged 46, later described their meeting as 'love at first sight'. 'I didn't believe in the concept until it happened, but there was no denying it,' he wrote in his memoir Last Shot.The pair would later marry on New Year's Day in 2017 and had children Alfie, six, and Isla, two, together. He said his family made him feel like he had won a 'gold medal'. Yet, just eight months before he met his future wife - who he fondly called Loz - Zonfrillo gave a stark assessment of how his career as a chef had impacted his personal relationships. ",
        "'Two divorces, a handful of friends because you don't have the time to spend with them, so therefore you can count your close friends on one hand, and a deep mistrust of most people,' he told the Adelaide Advertiser.",
        "'That's what you're left with at the end of the day. Is it really that glamorous after all? I don't think so.'He admitted to making mistakes in previous relationships and realising that he had been a 's*** partner to women'.'Shortly before meeting Loz, following a string of disastrous short-term relationships in Adelaide, after which I realised I was actually a fairly s*** partner to women, I'd finally put myself in therapy to try and sort myself out,' he wrote.He added: 'I found myself spilling my guts, just telling her everything I didn't want her to find out later on: the drugs, the failed marriages, my daughters Ava and Sofia, from previous marriages.'"
    ]
}