{
    "articleURL": "/tvshowbiz/article-12045145/First-look-NCIS-Sydney-filming-new-series-gets-underway-Bondi.html",
    "content": [
        "Filming is underway for the first ever international series of NCIS: Sydney.",
        "The cast and crew were spotted arriving to the set of the new series in North Bondi on Thursday.One actress wore a red shirt and black pants as she walked along the path with her hunky male co-star.The new Aussie stars were seen chatting and walking alongside one another as the camera crew filmed the scene.After filming their scene, the co-stars were seen chatting to crew as they enjoyed a break.",
        "NCIS: Sydney is set to launch in 2023 after a deal was made between Paramount Plus Australia and Network Ten.It will feature local stories with Australian actors and producers.Chief Content Officer and Executive Vice President, ViacomCBS Australia and New Zealand, Beverley McGarvey, recently said in a statement to TV Tonight: 'We are thrilled to welcome the inaugural international series of NCIS to Australian shores.''It is such a privilege to be able to continue the legacy of such a wonderful show and incorporate the superior NCIS storytelling while introducing new Australian characters and locations.''We can't wait to get production underway,' Ms McGarvey said.",
        "The announcement was made after the hit CBS show NCIS was renewed for a 19th season with star Mark Harmon returning as Leroy Jethro Gibbs.Fans just can't get enough of the drama series which is ranked as TV's most watched series and attracts an average of 12 million viewers per episode.",
        "The series may eventually edge out three shows in the Law &amp; Order franchise to become television's longest running show. The present title holder is Law &amp; Order: SVU which is going on 23 seasons.NCIS was a spin-off of CBS' JAG, both of which were created by Donald P. Bellisario, which ran for 10 seasons between 1995 and 2005.The show ended up spawning a number of CBS spin-offs itself, NCIS: Los Angeles, which debuted in 2009 and is currently in its 13th season, NCIS: New Orleans, which was canceled after seven seasons, and NCIS: Hawaii, which debuted this fall."
    ]
}