{
    "articleURL": "/wires/reuters/article-12039319/Livent-boosts-forecast-bullish-outlook-lithium-prices-demand.html",
    "content": [
        "By Ernest Scheyder",
        "May 2 (Reuters) - Lithium producer Livent Corp boosted its annual forecast on Tuesday after reporting better-than-expected quarterly profit, a bullish outlook fueled by rising prices and demand for the metal used to make electric vehicle batteries.Shares of the Philadelphia-based company, which has deals to supply the battery metal to General Motors Co, Tesla Inc and BMW, jumped more than 10% in after-hours trading to $23.15.While spot lithium prices in China had softened earlier this year, fueling concern the industry was entering a period of oversupply, Livent's results reflect strong appetite for its lithium and reinforce the company's strategy of selling the metal largely using long-term contracts.Roughly 70% of the lithium that Livent plans to sell this year is at fixed contract prices, Paul Graves, Livent's CEO, told investors on a Tuesday conference call.\"The spot market in China is not reflective of the entire market,\" he said. \"We have not reduced our lithium demand expectations for 2023.\"Livent is seeing strong appetite for its lithium outside of China, especially in Japan and South Korea, two of the world's largest cathode producers, Graves said.Additionally, Graves said he expects \"broad expansion delays and disruptions\" across the lithium industry to keep the market undersupplied, although he added Livent's expansions in Quebec are on track.",
        "\"We are absolutely not demand constrained, but we are absolutely supply constrained,\" Graves said.Livent posted first-quarter net income of $114.8 million, or 55 cents per share, compared to $53.2 million, or 28 cents per share, in the year-ago period.Excluding one-time items, Livent earned 60 cents per share. By that measure, analysts expected earnings of 39 cents per share, according to IBES data from Refinitiv.For the year, Livent boosted its revenue forecast to a range of $1.03 billion to $1.13 billion, from a previous range of $1 billion to $1.1 billion. (Reporting by Ernest Scheyder; Editing by Lisa Shumaker)"
    ]
}