{
    "articleURL": "/sport/golf/article-12039147/Tiger-Woodss-caddie-Joe-LaCava-hired-Patrick-Cantlay-getting-stars-approval.html",
    "content": [
        "Tiger Woods pulled out of The Masters last month citing plantar fasciitisAnd it's hugely unclear when he could return to the course from the injuryDailyMail.com provides all the latest international sports newsTiger Woods' caddie Joe LaCava will be working with Patrick Cantlay moving forward.",
        "Woods withdrew from The Masters last month citing plantar fasciitis, and faces a lengthy spell out after getting surgery to address arthritis 10 days later.With the uncertainty surrounding the return of the 15-time Major winner, LaCava has decided to join forces with Cantlay, the No. 4 player in the world. 'Joe called Tiger to ask him and get his approval,' Woods' longtime agent, Mark Steinberg told ESPN Tuesday. 'Of course, Tiger gave it. Tiger and Joe are like brothers, tremendous friends. You shouldn't read anything more in to that other than Joe wants to caddie. He loves it. It's his passion. He's great at it and one of the best.'",
        "Steinberg told also ESPN on Tuesday that there was 'no timeline' for Woods' return to golf, and while his procedure in April was described as 'successful,' one ex-golfer doesn't think he'll be back on the course anytime soon.Bill Mallon, now an orthopedic surgeon, used to play on the PGA Tour and explained after Woods' surgery that the legendary player could be out of action for a year. Woods underwent a 'subtalar fusion procedure to address his post-traumatic arthritis from his previous talus fracture,' a statement on his social media read, roughly two years after he suffered severe damage to his leg in a car accident.",
        "'Tiger will be in either a cast, a splint, or a boot for a period of time – its at the surgeon's discretion,' Mallon began a thread of tweets. 'He will likely get around using a rolling stroller, in which you rest your knee on a padded surface, bend your knee, and that leg will roll along.'It usually takes 6 weeks to 3 months for the fusion to take effect, and Tiger will have limited weight-bearing during that time, which again will be at the surgeon's discretion, and also depends on how the fusion is healing.",
        "'Can he play golf again? Yes, but that's at least 6 months to a year in the future. His tournaments for 2023 are likely over, and I would not be surprised to not see him play again until Augusta 2024.Speaking at Augusta before competing in this year's Masters. Woods suggested it could be his last tournament there as a competitor, while Steinberg indicated that his client's road to recovery would be taken slowly.'Tiger said repeatedly he's going to play a very limited schedule around the majors, his events, the father-son, assuming that everything goes well in the rehab and recovery,' he told ESPN. 'Joe wants to work, and so I think Tiger got that. We're just moving on.' ",
        "LaCava spent 20 years with Fred Couples and also' worked with Dustin Johnson for four years."
    ]
}