{
    "articleURL": "/wires/reuters/article-12041231/Germanys-DIHK-slashes-forecast-2023-real-exports-growth-1.html",
    "content": [
        "BERLIN, May 3 (Reuters) - The German Chamber of Commerce and Industry (DIHK) on Wednesday slashed its forecast for real growth of German exports in 2023 to 1% from a previously predicted 2.5%.",
        "The lower growth forecast was based on a survey of 5,100 German companies abroad, the DIHK said.German companies with overseas operations are more positive about the future than they were in the fall of 2022, but their outlook remains subdued, the DIHK said.Some 28% of companies expect growth in the next 12 months, while a similar proportion expect a decline in activity (27%), according to the latest AHK World Business Outlook.\"The proportion of optimists has increased by 11 percentage points compared with the previous survey and the proportion of pessimists has decreased by 20 percentage points,\" said DIHK head of foreign trade Volker Treier. \"However, expectations remain very subdued overall.\"Following three years of global crisis, a strong upswing should be expected, but a real boom isn't in sight, Treier said.In China, there is more optimism. Some 40% of German companies active in China expect a strong upswing in the next 12 months as a result of the lifting of restrictions related to the COVID-19 pandemic, while 19% expect the Chinese economy to weaken.\"Uncertainties surrounding future trade relations with China are also taking a toll on German companies there,\" Treier said.In the U.S., German companies predominantly expect a positive economic development in the current year. In Europe, by contrast, pessimism still dominates.",
        "Reasons for the subdued confidence overall included geopolitical uncertainties and a difficult financial environment due to high interest rates. A labour market shortage is becoming increasingly problematic, with 40% of companies worried about not finding qualified workers.There are also positive developments. Supply chains are stabilizing, with only 24% of companies seeing these disruptions as a risk to their business, according to the DIHK survey. Pressure from energy prices has also eased compared to the fall survey. (Reporting by Rene Wagner and Maria Martinez; Writing by Friederike Heine and Maria Martinez; Editing by Maria Sheahan, Alexandra Hudson)"
    ]
}