{
    "articleURL": "/sport/football/article-12052847/Pep-Guardiola-Kalvin-Phillips-deserves-Man-City-future.html",
    "content": [
        "Pep Guardiola has said Kalvin Phillips' Manchester City future is in his own handsThe £42million summer signing has only played eight league games, all as a subLack of playing time has prompted speculation the player and club may separatePep Guardiola has said Kalvin Phillips' Manchester City future is in his own hands.",
        "The £42million summer signing has made only eight Premier League appearances for City, all as a substitute, and will be eager to make a ninth when his former club Leeds visit the Etihad on Saturday.Phillips suffered an early setback in his City career with shoulder surgery in September, but since returning in November he has found it impossible to dislodge Rodri from the base of Guardiola's midfield, with John Stones now also stepping out of defence into a more advanced position.The England midfielder's lack of playing time has prompted speculation that the player and club might part ways this summer, but Guardiola said no decisions would be taken now.'It depends on the players,' Guardiola said. 'At the end we're here, I try to be honest with the questions and my feelings. My feelings sometimes change. But at the end it belongs to the players, they have to convince themselves and the team and not because I say something.",
        "'They have to earn my confidence. All of them, not just Kalvin, all of them how they perform. Teams change a lot and players for previous seasons who were incredibly important but this season less important. It's how they perform, many things can happen.'City continue to compete on three fronts. They can move four points clear of Arsenal at the top of the Premier League if they beat Leeds, with the first leg of their Champions League semi-final away to Real Madrid on Tuesday immediately following, and an FA Cup final against Manchester United booked for June.",
        "Guardiola said the tightness of the Premier League title race has worked against Phillips. 'I'm not complaining about Kalvin because when you don't play much it's difficult to take the rhythm,' Guardiola said.'John we're seven years together, Rodri is (four) years together. I don't have to tell them anything. Just little details - a movement here or there.'Kalvin if maybe in the past he'd played more minutes he will get that but Rodri was in exceptional form. That role is so, so important, that's why the lack of minutes makes the circle more difficult. 'But he always pays attention, in the training sessions he is always open-minded to get it.'But being behind Arsenal, we cannot drop points. We haven't had that situation of being eight, 10 points in front - in the past it happened. He can do it, but in that moment I always had the feeling Rodri knows exactly what to do in the role.'Guardiola also cited that relentless schedule when he said he had not given any thought as to whether Phillips has a long-term future at the club. 'What happens next season, I'm not concerned for one second now,' he said.",
        "'We will see at the end of the season. We'll sit with the players. Maybe they want more minutes or maybe they are not happy with the situation. But right now I'm not going to discuss anything.'",
        "City have failed to win only twice at home all season, something Guardiola put down to the 'vibe' they are enjoying in front of their fans.As they play on the day of the King's Coronation, the Catalan said he was eager to make sure that continued.'There is no time to keep something in the fridge,' he said. 'We have to give everything, it's so close. We still have one game in hand, important tough games. We saw Brighton (beat Manchester United) and we still have to go there.'We have just two games at home - Leeds and Chelsea - and we need our people. Please come at 3pm if you don't have anything better to do. There are important things in this country but anyway, if you don't have anything more then come and help us because we need it.'"
    ]
}