{
    "articleURL": "/wires/afp/article-12052707/US-border-not-open-Biden-admin-insists-ahead-rule-change.html",
    "content": [
        "The US border with Mexico will not be thrown open when Donald Trump-era restrictions change next week, the Biden administration said Friday.",
        "During a visit to the Texas frontier town of Brownsville, Homeland Security Secretary Alejandro Mayorkas said safeguards were in place to prevent a tide of migrants entering when Title 42 lapses on Thursday.The US is building legal pathways for those who qualify to reach the country safely, he told reporters -- and enforcing consequences for those who arrive at the southern border \"irregularly.\"\"The message is very clear. We are coming with the relief that our laws provide to the individuals in need. The border is not open, it has not been open and it will not be open into May 11,\" Mayorkas said.President Joe Biden's administration is under pressure from Republican Party opponents who claim that Latin Americans are already flooding over the border.They say the situation is expected to deteriorate next week when Title 42 expires.The rule was imposed early in the Covid pandemic, ostensibly to prevent infected people entering the country, and allows border guards immediately to turn people away without even accepting their asylum applications.\"May 11 is a nightmare day for the American people, particularly people in New Mexico and Texas,\" Senator Lindsey Graham said this week.\"In the next 90 days, you're going to (see) from 900,000 to 1.1 million\" migrants crossing the border, Graham predicted, adding: \"America is under siege here.\"",
        "Figures from US Customs and Border Protection show officials had 192,000 \"encounters\" with migrants at the southern border in March, the last month for which figures are available.An individual would-be migrant can have multiple encounters with officials, and the figure does not translate to the number of people attempting to cross the border.The Biden administration announced Tuesday it was mobilizing 1,500 more troops to help monitor and manage the migrant flow -- in addition to 2,500 already in place -- in anticipation of a surge of crossings Thursday."
    ]
}