{
    "articleURL": "/sport/othersports/article-12053053/Netball-denied-place-2032-Olympic-Games-Brisbane-not-MEN-play.html",
    "content": [
        "Netball Australia wants sport at the Olympics IOC is considering submissions for 2032 games Lack of players outside Commonwealth nations also a concern Netball's ambitious push to be included at the Brisbane 2032 Olympics could be denied because the sport is not inclusive enough as not enough men play it.",
        "The sport faces a significant hurdle after the International Olympic Committee (IOC) hinted at concerns over the sport's popularity beyond the Commonwealth of Nations, as well as the lack of male involvement in the game. The IOC's Agenda 2020 lists new quotas, capping the Games at 10,500 athletes and aiming for an overall 50 per cent female participation rate. While the latter should not be an issue for netball, the sport's heavily Commonwealth-based appeal will be put under scrutiny. Netball's inclusion would also be dependent on an increased commitment to the men's side of the game, which is still a relatively small niche within the sport. This may involve creating separate men's and women's divisions. However, this would require the IOC to consider whether the international competition is sufficient to stage a men's netball event, as well as whether the athlete cap will accommodate it.",
        "Netball Australia has been making strides in promoting the men's game over the past year, with various men's Tests staged as double headers alongside women's matches at both the trans-Tasman Constellation Cup and England Roses series in 2021. Various Super Netball clubs also signed official men's training partners for 2023 and are doing more to promote their profiles. Male players have often helped elite female teams prepare in their pre-season and weekly training sessions, but it has been in a silent capacity behind the scenes. ",
        "Still, this may not be enough to convince the IOC to allow netball to be included in the Olympic program.Netball's popularity has been growing worldwide, with more countries embracing the game and increasing their competitiveness. The game has seen rising interest and participation from men in some countries, notably Australia and New Zealand. This has led some observers to suggest that a mixed Fast5 event, featuring five players on each side and an adapted set of rules, could be considered. The Fast5 format is shorter, with power plays and super shots, and may help to address some of the IOC's concerns about the athlete cap.",
        "Despite these challenges, Australian captain Dylan Nexhip is optimistic about netball's chances of featuring at the Brisbane Olympics. He believes that the sport's increasing popularity, particularly among men, is a good sign. He also suggests that the IOC may be looking for more progressive sports and formats, making netball's inclusion more likely. 'Jamaica has a men's team, they've got a series lined-up with England next year, and some of the African countries also have men's teams in places like Uganda, Malawi, Kenya and South Africa,' he said.'Even in Asia, for example, we had Singapore come over and play in our Australian Men's and Mixed Netball Championships Reserve Division just last month, there are traces of it around the world.",
        "'Fiji are another one, in any country where netball is a big sport for women – particuarly the Commonwealth countries – most of them would have a men's team, it's just not public knowledge.'"
    ]
}