{
    "articleURL": "/sport/sportsnews/article-12039959/Aussie-athlete-praised-stunning-act-good-sportsmanship-shocking-mistake-race.html",
    "content": [
        "Dane Verwey competed in big Mornington raceFinished first but there was drama afterwards Has been hailed for stunning gesture Victorian athlete Dane Verwey has unselfishly handed over his winning medal and prizemoney to a fellow runner after a shocking mistake by officials in a half marathon held in Victoria last weekend.",
        "His big-hearted gesture followed a bizarre mistake by race officials late in the grueling 21km event, when the cyclist who was showing competitors the right way along the course took the leader of the race down the wrong path, paving the way for Verwey to swoop into first place late in the piece.'I was behind him - I'd say 50 metres behind, actually - and he was doing the right thing following the lead bike during the race,' Verwey explained to radio 3AW.'The bike leads us throughout showing us the right paths to go down. ",
        "'The bike took him down the wrong one late in the race and when it was discovered, he ended up running about 800 metres further than the rest of us.'Verwey, 37, went on to win the Half Marathon event at the Mornington Running Festival in a good time of 1:11.01. But, as chuffed as he was with his solid performance, the popular Victorian physiotherapist could not in good conscience keep the winner's spoils, so he sought out the runner who should have come first.'I told him, 'Not to worry, mate, I saw the bike take you the wrong way. And after doing the maths and calculating how much time you lost because of the mistake, it was clear to me that you would have hung on and won had this not happened,' he said.",
        "Those winning spoils Verwey handed over included a cheque for $500 and the victor's medal.It's not the first time Verwey's running career has launched him into a memorable moment.He laced up his shoes and competed  in the 2022 Berlin Marathon hoping for a big personal best run and not knowing at the time that the race would became the greatest marathon in history.'This was the race Eliud Kipchoge broke the world record running an unbelievable 2:01:09. I still had six kilometres to run when he crossed the line,' he recalled. Next stop for the Victorian physio will be the Brisbane Marathon in a few weeks.He boasts a best of 2:20 for the distance and is hoping to better that in Brisbane.If karma plays a role, he deserves it."
    ]
}