{
    "articleURL": "/sport/football/article-12057197/West-Ham-1-0-Manchester-United-David-Gea-HOWLER-gifts-Said-Benrahma-half-winner.html",
    "content": [
        "West Ham beat Manchester United 1-0 on Sunday night after a first half goal from Said BenrahmaThe Algerian forward took a chance from 20 yards, and David de Gea failed to make a straightforward saveDavid Moyes' side moved seven points clear of the relegation zone with the win with three games left to play The abiding memory from this encounter will be the image of David de Gea shaking his head in confusion at how he'd managed to get himself into such a mess.",
        "He wasn't the only one. Only De Gea can explain how he let Said Benrahma's shot squirm through his grasp. You'd imagine his manager Erik ten Hag will be demanding that explanation.While West Ham all but secured their Premier League status with this brilliant victory - United are in danger of relinquishing their grip on a top-four place.They are running out of steam at the wrong time, their gruelling schedule is catching up with them. What's more, Liverpool are breathing down their necks.They may find solace in the fact third-placed Newcastle also lost on Sunday. But that would be clutching at straws. Because here in east London they were - for the most part - abject, blown away by West Ham's intensity.",
        "United have won just twice in their last six; one of those via a penalty shoot-out against Brighton.Ultimately, De Gea cost them here at the London Stadium, but generally their form should be concerning Ten Hag heading into the final weeks of the season.Their Carabao Cup triumph has provided tangible success. Who knows, they may yet land a domestic cup double when they face Manchester City in the FA Cup final.But the target this season was always to qualify for the Champions League. At one stage, their return to European football's top table looked assured. Not any more.",
        "The perception of Ten Hag's largely impressive first season in charge will change if they blow it nowYet for the opening 25 minutes, there was a fluency to United's play that West Ham struggled to tame.But even in the throws of their bright opening, there were signs of the embarrassment De Gea was about to endure when he was rescued by Wout Weghorst's diligence after the goalkeeper's poorly directed pass into midfield was easily read by Declan Rice.Marcus Rashford, Bruno Fernandes and Anthony all missed decent opportunities inside the opening 10 minutes as United flew out of the blocks.",
        "West Ham United (4-2-3-1): Fabianski 7; Aguerd 7.5, Kehrer 7, Ogbonna 7.5, Cresswell 7 (Emerson 90); Rice 8, Soucek 7; Bowen 6.5, Paqueta 7.5 (Downes 90), Benrahma 7.5 (Fornals 87); Antonio 6.5 (Johnson 90). Substitutes not used: Areola; Anang, Lanzini, Cornet, IngsManager: David Moyes 8Scorer: Benrahma 27 Manchester United (4-2-3-1): De Gea 3; Wan-Bissaka 5.5 (Dalot 88), Lindelof 5.5, Shaw 6, Malacia 5.5 (Fred 88); Casemiro 6, Eriksen 6 (Sabitzer 74); Antony 5.5 (Sancho 74), Weghorst 5.5 (Martial 57, 5), Fernandes 6; Rashford 6.5. Substitutes not used: Butland; Maguire, Williams, Garnacho. Manager: Erik ten Hag 6 Booked: Malacia, Wan-BissakaReferee: Peter Bankes 6",
        "David Moyes was grateful for the returns of key trio Rice, Tomas Soucek and Nayef Aguerd - who missed the midweek loss at the Etihad through illness.",
        "Who knows if the Hammers would have managed to keep United at bay during the early stages without them.United, who also struck a post through Rashford, were in control. In complete control.But there are some things you cannot legislate for; what was to follow was one such a occasion.Perhaps Luke Shaw could have been meatier in the tackle. Maybe Aaron Wan-Bissaka could have chased harder.But this was all about De Gea's shortcomings. Benrahma's 27th minute effort should have been routinely saved; somehow the ball rolled under De Gea's hand.The United keeper is compiling a growing catalogue of aberrations.The cameras panned to Ten Hag, who looked unflinchingly into thin air. You wonder what was going through his mind.Antony's deflected effort struck the outside of Fabianski's far post as United regained their composure before De Gea finally thwarted Benrahma on the stroke of half time. If only he'd done that earlier.The Hammers were furious the Algerian's follow up effort - that appeared to strike Victor Lindelof on the arm - was not referred to VAR.Not that Moyes had too much to complain about. United, in contrast, only had themselves to blame.They'd created the openings but lacked a cutting edge. It's not the first time their efficiency in front of goal has cost them in recent weeks.",
        "No wonder Ten Hag has put a new centre-forward at the top of his summer wishlist. You wouldn't be surprised if he wants a new goalkeeper, too.",
        "De Gea was enduring a dreadful evening. West Ham had the ball in the net in the 52nd minute only for referee Peter Bankes to rule the goal out for a soft foul by Michail Antonio on De Gea.Weghorst saw his shot from the edge of the box comfortably saved by Fabianski in the 56th minute before he was replaced by Anthony Martial.But for all of United's endeavours to drag themselves level, West Ham were keeping them at arms length.Soucek rippled the side netting with an acrobatic scissor kick from Lucas Paqueta's cross as West Ham executed David Moyes' plan down to a tee.In the heat of battle, Rice was at his rambunctious best. Every blade of grass. Attentive in his own half. Expressive in the opposing.A special mention, too, for Paqueta, whose influence has grown in this West Ham team. He was excellent again last night.",
        "Soucek thought he'd headed the Hammers into a two-goal lead in the 73rd minute but the Czech midfielder had strayed into an offside position.Rashford saw a shot tipped over by Fabianski before the game was halted for a lengthy period following a sickening head collision between Soucek and Wan-Bissaka.",
        "The treatment added eight minutes of injury time onto the game. Eight further minutes of suffering for West Ham's supporters - or United's depending on how you look at it.But the anguish was worth it. Those in claret and blue erupted.Those in red - and a certain goalkeeper wearing luminous green - couldn't get off the pitch quickly enough."
    ]
}