{
    "articleURL": "/tvshowbiz/article-12040889/Lizzie-Cundy-dons-newspaper-print-minidress-celebrates-55th-birthday-Bruno-Tonioli.html",
    "content": [
        "Lizzie Cundy wowed onlookers as she celebrated her birthday with Bruno Tonioli on Tuesday night.",
        "The TV personality, who turned 55 that day, flashed her legs in a tight white minidress featuring newspaper-print designs. As she entered a restaurant, Lizzie posed up a storm for photographers while elevating her height with knee-high black boots.She wrapped up with a furry pink jacket and was later seen emerging from the swanky establishment with a giant bouquet of flowers.Britain's Got Talent judge Bruno, 67, opted for a more casual ensemble in a green jacket and jeans.",
        "He continued his look with a white T-shirt, the neck of which he clipped a pair of sunglasses onto, and suede shoes. Earlier in the day, Lizzie cut a royally chic figure as she dressed as a Queen to film a coronation special of That Was The Woke That Was on TalkTV.The former WAG looked amazing as she slipped into an elegant white gown complete with a glittering tiara and satin white opera gloves. Lizzie's gown perfectly hugged her curves and featured lace cap sleeves, with the back featuring a deep V design.Ensuring she looked her best for the double celebration, the beauty styled her brunette locks into glamorous waves while highlighting her features with a radiant palette of make-up.She looked in her element as posed away for the camera, getting into the spirit of things by waving Union Jack flags.",
        "It comes after Lizzie vowed to invite her ex-husband Jason to her next wedding.The brunette beauty was defending Queen Consort Camilla for inviting her own former spouse, Andrew Parker Bowles to the coronation of King Charles III.",
        "And while Lizzie joked she might not ascend to the throne herself, she's vowed to put retired footballer Jason, 53, on the guestlist of her second exchange of nuptials.After tying the knot in a 1994 ceremony, Lizzie and Jason enjoyed 17 years of marriage, where they welcomed sons Josh, 28, and James, 23.But having endured a bitter divorce with the former Chelsea player in 2012, the pair are now firm friends and have worked through their differences. Lizzie may be single at the moment, but when the time comes to make a lifelong commitment to her next love, she wants her ex to celebrate with them. She exclusively told MailOnline: 'So many are shocked that Queen Camilla Is inviting her first husband Andrew Parker Bowles to the coronation of King Charles.'Well I salute her for it! It shows what a great and healthy relationship with her family she has and, on this huge historic day, she wants to share it with her ex.'Many might not understand this and though I’m never likely to have a coronation, I would definitely invite my ex-husband to my wedding if I were to marry again.",
        "'People might think that is strange after we had such a bitter split and divorce but we have learnt it’s much better to be friends than enemies, especially as we share two lovely children together. ",
        "'For me, it was 17 years of good marriage, which is a success to me.'I think Camilla is incredible that she has kept friends with her ex-husband and they still have chats and cups of tea and great laughs together, despite what’s gone on in the past.'Like myself, Camilla has two wonderful children and there is nothing better than seeing the parents get on.'So for those that are pointing the finger at her and saying it’s wrong, this is what I call a healthy family. 'Well done Camilla! We could all learn a lot from her what the word family really means... Meghan take note.'"
    ]
}