{
    "articleURL": "/wires/aap/article-12044873/Reds-frontman-set-ALM-finals-return-against-Phoenix.html",
    "content": [
        "Adelaide United frontman Hiroshi Ibusuki is firming for selection for Friday night's A-League Men elimination final against Wellington Phoenix.",
        "The Japanese striker has missed the past two games because of a calf injury but is pressing for a starting role in the knockout clash at Adelaide's Coopers Stadium.\"He has put his hand up, he has trained fully this week,\" Adelaide coach Carl Veart told reporters on Thursday.\"It was always the intention to give him that two weeks off to make sure he's fresh to go tomorrow night so he's very close.\"I haven't finalised the starting 11 at this stage, I have still got a few things I need to sort out.\"The return of Ibusuki, who has scored seven goals this season, looms as a fillip for the Reds who finished third despite a late wobble.After an eye-catching unbeaten streak of 12 matches, Adelaide's past four outings resulted in two draws and two losses including a 4-1 drubbing from Central Coast last-start.\"It's just a one-off game,\" Veart said of the Mariners result.\"People will talk about last week but we finished third - the best finish we have had as a club for seven years, we have had a fantastic season.\"The Phoenix claimed sixth spot despite just one win from their past six games.And the last fixture between the clubs was a 5-1 rout to Adelaide at home on March 17 - though Wellington had the bulk of possession, more shots but suffered from wayward finishing without their star attacker Oskar Zawada, who will play in the elimination final.",
        "\"They have a very good attacking force, Zawada has scored a lot of goals this year and he was missing the last time so that's a big plus for them,\" Veart said.\"We have to make sure we don't allow them to take too much control of the game because when they control games, they're very tough to play again.\"Phoenix coach Ufuk Talay, who has chosen not to extend his contract after this season, said there was the \"quality in our team to be able to hurt\" the Reds.\"They (Adelaide) like to play in a lot of space,\" Talay told reporters on Thursday.\"They love when teams open up and chase the game.\"The boys understand how we play and what we need to do tactically.\"The Nix banked a 3-1 home win over the Reds on December 17 with their round-one encounter in Wellington ending 1-1."
    ]
}