{
    "articleURL": "/wires/reuters/article-12049989/Shares-rate-pause-bets-Apple-earnings-U-S-bank-rout-rumbles-on.html",
    "content": [
        "Stocks rise as markets eye Fed summer rate cuts",
        "Dollar set for seventh weekly decline of last eight weeksUS jobs growth expected to have slowed last month(Adds European open, updates Wall Street futures and adds extra context on U.S. non-farm payrolls expectations)By Naomi RovnickLONDON, May 5 (Reuters) - Global stocks eked out small gains on Friday as investors focused on bets of central banks pausing rate increases in light of another rout in shares of U.S. regional lenders.MSCI's broad index of global equities edged 0.2% higher following a four-day losing streak, while Europe's Stoxx 600 share index rose 0.3%.Futures contracts on Wall Street's S&amp;amp;P 500 share index added 0.4%, a day after Los Angeles-based PacWest Bancorp's said it was exploring a sale, deepening falls for U.S. regional banking stocks and increasing pressure on the Federal Reserve to end its most aggressive rate rise cycle in decades.Better than expected financial results from Apple Inc also boosted the mood on Friday, however. Futures contracts tracking Wall Street's tech heavy Nasdaq 100 rose 0.5%.Shares of U.S. regional banks have dropped 11.5% this week, following the collapse of First Republic Bank over the weekend that renewed fears of a financial sector crisis. Markets are pricing for the Fed to stand still at its next meeting in June but expect rate cuts from July.",
        "\"The U.S. banking turmoil raises hard landing risk,\" for the economy, said Emmanuel Cau, head of European equity strategy at Barclays.The Fed on Wednesday raised its funds rate by 25 basis points (bps) to a range of 5%-5.25%.\"We think further hikes are off the table,\" Cau said. But he cautioned that only \"a quick drop in inflation\" or a \"sharp weakening in growth\", would prompt the world's most influential central bank to cut borrowing costs.Later on Friday, the U.S. non-farm payrolls report for April is expected to show the slowest jobs growth in almost 2-1/2 years. Economists polled by Reuters expect to see that U.S. employers added 180,000 new workers, in the smallest gain since December 2020, with the unemployment rate edging up to a still historically low 3.6%.In government debt markets, U.S. Treasuries pared back some price gains after a strong performance all week. The yield on the two-year Treasury note &amp;lt;US2YT-RR&gt;, which tracks interest rate expectations, added 9 bps to 3.817%. The benchmark 10-year Treasury yield, which sets the tone for borrowing costs and asset pricing worldwide, was 4 bps higher at 3.39%. Bond yields move inversely to prices.Germany's 10-year bund yield, which reflects euro zone borrowing rates, rose 5 bps to 2.246% after falling for three straight sessions.",
        "The European Central Bank raised its main deposit rate for the seventh time in this cycle on Thursday, to 3.25%, but markets pared back bets of how long it would continue hiking in its fight against high inflation.Against a basket of currencies, the dollar eased 0.2%, heading for its seventh weekly decline out of the last eight weeks.Sterling was last trading at $1.262, up 0.4% on the day, while the euro firmed 0.2% to $1.1039.Spot gold was at $2,046.29 an ounce, not far from its all-time high of $2,072.49.Brent was at $73.47, up 1.4% on the day.(Reporting by Naomi Rovnick. Additional reporting by Ankur Banarjee in Singapore. Editing by Jacqueline Wong and Robert Birsel)"
    ]
}