{
    "articleURL": "/wires/pa/article-12044343/Sunak-predicts-hard-night-Tories-faces-local-elections-test.html",
    "content": [
        "Rishi Sunak has said the Conservatives are moving away from “box set drama” politics – but warned they were in for a “hard night” at the local elections, it has been reported.",
        "Voters will head to the polls across England on Thursday as Mr Sunak faces his first major electoral test since becoming Prime Minister just over six months ago.The local elections are also likely to be the final set of polls before the next general election, with the results expected to give an indication of whether Labour leader Sir Keir Starmer could be on course for No 10.The Daily Telegraph reported Mr Sunak told an Onward think tank event on Wednesday evening his administration had worked to improve the economy and move away from the “box set drama” of what went before his premiership, in what appeared to be a reference to predecessors Boris Johnson and Liz Truss. Good councillors will lose their seats because of all that has happened over the past year  Prime Minister Rishi Sunak  Mr Sunak became Prime Minister in October after Ms Truss’s fiscal measures spooked the markets and led to her downfall.She had been in Downing Street only 44 days, having taken over from Mr Johnson, who had been ousted following the partygate scandal and complaints over his handling of assault allegations against former deputy chief whip Chris Pincher.The Prime Minister, speaking on the eve of polls opening, reportedly said: “We should be prepared that tomorrow night is going to be hard for us.",
        "“Good councillors will lose their seats because of all that has happened over the past year.”He added: “I’ve only been Prime Minister for six months but I do believe we’re making good progress. Just think about where we were then and where we are now.“Our economy is in much better shape. Our politics doesn’t feel like a box set drama anymore. And our friends and our allies know that we are back.”The Tories have set expectation levels low for the local elections, with party chairman Greg Hands defending his claim that the ruling party in Westminster could lose 1,000 council seats.More than 8,000 council seats in England are up for grabs across 230 local authorities, ranging from small rural areas to some of the largest towns and cities.Polls are also taking place to choose mayors in Bedford, Leicester, Mansfield and Middlesbrough.",
        "Elections are not taking place in all parts of England this year. There are no contests in London and Birmingham, along with other areas including Cornwall, North Yorkshire and Cumbria.It is the first time new voter ID rules have applied to all of England ahead of the change coming into force for UK general elections from October.The policy means it will be compulsory for those showing up to polling stations to present photo identification to prove who they are before being handed a voting slip.",
        "Critics of the move, instigated by Conservative ministers, argue it could deter young people and ethnic minorities from voting.",
        "The Tories are trailing heavily behind Sir Keir Starmer’s Labour in opinion polling leading up the local elections.Labour is riding high, according to an Opinium survey carried out online between April 26 and 28, which indicated the red team could secure 44% of the vote share, versus the Tories’ 26% – a lead of 18 points.The poll of polls tracker kept by political website Politico said that, as of Tuesday, Labour had a slightly narrower lead of 16 points but one that was still well into double-digit territory.It is the vote share that polling experts argue is the outcome that should be the main focus for those wanting a clue as to who could win the next general election, which is widely expected to be held next year.Professor Sir John Curtice, a political academic, said Labour securing more than 10% of the projected national vote share — a method of applying the local election outcome on a national basis, as if everyone had the chance to vote — could be a marker that Sir Keir is on course for Downing Street.Sir Tony Blair had double-digit local election vote share victories in the lead-up to New Labour’s landslide in 1997, as did David Cameron’s Tories before it headed up the coalition government in 2010.",
        "Sir Keir, speaking to broadcasters on the eve of the polls opening, said his party had “a positive case to tell” and that he hoped to make electoral “progress”.In a separate statement, the Opposition leader said voters could “set Britain on a path of growth, security and the promise of a better future”.He added: “If you believe it’s time to build a better Britain you can do something simple – grab your ID, get down to your polling station and vote Labour today.”The results picture is complicated due to the Tories performing poorly in May 2019 when the same set of council seats were last up for election.Both Labour and the Conservatives fared badly, claiming 28% of the national vote each on that occasion, with then-Tory leader Theresa May — who was struggling to get her Brexit deal through Parliament — losing more than 1,300 council seats and majority political control of 44 councils.It means the Tories head into Thursday’s polls from a low baseline.University of Strathclyde academic Sir John told GB News: “Given how poor the baseline is, we should not necessarily be anticipating very large-scale Conservative losses, even if the party ends up still below the equivalent of 30%.”The Lib Dems did well as a result of voters turning away from the Tories and Labour in 2019, meaning even a strong showing for the party, which is currently polling around the 11% mark, could fail to produce a bumper crop of extra council seats.",
        "The party is hoping to make gains in liberal areas of the south of England that it has dubbed the “blue wall”.Deputy Lib Dem leader Daisy Cooper said: “Senior Conservative MPs are in for a big shock tomorrow. The Liberal Democrats are now on the cusp of causing a major political upset.”Polling stations are set to be open between 7am and 10pm.Around a quarter of the votes are expected to be counted overnight, with the rest counted during the day on Friday."
    ]
}