{
    "articleURL": "/sport/othersports/article-12044281/Transgender-professional-surfer-Sasha-Lowerson-reveals-stars-feel-accepted.html",
    "content": [
        "Transwoman Sasha Jane Lowerson is a pro surferShe got unexpected support from female surfersMs Lowerson is an ambassador for trans athletes Transgender pro surfer Sasha Jane Lowerson turned her back on surfing to find peace, but it was the women potentially most threatened by her involvement who convinced her she belonged among them.",
        "Ms Lowerson, 44, remembers facing the reality that she might never compete again when her transition began in 2020, because of the fear of 'rejection and violence' from the old guard of male surfers.As with many transgender people, transitioning wasn't about picking a lifestyle - there wasn't much choice in it, she told Daily Mail Australia.'I got to a point where I couldn't go on. I suffered a lot of mental health issues that were symptoms of my gender dysphoria... from agoraphobia to anxiety and depression, which lead to multiple attempts on my own life,' Lowerson said.'I didn't choose to live my truth, I just chose to live.'",
        "Heartbreakingly, that meant she faced quitting the sport she'd loved since primary school'Surfing was a thing that held me back from transitioning due to the old guard being so patriarchal and transphobic and homophobic,' she said.'When I started transitioning I stopped surfing for six months. I was willing to walk away from it to be truly happy. 'To think that something that gave me so much love and freedom was the thing that held me back was really horrible and hard to deal with.'But slowly she got back in the water and found only warmth, especially from an unexpected group of surfers: cis female board riders, all potentially her rivals, went out of their way to wish her well.",
        "'The current number six in the world, who I hadn't seen since before my transition, I paddled up to her and she saw me and said, \"Look at you, you look amazing\". The 2016 world champ Rachael Tilly came up and said hello, she said, \"It's so good to see you here\".'I initially had a lot of fears for my safety, but there were little things, little acts of kindness. One by one things that happened made me regain faith in humanity.",
        "'It was as simple as people coming up and saying hello and being friendly.'You have all these fears or rejection and even the threat of violence. But what I got was people reaching out and saying \"we see you\".'Two of her closest friends today are both 'rivals' on tour - Hawaiian Sierra Lerback and Aussie Roisin Carolan.Carolan says there is far more support among female surfers for Lowerson than opposition.'Most people don't care and they think, what's the fuss? If someone wants to surf, let them surf. This is an inclusive sport, plus I don't really think there's a physical advantage.'I think what's the fuss, too, but I want to support her, and loudly.'Trans women been through enough trauma and surfing shouldn't add to that.",
        "'She's really friendly to everyone, despite the fact that not everyone is friendly to her. ",
        "'She’s very outgoing and loves a giggle. She’s great.'Lowerson admits she had reservations about being interviewed, mainly because the present narrative about transgender ruining women's sport makes it inevitable that she will have to defend her involvement.'I just laugh at anyone that suggests I should justify my existence,' she said.'It's not even a discussion that's worth entertaining. I'm a woman and all trans women are women.'Why should I or anyone have to justify who they are and what they do? 'I'm just a girl next door that goes surfing and I'm good at it.'Of course surfing, like many sports, does make Ms Lowerson justify her involvement by submitting blood tests showing her hormone levels every six months.'The policy is in line with the IOC [International Olympic Committee]. I see it as one of the hoops I have to jump through to compete,' she said.'It's just where we are at, at the moment.'",
        "Lowerson is an ambassador for pro-LGBTQI organisation Athlete Ally, which has championed research showing that inclusion of transgender athletes helps women's sports instead of harming them. She is also the kind of ambassador many high-profile transgender women end up being: a role model.",
        "'I grew up without any positive role models which is which is why I didn't come out for many years.'I think it's an important to be an ambassador and role model for the next generation; you can't be what you can't see.'Getting my story out there for other young women is a big thing for me.'It's essential, she says, so describe how her life improved since she transitioned.'I wake up every day and I am happy to be here, I can plan for my life, for year ahead'Previously I dreaded the future, so I couldn't make plans. I just wanted to end it all, but today life is the polar opposite.'It's a story illustrated in a vibrant tattoo on her left forearm with a butterfly - a symbol of metamorphosis - emerging from the mind of a woman. Being an ambassador is not easy, however. While most female surfers accept her, some male surfers are less tolerant.Kelly Slater, regarded as the greatest ever surfer, believes transgender surfers should compete in a trans-only division.His friend and band-mate in The Surfers, Peter King, made a series of hostile remarks, claiming trans people are 'harming' women's sports.'Stay out of women’s sports where you miraculously win after being an average performing man. Women’s sports is not a backup plan where you can’t win a trophy,' King said. ",
        "But Lowerson believes the sport is slowly accepting transgender women.She's gained several sponsorships, including swimwear brands Atmosea and Zealous, and Holly Ryan Jewellery. She's also appeared on street billaboards in Perth for bottle store chain Liquor Barons.While she feels lucky to surf the globe on tour for three months a year, it's not all bikinis and big waves.For the rest of the time Lowerson supports herself by working as a fly-in, fly-out oil and gas worker in Western Australian mines.Because that barely covers her many surfing expenses, Ms Lowerson also started a GoFundMe page.   Ms Lowerson went on to become the first transgender surfer to compete at a global level and even picked up several wins.In May 2022 she won both the Open Women's and Open Logger divisions at the the West Coast Suspensions Longboard and Logger State Championships at Avalon, Western Australia.She was crowned the men's champion in the same competition in 2019 - competing as Ryan Egan - before transitioning a couple of years later. She was in contention for the Australian longboard title last season and eventually came fourth.She believes the idea that sportspeople transition in order to find success is 'absurd'.'Any suggestion that I would overhaul every aspect of my life and open myself up to damning criticism in order to improve my chances of winning is frankly bizarre.'"
    ]
}