{
    "articleURL": "/sport/football/article-12061027/Pep-Guardiola-way-ransack-house-enemy.html",
    "content": [
        "Pep Guardiola and Manchester City need to overcome Real Madrid's history The two European giants meet this week in Champions League semi-finals Guardiola hasn't won the Champions League since Barcelona's victory in 2011  A group of about 50 people waited on the pavement on the Calle del Padre Damian on Monday morning, seeking the shade offered by the trees.",
        "At 9.30am, the entrance to Gate 55 at the Estadio Santiago Bernabeu swung open and the group, who had paid to be on the first tour of the day, hurried into the sacred confines beyond.The staircase that led down from the spectator concourse was lined with sepia photos from the 1950s and sharper images from modern times. The first showed a team of 10 men in kits of brilliant white and a goalkeeper with a dark shirt. The face of Alfredo Di Stefano stared out from the front row.It was the Real Madrid team that had come from 2-0 down and 3-2 down to beat Reims 4-3 in the inaugural European Cup final. The inscription above them said: ‘1A Copa De Europa. Paris 13-06-1956.’The foot of the staircase opened out into a large room. Here was the piece de resistance of the Bernabeu tour. At the back of the room, in a long line, in a huge glass case, sat the 14 European Cups and Champions League trophies that Madrid have won.",
        "They looked like a line of emperors, the pride of a great lineage. Tickertape, propelled from below by jets of air, danced around them, those magnificent trophies with their famous big ears. It felt like being in the Louvre and seeing 14 Mona Lisas hanging in a row.",
        "This is what Pep Guardiola and Manchester City are up against tonight in the first leg of their Champions League semi-final. Not just the pace and the skill of Vinicius Junior, not just the timeless guile of Karim Benzema, not just the enduring class of Luka Modric and Toni Kroos. City are probably the best club team in the world this season but Guardiola knows as well as anyone that when they run out at the Bernabeu, they will be ranged against Real Madrid’s past as well as their present. They will be playing a club and their history. ‘They are the kings of the competition,’ City midfielder Rodri said at the stadium.It is even more loaded for Guardiola. He was at pains to point out that City, who are still chasing the Treble of Champions League, Premier League and FA Cup, have not returned for revenge after the heartbreak of their late defeat here in last season’s semi-finals, but this is the house of the enemy for him.A proud Catalan, a former manager of Barcelona, he has history with Madrid, too.As he sat on the dais for his press conference on Monday evening, a few yards from where those 14 trophies sit in a row, he was reminded of some of his iconic moments here.",
        "A Catalan journalist suggested the most memorable must be his Champions League semi-final first-leg victory with Barcelona here in 2011 over a Madrid team coached by Jose Mourinho. Guardiola did not allow himself to smile at the thought of that night.Lionel Messi scored both Barcelona goals that evening. Guardiola no longer has Messi but he does have Erling Haaland and his 51 goals so far. Beyond that, he would not be drawn on his struggles with a team synonymous with Spanish aristocracy.",
        "City will be playing an institution recently referred to by Barcelona president Joan Laporta as ‘the club of the regime’.If that was an attempt to smear Real Madrid with associations with Spain’s dictator General Franco, it made a wider point that Madrid are the team of the establishment.City will be playing all those forces as well as a side that has come to be defined by its success in the Champions League. There is a heatwave in Castille at the moment but sometimes it feels as if Real Madrid exists in eternal sunshine.They have won the competition five times in the last nine years alone. Carlo Ancelotti, their coach, has won it four times himself. More than any other manager. Madrid are a Champions League machine.",
        "They may be languishing in third place in the Spanish league, behind runaway leaders Barcelona, and city rivals Atletico Madrid, but it is in this competition, more than any other, that they come alive.Any other team would fear City in their current form but Madrid will not. They will expect to win over two legs. They will expect to prevail just as they prevailed against Guardiola and his team at this stage of the competition last season when they produced a miraculous stoppage-time comeback to reach the final.City did not have Haaland last season, of course, but they still have to overcome the one thing that Madrid possess that City do not. Madrid have the certainty that they can do this. They know what it takes to win this competition. It holds no fear for them any more.The opposite is true for City. The Champions League has become an obsession for them and for Guardiola, who won it twice with Barcelona but has not lifted the trophy since the year of that semi-final victory over Mourinho’s Madrid, quite a gap for a coach widely recognised as the best in the world.",
        "Madrid have won this competition 14 times. City have never won it. Its capture is all that remains to complete the Abu Dhabi project that started 15 years ago but the more often City falter close to the finishing line, the more freighted with tension their pursuit becomes.",
        "Madrid are unencumbered by such tensions.On their way back to their team hotel last night, City’s team bus passed the Plaza de Cibeles, the square where the Madrid players celebrate their greatest victories with their fans. They are preparing for another big night on June 11, the day after the Champions League final in Istanbul.It is time for City to forget history and spoil the party."
    ]
}