{
    "articleURL": "/tvshowbiz/article-12057769/Britney-Spears-autobiography-delayed-concerns-delving-list-relationships.html",
    "content": [
        "READ MORE: Spears' ex, Kevin Federline, 'gives star deadline to approve plan to move their sons to Hawaii - or he will take court action' Britney Spears' upcoming autobiography is reportedly being delayed over concerns about some of the A-list stars she mentions in it.",
        "Its publisher, Simon &amp; Schuster, has put the book on holding after receiving letters from two Hollywood stars, The Sun reported on Sunday.The 41-year-old pop superstar was previously expected to have released her tell-all book back in February, but it now isn't expected to arrive any sooner than late this year.DailyMail.com has reached out to representatives for Spears for comment.The news of the potentially salacious content follows a report that Glee and American Horror Story co-creator Ryan Murphy is interested in creating a 'tell-all show' — with Spears' approval — that would delve into her years living under a restrictive conservatorship.",
        "So far, it's unclear which famous people have contacted the publisher over the book.However, Simon &amp; Schuster is reportedly in talks with its legal team over how to proceed with the book's production.'Britney is brutally honest in the book — there are a lot of nervous A-listers,' claimed a source. 'Strongly worded legal letters have been sent to the publishers by people who know Britney and who fear what she has written.'It's unclear if the people who wrote letters to the publisher had confirmed that they were mentioned in the book, or if they took that step proactively.Regardless, the development has slowed the autobiography's momentum.",
        "'There is no movement at the moment and there are concerns over when it will eventually be able to come out,' the source added. Spears has enlisted the journalist Sam Lansky, who has previously written a memoir about his struggles with drug abuse in his teen years, along with a debut novel, Broken People, which was published in 2020.Page Six previously reported that Spears had earned a $15 million advance for her autobiography. In addition to potentially covering earlier romances, the book will be covering the trials and tribulations Spears experience under her conservatorship, which had been primarily managed by her father Jamie Spears, 70, until the arrangement was ended for good by a judge in November of 2021. ",
        "The Toxic singer is also expected to share details about her relationship and subsequent marriage to the aspiring actor Sam Asghari, 29.Fans recently expressed concern over the fate of their marriage after Spears took a trip to Hawaii without her husband last month. During the getaway she was spotted multiple times without her wedding ring on.'Britney wants this to be her moment she talks to the world, to tell her side of the story and set the record straight,' the source continued.'There’s a fair amount of throwing people under the bus, talking about past relationships, some of whom will be revealed for the first time ever.'",
        "Although the singer–songwriter has led a widely publicized life, the source added that 'there are relationships and people she had encounters with who she managed to keep under the radar, including some massive film star names and people from the music world.''She has wanted to go all out with this book and tell her truth, and that’s what has people worried,' they concluded. The latest report on Spears' delayed book came after a source told The Sun that TV superproducer Ryan Murphy was interested in creating a series about her time living under her conservatorship.Murphy, who allegedly 'hates being accused of exploiting victims,' is hoping to get Spears on board as producer, after he did the same thing with Monica Lewinsky when making Impeachment: American Crime Story, which detailed the former White House intern's relationship with former President Bill Clinton.",
        "'Ryan is openly fascinated by the Britney saga and of course, he is one of the few filmmakers in Hollywood, maybe the only one, really, with a professional relationship with Britney,' a source said. 'He knows her, he knows her world and he knows why the story of her conservatorship resonated with so many people.'But Ryan hates being accused of exploiting victims and tragedies in his shows so this becomes an incredibly delicate matter, and not something he would even consider pushing forward without Britney's full co-sign.'",
        "However, the source claimed he hasn't reached out to the singer and would only do the show if she was 'comfortable' with it."
    ]
}