{
    "articleURL": "/wires/ap/article-12060739/Warming-stoked-tides-eating-huge-holes-Greenland-glacier.html",
    "content": [
        "Daily tides stoked with increasingly warmer water ate a hole taller than the Washington Monument at the bottom of one of Greenland's major glaciers in the last couple years, accelerating the retreat of a crucial part of the glacier, a new study found.",
        "And scientists worry that the phenomenon isn't limited to this one glacier, raising questions about previous projections of melting rates on the world's vulnerable ice sheets.The rapid melt seen in this study was in the far northwest of Greenland on Petermann Glacier. If it is happening in the rest of Greenland and the even bigger Antarctic ice sheet, then global ice loss and the sea level rise could jump as much as twice as fast as previously thought, according to the study in Monday's Proceedings of the National Academy of Sciences.\"It's bad news,\" said study author Eric Rignot, a glaciologist at University of California Irvine. \"We know the current projections are too conservative. We know that they have a really hard time matching the current record'' of melt.He said this newly found consequence of tidal activity \"could potentially double the projections\" of global melt.The study looks at the all-important grounding line area of glaciers on ice sheets. That's the point where glaciers go from being on land to floating on water. Previous studies show it's also a key spot for rapid ice loss.",
        "At remote Petermann, where few people have been and there are no base camps, that grounding line zone is more than six-tenths of a mile (1 kilometer) wide and could be as much as 3.7 miles (6 kilometers) wide, the study said.",
        "Scientists used to think the daily tides weren't a big deal on melt. The snow added on top of the glacier compensated for the tides moving further in, said Rignot, the day before he left for an expedition to Petermann.But with an ocean that's warmer because of climate change the tides became \"a very powerful mechanism,\" Rignot said.\"The sea water actually goes much farther beneath the grounded ice (than previously thought), kilometers, not hundreds of meters,\" Rignot said. \"And that water is full of heat and able to melt the glaciers vigorously. And it's kind of the most sensitive part of the glacier.\"Using satellite altitude measurements, Rignot's team found a 669-foot tall (204 meters) cavity at the grounding line where the melt rate is 50% higher in the last three years than it was from 2016 to 2019. Previous models forecast zero melt there.The melting in Petermann has accelerated in the last few years, later than the rest of Greenland, probably because it is so far north that the water melting it from underneath is from the North Atlantic and it takes longer for the warmer water to reach there, Rignot theorized.Rignot this month is exploring Petermann to get more ground-based measurements using ultrasound. He hasn't been there since 2006, a decade before the changes were seen via satellite. Visiting Petermann, even before the glacier's retreat accelerated, Rignot said he noticed movements that make it seem like a living thing.",
        "\"When you are standing on that shelf or sleeping on the shelf you hear noise all the time, loud noises from deep inside cracks forming,\" Rignot said. \"That's where the concept of a glacier being alive starts getting to you.\"Greenland ice researcher Jason Box of the Geological Survey of Denmark and Greenland, who wasn't part of the research, called Rignot's technique clever and said the study makes sense, showing \"that ocean heat delivery to tidewater glacier grounding lines represents a potent destabilizing effect.\"Box, who uses a different technique to calculate how much ice is no longer being fed by glaciers and is doomed to melt, something called \"zombie ice,\" figures 434 billion metric tons of ice on Petermann is already committed to melting.The study provides strong evidence that models need to include these tidal effects deep inland and if they don't, then they are underestimating future sea level rise, said Pennsylvania State University glaciologist Richard Alley, who wasn't part of the Rignot study.___Follow AP´s climate and environment coverage at https://apnews.com/hub/climate-and-environment___Follow Seth Borenstein on Twitter at @borenbears___Associated Press climate and environmental coverage receives support from several private foundations. See more about AP´s climate initiative here. The AP is solely responsible for all content."
    ]
}