{
    "articleURL": "/news/article-12059153/EU-DELAY-dreaded-fingerprint-checks-Dover.html",
    "content": [
        "EU is planning to add a new layer of checks for entries to the Bloc in NovemberBut a new report has said that the changes could be pushed back amid concerns The European Union will delay its planned fingerprint checks at Dover over fears it would spark 'pandemonium' as people try to reach next year's Paris Olympics, according to a report.",
        "The EU had planned to bring in the checks - which would see the taking of four fingerprint scans and a photograph of new arrivals into the bloc - as part of the new entry and exit system (EES) set to begin in November.But The Guardian reports that this has now been pushed back amid fears from transport bosses that the checks could cause more chaos at border checkpoints.EU officials are now expected to discuss the plans in June, the newspaper says, with any delay coming as a welcome relief to coach operators whose passengers had to suffer through delays of up to 14 hours at Easter trying to reach Calais.Fears were growing that such checks at Dover, the Eurotunnel in Folkestone and the Eurostar terminal in London would lead to similar delays next year as people travel to and from Paris for the 2024 Olympic Games.",
        "Doug Bannister, the chief executive at the Port of Dover, told the publication that a repeat of the delays seen at Easter would be 'unacceptable'. And Anthony Marett, chair of the coach operators' association UKCOA, told The Guardian: 'Easter was a perfect storm. You had coach travel returning at a scale not seen since the pandemic. You had all of the coaches descending on one infrastructure all at the same time. The net result of it was just pandemonium.'  ",
        "Prior to Brexit, checks on passports for drivers, passengers and groups of coach tours - such as schoolchildren on school trips - were customary.However, queues have grown in recent years with the return of coach travel after the Covid-19 pandemic, combined with the post-Brexit requirement that border police 'wet stamp' passports and check that passengers are not overstaying the 90-day limit placed on British travellers entering the EU and  the Schengen area.Some coaches were taking up to an hour to process over the Easter holiday.On top of the existing checks, the EU is planning to introduce fingerprinting and facial image capture the first time they arrive on the continent under the new EES, which requires Brits travelling to the bloc to apply for a three-year travel document.After the first entry, the data gathered through the checks should then allow for quicker processing, John Keefe, the head of public affairs at Eurotunnel, told The Guardian. However, there is no room at the Eurotunnel or Dover to expand in order to create first-time registration zones, the publication noted. Each time Brits try to cross into the continent, travellers will have to show a facial image and provide four fingerprints. Personal data including first name, surname, date of birth, nationality, sex, travel documents and the three-letter country code will all be required, with only children under 12 exempt.",
        "The new rules will apply to ports, airports and other border checkpoints for travellers entering from outside the EU. Dover, the Eurotunnel and the Eurostar are likely to see the biggest queues as a result of the changes.Dover chiefs have previously said passengers without an EU passport could take as long as 10 minutes per vehicle to check, compared to the current 90-second average it takes to wave a car through.Logistics UK warned earlier this year that the new system could lead to 19-mile tailbacks in Kent and scenes of gridlock, while Mr Marett warned that if further checks are introduced, 'we think there will be quite a serious incident.'",
        "The EU has proposed the use of facial recognition to carry out checks on people who are entering again after giving their details over the first time.However, there are concerns that the technology the EU is proposing to use may not work through tinted glass, which would mean passengers inside vehicles with darkened windows would have to get out of their vehicles.There are also questions to be answered over mixed carloads - vehicles carrying people who have EU passports and non-EU passports.The Guardian reported that the EU is insisting it is still on-track to implement the new EES checks from November 2023, but cited sources saying this is not realistic."
    ]
}