{
    "articleURL": "/tvshowbiz/article-12058103/Ed-Sheeran-reveals-relies-lot-exercise-weight-check.html",
    "content": [
        "For eating disorder support, contact charity Beat on 08088010677 or visit beateatingdisorders.org.uk Ed Sheeran has shed light on his eating disorder, his reluctance to become a 'poster boy from bulimia' and detailed how he keeps his weight in check. ",
        "The Thinking Out Loud singer, 32, was interviewed on CBS Sunday Morning over the weekend during which he spoke to Seth Doane about how he stays in shape, having previously divulged that he battled bulimia in the past. He told Seth: 'I keep my weight in check now because I do a lot of exercise, but I've just always been a fat bloke', before the host uttered: 'You're not fat', leading to Ed's explanation that he be cautious in order to keep his weight down. In the wake of his bulimia reveal, he added: 'I just don't want it to turn into, like, the poster boy for [bulimia], you know? I think what is important about speaking about it is letting people know that it is not a problem that is just for one gender.'He first spoke about his body struggles in Rolling Stones' March issue, as he revealed comparing himself to other pop stars led to his body battles. ",
        "Speaking to Seth following his protestation about being fat, Ed explained: Well, I know [I'm not fat], because I keep it in check... I did, like, an hour-and-a-half worth of exercise this morning. And I'll be on stage for another two hours today...'Like, I watch what I eat and I exercise a lot and I try to not binge as much.'",
        "In the Rolling Stones interview in March, the embattled singer shared that he began struggling with his body image after collaborating with the likes of Shawn Mendes and Justin Bieber, as they both have 'fantastic figures'.He admitted to feeling 'mad uncomfortable' talking about his struggles, but explained how he began 'gorging' on food before vomiting it back up again.'I just don't want it to turn into, like, the poster boy for it, you know?,' he told CBS Sunday Morning. 'I think what is important about speaking about it is letting people know that it is not a problem that is just for one gender.'",
        "Aside from image, Ed also spoke about his recent headline-hitting copyright case in the interview, which was filmed before his victory last week.In the trial, which made news around the world, the estate and heirs of the late producer Ed Townsend, who co-wrote Let's Get It On with Marvin Gaye, sued Sheeran in 2018 accusing him of copying parts of the song in Thinking Out Loud. Ed said: 'I just think it comes with the territory,' while noting that his off-camera publicist Glenn was getting nervous about him discussing the case.He continued: 'There's, like, four chords that get used in pop songs...'And if you just think mathematically, the likelihood of this song having the same chords as this song? There's multiple, multiple songs. It's all the same four chords – some of them are like A, B, C...'",
        "During the interview he then addressed his off-camera publicist, saying: 'Dude, I'm a musician. I can f***ing speak about this.' ",
        "He explained that such copyright lawsuits were not going to stop because 'it's a big money business to take things to court': 'But like, you can only get caught out if you've done something wrong. And I'm not...'I have not done something wrong. I used four chorjds that are very common chords to use,' Sheeran declared.Seth then asked: 'Are you cool?,' to which Ed said: 'Yeah. Yeah. It just, it riles me up, man,' admitted Sheeran, who also talked about his new fifth studio album 'Subtract'.A jury in New York City on Thursday in a trial verdict found that Sheeran did not steal key components from the 1970s song to create his hit song Thinking Out Loud.Ed briefly dropped his face into his hands in relief before standing to hug his attorney, Ilene Farkas. As jurors left the courtroom in front of him, Sheeran smiled.",
        "He nodded his head at several of them, and mouthed the words: 'Thank you.' Later, he posed for a hallway photograph with a juror who lingered behind.He also approached plaintiff Kathryn Townsend Griffin, the daughter of Townsend, who co-created the 1973 soul classic with Gaye and had testified. They spoke about 10 minutes, hugging and smiling and, at one point, clasping their hands together.",
        "Ed later addressed reporters outside the courthouse, revisiting his claim made during the trial that he would consider quitting songwriting if he lost the case.He said in a prepared statement: 'I am obviously very happy with the outcome of this case, and it looks like I'm not going to have to retire from my day job, after all...'But at the same time, I am unbelievably frustrated that baseless claims like this are allowed to go to court at all.",
        "He also said he missed his grandmother's funeral in Ireland because of the trial, and that he 'will never get that time back.'The verdict capped a two-week trial that featured a courtroom performance by Sheeran as the singer insisted, sometimes angrily, that the trial was a threat to all musicians who create their own music.A year ago, Sheeran won a U.K. copyright battle over his 2017 hit 'Shape of You' and then decried what he labeled a 'culture' of baseless lawsuits that force settlements from artists eager to avoid a trial's expense.Outside court, Sheeran said he doesn't want to be taken advantage of. 'I am just a guy with a guitar who loves writing music for people to enjoy,' he said. 'I am not and will never allow myself to be a piggy bank for anyone to shake.'",
        "Thinking Out Loud was released in 2014 and won a Grammy Award for Song of the Year"
    ]
}