{
    "articleURL": "/news/article-12054209/Inside-home-serial-killer-pedophile-Victims-Jesse-McFadden-given-access-house.html",
    "content": [
        "New video shows drugs, restraints and sex toys inside Jesse McFadden's homeSeven people, including sex offender McFadden, were found dead on MondayFamilies of victims were let in the home where disturbing evidence was foundDisturbing new video footage has revealed drugs, restraints and sex toys at the home of pedophile Jesse McFadden where he shot and killed his wife, her three teenage children and their two teenage friends.",
        "Fadden, 39, was a convicted sex offender and rapist who was about to stand trial on Monday when he carried out the killings before turning the gun on himself.Families of the two teenaged victims were allowed on the property where they witnessed a horrific scene. A dog collar, handcuffs, drug paraphernalia, and weapons were strewn across the laundry room. The house was littered with syringes filled with unknown substances and as seen in the video footage filmed by KFOR.Holly Guess, 35, who was married to McFadden, and her three children, Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13, were all found slain on the property of McFadden's rural Oklahoma home. Ivy Webster, 14, and Brittany Brewer, 16, who had visited the home for a sleepover, who were also found dead at the house. ",
        "When KFOR arrived at the house, along with the victims' families and a sheriff's investigator, they found multiple beds with restraints, the chains still attached. Sex and bondages devices were scattered in various rooms and there was a shelf lined with witchcraft-related books.There was also a slew of evidence, including computers, cell phones and dirty bed sheets. One of the families found their daughter's cell phone, among other cell phones. Two laptops were also found with them. ",
        "'My daughter was locked up here! Right here!' Ivy Webster’s dad, Justin, told the investigator, who collected it as evidence. 'That's what I just don't get. I know you guys are hurting too and I know you have a hell of a job too. You saw. You saw my daughter dead, shot in the head and I know what you're seeing and I know what you went through, but a lot of this stuff needs to be taken. You guys have to come back out here and do a whole 'nother sweep because you missed so much. There's medicine. There's drugs. Brand new locks that he put in and brand new f*****g key and lock on the counter. Why are we not getting receipts and video out of him purchasing this sh*t' Justin said to the Investigator. The investigator continued the evidence clean out, but Justin told KFOR that when he returned to the property, he found more Justin said he found a receipt for the padlocks attached to the restraints that showed McFadden purchased them a couple days before the murder-suicide.He also found a bloody wet wipe, five more phones and more drug paraphernalia in the closet.When he called police, they told him to leave the property.  The Webster family has called on the Federal Bureau of Investigation (FBI) to get involved.",
        "A spokesperson for the OSBI said their investigators would take direction as to what needed to be collected from the Okmulgee Police Department.In a statement from OSBI to KFOR Thursday afternoon, they said, 'The OSBI will continue to support and assist our law enforcement partners and grieve with the families of this horrible event. The investigation is still ongoing.'Ivy Webster's parents earlier revealed that McFadden texted them pretending to be her while she lay dead next to her friend and four others on Monday.  While details from police have been scant, grieving relatives are trying to piece together the horror started that began with two teenagers being reported missing.Officials had issued an amber alert for Ivy and Brittany - who were reportedly seen travelling with McFadden, 39, after vanishing - but it was called off when the bodies were discovered later the same day at the home near Henryetta, a town of about 6,000 about 90 miles (145 kilometers) east of Oklahoma City.Janette Mayo, 59, said the Okmulgee County Sheriff's Office notified her late on Monday that the other four victims were her daughter, Holly Guess, 35, and her grandchildren, Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13. ",
        "Mayo was told her daughter and grandchildren were all found shot dead in various locations on McFadden's property but the Oklahoma State Bureau Investigation, which is assisting in the investigation, have not confirmed this. ",
        "Meanwhile Ivy's father, Justin Webster, said all of the victims suffered gunshot wounds and that some had been lined up and were located across the property. In an emotional interview this morning, Ivy's parents suggested that McFadden had impersonated their daughter over text after killing her.Ivy's mother Ashleigh Webster explained how she had been speaking to her daughter on Snapchat late on Saturday night but when she received a message from her the next morning, something didn't feel right.'I got a message the next morning, Sunday morning that was her phone but I don't believe it was from her anymore saying that they were going to McAlester and she would be home later,' she told NewsNation.Webster added: 'We think Jesse wrote that and probably had already happened at that point.'Speaking about why they had concerns, Ms Webster added: 'The way Ivy is, she's my best friend, she's constantly 'Mum I love you, ok mum we're going to eat, ok mum we're done eating we're going to go do this now'. She lets me know everything.'This message was kind of 'ok we're going to McAlester, I'll see you around 5.'It was just different but I also didn't think anything of it because they were maybe in a hurry.'",
        "Officials discovered seven bodies on the property around 3pm at 14600 Holly Road in the rural town of Henryetta, Interim PIO Gerald Davidson Oklahoma State Bureau of Investigations told DailyMail.com.The Oklahoma Department of Corrections prison records show McFadden was convicted of first-degree rape in 2003 and released in October 2020, the news outlet said.",
        "McFadden had been scheduled to appear in court Monday for the start of a jury trial on charges of soliciting sexual conduct with a minor and possession of child pornography. Court records show he was communicating with a then-16-year-old girl using a contraband cellphone while he was incarcerated at a state prison near Muskogee. The teen's grandfather reported their communications to prison officials, according to an affidavit from a Department of Corrections investigator. ",
        "The Websters, who moved to the area two years ago, revealed that they were completely unaware of McFadden's past, adding: 'We had a read on him that he was a little weird but we felt comfortable  especially knowing several of our daughters' friends would go over there all the time and hang out.'Tiffany would come over here to our house  and stay here on the weekends and we never suspected any kind of maliciousness.'Brittany's father Nathan, who called his daughter his 'right hand side kick' also said that his daughter had spent the weekend with the McFadden's family several times before.",
        "He told News On 6 that his daughter was selected to be Miss Henryetta at the [National American Miss pageant] in Tulsa and represent her town this summer. 'And now she ain't gonna make it because she's dead, she's gone,' the grief-stricken father said.He said during a vigil on Monday that his daughter had dreams of becoming a veterinarian or a teacher.He added: 'It's just a parent's worst nightmare, and I'm living it. I am just lost.' The grim discovery in Oklahoma keeps the U.S. on a torrid pace for mass killings in 2023 and could push the number of people slain in mass killings past 100 for the year, according to a database maintained by The Associated Press and USA Today in a partnership with Northeastern University.  "
    ]
}