{
    "articleURL": "/wires/reuters/article-12042607/U-S-state-abortion-legislation-watch-2023.html",
    "content": [
        "By Gabriella Borter and Sharon Bernstein",
        "May 3 (Reuters) - State legislatures are wrestling with how much to restrict or expand abortion access after the U.S. Supreme Court overturned Roe v. Wade last year.Here is a snapshot of pending and passed legislation seeking to restrict or protect access in 2023, including details on a law that took effect in North Dakota this week broadly banning abortion and the defeat of abortion ban bills in South Carolina and Nebraska.RESTRICTIONSFLORIDA: Florida Governor Ron DeSantis signed a six-week abortion ban this month, which includes exceptions for rape, incest, human trafficking and the life and health of the mother. It cannot take effect until the state Supreme Court rules on the constitutionality of the 15-week ban that is currently in place.IDAHO: Idaho Governor Brad Little signed a bill this month that makes it illegal to help a minor cross state lines to get an abortion without the permission of a parent or guardian. Offenders would face two to five years in prison. The Republican-led state is currently enforcing a near-total abortion ban, with exceptions for rape, incest or the life of the mother.MONTANA:The Republican-led legislature has passed a bill seeking to overturn a 1999 state Supreme Court ruling that found that the state constitution protected a right to abortion. That ruling has prevented lawmakers in the conservative state from restricting abortion further than the current 24-week limit. The bill awaits Republican Governor Greg Gianforte's signature.",
        "The full legislature has also passed a bill that would ban most second trimester abortions by prohibiting a common surgical procedure. If signed by the governor, it would take effect immediately. Planned Parenthood has sued to block the measure.NEBRASKA: Lawmakers in Nebraska's 50-seat unicameral legislature failed to pass a six-week abortion ban on Thursday, after the chamber did not amass enough votes to end debate on the bill. Much of the debate centered on one member's proposed amendment to allow abortions up to 12 weeks. Abortion is currently legal in the state up to 22 weeks.NORTH CAROLINA: Republican lawmakers have introduced a bill to limit most abortions to the first 12 weeks of pregnancy, with exceptions for rape, incest, life-limiting fetal anomalies and the life of the mother. Abortion is currently legal up to 20 weeks. If it passes the legislature, the Democratic governor's power to block the bill would be limited because Republicans now hold a large enough majority in both houses of the legislature to override his veto.NORTH DAKOTA: North Dakota Governor Doug Burgum on Monday signed a bill that bans abortion with exceptions for cases where the mother's life or health are at serious risk. The law, which took immediate effect, also makes exceptions for rape and incest victims, but only during the first six weeks of pregnancy.",
        "The measure passed despite the state Supreme Court's decision last month not to revive a previous version of the near-total ban, after finding that the state constitution protects abortion rights in some cases.SOUTH CAROLINA:The Republican-led House of Representatives is considering a six-week abortion ban that the Senate has passed, despite the fact that the state Supreme Court recently struck down a six-week abortion ban in a 3-2 vote.The Senate tabled discussion of a near-total abortion ban on Thursday after it had been approved by the House. The chamber voted to delay considering the bill until the next legislative session in January 2024, after a two-day filibuster by the five women senators who felt it was too severe.TEXAS: While abortion is completely banned with very limited exceptions in Texas, Republican state representatives have introduced legislation that would compel internet providers to block websites that supply abortion pills or provide information on how to obtain an abortion.UTAH: Republican Governor Spencer Cox in March signed legislation to prohibit the licensing of abortion clinics, which abortion rights advocates say would effectively eliminate access in the state. Abortion is currently banned after 18 weeks in Utah.WYOMING: The Republican-led state legislature passed a bill in March banning the use or prescription of medication abortion pills, and Republican Governor Mark Gordon signed it into law. It is due to take effect July 1. Abortion is currently legal until viability, about 24 weeks, while a state court is reviewing a challenge to a near-total \"trigger\" ban, which was took effect when Roe v. Wade was overturned.",
        "PROTECTIONSCALIFORNIA: A Democratic state senator has introduced a bill to protect doctors who prescribe medication abortion pills to patients in other states.MICHIGAN: Democratic Governor Gretchen Whitmer signed legislation this month repealing a 1931 bill that criminalized abortion.ILLINOIS: Democratic Governor J.B. Pritzker in January signed a law protecting abortion providers and out-of-state patients from legal attacks waged by other states.MINNESOTA: Democratic Governor Tim Walz in January signed legislation passed by the Minnesota legislature's new Democratic majority that codifies abortion rights in state law, as well as a right to contraception and fertility treatment. The Democratic-led House passed a bill to shield abortion providers and patients from other states' legal attacks, and the Senate is considering it.OHIO: Abortion rights supporters are trying to collect enough signatures to put a constitutional amendment on the November 2023 ballot that would assert a right to abortion. Abortion is currently legal up to 22 weeks.(Reporting by Gabriella Borter in Washington and Sharon Bernstein in Sacramento, California; Editing by Colleen Jenkins, Matthew Lewis, Aurora Ellis, Jonathan Oatis and Sharon Singleton)"
    ]
}