{
    "articleURL": "/wires/ap/article-12052677/Houston-area-Shell-chemical-plant-catches-fire.html",
    "content": [
        "HOUSTON (AP) - Fire erupted at a petrochemical plant in the Houston area Friday, sending nine workers to a hospital and causing a huge plume of smoke visible for miles.",
        "Emergency responders were called to help around 3 p.m. at the Shell facility in Deer Park, a suburb east of Houston. The city of Deer Park said in an advisory that there was no shelter-in-place order for residents.Harris County Sheriff Ed Gonzalez said earlier in the day that five contracted employees were hospitalized for precautionary reasons, adding that they were not burned. He said they were taken to a hospital due to heat exhaustion and proximity to the fire.Shell Deer Park officials said on Twitter Friday night that they were continuing to respond to the fire, all workers were accounted for and nine workers had been released after undergoing precautionary medical evaluations.Nothing exploded, Gonzalez said, although the sheriff's office initially responded to emergency calls saying there was an explosion.As of Friday evening, the fire was still burning but had died down and was contained, Gonzalez said.",
        "The cause of the blaze was still being investigated. The fire started while the olefins unit was undergoing routine maintenance. Air monitoring for any impact from the fire was ongoing, and had not detected any harmful levels of chemicals, Shell Deer Park said.\"There is no danger to the nearby community,\" the post said.The fire started at about 2:56 p.m. in the facility's olefins unit. The product that ignited includes cracked heavy gas oil, cracked light gas oil and gasoline, Shell Deer Park said.",
        "\"The cause of the fire will be the subject of a future investigation, and our immediate priorities remain the safety of people and the environment,\" facility officials said.Shell was conducting its own air quality monitoring, but the city has yet to receive an update, said Kaitlyn Bluejacket, a spokesperson for Deer Park.The city was advised by Shell that there was no need at the time to shelter in place, but that the city would update residents if that changed, Bluejacket said.Fire crews from the Deer Park facility and nearby plants responded.Wind conditions were favorable for fighting the blaze, although temperatures soared to near 90 degrees Fahrenheit (32.2 degrees Celsius) in the Houston area, but high humidity made it feeler hotter than 100 degrees Fahrenheit (37.8 degrees Celsius.)Harris County Fire Marshal Captain James Singleton said his office would be in Deer Park through the weekend investigating.\"You´re looking at a large number of people that need to be interviewed,\" Singleton said. \"Everyone who was at the unit at the time of the fire, the controllers, management, anybody that called 911.\"Houston meteorologists said the smoke plumes were visible from space via satellite.Facility fires are not uncommon in the area, with the strong presence of the petrochemical industry. In March, an explosion and a fire erupted at a facility owned by INEOS Phenol in nearby Pasadena, Texas, leaving one injured.",
        "A fire in 2019 at a facility owned by Intercontinental Terminals Company burned for days and though it caused no injuries, it triggered air quality warnings.___Coronado reported from Austin, Texas. AP writer Lisa Baumann reported from Bellingham, Washington."
    ]
}