{
    "articleURL": "/wires/ap/article-12043259/Police-Multiple-injured-shooting-inside-Atlanta-building.html",
    "content": [
        "ATLANTA (AP) - Police arrested a man accused of opening fire inside the waiting room of an Atlanta medical practice Wednesday, killing one woman and wounding four. Workers and others in a bustling commercial district took shelter for hours during the manhunt.",
        "Authorities swarmed the city´s midtown neighborhood shortly after noon in search of the shooter. Police said in a statement that the suspect, whom they identified as 24-year-old Deion Patterson, was captured in Cobb County, just northwest of Atlanta.Atlanta Police Deputy Chief Charles Hampton Jr. declined to discuss any details of the investigation or a possible motive, saying, \"Why he did what he did, all of that is still under investigation.\"Patterson had an appointment at a Northside Medical building and opened fire shortly after arriving in an attack that lasted about two minutes, law enforcement officials said at a news conference Wednesday night. Patterson then went to a Shell gas station and took a pickup truck that had been left running and unattended, authorities said.News of the shooting prompted workers and lunchgoers in the neighborhood, which is filled with office towers and high-rise apartments, to shelter in place for hours.A woman was pronounced dead at the scene of the shooting, Atlanta Police Chief Darin Schierbaum said. She was later identified as Amy St. Pierre, 38, of Atlanta.",
        "The four wounded women - aged 25, 39, 56 and 71 - remained in critical but stable condition Wednesday night, according to Hampton, the deputy chief. Their names were not immediately released.",
        "The shooting comes as cities around the U.S. have been wracked by gun violence and mass shootings in 2023.Patterson's mother, Minyone Patterson, who police said had accompanied her son to the medical office, told The Associated Press by phone that her son, a former Coast Guardsman, had \"some mental instability going on\" from medication that he began taking on Friday.She said her son had wanted Ativan to deal with anxiety and depression but that the Veterans Affairs health system wouldn't give it to him because they said it would be \"too addicting.\" She´s a nurse and said she told them he would only have taken the proper dosage.\"Those families, those families,\" she said, starting to sob. \"They´re hurting because they wouldn´t give my son his damn Ativan. Those families lost their loved ones because he had a mental break because they wouldn´t listen to me.\"She ended the call without saying what medication her son had been taking.\"We are horrified and saddened to hear of the active shooter situation in Atlanta today,\" Veterans Affairs Press Secretary Terrence Hayes said in an emailed statement. \"Due to patient privacy, we cannot discuss the Veteran´s personal information without written consent.\"In a statement, the U.S. Coast Guard said Patterson had joined the service in 2018 and was discharged from active duty in January. He was an electrician´s mate second class at the time.",
        "Atlanta Mayor Andre Dickens applauded the fact that Patterson was arrested and taken into custody alive so he can be prosecuted.\"Right now, we´ve had a successful end to a traumatic day,\" Dickens said, while also advocating for tougher gun laws and stressing the importance of police training.\"I hope the city, the region, rests easy that he is in custody, but I also hope that we will stay vigilant to continue to look at a future where individuals who shouldn´t have a gun in possession won´t have one, and also that individuals are brought to justice, and also that we deal with these things that are mental health or easy access to guns,\" Dickens said.Gov. Brian Kemp said in a statement that he was \"heartbroken\" by the shooting and praying for victims.Cobb County Police Chief Stuart VanHoozer said technology played a huge role in finding the suspect, along with Department of Transportation cameras and community members calling with information.\"Those tools are really what got us the clues that we we needed to make this successful - and the people getting those clues,\" VanHoozer said.The pickup truck was found in a parking garage not far from the stadium where the Atlanta Braves play. Video aired by WSB-TV showed Patterson was arrested near a tennis court and swimming pool in a nearby condominium complex.",
        "Around the time of the shooting, Cassidy Hale, a medical device representative, said she was driving to the facility to check on a machine in the building´s outpatient surgery center.Hale saw firetrucks but didn´t realize anything was wrong until after she parked and found the elevator wasn´t working. Hale said she called the operating room manager, who told her there was an active shooter and she should go back to her car.Hale said police kept her from leaving the parking garage and later checked each car and escorted her out to be interviewed.She gathered with other employees and patients in a building across the street, where she said \"everyone was really in shock\" and \"trying to process what was going on.\"Shortly after the shooting, U.S. Sen. Raphael Warnock of Georgia took to the Senate floor to decry gun violence and to urge his colleagues to advance gun reform.\"There have been so many mass shootings ... that, tragically, we act as if this is routine,\" the Democrat said. \"We behave as if this is normal. It is not normal.\"The Atlanta pastor added: \"I shudder to say it, but the truth is, in a real sense, it´s only a matter of time that this kind of tragedy comes knocking on your door.\"",
        "Georgia´s other U.S. Sen. Jon Ossoff, also a Democrat, echoed his colleague in a statement: \"The level of gun violence in America today is unconscionable and unacceptable, and policymakers at all levels have a responsibility to ensure public safety and implement long-overdue reforms.\"___This story was first published on May 3, 2023. It was updated on May 5, 2023, to correct the age of the woman killed. Amy St. Pierre was 38, not 39 as police had said. This story was previously corrected to show that one of the surviving victims was 39, not 29.___Associated Press writers Jeff Martin in Woodstock, Georgia, and Tara Copp in Washington contributed to this report."
    ]
}