{
    "articleURL": "/tvshowbiz/article-12055355/Joey-Essex-reveals-eye-Hollywood-actress-Lily-James-following-split-Vanessa-Bauer.html",
    "content": [
        "Joey Essex has revealed he has his eye on gorgeous Hollywood actress and fellow singleton Lily James.",
        "The former TOWIE star, 32, recently split from DOI partner Vanessa Bauer, 26, two months after Lily, 34, and her rocker beau Michael Shuman, 37, also parted ways. He told The Sun: '[Lily is] a sort. We do follow each other on Instagram — we've been following each other for a while.Before adding: 'I like seeing what she's up to. She looks good and seems like a nice girl — and we're both single.'Joey also told the publication: 'If a nice, kind girl walks into my life I'd get to know her. I'd like a girlfriend but she needs to fit into my jigsaw puzzle.",
        "Joey and Vanessa went their separate ways in April, a month after finishing runners-up on Dancing On Ice.Viewers saw the couple grow close earlier this year filming the show, where they narrowly missed out on being crowned champions to Olympic gymnast Nile Wilson and his professional partner Olivia Smart.And MailOnline then exclusively revealed that the couple were no longer dating and hadn't spent any time together since the end of series.Their separation comes as Joey is planning an overseas move to Dubai and is in the middle of viewing properties where he can relocate and begin a new life away from Essex.A source said: 'Joey absolutely loved his time performing with Vanessa on Dancing On Ice – he will treasure those memories forever.",
        "'But for now, he's focussing on work opportunities and beginning a new chapter in Dubai.'He's definitely single and while Vanessa means a lot to him because of the experience they shared on the show, they're just friends now.",
        "'Joey has a busy life and career and right now his main priority is his house move, which will be a massive change for him.'Meanwhile, Lily described herself a 'serial relationshipper' and claimed guys are 'rubbish' on the dating app Hinge following her split.The actress appeared on the Capital Breakfast show back in February to discuss her dating life. Hosts Roman Kemp and Sian Welby told Lily: 'We talk about love life quite a lot on this show'Sian went on to say: 'We do, and we quite laugh at our own previous experiences that went horribly wrong. Your character Zoe is very unlucky in love. Can you relate to this, is there any, in your past when you go, I'm cringing still'.Lily then explained: 'I cringe at most things I do. Yeah I've been a sort of serial relationshipper, so I've not had any crazy dating stories however I did go on my mates' hinge the other day and I just despaired. I mean come on!",
        "Roman asked: 'What do you mean?' to which Lily replied: 'The guys, they were rubbish'",
        "Sian then asked Lily: 'What were some of the icks?'Lily quipped: 'I'm sure some of the girls are c*ap too but men are worse. There's a line in the film where my character is looking at this guy and he's got a sentimental quote and she's like 'He's fit enough that I'll overlook the sentimental quote' which is 'every day is a new rainbow' but that would be a bit of a turn off for me.'Sian noted that 'Sentimental quotes are out' with Lily adding: 'Not on the first look at someone, a bit of banter, I sound like I'm on Love Island!' The pair called time on their two year relationship after growing apart in recent months it was reported. "
    ]
}