{
    "articleURL": "/tvshowbiz/article-12040813/Luann-Lesseps-dazzles-plunging-sequin-blazer-Ed-Sheerans-Disney-doc-premiere.html",
    "content": [
        "Luann de Lesseps turned heads on Tuesday as she attended the premiere of Ed Sheeran's Disney+ documentary series.",
        "The 57-year-old Real Housewives of New York alum - who enjoyed a Mexican getaway earlier this year - donned a sequin black blazer.The socialite wore it over a plunging black blouse that she accessorized with a skinny black tie.The former Bravo TV personality joined the look with expertly tailored trousers with a slight flare.Rounding out the ensemble, she stepped out in a pair of pointy-toe black leather heels. ",
        "Luann looked youthful in her figure-flattering look, which she teamed with teardrop-shaped silver-toned hoop earrings.She styled her lustrous, rich brunette locks in an off-center part, letting them tumble over her shoulders in loose, bouncy curls.The mother-of-two, who shares a son and daughter with ex Alexandre de Lesseps, was in good spirits as she posed for photos.The Connecticut-born star looked great in a face of flattering makeup that highlighted her features.She used dark eyeliner and mascara to accentuate her brown eyes and dusted blush on her cheeks.The songstress completed the cosmetics look with bold pink color swiped onto her pout.Sheeran's series features a personal behind-the-scenes look at his life, including a heartbreaking moment of him crying as he recalled finding out about his wife Cherry Seaborn's cancer diagnosis. It follows Ed after he learns the life-changing news and reveals his hardships and triumphs during the most challenging period of his life.",
        "Blending a never-seen-before personal archive, interviews with his wife and loved ones, and intimate performances, the series widens the lens to unearth what Sheeran thinks of the world, himself and his music.February 2022 was not the month that Cherry was diagnosed with cancer, and it was also quickly followed by the death of Ed's close friend Jamal Edwards.Jamal, a music producer and the son of Loose Women star Brenda Edwards, died at 31 from a cardiac arrest brought on by taking cocaine and drinking alcohol.The pair became close after Jamal's YouTube channel SBTV helped to propel Ed into the spotlight, and the entrepreneur gave the aspiring musician a place to sleep when he was 18 and had no place to live in London.That February, Ed was also fighting a court case — which he later won — over his hit Shape Of You, which he was accused of plagiarising.",
        "The star said: 'That was a horrible, horrible, horrible month. Life hasn't moved on for me yet and I don't think it will.'Cherry was diagnosed with a tumor six months into her pregnancy with their second child, Jupiter, who just turned one.Doctors told the couple that the tumour required surgery, but that it wouldn't be an option until after Cherry had given birth.",
        "In the new series, Cherry reveals it was fearing she 'may die' that encouraged her to be part of Ed's documentary, with the incentive to show he wasn't just a 'music machine' leading her decision."
    ]
}