{
    "articleURL": "/wires/reuters/article-12049257/U-S-bankers-urge-SEC-probe-short-sales-reduce-abusive-trading.html",
    "content": [
        "By Andrea Shalal",
        "WASHINGTON, May 4 (Reuters) - The American Bankers Association on Thursday urged federal regulators to investigate a spate of significant short sales of publicly traded banking equities that it said were \"disconnected from the underlying financial realities.\"In a letter to U.S. Securities and Exchange Commission Chair Gary Gensler, the lobby group said it had also observed \"extensive social media engagement\" about the health of various banks that was out of step with general industry conditions.\"We urge the SEC to consider all its existing tools and to take measures to reduce the avenues for abusive trading practices and restore investor confidence,\" the group said.\"These measures include, at a minimum, a clear message and appropriate enforcement actions against market manipulation and other abusive short selling practices.\"The ABA call came as shares of regional banks resumed their slide this week after the collapse of First Republic Bank , the third U.S. mid-sized lender to fail in two months.Short sellers raked in $378.9 million in paper profits on Thursday alone from betting against certain regional banks, according to analytics firm Ortex.Reuters reported earlier that U.S. federal and state officials are assessing the possibility of \"market manipulation\" behind big moves in banking share prices in recent days, as the White House vowed to monitor \"short-selling pressures on healthy banks.\"",
        "ABA President and CEO Rob Nichols told Gensler that short selling could be a legitimate financial tool, but his group was \"unalterably opposed to short selling practices that distort the markets through manipulation and abuse.\"He called on Gensler to send a clear message to market players and take appropriate enforcement action against market manipulation and other abusive short selling practices.\"The harm caused by short selling that runs counter to economic fundamentals ultimately falls on small investors, who see value destroyed by others´ predatory behavior,\" he said.The ABA includes small, regional and large banks that together employ more than 2 million people, safeguard $19.2 trillion in deposits and extend $12.2 trillion in loans.The S&amp;amp;P 600 bank index dropped more than 3% on Thursday. PacWest Bancorp shares tumbled over 50% after it confirmed it was exploring strategic options.Western Alliance Bancorp saw its saw plunge more than 38% after the Financial Times said the bank was exploring a possible sale, a report the bank later denied.Given the potential for damage to investors and the \"perceived health of banks\" targeted by short sellers, the SEC should reinforce and publicly highlight its efforts to address abusive, market-distorting short campaigns, Nichols wrote.Gensler on Thursday said the agency would go after any form of misconduct that might threaten investors or markets. (Reporting by Andrea Shalal Editing by Shri Navaratnam)"
    ]
}