{
    "articleURL": "/wires/ap/article-12039713/Report-describes-chaos-GloRilla-stampede.html",
    "content": [
        "A deadly stampede that killed three at a rap concert in upstate New York was likely exacerbated by a crowd of people trying to get into the venue just as thousands of concertgoers who were inside were trying to exit, according to a report released Tuesday by public safety officials.",
        "The crowd surge erupted at GloRilla's March 5 show, held in a decommissioned armory in Rochester.Concertgoers told investigators that people panicked after hearing noises that sounded like gunfire. The investigation turned up no physical or video evidence, nor eyewitness accounts of gunshots, leaving the cause of the stampede unexplained.But the report, released by Rochester police, described a chaotic situation at the Rochester Main Street Armory in the final minutes of the show.With about 20 minutes remaining before the concert's end, as many as 200 fans were still outside the venue, trying to get inside. Some people said they had VIP tickets. Eventually, almost the whole crowd was able to \"overtake security\" and get inside the building foyer, police said.\"Security attempted to create a stronghold on the inner, wooden doors, to maintain this crowd in the entryway,\" the police report said. As the concert concluded at around 11 p.m., thousands of people trying to exit met the crowd trying to get in, the police report said. \"This 'traffic jam´ is one of the likely contributing factors to the stampede as people still within the main concert hall began to push toward the front doors.\"The findings were made public a day after city officials announced that investigators had found no basis for criminal charges related to the disaster.",
        "The public safety investigation of the venue was hampered partly by a lack of security camera video, the report said.Only two working cameras were found by investigators. The venue owner told authorities that the majority of the cameras inside the venue were \"dummy cameras\" that did not record. Technicians found that a video recording system hadn't had any videos saved to it since 2014, the report said.When the crowds eventually cleared, police found several people had been trampled. Killed in the crush were Aisha Stephens, 35, of Syracuse; Rhondesia Belton, 33, of Buffalo; and Brandy Miller, 35, of Rochester.An Armory manager estimated there were 3,900 people inside the venue, which has a capacity of 5,000. The venue owner at the time of the concert, citing his attorney's advice, declined to provide a more accurate headcount, the report said. A Health Department investigator told police that a subpoena would be issued to the owner and promoter to determine attendance.Scott Donaldson, the armory´s owner at the time of the concert, did not immediately respond to an emailed request for comment. The armory was sold to a new owner in March, the Democrat and Chronicle newspaper reported.The report said the city is now considering additional licensing conditions to increase safety and security at entertainment venues. On the night of the concert, eight Rochester police officers were stationed outside of the Armory. The Armory and the performer, GloRilla, provided security inside.",
        "Thompson reported from Buffalo, N.Y."
    ]
}