{
    "articleURL": "/tvshowbiz/article-12059357/Love-Islands-Wes-Nelson-rushed-hospital-losing-consciousness.html",
    "content": [
        "Love Island star Wes Nelson was rushed to hospital after losing consciousness while at home. ",
        "The reality TV star, 25, who is now a singer-songwriter, discussed the incident on social media as he shared pictures of himself from A&amp;E.He explained that after he started to pass out, he managed to make it over to his neighbours' house, who helped him get to hospital.He said; 'So yesterday I randomly started to lose vision/consciousness in my house!'Managed to get to my neighbours who took care of me and got me to hospital in the ambulance.",
        "'Won't go into detail but we did a bunch of tests and throughout the day and they've have told me I'm all good now.'He's now feeling well enough to embark on his 14-date tour of the UK and Ireland and has said doctors have 'given him the green light' to perform.  Wes, who was a millionaire at 21, said: 'I feel LOADS better today! Got the green light for TOUR tomorrow.'Wes famously appeared on the 2018 series of Love Island where he found love with Megan Barton Hanson for a short time, before they sadly went their separate ways. He went onto date model Lucciana Beynon but they split in July 2022, after two years together. Wes and Lucciana, who is the daughter of millionaire tobacco tycoon 'Candyman' Travers Beynon, later unfollowed each other on social media and went their separate ways due to their 'busy schedules'. ",
        "The rapper recently hinted at the break up during an interview on Capital XTRA: There's been a lot that's happened in my life over the past year and a half, including a breakup. That was quite recently.''Look at me, still shining. Can't keep a good man down. I'm good with breakups. It wasn't it wasn't like a bad one in that sense.'Lucciana previously went public with Wes, who launched his music career back in 2020 with his single See Nobody, on Valentine's Day last year.",
        "She posted a photo on Instagram of herself kissing Wes on a balcony alongside the text 'mi amour', which translates to 'my love'.Wes has had a series of reality star girlfriends and after dating Megan, he went onto romance Love Island's Arabella Chi, who appeared on the show the year after him.However they broke up in April 2020 and Wes moved out of their shared home just before lockdown."
    ]
}