{
    "articleURL": "/news/article-12038173/KINDERGARTEN-children-vaping-claims-principal.html",
    "content": [
        " Principal Christine Del Gallo claims kidergarten kids are vapingHealth Minister announced a new crackdown on e-cigarettes Children at kindergarten are vaping, a top school principal has extraordinarily claimed.",
        "Christine Del Gallo, who is deputy president of the New South Wales Secondary Principals Council, was speaking on A Current Affair when she made the claim.'There is evidence that primary school students down to kindergarten children are vaping,' she told Ally Langdon. Scroll down for video ",
        "'They're vaping at school, they're vaping outside of school. They may have them in their bedroom drawers at home and are vaping at home.'It's become, exponentially, a really serious problem and it's across the whole state.'They are very, very dangerous products for our teenagers and young children.'Ms Del Gallo claimed research showed up to 80 per cent of children were vaping. She called for more rigorous policing of vapes entering Australia, as well as tougher measures against shops who sell them to people who are underage.Health Minister Mark Butler announced on Monday that the sale of flavoured vapes will been banned as part of a major crackdown on e-cigarettes.The strict laws will mean Aussies can only purchase vapes in plain packaging with a prescription at pharmacies - not convenience stores, service stations or any other shops.",
        "'I am determined to stamp out this public health menace because that's what I think it genuinely is,' Mr Butler said.'They should only be available in therapeutic settings, which is essentially pharmacies.",
        "'Only products that are pharmaceutical style plain package, plain products, they don't have flavours only those products should come into Australia.'As part of the major push Mr Butler is also preparing to ban disposable vapes, which are single use e-cigarettes that don't allow refills of the liquid electronically heated to produce the inhaled vapour.Currently vapes are available from convenience stores and tobacco outlets, as well as from online sources and come in a bewildering variety of flavours, shapes and designs.The minister said e-cigarettes were initially promoted to governments and health regulators as a therapeutic aid for people to quit smoking.But he claims vape producers are instead targeting children to take up the dangerous and addictive product.'It was not sold as a recreational product targeted at our kids but that's what it has become,' he said.'Vapes are disguised as highlighter pens, as USB sticks so that people can take them to school and it is having a significant health effect on our youngest Australians.'He accused producers of marketing to young people by decorating vapes with pink unicorns or giving them bubblegum flavours.'This is a deliberate strategy by the tobacco industry to create a new generation of nicotine addicts and far from being a pathway out of cigarettes, which is what it was promoted to us as, it has become a pathway into cigarettes for young people,' he said."
    ]
}