{
    "articleURL": "/wires/ap/article-12050361/Osimhen-Kvara-earn-mural-spots-alongside-Maradona.html",
    "content": [
        "ROME (AP) - Victor Osimhen and Khvicha Kvaratskhelia have earned their mural spots on the walls of Naples alongside Diego Maradona.",
        "More than three decades after Maradona led Napoli to its first two Serie A titles, \"Osi\" and \"Kvara\" were the biggest reasons behind the team´s runaway success this season.So it seemed appropriate that both players were involved in the decisive goal when Napoli sealed the \"scudetto\" (championship) with a 1-1 draw at Udinese on Thursday.Osimhen knocked in the rebound after a shot from Kvaratskhelia for the second-half equalizer.It was Osimhen´s league-best 22nd goal of the season, while \"Kvara\" is the league´s assist leader with 10 to go along with the Goergia international´s 12 goals scored.\"I really do not care who scores or who don´t. All I wanted was to win the `scudetto,´\" Osimhen said after Thursday´s match. \"I was just fortunate enough to be in the position to get the goal in.\"",
        "Even before the title was sealed, an Osimhen-Kvara mural was put up in the Forcella neighborhood, which is known for its mural of San Gennaro, the city´s patron saint.While the mural will likely still be in place, it remains to be seen whether Osimhen will stay with Napoli after acknowledging that he would like to play in the Premier League one day.Osimhen is 24 and \"Kvara\" is 22, so the pair could potentially play together for many more years.",
        "\"I want to enjoy this moment for the rest of my life. Then after the season my other dreams can come,\" Osimhen said. \"But for now it´s not a time to talk about my other dreams. I wanted to win this. ... For me this is just a moment.\"While the more outgoing Osimhen was leading the locker room celebration by singing and dancing on top of a table, the more reserved \"Kvara\" was quieter and wrapped in a Georgian flag.Another key element of Napoli´s success whose future remains uncertain is coach Luciano Spalletti, who is waiting for a contract extension.At age 68, Spalletti became the oldest coach to win Serie A - and it was his first title.\"He´s like a father to all. He´s ready to listen to the problems on and off the pitch,\" Osimhen said. \"He´s a very strict coach, he´s demanding. I owe a lot of my successes to this man. He has really taught me to be a striker.\"___ Andrew Dampf is at https://twitter.com/AndrewDampf ___ More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}