{
    "articleURL": "/news/article-12047721/Charles-Camilla-welcome-train-passengers-UK-stations-Coronation-weekend.html",
    "content": [
        "For all the latest Royal news, pictures and video click here King Charles III and Queen Camilla will remind millions to 'mind the gap' on train platforms across Britain this weekend.",
        "Their Majesties have recorded an announcement which is being played between today and Monday - the Coronation weekend - at all railway stations across the UK and all London Underground stations. In the message, the King begins by telling passengers: 'My wife and I wish you and your families a wonderful coronation weekend.'Camilla then says: 'Wherever you are travelling, we hope you have a safe and pleasant journey.' The message concludes with Charles adding: 'And remember, please mind the gap.'The message was recorded at Highgrove earlier this year by the audio team from Transport for London. ",
        "The King is to be crowned in a historic ceremony at Westminster Abbey in the first UK Coronation since the late Queen Elizabeth's in 1953.The ceremony itself will last around two hours and be preceded and followed by a procession from Buckingham Palace.On Sunday, the Coronation Concert is due to take place in Windsor, while Britons can also look forward to an extra bank holiday on Monday. Jacqueline Starr, Chief Executive Officer at Rail Delivery Group, said: 'The Coronation is a rare and exciting event and we very much look forward to welcoming passengers with this special message. 'It's wonderful that Their Majesties are including rail passengers as part of this historic moment.'",
        "Network Rail chief executive Andrew Haines said: 'Our station colleagues are pulling out all the stops to welcome people to London for the Coronation and it's fantastic that they will also be welcomed by King Charles III and Queen Camilla.'",
        "Andy Lord, London's Transport Commissioner, said: 'With less than one day to go before the Coronation, we look forward to hosting Londoners and visitors from across the globe. 'We are honoured to support the celebrations with a special station announcement across our network from Their Majesties King Charles III and Queen Camilla.'Although many eager royal fans will be keen to hear the announcements for themselves, they are being warned to expect services to be extremely busy throughout the weekend. Queueing systems may be introduced in some areas to regulate crowds, and passengers are advised to plan their journey in advance, allow extra time and check live updates while travelling.Ticketholders travelling to the Coronation Concert at Windsor on Sunday are also advised to plan their journey to and from the concert in advance.National Rail advised those heading to London: 'Please note that London is expected to be extremely busy. Queueing systems may be put in place in and around railway stations, to manage crowds and keep you safe.'Walking is likely to be the best way to get around within London and travel ambassadors will be on hand at all National Rail, London Underground and bus stations to provide directions and assistance.",
        "'On Coronation Day, there will be road closures on many of the roads around London Victoria station. There will be limited public access to the procession route, or The Green Park and St James's Park screening sites, from the station.'Due to the road closures and crowd management, if you exit London Victoria station you may only be able to access the screening site at Hyde Park.'If you are leaving London late on Saturday 6 May, please be aware of when your last train departs.'Fans from all over the world have already arrived in London ahead of the weekend, with thousands expected to travel to London on May 6 too.Hundreds have already camped out on The Mall outside Buckingham Palace in the hopes of seeing the royal family on Saturday. "
    ]
}