{
    "articleURL": "/wires/afp/article-12057265/Thailand-stun-US-LPGA-International-Crown.html",
    "content": [
        "Thailand captured the LPGA International Crown on Sunday, blanking Australia 3-0 in the championship match to complete a near-perfect run in the global team event at Harding Park.",
        "Patty Tavatanakit defeated Hannah Green 4&amp;3 and Atthaya Thitikul beat Stephanie Kyriacou 4&amp;2 in singles to clinch the trophy before Ariya and Moriya Jutanugarn downed Minjee Lee and Sarah Kemp 4&amp;3 in foursomes to complete the sweep.\"It means a lot for all of us,\" said Thitikul. \"It's incredible work we put in this week to get this trophy for our country.\"We're one of the best teams in the world and I think we can beat every team in the world.\"Sixth seed Thailand went 11-1 in all matches during the week, making a perfect streak through round-robin play before ousting top seed United States 2-1 in a Sunday morning semi-final.The seventh-seeded Aussies beat Sweden 3-0 in the other semi but had no answer for the Thai stars.\"It means so much and for us to come all the way this far it's so great for our country,\" Tavatanakit said.\"You can already see there are a lot of rookies this year from Thailand. You know this is going to keep making it growing and keep inspiring young people.\"I'm just so proud of all of us to be able to play and give it all we got and just try to make our home country proud.\"Thitikul and Kyriacou were level at the turn. Thitikul won the 12th hole with an eight-foot birdie putt, took the 14th with a par and got up and down from a bunker for par to win the 15th for a 3-up lead.",
        "When Kyriacou missed a 12-foot birdie putt, she conceded to hole and the clinching point.Tavatanakit birdied the par-3 second, par-5 third and par-4 fourth to jump 3-up, Green won the next two holes with birdies but Tavatanakit birdied seven, 11 and the par-3 13th to seize a 4-up lead. She won the match by tying the 14th and 15th.\"I was really patient out there,\" Tavatanakit said. \"I knew it was going to be tougher because everyone is tired, just tried to be as consistent as I can and that helped.\"The Jutanugarn sisters, who won the deciding point over the US women and went unbeaten for the week, birdied four holes in a row starting at the par-4 seventh to seize a 4-up lead.Ariya, named the Crown's Most Valuable Player, chipped in for par at 15 to tie the hole and complete the team sweep.\"It's such an honor to represent our country,\" Moriya said. \"Everyone just gave 100 percent for every match. We tried to play as solid as we can.\"Kemp took some consolation in the Aussies managing a best-ever finish by reaching the final.\"I think we made everyone in Australia proud by finishing second,\" she said. \"We've done the best ever Australia has done in this tournament. It's obviously a little disappointing, but it's still a big win for us.\"",
        "The United States defeated Sweden 2-1 in the third-place match.Launched in 2014, the International Crown is a biennial team event that returned this season after a five-year absence due to the Covid-19 pandemic."
    ]
}