{
    "articleURL": "/femail/article-12045597/est-amazon-deals-coronation-weekend-2023.html",
    "content": [
        "SHOPPING — Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information.",
        "Are you looking for some great deals to shop this coronation weekend? Well, look no further. There are plenty of discounts to be had at Amazon, and we've found the the best ones. With an extra bank holiday to celebrate the King's Coronation, now is the perfect opportunity to get the garden ready for summer entertaining, and the mega-site has a load of garden deals to help spruce up your outdoor space.If this weekend marks the first of many outdoor soirees, then investing in one of Kärcher's pressure washers could be a wise investment, helping you blast away mud, dirt and grime from your patio. There are also plenty of tech savings to help you entertain in style, including the Echo Dot (5th generation) for just £34.99 and a huge 40 per cent saving on the Fire TV Stick 4K Max.So what are you waiting for? With so many great discounts available, you're sure to find something you love at a price you can afford. Check out our top picks below.   Echo Dot (5th generation, 2022 release)  Described as Amazon's best-sounding Echo Dot yet, you can enjoy an improved audio experience with Alexa for clearer vocals, deeper bass and vibrant sound in any room. You can also get the weather forecast, set hands-free timers, get answers to your questions and even tell jokes. Need a few extra minutes in the morning? Just tap your Echo Dot to snooze your alarm.  £34.99 (save £20) Shop  Fire TV Stick 4K Max  Upgrade your entertainment this spring with this huge 40 per cent saving on the Fire TV Stick 4K Max.The brand's most powerful streaming stick, you can stream hundreds of thousands of films and TV episodes from BBC iPlayer, Netflix, Prime Video, Now, Disney+ and more, plus listen to millions of songs.  £38.99 (save £26) Shop",
        "  Shark Corded Stick Vacuum Cleaner [HZ500UK] Anti Hair Wrap  Spring is the perfect time to deep clean your home, especially ahead of all that summer entertaining. And one deal not to miss is 40 per cent off this top-rated Shark vacuum. Perfect for carpets and hard floors, Shark's DuoClean floorhead glides across all floors drawing in large and small debris, while the LED headlights illuminate hidden dust.  £149 (save £100.99) Shop  Silentnight Deep Sleep Pillows 2 Pack  Bedding in need of a refresh? Deeply filled for support and comfort, the Silentnight Deep Sleep Pillows are now on offer for a very tempting £13.90 for a pack of two.  £13.90 (save £3.09) Shop  Olay Retinol 24 MAX Eye Cream  If you're looking for a cream to target our under eyes and improve the look of fine lines and dark circles, then this is a deal not to miss. The smoothing eye cream is formulated with Olay's most potent retinoid and vitamin B3 formula, hydrating the skin with visible improvements in fine lines and wrinkles. £17.45 (save £26.55) Shop  Oral-B Pro 3 2x Electric Toothbrushes  You can get two of the bestselling rotating toothbrushes on Amazon for under £70 this bank holiday weekend.The Oral-B Pro 3 Electric Toothbrush oscillates, rotates and pulsates to remove up to 100 per cent more plaque versus a manual toothbrush. It also has three brushing modes and a pressure sensor that pulses to alert you when you're brushing too hard. £69.99 (save £90.01) Shop  eufy RoboVac 15C MAX Robot Vacuum Cleaner  Now is a great time to invest in a robot vacuum cleaner as the highly-rated eufy RoboVac 15C MAX Robot Vacuum Cleaner is on sale for 34 per cent off. Not only does it vacuum your home without assistance, but the robot vacuum is also small enough to fit underneath your furniture, cleaning where you can't. £159.95 (save £84.05) Shop  Fairy Non-Bio Platinum PODS, 120 Washes (60 x 2)  Keep your spring wardrobe soft and discover the gentle care of Fairy Non Bio Pods, with Fairy best softness for 23 per cent off, now live on Amazon.  £27.69 (save £8.31) Shop  Kärcher K 3 Power Control high pressure washer  With warm weather on its way, now is the perfect time to spruce up the garden and wash away built-up mud and grime on your patio.And with Karcher, cleaning has never been so easy. The pressure is regulated by turning the spray wand - the LED display on the Full Control Power gun makes it easy to check the setting made. £117.99 (save £32) Shop  Ariel All-in-1 PODS, 120 Washes (60 x 2) with Lenor Unstoppables  You can get 120 Ariel laundry capsules for under £30 this bank holiday weekend, thanks to Amazon.Helping you lift stains, brighten, freshen, and protect fabrics and with brilliant stain removal even in a cold wash, it even comes with a touch of Lenor Unstoppables. £29.99 (save £6.01) Shop  Fire HD 8 tablet | 8-inch HD display, 32 GB  Liven up the daily commute with the Fire HD 8, which lets you stream and download your favourite series and films from Prime Video, Netflix and Disney+.Get up to 13 hours of reading, browsing the web, watching videos and listening to music at home and on the go.  £64.99 (save £35) Shop  Blink Outdoor  With the Blink Outdoor Security Camera (now 40 per cent off), not only can you see visitors, but you can speak to them too, and also monitor live footage from your phone day or night with infrared night vision and use it in conjunction with Alexa.  £47.99 (save £32) Shop  SHADY® Car Window Sunshade For Baby - 2 Pack  As well as a bank holiday weekend, it's also sun protection awareness week. If you're hitting the road and travelling this bank holiday, then this deal on the SHADY car window sunshade could be a super practical buy.The sunshade helps block 86 per cent of harmful UV rays, helping protect your little ones from the damaging effects of the sun. Better still, the contrasting designs have been specifically crafted to aid visual stimulation - giving you a moment's peace. £20 (save £5) Shop  TP-Link Tapo Smart Plug Wi-Fi Outlet  Plugged into your mains power socket and set up with Wi-Fi using the app, you'll be able to switch the appliance on or off using your phone no matter where you are, and it's even compatible with Amazon Alexa for voice control.  £15.99 (save £9) Shop  UniBond 2079356 Anti-Mould White  If you're planning on doing some DIY this bank holiday weekend, then this deal is one not to miss. Once dry, the UniBond sealant forms a permanently flexible, mould resistant and waterproof sealant, ensuring strong seals and preventing mould growth.  £6.80 (save £1.20) Shop  Tower T17021 Family Size Air Fryer with Rapid Air Circulation  Been eyeing up air fryers? This is a deal too good to miss - shop the Tower T17021 Family Size Air Fryer for under £50 right now. The highly-rated air fryer has a generous 4.3-litre capacity and has fry, roast, grill and bake functions, so you can make a variety of meals. Better still, it cooks up to 30 per cent faster than a conventional oven, while the Vortx also cooks food with little or no oil.  £48.90 (save £21.09) Shop  Joseph Joseph Nest Lock, 5 Piece Plastic Food Kitchen Storage Container set with lids  Not sure what to do with all that left over bank holiday food? Or perhaps going on a bank holiday picnic?Keep food fresher for longer with the help of the Joseph Joseph storage container set, now on sale for 35 per cent off.  £25.99 (save £14.01) Shop  Foot Peel Mask with Peach by Plantifique - 2 Pack Foot Mask  Thousands of shoppers have been wowed by the results of the Foot Peel Mask by Plantifique, which sheds hard, dry and dead skin to reveal baby-soft skin.The foot exfoliator's impressive formulation contains milk and plant extracts, including sweet peach and papaya, that dissolve dead skin until it literally sheds off your feet. £13.55 (save £3.40) Shop  All Seasons Gazebos 2x2 Fully Waterproof Pop up Gazebo With Accessories  The Great British summer is not always reliable, and if you're hosting, then having a gazebo on hand ready to shelter your guests is a wise move. And now you can snap up this fully waterproof gazebo for under £100.   £96.99 (save £63) Shop  ghd Curve Creative Curl Wand - Hair Curling Wand  Get a new look this spring with the help from ghd Curve Creative Curl Wand.Whether you're after beachy hair, natural-looking curls or deep waves; the ghd curve creative curl wand has a unique 28mm–23mm tapered barrel that can create natural-looking curls for a beautiful beachy effect or glamorous, bouncy hair.  £119.20 (save £29.80) Shop  Miracle-Gro Evergreen Complete 4-in-1 Lawn Food  If your garden has been neglected, then a bank holiday weekend is the perfect excuse to get out and do some gardening. For some extra TLC for your lawn, the Miracle-Gro Lawn Food is a wise investment. Enjoy a thicker and healthier lawn, thanks to the unique blend of nutrients and minerals. Watch it grow greener in just seven days.  £16.97 (save £8.02) Shop"
    ]
}