{
    "articleURL": "/wires/pa/article-12056975/James-Nesbitt-All-NI-political-parties-attending-coronation-sign-progress.html",
    "content": [
        "James Nesbitt has said he thinks it is a sign of “progress” that every main political party in Northern Ireland turned up for the King’s coronation.",
        "Political leaders from across the world were in attendance at the ceremony in Westminster Abbey on Saturday, including Sinn Fein vice president Michelle O’Neill and DUP leader Sir Jeffrey Donaldson.",
        "The Northern Irish actor, 58, is taking part in the continued celebrations of the historic event by performing a poetry reading at the coronation concert on Sunday evening.Speaking backstage ahead of the event, he told the PA news agency he was “very impressed” with the King when he met him a few years ago at a project celebrating Northern Irish produce, as he took “such an interest”.Reflecting on the coronation, he said: “I’m just so delighted in the sense that every political party turned up yesterday for it and I think that’s progress.",
        "“In a sense, although a lot of people might disagree with me… and we all have our own opinions about it, but I feel that I’m representing an awful lot of people from where I come from, and I’m glad that he (the King) takes such an interest in the place.”Nesbitt added that it was a “real privilege” to be asked to read the poem at the celebratory concert, which was written for the occasion by Daljit Nagra, chairman of the Royal Society of Literature.",
        "It will come as part of the Lighting up the Nation segment of the event which will see colourful illuminations light up landmarks across the UK.Choreographed lasers, projections and drone displays will radiate over historic bridges and buildings in cities including Blackpool seafront in Lancashire, Sheffield Town Hall and Newcastle’s Tyne Bridge.Light shows will brighten up Belfast, Edinburgh and Cardiff at various locations.On Saturday, a 21-gun salute rang out from Hillsborough Castle in County Down to mark the coronation of the King.Ms O’Neill said she was attending the event to “represent the whole community” in Northern Ireland.“My determination is to keep moving forward, and to represent the whole community”, she tweeted on the morning of the ceremony.“The political landscape across our island is changing. My focus is on building a shared future for all.”Her attendance at the event was seen as another demonstration of the markedly improved relations between the republican movement and the royal family since the peace process."
    ]
}