{
    "articleURL": "/wires/ap/article-12044923/Trout-Lamb-homer-9th-Angels-rally-beat-Cardinals-6-4.html",
    "content": [
        "ST. LOUIS (AP) - Mike Trout and Jake Lamb hit solo homers in the 9th inning, Shohei Ohtani tied a career-high with 13 strikeouts and the Los Angeles Angels rallied to beat the St. Louis Cardinals 6-4 on Wednesday night.",
        "Los Angeles has won six of its last eight games, while the Cardinals have lost five in a row.Ohtani didn't get the decision, but did become the second player in MLB history to record 500 career strikeouts and hit at least 100 home runs, joining Babe Ruth.Ohtani gave up four runs on five hits over five innings and allowed two home runs for the second straight outing. He allowed five earned runs on eight hits in an 8-5 win over Oakland on April 27.\"I wanted to get through six or seven innings, minimum,\" Ohtani said through an interpreter. \"More than the strikeouts, I'm more disappointed that I didn't get that far in the game.\"Ohtani recorded his seven outs via strikeout.",
        "\"He was good,\" Los Angeles manager Phil Nevin said. \"There are some good hitters over there.\"Ohtani went 3 for 5 and drove in a run. He extended his hitting streak to a season-high seven games.The Angels trailed 4-3 heading into the top of the ninth before Lamb launched his second homer of the season to right-center off Giovanny Gallegos (1-1), tying the game at 4. With one out, Trout hit his eighth home run of the season to left for the eventual game-winning run. Anthony Rendon added a run-scoring hit.",
        "Trout was extra exuberant after the blast, pounding Nevin with an aggressive high five as he reached the dugout.\"I might have a broken finger right now,\" Nevin joked. \"He came in swinging at everybody.\"Trout recorded his fifth career go-ahead homer in the ninth inning or later.\"I was pumped,\" Trout said. \"I've been battling, I've been grinding.\"Lamb got the rally started with the fifth pinch-hit home run of his career.\"We've got a good team,\" Lamb said. \"We've got the pitchers, we've got the hitters. It says something that we haven't quite put it all together. We're still playing pretty good baseball. I look at that as a positive. We can only get better.\"Brandon Drury also homered for the Angels. Ryan Tepera (2-1) earned the win and Carlos Estevez picked up his seventh save of the season.Dylan Carlson and Nolan Gorman homered for St. Louis, which at 10-21 is off to its worst start since the 1973 squad opened the season 8-23.Carlson put the Cardinals ahead 4-3 with a two-run homer that capped a three-run outburst in the fourth inning. It was his first homer of the season. Nolan Arenado and Willson Contreras opened the inning with back-to-back doubles.Gorman gave the Cardinals a 1-0 lead with his seventh homer of the season in the first. Drury tied the game with his sixth homer of the season in the second inning.",
        "St. Louis starter Miles Mikolas allowed three runs on eight hits over 5 2/3 innings.\"It's a big punch in the gut,\" Mikolas said. \"I think this is going to (be) a wake-up call.\"Los Angeles shortstop Zach Neto was removed from the game in the fifth inning with a right finger contusion. He is considered day to day.TRAINER´S ROOMCardinals: RHP Adam Wainwright will make his first start of the season on Saturday against Detroit. Wainwright suffered a groin injury in March while working out for the World Baseball Classic. The 41-year old made three rehab starts and allowed nine runs on 18 hits over 13 innings.UP NEXTLos Angeles RHP Griffin Canning (1-0, 4.11) will face RHP Jack Flaherty (2-3, 3.94) in the final game of the three-game set on Thursday afternoon. Canning, who missed last season with lower back issues, allowed three earned runs on four hits over five innings in a 5-3 win over Oakland on April 25. It was his first win since July 2, 2021. Flaherty is making his first career start against the Angels.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}