{
    "articleURL": "/wires/aap/article-12044831/Kris-keeps-Savage-bay-Raiders-fullback-battle.html",
    "content": [
        "Rising star Xavier Savage will have to wait to wrestle back his No.1 jersey in Canberra as coach Ricky Stuart prioritises the continuity that's helped them steady their NRL campaign.",
        "Savage, who's been named for his first game of the year against Canterbury on a wing, might even find himself back in NSW Cup next weekend after Stuart vowed to recall Albert Hopoate after he misses the Bulldogs game to attend a family wedding.Many expected Savage, viewed as the club's best fullback pre-season, would immediately take the job from Sebastian Kris on his return from a broken jaw, but the deputy's hot form has seen him hang on to the role.Asked if Kris was the Raiders' first-choice No.1, Stuart said form had earned him the job for at least the time being.\"Whenever you're playing the way Seb's playing, with any player in any position, you're not going to upset the rhythm,\" he said.\"Players are finding a bit of rhythm with combinations. Jamal (Fogarty) and Jack (Wighton) are getting some combinations with Zac (Woolford) and Tommy (Starling) and our starting three middles.\"The boys are getting very comfortable with Seb at the back, they're getting very comfortable with Corey (Horsburgh) at 13.\"Continual game time with each other is a big part of the rhythm I talk about in regards to the team.\"Kris, traditionally a centre, has looked more comfortable with each appearance at fullback and has scored a try in his last two outings, running for an average of 177m in his eight games this season.",
        "Savage found 155m a game after winning the starting role last year but did have some struggles defensively.Stuart said Hopoate attending his sister's wedding instead of heading to Magic Round was a \"no-brainer\".\"He wanted to play, he was torn and I made the decision for him ... he'll come back into NRL next week,\" he said.\"I don't think it's fair on him that because he's gone to his sister's wedding and in the form he's in ... to have to then work his way back into the squad.\"He's done a wonderful job for us Albert ... another good player (Savage) comes in now and he's got big boots to fill.\"Canterbury, who've lost five straight games against the Raiders, get emerging star Jacob Kiraz back on a wing after overcoming knee injury and prop Max King returns from a rib complaint.They've persisted with Josh Reynolds in the halves despite the impressive debut of Karl Oloapu in their win against St George Illawarra last time out."
    ]
}