{
    "articleURL": "/wires/reuters/article-12041263/Malaysia-end-5G-monopoly-allow-second-network-year.html",
    "content": [
        "By Mei Mei Chu and Rozanna Latiff",
        "KUALA LUMPUR, May 3 (Reuters) - Malaysia said on Wednesday it will adopt a dual network model for its 5G rollout next year following widespread concerns about pricing and competition over a single state-run network.The decision is the latest by Prime Minister Anwar Ibrahim's six-month-old administration aimed at dismantling monopolies and promoting competition, though it could create tension with Western countries that wanted Malaysia to stick with its original plan.Malaysia had in 2021 unveiled a plan for a state-owned agency, Digital Nasional Berhad (DNB), to own the full 5G spectrum, with various carriers using the infrastructure to provide mobile services.Malaysia has now decided to allow a second entity after DNB's coverage reaches 80% of populated areas, Communications Minister Fahmi Fadzil said in a statement.\"This model also takes into account the sustainability of the telecommunications industry ecosystem in Malaysia thus ending the monopoly element that is often associated with DNB,\" Fahmi said.DNB has achieved 57.8% coverage of populated areas and is on track to reach 80% by the end of the year, he said.The government's announcement confirmed a report by Reuters last month on a plan to introduce a second 5G network from January 2024.The single-ownership plan had been met with industry concern over pricing, transparency and monopoly. A recommendation by major carriers for a second 5G provider was rejected by the previous government in March last year.",
        "The plan came under renewed scrutiny after Anwar announced a review after taking office in November, saying it was not formulated transparently by the previous administration.DNB rejected that assertion.It has said a single network would reduce costs, improve efficiency and accelerate the building of infrastructure.It was not clear how the proposal for a second 5G network would affect DNB's existing agreements with its development partner, Swedish telecoms giant Ericsson, and other mobile operators.On Tuesday, the Financial Times reported that the European Union and the U.S. had warned Malaysia of risks to national security and foreign investment amidst efforts by China's Huawei Technologies Co Ltd to bid for a role in its telecoms infrastructure.Reuters could not independently verify the report.Fahmi told a press conference he would meet interested diplomats to discuss the issue, and Malaysia would be \"neutral\" in commercial considerations.\"As a sovereign country, Malaysia has the right and power to set our own policies without the interference of other parties,\" Fahmi said. (Reporting by Mei Mei Chu and Rozanna Latiff; writing by A. Ananthalakshmi; Editing by Martin Petty and Robert Birsel)"
    ]
}