{
    "articleURL": "/wires/reuters/article-12045759/Rebound-travel-helps-vaccine-maker-Valneva-post-smaller-expected-loss.html",
    "content": [
        "May 4 (Reuters) - French vaccine maker Valneva reported on Thursday a smaller-than-expected first-quarter loss as sales of travel vaccines Dukoral and Ixiaro improved, propelling its shares 16% up.",
        "Valneva also confirmed its sales outlook for 2023, with revenue expected between 220 million euros and 260 million euros.\"We managed to double our first-quarter vaccine sales year-over-year, keeping us on track to deliver on our full-year sales guidance,\" Chief Financical Officer Peter Bühler said in a results statement.After the European Commission dropped nearly all of its orders of 60 million doses of Valneva's COVID-19 vaccine last year, in a move that all but wiped out the shot's value for the company, the French drugmaker, in line with market trends, redirected its focus to the recovering travel industry.Its Danish peer Bavarian Nordic also said in February it was to acquire a portfolio of travel vaccines from Emergent BioSolutions, as it noted a rebound in travel vaccines.Valneva said sales for its travel vaccines Dukoral and Ixiaro more than quadrupled year-on-year, benefiting from continued recovery of travel markets and price increases.It posted a loss of 12.3 million euros ($13.6 million), excluding interest, taxes, depreciation, and amortisation (adjusted EBITDA) in the quarter, compared with a loss of 17.8 million euros analysts forecast in a company-compiled consensus.The drugmaker's revenue rose over 53% in the quarter to 33.5 million euros, just below analysts' expectations of 34.3 million euros, while research and development expenses fell 32% from a year earlier, driven by lower spending on the company's COVID-19 vaccine.",
        "Valneva said regulatory filings for its Lyme disease vaccine candidate co-developed with Pfizer, are now expected in 2026, a year later than previously announced.The two companies announced in February that they would stop testing the vaccine in roughly half of U.S. patients in a late-stage study, citing a breach of clinical trial guidelines by a third-party contractor.($1 = 0.9022 euros) (Reporting by Greta Rosen Fondahn and Laura Lenkiewicz; Editing by Muralikumar Anantharaman and Emelia Sithole-Matarise)"
    ]
}