{
    "articleURL": "/tvshowbiz/article-12039491/Riley-Keough-husband-Ben-Smith-Petersen-enjoy-casual-lunch-date-Calabasas.html",
    "content": [
        "Riley Keough enjoyed a casual lunch date with her handsome husband Ben Smith-Petersen in Calabasas on Tuesday. ",
        "The 33-year-old granddaughter of Elvis Presley – who recently shared that being a nepo baby is hard work – was dressed in a black long-sleeved shirt and simple jeans, while her stuntman beau kept it cool in a bright white T-shirt and brown pants.The pair's relaxed afternoon comes on the heels of Riley telling Vogue Australia that they could soon be moving Down Under. Gracing the cover this month, Keough told the publication that she is constantly searching for her Aussie 'dream home.'The Daisy Jones &amp; The Six star said: 'I'm just really happy when I'm there. I have certain countries and places that I just feel so free in, and I think Australia's one of them.' ",
        "Referencing her romance with Smith-Petersen, Keough added: 'And I fell in love there. I think that when you fall in love in a place, it's always got that memory to it.'If it wasn't so far, I would live there in a heartbeat. We talk about it all the time. I would love to have a house there. I love being in Australia.'The couple met on the set of Mad Max: Fury Road and became engaged in 2014, marrying in Napa the following year.The couple share one daughter together – a baby girl born in secret last year.",
        "Riley trading in Los Angeles for Australia is understandable, since the actress has suffered a series of personal tragedies in Hollywood. Her mother Lisa Marie Presley's shocking death in January at the age of 54 spawned a brutal court battle with her grandmother Priscilla, 77. The pair have reportedly been at odds over Lisa Marie's $35 million estate, with Priscilla fighting to be reinstated as sole trustee after being replaced by Riley and her late brother Benjamin in 2016.Benjamin died by suicide in 2020, meaning the fortune now belongs to Keough, but Priscilla is contending the 2016 amendment and has questioned the authenticity of her late daughter's signatures on the document.",
        "But the battle between Priscilla and Riley seems to be dying down as Priscilla recently declared that rumors of a feud were 'not true' and that she and her granddaughter are 'fine.'Lisa Marie's half-brother Navarone Garcia, 36, confirmed that his mother Priscilla and niece Riley had been out for dinner in a bid to reconnect.Asked directly on Instagram if the pair are on speaking terms, he insisted: 'Yes they are fine. No feud, we did go to dinner, it went great, it's all good.'Riley is the eldest of Lisa Marie's four children. The late singer had four tumultuous marriages and Riley was fathered by her first husband, musician Danny Keough.  "
    ]
}