{
    "articleURL": "/wires/reuters/article-12040873/One-five-UK-households-buy-groceries-coronation-NIQ.html",
    "content": [
        "King Charles to be crowned on May 6",
        "Britain has extra bank holiday on May 8Boost to sales of beer, wine, spirits and treats expectedBy James DaveyLONDON, May 3 (Reuters) - One in five British households intend to buy extra or special groceries for King Charles' coronation as an extended weekend brings families and friends together, survey data from market researcher NIQ showed on Wednesday.Britain's new monarch will be crowned at Westminster Abbey in a ceremony full of pomp and pageantry on May 6.\"As we saw over the Jubilee weekend (in June 2022) shoppers celebrated with fizz and teatime treats, so there could be a demand for similar products this year despite shoppers wanting to make savings,\" Mike Watkins, NIQ´s UK head of retailer and business insight, said.He said beers, wines and spirits were likely to be \"a footfall driver\" for supermarkets.NIQ, previously known as NielsenIQ, noted that the late Queen Elizabeth's Jubilee week to June 4 2022 saw sales at UK supermarkets top 2.7 billion pounds ($3.4 billion), a 10% increase on the year-to-date average.The researcher also said 15% of UK households intend to buy coronation memorabilia.However, Pantheon Macroeconomics estimated Britain's gross domestic product will fall by 0.2% month-to-month in May, with all of that decline due to the lost working day on Monday May 8 for a coronation holiday.",
        "NIQ said total UK grocery sales rose 9.7% in the four weeks to April 22 year-on-year. Store visits by shoppers rose 4.5%, while online's share of fast-moving consumer goods spend dipped to 10.8% from 11.1% last month.Echoing data from rival market researcher Kantar last week, NIQ said discounters Aldi and Lidl continued to be the fastest growing grocers over the 12 weeks to April 22, with sales up 23.6% and 21.6% respectively.Sales were up 9.7% at both market leader Tesco and No. 2 Sainsbury's, while they increased 14.5% at Marks &amp;amp; Spencer.UK food prices soared 15.7% in the year to April, the biggest increase in records going back to 2005, the British Retail Consortium said on Tuesday. ($1 = 0.8021 pounds) (Reporting by James Davey; additional reporting by David Milliken;)"
    ]
}