{
    "articleURL": "/news/article-12042377/How-Kyivs-elite-troops-compare-Putins-ultimate-forces.html",
    "content": [
        "Ukraine and Russia have been using their Special Operation Forces differentlyWhile Ukraine's commandos have been wreaking havoc behind enemy lines, Russia's have been joining ground assaults with poorly trained infantry On February 26, 2020 – two days after Vladimir Putin ordered the invasion of Ukraine – Russian Spetsnaz units hatched a plan to hunt down and assassinate President Volodymyr Zelensky and other senior officials.",
        "The plot was long in the making. At least one of the units – said to be made up of personnel from Russia's near-mythical 'Zaslon' unit - was already deeply embedded within Kyiv before the invasion, disguised as civilians and Ukrainian soldiers.A further 400 Russian mercenaries from the Wagner group were reported to have arrived in the city by late February 2022, while Chechen leader Ramzan Kadyrov had also been ordered to send his own forces to eliminate Ukrainian leadership.Other Spetsnaz troops parachuted into regions around the Ukrainian capital, and gun battles broke out on the streets of the city, moving closer to the presidential palace that had hurriedly been turned into a fortress in anticipation of the invasion.The exact details of what happened over the days that followed are foggy, as is the nature of special operations, but what is known is that Ukraine's own Special Operations Forces (SOF) units sprang into action as Kyiv came under attack.",
        "On March 2, they ambushed and destroyed a Russian convoy carrying elite Chechen fighters under the National Guard of Russia, killing several – reportedly including the unit's commander - General Magomed Tushayev, although this has been disputed.Ultimately, Ukraine's forces successfully repelled the attempt on the presidential palace and, a month later, Russian forces pulled back entirely from Kyiv.",
        "Zelensky and his family – who refused offers from Britain and the US to be evacuated, opting to stay in Kyiv - were not captured or killed, and he has gone on to become a vital wartime leader for his embattled country.But there's a high chance that the outcome would have been vastly different had Ukraine's special forces failed, and the Russian assassins prevailed.Since then, the two countries' Spetsnaz units have been heavily involved in the on-going 14-month conflict, but in vastly different ways.Here, as Ukraine prepares to launch its next counteroffensive against Russia, MailOnline looks at how the paths of their respective Special Operations Forces diverged from the initial clash in the capital...Ukraine Special Operations Forces (SOF) vs Russian SpetsnazBoth Ukrainian and Russian commando units share their roots in the Soviet Union.Known as Spetsnaz, which historically referred to the Soviet Union's Spetsnaz GRU, the units made up the covert operations branch of the military intelligence service and other security services before the union broke up.Because Spetsnaz is a Russian word, it typically refers to Russia's special forces, but with the break-up of the Soviet Union in 1991, other post-soviet states also inherited their special forces from the now-defunct Soviet security agencies.As is the case with other military hardware such as tanks, fighter jets and aircraft, Russian and Ukrainian Spetsnaz have also been known to use much of the same equipment - such as various models of AK-74s and Glock sidearms.",
        "However, the influx of western weaponry into the Ukrainian military - particularly over the last two years, while Russia has advanced its weaponry from the Soviet era - has meant their equipment has diverged.Differences in how Ukraine and Russian special forces operate have also emerged over the course of the on-going conflict.Ukraine's highly-trained elite units - modelled on western special forces such as Britain's SAS - are limited in number, and so have been deployed in a more conventional and precise way.",
        "This has seen them working behind enemy lines to disrupt Russian war efforts, destroy key targets, and organise resistance movements in occupied territories.Videos of Ukraine's forces on the battlefield have shown them using drones (either to drop munitions or guide missiles to their targets) and weapons such as the hand-held Javelin missile launcher to destroy high value targets.Other footage from the Bakhmut battleground has shown Ukrainian snipers using thermal imaging to pick off advancing Russian troops hell-bent on seizing the city.In Russia's case, many of the units classed by Moscow as 'special forces' are often only defined by their superior equipment (and in some cases not even that).These so-called special forces have been used for reconnaissance missions, with recent reports placing them in ground assaults alongside regular troops.",
        "According to Alexander Lord, a strategic analyst at Sibylline: 'The organisation the Spetsnaz is not directly comparable to the Western concept of 'special forces', and they have frequently been used in ways that would be totally alien to the West.'And according to a recent slew of leaked US intelligence documents, Moscow has suffered devastating losses to its so-called 'elite' units as a result.That being said, Russia does boast true special forces units of their own.Known as Russia's Special Operations Forces (SOF), they are independent from the Russian army. While information around their activities in Ukraine since the 2022 invasion remains murky, they are known to have been involved in missions related to the annexation of Crimea in 2014 and during the Syrian Civil War.However, Russia threw many of its best forces into its brazen attempt to capture Kyiv, resulting in heavy casualties. Its doomed assault on Antonov Airport in the first weeks, for example, was deemed a massive failure by Russia's so called 'elite' units.Alpha Group Slightly more is known about the activities of Ukrainian special operations since Russian forces illegally crossed the border on February 24, 2022.There are several military units within Ukraine's own Special Operations Forces, with three being involved in land warfare: The 3rd Special Purpose Regiment, the 8th Special Purpose Regiment and the 140th Special Operations Forces Centre.",
        "The 140th is considered the most elite among them, with the unit in 2019 becoming certified as a special ops unit that can be involved in the NATO Response Force, the first from a non-NATO-member state.Meanwhile, the Security Service of Ukraine - Ukraine's law enforcement authority and main intelligence and security agency - also has its own special forces unit known as the 'Alpha Group' which was integral to the defence of Kyiv.The Alpha Group in particular has been visible at key points of the conflict.",
        "It is understood that the ambush on the Chechen convoy was carried out by the unit, meaning its soldiers were engaged in fighting from the very first days of the war. The Ukrainian side claimed to have destroyed 56 tanks in the convoy and to have killed hundreds of Chechen fighters in the Battle of Hostomel.In addition to the ambush, the unit was reported to have played a key role in repelling a 40-mile convoy advancing on Kyiv. The world watched in horror as satellite images showed hundreds - if not thousands - of Russian armoured vehicles rolled towards the capital, waiting for the seemingly inevitable mass siege and fall of Ukraine's capital city.But then the convoy stalled, and reports from the frontlines brought news of sabotage missions being carried out by a combination of artillery strikes, drones, mines and Ukrainian commandos.",
        "Alpha Group has been linked to a number of ambushes in the effort to stop the convoy, reportedly targeting vehicles at the front and the rear of the massive armoured column in order to halt the progress of the other vehicles.Videos in the opening phases of the war showed artillery strikes bombarding Russian tanks, but also javelin missiles - fired by hand-held launchers - striking and blowing up Moscow's heavy armour.Soldiers armed with the western anti-tank weapons were able to sneak up on Russian armour, fire their deadly missiles with pinpoint accuracy, and slip away into the dark. Russian troops in the column struggled for food and fuel as the supply line was disrupted, while the constant fear of attack made sleep difficult. As a result, morale among the Russian soldiers in the column fell.The stalled column became emblematic of Russia's early failures in relying on slow-moving soviet-era tactics. By contrast, Ukraine's more mobile special units equipped with modern tech - such as Alpha Group - wreaked havoc on the Russian army.After a month of being bogged down in thick mud and making little to no progress into the capital, the convoy was forced to pull back, along with all Russian forces in the Kyiv region, marking an embarrassing defeat for Vladimir Putin.",
        "Other Alpha Group fighters were also engaged in the doomed defence of Kharkiv, Ukraine's second largest city just 20 miles from the Russian border. The city was lost within days on account of it being so close to Russia, and a brutal Russian occupation gripped the city.But soon after Russian forces pulled back from Kyiv, Ukraine launched a lightning double-pronged counterattack in the north and south of the country, and Kharkiv was later liberated from Putin's occupying forces.In the north, Russia ceded thousands of miles of territory as Kyiv's forces pushed forward, led by Alpha Group fighters and other special forces units.The elite unit spearheaded Ukraine's efforts to liberate north-east regions of Ukraine, and were pictured by road signs for towns such as Kupiansk - surprising many commentators at how deep they were inside Russian-controlled territory.But it was Russian territory no-longer, and thanks to their efforts, the north-eastern town and many others in the region were rid of the Russian occupiers.Ukraine SOF While the exact operational details of missions carried out by Ukraine's special forces are unlikely to become public any time soon, if ever, the fingerprints of elite units have been all over suspicious and dramatic attacks since the war began.Some such attacks have reached deep over the frontlines into Russian-seized territory, and even Russia itself, prompting speculation of special forces involvement.One example was a huge blast in October 2022 that ripped a hole in the Kerch Bridge, the huge crossing linking Russia to annexed Crimea.",
        "The attack was an embarrassing blow for Putin. The bridge - hated by Ukrainians - had been a key project for the despot, and he even personally opened it in 2018. It was also a key supply route for Russian forces in the south of Ukraine.While Ukraine had said the bridge and other sites in Crimea were valid targets for their military, a strike on a target that far away from Ukraine-controlled territory had previously been unthinkable.But on October 8, a fire broke out on the bridge resulting in an explosion. A span of the bridge collapsed into the water below, while the railway bridge was also significantly damaged. Five people were killed.To add to Putin's misery, the explosion struck the day after his 70th birthday and one week after he announced the annexation of four Ukrainian regions - Donetsk, Kherson, Luhansk, and Zaporizhzhia - none of which were under full Russian control.The attack caused uproar in Russia, and celebrations in Ukraine. Immediately, questions were being asked: Could Ukraine have done this?To this day, no one has claimed responsibility, and President Zelensky stated that Ukraine 'did not order' the attack.However, many have suspected the involvement of Ukrainian special forces. The foreign minister of Estonia Urmas Reinsalu welcomed the explosion and suggested that Ukrainian special forces were behind it. He recalled that Ukrainian authorities had for a long time been calling for an attack on the bridge.To this day, the exact circumstances of the attack remain unclear. Videos from the bridge do not conclusively show how the attack took place. Some suggested elite units may have used a remote, underwater drone, although the prevailing theory is that a truck bomb was used.But whatever the cause, the blast specifically hit a weak point of the bridge, and even ignited a train carriage carrying large fuel tanks on the adjacent bridge - showing that it was a well planned and orchestrated attack.Speaking to the BBC at the time, a former British army explosives expert said of the blast: 'This is a masterpiece of clandestine sabotage.'",
        "Another attack deep inside Russian territory - this time in Russia itself - which raised the prospect of Ukrainian SOF involvement was a December blast that destroyed two Tu-95 bombers at the Engels airbase in Russia's Saratov region.The nuclear-capable Tu-95s - also known as bears - had been used by Russia to attack Ukrainian targets with missiles launched from a great distance, and were seen as a high-value target. But again, the attack took everyone by surprise.Video from the airbase on the morning of December 5 showed a huge flash of an explosion. Three Russian personnel were killed when a fuel truck detonated. The airbase is around 300 miles east of the most eastern point of Ukraine, and even further from the most eastern point currently under Ukrainian control.This means that no artillery in Ukraine's arsenal - even the American HIMARS - have the range to strike it from inside Kyiv's territory.As a result, it is believed that the attack was carried out by a long-range drone which can be launched from 600 miles away, well within range from Ukrainian territory.However, at least one of the strikes is understood to have been made with the help of special forces close to the base, who guided the drones to their target. This was according to a Ukrainian official speaking anonymously to the New York Times. ",
        "Ukrainian commandos are also believed to have been involved in the recapturing of Snake Island, a Ukrainian island located in the Black Sea.Snake Island was captured by Russian forces on the first day of Putin's invasion, when one border guard in its garrison gained near-mythic status.Moments before two Russian warships attacked the island, the crews hailed the garrison telling them to surrender. The border guard responded: 'Russian warship, go f**k yourself.' His remark went viral online and became a rallying cry across all of Ukraine - and even prompted the Ukrainian government to create a postage stamp honouring the soldiers there.From that point on, the island gained a symbolic significance, and not just for its vital tactical position, and on July 1, Ukraine was able to push Russian forces off the landmass once they were in-range of US-provided HIMARS missile systems.However, as Russia retreated, two Su-30 fighter jets bombed the island with phosphorus bombs, perhaps as a scorched-earth tactic to destroy any weapons and equipment left behind to prevent them from falling into Ukrainian hands.This led to Ukrainian military officials suspecting that Russia may have mined the island. Therefore, naval special forces units were sent in.Divers from Ukraine's SOF are understood to have approached the island underwater, checking for mines, before other forces moved in.",
        "Since the war began, there have been a suspicious number of assassinations of high-profile Russian officials, either in Russia itself or in occupied territory.One of the objectives of Ukraine's special forces since the war broke out has been to organise resistance movements in towns and cities captured by Russia, and these movements are suspected of being behind such attacks.A number of car bombs have been reported, in which officials - such as Russian-installed mayors - have been blown up.One high-profile attack was the assassination of Darya Dugina in Bolshie Vyazyomy, on the outskirts of Moscow, on August 20, 2022. Dugina was the daughter of Aleksandr Dugin, a supporter of Vladimir Putin and a far-right political philosopher, who has been a key supporter of the invasion of Ukraine. She is understood to have shared her father's views.Dugina's car exploded at around 9.45pm. Reports suggested that her father had been due to travel with her, but switched cars at the last minute. Investigators later said they found an explosive device fixed to the underside of her car. Two days after the attack, the Russian Federal Security Service (FSB) claimed the Ukrainian special forces were behind the killing.   ",
        "Russian SOF While Ukraine's special forces have set about covertly wreaking havoc behind enemy lines, and on Russia's early attempts to seize Kyiv, the role of Russia's Spetsnaz have - from what we know - been far less subtle or effective.According to American documents that were leaked online last month, Russia's senior commanders ordered their elite forces into direct combat in the early phases of the war- not trusting their conventional fighters to be effective on their own.As a result, the units have taken heavy losses.",
        "One of the leaked documents, seen by the Washington Post, showed before-and-after satellite imagery of a base used by the 22nd Separate Spetsnaz Brigade.The images of the base in southern Russia reveal that 'all but one of five Russian Separate Spetsnaz Brigades that returned from combat operations in Ukraine in late summer 2022 suffered significant losses,' The Post reports.The satellite images show the base in November 2021, and again a year later. The earlier image shows a well populated base full of vehicles, while the second is far more empty - which the US intel concluded shows a state of extreme depletion.The assessment says the 22nd Separate Spetsnaz Brigade as well as two other units have suffered an estimated 90 to 95 per cent attrition rate, The Post says.",
        "It takes four years for Russia to train a Spetsnaz soldier, according to the documents seen by the American publication, which concludes that it could take as long as a decade for Moscow to replenish its ranks of these elite units.Observers have expressed their shock over the tactic.Rob Lee, a Russia military expert and senior fellow with the Foreign Policy Research Institute, told The Post that by pushing special units to the front lines, Russian commanders have burned through them at an alarming rate.According to Sibylline's Alexander Lord, while the structure of Ukraine's special forces is now similar to those in the west, Russia takes a different approach.'Russia's Spetsnaz 'special designation' forces have a particular reputation, which often leads to direct comparisons with the UK's SAS or US Delta Force special forces,' he explains to MailOnline. 'However, the organisation of the Spetsnaz is not directly comparable to the Western concept of special forces.'One such difference, he says, is the fact that Russian conscripts form a 'significant contingent' of Russia's Spetsnaz units.'The majority of Spetsnaz units are essentially good light infantry and reconnaissance forces, rather than top-tier special forces akin to the SAS,' Lord says. Therefore, Spetsnaz is not one single elite force, but instead should be viewed as 'highly diverse units that form part of a complex network of competing elite special forces, largely borne of the Kremlin's desire to avoid over reliance on a single force.'On account of different factions forming between Russia's supposed elite units, they often compete with each other for resources, or even with other Russian units such as the FSB's commando forces or the Foreign Intelligence Service's Zaslon unit.Lord says that Russia has deployed many of its elite forces, including Spetsnaz and VDV - the Russian Airborne Forces (which also suffered huge casualties in the early days of the war) - to prop up its front-line infantry.Watch: How did Russia lose HALF of its 45,000 elite paratroopers in seven months?",
        "'Moscow also did this in Chechnya and Georgia, and in many instances it has led to highly wasteful deployments of some of Russia's most competent forces,' he says. Pointing to Bakhmut as an example, he said the defensive efforts there by poorly trained infantry are becoming increasingly reliant on elite VDV units.General Colonel Mikhail Teplinsky, commander of the VDV, was recently appointed deputy commander of Russian operations in Ukraine - illustrating the growing importance of the Lord says the distinction 'between Russia's elite forces are becoming increasingly meaningless' as Putin's generals become more reliant on poorly trained reservists.These, he says, are being used 'to plug personnel gaps across the full-breadth of the Russian military – including its special forces.'One such example is the well respected 155th Naval Infantry Brigade, which was almost entirely wiped out in Ukraine and reconstituted with poorly trained troops.Lord says: 'This highly attritional war has seen a large proportion of Russia's well-trained units steadily wiped out and degraded, and the same has been true of its special forces.'Meanwhile, the activities of Russia's 'true' special forces units that are more akin to western units and those formed by Ukraine remain clouded in secrecy.Wagner PMC One group that has come out of the shadows since the invasion was launched is the notorious Wagner Private Military Company.The war has seen the mercenary group - seen as the de fato army of President Putin - shift from a secretive Moscow unit allegedly hired to carry out Putin's dubious activities in Syria and Africa (where Russia has military and mining interests) to a mainstream militia widely talked about in the media.And while Wagner had previously been seen as an off-the-books special forces unit doing the clandestine bidding of Putin around the world, they too have been used to prop-up ordinary Russian units as they take heavy casualties in Ukraine.The group was first known to be active in Ukraine in 2014 during Russia's annexation of the Crimean peninsula, where they operated with Moscow's own units.",
        "They were soon deployed to the Donbas, where a conflict was raging between the Ukrainian government and pro-Russian forces. There, they were able to help the Russian sympathisers destabilise local governments and take control of towns.The PMCs conducted stealth attacks, reconnaissance, intelligence-gathering and accompanied VIPs - activities that would be expected from special forces units.Later, in January 2022 and a month before Putin ordered the full-scale invasion of Ukraine, The Times reported that 400 Wagner mercenaries were flown from the Central African Republic tasked with assassinating Ukraine's President Zelensky.The plan was for the mercenaries to take control of the government in Kyiv and lay the groundwork for Russia to install a puppet government in its place.By March 3, The Times reported that the Ukrainian leader had survived three assassination attempts - two of which were orchestrated by Wagner.The group was also accused of being responsible for war crimes in the region surrounding Kyiv, with reports of torture and executions of prisoners of war. It was also implicated in the Bucha massacre where 419 civilians were killed.However, as with Russia's other supposed 'elite' units, Wagner's role over the course of the war has shifted from attempting clandestine missions to being used as a blunt instrument to try and overwhelm Ukrainian defences. After pulling back from Kyiv, Russia refocused its efforts on capturing territory in the east of Ukraine. Moscow's armies made steady advances, but were brought to a halt around the city of Bakhmut, where fighting continues to this day.In late 2022, Wagner's leader Yevgeny Prigozhin claimed his troops - and his troops alone - were responsible for the capture of smaller towns around the city.Around the same time, it began to emerge that Wagner had been recruiting convicts from Russian prisons to bolster its numbers. With the promise of a pardon if a recruited convict served and survived for six months, as many as 50,000 signed up.What was - a matter of months ago - seen as an elite, off the books unit capable of carrying out missions Russia's army otherwise could not, Wagner's forces instead became cannon fodder for Moscow's military.",
        "Fighting for the city descended into bloodshed, with Ukrainians likening the battle for Bakhmut to a First World War 'meatgrinder' as Wagner crashed thousands of its convict troops against a wall of machine guns and artillery strikes.After months of brutal fighting, Prigozhin dramatically announced on May 5, 2023 that his forces would pull out of the city they had been trying in vain to capture since last summer.Prigozhin said they would withdraw on May 10 - ending their involvement in the longest and bloodiest battle of the war - because of heavy losses and inadequate ammunition supplies. He asked defence chiefs to insert regular army troops in their place. 'I declare on behalf of the Wagner fighters, on behalf of the Wagner command, that on May 10, 2023, we are obliged to transfer positions in the settlement of Bakhmut to units of the defence ministry and withdraw the remains of Wagner to logistics camps to lick our wounds,' Prigozhin said in a statement.'I'm pulling Wagner units out of Bakhmut because in the absence of ammunition they're doomed to perish senselessly.'Earlier on Friday he appeared in a video surrounded by dozens of corpses he said were Wagner fighters, and was shown yelling and swearing at Defence Minister Sergei Shoigu and Chief of General Staff Valery Gerasimov.'We have a 70% shortage of ammunition. Shoigu! Gerasimov! Where is the ******* ammunition?' he shouted into the camera. His tirade contained a torrent of expletives that were bleeped out by his press service.What next for special forces in Ukraine? Prigozhin's announcement comes at a key juncture in the war, with Ukraine expected to launch a long-anticipated counter-offensive imminently.There have already been signs that Ukrainian special forces are once again spearheading the attack, with reports last month saying the highly-trained units had already crossed the Dnieper river, probing for weak points in Russian fortifications.Should Ukraine use the same tactics as it did in its dramatic counteroffensives last year, then we can expect to hear more whispers of Ukrainian commando units carrying out dramatic attacks behind enemy lines.Russia, meanwhile, is facing the prospect of a military force that is increasingly made up of poorly trained reservists. If it continues on the path of placing its most elite units on the frontlines, then even more are expected to die."
    ]
}