{
    "articleURL": "/wires/pa/article-12051181/Emma-Raducanu-undergoes-ankle-surgery-following-operation-hand.html",
    "content": [
        "Emma Raducanu has undergone ankle surgery as she continues to work her way through several fitness problems.",
        "The 2021 US Open champion has encountered a number of issues recently and pulled out of the Madrid Open last month with a hand injury.Earlier this week, the 20-year-old revealed she was set to have minor procedures on both hands and her left ankle in an effort to sort out the ongoing problems.As a result of the minor surgeries and recovery, Raducanu looks set to miss Wimbledon and the whole grass-court season.",
        "On Friday, Raducanu confirmed in an Instagram Live post from her hospital bed that the ankle operation had now been done. She also shared a photo of herself in a wheelchair, left ankle bandaged, along with the caption “2/3” followed by a smiling and heart emoji.",
        "Raducanu said: “I just had my ankle done, so two out of three done and one to go, but not for two weeks time.”The world number 85 had endured a stop-start season so far, with a last-16 appearance in Indian Wells in March followed by first-round exits at both the Miami Open and Porsche Tennis Grand Prix in Stuttgart.Following a first operation on her right hand, Raducanu wrote on Instagram: “It is safe to say the last 10 months have been difficult as I dealt with a recurring injury on a bone of both hands.",
        "“I tried my best to manage the pain and play through it for most of this year and end of last year by reducing practice load dramatically, missing weeks of training as well as cutting last season short to try heal it.“Unfortunately it’s not enough. I’m having a minor procedure done on both hands to resolve the issues.“I’m disappointed to share that I will be out for the next few months and while I am at it will have another minor procedure that is due on my ankle.“It pains me that I will miss the summer events and I tried to downplay the issues so I thank all my fans who continued to support me when you did not know the facts. Look forward to seeing you all back out there.”"
    ]
}