{
    "articleURL": "/wires/ap/article-12056145/We-started-running-8-killed-Texas-outlet-mall-shooting.html",
    "content": [
        "ALLEN, Texas (AP) - Federal officials are looking into whether the gunman who killed eight people at a Dallas-area mall expressed an interest in white supremacist ideology Sunday as they work to discern a motive for the attack, a law enforcement official told The Associated Press. The official cautioned the investigation is in its early stages.",
        "Federal agents have been reviewing social media accounts they believe were used by Mauricio Garcia, 33, and posts that expressed interest in white supremacist and neo-Nazi views, said the official, who could not discuss details of the investigation publicly and spoke to the AP on condition of anonymity.Garcia also had a patch on his chest when he was killed by police that read \"RWDS,\" an acronym for the phrase \"Right Wing Death Squad,\" which is popular among right-wing extremists and white supremacy groups, the official said.In addition to reviewing social media posts, federal agents have interviewed family members and associates of Garcia to ask about his ideological beliefs, the official said. Investigators are also reviewing financial records, other online posts they believe Garcia made and other electronic media, according to the official.Allen Police Chief Brian Harvey declined Sunday evening to answer questions from the AP, saying of the investigation, \"we actually don´t have a lot.\"The Texas Department of Public Safety identified Garcia as suspected of killing eight people at a Texas outlet mall, a day after the attack turned an afternoon of shopping into a massacre.",
        "Garcia was fatally shot Saturday by a police officer who happened to be near the suburban Dallas mall.A law enforcement official said investigators have been searching a Dallas motel near an interstate where Garcia had been staying. The official said police also found multiple weapons at the scene after Garcia was killed, including an AR-15-style rifle and a handgun.",
        "Two law enforcement officials said investigators also searched a Dallas home connected to the suspect. The officials spoke on condition of anonymity in order to discuss details of an ongoing investigation.A woman who lives three houses down from the low brick house said she saw a large group of uniformed officers go into the home Saturday between 6 p.m. and 7 p.m.\"They went in like real fast, and I seen them do that like twice,\" said Marsha Alexander, who said officers were still in the area when she went to bed around 9 p.m. to 10 p.m. They were gone by Sunday morning.On Sunday afternoon, a woman named Julie was sitting on the porch of her house, next door to the one searched the day before. She declined to give her last name to an AP reporter but said she awoke from a nap around 6 p.m. Saturday to see four police squad cars and a large group of officers outside her neighbor´s home.She said they entered the home and were joined about an hour later by FBI agents and other people wearing plainclothes, who she also took to be law enforcement.The woman said she did not know her neighbors well, but knew them to be \"very polite, very nice people.\" She said the man she now understands to have been the shooter was always friendly and would wave or honk his horn as he came and went.",
        "At about 2 p.m. Sunday, a man entered the home that was searched, but when reporters knocked on the door and waited, no one answered.In a statement, President Joe Biden said the assailant wore tactical gear and fired an AR-15-style weapon. He urged Congress to enact tighter restrictions on firearms and ammunition.\"Such an attack is too shocking to be so familiar. And yet, American communities have suffered roughly 200 mass shootings already this year, according to leading counts,\" said Biden, who ordered flags lowered to half-staff.Republicans in Congress, he said, \"cannot continue to meet this epidemic with a shrug.\"The shooting was the latest attack to contribute to the unprecedented pace of mass killings this year in the U.S. Barely a week before, five people were fatally shot in Cleveland, Texas, after a neighbor asked a man to stop firing his weapon while a baby slept, authorities said.This year has seen an average of about one mass killing per week, according to a database maintained by The Associated Press and USA Today in partnership with Northeastern University.Information about the gunman in Allen emerged as the community mourned the dead and awaited word on the seven people who were wounded. Authorities have not publicly identified those who were killed.",
        "The wounded remained hospitalized Sunday, three in critical condition and four in fair condition, the Allen Police Department said in a statement.John Mark Caton, senior pastor at Cottonwood Creek Church about two miles from the mall, offered prayers during a regular Sunday morning service for victims, first responders and the shoppers and employees who \"walked out past things they never should have seen.\"\"Some of our people were there. Some perhaps in this room. Some of our students were working in those stores and will be changed forever by this,\" Caton said.Caton offered similar sentiments during a Sunday night vigil at the church attended by Republican Gov. Greg Abbott, who has signed laws easing firearms restrictions following past mass shootings in Texas, and other elected leaders. Earlier that day, Abbott said on Fox News that Texas wouldn't enact gun control now.\"People want a quick solution,\" Abbott said. \"The long term solution here is to address the mental health issue.\"The attack unfolded at Allen Premium Outlets, a sprawling outdoor shopping center. Witnesses reported seeing children among the victims. Some said they also saw what appeared to be a police officer and a mall security guard unconscious on the ground.Andria Gaither, the assistant manager at the Tommy Hilfiger clothing store, said Sunday she was at the back of the store Saturday afternoon when she saw two young girls trying to hide in a dressing room. At first, she thought they were playing. Then she heard one say shots were being fired.",
        "Gaither looked around to see customers and the store manager running to the back of the store. Eventually, Gaither and the others ran out a back door.\"As soon as I got outside the back of the store, you could hear the shooting,\" Gaither said Sunday. \"It was so loud. I´d never ever heard anything like that in my life. It was deafening.\"Allen, about 25 miles (40 kilometers) north of downtown Dallas and with a population of about 105,000 residents, is among the Dallas-Fort Worth area's diverse suburbs. The area saw the largest Asian American growth rate of any major U.S. metro area, according to U.S. Census figures. Those statistics show Allen's population is about 19% Asian, 10% Black and 11% Hispanic.Allen also is connected to another of Texas´ recent mass shootings. Patrick Crusius lived there in 2019 before he posted a racist screed online that warned of a \"Hispanic invasion\" and drove to El Paso, where he opened fire at a Walmart, killing 23. Crusius, 24, pleaded guilty to federal hate crime and weapons charges in February.__Balsamo reported from Washington, and Stengle reported from Dallas. Associated Press writers Vanessa Alvarez in New York, James Vertuno in Austin, Adam Kealoha Causey in Dallas, Gene Johnson in Seattle and Rebecca Boone in Boise, Idaho, contributed to this report."
    ]
}