{
    "articleURL": "/wires/ap/article-12060019/Kings-pledge-service-defines-UKs-modern-monarchy.html",
    "content": [
        "LONDON (AP) - If one thread ran throughout the festivities marking the coronation of King Charles III, it was the idea of public service.",
        "It was there when Charles stood before a choirboy at Westminster Abbey on Saturday and promised to serve. It was there in the words of his son, Prince William, during Sunday's concert at Windsor Castle. And it is there in the day of volunteerism that the king called for on Monday's holiday in the U.K.It's a strange word from the lips of a king - not exactly the stuff of fairy tales, or monarchs leading armies into battle, or shouting, \"Off with their heads!\" It´s been more than 260 years since a British king led troops in the field, and Charles is legally barred from meddling in politics.Despite the trappings of medieval power on display at the coronation, a modern monarchy links the royal family to the people of the United Kingdom and the 14 other countries Charles serves as head of state.His grandfather, King George VI, is remembered for staying in London during the German bombing raids of World War II, showing the people that he was with them.His mother, Queen Elizabeth II, endeared herself to the nation with 70 years of public duties, sprinkling a bit of royal stardust on communities from Belfast to Brighton. As a young princess, she pledged that \"my whole life, whether it be short or long, will be devoted to your service.\"",
        "She did it not just with mundane ribbon cuttings and tree plantings, but also by boosting the morale of health care workers during the pandemic and supporting charities that helped veterans and the disadvantaged.Charles´ reign, and the future of the monarchy, will rest on whether he and his heir, Prince William, can maintain that link in a country that is much less deferential to royalty than the one that cheered Elizabeth´s coronation in 1953.\"It´s a marriage between the monarch and the people,´´ said former BBC royal correspondent Michael Cole. \"His life has been dedicated to service. And I think that you´re going to see that more and more and more. He´s very committed to it. He´s utterly sincere and it will be up for other people to judge - and I hope they judge fairly and honestly - because nobody can doubt his good intentions.´´Throughout the weekend, Charles pledged to serve and recognized the service of others. When he walked into Westminster Abbey on Saturday morning, with four page boys carrying the train of his flowing robe, he walked past prime ministers and global dignitaries.But in the side chapels, out of sight of the cameras, were hundreds of the usually anonymous people who make the United Kingdom tick. People like Barbara Swinn, a librarian from York, Kim Beck, who works with Afghan refugees in Solihull, and Naomi Brock, who does community work and looks after four foster children, and well as five of her own, in Olney. All were invited to the abbey to honor their service to their communities.",
        "Prince William picked up the theme Sunday night as 20,000 people gathered in the shadow of Windsor Castle for a concert headlined by Lionel Richie, Katy Perry and Take That.After saluting his father´s work to protect the environment and help the disadvantaged, William turned his attention to others.\"I also want to express my pride and gratitude for the millions of people who serve - in the forces, in classrooms, hospital wards and local communities,\" he said. \"I wish I could mention you all. Your service inspires us.\"The theme carried through to Monday's final act of the holiday weekend, a less-glitzy affair that is being called \"The Big Help Out.\" Hoping to inspire a new generation of volunteers, Buckingham Palace asked people around the country to donate a few hours to local charities.It´s a modern role for a modern monarchy.As Britain´s ceremonial head of state, the king is symbol of stability and unity who helps the nation celebrate its victories and consoles it during times of adversity.Some argue that these duties are better performed by an elected head of state, not a 74-year-old man who inherited wealth and status by an accident of birth. But supporters argue that Britain is better off with a hereditary monarch, above the fray of party politics, who doesn´t have to face voters regularly.",
        "That debate, muted recently out of respect for the aging queen, is likely to intensify during Charles´ reign. There were rumblings of that over the weekend, when police arrested anti-monarchist protesters.\"These arrests were not about protecting people from harm, but about protecting the king from embarrassment,\" said Graham Smith, head of the campaign group Republic. \"It was the state wanting to stamp down dissent in order to present an image of a grateful and consenting public at the time of the coronation.\"Others grumbled that the coronation was too filled with the trappings of the Church of England for a country that isn´t very religious, too much medieval pageantry for a modern nation that has ditched many of the formalities of the past, and too much military involvement for a diminished world power.These traditions provide the historical underpinnings of the monarchy and give the royal family its majesty and its mystique.But Charles - and William - know that´s not enough.A day after the crown was placed on Charles´ head, William ended his speech - like his grandmother decades earlier - by pledging to continue his father´s work.\"I commit myself to serve you all,\" the heir said.___Follow AP's coronation coverage at https://apnews.com/hub/king-charles-iii"
    ]
}