{
    "articleURL": "/news/article-12047091/Girl-six-discovers-lost-wedding-ring-pile-seaweed-using-toy-metal-detector.html",
    "content": [
        "Six year old Katie Spence found the wedding ring in Aberdour Harbour in FifeThe 'wee hero' used the toy to find her dad's friend ring under a pile of seaweedA six-year-old girl saved the day after using a toy metal detector to find a wedding ring that had been lost by her father's friend.",
        "Young Katie Spence discovered the gold wedding ring beneath a pile of seaweed after her dad's schoolfriend lost it in Aberdour Harbour in Fife.Katie's dad Scott, 39, bought the metal detector in 2012 after the 'wee' hero's mum, Maria, lost her own wedding ring on their honeymoon in Corsica.The toy detector was later put away in the garage for more than a decade, after it failed to find Maria's ring.  But young Katie's practice trawling the garden with the toy as toddler was put to good use on Sunday after the father and daughter duo were called down to the harbour to help find another lost ring. ",
        "The call came from Mr Spence's schoolfriend Neil Sneddon, 39, who had already spent hours looking for his gold wedding band after losing it in the harbour.The white gold ring slipped off his finger while Mr Sneddon, a trainee technician, was pulling a boat in.Katie's father from Dalgety Bay, Fife, said: 'Neil phoned me in a bit of a panic, asking if I could give him a hand.'We agreed that it would have to wait till the tide went back out, and I went down with my daughter.'She has this wee metal detector that I bought ten years ago.",
        "'My daughter's only six so it was before she was born, but when we went on our honeymoon to Corsica, we used it to try and find my wife's wedding ring she lost on the beach - but we never found it.'Ten years later it's found a ring but it's not my wife's.'When the tide went out, we spent quite a long time looking for Neil's ring and just when we were about to pack up, Katie started shouting 'it's beeping, it's beeping!''She had got her wee metal detector over the top of it and located it.'It was great she found it, it was under a pile of seaweed. The tide had gone out and moved it, I thought it was a needle in a haystack.'When Neil phoned me and asked me to get Katie down with the detector I thought it was a really slim chance of finding it. She's a wee hero.'Katie was given a cash reward for her efforts, and was so happy she did a little dance on the beach.Neil, from Kirkcaldy, Fife, said: 'I spent about three hours looking for it. I just joined the boat club and was pulling it up the slip and the ring slipped off my finger.",
        "'I phoned Scott because I knew he had a metal detector. Katie was overjoyed when it started beeping.'We were searching for about an hour and a half with metal detectors but I was looking for around an hour before they arrived.'It was a great moment, I couldn't believe it.'"
    ]
}