{
    "articleURL": "/debate/article-12039371/RISHI-SUNAK-Time-fight-fraud-gangs-making-money-appalling-scams.html",
    "content": [
        "Imagine a text from your child with a desperate plea for help. My first instinct – your first instinct – would be to do whatever they ask; to send whatever money they need. But sickeningly, it might be from one of the people out there preying on that most natural and loving human instinct. Exploiting our very worst fears as parents. And making money out of appalling scams like these.",
        "Two fifths of all crime in England and Wales is now classed as consumer fraud. It costs us nearly £7billion a year and new technologies are making these scams easier to do and harder to police.It’s time to take the fight to the scammers and fraudsters, and put an end to the despicable schemes that can devastate lives and livelihoods within seconds. Just as we’ve cut all other crime by half since 2010, we’ll stop at nothing to crack down on these crimes too.Today, we’re launching our new plan to stop the criminals in their tracks and break their warped business models.First, we’re going to do everything possible to stop these scams reaching people in the first place. Modern technology makes it simply too easy to bombard people with a barrage of fake calls, texts, emails and WhatsApp messages. Criminals know that even if only one attempt in a thousand works, across a population of tens of millions, they’ll still make a killing.",
        "So we’re outlawing so-called ‘SIM farms’, technical devices that allow criminals to send hundreds of thousands of scam texts instantly and cheaply. By working with Ofcom, we’re also going to stop more ‘spoof’ calls, where scammers impersonate UK numbers and trick people into thinking they’re speaking to banks, telephone companies or other legitimate businesses. And we will ban cold calls on all financial products, so that anyone who receives calls trying to sell them crypto currency or insurance will know it’s a scam.",
        "To root out more online fraud, we’re working with tech companies on a simple and consistent reporting tool so that reporting online scams will only ever be a few easy clicks away. And we’re going further to make sure social media platforms remove more fraudulent content, such as fake celebrity endorsements, through the Online Safety Bill.Second, we should be under no illusion about what we’re up against: roomfuls of people, whose sole job is to spend all day and all night trying to trick people out of their money. So we’re launching a new National Fraud Squad. Led by the National Crime Agency and the City of London Police, there’ll be over 400 new officers to hunt down these fraudsters and bring them to justice.",
        "We know 70 per cent of fraud in the UK originates overseas or has an international link, with the proceeds often funding organised crime and terror. We’ll step up work with our partners around the world and make greater use of the UK’s security services to help identify more fraudsters overseas, as we know how effective this can be. A single spoof website that we brought down last year had enabled 3.5million calls to be made targeting innocent Brits – and those who reported falling victim to this scam lost an average of £10,000.",
        "So we’ll do more to delay payments where banks suspect a fraud is taking place. Currently banks can delay a payment until the next working day. Now we’re looking at giving them more time to bring in law enforcement and further engage the customer to stop more people from losing their money.Finally, we’re going to arm people with the power of information and knowledge. When you fall victim to a scam, people feel upset, panicked, or embarrassed about being caught out, worried about whether they’ll get their money back. That’s why we’re investing £30million in a state-of-the-art reporting centre to better support victims so they know what to do immediately after falling victim to a scam, and how to protect themselves in the future.Our plan will help protect you and your loved ones from these scams and the predators who perpetrate them. Tackling this problem will help us grow our economy – one of my five priorities for the country. The time has come to put the fraudsters out of business. And that’s what I’m determined to do."
    ]
}