{
    "articleURL": "/wires/pa/article-12054771/Liverpool-fans-boo-national-anthem-hours-King-s-coronation.html",
    "content": [
        "Sport paid tribute to the King on the day of his coronation, but thousands of Liverpool fans booed the national anthem before kick-off in the Premier League match against Brentford at Anfield.",
        "On Saturday morning Chelsea forward Sam Kerr led the Australian delegation in the formal procession in London as they made their way into Westminster Abbey for the service.After cricketers stood to observe the national anthem ahead of day three of the current round of LV= Insurance County Championship matches, the afternoon’s football and rugby union matches also honoured the King.",
        "Premier League leaders Manchester City hosted Leeds at the Etihad Stadium, where the national anthem was played before kick-off as the players stood around the centre circle, while the big screen showed a symbol to mark the coronation.Ahead of the games at Bournemouth and Tottenham fans were given the opportunity to watch the ceremony, as were spectators at the Badminton Horse Trials in Gloucestershire, where events were paused during the ceremony.At the Recreation Ground, the big screen showed a message to mark the King’s coronation during the Gallagher Premiership match between Bath and Saracens, while the national anthem was also played ahead of the game between Sale and Newcastle in Salford.",
        "However, the anthem was not impeccably observed before the 5.30pm Premier League kick-off at Anfield.As the first notes of God Save the King began to play while both teams lined up around the centre circle, the majority of Anfield voiced its opposition before the Kop broke into chants of “Liverpool”.",
        "Booing the anthem is not new among Liverpool supporters, who have been doing so for years because of a long-standing resentment of the establishment due to Government attitudes towards the city dating back to the 1980s and, more recently, in relation to the handling of the Hillsborough disaster and the fight for justice.Liverpool felt they had been put in an impossible position by the Premier League “strongly suggesting” the anthem was played and sources admitted they had taken a “tough” decision to play it, but believed in safe freedom of expression, even though they were fully aware the response would not be favourable.During Wednesday’s win over Fulham the Kop sang “You can stick your coronation up your a***”.However, in his match programme notes Jurgen Klopp, who admitted he was “not an expert on English history or the monarchy”, wrote: “We will be busy with our own concerns, of course, but I would like to take this opportunity to wish King Charles III well, not just today but also for the future.”",
        "Speaking after the match about the booing, Klopp said: “We have freedom of speech. That means a free opinion as well. It was clear that something like this would happen, I think everyone knew it. And that is allowed. That is fine.",
        "“Nothing else happened and there was not any kind of chants or anything like that. It was just that the people showed (their feelings).“I don’t know exactly what it is but the people of Liverpool in the past were not always happy with how the city or the club was dealt with so that is what they did.”Further afield, Formula One sent its congratulations to the King, with several teams displaying the coronation emblem at the Miami Grand Prix.Sir Alastair Cook, who was knighted by Queen Elizabeth II in 2019, was among those cricketers who stood to observe the national anthem.Cook joined his Essex team-mates and opponents from Surrey, including England players Ollie Pope, Ben Foakes and Will Jacks, as they lined the boundary edge at Chelmsford while God Save the King played out to those in attendance.There were similar scenes at the likes of Headingley, the Ageas Bowl and Trent Bridge, although some of the fixtures were unable to start on time due to rain.",
        "England stars James Anderson, Stuart Broad and Jonny Bairstow were among the best known faces to take part in proceedings.Charles, previously the Prince of Wales, has been a patron of Glamorgan since 1986 and they posted a picture of him holding a bat during a visit to Sophia Gardens.",
        "Two matches in the Rachael Heyhoe Flint Trophy, at Old Trafford and Chester-le-Street, were marked in similar fashion.",
        "Events in London also had an impact at the Badminton Horse Trials.Saturday’s dressage started at 8am and paused at 10.15am to allow spectators to watch the coronation on big screens.The action resumed at 12.45pm, with some screen access still available for those wishing to take in the full ceremony."
    ]
}