{
    "articleURL": "/news/article-12050671/Sex-attacker-jailed-nine-years-strangling-raping-woman-came-aid.html",
    "content": [
        "Jordan Campbell hit the woman in the face, strangled and raped her at his homeThe 30-year-old, who has 37 convictions from 78 offences, was handed 15 years A man has been jailed for nine years for strangling and raping a Good Samaritan who came to his aid after he was injured on a night out.",
        "The woman approached Jordan Campbell when she saw he was hurt and helped him home, but when she went to leave he became aggressive and then attacked her.The 30-year-old, who has 37 convictions from 78 offences, hit the woman in the face, strangled and raped her before she left.In the five days that followed he bombarded the woman, who had earlier given him her phone number, with a series of threatening video calls, phone calls and messages.When she later went to police, Campbell, of Southampton, was arrested and charged with rape, intentional strangulation, controlling and coercive behaviour and harassment.",
        "He was convicted of the offences following a trial at Southampton Crown Court and has now been sentenced to 15 years in prison.The court heard he targeted his victim after she went to his aid following an incident in the Southampton area on Friday September 16 last year.The woman sustained bruising to her face, neck and chest area as a result of the attack in a room at Campbell's home.In a victim impact statement, she said the incident 'made me feel like I lost control of who I am. Any dignity I had was gone'.Campbell was handed a 15 years extended sentence - nine years in prison plus ordered to serve six years on extended licence.",
        "He was also sentenced to two years for the non-fatal strangulation offence and 12 months for harassment, to be served concurrently.Judge Peter Henry told him: 'Strangling people is extremely dangerous.'There is a wafer-thin difference between someone being left alive, with brain damage or death.'I have no doubt that you pose a high risk of causing serious harm.'A restraining order was also made banning him from contacting his victim.Campbell has 37 convictions from 78 offences.After the case, Detective Constable Joanne Boyd said: 'I am hopeful the sentencing will allow the victim to begin to process her ordeal, provide her with that closure and begin to move forward with her life knowing Jordan Campbell can no longer cause her harm.'"
    ]
}