{
    "articleURL": "/news/article-12055529/Revellers-enjoy-night-Coronation-weekend-complete-patriotic-flags.html",
    "content": [
        "Images show revellers enjoying a night out in Newcastle on Coronation night Many donned Union Jacks and brought their own flags to their special night out People across the country have taken to the streets to celebrate the Coronation of King Charles III. ",
        "Images show revellers across the UK celebrating the crowning of the new monarch with a big night out, many complete with patriotic flags and wearing red, white and blue. Others donned crowns of their own as they hit the town over the second consecutive Bank Holiday weekend. Some even brought commemorative flags bearing the face of the King on their night out.  The pictures come after a day of celebrations in the capital and beyond, despite the cold and wet weather. ",
        "Well-wishers have not been deterred by the unseasonably damp weather, and turned out in their thousands to watch the Coronation parade from Westminster Abbey to Buckingham Palace, and that jubilant mood has continued into the evening. It comes after the Royal Family released a few images of their own of the very special day. The official images showcase a series of special moments for the King and Queen Camilla, who are dressed in their full regalia in each shot.One shows the pair looking out onto The Mall from the Palace balcony, waving to the tens of thousands of cheering Royal fans who waited patiently to catch a glimpse of them.Two others depicts them standing shoulder-to-shoulder - one in which they appear to share an intimate, personal word to each other, while the other shows them watching the magnificent red, white and blue display from the Red Arrows flypast dominates the London sky.",
        "Further images taken from inside the Palace shows Charles and Camilla smiling together, and provides a closer look at their attire for the historic ceremony.Charles and Camilla's next scheduled appearance is tomorrow evening's Coronation Concert at Windsor Castle, with headline acts including Lionel Richie and Katy Perry. Other members of the Royal Family will join 'Big Lunches' across the country on Sunday."
    ]
}