{
    "articleURL": "/news/article-12044163/Here-look-inside-Ed-Sheerans-36K-month-Brooklyn-rental-fights-Marvin-Gaye-lawsuit.html",
    "content": [
        "Ed Sheeran rented a $36,000-per months four-bedroom apartment in BrooklynThe apartment was the most expensive rental in Brooklyn when listed in JanuarySheeran is defending himself after it was alleged he ripped off Marvin Gaye's 'Let's Get it On' with his hit track 'Thinking Out Loud,' which he has deniedPop singer Ed Sheeran has rented a $36,000-per-month apartment in Brooklyn while he defends himself in a $100million copyright trial alleging one of his songs ripped off a Marvin Gaye track.",
        "Sheeran's new pad sits alongside Brooklyn Bridge Park, steps from the iconic bridge itself, and boasts stunning views of the downtown Manhattan skyline.The 32-year-old British singer-songwriter has been in and out of a Manhattan courthouse for the last week while defending himself against claims that his hit 'Thinking Out Loud' borrowed excessively heavily from Marvin Gaye's 'Let's Get it On.'He has vehemently denied the claims he infringed upon Gaye and his co-writer Ed Townsend's 1973 hit, and even vowed that he will be 'done' with music if found guilty.His new luxury apartment, listed by Societe Real Estate's Sarah Williams, has four bedrooms and four bathrooms spread over 3,239 square-feet and two floors. When it first hit the market in January, the apartment was the most expensive in all of Brooklyn.",
        "'There's a serious commitment to craftsmanship inside the penthouse. It features dramatic 16-foot ceilings and soaring Manhattan skyline views. Five star service with immense security measures,' said broker and agency President Ms Williams.The sprawling apartment comes furnished with luxury furniture from brands like West Elm, Crate and Barrel, Rejuvenation, Arteriors, Gervasoni and Cassina, according to the listing.Hardwood covers the floors across many of the rooms, a wrap-around kitchen with walnut cabinets and marble countertops looks out on to a dining and breakfast area on the second floor, while a wide staircase stretches down to a double-long den and living room with two-story ceilings lined with windows top to bottom.",
        "Bookshelves line the walls behind the stairs across the first floor, where all four of the apartment's bedrooms are located— three on one side of the apartment, with the master facing the river and Manhattan on the other.The master bedroom and the living room both open out onto a 32-foot wide terrace beneath another terrace on the floor above. The roof has its own private terrace that is reached by another wide staircase.All terraces are appointed with designer-maintained foliage and furniture, while the rooftop has a full grill and dining area.The bathrooms feature spa-worthy amenities including walk-in glass showers, bathtubs, and dynamic lighting.It is unclear whether he will remain in the apartment in the long term, or is only leasing it for the duration of the trial. Sheeran primarily calls the United Kingdom home.",
        "Sheeran was seen climbing out of a black SUV in the rain, before entering the Manhattan courthouse Tuesday.He has been adamant that he did not rip off Gaye's crooning hit, Let's Get It On, saying he would end his career if found guilty.'If that happens, I'm done, I'm stopping,' Sheeran said when asked by his attorney Ilene Farkas about the toll the trial is taking on him.'I find it really insulting to devote my whole life to being a performer and a songwriter and have someone diminish it,' the 'Shape of You' singer added.",
        "His latest appearance at the court comes after it was made public that his beloved grandmother, who inspired one his most personal songs, had died. Anne Mary Sheeran, née Mulligan, died at a nursing home in the Republic of Ireland last Tuesday. She was the inspiration behind Sheeran's hit Nancy Mulligan, from his 2017 album Divide.The singer's father told a packed church in Ireland that his son had to miss the funeral to 'defend his integrity' as he fights a copyright infringement case before a Manhattan Federal jury, based on alleged similarities between Marvin Gaye's 'Get it On' and Sheeran's hit 'Thinking Out Loud'. The superstar singer is believed to have tuned in online to bid goodbye to his grandmother. ",
        "Sheeran is being sued by Townsend's heirs, who claim there are 'striking similarities' between the tracks. They are seeking a massive $100million in restitution.   At the Manhattan federal court last week, lawyers for Townsend's heirs displayed a video of Sheeran transitioning seamlessly between 'Thinking Out Loud' and 'Let's Get it On' during a live performance.Doing so, they said, amounted to a confession that he had ripped off the song.",
        "But in court on Monday, Sheeran said he and other performers frequently perform 'mash ups,' and that he had on other occasions combined 'Thinking Out Loud' with Van Morrison's 'Crazy in Love' and Dolly Parton's 'I Will Always Love You.'",
        "'I mash up songs at lots of gigs. Many songs have similar chords. You can go from 'Let It Be' to 'No Woman No Cry' and switch back,' he said.'And quite frankly, if I'd done what you're accusing me of doing, I'd be quite an idiot to stand on a stage in front of 20,000 people and do that,' he added.He also noted his hit song was actually inspired by Irish musician Van Morrison. To prove his point, the singer strummed the four-chord sequence he is accused of lifting from 'Let's Get it On,' as part of his rendition of Morrison tracks, including 'Tupelo Honey' and 'Crazy Love.'"
    ]
}