{
    "articleURL": "/sport/football/article-12061375/KATHRYN-BATTE-womens-game-needs-project-like-Trents-help-players-fall-wayside.html",
    "content": [
        "Liverpool star has set up an initiative to help players rejected by club academies There is a path for girls from academies through to the Women’s Super LeagueImportant that support is in place for players dropped aged between 13-16There is a side to football we do not talk about enough. Those were the words of Trent Alexander-Arnold just over a week ago when he launched ‘The After Academy’ — a project to help young players released by football clubs.",
        "The conversation around the high number of hopefuls who do not make it as professionals and the importance of aftercare has been raised regularly in the men’s game.Clearly, improvements are still needed and Alexander-Arnold’s scheme will do much to help those who see their dreams crushed.But what of the young girls who find themselves in the same boat? Those playing in the Women’s Super League grew up not believing they could sustain a full-time career through football. But the youngsters coming through academies now can see there is a path — that the dream is possible.The problem, though, is that it is even harder for girls to make it than boys.",
        "The WSL is the only fully professional league in England, with the Championship still a mixture of clubs that are full-time and hybrid (a combination of full-time and part-time players).For example, a 16-year-old boy released by a Premier League club has far more options than a 16-year-old girl released by a WSL team.The issue has been brought into sharper focus following the launch of 20 Professional Game Academies (PGA). Clubs have been awarded either a Category 1 licence, which will see two age groups catered for, or a Category 2 licence, which will cater for one. The new system is designed to improve standards and give players a better chance to develop.",
        "Manchester City have decided to merge their Under 16 age group with their PGA — which will cater for players over the age of 14. The club believe this will improve players’ academy experience, though some parents have raised concerns about not keeping the Under 16 age group separate.Only a handful of players have progressed to the club’s PGA for next season, which appears a theme across clubs.City have kept in regular contact with those not offered a place and have provided assistance in finding other clubs. This is something all clubs must do but the women’s game is still early in its professionalism of academies and there have been, and will continue to be, teething problems.Parents who saw their daughters released by another WSL club were unhappy with the after-care received and described the academy environment as toxic.One parent told Mail Sport that contracts were held over players’ heads, and criticised what they believed to be derogatory and offensive language used by certain coaches.",
        "There, perhaps, needs to be a realisation that girls’ academies cannot simply replicate what is in place on the men’s side. They can learn from what is already there — the good and the bad.It also does not help that girls cannot sign professional contracts until they are 18 — boys can sign full terms at 16. This rule means clubs can lose a player they have developed since the age of seven a week before their 18th birthday, without receiving compensation.",
        "This discourages clubs from producing their own players and, in turn, improving the coaching standards at academy level. It also means that girls cannot join the PFA or get any income from football until they are 18. There will be many who fall out of the game and the rejection they experience can be damaging.In the boys’ game, more than three-quarters of academy players are dropped between the ages of 13 and 16 — it would be interesting to know the numbers on the girls’ side. It is important that there is enough emotional support in place and a scheme similar to the one Alexander-Arnold has set up with the PFA would undoubtedly be of use to the girls who are released, for their wellbeing is just as important.Wright joins bouncy castle rowHave you ever heard of a football game being moved because of a bouncy castle? You have now. Tier-five club Colney Heath Ladies arrived at their home ground to find they were unable to use their usual pitch. The outraged club tweeted: ‘We are genuinely upset to have to inform you that @ColneyHeathFC decided that a bouncy castle takes precedence over a Women’s Football Match at tier 5. We were informed that we had to play on a park pitch today. We apologise to our opponents.’",
        "In a since-deleted post, Colney Heath FC accused the women’s team of ‘politicising’ a community event, which they had been told would be taking place. The women’s team hit back, claiming they had not been informed the main pitch would not be available. They have received support from Arsenal legend Ian Wright, who said the decision was ‘absolutely ridiculous’ and an ‘embarrassment’.Former England captain Casey Stoney also weighed in, tweeting: ‘We think the game has moved forward. So many positive strides at the highest level but yet these attitudes still exist in the game. DO BETTER @ColneyHeathFC’.",
        "Kate nails Hammers woeWest Ham's defeat at home to Brighton has surely increased the pressure on manager Paul Konchesky. The Hammers have not won a league game since December, with seven defeats and two draws in their last nine games. Kate Longhurst, who has been with the club since 2018, wrote a telling message on social media that suggests all is not well. ‘Not once in my whole career have I felt so low on confidence and destroyed as I am in this moment,’ Longhurst said.‘If anyone thinks we don’t care, you’re wrong. We as players have stuck together and got each other’s back no matter what. We need something to change, to bring that belief back and we hope we can do that soon. We’re not representing the club how we want but more than anything we want to change that.’ ",
        "Rabjohn deal raises fearsEvie Rabjohn's move to Manchester United has caused some nervousness at Bristol City over the future of Brooke Aspin.Rabjohn signed her first professional contract with United after turning 18, meaning her former club Aston Villa were not entitled to compensation. ",
        "Aspin, who will be 18 in July, shares an agent with Rabjohn and has interest from three WSL clubs.The Robins are desperate not to lose the defender for nothing after seeing England star Lauren Hemp leave in the same circumstances in 2018.Arsenal have the same situation with Freya Godfrey, who turned 18 on Sunday, and United with Keira Barry, who can sign a professional deal in June.Gen-Z Football represent them all and have emerged as a major player in the women’s game in less than two years."
    ]
}