{
    "articleURL": "/sport/football/article-12056611/Notts-County-3-2-Boreham-Wood-Jodi-Jones-nets-extra-time-send-Magpies-Wembley.html",
    "content": [
        "Visitors took two-goal lead with goals from Femi Ilesanmi and Lee NdlovuBut Aden Baldwin's second-half double forced the game into extra timeJodi Jones netted with seconds remaining to send the Magpies to Wembley After 107 points and 117 goals in the regular season, Notts County were one minute away from it all counting for nothing.",
        "But finding a goal is something Luke Williams' side have made look easy, even if they needed two players who had never scored for them before to bail them out in the last minute — twice — to keep their season alive and send them to Saturday's play-off final at Wembley against Chesterfield.County trailed 2-0 at half-time at home to a Boreham Wood side that finished four places and 35 points behind them in the National League. They began their comeback with Aden Baldwin's piledriver, kept it alive in the seventh and final minute of stoppage time via the same source, then sealed victory in the last seconds of extra time when substitute Jodi Jones' shot burst too easily through the wrists of Joe McDonnell.Seconds later the full-time whistle triggered a pitch invasion from the 15,617 crowd at Meadow Lane, mostly joyous but with a healthy dose of relief that a historic season may still end in a Football League return after four years out.",
        "'I don't know if I've ever experienced that combination of emotions,' said Williams. 'It was like a lethal cocktail — if they can sell it, then we're all in trouble. I'm trying to search for the words but I can't find them.'",
        "NOTTS COUNTY: Slocombe, Cameron, Rawlinson, Austin (Scott 66), Langstaff, Nemane, Baldwin, Palmer, Rodrigues (O'Brien 103), Chicksen (Jones 78), BostockSubs not used: Brindley, MairGoals: Baldwin 47', Baldwin 90+7', Jones 119'Bookings: JonesCoach: Luke WilliamsBOREHAM WOOD: McDonnell, Ilesanmi, Evans, Broadbent (Newton 92), Ndlovu (Lewis 61), Marsh (Ricketts 89), Fyfield, Payne, Sousa, Brunt (Rees 68), BushSubs not used: AgbontohomaGoals: Ilesanmi 37', Ndlovu 45+3Bookings: NoneCoach: Luke GarrardVenue: Meadow LaneAttendance: 15,672",
        "Williams dedicated the victory to Jason Turner, the County chief executive who passed away at the age of 50 in March and whose funeral the Magpies boss was a pallbearer at on Wednesday.'It was a tough day,' he said. 'The whole time has been tough, to lose Jason. Jason looked after me, protected me, and nothing ever seemed to be a problem. I owe him so much.'The helping hand on the winning goal from McDonnell, who had joined Boreham Wood only two days before on an emergency loan from Eastleigh, balanced out his penalty save from Ruben Rodrigues midway through the second half. That had looked like the death knell for County until centre back Baldwin headed in his second goal of the game — and his County career — with just 55 seconds remaining.With Wrexham taking the only automatic promotion spot into the Football League, County were forced to walk the play-off tightrope. Last season they were seconds from Wembley, only for two goals at the death in normal time and extra time — sound familiar? — by Grimsby to inflict a heartbreaking defeat.This time they had to come from behind after a pair of defensive lapses saw Wood take a shock 2-0 lead. On 37 minutes, Sheffield United loanee George Broadbent slipped in behind the offside trap and had 15 yards of space to cross for Femi Ilesanmi, who bundled over the line from close range.",
        "And on the brink of half-time Baldwin was caught out by John Bostock's loose pass, letting in Lee Ndlovu who raced clear to silence the home crowd.Baldwin made amends two minutes into the second half when he strode forward into the space allowed by Wood's deep block and smacked a low 35-yard drive into McDonnell's bottom-right corner.The second arrived after he had made a crucial intervention to stop Ndlovu making it 3-1, after McDonnell had denied Rodrigues from 12 yards and after many County fans would have been coming to terms with another year of play-off misery.",
        "But Baldwin stooped to head in Jones' flat cross and earn his side an extra half-hour. They needed every second of it to keep their promotion dreams alive.'The players answered the questions asked of them in an unbelievable way,' said Williams. 'And we have a fanbase you're not gonna find anywhere. Between the players and the fans, we made sure this season didn't end here.'Liam Mandeville's  103rd-minute winner sent Chesterfield to Wembley as they finally saw off stern resistance from 10-man Bromley in their semi-final.Paul Cook's side came from a goal down to lead 2-1 in the 99th minute of normal time before Bromley's Michael Cheek equalised, but Mandeville hit back in extra time to seal a date with Notts County on Saturday."
    ]
}