{
    "articleURL": "/wires/aap/article-12058341/Qld-police-warn-vigilantes-angered-youth-crime-wave.html",
    "content": [
        "A vigilante mob frustrated by escalating youth crime surrounded homes in central Queensland as police and the premier warn against taking the law into their own hands.",
        "Authorities called for community calm on Monday after about 80 members of an online crime group staged a volatile protest in Rockhampton on Sunday.The protesters massed in Central Park in North Rockhampton led by former One Nation candidate Torin O'Brien after public posts on social media.The group surrounded two homes, banging on windows and doors and yelling at the occupants: \"The town wants to talk to you\".Capricornia District Superintendent Glen Pointing said dozens of police were called to intervene to protect the community.\"I believe one person ran away and that person was chased by a small group of people,\" Supt Pointing said.\"Whilst we understand, appreciate and empathise with the victims of crime, I just want to strongly impress upon people that taking the law into your own hands is fraught with danger.\"There are a number of unintended consequences that can result.\"Supt Pointing said police would ramp up patrols to ensure community calm as investigators review footage of the protests.Community anger over youth crime rose again last week after three people were killed in a collision involving a stolen Mercedes-Benz allegedly driven by a 13-year-old boy in Maryborough.Premier Annastacia Palaszczuk and her ministers have defended the government's response but admitted the actions of the community in Rockhampton were concerning.",
        "\"Please do not take the law into your own hands,\" she said.\"The police are employed to do that if you have evidence of wrongdoing or criminal activity, please report it to the police.\"Ms Palaszczuk feared the mob's actions could lead to serious injury.\"It is of concern that so many people would want to be doing that ... someone could get hurt.\"We acknowledge that people have very strong feelings about this in their local community but there are police that are on the ground that are there to serve the community and to actually resolve these issues.\"Liberal National Party leader David Crisafulli also said he understood community frustration, but \"vigilante justice\" was not a solution.\"No one wants to see vigilantism in the community - full stop, end of story,\" Mr Crusafulli said.\"What I want to see is more police to be able to do the job and the laws for them to be able to actually keep the community safe.\"Queensland Police Union president Ian Leavers said he also understood the feelings of the community but called for calm.\"I can understand the frustration on behalf of law-abiding people who have simply had enough,\" Mr Leavers told 4BC.\"I say to all sides can you just work with us (the police)? We're in a very difficult position, we have to protect life and property and maintain the peace.",
        "\"I don't want people to take the law into their own hands but on behalf of the police we understand their frustration, I understand why they do these things.\""
    ]
}