{
    "articleURL": "/wires/reuters/article-12048463/Soccer-Napoli-crowned-Serie-A-champions-following-draw-Udinese.html",
    "content": [
        "UDINE Italy, May 4 (Reuters) - Napoli won their third Serie A title, and their first in 33 years, on Thursday after a 1-1 draw at Udinese gave the Naples side an unassailable lead in the standings.",
        "Napoli's triumph ended the city's long wait for the Scudetto since Argentine great Diego Maradona led them to two championships in 1986-87 and 1989-90.A second-half goal by Victor Osimhen secured Napoli the title with five games remaining in the season.\"I am overwhelmed right now. It's an amazing feeling,\" Osimhen told DAZN. \"We've waited so many years for this moment, and to be able to deliver the Scudetto to the Neapolitans is something we will never forget.\"Napoli have 80 points, securing their position at the top of the table. Second-placed Lazio, who also have five games left to play, are 16 points adrift of Napoli.Visiting supporters at the capacity Stadio Friuli held aloft banners adorned with the image of the late Maradona, eagerly anticipating the long-coveted Scudetto.Sandi Lovric dampened the spirits of Napoli fans when he scored the opening goal after 13 minutes, with a well-placed shot that found the top-right corner of the box.After Udinese's goal, Napoli stepped up their attack. In the 53rd minute, Osimhen sparked jubilant celebrations among the visiting fans when he fired in the equaliser from a rebound.Udinese goalkeeper Marco Silvestri pulled off a save to block Piotr Zielinski's half-volley, keeping the scoreline at 1-1 and prolonging the jitters of the Napoli fans.",
        "As the final whistle blew, Napoli supporters rushed onto the pitch to celebrate the momentous occasion alongside the players.\"We were the underdogs at the start of the season. Not many believed in us and so many people wrote us off,\" Osimhen said.\"We believed from the start of the season that we have this great squad that can deliver the Scudetto.\" (Reporting by Tommy Lund in Gdansk, editing by Pritha Sarkar)"
    ]
}