{
    "articleURL": "/tvshowbiz/article-12057933/Katy-Perry-asks-Stella-McCartney-hard-hitting-questions-Britain-Coronation-Concert.html",
    "content": [
        "Katy Perry joined Stella McCartney backstage at the Coronation Concert on Sunday and asked the fashion designer some 'hard hitting questions' about British culture. ",
        "The American singer, 38, relaxed with the fashion designer, 51, ahead of her performance at Windsor Castle and shared some videos to Instagram.Speaking in a strong English accent, Katy asked Stella her opinion on the ongoing debate on whether milk should be added before or after removing the tea bag when enjoying a brew.The musician, who is married to Kent-born actor Orlando Bloom, asked her followers to discuss the age-old debate in the comments and said to blame her husband. Sparking the discussion, she questioned: 'Do I put the bag in, or do I take it out before the milk?'",
        "'Take it out before the milk,' Stella confirmed. Moving on, Katy then asked: 'Do we put put jam or cream on the scone first?'After correcting her pronunciation of scone, the designer responded: 'Clotted cream first, double clotted cream, because if you don't the jam squishes off.'Katy captioned the clip: 'Hard hitting q’s from backstage with Stella McCartney at the Coronation Concert on the BBC and PBS for us ‘mericans. Fight it all out in the comments and blame Orlando Bloom.'Taking to the stage later, the popstar looked sensational in a huge gold metallic gown as she entertained the 20,000 strong audience with a selection of her most famous hits.  ",
        "Beaming Katy thanked his majesty for the privilege and revealed her honour as she gushed: 'I got to bring my mum and stay in a castle!'.  Her show stopping frock featured a sculpted bodice with plunging neckline as well as an enormous princess skirt that made sure she could be seen from far and wide.It also boasted quirky sleeves with puff detailing at the shoulders and she completed the look with large gold earrings.",
        "Katy sported a glamorous palette of make-up with metallic accents and slicked her raven tresses back into a bun. She passionately grasped the colour coordinating microphone as she belted out her chart topping tracks Roar and Firework.Katy's impressive vocals were accompanied by an incredible light show and pyrotechnics as the audience cheered for more. Elsewhere, Nicole Scherzinger sang a popular Disney hit, Olly Murs took to the stage to show off his moves and Steve Winwood sang to spectators including the King and Queen and dozens of celebrities "
    ]
}