{
    "articleURL": "/wires/ap/article-12042083/EU-seeks-extend-sanctions-programs-include-corruption.html",
    "content": [
        "BRUSSELS (AP) - The European Union is working on plans to extend the sanctions regime that it uses to punish third countries for human-rights abuses to include grand corruption.",
        "The EU's executive Commission on Wednesday proposed the expansion because it believes serious corruption can undermine the rule of law, human rights and democracy. If adopted, the plans would include asset freezes and travel bans.\"Based on this framework, the European Union could ban perpetrators of corruption from entering the European Union to freeze perpetrators' assets in the European Union and any European Union person from making funds and economic resources available to perpetrators,\" said EU foreign affairs chief Josep Borrell.Grand corruption in third countries not only affects democracy there but can also turn against the EU when money is used to buy political influence in the 27-nation bloc. Belgian prosecutors are investigating several EU legislators and officials that are accused of being paid by Qatar and Morocco to influence decision-making at the assembly. Both countries deny the allegations.Borrell insisted the fight against corruption had to be ramped up both abroad and at home, with the EU Commission also proposing a raft of measures to toughen punishment and harmonize laws within the bloc.\"In the EU itself, we have a serious problem - I would compare corruption with a cancer, which also needs a lot of prevention, but also when prevention fails, then the proper treatment,\" said EU Commission Vice President Vera Jourova.",
        "Under the plans, the EU would move beyond bribery and make it easier to prosecute all forms of corruption, including illicit enrichment, embezzlement and abuse of power.On the global stage, the EU already has an overall human rights sanctions program to impose penalties for anything from genocide, slavery and torture to restrictions of freedom of speech. Now, the EU only has two sanctions regimes that include corruption - targeting Lebanonese and Moldovan individuals.Major EU allies like the United States and Canada already have incorporated corruption in their sanctions programs.The plans on corruption sanctions against third countries will now go to the member states for further debate before they can be approved. Once in place, they would provide a template that would make it easier for the bloc to go after corrupt officials worldwide instead of having to work each time with country-specific plans."
    ]
}