{
    "articleURL": "/tvshowbiz/article-12051993/Hollywood-star-dressed-King-Charles-he.html",
    "content": [
        "This Emmy nominated Hollywood actor can morph into just about anyone.",
        "And now he has taken on Prince Charles, who will become King Charles on Saturday during his star-studded coronation in England.The actor was seen in a red coat with his blue sash and gold medals with red-white-and-blue ribbons in place. On his lap was a Cavalier King Charles spaniel that stared into the camera.The actor is well known.He got his start on Saturday Night Live in the Eighties. Then the comedian parlayed that fame into a thriving movie career where he worked with everyone from Adam Sandler, Nicolas Cage and Mike Myers to Katie Holmes and Selena Gomez.Can you guess who this household name actor is?",
        "He is 67-year-old Dana Carvey.In honor of King Charles III’s upcoming coronation, PetSmart and Ryan Reynolds’ Maximum Effort have partnered to create a video featuring Carvey.The ad was from SixTwentySix and director Tom Morris. Dana has reprised his memorable impersonation of King Charles III from SNL.He encouraged viewers to adopt a dog through PetSmart Charities.  Ahead of the coronation, Carvey’s King Charles makes the connection between his name and that of the beloved family dog breed, a Cavalier King Charles spaniel.He asks that viewers refrain from buying a King Charles spaniel on coronation day and instead adopt a shelter dog.",
        "'Now be a good little doggy, daddy's got to go to work,' he begins in the video.'Coronation day is upon us and as your new king - or as your beloved actor impersonating your king - I make the following decree, let's not all run out and buy a bunch of Cavalier King Charles spaniels ok?'",
        "He reminds watchers what happened when everyone adopted Dalmatian dogs when 101 Dalmatians came out.They were adopted and returned after they stopped being a cute idea.'Can we please not f***ing do that again with Cavalier King Charles spaniels?' he asks. Carvey then encourages people to adopt shelter dogs instead through PetSmart charities.'Shelter dogs are incredibly loving dogs and will treat you like royalty!' Then a scruffy mutt named Linus jumped up on his lap.He then finishes with, 'Dog save the king!' On the PetSmart Instagram it read: 'While the King may be getting coronated, we know shelter pets are also deserving of the royal treatment. Bring home the next king or queen of your castle, or donate to assist homeless pets in discovering their very own throne. Make a difference today.'",
        "Buckingham Palace announced in October 2022 that the Coronation of His Majesty The King will take place on Saturday May 6, 2023.",
        "The Coronation Ceremony will take place at Westminster Abbey, London, and will be conducted by the Archbishop of Canterbury.The Ceremony will see His Majesty King Charles III crowned alongside The Queen Consort.'The Coronation will reflect the monarch’s role today and look towards the future, while being rooted in longstanding traditions and pageantry,' the announcement said.Dana - born Dana Thomas Carvey - is a comedian, actor, impressionist, screenwriter, and producer. He is best known for his seven seasons as a cast member on the NBC sketch comedy series Saturday Night Live from 1986 to 1993,.",
        "He earned him five consecutive Primetime Emmy Award nominations. Carvey was born in Missoula, Montana.In 1957, his family moved to Anderson, California. When he was three years old, his family moved to San Carlos, California, in the San Francisco Bay Area.Carvey had a minor role in Halloween II in 1981, and co-starred in One of the Boys in 1982, a short-lived television sitcom that also starred Mickey Rooney, Nathan Lane, and Meg Ryan.In 1984, Carvey had a small role in This Is Spinal Tap, in which he played a mime.His big break came in 1986, when he co-starred opposite Kirk Douglas and Burt Lancaster in Tough Guys. In 1986, Carvey became a household name when he joined the cast of  Saturday Night Live alongside Phil Hartman, Kevin Nealon, Jan Hooks, and Victoria Jackson.",
        "His top character was the Church Lady, a pious host of Church Chat.Throughout the election and presidency of George H. W. Bush, he was the designated impersonator of the president.",
        "In 1992, Carvey joined Mike Myers in Wayne's World, the film. A sequel, Wayne's World 2, was filmed and released in 1993.In 1994, Carvey starred in the film Clean Slate. He reprised many of his SNL characters in 1996 for The Dana Carvey Show, a short-lived prime-time variety show on ABC. In 2002, he returned to films in the spy comedy The Master of Disguise. Carvey did not appear in a film again until 2011's Jack and Jill with Adam Sandler and Katie Holmes.In 2015 he was one of the cast member's in the animated film Hotel Transylvania 2 which also starred Selena Gomez.Two years later he popped up in Sandy Wexler."
    ]
}