{
    "articleURL": "/wires/pa/article-12046947/Fighting-Khartoum-disrupts-efforts-deliver-aid-trapped-civilians.html",
    "content": [
        "Heavy shelling in the Sudanese capital of Khartoum has disrupted efforts to deliver aid to trapped civilians as yet another fragile and frequently violated truce ran out.",
        "Sudan has plunged into chaos since fighting erupted in mid-April between the country’s two top generals.There is increasing concern for those trapped and displaced by the fighting, and aid workers and civilians have said there is a dire lack of basic services, medical care, food and water.In central areas of Khartoum, sporadic explosions could be heard on Thursday, a day after the United Nations warned that the country’s people are “facing a humanitarian catastrophe”, and the latest in a series of ceasefires expired earlier in the day.“The situation is very dire,” Atiya Abdalla Atiya, secretary of the country’s doctors’ syndicate, said. “All forms of shelling can still be heard in Khartoum, whether air or artillery shelling.”Black plumes of smoke rising from central neighbourhoods dotted Khartoum’s skyline at midday.The fighting also raised questions about the viability of internationally backed initiatives seeking to bring an end to the fighting that has upended the country’s transition to democracy.The conflict started on April 15, preceded by months of escalating tensions between the military, led by General Abdel-Fattah Burhan, and a rival paramilitary group called the Rapid Support Forces (RSF) commanded by General Mohamed Hamdan Dagalo.The fighting turned urban areas into battlefields and foreign governments rushed to evacuate their diplomats and thousands of foreign nationals out of Sudan.",
        "Both sides have traded accusations of truce violations over the past weeks.On Thursday, each side claimed its forces were the subject of attacks. The military said late on Wednesday it clashed with RSF forces around key government institutions in Khartoum, including the Republican Palace in the capital’s centre.Ceasefire initiatives, put forward by the United States, Saudi Arabia, and the East African bloc known as IGAD, have all floated a path towards longer negotiations but both sides have shown little commitment to even short-term promises to stop the fighting.The doctors’ group has in recent days warned that at least 60% of hospitals located near areas of active fighting are out of service, either because they have been shelled or due to the shortage of medical personnel and supplies.Among those in a critical, life-threatening situation are some 12,000 patients with kidney failure with no access to dialysis facilities.“People suffering from chronic diseases are dying at home because functioning hospitals are only attending to the wounded,” said Mr Atiya, of the doctors’ syndicate.Kuwait’s government announced on Thursday that it will be dispatching flights carrying medical and humanitarian supplies to the city of Port Sudan, on Sudan’s Red Sea coast. One flight will be departing daily until Sunday, the Gulf Arab country’s state-run news agency KUNA said.",
        "The flights are meant to deliver at least 75 tons of humanitarian assistance to the Sudanese heath authorities and the Sudanese Red Crescent.Port Sudan, the country’s main seaport, experienced relative calm amid chaos elsewhere in the country and became a hub for tens of thousands of people looking to flee the fighting. It is now the entry point for an international effort to get aid supplies into the country.The conflict has so far killed at least 550 people, including civilians, and wounded more than 4,900. At least 334,000 people have been displaced inside Sudan, and tens of thousands more to neighbouring countries — Egypt, Chad, South Sudan, the Central African Republic and Ethiopia, according to UN agencies."
    ]
}