{
    "articleURL": "/news/article-12060821/Panicked-passengers-multiple-calls-911-Jordan-Neely-died.html",
    "content": [
        "Numerous people called to report a violent incident on the F train as ex-Marine Daniel Penny fatally restrained homeless man Jordan Neely on May 1Police said they responded to the scene within five minutes of the first 911 callThe fire department responded within 10 minutes of being called for assistance Numerous panicked bystanders called in to 911 as ex-Marine Daniel Penny fatally grappled with erratic homeless man Jordan Neely on the New York City subway, police records showed.",
        "The New York Police Department received their first call reporting a fight on the F train at 2:25pm on May 1, with another report coming in a minute later.At 2:27 pm two more calls were received - one telling of 'threats' being made on the train, and the other describing a rider 'armed with a knife or gun.' A call reporting an assault in progress was placed at 2:29pm, and at 2:30pm a second call reporting somebody making threats on the F train was made.According to Fox News, those calls were merely a 'summary' of the many calls placed to police during the altercation between Neely and Penny. The NYPD told DailyMail.com they 'responded to multiple 911 calls' as the incident played out at the Broadway-Lafayette Street station.Penny placed Neely in a chokehold as he menaced passengers, complaining that he was hungry and was ready to die or go to jail for life. The death has divided the city about whether Penny - who has not been charged with anything - is a killer or a hero.",
        "Police said they arrived on the scene by 2:30pm and began administering CPR on Neely, who had gone limp in Penny's grip by then.The New York Fire Department was called for assistance at 2:39pm, and they arrived less than ten-minutes later at 2:46pm.",
        "Neely was then taken to a nearby hospital, where he was declared dead. A medical examination revealed he died from compression of the neck, according to Fox News. It remains whether Neely died on the subway, or finally succumbed to his injuries at the hospital.It also remains unclear exactly what time Penny first put Neely in a chokehold or how long he held him. Some witnesses have reported Penny had his arm around Neely's neck for up to 15 minutes before he lost consciousness, according to NBC New York.Neely, 30, was homeless, schizophrenic and 'self-medicating with K2' - a potent synthetic cannabis - before his death, according to members of his family. Penny, 24, was detained and questioned by police after the incident, but was released on the grounds that he had been acting in self-defense.His lawyers released a statement defending his actions, saying that he 'could not have foreseen [Neely's] untimely death,' and noted Neely's long criminal record which includes two incidents of randomly punching strangers on the subway.In the face of outrage over Penny's release - which included politicians like Democratic Congresswoman Alexandria Ocasio-Cortez calling the death a 'murder' - a grand jury is expected to be impaneled this week to decide whether to press charge.",
        "In their statement, Penny's attorneys said he was trying to protect others from a mentally unstable and unpredictable stranger.",
        "'Earlier this week Daniel Penny was involved in a tragic incident on the NYC Subway, which ended in the death of Jordan Neely. We would first like to express, on behalf of Daniel Penny, our condolences to those close to Mr. Neely,' the press release began.'Mr. Neely had a documented history of violent and erratic behavior, the apparent result of ongoing and untreated mental illness. When Mr. Neely began aggressively threatening Daniel Penny and the other passengers, Daniel, with the help of others, acted to protect themselves, until help arrived. Daniel never intended to harm Mr. Neely.''For too long, those suffering from mental illness have been treated with indifference. We hope that out of this awful tragedy will come a new commitment by our elected officials to address the mental health crisis on our streets and subways,' the statement concluded.Neely's family were not impressed with Penny's statement, and said he belongs in prison.'Daniel Penny's press release is not an apology nor an expression of regret,' they said. 'It is a character assassination and a clear example of why he believes he was entitled to take Jordan's life.''He knew nothing about Jordan's history when he intentionally wrapped his arms around Jordan's neck, and squeezed and kept squeezing. His actions on the train and now his words show why he needs to be in prison.'",
        "They also begged Mayor Eric Adams to make contact with them.'The family wants you to know that Jordan matters,' they said. 'You seem to think others are more important than him. You cannot \"assist\" someone with a chokehold.'"
    ]
}