{
    "articleURL": "/news/article-12050535/What-happens-King-Charles-anointed-screen-for.html",
    "content": [
        "MailOnline reveals what exactly happens during this part of the coronation READ MORE: Full coronation schedule of events, itinerary and timings The official coronation ceremony of King Charles III is fast approaching, with anticipation building ahead of the event. ",
        "As part of the coronation ceremony, which will take place at Westminster Abbey, Camilla will also be crowned Queen. During proceedings, Charles will be anointed with oil, during which period he will be hidden from public view. But what actually happens when Charles is anointed? Why will he be hidden from view? Here is everything you need to know about Charles' anointing during his coronation ceremony.   ",
        "What is the significance of anointing in coronation?The anointing of the sovereign is the most sacred part of the coronation ceremony. Indeed, it is so sacred that, when Queen Elizabeth II was anointed, she was hidden from public view. Buckingham Palace have confirmed that Charles will also not be visible to the public, when he will be anointed by the Archbishop of Canterbury. To ensure the utmost privacy during this sacred occurrence, a screen will be used to ensure the anointing is appropriately respected. Depicting a tree with 56 leaves representing the Commonwealth nations, the hand-sewn design on the front of the screen bears the King’s cypher at the base of the trunk showing the sovereign as a servant of the ‘family of nations’.Sustainability – a long-held passion of the king – is a key theme of the design, even down to using poles made from a windblown oak tree from the royal estate at Windsor originally planted by the Duke of Northumberland in 1765 and special biodegradable thread.",
        "Charles selected iconographer Aiden Hart, a member of the Greek Orthodox Church who has created liturgical art and cathedral interiors for the Pope, Anglicans and his own faith during a 40-year career, to create a screen that will shield him from public view.Nick Gutfreund, who led the project to build the screen, said: ‘The screen is there to provide privacy to the most sacred part of the ceremony. Previously it was a canopy over the top, which didn’t provide real privacy. Now this three-sided screen provides absolute privacy during the process.’ By tradition, the Archbishop will apply the oil to the head, hands and breast of the Sovereign. The Queen Consort will also be anointed, though custom dictates a more modest single dab to the crown of the head. ",
        "At a ceremony in Jerusalem in March 2023, the anointing oil to be used for the coronation was consecrated by the Orthodox Patriarch of Jerusalem, His Beatitude Patriarch Theophilos III, who is the most senior Christian figure in the Holy Land. The Anglican Archbishop in Jerusalem, The Most Reverend Hosam Naoum was also present at the ceremony. What oil will Charles be anointed with?The sacred oil, which he will be anointed with by the Archbishop of Canterbury, will not be the traditional mix of unguents, spices and pungent animal parts, as was the case up to and including the late Queen's Coronation. ",
        "In the countdown to June 1953, officials suddenly discovered that the official phial of holy oil had been smashed by a wartime bomb landing on the Deanery of Westminster Abbey. It also transpired that the royal apothecary who had made that previous batch (ahead of the Coronation of Edward VII) had long-since passed away. His ingredients – including animal extracts – could be traced back to a Huguenot doctor, Theodore de Mayerne, who produced the oil for the ill-fated coronation of Charles I in 1626. However, no one knew the correct quantities. What is anointing oil made of?The oil is called 'chrism', but is better known as one of the gifts of the Three Wise Men – myyrh. Its origins as an anointing oil go back to the Book of Exodus in the Bible. This time, it has been blended from olives which have been freshly picked alongside the grave of Prince Philip's mother in Jerusalem, where she is buried on the Mount of Olives. ",
        "The olives were pressed just outside Bethlehem. The oil has been perfumed with essential oils - sesame, rose, jasmine, cinnamon, neroli, benzoin and amber - as well as orange blossom.Its spiritual credentials are, therefore, beyond reproach. It is the scent which will be different from last time.After attending the ceremony in Jerusalem earlier this year, the Archbishop of Canterbury stated: 'Since beginning the planning for the Coronation, my desire has been for a new Coronation Oil to be produced using olive oil from the Mount of Olives. ",
        "'This demonstrates the deep historic link between the Coronation, the Bible and the Holy Land. From ancient kings through to the present day, monarchs have been anointed with oil from this sacred place. As we prepare to anoint The King and The Queen Consort, I pray that they would be guided and strengthened by the Holy Spirit.' "
    ]
}