{
    "articleURL": "/wires/ap/article-12038571/Media-coalition-challenges-gag-order-Idaho-slayings.html",
    "content": [
        "BOISE, Idaho (AP) - A coalition of 30 news organizations launched another effort Monday to get a gag order lifted in the criminal case of a man accused of stabbing four University of Idaho students to death.",
        "The coalition, which includes The Associated Press, had asked the Idaho Supreme Court earlier this year to reject the gag order issued in the criminal case against Bryan Kohberger, contending it violates the First Amendment rights of a free press. The order prohibits attorneys, prosecutors, law enforcement agencies and others involved in the case from talking to the news media unless they are quoting directly from a court document.But last week the Idaho Supreme Court unanimously denied the request, saying the news groups should have first asked the lower court to have the order lifted. The Supreme Court justices did not weigh in on whether the gag order violates First Amendment rights.\"This Court has long respected the media´s role in our constitutional republic, and honored the promises in both the Idaho Constitution and First Amendment to the U.S. Constitution,\" Justice Gregory Moeller wrote in the high court´s decision, going on to quote a ruling from a federal case that said responsible press coverage, \"guards against the miscarriage of justice\" by subjecting the court system and those who are a part of it to public scrutiny.Still, Moeller wrote, the balancing act between the First Amendment protections afforded to the press and the Sixth Amendment fair trial rights promised to defendants has become increasingly difficult with the advent of the internet and social media.",
        "Now, the media coalition has challenged the gag order at the lower court level.",
        "Kohberger, 28, is charged with four counts of first-degree murder and burglary in connection with the stabbing deaths in Moscow, Idaho. Prosecutors have yet to reveal if they intend to seek the death penalty.The bodies of Madison Mogen, Kaylee Goncalves, Xana Kernodle and Ethan Chapin were found on Nov. 13, 2022, at a rental home across the street from the University of Idaho campus. The slayings shocked the rural Idaho community and neighboring Pullman, Washington, where Kohberger was a graduate student studying criminology at Washington State University.The case garnered widespread publicity, and in January Latah County Magistrate Judge Megan Marshall issued the sweeping gag order that has barred attorneys, law enforcement agencies and others associated with the case from talking or writing about it.The coalition of news organizations contends the gag order violates the right to free speech by prohibiting it from happening in the first place.Kohbergers' attorneys contend the gag order essentially requires the attorneys involved in the case to act ethically to ensure Kohberger gets a fair trial.Wendy Olson, the attorney representing the news coalition, said the ruling provided a clear road map for the organizations to challenge the gag order at the lower court level.",
        "The Goncalves family has also asked the lower court judge to lift the gag order, saying their attorney should be allowed to speak about the family's opinions on the case on their behalf. A hearing on the Goncalves' request has been set for May 25.High-publicity cases often present a conundrum for judges, who work to protect the defendant´s right to a fair trial. Courts sometimes feel that controlling the flow of information around the case - by forbidding those involved from talking about it - is an effective way to limit publicity.But gag orders can infringe on the First Amendment rights of the public and of the people involved in the case. News organizations that cover the courts serve a watchdog role, keeping the public informed about how the judicial branch operates.During the investigation into the University of Idaho students´ slayings, news organizations´ interviews with investigators and law enforcement officials often worked to quash misinformation spread online by people who styled themselves as sleuths on social media sites."
    ]
}