{
    "articleURL": "/wires/reuters/article-12039457/Fund-managers-Milken-eye-fixed-income-stocks-real-estate-lose-luster.html",
    "content": [
        "By Svea Herbst-Bayliss and Carolina Mandl",
        "BEVERLY HILLS, May 2 (Reuters) -Prominent investors including hedge fund and private equity managers at a major industry conference say they are shying away from stocks and real estate amid uncertainty over interest rates, fears of a recession and threat of a U.S. debt default.Instead, fixed income, which was unpopular when rates were low, is back in favor and seeing strong capital flows into products like bond funds, said fund managers at the Milken Institute Global Conference this week.Until now, investors made decisions on how to allocate their money based on models that looked at correlations between asset classes, statistics, returns and volatilities over the past 20 years, said Elizabeth Burton, a managing director and client investment strategist at Goldman Sachs.\"Things are very different now,\" she said.The shift in focus has been quick and is forcing investors to move away from some assets that had been popular recently. Six months ago, real estate was seen as the \"savior asset class\" but that is no longer the case, Burton said.Hedge fund and private equity fund managers plus top banking executives gathered at the conference that began Sunday with debates on how much more the Federal Reserve should raise interest rates and when rate cuts might begin.",
        "Attendees also discussed whether federal regulators should raise FDIC deposit insurance after First Republic Bank was seized and sold to JPMorgan, and how markets will react to even higher interest rates and potentially more market volatility.With the S&amp;amp;P 500 up 7.5% since January after a brutal 2022 when the index tumbled nearly 20% and bonds also fell, fund managers are hoping for more gains - though some at the conference said that smacked of rose-colored glasses.\"You get a good sense of consensus at these conferences,\" said Katie Koch, president and CEO of investment firm TCW. \"And I think people are still feeling a little too good. People are too happy.\"But some also worried that big companies like Microsoft and Apple that helped pull the S&amp;amp;P 500 index higher this year may be overvalued.\"I don't like equities because of the uncertainty,\" said Anastasia Titarchuk, chief investment officer at the New York State Common Retirement Fund.Others warned that companies will soon have to refinance their debt at higher rates, making them less attractive.Instead, thanks to higher interest rates, fixed income is once again playing a bigger role in portfolios.\"The Fed has helped us put the income back in fixed income,\" said Anne Walsh, Chief Investment Officer for Guggenheim Partners Investment Management.",
        "\"As a result, we're actually able to capture at least in the short run some very nice yields.\"Other investors also said secondary private equity funds that purchase assets from primary private equity investors could also become attractive as demand for liquidity rises sharply.Some investors have not given up on equities, though they caution that portfolio selections need to be made carefully.\"Bottom up fundamental investing, including crunching the numbers, is coming back as the risk-free rate has climbed,\" said Alexander Roepers, chief investment officer of investment firm Atlantic Investment Management, referring to the interest rate investors can expect on an investment that carries zero risk.As investors mulled what lies ahead for markets, the mood was more downbeat than in previous years - though at the conference at least, a wellness area for participants with hug-worthy puppies and massages offered some respite. (Reporting by Svea Herbst-Bayliss, editing by Deepa Babington)"
    ]
}