{
    "articleURL": "/news/article-12052009/Trapped-commuters-London-tube-smash-glass-escape-train-fire-Clapham-Common-station.html",
    "content": [
        "Commuters smash windows to escape as smoke fills tube at Clapham CommonBuilders with hammers smashed a tube carriage's windows this evening after the train filled with smoke and passengers were left trapped after the 'doors wouldn't open'.",
        "Around 500 people had escaped the train by the time firefighters arrived and confirmed there was not a fire. British Transport Police said the issue with the train was caused by 'brake dust, which can often be confused with burning'.Footage from Clapham Common underground station showed passengers rammed against the doors as people on the outside tried to pry them open at around 5.50pm today.Tech sales worker Jake Sharp, 32, was on his way to see friends in central London when he saw the carnage unfold.He told MailOnline: 'There was a smell of smoke on the train, the train went down about five carriages into the tunnel and stopped, the train on the opposite side pulled in and people were running to get off the platform.",
        "'The whole time the carriages were filling with smoke and the doors did not or would not open and when we tried to open them they only opened maybe 10cm. 'Thanks to the workman on the platform on their way home they had hammers and other tools to smash all the windows for everyone to get out.'[There was] no response from station staff at all even with everyone's screams for help.'He added: 'TfL should be ashamed! The response from station staff was horrific!'",
        "British Transport Police London said: 'We received a report of a faulty train at Clapham Common shortly before 6pm this evening, and we are aware of a video showing passengers trying to leave the train. 'The issue is believed to have been caused by brake dust which can often be confused with burning.'",
        "A TfL spokesperson said: 'We're sorry for the distress caused at Clapham Common. 'The London Fire Brigade attended the station and confirmed there was no fire. 'We are investigating the details of this incident.' London Fire Brigade said: 'Firefighters were called to a report of smoke issuing from a train at Clapham Common Underground Station this evening.'Crews attended but following investigation, found no sign or evidence of a fire. 'Investigations are ongoing but the report of smoke is believed to have been caused by the train's brakes.'Around 500 people left the train before firefighters arrived. The Brigade has not received any reports of injuries.'The Brigade was called at 5.52pm and the incident was over for firefighters by 6.29pm.'Crews from Battersea, Tooting and Brixton fire stations attended the scene.'"
    ]
}