{
    "articleURL": "/wires/pa/article-12051357/King-greets-realm-prime-ministers-governors-general-lunch.html",
    "content": [
        "The King joined realm prime ministers and governors general for lunch before heading to a Commonwealth Heads of Government leaders meeting the day before his coronation.",
        "The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence were at the lunch at Buckingham Palace.Completing the royal contingent were the Duke and Duchess of Gloucester and the Duke of Kent.",
        "There were 42 at the lunch, including the Prime Minister Rishi Sunak, Australian prime minister Anthony Albanese, and prime minister of New Zealand Chris Hipkins.Guests arrived in the white drawing room before a drinks reception in the music room followed by lunch in the blue drawing room.Mr Sunak was laughing and chatting with guests while the Princess of Wales, wearing a white dress, spoke to leaders including Mr Albanese and Mr Hipkins.Kate could be heard chatting about the weather, which is expected to be wet on Saturday.Later Charles, who is head of the Commonwealth, attended a Commonwealth Heads of Government leaders meeting and garden reception at Marlborough House.",
        "The meeting came after Charles, William and Kate pleased crowds on The Mall with a surprise walkabout.Charles mingled with leaders at the meeting before they all gathered in the garden for a group photograph with the Commonwealth mace.Some 100 heads of state will be in London for the coronation on Saturday, with international representatives from 203 countries due to attend.",
        "French president Emmanuel Macron, the presidents of Germany and Italy, Frank-Walter Steinmeier and Sergio Mattarella, and Pakistan’s prime minister Shehbaz Sharif will be among those in Westminster Abbey.Chinese vice-president Han Zheng, who presided over a civil liberties crackdown in Hong Kong, is also on the King’s guest list, a move described as “outrageous” by Conservative MPs."
    ]
}