{
    "articleURL": "/wires/pa/article-12047387/All-regal-robes-golden-garments-worn-King-coronation.html",
    "content": [
        "The King will don regal robes, golden priestly vestments and simple white garments amid an assortment of wardrobe changes during his coronation ceremony.",
        "The outfits the monarch will wear at his coronation are, in order:– Robe of StateThe King will arrive wearing a crimson Robe of State, made for his grandfather George VI’s coronation in 1937.",
        "Buckingham Palace has yet to reveal what the King will wear under his Robe of State, whether a military uniform or otherwise.– Simple white linen shirtThe King will take off his “robes of status” and wear a simple white shirt for his sacred anointing, which takes place hidden behind a screen.The simple garment signifies that Charles comes before God as a servant.– Colobium SindonisAfter his anointing, the King will put on a sleeveless white garment called the Colobium Sindonis – Latin for shroud tunic.It is the first of a number of coronation vestments inspired by priestly attire and worn during his crowning.– SupertunicaOn top of the Colobium Sindonis goes the long shimmering gold-sleeved coat called the Supertunica.",
        "It was created for the King’s great-grandfather George V in 1911, and worn at successive coronations including by Elizabeth II.Made of cloth of gold, which is silk thread wrapped in thin pieces of gold or silver gilt metal, the glittering Supertunica, also known as the Close Pall of Cloth of Gold, weighs around 2kg and is embroidered with stylised arabesques and floral motifs.",
        "– Coronation Sword BeltAround the King’s waist, on top of the Supertunica, goes the Coronation Sword Belt also known as the Coronation Girdle.",
        "The embroidered cloth of gold has a gold buckle stamped with national emblems.It has a gold clip used for briefly attaching the Jewelled Sword of Offering and was worn by George VI.– Stole RoyalAfter the King is invested with some of the Crown Jewels, he will be dressed in further golden vestments to represent priestly garments.The Stole Royal – also known as the Coronation Stole – is a long, narrow embroidered band of gold silk which goes around the shoulders on top of the Supertunica, mirroring outfits worn by a priest or a bishop.– Robe RoyalThe Robe Royal, also known as the Imperial Mantle, then goes on top.",
        "The heavy cloak, weighing around 3-4kg, was made for the King’s extravagant ancestor George IV in 1821.Made from cloth of gold, it is brocaded with colourful motifs including fleur-de-lis as a nod to the ancient claim of England over France, as well as imperial eagles, and national floral emblems of red-pink roses, blue thistles and green shamrocks.The mantle is inspired by ancient coronation ensembles and its representation of priestly robes symbolises the divine nature of kingship.",
        "Heir to the throne the Prince of Wales enters the coronation theatre to help place the robe on his father, as does Baroness Gillian Merron, who served as the Board of Deputies of British Jews’ chief executive.– Coronation GloveThe Coronation Glove also known as the Coronation Gauntlet goes on the King’s right hand before he uses it to hold the Sovereign’s Sceptre with Cross.",
        "Made of white leather, it has a large cuff embroidered with gilt metal thread, wire and spangles in the form of national emblems including the Tudor rose, thistle, shamrock, oak leaves and acorns.The back of the hand has an embroidered ducal coronet above the coat of arms of the family of the Dukes of Newcastle.Charles, for reasons of sustainability and efficiency, has decided to reuse the glove worn by his grandfather – the last male monarch – George VI.Once the King is dressed in all his coronation vestments and been invested with his regalia, he can be crowned.– Robe of EstateAfter Holy Communion and at the end of the service, the King and Queen Consort move to St Edward’s Chapel behind the High Altar.The King takes off his vestments and puts on the Imperial State Crown.",
        "He then changes into his grandfather George VI’s purple velvet Robe of Estate for his departure from the Abbey.",
        "The Queen Consort’s robes:– Robe of StateCamilla will arrive wearing the late Queen’s crimson Robe of State which was made for Elizabeth II’s coronation in 1953, which has been conserved with adjustments, and has a train of 5.5 metres.",
        "– Robe of EstateAt the end of the ceremony, Camilla switches into her newly-made purple velvet Robe of Estate.The specially commissioned regal cloak with train is embroidered in goldwork threads, and intricately decorated with bees, a beetle and a host of flowers – drawing on the themes of nature and the environment.",
        "It pays tribute to the King by incorporating delphiniums – one of his favourite flowers which is also Camilla’s birth month flower – and in memory of Elizabeth II includes the late Queen’s favourite bloom, lily of the valley."
    ]
}