{
    "articleURL": "/wires/ap/article-12050997/German-chancellor-supports-permanent-UNSC-seat-Africa.html",
    "content": [
        "NAIROBI, Kenya (AP) - German Chancellor Olaf Scholz, on a visit to Kenya, has offered support to African countries seeking a permanent seat on the U.N Security Council.",
        "Scholz told his host, President William Ruto, that he believes in African-led solutions to African issues such as the ongoing conflict in Sudan.\"Germany therefore supports the efforts for permanent African seats on the U.N Security Council and we also support a formal seat for the African Union within the G-20,\" he said on Friday after bilateral talks with Ruto.Currently, three African states, Gabon, Ghana and Mozambique, are non-permanent members of the council.Calls in the past for African states to get at least one permanent seat in the council have been supported by various leaders including the U.N secretary general.Scholz expressed concern over the conflict in Sudan that has led to hundreds of deaths, and lauded Ruto´s mediation efforts.",
        "He said the two warring generals must end the fighting for the sake of civilians.\"The army and the RSF must end their military struggle for power, which is detrimental to the people of the country,\" he said.He reiterated that the African continent must lead in finding solutions for such conflicts.\"I am deeply convinced that initiatives for peace and stability in Africa that are led by African states themselves are particularly important,\" he said.Scholz was in Addis Ababa, Ethiopia, before arriving in Kenya, and had had met African Union officials there. He offered his support for a permanent AU seat in the Group of 20 leading industrialized and emerging economies.",
        "Philanthropy group ONE´s Germany director, Stephan Exo-Kreischer, said after Scholz´s statement in Ethiopia that Africa needs better representation internationally.\"A seat at the G-20 table is an important step towards a louder African voice on the world stage,\" he said in a statement."
    ]
}