{
    "articleURL": "/news/article-12055989/Army-officer-led-coronation-procession-tragically-lost-son-rare-form-bone-cancer-2019.html",
    "content": [
        "Lt Col James Shaw lost his five-year-old son Harry to Ewing’s Sarcoma in 2019He and his wife want to raise £500,000 for the Royal Marsden Cancer Charity The dashing cavalry officer who led more than 6,000 servicemen at yesterday's Coronation procession bears the weight of a terrible family tragedy, MailOnline has learned.",
        "Less than four years ago, Lieutenant Colonel James Shaw lost his five-year-old son Harry to Ewing’s Sarcoma, a rare form of bone cancer.Only a handful of the global TV audience of millions watching the 43-year-old Grenadier Guards commander in his proudest moment would have been aware of the private pain he and his wife Charlotte endured as Harry succumbed to the disease.But inspired by their little boy’s incredible bravery, Lt Col Shaw and his wife set out to raise £500,000 for the Royal Marsden Cancer Charity - and are well on their way to the target.In a moving post on the JustGiving site, Lt Col Shaw, a combat veteran of tours to Iraq and Afghanistan, now the Brigade Major of the Household Division, recounted the heartbreaking story of his son’s own 10-month long battle.",
        "He wrote: ‘Harry was diagnosed with cancer on 2 August 2018 when a routine scan on a small lump showed a tumour the size of a large baked potato inside Harry’s right chest. Harry was four.‘In the space of a few minutes on that hot, sunny afternoon, the Shaw family’s life was changed forever.’Despite their expectation that the condition would be treatable, Harry did not survive and died on June 1, 2019.",
        "Lt Col Shaw wrote: ‘Harry had four months of strong chemotherapy which he largely charged through. Totally unfazed by his immediate hair loss, he regularly attended school where he adored playing with his friends.‘January 2019 saw us at the Royal Brompton for chest surgery to remove the tumour and yet again Harry blew us away with his determination in recovery.‘Up to this point we were upbeat and even started to plan life after his cancer treatment; not in a million years did we imagine this would be without Harry.’Writing in the present tense, Lt Col Shaw explained: ‘We write “is” because right now it’s impossible to think of our beautiful little boy as “was”.He added: ‘Harry simply loves life. He’s cheeky, naughty but also a lovely polite little boy.‘Harry is at his happiest when by the sea building sandcastles, searching for shells or paddling in the freezing water!",
        "‘He’s a fit, strong lion of a boy who loves school, playing with his friends and running around getting up to mischief. He even inspired Lewis Hamilton to win a Grand Prix.’He described the loss of his son as being akin to ‘a giant train crash in your heart’, adding: ‘We would like to say Harry died in peace and comfort; to an extent he did, dying at home in his own bed surrounded by his toys and the people he loved.",
        "‘But the actual truth is the last few weeks of Harry’s life were marked by terrible pain and suffering that no human, not least a five-year-old boy, should endure.‘As parents, to sit and have to watch your child die slowly in pain and discomfort is a memory we hope time will heal.‘We can't let Harry die without doing something to try and ensure other little Harrys don’t go through the same thing. One of Harry’s favourite expressions during chemotherapy was: \"Let’s just get it done\".‘In honour of Harry’s \"let’s just get it done\" spirit, let’s raise some money to beat this awful disease and give future children and their families hope.’In May 2019, just weeks before Harry’s death, Formula 1 star Lewis Hamilton dedicated his win in the Spanish Grand Prix to the little boy, who sent him a video message of support.After Hamilton’s victory, Mercedes arranged for one of its cars to be flown out to Harry’s home, and later that year, Hamilton himself met Charlotte and James.The world champion had been alerted to his plight after he received a video message ahead the race in Barcelona.",
        "Hamilton said in a Instagram post at the time: 'Harry, you don’t know how much this message means to me buddy.",
        "'Thank you so much, you are my inspiration today Harry. I will try to make you proud.'You are such a strong boy, I wish I was as strong as you, I wanted the world to see how strong you are and ask everyone to send their best wishes and prayers to you during this hard time.'Sending you love Harry. God bless you. Your friend, Lewis.'England cricketer Jos Buttler, former England footballer Gary Lineker, and grand slam tennis champion Novak Djokovic, were among the big names to speak about Harry's illness on social media.Lt Col Shaw married City insurance executive Charlotte Terry in 2012. The couple live in London.The death of Harry is not the only tragedy to have afflicted the career soldier.A year after Lt Col Shaw graduated from Sandhurst, his best friend from university, Blake Hartley, 25, who also attended the Royal Military Academy a year behind him, disappeared on an Army training camp in the French Alps in 2004.It took over three years for his remains to be found in the River L’Arve, 40 miles downstream from where he went missing.Blake’s girlfriend at the time of his death, Beth Taylor-Stubbs, 42, told MailOnline: ‘We all met on our first day at Reading University. We were in White Knights halls of residence and shared a corridor and kitchen with one another.",
        "‘James and Blake were friends from day one and all of us who loved Blake went through a terrible period when he was missing. There is nothing worse than not knowing.‘James and I both read at Blake’s memorial service and if he were alive today, Blake would be so proud of James for what he has achieved.’",
        "Blake’s mother Sally Perrin, who has kept in touch with James over the years, said: ‘We will be watching out for him on Saturday and feel incredibly proud of him.‘He used to stay at our house when Blake was alive and they were best of friends. He graduated a year before Blake so he could not join in the search for Blake but he kept in touch with us.‘He is a delightful, lovely guy who has been through so much. He came to see us a couple of years ago with his wife and daughter and to see him in such a prominent role is a credit to his strength of character.’Sally, who is currently doing a sponsored walk for the Missing People charity, made eight trips to France in the three years her son was missing.She added: ‘He was eventually found by a remarkable retired engineer called Josef Dancet who had reported seeing a body in the river to the police at the time but was ignored.",
        "‘With his friend Claude they spent six months searching the river bank before they spotted what turned out to be Blake’s thigh bone.’Last year, Lt Col Shaw, a Grenadier Guard who as Brigade Major of the Household Division, is the Army’s lead on ceremonial events, also led the military ceremony for the Queen’s Platinum Jubilee, and a few months later, her State funeral.Yesterday's event dwarfed both of those, and will involve twice the number of troops.The procession of troops from the Army, Royal Navy and RAF was so long that Lt Col Shaw, riding his horse, Sovereign’s Shadow, was almost a mile away from the Gold State Coach bearing King Charles.And - rather than relying on pre-prepared plans – Lt Col Shaw and other officers started from scratch, even resorting to YouTube clips of grainy film of Queen Elizabeth II's Coronation in 1953 to help.He said: ‘For operation London Bridge [the Queen's funeral] there was a written plan, but we didn't have a set plan for the Coronation.",
        "‘We have historical precedents we can draw from. A lot of the 1953 Coronation is on YouTube so we took bits from there.’He decided to widen the parade to make it 15 soldiers wide.He added: ‘We looked at the scale of the 1953 Coronation and how we could take some of that and bring it in.‘Footguards today usually march six wide, but in 1953 they filled the width of the Mall. We decided to make the procession as wide as possible so that it's packed with troops and colour.’The Shaws’ campaign to raise £500,000 for the Royal Marsden - called Harry’s Giant Pledge - has already smashed through the £400,000 mark.They say the money raised will ‘fund pioneering research into a new treatment approach for children with sarcoma cancers. Harry’s legacy will fund a research team to test this new treatment and help the Harrys of the future.’"
    ]
}