{
    "articleURL": "/femail/real-life/article-12048779/Woman-shocked-price-rental-property-western-Sydney-studio-costs-325-400-week.html",
    "content": [
        "Mum Therese, 25, is looking for a new flat to live in Sydney She was stunned by the price of a single studio apartment A mum-of-two looking for a flat to rent was shocked at the 'unreasonable' price of apartments she claims are barely big enough to fit a single bed.",
        "Therese, 25, has been inspecting properties in Western Sydney for weeks and shared footage of two flats she looked at with a friend in late April. While the studio apartments appeared modern and clean, both were shockingly small. 'Tell me you're in a rental crisis without telling me you're in a rental crisis. These places are going from $325 to $400 a week - and let me just show you,' Therese said in a TikTok video.She claims the properties also aren't 'near anything of significance' to justify the cost, such as the CBD, shops, petrol stations or universities.Scroll down for video",
        "In the video, she walked down a narrow hallway into the main area of one of the units and said: 'Where's your bed going to fit? And this is [for] $350 a week!'Her 'short' friend then laid down on the floor beside one corner to further show just how small the flat is.The studio apartment was equipped with brand new appliances - including a mini fridge, washing machine and microwave - but Therese still wasn't impressed with the space.'You would think you only have enough room to fit a single bed, that's it,' she said. ",
        "In the video she added how in 2021 she paid $350 for a two-bedroom apartment with a balcony, two huge car spaces, a massive kitchen and a separate lounge room. ",
        "But amid interest rate hikes, inflation and the cost of living crisis, usually $350 only gets tenants a 'tiny room'. 'How are we meant to survive?' she asked. The second apartment also was modern and featured a decent sized bathroom and kitchen in a separate area to the bedroom.The video has since been viewed more than 40,000 times and others gave their opinion on the current rental crisis. 'What a rip off,' one commented, another said: 'You should take it, there's not much else out there.' 'My rent just went up $150 a week and the owner won’t fix anything in the house, when we asked they gave us 60 days to leave the property,' a fourth said.Another said clothing would likely smell like food over time from being in such close proximity to the kitchen.On Tuesday the Reserve Bank of Australia increased the cash rate by 0.25 percentage points, taking the cash rate to an 11-year high of 3.85 per cent. The move - the 11th rate rise during the past year - flies in the face of the financial markets, which had almost unanimously predicted the RBA would leave rates on hold.This evidently means mortgage and rent rates will continue to rise.  ",
        "For many young Australians, the idea of home ownership is a distant dream drifting further beyond reach each time interest rates are hiked up, as they were on Tuesday, for the 10th time in as many months.In March, Daily Mail Australia took to Sydney's streets - and its beaches - to ask Millennials and Gen Z Australians if they still thought they would place a first, tentative step on the housing ladder.That very day interest rates were raised to 3.6 per cent, the highest level since 2012, as the Reserve Bank tries to control inflation, which is running at 7.4 per cent - a 30-year high.Some had abandoned all hope of property ownership, resigned to shelling out hundreds of dollars a week on rent forever, while others had careful strategies to save for their dream home - or were fortunate enough to own already.Professor Nicole Gurran, expert in urban planning and housing affordability, told Daily Mail Australia: 'Young people who've abandoned hope of getting on the housing ladder are right to feel aggrieved.'They've been let down by an unfair system which supports landlords rather than renters and existing home owners over those trying to break into the market.'Mira Almasri, a 35-year-old single mother, is renting a one-bedroom apartment with her two children aged nine and 14 in Mosman on Sydney's well-heeled north shore for $600 a week.'In Sydney everything is expensive. Even to breathe is expensive,' she said.Ms Almasri, who works in a bridal shop in central Sydney, said she had given up all hope of owning a Sydney home.'It's impossible to buy in Sydney,' she said.'Even if you earn loads of money it's still hard. All my friends who have bought houses in the last two years say they are not happy at all because they are paying high interest rates.''I get around $1,000 a week after tax and I'm paying $600 for a one-bedroom apartment. Add on food, petrol, electricity - it's too much.'Across Sydney unit rents jumped by a record 18.6 per cent to a median of $575 per week in December, according to a Domain Rent Report.Ms Almasri, who is originally from Lebanon, has not been able to return home or travel anywhere overseas for five years now.'I can't put any money on the side,' she said.Ms Almasri, who has been in Australia for 14 years, is looking for a three-bedroom house for herself and her two kids.In her current unit, she sleeps on a sofa bed in the living room while her children share the sole bedroom containing two single beds.Read more "
    ]
}