{
    "articleURL": "/wires/reuters/article-12051235/Drones-Kremlin-likely-launched-inside-Russia--US-experts.html",
    "content": [
        "Kremlin citadel has extensive anti-drone protections",
        "400-plus km journey from Ukraine unlikelyIf launched in Russia, multiple drone types possibleBy Mike StoneWASHINGTON, May 5 (Reuters) - The drones that crashed over the Kremlin earlier this week probably evaded an extensive number of defenses in and around Moscow, suggesting they might have been launched from inside Russia, U.S.-based drones experts said.Footage of the unmanned aircraft has sent governments and open source intelligence analysts on a hunt to discover the origin of the drones designed to fly to a destination and explode.Moscow has been very concerned about protecting the Kremlin from drones since at least 2015 when it began using electronic countermeasures to automatically direct them away by \"spoofing\" GPS locations, said Dana Goward, president of the non-profit Resilient Navigation and Timing Foundation, which advocates for tougher and redundant GPS.\"Spoofing\" occurs when a counterfeit GPS signal is sent to replace a legitimate one, electronically fooling guidance systems on drones or other devices.Goward said the sophisticated defense devices could mean that the type of drone used, which he believed to be mid-sized, \"was likely not using GPS but was either manually controlled - suggesting a nearby launch - or just pointed and set upon a path, kamikaze style.\"Two of numerous videos published on Russian social media channels show two objects flying on the same trajectory toward one of the highest points in the Kremlin complex, the dome of the Senate. The first seemed to be destroyed with little more than a puff of smoke, the second appeared to leave blazing wreckage on the dome.",
        "Russia accused Ukraine of orchestrating an attack with U.S. help. Kyiv and Washington denied any involvement.Avoiding detection while flying over long distances is difficult.HOW WAS KREMLIN REACHED?\"It is surprising this drone was able to fly through all of Moscow up to the Kremlin without being detected and destroyed,\" said Blake Resnick, founder and CEO of drone maker BRINC.\"The relatively small size and low altitude could help. If the drone was not utilizing GPS and not communicating with a ground control station, that would also harden it from jamming or spoofing techniques,\" Resnick said.The Kremlin has any number of close-defense systems based on radar and visual tracking, Goward said, that can use bullets and explosive projectiles to protect it from drones and even missiles.\"Of all the types of one-way attack drones, the aircraft used in this instance appears to have been a fixed-wing aircraft and among the larger one-way attack drones currently in use or development,\" said drone expert Dan Gettinger at the Vertical Flight Society, an engineering advocacy group.If it were a military-style drone with longer distance capabilities - flight from Ukraine for example - only a few countries would have that size of drone on hand.About half a dozen larger military drones currently in development or use worldwide have the ability to fly the 400 plus kilometer distance. China, India, Taiwan and Ukraine are among a clutch of nations producing drones of this size and capability, Gettinger said.",
        "Gettinger, who published a paper on one-way attack drones on Thursday, said if the aircraft was launched from within Russia, there was a significantly greater number of aircraft capable of carrying out this attack. (Reporting by Mike Stone in Washington; editing by Chris Sanders and Andrew Cawthorne)"
    ]
}