{
    "articleURL": "/wires/ap/article-12039471/Chiefs-sign-McKinnon-decline-5th-year-Edwards-Helaire.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - The Chiefs are re-signing Jerick McKinnon and declined the fifth-year option on fellow running back Clyde Edwards-Helaire on Tuesday, solidifying their backfield behind incumbent Isiah Pacheco heading into offseason workouts.",
        "McKinnon, who turns 31 this week, ran 72 times for 291 yards and a touchdown but was at his best out of the backfield, catching 56 passes for 512 yards and nine scores. McKinnon ended the regular season by reaching the end zone in six straight games, helping the Chiefs secure the No. 1 seed and first-round playoff bye.McKinnon helped the Chiefs reach the Super Bowl and could have scored there, but he gave himself up at the 2-yard line in the closing minutes. That allowed the Chiefs to hit the winning field goal in a 38-35 victory over the Philadelphia Eagles.\"He's certainly a guy that we love and greatly admire,\" Chiefs general manager Brett Veach said Monday.Edwards-Helaire, a first-round pick in 2020, was the starter heading into last season, but injuries that have held him back throughout his career resurfaced. He missed much of the season with a high ankle sprain, forcing Pacheco to step into the role of lead running back, and the seventh-round draft pick never gave it up.Edwards-Helaire came off injured reserve for the Super Bowl, but was inactive for the game.",
        "In other news, Veach acknowledged that the Chiefs will begin working with All-Pro defensive tackle Chris Jones on a contract extension. He's entering the final year of an $80 million, four-year deal, and his salary cap hit is $28 million for this season.",
        "The 28-year-old Jones is coming off perhaps his best season. The four-time Pro Bowl pick matched a career high with 15 1/2 sacks in the regular season, then ended a maddeningly playoff oh-for by picking up his first two postseason sacks.\"I think that's on the list of things to do,\" Veach said. \"We get into the offseason, and you know, you´re into combine meetings, and then you´re into free agency, and then you´re into the draft. And then after the draft, let the dust settle and start working on the future and things we can get accomplished in the spring.\"Veach indicated that he would like to get an extension done before the Chiefs report to training camp in July.\"We'll get to work and see what we can do,\" he said.There isn't nearly the same time pressure to rework the deal of MVP quarterback Patrick Mahomes, though that could be on the agenda soon. He just completed the first season of a 10-year, $450 million contract, but recent deals - including one signed by the Eagle's Jalen Hurts - already have pushed Mahomes to seventh in the league in average yearly salary.The benefits of working on Mahomes' contracts are twofold: The Chiefs want to keep him happy by paying him among the top tier of QBs, but they also can create some salary cap flexibility by altering the structure of the deal going forward.",
        "\"We're a few years into a long deal,\" Veach said, \"but at the same time, we have great communication with Pat, so that'll be a situation where we work through all those things. There's no timing from our end because we're in constant communication.\"___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}