{
    "articleURL": "/tvshowbiz/article-12040039/Ed-Sheeran-rocks-black-leather-jacket-screening-Disney-documentary-series-NY.html",
    "content": [
        "Ed Sheeran sported a laid-back look while attending the premiere of his Disney+ documentary series in New York on Tuesday.",
        "The singer, 32, wore a black leather jacket over a white T-shirt, black jeans and Nike sneakers for the screening, where guests were treated to his docuseries, 'Ed Sheeran: The Sum of It All.'The Shape of You hitmaker rocked his usual scruffy beard and wore his ginger hair in a tousled bedhead style with a choppy fringe.After originally believing his four-part documentary series would follow him in the studio and writing music, the challenges in Ed's life - particularly in February 2022 - saw the show turn into a therapeutic experience, where he bares his soul to his enormous fanbase. The series features a personal behind-the-scenes look at Sheeran's life, including a heartbreaking moment of him crying as he recalled finding out about his wife Cherry Seaborn's cancer diagnosis.",
        "While on the red carpet Ed - whose new album Subtract will be released on May 5 - posed with actor Ben Turner, 43, film producer Ben Winston, 42, and director David Soutar. Also present at the event was Real Housewives of New York City star Luann de Lesseps, 57, who looked chic in a black sequin blazer and tie. The reality TV star wore her brunette tresses parted on the side and cascading down in waves. Kelly Bensimon, 55, was also in attendance and stunned in a glittering jacket and shorts, which she paired with black tights.",
        "The beauty wore her blonde tresses parted in the middle and cascading down in light waves.Taylor Hill, 27, showed off her sense of style in an oversized grey suit and white sneakers.The model wore her brunette tresses parted in the middle and halfway pinned up.She was accompanied by Elle Macpherson's son Flynn Busson, 25, who looked dapper in a navy blue suit. ",
        "Miss Universe 2022 R'Bonney Nola Gabriel, 29, sizzled in a black gown with a saucy thigh slit and silver safety pin embellishments. Peyton Elizabeth Lee, 18, showed off her youthful style in a white button-up shirt under a studded white bustier. Roxy Sternberg, 34, was rocker chic in a monochrome polka dot dress and leather jacket.Krystal Joy Brown, 36, showed off her toned legs in a brown mini dress, which she paired with a black fedora.Karissa Bodnar opted for a pop of color in a green dress and a black leather jacket.Singer Orfeh, 52, was stylish as ever in an electric blue fur jacket and black leather pants.Sheeran's series follows Ed after he learns of life-changing news and reveals his hardships and triumphs during the most challenging period of his life.Blending a never-seen-before personal archive, interviews with his wife and loved ones, and intimate performances, the series widens the lens to unearth what Sheeran thinks of the world, of himself and his music.",
        "February 2022 was not only the month that Cherry was diagnosed with cancer, but it was also quickly followed by the death of Ed's close friend Jamal Edwards.Jamal, a music producer and the son of Loose Women star Brenda Edwards, died at 31 from a cardiac arrest brought on by taking cocaine and drinking alcohol.The pair became close after Jamal's YouTube channel SBTV helped to propel Ed into the spotlight, and the entrepreneur gave the aspiring musician a place to sleep when he was 18 and had no place to live in London.In that February, Ed was fighting a court case — which he later won — over his hit Shape Of You, which he was accused of plagiarising.The star said: 'That was a horrible, horrible, horrible month. Life hasn't moved on for me yet and I don't think it will.'Cherry was diagnosed with a tumor six months into her pregnancy with their second child, Jupiter, who just turned one.Doctors told the couple that the tumour required surgery, but that it wouldn't be an option until after Cherry had given birth. In the new series, Cherry reveals it was fearing she 'may die' that encouraged her to be part of Ed's documentary, with the incentive to show he wasn't just 'music machine' leading her decision. ",
        "Ed's close friend Jamal passed away the day after Cherry was told her tumor was not as severe as doctors had first feared, and that she would not need to have her baby early to allow doctors to operate. In the documentary, Cherry expresses concern over Ed's mental health and fears that he is working too hard to process his heartache.She says: 'He's worked every day this year, either writing, performing or doing promo. We've barely had a conversation this year about his mental health. I can see it and there's massive alarm bells for me.'But Ed says writing his sixth studio album Subtract, helped him deal with the loss of his friend. He says: 'The moment you find the worst thing has happened to someone you truly love, you feel like you're drowning and can't get out from under it.'Just from that situation, all these songs came out. It's scary putting your deepest, darkest thoughts out into the world, but I think I'm super ready to just put Subtract out and move on from it emotionally.'Ed Sheeran: The Sum Of It All is set to premiere on Disney+ on May 3. "
    ]
}