{
    "articleURL": "/wires/ap/article-12058861/Set-host-UK-taking-Eurovision-seriously-year.html",
    "content": [
        "LONDON (AP) - There´s nothing like nearly winning to wake people up. And the U.K.´s second-place position at last year´s Eurovision Song Contest has helped kickstart widespread enthusiasm for 2023´s edition - taking place in Liverpool this week.",
        "Sam Ryder´s \"Space Man\" restored the nation´s interest last year with his smiling enthusiasm, soaring vocals and great song despite coming on the heels of James Newman in 2021, who received no points at all, and 2019´s Michael Rice, who also came in last.Normally the winner of the previous contest would host the next one, but that winner was Ukraine, and the ongoing war there has made that impossible. So the U.K., as runnerup, is hosting instead.Singer Rita Ora says Eurovision - the semifinals begin Tuesday and the final is Saturday - has received another lease on life in the U.K.\"The Eurovision is suddenly just (becoming) huge again and I´m really here for it,\" she said.She´s performing during the interval at a semifinal in Liverpool, but her connection to the event goes back much further: Ora was lined up to represent the U.K. in 2009, but decided not to.",
        "After all, until Ryder, competing in Eurovision was no guarantee of a sparkling career for a Brit.The last time the U.K. won the contest was 1997, thanks to Katrina and the Waves and \"Love Shine A Light.\"The intervening years have seen five last-place results for the U.K.That could add up to a lot of pressure on this year's U.K. entry, Mae Muller, but she seems to welcome it.",
        "\"The energy feels different,\" Muller said.The London singer-songwriter is representing the U.K. with \"I Wrote a Song,\" and says Ryder helped change the way people inside and outside the U.K. view its participation in Eurovision.\"I feel like with the U.K., we have the tendency to be quite like self-deprecating,\" Muller said. \"We don´t take ourselves too seriously and I feel like that might have been like half our problem maybe with Eurovision. And I feel like now we´re like, `Let´s take this seriously. Like, let´s do this.´\"Liverpool singer Rebecca Ferguson is performing in her hometown alongside Ukrainian singer Aloysha in a duet during the semifinals interval.Ferguson thinks that the U.K. had become disheartened with the scores, but that being \"so close\" in 2022 changed things.\"The U.K. were like, yeah, OK then ... I can get into this,\" she said. \"We like winning, basically.\"Ukrainian rock star Julia Sánina, the frontwoman of The Hardkiss, is one of this year´s Eurovision hosts and a lifelong fan of the competition.She agrees that the U.K. is taking it more seriously in 2023 \"because of Sam Ryder and his musicality.\" But in addition to last year's success, there is added enthusiasm because Liverpool is hosting on behalf of Ukraine.The Ukrainian entry Kalush Orchestra won in 2022. When the U.K. agreed to host in Ukraine's place, it promised to celebrate Ukraine´s culture and people in every way.",
        "Sánina says she has felt that warm welcome in Liverpool.\"Beautiful city, super friendly people. And what was heartwarming for me that I saw lots of Ukrainian flags and Ukrainian blue and yellow colors all over the city,\" she said.After all, the U.K. does like a party.\"Eurovision, in my culture and when I grew up, was everything,\" Ora said.The Kosovo-born singer grew up with Albanian parents in London.\"It was like getting around the TV, all the music, like, `Everyone shut up,´ when there´s like a song on. There´s drinks flowing, everyone´s having a good time because it´s like, it was almost like rooting for your country or like where you´re from,\" she added.\"It´s just a cool way of everyone getting together,\" she said.___AP journalist Gary Gerard Hamilton contributed reporting from New York. For more AP coverage of Eurovision, visit https://apnews.com/hub/eurovision-song-contest"
    ]
}