{
    "articleURL": "/wires/pa/article-12042949/Plaid-Cymru-probe-finds-toxic-culture-bullying-misogyny.html",
    "content": [
        "Plaid Cymru have apologised after a damning review found a culture of harassment, bullying and misogyny in the party.",
        "The report states the Welsh nationalist party had “failed to implement a zero-tolerance approach to sexual harassment” and that women had been “especially” let down.It also said “too many instances of bad behaviour” by elected members have been tolerated within the party so that staff felt “there is little point in raising concerns”.A total of 82 recommendations have been made to “detoxify” the party’s culture. It is clear that there are instances - both historically and in more recent times - whereby unacceptable behaviour has been allowed to take place or go unchallenged  Plaid's Adam Price and Marc Jones  Plaid leader Adam Price said he was “deeply sorry” and that all the recommendations would be taken on board.The party’s National Executive Committee and Mr Price jointly commissioned the review, which was led by former Plaid politician Nerys Evans, and it began to look into the party’s culture last December.",
        "One of the key findings of the Prosiect Pawb (Everyone’s Project) report was that inherent power imbalances within the party “coupled with inaction over many years from those with positions of power to challenge bad behaviour, has made a bad situation even worse”.It said that despite the party having a robust complaints procedure, it needed to develop a system to “deal with the distinct issue of sexual harassment in the workplace and within the membership”.",
        "It added: “There is lack of faith and trust in the policies we do have in place due to historic issues of inconsistencies in how our policies and procedures have been implemented which has exacerbated the situation.”Evidence from an anonymous staff survey and elected members “highlight cases of sexual harassment, bullying and discrimination”, the report said, claiming: “These are not isolated cases.” It is clear that we must do better if we are to foster a culture which is safe, inclusive and respectful to all  Plaid's Adam Price and Marc Jones  The survey also found most discrimination was gender-based, it said.The report concluded that Plaid’s governing body “must be confident actions taken in the light of Prosiect Pawb’s findings and recommendations will be effective in enabling permanent, non-reversible measures to detoxify a culture of harassment, bullying and misogyny and to make Plaid truly and visibly welcoming to women”.In a joint statement, Mr Price and Plaid chairman Marc Jones said: “It is clear that there are instances – both historically and in more recent times – whereby unacceptable behaviour has been allowed to take place or go unchallenged and that our processes and governance arrangements have been inadequate to address this.“Individuals have been let down as a result – women especially, but also men.",
        "“For that, on behalf of the collective leadership of Plaid Cymru, we are deeply sorry.“It is clear that we must do better if we are to foster a culture which is safe, inclusive and respectful to all. That is how we will regain the trust of colleagues and members.”"
    ]
}