{
    "articleURL": "/wires/reuters/article-12060847/Yellen-calling-CEOs-personally-warn-US-debt-ceiling-sources.html",
    "content": [
        "By Andrea Shalal",
        "WASHINGTON, May 8 (Reuters) - Treasury Secretary Janet Yellen is reaching out to U.S. business and financial leaders to explain the \"catastrophic\" impact a U.S. default on its debt would have on the U.S. and global economies, two sources familiar with the matter said on Monday.The Treasury secretary is having one-on-one conversations with individual CEOs to warn them about the \"dangerous consequences of the current brinkmanship,\" one of the sources said.The sources declined to name the CEOs with whom Yellen had spoken in recent days, or provide any other details about their conversations, but one said they included executives in the financial sector and broader economy.While the sources did not spell out her purpose, Biden administration officials have been speaking to business owners about pressuring Republicans to raise the debt ceiling without conditions.The Treasury secretary delayed a planned trip to Japan for this week's Group of Seven finance ministers meeting to appear on the ABC News program \"This Week\" on Sunday, where she warned the failure of Congress to raise the $31.4 trillion debt ceiling could trigger a \"constitutional crisis.\"Talks on the issue should not take place \"with a gun to the head of the American people,\" Yellen said in a pointed reference to Republican lawmakers' insistence on tying a debt-ceiling increase to sweeping spending cuts that Democrats oppose.",
        "Yellen is now slated to leave for Japan this week and will hold a news conference in Niigata, Japan, on Thursday before the G7 meeting.President Joe Biden insists that Congress has a constitutional duty to raise the debt ceiling, which reflects previously spent federal money, without conditions.He will meet on Tuesday with Republican House Speaker Kevin McCarthy, Senate Minority Leader Mitch McConnell and top congressional Democrats at the White House to try to break the impasse.Yellen told lawmakers last week that Treasury will likely be unable to pay all the government's bills as early as June 1 without an increase in the federal debt limit.Yellen, other economists and analysts have repeatedly warned that a default on U.S. debt would result in millions of job losses, while driving household payments on mortgages, auto loans and credit cards higher.Unlike most other developed countries, the U.S. puts a hard limit on how much it can borrow. Because the government spends more than it takes in, lawmakers must periodically raise the debt ceiling. (Reporting by Andrea Shalal in Washington Editing by Heather Timmons and Matthew Lewis)"
    ]
}