{
    "articleURL": "/wires/ap/article-12038445/US-tracking-balloon-Pacific-not-Chinas-not-threat.html",
    "content": [
        "WASHINGTON (AP) - The Defense Department and the Federal Aviation Administration have been tracking a balloon that was flying off the coast of Hawaii last week, but a defense official said Tuesday there's no indication it is connected to China or any other adversary, and it presents no threats to aviation or national security.",
        "The balloon was first detected by radar on Friday and \"Pacific Air Forces launched three F-22s to assess the situation and visually identified a spherical object,\" U.S. Indo-Pacific Command said. \"We monitored the transit of the object and assessed that it posed no threat.\"The defense official said the balloon was floating at about 36,000 feet (11,000 meters), and it did not fly over any critical defense infrastructure or sensitive sites. After determining that the balloon presented no threat to people on the ground or to aviation over Hawaii, the military took no action to bring it down, said the official, who spoke on condition of anonymity to discuss military operations.It´s not clear who owns the balloon, which has now passed out of Hawaii´s airspace, the official said.The latest balloon sighting comes about three months after the U.S. military shot down what officials said was a Chinese spy balloon that crossed Alaska and part of Canada before returning to the U.S. and triggering widespread interest as it flew across the country. It was shot down over the Atlantic off the South Carolina coast on Feb. 4. Large portions of the balloon were recovered by the U.S. military.U.S. officials said it was equipped to detect and collect intelligence signals as part of a huge, military-linked aerial surveillance program that targeted more than 40 countries. Beijing insisted the balloon was just an errant civilian airship used mainly for meteorological research that went off course due to winds and had only limited \"self-steering\" capabilities.",
        "The U.S. military acknowledged there have been several other balloons that have been tracked over and near the U.S. in recent years, but none lingered over America for as long as that one did. The incident further eroded relations between the U.S. and China."
    ]
}