{
    "articleURL": "/femail/article-12056923/Kate-Middleton-poses-delighted-royal-fans-Windsor-walkabout.html",
    "content": [
        "The Prince and Princess of Wales arrived in Windsor today to greet well-wishers READ MORE: For all the latest Royal news, pictures and video click hereThe Princess of Wales showcased her natural charm with the public today as she posed for selfies with delighted royal fans during her Windsor walkabout - and offered high fives and hugs to the crowd.  ",
        "Kate, 41, and the Prince of Wales, 40, surprised royal fans at a Big Lunch gathering in the Berkshire town today - a day after attending the King's historic Coronation.The mother-of-three, dressed in a powder blue linen blazer, eagerly posed for photographs with admirers as she greeted members of the public on the Long Walk near Windsor Castle, ahead of tonight's Coronation concert. Although, one American royal fan was filmed grabbing Kate by the hair as she leaned forward for a selfie before security stepped in to intervene. A video showed the excited fan, who appears to be from the US, get her phone out and pull the royal in for a photo before putting her hand on the back of the princess's hair. ",
        "The arm of a concerned security guard is then seen pushing the fan's hand away, while another draws closer to assess the situation. A relaxed Kate appears unfazed by the physical contact as she smiles for the photo, before politely saying 'nice to meet you'. The excitable fan squeals at the selfie and apologises to the security guard who moved her hand away. It comes as a little girl broke down in tears and received a hug from the princess today after becoming overwhelmed to meet her at Windsor. Kate knelt down and embraced the child who was surprised when the princess and her husband joined the party on The Long Walk this afternoon.  ",
        "Kate saw the child crying and appeared to say: 'Do you want a hug?' before they shared an embrace. William was handed a can of 'Return of the King', a specially brewed organic 'Coronation ale'. He looked absolutely thrilled, and Kate smiled as her husband told the well-wisher he'd save it for later. Although there is no official protocol on selfies, the royals have a rule against signing autographs, so that they can't be sold for large amounts of money.",
        "And in the early days of camera phones, they seemed to shy away from being snapped with members of the public with Princes William and Harry and King Charles all voicing their dislike of the method.However, in recent years, they've become commonplace, with Charles posing for his first selfie all the way back in 2014, and other royals from Sophie Wessex to Prince Harry and Meghan Markle following suit.The late Queen Elizabeth II was not a fan of selfies and would politely decline if ever asked to take one, as she was thought to prefer eye contact. However, this was more of a personal preference than a rule of any kind.William has previously joked that he is 'allergic to selfies' while Harry once told a teenager that 'selfies are bad' and told her to 'just take a normal photograph' when she requested one in Australia in 2015.",
        "However in recent times it appears some royals have grown fonder of the selfie, perhaps viewing the form of photography as way of embracing modern times and connecting with fans.Despite previously admitting he 'hates' selfies, the King was among the first royals to be seen stopping for a snap with fans after cheeky scaffolder Sam Wayne took a picture with him in 2014.Two years later the same construction worker, from Redruth, reduced, Kate, then the Duchess of Cambridge, to fits of giggles as he snapped a selfie with them on a tour of a housing development in Cornwall.Prince William pushed the trend further in 2014 when he actually took the picture himself while posing for a snap with a schoolgirl after she visited the Sandringham Estate on Christmas Day.The Duke ended up photographing himself with the schoolgirl, Madison Lambe, 12, because she was too nervous to press the button on her phone.",
        "William seems to have grown more accustomed to the selfie over the years, with the royal melting hearts when he put his tour of Ireland on hold to stop for a selfie with little girl Jennifer Malone in March 2020.Kate has always seemed to be comfortable with the selfie, going viral in 2014 when she took a snap high-fiving a youngster in Christchurch before posing with various well-wishers on a walkabout in Sydney.",
        "Meanwhile, Prince Harry welcomed the selfie after marrying Meghan Markle in 2018 when the pair happily posed for several photos with royal supporters during their 16-day tour of Australia, Fiji, Tonga and New Zealand.It also seems that Queen Consort Camilla has always been on board with the selfie, having posed with various fans over the years.In June 2016, she proved she's a good sport by snapping a selfie with staff member Biffy Mackay, 27, at the Social Bite cafe in Edinburgh, which feeds, trains and employs members of the homeless community.Sophie Wessex has also been spotted indulging fans who asked for a selfie when she smiled with a group of youngsters while previously attending the New Forest and Hampshire County Show.As royal selfies appear to become more commonplace, fans may consider the practice a sign of a monarchy that is becoming more modern, as King Charles takes the reins."
    ]
}