{
    "articleURL": "/news/article-12053785/Meet-patriotic-dogs-Britain-Pooches-dressed-red-white-blue.html",
    "content": [
        "Four-legged friends are dressed like Royals ahead of King Charles' CoronationRead more about the coronation including minute-by-minute updates HERE Do YOU have pictures of patriotic pets? Email pictures@mailonline.co.uk It's not just humans who are getting in on the coronation action as we prepare for the coronation of their majesties the King and Queen. ",
        "Pets across the country are donning their red, white and blue glad rags to celebrate the coronation. Dogs and coronations have a long history. Queen Victoria, a devoted dog owner, reportedly bathed her dogs before her own coronation in 1838. Coronation-goers have been warned by vets to be careful if they take their dogs to places with large crowds, which could cause their pets stress. Battersea Dogs and Cats Home shared pictures of some of its residents looking 'extra proud' ahead of the beginning of the coronation ceremony.  Do YOU have pictures of patriotic pets? Email pictures@mailonline.co.uk",
        "Royal supporters and pet owners shared pictures of their proud puppers in their Sunday best. Some used neckchiefs to celebrate the big day with their pets while others went further, with special leads and harnesses. Large bows festooned the collars of other dogs, decorated with glitter and emblazoned with Union Jacks.  Vets warned coronation celebrators not to make a easy mistake if they decide to take their dogs with them to street parties or to watch the procession in central London. Dogs can be easily overwhelmed in large crowds which can cause behaviour problems even in well-trained dogs. Vets said that unless the pet was an assistance or support animal, it would be best to leave them at home, where they feel safe. ",
        "But that doesn't have to stop pet owners enjoying the coronation day with their dogs, as pictures on social media show.   ",
        "Images of proud pets were shared before coronation day as people prepared to celebrate the King's big day. Murphy, a mini-daschund from Stalybridge, looked dashing in a red and white hat as he got into the party spirit. Gus, a gorgeous miniature wire haired dachshund living in Battersea, looked regal in his crown and gold ribbon for the Coronation while Teddy the King Charles Cavalier Spaniel wore a noble 'God Save The King' bib against a backdrop of Union Jack flags.Meanwhile, Clementine the fuzzy sphynx looked as pretty as a Princess, wearing a sequined rainbow crown and multi-coloured vest. ",
        "Do YOU have pictures of patriotic pets? Email pictures@mailonline.co.uk "
    ]
}