{
    "articleURL": "/wires/ap/article-12052569/Happ-Steele-lead-Cubs-past-Marlins-4-1-end-3-game-slide.html",
    "content": [
        "CHICAGO (AP) - Ian Happ lined a deep two-run homer, Justin Steele tossed seven solid innings and the Chicago Cubs topped the Miami Marlins 4-1 on Friday to snap a three-game slide.",
        "Steele (5-0) allowed one run on six hits, all singles, and walked none to lower his ERA to an NL-leading 1.45. The left-hander has permitted two or fewer earned runs in 14 straight starts dating to July 22, 2022.The 27-year-old Steele has emerged as a soft-spoken Mr. Reliable at the top of the Cubs rotation in his third big-league season.\"Justin was really clean and efficient and attacking them,\" manager David Ross said. \"He's been so consistent. We've talked about it almost every start, just how great he's continued to pitch.\"Steele got some help from his defense, including three double-plays, as he threw 64 of 86 pitches for strikes.\"For me it´s just taking something from each and every time I´m on the mound, in a game and learning something from it,\" Steele said.",
        "Chicago´s Matt Mervis drove in an insurance run in the eighth with his first hit, a sharp single to right, in his major-league debut.Luis Arráez had three hits and Yuli Gurriel´s sac fly drove in the only run for the Marlins, who have dropped four straight. Edward Cabrera (2-3) yielded three runs on five hits in five innings while striking out eight.Nico Hoerner had two hits and Seiya Suzuki added an RBI for the Cubs, who returned to Wrigley Field following a 1-6 road trip when they struggled offensively and lost five games by one run.",
        "Michael Fulmer pitched a scoreless eight and Mark Leitner Jr. followed with a scoreless ninth for his first save.Miami swept a three-game series with the Cubs in Florida last weekend, with Cabrera winning the second contest. The Marlins then were swept in a three-game set by the Braves when they were outscored 23-9.The Cubs jumped ahead 1-0 in the first on Suzuki´s RBI single.Steele allowed back-to-back singles to Arráez and Gurriel with one out in the fourth, but escaped.Hoerner saved a run with a leaping catch of Garrett Hampson´s liner toward right in the fifth. After spearing the ball, Hoerner flipped to Dansby Swanson who tagged second base to double off Bryan De La Cruz.\"We're getting traffic on the bases,\" Miami manager Skip Schumaker said. \"If that ball goes over Hoerner's head, we got a run and here comes the momentum, but we're doubled off instead.\"Happ cracked his fourth homer to right center in the fifth to increase the Cubs lead to 3-0. The ball carried 420 feet despite being hit into a steady wind.Happ was ready for Cabrera's curveball on a 1-0 count.\"That one just popped a little bit,\" he said. \"It was a good swing.\"The Marlins cut it to 3-1 off Steele in the sixth on two singles and Guriel´s sacrifice fly.",
        "Mervis' line single made it 4-1 in the eighth.CUBS BIG PROMOTIONMervis, the Cubs minor league player of the year in 2022, was recalled from Triple-A Iowa before the game. He started at first base and batted seventh.Mervis struck out twice and grounded out before lining his single on a 1-for-4 day.\"I was hoping for the fourth at-bat and just trying to not overthink it,\" said Mervis, who got cheers in his first plate appearance despite fanning. \"Obviously the biggest crowd I've every played in front of and for people to cheer for me like that was nothing I've ever experienced before.\"The left-handed hitting Mervis hit .286 with six homers and 27 RBIs in 24 games for Iowa this season. Manager David Ross said he expects to play the 25-year-old \"consistently\" in Chicago, supplanting veteran Eric Hosmer at first base.To make room on the roster, the Cubs optioned INF Edwin Rios to Iowa where he´ll get more playing time.A converted pitcher, Mervis rose from High-A ball through Triple-A last season, batting a combined .309 with 36 homers, 119 RBIs and 40 doubles for three teams. His 36 homers were the most for a Cubs minor leaguer since Kris Bryant hit 43 in 2014.The Cubs signed Mervis as a free agent in 2020 after he wasn´t selected in the COVID-shortened five-round draft.",
        "TRAINER´S ROOMCubs: C Yan Gomes (concussion) has resumed conditioning and some baseball activities. ... RHP Kyle Hendricks (right shoulder strain) is scheduled to throw a bullpen session on Saturday. .... RHP Codi Heuer (recovery from Tommy John surgery) will pitch for Triple-A Iowa on Saturday.UP NEXTMiami RHP Bryan Hoenig (0-1, 6.23) takes the mound against Chicago LHP Drew Smyly (3-1, 2.83) on Saturday afternoon in the second game of the series. Smyly has allowed two or fewer runs in five straight starts.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}