{
    "articleURL": "/wires/ap/article-12040283/Wards-homer-leads-Angels-5-1-win-Cards-4th-loss-row.html",
    "content": [
        "ST. LOUIS (AP) - Taylor Ward capped a four-run first inning with a three-run homer, Patrick Sandoval combined with three relievers on a four-hitter and the Los Angeles Angels beat St. Louis 5-1 Tuesday night to extend the Cardinals' losing streak to four.",
        "St. Louis (10-20), facing the Angels for the first time in four years, has lost eight of its last 10 games and is 0-10 in series openers.\"We´re all frustrated,\" Cardinals manager Oliver Marmol said. \"When you start going up and down each guy on this roster, there´s not a lack of anything other than baseball´s tough right now. Guys are preparing well. They're taking their best shot, and it´s not working out, so it´s hard to get frustrated with them.On a night when Shohei Ohtani was given his second game off of the season, Mike Trout walked against Steven Matz (0-4) with one out in the first, Hunter Renfroe singled and Anthony Rendon hit a go-ahead single.With two outs, Ward hit a 2-2 changeup over the left-field wall for his fourth homer this season and a 4-0 lead.\"The boys came out swinging in the first inning,\" Sandoval said. \"All you can ask for as a starter is to start the game and when you get on the mound you have a lead. It´s awesome.\"",
        "Rookie Zach Neto added an RBI single in the sixth off Drew VerHagen.Sandoval (3-1), coming off a victory over Oakland, won back-to-back starts for the first time since last May. Making his first appearance against the Cardinals, he allowed three hits and three walks in five-plus innings with four strikeouts. He gave up his only run on Andrew Knizner's RBI groundout in the fifth.",
        "\"I feel like the changeup was good when I needed it,\" Sandoval said. \"It was a bit of a grind though. For whatever reason I couldn't get a grip on the ball the whole game. It was kind of frustrating, but I battled and got through five.\"Chris Devenski, making his second appearance since he was brought up from the minors. relieved with two on in the sixth, got Nolan Arenado to ground into a double play and retired Dylan Carlson on a flyout.Devenski, a 32-year-old right-hander in his eighth big league season, pitched a perfect seventh.Matt Moore struck out three around a single in the eighth, and Carlos Estévez struck out two in a perfect ninth.Matz allowed four runs, four hits and two walks in five innings.\"I got into a rhythm after that first inning.\" Matz said. \"One pitch got me bad there. Not the start I was going for, start of the season or the game. I've got a lot of things I need to address and look at. Ultimately I can look at the four innings today finishing strong, so I'll build off that.\"REMEMBERING AN ICONThe Cardinals held a pregame moment of silence for former player and broadcaster Mike Shannon who died on Sunday. Shannon played with the Cardinals for parts of nine seasons before spending 50 years in the broadcast booth.",
        "DAY OF RESTLos Angeles was off Monday, and Ohtani got consecutive days off going into his mound start Wednesday night.BULLPEN SHUFFLESt. Louis recalled RHP Guillermo Zuñiga from Memphis and optioned LHP Zack Thompson to the Triple-A team. Zuñiga, a 24-year-old Colombian right-hander, made his major league debut in the ninth inning and struck out Chad Wallach and Trout around Neto's flyout.TRAINER´S ROOMAngels: Activated RHP Ryan Tepera (right shoulder inflammation) from the 15-day injured list and optioned RHP Andrew Wantz to Triple-A Salt Lake.Cardinals: RHP Adam Wainwright (right groin strain) is scheduled to make his season debut this weekend against Detroit.UP NEXTRHP Ohtani (4-0, 1.85 ERA) will make his first career pitching appearance against the Cardinals Wednesday night. He will be opposed by RHP Miles Mikolas (1-1, 5.97 ERA), who is 1-2 with a 3.07 ERA in four two starts and two relief appearances against the Angels.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}