{
    "articleURL": "/news/article-12050685/Soldier-accused-slapping-female-comrades-bottom-cleared-sexual-assault.html",
    "content": [
        "Private Jonathan Rowell faced one count of sexual assault and was cleared Read more: British soldier slapped female colleague's bottom as she bent over A soldier who was accused of smacking a female colleague on the bottom as she bent over to adjust her uniform  ",
        "Private Jonathan Rowell had allegedly left the soldier 'shocked' and 'uncomfortable' by smacking her as she readjusted her boots and trousers after a break at work.However, Pte Rowell told a court martial the incident simply never happened.After a three day trial at Bulford Military Court, Wiltshire, a judge directed the board to return a not guilty verdict and that the soldier be cleared.During the case, prosecutor Lieutenant Commander Jamie Brotherton had told the court, the woman - who cannot be named for legal reasons - was walking from a smoking area when the alleged assault occurred.",
        "'The complainant was outside bending down to adjust her twisties when, without consent, the defendant came up behind her and grabbed her bottom hard, causing her pain and distress,' he said.'It was uninvited, unwanted and not consented to.'She clearly wasn't asking for it. The defendant denied it ever happened.'Giving evidence, the woman told the court her break, which she had taken in a smoking area, had ended so she was returning to her workplace in a group containing Pte Rowell.She said: 'We walked up a path and Pte Rowell was behind me in a group.'I wore twisties on the bottom of my trousers - they go around the bottom of your boots to touch the bottom of your trousers to make them look neater.",
        "'I bent down to readjust them because I was going back to work, when Pte Rowell came up behind me and slapped me on the bum - it knocked me forwards.'I shot up and obviously I was shocked. It hurt.'She claimed that when she admonished him, Pte Rowell replied: 'Don't act like you weren't asking for it.''It made me feel really uncomfortable,' the woman added.Pte Rowell, of Royal Military Academy Sandhurst, Berks, denied the single charge of sexual assault and was cleared by Judge Advocate Robert Hill after a submission from the defence legal team."
    ]
}