{
    "articleURL": "/news/article-12057649/500-power-bill-relief-handout-winners-losers-federal-budget-electricity-relief-package.html",
    "content": [
        "Millions of Aussies to save up to $500 on their energy billsPensioners &amp; welfare recipients to see the biggest cutsSingle workers &amp; families earning over $100k to miss outMillions of Aussies will save up to $500 on their power bill under the government's electricity relief package - but not everyone will be eligible for the scheme.",
        "Treasurer Jim Chalmers says the handout will be a focal point of the budget, which is to be handed down by the Albanese government in Parliament on Tuesday.The $1.5billion relief package from the federal government will assist households when it's rolled out towards the second half of the year.This amount will be matched by the states, bringing the total savings to $3billion. Pensioners and recipients of government handouts will see the biggest cuts, but an established income threshold means many households will also miss out. Daily Mail Australia has compiled a list of Australians who are set to benefit from the scheme. ",
        "WINNERSAged pensioners, commonwealth Seniors Health Card holders, small businesses and welfare recipients will be the biggest beneficiaries of the scheme.For families, households that receive income support under Family Tax Benefit A and B will also be targets of the handout. More than five-and-a-half million households and one million businesses are set to receive up to $500 in relief in total. 'In most states and territories the retailers will take it off your bill. For most people it's in the third quarter of the bill,' Dr Chalmers confirmed to News.com.au.'This is all about taking some of the sting out of higher electricity prices.' The amount households and businesses save will be dependent on where you live. ",
        "'It'll be different around the country, we've struck eight different deals with different jurisdictions,' Dr Chalmers added. ",
        "LOSERSSingle workers and families earning more than six-figure incomes are the cohorts most likely to miss out on cuts to their bills. The government has established income threshold limits for families dependent on the number of children in a household and their respective ages.This is determined by whether a household qualifies for family tax benefits.For families with one child, the cut off is a combined income of more than $108,000.The threshold is raised slightly to $114,000 for families with two children aged zero to 12 or one child aged zero to 12 and one aged 13-19 in secondary study.The cut off is $117,000 for families with two children aged 13-19 in secondary study.This is increased when there are three or more children in a household.Families with three teenagers in secondary study can have a combined income of up to $140,000 before they become ineligible for the handout.Households with four children will have a cut off between $147,000 to $157,000 - depending on the ages of the children. Further details about the edibility criteria for the government's electricity relief handout will be revealed when the budget is handed down on Tuesday."
    ]
}