{
    "articleURL": "/news/article-12057723/Out-control-wildfires-cause-evacuations-western-Canada.html",
    "content": [
        "Officials in Alberta said there were 108 active fires in the province Evacuee numbers grew to around 29,000, up from about 24,000 SaturdayThousands were evacuated and a state of emergency was declared as fire crews battled more than 100 wildfires threatening communities in western Canada on Sunday.",
        "Officials in Alberta said there were 108 active fires in the province and the number of evacuees grew to about 29,000, up from approximately 24,000 Saturday, when a provincewide state of emergency was declared.Alberta's Premier Danielle Smith said the situation was 'unprecedented'. Ms Smith said a hot, dry spring had created 'so much kindling' and some 122,000 hectares (301,000 acres) had burned so far.Cooler temperatures and a little rain brought some relief, but officials warned the reprieve came only in some areas. Two out-of-control wildfires in neighboring British Columbia also caused some people to leave their homes, and officials warned that they expected high winds to cause the blazes to grow bigger in the next few days.",
        "Provinicial officials in Alberta, one of the world's largest oil-producing regions, said the weather forecast was favorable for the next few days, with small amounts of rain and overcast conditions. But they cautioned that hot and dry conditions were predicted to return within a few days.'People have called this season certainly unprecedented in recent memory because we have so many fires so spread out,' Christie Tucker with Alberta Wildfire said at a briefing. 'It's been an unusual year.'Tucker said that 'light scattered showers in the southern part of the province' on Sunday allowed firefighters to approach previously unreachable areas due to 'extreme wildfire behavior'. ",
        "Conditions in the north of the province remained very difficult, she added.Colin Blair, executive director of the Alberta Emergency Management Agency, said accurate damage reports were not yet available because conditions made it difficult to assess the situation. There were of buildings destroyed in the town of Fox Lake, including 20 homes, a police station and a store.",
        "In northeastern British Columbia, officials urged residents to evacuate the areas around two out-of-control wildfires near the Alberta border, saying there were reports of some people staying behind.'This is impeding the response and putting their lives and the lives of firefighters at risk,' said Leonard Hiebert, chairman of the Peace River Regional District.A third fire in British Columbia was burning out of control 700 kilometers (430 miles) to the south, in the Teare Creek region, and some residents near the village of McBride were evacuated.Forest fires in Canada's oil sands region in 2016 disrupted production and forced out 100,000 residents from Fort McMurray, causing damage to the nation's economy.In 2021, westernmost British Columbia province suffered record-high temperatures over the summer that caused more than 500 deaths, as well as wildfires that destroyed an entire town."
    ]
}