{
    "articleURL": "/wires/reuters/article-12042211/AMDs-lackluster-forecast-sparks-selloff-shares.html",
    "content": [
        "By Tiyashi Datta",
        "May 3 (Reuters) - Investors dumped shares of Advanced Micro Devices on Wednesday after its earnings report indicated that it was struggling with a PC slump and had failed to gain market share from larger rival Intel Corp in the latest quarter.The stock fell more than 7% in premarket trading and was set to erase nearly $10 billion in market value. Intel, whose shares rose last week on a more upbeat PC market outlook, gained nearly 2%.\"Even if Intel didn't gain share this quarter, it seems unlikely that they lost any either,\" Bernstein analyst Stacy Rasgon said in a client note.\"While we will see if Intel's 2024 roadmap holds water or not, the competitive environment next year is likely to get tougher for AMD.\"The PC market has been in a slump for the past few quarters after a demand surge during the pandemic, while data center spending has also slowed as the economic outlook worsens.AMD, whose smaller and more efficient data center chips had helped it take market share from Intel last year, missed estimates for both PC and data center chip sales in the first quarter.Its sales forecast for the current quarter was also below market expectations, though the company was optimistic that the chip market would start to recover in the second half of 2023.",
        "\"AMD results were more vulnerable (to the PC slump) than Intel's because most AMD-based PC customers were consumers. In contrast, Intel had a significant share in the business PC segment,\" Gartner analyst Mikako Kitagawa said.Still, some analysts said that the buzz around artificial intelligence and a recovery in China were positive signs that could help the company.\"AMD is obviously not immune to the overall fluctuations of the macro spending environment, in our view, the share gains the company has earned through its roadmap execution and product performance will sustain through the choppy 1H23 before giving way to strong momentum in 2H23,\" brokerage TD Cowen said. (Reporting by Tiyashi Datta in Bengaluru; Editing by Anil D'Silva)"
    ]
}