{
    "articleURL": "/sport/football/article-12058859/Marc-Overmars-catch-breath-talks-stroke-December.html",
    "content": [
        "Marc Overmars was hospitalised in December after suffering a strokeThe former Arsenal winger has spoken of how the illness affects his lifeHe feels his heart is '45 per cent dead' but continues to work at Royal AntwerpFormer Arsenal star Marc Overmars has claimed his heart is '45 per cent dead' after suffering a stroke last December - as he spoke out about his health struggles that have left him struggling to catch his breath.",
        "The 50-year-old, who won the Premier League and FA Cup with Arsenal, reportedly suffered 'irreparable damage' to his heart following the health scare that saw him admitted to hospital on December 29.Overmars - whose heart is said to be pumping blood at 30 per cent of its normal volume - continues to work as Sporting Director at Royal Antwerp despite the illness, but has now spoken of day-to-day difficulties he faces.'I have to catch my breath when I talk a lot,' he told Het LaatsteNieuws, 'It takes energy to stay focused. My heart is 45 per cent dead.'But you shouldn't feel sorry for me. I am a happy man, only I have to distribute my energy as best I can.'On his active role at Antwerp, he added: 'If there are important points or meetings on the agenda, I focus on them. I can recover the next day. I'd rather die here than do nothing.'",
        "Overmars joined Royal Antwerp in March last year after quitting the same role at Ajaxover inappropriate messages sent to female colleagues.He apologised at the time, and said he 'did not know he was crossing the line' with his behaviour.Then-Ajax manager Erik ten Hag ended up in hot water over the incident, as he admitted 'congratulating' Overmars by text to celebrate their Eredivisie win despite the manner of his exit.",
        "He also predicted a 'romantic' return to the club for both of them as ten Hag was already headed for Manchester United.",
        "The manager may find the Ajax side that won three league titles in a row under him more romantic than ever, after another loss for the Red Devils against West Ham on Sunday night.Their fourth place standing now looks considerably less secure than it once did, with Liverpool just one point behind having played one more game.Jurgen Klopp's side are ending the season on a hot streak after winning their last six games, and face a relatively easy run in with games against Leicester, Aston Villa and Southampton.United's end to the season also looks straightforward on paper as they face Wolves, Bournemouth, Chelsea and Fulham, but they have now lost consecutive games 1-0 and won just once in their last four. "
    ]
}