{
    "articleURL": "/sport/football/article-12059715/LEAGUE-TWO-ROUND-Northampton-clinch-automatic-promotion-victory-Tranmere.html",
    "content": [
        "Northampton beat Tranmere 1-0 on Monday to secure automatic promotionMansfield narrowly missed out on a play-off spot despite beating ColchesterSalford clung on to seventh on goal difference despite losing 1-0 to Gillingham Northampton secured the final automatic promotion with a 1-0 win over Tranmere on the final day of the League Two season on Monday, while Mansfield came agonisingly close to a play-off spot before missing out on goal difference.",
        "Sam Hoskins' early goal for the Cobblers was enough to prevent a late challenge from Stockport on Monday, in a win that will come as an immense relief to fans after missing out on third place on the last day of the season last year.The Hatters ended up four points behind after they could only muster a 1-1 draw with already-relegated Hartlepool, and will have to rely on the play-offs to work their way into League One.They will face Salford, who clung on to seventh place despite losing 1-0 to Gillingham, in the first leg this weekend.It was a heartbreaking result for Mansfied fans, as the Stags' were left level on points  with the Ammies with a goal difference deficit of just one after their 2-0 win at Colchester.",
        "Barrow 0-1 StevenageBradford 1-1 Leyton OrientColchester 0-2 MansfieldGrimsby 1-0 WimbledonHarrogate 1-1 RochdaleNewport 2-2 CreweSalford 0-1 GillinghamStockport 1-1 HartlepoolSutton 1-1 CarlisleSwindon 2-1 CrawleyTranmere 0-1 NorthamptonWalsall 2-1 Doncaster ",
        "To make matters worse, Nigel Clough's side had scored more goals than Salford this season, meaning a third strike would have been enough to keep their promotion hopes alive.Bradford confirmed their sixth place standing with a 1-1 draw with champions Leyton Orient.",
        "They finish a point above Salford despite winning just once in their final four games. Carlisle stayed just ahead in fifth after rescuing a late draw against Sutton, a result that could give them an edge over Mark Hughes' side when they met in the first leg of their play-off on Saturday.Elsewhere in the league, already-promoted Stevenage picked up a 1-0 win at Barrow, with the home side ending the season ninth but a distant 13 points from the play offs.Grimsby, Swindon and Walsall picked up home wins over Wimbledon, Crawley and Doncaster respectively, while bottom-place Rochdale drew at Harrogate.Newport and Crewe, two teams stranded in mid-table with little to play for, played out a thrilling 2-2 draw that saw both sides scoring in second half injury time."
    ]
}