{
    "articleURL": "/wires/ap/article-12040141/Panthers-Maple-Leafs-Game-1-second-round-series.html",
    "content": [
        "TORONTO (AP) - Florida coach Paul Maurice says the Panthers play their best hockey when faced with the most difficulty.",
        "That was true Tuesday night, as the Panthers had less than 48 hours to recover from their first-round series win over Boston and opened the second round in Toronto.\"If we´re a little fatigued because that (Bruins) series was heavy, it´s kind of our normal day,\" Maurice said. \"When you look at our schedule at the end of January, it was brutal. And that´s when we started to play our best hockey.\"So being in the mud, as we would say, we´re kind of used to it.\"Sergei Bobrovsky made 34 saves, Matthew Tkachuk had three assists and the Panthers survived a squandered two-goal lead to defeat the Maple Leafs 4-2 in opening game of their second-round playoff series.\"He was unbelievable, he´s been great in every game that he´s come in,\" Sam Bennett said of the netminder. \"It has been awesome to see. That´s what we need out of him and he´s stepped up.\"",
        "Bennett had a goal and an assist and Carter Verhaeghe and Nick Cousins also scored for Florida. Aleksander Barkov had two assists.Matthew Knies had his first NHL goal and Michael Bunting also scored for Toronto. Ilya Samsonov stopped 24 shots.\"They force you to make mistakes,\" Toronto coach Sheldon Keefe said. \"But I thought we made some mistakes that we didn´t necessarily make in the last series.\"",
        "Game 2 of the best-of-seven series is Thursday.The Panthers had roared back from a 3-1 deficit to stun the record-setting Boston Bruins with three straight victories and take that first-round series in seven games.The Maple Leafs ended a generation of misery Saturday when John Tavares scored in overtime of Game 6 against the Tampa Bay Lightning as Toronto advance in the postseason for the first time since 2004.\"They played well,\" Toronto defenseman Luke Schenn said. \"But a lot of the goals that were scored were self-inflicted. We still have a lot more to give.\"Tied at 2 late in the second period with the Maple Leafs pushing, the Panthers silenced the towel-waving crowd at Scotiabank Arena.Verhaeghe, who scored the dramatic winner in Game 7 against Boston on Sunday, took a pass from Anthony Duclair and gave Florida the lead for good when he beat Samsonov on a breakaway at 17:47 for his fourth goal of the playoffs.\"Instead of going in (to intermission) tied, you go up a goal, so it´s huge,\" Verhaeghe said. \"It kind of settled us down after the period. You take a deep breath. It was a good goal.\"Toronto had a couple opportunities to tie it in the third, but never really threatened Bobrovsky before Montour blasted a one-timer on a delayed penalty at 12:24.",
        "Bobrovsky then denied William Nylander on a terrific toe stop with just over a minute left in regulation on Toronto´s best chance to close within one.\"As the hockey goes on we´ve come together to support each other and help each other,\" Bobrovsky said. \"We´ve become like a family every day (since) the playoffs started.\"The Maple Leafs are in the second round of the playoffs for the first time since Jeremy Roenick scored in overtime of Game 6 for the Philadelphia Flyers to eliminate Toronto on May 4, 2004 - a stretch of 18 years, 11 months and 28 days.After Toronto had a number of terrific looks on two power plays, the Panthers struck when Cousins scored his first on a rebound at 9:25 of the opening period.Helped when a shot clanged off the post earlier in the period, Samsonov made big stops on Anton Lundell and Barkov.Bobrovsky made a couple huge saves off Auston Matthews on a Maple Leafs power play in the second before Florida went up 2-0 at 7:58, when Bennett tipped a point shot past Samsonov that initially hit the stick of Knies.The Toronto rookie made amends 11 seconds later when he scored his first professional goal on a highlight-reel effort between his skates with his back to Florida´s goal after Bobrovsky made the initial save.",
        "\"Surreal feeling,\" the 20-year-old Knies said. \"Especially in the playoffs in the home arena.\"Schenn then rocked Tkachuk with a big hit in the neutral zone before Bunting, who was suspended three games in the first round and made a healthy scratch for another, scored his first of the postseason at 14:51 following a perfect pass from Calle Jarnkrok.Duclair sprung Verhaeghe later in the shift and he put the Panthers up 3-2.BUSY TAVARESApart from scoring the overtime goal that gave the Maple Leafs their first series win in 19 years, the Toronto captain and his wife recently welcome their third child, a daughter named Rae.\"An absolute whirlwind for him,\" Toronto center Ryan O´Reilly said before the game.MAURICE LOOKS BACKPanthers head coach Paul Maurice was behind the bench when the Carolina Hurricanes topped the Maple Leafs in the 2002 Eastern Conference final.\"I don´t think we gave up a five-on-five goal in that series,\" he said. \"That was back in when you could get away with clutching and grabbing.\"We were really good at it.\"___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}