{
    "articleURL": "/sport/football/article-12038679/Jurgen-Klopp-CHARGED-FA-comments-regarding-Paul-Tierney.html",
    "content": [
        "Jurgen Klopp has been charged by the FA for comments about Paul Tierney The German appeared to insinuate that Tierney had it in for his Liverpool teamFA claim that Klopp's post-match comments questions integrity of the officialLiverpool boss Jurgen Klopp has been charged by the FA for comments regarding Paul Tierney in the aftermath of the Reds' victory over Tottenham.",
        "The German was particularly animated throughout and was eventually booked after confronting fourth official John Brooks following Diogo Jota's late winner to secure a 4-3 win over Spurs. Jota's strike came just 99 seconds after Richarlison looked to have secued Tottenham an unlikely point from 3-0 down.Speaking afterwards, Klopp questioned what Tierney had against him and his side, comments that have been interpreted as insinuating bias, as laid out by the FA's statement detailing the charges against the Liverpool manager.'Liverpool FC’s Jurgen Klopp has been charged following their Premier League fixture against Tottenham Hotspur FC on Sunday 30 April,' the FA said in a statement.",
        "'It is alleged that the manager’s comments regarding the match official during post-match media interviews constitutes improper conduct in that they imply bias, and/or question the integrity of the referee, and/or are personal/offensive, and/or bring the game into disrepute. 'Jürgen Klopp has until Friday 5 May to provide a response.'It has been reported that such is the extent of Klopp's own rap sheet that he could be facing up to a sizeable touchline ban, with Sunday's incident not his first run in with the refereeing authorities.Klopp admitted on Tuesday that he 'regretted' his actions in the aftermath of Jota's goal, saying it was not 'necessary' for him to behave in such a manner, having accused Tierney of saying something that was 'not OK'.",
        "'How can they give a foul by Mohamed Salah [before Spurs' third goal]?' Klopp told Sky Sports when asked to explain his bizarre confronting of the fourth official after the winning goal on Sunday.",
        "'We have our history with [Paul] Tierney, I really don't know what this man has against us, he has said there is no problems but that cannot be true.'How he looks at me, I don't understand it. But again? He was reffing against Tottenham [in 2021] where Harry Kane should have got a red card. And I love this player, crazy player and I don't want him to get a red card, but he should.'And it's Mr Tierney. It's really tricky and hard to understand.'On Tuesday Klopp accepted wrongdoing and retracted his perceived accusations of bias, insisting that Tierney did not make mistakes against his team deliberately - while again noting that the parties have 'history'.From his comments, it appears Klopp is unlikely to challenge the FA on their charges. 'The whole situation shouldn’t have happened,' Klopp said. 'I didn’t say anything wrong [to fourth official John Brooks]. 'I was shouting: \"Without you, without you\". It didn’t make a lot of sense but that was all. Paul Tierney came over to me and I didn’t expect at all a red card because I didn’t feel it was right. ",
        "'I expected a yellow card and he said to me: \"For me it’s a red card but because of him\" – that’s what I understood because it was loud in the stadium – \"it’s yellow\". Showed me a yellow and smiled to my face. That’s it.'The things which were made of what Paul Tierney said to me, I didn’t say. I said: \"What he said to me was not OK\" and I thought it was not OK because it was not a red card in my view. 'I understand I opened the box. The rest was how I felt in that moment about Paul Tierney reffing our games. I am very sure he is not doing it intentionally but we have a history and I cannot deny that.'Klopp was banned for one game earlier in the season for his conduct during Liverpool's 1-0 victory over Manchester City at Anfield. He was also fined £30,000 and warned about his future conduct."
    ]
}