{
    "articleURL": "/tvshowbiz/article-12038921/Anna-Wintour-surfaces-New-York-amid-confusion-romance-rumors-Bill-Nighy.html",
    "content": [
        "Anna Wintour surfaced in New York this Tuesday under a cloud of confusion over her relationship status with Bill Nighy.",
        "The outing marked her first public sighting since this year's Met Gala, the high-octane fashion industry blowout she has presided over for decades.Held each year on the first Monday in May, the latest edition was especially significant for Wintour, 73, who attended it on Nighy's arm and thereby appeared to confirm years of rumors that they are an item.A representative for Nighy, 73, said the next day: 'Bill and Anna have simply been great friends for two decades. They are not in a relationship.'After spending 'fashion's biggest night' with Nighy, the US Vogue editor was spotted solo Tuesday as she plunged back into her work routine. ",
        "She draped her famously petite frame in a sleek, summery floral dress and warded off the northeastern chill with a lapis leather coat.Balancing expertly on a towering pair of high-heeled snakeskin boots, she accented the ensemble with an ornate white necklace.Wintour wore the bob she has sported since she was a teenager in Swinging London, plus the customary huge shades she once described as her 'armor.'One day earlier, as she and Nighy arrived arm-in-arm at the Met Gala, they appeared to confirm a romance that has been rumored for years - days after she dodged questions about their relationship.",
        "The pair, both 73, who have been close since 2010, sparked dating rumours once again in 2021 following Wintour's split from her husband of 20 years, Shelby Bryan.At the time her second marriage ended in 2020, it was reported that the editor had dumped her Texan husband because she had 'grown bored' with him.By August 2021, rumors began to swirl that Wintour had found a new flame in her long-time friend Nighy after the pair were spotted having dinner together in Rome.",
        "Nighy himself has not gone public with a relationship since his split from his long-term partner Diana Quick in 2008, with whom he shares a daughter, Mary.In 2018 Nighy even addressed the speculation that had mounted for nearly a decade, but appeared to brush it off when he said: 'There are a lot of rumors about me and probably about Anna.'And in an interview last year, he refused to be drawn on what he described as 'something very close to gossip'. Wintour's first marriage was to David Shaffer in 1984, who was 10 years her senior. They had two children, Charles and Bee, but by 1999 the couple were divorced and Anna began dating Shelby Bryan. The Vogue editor appeared to befriend Nighy around 13 years ago when they began to attend fashion weeks together - something they have done several times throughout their friendship.",
        "In 2010 the pair looked close as they sat next to each other at the Nicole Farhi Spring/Summer show at London Fashion Week.A photo from the event captured the pals sitting very close together as Wintour leaned behind to chat to someone in the second row. They were both smiling as they watched the catwalk show.However at this stage, there was no indication the pair were any more than just friends - and indeed two years later they were joined in the front row at LFW by Nighy's then ex, Diana Quick.",
        "The trio looked pally as they sat together to watch another Nicole Farhi show at the Royal Courts of Justice in 2012.As well as fashion shows, the pair also enjoy a mutual love of theatre - and in 2018 were spotted together in London as they watched 'The Jungle', a play about the refugee crisis in Calais, Page Six reported.While Wintour and Nighy have often made public appearances together, it is perhaps their intimate dinners which have caused more speculation that they might be more than just friends.In 2020, Page Six reported the couple had dined together at Sant Ambroeus on Madison Avenue in New York - and Wintour had even been spotted without her trademark shades.",
        "A source told the magazine that Wintour looked 'happier than I have ever seen her'.They added: 'Anna was beaming the whole time. She looked happy and in very good company. She was beautifully made-up and she was smiling so much — she had her sunglasses off the entire time!'",
        "The dinner date came just days after the pair put on a cozy display at the Paul Smith Autumn/Winter 50th anniversary show at Paris Fashion Week.As they sat in the front row, Nighy looked sharp in a navy suit and his thick-framed glasses, While Wintour kept her eyes covered with sunglasses and wore a metallic coat with a fur hood.In one photo, Nighy put his hand on Wintour's arm as they appeared to inch closer together. When the Covid lockdowns put a stop to dining out altogether, Nighy and Wintour were not spotted together for a little while, until August 2021 when they enjoyed dinner at Pierluigi in Rome.At the time, tongues wagged over reports Nighy had been spotted buying red roses for his dinner date ahead of meeting her. Just days before the pair appeared arm-in-arm at the Met Gala, Wintour dodged questions about the nature of their relationship during an interview with The Telegraph.When asked about Nighy and speculation, she said: 'I’m very ingrained in the British papers.",
        "'My dad was a Fleet Street editor, my brother [Patrick Wintour] works for The Guardian. I read them all at night online.'Just a year earlier, Nighy gave an interview to the same newspaper in which he was asked the same questions about Wintour.He replied: ‘I’d love to answer that. But if I did, I’d be involving the readers in something very close to gossip, and I know they’d never forgive me for that.’ "
    ]
}