{
    "articleURL": "/wires/pa/article-12055657/Military-parade-Glasgow-celebrations-mark-coronation-continue.html",
    "content": [
        "Celebrations continue in Scotland to mark the weekend of the King’s coronation.",
        "Following the coronation on Saturday, one of the main events north of the border on Sunday is a ceremony and parade in Glasgow.Scores of community celebrations are also being held across the country.",
        "In Glasgow, the city’s Lord Lieutenant Jacqueline McLaren will officially mark the coronation with a ceremony in George Square followed by a parade to Glasgow Cathedral.The ceremony includes inspection of a guard of honour, speeches and three cheers for the King and Queen, followed by the national anthem.The Lord Lieutenant will then take the salute as a parade of military servicemen and women, cadets and veterans marches past the City Chambers.The parade will then head through the city to the cathedral for a thanksgiving service at 11am.The cathedral was one of the locations in Scotland where the coronation was broadcast to the public.Scores of people attended the historic building to witness the event, while in Edinburgh the public watched on a big screen in West Princes Street Gardens.Across Scotland, more than 200 Coronation Big Lunch celebrations have been registered across the weekend of the coronation.",
        "Several are taking place on Sunday, including in the Royal Deeside village of Ballater, neighbouring the Balmoral estate where hundreds of people are expected at Coronation Big Lunch at the Church Green.",
        "Ballater businesswoman Wendy Cobban, who has helped organise the event, said: “Ballater holds a special affection for the King and Queen, as the village has had strong ties with the royal family since the time of Queen Victoria.“I think that the local residents feel a more personal relationship with the King and Queen, they are looked upon as friends and neighbours.“Locals and tourists will come together and enjoy the events of the weekend in an atmosphere of fun and celebration in Ballater, a place that holds a special place in the King and Queen’s hearts.”The Coronation Big Lunch initiative, from the Eden Project, forms part of the celebrations for the coronation weekend.The Queen has been Patron of The Big Lunch initiative since 2013 and The Big Lunch was set up four years previously to encourage neighbours and communities to share food.On Saturday, both celebrations and protests took place in Scotland as the coronation was marked.Gun salutes were fired at Edinburgh and Stirling Castles to mark moment the King was crowned.Thousands attended an independence march and rally in Glasgow while in Edinburgh hundreds of people gathered on Calton Hill for an anti-monarchy rally organised by Our Republic."
    ]
}