{
    "articleURL": "/wires/ap/article-12050359/Stock-market-today-Global-markets-ahead-US-jobs-data.html",
    "content": [
        "NEW YORK (AP) - Apple was at the head of a widespread rally on Wall Street Friday after the market's most influential company reported a better profit than expected. Stocks of beaten-down banks also leapt to recover a smidgen of their sharp losses from a brutal week.",
        "The S&amp;P 500 jumped 1.8%, though it still turned in a modest loss for the week that was its worst in nearly two months. The Dow Jones Industrial Average climbed 546 points, or 1.7%, while the Nasdaq composite rallied 2.2%.Treasury yields jumped in the bond market after a report showed hiring accelerated across the economy by much more than expected last month. The U.S. government´s jobs report also showed workers won bigger pay raises in April than expected.While that´s good news, particularly when many economists fear a recession may arrive this year, the data also raises worries inflation may stay high and push the Federal Reserve to keep interest rates higher. That in turn would keep the pressure up on an already slowing economy.The data did little to narrow the extremely wide range of possibilities for the economy that investors are forecasting for the economy, from a painful recession to a soft landing, said Bill Northey, senior investment director at U.S. Bank Wealth Management.\"Today's jobs report likely gave both the bulls and the bears something to anchor around,\" he said.High interest rates have already caused cracks in the U.S. banking system, and fears about what may be next to fall have rocked the industry. This week began with regulators seizing First Republic Bank, which became the third large U.S. bank failure to hit since March.",
        "Investors have been hunting for the next possible weak link in the system and driving down stock prices for those seen at risk of a sudden exodus by customers. That´s even as banks protested that they were seeing deposit levels stabilize or strengthen. Several of the hardest hit recovered some of their steep losses Friday, adding to the ebullient mood.PacWest Bancorp. soared 81.7%, though it still lost 43.3% for the week. Western Alliance Bancorp. jumped 49.2% to trim its loss for the week to 26.8%.The worry is falling stock prices for banks could create a vicious cycle that causes customers to lose faith and pull their deposits, which then raises more fear for the system.Apple didn´t rise as much as those banks Friday, but its moves pack a more potent punch. Apple is the most valuable stock on Wall Street, which gives its moves outsized weight on the S&amp;P 500 and other indexes.Its 4.7% gain made it the biggest force by far lifting S&amp;P 500. The iPhone maker reported a drop in earnings and revenue, but the results nevertheless topped analysts´ muted expectations.The story has been similar across the broader market for results during the first three months of the year. Analysts came into this earnings reporting season with low expectations given high interest rates and a slowing economy, but the majority of companies have done better than feared.",
        "Live Nation Entertainment jumped 15% after reporting a more modest loss than analysts expected, while Cigna Group rose 7% after topping forecasts for profit and revenue.On the losing end was Lyft, which slumped 19.3% after it gave a weaker financial forecast for the current quarter than Wall Street expected. It's a contrast to competitor Uber, which rose solidly for the week following its earnings report.In the bond market, yields leaped immediately after the jobs report as traders bet on it pushing the Fed to keep rates high for longer than earlier expected.The Fed on Wednesday said that it wasn´t sure of its next move after raising its benchmark rate to a range of 5% to 5.25%, up from virtually zero early last year. It´s been raising rates at the fastest pace in decades to drive down inflation, but that works by slowing the economy and hurting investment prices.Many traders expect the Fed to hold rates steady at its next meeting in June, which would be the first time that´s happened in more than a year. After that is where expectations diverge.The Fed has been insistent that it sees inflation coming down slowly, which would mean rates would stay high for a while, if not rise further if inflation were to reaccelerate. Many traders, meanwhile, see the economy weakening so much that the Fed will have to cut rates later this year.",
        "Adding to the uncertainty is what comes out of the U.S. banking industry's turmoil. If it causes banks to pull back on their lending, that could act like rate increases that further smother the economy.Friday´s jobs report offered encouraging and discouraging news, depending on one´s outlook.The strong hiring numbers reaffirm that the job market is remaining resilient. It´s propping up the rest of the economy, which has already begun to slow under the weight of much higher interest rates.But more concerning to pessimists was the 4.4% rise in wages for workers from a year earlier. The fear is too-strong wage increases could push companies to raise prices for their own goods and make other moves that create a vicious cycle that keeps inflation high. That in turn could pressure the Fed to keep rates higher for longer, which could cause more things to break beyond First Republic.The yield on the 10-year Treasury rose to 3.43% from 3.38% late Thursday. It helps set rates for mortgages and other important loans.All told, the S&amp;P 500 rose 75.03 points to 4,136.25. The Dow gained 546.64 to 33,674.38, and the Nasdaq climbed 269.01 to 12,235.41.AP Business Writers Joe McDonald and Matt Ott contributed."
    ]
}