{
    "articleURL": "/news/article-12044191/Global-weight-loss-company-Jenny-Craig-shut-doors-four-decades.html",
    "content": [
        "Australian-founded company to close Company founded by Jenny and Sidney Craig in 1983 Do you know more? Email tips@dailymail.com Australian-founded weight loss company Jenny Craig will close down after four decades in the business.",
        "The company, which was founded by an Australian woman Jenny Craig, sent an email to is US-based employees announcing the news.The email claimed the decision was made 'due to its inability to secure additional financing' with the company understood to be in $250million worth of debt. The future of the company in Australia, however, remains unclear, with staff being told to tell clients it is business as usual, but warning them not to talk to journalists.'While this is unfortunate news for our colleagues in the USA, the Jenny Craig operations here in Australia and New Zealand do act independently,' a spokesperson told Daily Mail Australia.",
        "'Here in Australia and New Zealand we currently continue to operate and support our clients. As always, our priority is to continue providing the best possible service.'Around 1,000 people are employed by the company in the US and Canada, with most told in the email their last day of work will be on Friday.Jenny Craig has around 600 stores around the world including the US, Canada, Australia and New Zealand. Australian staff have been told in a letter that: 'Those issues relate exclusively to Jenny Craig North America. 'We're a separate business here in Australia and New Zealand.' An internal communication sent to some Australian employees on Wednesday thanked them 'for all your support with reassuring your teams in light of the challenges confronting the North American business'.",
        "Josh Nunan, the head of Jenny Craig's human resources in Australia and New Zealand, said he is aware that 'conversations are already being had with clients who are coming to our team about the US issues and that these are being dealt with appropriately'.'However, to further assist with these conversations if/when they come up, we've pulled together some sample dialogue for the team to refer to:'If a client expresses concern about the situation with Jenny Craig North America, reassure them by saying: \"Those issues relate exclusively to Jenny Craig North America. '\"We're a separate business here in Australia and New Zealand and our continued focus is to provide the highest standard of customer service to our existing (clients), like yourself, and future clients. We're here to support you on your journey.\"'The recipients of the letter were also told that 'under no circumstances' were they to respond to questions from the media.Jenny Craig has worked with celebrities such as Magda Szubanski, Married At First Sight's Jules Robinson and Australian Idol's Casey Donovan.In a notice sent to employees on Tuesday, Jenny Craig said it is 'winding down physical operations, likely transitioning to an e-commerce model'.However, Bloomberg reported last week that the firm is considering filing for bankruptcy altogether, as it fails to deal with $250million of debt.",
        "The weight loss industry has been rocked recently by the rise of weight loss drugs such as Ozempic. Last month, WeightWatchers bought a digital health firm that offers virtual appointments with doctors who can prescribe such drugs. 'Like many other companies, we're currently transitioning from a brick-and-mortar retail business to a customer-friendly, e-commerce driven model. We will have more details to share in the coming weeks as our plans are solidified,' CEO and President of Jenny Craig Mandy Dowson told Bloomberg. ",
        "The company, which was founded in Australia in 1983 by Jenny Craig and her husband Sidney, sells a program that offers nutritionally balanced diets designed to help people lose weight. The company expanded into the US in 1985. Local celebrities who used and promoted Jenny Craig include Magda Szubanski, Married At First Sight contestant Jules Robinson and pop singer Casey Donovan. Mariah Carey, the late actress Kirstie Alley, Mel B of the Spice Girls and Jason Alexander of Seinfeld are among the many international stars who have represented the company. "
    ]
}