{
    "articleURL": "/wires/reuters/article-12040359/DMac-ignites-All-Blacks-flyhalf-debate.html",
    "content": [
        "By Nick Mulvenney",
        "May 3 (Reuters) - New Zealand could be gearing up for another heated flyhalf debate heading into the World Cup with Damian McKenzie staking a strong claim to the All Blacks number 10 shirt with his form for the high-flying Waikato Chiefs.Debates over who should play first five-eighth for the All Blacks are part of New Zealand tradition and go back at least to the days of Grant Fox and Frano Botica in the late 1980s and peaked with Carlos Spencer and Andrew Mehrtens in the 1990s.Three-times World Player of the Year Dan Carter, when fit, killed the debate for the best part of a decade until he retired after New Zealand won their third World Cup in 2015.Beauden Barrett and Richie Mo'unga have revived it in recent years with the former playing flyhalf in last year's lost home series against Ireland and the latter taking over for the Rugby Championship.The return of McKenzie from Japan at the start of the Super Rugby Pacific season, however, threatens to send the debate into overdrive.The 28-year-old has been outstanding for the Hamilton-based Chiefs and put in another brilliant display in last weekend's win over Mo'unga's Canterbury Crusaders.His electric pace and prodigious kicking have helped the Chiefs beat all-comers in nine matches this season, including a win over Barrett's Auckland Blues in early April when the twice World Player of the Year had an error-strewn night to forget.",
        "McKenzie has started only two of his 40 tests at flyhalf, mostly used at fullback or as a utility replacement, but his performances this year suggest he now has a firm grip on what is required in the main playmaker role.\"He's shown a lot of maturity in his decision making,\" All Blacks coach Ian Foster told Stuff media recently.\"I think he would say that he's still not the finished product, but I think he's had a major impact on the competition.\"The thing we're excited about is his game management. In terms of form, he's really putting his name up for us to think hard about how we see him.\"More conservative critics, who we might call the Mehrtenites, point out that his flamboyant style and slight frame might prove a liability in a World Cup slugfest against the Springboks or a major European power.The Spencerite faction will argue that McKenzie brings an X-factor that Mo'unga, mostly, and Barrett, lately at least, do not possess and which could be vital when taking on suffocating defences in France.Another argument in his favour is that while Barrett and Mo'unga are heading off to Japan after the World Cup, McKenzie re-signed with New Zealand Rugby until the end of 2025 on Monday.",
        "\"Since coming back from Japan, I feel rejuvenated and refreshed,\" he said after the deal was announced.\"I always back myself to play good rugby and get back in the All Blacks, but the decision might have been different if (Barrett and Mo'unga) had still been around.\"I can't forget (Auckland's Stephen Perofeta) - he's been there. But there is an opportunity.\" (Reporting by Nick Mulvenney, editing by Peter Rutherford)"
    ]
}