{
    "articleURL": "/wires/reuters/article-12048555/Italys-Naples-explodes-joy-city-finally-regains-soccer-crown.html",
    "content": [
        "By Antonio Denti",
        "NAPLES, May 4 (Reuters) - The southern Italian city of Naples exploded into what was shaping up to be a long night of celebrations on Thursday as local team Napoli secured their first Serie A soccer title in more than three decades, sweeping away years of disappointment.Argentine hero Diego Maradona inspired Napoli to its second and last triumph in 1990, but since then, the coveted Scudetto has been won almost exclusively by teams from wealthy northern Italy, such as Juventus, Inter and AC Milan.Napoli claimed a third crown following a 1-1 draw at mid-table Udinese, giving them an unassailable 16-point lead over second-placed Lazio with only five matches left in the season.\"Yes! We are the champions\" supporter Roberto Santoniello told Reuters TV, proudly wearing his club's shirt while others were screaming, waving flags, lighting flares and firecrackers in the central Trieste and Trento Square.Udinese are based in Italy's north-east, more than 800 kilometres away from Naples, so many Napoli fans stayed home and watched the game at their local Maradona stadium, which was specially equipped with eight giant screens.\"Today must be the right day,\" one of them, Raffaele Manfredonia, said. Kevin, another fan who declined to give his surname, said of the expected Scudetto party: \"It will be chaos, mayhem. We won't sleep, we won't work.\"",
        "But then he added, with a chuckle: \"I am joking\".The U.S. consulate issued a security alert last week, saying \"spontaneous celebrations could last multiple days\" and warned of \"heavy traffic or road closures, significant use fireworks, and alcohol consumption throughout the city\".Police had banned fireworks but that did not stop the Neapolitan sky being lit up as soon as the game against Udinese was over. Authorities also banned car and scooter traffic from the city centre in the hope of minimising risk to public order.\"I've been waiting for the Napoli Scudetto since I was small,\" said a teenage girl out with two friends, her cheeks painted Napoli blue. \"It's a victory for the entire city, it's wonderful,\" she added, declining to give her name.In Udine, there were post-match scuffles as Napoli fans ran onto the stadium pitch to celebrate with players, but were met by hostile home supporters armed with belts and batons, the ANSA news agency said.Anti-riot police intervened to break up the fights, and six fans were reported to have sustained non-serious injuries, RAI public television said.Having enjoyed a stellar season, Neapolitans have been gearing up for weeks for the title celebration, casting aside their usual superstition about claiming victory before it happens.",
        "Streamers, banners, flags, scarves and life-sized cardboard replicas of Napoli's present-day footballers, including Nigerian striker Victor Osimhen and Georgian winger Khvicha Kvaratskhelia, have festooned the city centre.The late Maradona is also still revered, celebrated on fans' t-shirts, banners or tattoos, and on a giant mural in Naples' Miracles Square that has become a major attraction in the countdown to the Scudetto. (Reporting by Antonio Denti, Guglielmo Mangiapane and Gabriele Pileri, writing by Alvise Armellini, editing by Pritha Sarkar)"
    ]
}