{
    "articleURL": "/money/markets/article-12048165/Oil-giant-Shell-rakes-record-7-7bn-profit-quarter.html",
    "content": [
        "Shell became the latest oil giant to post bumper profits as it raked in a record £7.7billion in the first quarter of the year.",
        "As the industry faced fresh allegations of ‘profiteering’, it cashed in, with strong energy trading offsetting a fall in oil and gas prices.The haul was a record for the first quarter and £1.4billion better than analysts expected, lifting shares 0.9 per cent, or 20p, to 2345.5p.Five of the world’s biggest oil companies – Shell, BP, Equinor, Exxon Mobil and Chevron – have posted quarterly profits of more than £35billion in recent days.",
        "They have triggered huge rewards for investors in the form of share buybacks and dividends. Shell will return £9.6billion to investors in the first half – £3.2billion of dividends and £6.4billion of buybacks – but it has been accused of a ‘profiteering bonanza’ and doling cash out to shareholders instead of investing in green energy.Chief executive, Wael Sawan, hailed ‘strong results and robust operational performance against a backdrop of ongoing volatility’. The price of Brent crude oil averaged $81 a barrel in the first quarter, below the $96 in the same period of 2022. It is now at just above $70.Although this hit margins, Shell offset it with an improved performance from its trading team and lower running costs. This week, BP also posted a £4billion profit for the first quarter, thanks to lower refining costs and stellar oil and gas trading. ",
        "And it plans £3.2billion of buybacks a year, based on current forecasts.",
        "But these profits and buybacks have reignited calls from environmental groups and politicians for a bigger windfall tax on a sector accused of profiting from Russia’s invasion of Ukraine.Britons’ energy bills have rocketed during the past 18 months as millions struggle to afford food, heating and other necessities.Branding the profits ‘obscene’, the Unite union said Shell has joined BP ‘in continuing the profiteering bonanza’.Sharon Graham, the union’s general secretary, said: ‘The scale of profiteering by Shell and BP is one of the corporate scandals of our times. And this is practically untouched by Rishi Sunak’s so-called windfall tax.’Last year, the Government introduced the energy profits levy to help fund support for families.Shell paid £108million in UK taxes, while BP paid £583million. In January, this was raised from a 25 per cent to 35 per cent tax on profit from North Sea oil and gas producers, taking the effective rate to 75 per cent. Firms can offset the tax by investing in oil and gas extraction in the North Sea, bringing in extra supplies.But Joseph Evans, researcher at think-tank IPPR, said: ‘Shell’s profits soar while households suffer. Instead of using the profits productively, like investing in the green transition, they’ve decided to hand this excess cash straight to their shareholders. ",
        "‘It is time the Government started taxing excessive payments to shareholders. A share buyback tax could bring in billions every year.’But some have warned that risks cutting investment as the UK seeks to beef up energy security.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}