{
    "articleURL": "/wires/aap/article-12058663/Supermarket-giants-begin-moving-soft-plastic-stockpiles.html",
    "content": [
        "Coles and Woolworths say they will meet the deadline to begin disposing of tonnes of soft plastic waste stockpiled by collapsed company REDcycle.",
        "The NSW Environment Protection Authority gave the companies until May 12 to remove parts of the stockpiles, found in huge stashes at 19 sites across the state alone.Another 15 sites in Victoria contain stockpiles of the plastics, six in South Australia, two in Tasmania, and one each in Queensland and Western Australia.Woolworths and Coles took control of REDcycle's stockpiles shortly before the company filed for voluntary administration.The soft plastic recycling program was wound up in November 2022 after it emerged the plastics consumers had returned to supermarkets for recycling were instead put into storage.A spokeswoman for the two large supermarkets said on Monday afternoon they had been working urgently for the past two months to find a site large enough to relocate the 2500 tonnes of soft plastic from high-risk storage sites in NSW.A site at Orchard Hills in western Sydney has been secured and the first of more than 250 truck trips moving about 5000 pallets of waste have begun over the past fortnight.\"This is a huge logistical undertaking and we're on track to meet the deadline for relocating the high priority stockpiles in NSW,\" she said.Some of the plastics being transferred were too decomposed to be used for recycling, and will now head to landfill.",
        "\"Unfortunately, we have been left with no choice but to dispose of this soiled material, which represents a small portion of the total stockpile,\" the spokeswoman said.The material currently identified for disposal represents about 3.6 per cent of the overall national REDcycle stockpile.\"We know this is disappointing, and it is sadly a consequence of REDcycle's stockpiling over an extended period,\" she said.\"We are working with stakeholders across the country to clean this up, and to maximise the amount of the stockpile that can be effectively recycled.\"NSW Environment Protection Authority CEO Tony Chappel had previously described the piles of plastic as incredibly dangerous.\"These stockpiles are stored from the floor to the ceiling, blocking entry ways and preventing adequate ventilation with the soft plastic estimated to fill about three and a half Olympic-sized swimming pools.\"Coles and Woolworths are searching for an alternative recycling scheme but warn it could be a slow process, and are looking into shipping waste overseas to free up limited domestic recycling capacity."
    ]
}