{
    "articleURL": "/wires/aap/article-12039987/Childrens-mental-health-harmed-COVID-19-pandemic.html",
    "content": [
        "The COVID-19 pandemic has seriously harmed the mental health of Australian youths, with the effects still being felt despite restrictions easing.",
        "A University of NSW study found a spike in mental health-related hospital presentations in children and adolescents during the pandemic.While the number of presentations fell as restrictions eased, the number remains above pre-pandemic levels.Australian hospital emergency departments recorded a 15 per cent increase in admissions for all mental health conditions from March 2020, however some illnesses saw more dramatic surges.An estimated 1500 people attended hospital for deliberate self harm, a jump of 82 per cent, while an estimated 1100 additional young people presented to emergency departments for eating disorders - a 76 per cent increase.The number of mental health related admissions fell slightly between January and June last year, but remained above pre-pandemic levels, researchers said.UNSW Medicine and Health's Jahid Khan says the number of mental health-related hospital presentations remained high even after the COVID-19 pandemic restrictions eased.\"This may be a result of continued pandemic-related stresses and delaying seeking mental health care,\" Dr Khan said.The pandemic has compounded pressure on the country's already overstretched healthcare system, which researchers say is a worry as Australia enters its COVID-normal phase.Senior author and academic at the Black Dog Institute Raghu Lingam says it could lead to a mental health service crisis, with health professionals experiencing burnout and longer emergency room waiting times.",
        "\"This in turn may result in more children and adolescents having acute and worsened mental health conditions, due to potentially reduced access to timely and appropriate mental health services and delayed treatment.\"Researchers analysed patient records from six large, public pediatric hospitals in NSW, Queensland, Victoria, WA and South Australia, using admission data from 130,000 children and adolescents.The records were from the beginning of COVID restrictions in March 2020 until they were eased in June 2022.The study is one of the first to look into the effects of the pandemic on mental health presentations at Australian hospitals and was published in Paediatrics last month."
    ]
}