{
    "articleURL": "/wires/ap/article-12038465/Ex-Maine-governor-hopeful-plead-guilty-child-porn-case.html",
    "content": [
        "PORTLAND, Maine (AP) - A wealthy attorney who came close to being elected governor of Maine in 2010 is expected to plead guilty to possessing videos and images of child sexual abuse and to serve nine months in prison, according to a court document.",
        "Eliot Cutler, 76, is due in an Ellsworth courtroom on Thursday, where he's expected to plead guilty to four counts of possession of sexually explicit material of a child under 12, according to terms of the agreement hammered out with prosecutors. Each count carries a maximum penalty of five years in prison, but the sentencing memorandum filed Monday by Cutler's attorney calls for him to get a four-year term with all but nine months suspended.The judge would still need to approve of the deal.The sentencing memorandum describes Cutler's rise to prominence and subsequent fall because of his addiction to pornography, with Cutler acknowledging that he downloaded hundreds of images and videos at a time - so many that he didn't have time to watch them all.Cutler takes responsibility for possessing those images and videos, his attorney wrote, noting that Cutler never engaged in inappropriate conduct with children.\"Eliot has and will accept total and full responsibility for his crimes for which he feels deeply ashamed,\" his attorney, Walter McKee, wrote. \"He recognizes the great harm he caused to those whose images he viewed, as well as the harm to his own family by committing his crimes.\"McKee and Hancock County District Attorney Robert Granger declined to discuss the case Tuesday.",
        "Cutler used his personal wealth to bankroll two campaigns for governor as an independent. He lost by less than 2 percentage points to Republican Paul LePage in 2010 and lost again by a wider margin in 2014.Cutler got a taste of politics as an aide to the late Democratic U.S. Sen. Edmund Muskie, of Maine, and later served as former Democratic President Jimmy Carter´s top adviser for environmental and energy issues.He went on to serve as an environmental attorney and helped found a law firm in Washington before returning to Maine to run for governor.Cutler, who remains free on bail, was arrested last year at his waterfront home in Brooklin, a coastal community 130 miles (210 kilometers) from Portland.___Follow David Sharp on Twitter @David_Sharp_AP"
    ]
}