{
    "articleURL": "/wires/reuters/article-12058693/German-industrial-output-slumps-recession-fears-rise.html",
    "content": [
        "By Maria Martinez",
        "BERLIN, May 8 (Reuters) - German industrial production fell more than expected in March, partly due to a weak performance by the automotive sector, spurring again recession fears in Europe's largest economy.Production decreased by 3.4% on the previous month following a slightly revised increase of 2.1% in February, the federal statistical office said on Monday. In a Reuters poll, analysts had pointed to a 1.3% fall.\"After a buoyant performance by industrial production at the beginning of the year, there was an unexpectedly sharp decline in March,\" the economics ministry said.The manufacture of motor vehicles and automotive parts fell by 6.5% on the previous month. Production in machinery and equipment fell by 3.4% and output in the construction sector decreased by 4.6% on the month.In the first quarter, production was 2.5% higher than in the last quarter of 2022, according to the statistics office.In March, German industrial orders fell by 10.7% from the previous month on a seasonally and calendar adjusted basis, posting the largest month-on-month decline since 2020 at the height of the COVID-19 pandemic.\"German manufacturing is suffering more and more from the global rate hikes, which are increasingly applying the brakes on the economy,\" said Commerzbank's chief economist Ralph Solveen. \"The risks of a recession in Germany are rising.\"",
        "Retail sales and exports also dropped sharply in March, increasing the odds of a downward revision to first-quarter gross domestic product, ING's global head of macro Carsten Brzeski said.GDP wasunchanged quarter on quarterin adjusted terms in the first quarter, following a 0.5% contraction in the fourth quarter of 2022. A recession is defined as two consecutive quarters of contraction.\"A downward revision would mean the economy fell into recession after all,\" Brzeski said. (Reporting by Rachel More and Maria Martinez; editing by Bartosz Dabrowski and Toby Chopra)"
    ]
}