{
    "articleURL": "/wires/reuters/article-12047883/UN-fails-raise-money-Yemen-oil-tanker-operation.html",
    "content": [
        "By Lisa Barrington",
        "DUBAI, May 4 (Reuters) - The United Nations on Thursday fell far short of raising the money it needs for an operation to salvage 1.1 million barrels of oil from a decaying vessel moored off Yemen's coast and avert an environmental disaster.U.N. officials have been warning for years that the Red Sea and Yemen's coastline was at risk as the Safer tanker could spill four times as much oil as the 1989 Exxon Valdez disaster off Alaska.The war in Yemen suspended maintenance operations on the Safer in 2015. The U.N. has warned its structural integrity has significantly deteriorated and it is at risk of exploding.Deputy U.N. spokesperson Farhan Haq said the U.N. was confident a salvage operation could begin by the end of May.\"We have available internal financial mechanisms if there are still gaps. That would, of course, need to be replenished by donors,\" Haq said.The United Nations has said the clean-up of a spill could cost $20 billion, but yet it is struggling to raise the $129 million needed to remove the oil from the Safer and transfer it to a tanker, the Nautica, the U.N. bought for $55 million.Around $99 million has been raised from governments, private donors and crowdfunding. A U.N. event co-hosted by Britain and the Netherlands on Thursday hoped to raise the remaining $29 million needed for the emergency phase, but Haq said only $5.6 million was pledged.",
        "An additional $19 million was required for a critical second phase, Haq said. The Nautica was procured by the U.N. in March and set sail from China in early April.The salvage operation cannot be paid for by the sale of the oil because it is not clear who owns it, the U.N. has said.Yemen has been mired in conflict since the Iran-aligned Houthi group ousted the government from the capital Sanaa in late 2014. A Saudi Arabia-led military coalition intervened in 2015 aiming to restore the government.Peace initiatives have seen increased momentum since Riyadh and Tehran in March agreed to restore diplomatic ties severed in 2016. (Reporting by Lisa Barrington; additional reporting by Reyam Mukhashaf and Michelle Nichols; editing by Christina Fincher; editing by Grant McCool)"
    ]
}