{
    "articleURL": "/wires/reuters/article-12060297/Soccer-Leicesters-relegation-worries-deepen-5-3-loss-Fulham.html",
    "content": [
        "LONDON, May 8 (Reuters) - Willian and Tom Cairney both scored twice to help Fulham beat Leicester City 5-3 at home on Monday, ending the visitors' three-game unbeaten Premier League run and leaving them in the relegation zone after the day's other results.",
        "Leicester, who had taken five points from their last three matches, have 30 points with three games left, falling to 18th place below Everton and Nottingham Forest who both won later.Fulham never really looked to be in danger with Leicester playing catch-up throughout the contest after a dismal first-half display, which was criticised by playmaker James Maddison.\"Big game for us and we were not at it. We were not hungry enough to want to win the game. We need to do the basics well,\" Maddison told the BBC.\"We can't defend like we did, that is why we are where we are but it not just the defence, it is the team. The team needs to be watertight and that comes from the front too.\"They played through us. They scored three goals in the first half and it left too much to do.\"Leicester face Champions League-chasing Liverpool and Newcastle United in their next two games.Fulham were gifted the opener in the 10th minute by a howler from goalkeeper Daniel Iversen, who misjudged the trajectory of a Willian free kick and could only watch as the ball bounced past him and into the back of the net.Leicester's sole attacking outlet in the first half was the ever-lively Jamie Vardy, who twice tested Bernd Leno from range.",
        "The hosts continued to press forward, with Carlos Vinicius squeezing a shot past Iversen in the 18th minute before Cairney scored either side of halftime to give the West London club a four-goal advantage.Leicester pulled a goal back as winger Harvey Barnes fired into the roof of the net in the 59th minute before Vardy won and missed a penalty, but Willian wrapped up a one-sided victory by curling home Fulham's fifth from distance.The visitors scored through Barnes and Maddison late on but they merely added some respectability to the scoreline on an awful day for Dean Smith's team.Marco Silva's Fulham have now won 14 league games this season -- equalling a club record in the Premier League.\"Great moments of football, great goals. The way we played from the first minute was really good,\" Silva told the BBC.\"We prepared well for the game and the players executed the plan very well. We clearly deserved the three points and it should have been much more comfortable. That is something for us to work on and keep improving.\"Fulham remain 10th in the table. (Reporting by Aadi Nair in Bengaluru, additional reporting by Martyn Herman Editing by Toby Davis)"
    ]
}