{
    "articleURL": "/news/article-12047255/Inquests-open-deaths-father-son-days-joint-funeral-shot-dead.html",
    "content": [
        "Gary Dunmore, 57, and his son Josh Dunmore, 32, were found dead in MarchThey were both found dead with head and torso wounds in CambridgeshireThe inquests into the deaths of a father and son who were both shot dead amid an alleged custody battle have opened just days after their joint funerals.",
        "The inquiries into the death of Gary Dunmore, 57, and his son Josh Dunmore, 32, opened today at Peterborough Town Hall, Cambridgeshire.It comes just days after hundreds of mourners flocked to West Chapel in Cambridge, Cambridgeshire, for their funeral.Josh was found with shotgun wounds to his head and chest and pronounced dead at 9.40pm on March 29 at his home in Bluntisham, Cambridgeshire, the inquest heardGary was also found dead at his home in Sutton, Cambridgeshire, 20 minutes later, with shotgun wounds to his head and torso.",
        "Coroner Simon Milburn said it was likely Josh's inquest would be 'suspended' due to police investigations.But he added post mortem examinations were carried out on both men on April 3 at Peterborough City Hospital.Stephen Alderton, 66, the maternal grandfather of Josh's young son, was arrested the same evening and has been charged with their murders and possession of a firearm.The victims' family paid tribute to the 'devoted' father and son in a statement released via Cambridgeshire Police last month.The family said: 'Josh was a devoted father and a loving uncle. He was a wonderful son and brother and leaves behind an extensive group of family and friends.'He will be deeply missed and the devastation this has caused will never heal. Gary was the most devoted son, brother, dad and grandad, who gave everything for those he loved.' ",
        "'He was a gentle and generous person who always put others before himself and he'll be massively missed by his family and all those who knew and loved him.'",
        "In March, MailOnline revealed that Mr Dunmore had been celebrating after successfully stopping his former partner and her husband from taking his son to America.He had turned up to a boxing gym close to his home 'buzzing' after being given the good news, friends said, and was looking forward to having his son for a week over Easter.But Mr Dunmore and his father were soon allegedly gunned down by his ex-lover's father Mr Alderton, in a 'targeted' double shooting.Cambridgeshire Police Chief Superintendent Jon Hutchinson said at the time: 'At this stage we're not looking for any further people in relation to the incident. 'Once we had identified that family relationship, it became quite apparent why this attack may have happened and this is clearly a targeted and isolated attack.''A line of inquiry that we're focusing on is that those people who are in custody are known to the deceased and have had recent contact with them.'"
    ]
}