{
    "articleURL": "/wires/reuters/article-12053355/Merrill-Kelly-fans-10-D-backs-3-1-win-Nationals.html",
    "content": [
        "Merrill Kelly's season-high 10 strikeouts and Corbin Carroll's fifth home run helped the Arizona Diamondbacks to a 3-1 win over the Washington Nationals on Friday night at Phoenix.",
        "The Diamondbacks started a 10-game homestand by winning for the fifth time in their last seven games.Kelly (3-3) scattered four hits and had one walk in seven innings.Luis Garcia homered off Kelly with one out in the first inning, and Dominic Smith reached third base in the second inning after a walk and a Lane Thomas single. Kelly escaped unscathed by getting a groundout and a strikeout.Kelly settled down and did not allow a baserunner past first base in the third through seventh innings. He faced only 16 batters and struck out six in that span.Carroll returned to Arizona's starting lineup in left field for the first time in six days because of a knee injury he suffered last weekend at Colorado when he crashed into the outfield fence.With two outs in the third inning, he hit a solo home run off Josiah Gray (2-5) to tie the game at 1.The Diamondbacks scored two more runs against Gray in the fourth inning after loading the bases with one out on a single by Dominic Fletcher, a walk to Alek Thomas and single by Geraldo Perdomo.Josh Rojas' fielder's-choice groundout scored Fletcher, and Ketel Marte followed with a sacrifice fly to give Arizona a 3-1 lead.",
        "Kelly combined with relievers Miguel Castro and Andrew Chafin to throw three perfect innings to end the game. Chafin struck out two in earning his fifth save.Washington relievers Erasmo Ramirez and Hobie Harris also kept Arizona without a hit in the last three innings.Gray went five innings and allowed three runs on seven hits with six strikeouts and two walks.Garcia finished 2 for 4 with a run and RBI as the only Nationals player with multiple hits.Christian Walker and Gabriel Moreno each went 2 for 4 for the Diamondbacks.--Field Level Media"
    ]
}