{
    "articleURL": "/wires/ap/article-12056829/Crystal-Palace-ban-fan-alleged-racial-abuse-Son.html",
    "content": [
        "LONDON (AP) - Crystal Palace promised Sunday to issue a club ban to a spectator who is alleged to have racially abused Tottenham forward Son Heung-min during a Premier League match between the teams.",
        "Footage has circulated on social media of a man in the away end at Tottenham Hotspur Stadium making what appears to be a racist gesture toward Son on Saturday.The incident occurred in the 89th minute of Tottenham's 1-0 win when Son was replaced by substitute Arnaut Danjuma and had to walk around the outside of the field, past Palace's travelling support.\"We are aware of a video circulating online (as well as reports made directly to us) regarding an individual in the away end at Spurs yesterday, appearing to make racist gestures towards Son Heung-min,\" Palace said in a statement.\"Evidence has been shared with the police, and when he is identified, he will face a club ban. We will not tolerate such behavior in our club.\"Tottenham said it was aware of an allegation of racial abuse toward Son.\"Discrimination of any kind is abhorrent and has no place in society, our game and at our club,\" Tottenham said.\"We are working with Met Police and Crystal Palace to investigate and identify the individual involved. We will do everything in our powers to ensure that if found guilty, the individual will receive the strongest possible action - as was the case earlier this season when Son suffered similar racial abuse at Chelsea.\"",
        "Son was abused during the Chelsea-Tottenham match at Stamford Bridge in August.Chelsea banned a season-ticket holder indefinitely after footage emerged on social media of a fan in the home end making a racist gesture. The Crown Prosecution Service issued the supporter with an order banning him from attending live soccer matches for three years.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}