{
    "articleURL": "/wires/aap/article-12056191/Fagan-slams-prejudicial-reports-Hawks-racism-saga.html",
    "content": [
        "Brisbane coach Chris Fagan is pleading for an end to \"damaging and prejudicial\" reporting of Hawthorn's racism saga.",
        "And Fagan says while he's open to attending mediation, he won't if given a list of demands to abide by.Fagan, North Melbourne coach Alastair Clarkson and former player development manager Jason Burt have been named as figures involved in alleged episodes of racism during their time at Hawthorn.All deny any wrongdoing.The allegations, initially reported last September, are the focus of an ongoing investigation independent of the AFL.Mediation has been offered to help resolve the matter with News Corp's Herald Sun on Friday publishing what it said were 18 conditions for mediation.These included public apologies, reparations, a joint media statement and termination of all legal claims.In a statement reported by Fox Sports on Sunday, Fagan said he would consider attending mediation \"in good faith with a view to arriving at a consensual resolution, if that is possible\".\"I expect, however, that other potential participants will also approach a potential mediation in good faith,\" Fagan's statement said, according to Fox.\"I consider that the making of demands of the kind referred to in the Herald Sun article would be inconsistent with this.\"I wish to make it very clear that I will not be attending a mediation on the basis that I accept any of the 18 supposed demands.\"",
        "Fagan said \"numerous journalists and publishers have fuelled damaging and prejudicial speculation about matters concerning the investigation by the publication of articles which are defamatory of me and others\".\"This is patently unfair. It should stop,\" he said.\"Like all other participants in the investigation, I am bound by a confidentiality deed.\"Based on the recent reporting in the Herald Sun, I am deeply concerned that one or more participants in the investigation or their advisors is breaching his or her obligations.\"Fagan didn't rule out taking legal action.\"I have never given up the right to take up my concerns in the appropriate forum,\" he said.\"I have complete faith in the court system in Australia and our system of open justice.\"I have been involved in football coaching or other roles within football clubs for approximately 40 years.\"I am proud of my work and my conduct. I stand behind it ... I deny categorically any wrongdoing by me.\"I have long been willing to participate in a fair process concerning the allegations against me but everyone has an equal right to fair treatment.\"I wish no more, and no less, than to be afforded this right.\"Speaking soon after North Melbourne's loss to St Kilda on Sunday, Clarkson said he had not seen Fagan's statement but had been made aware of it.",
        "Asked whether he was open to mediation, Clarkson said: \"I'm open to speaking to the investigation panel first and foremost.\"Until such time as we get an opportunity to do that, I don't really want to give too much consideration to anything else except the opportunity to speak to the panel and put forward our story.\"Clarkson said it was \"extraordinary\" he had not yet been able to speak to the investigation panel.\"We're looking forward to the day that we get that chance,\" Clarkson said."
    ]
}