{
    "articleURL": "/health/article-12046727/Just-half-hour-mobile-phone-calls-week-raises-risk-high-blood-pressure-scientists-say.html",
    "content": [
        "A team from China found that regular callers are at highest risk of hypertensionThey analysed more than 200,000 UK adults, looking at their phone usage We all enjoy a catch-up over the phone with family and friends.",
        "But calls should be kept to a minimum to keep blood pressure low and our hearts healthy, experts have warned.That’s because new research suggests talking on a mobile phone for just half an hour per week is linked to a greater risk of high blood pressure.And regular callers, who spend an hour on the phone per day, appeared to be at the highest risk of developing the condition.A team from Southern Medical University in Guangzhou, China, wanted to investigate whether there was a link between making and receiving phone calls and a new diagnosis of high blood pressure, also known as hypertension.",
        "They analysed data on more than 200,000 UK adults and collected information about their mobile phone use through a questionnaire.These included questions about how many years they had been using a mobile, how many hours per week they spent using it and whether they used a speakerphone or hands-free device.Over a 12-year follow-up, they discovered participants who talked on their mobile for 30 minutes or more per week had a 12 per cent greater likelihood of developing high blood pressure than those who spent less time on phone calls.This is the equivalent to being on the phone for just four minutes and 17 seconds per day.",
        "Looking at the findings in more detail they discovered people who spent more than six hours on the phone each week had a 25 per cent raised risk of high blood pressure compared to those who spent less than five minutes making or receiving phone calls.",
        "The number of years participants had been using a mobile phone, or whether they used a hands-free device, did not appear to make a difference to the level of risk.Professor Xianhui Qin, one of the study’s authors, said: ‘It’s the number of minutes people spend talking on a mobile that matter for heart health, with more minutes meaning greater risk.‘Our findings suggest that talking on a mobile may not affect the risk of developing high blood pressure as long as weekly call time is kept below half an hour.‘More research is required to replicate the results, but until then it seems prudent to keep mobile phone calls to a minimum to preserve heart health.’It is estimated that just over a quarter of adults in the UK, around 14.4 million people, have high blood pressure.The condition can damage arteries by making them less elastic, which decreases the flow of blood and oxygen and can lead to a heart attack or stroke.",
        "The link between mobile phone use and higher blood pressure could be to do with low levels of radiofrequency energy emitted by the devices, the researchers said.However previous research on the same topic has had mixed results – possibly because they included calls, texts and gaming, they added.Writing in the European Heart Journal – Digital Health, the team said: ‘In recent years, mobile phones have become a device of everyday life around the world.‘This raises important questions about the safety of using a mobile phone to make or receive calls, especially for heavy users.‘Our study provides some new insights. Mobile phone use for making or receiving calls was related to a significantly higher risk of new-onset hypertension, especially in those with a longer weekly usage time.’",
        "High blood pressure, or hypertension, rarely has noticeable symptoms. But if untreated, it increases your risk of serious problems such as heart attacks and strokes.More than one in four adults in the UK have high blood pressure, although many won't realise it.The only way to find out if your blood pressure is high is to have your blood pressure checked.Blood pressure is recorded with two numbers. The systolic pressure (higher number) is the force at which your heart pumps blood around your body.The diastolic pressure (lower number) is the resistance to the blood flow in the blood vessels. They're both measured in millimetres of mercury (mmHg).As a general guide:high blood pressure is considered to be 140/90mmHg or higherideal blood pressure is considered to be between 90/60mmHg and 120/80mmHglow blood pressure is considered to be 90/60mmHg or lowerA blood pressure reading between 120/80mmHg and 140/90mmHg could mean you're at risk of developing high blood pressure if you don't take steps to keep your blood pressure under control.If your blood pressure is too high, it puts extra strain on your blood vessels, heart and other organs, such as the brain, kidneys and eyes.Persistent high blood pressure can increase your risk of a number of serious and potentially life-threatening conditions, such as:heart diseaseheart attacksstrokesheart failureperipheral arterial diseaseaortic aneurysmskidney diseasevascular dementiaSource: NHS"
    ]
}