{
    "articleURL": "/tvshowbiz/article-12048849/The-Flash-characer-posters-offer-new-look-Michael-Keatons-Batman-iconic-Batmobile.html",
    "content": [
        "With just a month and a half left before The Flash hits theaters, Warner Bros. has released three new character posters for the superhero epic.",
        "The posters (via The Flash Twitter) offer closer looks at Michael Keaton's Batman and his iconic Batmobile, along with Ezra Miller's title character and Sasha Calle's Supergirl.Each of the posters feature the tagline 'Worlds Collide' up top with each character below.The film had its first public screening at the annual CinemaCon convention in Las Vegas, where many critics called it one of the best superhero movies of all time. The Batman showcases Keaton's beloved hero in his Batcave, with bats swirling all around him and his Batmobile. The film is inspired by the iconic Flashpoint comics, a 2011 comic book crossover story by Geoff Johns that featured several iconic characters and lead into DC's New 52 reboot.The story follows Barry Allen as he uses the Speed Force to go back in time to save his family... but in doing so creates a whole new world without superheroes.The film is set in multiple 'universes,' which explains why Ezra Miller plays two different versions of Barry Allen, and why there are two Batman's.Michael Keaton returns as Bruce Wayne/Batman from his 1989 film Batman and 1992 sequel Batman Returns, who has been the Caped Crusader for many years in his universe.Ben Affleck also returns (likely for the last time) as Batman from the main timeline of the DC Extended Universe, after starring in Batman v Superman: Dawn of Justice, Suicide Squad, Justice League and Aquaman.",
        "Also returning from 2013's Man of Steel is Michael Shannon as the villainous General Zod and Antje Traue's Faora, along with Aquaman's Temuera Morrison as Tom Curry.Ron Livingston and Maribel Verdu also stars as Barry's parents - Henry and Nora - with Kiersey Clemons returning as Iris West.  Warner Bros. has set a June 16 release date for The Flash, directed by Andy Muschietti (IT) from a script by Christina Hodson (Birds of Prey) and Joby Harold (Army of the Dead). While The Flash was receiving rave reviews from critics at CinemaCon, many are still concerned about the studio continuing to back Ezra Miller after his spate of legal troubles.",
        "The 30-year-old actor was arrested several times earlier this year for assault and burglary, faced accusations of grooming children, and reportedly provided housing for a mother and three young children at an unlicensed cannabis farm in Vermont despite opposition from their father.The actor issued a statement in August apologizing for his behavior while revealing that he was seeking treatment for 'complex mental health issues.'His reps told Variety in a statement: 'Having recently gone through a time of intense crisis, I now understand that I am suffering complex mental health issues and have begun ongoing treatment.'The statement continued: 'I want to apologize to everyone that I have alarmed and upset with my past behavior. I am committed to doing the necessary work to get back to a healthy, safe and productive stage in my life.'"
    ]
}