{
    "articleURL": "/tvshowbiz/article-12060275/Olivia-Attwood-shows-13k-birthday-present-fianc-Bradley-Dack-ahead-nuptials.html",
    "content": [
        "Olivia Attwood showed off her extravagant birthday present from her fiancé Bradley Dack on Instagram ahead of their upcoming nuptials.",
        "The former Love Island star, 32, shared a string of snaps from her birthday celebrations including a lavish gift and heartfelt card from Bradley.Olivia will finally marry the Blackburn Rovers footballer, 29, this summer after three attempts to tie the knot due to various delays. She showed off a Bulgari watch she'd been gifted, called the Serpenti Tubogas single-spiral watch in 18 kt yellow gold and stainless steel, which costs a whopping £13,200.She also revealed a host of gorgeous flower bouquets and a sweet birthday card from Bradley. ",
        "It read: 'Happy birthday, I hope you get everything you deserve, because you are the kindest, funniest, caring, skinny, beautiful, (moaniest), haha, person I know. Love you forever and always! Love Brad xxx.'Last week, Olivia discussed her third attempt at getting married with New! Magazine - saying this one feels 'true to who she is'.  She said: 'I think the wedding we are going ahead with this summer is much more true to who I am and who Brad is and it reflects our personalities a lot more.'We've stood our ground and reduced the guest list quite drastically and I feel way better about it.'On whether she is a Bridezilla, she added: 'I can feel myself dreaming about the wedding more and as the days get close I can feel it rising up inside me. But I wouldn't say it's in my character to be a bridezilla. ",
        "Elsewhere in the chat, on if she will cry on the big day she answered: 'I've known Brad for seven years and I've seen him cry once But I reckon he could be more emotional than me!'It comes after last month it was first revealed that the couple's nuptials and the build-up to their wedding will be in the ITV show.After postponing their wedding a number of times due to the pandemic and Bradley, being injured, the couple are finally set to walk down the aisle in June and their fanbase will have the chance to see all the action unfold.Olivia and Bradley are getting hitched at luxury venue Grantley Hall after scoping out potential locations in the series, which concludes with the pair sharing their romantic day with the show's viewers.A TV source told MailOnline: 'Olivia and Bradley are so excited to begin filming Olivia Marries Her Match. It has been everything they have dreamed of for years now and finally their day big day is almost upon them.'Olivia's fanbase has watched her grow from her time on Love Island and she can't wait to share her wedding day with them all.'So far this year she's been jam-packed filming the next series of Filthy Rich, which often means her and Bradley are spending days apart.",
        "'But filming the buildup to their nuptials will be so special because they will be doing it together, plus they will always have the memories captured to look back on.'Olivia met Bradley in a nightclub before she starred on Love Island, but the couple found their way back together and have been engaged since the footballer popped the question in 2019.",
        "A number of setbacks prevented the pair from sealing the deal, with Olivia revealing to MailOnline in November 2021 that she and Bradley cancelled their 2022 wedding because neither of them wanted to rush making important decisions. Olivia listed several reasons including the pressure on her shoulders with work commitments, Bradley's football schedule and recovering from his injury, plus needing time on their side for their stag and hen dos.  But after three years of planning, they are set to marry in an idyllic ceremony and Olivia's dress, which she's had in her possession for months, will finally be worn. Olivia and Bradley live together in Manchester with their dogs Lola and Stitch and even share matching tattoos in tribute to their 'first babies.'"
    ]
}