{
    "articleURL": "/tvshowbiz/article-12046943/Gisele-Bundchen-shows-toned-legs-new-ads-Jimmy-Choo.html",
    "content": [
        "Gisele Bundchen has landed a high-profile shoe campaign.",
        "The 42-year-old Brazilian bombshell is the new face of Jimmy Choo, it was revealed on Thursday morning.The mother-of-two - who was seen at the Miami airport on Wednesday after attending the Met Gala in NYC - looked stunning in the new collection for summer which included platform heels and sandals as well as purses.The ex-wife of football veteran Tom Brady was seen on the beach in Miami as she posed away with her curly, highlighted hair worn down over her shoulders as she displayed her tanned skin.The catwalk queen wore swim bottoms with colorful tops as well as a white fringed flirty dress and a blue denim jacket with shorts.",
        "'Jimmy Choo introduces Gisele as the star of the brand's Summer 2023 campaign,' it said in a release shared on Thursday.'Captured by Carlijn Jacobs on location in Miami, Gisele embodies the glamorous, confident, and daring spirit of Jimmy Choo. 'The epitome of a modern goddess she commands full attention against a sun-drenched backdrop, her gaze and presence captivating and self-assured.The brand said that the Summer 2023 collection is inspired by the 'heady energy of summer romance and the instinctive glamour of sun-drenched days.'There is the gold AGAVE FLAT gladiator sandal to the pearl embellished FAYENCE slide and handwoven BON BON BUCKET MAXI bag as well as the  SAEDA SANDAL PLATFORM and the INDIYA metallic sandal encapsulate timeless glamour.",
        "'Gisele's confident presence, and magnetism underscore versatility. Her statuesque poses and joyful sense of movement, as brought to life in the campaign film, embody the spirit of the brand,' Choo said in the press release.",
        "Bundchen is said to be 'back to herself' after divorcing from Brady.The supermodel - who made her first solo appearance at the Met Gala on Monday - was married to former NFL star Tom, 45, from 2009 until 2022.Together they share Benjamin, 13, and 10-year-old Vivian.Now an insider has claimed that she is just happy to be in 'mom mode' since parting ways with her ex-husband.A source told People: 'She's back to herself, she's good, she's happy, she's doing lots of good things. 'She's back to work. [When she was with Tom,] she was just focusing on being a mom. 'With all their moves [because he changed teams] and everything, you have to be in mom mode. ",
        "'She's really happy just enjoying her new chapter!'In March, Gisele was asked about the speculation that she had become romantically involved with instructor Joaquim Valente.And although she was vague in her response, she admitted she is 'so grateful' to know the trainer and his brothers Pedro and Gui, who also teach martial arts.",
        "She told Vanity Fair: 'I think, at this point, unfortunately, because I'm divorced, I'm sure that they're going to try to attach me to anything.'I'm so grateful to know all of them, because not only have they helped me and helped my kids, but they have become great friends, and Joaquim especially.",
        "'He's our teacher and, most importantly, he's a person that I admire and that I trust. 'It's so good to have that kind of energy, to have my kids around that type of energy.'Meanwhile, Gisele credited Tom's 15-year-old son Jack - who he has with former partner Bridget Moynahan - for awakening her own desire to have children.She said: 'I've always dreamed of being a mom, but I think that happened a little faster than I thought, because now I have this beautiful little angel that I get to care for and love.'"
    ]
}