{
    "articleURL": "/wires/aap/article-12058363/Addo-Carr-closing-miracle-return-Origin.html",
    "content": [
        "Josh Addo-Carr is closing in on a \"miracle\" early return from his syndesmosis injury, with the Canterbury flyer expected to return within the next fortnight.",
        "Addo-Carr has returned to running at Bulldogs training in the past week, and has realistic hopes of facing the Warriors on Friday night.If he is not fit for that, teammates expect Addo-Carr will come back against Gold Coast in round 12, hours before NSW's State of Origin team is set to be named.It comes after the 27-year-old was initially ruled out until round 15 when he underwent surgery on his ankle after being injured on Good Friday against South Sydney.\"It's literally a record if he does come back,\" fellow winger Jacob Kiraz said.\"It's crazy, because when he did it he said he would come back in four weeks and everyone was saying, 'Yeah, yeah'.\"Hopefully he can pull off a miracle. He has to do a couple of tests and stuff he has to finish. Get training done and do it without any pain.\"He is a big part of our team and I would love to see him out there.\"If Addo-Carr does return in the next fortnight, it would put the former Melbourne winger in the box seat to reclaim the NSW Origin jumper he lost last year for Game I on May 31.Left out by Brad Fittler ahead of NSW's 2-1 series loss, Addo-Carr was one of the stars of last year's World Cup win for Australia with 12 tries in five games.",
        "Addo-Carr's push to return early from his round-five injury coincides with Kiraz's effort to do similar, after he rushed back from a knee problem against Canberra last Friday.\"Last week he was running with me when I was coming back and was doing what I was doing,\" Kiraz said of Addo-Carr.\"It it's a credit to him, he has worked so hard. The physio team, even the performance staff and everyone.\"To see him doing what I was doing last week, and he was supposed to be back in another three or four weeks, he is looking good.\"Origin hopes aside, Addo-Carr's return would also prove a timely boost for the Bulldogs after their 32-30 loss to the Raiders marked their fourth defeat in five weeks.Struck down badly by injuries through the first half of the year, Canterbury are 15th on the ladder, four points out of the top eight and yet to have their bye.The Bulldogs know they must start winning on Friday against the Warriors.\"The whole year, there have been games where we show our grit,\" Kiraz said.\"But there is only so much grit, we need to stick to the game plan.\""
    ]
}