{
    "articleURL": "/sport/mlb/article-12051595/Ex-Mets-pitcher-Matt-Harvey-announces-retirement-nine-year-MLB-career.html",
    "content": [
        "Matt Harvey starred for the Mets and helped them make the World Series in 2015But he struggled to reach the same levels after he left New York before retiringDailyMail.com provides all the latest international sports newsPitcher Matt Harvey, most well-known for his time with the Mets from 2012-18, announced his retirement Friday and thanked the New York fans that cheered him on at Citi Field.",
        "Harvey was an All-Star in 2013 and helped lead the team to a World Series trip the two years later.And while he'd go on to play for the Reds, Angels, Royals and Orioles before calling it a career, by the greatest moments of his career came in New York.'To the fans, and most importantly the NY Mets fans: you made a dream come true for me,' he wrote on Instagram.'A dream I could never could have thought to be true. Who would have thought a kid from Mystic, CT would be able to play in the greatest city in the world, his hometown. You are forever embedded in my heart.",
        "After Harvey's strong 2015 season - which came after he recovered from Tommy John surgery - he struggled, posting a 5.92 ERA over the next six seasons of his career.'With all the amazing memories came a lot of injuries and tough times. The realization that those amazingly powerful moments that make me thrive as a pitcher and help my teammates and city win are no longer possible.'Believe me I wish I could have done more and brought more of those amazing moments back to life. I have to say this is my time to say thank you, and goodbye.'",
        "The 34-year-old last appeared in the MLB in 2021, and served a 60-game suspension at the start of the 2022 season for distributing a prohibited drug of abuse and therefore violating MLB's drug program.That indiscretion came during his time with the Angels, as Harvey later admitted to a court that he provided former teammate Tyler Skaggs with Percocet pills found in his possession the day he died in 2019.Harvey made two appearances for Italy in the World Baseball Classic this year. "
    ]
}