{
    "articleURL": "/wires/aap/article-12045291/Outback-Aussie-town-start-Kings-reign-bang.html",
    "content": [
        "Marie Paulsen remembers catching a fleeting glimpse of a young Queen Elizabeth dressed in elegant blue, radiant in the Brisbane sun.",
        "\"I was a young chick then,\" Mrs Paulsen told AAP.The now 92-year-old was among thousands of admirers who waited on the streets of the Queensland capital to see the newly-crowned Queen during the 1954 royal tour, the first time a reigning monarch visited Australia.\"I remember the vehicle appeared and Elizabeth was sitting there in pale blue, she looked absolutely beautiful,\" Mrs Paulsen said.\"I've never seen such a vision, such a complexion in my life. It was a bright sunny day and she was feeling the heat.\"Seven decades later, Mrs Paulsen will be one of few people to see two coronations in a lifetime when she watches King Charles III officially crowned from her home in Quilpie, outback Queensland, on Saturday night.\"It's been thrust upon him and now he has to deal with it, but he's well able to do that,\" she said.\"They cop a lot of criticism, the royals, whether they deserve it or not. But I think they do a good job.\"Mrs Paulsen is not the only royal watcher among the 702 people who live in the outback town nearly 1000km west of Brisbane.Quilpie Shire councillor Lyn Barnes, a self-described devotee of the Westminster government system, has helped organise a bonfire and fireworks display at the Baldy Top red rock lookout just outside of the town on Saturday evening.",
        "\"We have a new king and it's important that even little places like Quilpie, tiny outback communities, have the opportunity to be part of a global event,\" Cr Barnes said.The celebration honours the royal family's long affinity with rural Australia, where Queen Elizabeth, Prince Philip, King Charles, Princess Diana and Princes William and Harry were all warmly welcomed over the years.\"King Charles himself is a country person at heart, as was the Queen, a great woman of the country,\" Cr Barnes said.Revellers will soak up the King's coronation music playlist, listening to Handel and Holst as they stay warm by the fire and watch the fireworks.Cr Barnes hopes the outback stars come out for the King.\"What a good thing for Quilpie to step up beside Tunbridge Wells and English villages and be part of the whole thing.\"People look at places in the outback and think we are really isolated, but you can go to the Quilpie airport and fly anywhere in the world. We're as much a global community as anywhere.\"Plus Quilpie people will do anything for a party.\""
    ]
}