{
    "articleURL": "/sport/formulaone/article-12055183/Sergio-Perez-takes-Miami-Grand-Prix-pole-Charles-Leclercs-crash-dents-Max-Verstappens-hopes.html",
    "content": [
        "Sergio Perez took pole position after a dramatic qualifying session in MiamiCharles Leclerc crashed late on, leaving Max Verstappen down in ninth placeLewis Hamilton went out in Q3 and will start Sunday's race from 13th place Lewis Hamilton showed up here last week with a twinkle to match his diamond earrings, but was left shaking his head in dejection after qualifying an awful 13th for the glitz-studded Miami Grand Prix.",
        "'A kick in the guts,' is how he described the performance of his Mercedes car. Worse, he was outperformed by his team-mate George Russell, who qualified sixth for the 57-lap race around the Hard Rock Stadium, which will be attended by stars from sports and showbiz as well as tech giants Elon Musk and Jeff Bezos.Russell on top of Hamilton is the way around it has been on four out of five occasions in qualifying this season, and that is seriously hard on the digestive system.While Hamilton suffered his own problems, the grid wears a topsy-turvy air after Ferrari's Charles Leclerc crashed – again – to bring out a red flag and a premature end to proceedings. Red Bull's Sergio Perez took pole as his pursers' final flying laps were scuppered.Team-mate Max Verstappen, turning the air blue as his plans were curtailed, will start ninth. That sets up a potential blockbuster of a race, though it is not too easy to overtake here, or so last year's inaugural edition suggested. Fernando Alonso was second quickest for Aston Martin, Carlos Sainz third for Ferrari and Kevin Magnussen fourth for Haas.",
        "Leclerc skidded off at Turn 7, just as he had in practice on Friday. The Monegasque is lightning quick, but has a worryingly growing record of making too many mistakes for his status as the Scuderi'a No 1.",
        "As for Hamilton, disappointment follows disappointment. After his expulsion, the seven-time world champion came straight on the radio to say: 'We left that way too late.' But, in truth, he and Mercedes were way off the pace throughout practice and his early misfortune came as no great surprise.He was 1.1 seconds adrift of Verstappen in the same session and two-tenths short of Russell.Hamilton's progress had been dented early when he was squeezed by the Haas of Kevin Magnussen at Turn 17 and returned to the pits to check if his contact with the barrier had damaged his front wing.'I hit the wall,' he said, before returning to the fray, briefly.Hamilton is 45 points behind championship leader Verstappen after just four races. The Briton's second-place finish in Australia last month is a distant memory. He finished sixth in Baku last week.The British star said: 'We knew it was very hard and there was a 50:50 chance we could get into Q3, so we need to be better with our timing. It's done. I'll try to get my head down tomorrow and see what I can do – 13th to God knows where.'We are trying different things, but It's the same every week. We are a second down. We are just not particularly quick. It is a struggle out there. I hope we can start a new path next race.'",
        "That was a reference to a major, long-planned upgrade coming in Imola a fortnight hence, and desperate hopes hinge on that.",
        "Despite the gloom, Wolff is confident that Hamilton will re-sign for the team when his current contract expires at the end of the year, saying: 'Lewis and Mercedes have been together for 11 years, and every single time when we talk about his contract, it's six months of \"where are we and what is happening?\" And each time we're just rolling on.'It was a terrible afternoon for McLaren. Both cars bombed out in Q1. Lando Norris qualified 16th with rookie team-mate Oscar Piastri only 19th. A pained expression came across chief executive Zak Brown's face as he saw the results on the timing screens.Making matters more uncomfortable is the fact McLaren took on a major upgrade only in Baku last week – the one that was meant to unlock speed that their original design had lacked.Williams' local boy Logan Sargeant, who grew up in Fort Lauderdale, moved to Europe to pursue his career and today's race will be the first time he has competed Stateside. It promises to be a tough day for him, just as it may well be for Hamilton."
    ]
}