{
    "articleURL": "/wires/aap/article-12052063/Seibold-wants-Schuster-Manly-Sharks-showdown.html",
    "content": [
        "Manly coach Anthony Seibold says five-eighth Josh Schuster is in the frame to play next week against fierce rivals Cronulla.",
        "The 22-year-old has been ordered to get himself in shape through a reconditioning program so he can to play to his immense potential.After the Sea Eagles' 32-6 loss to Brisbane on Friday, their second defeat on the trot, his presence on the field at his best is urgently required.Schuster has played three games this year due to soft tissue injuries. Manly won two and lost the third in golden point to South Sydney.Seibold was asked about a photo on social media of Schuster with his wrist or hand strapped up, and whether that was another issue he knew of that was contributing to his absence.\"Not that I am aware of but Josh has been back there (in Manly) with some of the performance staff,\" Seibold said.\"Josh will be available, from my understanding, for next week's game. We will get a look at him (on Saturday). There will be some guys who train and he will be part of that group.\"Whether he plays in the home game against the Sharks on Sunday, May 14 is yet to be determined.\"I will have a look at that and see how he is going with his reconditioning,\" Seibold said.Seibold defended Schuster from negative comments about his attitude towards training.",
        "\"I have never said anything about his attitude,\" he said.\"That must be commentary from outside the building. He has had a calf injury and a quad injury to start the year so he hasn't really got started.\"I thought he was really good against Parramatta and Souths.\"Sea Eagles captain and half Daly Cherry-Evans topped the tackle count with 36 against the Broncos. He tried his heart out but will need more from whoever his halves partner is in future if the side is to prosper.Cooper Johns, No.6 against the Broncos, has played six games for the Sea Eagles this year but is in the infancy of his career.\"For Cooper it is all learning and I am really proud of the way he has started the year,\" Seibold said.\"Prior to this year he has played 11 games so ... he is still developing.\"The Sea Eagles had lapses in the 26-10 defeat by the Gold Coast the previous week but the coach said the loss to the Broncos was not about defensive deficiencies.\"When you are making 15 errors it is not a defensive thing,\" he said.\"It is a cycle and we have got to keep working and building on the platform we made earlier in the season.",
        "\"It has been a disappointing two weeks but we will bounce back and keep chipping away.\"Seibold's men ripped into Melbourne in a gritty and tough 18-8 win in round seven but haven't replicated that kind of intensity since."
    ]
}