{
    "articleURL": "/news/article-12052889/Mother-Akira-Garton-wants-inquest-death-Byron-Bay-twins-died-commune-fire.html",
    "content": [
        "Mother wants inquest into twins death at a hippie communeTwin girls died in a tragic candle fire in Goonengerry, NSWFour-year-old Tarrow and Ophelia died of smoke inhalationThe mother of twin girls who died in a tragic commune fire while visiting their father and his girlfriend has demanded an inquest into their deaths.",
        "Four-year-old Tarrow and Ophelia were fast asleep by themselves in a house when a tall candle burning just metres away set a painting alight, resulting in toxic smoke that engulfed the children and ended their young lives.The adults who were gathered outside around a bonfire approximately 50m away had no warning of what happened as the smoke alarm was found disabled with no battery at the Goonengerry commune in northern NSW, near Byron Bay, on November 6, 2021.Their mother, Akira Garton, says many questions remain and wants a NSW coronial inquiry to find out whether the fire involved criminal negligence.Coroner Karen Stafford has declared the twins' death an accident and didn't launch an inquest as she didn't think it was needed.",
        "'At most, the inquest would ­remind parents and carers not to leave children alone with a naked flame and not to remove the cover of a smoke alarm,' Ms Stafford said in her unpublished reasons for not recommending an inquest, reported The Australian.Yet Ms Garton is urging for more to be done to prevent future tragedies from occurring, saying that around Byron there is a culture of leaving children unattended near  burning candles and incense, as well as neglecting to install smoke alarms.'Almost a year and a half after my children died, I feel like the system would prefer to act as if my children did not exist,' Ms Garton said.",
        "'No one has taken responsibility for the deaths, acknowledged or even apologised for the deaths. An inquest will provide a space for all of the questions to be asked – an inquest is the absolute minimum my children deserve.'",
        "Ms Garton had dropped her girls off to their father James Wright, a political activist who was outside at a bonfire while a candle was left burning on top of a piano in the bedroom where the girls were asleep.He and his girlfriend arrived back to the home just before 4am and noticed smoke billowing from the room.They called emergency services, but the twins could not be revived. There was little damage to the home itself, but it's believed the toxic fumes from the smoke resulted in the twin's death.The mother had broken up from Mr Wright more than three years before the fire and said they were doing their best to make things work for their girls, with an agreement that they would spend seven days each with their children at their separate residences in Mullumbimby.",
        "Mr Wright, 39 at the time of the fire, was a well-known Bay FM community radio presenter and was a former state political candidate with the anti-lockout party Keep Sydney Open.He and his new partner Hannah Forrester resided on a multi-occupancy property at Goonengerry.",
        "There were six separate dwellings on the site, with Ms Forrester living in an open-plan house that police were told was nicknamed 'The Love Shack'.Investigations revealed property owner Michael Hameiri had an electrician install a new smoke alarm inside the home in January, 2021 and therefore faced no blame for the fatal fire.Coroner Karen Stafford found the candle caused a painting hanging on a wall above the piano to fall which 'likely' knocked over the candle and started the fire.All bar one of the windows to the property was closed, which caused the house to fill with smoke.While the coroner found there was one smoke alarm in the property, 'the cover had been opened, and as it had no battery inside, the power source had been disconnected rendering the alarm inoperable'.Coroner Stafford was satisfied there were no suspicious circumstances and didn't believe an inquest was required.'Whilst leaving a naked flame in a room with a child, no adult supervision and no effective smoke alarm are matters of safety, there is no wider issue of public safety,' she said."
    ]
}