{
    "articleURL": "/tvshowbiz/article-12061527/Im-Celeb-Myleene-Klass-dons-bikini-getting-covered-gunk.html",
    "content": [
        "Myleene Klass was left needing the jungle shower more than ever during Monday's episode of I'm A Celebrity... South Africa after she was completely covered in muck.",
        "The singer, 45, had brown gunk all over her body from head to toe after taking part in the Gold Rush challenge.She was nominated to take part along with fellow campmate Diversity dancer Jordan Banjo, 30, in a bid to win a picnic for half the group.They competed against former Made In Chelsea star Georgia Toffolo, 28, and Andy Whyment, with the pair being given the boot from the show after they lost out to Myleene and Jordan.Former Hear'Say star Myleene - who was known for wearing a white bikini in the shower during her first time on I'm A Celebrity... Get Me Out of Here! in 2006 - was drenched in brown gunge when she competed in the trial which saw her and Jordan attempt to find enough golden nuggets to successfully tip a set of scales.",
        "Classical musician Myleene was in good spirits as she took part, ecstatically screaming in joy when she learned she and Jordan had won and would be returning to camp.However, during the trial all the campmates were covered in sticky molasses and creepy crawlies.Host Ant McPartlin told the foursome of the task: 'This is Gold Rush. Hidden inside these shafts are these gold nuggets, buried inside the shafts.'You'll have to lie on your back, find the nuggets, dig them out and place them on your pride’s scales.",
        "'The first pair to collect enough nuggets to tip the scales, wins the trial and that picnic for their pride. The losing pair will leave camp for good.' Andy and Georgia were eliminated from I'm A Celebrity... South Africa during Monday night's episode. The group went head-to-head in the gold mine trial, with the winners earning a luxury picnic, while the losing pair were sent home. As she left Georgia said: 'It's been glorious! It has just been amazing. Doing it twice has been really immense.'",
        "Andy added: 'Thanks for having me back!', before the pair boarded their boats back to civilisation. Viewers were sad to see the pair both leave as they complained that two entertaining and strong contestants were going home. One said: 'WHY YOU ANDY AND TOFF!', while another said: 'I’m sorry but why are all the best ones going home first Shaun and now Toff.'Another said: 'Not Toff and Andy going', while a fourth said: 'Kinda don’t wanna carry on watching Toff was my fave.'A fifth said: 'toff was carrying the show can’t wait for absolutely dead content now.'Viewers kicked off on Friday night as the show ended on a dramatic cliffhanger ahead of the double elimination.Fans were far from impressed with the 'cruel' twist as they took to Twitter to vent their fury, with one even asking: 'What are you playing at?!'",
        "'Making us wait till Monday?!' fumed one person, while another questioned: 'What you mean NEXT TIME ???!''Literally ending it on a cliffhanger like that and we won't even find out until Monday. Nah. Livid' ranted a third.",
        "'Leaving it there and making us wait till monday..cruel' fumed a fourth person.Another angry viewer asked: 'WHAT ARE YOU PLAYING AT?!'With an additional person adding: 'Tell us what's happening as cannot wait until Monday as it will do my head in.'I'm A Celebrity... South Africa continues on ITV1 and ITVX at 9pm on Tuesday. "
    ]
}