{
    "articleURL": "/tvshowbiz/article-12038419/Soapwatch-JACI-STEPHEN-Coronation-confrontation.html",
    "content": [
        "This week, Jaci looks at Eastender's royal knees up for the Coronation READ MORE: Soap's wackiest wedding! EASTENDERS",
        "You can always rely on the Queen Vic to throw a decent royal knees-up, and now that we’ve moved on from the ’Er Majesty, Gawd bless ’er days, it’s time for the new King to be celebrated. And how. The ocean of red, white and blue sees everyone swimming in a giant vat of royal love.It’s not such a good day for Sonia, who wakes up to birthday treats, but no Reiss. Rocky comes close to sharing his suspicions with her, but will he confront Reiss when he turns up? And what is Reiss’s secret? Apart from where he found earplugs capable of drowning out Sonia’s trumpet-playing. It’s a secret that, when revealed, leaves Sonia devastated, and Reiss desperate to explain himself.Some locals are having a ball, absorbing the historic moment before the entertainment – both Kim and Felix performing as Dusty Springfield. ",
        "But there’s less joy for Karen, who doesn’t take well to the news of Keanu and Sharon’s engagement. Maybe she won’t need to worry for many more months… Is Keanu the dead body we saw in a recent flash forward to the Vic at Christmas? Or Grant, back for Sharon’s wedding? Or Ian (remember him?), or maybe Vinny, mistaken by Suki for Nish? She does have a habit of being responsible for her kids disappearing/dying. ",
        "EastEnders’ game of Musical Landladies continues with the arrival of Harriet Thorpe as Linda’s mum, Elaine. ‘She’s funny, fearless, forthright and has a big heart. It’s a fulfilling role,’ says Harriet.",
        "While it will obviously be a case of mistaken identity, the suspense is torture, but take heart – there are only 232 guessing days to Christmas!Nish and Suki are in for a shock with Linda sneaking around behind their backs and talking about cash to a mystery caller. When she reveals her plans for the Vic to Sharon, a huge fight breaks out before the new co-owner is revealed – Linda’s mum, Elaine.Quickly making her presence felt, Elaine charms some punters and puts others in their place. Will Nish’s intimidation tactics work on her? And is he behind the trashing of the Vic? Welcome to Walford.More excitement beckons as Kaffy begins planning her Eurovision-themed birthday bash. One request: please, under no circumstances let Kim sing again.CORONATION STREETDid Daisy ever stop loving Ryan? It’s the question to ask as she continues the charade of being ‘Crystal’ in order to cheer Ryan up. When he says he’s going to visit his crush in Ibiza, Daisy has to deter him, and when they go for a walk, followed by a drink in the Rovers, he thanks her for making him face his demons.",
        "It’s ironic given that not long ago Daisy was the devil incarnate. Her personality transplant was obviously a means to keep Charlotte Jordan, who plays her, in Weatherfield. Quite right, too; she’s terrific.It becomes clear that Ryan and Daisy have deeper feelings for each other, though given the appalling quality of drinks in the Rovers, you could bond with a stoat across the table. ",
        "When Daniel finds Daisy’s spare phone to give to Max to record anything that’s bothering him, it seems as if the game might be up for ‘Crystal’. What is the message Max hears that alerts him to the fact Ryan is in danger? Not as much danger as I suspect Daisy might be in if Daniel’s jealousy raises its ugly head.The same fate probably awaits Sarah, if Adam discovers her passion for Damon. Yes, she’s at it again, this time in the Bistro office. What is it with her and offices? Barely two minutes have passed since she was seducing Adam over his desk. It’d be surprising if she didn’t have the imprint of a stapler on her back.Big questions for Daniel...Where’s Bertie – and has he been fed this year? It’s one of many questions surrounding Corrie’s Daniel, played by Rob Mallard. ",
        "Come on, Daniel! Give the lad a rusk! He’s more concerned about Max, when he sees the youngster’s phone video diary. Rob says, ‘Daniel sees that suddenly this person who was so set on destroying him is now in such a weak and vulnerable position, and it’s quietly tragic.’He won’t be so fluffily nice if and when he discovers Daisy’s resurrected feelings for Ryan.EMMERDALE Has Mack finally let the cat out of the bag?You’d have to have been living under a rock not to realise how strangely Mack’s been acting. He’s been lurking with the kind of expression you’d expect from a Scotsman in a kilt – in a hurricane. When he visits Reuben at hospital and is told the baby doesn’t have brain damage, his emotions give him away. When Charity turns up for a surprise visit, the penny drops for Charity. Well, not so much a penny as a Royal Mint of loose change that threatens to take her head off.Poor Charity. She hasn’t had much luck with men. Or women. Or kids. Or work. In Mack she appeared to have found a partner and true love, but he turned out to be a mirage of Scotch mist. Where now for her? Back to Cain, her real soulmate, I reckon.",
        "Or Paddy? He’s free and clearly has a penchant for Dingle women. Note to Paddy: there are females other than Dingles. He’s probably too busy ‘finding himself’ at the moment and attends a Man Club outside the village. It’s an adventurous start, though clearly not a hunting expedition for women. Finding the courage to speak, he shares his troubles with an understanding group. Who knew there were so many right-on men in the Dales? There are now almost as many as there are lesbians. Thank goodness for the eternal bit of rough that is Cain."
    ]
}