{
    "articleURL": "/femail/article-12046053/Viewers-wild-rapport-King-Jay-Blades-monarch-visits-Repair-Shop.html",
    "content": [
        "BBC aired episode of The Repair Shop which featured King Charles last nightRead more: The Repair Shop viewers wowed after Dominic Chinea makes historyViewers of The Repair Shop went wild last night over the rapport between King Charles and Jay Blades on a special royal version of the show.  ",
        "Presenter Jay Blades and the team visited Dumfries House in Scotland for a one-off episode to mark the BBC's centenary filmed when Charles was still the Prince of Wales and initially aired back in October. In The Repair Shop: A Royal Visit, Charles needed help with an 18th-century bracket clock and a piece made for Queen Victoria's Diamond Jubilee by British ceramics maker Wemyss Ware.He said the damaged 19th century ceramic piece fell over when someone was opening a window - 'they didn't own up', he joked.However it was the friendship between the two men which left viewers blown away, with one writing: 'The rapport between King Charles and Jay Blades on The Repair Shop is superb. In a world where everything is 'binned' at the drop of a hat, it's a brilliant and refreshing show.'",
        "Another commented: 'Just watched again The Repair Shop where they repaired two of, the then Prince Charles', antiques from Dumfries House. In stitches again at how incredibly relaxed and informal Jay Blades was.'Loved it when he told the King not to be a stranger.'  A third added: 'Charles is brilliant on the Repair Shop tonight.' In the episode, Charles met students from the Prince's Foundation Building Craft Programme - a training initiative that teaches traditional skills such as blacksmithing, stonemasonry and wood carving.",
        "The monarch said: 'I still think the great tragedy is the lack of vocational education in schools, actually not everybody is designed for the academic.'I know from The Prince's Trust, I have seen the difference we can make to people who have technical skills which we need all the time, I have the greatest admiration for people.'I think that's been the biggest problem, sometimes that is forgotten. Apprenticeships are vital but they just abandoned apprenticeships for some reason. It gives people intense satisfaction and reward.'",
        "Charles said the thing he 'really loves' is students returning as tutors year after year - 'filling the school gaps', he said.Elsewhere, he chatted about his love of clocks, saying: 'To me I just love the sound, the tick-tock but also if they chime, that's why I love grandfather clocks.'I find it rather reassuring in a funny way and they become really special parts of the house... the beating heart of it. So that's why they matter to me.'I'm afraid it is something I learnt from my grandmother, she had great fun putting a few together and trying to get them to chime at the same time in the dining room, which made it very enjoyable because everybody had to stop talking.'",
        "Blades and ceramics expert Kirsten Ramsay, horologist Steve Fletcher and furniture restorer Will Kirk set out to repair the King's clock and ceramics in the episode.Before the results are unveiled, Charles asked the crew: 'Have you sorted this? The suspense is killing me.'The monarch also lends Prince's Foundation graduate Jeremy Cash to The Repair Shop to work with metalwork expert Dominic Chinea on a third item described as a fire set in the shape of a soldier with a poignant story behind its existence.The programme aired after Jay revealed he's been invited to the King's coronation - and asked his fans 'what they think?'.",
        "Taking to his Twitter and Instagram accounts last week, the presenter and furniture restorer, 53, showed off his invitation to the historic event on May 6, at Westminster Abbey, and encouraged his followers to comment their thoughts on the matter.Father-of-three Jay, who is now based in Ironbridge, Shropshire, after growing up in poverty in Hackney, is Co-Chair of Heritage Crafts Association (a national charity aiming to safeguard craft skills), of which King Charles is President.However, Jay's inclusion among the 2,000 guests at the slimmed-down ceremony could ruffle some feathers after it emerged that Lady Pamela Hicks — who had been present at two Coronations — was not going to make it a hat-trick.",
        "Taking to his social media account, Jay tweeted: 'Look what the postman's just delivered. Scared to open it. What do you think it could be?,' alongside an image of an envelope with King Charles' cypher on it.Later sharing a snap of the invitation, he added: 'I am of the opinion that my Life belongs to the Whole Community and as long as I live, it is my privilege to do for it whatever I can.'I want to be thoroughly used up when I die, for the harder I work the more I LIVE. What do you think?,' he concluded.Fans rushed to comment on the posts on Instagram and Twitter, with one person writing: 'The King must have thought a lot about you Jay! You deserve it and enjoy your day.'"
    ]
}