{
    "articleURL": "/news/article-12057955/Budget-2023-Centrelink-tax-cuts-hikes-Medicare-electricity-gas-bills-means-you.html",
    "content": [
        "Budget delivers for 'vulnerable' AustraliansFirst Budget surplus in 15 yearsKey winners and losers are clear Jim Chalmers has launched an enormous shake-up of Australia's welfare state – from Centrelink to Medicare to childcare and retirement savings – as Labor brings the nation's federal Budget back to a $4billion surplus for the first time in 15 years.",
        "Dr Chalmers said on Tuesday night that his Budget would 'help those who need it most' - unveiling a $3.5billion plan to help 12 million Aussies see a doctor for free under Medicare, a $40-per-fortnight cash boost to welfare recipients, including dole, Youth Allowance and Disability Support Pensions.The Budget includes a $500-per-year energy bill package for households that earn less than between $108,000 and $117,000, and programs that will benefit Australians through services rather than cash handouts.They include cheaper medicine and childcare for some families, higher salaries for care workers and assistance for Aussies battling to break into the housing market – including allowing more Australians to buy a home with smaller deposits.",
        "But tucked inside the plan were some nasty shocks for taxpayers including confirmation he will scrap the lower and middle income tax (LMITO, or 'Lamington' offset) – which will cost some 10 million Australians up to $1,500 at tax time despite the rising cost of living.Meanwhile, smokers will be stung with higher prices, the Stage Three tax cuts due to come into force in the middle of next year are going no-where – mostly benefiting Australians who earn more than $200,000 – and voluntary contributions to super will be taxed at 30 per cent after balances hit $3million.",
        "In a speech announcing his Budget on Tuesday evening, Dr Chalmers said he was desperately trying not to add to inflationary pressures – with the consumer price index at seven per cent.'This Budget is carefully calibrated to alleviate inflationary pressures, not add to them,' Dr Chalmers said.'The pressures on the Budget are acute – but as a Labor Government we will always strive to help those who need it the most.'Dr Chalmers earlier described the Budget as one in 'Labor's best traditions' – focusing on 'the vulnerable… investing in the future of our country and its people'.Here, Daily Mail Australia provides a comprehensive guide to all you need to know about the 2023 Federal Budget.",
        "If you're struggling to pay the bills... More than five-and-a-half million households will be able to claim up to $500 in a cost of living rebate – depending upon where they live, how high prices are, and whether a home is on a pension or a fixed income.It will also depend on what state or territory a household or business is in because it will vary by 'how much the states and territories are prepared to kick in, because this is a co-investment with them,' Dr Chalmers said.However, thousands of families will miss out on the handout. The government has confirmed the money will only be available to those who are eligible for the family tax benefit.",
        "This means households with one child earning over $108,892 will not be eligible, nor would families with two children and a combined income of $117,000.If you're on Centrelink...The government has increased the Jobseeker payment – aka the dole - by $2.85 a day, or $40 per fortnight.Centrelink payments including Youth Allowance, Parenting Payment (partnered), Austudy, ABSTUDY, the Disability Support Pension (Youth) and the special benefit will increase by the same amount. The increase will kick in from September 2023.At present payments for a single adult with no dependent children are $693.10 per fortnight, or $49.50 a day, and slightly less for those in a live-in relationship.Those with a dependent child or who are over 60 currently receive $745.20 a fortnight, or $53.22 a day. People over 55 will now be able to receive a similarly high payment, in a new change.",
        "If you have children in childcare...Upwards of 1.2 million families will be better off from July this year as the government commits to cutting the cost of childcare.Subsidy rates will increase up to 90 per cent for families, and 95 per cent for any additional children aged under five who are also in care.Dr Chalmers said: 'It will make it easier for parents and carers, particularly women, to participate in the workforce.'",
        "Childcare funding will increase by $1.4 billion this budget, taking total government spending for the next four years to $55.31 billion.The Budget will also include $72.4 million over five years to boost skills and education within the sector. Up to 75,000 early childhood educators will be able to access paid professional development as a direct result of the investment.If you need to go to the doctor…Some 11.6 million eligible Australians will be eligible for bulk billing when they need to visit their local GP after the government set aside $5.7 billion in the Budget to strengthen Medicare.Bulk billing incentives will be tripled for consultations with children under the age of 16, pensioners and concession card holders. The government estimates this will allow doctors to treat 11.6 million eligible Australians.Eight new bulk billing clinics have also been promised in the Budget.The allocation of this money also includes $445 million to employ nurses and allied health professionals in general clinics to work alongside GPs, $143.9 million to encourage practices to extend their opening hours and $98.9 million to transition frequent hospital users to GPs within their local community.A further $79.4 million will be dedicated to treating people with chronic health conditions in underserviced communities.The government is further investing $3.5 billion over five years to make it easier and cheaper to see a doctor.",
        "The Budget has also committed $824.4 million to modernising the My Health Record system and funding other digital health initiatives.",
        "If you need prescription medicine...Some medicines on the Pharmaceutical Benefits Scheme will be made available at two for the price of one in a move which could benefit up to six million Australians.A total of 325 medicines are expected to be included in the list, treating a range of conditions from heart disease and Crohn's to cholesterol.Patients with stable, chronic health conditions will be able to reduce the number of visits they need to make to the pharmacy by picking up two months worth of medicine at a time.The Budget estimates this will save about $1.6 billion in out of pocket expenses.If you're a tradie...Tradies have been dealt a blow with a substantial reduction to the instant asset write off measures previously introduced by the Coalition government.Under that program- formally known as 'temporary full expensing' - tradies were claim the whole cost of a work ute or van on tax in one year, rather than over eight.The cost of a vehicle was capped at $64,741 - which covers Australia's two bestsellers, the Toyota HiLux and Ford Ranger.Dr Chalmers has announced an amended version of the scheme, reducing the write-off amount to $20,000.",
        "This restricts the options available to tradies who had hoped to purchase a new work vehicle.The new scheme will be available to 3.8 million small businesses with an annual turnover of less than $10 million, and is costed through to June 30, 2024.If you're a low or middle income earner...Australians earning less than $126,000 per year will pay more tax after the former government's low and middle income tax offset expired.The offset was first introduced by the Turnbull government and provided relief of up to $1,500.It was due to end this year, regardless of who was in government.",
        "If you pay superannuation...· Change to tax breaks for balances of $3 millionAustralians with super balances of more than $3 million will no longer get generous tax breaks under a new plan announced by Prime Minister Anthony Albanese.Taxpayers can voluntarily deposit up to $27,500 a year into their super and pay a low concessional tax rate of just 15 per cent if they earn up to $250,000 a year.But Mr Albanese wants to double that tax rate to 30 per cent for Australians with more than $3million in their super, from July 1, 2025.That affects some 80,000 people - the top 0.5 per cent of super savers - and would save the federal budget about $2 billion a year.The other 99.5 per cent of Australians would continue to receive the 'same generous tax breaks' of 15 per cent.The change won't kick in until after the next election, due by mid-2025.· Super to be paid on paydayThe government has announced a plan to force employers to pay superannuation in real time on payday, rather than only making a single contribution each year.Experts believe it could give young workers an additional $50,000 by the time they retire.'This is a big win for the three million mostly young and lower paid Australians unfairly deprived the super they've earned and will give them a better shot at building a good nest egg for retirement,' Industry Super Australia Chief Executive Bernie Dean said.The policy will not come into effect until July 1, 2026.While this policy will primarily benefit the 8.9 million employees who pay super, the government has emphasised the benefits to employers as well, noting that 'more frequent super payments will make employers' payroll management smoother with fewer liabilities building up on their books'.",
        "$45,000: Nothing$60,000: $375$80,000: $875$120,000: $1,875$150,000: $3,975$200,000: $9,075Tax liabilities for 2024-25 compared with 2022-23",
        "If you're a high income earner...There will not be any changes to the hotly debated Stage Three tax cuts, as per Labor's election promise.Prime Minister Anthony Albanese's government had been expected to dump the cuts, which his Liberal predecessor Scott Morrison legislated in 2019 to come into force from July 1, 2024.But Industry and Science Minister Ed Husic on Friday said that dumping the policy in the Budget would be a breach of faith with voters.When the cuts kick in, the number of tax brackets will slashed from five to four, for the first time since 1984.Those earning more than $200,000 stand to get back $9,075, compared with now.A new 30 per cent marginal tax rate would apply for those earning $45,000 to $200,000.This will reduce the income tax burden for about nine million Australians. The Australian Parliamentary Budget Office estimated the Stage Three tax cuts would cost $243billion over 10 financial years from 2024-25.If you're a healthcare worker...The one group who are set to score a significant, $10,000-a-year pay rise are 250,000 care workers.The frontline workers will be given the record salary bump to battle the cost of living crisis. It is also expected to improve equal pay statistics for women.The 'historic' 15 per cent pay rise will cost the federal budget more than $11 billion, the government said.Dr Chalmers believes the wage bump will be enough to attract new staff to the industry and keep existing workers.",
        "If you run a small business...Up to 3.8 million small and medium-sized businesses will be eligible for $20,000 of tax relief, which must be used for equipment to slash their energy bills.The business must have an annual turnover of less than $50 million to qualify and the tax relief will be offered for investments in installing batteries, electrifying heating and cooling systems and upgrading electrical goods.This incentive is estimated to cost $310 million over the four-year period.Dr Chalmers has also announced an Energy Price Relief Plan which helps to shield small businesses from high energy prices for the short-term. He said some one million small businesses will be entitled to direct bill relief.",
        "Australians were warned not to expect vast government spending to help them as they struggle with decades-high inflation and interest rates which have risen 11 times in just over a year.Last Tuesday, the RBA shocked most financial analysts by lifting the cash rate to 3.85 per cent, adding hundreds of dollars to the cost of the average mortgage. Australia's stubbornly high inflation rate means despite the pain, Australians expecting a massive 'cash splash' in the Budget will be sorely disappointed, Deloitte economist Stephen Smith said.Mr Smith forecast some measures to offset the cost of living, but noted too many handouts would risk worsening inflation and seeing more rate rises, which would cripple the economy.'Do too little, and low-income households, and the economy more generally, will be left teetering,' he said.'While higher spending appears unavoidable, importantly, that can't be via a blank cheque.'Although the national economic outlook is uncertain, Mr Smith noted 'it's still brighter than what Treasury had assumed in the 2022-23 October Budget'.",
        "The instant asset write-off scheme has also been extended – though in an altered format. In the past, small businesses could write-off an asset worth up to $64,000.The scheme was expected to end entirely, but has been extended until at least June 30, 2024.Additionally, the government will halve quarterly GST instalments and income tax for 2.1 million eligible businesses, from 12 per cent to six per cent.Finally, $392.4 million will be invested into the Industry Growth Program – which will help to support small and medium businesses develop new products and services.If you're a working expectant parent…From July 1, Parental Leave Pay and Dad and Partner Pay will combine into a single 20-week payment. This was announced in the October Budget, when the government committed $531.6 million to creating a more flexible parental leave scheme.And, 3,000 higher income families will be in a position to benefit too, with a new eligibility test extending to a combined household income of $350,000.It's expected 180,000 families will be better off under the changes.The government has also committed to extending Paid Parental Leave to 26 weeks by 2026.If you're a single parent...Single parents will now be entitled to financial support on the Parenting Payment (Single) until their child is 14 in a commitment worth $1.9 billion.The decision has been widely tipped in the past few weeks and described as an opportunity for Mr Albanese to make up for a Gillard government move, which pushed single parents off the payment when their child turned eight.The PM has admitted that 'the sole parent payment is an area where we made a mistake'.Mr Albanese said: 'Many single parents - overwhelmingly women - face difficulty balancing caring responsibilities and work.'Those difficulties do not end when their child turns eight.'The updated plan will come into effect from September 20 of this year.Under the new policy, single parents who are currently on JobSeeker will receive an additional $176.90 per fortnight.In total, some 57,000 single parents (90 per cent of whom are women) will benefit. The payment is $922.10 per fortnight.'By age 14, children have typically settled into high school and need less parental supervision, and single parents are in a much stronger position to take on paid work,' Mr Albanese said.Historically, the single parents payment was for singles with children aged up to 16.But former prime minister John Howard, supported later by Julia Gillard, slashed the age to eight in an attempt to encourage parents back into the workforce.Two advisory bodies urged the government to extend the payment and the eligibility criteria.Mutual obligation requirements from when the youngest child turns six will still remain in place to continue to encourage parents to return to the workforce.",
        "If you want to buy a home...Australians who haven't owned a property in 10 years will be allowed to access the First Home Guarantee scheme.That program lets workers put down just a five per cent deposit in order to buy a property.The government said this will support Australians who have fallen out of home ownership 'often due to financial crisis or relationship breakdown'.Permanent residents will also be eligible for the program for the first time.As was announced before the Budget, any two Australians will also be eligible for the scheme - that is, friends or family members, instead of just spouses or girlfriends/boyfriends.If you're a renter…The Budget has included a policy Labor is touting as 'the largest increase to Commonwealth Rent Assistance in 30 years'.Some 1.1 million low income renters will receive a boost to the amount of rent assistance they receive.This commitment will cost $2.7 billion over five years.The government also hopes to boost build-to-rent projects to create 150,000 new rental properties over the next decade by creating a host of new incentives.If you're a vaper...To tackle the growing black market, the government will increase the product standards for vapes, including by restricting flavours and colours.Regulation will see pharmaceutical-like packaging, a reduction in the allowed nicotine concentrations and volumes, and a ban on single-use vapes.Children under four having been reported to Victoria's poisons hotline as having used a vape.'This is a product targeted at our kids, sold alongside lollies and chocolate bars,' Health Minister Mark Butler said. 'Vaping has become the number one behavioural issue in high schools, and it's becoming widespread in primary schools. This must end.'The Minister said the hard-won gains in public health relating to the reduction in smoking could be undone by a 'new threat'.'Vaping was sold to governments and communities around the world as a therapeutic product to help long-term smokers quit,' he said.'It was not sold as a recreational product, especially not one for our kids. But that is what it has become - the biggest loophole in Australian history.'At least $234 million will be dedicated to tackling the issue, including $63 million for an information campaign.If you smoke cigarettes...The Albanese government has announced three tobacco price hikes will be in next week's Federal Budget - raising $3.3billion in revenue.Health Minister Mark Butler announced the tax on tobacco will be increased by five per cent per year over the next three years, beginning on September 1.Loose leaf tobacco will be taxed equally to cigarettes, Budget papers confirmed.Mr Butler said the changes will raise an additional $3.3billion over the coming four years, including $290million in GST payments to the states and territories.He said it would help 'to support our health system and the health of current and former smokers and vapers'.The government has committed $63.4 million to national public health campaigns, $141.2 million to expanding the Tackling Indigenous Smoking program and $29.5 to boost the supports to quit program.",
        "Sydneysiders are sick of overcrowding will flee Australia's biggest city in droves, shock Budget figures show - as 1.5million new migrants move to Australia over the next five years. Treasury figures seen by Daily Mail Australia show 124,100 people are expected to leave New South Wales for other states between now and July 2027.They will be relocating to Queensland, Victoria, Western Australia, Tasmania and the Australian Capital Territory.At the same time, Australia is now predicted to take in 1.495million new migrants over five years, including a record 400,000 in 2022-23 and 315,000 in 2023-24.The national population growth pace of 1.7 per cent during this upcoming financial year will be among the highest in the developed world.Population growth will have consequences – with unemployment already at a 48-year low of 3.5 per cent and bosses struggling to recruit staff. ",
        "If you're sick of SMS scams... The government has dedicated $86.5 million to establishing a National Anti-Scam Centre and tackling the increasing number of scam SMS messages plaguing Australians.The money will be spent to help launch a technology which should prevent scammers from mimicking brand names in texts.If you want to buy an electric or a hybrid car...From April 1, 2025, drivers who are eyeing off a hybrid car for their next purchase won't be able to get an electric car discount.In a significant change to the Federal government's electric car policy, plug-in hybrids - such as Toyota Priuses - won't be eligible for cheaper electric cars.Only purely battery electric cars - such as Teslas - or hydrogen vehicles will be eligible.However, car buyers can still buy cheaper hybrids between now and this point.If you're on the NDIS...The NDIS will receive a further $732.9 million to develop initiatives to support people with disabilities. Dr Chalmers said: 'Under Labor, the NDIS is here to stay.'It took a Labor Government to create the NDIS – and this Labor Government will secure its future.'But the program has been identified as one of the largest sources of pressure to the government's bottom line.An 'annual growth target' of eight per cent has been announced in an attempt to save more than $50 billion on the scheme in the next decade. Advocates describe the move as a 'cut' to the scheme in real terms. The current growth rate is at about 14 per cent.Funding for the scheme is expected to double between now and 2031.The Albanese Government will also spend $48.3 million in the 2023-2024 Budget to crack down on fraud and non-compliance within the scheme.If you're a nurse or midwife…A Primary Care and Midwifery Scholarship program has been established to support registered nurses and midwives who want to continue in their studies.Over four years, $50.2 million has been committed to encouraging employees in this sector to pursue post-graduate study to improve their skills.If you're due for a heart health check up...The Albanese government will extend the Medicare rebate for heart health assessments until June 30, 2025 this Budget.The check is considered the nation's best tool for preventing heart disease.Mr Butler said: 'Heart disease is Australia's biggest killer – one Australian has a heart attack or stroke every 4 minutes. About 2.5 million Australians have a high chance of suffering a heart attack or stroke in the next 5 years, and many don't know it.'The former Government would have had these crucial heart health assessments expire on 30 June 2023 but with about 250,000 people expected receive a heart health assessment over the next 2 years, our government's action on this has the potential to save thousands of lives.'",
        "If you require a lung cancer screening…Additionally, the government will invest $263.8 million over the next four years to establish and run a national lung cancer screening program.If you're a pharmacist…The government will invest $79.5 million into regional and remote pharmacies over the next four years.The funding will ensure the continuation of 1,093 community pharmacies and help pharmacists to deliver vaccines under the National Immunisation Program.If you're a carer under 25...Young people under 25 who are caring for a loved one will be entitled to $3,768 in support - $768 higher than in the past.This will be a near $10 million funding increase.If you've got long Covid...$50 million will be injected into the Medical Research Future Fund to explore the long term effects of Covid-19.If you're getting old…The government has vowed to support elderly Australians who do not wish to enter aged care.An additional 9,500 home care packages have been funded, worth $166.8 million.Indigenous and Torres Strait Islander Elders will also be encouraged to remain connected to their communities with a further $52.1 million in funding to aged care providers in extremely remote areas.An interim First Nations Aged Care Commissioner will be appointed to help manage this, at a cost of $1.7 million to the Budget.For those Australians already in aged care, the government has committed $12.9 million to improving the food and nutrition in facilities and $81.9 million to implement a new Aged Care Act to support and recognise the need for sector reform.$487 million has also been committed to extending and bettering support for elderly Australians with a disability.",
        "THE WINNERS- Healthcare workers: The one group who are set to score a significant, $10,000-a-year pay rise are 250,000 care workers- JobSeekers: The government has increased the Jobseeker payment by $2.85 a day, or $40 per fortnight.- Small Business owners: Up to 3.8 million small and medium-sized businesses will be eligible for $20,000 of tax relief, which must be used for equipment to slash their energy bill- Families with children in childcare: Upwards of 1.2 million families will be better off from July this year as the government commits to cutting the cost of childcare.- Working expectant parents: From July 1, Parental Leave Pay and Dad and Partner Pay will combine into a single 20-week payment.- Single parents: Single parents will now be entitled to financial support on the Parenting Payment (Single) until their child is 14 in a commitment worth $1.9 billion.- People who require prescription medicine: Some medicines on the Pharmaceutical Benefits Scheme will be made available at two for the price of one in a move which could benefit up to six million Australians.- Pharmacists: The government will invest $79.5 million into regional and remote pharmacies over the next four years.- Medicare users: The Budget has set aside $5.7 billion to be spent over the next five years strengthening Medicare.- Nurses and Midwives: A Primary Care and Midwifery Scholarship program has been established to support registered nurses and midwives who want to continue in their studies.- Aging Australians: The government has vowed to support elderly Australians who do not wish to enter aged care.- Young workers: The government has announced a plan to force employers to pay superannuation in real time on payday, rather than only making a single contribution each year.- High income earners: There will not be any changes to the hotly debated Stage Three tax cuts, as per Labor's election promise.- Hopeful home buyers: Several changes to the First Home Buyer scheme make it easier for a suite of Australians to buy their first home.- Renters who receive rent assistance: The Budget has included a policy Labor is touting as 'the largest increase to Commonwealth Rent Assistance in 30 years'.- Cultural institutions: The government has assured the National Library of Australia of $33 million worth of funding over the next four years.- The Arts sector: Some $286 million has been set aside to 'renew and revive Australia's arts, entertainment and cultural sector'.- ABC and SBS: The ABC will get a massive $6 billion investment over five years while SBS walks away with an additional $1.8billion.- Immigrants: In the next five years, Australia will welcome as many as 1.495 million new skilled workers.- ADF troops considering re-enlisting: A $400 million cash splash to lure ADF soldiers back into the fold has been announced.- Teachers: An additional $9.3 million has been committed to the National Teacher Workforce Action Plan to attract, train and retain teachers.- Students and apprentices: The government is currently in talks with states and territories to implement a new National Skills Agreement from January 1, 2024, lasting five years. AUSTUDY has been raised by $40 per fortnight.THE LOSERS - 10 million low and middle income earners: The low and middle income tax offset has not been extended, meaning 10 million Australian taxpayers will be up to $1,500 worse off at tax time.- Tradies seeking a tax break: Tradies will lose the right to buy a Ute worth up to $64,741 and claim in back in tax in one year, rather than eight – but a new instant asset write off scheme will be available for small businesses with a turnover of up to $10 million, allowing them to spend $20,000 on tools and claim it back instantly if they are bought and used from July 1, 2023 to June 30, 2024.- Cigarette Smokers: The Albanese government has announced three tobacco price hikes will be in the Federal Budget - raising $3.3billion in revenue.- People hoping to buy a hybrid car: From April 1, 2025, drivers who are eyeing off a hybrid car for their next purchase won't be able to get an electric car discount- Large multinational businesses: The government has introduced a global minimum tax and domestic minimum tax to ensure large multinational businesses are paying enough tax.- People with superannuation balances over $3million: Australians with super balances of more than $3 million will no longer get generous tax breaks under a new plan announced by Prime Minister Anthony Albanese.",
        "If you work for a large multinational business…The government has introduced a global minimum tax and domestic minimum tax to ensure large multinational businesses are paying enough tax.The measures will come into effect from January 1, 2024, and ensure corporations pay an effective tax rate of at least 15 per cent.Budget papers said this would 'reduce incentives for multinationals to shift their profits to low-tax jurisdictions, level the playing field and protect Australia's revenue base'.If you're worried about local manufacturing…The government has committed $15 billion to the National Reconstruction Fund and boosting manufacturing here on home soil.This is being hailed as one of the largest investments in manufacturing in Australia's history.And $392.4 million has been invested in the Industry Growth Program, which will support startups in commercialising their ideas and getting them off the ground.Budget papers said: 'Support will be targeted towards businesses operating in the priority areas of the National Reconstruction Fund.'",
        "Australia's tradies will lose the right to buy a $65,000 ute and claim it back on tax in one year – but they will now be able to spend $20,000 on tools and get generous treatment from the taxman.Treasurer Jim Chalmers is axing his Liberal predecessor's Josh Frydenberg's instant asset write-off program – formally known as 'temporary full expensing' – that ends on June 30.This program debuted in October 2020, allowing tradies battling lockdown restrictions to buy a $59,136 ute or van and claim it back in one year rather than over eight.This was adjusted to $64,741 in the last financial year to account for inflation, after the scheme was extended in the 2021 Budget.Usually, small business owners can buy tools and machinery and claim it back against their taxable income over the life of the item, which can range from three years for a computer to decades for a factory machine.But in Tuesday night's Budget, Dr Chalmers announced a scaled-back instant asset write-off program where small businesses with an annual turnover of $10million will be able to spend $20,000 on tools or equipment - multiple times - from July 1, 2023 to June 30, 2024.They will be able to write it off against their taxable income in one year, rather than having to wait for several years to depreciate it, provided these items are used or installed in the 2023-24 financial year.",
        "If you watch the ABC and SBS...The ABC will get a massive $6 billion investment over five years while SBS walks away with an additional $1.8billion.That includes $52million in funding to support local ABC news operations.If you're in the media...Up to 56 cadet journalists will be hired and deployed to 38 regional newsrooms across the nation on the government's dime.If you're seeking more information on The Voice to Parliament...The government will launch an education campaign ahead of the referendum, expected sometime between October and December.In total, Labor estimates it will spend $364.6 million on delivering the Voice to Parliament referendum over the next three years.The funding includes $336.6 million for the Australian Electoral Commission to deliver the referendum - $10.6 million of which will be spent on producing information pamphlets for the respective 'yes' and 'no' campaigns.A further $12 million will be spent over two years on neutral public civics education and awareness activities – run primarily by the National Indigenous Australians Agency and the Museum of Australian Democracy.The NIAA have also been allocated an additional $5.5 million for consultation, policy and delivery work.Finally, $10.5 million will be allocated to the Department of Health and Aged Care to increase mental health supports for First Nations people during the lead up to the referendum – in a sign the government is anticipating a heated and potentially ugly battle between both sides.This process was partially funded back in the 2016-2017 Budget.If you work in the arts…Some $286 million has been set aside to 'renew and revive Australia's arts, entertainment and cultural sector'.The government has also vowed to boost incentives for the film industry in an attempt to lure more international productions to Australia and create more jobs. A total of $112.2 million over four years will be dedicated to attracting large-budget productions.Screen Australia will receive $12 million in funding.If you're interested in the Olympics…As the 2032 Brisbane Olympic and Paralympic Games inches closer, the government has assigned $3.4 billion over the next 10 years for infrastructure.If you're caught in a national emergency...Labor will spend $10million on a national emergency warning system to 'ping' mobile phones which are identified as being in the path of a natural disaster.Messages can be sent in multiple languages and temporarily override anything else a person is doing on the device at the time.",
        "If you're interested in the shift to renewable energy…A further $4 billion has been invested in Australia's long term plan to become a renewables superpower.Labor hopes to turn Australia into a 'world leading hydrogen producer' with a $2 billion investment in a new program supporting production.In all, the government will invest $40 billion in this area.The government hopes to reach 82 per cent renewables by 2030 to become 'cleaner, cheaper and more reliable' – despite coal and gas providing much of the income that's allowed a forecast surplus this year.$200 million has also been allocated to support levee upgrades and seawalls to 'improve Australia's resilience against natural disasters'.If you're concerned about preservation of Australia's native species and habitat…Over the next five years, $1.1 billion has been committed to the National Heritage Trust, which will help to protect Australia's threatened species and habitats.The money will also go toward restoring urban rivers and catchments.A further $262.3 million has been assigned to national parks including Kakadu and Uluru to protect both their natural and cultural heritage.If you're planning to migrate to Australia...In the next five years, Australia will welcome as many as 1.495 million new skilled workers.The government has allocated about 70 per cent of all places in the permanent migration program for this year to account for 'persistent skills shortages'.Visa holders with certain degrees will be entitled to an extra two years of post study employment in key sectors, and international students working in aged care will be exempt from capped fortnightly hours limits until December 31, 2023.And from July 1, the beginning of the financial year, New Zealanders will have an easier pathway to Australian citizenship. If a New Zealander has been living in Australia for four or more years, they'll be eligible to directly apply for citizenship.A new visa will also be introduced specifically for migrants from Pacific nations and Timor Leste. 3,000 spots will be allocated via an annual ballot process.Student visas will also be relaxed to allow them to seek employment for 48 hours per fortnight.Additionally, students who study in India will have greater reassurance that their qualifications will be recognised after Mr Albanese struck a deal with the nation earlier this year.In his October mini-budget, the PM offered up an additional $576 million over four years to the department of Home Affairs for visa processing and migration.New figures suggest Australia's net migration is set to reach 400,000 this financial year and 315,000 next year.",
        "Cruel scammers are already capitalising on the federal Budget announcement with phishing text messages promising victims a $750 reportedly doing the rounds.It comes just minutes after Treasurer Jim Chalmers announced a crackdown on SMS scams.Labor MP Stephen Jones shared a text message on Twitter from a scammer posing as a MyGov official which read: 'myGov: Eligible individuals can receive a one-time payment of $750 to help with their living expenses.'Mr Jones said: 'I’m hearing that scam texts like this are being sent tonight - don’t click on any links in texts messages. Any message from MyGov will be in your MyGov inbox.'",
        "If you're an ADF troop considering re-enlisting...A $400 million cash splash to lure ADF soldiers back into the fold has been confirmed.The plan will offer 3,400 soldiers a $50,000 bonus if they re-enlist for an additional three years in an attempt to combat a recruitment and retention crisis.If you're a student or apprentice…The government is currently in talks with states and territories to implement a new National Skills Agreement from January 1, 2024, lasting five years.A further 300,000 TAFE and vocational education training places would become fee-free under the changes.To support students, AUSTUDY has also been raised by $40 a fortnight.An Australian Apprenticeship Support Service will also be redesigned to help support women, First Nations and disabled apprentices to ensure equal opportunities.If you're a teacher…An additional $9.3 million has been committed to the National Teacher Workforce Action Plan to attract, train and retain teachers.This is in addition to $328 million worth of funding previously announced.Additional assistance provided to UkraineAustralia will provide Ukraine with a further $189.6 million over the next two years to assist in the war against Russia.This money will be spent providing Bushmaster vehicles, artillery ammunition and training to the Ukrainian Armed Forces.Preventing future pandemicsLabor has committed to opening an Australian Centre for Disease Control on the back of the Covid pandemic.Budget papers stated: 'The COVID-19 pandemic demonstrated Australia needs to be better prepared for future pandemics and other health threats in the 21st century.'The Centre will provide a national focal point for disease management to improve our ability to respond to health emergencies and other public health challenges.'This commitment will cost $91.1 million.National Library of Australia – TroveThe government has assured the National Library of Australia of $33 million worth of funding over the next four years.The NLA runs a digital archive, Trove, which holds billions of resources accessible to the public.",
        "Emphasis on fixing 'booby traps' The government has been vocal in the need to dedicate a 'significant portion' of funds to fix 'booby traps' left behind by the Morrison government.Senator Katy Gallagher said Labor has discovered $5 billion worth of programs and services that the Coalition had no plans to fund.This is on top of $4.1 billion worth of gaps in funding that were plugged in the October mini-budget.'It was booby trapped. Without a doubt,' she said. 'It's taken us some time to uncover them because programs are ending on the 30th of June this year or next year. And we've worked through that, but there's no doubt they were booby trapped.'The current concerns centre on mental health programs, funding for eating disorder treatment, monitoring high risk terror offenders and continuing a domestic violence national partnership agreement.'We are cleaning up the Liberals' Budget mess in a methodical, responsible and transparent way,' Senator Gallagher said.'For example, there was no money in the budget for the agency responsible for safely storing and disposing of Australia's radioactive waste, and there was a significant drop-off in funding to keep women and children safe online.'This was put simply a political strategy to dress up their pre-election budget bottom line and try to trick Australians into voting for them again.'",
        "Surplus confirmedThe Labor government will post a surplus in the federal Budget in an astonishing fiscal turnaround. The small surplus has been made possible by higher iron ore, coal and gas prices, while low unemployment reduced the welfare bill.This would be the first Budget surplus since 2007, when the Coalition was in power before the Global Financial Crisis worsened.Opposition Leader Peter Dutton said he, too, is predicting a surplus.'I think it's obvious now that and I think it's predictable that there will be a surplus,' he said.'The revenues from royalties, company, tax receipts, etc. are through the roof and the government obviously has a big spending program.'"
    ]
}