{
    "articleURL": "/sport/football/article-12045859/The-SIX-greatest-hair-transplants-football-history-Wayne-Rooney-Rob-Holding.html",
    "content": [
        "Arsenal defender Rob Holding attracted attention when he had a hair transplant After struggling with hair loss, Holding now has an impressive mop of hairMail Sport takes a look at some of the best hair transplants in football history Footballers are known as some of the fittest athletes in the world, putting thousands of hours into perfecting their technique, physique and skills so they can be the best versions of themselves on the pitch.",
        "However, something they can't often perfect is their natural looks, but over recent years we've seen more and more figures in the game undergo hair transplants as they go through their careers.From international stars to Premier League stalwarts, Mail Sport takes a look at six of the greatest hair transplants in football history. Rob Holding (2021) In late 2021, Arsenal fans noticed something different about long-serving defender Rob Holding. Having signed for the Gunners from Bolton in 2016, Holding had started to enjoy a prominent role in the side the previous season as he made 30 Premier League appearances - the most of his seven-year spell at the club.",
        "However, his hairline had begun to recede over time with Holding bravely opening up about how this had impacted his self-confidence.As a result, he revealed in October 2021 he had undergone a hair transplant at a London clinic to transform his hairline, along with his mental health.He wrote: 'Because it’s World Mental Health Day, I struggled so much with my hair and self confidence.'I have had so many messages about where I have had my procedure. Wimpole Clinic in London treated me so well and I’m so happy with the results.'I have so many messages of other people affected by simple mental health issues and self confidence issues. I couldn’t recommend this place enough, let’s all be better.'",
        "The procedure was hugely successful with Holding subsequently sporting a strong head of hair.At times this season, we have even seen the defender have to wear an Alice band to keep his luscious locks in check.",
        "Wayne Rooney (2011)Perhaps the most high-profile hair transplant of recent times was England and Manchester United legend Wayne Rooney.The former attacker noticed hair loss from his late teens and had receded significantly by the time he was 25.In 2011, he confirmed he had undergone a procedure as he tweeted: 'Just to confirm to all my followers I have had a hair transplant. I was going bald at 25 why not. I'm delighted with the result.' It was a success as his hair appeared to grow significantly, but he had to have another procedure in 2013 after he was slowly balding once again.But, the second transplant left him with thicker hair once more - something that is still evident with the now DC United boss.",
        "Andros Townsend (2016)Another Premier League star rumoured to have undergone a hair procedure was Andros Townsend.After making his debut in 2012, the winger has been a Premier League footballer for over a decade but his hairline has looked remarkably different from his first two clubs - Tottenham and Newcastle, to his most recent two clubs - Crystal Palace and Everton.",
        "When playing for Newcastle in 2016, the now-31-year-old struggled with a receeding head of hair, but this changed when he moved to Crystal Palace for the 2016-17 season.After initially having a shaved head with the Eagles, the transformation when he grew his hair out has been impressive, although he has never confirmed if he did in fact have a transplant.",
        "Slaven Bilic (2016)Known as a real rockstar footballer during his playing days for Croatia, West Ham, Everton and Hadjuk Split among others, Slaven Bilic began to lose his hair during his managerial career.An extremely popular figure at both West Ham and West Brom after managing his country for six years - where he infamously stopped England from qualifying for Euro 2008 - there seemed to be a difference in his hairline during his spell with the Hammers.While there was only light hair loss, Bilic was suddenly pictured with a full head of hair again.The Croat is yet to publicly confirm this himself - but a hair doctor explained he had undergone the procedure just before Euro 2016.This led to eagle-eyed fans spotting the growth during Bilic's appearances as a TV pundit for the tournament. ",
        "Antonio Conte (first one in 2000)The hot-headed Italian boss may have ended his spell with Tottenham under a cloud, but Antonio Conte can lay claim to having one of the strongest hairlines of any Premier League manager this sesaon.",
        "However, it wasn't always the case, with Conte struggling with hair loss towards the end of his playing career.He was rumoured to have undergone a transplant around 2000 - which was the first of three procedures Conte experienced in an attempt to fight off baldness.The Italian's current mop of hair is renowned with his look and adds to his stylish persona on the touchline that we have seen over the past few decades at Juventus, Italy, Chelsea, Inter Milan and Spurs. ",
        "Marc-Andre ter Stegen (2022)Not only has it been a good year for Marc-Andre ter Stegen on the pitch, with Barcelona's German goalkeeper conceding just 11 times in the league as his side look set to win their first LaLiga title in four years.But off the pitch, ter Stegen has seen a remarkable transformation in his hairline, with the goalkeeper announcing he had undergone a transplant when turning up for a pre-season game.Like Holding, he revealed building his confidence was a key reason for the procedure.Ter Stegen definitely looks to have secured that, with the goalkeeper now sporting an impressive quiff in between the sticks for the Catalan giants."
    ]
}