{
    "articleURL": "/news/article-12045769/Workplaces-appease-staff-letting-clock-lunchtime-Friday.html",
    "content": [
        " Major firms are letting staff clock off early on Fridays for up to five months a year Campaigners say firms are bowing to pressure for a four-day working week Bosses are increasingly letting their workers clock off early on Fridays during the summer amid mounting pressure to give staff a four-day working week.",
        "Big companies including Kellogg's, Asos and PwC all offer 'summer working hours', meaning workers can leave early on Fridays for up to five months of the year. The firms say their 'Summer Fridays' schemes help them win over the best workers while boosting staff wellbeing. But campaigners claim the schemes are simply a way for businesses to appease workers in the face of rising pressure for a four-day working week. Critics also say the policies force staff to overwork from Monday to Thursday, in making employees do the same amount of work over a four and a half day week. ",
        "Cornflakes maker Kellogg's lets staff in its Manchester head office leave at 12pm on Fridays, from the months of May to September, so long as they have completed a full week's working hours by midday at the end of the week. ",
        "'For Kellogg's, there's reasons we've brought summer hours back year after year for the last 20 years – it helps us retain and attract the best people,' a Kellogg's spokesperson told MailOnline. Accounting firm PwC lets its 6,000 UK employees finish at lunchtime on Fridays in the months of June, July and August. PwC's UK chairman Kevin Ellis said the accounting firm 'knew summer working hours would be popular' among staff, as the company's surveys showed 90 per cent of its own workers were in favour of the shorter Friday hours. ",
        "The accounting firm chief, however, noted 'not everyone could take every Friday,' due to heavy workloads, but that those who had to work 'benefited from less email traffic' when they did.  Staff at clothes seller Asos and shampoo maker L'Oreal are allowed to clock off at 3pm on Fridays in summer months. Shoe seller Nike even gives its staff a whole week off in August and lets them log off at midday every Friday from May until September. Campaigners, however, said the increased uptake of Summer Fridays schemes are a sign that firms are bowing to pressure to shift away from the traditional 9-5 model and begin offering a four-day working week.   ",
        "Joe Ryle, director of the 4 Day Week Campaign, said: 'Pressure for a four-day week with no loss of pay has been building and companies that aren't quite ready to go the full hurdle are introducing nine-day fortnights and summer working hours.''The traditional 9-5, 5-day working week is outdated and no longer fit for purpose. We are long overdue an update and reduced summer working hours gives companies the opportunity to experiment with a shorter working week,' he told MailOnline. Jon Boys, a labour market economist at the Chartered Institute of Personnel and Development, said that since the pandemic workers have become increasingly 'reluctant' to 'work for a company that wants them in the office five days a week'.",
        "He said the 'battle for talent' is driving companies towards taking up Summer Friday practices, as he argued the schemes are a 'win win' for companies, in helping them secure their staff members' 'goodwill'. 'If a company has less need for people at certain times of year it makes sense to flex the workdays, then, secure the goodwill amongst employees and get the commitment back when demand is strong,' Boys said.  Lord Sugar previously hit out at PwC's summer working hours policy, on Twitter, by calling the Big Four firm's staff 'lazy gits'. 'This is a bloody joke,' the businessman said in response to the Big Four accounting firm's scheme. 'The lazy gits make me sick. Call me old-fashioned but all this work from home BS is a total joke.''There is no way people work as hard or productive as when they had to turn up at a work location,' he added. 'The pandemic has had long lasting negative effect.' PwC, Asos and Kellogg's have been contacted for comment. "
    ]
}