{
    "articleURL": "/wires/reuters/article-12039353/Motor-racing-Button-expects-Hamilton-fighting-2024.html",
    "content": [
        "By Alan Baldwin",
        "LONDON, May 2 (Reuters) - Former world champion Jenson Button expects to see Lewis Hamilton chasing a record eighth Formula One title next year despite speculation the Mercedes driver could walk away from the sport.Hamilton will be 39 next January and has not won a race since the December 2021 Saudi Arabian Grand Prix when he took a record 103rd, with his team playing catch up to now-dominant Red Bull.Hamilton is out of contract at the end of the season and there has been media speculation about his future despite both the Briton and his team saying they want to do another deal.\"I don't think Lewis is going to walk away from the sport,\" Button told reporters on Tuesday after discussing his preparations for the 24 Hours of Le Mans endurance race with a special NASCAR entry.\"As a racing driver, you have two things; One, if you're winning for so long and then you're suddenly not, you want to fight back to winning. So you're not going to retire,\" added the 2009 champion.\"And then you can come at it the other way. If you're in a bad car you want to retire, if you've been there for many years in a bad car, because it just gets you down.",
        "\"Lewis is not in a bad car. He's in a car that's not as good as what he's used to, I get that.\"But I think he knows the strength of the team, he knows how quick he is still, so I think he's going to work with his team to get back to fighting with Red Bull -- and I think they will,\" added Button, who was team mate to Hamilton at McLaren from 2010-12.\"It probably won't be this year but in 2024, I think we'll see Lewis Hamilton on the grid. I think he's still hungry to win another world championship.\"Hamilton is fourth in the championship, 45 points behind Red Bull's double world champion Max Verstappen after four of 23 races and with Miami next up this weekend. He was second in Australia last month.Red Bull have won every race so far, three of them with one-two finishes. (Reporting by Alan Baldwin, editing by Christian Radnedge)"
    ]
}