{
    "articleURL": "/wires/reuters/article-12042271/Moscow-sabotage-undersea-cables-war-Ukraine--NATO.html",
    "content": [
        "By Sabine Siebold",
        "BRUSSELS, May 3 (Reuters) - Russia may sabotage undersea cables to punish Western nations for supporting Ukraine, NATO's intelligence chief warned on Wednesday, as the alliance boosts efforts to protect undersea infrastructure following the Nord Stream attacks.\"There are heightened concerns that Russia may target undersea cables and other critical infrastructure in an effort to disrupt Western life, to gain leverage against those nations that are providing security to Ukraine,\" David Cattler told reporters.\"The Russians are more active than we have seen them in years in this domain,\" he said, adding they were patrolling more throughout the Atlantic than in recent years and had also stepped up activities in the North and Baltic seas.Threats to undersea cables and pipelines have become a focus of public attention since, in September 2022, as-yet unexplained explosions crippled the Nord Stream 1 and 2 pipelines, built to ship gas from Russia to Germany across the Baltic Sea.Citing ongoing investigations, Cattler declined to speculate about who was behind the attacks.As concerns grow over the security of undersea cables, Western countries are setting out to turn the North Sea into a green power engine, planning a spate of new wind parks that will be linked to the mainland by cables.Other undersea cables transport some 95% of internet traffic around the world at speeds of about 200 terabytes per second, with 200 of these 400 cables deemed critical, according to NATO.",
        "\"Altogether, they carry an estimated 10 trillion U.S. dollars worth of financial transactions every day, so these cables really are an economic linchpin,\" said Cattler, NATO's assistant secretary general for intelligence and security.He warned NATO's adversaries were realising the huge strategic advantage of being able to threaten the security of Western internet, energy and financial systems.\"Russia is actively mapping allied critical infrastructure both on land and on the seabed,\" Cattler said, describing the procedure as part of an underwater reconnaissance program run by part of the Russian defence ministry.However, NATO allies are closely monitoring Russian vessels equipped with sensors that can collect electronic or acoustic information from the seabed, he underlined, saying the spy ships can be identified by their antennae or unusual activity near critical areas.NATO significantly increased the number of ships patrolling the North and Baltic seas after the Nord Stream blasts, and established a Critical Undersea Infrastructure Protection Cell to improve cooperation with industry, capitals and experts.\"The threat is real, and NATO is stepping up,\" said German Lieutenant General Hans-Werner Wiermann who has been in charge of the new cell since February.Asked what industry can do to make new wind parks more resilient to attacks, he suggested linking them to the mainland with several cables instead just one. (Reporting by Sabine Siebold; editing by Marine Strauss and Jonathan Oatis)"
    ]
}