{
    "articleURL": "/money/markets/article-12038633/Israel-75-desert-economy-Silicon-Valley-Middle-East.html",
    "content": [
        "Celebration of the economic miracle that is Israel over the last 75 years has been dampened by weeks of demonstrations and protests.",
        "Dissenters in the country and across the diaspora have been taking a stand against Benjamin Netanyahu’s judicial and other reforms.Former Bank of Israel governors Karnit Flug and Jacob Frenkel are among the global economists who have warned that the proposed judicial changes could scare away investors and negatively impact the country’s credit rating.The paradox is that Netanyahu, as finance minister in Ariel Sharon’s government and as Prime Minister, changed Israel’s economy forever.He transformed the country from a struggling state-dominated nation, with high inflation and a weak shekel, into a free market economy on the Thatcherite model.",
        "Netanyahu was also responsible for guiding Israel to membership of the OECD, the Paris-based club of advanced Western nations.Israel’s journey from undeveloped, desert economy to the ‘Silicon Valley’ of the Middle East is an inspiring narrative.The Israel of 1948 was about Jaffa oranges, Dead Sea chemical plants and low-value textiles.Today’s Israel is a leader in advanced technology, cyber-security, avionics, telecoms, life sciences and materials research. Prosperity is supported by self-sufficiency in natural gas, particularly important in an age of fuel insecurity following Russia’s invasion of Ukraine.It should be no surprise that despite the recent political uproar in Jerusalem and demonstrations outside Downing Street, Britain signed a far-reaching trade agreement in London in March 2023. The UK’s trade relationship with Israel has blossomed to £7billion annually.",
        "At its beginnings in 1948, Israel had some advantages.As Europe’s pre-war universities emptied of Jews, a first wave of scientists and engineers put down the roots of Israel’s advanced science and technological citadels of excellence.Israel’s technological revolution has been reinforced by an intense focus by successive governments on research and development, with an astonishing 4.65 per cent of national income devoted to the cause.Its leadership in this area was reinforced by the arrival of Russian scientists, engineers and mathematicians when the barriers to emigration from the old Soviet Union came down in the 1980s.High-tech culture is seen by many young people as the path to prosperity. Israel’s high-tech industries contribute 15 per cent to national output (GDP), providing 43 per cent of the country’s exports and 25 per cent of the tax income.Perhaps the best measure of its economic strides is the speedy rise in the country’s per capita income – national output divided by population. On this measure, Israel’s per capita income stood at US $54,847 (£44,000) at the end of last year. Prosperity is higher than that in Britain at $47,317 (£38,000). ",
        "Israel’s historic growth record reflects a triumph of immigration. Holocaust survivors, their children and grandchildren, expelled populations from Arab lands and waves of Russian and Eastern European immigrants have all demonstrated the entrepreneurial spirit.",
        "Investment in Israel through its most difficult decades in the 1950s, 60s and 70s was supported by large subventions from overseas. German reparations at their peak amounted to more than $1billion (£800million) a year. Most significantly since independence, Israel has been the recipient of $158billion (£127billion) of military and other assistance from the US, according to the Congressional Research Service.But the OECD and the International Monetary Fund also recognise flaws in the society and economy. Among the most disturbing is that the OECD found that Israel has among the biggest income disparities in the Western world.At the top end of the income scale are the tech entrepreneurs, Russian oligarchs and established Israeli industrial and banking families, which dominate corporate ownership on the Tel Aviv Stock Exchange.At the other end are Israel’s less well-off minorities who find it hard to access the workforce. They include the fast-growing ultra-religious Charedi groups which often lack the secular education and awareness needed to contribute to wealth creation.Other struggling segments include the Israeli-Palestinian population of 2m.Many have advanced up the economic ladder and Israel’s healthcare system has proved a great testbed for social and economic equality. Around half of Israeli pharmacists are Arabs and up to one third are doctors and other medics.",
        "Left behind in abject poverty are the Bedouin Arabs of the Negev, who are involved in long-running and bitter land disputes with the Israeli authorities. Their communities wrestle with problems of drugs and inter-family violence.In its most recent, largely upbeat assessment of Israel’s prospects, the IMF pointed to large socio-economic gaps which mean ‘lower performance for Arab and Charedim students compared to their peers’.But there can be no dispute about the degree of economic change that has taken place in Israel. A barren land has been transformed into a Middle Eastern economic powerhouse.In any economy, the best opportunities for trading advantage are with your nearest neighbours. That has been denied to Israel for most of its existence because of extant security threats.Openings to the Gulf States and Morocco through the Abraham Accords, however, should be an enormous plus, with many of the modernising and wealthy oil states seeking to invigorate their economies with the best tech.But the full potential of Israel’s economy will never be reached until it better integrates its domestic minorities into the labour force and finds better ways of co-existing with its closest neighbours in the West Bank and Gaza.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}