{
    "articleURL": "/wires/reuters/article-12041555/Bunge-beats-quarterly-profit-estimates-strong-food-biofuels-demand.html",
    "content": [
        "By Karl Plume and Sourasis Bose",
        "May 3 (Reuters) - Agricultural commodities trader Bunge Ltd beat Wall Street estimates for first-quarter profit on Wednesday, helped by strong crush margins in North America and Brazil as well as high demand for food, feed and biofuels.But earnings were down from a record first quarter last year due to weaker oilseed processing results in Asia, Europe and drought-hit Argentina and disruptions to grain flows caused by the war in Ukraine.Shares were little changed in morning trading, up 0.5% at $91.58.Bunge reaffirmed its full-year 2023 outlook of adjusted earnings of $11 per share, citing likely weaker results from its Agribusiness and Milling divisions but improved profits in its Refined and Specialty Oils unit.\"The mixed results might not weigh much on the shares today. But estimates are probably not headed higher for the year,\" J.P. Morgan said in an analyst note, citing Bunge's unchanged full-year guidance that was about 80 cents lower than the current consensus analyst view.Bunge and other supply chain middlemen, including Archer-Daniels-Midland Co and Cargill Inc, have generally benefited from strong global crop demand and tightening supplies, with record profits last year.But supply disruptions due to the ongoing war in Ukraine and a severe drought in Argentina have begun to dent earnings for the grains merchants.",
        "The worst drought in decades has slashed grain and soy harvests in Argentina, depriving Bunge of the crops it needs to process.First-quarter adjusted profit in Bunge's Agribusiness unit, its largest in terms of revenue and volumes, dropped 18% on the year.Bunge said results were strong in all regions in its Refined and Specialty Oils division, with notable strength in North America and South America, reflecting favorable food and fuel demand trends.The company reported adjusted net earnings of $3.26 per share for the three months ended March 31, down from a record $4.26 in the same quarter last year but above analysts' average estimate of $3.24 per share, according to Refinitiv data.(Reporting by Karl Plume in Chicago and Sourasis Bose in Bengaluru; Editing by Vinay Dwivedi, Louise Heavens and Mark Porter)"
    ]
}