{
    "articleURL": "/money/markets/article-12040855/Booming-banks-Lloyds-latest-lender-unveil-bumper-profits.html",
    "content": [
        "Lloyds reported pre-tax profits of £2.3bn for the three months to 31 MarchBarclays, HSBC and NatWest have posted bumper results in recent daysBritain's big banks are raking in bumper profits, with many benefiting from higher interest rates and greater consumer reliance on credit cards.",
        "Banks profit on the gap between what they charge on lending and pay out on deposits, and Lloyds Banking Group today joined its rivals on Wednesday in posting better-than-expected results for the first quarter. Lloyds told investors rising interest rates helped pre-tax profits surge by 46 per cent to £2.3billion in the three months to 31 March, up from £1.5billion a year ago.",
        "Lloyds took an impairment charge of £243million, up from £177million a year ago, despite a slightly improved outlook for the UK economy. Britain's households and businesses are contending with the highest inflation rate in western Europe, ramping up the risk of some cash-strapped borrowers defaulting on increasingly expensive debt. The lender said it was seeing 'modest' increases in borrowers falling into arrears and defaulting on loans amid the cost-of-living crisis, but said levels remain at or below those seen before the pandemic.  Customer deposits fell slightly during the period, from £475.3billion to £473.1billion and are down 2 per cent from the previous year.Operating costs did see a modest increase over the quarter to £2.17bn but are still lower than this time last year.The banking group expects the UK economy to contract by 0.6 per cent this year, – compared to its prediction in February for a 1.2 per cent downturn – but still slip into a mild recession over the first three quarters, before returning to growth.",
        "House prices are likely to fall by a more muted 5.3 per cent this year and 1.2 per cent in 2024, it added.Charlie Nunn, chief executive of Lloyds, said: 'The macroeconomic outlook remains uncertain.'We know that this is challenging for many people.'Our purpose-driven strategy, alongside our financial strength, means we can continue to support our customers across the country.'Lloyds' shares fell today and were down 3.58 per cent or 1.71p to 45.98p this afternoon.Richard Hunter, head of markets at Interactive Investor, said: 'Lloyds has brought down the curtain on the quarterly banking reporting season with another show of strength, as it breezed past expectations on virtually all measures.'As has been the theme throughout, rising interest rates and relatively low levels of customer defaults have boosted most of the key metrics with the backdrop playing into the hands of well-capitalised banks.He added: 'The group has rallied against an increasingly tightening screw which has placed pressure on consumers, while keeping an eye on future opportunities. 'The share price has had to contend with the group’s reputation as being something of a barometer for the UK economy, which has not been a comfortable ride, in addition to the wider banking weakness of recent months. 'The shares are down by 11 per cent in the last three months as a result, although over the last year have posted a gain of 4 per cent, which compares to a rise of 2.8 per cent for the wider FTSE 100. ",
        "'The measured progress which has opened the bank’s new year may not have blown the lights out, but represents a positive direction of travel, which in turn will likely result in the market consensus of the shares as a buy remaining in place.'Michael Hewson, chief market analyst at CMC Markets UK, said: 'Lloyds has... had a difficult quarter share price wise, pushing up to one-year highs in early February in the aftermath of its full year numbers, before sliding to its lowest levels since November last year as the March turmoil in the banking sector clobbered valuations.'The bank has been a serial underperformer over the past five years despite being more profitable than it was when it was trading above 70p back in 2019.'Metro Bank boosted by mortgage demandMetro Bank also posted its latest first quarter results on Wednesday, revealing net inflows picked up in March on a revival in demand for mortgage loans.'March has been our strongest month of performance since the turnaround commenced,' boss Daniel Frumkin, said.Retail mortgage lending increased marginally to £7.7billion in the three months ending 31 March. Metro Bank's first-quarter total deposits dropped, compared with the prior quarter, as the lender faced seasonal factors such as higher tax payments in January.Total deposits stood at £15.6billion in the first quarter, against £16.01billion in the three-month period ending 31 December.",
        "Metro Bank said total loans remained broadly flat quarter-on-quarter at £12.92billion, on weak consumer and commercial lending. Metro Bank shares rose today and were up 2.26 per cent or 2.20p to 99.60p this morning, having risen over 9 per cent in the last 12 months. HSBC, Barclays and NatWest also faring wellOn Tuesday, Asia-focused HSBC said its profits got a £1.2billion boost from the purchase of collapsed Silicon Valley Bank's UK business.HSBC posted a pre-tax profit of $12.9billion, or over £10billion, for the three months to the end of March.That is more than three times the amount it made for the same time last year.In March, HSBC snapped up SVB UK for a nominal £1, in a deal led by the government and the Bank of England.'We remain focused on continuing to improve our performance and maintaining tight cost discipline, but we also saw an opportunity to invest in SVB UK to accelerate our growth plans, HSBC boss Noel Quinn, said. ",
        "The group's revenue rose by 64 per cent $20.2billion, having been bolstered by rising interest rates. HSBC also announced its first quarterly payout to investors since before the pandemic in 2019 and said it would buy back $2billion of its shares. HSBC shares have struggled in recent years but are around 13 per cent higher than a year ago. ",
        "Last week, Barclays unveiled a stronger than expected first-quarter profit after a storming performance from its credit card business offset weakness elsewhere.The bank's first quarter pre-tax profit came in at £2.6billion, up from £2.2billion a year ago and beating analyst forecasts.It marked the bank's highest quarterly profit since 2011 when accounting standards changed.Income at the lender's consumer, cards and payments division surged by 47 per cent to £1.3billion, thanks to rising credit card balances, driven partly by its acquisition of a portfolio from retailer Gap last year. Barclays shares are around the 154.78p mark today. On Friday, NatWest posted bumper first-quarter profits on the back of a rise in interest rates, but said persistently high prices were prompting some customers to dip into their savings.The group reported a 50 per cent rise in profits to £1.9billion in the first three months of the year. That was better than the £1.6billion forecast by analysts. NatWest shares are up 1.7p to 259.40p today. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}