{
    "articleURL": "/tvshowbiz/article-12060089/Priyanka-Chopra-stuns-white-halter-dress-arrives-View-promote-Love-Again.html",
    "content": [
        "Priyanka Chopra was a vision in white as she arrived for an interview in New York City on Monday. ",
        "The actress, 40, who revealed her father had to put bars on her bedroom windows as a teen to protect her from adoring fans, showed off her curves in a white ankle length halter dress with a plunging neckline and A-line skirt. The Indian-born star showcased her toned frame via the frock's low cut T-back.  The 5ft5in beauty stood tall in a pair of white boots with a stiletto heel. Priyanka's chestnut brown hair was parted in the center and styled in loose layers. Her makeup was camera ready for her interview with the ladies of The View. She accessorized with large hoop earrings and carried white framed sunglasses. ",
        "The versatile actress shared a selfie from her morning styling session with writing 'Last Press day!!' she shared.'See you soon @theviewabc.'Priyanka has been promoting her latest film, Love Again which was scheduled to open Friday.She co-stars in the romantic comedy with Outlander hunk Sam Heughan, 43.The People's Choice Award winner stars as Mira, a woman who begins sending messages to her dead boyfriends cell number as a way of dealing with her grief.Sam's character, Rob, is a music critic for a newspaper and he receives the tender texts on his work phone.After one of the notes interferes with an interview of Celine Dion, 55, who is starring as herself, the Grammy winner first chastises Rob, then offers advice.",
        "She encourages the journalist to take a chance at love with Mira. ",
        "In addition to starring on-screen, Celine worked as an executive producer of the project and contributed several new songs to the soundtrack including I'll Be.In addition to showing scenes from the film, the video includes photos of fans who sent their pictures with messages of love for the diva who revealed she had been diagnosed with stiff-person syndrome.On her Instagram page, the superstar and her team thanked them writing 'To all of you amazing fans who submitted pictures for Celine… thank you for your incredible support. It means the world to feel this love…again.' The neurological condition was diagnosed after years of dealing with unexplained spasms that affected her different part of her body and her vocal chords. Celine announced the diagnosis in an emotional video in December, explaining how the condition had affected her. ",
        " 'Unfortunately, these spasms affect every aspect of my daily life, sometimes causing difficulties when I walk and not allowing me to use my vocal cords to sing the way I'm used to.'The film and her musical performances in it were shot in 2020 before her diagnosis. Sam explained to Entertainment Weekly that Covid restrictions kept the production in a very close bubble.",
        "Although he and Celine appear to be in the same room during a couple of scenes they never worked together in person. Thanks to technological wizardry and excellent editing, Sam and Celine appeared to be in the same room although they were thousands of miles apart. He was on a sound stage in London, while she was in front of a green screen in Canada. "
    ]
}