{
    "articleURL": "/news/article-12046781/Hunter-Biden-files-motion-former-Trump-aide-testifying-custody-trial.html",
    "content": [
        "Hunter Biden's baby mama Lunden Roberts has retained ex Trump aide Garrett Ziegler as an expert witness to paint a true picture of Hunter's finances DailyMail.com can reveal that Hunter has filed a motion to have Ziegler kicked off the case and banned from giving evidenceZiegler prepared a 644-page dossier on his abandoned laptop and has slammed 'wussies' who were afraid to take on the BidensHunter Biden wants the former Trump aide who prepared a 644-page dossier on his abandoned laptop to be banned from giving evidence at his paternity trial, DailyMail.com can reveal.",
        "Hunter's baby mama Lunden Roberts has retained Garrett Ziegler as an expert witness to tease out a true picture of the Biden scion's murky finances as they wrangle over how much child support he should pay for their four-year-old daughter, Navy Joan Roberts. But Hunter's lawyers have filed a fresh motion to have Ziegler kicked off the case, trashing his lack of accountancy credentials and painting him as a right-wing conspiracy nut who is waging 'war' against the Biden family.They want the longtime Hunter nemesis to be slapped with a temporary restraining order to prevent him from disseminating his tax records to 'extremists.'",
        "The president's embattled son, 53, was spotted by DailyMail.com Wednesday as he headed out for a family meal in Malibu with his wife Melissa Cohen and their two-year-old son Beau.Despite looming federal and congressional probes, Hunter looked relaxed and cheerful as he dressed casually in jeans, sneakers and a baseball cap and carried his little boy into the Cholada Thai eatery, Secret Service agents trailing close behind.Melissa Cohen has been standing beside her man in the midst of his legal battles and was walking alongside him on Wednesday in green sweatpants, a t-shirt and sneakers.Behind the scenes, Biden's legal team have been hard at work trying to block Ziegler, 27, from using the Arkansas paternity suit to inflict yet another embarrassing attack on the First Family",
        "In the new filing, Biden attorney Brent Langdon links Ziegler, the founder of conservative non-profit Marco Polo, to botched attempts to overthrow the results of the 2020 election and blasts him for transcribing and publishing the contents of Ashley Biden's stolen diary.He further accuses Ziegler of leaking confidential details from Hunter's tax returns just one day after he was hired by Arkansas native Roberts.",
        "The motion includes audio taken from an April 15 powerpoint presentation in which Ziegler slammed 'wussies' who were afraid to take on the Bidens and bragged that he had 'digitally carpet bombed' his laptop dossier to every single media outlet, according to Langdon.'The only person that has held Hunter accountable for anything in his entire life is the lawyer for his baby mama in Arkansas, okay, and I have since been approached by him and working with him, his name is Clint Lancaster,' Ziegler is said to have boasted during the two-hour talk.He went on to accuse the Bidens of money laundering, sex trafficking and other crimes, according to the filing, which argues Ziegler is a 'security and confidentiality risk' who has already breached a court order banning the parties from disseminating confidential financial docs.'Ziegler's only notable work experience was as a White House aide in the now defunct Office of Trade and Manufacturing Policy (OTMP) under Peter Navarro (currently pending trial for charges of criminal contempt of Congress) during the Trump administration, where he wrote reports on election fraud, domestic manufacturing, the 'plandemic response' (insinuating that the COVID-19 pandemic was a conspiracy), counterfeit goods, and trade,' Langdon states in the scathing 34-page motion. ",
        "'He has no work experience as an accountant or finance expert of any kind.'",
        "The latest legal tussle comes after Hunter and Roberts, 32, came face to face in an Independence County, Arkansas courtroom on Monday, the first time the former flames had seen one another since she played him an audio recording of her unborn daughter's heartbeat in spring 2018. Their long-running paternity suit seemed to have been resolved in 2019 when a DNA test proved Hunter had fathered Navy Joan and he agreed to a reported $2.5 million settlement. But the recovering drug addict abruptly reopened the case in September, claiming he had suffered 'a substantial material change' in his income and couldn't afford the $20,000-per-month payments.",
        "Roberts refused to buckle and raised the stakes by petitioning the court to officially rename her daughter Navy Joan Biden to 'benefit from carrying the Biden Family name.'She also served Hunter with a sprawling discovery request covering everything from his business deals in Ukraine and China to the names of the mystery art lovers who have paid hundreds of thousands of dollars for his beginner paintings.Hunter's lawyers told Monday's hearing he was not a deadbeat dad and complained about DailyMail.com reporting on Hunter's lavish lifestyle, claiming his Porsche had been repossessed and he had only flown on Air Force Once on one occasion the entire time his dad was president. ",
        "Judge Holly Meyer ordered them to hand over various discovery items, including a breakdown of any loans or gifts Hunter has received from his so-called 'sugar brother' pal Kevin Morris, a wealthy Hollywood attorney who reportedly loaned him $2.8 million to pay off a 2021 tax bill.Morris is currently suing Ziegler for alleged harassment and invasion of privacy in a separate case related to his investigation into alleged Biden family corruption. Hunter's hotshot DC lawyer Abbe Lowell also fired off letters last month to the Treasury Department and House Ethics Committee urging them to investigate Ziegler for circulating federal banking records.They say he was a key figure in the lead up to the January 6 riot after he reportedly organized a December 18, 2020 meeting where Trump loyalists Michael Flynn and Sidney Powell discussed seizing voting machines or declaring martial law. Ziegler has uploaded more than 120,000 emails and other documents from Hunter's laptop to his Marco Polo website, with chapters including 'A wrecked life: Hunter's Bill' and 'An Orgy with Daphne Guinness, and Joe thinks I'm God.' He did the same with the alleged contents of Ashley Biden's diary a year after she left it behind when she moved out of a home in Delray Beach, Florida, in spring 2020.",
        "Aimee Harriss and Robert Kurlander later admitted trafficking the stolen item across state lines and selling it to Project Veritas for $40,000.Ziegler's involvement in Hunter's child support case pours further fuel on the bitter four-year saga over Navy Joan, the adorable little girl neither he, nor his parents Joe and Jill, have ever met or publicly acknowledged. Roberts wants to know how Hunter can plead poverty while deploying a stable of super lawyers including Lowell – who is said to charge up to $855 per hour – across his various lawsuits and congressional probes.",
        "Lancaster argues that slashing her payments would be 'inappropriate and unjust'. In his own filings, the father-of-five has opposed Navy Joan becoming a Biden, insisting he wants a 'peaceful existence' for her, free of the political scrutiny associated with his family dynasty.It was initially reported that Hunter met Roberts while she worked as a stripper at a DC club which Hunter frequented. But texts retrieved from his abandoned laptop proved that she was in fact on the payroll at Rosemont Seneca, Hunter's Washington, D.C. investment firm. She and Hunter conceived Navy Joan around December 2017 while he was still in a relationship with his brother Beau's widow, Hallie.The blonde-haired tyke was born in August 2018 but remained a secret until her mom sued Hunter for child support in her native Arkansas a year later. ",
        "He claimed during the original 10-month paternity case that he was 'unemployed and had no monthly income' despite living in a $12,000-per-month Hollywood rental and driving a Porsche. But when a judge ordered him to produce financial records Hunter repeatedly failed to do so and instead settled out of court, the two sides announcing a 'global, final settlement of all issues'. He's never seen Navy Joan and – according to Roberts's court filings – couldn't even pick her out of a photo lineup."
    ]
}