{
    "articleURL": "/wires/reuters/article-12045263/Adecco-sales-beat-polls-career-transition-branch-gains-traction.html",
    "content": [
        "Sales beat estimates on strength in Europe, Asia",
        "Europe's temporary jobs market resilientTalent scarcity set to last - CEO(adds new CEO quote, share move, details on APAC and North America, AI comments, analyst comment)By Andrey SychevMay 4 (Reuters) - Adecco Group beat first-quarter sales expectations on Thursday as companies turned to temporary workers after laying off staff to cope with economic uncertainty.The group reported an 8% rise in quarterly sales to 5.89 billion euros ($6.53 billion), beating analysts' consensus forecast of 5.83 billion euros.Sales in its biggest unit Adecco, which offers permanent and flexible staffing services, grew 3% organically and brought in two-thirds of revenues in the quarter, underpinned by resilient demand for temporary workers.The division's result was especially strong in Europe, thanks to demand from the automotive, logistics, and services sectors. Asia-Pacific saw a record 10% increase, though North America lost 8% due to lower volumes.\"We see a pretty good dynamic overall. Talent scarcity is there to last both for blue-collar and white-collar jobs, driven by demographics and personal choices,\" Adecco's CEO Denis Machuel said during a conference call.Adecco shares opened 2.5% higher, before shedding gains to fall 2% by 1215 GMT.ING analyst Marc Zwartsenburg said the stock's reversal was \"more due to fear of further economic weakness, or maybe potentially a recession\". \"It's not about the results... but about the outlook statements,\" he said. \"There you see room for caution.\"",
        "In the current quarter, Adecco sees both gross margin and its selling, general and administrative expenses (SG&amp;amp;A) broadly in line with the first quarter, when gross profit margin came in at 21.3% and SG&amp;amp;A at 18.4% of revenues.The performance of staffing firms such as Adecco and Randstad is seen as a bellwether for broader economic activity as companies' appetite for hiring indicates confidence in the economy. Peer Randstad's shares were down 2% at 1215 GMT, tracking Adecco.European companies have accelerated hiring to meet rising demand in the region's dominant service sector as the euro zone economy recovers faster than expected.Sales in Adecco's career transition business, which offers coaching services to employees and organisations, surged by 63% on a reported basis, driven mainly by the U.S. and UK markets, as well as by the tech sector in general.Asked about the impact of developments in artificial intelligence (AI) on the job markets, Machuel said many blue-collar roles will remain as AI cannot fully replace them, but that employees will have to adapt to possible changes in workflow.\"Some clerk jobs will probably be reduced by AI,\" the CEO of the world's second-biggest human resources firm by revenue said.From the company's perspective, AI offered opportunities, Machuel said. \"We are quite positive about AI, it can also bring efficiency to our business,\" he said.",
        "($1 = 0.9021 euros) (Reporting by Andrey Sychev in Gdansk; Editing by Muralikumar Anantharaman, Mark Potter and Jan Harvey)"
    ]
}