{
    "articleURL": "/femail/article-12043169/Inside-Chick-fil-THEMED-Atlanta-restaurants-one-kind-menus.html",
    "content": [
        "The company has a spread of very unique restaurants in its home city AtlantaThey are showcased in a TikTok by Boston-based YouTuber Maggie Calhoun The one-of-a-kind outposts embrace various themes, from Hawaii to the 1950sChick-fil-A is one America's biggest fast food chains. ",
        "Yet unbeknown to many, the company has a spread of very unique restaurants in its home state Georgia which are a far cry from the standard Chick-fil-A brick and mortar restaurants. As revealed in a recent TikTok by Boston-based TikToker Maggie Calhoun, the one-of-a-kind outposts that she visits embrace various themes, with several looking like a 1950s diners and another inspired by the climbs of Hawaii, complete with palm trees and Tiki-style interiors.  Some of the most off the wall Chick-fil-As - called the Dwarf Houses - boast miniature fairytale-esque doors and whimsical exteriors, while all of the unique outposts serve up special menus and merchandise which are unavailable elsewhere. Scroll down for your fill of Chick-fil-A's wacky and wonderful restaurants, which pay homage to the company's late founder, Truett Cathy, and draw fans from far and wide. The Dwarf House",
        "Chick-fil-A founder S. Truett Cathy and his younger brother, Ben, opened The Dwarf Grill (later renamed The Dwarf House) in Hapeville, Georgia on May 23, 1946. It was named The Dwarf Grill because of its small footprint, and it opened with just 10 counter stools and four tables.It is here in 1964 that Cathy invented - and his customers at The Dwarf House taste-tested - what is now known as the Chick-fil-A Chicken Sandwich.",
        "The company still makes the Chick-fil-A Chicken Sandwich the same way today: a boneless, hand-breaded breast of chicken 'seasoned to perfection, pressure cooked and served on a toasted, buttered bun with dill pickle chips.' Shortly after opening the first freestanding Chick-fil-A in 1986, Cathy created a new restaurant to replicate the Dwarf Grill. Beginning in the late 1980s and through the early 1990s, Cathy oversaw the construction of multiple Dwarf House restaurants located around the metro Atlanta area. There are now five Dwarf House outposts which have a a fairytale-like look about them, which miniature doors and redbrick detailing. These Chick-fil-A restaurants still serve many of the original diner classics, including hamburgers, waffles, the famous 'hot brown' (a concoction featuring chopped chicken topped with cream sauce, cheddar cheese, paprika and bacon) and sweet pies according to the 'Pie Lady' Zelma Calhoun's original recipes.TikToker @paige.mccormick visited one of the Dwarf Houses this year and said 10/10 she 'would do it again.'Truett's Grill ",
        "Truett's Grill - which has the look and feel of a 1950s diner - was originally opened in Morrow in 1996 to commemorate Truett Cathy's 50th anniversary as a restauranteur. There are now three locations in Georgia, with the other two in McDonough and Griffin.Videos posted to TikTok reveal the interiors of the restaurants, with some of the more unusual features being a miniature doors labeled 'this door's for little folks and grandparents.' ",
        "Paying homage to Cathy's love of transportation, the restaurants feature everything from model trains running through the restaurants on tracks to the carcass of cable car carriages to pictures of Cathy and his favorite cars. Truett's Grills offer sit down, counter and drive-thru services, and some of the unique menu items include banana pudding, fried pickles, fried okra, chicken and waffles and collard greens. TikToker @lolo13sanzo, who visited the McDonough location in 2022, says: 'You won’t get the full menu in the drive through, you have to go in and sit down!' Overall, she gave the diner 9/10 and told  viewers that it is 'worth a try!' ",
        "Truett's Luau ",
        "Food entrepreneur Cathy once visited Hawaii and loved the experience so much he wanted to, 'bring Hawaii to Fayetteville, Georgia.'So in December 2013, at the age of 92, he opened Truett's Luau.From the outset this Hawaiian-themed restaurant has a tropical feel, with a large rock and waterfall feature in the grounds. On stepping inside, a video posted by TikToker @lolo13sanzo reveals how the theme continues with tables framed by palm tress and ukuleles hanging on the walls. She also tells viewers that it 'smells like coconuts when you walk in.' As she looks through the menu there are dozens of unique dishes that do not appear at any other Chick-fil-A outposts, with these including an 'Aloha fish sandwich' and 'Lava Rocks' which are described as fried wontons 'filled with a flavorful mix of chicken, bacon, cream cheese, green onions, blue cheese and volcano sauce.'",
        "During her visit, @lolo13sanzo rates a number of things at Truett's Luau, giving the frozen Hawaiian Milkshake a 10/10, the Big Kahuna Fries a 12/10, the Kalua Pork Nachos a 4/10, the Tropical Nuggets a 10/10, the Luau Burger a 10/10 and the Banana Macadamia Nut pancakes a 9/10.She states in the video's accompanying caption: 'It’s so worth a visit! Go in and sit down or you won’t get the full menu!' Meanwhile, Chick-fil-A says of its Hawaiian spot: 'Until you can make it to the Aloha State, check out Truett’s Luau for the next best thing – tasty food and top-notch service in a fun, Hawaiian atmosphere (minus the ocean views).' Truett's Chick-fil-A ",
        "Truett's Chick-fil-As, which first launched in 2017, are restaurants are dedicated to the life and legacy of Truett Cathy. According to the company, they were designed to 'allow customers to learn Cathy's story through family heirlooms, photos and quotes displayed on the walls.' Each restaurant - located in Newnan, Rome, Stockbridge and Woodstock - provides sit down, counter and drive-thru services. Some of the most popular dishes on the Truett's Chick-fil-A menu include the Loaded Southern Waffle Fries and Battered Pickles. TikToker @g.a.m_2001 visited the Truett's Chick-fil-A in Rome last year with her family and said it was 'sooo good.'",
        "A video detailing her outing shows how the restaurant has a 'little red door' like the Dwarf Houses. A sign inside the restaurant details the history of the door and explains that the one at the Rome location pays homage to the original door at the first Dwarf House.It adds: 'Then as now, the door is open for a whole new generation of neighbors and friends. Come in, and make yourself at home.'Other features in the restaurant include retro-style interiors, vintage black and white photos of Cathy and locomotives running around a track hanging from the ceiling."
    ]
}