{
    "articleURL": "/femail/article-12042345/Save-40-DreamCloud-hybrid-mattress-improved-quality-quantity-sleep-thousands.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, DailyMail.com will earn an affiliate commission. Click here for more information.",
        "While you can't put a price on a comfortable night's sleep that leaves you feeling blissfully rested, it's now almost half the price it used to be.With a 40 per cent off sale running at DreamCloud until the end of the day on May 8, you can invest in a mattress that feels both supremely soft and reassuringly supportive from just $499 for a twin or $999 for a giant California King.  DreamCloud Hybrid Mattress, Full Climb into supreme comfort with a luxury mattress featuring a breathable cashmere top quilted with foam, pressure-relieving gel memory foam, and innerspring coils.It comes with a 365-night trial in which you can return it hassle-free for a full refund if you find it doesn't improve your sleep or suit your needs.Thousands of reviews from satisfied customers are glowing with shoppers saying its cured pain and increased the amount of quality sleep they're getting. $719 (was $1,199)   ShopDreamCloud specialize in hybrid mattresses with memory foam on top for softness, support and an extra layer of breathability while individually wrapped pocket springs on the bottom provide increased airflow and reduced motion transfer. It offers the best of both worlds. Pocket spring mattresses are great for support but can be uncomfortable while pure memory foam mattress are often too soft to properly align your body and relieve pressure. ",
        "A DreamCloud's hybrid design has an impressive seven layers, which is why shoppers say 'it feels like sleeping on a soft cloud' and they sleep deeper after making the switch.",
        "People who suffer from painful conditions that have previously interfered with sleep are able to switch off and get some rest thanks to an inch of gel-infused memory foam that hugs the body and adapts to it's curves for responsive contouring and unparalleled pressure relief for your neck, shoulders, back, and hips.On top, there's another one and a half inches of responsive memory foam for a lovely cushioned feel that allows you to sink in and relax. Eight and a half inches of motion-resistant spring coils provide a stable surface for sleep but you won't feel them at all thanks to an additional layer of  foam above them. This layer also promotes better spinal alignment.",
        "Are you a hot sleeper? You'll find a DreamCloud hybrid mattress is exceptionally breathable as cooling gel memory foam and innerspring coils work in tandem to help disperse heat, so you can have a refreshing rest.The reviews on the website are unanimously positive with almost 10,000 shoppers awarding the original DreamCloud hybrid mattress a full five stars and everyone raving about the unrivalled comfort and support.",
        "'This mattress has helped me to sleep like a baby,' praised one delighted reviewer. 'I could not say enough good things about my DreamCloud purchase. My partner and I have both experienced higher quality sleep, less tossing and turning due to the comfort of the mattress, and more controlled body temperatures over night.' ",
        "Another added: 'I love the mattress. From the first night it was comfortable. Many mornings I don’t want to get up because I am so comfortable. The mattress seems to be helping the arthritis in my back and other pain issues.'As DreamCloud appreciate choosing a mattress is a big deal, they offer a 365-night sleep trial in which you can get your money back if you decide the mattress is not for you. A DreamCloud Sleep Concierge will work with you to get the item donated or otherwise disposed-of through local organizations within your community.Just remember to shop on the DreamCloud website before 2359 on May 8 to save 40 per cent. "
    ]
}