{
    "articleURL": "/wires/reuters/article-12042507/Reunited-Jets-strike-deal-pair-WR-Randall-Cobb-QB-11th-season.html",
    "content": [
        "Randall Cobb rates among new Jets quarterback Aaron Rodgers' favorite targets, which explains the team's motive for adding the veteran slot receiver on a reported one-year deal.",
        "Cobb, 32, spent his first eight seasons with Rodgers and the Green Bay Packers before playing for the Dallas Cowboys and Houston Texans. The Packers, under Rodgers' direction at a salty stretch in their partnership, re-acquired Cobb via trade from the Texans in 2021.In 10 seasons as teammates, Rodgers completed 534 career passes to Cobb according to Green Bay game notes, second only to the Rodgers-to-Davante Adams pairing (687).Cobb is reportedly tailing Rodgers to New York after the Jets finalized a trade for the four-time MVP quarterback last week. The Jets already signed former Packers wide receiver Allen Lazard to a four-year, $44 million deal in free agency. Cobb turns 33 in August, and Rodgers will be 40 in December.Like Rodgers and Lazard, Cobb will recognize a few familiar faces in New York, including offensive coordinator Nathaniel Hackett, No. 3 quarterback Tim Boyle and right tackle Billy Turner.Cobb played in 13 games last season with 34 receptions for 417 yards and one touchdown.Following the season-ending loss to the Detroit Lions in Week 18 on Jan. 8, Cobb exited the playing field and went into the tunnel at Lambeau Field at Rodgers' immediate right, a blaring signal it was the final appearance for the pair as Packers.",
        "\"I just love the man. Always had a tight friendship with him. Just a lot of gratitude in the midst of disappointment,\" Rodgers said after that game. \"The best part of this game is the relationships that come out of it because that lasts longer than the career, and I'm thankful for Randall.\"Cobb and Rodgers also shared a tearful embrace on the sideline in what they thought could be their last time taking the field together on Dec. 30, 2018.\"We've spent a lot of years on this team in Green Bay here,\" Cobb said in January. \"We'll see where life takes us.\"Cobb has 625 receptions for 7,585 yards and 53 touchdowns in 155 games with the Packers, Cowboys and Texans.--Field Level Media"
    ]
}