{
    "articleURL": "/tvshowbiz/article-12039185/Vanderpump-Rules-Ariana-Madix-SCREAMS-Tom-Sandoval-Raquel-Leviss-season-finale-trailer.html",
    "content": [
        "Scorned Vanderpump Rules star Ariana Madix declared she 'regretted ever loving' cheating ex Tom Sandoval as the pair screamed at one another in the explosive season 10 finale trailer.",
        "The dramatic new clip sees former couple of nine years Madix, 37 and Sandoval, 40, have an incendiary row over his affair with Raquel Leviss, 28 - before Leviss and Sandoval joke about their tryst going 'horribly wrong.'The clip opens with Sandoval telling Scheana Shay: 'I was going to break up with Ariana regardless' with the star retorting: 'But you didn't, you f****d her best friend.'A sobbing Sandoval then says: 'I sacrificed everything and my world got turned upside down' as he hugs Leviss' former love interest Tom Schwartz.Sandoval says: 'I felt something I hadn't felt in a really really long time' as Schwartz responds: 'Jesus Christ.' ",
        "Madix and Sandoval are then seen having a heart-to heart as the hunk says: 'Me and Raquel became like really good friends' before his ex cuts him off and screams: 'I don't give a f*** about f*****g Raquel!' screaming. Your friendship is  f*****g bulls**t!An incensed Sandoval responds: 'No it's not! You know everything!'' as Madix shouts back: 'Yes, it is!'A tearful Madix then tells a despondent Sandoval: 'I regret ever loving you!'Sandoval and Leviss are also seen cozying up together as the beauty laughs about the swirling drama - saying: 'It turned out so horribly wrong.'LaLa Kent says to Madix: 'You think this is the first time he's been creeping around?' as Sandoval admits to another instance of infidelity, saying: 'There was one other time.'",
        "Leviss' voice is also heard on a phone call with ex-fiancé James Kennedy saying she and Sandoval are 'not an item.'Lisa Vanderpump is seen telling a tearful Madix 'You don’t deserve any of this'.The trailer also sees Schwartz reveal Sandoval told him about the affair a month before it was revealed.Kristen Doute is also seen making her return to the show as she asks Madix: 'You ready?' ",
        "Leviss dropped a shocking admission when she revealed she had slept over at  Sandoval's house in a sneak peek of an upcoming Vanderpump Rules episode set to air on May 3. In the most recent episode that aired earlier this week on Wednesday, the TomTom founder issued a bare faced lie and claimed 'nothing has happened' between him and the former beauty pageant queen.However, in the sneak peek, Leviss was tardy to work at SUR restaurant in West Hollywood, and Lisa Vanderpump had questioned her lateness, with her explaining she 'overslept' and 'stayed up late.' 'I went back to Tom's place and we went in the jacuzzi with [Tom] Schwartz,' she added. When Lisa asked where she ended up staying the night, Raquel answered, 'At Sandoval's.' The sleepover had taken place when his then-girlfriend, Ariana Madix, was out of town attending her grandmother's funeral. ",
        "After the admission and Lisa's rather shocked reaction, the TV personality quickly jumped back into the conversation to claim, 'Nothing happened though' while expressing that the situation 'looked bad.' Leviss added that she had felt, 'It was easier to sleep on the couch and stay the night.' Vanderpump didn't waste any time to video call Sandoval and get a confirmation of Raquel's statement. 'We hung out for a little bit,' he stated while driving, but added that she 'dipped out' and 'left early.'However, after avoiding the question if she had spent the night or not, Lisa asked for a simple 'Yes' or 'No,' and following a brief moment of silence, Tom stated, 'Yes,' ending the clip.  At the beginning of the 7-minute sneak peek, Raquel and Tom, along with Ariana, Tom Schwartz, Brock Davies, and Scheana Shay enjoyed a glamping trip in celebration of Leviss' birthday. The video then transitioned to Lala Kent at her office and was visited by James Kennedy, who previously dated Raquel until their split in December 2021. The mother of one told James that she was aware that Raquel had slept over at Tom's house and revealed that Katie Maloney had told her. The clip then cut to 'A few days ago' to show Maloney at Villa Rosa. ",
        "She had discovered the shocking news when Ken Todd told Lisa Vanderpump, with Katie also in the room, 'I can't believe that Tom Sandoval had Raquel over when Ariana was away.' ",
        "Lisa already had knowledge of the sleepover due to Leviss being late to work, and her confrontation with both the former beauty pageant queen and the TomTom founder. The admission comes shortly after the latest Wednesday, April 26 episode where Sandoval told a lie and stated that 'nothing has happened' between him and Raquel during a confessional on the show. The question was asked after James Kennedy's current girlfriend, Ally Lewber, revealed she had seen both Raquel and Tom dancing at a club called The Abbey, with no Ariana in sight. Sandoval had also clapped back at Katie after she had claimed that both he and Madix were in an open relationship. 'It's annoying that Katie would say something like that. It's insulting to not just me but Ariana as well. Raquel and I were not, like, dancing all close in the dark corner of a speakeasy,' he explained during a confessional, adding that 'a bunch of us' went to the bar. Despite Tom's claims that nothing physical had happened between him and Leviss, his nearly ten-year relationship with Ariana came to an end earlier last month in March after the affair had come to light. ",
        "The infidelity had begun last year in August 2022, and lasted for seven months until Ariana discovered intimate FaceTime videos on Tom's phone between him and Raquel. Madix then split with the businessman, and has been moving on with the support of her fellow VPR castmates, such as Lala, Scheana, and also Katie. She was spotted earlier this month sharing a romantic kiss with fitness coach, Daniel Wai, during Coachella. Raquel, on the other hand, has checked herself into a mental health facility following the affair, although doubts have been voiced by both Peter Madrigal and Dayna Kathan.",
        "Earlier this week on Tuesday, Tom came to the defense of the model and expressed that she was definitely in a mental health facility, and not away at a lavish resort. 'Raquel is in a mental facility,' he adamantly stated to TMZ. 'No visitors. She's there, whether she decides to tell you where that is after the fact, that's where Raquel is.' 'No visitors. No friends. No family. No phones. No nothing,' and then called out both Peter and Dayna, stating that, 'These people have absolutely no idea what's going on.'The new episode of Bravo's hit show, Vanderpump Rules, is slated to air next week on Wednesday, May 3. The season is now available to stream exclusively on Hayu in the UK.  "
    ]
}