{
    "articleURL": "/wires/ap/article-12060663/North-Dakota-governor-signs-law-protecting-tribal-adoptions.html",
    "content": [
        "North Dakota's Republican Gov. Doug Burgum has signed a bill into law to protect tribal cultures by codifying the federal Indian Child Welfare Act into state law, Burgum's office announced Monday.",
        "The federal Indian Child Welfare Act, enacted in 1978, gives preference to Native American families in foster care and adoption proceedings of Native children.Also known by the acronym ICWA, it was created in response to the alarming rate at which Native American and Alaska Native children were taken from their homes by public and private agencies.Several other states - including Montana, Wyoming and Utah - have considered codifying the act this year, as the U.S. Supreme Court considers a challenge to the federal law.A handful of white families have claimed the law is based on race and is unconstitutional under the equal protection clause. They also said it puts the interests of tribes ahead of children. Lower courts have been split on the case.The outcome could undercut federal law. Tribes also fear more widespread impacts on the ability to govern themselves if the justices rule against them.",
        "Supporters of the law include Native American leaders who have long championed it as a way to preserve Native families and culture. Opponents include non-Native families who have tried to adopt American Indian children in emotional legal cases.Mike Nowatzki, a spokesperson for the governor, said the new state law ensures \"that these important protections for Native American children and families will remain in place in North Dakota regardless of what happens with the ICWA in the federal court system.\"",
        "___Trisha Ahmed is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Trisha Ahmed on Twitter: @TrishaAhmed15."
    ]
}