{
    "articleURL": "/sport/golf/article-12044245/Aussie-stars-LIV-shot-illness-revealed.html",
    "content": [
        "Health drama halted Jason Day's Masters progressExperienced vertigo at Augusta recently Day, 35, is in encouraging form on the PGA TourAlso knocked back an approach from LIV TourResurgent Aussie star Jason Day has taken a subtle dig at the no-cut aspect of LIV Golf as he revealed recurring bouts of vertigo hampered him in recent tournaments, including his horror final round at the Masters where it 'really kicked my butt'.",
        "Day has climbed from the depths of the world rankings, slumping outside the top 150 in 2022 back to 34, now the second-highest ranked Australian after five top-10 finishes in his eight events on the US PGA Tour this year.He knocked back an approach to join Greg Norman's LIV Golf League during his slump and declared he 'loves the cut' as an aspect of tournament golf, something the new tour has done away with to guarantee all 48 players at every event get paid.Day was responding to a question about the inclusion of several no-cut events by the PGA Tour this year as part of a direct response to LIV's emergence.'I like having the cut, too,' he said.",
        "'I think this year's worked out great with the cuts. I mean, we've had the best players in the world rise to the occasion multiple occasions now.'I look at it and I say if the best players are supposed to stick around for the weekend, we should play better, and I understand that.'Why do we need guaranteed pay? We have played golf our whole lives. I think the majority of the fans out there know that you come in, you play two days. 'If you don't play well, you're out, you don't get paid. That's just how our lives work.'",
        "Day flirted with contention at Augusta before a horror show final round in which he shot 80 and, ahead of his return at the Wells Fargo Championship this week, revealed he was hit by vertigo, which has impacted him before.Day, 35, said he was hit after finishing his weather-delayed third round and just before he headed out for his final 18 holes at the Masters, which forced him to take some time off, halting his golden run.'We had to finish our third round Sunday morning and then I was sitting in the caddie hut and that's when I got vertigo,' he said in North Carolina.'It's just hard because when you feel like you're running on all cylinders, you're making a lot of birdies, you're doing a lot of good things, it's difficult when sometimes [ill] health plays a factor.",
        "'So it's just one thing after another where I just kind of have to peel it back a little bit, kind of understand a little bit more, get a little bit better.'It really kicked my butt at Augusta. That was like kind of the time where I had to take a step back.'I just needed to take some time off, that was pretty much plain and simple. And then obviously on top of it just rework how I come to the golf course and work as well.",
        "'But I've had three weeks off and I feel like I'm getting a handle on it, which is good, so it will just take some time.'"
    ]
}