{
    "articleURL": "/tvshowbiz/article-12043927/Kevin-Costner-NOT-returning-Yellowstone-following-fifth-season.html",
    "content": [
        "READ MORE: Inside Yellowstone creator Taylor Sheridan's TWO luxury ranches - including $350M property that is twice the size of ChicagoKevin Costner is reportedly not returning to his hit Western series Yellowstone after five years starring on the show.",
        "Entertainment Tonight has reported the actor, 68, who has led the cast as patriarch John Dutton since 2018, will be departing the series after its current fifth season.Costner's future on the show has been under intense scrutiny amid an alleged rift with Taylor Sheridan, the co-creator of the show. The latest news comes just one day after it emerged Costner's wife of 18 years, Christine Baumgartner, 49, had filed for divorce.Her divorce filing on Monday reportedly 'completely blindsided' and devastated Costner, according to TMZ.Watch the complete series of Yellowstone available now, only on Stan.  ",
        "The second half of season five has yet to be finished, and no update has been provided on when the cast and crew are set to return to Montana to continue working on the remainder of the season, ET has reported. The uncertainty has led to lots of confusion and frustration, adds ET. A spinoff with Matthew McConaughey in the lead role is moving forward. Last month, Paramount president and CEO Chris McCarthy has said the new show starring McConaughey will go on, regardless of whether Costner decides to stay with the original series, according to The Hollywood Reporter. In April, DailyMail.com reported new details about Costner's rift with Yellowstone creator Taylor Sheridan.Sources claimed Sheridan developed a 'God complex' which left Costner reportedly frustrated with the development of the hit Paramount Network series.",
        "The outlet also claimed morale had been dwindling among the cast as they are not kept up to date on Costner's  negotiations with producers.'Kevin will forever be proud of and grateful for Yellowstone and the cast is like family to him,' the source said of Costner, who recently nabbed a Golden Globe Award for best actor for his portrayal of John Dutton.'He just felt like Yellowstone is headed in a direction that was not in line with their initial vision and he was met with criticism, including that he should just stick to acting.'Adding to the uncertainty around the series is the fact that a date has not been set for when filming will commence for the second half of the latest season, which could be disrupted by an impending writers strike after members of the Writers Guild of America voted to authorize a shutdown over pay issues.Last month, the New York Post reported that Costner's desire to cut down his workload on the fifth season to focus on other projects was also to blame for the tension between him and Sheridan.'It’s the same as with any show runner and big star — there’s respect, but there’s friction,' a source described as 'well-placed' within the production told the outlet.",
        "Costner is currently directing and starring in Horizon, a western film series consisting of four separate movies that will be released three months apart from each other.Each film is close to three hours long and after the quadruple release, Horizon is going to be broken into a series for television - each with 42-minute episodes.Another 'highly placed' Hollywood source told the outlet that some of the blame for the 'friction' on set lies with its creator.'Taylor is the star of his show. He’s the most important person on all of his shows,' they said.Deadline reported in February that Costner wanted to shoot for only a week on the second half of season five, after he had already shortened his work on the first half.",
        "The apparent reason was that the actor wanted to focus on his upcoming Western film franchise Horizon.But Costner's attorney Marty Singer shot back after the report and claimed to Puck News that it was an 'absolute lie' that his client would only shoot for a week.'As everyone who knows anything about Kevin is well aware, he is incredibly passionate about the show and has always gone way above and beyond to ensure its success,' he said at the time.Other inside sources have claimed that Sheridan's lack of preparation has caused major delays with the production of the show - with one suggesting that Costner had made himself readily available to shoot, only for the creator's own 'overburdened' schedule to get in the way.",
        "They added that Sheridan was 'overburdened' and 'nothing was ready' even after Costner 'made himself available.'They said that Costner was prepared to shoot the second half of the season sometime last year, as well as in January of this year, but there were allegedly no completed scripts to shoot at the time.'Kevin’s been extremely cooperative with working with Taylor and his production company, 101 Studios. They were supposed to shoot the second chapter of Season five late last year, but they just didn’t have the scripts,' a source told the Post.'Kevin had already committed to making his other movies. He had given the producers his schedule. There was nothing to shoot.'There have also been reports that Costner's beloved character John Dutton will be killed off in the back half of Yellowstone's current fifth season.It's unclear when production will begin on the new episodes for Yellowstone Season 5, or if those episodes will feature the death of John Dutton.Along with tensions with Sheridan, it was also reported last year that Costner's wife Baumgartner was fed up with her husband's demanding work schedule.'It's really knocked a hole in their family life,' a source told RadarOnline. 'The show is such a mega-hit, producers want it to go on forever!'",
        "It was further reported that Christine's patience was wearing thin which led to her posing an ultimatum to Costner.",
        "'However, Christine wants her husband to hang up his cowboy hat,' the source divulged.'She wants a firm commitment this is his last season — or he might have to hit the dusty trail!'News of their divorce broke on Tuesday. The split is said to be due to 'irreconcilable differences,' with Baumgartner asking for joint custody of their kids - Cayden, 15, Hayes, 14, and Grace, 12.Costner filed his response to the divorce on Tuesday, and he is also seeking joint custody of their children.The actor and Baumgartner, a model and fashion designer, started dating in 2000 and tied the knot at Costner's Aspen, Colorado ranch in 2004.'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' a statement from Costner's rep read.'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time,' the statement concluded.Baumgartner is not said to be filing for spousal support, with Costner's response filed by Laura Wasser.'Spousal support to be payable to petitioner pursuant to the terms of the parties' Premarital Agreement,' Wasser said, indicating there is a pre-nuptial agreement between Costner and Baumgartner.",
        "TMZ was the first to report the divorce news.According to TMZ, the prenup states Christine must vacate the actor's homes. Costner owns three homes but they do not own any residences together. Costner was previously married to Cindy Silva from 1978 to 1994 and they share three children - Annie, 39, Lily, 36, and Joe, 35.He also shares a son Liam Costner with Bridget Rooney, who he dated after his split with Silva.",
        "Kevin Costner's marriage to second wife Christine Baumgartner is coming to an end after 18 years and three children together.Baumgartner, 49, cited 'irreconcilable differences' as the reason for the shock split, which reportedly 'blindsided' the Yellowstone star, 68.And in wake of his latest failed union, DailyMail.com is taking a deep dive into the actor's colorful love life.",
        "First wife Cindy Silva",
        "In November 1994, Costner's then wife, Cindy Silva, filed for divorce after 16 years of marriage.'We have amicably resolved all issues regarding our children and financial affairs and a full marital settlement has been reached. We ask to be allowed the dignity of sorting through this more painful part of our lives in private,' a statement from the couple read in 1994. Costner and Silva met while they were both students at California State University - Fullerton.They would go on to have three children together.The pair split amid multiple reports that Costner had been having an affair with a celebrated hula dancer named Michele Amaral while he was filming his multi-million dollar flop Waterworld in Hawaii.Eventually, Silva was awarded around $80 million in the divorce settlement.In a 1995 interview, The Bodyguard star took responsibility for his role in the demise of his marriage, but did not go into detail.'A series of events conspired to happen at the same time. I know it hurt some people that I had failed in my marriage. And the marriage was my own failure,' he said.Costner said in a 1995 interview with Parade Magazine that he never even spoke to Amaral on the phone.He also listed off the other women he was supposedly linked to including Playboy model Angie Everheart and the daughter of casino magnate Steve Wynn.'It was hard on Cindy and our children. It didn't help things. The only thing it did was hurt. The collapse of my marriage was the hardest thing of all for me,' the Dances With Wolves star said.Costner went on to express his love for his first wife: 'You can put this on the record. Through all the pain, Cindy's been what I always thought she was a real lady. I still have love for Cindy.'Silva supported Costner when he was a struggling actor, taking on odd-jobs that included performing as Snow White at Disneyland.Short-lived fling Bridget Rooney",
        "Less than two years after his split from Silva, Costner had a son, Liam, with Bridget Rooney.She is heiress to the Pittsburgh Steelers, and the aunt of actresses Rooney and Kate Mara.In 1996 Rooney insisted that she was '110% sure who the father' of her child was. But Rooney still 'insisted on a paternity test' to prove paternity, according to a 2002 article from PEOPLE.That months-long affair is rumored to have cost the actor $7 million.Liam in now 27-years-old.'Mistress' Michele Amaral ",
        "Costner allegedly had an affair with a celebrated hula dancer named Michele Amaral while he was filming his multi-million dollar flop Waterworld in Hawaii. Amaral was also married as well as being a mother-of-two when she met Costner.A report at the time in the New York Daily News said that the pair met at the Mauna Lani hotel and shortly afterwards Amaral was 'spotted creeping out of his $4,500-a-day villa.According to a Departures Magazine feature, Amaral has taught hula across the world and is known as the island's premier soloist.The Daily News report said that Silva was alerted to the affair by someone who was working on Waterworld and was fired.The same article accused Costner of multiple infidelities during his marriage.At the time Costner strenuously denied the allegations saying that he was merely interviewing Amaral for a job.During an interview where Amaral was brought up, Costner became infuriated.'This woman has done nothing wrong and yet has had to share the harsh light of celebrity with me. I feel embarrassed, and I don't think there's one thing I can do to make her life better.''This woman has a name and to make her a thing is the worst part of all. It's wrong for her and her husband,' Costner said.Second wife Christine Baumgartner ",
        "Costner and second wife Baumgartner first began dating in 1998, having met around 1996 while Costner was filming his movie Tin Cup.The Bodyguard star said that at the time he first met her, he wasn't ready to fall in love again. Both are graduates of California State University - Fullerton. Baumgartner graduated with a degree in business. They married in 2004 in Aspen, Colorado, where Costner has long maintained a 160-acre ranch, known as The Dunbar. Rooms can be rented on the property for as much as $36,000 per night.The reason for the long courtship was because Costner was not sure if wanted more kids. The uncertainty even led them to break up for a period prior to their engagement.'Fear kept me from marrying Christine. [She] wanted a child, but I was afraid I couldn't be an effective father.''I woke up and thought, 'Am I going to lose a beautiful woman who is willing to be with me to my very last breath because I am afraid to say yes to a child?' That's all it took. Sometimes you learn the thing you're most afraid of will save your life,' he told Closer Weekly in 2018.Costner told the Daily Telegraph in 2011 that the reason for his four year hiatus from making movies was because of his new family.As a recently as 2020, Costner spoke glowingly about how the couple's relationship strengthened during the Covid-19 pandemic. He told People: 'Our partnership has really come into focus about what we do for each other and how we deal with our family.'",
        "In 2022, Radar Online reported that Costner was given an ultimatum from his wife. The report said that she was demanding that he quit his hit show Yellowstone due to the fact that he was gone from home so often.'The show is such a mega-hit, producers want it to go on forever! [Baumgartner] wants a firm commitment this is his last season — or he might have to!,' a source told the website.And on Tuesday, May 2, it was revealed that Baumgartner had filed for divorce after 18 years of marriage.A representative for the Yellowstone star asked for privacy  while saying that 'circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action' with Baumgartner.The couple share three children, 12, 14 and 15, and both have filed for joint custody.The family's primary residence was in Ventura, California, 30 miles south of Santa Barbara, where they also own an oceanfront mansion.The couple has a prenup, reports TMZ."
    ]
}