{
    "articleURL": "/wires/reuters/article-12039539/Well-fight-end-says-Odegaard-firing-Arsenal-top.html",
    "content": [
        "LONDON, May 2 (Reuters) - Arsenal will battle until the end for the Premier League title, their captain Martin Odegaard said on Tuesday after scoring twice in a 3-1 defeat of Chelsea that put the north London side back on top of the table for 24 hours at least.",
        "Three successive draws and a 4-1 drubbing at reigning champions Manchester City last week had seen Arsenal's hopes of a first title since 2004 evaporate.City topped the standings for the first time since February by beating Fulham on Sunday but Arsenal have returned to form by outclassing a struggling Chelsea side -- meaning they have gone undefeated in London derbies this season.Relentless City are two points behind the Gunners with two games in hand after eight straight league wins and will reclaim top spot if they beat visiting West Ham United on Wednesday.The manner of Arsenal's home win on Tuesday could sow some seeds of doubt into the heads of Pep Guardiola's City players and Odegaard remains confident the title race is not over.\"Especially the first half was brilliant. We came out and showed a different spirit to last time,\" the Norwegian, who produced two superb first-half finishes to take his league tally to 14 for the season, told Sky Sports.\"We have to fight and keep going. We believe and will fight until the end.\"Arsenal face third-placed Newcastle United away in their next league game, by which time they could be four points adrift if City beat West Ham and Leeds United at home.But manager Mikel Arteta said the important thing was that Arsenal had got their mojo back after a damaging April.",
        "\"We have four games to go and we are top of the league,\" he said. \"The first 60 minutes, I thought the team played really well.\"We need to be us, and that was everything I want to see from our team. Speed, quality, movement, two beautiful goals, we connected with our crowd and created an incredible atmosphere.\"The one negative was an injury to defender Gabriel who limped off near the end.\"He tried for 10 to fifteen minutes and he couldn't carry on. A big concern,\" said Arteta, who is already without Gabriel's fellow centre back William Saliba through injury. (Reporting by Martyn Herman; Editing by Ken Ferris)"
    ]
}