{
    "articleURL": "/tvshowbiz/article-12046209/Ed-Sheeran-recalls-hilarious-date-wife-Cherry-Seaborn.html",
    "content": [
        "Ed Sheeran has detailed his hilarious first date with his wife Cherry Seaborn after their romantic boat ride was swarmed by tourists.",
        "The couple offered rare insight into the early days of their relationship in the first episode of his Disney+ documentary, titled The Sum Of It All.In the opening episode, Ed and Cherry enjoyed a low-key date night by riding a rickshaw around Zurich, before reflecting on their first date.Ed and Cherry were friends at school and began dating after she went to university in the US.Cherry explained: 'We went boating in Central Park on that lake but it was the busiest. hottest day of the year so we were rowing out.",
        "Ed then added: 'We rowed out into the middle of the lake, and the boats just started surrounding us, all of these tourists.'Cherry admitted that the boats began 'rowing after them.'Then Ed added: 'And then Chez goes ''do you want me to row?'' and I said ''Cherry the last thing is a picture of you rowing me!''Reflecting on their romance, Cherry added: 'We were friends at school, so he's in the year above, always got on.'We had I guess flirted with the idea of flirting, does that make sense?'Ed added: 'We did have a little smooch at that time, and she basically went to university in America and I went on tour and we didn't see each other for a few years.'  ",
        "'I always wanted to go to university in the states, I WAS PLAYING field hockey and an offer to work i ntech and finance in New York,' Cherry continued.Ed went onto say: 'We bumped into each other again, and me and Chez started dating. It just felt natural, it just felt right.'",
        "Ed and Cherry married in 2019, and are now parents to daughters Lyra, two, and Jupiter, 11 months.In the moving documentary, Ed also tearfully reflected on his wife's cancer diagnosis in 2022, while she was pregnant with their second child.Doctors discovered Cherry, 30, had a tumour in her arm in February last year while she was six months pregnant with their second child, daughter Jupiter. In his Disney+ documentary, The Sum Of It All, the couple recalled their 'horrible' start to 2022 which saw Cherry battle cancer, Ed's best friend Jamal Edwards die suddenly and a court case launched over his song Shape Of You, where Ed was accused of plagiarising and which he later won. 'I got diagnosed with cancer at the start of the year, which was a massive s*****r,' Cherry said of why she said yes to letting the cameras into their notoriously private life.  'But it made me massively reflect on our mortality. We're all human. I was saying to Ed I would have never agreed to do anything like this but it made me think, this whole year \"If I die, what's people's perception of me? What do you leave behind?\". ",
        "'For Ed he wants to say \"I'm not just this music machine, a robot trying to get number ones. I'm a father. I'm a son, husband, friend\". And I've massively reflected. It wasn't until this year where I thought \"I might die\". It was horrible.'When Cherry first sought medical help, she was initially told by a doctor 'this is really bad' and that she had cancer.The mother-of-two immediately rang Ed telling him to cancel all of his plans, while they waited an agonizing month long wait for the full report. But Cherry, who was six months pregnant at the time, was told there were no treatment plans that would work with her pregnancy. After a sequencing test was done on the tumour, the couple found it was much less severe than what was thought originally and surgery could be done after she had given birth to Jupiter. Cherry said: 'It was the most incredible news. I nearly threw up when the surgeon told us we could wait to the end of the pregnancy to get the tumour out. 'We didn't have to worry about delivering the baby early.' But the couple faced the most devastating blow, when a day later, Ed's best friend Jamal died suddenly aged 31. 'I was hit by heavy stuff one after the other. They found a tumour in Cherry's arm. The diagnosis wasn't good,' Ed said. ",
        "'She was pregnant and they can't do anything. Then suddenly I'm in this three week court case. Then Jamal dies. 'The moment you find out that the worst thing in the world has happened to someone you truly love with all your heart, you feel like you're drowning and can't get out from under it. ",
        "'I remember being sat in this specialists waiting room thinking the worst was going to happen. I'm worried about Cherry. 'The unborn daughter, that's in her. You start writing a song and you vent a little bit and that's why songs get written.' His wife Cherry also admitted that Ed hadn't 'processed' Jamal's loss adding: 'The difficult thing about grief is everyone rallies around you at the start, six months down the line that wears off. 'Everything's been so busy and there's an attitude, especially in Brtian, of carrying on. I'm in a much better place from a processing perspective. I don't think Ed is there yet. 'There's no way he had time to process and be at peace with things. He's been too busy. He needs to stop. He needs to process, he hasn't processed at all.'"
    ]
}