{
    "articleURL": "/tvshowbiz/article-12057959/David-Victoria-Beckham-enjoy-Coronation-celebrations-Guy-Ritchie-wife-Jacqui.html",
    "content": [
        "David and Victoria Beckham enjoyed Coronation celebrations with Guy Ritchie and his wife Jacqui over the bank holiday weekend.",
        "The former footballer, 48, and the fashion designer, 49, joined director Guy, 54, and Jacqui, 41, as they all let their hair down.The Beckhams took to their Instagram Stories to share a glimpse at the fun as they sipped on fizz and indulged with some scones.In one snap David looked smart in a navy suit jacket and chinos as he sat beside Guy while they relaxed with drinks.He captioned the snap: 'Celebrating in style' along with a crown emoji before showing off the delicious food they had including trifle and cakes.",
        "Meanwhile on Victoria's social media she posed with a glamorous Jacqui outdoors as Union Jack bunting was seen behind them.She penned: 'Love you poo!!! Amazing weekend celebrating with friends! Kisses!'It comes after Victoria flaunted her long legs in a glamorous new photoshoot for her beauty range in Miami on Sunday. The former Spice Girl slipped into a plunging blazer dress with a pair of fishnet stockings in the snaps at Soho Beach House. Relaxing by the pool, she kicked back on a striped sun lounger against a backdrop of pastel coloured umbrellas. Victoria pulled her brunette hair back into a sleek plait and sipped on a cup of tea in the fun art deco themed snaps. To complete her chic all-black ensemble Victoria added a pair of towering heels and shielded her eyes with some large sunglasses.",
        "After launching her self-titled beauty brand in 2019, Posh has won critics over with her smudgy Satin Kajal eyeliner, which at £26 has been selling strongly in most colours and is on its way to attaining cult status. ",
        "It came after David and Victoria led the stars sending their well wishes to King Charles and Queen Camilla following their their historic Coronation on Saturday.The former Spice Girl took to her Instagram following the London ceremony to share a throwback snap of herself meeting his Royal Highness.Posing in pictures from her pop star days, Victoria penned: 'From then to now! I have so many fond memories of meeting His Majesty throughout my career, and he is always so supportive and kind'. She continued: 'Today is a truly historic day and I’m incredibly humbled to celebrate King Charles III and Queen Camilla as they embark on their new roles. Meanwhile husband David, 48, posted his own tribute to the Royal declaring the coronation a day out 'country comes together'.He wrote: 'Today our country comes together to celebrate the coronation of Their Majesties King Charles III and Queen Camilla'.",
        "Later taking to his Instagram Stories, the former footballer shared a slew of snaps from the big day and said 'London is looking incredible'.Following in his famous parents' footsteps, Brooklyn Beckham also took to social media all the way from LA.",
        "He wrote: 'A historic day celebrating the coronation service of King Charles III and Queen Camilla, sending my best wishes xx'.His younger brother Romeo, 20, also took to his Instagram Stories to write 'God Save the King' and share his father David's post. "
    ]
}