{
    "articleURL": "/wires/aap/article-12058513/Magpie-fans-decried-booing-Swans-great-Franklin.html",
    "content": [
        "Sydney have expressed fears some spectators are failing to learn from the past as the Swans, Collingwood and the AFL all criticised Magpies fans who booed Lance Franklin.",
        "Clearly referring to the booing that drove fellow Swans indigenous great Adam Goodes out of the game, Sydney said the treatment of Franklin during Sunday's AFL match was offensive.Collingwood coach Craig McRae, captain Darcy Moore and chief executive Craig Kelly put their names to an apology, calling Franklin a great of the game.The AFL joined the two clubs in issuing statements on Monday afternoon - a sharp contrast to their delay before making any official comment about the booing of Goodes at the end of his stellar playing career.\"Sydney are extremely disappointed by the repeated booing of Lance Franklin in Sunday's match ... (he) is a champion and his contribution to the AFL should be celebrated and respected,\" the Swans said in a statement.\"Fans are the lifeblood of our game and have the right to cheer loudly at the football.\"But booing isn't a right - it's offensive - and players should not be subjected to it in their workplace.\"We have been here before and sadly it seems some people have not learned from the past.\"The Collingwood leaders said while they loved their fans and regarded them as the team's \"19th player\", the booing of Franklin showed a lack of respect.\"We hope the next time we get the chance to witness a champion of the game we treat them with respect, the same respect we ask for when it comes to our players and our champions,\" they said.",
        "AFL chief executive Gillon McLachlan called Franklin a \"generational athlete\" and also referred to Port Adelaide young gun Jason Horne-Francis, who has been booed by opposition fans this season.\"All players have the right to be treated respectfully on-field,\" McLachlan said.\"We want everyone to go to a game and express themselves, the passion for the contest and the voice of the crowd is what sets our competition apart, however we don't accept excessive booing as part of our game.\"Port coach Ken Hinkley angrily defended Horne-Francis and slammed the booing of him in a match last month.\"We don't accept excessive booing as part of our game,\" McLachlan said.\"Jason Horne-Francis is an emerging star of our game, Lance Franklin is an all-time great. Our view applies equally to both. In fact, no player should be targeted in that way.\"Sydney coach John Longmire and McRae separately criticised the booing immediately after Sunday's game.Magpies great Nathan Buckley told SEN on Monday that the booing was, at worst, \"ignorance and bigotry\".Swans chief executive Tom Harley backed Longmire, who questioned why anyone would boo Franklin - a likely Australian football Hall Of Fame legend once he retires - and the Swans boss added it was \"really boorish\".He said the booing appeared to come from a minority and other fans needed to influence the poor behaviour.",
        "Harley was asked about Swans fans booing Collingwood young gun Jack Ginnivan last year during a game.\"I don't think it's a great side of the game,\" he said.He also noted the booing of Franklin did not appear related to anything specific that happened during Sunday's match.The booing of Goodes marred the end of his glittering career and he has stayed away from the game since retirement, rejecting induction to the Australian football Hall Of Fame.Geelong star Tom Stewart had a different perspective on the issue, saying on Monday he expects \"a lot of noise\" from Richmond fans during Friday night's match at the MCG.It will be the first time the two teams have played since Stewart was banned for four matches last June after his heavy hit poleaxed Tigers onballer Dion Prestia.\"They're probably, fair enough, allowed to boo me. I probably deserve it, in this respect,\" he said."
    ]
}