{
    "articleURL": "/wires/reuters/article-12054979/Soccer-Dimarco-Lukaku-strike-Inter-grab-2-0-win-Roma.html",
    "content": [
        "May 6 (Reuters) - Midfielder Federico Dimarco and striker Romelu Lukaku were both on target as Inter Milan secured a 2-0 victory at AS Roma in Serie A on Saturday, their fifth consecutive win in all competitions.",
        "Inter bounced back to fourth in the table on 63 points, two ahead of fifth-placed AC Milan who secured a 2-0 home win over Lazio earlier on Saturday. The Milan sides meet in the Champions League semi-final first leg on Wednesday.Inter coach Simone Inzaghi stressed that a fit squad was behind their recent return to winning ways.\"Now I have the opportunity to rotate in midfield and in attack, which I couldn't do before,\" he told DAZN.\"I have a few little problems with defenders, which I hope to solve. (But) I can choose, until January I couldn't.\"Against Roma Inzaghi rested Lautaro Martinez and Edin Dzeko from the starting line-up ahead of Wednesday's clash, and strikers Joaquin Correa and Lukaku returned up front in their place.Both teams started cautiously and a dull first half at Stadio Olimpico sprung to life after the half-hour mark when Inter defender Denzel Dumfries squared the ball inside Roma's six-yard box for Dimarco to tap it in from a tight angle.The defensive Roma side needed to change their approach following the break and Nicola Zalewski took a shot at Andre Onana's goal early in the second half but his attempt lacked power to surprise the goalkeeper.Roma defender Roger Ibanez followed shortly after with a much more powerful strike, which flew narrowly over the bar.",
        "But an error by Roma's defence then gifted the ball to Inter substitute Martinez, who slipped it to Lukaku and the Belgium striker sealed the win in the 74th minute with a low strike from the edge of the box.\"I'm happy with the team's game, we're growing to reach a top level,\" Lukaku said. \"Everyone sees our team's will to win. Today we showed our maturity.\"Roma, whose push for a top-four finish was further dented after their mid-week 1-1 draw at Monza, extended their winless league streak to four games.\"Today we played against the strongest team in Italy, with four-five dead tired players because they play all the time, and with injured people like (Paulo) Dybala or (Andrea) Belotti,\" coach Jose Mourinho said.Mourinho's side remain seventh in the standings on 58 points, level with sixth-placed Atalanta who host Juventus on Sunday.They take on Bayer Leverkusen in the first leg of their Europa League semi-final on Thursday before they travel to Bologna in the league on May 14. (Reporting by Anita Kobylinska in Gdansk Editing by Toby Davis and Pritha Sarkar)"
    ]
}