{
    "articleURL": "/news/article-12059965/Turn-Afghanistan-withdrawal-memo-sue-Republicans-warn-Blinken.html",
    "content": [
        "McCaul is specifically seeking a classified dissenting cable that U.S. State Department employees sent prior to the Taliban's takeover of KabulThe cable warned about a 'deteriorating security situation' and urged the immediate evacuation of alliesHouse Foreign Affairs Committee Chairman Michael McCaul is threatening to hold Secretary of State Antony Blinken in contempt of Congress if he doesn't hand over a key document related to the August 2021 Afghanistan withdrawal by Thursday, as oversight by Republicans into the deadly exit ramps up.",
        "In August 2021, 13 U.S. service members and 170 others were killed near the Hamid Karzai International Airport after a suicide bomber detonated an explosive. Additionally, thousands of U.S. citizens and allies of the United States who were unable to quickly evacuate were left stranded in the country after the Taliban quickly took over the capital of Kabul. The committee led by McCaul is investigating the Biden administration's role in the deadly withdrawal, which he has previously called a 'stunning failure' of leadership. McCaul is specifically seeking a classified dissenting cable that U.S. State Department employees sent prior to the Taliban's takeover on July 13, 2021. The cable warned about a 'deteriorating' security situation' and urged the immediate evacuation of allies, a warning that the Biden administration did not heed, say Republicans.In a letter to Blinken Friday, obtained by DailyMail.com, McCaul, R-Texas, writes that as part of the committee's investigation, Blinken must hand over the cable in its entirety by May 11 or legal proceedings will be immediately started against him. His request comes after a subpoena was issued to Blinken on March 28 requesting the 'dissent cable' along with other documents and Biden administration communications on the withdrawal.",
        "The department provided an April 27 classified briefing, which Republicans on the committee have said did not fulfill the many demands they outlined.",
        "A State Department spokesperson slammed the move by McCaul in a statement. 'It's unfortunate that despite having received a classified briefing on the dissent channel cable as well as a written summary that the House Foreign Affairs Committee continues to pursue this unnecessary and unproductive action,' spokesperson Vedant Patel said.'Nevertheless, we will continue to respond to appropriate oversight inquiries and provide Congress the information it needs to do its job while protecting the ability of State Department employees to do theirs,' Patel continued in a statement.However, McCaul writes in the letter that the information turned over to the committee from the State Department has been 'insufficient.''The Department provided the Committee a roughly one-page summary of the dissent cable as well as a summary of the Department's official response that was just under one page in length,' says McCaul. 'The Department has confirmed that the original dissent cable totaled four pages in length, meaning that the summary represented a 75% reduction of the original cable.' As a result, the agency is 'now in violation of its legal obligation to produce these documents and must do so immediately.'He gave a May 11 6:00 p.m. ET deadline for Blinken to comply or else the committee will move forward with contempt of Congress proceedings, he writes. ",
        "'As noted above, should the Department fail to comply with its legal obligation, the Committee is prepared to take the necessary steps to enforce its subpoena, including holding you in contempt of Congress and/or initiating a civil enforcement proceeding.' If Blinken is held in contempt of Congress, President Biden's Department of Justice would have the option to move forward with legal proceedings. It is unlikely that the DOJ would take action against Blinken, as the department has declined to prosecute other cabinet-level secretaries that have similarly been held in contempt - including Trump-era Attorney General Bill Barr Obama-era Attorney General Eric Holder. ",
        "McCaul has pushed back the deadline for Blinken to comply with the subpoena multiple times.The first deadline was April 1, then April 21, May 1 and now May 11 following discussions with the State Department.The chairman also accused the Biden administration of 'misleading the public' with the release of several 'summarizing' documents related to the withdrawal. 'On April 6, the Biden Administration released a 12-page document which it represented as an unclassified 'summary' of the Administration's after-action reviews of the Afghanistan withdrawal and took questions on the subject from the media in a press briefing. This summary, however, misrepresented the conclusions contained in the source material it purported to summarize,' the letter states.",
        "'As the Committee detailed in an April 25 letter, the Department's classified After- Action Review specifically contradicted inaccurate and misleading assertions in the White House summary and press briefing that there was not 'chaos' during the emergency evacuation at Kabul's Hamid Karzai International Airport and that the Administration did not bear significant responsibility for the failures of the withdrawal.''Accordingly, the Committee has reason to be highly skeptical of summary documents prepared by the Administration, especially where it does not have access to the original source material to perform an independent verification.'"
    ]
}