{
    "articleURL": "/news/article-12042511/M-S-security-guard-killed-shoplifter-knockout-blow-said-frustrated-court-hears.html",
    "content": [
        "Sabeur Trabelsi, 44, is standing trial accused of the manslaughter of Jason Page A Marks and Spencer security guard accused of killing a 'shoplifter' with 'a knock-out blow' told police in interviews 'I was frustrated, I know I shouldn't have done it,' a court has heard. ",
        "Sabeur Trabelsi, 44, had been hired to work at the supermarket in Lower Earley, near Reading, Berks., after a spate of thefts of expensive meat and alcohol.On his last day on the job on March 31 last year and 30 minutes before the shop was due to shut, the guard chased Jason Page and his accomplice, Oswold Walker, out of the shop after they were seen on CCTV 'brazenly' filling up a bag with expensive meat and grabbing a box of Moretti beer on their way out.The jury at Reading Crown Court heard that Trabelsi carried on chasing Mr Page towards the nearby BP garage on Chalfont Way and Elliot Cripps, the M&amp;S store manager, followed behind in an attempt to grab back the bag of meat.CCTV played to the jurors showed Mr Page being wrestled to the ground as Cripps manages to get the meat back from him. When Mr Page got back on his feet, Trabelsi delivered a 'knock out blow', causing him to fall backwards and crash onto the pavement. He died a short time after from his injuries.",
        "For the past three weeks, the jury has heard the case of father-of-three Trabelsi who is standing trial accused of manslaughter.A jury of eight men and four women retired this afternoon to consider verdicts.",
        "Prosecutor Charles Ward-Jackson, in his summing-up speech reminded the jury of Trabelsi's statement to the police and submitted that, along with the evidence, it showed the Marks and Spencer employee was guilty.In evidence Trabelsi told jurors that 51-year-old Mr Page had threatened to stab him with a needle when he landed the punch, which he also argued was instead a slap.Both Trabelsi, from Reading, and Cripps, of Taunton, Somerset, are also accused of perverting the course of justice and lying to the police about what happened next, saying that Mr Page fell over because he was so drunk.Summing up the prosecution case, Mr Ward-Jackson told jurors that in one of his three police interviews Trabelsi told the investigators: 'Obviously I got frustrated by the way he was talking. I know I shouldn't have done it.'Mr Ward-Jackson said: 'He had pent-up anger. He was angry and wound up, or to use his words - frustrated. 'This was a rare moment where he reveals the reason he did it, which is anger or frustration and if that is right, this is not a case of self-defence but a blow committed on the spur of the moment aimed in anger.'Therefore, the prosecution say he is guilty of manslaughter.'",
        "However, Trabelsi's counsel, Felicia Davey, told jurors: 'Was it necessary for Trabelsi to defend himself? On the evidence we submit how could there be any other conclusion other than 'yes it was.'",
        "'We go on to consider the second stage - was what he did reasonable? Knowing that tragically it is the head hitting the floor that does the damage and knowing that tragically Mr Page would have hit the floor much harder and faster than usual [because he had alcohol in his system. Again we say how could there be any other conclusion than' yes.''We say that the fact he didn't mention the slap to the police was not for any bad reason - certainly not to pervert the course of justice.'In regards to Cripps, his lawyer Nadia Chbat: said: 'The prosecution will tell you that he is deceitful and deliberately lied to the police. The prosecution have to make sure that they convince you he is guilty.'He is one of the good guys.'She went on to explain that on January 25 at around 7.30pm at the Marks and Spencer store, only months before this incident, a security guard was stabbed in the hand with a needle by shoplifters who were trying to make a getaway with a case of wine.She added: 'He left [the shop] to back up his security. He was worried for him. There was nothing that he did that was unlawful. In fact what he did was help Mr Page when he was bleeding. He did not walk away and leave him. He would never leave a man bleeding on the ground, why? Because he is a trustworthy person.",
        "'Not because he is a malicious person that would lie to the police. He got Mr Page off the road, he was trying to keep him safe. This man called 999, this man called the ambulance. Without Mr Cripps there may not have been an ambulance or police for many, many minutes.'Mr Cripps did the best he could, not because he was trying to cover up anything. You have to be sure that the explanation was to mislead the police investigation.'Judge Amjad Nawaz added: 'Mr Page sadly was using drugs and engaging in thieving. However, everybody must be treated according to the law.'The prosecution says he was subjected to violence by Mr Trabelsi and that it was unlawful and there was no lawful justification and he was not acting in self-defence.'The jury retired at lunchtime to consider its verdicts."
    ]
}