{
    "articleURL": "/news/article-12060571/Female-Chicago-cop-24-killed-lawn-returned-work.html",
    "content": [
        "Four people, two male and two female, have been arrested over the shooting Officer Areanah Preston, 24, was found dead on her front lawn on SaturdayA female police officer was killed on her front lawn as she was returning home from work in Avalon Park, Chicago.  ",
        "Officer Areanah Preston, 24, was found dead in front of her home on 81st Street and Blackstone Avenue as she came home from work at 1.42am on Saturday morning. She died from multiple gunshot wounds and her death is officially being considered a in-the-line-of-duty killing, a CPD spokesperson said Monday.Four people, two males and two females, have been arrested over the fatal shooting. They were taken into custody after a SWAT standoff Sunday night.It's believed that some, or all, of the suspects are juveniles.",
        "Police have not released the names of any of the people arrested after the standoff or said if and how they were involved in the officer's killing.  Speaking about how Preston's body was found, Interim Police Supt. Eric Carter said: 'The officer picked her up, put her in the back of his car, and immediately brought her to U of C hospital where she succumbed to her injuries early this morning.'",
        "Preston was a three-year veteran of the Chicago Police Department. The Fraternal Order of Police, the officer's union, stated online that she was killed while defending herself against armed robbers. They wrote: 'Though off-duty Officer Areanah Preston was killed while trying to defend herself from armed individuals in an apparent robbery, she died taking police action.' Police officials have not confirmed the details of what led to her murder.  ",
        "Preston's family and friends have paid tribute to the officer. Her father, Allen Preston, told the Chicago Sun-Times: 'She was trying to make a change on this Earth.' Preston, who lives in Los Angeles, described his daughter as a 'beautiful soul' who 'always saw the best in people.''This was my baby. Everything I did was for her,' he said. 'I don´t know what to do, right now. I´ll be dealing with this for the rest of my life.'",
        "Late Saturday morning, more than a dozen family members gathered outside Areanah Preston´s home.'She was a definite role model with a career path that just didn´t stop,' said her aunt, Sonia Rawsk.Another aunt of Preston's, Norma Mhoon, said in a Facebook video: 'It weakens me to even think that she's gone.'Mhoon said: 'She's a very good sweetheart. A very nice person: educated, intelligent in every way, striving for her master's, her goals and everything. She was just doing such a great job. And this happened to her. It's unbelievable.'Areanah Preston earned a bachelor´s degree in criminal justice and law enforcement administration from Illinois State University.Professor Charles Bell told the Sun-Times that she was 'very passionate about making a difference and showing young people that policing is a profession that can make a difference in the community.'",
        "'She was very aware of a lot of the problems that in her opinion had manifested in the Chicago community,' Bell added. 'She was a reformer. She saw a problem and she was dedicated to making a difference.'"
    ]
}