{
    "articleURL": "/home/books/article-12048599/WHAT-BOOK-writer-Rachel-Joyce-dessert-island.html",
    "content": [
        "Rachel revealed that she would take Mary Oliver’s Devotions to a desert islandREAD MORE:  WHAT BOOK would Booker prize winner 2022 Shehan Karunatilaka take to a desert island. . . are you reading now?",
        "I’m reading two books, not because I am clever but because one is fiction and one is more of a memoir. Letters To Gwen John is a powerfully honest series of ‘letters’ written by Celia Paul to an artist she never knew but feels linked to.Her voice is deceptively plain and her insights about her own art, as well as the choices she had to make as a woman, are both illuminating and full of courage. It’s also a beautiful book: the pages are thick and the paintings exquisite.Meanwhile, my fiction book is Here Again Now by Okechukwu Nzelu, an exploration of relationships and grief written in glorious tender prose.It’s about the love that finds no voice — and it’s exceptionally poignant on the complexity of the relationship between fathers and sons, especially when they are divided not just by age but also by culture, too.For all that, it’s the attempts of its protagonists to bridge those gaps that make it unique and ultimately hopeful.",
        ". . . would you take to a desert island?I would probably take something really hefty like Mary Oliver’s collection of poems, Devotions. I would learn poetry by heart and eat berries and finally let my hair go grey.Oliver’s observations about the natural world and our connection to all living things would be the best company on the island. And if needs be, I could always sit on the book occasionally. I am sure she wouldn’t mind.",
        ". . . first gave you the reading bug?As a child, I lapped up books. I was lucky. They really spoke to me and I still remember the joy of discovering I could read all by myself — it was my first taste of real independence.",
        "I loved the children’s classics like Noel Streatfeild, who wrote Ballet Shoes — though sadly I was never a ballerina.But it was when I found Jane Austen that the world turned upside down. I had no idea a world could spring so completely out of a book that my own life got somehow parked around the corner.I was no longer a girl in jeans and a top, but marching across fields in a rain-spattered frock and bonnet, determined to change the world.. . . left you cold?Okay, I am going to be frank. I generally try not to give up on books — partly out of respect but also out of curiosity, wondering how the writer is going to tie things up. (Especially if they strike me as far-fetched.)But earlier this year I decided to go back to school and relearn Latin. I even invested in my old text book. It is not going well. Despite my best intentions, I have not got beyond Chapter 2, Metella est in atrio.",
        "Rachel Joyce is judging the 2023 Women’s Prize For Fiction. The shortlist was announced last month and the winner will be revealed on June 14."
    ]
}