{
    "articleURL": "/sport/football/article-12052653/Ryan-Mason-fires-Jurgen-Klopp-Liverpool-boss-said-Tottenham-coul-dn.html",
    "content": [
        "Jurgen Klopp said that Tottenham 'have to play better football' after recent winTempers ran high after a fiercely contested 4-3 at Anfield last Sunday Ryan Mason insisted he would never tell another club how to go about things Tottenham interim boss Ryan Mason has hit back at Jurgen Klopp and insisted he would never tell another club how to play.",
        "Klopp was critical of Spurs' tactics after last weekend's dramatic 4-3 win at Anfield and told Mason to 'worry about other stuff' following his frustration with Diogo Jota still being on the pitch to score the winner.The Liverpool manager insisted Tottenham 'have to play better football' and 'can't just counter-attack' which frustration the 31-year-old in caretaker charge.Mason, speaking ahead of Saturday's visit of Crystal Palace, said: \"First of all I respect and admire Jurgen Klopp. I also respect Liverpool Football Club.'But honestly in my current situation now and regardless of what happens in my coaching career, I don't believe I will ever be in a position where I can sit here and criticise another football club in the way they are doing things.",
        "'Look, I will not create a war of words. That is my opinion on it. I don't think it will change in 20 years time.'I don't think I will ever be in that position or earn the right to criticise another football club for how they want to try and win the game and how they feel is the best chance for them to win the game in that moment in time.'Mason went on to reveal Oliver Skipp had been inches away from a serious eye problem after Jota caught him in the head with a high tackle at Anfield.",
        "'Skippy is a very, very lucky boy,' the former Tottenham midfielder added.",
        "'He had a couple of gashes in his head, needed near to 10 stitches and we are talking about a couple of inches away from an eye problem.'I think the overall feeling this week is we are quite grateful Skippy is okay and nothing too serious.'Spurs captain Hugo Lloris will not play again this season due to a thigh injury. Mason said: 'Hugo's out for the season. We kind of feared that initially.'We did some more tests and he won't play for us again this season.'"
    ]
}