{
    "articleURL": "/wires/reuters/article-12049063/Former-Texas-star-Lance-Blanks-dies-56.html",
    "content": [
        "Former Texas star guard Lance Blanks, who also served as general manager of the Phoenix Suns, has died. He was 56.",
        "According to the NBA, Blanks died Wednesday in Dallas. No cause of death was revealed.Blanks was a scout for the Los Angeles Clippers and was on assignment at the time of his death.\"Lance was a light for all those who knew him,\" said NBA executive vice president Joe Dumars, who was teammates with Blanks on the Detroit Pistons in the early 1990s. \"It's been a privilege to have called him one of my closest friends. I'm eternally grateful for all the support he has shown me throughout the years.\"His legacy will be carried on, not only by his family, but by all those whose lives he touched for the better. You will be dearly missed, brother.\"Blanks began his college career at Virginia in 1985 and later transferred to Texas, where he had back-to-back big seasons. His 1,322 points are the most in program history for a two-year player.Blanks averaged 19.7 points, 5.6 rebounds, 4.3 assists and 3.3 steals in the 1988-89 season.The next season, he averaged 20.3 points, 4.3 rebounds, 3.0 assists and 2.7 steals while helping the Longhorns reach the Elite Eight of the NCAA Tournament. Texas was eliminated by Arkansas.Blanks made 78 3-point baskets in each of those seasons.Blanks was inducted into the Texas Longhorns Hall of Honor in 2007.",
        "Blanks was a first-round pick (26th overall) in the 1990 draft by the Pistons. But he didn't have the same success in the NBA, averaging 2.0 points and 0.8 assists in 142 career games (two starts) with the Pistons (1990-92) and Minnesota Timberwolves (1993).In his post-playing career, Blanks worked in the front offices of the San Antonio Spurs and Cleveland Cavaliers before becoming general manager of the Suns in 2010. He was fired after three seasons with Phoenix finishing last in the Western Conference with a 25-57 record in 2012-13, his final campaign.--Field Level Media"
    ]
}