{
    "articleURL": "/news/article-12039011/Father-Oklahoma-teen-dead-six-didnt-know-sex-offenders-conviction.html",
    "content": [
        "Brittany Brewer, 16, and her friend Ivy Webster, 14, were among the deceased along with convicted sex offender, Jesse McFadden The names and ages of the other four victims have not yet been disclosed Brittany's father, Nathan Brewer said he had no idea that McFadden had a criminal history The devastated father of a 16-year-old Oklahoma beauty queen found dead with six other people, including a sex offender, had no idea that he had a criminal history.",
        "Nathan Brewer called his daughter, Brittany Brewer, his 'right hand side kick,' and was heartbroken when he found out on Monday that his child and her friend Ivy Webster, 14, were killed. 'She was my right hand person and now she is gone,' the heartbroken father told The Oklahoman. 'It's just a parent's worse nightmare and I'm living it.' Six other people were also found dead, including pedophile Jesse McFadden, 39, a convicted sex offender. The names or ages of the other victims have not officially been disclosed.Earlier in the day, an endangered missing advisory was issued by officials for both girls. The alert indicated that the authorities believed that the two teens were with McFadden. It wasn't until hours later that officials from the Okmulgee County Sheriff's office made the grim discovery.Officials discovered seven bodies on the property around 3 pm at 14600 Holly Road in the rural town of Henryetta, Interim PIO Gerald Davidson Oklahoma State Bureau of Investigations told DailyMail.com.",
        "The Oklahoma Medical Examiner's office did not respond to DailyMail.com's request for comment and to find out the other victims identities and their manner and cause of death.But according to a relative, the other four victims were all found shot to death. Janette Mayo, 59, said the Okmulgee County Sheriff’s Office informed her that the other four victims were her daughter, Holly Guess, 35, and her grandchildren, Rylee Elizabeth Allen, 17, Michael James Mayo, 15, and Tiffany Dore Guess, 13, reports NYP. ",
        "McFadden, who was listed on the state's sex offender registry, was supposed to be in court Monday on child porn charges and that he had been convicted of sex crimes, as per online records, WWMT News reported.The Oklahoma Department of Corrections prison records show McFadden was convicted of first-degree rape in 2003 and released in October 2020, the news outlet said.The Okmulgee County Sheriff's Office said in a news release that deputies took a missing person report for Webster Monday morning.Both women were reportedly seen traveling with McFadden before they disappeared.",
        "Brittany's father said that his daughter had spent the weekend with the McFadden's family several times before.He told News On 6 that his daughter was selected to be Miss Henryetta at the [National American Miss pageant] in Tulsa and represent her town this summer. 'And now she ain't gonna make it because she's dead, she's gone,' the grief-stricken father said.He said during a vigil that he was held on Monday that his daughter had dreams of becoming a veterinarian or a teacher.He added: 'I am just lost.'  "
    ]
}