{
    "articleURL": "/wires/ap/article-12040437/History-civics-scores-US-students-dipped-amid-pandemic.html",
    "content": [
        "Test scores in history and civics have declined slightly for eighth grade students in the U.S., according to results that show an increasing number of children lack a basic understanding of either subject.",
        "The scores were released Wednesday by the National Assessment of Educational Progress. The same assessment reported in October that every single state had seen a decline in math or reading scores amid the COVID-19 pandemic. The latest scores, officials said, reflect more of the impact of the disruptions from the virus that shuttered schools across the country.At a time of some pessimism about the state of the U.S. democracy, the test results suggest many young people are struggling to understand how government works and the importance of civic participation. Nearly one-third of eighth grade students cannot describe the structure or function of government, according to the results.Many U.S. schools aren't doing enough to reverse the trend, history and civics educators say.About 68% of eighth graders said they are taking classes mainly focused on U.S. history. That´s compared with 72% of students in 2018. And only about half of eighth graders report taking a class mainly focused on civics and or government, which remains mostly unchanged compared to 2018, according to the report.\"We´re not putting a value there, and we´re not saying this is something that they really need to be active, informed and engaged in as they grow,\" said Kerry Sautner, chief learning officer at the National Constitution Center, a nonprofit organization in Pennsylvania.",
        "The CivXNow Coalition, a civics education advocacy group, reported last year that 38 states require a stand-alone civics course to graduate high school and only seven states require civics in middle school.Patrick Kelly, a government teacher in South Carolina, said he has seen a growing emphasis on ensuring students are doing well in reading and math, and rightfully so.\"But every minute that you redirect to one place, it´s got to come from somewhere else. And so if literacy interventions don´t have a connection to social studies, then we lose ground in social studies instruction,\" he said.The National Assessment of Educational Progress - known as the \"nation´s report card\" - tested about 7,800 students across the country in civics, and 8,000 students in U.S. history between January and March 2022. The test had last been given in 2018.On a point scale of 0 to 500, the average U.S. history score dropped 5 points to 258, continuing a downward trend that began in 2014. Just 13% of eighth graders scored at or above the proficient level. The latest average score was one point lower than the results of the first U.S. history assessment in 1994.In civics, the average score dropped 2 points to 150 between 2018 and 2022. Just 22% of eighth graders scored at or above the proficient level. The results, which are on a point scale of 0 to 300, are the first drop since 1998. The average score at its highest was 154 in 2014.",
        "The civics test included open-ended questions that asked, for example, for students to name one advantage of having the government operate programs to provide for the needs of people, and to describe a way that political candidates use technology during political campaigns.U.S. Secretary of Education Miguel Cardona said the scores highlight a need to provide more opportunities to learn about America's history and government.\"Banning history books and censoring educators from teaching these important subjects does our students a disservice and will move America in the wrong direction,\" Cardona said, referring to conservative efforts to impose new restrictions on how topics related to race and gender are taught.Republican Rep. Virginia Foxx, chairwoman of the House Committee on Education and the Workforce, said the results are an \"outright failure that should concern every parent.\"\"The Department of Education chooses to ignore this flashing red light and opts to shove wokeness down the throats of school districts and students,\" said Foxx, of North Carolina.According to the results, 40% of eighth grade students are performing below basic proficiency in history, meaning they likely cannot identify simple historical concepts in primary or secondary sources. Thirty-one percent are performing below basic proficiency in civics.___Data journalist Sharon Lurye contributed reporting from New Orleans.",
        "___The Associated Press education team receives support from the Carnegie Corporation of New York. The AP is solely responsible for all content."
    ]
}