{
    "articleURL": "/news/article-12042557/Bulgarian-pickpocket-deported-UK-used-passport-maiden-sneak-steal-4-000.html",
    "content": [
        "Keranka Nicolova, 27, has been jailed for two years for stealing from woman, 74She returned to UK after deportation to Bulgaria in 2018 for stealing on streetA Bulgarian professional pickpocket who had been deported from the UK returned using a passport in her maiden name and stole £4,000 from a pensioner, a court heard.",
        "Serial thief Keranka Nicolova, 27, was deported for street stealing in 2018 and banned from Britain.But the Bulgarian national returned in March this year 'to commit crime', a judge said. And now she has been jailed for two years after admitting theft.Nicolova, a married mother-of-three, stole the money from a 74-year-old woman after targeting her in a WHSmith store in Pontefract, West Yorkshire.Leeds Crown Court heard she was with another unnamed woman as they distracted the elderly lady who was walking with a trolley in the newsagents on March 29.The victim had withdrawn the cash from one bank and was on her way to another to deposit it but stopped at the shop first.",
        "The elderly woman only noticed the cash was gone when she arrived at the second bank, the court heard.CCTV images showed Nicolova and the woman stealing the cash. When the Bulgarian was arrested, police found more than £5,000 on her.A fingerprint scan at the police station showed that she was already subject to a deportation order served in March 2018 after being caught pickpocketing.Nicolova, whose address was given as Una Place, Huddersfield, tried to claim the fingerprint was wrong, the court heard.Prosecutor Benjamin Bell said records showed she'd only arrived back in the UK the day before the theft.",
        "She had used a passport bearing her maiden name to avoid detection and flew into Liverpool Airport.She admitted a charge of theft from a person and was jailed for 24 months.James Littlehales, defending, said: 'She accepts it was a joint enterprise and... that this does have an element of being professionally planned.'Her main mitigation is that she pleaded guilty at an early opportunity.'",
        "He said she had three children aged 11, nine and four, and that jail would have an affect on them.Appearing by video link from prison, Nicolova cried throughout the court hearing.Jailing her for 24 months, Judge Simon Batiste said: 'You were happy to leave your family behind in Bulgaria to come to this country and commit crime.'You were well aware you were not entitled to come back to this country. Equally I'm satisfied it was to commit crime.'She was a vulnerable woman and that is why you targeted her. I expect you will be deported and sent back to Bulgaria when you are released.'The £4,000 is to be returned to the victim."
    ]
}