{
    "articleURL": "/wires/reuters/article-12049367/GRAINS-Corn-track-weekly-rise-China-cancellation-US-cargoes-curbs-gains.html",
    "content": [
        "Slowing demand for US corn supplies to weigh on prices",
        "Talks on Black Sea grain deal in focus for wheat market(Adds quote in paragraph 3, updates prices)By Naveen ThukralSINGAPORE, May 5 (Reuters) - Chicago corn futures were poised to end the week with marginal gains on Friday, after dropping to a nine-month low on news of cancelled sales to China and strong competition from Brazil.Wheat is on track for a first weekly rise in three weeks as the market is being supported by uncertainties over a Black Sea export deal, which allows Ukraine to ship grains despite war with Russia.\"South American volumes is the big issue at the moment, Brazil has large corn and soybean supplies,\" said Phin Ziebell, an agribusiness economist at National Australia Bank.The most-active corn contract on the Chicago Board of Trade (CBOT) rose 0.1% to $5.89-1/2 a bushel, as of 0246 GMT, wheat added 0.2% to $6.46-1/4 a bushel and soybeans gained 0.1% at $14.19-3/4 a bushel.U.S. export sales of corn fell to their lowest weekly total on record, government data showed on Thursday, as overseas buyers cancelled purchases made earlier in the year.Concerns about export demand for U.S. corn have weighed on prices for months, and the futures market sank to a nine-month low earlier this week as a massive crop in Brazil was expected to provide a glut of cheaper supplies.",
        "For the week, corn is up 0.8%, wheat has added 1.9% and soybeans are little changed.The market is also eyeing the USDA's monthly World Agricultural Supply and Demand Estimates (WASDE) on May 12, with an expected decrease in exports.Technical personnel from Turkey, Russia, Ukraine, and the United Nations will meet on Friday to discuss a deal that allows the exports of Ukrainian grains on the Black Sea, Turkish Defence Minister Hulusi Akar said.The evacuation of Turkish-flagged ships and grain shipments from Black Sea ports as part of the deal will be discussed, Akar said.Ukraine President Volodymyr Zelenskiy said a day earlier that Russia did not appear to be interested in extending the Black Sea grain deal, but that Kyiv was focused on looking for partners to fulfil the deal and was not looking for Russian interest.Commodity funds were net buyers of CBOT wheat futures on Thursday, traders said. Funds were net sellers of corn, soybeans, soymeal and soyoil futures. (Reporting by Naveen Thukral; Editing by Uttaresh Venkateshwaran and Varun H K)"
    ]
}