{
    "articleURL": "/wires/ap/article-12052607/Colts-release-Foles-create-roster-space-salary-cap-room.html",
    "content": [
        "INDIANAPOLIS (AP) - The Indianapolis Colts released veteran quarterback Nick Foles on Friday, saving about $2 million in salary cap space while creating room for the 12 rookies it added last week in the draft.",
        "Foles lost both of his starts in 2022, his only season with the Colts. He left the second game with injured ribs, then missed Indy's final game also because of injured ribs. The release was expected after the Colts selected former Florida quarterback Anthony Richardson with the No. 4 overall pick.The Super Bowl 52 MVP started 58 of 71 career games during an 11-year career that took him from Philadelphia to St. Louis to Kansas City, Philadelphia again, Jacksonville, Chicago and finally Indy. Foles completed 1,302 of 2,087 passes for 14,227 yards with 82 touchdowns and 47 interceptions after the Eagles drafted the former Arizona star in the third round in 2012.Indy cut longtime veteran Matt Ryan in March after the four-time Pro Bowler struggled with turnovers last season.Those two moves leave Indy with three quarterbacks on the depth chart - Richardson, Gardner Minshew and Sam Ehlinger, who was one of three starters the Colts used last season - and assures the team of having a seventh consecutive season with a different opening-day starter.Ehlinger is entering his third season with the Colts after starring at Texas. Ehlinger and Foles both attended Westlake High School in Austin, Texas.",
        "Foles' release was the latest in a flurry of roster moves this week.",
        "Indy also announced before its rookie minicamp began Friday that it has signed seven draft picks - cornerback Darius Rush, safety Daniel Scott, tight end Will Mallory, running back Evan Hull, defensive end Titus Leo, cornerback Jaylon Jones and tackle Jake Witt. Scott, Rush, Mallory and Hull were fifth-round picks, Jones went in the sixth and Witt was taken in Round 7.Indy also said it has signed 15 undrafted rookies including former guards Emil Ekiyor and Harris LaChance, four receivers and two linebackers.Earlier this week, Indy waived defensive end Kameron Cline, tight ends Nikola Kalinic and Jalen Wydermyer, linebacker Forrest Rhyne, defensive tackle Chris Williams, running backs Darrynton Evans and Aaron Shampklin, cornerback David Vereen and receiver Kristian Wilkerson.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}