{
    "articleURL": "/tvshowbiz/article-12039533/Natalie-Cassidy-shares-rare-glimpse-fianc-Marc-Humphreys-enjoy-Irish-getaway.html",
    "content": [
        "Natalie Cassidy enjoyed a romantic Irish getaway with fiancé Marc Humphreys as she kicked off her 40th birthday celebrations last weekend. ",
        "The EastEnders actress will mark the milestone May 13, but appeared overjoyed as she headed off to the picturesque town of Killarney for an early treat. Natalie, who shares daughter Joanie, six, with Mark, offered her Instagram followers a glimpse of their swanky accommodation before venturing to a local pub. The lovebirds, who began dating in 2014 before getting engaged a year later, stayed in a luxurious with roaring fire and speculator views.The soap star was surprised with a lavish chocolate cake before celebrating with Champagne and fresh strawberries. ",
        "The birthday girl to quick to tease her cameraman beau after he accidentally covered her face with a flute of bubbly while attempting to take a selfie.Natalie, is also mum to her 12 year old daughter Eliza, from a previous relationship, Jokingly captioning the snap: 'FFS [For f*** sake].Later writing: 'What a weekend. Killarney you were INCREDIBLE. Thank you to @aghadoeheights for the incredible hospitality and wonderful views'. 'Siobhan- (2nd pic) was amazing. As was Brendan the concierge- gutted I’ve not a photo with him. Family and respect is everything there. Music is in their hearts and they love their country'. She continued: 'We will be back very soon. Shout out to @mrsaoifehutton for all your recommendations. The best weekend to kick off my 40th celebrations. Me and Marc loved every second of it. @j.m_reidys was the best pub in town'.",
        "It comes as Natalie's character Sonia Fowler is set to be left devastated in next week's EastEnders when she discovers the shocking secret about boyfriend Reiss Colwell.Viewers of the BBC soap have long been suspicious about Reiss and his relationship status, especially after he made a mysterious call earlier this month asking to speak to his 'wife'.And in upcoming scenes, it's another mysterious call which proves to be Reiss' undoing, leaving his girlfriend Sonia crushed.",
        "The drama begins when Sonia wakes up to treats from Reiss (Jonny Freeman) on her birthday but is confused when he fails to put in an appearance in person. While over at the café, a concerned Rocky Cotton (Brian Conley) tells partner Kathy Beale (Gillian Taylforth) that he overheard Reiss on the phone to a mystery person.But she swiftly shuts him down and  tells him to drop it as its Sonia's birthday.And as time ticks down to their upcoming Coronation performance, there is concern as there's still no Reiss.Rocky comes close to sharing his suspicions with a worried Sonia but just in the nick of time, Reiss appears. Later, Rocky confronts Reiss and demands the truth from him, just as Sonia walks in and overhears. ",
        "The nurse is then left shattered when Reiss eventually admits the shocking truth about what he's been hiding.",
        "Furious at the betrayal, Sonia berates Reiss and demands he gets out of her life for good. Later, an utterly devastated Sonia breaks down in tears as her ex Martin Fowler comforts her over Reiss' confession.Eve Unwin takes pity on him and lets Reiss unburden his soul before going to find Sonia and recommending that she hears him out.EastEnders airs Mondays to Thursdays at 7:30pm on BBC One and iPlayer. "
    ]
}