{
    "articleURL": "/tvshowbiz/article-12058289/Yellowjackets-season-2-episode-7-teases-tensions-fist-throwing-2023-MTV-Movie-TV-Awards.html",
    "content": [
        "A new teaser of Yellowjackets season 2, episode seven titled, Burial, was unveiled during the 2023 MTV Movie &amp; TV Awards on Sunday, hinting at plenty of explosive arguments and even a bit of fist throwing. ",
        "The popular Showtime series, which received two nominations at the ceremony including Best Show and Best Performance in a Show, premiered its second season earlier this year in March, with new episodes airing every Friday. The annual awards show was thrown into chaos due to the current Writers Guild of America strike which prompted some celebrities to not make appearances and host, Drew Barrymore, to drop out. However, a minute-long teaser clip was shown during the pre-taped ceremony, hinting at what fans can expect from episode seven, which will premiere on May 14. At the very beginning, the surviving Yellowjackets could be seen huddled near a fire indoors, with Teen Misty, played by Samantha Hanratty, standing up and humming to the track, Lightning Crashes, by artist Live. ",
        "Teen Shauna, played by Sophie Nelisse, strolled to the other side of the room, only to come to a crashing halt when she heard the tune. She slowly turned around and asked Misty, 'Why are you singing that?' The camera slowly zooms in on Misty's face, as she remains silent in slight confusion. Shauna demanded once again with less patience, 'Where did you hear that song?' The clip then jumped to years later with the adult versions of the characters dancing happily to the track, played by Christina Ricci (Misty) and Melanie Lynskey (Shauna). ",
        "The teaser then transitioned back to the past, with Teen Misty answering with, 'I don't know. I think that Crystal was singing it.'Within seconds, Shauna stormed across the room, punching Misty directly in the face, causing her to nearly fall over. Just as the punch sounded on the screen, Christina Ricci's voice yelled, 'Oh my God you guys, is it snowing?' jumping back to the future. The adult versions of the characters could be seen showing excitement as they prepared to look at the snowfall. The teaser then cut back to Shauna emotionally yelling, 'You killed my f***ing baby!' with two other Yellowjackets trying to hold her back away from Teen Misty. In the previous episode, Shauna had tragically lost her baby boy, mainly due to malnutrition.Nat stepped in the middle, adamantly telling Shauna, 'Stop! Misty did everything that she could!'",
        "Still mourning the loss of her child, Shauna fired back, 'Oh shut up!' and accused other Yellowjackets of eating her baby. 'I saw you. You were covered in blood!' At the end of the explosive clip, Teen Lottie then stepped in the middle, only prompting Shauna to throw another punch as well, the sound echoing around the survivors and ending the teaser. Showtime's Yellowjackets has received critical acclaim and a devote following from viewers and fans since the first season premiered in November 2021. ",
        "The second season began airing earlier this year in March, with a new episode dropping every Friday. The plot follows the Yellowjackets, a soccer team that was flying to Seattle but crashed in Canada in 1996. The survivors then had to learn to survive in the wilderness, with episodes jumping to the future to show the adult version of the characters who are still coping from the trauma. The premise of season two follows, 'The Yellowjackets barely made it through summer in the woods, but now as winter begins to bite, we’ll see if hunger and desperation turn into full-on psychosis,' according to an official synopsis. ",
        "Since its release, the thriller has garnered several Emmy nominations, and recently received two nominations at the 2023 MTV Movie &amp; TV Awards, which aired on May 7. The series received nods for Best Show, which was awarded to HBO's The Last Of Us, and Best Performance in a Show for Christina Ricci. However, the win went to Jenna Ortega for her portrayal in Netflix's Wednesday. MTV jumped to its own Twitter page to share the teaser, and added the caption, 'Snow is falling, fists are flying, and everything is juuust fine in this exclusive clip from episode seven of #Yellowjackets.' The second season contains nine episodes and will soon come to an end later this month. However, late last year in December 2022 , Yellowjackets was renewed for a third season.  ",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}