{
    "articleURL": "/news/article-12048935/Strangers-met-William-Kates-wedding-12-years-ago-reveal-lifelong-bond-ahead-Coronation.html",
    "content": [
        "Donna Werner and Faith Nicholson met while camping out for the royal weddingThey met up for Harry and Meghan's wedding and have reunited once again Two royal super fans who met at William and Kate's wedding 12 years ago have reunited yet again to celebrate the Coronation of King Charles and Queen Camilla.",
        "Donna Werner, 71, travelled to London from Connecticut, USA to watch living history with her now-close friend Faith Nicholson, of Essex. They were among the first to secure spots on the Mall earlier this week.The pair, who have both loved the royal family since they their youths, say they 'bonded automatically' after meeting by happenstance and spending four nights camped out together ahead of the Wales' royal wedding in 2011.Despite living an ocean apart, Ms Werner and Ms Nicholson, 61, have kept in touch over the years and have met up several times in the past decade, including for Harry's wedding to Meghan. The friends are thrilled to be witnessing the historic Coronation together and say they cannot wait for the 'iconic moment that the King and Queen go passed in the golden coach'.",
        "Ms Nicholson and Ms Werner first met after pitching tents near each other ahead of William and Kate's wedding.They spent four nights as campsite neighbours and instantly connected due to their 'outgoing personalities'.'You just start talking to everybody that's around you, saying \"hey, will you watch my tent while I go get something to eat\" and we just hit it off,' Ms Werner said of their first encounter.Ms Nicholson added: 'And we've stayed in touch ever since.' ",
        "The pair reunited again, seven years later, when Harry married Meghan, and camped out. But unlike the first royal wedding, the pair had to rough it a bit.'They didn't allow tents. So we just had to sleep right on the sidewalk with nothing over us,' Ms Werner recalled. 'That was pretty cold.'The pair were among the first to camp out on the Mall this week with Ms Nicholson arriving on Monday night in effort to secure the best possible spot. Ms Werner joined her on Tuesday.Ms Nicholson is most looking forward to seeing the King and Queen process in the golden coach and when their first appearance on the balcony.And Ms Werner says she can't wait until the couple comes back from Westminster Abbey after being crowned King and Queen. ",
        "Over the past decade Ms Werner, who says she developed a 'lifelong love affair with England' when she was just 17, has visited London numerous times and during recent visits even met up with Ms Nicholson.But she says her fascination with the royals began as a teenager when her father sent her on a bicycle trip across the UK and parts of Europe.While travelling she fell in love with the history, the gardens, England's countryside villages and 'of course, the royal family'. ",
        "'During the Diana years, I really followed her, loved her and was of course devastated with her passing,' Ms Werner said. 'I just like to follow the family. It's just sort of a hobby of mine. I read the Court Circular every day and follow all the royal news. 'She first came to the UK for royal festivities in 1986 when Andrew married Sarah Ferguson and has been hooked ever since.'People might think I'm obsessed, but I really enjoy it,' she said. ",
        "Ms Nicholson, who was also a teenager when she first fell in love with the royals, has gone to several royal events throughout her lifetime.'My first experience was the Silver Jubilee,' she recalled. 'I was 15 and I remember coming home and just seeing the street, which is probably longer than the Mall. 'It was just red, white and blue everywhere. It just blew my mind and from that point onwards, I've been following the royal family.'Ms Nicholson turned up for Charles' wedding to Diana, Andrew's wedding to Fergie and multiple events honouring the late Queen.Most recently she camped out for Queen Elizabeth's funeral and spent 16 hours in the queue to see her lying in state. Both agree the real prize this weekend and culmination of their decade-long companionship will be seeing the new King and Queen.",
        "Ms Werner added to MailOnline: 'I can't wait till they have their crowns on and their in the golden coronation coach that even Queen Victoria rode in and said it was the most uncomfortable ride of her life.'Hopefully it'll go slow enough that we can see through the raindrops.' "
    ]
}