{
    "articleURL": "/tvshowbiz/article-12048645/Influencer-Jad-Tuncdoruk-reveals-husband-Lachie-Brycki-spent-night-hospital.html",
    "content": [
        "Influencer Jadé Tuncdoruk revealed on Thursday that her model husband Lachie Brycki was forced to spend the night in hospital after suffering a sport injury. ",
        "Jadé, 27, shared a picture of her man in a wheelchair on her Instagram stories on Thursday, saying he fell victim to a knee injury. In the snap, Lachie wears a face mask and ices his knee while flashing the peace sign, with Jadé saying they had a 'rough one'.'Rough one last night, in the hospital from 10pm - 6am after Lach sustained a bad knee injury at ball,' she wrote.'He has a very high pain threshold so you know it's not good when you get a call to take him to hospital. Discharged without really knowing what's happened so we spent today going to the doctors to get referrals etc.'",
        "She added: 'Have a lot to do and playing nurse.'She also shared a picture of Lachie at the desk at work with crutches by his side, writing: 'First thing he did when he woke up today was go to the office to try get Tunchy Wear orders out cause he wants customers to get there (sic) pieces asap.' 'I had to force him out of the room so he could rest but he snuck back in and did it when I wasn't watching,' she added. ",
        "The pair tied the knot at Krinklewood Vineyard in the Hunter Valley, in rural NSW, in October, after four years of dating. ",
        "The Instagram star walked down the aisle in a stunning custom-made dress with a full, flowing skirt from J.Andreatta Bridal Couture. She then changed into a slinky Marilyn Monroe-inspired satin halterneck dress for dinner and dancing at her reception. Among the guests was former Bachelor star Bella Varelis, who was also a bridesmaid on the day. ",
        "'I've never met someone I am proud to stand next to, and someone I miss an hour after leaving their side,' he said in his speech at the wedding. 'I've never met someone who motivates me on the darkest of days and somehow always inspires me to be better.'In 2019, popular social media personality Jadé, who boasts 475,000 Instagram followers, became the first Australian influencer to win E! People's Choice Award.Lachie meanwhile is an Australian fitness model who was the face of Revlon's Nearly Naked campaign and appeared in ads for men's underwear company aussieBum.Jadé was previously embroiled in controversy when she slammed luxury holiday rental company Weekenda on Instagram for refusing to refund her $2,000 deposit - after ignoring the company's clear-cut terms and conditions."
    ]
}