{
    "articleURL": "/tvshowbiz/fb-12058181/MTV-Movie-TV-Awards-Nominations-WINNERS.html",
    "content": [
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)",
        "Read articles that feature this panel     Drew Barrymore parodies Never Been Kissed as she does the Wednesday dance and KISSES Cocaine Bear in 2023 MTV Movie &amp; TV Awards skit......    Drew Barrymore kicked off the 2023 MTV Movie &amp; TV Awards in style with a hilarious skit referencing some of the past year's buzziest films...       MTV Movie &amp; TV Awards 2023: Vanderpump Rules star Ariana Madix says: 'we've been through tumultuous times' as show wins Best On-Screen Team...    Ariana Madix reflected on her volatile recent months as she accepted an MTV Movie &amp; TV Award on Sunday. She called recent events in her life...       MTV Movie &amp; TV Awards 2023 WINNERS: Jennifer Coolidge and drop-out host Drew Barrymore support WGA amid strike action as pair scoop gongs...    Jennifer Coolidge and Drew Barrymore showed their support for the Writers Guild of America amid the ongoing strike on Sunday as they picked...       The Last Of Us star Pedro Pascal gives emotional tribute to Bella Ramsey and gets choked up praising 'young people' as show sweeps MTV Movie...    The 48-year-old star delivered a trio of speeches to collect his golden popcorn trophies, and the first award saw him get slightly choked up...       Talk about irony! Drew Barrymore proudly accepts award for Best Host in her BATHROOM during pre-taped 2023 MTV Movie &amp; TV Awards... after...    Drew Barrymore happily accepted the award for Best Host during the pre-recorded 2023 MTV Movie &amp; TV Awards on Sunday after dropping out of...       (Finally) Ready For It! Taylor Swift's Nashville show delayed for FOUR HOURS due to severe weather warning - as singer gets go-ahead to...    Taylor Swift was cleared to perform after a four-hour weather delay kept fans waiting on Sunday. Nissan Stadium advised concert-goers that...       'What is this bulls***?' MTV Movie &amp; TV Awards fans SLAM drastically stripped-back pre-recorded show filled with past iconic moments - after...    Fans were upset after the 2023 MTV Movie &amp; TV Awards aired a stripped-down version of its ceremony featuring little more than clip packages,...       Jenna Ortega wins Best Performance in a Show for Wednesday at 2023 MTV Movie &amp; TV Awards... after striking WGA writers mocked her over...    Jenna Ortega was among the major winners at the 2023 MTV Movie &amp; TV Awards on Sunday, but she didn't appear virtually or in person at the...  "
    ]
}