{
    "articleURL": "/news/article-12061171/Children-copying-sick-sex-acts-watching-online-pornography-report-warns.html",
    "content": [
        "Acts include choking and strangulation, slapping, kicking and whipping Dame Rachel de Souza has called for tougher measures against online pornREAD MORE:  EXCLUSIVE: Boris and Charles' 'Rwanda bust-up'Children are committing violent sexual acts after watching online pornography, a report warns today. ",
        "Young people are imitating abusive and demeaning sexual acts depicted in internet videos, research by the Children's Commissioner for England found.Some have been subjected to sexual degradation at the hands of other youngsters, including choking and strangulation, slapping, kicking, whipping and punching. Others told of being forced to take part in perverted sex acts.An analysis of police interviews with young victims of sex crimes found half contained references to violent sexual activities.Two children said they had been treated 'like a porn star' by their abuser.",
        "The commissioner, Dame Rachel de Souza, called for tougher measures against online porn.'What this compelling evidence shows is that these acts commonly taking place in pornography are also occurring in terrible cases of child sexual abuse and violence,' she said.'When we combine that with what children and young people themselves tell us about the influence porn has on their behaviour and wellbeing, I believe we have a stronger case than ever for bringing in the most robust protections for children online. For too long we have brushed the issue of pornography under the carpet.'But we cannot shy away from discussing the nature, scale and impacts of online pornography.'The report analysed nearly 12million words from hundreds of police interviews, as well as documents from sex assault referral centres and interviews with perpetrators. In transcripts of police interviews, 16 per cent mentioned slapping, 18 per cent referred to punching and 8 per cent to strangulation.",
        "More than a fifth – 22 per cent – mentioned name-calling, 3 per cent referred to being abused while asleep and 2 per cent to being abused while drugged. In all, 35 per cent mentioned acts of physical aggression, 22 per cent cited acts of humiliation and 13 per cent referred to acts of coercion during sex.'In several interviews, children who had harmed acknowledged that their exposure to pornography was excessive or unhealthy,' the report said. 'The analysis looked at specific sexually violent acts commonly seen in pornography to see whether they appear in interviews with children about child sexual abuse.'Many cases of sexual abuse by a child of another child analysed (50 per cent) include words referring to at least one of these acts. Children themselves sometimes drew the link between what happened to them, or the harm they caused, and pornography.'A survey by the commissioner published in January found 38 per cent of children who had seen porn had accidentally stumbled across it online. On average, children first encountered porn at the age of 13.Dame Rachel added: 'No child should be able to access or watch pornography. Passing the Online Safety Bill must be a priority.'The Bill returns to the House of Lords today, where it will face further amendments around children's exposure to pornography.",
        "A Government spokesman last night said the Bill has been designed to cover all online sites that host pornography, adding: 'These companies will have to prevent children from accessing pornography or face huge fines.'"
    ]
}