{
    "articleURL": "/news/article-12039311/Pedal-Power-ACT-calls-Canberra-drop-speed-limit-30km-h-help-cyclists.html",
    "content": [
        "Pedal Power ACT wants CBD speed limits droppedIt recommended 30km/h in town centres A new campaign by a cyclist lobby group is pushing for the speed limit to be dropped to just 30km/h on some streets to improve safety for those on bikes.",
        "Pedal Power ACT called for speed limits in Canberra's CBD to be lowered to 30km/h in a submission ahead of the ACT budget.While the focus of the submission was to call for improved cycling infrastructure, the recommendation to lower the speed limit has outraged locals.In its recommendations, Pedal Power ACT called for the government to: 'Reduce speeds to 30km/h and ensure streets and intersections are redesigned with physical barriers to prevent drivers from speeding.'It described transport in the capital as a 'rat race' and noted that reduced speed limits for cyclist and pedestrian safety had been successfully enforced in European cities.",
        "'Low traffic neighbourhoods work successfully in England by slowing streets to 30km/h, using physical barriers like planter boxes and filtering measures to prioritise people walking and on bikes, making car use more difficult but still possible,' it said.The submission has been widely shared across local social media pages and sparked anger among residents who slammed the group as 'entitled and arrogant'.'Since when are they more precious than our children? Schools get a 40km/h zone, but entitled Pedal Power want it their way. What a joke!,' a furious mother wrote.'If you are too nervous a cyclist to be on roads that are 40-50km/h zones then use the dedicated off-road cycle ways. You have options, plan accordingly,' another said.",
        "'If the traffic is dangerous to the cyclists, maybe they could consider using cycle paths rather than inconveniencing motorists travelling at 60km/h,' another wrote. 'Canberra has an excellent network of over 1,000km of shared paths and 2,500km of footpaths which ACT taxpayers have funded. Cyclists should use these built-for-purpose paths and not the roads,' another said.In an earlier submission, Pedal Power ACT explained opposition to lower speed limits is rooted in Canberran drivers 'being used to' car-only roads.'Considerable cultural change is required for people to accept that city and town centres are places for people rather than for cars, and where cars are the \"guests\" among the people,' it said.'The era of inner Civic streets being provided exclusively for the smooth passage of fast-moving motor vehicles is over.' ",
        "Pedal Power said its position on speed is supported by data that shows most cyclist and vehicle crashes happen in the CBD area.Some locals agreed with Pedal Power and said they'd be happy to drive slower if it made roads safer. 'This would be great. Residential streets and high pedestrian areas should be slower, especially seeing as so many suburbs are without footpaths,' one person wrote.'If the \"town centre\" means the high pedestrian shop fronts areas, by all means yes please. But seriously other than that, it's just a road designed for automobile,' another said."
    ]
}