{
    "articleURL": "/news/article-12042059/Shocking-moment-pregnant-passenger-beats-Spirit-Airlines-manager-wouldnt-allow-fly.html",
    "content": [
        "Que Maria Scott told onlookers she was pregnant following the violent incidentThe passenger reportedly threatened a gate agent before being denied boardingAirline worker Jasmine Rhoden said Scott hit her face and 'smelled of alcohol' A six-months pregnant passenger attacked a Spirit Airlines employee after she was told she could not board the flight after threatening a gate agent.",
        "Video footage shows Que Maria Scott, 29, tackling Jasmine Rhoden at a gate at Hartsfield-Jackson Atlanta International Airport, Georgia on April 30. After a brief struggle, fellow passengers were able to pull Scott, who is originally from Philadelphia, off Rhoden. As she was being led away from the gate, Scott announced to shocked onlookers that she was pregnant, despite allegedly 'smelling of alcohol.'She was later arrested for simple assault and disorderly conduct and transported to the Clayton County Jail in Jonesboro. ",
        "Footage posted on social media shows a violent altercation between the two women, with Scott ending up on top of the employee.Although the video posted to Twitter says 'They were both added to the no fly list', this is incorrect as one is Rhoden, who works for the airline.An Atlanta Police Department witness statement from Rhoden said Scott came to the gate and asked others what was going on with the flight that they were supposed to take.She then reportedly began to threaten one of the gate agents, who got on the phone to call 911.'Rhoden stated that the passenger made a statement to other passengers around that, she will beat a b**** up if she does not get on the plane,' the report said.'At that moment, Ms. Rhoden explained that she was going to deny her boarding to this flight due to her statement and actions at the gate area.'",
        "The gate agent then reportedly closed the gate, and Scott pulled up her sweat pants and proceeded to attack Rhoden by 'swinging her arms and hitting Ms. Rhoden on the left side of her face.''Ms. Rhoden then stated that Ms. Q. Scott began to pull her hair at the scene and pulling her into a barrier that was at the location causing them to fall to the ground,' the report continued. 'Ms. Rhoden stated that the female fell on top of her and it took for other passengers to get Ms. Q. Scott off her.'Ms. Rhoden stated that she clearly smelled alcohol on Ms. Q. Scott even though Ms. Q. Scott claimed to be pregnant.'     ",
        "Body cam footage provided by Atlanta Police Department shows Rhoden saying 'she needs to be arrested.'In response Scott shouts 'I'm pregnant, I'm pregnant' as she is handcuffed by officers.Scott then says: 'I didn't do nothing to nobody. You really just got me booked. It's cool. I'm going to remember your face in my head forever.'Scott was arrested by the Atlanta Police Airport Division and transported  to Clayton County Jail with a bond amount of $1,500 in fees and $350 in fees.The police report said Scott told officers she was pregnant as she was transported to the precinct.",
        "'During the event, Ms. Q. Scott advised that she was six months pregnant,' the report said.'Atlanta fire and EMS was called out to the precinct to check Ms. Scott out for any pains or discomforts. Ms. Scott was not transported to the hospital.'DailyMail.com has contacted Spirit Airlines for comment. ",
        "According to FOX 5, Spirit is one of the few airlines that would bring on off-duty officers to monitor its gates in the past. That deployment has apparently been discontinued.It is not the first violent incident which has occurred at an airport gate of the airline. Shocking video footage obtained in February exclusively for DailyMail.com shows Spirit Airlines agents trading blows with unruly passengers as they were boarding a flight in Philadelphia. The vicious fight erupted at Philadelphia International Airport when a mom, 39, and her 17-year-old daughter were hit with extra fees because their carry-on luggage was too large. Officers spoke to everyone involved but did not make any arrests over the dust-up."
    ]
}