{
    "articleURL": "/wires/aap/article-12040451/Dolphins-900-reasons-fire-against-Sharks.html",
    "content": [
        "Dolphins prop Herman Ese'ese is on a mission to deliver coach Wayne Bennett a win over Cronulla in his 900th premiership match as coach.",
        "The 28-year-old said no mention of the number 900 had passed from Bennett's lips at training this week but Ese'ese said that would not change the team's resolve against the Sharks at Suncorp Stadium on Saturday night.\"We just want to win for Wayne,\" Ese'ese said.\"He doesn't brag about it. We all had to find out in the media. He doesn't really pump up his milestones. That's Wayne.\"I can speak on behalf of the team. He is not just a coach. He is a father figure. He is likely to be the greatest coach of all time.\"It is 900 games now. That is a remarkable milestone. Hopefully we can go out there and get the win for him.\"Ese'ese has been a powerhouse off the bench for the Dolphins where his dynamic charges and offloading skills have come to the fore.He played his best football under Bennett at Brisbane in 2017 and after stints with Newcastle and Gold Coast, has regained his mojo at the Dolphins.\"I have been under Wayne before at the Broncos and he gets me playing my game,\" Ese'ese said.\"He gives me a lot of confidence and I feel like I am back in the Broncs days.\"Rugby union convert Valynce Te Whare has firmed to make his NRL debut at centre against the Sharks, despite only taking up rugby league last year.",
        "Regular centre Brenko Lee came off the training field frustrated on Wednesday after giving his hamstrings a workout in a fitness test. Te Whare, known as 'Val Meninga' for his blockbusting ways, slotted in at centre and appears on track to play unless Lee makes a miracle recovery.\"(Te Whare) has been killing it in (Queensland) Cup and training in place of Brenko in case he doesn't pull through. I think he is ready to go,\" Ese'ese said.\"He definitely looks like one of those centres who has been playing league for a while now.\"He is a big boy if he is coming straight at you. He is surprisingly quick ... probably one of the quickest in the team.\"Ese'ese said the Dolphins must improve their recent starts if they are to beat Cronulla. They came back from 26-0 down to beat the Titans 28-26 but lost 31-30 in golden point to Canberra last week after trailing 18-0."
    ]
}