{
    "articleURL": "/wires/aap/article-12049411/NRL-push-structured-four-week-international-window.html",
    "content": [
        "The NRL will push for a four-week post-season international window after selling their vision for the global game to club bosses.",
        "The topic of international football formed part of the agenda for the NRL's meeting with club chief executives on Thursday, with the game's powerbrokers in Brisbane for Magic Round.Five months out from the end of the season there are no international games scheduled in the southern hemisphere in 2023, with the mid-year representative round scrapped.Tonga will tour England for a three-Test series, meaning the Pacific powerhouse cannot feature in any Oceania tournament involving Australia, New Zealand and Samoa.Samoa reached the decider of last year's World Cup after beating England in the semi-final, while New Zealand were knocked out by Australia.There is a feeling within the code the momentum enjoyed by the international game must be capitalised on after similar gains made from the 2017 World Cup were curtailed by COVID-19.NRL CEO Andrew Abdo said he was not sure what any tournament in the international window would look like, but was adamant a structured spot in the calendar was required.\"What we want is a regular, fixed international window where we have a four-week period following the grand final where we play international football,\" Abdo said.\"The clubs are supportive of that.\"That's a great opportunity for us to take a leap in our market here with our neighbours and create some meaningful competition for both men and women.\"",
        "The issue of player safety emerged as a concern out of the World Cup, with those involved having a reduced pre-season after a post-tournament break.However, an AAP analysis on player availability showed no correlation between players who travelled to the World Cup and those who have missed games through injuries other than concussions.Approximately 25 per cent of NRL-contracted players featured at last year's World Cup in the men's draw.Those players are not drastically over-represented in the 145 injuries suffered in the first nine rounds of this year, accounting for 26 per cent of them.Abdo said workload was something the NRL had to consider when scheduling an international window, but he was confident a balance could be found.\"That's why we say a dedicated window that happens within certain standards and certain parameters,\" Abdo said.\"We're talking about three or four matches and we're talking about playing as many matches as possible in this market at NRL standard.\"So we're going to have to work with the countries within those constraints. It is a balancing act.\"The RLPA (Rugby League Players Association) are also supportive of the fact that we have a pre-season, a premiership and an international window at the end.\"It's just about making sure that that's within the right standards and also it's limited.\""
    ]
}