{
    "articleURL": "/wires/pa/article-12061215/Johnson-went-quite-hard-confrontation-King-Rwanda-policy.html",
    "content": [
        "Boris Johnson confronted the King, “essentially squaring up” to him for branding the Rwanda asylum policy “appalling”, it has been alleged.",
        "Guto Harri, who served as No 10’s director of communications under the former prime minister, claimed Mr Johnson told him he “went in quite hard” on the then-prince.Mr Johnson disputed his long-standing ally’s account as “inaccurate”, with a source saying he “deplores” any commentary on conversations with royals.Charles and Mr Johnson discussed the King’s reported criticism of the scheme as they met in Rwanda’s capital of Kigali at a Commonwealth summit in June.",
        "At the time, Mr Johnson described his discussion with Charles as a “good old chinwag” that “covered a lot of ground”.Writing in the Daily Mail, Mr Harri says that the meeting was “less amicable” than suggested.The former BBC journalist wrote: “‘I went in quite hard’, he told me at the time, essentially squaring up to the prince and confronting him about what he – as unelected royalty – had said about the actions of a democratically elected government.“Prince Charles was busted. He had obviously expressed some criticism, and though he tried to play it down, Boris pointed out the obvious, (saying): ‘If you didn’t say it we both know your people could ring the newspapers and kill the story. The fact they haven’t done that says it all’.”Along with other former prime ministers, Mr Johnson’s attended the King’s coronation at the weekend.",
        "Mr Harri claimed Charles and Mr Johnson had struggled to get on for years after the politician was late for a meeting while London mayor, but that Rwanda was the final straw.“Relations never fully recovered and Charles will be relieved that Boris had left No 10 before he ascended to the throne,” he added.Mr Johnson brought Mr Harri into No 10 after a clearout of aides over the partygate scandal, bringing back his former City Hall communications adviser into his inner circle.A source close to Mr Johnson said: “Boris Johnson does not recognise this account and it is inaccurate. It does not accurately reflect any conversation“We would never comment on these matters and Mr Johnson deplores any attempt to do so.”"
    ]
}