{
    "articleURL": "/sport/football/article-12050003/Fancy-life-London-Lionel-Chelsea-clubs-keen-signing-Lionel-Messi.html",
    "content": [
        "Lionel Messi will leave PSG upon expiry of his contract at the end of this season The Argentinian was suspended for two weeks following a trip to Saudi ArabiaChelsea were linked with the player during the previous Roman Abramovich era  Chelsea are reportedly one of a number of clubs contemplating a blockbuster move for Lionel Messi in the summer, after it was confirmed the Argentine will be leaving Paris Saint-Germain.",
        "Messi looks to have played his last match for French club and he appears determined to make a fairytale return to Barcelona, despite his former club's financial woes.But there are reportedly plenty of other suitors who are now exploring ways to make an offer to Messi that he cannot refuse. The World Cup winner has been suspended for two weeks without pay after missing Monday's training session without permission due to a commercial commitment in Saudi Arabia. Europe's biggest clubs will be fully aware that a deal for Messi may not be possible for Barcelona, with the club needing slash their wage bill by £180m to meet strict LaLiga rules.",
        "Chelsea were linked with Messi a number of times during the previous Roman Abramovich era and now football.london claim the Blues are interested once again, this time under new co-owner Todd Boehly.The seven-time Ballon d'Or winner has never tested himself in the Premier League - he only played in Spain prior to his move to France.Back in 2014 there was talk that a move to Stamford Bridge was 'close'.Sky Italia's Gianluca Di Marzio has claimed that Messi was seriously tempted following a FaceTime call with Jose Mourinho. However, the deal collapsed after his agent and father Jorge Messi found out about the proposed transfer.",
        "Boehly, who has already spent £600million on new players, will be looking to make more statements this summer after  a disastrous first season since taking ownership.The Blues are currently sitting 12th in the Premier League and will not have European football next season. They are onto a third manager of the season, also.",
        "Statements would not come much bigger than signing the man who many believe to be the greatest of all time.Messi has contributed 20 goals and 19 assists in 37 appearances for PSG this season, having also won the World Cup at the end of last year.He currently makes in the region of £1m a week but will be a free agent come the end of the season.Much is being made of his trip to Riyadh earlier this week, which has led to his suspension.The trip had been arranged on a day-off but the players were called in Monday after they lost 3-1 to Lorient at the weekend.The severity of the punishment - he will not be able to enter club facilities and misses two Ligue 1 games against Troyes and Ajaccio - appears to confirm suspicions that the Ligue 1 leaders are planning next season without the 35-year-old.",
        "When Messi's ban ends there will only be three games left and the player's focus is now on finding a club for next season.",
        "Barcelona's problem is registering Messi's contract with LaLiga, whose rules oblige the club to lose around €200m (£175m) from their current wage bill before they register new players.Even if Messi agrees to play for a nominal fee - something that sources close to the player suggest he has not ruled out - LaLiga would still oblige Barcelona to register the player's wages at the market rate leaving them struggling to balance their squad spend inside the league-imposed permitted limit.David Beckham's Inter Miami have also been linked with a move for the 35-year-old, who will not be short of options upon the expiry of his PSG deal this summer."
    ]
}