{
    "articleURL": "/news/article-12057689/First-victim-Texas-mall-massacre-identified-20-year-old-security-guard.html",
    "content": [
        "The first victim of the Texas mall shooting has been identified as a security guardChristian LaCour, 20, was killed inside the Allen Premium Outlets on SaturdayLaCour was one of nine people killed, including the shooter,  in the incident The first victim of the Allen, Texas shooting has been identified as a 20-year-old man who worked as a security guard in the mall where the massacre took place. ",
        "Christian LaCour was positively identified as one of the nine deceased - including the shooter - by friends and family on Sunday afternoon. LaCour's mother confirmed he was killed when a gunman walked into the Allen Premium Outlets Saturday morning and opened fire on the busy mall. In a post made Sunday, LaCour's grandmother Sandra Montgomery said she was 'so proud of him' while sharing the tragic news of his death. 'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen Texas. He was such a beautiful soul,' she wrote. ",
        "In another tribute post shared Sunday, one person who is friends with LaCour's family said he was a 'very sweet gentleman.'Kellie Smith said she considered herself lucky to have 'watched this sweet young boy turn into a very sweet gentleman,' the woman wrote on Facebook. 'Their will forever be a void. Please uplift his family in prayer as they navigate this unimaginable time of their lives. Christian you will always remain close to us because we will keep you in our hearts until we see you in Heaven,' Smith wrote. LaCour is the first of eight victims to be identified publicly and the identification comes a full day after the shooting took place. Children were among the eight killed during the rampage where more than 100 rounds were fired. Seven were pronounced at the scene and two at the hospital. ",
        "Additionally, the fire department transported nine victims to local hospitals, however, officials say more may have been taken by other agencies. As of Sunday afternoon, there are three victims in critical condition and four in stable condition, police confirmed to FOX 4.  The shooter has since been identified as Mauricio Garcia, 33, who investigators believe may have been a white supremacist or neo-Nazi. Garcia was gunned down by a police officer Saturday afternoon. ",
        "A man who witnessed the outlet mall shooting firsthand Saturday recalled being one of the first people on the scene - rushing to rescue his son from a clothing store where the now-deceased gunman's attack started. Shortly before, around 3:30pm Steven Spainhouer received a frantic call from his son notifying him that there had been shots fired outside the H&amp;M. Footage shows the moment those first shots rang out, in which the unidentified gunman is seen pulling up the store. Driving over with the intent to save his child's life, Spainhouer explained how he got there before any first responders - and was faced with the monumental task of trying to save lives.'I never imagined in 100 years I would be thrust into the position of being the first first responder on the site to take care of people,' he told CBS News. ",
        "Spainhouer said he jumped in and attempted to help victims who were in need. The man said he attempted CPR and first aid but was shocked by the severity of the situation and several of the victims. 'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face,' he said of the first victim he came across, a young girl.",
        "Dashcam video showed gunman Mauricio Garcia getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off.Garcia was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear. Allen Fire Chief Jonathan Boyd confirmed that seven people died at the scene, including the gunman, and then a further two victims died in hospital. Three of the wounded were in critical condition in the evening, and four were stable, Boyd said in an update on Saturday night. A Dallas-area medical group said it was treating victims as young as five-years-old. Investigators confirmed they believe shooter Garcia was working alone, but they have not yet released any motive for the killings. ",
        "Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.'I pray it wasn't kids, but it looked like kids,' he said. 'The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'"
    ]
}