{
    "articleURL": "/wires/pa/article-12060357/Blackpool-interim-boss-Stephen-Dobbie-refuses-rule-job.html",
    "content": [
        "Blackpool caretaker head coach Stephen Dobbie refused to rule himself out of the running to be the club’s permanent boss after guiding them to a excellent 1-0 victory over Norwich on the final day of the Sky Bet Championship campaign.",
        "The Seasiders went into the game at Carrow Road with nothing but pride to play for after being relegated in their previous match, but turned in a spirited display against their mid-table opponents, with Morgan Rogers’ effort after 15 minutes enough to settle the issue.It completed a record of three wins and three defeats since Dobbie was put in temporary charge following Mick McCarthy’s departure and the Scot is now waiting on developments behind the scenes as the Tangerines mull over the identity of their next head coach.When asked if he was interested in the job, Dobbie replied: “It would be wrong of me to say ‘no’, but I have got to wait to see what happens above me – there are things that need to be sorted out before anything happens on that.“All I can say at the moment is that I loved playing for this club and I have enjoyed the honour of being in charge and being in the dugout – even though it was obviously a big disappointment when we were relegated.“We’ll just have to see on that one but it was pleasing to finish the season with a win.",
        "“Obviously everyone felt down after relegation but we had fans travelling down today and we worked very hard to make sure we were ready for the game.",
        "“It was a strong team, one I thought could win the game and the players were excellent out there. They deserve a lot of credit for how they played. No way were they going to slack off just because we were down.”An entertaining encounter was settled by a well-taken effort from on-loan Manchester City youngster Rogers, his first for the club.With just 15 minutes on the clock, Rogers latched on to a well-judged through ball from Josh Bowler and produced a deft chip to beat the advancing Angus Gunn.Norwich had their chances to grab at least a draw, with Teemu Pukki at the centre of most of their best moments in what was his final appearance for the Canaries after scoring 88 goals in 209 appearances.He went close on a number of occasions but was denied by a mixture of poor finishing and good saves from Daniel Grimshaw as the visitors came away with the points.Norwich head coach David Wagner was pleased to see Pukki get a rousing farewell, even though the goal he craved would not come as they finished the season 13th in the table.“I thought he got the reception he deserved before, during and after the game,” he said. “It was a very emotional day for him but he dealt with it well and had many opportunities to score – it’s just a shame he didn’t take one.",
        "“Of course he will be a big miss for Norwich City.“I know all the numbers, but the club will also lose a reliable, honest and down-to-earth individual and I wish Teemu and his family all the best for the future. He will go down in Norwich’s history as one of the club’s stand-out strikers.”As for the game, Wagner added: “We started well enough but we weren’t clinical or ruthless enough and the second half wasn’t nearly as good as the first.“We need to make sure we don’t have another season like this and I am excited at the challenge that lies ahead.”"
    ]
}