{
    "articleURL": "/wires/ap/article-12048161/Calls-walk-homer-gives-Nationals-4-3-win-Cubs.html",
    "content": [
        "WASHINGTON (AP) - Alex Call had a lengthy batting cage session, an unusual practice before a day game, in an effort to lock in his timing on fastballs. The Nationals' leadoff batter saw promising results when he lined out to third base twice in his first three at-bats against the Cubs.",
        "Leading off the ninth inning in a 3-3 game, he got a fastball, and the hard work paid off in the sweetest way possible.Call hit a game-ending homer and Washington recovered after blowing a 3-0 lead to beat Chicago 4-3 on Thursday and take three of four from the skidding Cubs.\"It´s probably the best feeling on a field that I´ve ever had,\" Call said. \"I´ve dreamed about that so many times. That´s my first walk-off home run at any level. I´ve hit walk-offs before but never a home run.\"Call lofted the only pitch from Brad Boxberger (1-1) just inside the left-field foul pole - his third homer this season and eighth of his two-year big league career - and was greeted at the plate by exuberant teammates, who dumped a bucket of blue Gatorade on his head.\"It felt like the ball was in the air for about 12 seconds. I was kind of hopping down the line,\" he said. \"I knew I hit it enough to go out, but I was like, is that going to stay fair? Yeah, it's staying fair, this is real.\"",
        "Washington led 3-0 after seven near-flawless innings by starter Patrick Corbin. The veteran left-hander had given up only one hit - a popup by Cody Bellinger that shortstop CJ Abrams lost in the sun - before allowing back-to-back singles to start the eighth. Manager Dave Martinez pulled him for Hunter Harvey, who quickly allowed the Cubs to tie it.",
        "Pitching for the third straight day, Harvey gave up Trey Mancini's double off the wall in right field - the Cubs´ first extra-base hit since Tuesday night - for Chicago´s first run. Miguel Amaya added a sacrifice fly and Nico Hoerner tied the game with a two-out RBI single.Closer Kyle Finnegan (1-1), also working in a third consecutive game, gave up a walk and a double to start the ninth but struck out Bellinger and Patrick Wisdom and got Mancini to fly out to right.\"Unfortunately that's what you've got to do in that situation,\" Finnegan said. \"You've got to strike a couple guys out and we were able to do it.\"The Cubs went 1-6 on their East Coast trip and fell below .500 (15-16) for the first time since April 4.\"It's a tough loss, for sure,\" Cubs manager David Ross said. \"This group's shown they don't quit. They fight really hard. Patrick was really good to start the game. We got to him late. ... Guys had really good at-bats, we just weren't able to push another one across.\"Lane Thomas hit a three-run homer in the second inning off Jameson Taillon, who lasted only three innings in his return from a left groin strain. Javier Assad came on and faced the minimum in five innings of relief, allowing two hits.",
        "Corbin, who led the majors in losses and earned runs allowed in 2022 and 2021, was outstanding for Washington, consistently throwing his fastball, slider and changeup for strikes to induce weak contact from the Cubs' powerful lineup. He struck out six, walked none and was charged with two runs in seven-plus innings.\"The changeup was awesome,\" Martinez said. \"He's thrown the ball, six out of last seven times, really well. Today was really the Patrick Corbin that we've seen before.\"Corbin's ERA dropped from 5.88 to 5.17. He has not taken the mound with an ERA under 5 since his second start of 2022.DON'T BLINKWith Corbin and Assad trading quick innings, the game was moving at a blistering pace and it finished in 1:55 even after going into the ninth tied.\"We were flying. I think we were going to be done in like an hour and a half. Got that little curveball and we persevered and we still got done in pretty good time,\" Call said.FIRST TIMEAmaya, promoted from the minors because starting catcher Yan Gomes is on the seven-day concussion injured list, went 0-for-2 with an RBI in his major league debut.TRAINER'S ROOMCubs: With Taillon activated from the injured list, RHP Jeremiah Estrada was optioned to Triple-A Iowa. ... RHP Kyle Hendricks (right shoulder strain) is set to throw a bullpen in Chicago to work on mechanics following his rehab start for Iowa on Wednesday.",
        "Nationals: RHP Jake Irvin, recalled from Triple-A Rochester to make his major league debut Wednesday, will remain on the roster and could get another start, Martinez said. ... LHP Anthony Banda cleared waivers and was assigned to Rochester.UP NEXTCubs: Host Miami on Friday, with NL ERA leader Justin Steele (4-0, 1.49) opposing the Marlins' Edward Cabrera (2-2, 4.67).Nationals: At Arizona on Friday night. Josiah Gray (2-4, 2.67) is scheduled to start against Merrill Kelly (2-3, 3.06) of the Diamondbacks.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}