{
    "articleURL": "/wires/aap/article-12049649/Bellamy-weeks-away-call-coaching-future.html",
    "content": [
        "Craig Bellamy is considering whether to coach on with Melbourne's next generation, admitting the fresh challenge has brought on some nostalgia in a 21st season in charge.",
        "Bellamy has coached 527 NRL games for the Storm and scoffed at the prospect of chasing down former mentor Wayne Bennett, who will notch game 900 during Brisbane's Magic Round with the Dolphins.Coaching on beyond this season remains a tantalising option though, Bellamy saying on Friday he'd make a call \"in the next week or so\".\"I won't be going for 900, I'll be sure about that,\" Bellamy said of the drawn-out process ahead of Saturday's clash with South Sydney.\"I'll make a decision in the next week or so.\"There's been a few twists and turns.\"I'll just trust my gut; I've always encouraged other people to do that. Trust what my gut's telling me and go from there.\"Bellamy's Storm were the dominant force with Cameron Smith, Billy Slater and Cooper Cronk steering the ship and since their retirements have undergone further renovations with Bromwich brothers Jesse and Kenny joining Felise Kaufusi at new club the Dolphins.Brandon Smith also left for the Sydney Roosters but Melbourne are coping at 5-3 to sit sixth, Bellamy rating their season a \"six or seven\" out of 10 so far.\"A lot of change,\" he said.\"The big three leaving, then we lost a lot of experience this year ... it's going back to the age the squad was when I first started.",
        "\"There's always challenges in this job ... it's what the game's about. Sometimes I have (enjoyed that), sometimes I haven't.\"Saturday's sold-out Suncorp Stadium headliner shapes as a tasty clash given the Rabbitohs have charged to four straight wins since losing to the Storm in their last encounter.Like Bellamy, Souths coach Jason Demetriou enjoyed a cadetship under Wayne Bennett as an NRL assistant before earning a head-coaching role.\"They're playing better than anyone else at them moment,\" Bellamy said.\"Jason's done a great job; they've been up around the top the whole time he's been there (last season).\"I got a pretty good education as far as it goes under Tim Sheens and then Wayne.\"It's amazing how highly rated those guys are, the success they've had, but they're 180 degrees away from each other as far as coaches.\"They do it their own way, a whole heap different and it shows there's more than one way to skin a cat.\""
    ]
}