{
    "articleURL": "/news/article-12054419/Woman-tipping-hand-named-Americas-confusing-emoji-know-means.html",
    "content": [
        "The Woman Tipping Hand emoji is often used to express sassiness or sarcasmMore than 1,000 Americans, ranging in age from 18 to 76, participated in the online survey by Preply, to determine the most confusing emojisThe 'money with wings' and 'nail polish' emojis were number 2 and 3 on the list If you've ever been confused by the meaning of an emoji, you're not alone. ",
        "Emojis have become a crucial part of every day communication, but their meanings can sometimes be misinterpreted - like the upside down smiley face and or the person with folding hands.But the most confusing for people across America is the 'woman tipping hand,' according to a study conducted by Preply last month.The emoji, which is widely understood to express sassiness or sarcasm, shows a woman with her hand up like she's holding a tray of drinks or like she's flipping her hair.The 'money with wings' and 'nail polish' emojis came in at number two and number three on the list. ",
        "While 35 percent of Americans who participated in the study took the 'woman tipping hand' emoji to mean 'feeling sassy,' 31 percent took it as 'I have a suggestion,' and 20 percent said they felt it meant 'feeling sarcastic.''I have no clue what people mean when they use this one,' Saraya Weerasinghe, 18, of Kips Bay told The New York Post.More than 1,000 Americans Participated in the survey. Their ages ranged from 18-76. The second most confusing emoji is Money with wings - which shows a bundle of cash with wings. The survey reported that 40 percent of the participants felt it symbolized gaining money while 34 percent thought it meant losing money. Just 18 percent took it to mean 'flaunting wealth.'",
        "The nail polish emoji, which shows a hand being applied with nail polish, came in number third. About 43 percent of Americans felt it meant classy/bougie whole 40 percent thought it was 'just nail polish.'",
        "The upside down smiley face came in fourth of the most confusing emojis. 'The upside down smiley face one is definitely confusing because that could mean anything,' St. Francis College student Sabrina Tayeh, 18, of Brooklyn Heights, told The Post.According to the study, 45 percent of participants thought it meant sarcasm, while 23 percent said the emoji symbolized passive aggressiveness, and 37 percent said it was 'smiling through pain.'But there were 12 percent who said it was the same as the traditional smiley face.'Sometimes I just don't know what the emoji is supposed to mean — especially when an old person uses one,' Tayeh added.'I purposely don't send emojis to older people because I know they won't get what it means.'",
        "Confusingly, the Unicode Consortium, which creates emojis, does not specify the meanings of its images, meaning they remain open to interpretation.  Preply spokesperson Matt Zajechowski said that generational differences is a big reason for confusion when sending emojis. The findings highlight 'the need for context and clarity in digital conversations,' Zajechowski said about the study. ",
        "The study also highlighted the top five least recognizable emojis.There were nearly 300 people who did not know any of these meanings were attached to the emoji, according to the study.'Most people use other emojis — not these ones,' Tony Junior, 20, said.These included the dotted line face, shooting star, twins, and a person getting a head massage. "
    ]
}