{
    "articleURL": "/news/article-12054241/Not-staying-lunch-Harry-Princes-car-spotted-leaving-London-Coronation.html",
    "content": [
        "King Charles Coronation LIVE: Read the latest updates from Westminster Abbey and the Palace hereHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.ukPrince Harry wasted no time in leaving his father's coronation today, getting picked up from Westminster Abbey by a car that immediately headed out of London and was spotted at Heathrow Airport. ",
        "It comes after the Duke of Sussex, 38, appeared to indicate to Jack Brooksbank that he would be leaving straight after the ceremony during a conversation they shared inside Westminster Abbey. Lip reader Jacquie Presser told MailOnline that when Harry indicated with his thumb, he said the words 'tomorrow' and '3.45pm', while another lip reader picked up the word 'airport.' The King's son was beaming as he climbed into a black vehicle immediately after the historic event this afternoon. The same car was then seen being escorted out of the capital by a police motorcade in the direction of Heathrow. Harry was widely expected to return to California as soon as possible to celebrate his son Archie's fourth birthday with his wife Meghan Markle. There are multiple commercial flights heading from Heathrow to Los Angeles this afternoon. The flight time is around 11 hours, meaning if he left at 4pm he would touch down by 7pm, giving him time to celebrate his son's special day. It was reported that the Duke had been invited to a post-coronation lunch at Buckingham Palace, in what many would have seen as an olive branch after his explosive memoir Spare left several members of the Royal Family reeling - most notably his brother Prince William.",
        "Harry had worn an awkward smile today as he was forced to watch the event of a generation from his relegated seat in the third row - while his sibling took centre stage alongside a radiant Kate Middleton. ",
        "The Duke seemed keen to put on a jovial display  amid ongoing speculation of the Royal Family's inner turmoil following the release of his bombshell book in February.Wearing medals pinned to his suit jacket, he had been seen laughing and smiling as he entered the church alongside Princesses Eugenie and Beatrice and their respective husbands Jack Brooksbank and Edo Mapelli Mozzi.Once sat next to Mr Brooksbank, a lipreader consulted by Hello! magazine believes the Duke told him: 'I will be straight to the airport.' Another lipreader, Ms Press, told MailOnline that their conversation appeared light-hearted as they waited for the historic occasion to begin, with Harry possibly discussing an event happening on Sunday.She claimed the Prince smiled at Mr Brooksbank and said: 'That’s funny, mmm interesting'.To an unknown question from Mr Brooksbank, Harry replied: 'About quarter to 4?'Mr Brooksbank then replied: 'Oh really, when?' to which the Duke responded: 'I think tomorrow...'It came after Harry awkwardly nodded at other guests as he endured a solo walk down the aisle to take his seat next to his cousins ahead of the arrival of his father and now Queen Camilla. Harry appeared to bow his head as the newly-anointed King walked past him on his way out of the abbey - although much of his true reaction was blocked by a feather on Princess Anne's hat.",
        "The prince had not been seen for over 24 hours after his arrival and accommodation plans remained shrouded in secrecy - before it emerged he had flown into the UK on a commercial American Airlines flight on Friday morning. ",
        "Prince Harry was 'out of step with the others around him' as he twisted and bent his body while entering Westminster Abbey for his father's Coronation, a body language expert has said. His nervous walk into King Charles III's ceremony was a 'sure sign he was on his own', Carole Railton explained, and was 'with his own thinking'.However, he then stepped in line and started smiling broadly which showed him being more comfortable. The pro added that his hand holding the edge of his jacket may signal the need for a 'small hug' to make himself feel better in what is bound to be a tense reunion with his family.Carole also remarked that the twisting and turning of Harry’s body would indicate discomfort, which is an 'unusual pose' which we 'do not normally see this with the royals'.",
        "Harry was seated between Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for 10 years. They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edo Mapelli Mozzi. ",
        "Also in the third row, at the other end from Harry, was the Duke of York, who stopped using the title His Royal Highness in an official capacity in January 2022. He wore his Order of the Garter robe.William and Kate were in the front row at the abbey for the historic ceremony, with their children Prince George and Princess Charlotte.Their youngest child, Prince Louis, who recently turned five, will take his seat after processing through the abbey, but will retire once the ceremony begins.Only the other senior working royals will have a front row seat, made up of the Duke and Duchess of Edinburgh - Edward and Sophie - and their children Lady Louise and James the Earl of Wessex, as well as the ever-popular Princess Anne and her husband Tim Laurence. A source told the Sun: 'There were discussions that the seating could be arranged on line of succession. But that would have put fifth-in-line Harry front and centre — and with William and Kate.'Instead the decision was working royals only at the front and work back from there. Harry will be a long way from his father.'Sources previously told the Mail there were 'no plans' for Harry to join the Royal Family on the Palace balcony or to even appear in official photos.",
        "It emerged today that the Duke jetted into the UK on a commercial flight on Friday morning, leaving passengers gobsmacked. The King's son arrived from Los Angeles on American Airlines flight AA136, which landed at 11.23am at London Heathrow yesterday.Sources this week stressed that Harry will be 'in and out of the UK in 24 hours'. He plans to dash back straight after the two-hour ceremony to be with Meghan Markle for their son Archie's fourth birthday. He was expected to spend a final evening at Frogmore Cottage last night after his father decided to evict him and his American wife just days after the release of his memoir Spare.As was widely expected, it was confirmed by the Palace this morning that Harry and Andrew will be mere spectators to the historic Coronation Ceremony given that they are no longer working royals. The two men will also be absent from the procession behind the Gold State Coach that will carry the newly crowned King and Queen to the Palace after the ceremony.It means they will miss out, too, on stepping out onto the balcony at the Palace for a traditional photo op following the service.  ",
        "All eyes are on Harry as he faces his relatives in public for the first time since he criticised Charles, Camilla and the Prince and Princess of Wales in his explosive tell-all book. ",
        "Insiders last night said they could not rule out him having an unplanned heart-to-heart with his father after arriving to the UK.'Of course you can never say never,' said one. 'Anything is possible, especially with him. And His Majesty loves his son despite everything.' But others felt that this was extremely unlikely.'To be honest it seems a bit pointless him being there. His place in the pecking order couldn't be clearer,' another source told the Mail.'Attending is probably the right thing for him to do in the long run. He can at least say he came and made the effort to be with his father on his big day... But the red carpet is most definitely not being rolled out and, as it stands, he will just be another member of the congregation.' ",
        "Sources last month suggested that other family members – with the possible exception of Princesses Beatrice and Eugenie – had no interest in talking with Harry at the Coronation beyond the most basic of greetings. It came after the prince publicly called on his family to apologise to himself and Meghan for what they saw as slights against them. ",
        "He also demanded that his father and brother sit down with him before May 6 to thrash their issues out - a meeting which never came to fruition.Adding fuel to the fire, Harry also indicated he has enough material to fill another book, which is likely to make the royals wary of encountering him.He is set to make a quick exit after the Coronation, flying back to the US to mark Archie's birthday, and is expected to attend only the abbey ceremony.Sources previously said the decision by Meghan to remain in California had come as a relief in some circles, following fears her presence could have heightened family tensions.It is also understood there was real concern in the Sussex camp about the public reception the couple would have received if they attended the Coronation together.Friends, including Meghan's biographer Omid Scobie, suggested her decision was largely due to the Coronation falling on the same day as Archie's fourth birthday.The couple had delayed answering their invitation for weeks, causing difficulties for organisers tasked with complex seating plans, transport and security for senior members of the Royal Family, world leaders and other dignitaries.Sources described the negotiations as a game of 'transatlantic ping pong', and Harry was said to have wanted numerous assurances about arrangements.Coronation organisers admitted that they were stressed about Harry's plans and said that it was like 'trying to communicate with Mars'.Asked in an interview in January whether he would attend the Coronation if invited, Harry said 'the door is always open'.It was then reported last month that the duke would be coming to the Coronation alone, leaving Meghan at home with their children Archie and Lilibet.Buckingham Palace later said it was 'pleased to confirm' the Duke of Sussex will be at Westminster Abbey. There had been uncertainty at the Palace over the Sussexes' attendance.Sources last month said Charles was very pleased his youngest son is coming and his mood was described as 'generally quite forgiving', however, his brother William was understood to still feel betrayed and angry, particularly by the revelations in Harry's memoirs.One source told The Telegraph that the 'gulf' between the brothers, who were once as close as siblings could be, is now so large they cannot see how their relationship can ever be repaired.But their father hoped his Coronation could heal some of those wounds, sources said. ",
        "Sussex supporters said Harry understood that the Coronation is the biggest day of his father's life and felt it was right to be present, despite his attacks on the family. But more than one source confirmed to the Mail that there had been 'extensive discussions' between London and California over the issue of Harry's attendanc.One said: 'Harry's side was keen to find out, presumably because they wanted to rubber-stamp it, what the seating plan at the Abbey is. There's been extensive back and forth about who they [Harry and Meghan] would be sitting behind if they came. And who would be behind them.'Harry was apparently quite preoccupied by this particular detail, the source said.Another source added: 'This is true. There have been a lot of questions on detail for the Abbey.'Publications with links to the Sussexes have suggested that Harry had a list of questions for the Palace about what would happen if he attended and wanted certain 'assurances', but did not detail what they might be.When Harry and Meghan came to the UK for Queen Elizabeth's Platinum Jubilee they joined other members of the Royal Family at St Paul's Cathedral for a service of thanksgiving. But, notably and rather awkwardly, they were seated on the other side of the nave from Charles, Camilla, William and Kate.The Duke and Duchess of Sussex have been shunted away from the main seats as their rift with the Royal Family has grown.There had been hopes the Coronation could provide an opportunity for reconciliation - but as of last month, members of the Royal Family were understood not to have an appetite for it.One source told the Daily Express: 'The Royal Family are focused on planning for the historic occasion and have no appetite or time at this stage to think about reconciliation.' "
    ]
}