{
    "articleURL": "/tvshowbiz/article-12058703/The-O-C-star-Mischa-Barton-gives-fans-update-set-Neighbours.html",
    "content": [
        "Mischa Barton is calling Australia home for the coming months as she gets to work on the revamped soap opera, Neighbours. ",
        "The 37-year-old shared an update with fans on Monday, appearing in a video on the show's official Instagram account. The O.C. star promised that her character will liven up the series and bring 'drama' to the plotlines. 'I’ve started filming on set and it's going so great,' the actress, who has dyed her hair blonde for the role, said in the video. 'I cant wait for you guys to see it, there’s lots of drama to come. So see you all soon,' Mischa added. Watch the iconic series, The O.C. available now only on Stan. ",
        "Mischa's role as Reece in the Amazon reboot will shake up Ramsay Street as her character's identity 'is not what it seems'.The former Hollywood socialite's appearance is designed to appeal to American viewers, as Neighbours, which is set in the fictional Melbourne suburb of Erinsborough, will screen in the U.S. on Amazon Freevee.'I'm excited to be part of this iconic show's next chapter, and I am really looking forward to being back in Australia – a place I know and love!' Barton said in a statement.'I think the character of Reece is going to be a great role for me to explore and play with,' she added. Neighbours' executive producer Jason Herbison said: 'With Neighbours launching on Amazon Freevee in North America, we are beyond excited to have an actor of Mischa's calibre join us for the beginning of this exciting new chapter.",
        "'Mischa's character is dynamic and unpredictable, and will have an instant presence on Ramsay Street. Our loyal viewers are going to love her, locally and abroad.'Barton began her career as a child actress in Hollywood films like The Sixth Sense and Notting Hill, which were both released in 1999.However, she became a bona fide superstar when she was cast as troubled teenager Marissa in the hit TV series The O.C., which ran from 2003 to 2007.Her career floundered after she quit The O.C. at the end of the third season, and Barton publicly struggled with life in the spotlight.Cameras began rolling for Amazon's revived Neighbours last month, and the series should be back on screens by the end of this year.The continuation of the long-running soap series follows the finale in 2022, which was watched by millions of fans."
    ]
}