{
    "articleURL": "/tvshowbiz/article-12058291/Halle-Bailey-goes-kiss-romantic-boat-ride-Prince-Eric-Little-Mermaid.html",
    "content": [
        "The Little Mermaid star Halle Bailey went in for the kiss in a new teaser of The Little Mermaid played during the 2023 MTV Movie &amp; TV Awards on Sunday.",
        "In a never-before-seen scene and first look at the film's iconic Kiss The Girl number, the 23-year-old singer, who plays Ariel, shared an intimate moment with Prince Eric — played by Jonah Hauer-King, 27 — during a romantic canoe ride.Kiss the Girl was playing in the background as the pair are seen sitting in a boat underneath the willow trees.As their sea animal friends encouraged them to kiss, the characters were interrupted multiple times due to their own shyness or coincidentally when the boat flipped. The live-action reimagining of the animated film will receive a theatrical release later this month on May 26.",
        "In the beginning of the sneak peek preview, the five-time Grammy nominee was seen in a baby blue, tulle gown and a pink bandana tied around her hair.The World On Fire star sported a white pirate shirt like in the animated movie but also sported a navy blue, double-breasted vest. The pair were seen laying in a boat shoulder-to-shoulder but are too nervous to look each other in the eye. Ariel and Prince Eric started leaning in for a smooch, but the red-headed beauty suddenly sat up when the canoe floated into low-hanging willow leaves.Magically, fireflies started surrounding the pair, and they appeared mesmerized by the twinkling sight.",
        "All of a sudden, a school of fish appeared and swam around the boat causing a slow rotation.Ariel's gilled friends — unbeknownst to Eric — attempted to make the moment more romantic by spitting water to create a fountain.When water splashed onto Eric, Ariel touched his face — causing the two share a sweet moment.",
        "Now holding hands, they went in for a kiss again, but at the very last moment, the boat flipped. According to the official synopsis, The Little Mermaid tells the story of Ariel — the youngest of King Triton's many daughters.The 'bright and spirited young mermaid with a thirst for adventure' — who longs to 'find out more about the world beyond the sea' — makes a trip to the surface and meets Prince Eric.'Following her heart, she makes a deal with the evil sea witch, Ursula, to experience life on land,' the summary read. Iconic songs from The Little Mermaid soundtrack have had their lyrics changed to reflect consent in the upcoming live action remake of the 1989 Disney film.Composer Alan Menken told Vanity Fair last month: 'There are some lyric changes in Kiss the Girl because people have gotten very sensitive about the idea that [Prince Eric] would, in any way, force himself on [Ariel].",
        "The lyrics to the original song - which encourage Prince Eric to kiss Ariel before it's too late and without asking for her consent - include the chorus lines: 'Yes, you want her.  Look at her, you know you do.  Possible she wants you too.  There is one way to ask her.  It don't take a word. Not a single word.  Go on and kiss the girl.'Menken added: 'We have some revisions in Poor Unfortunate Souls regarding lines that might make young girls somehow feel that they shouldn’t speak out of turn.'Even though Ursula is clearly manipulating Ariel to give up her voice.'In the original song, Ursula sings: 'The men up there don't like a lot of blabber. They think a girl who gossips is a bore!'Yet on land it's much preferred for ladies not to say a word'And after all dear, what is idle babble for? Come on, they're not all that impressed with conversation. True gentlemen avoid it when they can'But they dote and swoon and fawn. On a lady who's withdrawn It's she who holds her tongue who gets a man.'",
        "The lyrics for the songs on the 1989 soundtrack were written by the late Howard Ashman and composed by Menken.Menken has joined producer Lin-Manuel Miranda to write new music for the remake and rework the original songs.",
        "The long-running awards show was one of the first victims of the ongoing dispute between the Alliance of Motion Picture and Television Producers and the Writers Guild of America union.Writers are now on strike and picketing studios, leading the host Drew Barrymore to announce she was dropping out last Sunday.The 48-year-old actress-turned-talk show host had been set to MC the festivities, but she is now putting her clout behind writers struggling to earn better pay and guarantees on staffing, as studios increasingly try to limit the size of writers' rooms and shrink the number of episodes per series.  'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' Barrymore told Variety. 'Everything we celebrate and honor about movies and television is born out of their creation.'The labor action has also led the awards show to cancel its red carpet festivities, and other stars may also drop out to show support to strikers.On Thursday, Vanderpump Rules star Lala Kent also announced she was no longer attending as a show of solidarity.'Although Vanderpump Rules falls under the unscripted sector of TV, that is not an excuse for me to remain silent and carry on as if there isn’t so much at stake for every writer and their families,' she told The Hollywood Reporter in a statement. 'We have to protect our creators and I hope you’ll stand with me and many others as we do so until we reach a resolution (hopefully very soon).'",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}