{
    "articleURL": "/wires/aap/article-12061389/Family-dont-want-Stanley-just-statistic.html",
    "content": [
        "The family of an Indigenous teenager who died in hospital after attempting to take his own life at a Perth prison have made an impassioned plea for change, saying Aboriginal prisoners aren't receiving adequate care.",
        "Noongar and Wirlomin man Stanley Inman, 19, was described by his sister Jacinta Miller as a humble, loving and cheeky brother.\"He lit up a room when he walked into it. He was beautiful inside and out,\" she told reporters on TuesdayMr Inman died in hospital two days after he was found in a critical condition at the privately run Acacia Prison on July 11, 2020.An inquest on Tuesday heard his mental health had been deteriorating before his death as he struggled to cope with the loss of two family members and his failing relationship with his girlfriend.Mr Inman's sister Tianna Austin said too many Indigenous families had stood in front of the coroners court demanding justice for their loved ones and changes to the way Aboriginal inmates are treated in prison.\"Young Aboriginal men and women aren't given the care they need in prison,\" she said.\"Mental health care in prisons is underfunded, under resourced and culturally unsafe (and) this results in our mob slipping through the cracks, just like our Stanley.\"Ms Austin said there were \"too many deaths and too many suicides happening behind bars\".\"How many more black fellas will be lost before the prison system changes?\"Ms Austin said her family want past death in custody inquiry recommendations to be implemented, along with any that come from her brother's inquest.",
        "Mr Inman's family also called for culturally appropriate Aboriginal medical care in Western Australia's prisons and reports of self-harm and family's concerns to be taken seriously.A corrections officer found Mr Inman critically injured and not breathing in a storeroom about 11.30am on July 11 during a search after he failed to attend the midday prisoner count.He and other prison staff performed CPR until paramedics arrived and transferred the teen to St John of God Hospital Midland in Perth's eastern suburbs, where he was placed in an intensive care ward.He was declared \"life extinct\" two days later.In the days before the incident, he made repeated calls to his mother and girlfriend and talked about self-harm and suicide.He told correctional staff he wanted to kill himself and showed them self-inflicted injuries to his chest.As a result, he was placed on a high risk rating with one hourly observations and sent to the medical centre for assessment.The following day, Mr Inman met staff at the prison's psychological wellbeing services unit, who noted he was polite, engaged and didn't show signs of distress.He denied thoughts or plans to self-harm or suicidal ideation and was assessed as not being in a suicidal crisis and his risk rating was lowered to medium.",
        "On July 10 a follow-up assessment found Mr Inman was flat and emotionless but responsive.It was recommended his risk rating be decreased to low.Ms Miller said the prison had failed in its duty of care to her brother by downgrading his risk rating so rapidly.\"The whole assessment thing needed to be done properly and it needs to change,\" she said.\"That could have made a difference in our brother's life and we don't want another family to go through this, it's heartbreaking.\"National Justice Project chief executive George Newhouse, who is representing the family at the inquest, said the system only managed risk.\"There was no 'let's look at his life history, his medical history' and take that into account when determining what Stanley needed,\" he said.\"He did not get what he needed. There was no real assessment of what he needed, there only 'is he going to die today'.\"The inquest continues.Lifeline 13 11 14beyondblue 1300 22 463613YARN 13 92 76Aboriginal Counselling Services 0410 539 905"
    ]
}