{
    "articleURL": "/news/article-12041127/Putin-preparing-contingency-plan-DEFEAT.html",
    "content": [
        "It comes as Ukraine plans a counter-offensive east of the Dnipro RiverVladimir Putin is reportedly preparing a contingency plan in the event that Russia sustains more losses in the war against Ukraine, sources have said. ",
        "Russia's presidential administration sent an instruction manual to the Kremlin's team of propagandists, urging not to 'underestimate' Ukraine's planned counter-offensive and not to spread the idea Kyiv is not ready for it.Ukraine's strategy is thought to focus on the eastern side of the Dnipro River, near Kherson city.Infiltration of the area is an attempt to dislodge Russian forces from positions they are using to shell Ukraine-held Kherson.  Independent news outlet Meduza - which obtained a copy of the manual - said the aim is to provide Russians with morale regardless of the outcome of the attack. ",
        "'If the offensive is unsuccessful, it will be possible to say: the army [of Russia] skillfully fended off an attack that was superior in power.'But should the Ukrainian military take back territories and achieve victories 'with the help of weapons from the US and Europe,' then Russia's losses should be 'understandable' as they were up against the 'entire West', the sources said. Propagandists are advised to use material to show citizens that Russia is upgrading buildings, hospitals and schools in its territory, rather than shooting funds into new ones. 'It's clear there will be problems with the economy, and it's clear why. Spending on the \"special military operation\" isn't going anywhere,' a source close to Putin said. 'It is better not to show in specific amounts how much was taken [for the new regions].' ",
        "It is a rapid turn from last year, when spin doctors tried to convince the population that Russia was on the way to revitalising itself as a grand empire as it takes control of Ukraine.Ukraine is thought to be mustering up to 100,000 men into at least 12, but even as many as 18 combat brigades to take on the Russians in the upcoming attack. Their military has been given roughly 200 western tanks, 800 armoured vehicles and 150 artillery guns – a total of up to 400 tanks, 1,600 vehicles and 300 guns are thought to be held.",
        "Russia's status is not as clear. Based on leaked casualty figures, Putin could have between 100,000 and 290,000 troops in Ukraine.The leaks suggest he only has around 500 tanks left on the battlefield, but may be able to rely on more from storage. The number of armoured vehicles and artillery is unclear.Although Ukraine's plans are being kept very close, Mick Ryan, a general who recently retired from the Australian army, told Mail Online Kyiv has three options.'First, they could go with a single big attack, using everything they've got; second, they could split that force between simultaneous attacks in the south and east; or third, they could decide on smaller-scale attacks in both the south and east, which are not coordinated.'",
        "General Stephen Twitty, retired from the US military, believes Ukraine will go with option three, which is incremental, slower and more sustainable. 'Ukraine will go with what has worked for them in the past,' he said. 'What the Ukrainians have been successful at doing is small-scale manoeuvres using infantry, armour and artillery, to attack Russian forces in small areas, and gain ground.'General Ryan himself believes it will be a mixture of options two and three.It comes as an oil storage depot today exploded close to a bridge linking Russia to its annexed Crimea, following a drone attack thought to be orchestrated by Ukraine.One tank containing the fuel burst into flames at 2am at a port near Volna village on the Black Sea.Over the past few days, saboteurs have also derailed two Russian freight trains and destroyed power cables.Today, Russia's FSB security service said it arrested members of a Ukrainian sabotage network planning attacks in Russian-occupied Crimea, according to Russian news agencies.'The FSB has broken up the activities of an agent network of Ukrainian military intelligence planning to carry out major sabotage and terrorist attacks in Crimea,' it was quoted as saying."
    ]
}