{
    "articleURL": "/news/article-12061149/Birmingham-airport-UKs-worst-flight-delays-second-year-row-figures-show.html",
    "content": [
        "Birmingham Airport had average 30m flight delays in 2022 - the worst in the UKCivil Aviation Authority ranked British Airports, with East Midlands best rated Birmingham airport was the country's worst for flight delays for a second year running, figures show.",
        "Departures from the West Midlands airport were half an hour behind schedule on average last year, according to analysis of Civil Aviation Authority data.This was more than twice as long as the previous year, when it was also ranked last for punctuality.Doncaster Sheffield – which closed in November – and Manchester airports had the joint second poorest punctuality records last year, with an average delay of 29 minutes.They were followed by Luton (28 minutes), Gatwick (27) and Bristol (26) airports.",
        "East Midlands Airport had the best performance, with an average delay of 13 minutes.The average across all airports was 23 minutes.The analysis took into account all scheduled and chartered departures. Cancelled flights were not included. When flights are significantly delayed, airlines are required under consumer laws to provide passengers with assistance, which can include refreshments, a means of communication and accommodation if required.If the cause of disruption is under an airline's control, passengers are also due compensation of up to £520 depending on the length of the delay and the distance of the flight.May and June were the worst months for flight reliability in 2022 as the aviation sector failed to recruit and train enough staff to cope with a surge in demand for holidays.",
        "Some 10.3million passengers travelled through Birmingham airport last year, making it the seventh busiest in the UK.In addition to flight delays, many departing passengers were forced to spend several hours in long queues for check-in and security.Around 50 airlines operate at the airport, such as Ryanair, Jet2.com, Tui Airways, Air France and Emirates.A Birmingham airport spokesman said: 'The start of 2022 was devastated by Covid.'After travel restrictions were lifted, the aviation industry fought hard to recover.'This year, the first since 2020 not impacted by Covid, our airport is running smoothly with customers set to equal or exceed pre-pandemic numbers.'Customers using Birmingham airport this summer can expect changes to walking routes as we build our £40 million new security hall, set to be ready for June 2024.'",
        "Rory Boland, editor of consumer magazine Which? Travel, said: 'Your choice of airport shouldn't make or break your trip, but for too many travellers last year that was sadly their experience.'A repeat of last year's chaos cannot be allowed to stand again, and airports and airlines must ensure they're working together to ensure they can deliver their summer schedules as promised, while the Government must urgently grant the CAA the powers it needs to hold the industry to account.",
        "'With at least some level of disruption sadly probable as we head into another busy travel season, airports' delay records are something some travellers may well want to take into consideration, even if that involves travelling slightly further from home.'CAA head of consumer Anna Bowles said: 'Our data tells us that too many passengers faced disappointing levels of delays across UK airports last year.'It is important consumers experience a high-quality service from both airlines and airports this year.'We expect airlines to proactively provide passengers with information about their rights when flights are disrupted.'",
        "The quickest and easiest way to save money on travel insurance and compare the best policies is to use a comparison site.While results will broadly be the same across most comparison sites, they may slightly differ, so it is worth checking a couple. We suggest: MoneySupermarketCompare deals from 35 leading providersConfused.comSee how much you can save from a few days to an annual policy Also check insurers such as Direct Line that does not appear on comparison sites and if you have previous serious medical issues consider a specialist insurer or broker.Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. "
    ]
}