{
    "articleURL": "/tvshowbiz/article-12039825/Maya-Jama-puts-busty-display-strapless-ripped-denim-dress-dinner-friends.html",
    "content": [
        "Maya Jama put on a very busty display on Tuesday in a denim dress for a dinner out with friends. ",
        "The Love Island host, 28, posted to her 2.7 million Instagram followers to show off her flawless ensemble. Maya displayed her gorgeous cleavage in the maxi dress as it hugged her sensational figure. The strapless top of the unique gown was embellished with ripped denim for a rustic feel, whilst the bottom flared out in an elegant sweep by her feet. She accessorised with a giant silver bangle but opted to go without a necklace to instead emphasise her incredible collarbones and jawline. ",
        "The beauty wore her raven tresses loose but poker straight, while her doe eyes were accentuated with winged eyeliner. She posed by an elegant staircase, panelled doors and later a grilled window as she showed her fans every angle of her flattering ensemble.  Maya wrote: 'Dinner with elite footwear &amp; amazing women, lovely.' She then posed for snaps with her famous pals singer Mahalia, 25, and shoemaker Amina Muaddi.  It is not the first time Maya has set pulses racing this week.On Monday the presenter looked incredible as she posed up a storm in a figure-hugging white co-ord.Maya took to Instagram on Wednesday to give her followers an insight into her bank holiday weekend. And the star did not disappoint, as she showcased her enviable figure in a tight white crop top and matching skirt.",
        "The beauty paired her stylish look with a pair of pink Miu Miu sunglasses and chic white Miu Miu bag.She added inches to her enviable frame with white knee-high boots and styled her brunette locks straight.Maya appeared in good spirts as she offered the camera a variety of poses and sipped on an espresso martini.In one snap, she offered a cheeky grin as she clutched a pink jersey jacket and showed off her flawless palette of make up, including a bold winged eye.At the end of her photo dump, Maya shared a quote which had clearly resonated with her.It read: 'Something I heard recently and I've tried to adopt whenever possible: \"Whoever has the most fun, wins.\"' It comes after The Sun revealed that Love Island will return to screens in just over four weeks on June 5.Maya will be back as the host following her huge success on the winter version of the show, which saw Sanam Harrinanan and Kai Fagan be crowned the winners.The summer version will see a new host of singletons travel to Majorca and stay in a luxurious villa for two months.Maya took over from Laura Whitmore to present series nine of the reality show."
    ]
}