{
    "articleURL": "/tvshowbiz/article-12048181/Georgia-Harrison-flaunts-incredible-figure-TINY-pink-bikini-sun-soaked-Ibiza-getaway.html",
    "content": [
        "Georgia Harrison sent temperatures soaring as she shared a slew of sizzling bikini snaps to her Instagram grid on Thursday.",
        "The Love Island star, 28, looked incredible in the tiny pink two piece as she flaunted her jaw-dropping figure in sunny Ibiza. Her skimpy ensemble boasted a plunging top and high-cut bottoms that were both adorned with a sweet lace trim.Georgia completed the look with a colour coordinating baseball cap as she flashed her gorgeous smile for the camera. Cheekily captioning the snaps: 'We're all on a 90 year holiday, get out there and smile whilst you still have teeth'.",
        "Last week, Georgia apologised to fans for over editing her photos in the past in a heartfelt Instagram post.While she appeared confident in her bikini photos, she admitted that it wasn't always the case and had previously edited her snaps.In an attempt to 'take accountability' for her past actions, Georgia issued an apology to her followers in which she said sorry for 'being part of the problem' at one point. She penned in her caption: 'I'm currently reading power vs force and I feel this is something I need to address after finishing it. 'I haven't been over editing my photos for a long time now and although I learnt my lesson I never really took accountability for the fact that I done it. So here it is…'I'm sorry to you if I made my insecurities your insecurities",
        "'I'm sorry to myself for not loving my imperfections the way I encourage others too'And I'm sorry to society for once being part of the problem.",
        "'I promise to continue to embrace my authentic self going forward and I acknowledge that authenticity is the highest form of love for oneself and others.'Her post was met with several positive messages from her followers praising her for being so honest and open.  It comes as the TV personality is hoping to pursue her dream of moving to California in a bid to put her legal battle with Stephen Bear behind her.Former Celebrity Big Brother housemate Stephen was jailed for 21 months after posting a revenge sex tape online featuring Georgia.Reality star Stephen, 33, was handed the sentence for publishing the explicit clip of the former couple having sex in his garden in August 2020, which was captured on CCTV, and published on his OnlyFans page and shared via WhatsApp.Georgia is hoping to leave the 'negative energy' of her experience with Stephen in the past, and head off to live in Los Angeles if she's able to secure a visa.Taking to Instagram recently, she wrote: 'I was meant to live in the sun, being in the cold/rain makes me feel s**t lol so if I could sort my visa 100 per cent I would be living in LA right now.",
        "'I miss my friends there, I love all of the healthy activities, the excitement, the enthusiasm.'I'm such an empath and I take on a lot of negative energy in the UK whereas the US has the opposite effect on me.'Stephen was jailed in March for 21 months after posting a revenge sex tape featuring ex Georgia.He was joined by his current girlfriend Jessica Smith as he was sentenced at Chelmsford Crown Court in Essex. "
    ]
}