{
    "articleURL": "/news/article-12041065/Mother-26-reveals-secret-five-word-message-taxi-driver-saved-violent-ex.html",
    "content": [
        "Daniel Little, 33, of Warrington, Cheshire, beat up ex-partner Rosie Frankish, 26After six hours of 'torture', she managed to escape with the help of a taxi driver A woman who was savagely beaten and smeared with dog faeces by her ex-partner in a six-hour ordeal managed to escape after mouthing five words to a quick-thinking taxi driver.",
        "Mother-of-two Rosie Frankish, 26, of Warrington, Cheshire, was locked in an abusive relationship with Daniel Little, 33, who refused to let her to move on with her life when she tried to split up.Little had just been released from police custody for attacking a stranger when he turned up at Miss Frankish's home late one night in December last year, banging on her door and demanding to be let in.Once inside, he grabbed her by the throat and subjected her to six hours of repeated punches, kicks and slaps as he blamed her for everything wrong in his life.Miss Frankish said: 'He was telling me it was all my fault, that I had taken away his family, and I would have to pay for it. I knew the attack was coming. His eyes were completely dead. I had no way of getting through to him.'",
        "She said that when her frightened dog defecated inside the house because the doors were bolted shut, Little smeared the faeces in her face, grinding it into her cheeks and hair with a towel. Obsessed Little even forced Miss Frankish to sit on a toilet seat while he ran himself a bath, determined not to let her out of his sight.Eventually, after he decided he needed to return to his home to get some clothes, he dragged Miss Frankish - who was still in her pyjamas and covered in dog faeces - into the back of the taxi.",
        "She said: 'The taxi ride lasted only around ten minutes, but it felt like forever. My mind was racing with possibilities, I thought about throwing myself out on to the road, or screaming out of the windows for help.'However, she saw her chance when Little got out first, telling the cabbie as soon as her abuser was out of the car: 'Please drive. Just go. Now.'She added: 'As he drove off, Daniel was grabbing the door, trying to get back in. I only just got away. I want every woman out there to see his face and know what he is capable of.'Miss Frankish said she thought Little was going to kill her that night and she was left with bruises for weeks after the attack.Last week, Little was jailed for three years and seven months at Liverpool Crown Court after admitting assault occasioning actual bodily harm and false imprisonment. ",
        "Miss Frankish said she met her former partner seven and a half years ago while pregnant with her first child and facing the prospect of being a single parent.She described him as 'lovely, very jokey and confident' in the early days of their relationship and he was supportive and loving when her baby was born.After setting up a home, the couple had a child together the following year. But it was during her second pregnancy that Miss Frankish said Little began to abuse her. ",
        "She said: 'I was three months pregnant when he grabbed my hair in an argument.'Despite this, Miss Frankish said she was determined to stay with Little for the sake of her children - even as he became increasingly controlling and violent - forcing her to hand over her phone and keys once she was at home.In 2020, the couple split up and two years later, she heard from Little again as he pleaded to see the children.Hesitantly, Miss Frankish agreed to them going on days out with him and says the arrangement worked well at first.But she took a step back once he became 'possessive and controlling' again - telling him he could only see the children in supervised visits with another adult present.Little is said to have taken the news badly and his behaviour deteriorated, eventually leading to his arrest for attacking a stranger in December 2022.Upon being released, he immediately went to the address where Miss Frankish and the children were living. ",
        "After letting him in, Miss Frankish says he gripped her throat and threw her against the fridge freezer before dragging her upstairs where his attack continued.In between blows, she said he made her hug him and he promised not to hit her any more, before resuming the attack 'like it was all part of some sick game'. ",
        "It wasn't until six hours later that Little decided he needed to collect some clothes and called the taxi. When he got out of the vehicle to light a cigarette, Miss Frankish saw a chance to get away.She says: 'I knew Daniel was looking at me, expecting me to get out after him, so I said very quietly, without moving my face, \"Please drive. Just go. Now\".'The cab driver said, \"Where do you want me to go?\", and I saw Daniel's hand reach for the door handle. It was like it happened in slow motion.'I yelled and the driver just put his foot down and we were off. I couldn't believe it was over. He took me to the police station and I got help.'Miss Frankish was taken to hospital with severe cuts and bruises, including a black eye, reduced hearing in her left ear, a 10cm bruise over her shoulder to her elbow, a 5cm bruise over her chest, and swelling to her head and scalp.Officers arrested Little shortly afterwards.Last week he appeared at Liverpool Crown Court and admitted assaults and false imprisonment.In her impact statement, Miss Frankish told the court: 'Psychologically this has affected me. I cannot sleep properly.'I feel like I cannot talk to anyone but my family. I feel vulnerable as a result.",
        "'When I close my eyes, I can see his face from that night. I used to love being on my own but now I cannot do that.'In mitigation, the court heard Little was 'deeply ashamed' of his behaviour.His barrister said: 'He accepts that he needs to be in prison. He knows he must be punished.'Little has a lengthy record of 17 previous convictions for 34 offences, including violence.Concluding, recorder Michael Blakey described the attack as a 'prolonged and persistent assault'.'There is serious psychological harm. You humiliated that lady,' he said.Little was sentenced to three years and seven months in prison, of which he will serve half before being released on licence.Miss Frankish said: 'I think his sentence should have been much longer. He could have killed me that night, and perhaps he would have if it wasn't for the taxi ride.'I feel deeply traumatised by what he did.'It was Daniel's aim to ruin me, but that won't happen. I won't let him win. I'm building a new life for me and my children, and our love is far stronger than his hatred.'"
    ]
}