{
    "articleURL": "/tvshowbiz/article-12042031/Gogglebox-stars-Giles-Wood-Mary-Killen-head-London-appearing-Heart.html",
    "content": [
        "They're best known for their dry-witted remarks and hilarious one-liners.",
        "But Gogglebox stars Giles Wood and Mary Killen were worlds away from their famous Wiltshire 'grottage' as they headed through London's Leicester Square on Wednesday.The pair, who joined the Channel 4 series in 2015, visited the capital to appear on Heart Radio's Breakfast Show. Gyles and Mary have become best known for their amusing quips and playful bickering from their cottage living room where they watch the biggest moments in that week's TV.Mary donned one of her famous quirky outfits, consisting of a red tartan skirt and a matching beret as she headed into the capital after leaving Global Studios.",
        "Giles followed close behind as the couple carried their bags out of the studio.Recently they stunned their followers by sharing an Instagram throwback snap from their younger years.In the black and white pictures, taken around 1986, the couple, who refer to each other as Nutty, are seen looking adoringly at one another.In one image, Mary can be seen staring at the lens while Giles gazes off into the distance as they stand arm-in-arm.In another, they hug one another as Mary looks up at her partner who she met when they were both aged 21 when Giles was studying at Wimbledon School of Art.Sharing the snaps on Instagram, Giles wrote: 'Throwback shots, Giles and Mary, circa 1986.'",
        "The couple have been married for more than 30 years and they live together in Wiltshire in their home dubbed The Grottage.Before finding fame on Gogglebox, Giles worked as an artist and Mary is a journalist who writes columns for the likes of The Spectator magazine.",
        "The couple share two adult children and first met over three decades ago at Wimbledon College of Art, where Giles was a student and Mary appeared as a costume model. Last year, the armchair critic revealed Gogglebox has reminded her of why she fell in love with her husband, Giles, as filming together provided bonding time. She said to The Daily Star: 'Giles and I were like ships that pass in the night. I got up early. He went to bed late and we rarely even ate together.'I know a few couples who have split up because they have decided they can’t stand one another. 'Sitting down and watching television reminded us how much we enjoyed the same jokes.'  "
    ]
}