{
    "articleURL": "/tvshowbiz/article-12040827/Madame-Tussauds-Sydney-brutally-snub-Meghan-Markle-unveiling-King-Charles-wax-figure.html",
    "content": [
        "Madame Tussuads has brutally snubbed Meghan Markle as it unveiled a waxwork of King Charles III in Sydney on Wednesday. ",
        "Ahead of his coronation this weekend, the museum had a special ceremony outside Sydney's Queen Victoria Building to show off the uncanny figure of King Charles.He was displayed alongside his wax figure family, William, Kate, and Harry, as uniformed guards stood at their sides.  However, Meghan's waxwork was notably missing, while Harry's figure was placed to the side on his own, off the red carpet. This is despite Madame Tussauds Sydney having a Meghan figure in its collection, as it advertises on its website that customers can 'feel like royalty' by standing next to her. ",
        "The museum likely decided not to include Meghan's waxwork because she will not be attending King Charles' coronation on May 6.Harry will be attending his father's ceremony while Meghan will stay at home in Montecito, California, with one-year-old Lilibet and Archie, whose fourth birthday is on the same day.However, it is unlikely that Harry will have any role in the coronation or stand on the Buckingham Palace balcony.",
        "It was announced that Meghan would not be attending the coronation following months of tension between the Sussexes and the rest of the royals following the release of Prince Harry's memoir Spare.The couple's friend Omid Scobie confirmed Archie's birthday 'played a factor in the couple's decision' for Meghan not to attend and that he expected it would be a 'fairly quick trip to the UK' for Harry.",
        "An anonymous friend told People that while Meghan wanted attend the coronation to support her father-in-law 'the scrutiny she receives outweighs the support.' ",
        "They added: 'There's always going to be that other side challenging their reasoning, and who wants to put themselves in that position?' Construction for the wax figure of King Charles that was unveiled in Sydney on Wednesday began nine months ago in Madame Tussauds' London studios. Madame Tussauds Sydney has been contacted and asked why Meghan Markle's wax figure wasn't included at Wednesday's ceremony. "
    ]
}