{
    "articleURL": "/wires/ap/article-12053117/Police-Georgia-man-killed-3-gunfight-earlier.html",
    "content": [
        "MOULTRIE, Ga. (AP) - A man in Georgia who, police said, killed his workplace manager, mother and grandmother before taking his own life, had been involved in a gunfight less than 48 hours earlier, law enforcement said Friday.",
        "Security video from a McDonald´s in the south Georgia town of Moultrie showed Kentavious White, 26, shoot store manager Amia Smith, 41, after getting her to come to the door before dawn on Thursday morning, the Georgia Bureau of Investigation said. The footage then showed White step inside the restaurant and shoot himself.After finding the shooting at the McDonald's, police found White's mother, 50-year-old Susie Arnold, and grandmother, 74-year-old Hilda Marshall, shot dead in their adjoining homes less than 2 miles (3.2 kilometers) away. Marshall was dead when police found her, while Arnold died later at a hospital.All three of the slain women appeared to have been shot multiple times, Colquitt County Coroner C. Verlyn Brock told The Associated Press.Moultrie Police investigator Nathan Cato told The Moultrie Observer that White had been involved in a gunfight on Tuesday at the home he shared with Arnold. White had returned home on his lunch break when another man began shooting at him, Cato said. White fired back, but both men missed and no one was hurt, according to police.Moultrie police had no other previous interactions with White, Chief Sean Ladson said.",
        "Rahiem Rashad Kinsey, 30, of Moultrie, a former McDonald's employee, shot at White, according to police. Kinsey was charged with aggravated assault and possessing a gun while committing a crime, and remained in jail Friday in Moultrie. It's unclear if he has a lawyer to speak for him.",
        "Felicia McGough, Smith's cousin, described the woman's killing as \"senseless\" to WALB-TV.\"And we're still today asking ourselves, why, why her'?\" McGough said.Arnold and Marshall had worked at a local assisted living home.The McDonald's reopened Friday, with purple ribbons tied to doors and employees wearing purple to honor Smith.The killings in Moultrie, in rural Colquitt County about 60 miles (95 kilometers) northeast of Tallahassee, Florida, came a day after a gunman in Atlanta killed one person and wounded four others at a medical office."
    ]
}