{
    "articleURL": "/wires/reuters/article-12049131/Chinas-aircraft-carriers-play-theatrical-role-pose-little-threat-yet.html",
    "content": [
        "By Greg Torode, Eduardo Baptista and Tim Kelly",
        "HONG KONG, May 5 (Reuters) - When China sailed one of its two active aircraft carriers, the Shandong, east of Taiwan last month as part of military drills surrounding the island, it was showcasing a capability that it has yet to master and could take years to perfect.As Beijing modernizes its military, its formidable missile forces and other naval vessels, such as cutting-edge cruisers, are posing a concern for the U.S. and its allies. But it could be more than a decade before China can mount a credible carrier threat far from its shores, according to four military attaches and six defence analysts familiar with regional naval deployments.Instead, China's carriers are more of a propaganda showpiece, with doubts about their value in a possible conflict with the U.S. over Taiwan and about whether China could protect them on longer-range missions into the Pacific and Indian oceans, the attaches and analysts told Reuters.China's Defence Ministry did not respond to questions about its carrier program, though dozens of articles in state-linked journals reviewed by Reuters reveal awareness among Chinese military analysts about shortcomings in the country's carrier capability.While some regional press coverage, partially based on Chinese state media reports, portrayed recent drills around Taiwan as active patrols and a military challenge to the U.S. and its allies, the Chinese carriers are effectively still in training mode, eight of the experts said.",
        "Landing of aircraft at night and in bad weather, for instance - crucial to regular offshore carrier operations - remain far from routine, several of the attaches and analysts said.And in a conflict, China's carriers would be vulnerable to missile and submarine attacks, some of the experts said, noting the People's Liberation Army Navy (PLAN) has not perfected protective screening operations, particularly anti-submarine warfare.\"Unlike other parts of their military modernisation, there is something politically theatrical about their carrier deployments so far,\" said Trevor Hollingsbee, a former British naval intelligence analyst.\"Carrier operations are a very complicated game, and China's got to figure this out all by itself. It still has a long, long way to go.\"At times, China's carrier pilots have relied on land-based airfields for takeoffs or landings, as well as for extra air cover and surveillance, the attaches told Reuters on the condition of anonymity as they were not authorised to speak publicly.And though China's Liaoning and Shandong carriers have each sailed into the western Pacific in recent months, approaching U.S. bases on Guam, they remained within range of coastal Chinese airfields, according to Rira Momma, professor of security studies at Takushoku University's Institute of World Studies, who reviewed Japanese defence ministry tracking data.Both the Liaoning - a refitted ex-Soviet vessel - and the Chinese-built Shandong have jump ramps for take offs, which limit the number and range of aircraft on board.",
        "Anti-submarine helicopters operate from both carriers and China's Type 055 cruisers but the carriers have yet to deploy an early warning aircraft, relying so far on land-based planes, the 10 experts said.A new plane, the KJ-600, designed to perform a similar role to the E-2C/D Hawkeye launched from U.S. carriers, is still in testing, according to the Pentagon's latest annual report on China's military.FROM SKI JUMPS TO CATAPULTSAs the Liaoning and Shandong gradually increase the tempo of their drills, China is preparing for sea trials of its next-generation carrier, the 80,000-tonne Fujian, state media reported last month. The Fujian is significantly larger, though conventionally powered, and will launch aircraft from electromagnetic catapults.The ship, which the Pentagon report said could be operational by 2024, is expected to carry new variants of the J-15 jet fighter, replacing the existing model that foreign analysts consider underpowered.\"The Fujian, with its more modern capabilities, will be just another test bed for a good few years,\" said Collin Koh, a defence scholar at Singapore's S. Rajaratnam School of International Studies.\"It won't be until we see the next generation of carriers that the Chinese designs and the PLAN's intentions will really settle down.\"The carrier program reflects the ruling Communist Party's aim of making the People's Liberation Army (PLA) a \"world class\" military by 2049, part of President Xi Jinping's vision of building \"a great modern socialist country\".",
        "One indication of China's ambitions, the attaches said, will be if carriers built after the Fujian are nuclear-powered like U.S. ones, allowing global range.A study published in December by the non-partisan U.S. Congressional Research Service noted that China would use its carriers to project power \"particularly in scenarios that do not involve opposing U.S. forces\" and \"to impress or intimidate foreign observers\".Several countries operate aircraft carriers but the U.S. remains the most dominant, running 11 carrier battlegroups with global reach.China, by contrast, could use its carriers primarily in the Asian theatre, working in tandem with submarines and anti-ship missiles to attempt to control its near seas.The Shandong's appearance off Taiwan's east coast to stage mock strikes last month surprised some analysts, given the island's proximity to land-based airfields. But, in the short term at least, China's military would struggle to defend the carrier out in the western Pacific in a clash with U.S. and allied forces.\"China's objective with the deployment of the Shandong is clear, it is a symbol of its political anger\" over U.S. engagement with Taiwan, said Yoji Koda, a retired admiral who commanded the Japanese fleet.In a battle, he said, it \"would be a very good target for U.S. and Japanese forces, and they would take it down at the very beginning.\"",
        "A U.S. defence official, speaking on the condition of anonymity as they were not authorised to talk publicly, said while China had made progress with its carriers, it had yet to master operations in difficult conditions or how to protect the vessels.One question was how the ships would be relevant in a conflict, the official said.HOPES AND SHORTCOMINGSChinese military and government researchers appear aware of the challenges, according to a Reuters review of over 100 recent articles published in dozens of publicly available Chinese defence journals.The official PLA Daily in October published an interview with an aircraft carrier aviation unit where the deputy chief of staff, Dai Xing, acknowledged \"many shortcomings in preparing for war\", and a gap between sailors' training level and combat requirements.A September editorial published in a magazine run by a PLA weapons manufacturer, titled \"Four great advantages the PLA has in attacking Taiwan\", did not mention the role of Chinese carriers. Instead, it said, China's land-based ballistic missiles would be enough to overwhelm potential intervention from U.S. carriers.Two earlier editorials in the same publication, Tank and Armoured Vehicle, noted that China's carriers would remain in their infancy for the foreseeable future and that other surface ships would be more useful in a conflict in the East China Sea.",
        "Other articles in similar publications outline pilot recruitment and training problems, vulnerabilities to submarine attack and command issues - which some foreign analysts say is a problem for a navy that still sails with political commissars with executive authority.When at sea, U.S. carriers fly almost constantly, routinely operating fighter, electronic-warfare and surveillance aircraft to create a protective screen around the battlegroup.Beyond the expense and danger of such operations, one key element is mastering devolved command systems, particularly in a crisis such as a fire or crash onboard when planes are airborne and the flight deck is disabled.The U.S. has spent decades perfecting such systems, having expanded carrier operations after their importance was highlighted in the Allied victory over Japan in the Pacific in World War Two.\"The continuous operation of its carriers sits at the very core of what makes the U.S. military absolutely preeminent,\" said Singapore-based defence analyst Alexander Neill, an adjunct fellow with Hawaii's Pacific Forum think tank.In the medium term, China is likely to start sending battlegroups into the Indian Ocean, where China's presence is minimal beyond routine submarine operations, the attaches and defence analysts said.Operating far from the security of land-based airfields would test China's capability, but preparations are underway.The pier at China's first major offshore military base in Djibouti was recently extended, and could now fit a carrier, the Pentagon report noted. (Reporting by Greg Torode in Hong Kong, Eduardo Baptista in Beijing and Tim Kelly in Tokyo; additional reporting by Idrees Ali and Phil Stewart in Washington; editing by David Crawshaw and Gerry Doyle)"
    ]
}