{
    "articleURL": "/wires/ap/article-12056705/Yankees-Arozarena-help-bring-big-crowds-series-Rays.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Even with among the best starts in major league history, the Tampa Bay Rays needed a visit from the New York Yankees to draw big crowds to Tropicana Field.",
        "\"Every time you play the Yankees, it feels like you´re playing in the World Series,\" Rays first baseman Yandy Díaz said through a translator.Tampa Bay´s 28-7 start ranks among World Series-winning teams such Kirk Gibson´s 1984 Detroit Tigers, Joe DiMaggio´s 1939 Yankees and the 1928 Yankees, which included Babe Ruth and Lou Gehrig.The first meeting this season between the AL East foes had the Rays opening up the normally closed upper deck. The attendance Saturday was 27,708, which bested the season-high 25,025 from opening day against the Tigers.Sunday's turnout was even better at 32,142. That's the biggest in the regular season since 40,135 for a game on June 17, 2016. It also the first crowd over 30,000 since opening day 2018 drew 31,042.And those present witnessed a sterling comeback as the Rays fell behind Yankees ace Gerrit Cole 6-0 before rallying for an 8-7 win in 10 innings in the series' third straight one-run game.",
        "The total turnout through the first two games was 52,715, lifting the 2023 home attendance average to 17,137. It ranked eighth-best in the AL, an increase from last year´s 13,927.Despite six postseason appearances over the stretch, the Rays haven´t had a 20,000 average since 2010.Tampa Bay manager Kevin Cash likes the atmosphere of a boisterous crowd.",
        "\"This place, when there´s a lot of people in here, it gets really loud,\" Cash said. \"I appreciate the fans coming out. Anytime we get a packed house, it´s pretty exciting.\"Tampa Bay´s 5-4 victory in Friday´s series opener had that playoff feel from the start. Popular Rays left fielder Randy Arozarena homered in the first inning, and was hit by what both team called unintentional pitches in each of his next two plate appearances,The ensuing barking between the two dugouts prompted the umpires to issue an warning to both benches. Unhappy that a warning wasn´t given earlier, Cash stormed out of the dugout to make his point and was ejected.Adding to it all was \"Randy Land,\" a section of seats in left field set aside for Friday´s game where fans got a Arozarena T-shirt.Part of the package includes a free soda, water or beer - for those of legal age - if Arozarena goes deep. He quickly obliged.\"Very happy and excited,\" said Arozarena, through a translator. \"I know the fans are pretty excited, too, because they´re able to drink for free because of me.\" ___ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}