{
    "articleURL": "/money/markets/article-12043669/No-cause-alarm-increase-bad-loans-insists-Lloyds-quarterly-profits-soar-2-3bn.html",
    "content": [
        "Lloyds said a ‘modest’ increase in borrowers in arrears was no cause for alarm as quarterly profits rose to £2.3billion.",
        "Rising interest rates have boosted lenders but squeezed borrowers, some of whom are finding it more difficult to pay.Lloyds, Britain’s biggest mortgage lender, said while more borrowers fell into arrears and defaulted on loans, these were at or below pre-pandemic levels.",
        "Problems mostly related to loans sold before the 2008 crisis when buyers overstretched themselves. Chief financial officer William Chalmers said: ‘It’s very modest and doesn’t cause us any alarm.’The group, which owns Lloyds Bank as well as Halifax and Bank of Scotland, took a £243million charge for the risk of loans going bad.First-quarter profits were up by 46 per cent compared to the same period a year ago as the rise in interest rates boosted the net interest margin, the gap between what lenders earn from borrowers and pay savers.Interest rates are expected to rise even further but the bank did not upgrade its outlook for the full year, signalling caution. Shares fell by 3.6 per cent, or 1.7p, to 45.98p.Lloyds slightly upgraded its outlook for the UK economy but expects GDP to shrink 0.6 per cent in 2023 and house prices to fall 5.3 per cent.Chief executive Charlie Nunn said: ‘The macro-economic outlook remains uncertain.’Lloyds was the latest UK bank to report quarterly results for the period in which several US lenders collapsed, as well as 167-year-old Credit Suisse. ",
        "Lloyds seemed to shrug off the crisis as profits beat expectations. But it has seen a fall in deposits of £2.2billion.Smaller rival Metro Bank said it had enjoyed a second quarter of profitability. Metro also saw an outflow of deposits – of £400million – over the period.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}