{
    "articleURL": "/wires/ap/article-12043263/US-approves-1st-vaccine-RSV-decades-attempts.html",
    "content": [
        "WASHINGTON (AP) - The U.S. approved the first vaccine for RSV on Wednesday, shots to protect older adults against a respiratory virus that´s most notorious for attacking babies but endangers their grandparents, too.",
        "The Food and Drug Administration decision makes GSK´s shot, called Arexvy, the first of several potential vaccines in the pipeline for RSV to be licensed anywhere.The move sets the stage for adults 60 and older to get vaccinated this fall - but first, the Centers for Disease Control and Prevention must decide if every senior really needs RSV protection or only those considered at high risk from the respiratory syncytial virus. CDC´s advisers will debate that question in June.After decades of failure in the quest for an RSV vaccine, doctors are anxious to finally have something to offer - especially after a virus surge that strained hospitals last fall.\"This is a great first step ... to protect older persons from serious RSV disease,\" said Dr. William Schaffner, medical director of the National Foundation for Infectious Diseases, who wasn't involved with its development. Next, \"we´re going to be working our way down the age ladder\" for what´s expected to be a string of new protections.The FDA is considering competitor Pfizer´s similar vaccine for older adults. Pfizer also is seeking approval to vaccinate pregnant women, so their babies are born with some of mom´s protection.",
        "There isn't a vaccine for kids yet but high-risk infants often get monthly doses of a protective drug during RSV season - and European regulators recently approved the first one-dose option. The FDA also is considering whether to approve Sanofi and AstraZeneca's one-shot medicine.",
        "\"This is a very exciting time with multiple potential RSV solutions coming out after years of really nothing,\" said Dr. Phil Dormitzer, chief of vaccine research and development for GSK, formerly known as GlaxoSmithKline.RSV is a cold-like nuisance for most people but it can be life-threatening for the very young, the elderly and people with certain high-risk health problems. It can impede babies´ breathing by inflaming their tiny airways, or creep deep into seniors´ lungs to cause pneumonia.In the U.S., about 58,000 children younger than 5 are hospitalized for RSV each year and several hundred die. Among older adults, as many as 177,000 are hospitalized with RSV and up to 14,000 die annually.Why has it taken so long to come up with a vaccine? The field suffered a major setback in the 1960s when an experimental shot worsened infections in children. Scientists finally figured out a better way to develop these vaccines - although modern candidates still were first tested with adults.GSK´s new vaccine for older adults trains the immune system to recognize a protein on RSV´s surface, and contains an ingredient called an adjuvant to further rev up that immune reaction.In an international study of about 25,000 people 60 and older, one dose of the vaccine was nearly 83% effective at preventing RSV lung infections, and reduced the risk of severe infections by 94%.",
        "To see how long protection lasts, GSK is tracking study participants for three years, comparing some who get just one vaccination during that time and others given a yearly booster.Shot reactions were typical of vaccinations, such as muscle pain and fatigue.There was a hint of a rare but serious risk - one case of Guillain-Barre syndrome, which can cause usually temporary paralysis, and two cases of a type of brain and spinal cord inflammation. The FDA said it was requiring the company to continue studying if there really is a link to the vaccine.If the CDC ultimately recommends the vaccination for some or even all seniors, it will add another shot for the fall along with their yearly flu vaccine - and maybe another COVID-19 booster.\"We´ll have to educate the population that this virus that not everyone has heard about is actually an important threat to their health in the wintertime,\" said Schaffner, an infectious disease expert at Vanderbilt University. ___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}