{
    "articleURL": "/tvshowbiz/article-12047143/Coronation-Street-SPOILERS-Faye-tempted-LEAVE-Weatherfield.html",
    "content": [
        "Faye Windass' feelings for her ex Jackson Hodge could force her to leave Weatherfield on Coronation Street next week.",
        "The pair are dangerously close to being caught by her fiancé Craig, after she debates whether to relocate to Slough with their daughter Miley.Since reconnecting with her estranged daughter, Faye is considered leaving Craig for Jackson despite getting engaged.In upcoming scenes, the pair are nearly caught out by Craig during a tense moment - will their growing chemistry be exposed?In the coming episodes, Miley admits how much she's going to miss her mother, with Faye struggling to hide her emotions, as her daughter pleads that she should move to Slough with her.",
        "Later, Faye (Ellie Leach) tells Beth (Lisa George), Sally (Sally Dynevor) and Izzy (Cherylee Houston) how she plans to throw a surprise party for Craig to celebrate his CID secondment. Jackson and Miley persuade Faye to help her with her family tree school project and so Faye and Gary both help Miley with her family tree. When Jackson praises her, Faye basks in his flattery which doesn't go unnoticed by Gary. With Beth, Sally and Tim's help, Faye goes through the details of Craig's party with Leanne.Gary quizzes Faye about her feelings for Jackson, and she admits that Jackson tried to kiss her but it's Craig she loves and Jackson refuses to accept it. After being lured into the furniture shop by Gary, Jackson tells Faye that by choosing Craig over him, she's making the biggest mistake of her life.",
        "Meanwhile Craig arrives at the bistro and is taken aback to find all his family and friends there. Noting that both Faye and Jackson are missing, Craig calls Faye's phone, and when he hears it ringing in the furniture shop, he heads over. ",
        "Hearing Craig approach, Faye orders Jackson to hide under a desk as Craig enters the shop, will he find Faye alone with Jackson?Faye's turmoil comes amid news that Ellie Leach, 22, is reportedly set to leave the ITV show in July this year. The actress first stepped foot onto the cobbles as a wide-eyed nine-year-old back in 2011, playing the adopted daughter of Eddie and Anna Windass. Her character is said to have been 'written out', with Ellie grateful that Faye will not be 'killed off.' A source told The Sun: 'Ellie's been on the soap since she was 10 years old so it's all she's known, she sees the cast like an extension of her family.'They added: 'She's sad to be leaving, but grateful that her character won't be killed off. She's going to have a go at trying other acting roles for a bit.'MailOnline has contacted Ellie's representative for comment. Last year, Ellie admitted that she 'definitely didn't imagine' portraying Coronation Street's Faye, 10 years later as she remarked: 'I feel like I've been there my whole life.'",
        "In the interview, the actress, reflected on her decade-long role and said she hoped to stay in her job 'forever'. Coronation Street airs every Monday, Wednesday and Friday on ITV at 8pm. "
    ]
}