{
    "articleURL": "/wires/aap/article-12048617/Controversial-parenting-welfare-obligations-scrapped.html",
    "content": [
        "The government will scrap a controversial parenting welfare program and immediately suspend compulsory obligations it says are punitive, counterproductive and cause harm.",
        "The ParentsNext program sent new parents to an employment provider and required parents to do training, education and parenting courses to maintain welfare.It covers parents of children aged nine months to six years who are under the age of 55 and have not worked in the previous six months.It also covered parents who hadn't completed high school and had been on income support for a certain amount of time.The scheme will be scrapped from July 1 next year.Finance and Women's Minister Katy Gallagher said the government was committed to listening to women and making their lives better and fairer.Of the 98,000 people on the program, 95,000 are women.\"It's a small group of vulnerable Australians who, when they didn't show up to take their kid to the library for story time, had their money withheld,\" she told reporters in Canberra on Friday.Shadow attorney-general Michaelia Cash said it was an astonishing move by the government given the program \"keeps young parents, the overwhelming majority of whom are young women and single parents, connected to the workforce\".\"By abolishing ParentsNext, the Albanese government is punishing some of Australia's most vulnerable people and will destroy their connection to the workforce,\" Senator Cash said.\"Prime minister Albanese does not believe in the concept of mutual obligation.",
        "\"This is the basic principle that if you are receiving assistance, you should be looking for work or preparing for work. The coalition, in contrast, believes in mutual obligations because we know that the best form of welfare is a job.\"Senator Gallagher said the opposition didn't understand their own program and that it was more about providing opportunities to get job ready.\"We're going to take any free advice from the opposition about skill shortages that exists in the country after they did so little to skill up the workers we need for the future on ParentsNext,\" she said.The Australian Council of Social Service welcomed the axe, saying the obligations were unfair and punitive.Chief executive Dr Cassandra Goldie said 60 per cent of the 230,000 women on the single parenting payment had experienced domestic and family violence.\"When forced into the ParentsNext program they were then subject to pointless and intrusive activity requirements for parents with children as young as nine months, enforced by threats of income support payment suspensions,\" she said."
    ]
}