{
    "articleURL": "/sciencetech/article-12050121/Uranus-moons-Titania-Oberon-oceans-warm-support-life.html",
    "content": [
        "They are likely insulated enough to retain internal heat needed to host an oceanExperts also found what may be a potential heat source in moons' rocky mantlesIf there is extraterrestrial life in our solar system, experts have long thought it could be hiding beneath Mars' surface, in Venus' clouds or in the icy oceans of Jupiter and Saturn's moons.",
        "But a new study points to another possibility.NASA scientists say Uranus' moons Titania and Oberon may also have oceans warm enough to support life, suggesting that we should look there too in our hunt for aliens close to home.They made their discovery after re-analysing data from Voyager 2's close flybys of Uranus in the 1980s, as well as using computer modelling to look for signs of water on five of the planet's largest icy moons.It is the first piece of research to establish how the interior makeup and structure has evolved on Ariel, Umbriel, Titania, Oberon, and Miranda. ",
        "What they found is that four of those – all except Miranda, the innermost and fifth largest of Uranus moons – likely contain an ocean between their cores and icy crusts.",
        "ArielBelindaBiancaCalibanCordeliaCressida  CupidDesdemonaFerdinandFranciscoJulietMabMargaretMirandaOberonOpheliaPerditaPortiaProsperoPuckRosalindSetebosStephanoSycoraxTitaniaTrinculoUmbriel (Moons in bold are the five that were studied in the new NASA research)",
        "These bodies of water could be so vast that they are each dozens of miles deep, the NASA researchers from the Jet Propulsion Laboratory in Southern California revealed.They came to their conclusion after establishing that Ariel, Umbriel, Titania and Oberon are likely insulated enough to retain the internal heat that would be needed to host an ocean.Better still, on Titania and Oberon these oceans may even be warm enough to potentially support extraterrestrial life, the scientists said.",
        "This was supported by the discovery of what could be a potential heat source in the moons' rocky mantles, which release hot liquid, and would help an ocean maintain a warm environment. In all, Uranus has at least 27 moons circling it, with the four largest ranging from Ariel – at 720 miles (1,160 km) across – to Titania, which is 980 miles (1,580 km) across. Experts have long believed that the latter, given its size, would be most likely to retain internal heat because of the warmth created by radioactive decay.As a comparison, here on Earth 50 per cent of the heat given off by our planet is generated by the radioactive decay of elements such as uranium and thorium.It had been thought that Uranus' other large moons were too small to retain the heat needed to prevent an underground ocean from freezing, but the new research challenges this belief.One of the other reasons scientists had assumed this to be the case is because the warmth created by the gravitational pull of Uranus is only a minor source of heat.With other planets such as Jupiter and Saturn, a gravitational phenomenon known as tidal heating helps to significantly warm their moons.This gravitational tug-of-war between the moons and the planets themselves causes the natural satellites to stretch and squish enough to warm them.",
        "It is thought that this could help warm the moons' waters and create conditions possible for life. ",
        "Voyager 1 is currently 14.7 billion miles away from Earth, travelling northward through space.The probe sent back data to NASA once it reached interstellar space that cosmic rays are as much as four times more abundant in that region, beyond the sun's direct influence, than in the vicinity of Earth.This suggests that the heliosphere, the region of space that contains our solar system's planets, may act as a radiation shield.Meanwhile, Voyager 2 is now 12.3 billion miles from Earth, travelling south towards the interstellar region.The contrasting locations of the two spacecraft allow scientists to compare two regions of space where the heliosphere interacts with the interstellar medium.Voyager 2 crossing into the interstellar medium allows scientists to sample the medium from two different locations at the same time.",
        "'When it comes to small bodies – dwarf planets and moons – planetary scientists previously have found evidence of oceans in several unlikely places, including the dwarf planets Ceres and Pluto, and Saturn's moon Mimas,' said the new study's lead author Julie Castillo-Rogez, of NASA's Jet Propulsion Laboratory. 'So there are mechanisms at play that we don't fully understand. 'This paper investigates what those could be and how they are relevant to the many bodies in the solar system that could be rich in water but have limited internal heat.'",
        "By studying the composition of these oceans, scientists are also able to learn about materials that might be found on the moons' icy surfaces as well — for instance if substances underground have been pushed up by geological activity.As an example, at least one of Uranus' largest moons – Ariel – has material that could be from icy volcanos which has flowed on its surfaced relatively recently.There are also what appear to be recent surface features on Miranda, which suggest it may have retained enough heat to have an ocean for a certain amount of time, although it likely wasn't for very long.Thermal modelling shows that the moon loses heat too quickly and is probably frozen now.Digging into what lies beneath and on the surfaces of these moons is important because it will help inform scientists as they prepare for future missions to the seventh planet from the sun.For example, they need to know what science instruments would be the most helpful to attach to a spacecraft or probe which would elicit the most informative findings.'We need to develop new models for different assumptions on the origin of the moons in order to guide planning for future observations,' Castillo-Rogez added.",
        "The researchers built computer models using data from NASA's Galileo, Cassini, Dawn, and New Horizons spacecrafts, each of which discovered ocean worlds.",
        "This information included details on the chemistry and geology of Saturn's moon Enceladus, Pluto and its moon Charon, and Ceres — all icy bodies that are about the same size as the Uranian moons. As well as offering an insight into the porous surfaces of the worlds, the modelling revealed a high concentration of chlorides and ammonia beneath the surface.This is significant because ammonia has anti-freezing properties, while salt would also stop water on the icy moons from freezing.The NASA scientists now hope to continue developing models of the Uranian system in preparation for potential future missions to explore the distant ice world and its moons.The research has been published in the Journal of Geophysical Research.",
        "A study analysing data collected more than 30 years ago by the Voyager 2 spacecraft has found that the Uranus's global magnetosphere is nothing like Earth’s, which is known to be aligned nearly with our planet’s spin axis.",
        "According to the researchers from Georgia Institute of Technology, this alignment would give rise to behaviour that is vastly different from what’s seen around Earth.Uranus lies and rotates on its side, leaving its magnetic field tilted 60 degrees from its axis.As a result, the magnetic field ‘tumbles’ asymmetrically relative to the solar wind.As a result, the magnetic field ‘tumbles’ asymmetrically relative to the solar wind.When the magnetosphere is open, it allows solar wind to flow in.But, when it closes off, it creates a shield against these particles. The researchers suspect solar wind reconnection takes place upstream of Uranus’s magnetosphere at different latitudes, causing magnetic flux to close in various parts."
    ]
}