{
    "articleURL": "/wires/pa/article-12050609/Police-urged-probe-video-Boris-Johnson-allegedly-not-wearing-seatbelt.html",
    "content": [
        "Police are being urged to investigate after a video emerged of Boris Johnson allegedly not wearing a seatbelt in what appears to be a moving vehicle.",
        "In a video being widely shared on social media, the former prime minister is heard urging Derbyshire Conservatives ahead of Thursday’s local elections to “get as many people as possible to turn out and vote for us”.Mr Johnson does not look to have been wearing a seatbelt in the 42-second clip which appeared to have been self-recorded.The Liberal Democrats have called on the police to investigate a “potential breach of the law”. The police should investigate this potential breach of the law immediately  Liberal Democrat MP Christine Jardine  The message was said to have been shared on Twitter by Derby North MP Amanda Solloway but seems to have since been deleted.Derbyshire Police said there is “no information” to suggest the former Tory leader filmed the video while in the county.",
        "The question over whether Mr Johnson was wearing a seatbelt has echoes of his successor’s brush with the law.Prime Minister Rishi Sunak was fined by police after being spotted without a seatbelt in an Instagram video he filmed while travelling during a visit to Lancashire on January 19.Christine Jardine, Lib Dem Cabinet Office spokeswoman, said: “This looks like yet another high-level Conservative ignoring the law by not wearing his seatbelt.“If confirmed, this would be just further proof that Johnson and Sunak are cut from the same cloth.",
        "“Every time it’s one rule for the Conservatives and one for everybody else. The police should investigate this potential breach of the law immediately.”Derbyshire Police said on Twitter: “We are aware of a video of former prime minister Boris Johnson urging voters in Derbyshire to cast their ballot.“The force was not notified of any visit by Boris Johnson to Derbyshire yesterday – and we have no information to suggest that this was taken while in the county.”Mr Johnson’s spokesman has been approached for comment.Derbyshire was home to several key contests during Thursday’s local elections in England.Labour retained control of Bolsover after gaining seats and winning more than half of the 37 available on the council, having held a slim majority ahead of the vote.Results in Derby, where every seat is in play and where Labour is hoping to oust the minority Tory administration to become the largest party, and South Derbyshire – another expected two-way tussle between the Tories and Labour – are expected later on Friday."
    ]
}