{
    "articleURL": "/tvshowbiz/article-12057423/Tom-Cruise-makes-list-cameo-King-Charles-star-studded-Coronation-concert.html",
    "content": [
        "Tom Cruise made a cameo during King Charles' star-studded Coronation concert on Sunday night in a surprise pre-recorded segment.",
        "The A-list actor, 60, was flying his iconic Top Gun plane in the cameo during an interlude between performances as stars including Pierce Brosnan and Bear Grylls discussed the King's military service.A clip of Tom then came up on the screen as he flew a plane and quipped: 'Pilot to pilot - your Majesty, you can be my wingman anytime!'King Charles served in both the Navy and air force during his military career between 1971 and 1994. Top Gun: Maverick star Tom is known for his love of flying and appeared in the P-51 Mustang which featured in the film. The cameo was part of a series of pre-recorded sketches revealing little-known facts about the monarch. ",
        "The King and Queen of the royal family joined around 20,000 members of the public at the Coronation Concert to continue the celebrations after their crowning at Westminster Abbey on Saturday.The Coronation Concert saw performances by Paloma Faith, Katy Perry, Lionel Richie and veteran rock guitarist Steve Winwood.The show in Windsor, which was hosted by Downton Abbey and Paddington star Hugh Bonneville, started at 8pm. Buckingham Palace promised 'global music icons and contemporary stars' for the big concert.It was the highlight of the second day of coronation celebrations with around 20,000 members of the public attending.",
        "Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse also made appearances via video.The series of pre-recorded sketches revealed little-known facts about the monarch and also included moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, also performed.Meanwhile, fashion designer Stella McCartney delivered a spoken word performance with a conservation theme which reflected her and the King's 'shared passion for environmental sustainability'.Her performance was part of a broader nature-themed section of the concert which also included a rendition of a 1980s hit by classical-soul composer Alexis French and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor also delivered a spoken-word performance.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.",
        "The concert was broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds.",
        "Former Desert Island Discs and Crimewatch presenter Kirsty Young anchored the special live broadcast of the concert in the grounds of Windsor Castle after reporting from a studio at Buckingham Palace on Saturday's coronation day.The concert on the castle's East Lawn also saw TV presenter Clara Amfo and Diversity dance troupe member Jordan Banjo speaking to the artists backstage.At Saturday's coronation, King Charles and Queen Consort Camilla were officially crowned by the Archbishop of Canterbury, Justin Welby.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year."
    ]
}