{
    "articleURL": "/news/article-12040249/Kevin-Costners-marriage-Cindy-Silva-ended-amid-rumors-affair-hula-dancer.html",
    "content": [
        "On Monday, Kevin Costner's wife of 19 years filed for divorce citing irreconcilable differences Christine Baumgartner first met Costner shortly after his first marriage to Cindy Silva ended in the 1990s but they didn't become a couple until 1998 The broke up for a period after she told him that she wanted children, Costner already had four children from three different relationships Kevin Costner's impending split from his wife of 19 years, Christine Baumgartner, will be the Oscar-winning director's second time in divorce court. ",
        "Baumgartner filed Monday to end their union citing unspecified 'irreconcilable differences.' It's believed that the pair have a pre-nuptial agreement. In November 1994, Costner's then wife, Cindy Silva, filed for divorce after 16 years of marriage. The couple met while they were both students at California State University - Fullerton. They would go on to have three children together.The pair split amid multiple reports that Costner had been having an affair with a celebrated hula dancer named Michele Amaral while he was filming his multi-million dollar flop Waterworld in Hawaii. Eventually, Silva was awarded around $80 million in the divorce settlement. Less than two years after that split, Costner had a son, Liam, with Bridget Rooney, heiress to the Pittsburgh Steelers, and aunt of actresses Rooney and Kate Mara.  That affair is rumored to have cost the actor $7 million. ",
        "Amaral was also married as well as being a mother-of-two when she met Costner. A report at the time in the New York Daily News said that the pair met at the Mauna Lani hotel and shortly afterwards Amaral was 'spotted creeping out of his $4,500-a-day villa. According to a Departures Magazine feature, Amaral has taught hula across the world and is known as the island's premier soloist.  The Daily News report said that Silva was alerted to the affair by someone who was working on Waterworld and was fired.",
        "The same article accused Costner of multiple infidelities during his marriage. At the time Costner strenuously denied the allegations saying that he was merely interviewing Amaral for a job. During an interview where Amaral was brought up, Costner became infuriated. 'This woman has done nothing wrong and yet has had to share the harsh light of celebrity with me. I feel embarrassed, and I don't think there's one thing I can do to make her life better.''This woman has a name and to make her a thing is the worst part of all. It's wrong for her and her husband,' Costner said. ",
        "In a separate interview, The Bodyguard star took responsibility for his role in the demise of his marriage, but did not go into detail. 'A series of events conspired to happen at the same time. I know it hurt some people that I had failed in my marriage. And the marriage was my own failure,' he said. Costner said in a 1995 interview with Parade Magazine that he never even spoke to Amaral on the phone. He also listed off the other women he was supposedly linked to including Playboy model Angie Everheart and the daughter of casino magnate Steve Wynn. 'It was hard on Cindy and our children. It didn't help things. The only thing it did was hurt. The collapse of my marriage was the hardest thing of all for me,' the Dances With Wolves star said. ",
        "Costner went on to express his love for his first wife: 'You can put this on the record. Through all the pain, Cindy's been what I always thought she was a real lady. I still have love for Cindy.'The article notes that Costner was shortly due to begin filming the romantic comedy Tin Cup, it was on that movie's set where he met his second wife, Christine Baumgartner, who was then 21.  Silva supported Costner when he was a struggling actor, taking on odd-jobs that included performing as Snow White at Disneyland. ",
        "'We have amicably resolved all issues regarding our children and financial affairs and a full marital settlement has been reached. We ask to be allowed the dignity of sorting through this more painful part of our lives in private,' a statement from the couple read in 1994.  A representative for the Yellowstone star asked for privacy Tuesday while saying that 'circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action' with Baumgartner. The couple share three children, 12, 14 and 15, both have filed for joint custody. The family's primary residence was in Ventura, California, 30 miles south of Santa Barbara, where they also own an oceanfront mansion. The couple has a prenup, reports TMZ. ",
        "In a 2012 interview with Parade Magazine, Costner was asked about what the secret was to a good marriage.'Maybe it’s the ability to say you’re sorry. I know that sounds so simple. If you’re willing to tell somebody that you love them, are you also willing to say you’re sorry? You need to, even when you think you’re in the right,' The Untouchables star said. The couple first began dating in 1998, having met around 1996 while Costner was filming his movie Tin Cup. The Bodyguard star said that at the time he first met her, he wasn't ready to fall in love again. Both are graduates of California State University - Fullerton. Baumgartner graduated with a degree in business. They married in 2004 in Aspen, Colorado, where Costner has long maintained a 160-acre ranch, known as The Dunbar. Rooms can be rented on the property for as much as $36,000 per night. The reason for the long courtship was because Costner was not sure if wanted more kids. The uncertainty even led them to break up for a period prior to their engagement. 'Fear kept me from marrying Christine. [She] wanted a child, but I was afraid I couldn’t be an effective father.''I woke up and thought, ‘Am I going to lose a beautiful woman who is willing to be with me to my very last breath because I am afraid to say yes to a child?' That’s all it took. Sometimes you learn the thing you’re most afraid of will save your life,' he told Closer Weekly in 2018. ",
        "Costner told the Daily Telegraph in 2011 that the reason for his four year hiatus from making movies was because of his new family.  ",
        "Christine is a handbag designer by trade. Her label is named Cat Bag Couture. The Daily Telegraph feature refers to her as a 'model.'It was her Oscar-winning husband who helped her to get her start in style. 'When I came up with some samples, I showed them to Kevin, and he said they were beautiful and amazing. When I came up with some samples, I showed them to Kevin, and he said they were beautiful and amazing,' Christine told the Denver Post in 2005. 'I love classic women who are strong and feminine,' she said in the interview. The piece also mentioned that the bags made an appearance in an episode of Desperate Housewives.The article listed the bags as retailing at between $275 and $997. The website for Cat Bag Couture is no longer active. 'I don’t know if we’ll ever be a big company. I have mixed feelings about it. I have so much room to grow,' Christine told the Post. Online records show that Christine now operates a business named Coda Bands, a fashion accessory business. As a recently as 2020, Costner spoke glowingly about how the couple's relationship strengthened during the Covid-19 pandemic. He told People: 'Our partnership has really come into focus about what we do for each other and how we deal with our family.'",
        "In 2022, Radar Online reported that Costner was given an ultimatum from his wife. The report said that she was demanding that he quit his hit show Yellowstone due to the fact that he was gone from home so often. 'The show is such a mega-hit, producers want it to go on forever! [Baumgartner] wants a firm commitment this is his last season — or he might have to!,' a source told the website. "
    ]
}