{
    "articleURL": "/wires/afp/article-12042553/Russia-blames-Ukraine-foiled-drone-attack-aimed-Putin.html",
    "content": [
        "Russia said Wednesday it had shot down two drones at President Vladimir Putin's Kremlin residence in what it called a Ukrainian \"terrorist\" assassination attempt.",
        "Kyiv insisted it had \"nothing to do\" with the alleged attack, suggesting it was \"staged\" by Moscow, while the US said the report should be taken with a \"shaker of salt\".\"We do not attack Putin or Moscow,\" Ukrainian President Volodymyr Zelensky said on a visit to Finland.\"We defend our villages and cities.\"On the same day, Kyiv said Russian strikes had killed 21 people in the southern Ukrainian region of Kherson -- including on a supermarket and a train station.Russia announced the drone incident after a series of major sabotage attacks in the run-up to celebrations for the nation's most important holiday on May 9, marking the Soviet victory over the Nazis.\"Today at night, the Kyiv regime attempted to strike the Kremlin residence of the President of the Russian Federation with unmanned aerial vehicles,\" the Kremlin said.\"Two unmanned vehicles were aimed at the Kremlin... the devices were put out of action,\" a Kremlin statement said.",
        "The operation was described as \"a planned terrorist act and an attempt on the life of the President of the Russian Federation\".Moscow said Putin was not hurt and there were no casualties.\"Russia reserves the right to take retaliatory measures wherever and whenever it deems necessary,\" the Kremlin statement continued.",
        "Kremlin spokesman Dmitry Peskov said Putin was working at his residence near Moscow on Wednesday and would still take part in a scheduled World War II Victory Day parade on Red Square next week as planned.Russia later launched a terrorism probe \"in connection with the attempt to strike the Kremlin residence of the President of Russia.\"Kyiv suggested that Moscow \"staged\" the attack, which came ahead of a widely expected Ukrainian spring offensive.\"Such staged reports by Russia should be considered solely as an attempt to prepare an information background for a large-scale terrorist attack on Ukraine,\" presidential spokesman Mikhaylo Podolyak said.- 'Shaker of salt'-US Secretary of State Antony Blinken also cast doubt on the veracity of the report.\"I've seen the reports. I cannot validate them, we simply don't know,\" Blinken said at an event in Washington.\"I would take anything coming out of the Kremlin with a very large shaker of salt.\"",
        "On Moscow's iconic Red Square, AFP saw some people climbing external stairs onto the domed roof of a building known as the Kremlin Senate, which houses the presidential administration.The roof appeared to be unscathed despite unverified images circulating on social media apparently showing it being struck by an explosion from a possible drone.",
        "People were walking freely in the area and there was no strengthened police presence.Banners and seating have already been set up ahead of the May 9 parade, which Moscow has vowed will go ahead.There were calls in Moscow for a tough reaction against Ukraine.Ex-president Dmitry Medvedev called for the \"elimination\" of Zelensky.\"We will demand the use of weapons capable of stopping and destroying the Kyiv terrorist regime,\" said Vyacheslav Volodin, the speaker of the Russian Duma and Putin ally.- 'Shock and suspicion' -But on the streets of Moscow, AFP found people were shaken and confused.\"I feel something between shock and suspicion,\" said 21-year-old student Viktor.\"It is not very clear yet whether this is really some kind of military act or is it just a staging for unclear purposes.\"",
        "Others said this kind of major incident in Russia was only a matter of time, after months of drones hitting the country and increased apparent sabotage in recent days.The last five days have seen two trains derailed by explosions, oil depot fires near and in Crimea, and power lines blown up near Saint Petersburg.\"I was waiting for something like this to happen,\" 71-year-old Vera Ilyinichna said.The pensioner said it was good the drone had not hit a residential building.",
        "\"The Kremlin is better protected,\" she said.\"But residential buildings, where old people and kids live, where we work, that worries me more.\"- 'Everyone is worried' -Many were nervous.\"Everyone will be worried,\" said Andzhela, a 50-year-old woman who did not give her last name.\"It is not normal. It is open terrorism.\"The alleged thwarted Kremlin operation comes after a series of apparent sabotage incidents ahead of the May 9 celebrations.On Wednesday, officials said they were dealing with a major fire at a fuel depot close to the bridge to Russian-annexed Crimea.A source in the emergency services was quoted by TASS news agency as saying that the fire had been caused by a drone.As these apparent attacks behind Russian lines have become more frequent, a range of cities near the Ukraine border, but also some more distant, have cancelled May 9 parades.Moscow however has vowed that the central Red Square parade will go ahead as normal although extra precautions are being taken, including a ban on all unauthorised drone flights in the city.- Kherson shelling -The Kremlin news came as Ukraine prepares for a fresh offensive aimed at repelling Russian forces from the territory they currently hold in the east and south.",
        "Fighting sharply intensified on the southern front.Zelensky said 21 people were killed in the Kherson region in Russian strikes on the city of Kherson -- retaken by Ukrainian troops last November -- and nearby villages.He said a supermarket and a railway station had been hit.The Ukrainian leader posted images of bodies and wounded people on the floor of a vegetable aisle, with debris around them.Earlier, the city of Kherson announced a weekend-long curfew, in a possible sign that offensive preparations are being stepped up.The city will be under a will be under a 58-hour curfew from Friday evening until Monday morning.Regional officials said this was \"for law enforcement officers to do their job\", but similar long curfews have also been used in the past to facilitate troop and arms movements.Kherson fell to Russian troops in the first days of their offensive before being retaken by Ukraine in November last year.NATO's newest member Finland welcomed Zelensky on a surprise visit to take part in a summit with the leaders of the five Nordic nations, which have been key providers of military aid.\"I believe that this year will be decisive for us, for Europe, for Ukraine, decisive for victory,\" Zelensky said in the Nordic country."
    ]
}