{
    "articleURL": "/wires/ap/article-12043843/GOP-subpoenas-FBI-whistleblowers-claims-Biden.html",
    "content": [
        "WASHINGTON (AP) - A top House Republican subpoenaed FBI Director Chris Wray on Wednesday for what he claimed are bureau records related to President Joe Biden and his family, basing the demand on newly surfaced allegations he said an unnamed whistleblower made to Congress.",
        "The White House said it was the latest example in the yearslong series of \"unfounded, unproven\" political attacks against Biden by Republicans \"floating anonymous innuendo.\"Kentucky Rep. James Comer, chairman of the House Oversight Committee and Accountability, is seeking a specific FBI form from June 2020 that is a report of conversations or interactions with a confidential source. Comer, in a letter to Wray with Republican Sen. Chuck Grassley of Iowa, said that \"it has come to our attention\" that the bureau has such a document that \"describes an alleged criminal scheme\" involving Biden and a foreign national \"relating to the exchange of money for policy decisions\" when Biden was vice president and includes \"a precise description\" about it.The subpoena seeks all so-called FD-1023 forms and accompanying attachments and documents.The lawmakers used the word \"alleged\" three times in the opening paragraph of the letter and offered no evidence of the veracity of the accusations or any details about what they contend are \"highly credible unclassified whistleblower disclosures.\"Comer and Grassley said those \"disclosures\" demand further investigation, and they want to know whether the FBI investigated and, if so, what agents found.To the White House, the subpoena is further evidence of how congressional Republicans long \"have been lobbing unfounded, unproven, politically motivated attacks\" against the Bidens \"without offering evidence for their claims or evidence of decisions influenced by anything other than U.S. interests.\"",
        "A White House spokesperson, Ian Sams, said Biden \"has offered an unprecedented level of transparency\" about his personal finances with the public release of a total of 25 years of tax returns.The FBI and Justice Department confirmed receiving the subpoena but declined to comment further. The president's personal lawyers had no comment.Republicans claim they have amassed evidence in recent years that raise questions about whether Biden and his family have used their public positions for private gain.House Republicans have used the power of their new majority to aggressively investigate Joe Biden and Hunter Biden's business dealings, including examining foreign payments and other aspects of the family's finances. Comer has obtained thousands of pages of the Biden family's financial records through subpoenas to the Treasury Department and various financial institutions since January.Comer has not revealed much about the findings of his investigation so far. Most recently, Comer claimed one deal involving the Biden family resulted in a profit of over $1 million in more than 15 incremental payments from a Chinese company through a third party.Both Comer and Grassley have accused both the FBI and Justice Department of stonewalling their investigations and politicizing the agency´s yearslong investigation into Hunter Biden's taxes.Last month, an IRS special agent sought whistleblower protections from Congress to disclose a \"failure to mitigate clear conflicts of interest in the ultimate disposition\" of a criminal investigation related to the younger Biden´s taxes and whether he made a false statement in connection with a gun purchase."
    ]
}