{
    "articleURL": "/wires/aap/article-12049991/Posh-soft-roader-downsizes-packs-punch.html",
    "content": [
        "Six cylinders.",
        "It used to be the starting point for any serious 4WD or soft-roader.Enough power to roar down the freeway or, more to the point, grind your way through ankle-deep mud and slush.And to do that in a decent-sized SUV, you needed at least six cylinders worth of power.Many opted for considerably more - a V8 was often the preferred option - until the refinement and development of diesel technology meant an oil-burner became the engine of choice.Now, things have changed again - this time thanks to the all-new Lexus RX.A car that, through its five generations (it's been around since 1998) has been the Japanese luxury brand's most popular model. And for all of those 25 years, the RX has always been primarily powered by a quiet, smooth petrol V6 engine.No more.Now, it's four-cylinders all the way for this very posh soft-roader - a car that helped put Lexus on the map and also led the entire SUV market towards never-before seen levels of luxury with its plump leather, piped music and electric everything.That continues to be the case with its all-new fifth-generation model of the RX, even if the engine has changed format.And what a change it is. Instead of one four-cylinder option, they now have three. One has a turbocharger, one is boosted by some of Lexus' famous hybrid synergy drive and one gets a bit of both.",
        "Tested is the \"standard\" RX350, fitted with a 2.4-litre, four-cylinder turbocharged petrol engine delivering a stout 205 kilowatts and equally grunty 430 Newton metres. No complaints about the four-cylinder in this model, keenly priced at $87,500.Cough up another $4500 and you'll find yourself in the all-wheel-drive RX350H - which adds hybrid power to its normally-aspirated, 2.5-litre four-cylinder for a combined output of 180kW and 316Nm - not to mention a miserly thirst of just 6.4L/100km thanks to that hybrid help.The flagship RX500H will set you back $126,600 plus on road costs - which means with an option or two you'll be nudging the $150,000 mark - putting it roughly on a par with comparable rivals from BMW (the X5) and Mercedes-Benz (GLE).Thumping out a sparkling 273 kilowatts when both the petrol and electric engine are at full tilt, it might even wipe the smile off some of those German marques.The only complaint to muster about the entry-level RX350 was that, while able to match the old V6 for power and performance, it loses a bit of that legendary Lexus quietness, purely because the four-cylinder works harder to shunt this big SUV around.And yes, it is a big thing - despite looking so sleek and svelte.This model shed a few kilos in the switch from the bigger, heavier V6 engines, and consequently enjoys better driving dynamics than has previously been the case with the RX. The engine is responsive, the chassis nicely taut and the ride still Lexus-like. That makes for an impressive package.",
        "That all-new chassis is 40kg lighter than its predecessor, despite the fact this new RX is wider (by 25mm), lower (10mm) and just as long (4890mm) - and has a longer wheelbase (by 60mm) which helps the handling.So, what does this all mean? Well, not a whole lot, to be honest. The engine heart-transplant has made precious little difference to a car that will continue to turn heads despite the fact that it's no quicker than your average trayback ute (RX500F-Sport excepted) .Which brings us to one question. By leaving the \"350\" designation on the RX, could it be that Lexus was trying to pull a swifty on its loyal and loving customers by pretending the four-potter was still a V6?Surely not.After all, Lexus buyers (as distinct from BMW and Benz fans) are not particularly fussed by how many cylinders or buttons their car has. They just want it to be quiet and plush and expensive-looking - and the RX350 certainly still hits the mark on that score.It's fair to say most Lexus devotees wouldn't bother if the car was driven by rubber bands, provided they were the smoothest, quietest and most comfortable rubber bands around.So much for the conspiracy theory.While not rewriting the rules in any particular way, this is probably the nicest car ever to wear the badge, which is high praise.",
        "Inside, Lexus seems to have tweaked its \"relentless pursuit of perfection\" motto which saw it trying to reinvent one feature or another on every new model. This time, the Japanese engineers seem to have changed tack - instead taking existing technology and making it work as well as possible.That seems to be the case with the active cruise control and the 360-degree parking system is effortless to use - like most functions which are controlled by the wide touch-screen controller.The massive 14-inch screen is the centrepiece of a pleasantly scaled-back dash arrangement With minimalism replacing the buttons and switches so familiar on Japanese machines.Oh, there's also a warning system which monitors the driver's every mood and movement, warning you the instant it senses the driver might be getting tired or distracted.Another enjoyable feature was the electric-operated front and rear doors, which pop open when you touch a small button on the door trim - or on the exterior door handles.This fifth iteration of the RX ensures the model will continue to be an indelible part of the Japanese luxury marque's range.As well as being the best-looking RX model, it delivers a beautiful, serene and oh-so-posh interior which continues to push the needle on luxury and quietness.",
        "LEXUS RX350HOW BIG?Bigger in virtually every way than the previous model, except, of course, in engine size.HOW FAST?Even the entry-level model tops 200kW, giving the RX plenty of poke.HOW THIRSTY?The model tested uses 8.8L/100km - although both hybrid-equipped versions are more frugal.HOW MUCH?Prices start from $87,500 plus on road costs."
    ]
}