{
    "articleURL": "/wires/reuters/article-12039373/Chargers-QB-Justin-Herbert-throw-couple-weeks.html",
    "content": [
        "Chargers quarterback Justin Herbert expects to resume throwing this month as part of the next phase of his recovery from left shoulder surgery in January.",
        "Herbert, who had a torn labrum, continues to actively participate in voluntary workouts, primarily on rehabilitation and mobility exercises with trainers. He hasn't thrown the ball -- or participated in his beloved disc golf -- since last season ended in a dramatic loss to the Jacksonville Jaguars in the wild card playoff round.\"It's a pretty long process. Kind of expecting to be a five or six-month recovery and being on the lead shoulder, it's kind of tough throwing, golfing and doing all those things that are kind of explosive movements,\" Herbert said, estimating his progress to full health at 75 percent. \"I've done everything I can to rehab to get good movement back in it, strengthen it back up. But I knew it wasn't going to be an easy journey back. Just doing everything I can to be back.\"Herbert plans to attempt light throwing in the \"next couple of weeks,\" he said.General manager Tom Telesco said last week the Chargers are working with Herbert's reps on a long-term extension, but there are no signs of urgency. Los Angeles picked up Herbert's fully guaranteed fifth-year option for the 2024 season before Tuesday's deadline, which buys the franchise more time to plot for the future.\"I think that's probably a better question for my agent and the front office,\" Herbert said of extension talks. \"I'm kind of left out of those negotiations and I think my job now, my focus, is to be the best quarterback that I could be and to rehab my shoulder. Make sure that I could be back for these OTAs (Organized Team Activities) and do everything I can in the building,\" Herbert added. \"As far as (contracts are) concerned, I wish I could give you a better answer.\"",
        "The NFL might be looking for a better answer from Telesco and head coach Brandon Staley regarding Herbert's shoulder injury that led to surgery but didn't receive mention on the injury report for the wild-card game. He was listed on the Week 18 injury report with a shoulder injury.Herbert, who turned 25 in March, had 25 touchdown passes in 2022 while setting career-bests for completions (477), attempts (699) and completion percentage (68.2). Herbert said he's working with new offensive coordinator Kellen Moore to be ready when he's fully cleared to be on the field.\"I think you get as much as you can in the classroom, the walkthroughs, all of the different components to that thing,\" Moore said. \"Obviously, there will be some field work that Justin may not be able to be a part of -- as much as he would want to, we would all want to, but we'll catch up with it. We have plenty of time through the training camp and all of that.\"--Field Level Media"
    ]
}