{
    "articleURL": "/wires/reuters/article-12048351/Pistons-fire-assistant-GM-Rob-Murphy-alleged-harassment.html",
    "content": [
        "Assistant general manager Rob Murphy was fired by the Detroit Pistons for an alleged violation of the team workplace conduct policy.",
        "The firing this week is seven months removed from Murphy being placed on leave as the result of an investigation into whether he engaged in workplace misconduct with a female former employee.\"Rob Murphy no longer works for the Detroit Pistons or Motor City Cruise, in any capacity. Mr. Murphy was recently terminated for violation of company policy and the terms of his employment agreement. The facts that gave rise to his termination surfaced during a review, assisted by a national law firm, of allegations made by a former employee,\" the Pistons told the Detroit Free Press in a statement on Wednesday.The former employee, DeJanai Raska, told the Detroit Free Press in a story published Thursday that Murphy tried to force her into having sex. Raska came forward under her own volition to share her story and has filed suit against the Pistons and Murphy for sexual discrimination and harassment.Raska, 32, who began working as Murphy's executive assistant in September 2021, said the harassment included Murphy grabbing her buttocks, groping her in front of her 4-year-old daughter and saying he wanted to \"put a baby in her.\"\"Silence is not an option,\" Raska told the Free Press. \"It's not for me. It shouldn't be for any woman. ... This is my chance to voice the truth ... and to take my power back.\"",
        "The harassment went on for eight months, according to Raska.Murphy, 50, was the Pistons G League team president before he was promoted to assistant general manager in 2022.Murphy spent a decade as head coach at Eastern Michigan before joining the Pistons. Like general manager Troy Weaver, Murphy is a former assistant coach at Syracuse, among other stops in the college ranks.--Field Level Media"
    ]
}