{
    "articleURL": "/wires/reuters/article-12051783/GRAINS-Chicago-grains-track-end-higher-week-Black-Sea-jitters.html",
    "content": [
        "Slowing demand for US corn supplies to weigh on prices",
        "Talks on Black Sea grain deal in focus for wheat market(Updates prices, adds quotes in paragraphs 4 and 8, adds details on Black Sea in paragraphs 3 and 4, changes byline, changes lead, changes headline, changes dateline from previous SINGAPORE/PARIS)By Cassandra GarrisonMEXICO CITY, May 5 (Reuters) - Chicago grains and soybean futures were poised to end the week with marginal gains on Friday, as the market adjusts from being oversold after days of Black Sea uncertainty.Corn was on track to rebound after dropping to a nine-month low on news of cancelled sales to China and strong competition from Brazil.Wheat could also mark its first weekly rise in three amid uncertainties over a Black Sea export deal, which allows Ukraine to ship grains despite the war with Russia. Prices were impacted this week after Russia accused Ukraine of a failed attempt to kill President Vladimir Putin in a drone attack. Ukraine denied it.\"We had what really put a floor in the market when we focus back to Russia and Ukraine with the drone attack on the Kremlin,\" said Don Roose, president of Iowa-based U.S. Commodities. \"I think that was a wake up call of what's going on in the Black Sea area.\"The pace of grain shipments from Ukraine under the initiative has slowed as concerns grow over ships getting stuck if a deal is not renewed later this month, according to sources and data.",
        "Technical personnel from Turkey, Russia, Ukraine, and the United Nations were due to meet on Friday to discuss the Black Sea deal, Turkish Defence Minister Hulusi Akar said.The most-active corn contract on the Chicago Board of Trade (CBOT) rose 0.98% to $5.94-3/4 a bushel, as of 1011 CDT (1511 GMT), wheat added 1.63% to $6.55-1/2 a bushel and soybeans gained 1.2% at $14.34-3/4 a bushel.Markets also had eyes towards monthly U.S. crop report on May 12.\"We've got issues with lack of selling by the producer because it's planting season, we've got the debt ceiling concern and we have a crop report that's going to come out next Friday, expected to be negative,\" Roose added. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Uttaresh Venkateshwaran, Varun H K and Sohini Goswami)"
    ]
}