{
    "articleURL": "/sport/boxing/article-12052237/John-Ryder-admits-special-beat-Canelo-Alvarez-Mexicans.html",
    "content": [
        "Canelo Alvarez and John Ryder will go toe-to-toe in the ring on Saturday eveningCanelo will have the advantage on Saturday, facing Ryder in his native countryRyder may struggle with the temperature as it's set to be 26C during the fightThere's home advantage. Then there's the manic adulation of an entire machismo nation. Population 130 million.",
        "Sixty thousand of them roaring on their idol in a stadium crammed to patriotic hysteria.Canelo Alvarez, defender not only of the undisputed world super-middleweight championship but also the faith of Mexican manhood, puts this Saturday night into perspective for his English challenger John Ryder, saying: 'It will be very difficult for him here. He has never experienced an atmosphere like this.'Nor, the ruler of all the 12 stone belts might have added, has this 34-year-old Londoner ever competed in an event of such magnitude.Ryder's ring moniker is Gorilla but his mauling will have to be far mightier than his growling if he is to put an end to Canelo's vicious culling of British boxers.",
        "Seven have gone against the power and speed of the curiously red-haired pride of the red-hot state of Jalisco. Seven have failed.Five - namely Ryan Rhodes, Amir Khan, Liam Smith, Rocky Fielding and Billy Joe Saunders – were demolished, crushed, knocked out. The two who went the distance – Matthew Hatton and Callum Smith – survived those 12 rounds by defending deeper than Arsenal against Manchester City, with similar bleak returns on the score-sheets.Of his Brit-bashing, Alvarez says: 'Nothing personal. They are all good fighters so I have to prepare properly to beat them. As I have for Ryder. So this Saturday night he will be number eight.'",
        "The Gorilla is making all the right noises about everything that is at stake and all that has to be involved in his effort. Being valiant of heart, resilient of jaw, as fit as a fighter can be and better schooled than ever will not be enough. Ryder, intelligent as he is, knows that.'It will take something special from me,' he says. Extra special if he is to realise what he calls: 'A life-changing victory for myself and my family. One which would put me up there with the great British upsets abroad achieved by lads like Lloyd Honeyghan beating Donald Curry and Tyson Fury defeating Wladimir Klitschko and Deontay Wilder.'To beat Canelo out here on Mexico's Cinco de Mayo weekend, beat the best boxer in the world today, in a stadium, in his home town, might be seen as the biggest of them all. I do realise that I could go down in folk-lore. Be talked about for a very long time.'Life-changing? Ryder knows it will take a most famous victory to swell the hundreds of thousands of dollars he will receive here into the many millions which would come with forcing Alvarez to trigger a rematch clause in their contract.Something extra special? He says: 'I've spent my entire career working towards this biggest night of my life. I will have to rough him up a bit as well as box him. Work more angles. Try to be the quicker to the punch. But I realise that I will have to take risks if I'm to beat such a great fighter.'",
        "Therein lies the rub. This career has been an honest, dignified, hard-working, admirable accumulation of the experience and the wisdom which has brought him back from occasional deflating defeats to this brink of glory.Those setbacks on his record have encouraged Canelo to accept Ryder as the ideal opponent against whom to fully test the success of surgery on the broken hand he carried into a surprise second career defeat by Russian light-heavyweight Dmitry Bivol one year all but one day ago.Alvarez knows that vultures believing they scent decline are circling above him, over these vast, sun-burned acres of northern Mexico.He is ready, action man that he is, to shoot them down, saying: 'The recuperation has been good. I feel back to my best.'His people are ready, too. The buzz – more so than the buzzards – is out in force here. Man, woman, boy and girl.Canelo's own children were among 8,000 youngsters invited to the Friday weigh-in. Those four offspring will be at ringside in the new, aesthetically-designed Estadio Akron, not far from the old stadium in which Bobby Moore famously exchanged shirts with Pele at the end of the epic 1970 World Cup match between England and Brazil.Military history was made near here during Mexico's war of independence, the 200th anniversary year of which Canelo is honouring with this homecoming fight, his first on patriot soil for almost 12 years.",
        "It is his responsibility to bring the Cinco de Mayo weekend of national festivities to a triumphant climax, to the blaring accompaniment of multiple mariachi bands. Will he get a helping hand from the officials – and inevitably there has been controversy in some close decisions going his way in a long career – if Ryder takes him the distance?Mauricio Sulaiman, Mexican president of the WBC, has promised Ryder: 'The referee and the judges are all from neutral countries. They will be fair and if it goes to the score-cards the rightful winner will leave the ring with all fhe belts.'It will be a hot night in this high town. Guadalajara sprawls 5,100 feet above sea level and the temperature come the first bell at 9 pm is forecast to be in the high 70s. That will be stoked a few degrees extra by the pressure-cooker passion in the stadium.Ryder believes he has acclimatised fully by training at altitude and adjusting to heat while in California.There is even more at stake for Jalisco's Alvarez than for Islington's Ryder. Will that pressure weigh more heavily on Canelo?",
        "Ryder says he feels none. The super-star confronting him, whose nickname means cinnamon in Spanish, offers a smile as a reminder that he has won through all this many a time before.",
        "That he has. Ryder may offer stiffer opposition for longer than Alvarez has been led to expect. There is speculation that his being a southpaw may be of help. Although when the time comes to take risks his square, southpaw stance could leave him open to Alavarez's deadly trademark uppercut.The notion of another British coronation to follow in succession late into the night following this May 6 crowning of King Charles 111 is seductively romantic.But class usually tells in the prize-ring as well as the pageantry and the odds heavily favour the Cinnamon Kid snaring and caging the Gorilla. Probably in the middle rounds.Canelo v Ryder for the undisputed world super-middleweight championship will be televised late this Saturday night on DAZN."
    ]
}