{
    "articleURL": "/wires/reuters/article-12045745/Chemicals-group-Solvay-raises-outlook-shares-slip-lower-volumes.html",
    "content": [
        "By Marine Strauss",
        "BRUSSELS, May 4 (Reuters) - Belgian chemicals group Solvay reported higher-than-expected first-quarter results on Thursday and lifted its full-year profit and cash outlooks, but lower volumes hit its shares.Solvay said its ongoing lower volumes were offset by higher pricing in all its segments and pointed to some recovery in volumes in the second half of 2023.The company forecast earnings before interest, tax, depreciation and amortisation (EBITDA) for 2023 to grow within a range of 2% to 5% compared to 2022, and expects free cash flow at around 750 to around 900 million euros ($996 million).\"We have been favouring pricing against volumes so going forward in the second quarter, volumes are not going to recover much compared to quarter one,\" CEO Ilham Kadri said.\"We see probably a bit of recovery in the second half of the year from the volume perspective,\" Kadri told reporters.Solvay, which makes lithium derivatives for batteries, said first-quarter net turnover rose 3.6% year-on-year to 3.17 billion euros, driven primarily by higher prices in automotive, electric vehicle and electronic markets, higher prices in soda ash, in agriculture and coating markets.That beat a company-provided analysts' consensus forecast of 3.23 billion euros.Kadri also said Solvay's plan to split into two independent public companies was on track for completion in December.",
        "\"A big beat and raise which should support the shares into the de-merger later this year,\" ING analysts said in a note.Quarterly EBITDA was 839 million euros, also above a consensus of 730 million and up 18% from a year earlier.Solvay shares were down around 2% in early trading, underperforming the Stoxx 600 Europe Chemicals index which was 0.8% lower. ($1 = 0.9033 euros) (Reporting by Marine Strauss; Editing by Alexander Smith)"
    ]
}