{
    "articleURL": "/wires/reuters/article-12051629/Singapores-central-bank-imposes-additional-capital-requirement-DBS-Bank.html",
    "content": [
        "By Navya Mittal and Yantoultra Ngui",
        "May 5 (Reuters) - The Monetary Authority of Singapore on Friday imposed additional capital requirement on DBS Bank, the banking arm of the country's largest lender DBS Group, following the disruption of its banking services in recent months.The moves follows the widespread unavailability of the bank's digital banking services on March 29 and a subsequent disruption to its digital banking and ATM services on May 5, the Monetary Authority of Singapore (MAS) said in a statement.\"Together with the additional capital requirement imposed on DBS in February 2022, this translates to approximately S$1.6 billion ($1.21 billion) in total additional regulatory capital,\" MAS added.The additional capital requirement for DBS is now a multiple of 1.8 times to its risk weighted assets for operational risk, an increase from the multiple of 1.5 times MAS applied in February 2022 following the November 2021 disruption, according to MAS.MAS may subsequently vary the size of the multiplier depending on the outcome of ongoing reviews, it added.In response, DBS said MAS' latest action will have an incremental 0.3% point impact on DBS Group's March 31, 2023 common equity tier 1 capital ratio, reducing it from 14.4% to 14.1%.\"Following the March 29 incident, the bank convened a special board Committee to oversee a full review of our technology resiliency with an independent external expert,\" DBS Group CEO Piyush Gupta said in the response.",
        "\"We will complete the review as a matter of utmost priority and implement all recommendations expeditiously,\" he added.MAS has now required acomprehensive review it directed DBSto conduct in March to cover the May incident, MAS said.The repeated inconvenience caused to the public is unacceptable, Ho Hern Shin, MAS' Deputy Managing Director (Financial Supervision), said in the MAS statement.\"The additional capital requirement imposed at this time underscores the seriousness with which MAS treats this matter,\" she said. \"DBS Bank must spare no effort in dealing with the underlying issues leading to these disruptions.\" ($1 = 1.3252 Singapore dollars) (Reporting by Navya Mittal in Bengaluru and Yantoultra Ngui in Singapore, Editing by Louise Heavens)"
    ]
}