{
    "articleURL": "/wires/aap/article-12055157/The-power-budget-Australia-cusp-green-economy.html",
    "content": [
        "Hard-nosed billionaires like green energy champion Andrew Forrest, and his former venture partner Mike Cannon-Brookes, know that Australia's future prosperity will come from sunshine and electrons.",
        "But industrial heartland families remain concerned about job losses due to coal-fired power station closures and regional communities worry about transmission lines crossing farmland.\"If you're a tree-hugging environmentalist, I'd say stop hugging trees mate. If you like trees, go hug an electrical pylon - that's going to save your trees,\" Dr Forrest says.\"There are trillions of trees which are going to be wiped out if global warming continues to get a grip on our plant,\" he says while flanked by wind turbines at the recent opening of the Bango Wind Farm near Canberra.After years of taxpayer-funded support for coal and gas producers to power the economy, Australia's new industrialists are calling for federal budget settings that support clean energy.\"We spend just such a disgusting amount of money subsiding fossil fuels and fossil fuel consumption,\" Dr Forrest said.\"Let's level that playing field, let's have an even battle here.\"In particular, the diesel fuel rebate is sucking $10 billion out of the government's coffers that could go to schools and hospitals, he argues.Dr Forrest's Fortescue Group is one of the biggest winners from the rebate that goes to mine operators and other off-road diesel users.But the iron ore baron says Fortescue will stop taking the rebate \"as quick as we can\" by switching the entire company off fossil fuels.",
        "He's staking the company's future on green hydrogen, which he hopes will be commercially viable for making green steel as well as fuelling haulage trucks.The Forrest family's private investment arm Tattarang is also betting on wind farms, after acquiring CWP Renewables to become Australia's largest renewable energy investor, operator and developer.Dr Forrest got into a tangle recently with investment partner Mr Cannon-Brookes over the Sun Cable venture, which was intended to be the world's largest solar energy infrastructure network, and its future ownership is now up in the air.Meanwhile, hefty tax breaks outside of Australia are attracting capital and talent, as the United States and Europe move to catch up to China's green power push.Australia and its allies are scrambling to counter China's dominance in supply chains for clean energy technologies.Federal Labor committed more than $24 billion to a net-zero economy in its first budget last year, in various buckets of funding.But David Scaysbrook, co-founder of renewables developer Quinbrook Infrastructure Partners, said the upcoming federal budget on May 9 should include a timeline for the $15 billion National Reconstruction Fund and more specifics on its investment remit.\"A large funding allocation to support the development of new critical minerals related industry in Australia must also be made now,\" he told AAP.",
        "Mr Scaysbrook said the fund is critical to get the \"green superpower\" industry moving.\"We are in a race against other host countries that is fiercely competitive,\" he said.\"Policy statements will mean little without the big bucks to make it happen.\"The budget will provide additional funding from the $1.9 billion Powering the Regions Fund to support existing industry - such as rail and aviation - and new clean energy industries, with the creation of a $400 million Industrial Transformation Stream.Mr Scaysbrook also wants federal departments to accelerate approvals of projects of national significance - as the United States and the United Kingdom have done.In the meantime, households and businesses will share $1.5 billion in power bill help - which will be matched by state and territory governments.And small businesses will get new tax breaks to electrify their premises and appliances, with $314 million up for grabs in 2023/24 that's expected to unlock investment worth $1.5 billion.Clean Energy Council CEO Kane Thornton said Treasurer Jim Chalmers recognises that one of the causes of inflation is high electricity prices and the solution is to encourage more renewable energy.Dr Chalmers has pledged that the budget he hands down on Tuesday will be the most substantial investment in cleaner and cheaper energy and the future of the industry.",
        "After a recent trip to the US, the treasurer knows Australia needs an answer to the US Inflation Reduction Act passed last year to bankroll cheaper clean energy.\"There's now an appreciation that Australia can't be complacent,\" Mr Thornton told AAP.\"We've got plenty of advantages and strengths, but the rest of the world has moved dramatically.\"Mr Scaysbrook said there also needs to be more tangible progress on Australia's Rewiring the Nation plan, with funding allocated for new transmission projects to unlock renewable energy resources.\"That's the only way Australia can hope to once again enjoy cheap electricity for our homes and industry, but this time from carbon-free renewables,\" he said.Mr Thornton warned Australia won't hit its 82 per cent renewable target by 2030 at the current pace.\"We're deploying about five or six gigawatts of renewable energy a year and that needs to be close to 10 or 12,\" he said.An already announced new Sovereign Green Bonds program will help investors back public projects and is designed to attract more green capital to Australia.But the US has committed almost $US400 billion ($A598 billion), including tax credits to lure Australian companies to set up green hydrogen and battery manufacturing hubs on American soil.One big ticket item is the cost of the decades-old Petroleum Resources Rent Tax (PRRT) on offshore gas, which has delivered generous deductions for exploration expenditure and complex ways to transfer costs between projects to reduce tax bills.",
        "A Greens plan costed by the federal Parliamentary Budget Office before last year's May election found scrapping the tax credits would add more than $92 billion to the fiscal balance over a decade.Officially, the PRRT is levied at a rate of 40 per cent of a project's taxable profit and the tax office has collected around $40 billion since payments began in 1989/90.The gas industry says it's paying more tax - company tax, royalties and other charges - than ever.But profits have also surged and Australia is back on top as the world's top LNG exporter - mostly to Japan, China and Korea.Dr Chalmers has called for the parliament to support an overhaul of the gas tax that he says will make a meaningful contribution to the budget.A cap on deductions from July 1 will give Australians a \"fairer return\" from offshore gas projects, he said.The changes are slated to increase tax receipts by $2.4 billion over the forward estimates contained in the budget.Australian Petroleum Production and Exploration Association chief executive Samantha McCulloch said the move aimed to get the balance right between having a strong gas sector and a more sustainable national budget.\"The announcement today will provide greater certainty for our industry to consider the future investment required to maintain both domestic and regional gas supply security for our customers,\" she said.",
        "Deloitte Access Economics partner Stephen Smith points to an enormous boost to tax revenues from high commodity prices, with the 2023/24 federal budget expected to include a substantial improvement in forecast deficits and possibly a surplus for this year.The independent number-cruncher expects a small underlying cash deficit of $8.7 billion for the financial year ended June 30.\"Anyone expecting the budget to include a cash splash aimed at Australians doing it tough is likely to be disappointed,\" Mr Smith said.Energy shortages - here and abroad - might have eased but the world economy is slowing and inflation still needs to be tamed."
    ]
}