{
    "articleURL": "/sport/boxing/article-12056595/JEFF-POWELL-took-King-Canelo-just-47-minutes-reclaim-throne-boxing.html",
    "content": [
        "Saul Alvarez defeated John Ryder in Guadalajara, Mexico on Saturday eveningThe Mexican star defended his undisputed super-middleweight world title belt His coronation took 47 minutes but it required a significant effort to beat Ryder It took Charles the Third five hours to be anointed. It took King Canelo 47 minutes to reclaim the throne of boxing. Yet it required considerably more effort by Saul Alvarez to recover his crown.",
        "Because his procession this royal Saturday was prolonged by a single commoner infinitely more stubborn and worthy than the anti-monarchist rabble who failed to halt the Coronation.Plain Mr John Ryder, unheralded pugilist of Islington parish, put up resistance against the powerful force of Canelo the Great of which the 40,000 troops who marched down The Mall and then raised their hats to cheer Britain's new monarch would have been proud if called to combat.All the more so since the fighter who bizarrely calls himself The Gorilla shipped heavy fire for the majority of the entire 12 three minute rounds - separated by 11 minutes of intervals - of his doomed challenge for the undisputed world super-middleweight championship.Ryder failed in his mission to pull off possibly the greatest away victory in the annals of British boxing. Yet so gallant was he in continuing to chase that dream that at the end Senor Alvarez led the salute to his bravery which was joined by some 60,000 of the most passionate and exuberant fanatics of the hardest game on earth.",
        "Mexico and the United Kingdom will not soon forget the valour with which Ryder refused to yield to Canelo the knock-out with which he hoped to hallmark this first fight in his own country for almost 12 years and proclaim his redemption of a distressing year low-lighted by that embarrassing loss - only the second of his career - to Russian light-heavyweight Dmitry Bivol.",
        "Ryder was sent slumped somewhere close to unconsciousness between ropes and canvass by a demolition fifth round right cross.",
        "Round 1: 10-9 Alvarez, Round 2: 10-9 Alvarez, Round 3: 10-9 Alvarez, Round 4: 10-10, Round 5: 10-8 Alvarez, Round 6: 9-10 Ryder, Round 7: 10-9 Alvarez, Round 8: 10-9 Alvarez, Round 9: 10-9 Alvarez, Round 10: 10-9 Alvarez, Round 11: 10-10, Round 12: 9-10 Ryder.Powell's final score: 118-109; Judges' scores: 120-107, 118-109, 118-109.",
        "Canelo was already thinking about the rematch with Bivol in September. The Gorilla got up. Ryder was dropped again - the referee wrongly ruling it a slip - but he got up.Whether he could have risen again had he hit the deck under the next, most brutal barrage of all, instead of reeling around the ring from blow after crunching blow, has to be doubtful. But he didn't go down. Unlike King Kong he was still standing at the finish. Albeit rather less handsome with his nose broken to bits, his face battered into red-meat candidacy for a butcher's shop.The scorecards bore witness to his valour. One judge gave it to Alvarez by 120-107. The other two saw it as 118-109. My sympathy vote a little kinder to Ryder at 118-111.There was never a doubt about the outcome but Canelo as good as thanked Ryder for making such a good fight of it for his home-city audience to enjoy.",
        "Actually, Ryder did him a favour by making him work for the win. The arch criticism of Canelo against Bivol was that, at 32, his stamina was blown to such an extent that he would gas out in the second half of any fight. Well, he lasted the distance just fine. Just as his broken hand was pronounced totally healed.Ryder praised the champion's greatness down the years but suggested 'he is not as good as he used to be.' ",
        "Perhaps, while he was occupied with riding the storm, he didn't appreciate that at this level of power-punching Canelo could have knocked out anyone. Bivol included, especially if their second fight is made at super-middleweight. Ryder's defiance may well have earned him a few more good pay-days down the road, to go with his biggest purse so far.Canelo pondered, once again, the possibility of a big stadium fight in London, probably at Wembley. The problem with that: He has now knocked off an astonishing number of eight British fighters. So it is hard to see who is left on these shores for him to fight. Especially since he added: 'Ryder has been the toughest of them all.' A compliment is not a win but after a boiling night like this - it was 83 degrees Fahrenheit (28 degrees Celsius) in Guadalajara's aesthetic new stadium at the first bell - but it sure does help ease the hurt."
    ]
}