{
    "articleURL": "/sport/football/article-12057595/Livelihoods-line-Dyche-issues-warning-Everton-potential-cost-relegation.html",
    "content": [
        "Everton will seek only their second away win of the season against BrightonThe Toffees remain 19th in the Premier League with four matches remainingSean Dyche admits relegation would have a huge impact on staff at the club Sean Dyche has given Everton’s squad a stark warning about what is at stake by admitting that livelihoods are on the line around the club.",
        "Everton have only won away from home once all season and face a team, superbly managed by Roberto De Zerbi, who are pursuing a European spot.After the trip to the Amex, Everton host a Manchester City team on the cusp on the title. Then comes a trip to Wolves before the campaign finishes when Bournemouth come to Goodison Park.‘The next four games not only affect people’s futures but people’s lives and livelihoods,’ said Dyche. ‘That is football. That is the challenge. It is right there in front of your eyes.’One of the things that gave Everton an identity was David Moyes referring to it as ‘The People’s Club’, where players knew the importance of who was backing them from the stands and who was working to help them behind the scenes. Would that motivate the current squad?",
        "‘Motivation does not win games,’ Dyche responded. ‘Performance wins games. Motivation adds to the performance, of course. We have shown enough that we can win games. It is piecing it together at the right times.‘The key moments are in the games. Things around that in the departments still need to be done. Otherwise you are just putting a sticking plaster on something.‘There is loads going on behind the results. But the results are still the key thing. It is just how it is. We need to get the job done, get to the summer then start all the big stuff.’",
        "‘The bigger picture has to be shaping the whole club to get it in the right direction. It can’t just be, “Oh, we have stayed up again!” That is not building anything. That is just surviving. We want to be growing.’EVERTON (4-2-3-1) Pickford; Patterson, Keane, Tarkowski, Mykolenko; Gueye, Onana; McNeil, Doucoure, Iwobi: Calvert-Lewin."
    ]
}