{
    "articleURL": "/wires/reuters/article-12057235/Soccer-Osimhen-penalty-earns-champions-Napoli-1-0-win-Fiorentina.html",
    "content": [
        "NAPLES, Italy, May 7 (Reuters) - Newly-crowned champions Napoli secured a 1-0 win over Fiorentina in Serie A on Sunday as the league's top scorer Victor Osimhen scored from the spot at the Diego Armando Maradona Stadium.",
        "Fiore welcomed Napoli onto the pitch with the traditional guard of honour after the southern side returned home from wrapping up their first league title in 33 years with a 1-1 draw at Udinese on Thursday to claim their third Scudetto.Fiorentina's courtesy, however, ended there and the visitors pushed for an opener from the start with striker Luka Jovic coming close to scoring twice inside the first 20 minutes.Osimhen could have put a relaxed Napoli in front from the spot three minutes into the second half but Fiore goalkeeper Pietro Terracciano saved his weak shot after the penalty was awarded for Sofyan Amrabat's foul on Stanislav Lobotka.Osimhen came close to contributing to the fans' party in the stands 15 minutes later when he lobbed Terracciano with a well-measured effort but the ball hit the bar and ricocheted away.The Nigerian striker redeemed himself when winger Khvicha Kvaratskhelia won another penalty for Napoli in the 74th minute and Osimhen made no mistake from the spot this time.It was the 47th Serie A goal for the 24-year-old, taking him past George Weah as top African scorer in the league's history.That sparked life back into Luciano Spalletti's side and a determined Fiorentina could find no way of spoiling Napoli's celebrations which continued with live music and speeches.",
        "\"The best quality is to give others happiness,\" Spalletti told DAZN. \"When you see such love, affection and happiness, it is satisfying to know you have contributed a little bit to this atmosphere here.\"We played a good game again today against a tough opponent who knows how to feel good on the pitch. In the first half we couldn't turn the ball over, in the second half we did very well.\"Fiorentina, who play FC Basel in the first leg of their Europa Conference League semi-final on Thursday, have little chance now to climb above their eighth spot in the standings.They are on 46 points, 12 points behind AS Roma in seventh and Atalanta in sixth with four games left. (Reporting by Anita Kobylinska in Gdansk; editing by Clare Fallon and Ken Ferris)"
    ]
}