{
    "articleURL": "/sport/football/article-12048911/Erik-ten-Hag-admits-Manchester-Uniteds-gasp-defeat-Brighton-annoying.html",
    "content": [
        "Brighton defeated Manchester United 1-0 thanks to a stoppage time penalty  United boss Erik ten Hag hit also admitted his side were not clinical enoughUnited wasted numerous opportunities in front of goal at the Amex Stadium Erik ten Hag bemoaned an 'annoying' last-gasp loss at Brighton as Manchester United's Champions League hopes suffered a setback.",
        "Seagulls midfielder Alexis Mac Allister slammed home from the penalty spot in the ninth minute of added time after Luke Shaw's inexplicable handball was punished following VAR intervention.The dramatic 1-0 defeat at the Amex Stadium dented United's top-four aspirations, leaving them only four points above fifth-placed Liverpool, albeit with a game in hand.Ten Hag conceded his side contributed to their own downfall during a pulsating south-coast clash.The Dutchman felt an action-packed opening in which Antony wasted a golden chance before goalkeeper David De Gea was flattened when denying Albion winger Kaoru Mitoma with his face following a poor pass from Victor Lindelof encapsulated the frustration.",
        "'Every defeat is a disappointment but in the end when you lose in the last second, that is of course annoying,' said United boss Ten Hag.'And I think the first minute sums everything up. We create a good chance, we were not clinical enough, then in the attack after we concede a big chance by a giveaway from us, the ball on the head for David.'And in the end, we also gave away the goal and that's annoying because if you can't win because you don't finish your opportunities then don't lose.'With plenty at stake in the battle for continental qualification, rival players clashed in a heated second half after Antony's crude challenge on Mac Allister sparked a mass brawl.",
        "The two sides were each shown four yellow cards across the course of a gripping encounter.Ten Hag was unhappy with some of Brighton's challenges and also bemoaned a free-kick award in the build-up to referee Andre Marriner pointing to the spot after viewing Shaw's handball on the pitch-side monitor.'The annoying thing is that the free-kick before (the corner) is never a free-kick and I have seen really bad tackles today, sometimes without whistles as well,' he said.'Every attack you make, they kick you and then from a fair block it's a free-kick and it's a corner and then it's a disappointing handball in the dying seconds and you can't react any more.",
        "'It's not about me to give a judgement about the ref. We lost this game, we make a mistake in the end and we didn't take our chances but of course there are some disappointments.'Brighton's win partially avenged the spot-kick heartache they suffered at the hands of their opponents in the FA Cup semi-finals just 11 days ago and completed a league double over United.Victory for Roberto De Zerbi's men lifted them to sixth in the table, above Tottenham and Aston Villa, and four points behind Jurgen Klopp's fifth-placed Reds with two additional games remaining.",
        "Head coach De Zerbi, who overcame illness to lead the Seagulls to success, said: 'We deserved to win today, we deserved to win in the semi-final. If you play well, it can happen one time you lose but in the end you win, my experience in football says it's like this. I feel better with the victory. I'm wasted!'"
    ]
}