{
    "articleURL": "/news/article-12043517/Florida-Democrat-sold-15-000-stock-Republic-bought-JPMorgan-Chase-stock.html",
    "content": [
        "Florida congresswoman Lois Frankel sold her First Republic stock on March 16 while the share price was tanking, disclosures revealNews comes out the same day as the bipartisan bill to ban Congress from trading stock by Ocasio-Cortez, GaetzFrankel said her 'account is managed independently by a money manager who buys and sells stocks at his discretion'A Democrat congresswoman sold shares in First Republic Bank while the price was tanking - then purchased stock in JPMorgan before it took over the doomed institution.",
        "The news comes the same day a bipartisan bill was introduced by left-wing 'squad' member Alexandria Ocasio-Cortez and Trump supporter Matt Gaetz to ban stock trading by members of Congress. Florida legislator Lois Frankel sold her First Republic stock on March 16 while its value was sinking.She then purchased stocks in JPMorgan on March 22, weeks before it took over First Republic.The transactions are revealed in financial disclosures which say the value of the stocks in both instances was between $1,001 and $15,000. The revelations have placed renewed scrutiny on lawmakers over their trading.",
        "Frankel said her 'account is managed independently by a money manager who buys and sells stocks at his discretion'. Moderate Pennsylvania Republican Brian Fitzpatrick, co-chair of the Problem Solvers' Caucus, together with Florida Republican Matt Gaetz, Alexandria Ocasio-Cortez, D-N.Y., and Raja Krishnamoorthi, D-Calif., introduced the Restoring Faith in Government Act on Tuesday to prohibit financial investments by members of Congress, spouses and dependents. 'The fact that Members of the Progressive Caucus, the Freedom Caucus, and the Bipartisan Problem Solvers Caucus, reflecting the entirety of the political spectrum, can find common ground on key issues like this should send a powerful message to America,' Fitzpatrick said in a statement on the bill. Ocasio-Cortez added: 'When members have access to classified information, we should not be trading in the stock market on it. It's really that simple.' ",
        "Gaetz and Ocasio-Cortez have frequently sparred over the years, with the progressive firebrand calling the Florida Republican a 'bad haircut in a cheap suit' when Gaetz said Rep. Jamie Raskin might be unable to perform his job through the grief of losing his son to suicide. 'Members of Congress are spending their time trading futures instead of securing the future of our fellow Americans. We cannot allow the Swamp to prioritize investing in stocks over investing in our country,' Gaetz said of the new bill.  Public momentum for a stock trade ban came to a head last Congress after ex-Speaker Nancy Pelosi's husband made a number of questionable high-value trades. A stock trading ban has had bipartisan support - and quiet opposition - in both parties in both chambers.",
        "'The dirty secret here is that members of Congress hate this, they hate this bill,' Sen. Josh Hawley, R-Mo., who introduced another ban told DailyMail.com earlier this year. The collapse of First Republic on Monday sent shockwaves through the financial sector, despite its swift sale.The bank was taken over by the Federal authorities before its assets were sold to JP Morgan Chase.Jamie Dimon, chief executive of JP Morgan Chase, declared: 'This part of the crisis is over.'Frankel sold her stock when it was worth $34.27 a share. By that point, the price had already been battered following the closure of Silicon Valley Bank.",
        "But following the sale, the stock fell further and by the time the bank was shuttered, shares were worth just $3.51.The congresswoman bought JPMorgan shares on March 22. Since then, the bank's shares have risen about 10 percent to $136.91 apiece.After the crash of First Republic - the third bank failure in the past two months - experts and consumers have been anxious to determine whether it spelled the end of turmoil - as Dimon stated - or the start of a worsening crisis. Despite JPMorgan Chase buying out the bank, shares in several regional lenders fell at the start of the week, sparking fears that more banking pain could be to come. While experts have urged calm, saying consumers do not need to worry that we are headed to a similar crisis faced in 2008, there are suggestions that greater instability could mean further grief for midsized firms. Late last month, the credit ratings firm Moody's downgraded 11 regional banks, including Zions Bank, Western Alliance Bank and Bank of Hawaii. The firm specifically cited fears over commercial real estate portfolios, with midsize banks bearing the brunt of high interest rates and stress in the market. ",
        "A deal was announced on Monday that allows for an orderly failure of First Republic, following the announcement that JPMorgan Chase purchased the bank.",
        "While financial markets were calmer as the bank headed towards failure, depositors fled regional lenders on Monday over fears of more banks tanking. The KBW Regional Banking Index, an index of smaller regional lenders in the US, shed 2.7 percent, hitting a session low.Shares of Citizens Financial Group, PNC Financial Services Group, Truist Financial Corp and U.S. Bancorp fell between 3 percent and 7 percent. Valley National Bancorp, which owns Valley National Bank, lost more than 20 percent."
    ]
}