{
    "articleURL": "/wires/aap/article-12040091/Max-King-poised-add-power-Saints-attack.html",
    "content": [
        "Ross Lyon is seeking a Tom Hawkins and Charlie Dixon-like impact from Max King when the St Kilda spearhead makes his long-awaited comeback from injury.",
        "King has had a delayed start to the AFL season following a shoulder reconstruction and hamstring injury, and won't be ready for Sunday's clash with North Melbourne.The 22-year-old marquee forward will be put through a two-week block of full training as the Saints aim to bring him back against Adelaide in round nine.\"It's possible, nah, I think we're declaring him,\" Lyon told reporters on Wednesday.\"He's been running, high-end speed. He's done more work than (Tim) Membrey did before he came back.\"He's in full training, full contact - not that we do a lot (of contact).\"I'll manufacture some at the end of this session and on Friday, so he'll get two weeks of full training.\"St Kilda's makeshift forward-line has stood up in a positive 5-2 start to Lyon's second tenure as coach.Mitch Owens and Mattaes Phillipou have shone, Anthony Caminiti impressed before his suspension and Zaine Cordy has filled a hole.Experienced forward Tim Membrey has had two games back from his knee injury and Caminiti will be available again in round nine.But King - the 202cm, 90kg target who kicked more than 50 goals last season - can add something different to all of them.\"You can see what Hawkins is doing (for Geelong) and some of the power forwards in the competition, and we'd like to think he sits in that bracket,\" Lyon said.",
        "\"He looks big and he's imposing ... he's powerful, he's quick and he's agile.\"Even (Charlie) Dixon on the weekend for Port, it just puts your defenders under pressure, that really big man.\"We'd love to add that.\"Lyon admitted St Kilda need to improve their efficiency going forward after losses in two of their last three games, and hopes King's return will contribute to that.The 56-year-old coach denied former Saints fitness boss Nick Walsh's sudden departure in recent days was a result of the club's long injury list.The surprise news came as it was revealed Jack Hayes had sustained a serious hamstring injury while rehabilitating his troublesome foot.Lyon said the Saints are working with another club about appointing a new high performance management boss."
    ]
}