{
    "articleURL": "/tvshowbiz/article-12056793/Anna-Nicole-Smiths-daughter-Dannielynn-Birkhead-16-shows-guitar-skills-Kentucky-Derby.html",
    "content": [
        "Anna Nicole Smith's daughter Dannielynn Birkhead glammed up for her annual trip to the 149th Kentucky Derby in Louisville on Saturday alongside her photographer father Larry Birkhead.",
        "The Bahamian-born 16-year-old posed at Churchill Downs wearing a $2,350 Leo Lin sunflower-print 'Nadia Voluminous Gown' as the 50-year-old Kentucky native coordinated with his little girl in a baby-blue suit, gold necktie, and sunflower pin.Dannielynn accessorized with a cute sunflower fascinator and her late mother's archival necklace and bracelet.Birkhead enlisted hairstylist Ryan Austin and make-up artist Rick Bancroft to get her red-carpet ready.This year, Larry treated the high school junior to a private guitar lesson from none other than former Bon Jovi guitarist, Richie Sambora.",
        "Dannielynn looked adorable wearing her glasses as she played a few chords of five-time Grammy winner Janet Jackson's 1989 rock song Black Cat for the 63-year-old Grammy winner.Birkhead - who boasts 142K social media followers - wrote of the encounter: 'Richie spent a ton of time giving her confidence building tips and mastering the art of playing the guitar. Great guy!'The not-so-typical teenager and her protective father are huge fans of the 56-year-old R&amp;B diva, having met her twice in person after attending her concerts in May 2022 and July 2022.'She's getting ready to [get her driver's license] and we're working on it,' Larry told the Courier Journal on Saturday.'I'm trying to get the budget of the car down to what she wants. She was talking like Tesla up here and I'm trying to go down a little bit. So we'll see how that works out but she's starting her driving courses now.'",
        "Aside from the Barnstable-Brown Kentucky Derby, Birkhead keeps Dannielynn out of the spotlight so she can have a normal life and solid foundation.'She's very grounded and very humble,' the University of Louisville grad told DailyMail.com on Saturday.'She is not one of these entitled celebrity kids. She's gone to a public school all her life. That's what she chose. She said I want to go to public school and not to private.",
        "'Dannielynn is on the honor roll and she makes great grades. She is taking college level classes. Anna would be very, very proud of her. I know I am.'This year marks the 20th anniversary of Larry's first 'magical' Derby encounter with the Playboy and Guess model, whom he dated on/off for four years until her tragic 2007 accidental drug overdose at age 39.'I met Anna first in 2003 and she blew me kisses. I was intrigued by her but we didn't have too much interaction,' Birkhead told DailyMail.com.'I think when she came back in 2004 to the party that her confidence had changed. And she was a totally different person. The second year when she came back that is when the magic happened.'She was blowing me kisses, but I thought she was doing that for everyone. Being flirtatious for the camera. I never thought that she would want some guy like me from Kentucky when she could have any guys who wants.'",
        "Larry moved to Anna's Hollywood home three months later and after her death, a DNA test confirmed he was the father of her child.Birkhead subsequently changed her birth name from Hannah Rose to Dannielynn in order to honor Smith's middle name Lynn as well as her late half-brother Daniel who died, aged 20, from an accidental drug overdose three days after her birth.",
        "The Texan 5ft11in bombshell acted in six films including Naked Gun 33 1/3: The Final Insult (1994), The Hudsucker Proxy (1994), and Be Cool (2005).Anna (born Vickie Lynn Hogan) also guest starred in episodes of Fox legal drama Ally McBeal and NBC sitcom Veronica's ClosetEventually Smith brought her larger-than-life boisterous personality to her very own E! reality show The Anna Nicole Show, which ran for three seasons (2002-2004)."
    ]
}