{
    "articleURL": "/news/article-12047691/Army-eccentric-royal-campers-enjoy-Coronation-festival-atmosphere-Mall.html",
    "content": [
        "Follow all the latest news and updates on the Coronation and everything royal on our live blog here An army of royal fans are descending on The Mall in London in a 'Glastonbury for royalists' as they camp out for days in the run up to the Coronation on Saturday to soak up the festival atmosphere and party with like-minded superfans.",
        "At the heart of a royal frenzy today is a sea of tents – dubbed 'King Charles' Camp' – where fans who travel to London over the next 36 hours will join those already along the procession route to secure their spots to watch the procession in the historic first Coronation for 70 years.Patriotic campers swathed in Union Flags and stocked up with tinned all-day breakfasts, booze and bunting are settled in for Saturday – many of whom also camped out for the Queen's funeral in September last year. Away from The Mall, houses, streets and schools across the country are decked out in red, white and blue as they prepare to celebrate the new King - with hundreds of thousands of people still to arrive in the capital before Saturday. Royal fans from across the globe have descended on London, with some sleeping on The Mall since the start of the week to get a prime spot. On the route to Buckingham Palace today, MailOnline has met people from all over the UK and across the globe, including the United States, Canada and Commonwealth nations.One couple jetted in from New Zealand for a trip that will cost them £5,000 and are camped near a group of women nicknamed 'The Golden Girls', who met for the first time at the Platinum Jubilee last year and agreed to reunite in the same spot for the Coronation.",
        "Many are sleeping in tents – one man has had two stolen already – but some are just sleeping on the floor. With rain and thunder forecast in the coming days, many are likely to get very wet but vowed not to let Britain's spring weather dampen their spirits. Faith Nicholson, 61, from Althorne near Chelmsford, has been attending royal events for more than 40 years. She said: 'I've been doing this now since 1981 and the crowds just get bigger and bigger and bigger at each event. Come Saturday, this is going to be packed.'We all look out for each other, we all watch each others tents, people bring us food, it's just really nice.'She added that she feels she 'probably let the Queen down a bit' by only camping on the Mall for four nights ahead of her funeral in September.Not everyone in her family are as staunch supporters of the monarchy - but Mrs Nicholson doesn't let that stop her: 'My husband thinks I'm mad. My son, who is a policeman, I think he's embarrassed.'",
        "Karen Ayms, 53, is camping on the Mall with her friend and work colleague Becky Rovertson, 29. She said there is a 'real community feel' to the gathering.Ms Robertson added the atmosphere feels 'a little bit like Glastonbury' and that they have stocked up on plenty of gin and wine to toast the King with ahead of the big day. ",
        "One group outside the Palace hail from as far away as Australia. Kathy Shepherd told MailOnline: 'I came for the funeral and when I saw the haggard looks of Anne and Charles, I just thought you have done such a sterling job and your hearts are breaking, and I'm going to come to the Coronation to support you.'Her friend Kate Edgar, who flew in from down under two weeks ago, said the group had plenty of champagne and whiskey in preparation for the big day. She said: 'This is the ultimate [royal event] isn't it. It will only ever happen once, maybe twice in our lifetimes.'",
        "Army veteran Geoffrey York enjoyed an all-day breakfast in a tin this morning, costing £2.25, which includes baked beans, sausages, button mushrooms, chopped pork and egg nuggets with bacon burger pieces, all cooked up on a camping stove. Others tucked into into smoked salmon and basil rolls as they sat on camping chairs next to their tents.Hot drinks were also being consumed - with one group of five pictured with camping mugs as they stood next to crowd barriers on the famous road.Mr York, 69, said he has been making hot drinks for fellow campers and told MailOnline: 'You can either sleep rough or come prepared.' He also has a table with a box of sugar, camping mug and milk on the table in front of him - as well as an opened pack of digestives.",
        "Theresa D'souza, 72, and Betty Velgi, 79, were seen enjoying a homemade smoked salmon and basil roll each.And another woman had a military-style ration pack in the form of a £4 boil in the bag full English breakfast.Meanwhile Jessie Young, Margaret Tinsley, Eunice Hartstone, Elizabeth Couzens and Shirley Messinger all posed for a photograph holding their drinks.Nicknamed the 'Golden Girls', they met at the Platinum Jubilee last year and decided to get together again to be in London for Charles' Coronation. Tony Lown, 36, is at The Mall with three children and his niece aged seven to 11, and has been there since Wednesday afternoon.He told MailOnline: 'It's a once-in-a-lifetime thing for them to see, it's an experience. We came for the funeral.'Mr Lown, of Croydon, South London, said he had taken the children out of school to be at The Mall. Asked how the school reacted, he said: 'Well we haven't heard nothing yet, so we'll take it as it comes, you know.'He said they had 'loads of food and there's a McDonald's down the road'. He has even set up a table for the children to complete 'Coronation-related' homework.",
        "Mother-of-two Claire Swift, from Wigan, Greater Manchester, who turns 68 tomorrow, brought her mother's teddy to The Mall and admitted her family think she is 'nuts' for camping out.",
        "She told MailOnline today: 'I said at Christmas I was going to come for the King's Coronation and then it coincided with my birthday and I thought 'great, why not'?'It's the first occasion that I've been to and I've met these lovely people who've been coming to state occasions since Diana and Charles's wedding. They've been coming to everything so they're a dab hand with the rules and regulations and protocol of camping out. It's been absolutely great.'Asked what her family think of her camping out, she said: 'I think they just think, \"it's my mother, she's nuts\". I've got two sons - one lives in Australia and one lives in Hale near Manchester.'Ms Swift continued: 'Last night I borrowed a yoga mat from (fellow camper) Faith because I lost my self-inflatable mattress. So we're going to walk down to Argos later on to get a self-inflatable mattress. So hopefully I'll have a better night's sleep than last night.'But it was great - you could hear everybody outside, it was nice and cosy. Then this morning I woke up to somebody saying \"good morning, are you awake, how did you sleep\"? And it was BBC News.'Ms Swift said she had brought a bear which once belonged to her mother who used to work in a hospice shop in Wigan.",
        "She added: 'When my mum died, it came to live with me, and he normally just sits on the sideboard. So when I was grabbing my bag yesterday to come down I just said to teddy \"do you facing coming to the Coronation?\" And off he went in my bag and he's here - he's a bit shell-shocked because normally he has a very boring life.'There may be a carnival atmosphere on The Mall today, with groups sharing food and drink - but camping out for the big day has not been a positive experience for all, as some have been targeted by thieves stealing their tents and valuables when they need the toilet, MailOnline can reveal. One fan had two tents stolen in 48 hours when he went to the toilet. Patrick McCrossan, a Northern Irishman living in London, has been forced to sleep in his deck chair and told MailOnline that he is scared to go for a comfort break in case he is targeted again. He joked: 'I'm not going to bathroom again.'Mr McCrossan's GoPro and various phone chargers were also stolen, despite The Mall being at the heart of the biggest security operation in British history with a record 11,500 police officers on duty in London this weekend.He said that he is disgusted that criminals are using the Coronation as an 'opportunity' to steal from royal well-wishers.'I think that they must have overheard me saying about going to the toilet', he told MailOnline.Mr McCrossan said: 'My stuff got stolen - twice. I've got no tent now. I had to buy two new chairs and my tents gone, twice. I couldn't get it a third time.'Asked if he had told the police, he said: 'No - I don't see any cameras anywhere. I think what it was was there were some guys, some people milling around. I've been to so many of these events over the years - I thought it was all right to say that I'm only going to the toilet.'There were some that weren't open, so I went up towards Green Park to go to the toilet up there and I thought that would be fine. And when I came back, they were gone. And I thought oh s***, someone's gone off with my stuff.'My bag had phone chargers and all sorts of things in it and my GoPro. I bought my GoPro, £659, in March for my birthday and it was gone. I lost a lot of stuff. I'd got myself a GoPro for my birthday because I go to that many interesting places and see interesting things.'",
        "He continued: 'If I get enough trust in people around me, even though they've just come, I think they're alright - but I've just got to be sure I can go away and feel that I'm not going to come back and it would be all gone. I'd be tempted to go and get another tent as there's one in Piccadilly.'Bartley Graham, 34, arrived at The Mall on Wednesday after discharging himself from hospital. He has joined dozens of people gathered in front of the Palace ahead of the King's Coronation, with tents set up to enable them to get a prime spot.Mr Graham, from County Durham, said: 'I should have been here earlier, but the hospital scenario made it impossible. I self-discharged this morning purely so I could be here.'It's important I'm here to get a good view of the procession, as I did for the Jubilee. I came out for Prince Phillip's funeral even though there was a risk I might be fined at the time.'I queued for 30 hours at Balmoral to see the Queen's coffin a first time, and I queued 30 hours a second time at the Houses of Parliament.'Then I passed out and had a stroke, and all I could blame was exhaustion. If it happens again, I'm in the right place, London's hospitals are the best in the country. I love being out here.'Mr Graham came wearing a suit printed with Union Jacks and carrying a cardboard cut-out of Charles, who he thinks will be 'a fantastic King'.'I like King Charles, and I definitely like Lady Camilla,' he said. 'Charles will be a fantastic King and will do a great job, he has some really strong values, and I think Lady Camilla has fallen into the role very well.'Kerry Evans, 58, from Gainsborough, Lincolnshire, who also arrived at The Mall on Thursday said she 'would rather die' than miss the King's Coronation.'I can't camp out like I used to, I've got a heart condition and small vessel disease,' she said.'Every time I come out to an event like this I end up in casualty, because I just exhaust myself, but I've really paced myself this time.'Nothing would stop me, I would rather die supporting the Royal Family than not be part of all this,' she continued. 'I'll probably suffer for three or four months after an event like this.'Ms Evans, who is a writer and a full-time carer, hopes the King will be a champion for diversity. 'The King is being very quiet at the minute, I think he's waiting to see what people want,' she said.'I hope he'll be a strong King in terms of change and diversity, race, disability.'Other fans have travelled from further afield. Carol Bush, 62, who comes from California but now lives in London, and Ardis Ryburg, 61, from Arkansas, came out to The Mall together 'to support' the late Queen.'We loved her, and she wanted her boy to do this, so we want to support her,' Ms Bush said. 'The Queen just gave and gave and gave, and really took her job as a monarch seriously.'We're going to come back in 20 years for her grandson, we'll be old in our wheelchairs and we'll be here for William,' she continued. 'I can't wait for the carriage, I want to see the golden carriage come back out again.'The coronation itself will take place in Westminster Abbey on Saturday, with the Coronation Big Lunch and Coronation Concert on Sunday.Members of the public have been encouraged to take part in The Big Help Out on Bank Holiday Monday by volunteering for local organisations.The first glimpses of the Coronation procession seen during a rehearsal overnight have given an insight into what the pageantry will look like and who will be involved. The procession returning to Buckingham Palace down The Mall will feature the Gold State Coach. King Charles III and Queen Consort Camilla will sit in it as they are greeted by crowds."
    ]
}