{
    "articleURL": "/tvshowbiz/article-12041023/Ryan-Reynolds-wishes-pal-David-Beckham-happy-48th-birthday.html",
    "content": [
        "David Beckham celebrated his 48th birthday on Tuesday and his family and friends - including A-list pal Ryan Reynolds - took to social media to send him well wishes.  ",
        "Ryan, 46, took to his Instagram Story to give David a special message while he was on top of the bus during the raucous Wrexham promotion parade.Ryan and Rob McElhenney led the victory celebrations after their club Wrexham AFC won promotion last weekend.  While on top of the bus Ryan shouted in a message to David: 'David I just wanted to wish you a happy birthday!'He then joked: 'We threw this huge parade for you! We love you so much! Every body came! ",
        "The camera then panned to the fans he was stood with on the bus as they shouted happy birthday to him. Elsewhere on social media David gave a glimpse at his family birthday celebrations as he enjoyed his third cake of the day presented to him by his wife Victoria, 49.He looked delighted as he had the cake put down in front of him and blew out the candles after two previous cakes the same day. David's Instagram was full of happy birthday Stories that he had reposted including from his children, Brooklyn, Cruz and Romeo. It came as Ryan Reynolds and Rob McElhenney led the victory celebrations on Tuesday after their club Wrexham AFC won promotion.The Deadpool star and It's Always Sunny in Philadelphia actor McElhenney are co-owners of the Welsh football team and their goal has been to help the club move back to the English Football League after a 15-year absence.",
        "Now they have now achieved their aim after Wrexham won promotion as champions of the 2022–23 National League.",
        "The pair celebrated alongside the team on one of three open-top buses which cruised the streets of Wrexham on Tuesday night to the sound of Queen anthem 'We are the Champions' and attracted huge crowds.The actors were seen belting out the Welsh national anthem as thrilled supporters waved flags and let off red smoke.The parade party was held 10 days after Wrexham secured the National League title with a decisive 3-1 win against Boreham Wood which was attended by both Reynolds and McElhenney, who was seen in tears as they celebrated their victory.Speaking to BT Sport after the match, Reynolds said: 'I'm not sure I can actually process what happened tonight, I'm speechless.'One thing that's running through my head is people asking us: 'Why Wrexham, why Wrexham' – this is exactly why Wrexham. What is happening right now is why.'McElhenney added: 'We can hear how it feels to the town and that's what's most important to us. 'It's a moment of catharsis for them and for us to be welcomed into their community and to be welcomed into this experience is the honour of my life.'Wrexham will start the 2023-24 season in EFL League Two."
    ]
}