{
    "articleURL": "/wires/reuters/article-12045609/Indian-army-steps-quell-violence-northeastern-state-Manipur.html",
    "content": [
        "By Zarir Hussain and Krishn Kaushik",
        "GUWAHATI, India, May 4 (Reuters) - Soldiers of the Indian Army held flag marches and evacuated thousands of civilians amid a dawn-to-dusk curfew to quell violence between tribal and non-tribal groups in the remote northeastern state of Manipur, officials said on Thursday.Violence initially broke out during a protest march on Tuesday by thousands of tribal people opposing a demand by a non-tribal group for the constitutionally defined status of a scheduled tribe.Indian army sources said troops and the paramilitary Assam Rifles evacuated more than 7,500 people of different communities through Wednesday night and Thursday, sheltering them in the troops' camps and government premises.\"We are working on a war footing with army and paramilitary troopers deployed in strength to defuse any kind of communal clashes, protests, and blockades,\" a senior police officer, who sought anonymity, told Reuters from the state capital of Imphal.Mobile internet services have been suspended for five days statewide, amid incidents of fighting among young men and volunteers of different communities, the state government said in a statement.In a social media post, N. Biren Singh, the chief minister of Manipur, which shares a border with Myanmar, pleaded with joined hands for people to maintain peace and harmony, adding that \"precious life\" had been lost in the clashes.",
        "There was no official confirmation of deaths, however.Tuesday's march in the Churachandpur district was called by a students' union, the All Tribal Students' Union Manipur (ATSUM), to protest against a demand by the majority, non-tribal Meitei community for the status of a Scheduled Tribe (ST).\"The situation is tense but we are trying to engage community leaders in a dialogue process,\" the district magistrate in the area, Sharath Chandra, told Reuters.That would help bring the situation under control, in addition to security measures taken to deter violence, he added. The curfew will run for an indefinite period.Television channels broadcast images of both tribals, who make up about 40% of the state's population of 3.6 million, and Meiteis burning tyres on roads and setting fire to some houses in parts of the state. (Writing by Sudipto Ganguly; Editing by Clarence Fernandez)"
    ]
}