{
    "articleURL": "/wires/ap/article-12038717/Bolivian-Jesuits-apologize-alleged-abuse-late-priest.html",
    "content": [
        "LA PAZ, Bolivia (AP) - Bolivia´s Jesuit congregation apologized Tuesday and announced an investigation into a late Spanish priest who allegedly abused several minors in Bolivia dating back to the 1980s.",
        "\"We apologize for the pain this has caused,\" said the Rev. Bernardo Mercado, head of the Catholic religious order known as La Compañía de Jesús. He said the congregation has launched a probe that seeks to bring justice for the victims and called the situation an \"embarrassment.\"The case of Jesuit priest Alfonso Pedrajas Moreno came to light over the weekend in a report by the Spanish newspaper El País. It published excerpts of the priest's dairy, where he allegedly admitted to having abused at least 85 children while he was a teacher in Bolivia until 2009 when he died.Bolivian officials have not released the number of victims nor the dates in which the alleged abuse took place. But earlier this week Bolivia's top prosecutor Wilfredo Chávez said on Twitter that he would seek information from the Spanish consulate on the case, so it can be investigated in Bolivia.The congregation is investigating two cases, one which concluded in April and determined the \"veracity\" of that allegation, and a second one which is ongoing.Audalia Zurita, a lawyer for the Jesuit congregation, said Tuesday at a press conference that they have asked El País for a copy of Pedrajas Moreno's dairy, and that all information gathered in their probe will be shared with the Attorney General´s Office.",
        "This is not the first complaint against priests for abusing minors in Bolivia, but few cases have been thoroughly investigated and brought to justice.In 2015, a rural priest was sentenced to 15 years in prison for the abuse of 12 minors. A short time later he committed suicide in jail. In 2009 a priest was sentenced to 22 years in prison for similar crimes."
    ]
}