{
    "articleURL": "/news/article-12044051/Thousands-offenders-education-courses-avoid-prosecution-crime-UK-jumps-20.html",
    "content": [
        "Criminals who agree to a course, including therapy, do not have to go to courtThe number of thugs, drug offenders and other serious criminals told to have therapy or an education course instead of prosecution spiralled last year.",
        "Home Office data shows a 128 per cent leap in offenders given ‘diversionary, educational or intervention activity’ programmes in 2022.Police handed out 31,230 of the punishments last year compared with 13,718 in 2021.Criminals who agree to a course, including therapy sessions to address offending, do not have to go to court. Last year 16,000 violent offenders chose to do so, along with 2,000 vandals and arsonists, 1,400 thieves and 5,000 drugs criminals.Incredibly 93 robbers and 1,000 sex offenders escaped prosecution this way. The ‘diversionary, educational or interventional activity’ category – also known as ‘Outcome 22’ – was introduced in 2019 on the recommendation of Labour frontbencher David Lammy, who carried out an official review.",
        "Police take no further action if a criminal agrees to take a course ‘to prevent reoffending or change behaviour by addressing the root cause of the offending’.The Youth Justice Legal Centre says ‘this might include a victim awareness course, engagement with addiction services or referral to a domestic abuse perpetrator programme. It might also include some form of restorative justice’.Crime figures published by the Office for National Statistics last week showed the overall number of offences logged by police hit 6.6million in 2022 for the first time. Violent crime surged by 20 per cent compared with pre-Covid levels to a record 2.1million offences. Sex offences hit a new high with 189,731, up 19 per cent over the same period. Only 7.1 per cent of recorded crime led to court action.",
        "The Mail revealed last week that thousands of sex offenders dodged prosecution in 2022 and were handed a ‘slap on the wrist’.A total of 629 sex criminals got away with an ‘informal out-of-court settlement’, such as making an apology to their victims. Another 666 escaped prosecution by accepting a ‘formal out-of-court settlement’, such as police caution. A further 1,082 were handed an ‘Outcome 22’ punishment.A Home Office spokesman said: ‘We are focused on cutting crime, and building stronger communities.‘We’ve delivered our pledge to put 20,000 more police officers on our streets, and we’re taking action across the board to bring more offenders to justice, better protect victims, and equip the police with the powers they need to prevent crimes from happening in the first place.’"
    ]
}