{
    "articleURL": "/wires/reuters/article-12056963/Texas-mall-shooting-prompts-Biden-renew-call-gun-control.html",
    "content": [
        "By Maria Caspani",
        "May 7 (Reuters) - U.S. President Joe Biden on Sunday called on Congress to pass gun control bills in the wake of yet another mass shooting that left nine people dead, including the gunman, at a Texas mall on Saturday.The Democratic president renewed calls for Congress to ban assault weapons and high-capacity magazines, as well as to enact universal background checks and end immunity for gun manufacturers. There is little chance the narrowly divided House and Senate would pass such legislation, although polls show most Americans support background checks.Biden, who has made similar pleas before, said the assailant at Allen Premium Outlets mall in Allen, a northern suburb of Dallas, wore tactical gear and was armed with an AR-15 style assault weapon.The gunman killed eight people, including children, and wounded at least seven, before a police officer killed him, police said on Saturday.Mass shootings have become commonplace in the United States, with at least 199 so far in 2023, the most at this point in the year since at least 2016, according to the Gun Violence Archive. The nonprofit group defines a mass shooting as any in which four or more people are wounded or killed, not including the shooter.As of Sunday morning, law enforcement had not released details about suspect's identity or a possible motive. The identities of the victims had also not been released.",
        "\"We don't have anything that we're ready to release at this time,\" Sergeant Jonathan Maness of the Allen Police Department told Reuters. \"It's a lot of moving parts here.\"Officials said three people transported to area hospitals were in critical conditions as of Saturday, while four had been stabilized.TRAGEDY REIGNITES GUN CONTROL DEBATEThe tragedy in Allen, which happened just over a week after another deadly shooting in the Texas town of Cleveland, reignited the heated debate over gun control in the United States.The U.S. Constitution's Second Amendment protects the right to bear arms, and that issue is a hot button one for many Republicans, who are backed by millions in donations from gun rights groups and manufacturers.Texas Governor Greg Abbott, a Republican, called the shooting \"devastating\" in a Sunday morning interview on Fox News but said that the way to effectively tackle gun violence lies in addressing mental health.\"There has been a dramatic increase in the amount of anger and violence that's taking place in America,\" he said. \"We are working to address that anger and violence by going to his root cause, which is addressing the mental health problems behind it.\"Senate Majority Leader Chuck Schumer and other Democrats stressed the need to pass stronger gun safety legislation to curtail gun violence.",
        "On Saturday, TV aerials showed hundreds of people calmly walking out of the mall, located about 25 miles (40 km) northeast of Dallas, after the violence unfolded, many with their hands up as scores of police stood guard.One unidentified eyewitness told local ABC affiliate WFAA TV that the gunman was \"walking down the sidewalk just ... shooting his gun outside,\" and that \"he was just shooting his gun everywhere for the most part.\"Blood could be seen on sidewalks outside the mall and white sheets covering what appeared to be bodies.(Reporting by Maria Caspani in New York, Brad Brooks in Lubbock, Texas, Moira Warburton in Washington, and Brendan O'Brien in Chicago; Editing by Lisa Shumaker)"
    ]
}