{
    "articleURL": "/news/article-12051923/Bombshell-report-reveals-U-S-officials-bussed-migrants-AWAY-southern-border-hide-chaos.html",
    "content": [
        "Border agents were ordered to transport asylum-seekers away from the frontierA damning probe said it was to hide 'reality' from visiting VIPsThousands of migrants plan to sneak into the U.S. once emergency Covid laws expire U.S. officials bussed away migrants and inflated staffing levels during VIP visits to mask the chaos on the southwest border, a bombshell report has claimed. ",
        "The revelations came in a damning probe into the Department of Homeland Security's (DHS) handling of the migration crisis.They also follow repeated calls from Republicans to renew a Trump-era Covid diktat that allows the U.S. to boot out illegals more easily.The report by a top government accountability watchdog grilled more than 9,000 border officials who painted a bleak picture of how authorities are coping.",
        "They told the Office of the Inspector General (OIG) said that a VIP visit to frontier posts would see bosses orchestrate a cover-up.Top management 'would transport migrants out of the facility before a visit and return them after the visit ended', the report said. One source said he was asked to take would-be asylum-seekers away 'and make this place look fit and proper to code.'  Border agents, speaking off the record, also claimed that senior managers would 'require more staff to work, creating the impression that they are sufficiently staffed.'They said visitors 'are not shown how conditions are in reality' in a 65-page tirade by OIG investigators on how the DHS was failing its employees.The damning assessment by border and immigration officers marks yet another border humiliation for Joe Biden.The president has been repeatedly slammed by Republicans over his axing of Donald Trump's border wall two years ago. ",
        "The OIG also said that border forces are struggling to cope with the increased numbers of migrants sneaking into the country due to low staffing levels. Its report said that the situation is 'unsustainable' in the battle against illicit crossings across the southwestern frontier.It also warned that many agents could quit or retire early unless working conditions improve.'Staffing at the border has not grown at the same pace as the flow of migrants and traffic into the country,' officials wrote.Investigators said that last year there were just 16,654 border agents, levels that have barely changed in three years, facing 180,000 illegal crossings each month.The report calls these crossings 'migrant encounters': U.S. government jargon for when asylum-seekers get in illegally but are arrested or immediately kicked out.",
        "But the findings said staff were so overstretched that it has resulted in less enforcement' in the policing of the border.Staffing for the U.S. border agencies is the responsibility of the commander-in-chief who can use executive orders to ramp up numbers.The report said hiring has already hit 'authorized levels' but it called on the Biden administration to consider whether they were adequate.But the Department of Homeland Security dismissed the idea of a review, saying there was 'no funding' available to do so.",
        "OIG investigators said this meant asylum-seekers could escape into the U.S. more easily.They said there were more than 600,000 'gotaways' who were spotted by border cameras or sensor technology last year, up from 389,000 in 2021.They are asylum-seekers who eventually escaped capture or who were able to cross freely into the U.S. because 'no agents are available to respond.' Officials also found that were just 1,414 deportation officials on the U.S. southwestern frontier struggling to cope with 18 cases each on average.An estimated 13,000 people could try to cross each day after the expiry of Title 42, the emergency anti-immigration laws used during the coronavirus pandemic.The powers, drawn from a near 80-year-old federal public health law, allowed both Donald Trump and Joe Biden to kick out migrants without hearing their cases.It expires on May 11 because the current president has decided to end the coronavirus emergency. Thousands of people have already started gathering at the border between the U.S. and Mexico in the hope of making the crossing. But a senior Biden administration official blamed Republicans in Congress for 'blocking funds and reforms' to fix the U.S. immigration system.  The White House has deployed an extra 1,500 troops to join the already 2,500 who are already stationed on the frontier between the U.S. and Mexico. ",
        "'House Republicans are pushing a MAGA agenda of chaos and inaction. They are playing politics when they should be joining the President in pursuing real solutions,' the source said.At least 2.3 million migrants tried to illegally cross into the United States across the Mexican border last year, according to U.S. Customs and Border Protection.That is up from 1.7 million people in 2021 and just over 450,000 the previous year when much of the world was locked down during the  pandemic."
    ]
}