{
    "articleURL": "/sport/football/article-12051511/Jack-Grealish-face-Gucci-100m-City-maverick-loves-joke-Haaland.html",
    "content": [
        "Jack Grealish felt 'shy' playing alongside his idols after signing for Man CityGrealish loves to joke around with star Erling Haaland in the changing rooms The midfielder also revealed he listens to the commentary back after a game When Jack Grealish became the Premier League’s first £100million footballer in the summer of 2021, his agent sat him down for a talk.",
        "‘We had this big meeting,’ Grealish reveals to Mail Sport. ‘He said, “You are going to Manchester City and everything is gonna change. You have to realise nothing will ever be the same again”.‘Sitting here now I can say I have dealt with it. But last season I didn’t at all. But that was not off the pitch. That was on it.’Grealish moved to City from Aston Villa, his hometown club, thinking his football life would be easier. How could it not be? He was a young and gifted attacking footballer joining one of the most potent offensive teams in Europe. Nine months after joining, his debut season ended with his first Premier League medal but also with hard lessons learned.‘I was a bit in awe of being here, a bit shy,’ says Grealish, in that slow and recognisable Birmingham drawl. ‘Not, like, in my personality but on the pitch. People would shout, “Jack, pass!” and I would be, “F***ing hell it’s (Kevin) De Bruyne, I had better pass it to him”. You know what I mean? He had been my idol.’",
        "Almost exactly a year ago, Grealish was coming to terms with a difficult season’s low point. City had taken a lead to the Santiago Bernabeu in a two-legged Champions League semi-final with Real Madrid. On Tuesday night the teams meet again at the same stage.",
        "The 27-year-old was not in Guardiola’s first team back then but was introduced for the final 12 minutes in Madrid with City leading 5-3 on aggregate.Grealish immediately came close to scoring before somehow Real did so twice in stoppage time. A Karim Benzema penalty subsequently took Carlo Ancelotti’s team through to the final.‘It was horrible,’ says Grealish. ‘The thing that p****d me off the most was their second goal. Dani Carvajal gets it and crosses. I was so leggy. I didn’t feel fit, just miles off it and blowing.‘I just put a leg up to try and stop the cross and it was just sloppy. They scored and we know what happened. I was devastated after that, man. I was so down.’",
        "Grealish is taller than you may imagine. Not quite as stocky and squat as he can appear on the field. He sits in a yellow armchair wearing a Gucci tracksuit that one would need both youth and a certain confidence to carry off. Grealish currently has both. These days he is an ambassador for the Italian fashion house, joining A-list singers Harry Styles, Miley Cyrus and Lana Del Rey.Recently he was invited to Elton John’s dressing room after a concert. ‘He said he liked my necklace,’ smiles Grealish.",
        "But it is not celebrity, clothes or jewellery that give Grealish such confidence these days. It’s football.We meet the day after City have beaten West Ham 3-0 to edge closer to a third consecutive league title. Ahead of today’s home clash with Leeds, they need 12 points from five games.Since losing at Manchester United in mid-January, Grealish has started 21 of 23 matches. When it matters these days, he plays. As Pep Guardiola’s gilded team push forwards with a Treble in their sights, Grealish has become as fundamental as De Bruyne or record-breaking centre forward Erling Haaland. The change in his circumstances has been stark.",
        "‘The main thing now is I feel loved,’ he says. ‘I feel the manager really trusts me. At Fulham last weekend I didn’t have my best game. But Pep kept me on, trusting me. He was telling me, “Jack, get hold of the ball, keep it, win fouls”. So you go home and feel happy.‘This is what I dreamed of. To play in every game for such an important team at such an important time.’Grealish plays a different kind of football now. At Villa it was sometimes like watching a street footballer. It could be exhilarating but it was not what City paid all that money for.",
        "Grealish has subsequently learned to play within Guardiola’s more defined structure, staying tight to the left touchline until moments arrive to cut loose. His defensive work, strange as it sounds, is just as impressive as what he does with the ball.‘Yeah, it was difficult to change,’ he nods. ‘Now I see these guys as my friends and I am like, “Give me the ball”. I demand it.‘I would still like to score more. My assists — not trying to big myself up — are now at 11 and I don’t take any set-pieces. But it’s not just numbers, is it?’Grealish has historically been criticised for not releasing the ball quickly enough. On TV, two eminent midfielders of yore, Mail Sport’s Graeme Souness and Roy Keane, have sometimes offered that view. Grealish takes a deep breath and goes in for the tackle.",
        "‘Oh don’t,’ he says. ‘The way some of the TV pundits talk I can’t actually catch my breath sometimes. It’s as if they never played bad themselves. Graeme was an unbelievable player. But he used to say I held on to the ball too long.‘I was like, “Mate, I play for Aston Villa”. A lot of the time we didn’t have the ball so when we did the manager told me to keep it.",
        "‘It’s the same here. Everyone sees Pep as a tiki-taka manager, but before the Bayern Munich game away in the Champions League he said, “You know what having balls is? It’s about being the one to keep the ball, to calm the game down”.’‘So you do that and you get criticised. It’s tricky. When I was at Villa nobody had paid any money for me so it didn’t matter if I played bad. Also, 90 per cent of the games were not live on TV so people wouldn’t notice anyway.‘It is different now but I will be honest here — if I have played well I go back home and watch everything and listen to the commentary and what they say afterwards.‘If I play s***, I will not listen to a word they say.’Grealish has 31 England caps and, for now, one Premier League title. As well as being a Gucci ambassador, he recently signed a record-breaking boot deal with Puma.He has been written about in Vogue, Tatler and GQ. When he was featured on the front cover of FACE magazine, the accompanying write-up suggested that ‘not since David Beckham has a footballer fascinated the nation so much’. To maybe prove the point, it featured some arty, black-and-white close-up photographs of his calves.",
        "During our hour together, this is the first thing to knock him from his conversational stride.",
        "You aren’t just ‘Jack’ any more, are you?‘Erm… I don’t know what you want me to say to that.’Well, if I put you in to Google now different things come up…‘What used to come up? Me drunk?’ he laughs.Well, a bloke who used to play for Aston Villa and who would occasionally fall out of a taxi.‘No, listen,’ he laughs again. ‘I know obviously things are different but I will be honest with you. Sometimes I don’t like that. I just want to be my normal self. If you ask anyone who knows me, I am still just Jack if you know what I mean?‘I would like to do everything I used to do when I was younger and it is annoying sometimes because I can’t.‘You mentioned a lot of stuff there and it’s obviously nice. But I don’t do any of that for money and you really have to believe when I say the main stuff for me is the football. It’s about concentrating on the pitch. Yeah?‘That line from the magazine. It’s not a bad thing to hear is it? You can understand bits of it because of the price tag and things. But I would like them to say that because of my football ability and trophies I win and the way I am playing. I don’t know what else to say on that really…’",
        "Grealish is not short of self-awareness. He knows himself, all right. When he leaves a game, he would always instinctively prefer to turn right for a beer than left for the sofa. This occasionally got him in trouble at Villa but has not at City. He makes no attempt to hide what he fundamentally is and it is endearing.‘Everyone is different, aren’t they?’ he says. ‘Look at Erling. He is the best professional I have ever seen. His mindset is something you won’t see again. He does everything. Recovers. In the gym. Ten hours of treatment a day. Ice baths. Diet. That’s why he is what he is. But I swear I couldn’t be like that.‘We have a great friendship but he will point at me after a game and say, “Hey, don’t you go out tonight partying”. I just tell him to shut up and go and sit in his ice bath. But that’s us. Two different people doing well in our own way.‘I am not as successful as him. He has scored more goals this season than I have in my whole career. But if he did what I occasionally did he would be like, “F***ing hell I feel terrible today”.‘I have a release that’s different to his. He is going home and sitting with his family and having a takeaway. Sometimes that’s my choice, too. I love doing that. But sometimes I like to go out and let my hair down.‘I am not gonna sit here and lie and say I don’t go out. What’s the point? It’s also pointless telling you I am here at 8am going in the gym and that’s the reason I am playing well. It’s not.‘The reason I am playing well is because I feel fit, confident, good in myself and like I am at home here. But I still love an occasional drink and going out with my friends. That’s just normal.’",
        "It strikes me that trying to go out in Manchester or indeed Birmingham when you are Jack Grealish must entail a certain amount of planning. Subterfuge even.‘I can’t tell you because you will follow me, won’t you?’ he says with a wink. ‘I just look after myself more now. In the old days I would have one drink and think I had this invisible cloak on where nobody could see me.‘Now I just have people who look after me and I go to more secretive places. I have actually been really good these last few months. I have not been out much and told myself I wouldn’t until I had a medal or two round my neck.‘I like to think life hasn’t changed who I am. Why should it? I just like going to normal places.‘I like going for nice food but I don’t have to go for nice food. I still love sitting in Nando’s with my family. Even if I go to a nightclub, I don’t have to have the best table.‘I love going to 80s clubs and just chilling at the bar. I would love to be able to do that. That’s why in the summer I am gonna buy a wig…’Grealish comes from a big family and would like to be a father.‘I think I would be a sick (great) dad,’ he laughs. ‘I was lucky that I had the best upbringing. I love my mum and dad so much, they did everything for me. It makes me want to do the same for my own children when I do have them.‘I am not sure when that will be. I need to grow up a bit first. To me, everything is about enjoying life. I am so blessed doing what I am doing but I do need that balance between football and the rest.",
        "‘I don’t want to get emotional but life is just short. A young guy I knew in Birmingham died at the weekend. I was in the hotel at Fulham before the game. It’s just so scary. You never know what’s gonna happen. I was so emotional in the room. It makes you realise that a lot of the time you have to do what makes you happy.’At City, Grealish has developed a rapport with the club’s young supporters. His sister Hollie has cerebral palsy. ‘I know what it’s like when she is really happy and I know I can have that kind of impact on children and fans,’ he explains. ‘When you can help, you are going to, aren’t you? A lot of footballers do it and it brings a tear to my eye. You can make someone’s day by doing something so little. We don’t do it for clout. It’s because we want to.’Part of Gareth Southgate’s England team, Grealish has, along with the likes of Bukayo Saka and Jude Bellingham, become the face of what could be a brighter future.",
        "‘Every away ground I go to with City I get booed,’ he laughs. ‘I am not sure why. But when I play for England, I feel that love. I remember at the Euros at Wembley getting a big cheer when my face appeared on the screen. It made me happy. There is a bond there.’Back in Manchester, only one thing really matters now. Or three things. With five weeks of the season to go, there are a trio of trophies and a shot at immortality to aim for. Only one English team, Manchester United, has ever won the Premier League, FA Cup and the Champions League in one season.‘Listen, we are in exactly the same position as last year in Europe,’ he says. ‘Real Madrid again. Three games away from winning the Champions League. All I can say is that I have never had so much confidence and belief in my team-mates and myself before a game as I have before going there next week.‘Well, apart from when I was six and thought I was the best player in the world…’"
    ]
}