{
    "articleURL": "/news/article-12038849/Merrick-Garland-stands-Hunter-Biden-testimony-despite-claims-AG-interfered-probe.html",
    "content": [
        "Republicans have reviewed IRS documents they claim prove Biden corruption has benefitted at least 12 family membersAG insisted his investigation would be carried out without political interferenceBut a whistleblower claims in a bombshell report that Garland lied under oath to CongressAttorney General Merrick Garland insists he is still committed to ensuring his office's investigation into Hunter Biden is conducted without political interference – despite bombshell claims the Justice Department head already thwarted the probe.",
        "In his April 2022 testimony before Congress, Joe Biden's Attorney General said: 'There will not be interference of any political or improper kind' when it came to the investigation into the president's son.But since then, a whistleblower has come forward claiming that a senior Biden administration official did, in fact, interfere with the probe – and DailyMail.com confirmed that the official in question is Garland.The whistleblower, according to a letter from attorney Mark Lytle, says politics are 'improperly infecting decisions' in the probe into the president's 53-year-old son.",
        "'You assured Congress some time ago that the Hunter Biden investigation would be conducted without any kind of political interference and I'm wondering if you believe that is still the case… that the investigation is not being interfered with in any political way since an agent from Mr Lee's agency has now come forward claiming whistleblower status and alleging there has been some sort of interference,' a reporter posed to Garland during a press conference Tuesday.'That is still the case,' Garland assured. 'I stand by my testimony.'I refer you to the U.S. attorney for the district of Delaware who is in charge of this case and capable of making any decisions that he feels are appropriate,' he added.The whistleblower, who is alleging wrongdoing by the U.S. Attorney General, is an agent of Internal Revenue Services (IRS) Criminal Investigations, which is headed by Chief Jim Lee.",
        "As part of the ever-growing investigations against Hunter Biden, Republicans on the Oversight Committee have also reviewed IRS documents and Suspicious Activity Reports (SARs) they claim prove that the Biden family corruption and influence peddling has benefitted at least 12 family members.U.S. Attorney for the District of Delaware David Weiss is leading the investigation into the contents found on Hunter Biden's abandoned laptop.Garland last year told Republican Sen. Bill Hagerty, who serves on the Banking, Housing, &amp; Urban Affairs Committee, as well as the Foreign Relations, Appropriations and Rules &amp; Administration panels, that he would ensure there would not be political interference in the probes into Hunter and his foreign business dealings.According to a letter from Lytle, a man serving as a supervising agent on a 'high-profile' criminal tax probe has come forward seeking whistleblower protections while claiming politics are 'improperly infecting decisions' in the investigation examining matters related to President Biden's son.The protected disclosures by the IRS whistleblower 'contradict sworn testimony to Congress by a senior political appointee,' the letter stated.DailyMail.com has confirmed that the 'senior political appointee' referenced in the letter is Attorney General Merrick Garland.",
        "The New York Post first reported Garland's connection to the whistleblower's claim last month. The disclosures also 'involve failure to mitigate clear conflicts of interest in the ultimate disposition of the case,' the letter from Lytle continued. ",
        "In addition, the whistleblower's admissions apparently 'detail preferential treatment and politics improperly infecting decisions and protocols that would normally be followed by career law enforcement professionals in similar circumstances if the subject were not politically connected.'Lytle wrote that his client is a career IRS Criminal Supervisor Special Agent who has been overseeing the 'sensitive investigation of a high-profile, controversial subject' since 2020. The letter obtained by DailyMail.com was sent to senior members of the House and Senate. The whistleblower has already shared information with the Treasury Department's inspector general for tax administration, and the Department of Justice's inspector general.The revelation shook Capitol Hill and members of both political parties.",
        "'We take all whistleblower statements seriously, as we should. Some turn out to be very important and some not,' Sen. Dick Durbin, D-Ill., said.'But we take them all seriously at the outset and look at them closely,' Durbin, who is the chairman of the Senate Judiciary Committee, added Thursday.Chairman of the House Oversight Committee James Comer, R-Ky., said Hunter Biden has been involved in 'deceptive, shady business schemes.'He elaborated, saying the ventures have seen the president's relatives rake in 'millions from foreign adversaries like China.'The House Judiciary Committee Chairman Jim Jordan tweeted sarcastically referencing the IRS whistleblower claims: 'Imagine that, the Biden Administration is reportedly mishandling the criminal probe into Hunter Biden.' ",
        "On the other hand, the White House dismissed the claims, referencing the independence of DOJ.'The president respects the rule of law and the independence of the Department of Justice,' press secretary Karine Jean-Pierre said when asked about the claims Thursday."
    ]
}