{
    "articleURL": "/femail/article-12057391/What-Kate-said-Muppets-sketch-Coronation-Concert.html",
    "content": [
        "Expert lip reader Jacqui Press revealed what the Wales couple said during the Windsor concertFollow all the latest royal news and updates on Coronation events on MailOnline's live blog hereA lip reader has revealed what the Prince and Princess of Wales thought of the hilarious moment the Muppets crashed the Coronation Concert in Windsor tonight. ",
        "Miss Piggy and Kermit the Frog surprised crowds when they interrupted Hugh Bonneville halfway through his presenting segment during the concert. And sat in the royal box with the King and Queen and the other members of the royal family, Prince William, 40 and Kate Middleton, 41, could be seen enjoying the fun skit. Expert lip reader Jacqui Press told Femail what the couple, who attended the event with two of their children, Prince George, nine, and Princess Charlotte, eight, said to each other. The royal family came out in force to the concert tonight, and more than 20,000 people are also in place as the celebrations for the King and Queen's crowning ramped up again tonight. ",
        "Miss Piggy and Kermit the Frog decided to stop by halfway through the concert to have a chat with host Hugh Bonneville, in a moment that got a good laugh from the royals. The two characters walked up to the host, telling him they were 'looking for their seats,' explaining they were expected in the royal box. Miss Piggy then exclaimed she couldn't believe she didn't have a castle yet, and asked Bonneville if he was single.  Kate Middleton particularly loved the skit, exclaiming: 'that’s funny!' as she sat next to her daughter Princess Charlotte. ",
        "Hugh Bonneville's quip at Miss Piggy, calling her a 'pig in a dress,' particularly amused Prince William, as the royal repeated the words under his breath with a laugh. The royal family seemed to be thoroughly enjoying the evening. Charles III and his wife Camilla walked into the royal box to roars from the 20,000-strong crowd who did three cheers for the couple who waved and grinned back as the sun set over Windsor Castle. And as night fell, the royals donned their glowstick wristbands, got to their feet and started dancing to Lionel, as he sand All Night Long.",
        "Charles and Camilla laughed and chatted as they bopped along, with Kate, Charlotte and George also getting into the groove - as did the Duke and Duchess of Edinburgh.William had slipped away so he could go on stage to give a moving tribute to his father, telling him: 'Pa, we are all so proud of you.' He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven on his Coronation weekend.Princess Charlotte attempted to get Prince George's attention and pointed at her father the Prince of Wales as he made his way onto the stage to deliver a speech during the Coronation Concert.",
        "As William concluded his speech, he said: 'God Save the King,' which was repeated loudly by the thousands in attendance. The speech was followed by the national anthem, which was sung by all present, including Prince George. The King smiled and waved to the crowd at the end of the national anthem.The concert is considered by many to be a crowning touch on the magnificent weekend, after joyous big lunch celebrations today and a surprise walkabout by the Prince and Princess of Wales.Among the celebrities to perform on stage will be the royal family's own Prince William, who will deliver a speech.",
        "Reflecting on his thoughts surrounding the royal family ahead of the concert, host Mr Bonneville said: 'I think each generation will need to make its own definition of what monarchy means.'And I think that is the challenge for the future. In our ever-changing world, where does the monarchy stand? What does it mean?'I mean, for my generation, and for my parents' generation, it was the glue that bound our nations together, and that glue will need to shift and evolve in order to keep the strength that it's had in the past.'Bonneville said he thought the coronation service was 'extraordinary' and admitted that he found the moment the King swapped his 'robes of status and honour' for a simple white shirt for the private anointing as 'particularly touching'.",
        "He added: 'It's a crazy old service, it's strange to think how it's accreted over the years, over the centuries to what it is today and it obviously will have a new meaning, a different meaning for our generation, the generation that witnessed it with the late majesty.'I found it moving and an extraordinary change-marker in the sand for our culture and for our generation.'The show in Windsor also saw performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video."
    ]
}