{
    "articleURL": "/wires/reuters/article-12051857/The-crowns-jewels-swords-spoon-used-King-Charles-coronation.html",
    "content": [
        "LONDON, May 5 (Reuters) - The ceremony for King Charles' coronation at Westminster Abbey in London on Saturday will involve historic regalia ranging from sceptres and maces to a ring and a spoon.",
        "Here are details of some of the Crown Jewels that will be used during the ceremony:ST EDWARD'S CROWNCharles will be crowned with the historic St Edward's Crown that has been used since the coronation of King Charles II in 1661 after the monarchy was restored following the 10-year republic of Oliver Cromwell. It was removed from the Tower Of London in December for modifications.The crown, which weighs about 2.2 kg (4 lb 12 ounces), is made up of a solid gold frame set with rubies, amethysts, sapphires, garnet, topazes and tourmalines, and has a velvet cap with an ermine band.It replaced an original crown believed to date back to the 11th century Anglo-Saxon king of England, Edward the Confessor.Charles will also wear the 1 kg (2.3 lb) Imperial State Crown at the end of the service, the headware regularly used by British monarchs for official occasions such as the State Opening of Parliament.Made for the coronation of Charles' grandfather George VI in 1937, it is set with 2,868 diamonds in silver mounts including the 105-carat Cullinan II, the second biggest stone cut from the Cullinan Diamond, which was given by the government of the Transvaal in South Africa to Edward VII on his birthday in 1907.",
        "The crown also features the large \"Black Prince's Ruby\", along with 17 sapphires, 11 emeralds and 269 pearls, including some of which are said to have been bought as earrings by Tudor monarch Queen Elizabeth I.SOVEREIGN'S SCEPTRE WITH CROSSThe Cullinan 1 diamond, also known as the Star of Africa, which weighs in at 530 carats and is the world's largest colourless cut diamond, was set in the bejewelled golden sceptre which has been used in every coronation since 1661.The sceptre, which has undergone a number of alterations over the centuries, represents the sovereign's temporal power and is associated with good governance.SOVEREIGN'S SCEPTRE WITH DOVEThis is the second sceptre used in the ceremony, representing the sovereign's spiritual role. It also dates from 1661. It is made from a gold rod in three sections, mounted with diamonds, rubies, emeralds, sapphires and spinels. At the top is an enamelled dove with outspread wings, which represents the Holy Ghost.THE SOVEREIGN'S ORBThe Sovereign's Orb, another item commissioned for Charles II's coronation, is a globe of gold with a cross mounted on top, surrounded by a band of diamonds, emeralds, rubies, sapphires and pearls with a large amethyst at the summit. It is a representation of Christian sovereignty.CORONATION RING",
        "The coronation ring, known as \"The Wedding Ring of England\" and composed of a sapphire with a ruby cross set in diamonds, was made for the coronation of King William IV in 1831. Worn at every coronation since then, it symbolises kingly dignity.SWORDS AND MACESA number of swords will feature in the coronation procession.These include the Sword of State, which symbolises royal authority and was made in about 1678, and was used at Charles' investiture as Prince of Wales in 1969. Also to feature will be the Sword of Temporal Justice, the Sword of Spiritual Justice and the Sword of Mercy, which were first used in the coronation of Charles I in 1626.The bejewelled Sword of Offering, made for the coronation of George IV in 1821, will be presented to Charles, with the message it is a symbol not of might or violence but for the protection of good.Two maces, made of silver gilt over oak and date from between 1660 and 1695, will also feature. These are the ceremonial emblems of authority which are carried before the sovereign at events such as the State Opening of Parliament.AMPULLAThe golden ampulla, which dates from 1661, is a flask in the shape of an eagle that holds the holy oil, which was consecrated in Jerusalem in March and will be used to anoint the king.",
        "CORONATION SPOONThe silver-gilt spoon is the oldest piece in the regalia, probably made for Henry II or Richard I in the 12th century. It was used to anoint King James 1 in 1603 and has featured at every coronation since.BRACELETSTwo armills, golden bracelets representing sincerity and wisdom, are placed on the sovereign's wrists. They are thought to relate to ancient symbols of knighthood and military leadership.They date back to 1661 and have been used at every coronation from King Charles II´s until King George VI´s in 1937, with new armills specially prepared for Queen Elizabeth in 1953.(Reporting by Michael Holden; Editing by Frances Kerry and Janet Lawrence)"
    ]
}