{
    "articleURL": "/tvshowbiz/article-12045439/Emma-Stone-snuggles-Mickey-Mouse-day-family-Disney-World-Florida.html",
    "content": [
        "Emma Stone decided it was time for her to spend the day at the Happiest Place on Earth.",
        "On Wednesday, the Oscar-winning actress got in some quality family time when she and some loved ones made their way to Disney World in Lake Buena Vista, Florida, which is typically associated with being in Orlando.And A-list leading lady was all smiles when she met up with Mickey Mouse, himself, at Town Square Theater at Magic Kingdom Park.The Scottsdale, Arizona native opted to keep it casual in the fashion department dressed in light blue jeans and a white crop top that at times gave a hint of her toned abs.But in keeping with the festive mood of Disney and its famous characters, Stone played the role of Minnie Mouse by wearing her famous ears and red and white polka dot bow on top of her head.",
        "Along with the ears and bow combo, Stone had her red tresses falling just past her shoulders with a part on the slight right. She stood proud next to Mickey with her left arm across his shoulders, all while flashing a beaming smile that could light up a Disney set.For his part, Mickey was decked out in his classic ensemble  with his left arm extended outwards to help highlight his blue and gold cape.During her acclaimed career in Hollywood, Stone has worked with Disney on several occasions that includes voicing Ivana in the episode of The Suite Life of Zack &amp; Cody (2006), titled Crushed, that aired on the Disney Channel.",
        "She also played Estella/Cruella in the crime comedy film Cruella (2021) from Walt Disney Studios Motion Pictures that's based on the character Cruella de Vil from Dodie Smith's novel The Hundred and One Dalmatians (1956).The cast also included Emma Thompson, Joel Fry, Paul Walter Hauser, Emily Beecham, Kirby Howell-Baptiste and Mark Strong, among others.Stone also played Eugenia 'Skeeter' Phelan in the period drama film The Help (2012) that was distributed by Walt Disney Studios Motion Pictures.The story focuses on Skeeter, an aspiring journalist, and her relationship with two black maids, Aibileen Clark and Minny Jackson, played by Viola Davis and Octavia Spencer, during the Civil Rights Movement in Jackson, Mississippi in 1963.The Help received four Academy Award nominations, including Best Picture and Best Actress for Davis and Best Supporting Actress for both Jessica Chastain and Spencer, with the latter winning the award.",
        "Stone and husband Dave McCary, who will be celebrating their third wedding anniversary this coming September, are the proud parents of their two-year-old daughter, Louise, who was named after Stone's grandmother, Jean Louise. In a tribute to that very same grandmother, Stone was given the middle name of Jean. In all, Stone has received three Academy Award nominations that includes Best Supporting Actress for the black comedy-drama film Birdman (2018), and Best Supporting Actress for the period black comedy film The Favourite (2018).",
        "She won her Oscar in the Best Actress category for her role in the romantic musical film La La Land, alongside Ryan Gosling.In the film, Stone and co-star Ryan Gosling play an aspiring actress and a struggling jazz pianist, respectively, who meet and fall in love while pursuing their dreams in Los Angeles."
    ]
}