{
    "articleURL": "/wires/pa/article-12043539/Trump-accuses-Biden-disrespecting-King-not-attending-coronation.html",
    "content": [
        "Donald Trump has accused his successor Joe Biden of disrespecting the King by opting not to attend the coronation.",
        "The former US president speculated that the 80-year-old White House incumbent would be “sleeping” at his American home instead of taking up the invitation to be at the Westminster Abbey ceremony on Saturday.The billionaire businessman, who was defeated at the 2020 US presidential election by Mr Biden, said his Democrat rival was not physically up to being the country’s leader. When you have somebody that's going to be sleeping instead of coming to the coronation as President of the United States, I think it's a bad thing  Donald Trump  Mr Trump, in an interview with Nigel Farage for GB News during his recent visit to Scotland, said: “I was surprised when I heard that he wasn’t coming.“I think it’s very disrespectful for him not to be (at the coronation).”Mr Biden carried out a tour of Ireland last month to mark the 25th anniversary of the Good Friday Agreement, the peace deal that helped quell the Troubles in Northern Ireland.The US President also travelled to London in September for the late Queen’s funeral but has opted not to attend her son Charles’ coronation, with his wife and First Lady Jill Biden representing him instead.During the interview, Mr Trump predicted that he had a “very good chance” of winning the next election if he secures the Republican nomination to take on Mr Biden.",
        "Bemoaning the performance of Mr Biden’s administration, he said: “When you have somebody that’s going to be sleeping instead of coming to the coronation as President of the United States, I think it’s a bad thing.”",
        "Mr Trump was also critical of former prime minister Boris Johnson — previously seen as an ally of the former president — and former Scotland first minister Nicola Sturgeon.He argued that Mr Johnson “changed a lot in office”, suggesting policies under the former Conservative Party leader were “literally going far-left”.Mr Johnson won a landslide election for the Tories in 2019 but revelations about parties held in Downing Street during the coronavirus pandemic and his handling of sexual assault allegations against one of his ministers led to him being ousted.Questioning the policy direction Mr Johnson’s administration had been going in before he left office at the end of last year, Mr Trump said: “What were they doing? I can tell you they were not Conservative policies in the end.”On Ms Sturgeon, Mr Trump said he did not think that the former SNP leader, who announced her intention to step down in February, loved her country.Mr Trump, whose mother was Scottish, has business interests in Scotland, including owning a golf course in Aberdeenshire, which he visited during his stay this week.",
        "Asked about Ms Sturgeon’s handling of the Isla Bryson case, the transgender woman who was held in a female prison after being convicted of raping two women before her transition from a man, the 76-year-old said: “I know that case, and I thought it was terrible, and I guess it helped ruin her career.",
        "“I think she had other reasons also, but I just felt she didn’t love Scotland.”Mr Trump said he did not know the new First Minister Humza Yousaf but said that he was “sure he’s going to be a lot better than Sturgeon”.On international issues, the former Western leader said he would be able to put a stop to the Ukraine conflict in a single day if he wins power again.He also suggested Russian president Vladimir Putin would not have decided to invade Ukraine if he had still been in the White House, claiming he knew the Kremlin leader “very well” and that he “never mentioned” wanting to attack Kyiv.“If I were president, I will end that war in one day,” Mr Trump continued.“It’ll take 24 hours. I will get that ended. It would be easy.“That deal would be easy. A lot of it has to do with the money. That war has to be stopped. It is a disaster.”"
    ]
}