{
    "articleURL": "/news/article-12054905/The-proof-loyal-Lady-Hussey-truly-belongs.html",
    "content": [
        "Lady Hussey, 84, sported a purple and blue suit, hat, black shoes and black bagShe was embroiled in controversy over remarks made to Ngozi Fulani last yearLady Susan Hussey, who was forced to stand down from Royal duties after finding herself at the centre of a racism row, was back in the fold at Westminster Abbey yesterday.",
        "The presence of Prince William's godmother at the Coronation ceremony confirmed that she and the Royal Family have managed to put last year's controversy behind them.Lady Hussey, 84, sported a purple and blue suit, blue hat, black shoes and a black bag.She found herself in hot water in November over remarks she made to Ngozi Fulani at a Buckingham Palace reception for domestic violence charities.The British-born founder of Sistah Space tweeted that Lady Hussey had repeatedly asked her where she came from. ",
        "Ms Fulani and her supporters claimed it was motivated by 'prolonged racism' and that the royal aide was incapable of grasping she was from Britain and not Africa.The charity worker later told reporters: 'She demanded to know where I was from. No matter how many times I answered her it wasn't the answer she wanted.'In a bid to calm tensions before a visit to the US, the Prince of Wales stated through his spokesman that 'racism has no place in our society'.Lady Hussey's friends insisted she was only trying to take an interest in a fellow guest, but such were the sensitivities of the issue, she stood down from Royal duties.In December it was reported the women cleared the air in a meeting 'filled with warmth and understanding' at Buckingham Palace. ",
        "A statement issued by the Palace said: 'Lady Susan has pledged to deepen her awareness of the sensitivities and is grateful for the opportunity to learn more.'Lady Hussey, who served as lady-in-waiting to Queen Elizabeth II for more than 60 years, has since made a gradual return to the Royal fold."
    ]
}