{
    "articleURL": "/wires/ap/article-12047713/Recall-effort-against-Arizona-election-denier-fails.html",
    "content": [
        "Organizers of an effort to remove a rural Arizona county supervisor for skepticism over the results of last year's election announced that they have fallen short of the legal requirement to proceed with a recall effort that would have given voters the option of removing him from office.",
        "The campaign to recall Tom Crosby in rural Cochise County said Wednesday night that it fell short of collecting the 4,865 signatures required to place the recall on the ballot for voters later this year.Crosby is one of two Republican supervisors on the three-member board who refused to certify the 2022 election in the county.They pushed for hand counting ballots instead of relying on more accurate voting machines and gave oversight of elections to the county´s elected Republican recorder instead of nonpartisan staff. The recorder then hired a new election director who shared memes echoing former President Donald Trump's false claims of fraud in the 2020 presidential election.\"This will not be the end,\" said recall organizer Eric Suchodolski in a statement. \"We will just continue in a different way, and it will take a bit longer.\"Crosby did not immediately respond to a request for comment. He had previously scoffed at the recall's seriousness.",
        "Conservative Cochise County has become an epicenter of election conspiracy theories in a state where Republicans lost top races last year in part because their nominees embraced those theories.Crosby and the other Republican on the board, Peggy Judd, pushed for a hand count over the objection of the county's election director, Lisa Marra, only to be stopped by a judge. They then refused to certify the results of the election, only again to be stopped by a judge.",
        "Marra resigned earlier this year and sued the county, contending she was exposed to threats and harassment because of the supervisors' decisions. Crosby and Judd then gave oversight of elections to Recorder David Stevens, who'd supported their hand count effort. Arizona Attorney General Kris Mayes, a Democrat, sued to block the move, but a judge allowed it to proceed.Last month, Crosby and Judd voted to hire Bob Bartelsmeyer, who had run elections in a smaller Arizona county and shared memes repeating disproven claims of voter fraud, as the county's new election director."
    ]
}