{
    "articleURL": "/tvshowbiz/article-12052981/Rihanna-fuels-marriage-rumors-boyfriend-AP-Rocky-attending-Met-Gala-bridal-gown.html",
    "content": [
        "Pregnant Rihanna continued to fuel rumors that she secretly tied the knot with A$AP Rocky with her latest social media posts on Friday.",
        "The Diamonds singer, 35, shared photos of herself posing with the 34-year-old rapper and father of her children at the 2023 Met Gala and wrote: 'shout outz 2 the bridal party' and 'here comes the bride'. At the lavish event, the Anti hitmaker first sparked marriage rumors after stealing the show in an extravagant wedding-inspired dress.The record producer — who sported a button-up and blazer on top paired with a kilt over jeans on the bottom — was seen holding her hand in every shot of the photo series.The couple welcomed their son last May and are currently expecting their second child together.",
        "Along with the four images, the Fenty Beauty founder wrote on Twitter: 'shout outz 2 the bridal party….here come de bride #idoKARL#METgala2023'. She also used the same caption for her latest Instagram post.In the seemingly candid photos, the lovebirds were seen holding each others' hands tightly as they arrived at the star-studded event and walked onto the red carpet.Rihanna looked ethereal in a white Valentino gown with a voluminous and long, floor-sweeping train. As she walked hand-in-hand with Rocky, various people assisted her by holding up the lengthy skirt.Over the bridal-esque garment, the billionaire mogul donned a cape adorned with camellia flowers — an ode to the emblem of the Chanel fashion house.",
        "She also rocked a pair of white framed sunglasses decorated with dramatic false eyelashes on the top bar. By her side, Rocky sported an eclectic version of the conventional tuxedo with a high-low kilt worn over bedazzled denim jeans.He wore a classic white button-up top with a black thin leather tie teamed with a black blazer on top. ",
        "The record executive also donned four different Gucci belts and black boots with metal toe caps.With their show-stopping ensembles, fans quickly took to social media and started speculating that the pair had already exchanged vows.Rihanna and Rocky started dating in 2020 after years of longtime friendship and musical collaboration. Two years later, they welcomed their first child — who will soon be turning one later this month.Earlier this year, the entrepreneur announced her second pregnancy by showing off her baby bump during her Super Bowl halftime show."
    ]
}