{
    "articleURL": "/news/royals/article-12043953/Late-Queens-note-friend-Late-monarch-prayed-strength-weeks-death-King-George-VI.html",
    "content": [
        "Late Queen prayed for strength after the death of her father King George VI It is a role he has been in training for since the day he was born.",
        "But as he faces his very public moment of destiny on Saturday, King Charles III could be forgiven for a frisson of nerves.How will he step into the shoes of his late mother, whose remarkable reign spanned 70 years and saw her become one of the most loved and admired heads of state in the world?It may come as a crumb of comfort to learn, however, that much the same thoughts were going through Queen Elizabeth II’s own mind as she struggled to come to terms with the death of her beloved father, King George VI, in February 1952 and her own accession to the throne.Remarkably she, too, was praying for the strength to follow ‘his wonderful example during my reign’.",
        "The Daily Mail has been given exclusive access to a never-before-seen letter written by the late sovereign to a close friend in March 1952, just a few weeks after her father’s passing on February 6 aged 56.Although he had been unwell for many months, his death still came as a shock to his family and left his eldest daughter, then a mother of two young children, Queen at the age of just 25.Written in her familiar looping hand at Clarence House – the London residence she occupied at the time with her husband, the late Duke of Edinburgh and their young family – Elizabeth thanks the writer for their own kind letter of sympathy. ‘We have been greatly comforted by the knowledge that so many people have been thinking of us at this sad time,’ she says.",
        "She continues: ‘My father will be very much missed, for it has been a source of great pride to us to know that so many people thought of him as a friend, as well as their king.’In a sign that she, too, felt the weight of responsibility bearing down on her shoulders, she continues: ‘I trust I shall be given the strength to follow his wonderful example during my reign.’ She signs the letter using her private family nickname, Lilibet.",
        "It is not known if King Charles was ever aware of the existence of the letter.But the fact that his mother, who went on to rule for an extraordinary seven decades, faced her own destiny knowing she had much to live up to, will no doubt provide reassurance on the eve on his own coronation.Queen Elizabeth utterly adored her father and his death, when she was on a trip to Kenya with Prince Philip, hit her hard.But she had little time to mourn, having to step up and immediately take over his responsibilities as head of state.So diligent was she in her duties that Charles later complained she was not just a physically distant mother, often travelling abroad as part of her official duties, but an emotionally distant one too.",
        "The King was just three years old when he became Heir Apparent and four by the time his mother was crowned more than a year later.But he always doted on her – and she him – and mother and son became much closer in the years before her death.Charles would often pop in to spend time with her at Windsor when he was there on official business, such as investitures, and the pair would sit talking companionably in her private compartments.The King was also at Balmoral when his mother died in September last year, along with his sister, Princess Anne."
    ]
}