{
    "articleURL": "/wires/aap/article-12043287/Nicho-Hynes-not-guaranteed-Origin-spot-Fittler.html",
    "content": [
        "Nicho Hynes has not yet done enough to guarantee a State of Origin debut, with NSW coach Brad Fittler challenging the Cronulla captain to keep his blistering form up for the next three weeks.",
        "Hynes collected the Dally M Medal in his first year with the Sharks but has taken his game to new heights in his second, buffing up his defence and guiding Cronulla to a three-game winning streak.Even after missing the first three weeks of the season through injury, Hynes is ranked equal-third in the Dally M stakes after round nine, trailing only probable NSW teammates Payne Haas and Nathan Cleary.The 26-year-old was selected as 18th man for the Origin series opener in 2021 and the first two games of last year but has yet to make his Origin debut.Given his ability to play as a fullback as well as in the halves, Hynes could be selected as a bench utility if not as Cleary's halves partner, but Fittler is holding his cards close to his chest at the selection table.\"There's still three weeks and he's got a couple of games to go. Not only has he still got to keep playing well, stay injury-free,\" Fittler said.\"There are couple of other players there doing a good job as well.\"But just watching him is enjoyable, watching what he does on the field and off the field. He's a great role model for the game.\"Cleary's Penrith co-pilot Jarome Luai is the incumbent NSW five-eighth and Hynes' biggest competition for a spot in the starting side.",
        "Luai has had a quieter start to the year than Hynes, with the reigning premiers managing only four wins from their first eight games of the season.Cleary, Luai, Liam Martin, Isaah Yeo, Brian To'o, Stephen Crichton and Api Koroisau have all been selected in the Origin side while playing in the Panthers' two premiership seasons as Fittler looked to capitalise on the club's recent success.The Panthers' lukewarm start to the season appears unlikely to sway Fittler dramatically from this outlook, the coach defending the side's form amid a tough run of injuries and roster changes.Koroisau and key forward Viliame Kikau both left the club at the end of the 2022 season, while premiership players Martin, James Fisher-Harris, Izack Tago, Taylan May and Spencer Leniu have all spent time in the casualty ward to start the season.\"They are just going through their challenges,\" Fittler said.\"Their club is in a pretty good position considering the injuries they've got this year and the players they lose each year.\"Fittler refused to rule Jake Trbojevic out of his calculations despite the Manly prop suffering a calf injury that the club says will keep him out for the first game of the series.\"I just spoke to Jake Trbojevic last night. Manly says four weeks, Jake says two. We'll wait and see,\" he said.",
        "The utility value of Canterbury halfback Matt Burton, selected in the Blues' centres last year, has once again made him an enticing prospect for Fittler and his staff.\"Matty has the advantage of being able to play other positions,\" Fittler said.\"You need to have some versatility among your team. It's pretty tricky because you've got three games but you need to nail each one.\""
    ]
}