{
    "articleURL": "/wires/reuters/article-12046083/Carlyles-quarter-earnings-drop-10-lower-asset-sales.html",
    "content": [
        "By Chibuike Oguh",
        "NEW YORK, May 4 (Reuters) - Carlyle Group Inc said on Thursday its first-quarter distributable earnings fell 10% year-on-year owing to a sharp drop in asset sales from its private-equity portfolio that was partly offset by strong growth in its credit business.It was the first earnings the Washington, D.C.-based firm reported after former Goldman Sachs Inc executive Harvey Schwartz was named CEO in February.Carlyle said its distributable earnings, which represent the cash used to pay dividends to shareholders, fell to $271.6 million, down from $302.8 million a year earlier. That resulted in after tax distributable earnings per share of 63 cents, which underperformed the average analyst forecast of 69 cents, according to Refinitiv data.A slowdown in dealmaking amid rising interest rates and higher inflation have limited the ability of private-equity firms to cash out on their assets for top dollar.Carlyle said its revenue for asset divestments fell 30% to $165.1 million during the reported quarter.Last month, Blackstone Inc, the world's largest private-equity firm, reported a 36% drop in first-quarter distributable earnings due to slower asset disposals, primarily in its real estate portfolio.Carlyle's credit business recorded strong performance during the quarter, with segment distributable earnings nearly doubling to $69 million, helped by higher fund management fees from managing more assets, including from reinsurer Fortitude Re.",
        "Carlyle said its credit funds appreciated by 3%, while secondaries funds rose 5% and corporate private-equity funds gained 1%. Blackstone had said its corporate private-equity funds had appreciated by 2.8% while liquid credit funds gained 3%.Under generally accepted accounting principles, Carlyle's net income tumbled to $100.7 million, down 82% from $571.6 million a year earlier, driven by a slump in investment income.Carlyle generated fee-related earnings of $193.4 million, raised $6.8 billion of new capital, and spent $3.8 billion on new acquisitions. Its total assets under management reached a record $381 billion, up 2% from the prior quarter, driven by fund appreciation. The firm declared a dividend of 35 cents.(Reporting by Chibuike Oguh in New York; Editing by Sherry Jacob-Phillips)"
    ]
}