{
    "articleURL": "/news/article-12048333/Rishi-Sunak-bounces-local-elections-GP-access-plan.html",
    "content": [
        "Pharmacies will be asked to issue more prescriptions to free up appointmentsMinisters fear that some councillors will blame the Government for their defeat Rishi Sunak will publish long-awaited proposals to improve access to GPs next week, in a bid to bounce back from yesterday’s local elections.",
        "Downing Street has drawn up plans for a health-focused mini-relaunch in the coming days to demonstrate that the Prime Minister is focused on delivering on the public’s priorities.The package will include the Government’s delayed primary care plan which is designed to free up hundreds of thousands of GP appointments by asking pharmacists to issue more prescriptions.Mr Sunak was last night braced for the Conservatives to lose hundreds of seats in council elections across the country. Ministers fear that some councillors will blame the Government for their defeat.A Savanta poll yesterday found that 25 per cent of Conservative councillors are ‘dissatisfied’ with the leadership of the party, compared with 63 per cent who say they are satisfied. Some 34 per cent said they were unhappy with the direction of the country.",
        "In a damage-limitation exercise ahead of the poll, the PM acknowledged that the elections were ‘going to be hard for us’. ‘Good councillors will lose their seats because of all that has happened over the past year,’ he said.But he insisted that a ‘tough night’ should not ‘dishearten’ activists, adding that the Tories were still the party with ‘energy and ideas’.A senior Tory source said: ‘The circumstances mean this round of elections was always going to be very difficult for us. We are mid-term and the country want us to deliver on their priorities.",
        "‘I think that after the Coronation you will see the Prime Minister move on pretty quickly to do exactly that.’",
        "Ministers have faced calls to ease the difficulties faced by people trying to get a GP appointment, and end the ‘8am rush’ which sees phone lines to surgeries jammed every morning. Under plans to be published next week, pharmacists will be given wider powers for prescribing medicines to take pressure off GP practices. GPs will also be encouraged to sign up to online triaging services which divert patients to the most appropriate care, reserving face-to-face appointments for patients in need.Ministers hope the focus on delivery in a key priority area will quickly overshadow the impact of the local election results. Experts have predicted the Tories could lose up to 1,000 seats while Sir Keir Starmer is under pressure to pick up at least 700 Labour seats. Yesterday’s election was the first national poll held with voter ID requirements.But despite warnings millions of voters could miss out, early reports suggested only a small number were turned away from polling stations for not having suitable ID.The Association of Electoral Administrators said polls had been ‘running as smoothly as usual’."
    ]
}