{
    "articleURL": "/wires/reuters/article-12047015/Britain-start-Australia-NZ-free-trade-agreements-month-end.html",
    "content": [
        "SYDNEY/LONDON, May 4 (Reuters) -",
        "Britain's free trade agreements with Australia and New Zealand are set to come into force at the end of this month, the business and trade ministry said as London seeks to deepen ties in the Indo-Pacific region.British Prime Minister Rishi Sunak will meet his Australian counterpart Anthony Albanese and New Zealand PM Chris Hipkins in London on Friday, ahead of the coronation of King Charles.Britain said that the two free trade agreements were expected go live from midnight on May 31.\"These landmark deals squarely deliver on my priorities to drive economic growth, boost innovation and increase highly skilled jobs across the UK,\" Sunak said in a statement.The agreements will see more than 99% of all Australian and New Zealand exports enter Britain duty free through a combination of tariff elimination and duty-free quotas.The deals come as London seeks to pivot towards the Indo-Pacific in light of its departure from the European Union.New Zealand forecasts the deal with its seventh largest trading partner will add NZ$1 billion ($626 million) to GDP each year and save NZ$37 million in tariffs annually. The UK estimates the deal will add 800 million pounds to its GDP.\"The market access outcomes are among the very best New Zealand has secured in any trade deal,\" Hipkins said in a statement.",
        "Duty-free quotas for major New Zealand exports such as dairy and red meat will gradually expand before being fully liberalised in five and 15 years, respectively. New Zealand exported NZ$455 million worth of beef to the UK in 2022.Britain has also agreed with Australia and New Zealand to increase the age of eligibility for working holiday visas to 35 from 30, letting people stay for up to three years at a time.($1 = 1.5959 New Zealand dollars) (Reporting by Lewis Jackson in Sydney and Alistair Smout in London; Editing by Andrew Cawthorne)"
    ]
}