{
    "articleURL": "/sport/football/article-12055213/Teddy-Sheringham-Jimmy-Carter-Alan-McLeary-reflect-Millwalls-miraculous-team-80s.html",
    "content": [
        "Teddy Sheringham had a hugely successful career at Man United and TottenhamHe also shone at Millwall in the 1980s as they made it into England's top-flightAlongside two ex-teammates, Sheringham has reflected on that golden period You would be forgiven for thinking Teddy Sheringham’s best times in football were at Manchester United where he won the Treble. Or perhaps it was playing for England in front of a packed Wembley at Euro 96. Or even at Tottenham where he won the Premier League golden boot.",
        "You would be wrong.‘People ask my best time in football and instinctively expect me to say Man United. But lifewise my favourite was Millwall,’ says Treble-winner Sheringham, whose celebrated career also took him to Tottenham, Nottingham Forest, West Ham and England at Euro 96.‘They ask who I keep in touch with, wanting to hear Gary Neville or Paul Scholes. Nah, it’s Jimmy Carter, Alan McLeary, Brian Horne, Tony Cascarino, my old Millwall team-mates. That’s what the club means to us.’Sheringham, fit and tanned, met up again with Carter and McLeary this week to reminisce about being the only Millwall team in their history to play in the top division, between 1988 and 1990.",
        "Gary Rowett’s class of 2023 can emulate them this season with victory against Blackburn tomorrow guaranteeing them a spot in the Championship play-offs.But they will do well to capture the imagination like John Docherty’s team 35 years ago, topping the First Division table at one point to the backdrop of the famous Millwall anthem: No one likes us, we don’t care.‘George Graham started the turnaround,’ explains Sheringham. ‘He hammered me every day — “Stop chipping the ball, goals don’t need to be pretty” — trying to raise standards.‘When he joined Arsenal, the Doc [John Docherty] took over. Millwall had never been in the top flight before. When we were promoted at Hull, fans got into the dressing room, grown men of 40 and 50 in floods of tears, “Do you know what this means to us? We never thought this would happen”.’",
        "Alan McLeary, a boyhood Millwall fan from south London and Docherty’s vice-captain, says the cigar-loving Scot knew exactly what he wanted.‘We didn’t deviate from 4-4-2 and picked the same XI,’ he says. ‘Terry Hurlock and Les Briley would win the ball and give it to the wingers. Jimmy and Kevin O’Callaghan would then put it in for Teddy and Cas [Cascarino]. Simplicity.‘Doc would sit with the players in his office, try to get to know them. Even his discipline had humour. If you got fined, it would be five Hamlets. You’d have to go down the shops to buy his cigars.’Millwall’s ground at the Old Den had a reputation for being intimidating. ‘Players still tell me it was horrible to go there. I say it could be horrible for us as well!’ says Sheringham.‘The fans could hammer you if you kept on making mistakes. It taught resilience. Some good players couldn’t handle it and fell by the wayside.’Carter adds: ‘The fanbase from previous generations were dockers and once a Millwall family, always a Millwall family. It’s not like other clubs where the son or daughter might end up supporting Man United. The fans would stand on Cold Blow Lane where their dads and grandads had. They could be tough. Being a winger closest to them, I’d be first to get it in the neck!’",
        "Fortunately, their Millwall team had momentum on their side. A 12-game unbeaten run saw them clinch promotion in 1987-88. That October they beat QPR to go top of the league. The following month, they drew 1-1 at champions Liverpool.‘I remember Anfield. Alan Hansen marked me and I couldn’t get near him or the ball. It was an eye-opener to what the top level was. It showed how well we competed that we took a point.‘We’d spent the summer being warned we could get battered if we weren’t at it. When we won a couple of games and then a couple more, we started to think we did belong.‘We had leaders all over the pitch. The actual captain Les Briley was a silent assassin. People would be looking out for Terry Hurlock with his reputation and Les could come in studs over the top. They were under-rated as footballers too.’",
        "Carter chooses a different highlight. ‘Our home game against Norwich on a Sunday, live on television. It had never happened to Millwall before, though we lost 3-2.‘I liked playing the hard-man left-backs like Julian Dicks and Stuart Pearce. You knew they would steam in so I’d be able to knock the ball around the corner for Teddy and we’d go on the attack. The player I didn’t like facing was Terry Phelan, too quick and gave verbals all game.’",
        "Sheringham interjects: ‘I got sent off for doing Phelan at Wimbledon. I smashed into him and it sparked a 20-man brawl. Those games against the Crazy Gang were absolutely mad.’Millwall ended 1988-89 a creditable 10th with Sheringham and Cascarino scoring 15 goals each. But financial reality caught up with them the following year. Cascarino was sold to Aston Villa before the end of the campaign and Millwall went down. ‘Our play was high energy and relied on really hard work. We ran out of steam,’ explains McLeary. ‘The Doc’s strength was his loyalty but in hindsight maybe we could have brought in one or two more.’‘Not that Millwall liked spending money,’ laughs Carter. ‘Our wages were offset by a win bonus, a crowd bonus, a position bonus. Except when we got our slips, the attendance would be down as 14,000 when it looked like a full house to us!’Today, Sheringham and McLeary will be watching Dartford in a National League South play-off game. Sheringham’s son Charlie plays for them and McLeary is a coach.",
        "Tomorrow, it’ll be up to the current generation at the New Den where Gary Rowett has built a resolute and organised Millwall team based around a strong togetherness. Sound familiar?‘I can see similarities with our side. Small budget, great team spirit,’ says Sheringham. ‘Promotion would be huge, it would set the club up for the next 10 or 15 years.’",
        "Instead of Sheringham and Cascarino, it is Tom Bradshaw and Zian Flemming banging in the goals nowadays, 32 between them.‘I don’t think there will be another one like Teddy but we’ve had our time, these players can make their own history,’ says Carter. ‘I never thought we’d be waiting 35 years for another promotion. These players can get themselves into the record books. What an incentive.’"
    ]
}