{
    "articleURL": "/tvshowbiz/article-12044503/Dancing-Stars-celebrity-line-leaked-ahead-new-season.html",
    "content": [
        "The new season of Channel Seven's Dancing With the Stars is currently in pre-production.",
        "And Daily Mail Australia can reveal that the 2023 series will feature a new-line up of judges and contestants who haven't already been seen on the dance floor.Sources close to production have let slip that season 20 will not be an All-Stars series as previously reported, but will showcase a new mix of talent.Sonia Kruger and Daryl Somers will both return as hosts.Kym Johnson, who previously appeared as a judge between 2013 and 2015, is tipped to return to the series and has been spotted in and out of meetings with Seven.",
        "As for this year's line up of stars, Aussie actress and ex-wife of Sean Penn, Leila George is a strong contender to star on the Channel Seven show.Natalie Bassingthwaighte is also tipped to join the line-up.The Newcastle-based actress and singer recently revealed she has temporarily relocated to Sydney, just in time for the series to begin filming.",
        "A member of Australia's beloved boy band, Human Nature, is set to add some smooth moves to the mix, according to the spy.Meanwhile, Dr. Chris Brown, who recently defected from Channel 10 to Seven, was previously rumoured to co-host the series alongside Kruger, but according to The Sunday Telegraph he missed out due to a 'miscalculation'. TV bosses were apparently 'compelled to extend the invitation to Somers' after miscalculating Brown's start date at Channel Seven, the publication claims. ",
        "Chris, who is still contracted to rival Ten, will join Seven in July which is too late for the show's producers, BBC Studios, to start filming.Hey Hey It's Saturday veteran Somers, 71, is no stranger to the DWTS franchise, having previously co-hosted the show between 2004 and 2007, and then again in 2021 alongside co-host Kruger. Seven announced in March it would resurrect the popular reality TV program for its 20th season. The competition series is expected to be screened in the second quarter of the year."
    ]
}