{
    "articleURL": "/wires/pa/article-12055059/US-anglophiles-hail-beautiful-coronation-celebrations-UK.html",
    "content": [
        "US anglophiles say the “beautiful” celebrations and ceremony surrounding the King’s coronation in the UK shows that “we still have some depth in our world”.",
        "Californian locals arrived at Ye Olde King’s Head in Santa Monica on Saturday to watch replays of the ceremony alongside British expats.Shirley Aconti, who lives in Beverly Hills, had arranged to have high tea and watch the coronation with her friends at the pub.She dressed up in a sparkling silver cardigan, with a locket of Queen Elizabeth II and a small plastic tiara.",
        "“We’re going to have the tea with all the famous English goodies and sandwiches and watch the coronation on the big screen,” she told the PA news agency.“They make it so beautiful and so historic and I hope they keep it that way. It shows we still have some depth in our world.”She added: “Everybody that I know is just thrilled about it. We love it. Americans are very interested in the monarchy.”Erin Gerton, who came to Ye Olde King’s Head with her British friend, said she felt it was “important” for her daughter to watch the ceremony.",
        "“You can read about the ceremonies but it doesn’t mean as much so the fact we can see it and what (Charles) is doing differently is important,” she told PA.Eight-year-old Violet said she was “very excited” to watch the coronation but had been “sad” about the death of Queen Elizabeth II.",
        "Los Angeles resident Jenny Welsh told PA she had wanted to celebrate the coronation with “people that care”.“I will never not root for royalty,” she said.“I’ve got friends that say it’s crazy and that there’s a million problems with it, and I totally get it…and yet there’s something about the lineage, the tradition, something that stays and is exciting.",
        "“The jubilee, the funeral and now this. I wanted to come down here and be with people who cared.”Ms Welsh said she had become a royalist after watching the wedding of Charles and Diana, Princess of Wales, but had since grown a “soft spot” for Camilla.“I want the old guy (Charles) to be happy. He waited a long time, I want him to succeed…I wish him well,” she said.She added: “I’m going to have an English breakfast, maybe a couple of pints and then go to the beach for a snooze.“It’s the perfect Saturday.”"
    ]
}