{
    "articleURL": "/news/royals/article-12052017/Photographer-taking-official-Coronation-favourite-King-Charles.html",
    "content": [
        "Hugo Burnand, 58, is the only portrait photographer with a Royal warrantHe was the official snapper at Prince William and Kate's wedding back in 2011 The photographer tasked with taking official pictures at the Coronation is a favourite of King Charles who is known for his catchphrase: ‘Don’t f**k it up’.",
        "Hugo Burnand, 58, is the only portrait photographer with a Royal warrant, and is considered a safe pair of hands to capture the great and the good looking their best. The high society snapper was the official photographer at Prince William and Kate’s wedding in 2011 which he called ‘the gig of the century’. He will now be following in the footsteps of Cecil Beaton who famously photographed the late Queen, then 27, when she was crowned at her Coronation in 1953. Burnand is an obvious choice and safe pair of hands to record the Coronation today as he has plenty of experience of putting Charles and Camilla at ease, having repeatedly photographed them over the last 18 years. ",
        "The former Tatler photographer won acclaim for his ‘relaxed, but regal’ official pictures of the couple’s wedding in Windsor in 2005 after Camilla emailed him to say that she and Charles wanted him for the role. Burnand also took pictures of Charles on his 60th birthday in 2008 and his 70th in 2018 and pre-Coronation portraits of him and Camilla in March in the Blue Drawing Room at Buckingham Palace. Others who have posed for him include Bill Clinton, President Mikhail Gorbachev, Baroness Thatcher, Lucian Freud, Spike Milligan, Victoria Beckham and Michael Jackson. ",
        "Burnand told Hello magazine in 2008 how he preferred an ‘approachable feel’ to his subjects, describing his method of taking pictures as ‘almost talking to the person”. He once revealed his secret for snapping the perfect photograph as being ‘the three Ts: tummy, tits, teeth.’ ",
        "Explaining his words, he said: ‘Suck it in, thrust them out, flash those pearly whites. And for the perfect smile? Don't say cheese. Say: “shit!” Try it. It works.’ Burnand also has another trick up his sleeve to make sure children behave by bribing them with jelly beans to make sure they follow his instructions which should come in handy when he wants to get the attention of Prince George, Princess Charlotte and Prince Louis. The trick gave him a good rapport with the page boys and bridesmaids at William and Kate’s wedding, enabling him to get his favourite photograph of the day featuring the couple on the steps of the throne room at Buckingham Palace with the children surrounding them. The picture showing Kate’s hand casually resting on William’s knee, as a page boy playfully leaned in was taken in a three minute time slot before the wedding flypast. The snapper later told Town and Country magazine: ‘The flypast was at 1.30pm and we couldn’t overrun, even by a minute.’ ",
        "Burnand who has also photographed the Queen and Princess Anne had to cycle to Buckingham Palace with his team of six from his studio in Notting Hill studio on the day of the wedding because of all the road closures. ",
        "He used staff with stopwatches to fit in pictures in allotted time slots, raising the possibility that he will have to do the same to organise his official snaps today. Burnand who spent three weeks preparing for the 2011 wedding, recalled: ‘We had spares for everything and then spares for the spares. ‘We did dress rehearsals with stopwatches using endless staff from Buckingham Palace to fill in as family members, so we knew we had just enough time.’ It has been reported that his Coronation photographs will feature traditional and modern elements – reflecting the new Carolean era which is the name given to the reign of King Charles III. Beaton's portraits of the late Queen after her Coronation service were very different from the official pictures taken when her parents were crowned in 1937, and her grandparents, George V and Mary, came to the throne in 1911. He rejected having static line-ups of royals in favour of more dynamic compositions, featuring the Queen wearing the imperial state crown and her coronation robes while holding the orb and sceptre. ",
        "The historian Hugo Vickers, a biographer of Beaton, told the Sunday Times: ‘Beaton's images were such a success because he captured a young woman looking assured and in control, not overawed by the trappings of monarchy. ‘Burnand won't have a young, romantic queen, but his portraits of the King and Queen Consort in full splendour will be a big statement and crucial in setting the tone for the new reign.’ The photographer who is British was born in Cannes, France, and took up photography at the age of seven when he was given his first camera by his grandmother as a seventh birthday present. His website describes how he first learned to develop and print photographs his kitchen table at home, with his photographer stepmother Ursy Burnand who raised him after his mother Susan Gordon died in a car accident a year after he was born. Describing how he learned from her, he said: ‘I spent many childhood years helping her convert our kitchen into a darkroom after supper most evenings, blacking out the windows and putting the enlarger on the kitchen table which the dogs were sleeping under. ‘She is enormously talented with a fantastically sympathetic and humorous eye.’ Burnand, who enlisted his stepmother to help him at the weddings of William and Kate as well as Charles and Camilla, won his first photography competition at the age of seven at Cheam School in Headley, Hampshire, which was the prep school attended by the King and the late Prince Philip. ",
        "He honed his skills at Harrow by taking portraits of school-leavers, and worked as a stable hand, and an insurance broker at Lloyds of London before becoming a professional photographer at the age of 27. Burnand became known as a society photographer during more than 20 years spent working on Tatler’s Bystander party column. During that time, he took the steely portrait of former prime minister Margaret Thatcher and husband Denis, seemingly reluctantly holding hands on a gold coloured sofa, for their Golden Wedding anniversary. He also photographed David and Samantha Cameron’s wedding in 1996 and regularly photographs his own family, taking a new birthday portrait of each of his four children ‘no matter where they are in the world’. His portfolio includes a striking black and white image of himself, his former wife and their children lying face down and naked on top of each other ‘in a human pyramid’ with Burnand at the bottom of the pile. Burnand talked of his love of taking photographs and travelling the world in a 2021 interview, saying that he ‘really, really enjoy[s] it and want[s] to keep doing it’."
    ]
}