{
    "articleURL": "/wires/aap/article-12052523/Bushfires-brutal-blow-threatened-Aussie-frogs.html",
    "content": [
        "Not too long after the Black Summer blazes tore across NSW, Chad Beranek found himself plodding through boggy bushland listening for farts.",
        "The object of his desire was Philoria pughi, a mountain bog frog of ancient lineage with a call that sounds just like a bum burp.In some locations, the endangered species is still numerous enough to emit a comforting chorus.But in others - notably in the state's north, where the fires that raged from mid-2019 into early 2020, did so much damage to the rainforest - they were barely heard.The University of Newcastle ecologist has just published the first extensive survey of amphibian communities since the fires and says other species have similarly suffered.They include the tiny but intriguing marsupial frog, which carries its tadpoles around in pockets on its hind legs. When numbers are good, it's not difficult to find them thanks to their \"little creepy laugh\".\"You're in the rainforest and it's at night and you have all these little creepy chuckles coming from the leaf litter, wherever you go,\" Dr Beranek says.It was just like that in 2016, when he went on a field trip to the Washpool National Park, near Tenterfield in the New England region of NSW.\"But this time, when we went back, we barely heard any, which was very disheartening and worrying. Almost none really.\"In total, researchers from the University of Newcastle and the Australian Museum surveyed 35 threatened frog species across more than 400 sites in NSW's northeast and southeast.",
        "\"We looked at the amount of severe burning within the surrounding landscape, and correlated this to the presence, or absence, of frog species to get a picture of local extinction following the bushfires,\" Dr Beranek said.\"We found that the fires significantly reduced the distributions of at least six frog species and whole communities, especially in the southern NSW region where the fires were more severe. Some species are now locally extinct.\"The findings raise serious concerns about the survival of frogs as climate change fuels more frequent and more severe fires.And some of the species most at risk are the rainforest dwellers whose evolutionary history lies in the ancient supercontinent of Gondwanaland.\"Australia was once completely covered in rainforest, every inch of it, so they have all evolved from cool temperate rainforest ancestors,\" Dr Beranek says.\"You can think of a lot of our Gondwanan relic frogs as similar to platypus in terms of how weird and specialised they are.\"We were hypothesising that these rainforest species would not fare well with fire because they have no evolutionary history with dealing with fire.\"And they were right.But the fires also took a heavy toll on species researchers believed might be more resilient, like the Giant Burrowing Frog that lives in dry woodlands including the sandstone country that surrounds Sydney.",
        "\"Burrowing frogs are thought to be quite fire tolerant thanks to their ability to burrow underground to avoid heat,\" Dr Beranek.\"We were surprised to learn that burrowing species did not fare well in severe fire.\"It's possible the sheer scale and severity of the 2019-20 wildfires may have exceeded the physiological limits of even species with fire-resistant adaptations.\"There was one surprise though - tree frogs.It was assumed the severity of the fires and resulting canopy loss would hit them hard, but amazingly they were not impacted by severe fire.\"We suspect deep hollows in trees served as a buffer to help protect them from drought and fire.\"The study, funded by a federal government grant, has been published in the journal Diversity and Distributions."
    ]
}