{
    "articleURL": "/wires/reuters/article-12050109/Gaming-make-4-Wynns-planned-UAE-resort-tourism-executive.html",
    "content": [
        "By Lisa Barrington",
        "DUBAI, May 5 (Reuters) - Hotel and casino giant Wynn Resorts' planned project in Ras Al Khaimah is the emirate's largest FDI project, an official said, and 4% of the resort will be dedicated to gaming, underscoring the UAE's drive to remain the region's tourism hub.Wynn made headlines in January last year when it said Wynn Al Marjan Island, a free zone, would host the first gaming facility in the United Arab Emirates, where gambling has long been off-limits.Later, Wynn's chief executive said the resort's casino component was shaping up to be larger than its Las Vegas venue.\"The gaming space makes up 4% of the overall development,\" Raki Phillips, the chief executive of the Ras Al Khaimah Tourism Development Authority (RAKTDA), told Reuters this week.Wynn last week said the 1,500-room resort, built on a man-made island off the coast of Ras Al Khaimah (RAK), one of the smaller and less-known of the UAE's seven emirates, would cost $3.9 billion.Wynn and RAK authorities have said the gaming element will be licensed, but a question mark remains over how it - or other emirates that might follow Wynn's lead - would actually do so, until a prohibition is dropped from the UAE's penal code.\"The UAE is a very forward-thinking nation, especially when it comes to tourism and what that impact of an investment will do,\" Phillips said. \"Regulations have been put into place, there are a lot of elements that have been put.\"",
        "The Wynn resort will be a key element in RAK's intensifying push to boost tourism's contribution to its GDP to about a third at some point, Phillips said. Government data shows around 5% of GDP came from accommodation and food activity in 2019.Last year the emirate received its highest number of visitors ever, at 1.13 million.Phillips said Chinese travellers would be key to help RAK achieve its targets for visitor numbers.The emirate's bid to attract tourists plays out against the backdrop of intense competition in the Gulf, as the UAE vies with rapidly-opening Saudi Arabia to become the go-to destination in a region pivoting away from oil.In 2019, tourism contributed 11.6% to the UAE's GDP, or about 180.4 billion dirhams ($49.13 billion), government data show. Last year the UAE kicked off a strategy to boost that to $450 billion by 2031. ($1=3.6719 UAE dirham) (Reporting by Lisa Barrington; Editing by Clarence Fernandez)"
    ]
}