{
    "articleURL": "/news/article-12059583/How-East-End-gangsters-Kray-twins-arrested-murder-charges-55-years-ago-today.html",
    "content": [
        "Ronnie and Reggie Kray ran protection rackets in the East End of LondonWere arrested for murders of Jack 'the hat' McVitie and George Cornell They started out as petty criminals but ended up becoming the most notorious gangsters in British history.",
        "Twin brothers Ronnie and Reggie Kray used a mixture of extreme violence and intimidation to rule the criminal underworld in the East of London in the 1960s. But on this day 55 years ago, the night club owners' 12-year reign of terror finally came to an end when they were arrested on charges of murdering fellow gangsters Jack 'the Hat' McVitie and George Cornell.What followed in 1969 was the longest and most expensive trial in criminal history, all conducted under an intense media spotlight, as the men who had mixed with high-profile celebrities including Barbara Windsor finally faced justice. After being convicted, Ronnie was eventually committed to Broadmoor psychiatric hospital, whilst Reggie - who had driven his young wife Frances to suicide - spent most of the rest of his life behind bars.",
        "The brothers' lives have been dramatised several times on the big screen, most famously in 1990 film The Krays and 2015 production Legend, in which Tom Hardy portrayed both of them. Ronnie and Reggie, who grew up in Bethnal Green and Haggerston in East London, with older siblings Charlie and Violet, began their criminal careers with a string of violent offences as teenagers.By the time they were 21, they were known across the East End as the most vicious criminals in London's gangland scene.",
        "They went on to develop a protection racket network in which they forced fashionable clubs to pay weekly fees to stop them from destroying their livelihoods.And to mask their misdeeds, they donated money to charity, even buying tickets boxing shows in aid of cancer victims. ",
        "As well as intimidating business owners, they opened clubs of their own - most famously Esmeralda's Barn in Wilton Place, Knightsbridge.The Krays initially went on trial in 1965, when they were charged with demanding money with menaces (blackmail), but were acquitted.Brazenly, they then held a celebration party at the El Morocco Club in the West End and even invited Lenoard 'Nipper' Read, the Metropolitan Police Detective who had been investigating them.It was Nipper who, three years later, would arrest both men and charge them with murder. Ronnie had murdered Cornell in March 1966 amid an ongoing turf war with a gang led by Charles Richardson in South London.Cornell, an active member of the Richardson gang, had a violent row with Ronnie over his and his brother's desire to expand their protection racket into clubs south of the river. Ronnie then shot Cornell when he was drinking in the Blind Beggar pub in Whitechapel.Reggie then killed McVitie after luring him to a drinking party and repeatedly stabbing him.",
        "The murders of both Cornell and McVitie were depicted in Hardy's 2015 film. The brothers' convictions were secured thanks to the evidence of several witnesses, including Carol Skinner, whose flat had been the site of McVitie's murder. Earlier this year, documents relating to the Krays' trial that were kept by Read for decades afterwards came up for sale.He kept meticulous reports as he tried to find evidence and witnesses who would be willing to testify.Also featured in the trove were transcripts from every day of the brothers' trial. He detailed their attempts to tamper with witnesses and get the jury dismissed. After their convictions, famed Daily Mail journalist Vincent Mulchrone wrote: 'The Kray business in mass extortion, violence and death was liquidated by the most brilliant campaign of criminal investigation in the Yard's history.'But it was also a classic achievement at the highest level of detective work - crime prevention. ",
        "'Had it failed, the lives of at least four women and eight men would be in imminent peril today.' Both of the Kray twins were sentenced to life imprisonment, whilst their older brother Charlie was handed ten years behind bars.In 1979, Ronnie, a paranoid schizophrenic, was moved to broadmoor after being certified insane.Reggie spent time in jails including Maidstone Prison in Kent and Wayland in Norfolk. ",
        "The pair were allowed out from their confinement for a day in 1982 so they could attend the funeral of their beloved mother, who was also called Violet. Reggie was then pictured at his brother Charlie's funeral in 2000.  Ronnie died aged 61 from a heart attack in 1995, whilst Reggie was released from prison on compassionate grounds in August 2000, five weeks before his death from bladder cancer. "
    ]
}