{
    "articleURL": "/tvshowbiz/article-12054787/Britains-Got-Talent-judges-blown-away-school-childrens-cheeky-royal-song.html",
    "content": [
        "Britain's Got Talent judges were blown away by a group of talented school children during the show's Coronation special on Saturday.",
        "Taking to the stage, teacher Banji was joined by his class as they revealed their dream of performing for King Charles himself - with the show's prize being a slot of the Royal Variety performance. The group then left the audience screaming for more with an incredible song and dance as they imagined being Monarch for a day in the pre-recorded show.From unending supplies of pizza to bags of pocket money, one lad even had a huge cream pie pushed into his face during the fun-filled routine.The judges couldn't contain their laughter with Amanda Holden, 52, telling the young performers: 'I think if King Charles III was here now, sat up in the box, he would have absolutely loved it.",
        "While usually stoney face Simon Cowell, 63, flashed a huge smile admitting: 'Sometimes when we see these school acts nobody is smiling, they're all miserable but this was the opposite'.'It was brilliant, fun, very British and everything we were looking for'.  While Amanda, Bruno Tonioli, 67, and Alesha Dixon, 44, sent the group straight through to the semi finals, Simon appeared unsure.They said: 'I need to think about this, throwing pies in each others faces, eating pizza....'.Before declaring: 'That's exactly the type of school i would like to go to, it's four yeses!'.  ",
        "Elsewhere in the episode, nineties TV icon Mr Blobby threw the show into chaos as he made his epic comeback.The manic pink character attempted to impress with his own unique brand of magic before falling flat on his face in front of the judges.Blobby - who found fame in BBC1's Noel Edmond's House Party - is welcomed by a round of applause from the audience. ",
        "However judge Alesha grumbles 'oh no' as soon as she claps eyes on the chaotic pink and yellow spotted icon. As he makes his way from the stage to the panel he takes a tumble with Bruno declaring: 'Mr Blobby is going to hospital'.He then offers Amanda a card as he attempts to showcase his magic tricks, only to fail dismally. ",
        "While the audience were left in stitches head judge Simon glared as he appeared to be less than impressed. Created by Charlie Adams, a writer on Noel's House Party, Mr Blobby is a bulbous pink figure who  communicates only by saying the word \"blobby\".He topped the UK Charts in 1993 with his Christmas hit 'Mr Blobby' and more recently has appeared on Dancing on Ice, Loose Women and This Morning. Britain’s Got Talent airs on Saturday nights, ITV "
    ]
}