{
    "articleURL": "/news/article-12042137/Texas-cops-arrest-MULTIPLE-people-nabbing-gunman-shot-killed-five.html",
    "content": [
        "Cops say they arrested at least one other person alongside illegal immigrant Franceso OropesaHis wife Divimara Lamar Nava, 53, has been arrested on suspicion of hindering the apprehension of a felonOropesa allegedly massacred five last Friday after his neighbor confronted him over waking his baby with gunfireTexas police say they've arrested the wife of the suspected gunman accused of shooting and killing five people.",
        "Francesco Oropesa, 38, was found hiding in a laundry basket in Conroe, Texas, Tuesday evening,  11 miles from the crime scene. San Jacinto County Sheriff's Office confirmed that they arrested Oropesa's wife,  Divimara Lamar Nava, 53, for hindering the apprehension of a felon.She was booked into Montgomery County Jail Tuesday evening, though court records list her as not being legally married. The pair share a home together, and Montgomery COunty Sheriff Rand Henderson confirmed they believe she hid him in the home near Conroe where he was arrested.Oropesa, a Mexican national, had been deported from the US five times prior to the mass shooting which saw a nine-year-old boy killed 'execution-style'. ",
        "Oropesa's wife was interviewed multiple times and is in 'constant contact' with investigators, according to authorities. He is accused of shooting and killing five last Friday after being asked to stop firing his gun by neighbors who said the gunshots were scaring their newborn.Authorities confirmed that he had not been hiding in the house he wa apprehended in for the duration of the manhunt. Sheriff Tim Kean said Oropesa 'thought he was in a safe spot', and confirmed a sighting of him on Highway 105 was the suspected murderer. Authorities said Oropesa had a cell phone with him when he was found and that the people he had been contacting never left the area.",
        "Kean added: 'Anybody that helped this maniac definitely has some kind of issues as far as I'm concerned.'He is set to be charged with five counts of murder, with bond likely to be set at $5 million.Wilson Garcia said he asked Oropesa to stop firing his gun because it kept his one-month-old baby awake, before the migrant killed Garcia's wife Sonia Guzman, 29, and their son Daniel Enrique Laso-Guzman, 9.",
        "Oropesa, who had been deported from the US five times, also shot dead Diana Velazquez Alvarado, 21, Julissa Molina Rivera, 31, and Jose Jonathan Caserez, 18, during the incident.Garcia says one of the dying women urged him to jump out the window because his other two children needed a parent. He lived next door to Oropesa for three years without incident.His wife also called officers five times before the shooting, with Kean saying that there was an aggravated robbery at the time, which was deemed to 'trump' the information they had on Oropesa at the time. The response time for officers was 14 minutes, with the illegal immigrant killing five in that time and fleeing. Garcia told CNN : 'She saw when my wife fell to the ground and was dying, and she told me to throw myself out the window because my children were already without their mother.",
        "'I have no words to describe what happened that night. I feel like I'm not alive, but at the same time I am.",
        "'What happened was horrible and ugly. I lived through it because I was there and managed to miraculously escape.'My nine-year-old son and my wife died, and two people who died protecting my two-and-a-half-year-old daughter.'They protected my one-and-a-half-month-old son, covering him with a lot of clothes so that the murderer would not kill him too. Imagine how we feel right now.'Garcia confirmed he and two others went to try to speak to Oropesa about the noise from the gun, but was told that it was his property so he could do what he wanted.Texas Governor Greg Abbot offered $50,000 for his capture, and other counties' have chipped in $5,000, with the FBI offering $25,000.Garcia added: 'We had company. We were going to make something to eat, the guy, came out and he was shooting.' I said to my wife: 'Get inside, because this man has already loaded his gun'. I told her 'I don't think he is coming here to just threaten us.'",
        "'Then my wife said, 'You should go inside, because I don't think he will shoot me. I am a woman.'",
        "'She said, 'I'm going to stay here, I'm going to stay in the door.' He just came and shot, that is, without saying anything. Bam. And my wife went down.'I don't know what to tell you. He might have been intoxicated. Might have been drunk. But everything he did... he knew what he was doing.'Because a drunk person who can't even stand up anymore, I don't think would have grabbed a gun and loaded it and started shooting.San Jacinto County Sheriff Greg Capers said on Sunday 'My heart is with this nine-year-old boy. I don't care if he was here legally. I don't care if he was here illegally. He was in my county'Honduran flags are seen decorating a tree where the five people were shot and killed, as the Foreign Ministry prepares to repatriate their remains.'He discovered that some of the people escaped and came back to finish them off and shot them in the head. When he didn't get us, he came back and shoot everybody else in the head.",
        "'I never thought that he would shoot. Then he went room to room, looking for people.'He couldn't catch up to me. The bullets were hitting everywhere. I never had a problem with him. I can't believe what he did.'",
        "The FBI initially used the wrong photo in their wanted poster, but on Sunday corrected it, and also corrected the spelling of the shooters last name.All those killed were Honduran nationals, with the Honduran Foreign Ministry preparing to repatriate their remains.In a statement, they said: 'The Government of Honduras deeply regrets the loss of these valuable lives and accompanies all their loved ones in their pain.'We demand that the pertinent authorities arrest the perpetrator of this terrible event and apply the full weight of the law.'Enrique Reina, Honduras' Secretary of Foreign Relations and International Cooperation, offered his condolences to the families of the San Jacinto County shooting victims.",
        "He said: 'Our condolences to the families of the victims of this terrible crime. We demand that the full weight of the law be applied against the person(s) responsible for this crime.'Police had been called to the home before for reports about the firing of guns, but nothing was done.Oropesa has a large tattoo on the inside of his forearm of what appears to be a female Aztec, wearing a headdress.Police have found an abandoned cell phone and articles of clothing lying around and tracking dogs from the Texas Department of Correction 'picked up a scent and then lost that scent in the water.'",
        "All of the victims were shot from the 'neck up', with two found in a bedroom laying over two children in an apparent attempt to shield them.Officials said there were ten people in the house, including three children who were not hurt.",
        "Rene Arevalo Sr., who lives close to Oropesa's house, said he heard gunshots around midnight but was unperturbed, as gunfire is normal in the neighborhood.'It's a normal thing people do around here, especially on Fridays after work,' Arevalo said.'They get home and start drinking in their backyards and shooting out there.'He told ABC 13 that Oropesa threatened to kill his dog after it got loose in the neighborhood.His dog chased a pit bull in Oropesa's truck.'I tell my wife all the time, 'Stay away from the neighbors. Don't argue with them. You never know how they're going to react,'' Arevalo said.'I tell her that because Texas is a state where you don't know who has a gun and who is going to react that way.'"
    ]
}