{
    "articleURL": "/wires/afp/article-12047893/Ex-Pentagon-chiefs-call-US-Senate-approve-military-nominees.html",
    "content": [
        "Seven former US secretaries of defense called in a letter Thursday for the Senate to quickly approve nearly 200 nominations for senior military positions, delayed over a lawmaker's opposition to the Pentagon's abortion policy.",
        "Senator Tommy Tuberville, a Republican from Alabama, pledged in February to block Senate confirmation of Defense Department nominees after the agency said it would assist troops traveling to receive abortions.Though the nominations can still work their way through the Senate, Tuberville's \"hold\" means they cannot be quickly approved through the usual procedure.\"The current hold that has been in place now for several weeks is preventing key leaders from assuming important, senior command and staff positions around the world,\" wrote the former defense chiefs, who served under former presidents Bill Clinton, George W. Bush, Barack Obama and Donald Trump.\"Some are unable to take important command positions, such as leading the 5th Fleet in Bahrain and the 7th Fleet in the Pacific, which are critical to checking Iranian and Chinese aggression, respectively,\" they said in the letter addressed to Senate leaders Chuck Schumer and Mitch McConnell.Tuberville, a member of the Senate Armed Services Committee, tweeted in mid-February that because Defense Secretary Lloyd Austin is \"following through with his radical plan to facilitate thousands of abortions a year with taxpayer dollars,\" he would \"hold all DoD civilian &amp; general/flag officer nominees that come before the U.S. Senate.\"The US Supreme Court in June 2022 struck down the nationwide right to abortion, meaning troops stationed in places that subsequently banned the procedure must now take leave and travel to areas where it is legal.",
        "In response, Austin directed his agency to develop policies -- which were released in February -- to allow servicemembers to take administrative absences in order to receive \"non-covered reproductive health care,\" and to establish travel and transportation allowances to help service members cover costs.\"We appreciate that senators can have sincere and legitimate concerns about a Pentagon policy,\" but \"we believe placing a hold on all uniformed nominees risks turning military officers into political pawns, holding them responsible for a policy decision made by their civilian leaders,\" the ex-defense chiefs' statement said."
    ]
}