{
    "articleURL": "/tvshowbiz/article-12048783/Big-Brother-star-Farmer-Dave-Graham-announces-major-life-change-months-engagement-news.html",
    "content": [
        "Big Brother Australia star 'Farmer Dave' Graham recently announced his engagement to boyfriend Shazli after less than a year of dating.",
        "Now the farmer-turned-dog trainer, 42, who appeared on the reality show in 2006 and in 2022 for the reboot, has announced another major life change. Taking to Instagram on Wednesday, the hunky TV star revealed he is 'making some changes' to improve his 'work/life balance'.He made the admission in a reel of pictures which showed him relaxing in a luxurious deep stone bathtub at Logan Brae Retreats in the Blue Mountains 'for a midweek getaway'. The caption read: '2023 is the year I decided I'm halfway through this thing called life so I'd better make some changes, particularly around work/life balance.'",
        "'After all, what behaviour am I modeling to the young people I work with? So I work hard and rest well,' he continued.Farmer Dave went on to say he spent the day corralling 'a rogue alpaca who was menacing the local neighbourhood' before he 'checked in' with his workers. After he 'helped with a bit of rubbish clean up', he explained that he and his 'beautiful bloke' Shazli travelled up to the Blue Mountains for a 'midweek getaway'. ",
        "The former reality television star then kicked his feet up and relaxed back into the huge tub in his getaway room. Looking out over a gorgeous view of the Blue Mountains area, he seemed as relaxed as ever and enjoying life with his partner as a newly engaged couple. ",
        "The lovebirds announced their engagement in early January, with Farmer Dave telling Woman's Day magazine he can't wait to have a 'big outback wedding'.Dave met Pakistan-born Shazli at a Sydney pub in early 2022 and immediately fell for his good looks and gentlemanly manners."
    ]
}