{
    "articleURL": "/wires/ap/article-12061059/Washington-governor-signs-law-allowing-duplexes-fourplexes.html",
    "content": [
        "SEATTLE, Wa. (AP) - At a time of soaring home prices, rising homelessness and a housing crisis in Washington that will require 1 million homes over the next two-plus decades to keep up with population growth, Gov. Jay Inslee on Monday signed a law legalizing duplexes and fourplexes in most neighborhoods in nearly every city to increase the state's housing supply.",
        "House Bill 1110 overrides local zoning rules that have long kept large areas in cities for only single-family homes. The new law will not ban the construction of single family homes, but it will stop cities from requiring neighborhoods to have only single-family homes.As cities lobbied to maintain control on zoning regulations, similar legislation had failed in recent years. But supporters this year worked closely with the Association of Washington Cities, which gave support in the final weeks of Washington's legislative session.States have increasingly stepped in to contend with a national housing crisis as populations grow and housing stocks fail to keep pace. Oregon eliminated single-family zoning in 2019 and California largely did the same in 2021.Opponents of the new Washington law argue planning and land use decisions should be handled locally and that the law is a gift to developers without doing enough to increase affordable housing.Supporters of the measure, however, contend an increase in the housing supply is a critical step in navigating the housing crisis. The state Department of Commerce estimates Washington needs to build an additional 1 million homes over the next two-plus decades to keep pace with population growth.\"We are going to make it easier to build housing of all shapes and sizes in Washington,\" said Democratic Rep. Jessica Bateman, of Olympia, who was lead sponsor of House Bill 1110.",
        "The law requires cities with populations between 25,000 and 75,000 to allow duplexes in all residential areas. Any area within a half-mile of a major transit stop, park or school would have to allow fourplexes. The building of fourplexes would be allowed anywhere if one unit meets affordable housing requirements.In cities of over 75,000 people, all residential areas must allow fourplexes. Areas near major transit, parks or schools have to allow six-plexes, which would be allowed anywhere if two of the units are affordable."
    ]
}