{
    "articleURL": "/wires/ap/article-12046569/Denmark-boost-military-spending-upgrade-facilities.html",
    "content": [
        "COPENHAGEN, Denmark (AP) - Denmark´s centrist government wants to spend 38 billion kroner ($5.6 billion) over the next decade to modernize military facilities, renovate shabby and dilapidated buildings, increase the number of soldiers and upgrade outdated computer systems.",
        "Acting Defense Minister Troels Lund Poulsen called it \"a very serious situation\" and said Thursday that previous governments and senior defense officials haven't prioritized spending money on such facilities.\"Are all responsible for the fact that we have ended up in this situation,\" he said.\"For many years, the security policy situation has worn down the armed forces,\" Lund Poulsen said. \"We are now faced with a major task of restoring the foundation of the armed forces before we build on top of it.\"\"We lack soldiers and many buildings are not up to date, or are dilapidated. The same applies for part of our equipment and the computer systems,\" Gen. Flemming Lentner, head of NATO-member Denmark´s armed forces, told the news conference.An army base north of Copenhagen has problems with mold and a lack of maintenance. Heating in the offices doesn´t work and sometimes there is no hot water for showers, or very low water pressure, broadcaster TV2 reported. Oliver Hansen, a spokesman for conscripted soldiers, told TV2 that soldiers must be able to withstand difficult conditions in the field but \"not in the barracks.\"Denmark´s Work Environment Agency, which carries out inspections as to whether health and safety rules at workplaces are being observed, has issued several warnings to the armed forces.",
        "The military also has been suffering from lack of soldiers to replace those stationed abroad.Of the 38 billion kroner, 11 billion kroner ($1.6 billion) should be used on new investments, the government said. It gave no details as to what the money should be spent on.Denmark's three-party majority coalition government is made up of the center-left Social Democrats, the center-right Liberal Party and the centrist Moderate party.The coalition is aiming to reach a NATO target of spending 2% of gross domestic product on military budgets by 2030, in part as a response to Russia´s invasion of Ukraine, and the 38 billion kroner will count toward that, public broadcaster DR said."
    ]
}