{
    "articleURL": "/wires/afp/article-12045641/Microsoft-expands-AI-access-public.html",
    "content": [
        "Microsoft on Thursday expanded public access to its generative artificial intelligence programs, despite fears that tech firms are rushing ahead too quickly with potentially dangerous technology.",
        "The AI-enhanced features of the company's Bing search engine and Edge internet browser are now open for anyone to use, Yusuf Mehdi, corporate vice president, said in a blog post.\"This means that it will now be easier than ever for everyone to try the new Bing and Edge by simply signing into Bing with your Microsoft Account,\" Mehdi said.The services have been enhanced with the ability to work with images as well as text, and Microsoft intends to add video to the mix, according to the executive.A Bing \"Image Creator\" was recently integrated into its AI chatbot's repertoire, allowing it to generate visual, as well as written, content, Mehdi said.\"We are expanding Image Creator to all languages in Bing,\" he added.\"So now you can create images in your native language.\"Risks from AI include its potential uses for fraud, with voice clones, deep-fake videos and convincing written messages.A range of experts in March urged a pause in the development of powerful AI systems to allow time to make sure they are safe.Their open letter, signed by more than 1,000 people, including billionaire Elon Musk and Apple cofounder Steve Wozniak, was prompted by generative AI technology from Microsoft-backed firm OpenAI.\"AI systems with human-competitive intelligence can pose profound risks to society and humanity,\" the letter read.",
        "\"Powerful AI systems should be developed only once we are confident that their effects will be positive and their risks will be manageable,\" it said.A prominent computer scientist often dubbed \"the godfather of artificial intelligence\" recently quit his job at Google to speak out about the dangers of the technology.Geoffrey Hinton said at an MIT forum on Wednesday that it makes sense to halt the development of AI. But he added that the idea is naive given the intense competition between countries and companies involved in the sector.Hinton, who created some of the technology underlying AI systems, maintained that the existential threat from AI is \"serious and close.\"In the three months since AI-powered Bing and Edge were unveiled, more than a half a billion chats have taken place, according to Mehdi.Microsoft has so far seen people make more than 200 million images with Bing creator software, Mehdi said.\"We believe innovating and learning in the open is part of a responsible approach,\" he added.\"Our teams continue to work to address issues such as misinformation and disinformation, content blocking, data safety and preventing the promotion of harmful or discriminatory content in line with our AI principles.\""
    ]
}