{
    "articleURL": "/news/article-12040001/Texas-gunman-opened-fire-family-killing-five-people-caught-four-day-manhunt.html",
    "content": [
        "Francisco Oropesa, 38, has been arrested and charged with first-degree murderHe is accused of opening fire on his neighbors after they asked him to stop shooting in his yard because they were trying to get a baby to sleepA four-day long manhunt ensued after the incident The man accused of opening fire on a family in Texas, killing five people, has been arrested following a four-day manhunt. ",
        "Francisco Oropesa, 38, is accused of opening fire on his neighbors after they asked him to stop shooting in his yard because they were trying to get a baby to sleep.The shooting happened on April 28, and sparked a national manhunt. On Tuesday, sources told NBC DFW that Oropesa was apprehended in the city of Cut and Shoot, Texas.Officials said Oropesa was found hiding under the laundry in a closet. Oropesa has been taken to the Montgomery County Jail and is charged with first-degree murder.",
        "Authorities said they responded to a home in Cleveland, a city just north of Houston around 11.30pm and found two women dead at the front of the house, and a man lying dead in the living room.The two women were covered in blood, according to San Jacinto County Sheriff Greg Capers, and were lying on top of two young children who survived. 'In my opinion, they were actually trying to take care of the babies and keep them babies alive,' he said. The victims have since been identified as Sonia Argentina Guzman, 25; Daniel Enrique Laso Guzman, 8; Diana Velazquez Alvarado, 21; Julisa Molina Rivera, 31; and Jose Jonathan Casarez, 18.They were all Honduran nationals shot 'from the neck up,' in their home, Capers said.Capers added there were 10 people in the house, including three children who were not hurt.",
        "Police said they had been called to the home before for reports about the firing of guns. It is not illegal to fire guns in your own yard, but it remains unclear why officers did not ask for a permit - which, as a person in the country illegally, he could not have. Oropesa, a Mexican national, had been deported multiple times, sources told Fox News.His last encounter with immigration authorities was in 2016.He has a large tattoo on the inside of his forearm of what appears to be an Aztec woman wearing a headdress.During a four-day manhunt, the FBI confirmed that more than 250 law enforcement officers participated in the search for the suspected mass murderer, who was an illegal immigrant. The city of Cut and Shoot is about a 30-minute drive from Cleveland where the shooting happened. Authorities said they acted on a tip and found Oporesa hiding underneath a pile of laundry in the closet of a house, according to the Associated Press. 'They can rest easy now, because he is behind bars,' San Jacinto County Greg Capers said of the families of the victims, the outlet reported. 'He will live out his life behind bars for killing those five.'"
    ]
}