{
    "articleURL": "/wires/reuters/article-12049357/Oil-ticks-set-week-losses-demand-concerns.html",
    "content": [
        "By Arathy Somasekhar",
        "HOUSTON, May 5 (Reuters) - Oil prices rose on Friday but fell for the third straight week after a sharp fall earlier this week ahead of benchmark interest rate rises and on concern that the U.S. banking crisis will slow the economy and sap fuel demand.Brent crude closed $2.80, or 3.9% higher, at $75.30 a barrel. U.S. West Texas Intermediate settled up $2.78, or 4.1%, at $71.34 after four days of declines that sent the contract to lows last seen in late 2021.The Brent benchmark finished the week with a decline of about 5.3%, while WTI plunged 7.1%, even after the rebound on Friday. Both benchmarks were down for three weeks in a row for the first time since November.\"Crude is trying to reverse the recent washout in prices triggered by higher interest rates and recession fears mostly in the banking sector,\" said Dennis Kissler, senior vice president of trading at BOK Financial.For some analysts, fundamentals in the physical market are stronger than the futures market would indicate.\"Rather than underlying fundamentals, the selling frenzy over the past week has been driven by worries about demand linked to recession risks and the strain in the U.S. banking sector,\" said PVM oil market analyst Stephen Brennock.\"The upshot is that there is a big disconnect between oil balances and oil prices.\"",
        "Commerzbank analysts noted oil demand concerns were overblown and expect a price correction upward in coming weeks.Equities, which often move in tandem with oil prices, also rose.A better-than-expected jobs report helped ease some fears of an imminent economic downturn, spurred in part by renewed banking fears. Investors also broadly expect the Fed to pause rate hikes at its June policy meeting.In China, however, factory activity contracted unexpectedly in April as orders fell and poor domestic demand dragged on the sprawling manufacturing sector.However, expectations of potential supply cuts at the next meeting of the OPEC+ producer group in June have provided some price support, said Kelvin Wong, a senior market analyst at OANDA in Singapore.U.S. oil rig count, an indicator of future output, fell by 3 to 588 this week, data from oil services firm Baker Hughes showed. (Reporting by Arathy Somasekhar in Houston; Additional reporting by Shadia Nasralla and Andrew Hayley in Beijing; Editing by Jan Harvey, Alexander Smith, David Gregorio, Emelia Sithole-Matarise and Jonathan Oatis)"
    ]
}