{
    "articleURL": "/wires/pa/article-12044357/Pregnant-women-suffer-silence-long-mental-health-issues.html",
    "content": [
        "Many pregnant women “suffer in silence for too long” with mental health issues, experts have warned.",
        "The Royal College of Psychiatrists has urged new and expectant mothers who are struggling with their mental health to reach out and ask for professional help.An estimated one in five pregnant women or new mothers develop mental illnesses such as anxiety, depression, eating disorders, post-traumatic stress disorder and psychosis, it said.The college has also called for more transparency over mental health screening for new and expectant mothers after it found that one in six NHS organisations charged with screening are failing to declare whether they do so. I treat women from a range of backgrounds who develop serious mental illness while pregnant or after giving birth, many of these women suffer in silence for too long  Dr Trudi Seneviratne  Official guidance recommends that all pregnant women are asked about their mental health history, family history of mental illness and risk factors for mental illness during their 10-week check up.But the college said that 20 out of 122 NHS trusts providing this care in England are not reporting whether they are screening every pregnant woman for mental health issues at this stage.",
        "“Every pregnant woman should be screened for mental health issues at their antenatal booking appointment,” said Dr Trudi Seneviratne, consultant perinatal psychiatrist and registrar of the Royal College of Psychiatrists.",
        "“More than eight years after routine screening was first recommended, we still don’t know if NHS trusts are following the guidelines, and there is strong anecdotal evidence to suggest many women are missing out.“Suicide and substance abuse are leading causes of maternal death in the first year following birth so it’s vital that women experiencing mental illness receive timely specialist support.“We’re calling on NHS England to urgently publish data showing if NHS trusts are screening pregnant women for mental health issues.“In my clinic, I treat women from a range of backgrounds who develop serious mental illness while pregnant or after giving birth, many of these women suffer in silence for too long.“They are often embarrassed to ask for help, fearing people will view them as weak or unfit to be a mother.“Some didn’t realise they were very unwell while others didn’t know how to get help. If you experience mental health issues during or following pregnancy, please don’t be embarrassed to ask for help.“Speak to your GP or your midwife who can offer advice and, if appropriate, refer you to specialist mental health teams.”An NHS spokesperson said: “Record numbers of women in England are benefitting from specialist perinatal mental health support with an estimated 51,000 new mums treated over the last year – up nearly 60% compared to two years ago – with every local health system now having access to a specialist community perinatal mental health team so any woman worried about her mental health should speak with her GP or midwife as support and treatment is available.",
        "“We are working with the small number of trusts that are not fully publishing data on the mental health screening of pregnant woman to ensure that this changes.”"
    ]
}