{
    "articleURL": "/sport/football/article-12054119/Wigan-fail-pay-salaries-FIFTH-time-season.html",
    "content": [
        "Wigan Athletic have failed to pay player and staff wages for a fifth time this termThe club have updated their supporters over growing concerns in a statementSome of the club's staff were paid on Friday while others are being made to wait Wigan Athletic have updated supporters on current issues surrounding unpaid wages at the club.",
        "Players have been given a day off from training ahead of their final Championship game of the season against Rotherham on Monday after some staff were paid on Friday while others weren't.The financially-struggling outfit have failed to pay wages on four separate occasions this season and were punished a three-point deduction by the EFL for breaching an agreement made in January, when the club accepted a suspended penalty.Renewed problems over wage payments have cropped up again with Wigan choosing to address concerns via their official website where they state there has been 'some delays'.Staff and players who are owed wages have been instructed that they will be paid at the 'earliest opportunity' after the ongoing bank holiday weekend concludes.",
        "Wigan's statement in full read: 'There has been some delay with wages which were due to be paid yesterday (Friday 5 May).'Staff wages were paid on Friday with the Chairman, Mr Talal Al Hammad, making a decision to pay as many employees as possible within the organisation with the resources available. 'All remaining playing and non-playing staff will be paid at the earliest opportunity following the Bank Holiday weekend.'The ownership group, Phoenix 2021 Limited, insist they are working hard to ensure that this is rectified as soon as possible and apologise again for the stress this has caused.",
        "'All first team players have been given the day off from training today given the difficult circumstances.'The Club will make no further comment until it has further clarification.'Fresh issues will concern Latics supporters who are already worried about their club's future after their relegation to League One was confirmed last month.Wigan chairman Talal Al Hammad previously stressed in March that the delayed receipt of wages 'simply cannot happen again'."
    ]
}