{
    "articleURL": "/tvshowbiz/article-12059445/Sharon-Osbourne-looks-stylish-brown-blazer-jeans-steps-London.html",
    "content": [
        "Sharon Osbourne looked stylish as she stepped out with her daughter Aimee in London on Sunday after celebrating King Charles' Coronation.",
        "The TalkTV host, 70, who presented a watch along for the historic event on the channel, donned a brown blazer and blue jeans, strolling back to their hotel.Sharon, who camped out on the Mall with royal fans for the broadcaster's coverage, added a blue shirt to her ensemble.  The presenter, who was reportedly up until 6am enjoying the festivities, wore a pair of black sunglasses. She sported brown boots and toted her essentials in a large black bag, linking arms with her eldest daughter.",
        "While her siblings Jack and Kelly have enjoyed successful media careers, singer Aimee has purposefully remained out of the reality TV spotlight that was cast upon the family during fly-on-the-wall show The Osbournes in the early noughties.She has instead focused on a career in acting music, with her debut album Vacare Adamaré - translated from Latin as To Be Free and Loved - released in 2020.It comes after Sharon spoke out about the dangers of using controversial weight loss jabs after using them herself. The plastic surgery fan has said that while she lost over two stone in weight over a four month period, she felt nauseous every day and insisted it's not a 'quick fix'.During a discussion on the controversial injections on The Talk, Sharon shared her first-hand experience of the drugs, after it was announced on Thursday that WeGovy's launch in the UK had been put on pause.",
        "Fellow panellist Daisy McAndrew explained that weight loss isn't as easy as increasing exercise and changing your diet, saying, 'It doesn't work like that for a lot of people's metabolism.'Sharon replied: 'It doesn't. It is a mental problem. It really is, apart from, you know, when children grow up in a household where they live off chips and pies. 'But I took it. I took it for four months and I lost 30 pounds, but like everything, there's always no quick recipe.'I was very sick for a couple of months. The first couple of months, I just felt nauseous. Every day I felt nauseous, my stomach was upset, whatever. 'But listen, I took it for four months, I lost 30lbs. I've just shoved two chips in my mouth, while we had the break, and I eat normally now, and I haven't put on a pound. Nothing.'"
    ]
}