{
    "articleURL": "/wires/ap/article-12040125/Ramirez-Rays-beat-Pirates-4-1-matchup-two-teams.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Harold Ramírez homered and drove in two runs to lead the Tampa Bay Rays over the Pittsburgh Pirates 4-1 on Tuesday night in a matchup of teams with the top two records in the major leagues.",
        "Ramírez drove in the game's first run with an RBI single in the fourth and boosted the lead to 4-1 with a solo homer in the sixth against Roansy Contreras (3-2). The Rays, who drew just 10,325 to Tropicana Field, lead the big leagues with 62 home runs and have outscored opponents 199-93.\"Don't matter who we play, we just have to play good baseball,\" Ramírez said. \"We're just here to win.\"Tampa Bay is the 15th team since 1901 to win at least 24 of its first 30 games and the first since the 2016 World Series champion Chicago Cubs started 24-6.Pittsburgh (20-10), in first place at the end of April for the first time since 1992, lost back-to-back games for the first time since the last two games of opening series at Cincinnati. The Pirates lost for the third time in the last 13 games.Pittsburgh went 0 for 10 with runners in scoring position, while Tampa Bay was 2 of 11 chances.",
        "\"There´s not a lot of room for error,\" Pirates manager Derek Shelton said. \"I think we left 11 runners on base. We didn´t execute with runners in scoring position, and you just can´t do that.\"Tampa Bay left-hander Josh Fleming left in the fifth after taking Ke´Bryan Hayes' hard-hit single off his left foot. The Rays said initial images didn't show a fracture.",
        "\"Fingers crossed he's OK, Rays manager Kevin Cash said.Seven Rays combined on a five-hitter, Tampa's 13th game allowing five hits or fewer.Colin Poche (3-0) replaced Fleming in the fifth and gave up a double to Bryan Reynolds and Carlos Santana's tying sacrifice fly. Hayes called safe on a close play at the plate that stood after a video review.Jason Adam worked the ninth for his first save this season.Manuel Margot opened a two-run fifth that with Contreras' fourth walk and took second when Jose Siri's popup dropped in shallow center.Wander Franco, who had hit into double plays in his first two at-bats, hit a go-ahead single and Siri stole home for a 3-1 lead as part of a double steal with Franco.Contreras allowed four runs and six hits in 5 1/3 innings.Pittsburgh had runners on the corners in the sixth when the Pirates felt Ryan Thompson balked, but there was no call.\"The umpires told me they missed it.\" Shelton said. \"That didn´t change the outcome in the game. The fact we didn´t get runners in was what changed the outcome of the game.\"Thompson worked out of the jam with a pair of strikeouts.FLASHING LEATHERFleming made a nifty play to end the second, reaching behind his back to field Mark Mathias' comebacker and throw him out at first. ... Tampa Bay 3B Isaac Paredes dove to his right to grab Austin Hedges' two-out liner in the fourth with runners on the corners. ... 3B Hayes made a nifty spin move throw on Christian Bethancourt's inning-ending fourth-inning grounder with a man on third.",
        "WELCOME VISITORInjured Pirates 1B Ji-Man Choi (Achilles tendon) walked into his old Tampa Bay clubhouse and said `\"Hi guys, where´s my locker?\"Rays infielder Brandon Lowe responded \"out\" before giving him a hug.\"I'm glad he didn't find me,\" Cash said with a laugh. \"He's a pretty exciting character.\"The popular Choi, who was with the Rays from 2018-22, received a partlal standing ovation following a video tribute.TRAINER'S ROOMTampa Bay closer Pete Fairbanks, who has experienced finger numbness in cold weather associated with Raynaud´s syndrome, had his medication adjusted. He left Friday's game at the Chicago White Sox with the issue.UP NEXTPirates RHP Mitch Keller (3-0) and Tampa Bay LHP Shane McClanahan (5-0) are Tuesday night's starters.___ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}