{
    "articleURL": "/wires/ap/article-12052285/Florida-lawmakers-OK-budget-end-session-quietly-home.html",
    "content": [
        "TALLAHASSEE, Fla. (AP) - After 60 tumultuous days fighting about abortion, immigration, LGBTQ+ issues, guns and teaching sexuality in schools, the Florida Legislature ended its annual session by unanimously passing a $117 billion state budget Friday.",
        "The ending was a stark contrast to the the two months leading up to it, with cheers instead of jeers and unity instead of divisiveness.\"I´ve been getting texts all day from people who´ve been in the process for years. One said in 50 years, he has never seen such a seamless session,\" Republican President Kathleen Passidomo said while standing with Republican Gov. Ron DeSantis and Republican House Speaker Paul Renner.Most years, the last day of session drags on well past sunset as the final trading on important legislation goes back and forth. This year, DeSantis told lawmakers not to save the biggest items for the last week.Other than the budget, which was passed before noon Friday, that was largely accomplished. Seamless, of course, is in the eye of the winner. A Republican supermajority in both chambers left Democrats powerless to stop many of the issues on DeSantis´ agenda.And DeSantis, who has controlled the Legislature like no other governor in recent history, made it clear from the start that he didn't want the session to become a \"train wreck\" in the final week.",
        "\"If you take just two or three of these items, that would usually be enough to say that you´ve had a banner session,\" DeSantis said. \"This Legislature said that we´re going to tackle all these issues and we´re going to take all the meat off the bone and we are going to deliver results.\"",
        "Many of the results will feed into DeSantis' political future as he considers seeking the Republican nomination for president: a six-week ban on abortion, efforts to shield students from lessons on LGBTQ+ issues, further crackdowns on immigrants in the country illegally, a prohibition on gender-affirming care for minors, allowing gun owners to carry concealed weapons and other conservative issues.Renner and Passidomo also highlighted other priorities - like efforts to increase available affordable housing, expanding school voucher programs, and expanded sales tax holidays for back to school supplies, hurricane supplies and outdoor recreation.For Democrats, though, there wasn't as much to celebrate in a year when the Senate Democratic leader was arrested for protesting abortion bills, citizens opposing DeSantis' agenda were arrested for refusing to leave while singing in his office lobby and LGBTQ+ lawmakers felt their very existence was being attacked.Democratic Sen. Shevrin Jones said that DeSantis micromanaged the session and steered GOP leaders to a political agenda instead of focusing more on issues like property insurance, health care and gun violence.\"The thing that struck me the most this session is the concept of the free state of Florida. There was nothing free about this legislative session when you are infringing on the rights of women, when you continue to attack the marginalized people, whether they're Black, immigrant or LGBTQ,\" Jones said. \"The governor led with a very firm, strong hand. He continues to show it's `my way or no way at all.´\"",
        "With the session over, the big question facing DeSantis is what's next in his future. He's widely expected to jump into the presidential race soon.\"What´s next for me is to go through this budget they passed,\" DeSantis said. \"What happens in the future, we´ll get to that relatively soon. You have to put up or shut up.\""
    ]
}