{
    "articleURL": "/news/article-12057311/Out-control-AI-risk-society-fuel-explosion-disinformation.html",
    "content": [
        "Cyber expert Ciaran Martin said AI could undermine the 'fabric of our society'It comes after AI pioneer Geoffrey Hinton quit Google to warn about dangersRapid advances in artificial intelligence risk 'undermining the fabric of our society', Britain's former cyber security chief warned yesterday.",
        "Ciaran Martin said that AI could fuel an explosion in disinformation, with potentially damaging consequences for democracy.Mr Martin, former head of the National Cyber Security Centre, said ministers had little influence over the development of the technology, but suggested they should be doing more to impose safeguards.'AI is now making it much easier to fake things,' he said. 'So having a sense of what is true and reliable, it's going to become much more difficult. And that's something that risks undermining the fabric of our society.'Mr Martin said the Government was 'struggling to keep up' with AI, adding: 'It's hard for serving ministers to say this, but so much of the development is happening in the American private sector that there aren't always the sort of levers that you can pull.'",
        "He told Times Radio: 'The big question that we haven't been able to answer yet, and that's because it's a really hard question, is how do you get technological markets to work in a way that validates information credibly, and in a sort of economically efficient way.'So is the Government doing enough? And you can make a case that it isn't, but it's partly because it's a really, really difficult challenge.'Mr Martin is the latest senior figure to raise questions about the risks posed by AI, which some critics fear could destroy the human race. ",
        "Last week, AI pioneer Geoffrey Hinton quit Google to speak out about the potential dangers of allowing the rapidly emerging technology to go unchecked.In an interview at the weekend he warned that AI could pose a 'more urgent' threat to humanity than climate change.He said: 'With climate change, it's very easy to recommend what you should do – you just stop burning carbon... For this it's not at all clear what you should do.'Last month, GCHQ boss Sir Jeremy Fleming warned the Cabinet that AI created a number of 'potential applications and risks' for Britain, including the threat of sophisticated disinformation campaigns designed to undermine democracy.Billionaire tech tycoon Elon Musk has called for a six-month 'pause' in the development of the technology to allow society to consider the potential risks.But Government sources dismissed the call, saying that a pause is 'not the right way' to tackle concerns.Culture Secretary Lucy Frazer appeared to play down the potential threat yesterday, describing AI as 'both an opportunity and a challenge'."
    ]
}