{
    "articleURL": "/news/article-12058293/Drone-video-shows-huge-line-hundreds-migrants-illegally-crossed-border-Brownsville-Texas.html",
    "content": [
        "A large group of migrants who had illegally crossed the border from Mexico into Brownsville, Texas was captured on camera waiting in lineDrone footage revealed the extensive line stretching into the distance with the majority of migrants appearing to be single adultsThere has been a recent increase in Venezuelan migrants entering South Texas, especially in the vicinity of BrownsvilleA huge line of consisting of hundreds of migrants who crossed into the U.S. illegally from Mexico into Brownsville, Texas was caught on camera on Sunday evening. ",
        "The line could best be seen from the air as footage from Fox News' drone tea, attempted to capture the enormity of the as it snaked off into the distance.The great majority of the migrants looked to be single adults. Many of those waiting in line did not appear to have baggage of any kind with most simply holding a plastic bag containing important documents. Although it is not clear exactly where the migrants had arrived from, over the last two weeks there has been a surge of Venezuelan migrants through South Texas, particularly in and around Brownsville. The reasons for the surge are unclear. On Friday U.S. Homeland Security Secretary Alejandro Mayorkas noted that Mexico has agreed week to continue taking back Venezuelans who enter the U.S. illegally even after asylum restrictions end Thursday, along with Cubans, Haitians and Nicaraguans. ",
        "Migrants have been expelled from the U.S. more than 2.8 million times since March 2020 under what is known as Title 42 authority.Title 42, the COVID-19 pandemic-era policy that helped law enforcement quickly remove illegal migrants at the border, is set to expire on May 11.The Biden administration will send an extra 1,500 troops to the southern frontier to join the 2,500 already battling to stem the flow of people crossing over. ",
        "The secretary reaffirmed plans to finalize a new policy by this Thursday that will make it extremely difficult for migrants to seek asylum if they pass through another country, like Mexico, on their way to the U.S. border.'The situation at the border is a very serious one, a very challenging one and a very difficult one,' Mayorkas said.Illegal crossings tumbled after President Joe Biden announced asylum restrictions in January, but they have risen since mid-April. ",
        "Brandon Judd, president of the National Border Patrol Council, said this week they have been hovering around 7,200 daily, up from about 5,200 in March.Border Patrol Chief Raul Ortiz said 1,500 active-duty troops will be dispatched to El Paso, Texas, adding to 2,500 National Guard troops already positioned across the border. Ortiz said El Paso was chosen because it has been a busy corridor for illegal crossings over the last six months. The troop deployment was announced this week but not the location.Mayorkas said smugglers were deceiving migrants and luring them on a dangerous journey. 'The border is not open, it has not been open, and it will not be open subsequent to May 11,' he said.Mexican Foreign Affairs Secretary Marcelo Ebrard echoed Mayorkas' sentiment about smugglers spreading misinformation.'We're seeing a very significant flow (of migrants) in recent days on the basis of a hoax,' Ebrard said at a news conference on Friday. He said smugglers are saying, '\"Hurry up to get to the United States by crossing Mexico because on May 11 they´re going to end Title 42.\"'",
        "'It's a trick and they're at risk,' Ebrard said.",
        "Mexican President Andrés Manuel López Obrador urged those who want to migrate to follow legal pathways, such as applying in U.S. processing centers scheduled to open in Guatemala and Colombia. He said Mexico was not making special preparations for the end of Title 42 because he didn't expect a surge.'A lot of people won´t let themselves be tricked,' the president said.Mayorkas touted new legal pathways which include parole for up to 30,000 Cubans, Haitians, Nicaraguans and Venezuelans a month who apply online with a financial sponsor. But he said the Biden administration could only do so much without Congress.'We have a plan, we are executing on that plan,' Mayorkas said. 'Fundamentally, however, we are working within a broken immigration system that for decades has been in dire need of reform.'",
        "Texas rancher Stephanie Canales called the Biden administration's treatment of the situation 'a joke.''You want to laugh, it's a joke. And those of us that live down here every day that are dealing with this, it has not improved at all,' Canales told Fox Business. 'It just continues to get worse. And I don't care what lies they spew to the American people. They are lies because it's only gotten worse every day.' ",
        "Her comments came after White House spokeswoman Karine Jean-Pierre said the Biden administration has made efforts to address the 'broken' immigration system. Canales says she constantly has to battle against migrants crossing through her ranch every day. 'When they drive through our property, that's fence damage. So we're constantly repairing fences, we're constantly replacing gates that they will blow through on their vehicles when they're being chased by law enforcement,' Canales said.She noted inflation under President Biden has only exacerbated her family's troubles. 'We've also had to install cameras throughout our property... but the cameras allow us to see who's on our property at any given time, so then we can alert the patrol. But it's come at a huge cost to us and it's very, very frustrating. And no, we don't feel safe at all.' Canales said sending troops to the border was a good decision but one that may have come too late.'God bless our troops, I'm sure they will be a big help to the Border Patrol and to our state troopers that are down here. But, where were they a long time ago? They need to shut the border because people are just coming over here. It's nonstop.' ",
        "More than 2.3 million migrants tried to illegally sneak into the United States across the Mexican border last year, according to U.S. Customs and Border Protection.",
        "That is up from 1.7 million people in 2021 and just over 450,000 the previous year when much of the world was locked down during the coronavirus pandemic.Emergency powers to remove migrants, known as Title 42, come from a 79-year-old federal law that Trump used from the start of the coronavirus pandemic.Republicans are also angry that Joe Biden axed his predecessor's flagship anti-immigration policy: a $16.6-billion border barrier along the frontier with Mexico. Some border towns, including El Paso in Texas, have already declared a state of emergency.The administration stated it will use different legal tools to try and stem the amount of people trying to cross.Those powers, known as Title 8, will mean undocumented migrants detained inside the United States will be punished in such a way that will render them ineligible to come to the country legally.Title 42 is ending on Thursday – so what will the border look like in a post-pandemic world?  Internal estimates warn there are at least 10,000 migrants waiting to cross the second the measure expiresBy Katelyn Caralle, US Politics ReporterTitle 42 is finally coming to an end on Thursday, May 11 and there are at least 10,000 migrants waiting in Mexico to immediately cross the U.S. southern border once the policy is no longer in use.",
        "The public health measure was employed in March 2020 by then-President Donald Trump as a way to quell migration over the southern border at the onset of the COVID-19 pandemic.While many saw it as a way to keep COVID-19 from spreading by way of illegal immigration and a way to address the spikes of migrant crossings, immigrant advocates felt it was inhumane for those seeking asylum in the U.S.So what is Title 42, when was it enacted and what are authorities and the southern border bracing for when it does end next week?Keep reading as DailyMail.com breaks it all down.",
        "History of Title 42Title 42 was first enacted nearly eight decades ago as part of the Public Health Service Act of 1944.The policy allows for border and immigration authorities to prohibit the entry of those who potentially pose a health risk or recently visited a country where a communicable disease was present.Specifically, the law is related to stopping those who unlawfully entered the country and therefore were able to bypass any health-screening measures that might be in place.During the coronavirus pandemic, Title 42 was used to immediately deport migrants without processing their asylum claims due to the declared public health emergency.Enacting and attempting to end Title 42Trump put Title 42 to use in March 2020 when the coronavirus pandemic hit the U.S.Not only was the then-president using it as a way to stop migrants from bringing and spreading the virus in the country, but it also helped advance his tough-on-immigration stance.President Joe Biden has tried to end Title 42 on more than one occasion, first attempting to do so in May 2022.Republicans and illegal immigration hawks, however, argued that as long as a health emergency was declared in the U.S., the policy should also remain. They have also argued since then that the program needs to persist because there is nothing to replace it and illegal immigration will massively spike once it ends.In March 2022, the Centers for Disease Control and Prevention (CDC) decided the pandemic's intensity reduced enough for Title 42 expulsions to be ended.May 23, 2022 was the first date the Biden administration set to terminate the policy's use.But just before the expiration date was reached, Louisiana Federal District Judge Robert Summerhays blocked the administration from lifting Title 42 and expulsions continued through the original deadline.",
        "Later in December 2022, Biden tried to once again end Title 42 close to the Christmas holiday as reports and images emerged of migrants freezing on the streets of El Paso, Texas.The second attempt to end the policy came in November when Federal District Judge Emmet Sullivan ruled it as unlawful and created a December 21 end date.The Supreme Court stepped in, however, to pause that ruling on December 19.The policy remained in place while legal proceedings played out.May 11, 2022 serves as the final end date for Title 42 – coming in conjunction to the end of a three-year public health emergency.The declaration of the health emergency gave the president certain authorities that are only able to be used during times of emergency in the U.S., including increased executive privilege.",
        "Effects of Title 42 and its imminent endSince Title 42 was enacted in March 2020, migrants have been expelled in more than 2.5 million instances. It's unclear what rate there are repeated expulsions under the policy.When taking all Title 42 expulsions into account since March 2020, at least 81 percent took place since Biden's inauguration after he twice-failed to end the policy.With the latest deadline of May 11, the Biden administration also announced last week the deployment of 1,500 active-duty soldiers to the U.S.-Mexico border where they will remain for 90 days as border communities brace for massive spikes in crossings.There are fears that the number of migrants that could cross in the days after Title 42's expiration could span between 700,000 and 1 million.Homeland Security Secretary Alejandro Mayorkas said Sunday morning that it will be a 'tough challenge' to address migration at the southern border with Title 42 ended and said there will be 'unprecedented' immigration throughout the entire hemisphere after Thursday.'There is already reports of Brownsville, Texas right now. Shelters are overwhelmed. The cities of Chicago and New York are already overwhelmed. What's May 12 going to look like if we're already overwhelmed before the expiration of Title 42?' NBC News Meet the Press host Chuck Todd posed.'First of all, this is a really tough challenge and has been, as we all recognize, for years and years. We are seeing a level of migration not just at our southern border, but throughout the hemisphere, that is unprecedented,' Mayorkas replied.'It is, I think, the greatest migration in our hemisphere since World War II,' he added.'Our approach is to build lawful pathways, cut out the ruthless smugglers, deliver lawful pathways so people can access humanitarian relief without having to take the dangerous journey from their home countries. And at the same time, if they arrive at our southern border in between ports of entry, we will deliver consequences.'Mayorkas has assured Congress that the southern border is closed and has refused to call the immense number of illegal crossings a 'crisis.'Republicans have called for Mayorkas' resignation or impeachment, claiming he has lied to Congress and the American people and has engaged in a dereliction of duty.As Title 42 comes to an end, a resident of Brownsville, Texas said she questions if Mayorkas and Biden 'even care' about the people in these border communities.Asked what her message would be for Mayorkas, the resident told Fox News on Sunday: 'I would ask him if he even cares about us, because I have to take my son to school… and it's cruel to not have a plan in place for all of the people you're supposed to represent.''He keeps talking about 'humanity' and 'being compassionate' and 'cutting out the cartel' — and it's just lip service,' she added."
    ]
}