{
    "articleURL": "/wires/ap/article-12058539/After-years-turmoil-Milan-teams-European-elite.html",
    "content": [
        "MILAN (AP) - First came a return to the top of Italian soccer, now comes a chance to reach the Champions League final.",
        "The Milan teams are back.But only one will get the opportunity to compete for European soccer´s top prize as AC Milan faces city rival Inter Milan in the semifinals of the Champions League.The victor will face either Real Madrid or Manchester City in the final.Three-time European champion Inter was the last Italian club to lift the trophy, when it won an unprecedented treble of the league, Italian Cup and Champions League under José Mourinho in 2010.Milan won the last of its seven titles in 2007.",
        "\"To be part of a club like this is a dream,\" Milan defender Fikayo Tomori said in an interview with The Associated Press. \"To go and play in the San Siro, seeing it on the Champions League nights ... it´s such an iconic stadium, such an iconic sort of club.\"The fact that two Italian teams are in the semifinals ... it´s obviously good for the league, good for Italian football. We´re obviously focusing on us. We want to be the best.\"Milan hosts Inter on Wednesday before the return leg the following Tuesday. Both games will be at the San Siro as the teams share the stadium.\"We got two really exciting games coming up,\" Tomori said. \"Two games that we can really show ourselves, prove ourselves and you know, we can hopefully add to the history of this club.\"",
        "Since the Milan teams´ last triumphs in Europe there have been slumps on the field and turmoil off it, with both clubs changing ownership several times and coaches even more frequently.However, after years of mediocrity, Inter and Milan ended lengthy waits for a Serie A title before finally making it back to the top level of European soccer.COACHING CHANGESInter has had 14 different coaches since Mourinho left the Nerazzurri after winning the Champions League - an average of more than one a year.Rafael Benítez replaced Mourinho but he lasted a matter of months before being fired. The rest of the list includes Claudio Ranieri, Roberto Mancini and Antonio Conte.Current Real Madrid coach Carlo Ancelotti steered Milan to the Champion League trophy in 2007 - and also in 2003 - but he quit just two years later.Since then there have been 10 different coaches in the Rossoneri hot seat. The incumbent Stefano Pioli was also in charge of Inter in the 2016-17 season.Inter is now coached by Simone Inzaghi, who has emerged as somewhat of a cup specialist. He steered both previous club Lazio and Inter to the Italian Cup trophy and the Nerazzurri are back in the final of this year´s competition.Inzaghi also led Inter to back-to-back Italian Super Cup titles to match the two he won with Lazio.",
        "CHANGING OWNERSChinese retail giant Suning and U.S.-based hedge firm Elliott Management turned things around for the Milan clubs, which were under the stewardship of long-term Italian owners the last time they were at the top of European soccer.Suning took over Inter in 2016, ending a three-year reign by a consortium led by Indonesian businessman Erick Thohir. Massimo Moratti had been in charge since 1995 before selling a majority share of the club to Thohir. Five years after Suning took over, Inter won its first Serie A title in more than a decade. That was Inter´s first trophy since 2011 and the first league title since 2010.Milan was also briefly owned by a Chinese group, which purchased the club from Silvio Berlusconi in 2017, ending an era of more than 30 years. However, the consortium failed to repay part of a loan and Milan was taken over by Elliott the following year. Elliott helped the club rectify its financial issues and after finishing second to Inter in 2021, Milan ended its own 11-year wait for the Serie A title last season. Shortly afterward, the club was sold to another American investment firm, RedBird Capital Partners.SANCTIONSInter and Milan were among the clubs that had to pay fines at the start of the season for breaching financial fair play rules.",
        "Inter had also paid a fine in 2015, while Milan had endured even sterner punishment after overspending under its Chinese owners.When Elliott took over, Milan was already embroiled in a case with UEFA over financial fair play breaches that later saw it voluntarily withdraw from the 2019-2020 Europa League to avoid penalties.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}