{
    "articleURL": "/tvshowbiz/article-12056827/Mariska-Hargitay-Christopher-Meloni-suit-International-Firefighters-Day-Denis-Leary.html",
    "content": [
        "Mariska Hargitay and Christopher Meloni teamed up for a special reason Saturday.",
        "Mariska, 59, who gave a Law &amp; Order: SVU fan the thrill of a lifetime when they bumped into each other on the same flight, and Christopher, 62, did their part to honor some real life heroes on International Firefighters Day in New York. The two, who have been partners in solving crimes on TV for more than 20 years both share photos of their training with the Leary Firefighter Foundation founded by their friend and former Law &amp; Order: Organized Crime co-star Denis Leary, 65.'Had the most epic day with @learyfirefighters. Thank you @denisleary for inviting me to join! It was an honor, the actress wrote.Mariska also shared a video as she climbed out a window and rappelled down a what looked like a two to three story wooden structure in full gear.",
        "'Wait for it' she posted next to the clip.A photographer captured the last bit, as she approached the platform where a firefighter was standing by.   'You are a warrior and I love you!' wrote actress Ali Wentworth after seeing Mariska's posts. Kathy Najimi posted, 'You are incredible my friend,' and Debra Messing followed with 'Amazing.'Many fans were amazed the Emmy winner was back in action so soon after getting a clean bill of health from her doctor. ",
        "Mariska was off her feet for a while after fracturing her ankle in three places.  The SVU alums weren't the only celebrities taking part in the special training which took place at the New York Fire Department's 'The Rock' academy.'So…this happened' Christopher wrote, sharing photos of himself and Mariska along with snaps of actors Steve Buscemi, Billy Crudup, Robert Burke, Adam Ferrara and MSNBC anchor Brian Williams who turned up as well.",
        "It was a personal tragedy that resulted in Denis founding The Leary Firefighters Foundation in 2000.The Rescue Me star lost his cousin and a childhood friend to a fire that claimed their lives and the lives of four other firefighters in Worcester, Massachusetts.The organization has donated some $2.7 million since 2014 in the form of grants to fill gaps in funding and training for fire departments across the globe. The LFF has teamed with the NYFD to create training videos.Those videos have provided virtual training for more than one million firefighters in the US to help them develop their skills. "
    ]
}