{
    "articleURL": "/wires/reuters/article-12053761/Red-Sox-eye-eighth-straight-win-Phils-aim-halt-skid.html",
    "content": [
        "Two teams trending in opposite directions meet again on Saturday when the Boston Red Sox face the host Philadelphia Phillies in the second game of a three-game series.",
        "The Red Sox, who came to Philadelphia fresh off a four-game sweep of the visiting Toronto Blue Jays, extended their winning streak to seven games with a 5-3 victory over the Phillies on Friday.Philadelphia took its fifth consecutive loss.A large part of Boston's recent success is due to left fielder Masataka Yoshida, as the 29-year-old rookie from Japan is hitting .476 (10-for-21) in May and riding a 15-game hit streak. He helped the Red Sox complete the sweep of Toronto in an 11-5 win Thursday, going 3-for-5 with three RBIs and a 400-foot homer to the triangle at Fenway Park in his first at-bat.Designated hitter Justin Turner enjoyed a big series vs. the Blue Jays, too, going 8-for-18 (.444). He and Yoshida are new additions who have helped propel Boston to its surprisingly successful start.The Red Sox also are proving successful on the basepaths, having stolen 21 bases in 22 attempts.\"I like this offense,\" Boston manager Alex Cora said. \"I like where we are right now. ... Just running, you know, and putting pressure on the opposition. ... They're going to make it work, and that was the goal and so far so good.\"Corey Kluber (1-4, 6.44 ERA) will be get the ball for the Red Sox on Saturday. He had a decent start his last time out, allowing three runs over 5 1/3 innings and fanning seven in Boston's 6-5 over Toronto on Monday.",
        "In two career starts vs. the Phillies, Kluber is 1-0 with a 3.46 ERA. However, he has not opposed them since 2016. Among Philadelphia hitters, Josh Harrison is 4-for-10 (.400) vs. Kluber with a homer, while Nick Castellanos is 13-for-48 (.271) with 18 strikeouts and one walk.Philadelphia is in the opposite form as the Red Sox. The Phillies were swept in three games by the host Los Angeles Dodgers to open the week.Bailey Falter (0-5, 5.01 ERA) will get the nod for the Phillies on Saturday, looking to end a personal skid that has seen him lose each of his past four starts.The left-hander was roughed up in his latest outing, when he allowed four runs on eight hits in just 4 1/3 innings against the Houston Astros on Sunday. He pitched better in his previous start, when he struck out seven and gave up four runs (three earned) over six innings against the Seattle Mariners on April 25.Falter got a win the only previous time he faced the Red Sox, when he threw two scoreless innings in relief on July 10, 2021.Bryce Harper arrived as a reinforcement during the Phillies' slump, making his season debut on Tuesday in Los Angeles after recovering from offseason elbow surgery. The two-time National League MVP is batting .364 (4-for-11) through his first three games back.",
        "Philadelphia could use a resurgence from left fielder Kyle Schwarber, who went 0-for-5 with three strikeouts on Friday and committed a first-inning error that led to a run. Schwarber is 0-for-14 with six strikeouts in the past three games.\"I'm going to keep working,\" Schwarber said. \"I've just got to keep working in the (batting) cage. I feel like the cage is kind of the biggest thing and it's going to set the table, if you just go out there and compete.\"--Field Level Media"
    ]
}