{
    "articleURL": "/wires/reuters/article-12059221/Moldovan-farmers-fear-grain-storage-shortage-Ukrainian-imports.html",
    "content": [
        "CHISINAU, May 8 (Reuters) - Moldova will face a shortage of storage capacity for its 2023 grain harvest if it doesn't ban imports of Ukrainian grain and oilseeds, the Moldovan farmers' union said on Monday.",
        "Moldova said late last week that it might ban imports of Ukrainian grains as local farmers were facing losses due to a drop in global prices.\"If Moldova does not restrict grain imports from Ukraine with its stocks of 10 million tonnes, it will be deposited in Moldovan silos and we will face a problem when we do not have storage for the new harvest,\" said Alexandru Slusari, head of the Farmers' Power association.He said official data showed that 300,000 tonnes of Moldovan-origin grain from the 2022 harvest was still in silos, while a new harvest would arrive in about one and half month.Moldova harvested 720,000 tonnes of grain in 2022.Last week the European Union set restrictions until June 5 on imports of Ukrainian wheat, maize, rapeseed and sunflower seed to Bulgaria, Hungary, Poland, Romania and Slovakia after those countries cited concerns that Ukrainian grain meant for export to other countries has ended up in their local markets.The five countries became transit routes for Ukrainian grain that could not be exported through the country's Black Sea ports because of the war in Ukraine.Ukraine has protested to key allies the European Union and Poland over restrictions on its grain supplies.Ukrainian farm minister Mykola Solsky visited Moldova this weekend and \"expressed his disagreement\" with Moldova's plans to restrict imports from Ukraine, saying that the grounds for such a decision were unclear, the farm ministry said in a statement.",
        "Ukraine also said it could limit imports of Moldovan food if Moldova restricts Ukrainian supplies, RBK-Ukraine news agency quoted deputy economy minister Taras Kachka as saying.Ukraine's total exports to Moldova in 2021 were seven times the size of Moldova's exports to Ukraine. Moldova mainly exported alcohol, fruits and nuts. (Reporting by Alexander Tanas, writing by Pavel Polityuk, editing by Susan Fenton)"
    ]
}