{
    "articleURL": "/news/royals/article-12039587/Queen-Elizabeths-godson-Earl-Carnarvon-not-invited-Westminster-Abbey-Coronation.html",
    "content": [
        "So entwined has his life been with that of the Royal Family that his earliest memory is of being brought in to see Queen Elizabeth when she visited his parents’ house in the late 1950s. She had, by then, already cradled him in her arms – not least at his christening, at which she became his godmother.",
        "Yet I can reveal that, despite this intimate bond – so intimate that he attended the Committal Service at Windsor, when Her Majesty was laid to rest in St George’s Chapel – the Earl of Carnarvon will not be at Westminster Abbey on Saturday.Instead, ‘Geordie’, as the Queen always called him, and his wife, Fiona, will watch proceedings from afar, most probably at Highclere Castle, the spellbinding family seat which achieved global renown after the hit ITV drama Downton Abbey was filmed there.‘We will be watching it,’ the Countess declares of the service. ‘We are not there – new king, new way of doings things,’ she explains, adding that such innovations are ‘the right thing to do’.That diplomatic flourish cannot disguise the fact that the couple’s absence from the Coronation represents an even more startling divergence from the old order than the exclusion of most of the dukes and lesser members of the aristocracy.",
        "This is not so much because generations of Carnarvons have attended innumerable previous coronations nor even because, aged 13, Geordie was the Queen’s Page of Honour, holding her train at the State Opening of Parliament in 1970. It is, instead, because of the longstanding and profound personal friendship between the two families as embodied in the bond between Geordie’s father, ‘Porchey’ Carnarvon, the 7th Earl, who died in 2001, and the Queen.",
        "His sudden death aged 77 was a shattering blow to the monarch. It came on the same day as the September 11 terrorist attack on New York’s World Trade Centre and many saw a personal touch in the emotional message she sent to be read at a service of remembrance.‘Nothing that can be said can begin to take away the anguish and the pain of these moments,’ she wrote. ‘Grief is the price we pay for love.’As a young officer in the Blues, Porchey was one of the friends who, as Geordie, 66, told the Daily Mail last year, ‘ran around London on VE Day with [the then Princess Elizabeth] and Princess Margaret incognito...There were about 12 of them. Took off and conga-ed.’In the years that followed, Porchey became not only Queen Elizabeth’s racing manager – a role he fulfilled for more than 30 years – but her confidant, to whom she would speak by telephone or in person at Sandringham, Windsor or Balmoral, where the two families holidayed together. Numerous photographs of those carefree times are contained in the Carnarvons’ family albums.There will be no such intimate moments on Saturday. But, as they watch proceedings on television, the Earl and Countess may well spy one very familiar figure – Geordie’s erstwhile sister-in-law, Chica, who was married to his younger brother, Harry, until 2018. Since then, Harry has re-married, his new wife being acclaimed chef Clodagh McKenna; so, too, as I disclosed in December, has the vivacious Chica. Her new husband is the Duke of Norfolk – who, in his role as Earl Marshal, arranges every detail of the Coronation...",
        "Crown Countess Natascha puts her best foot forward",
        "The Crown star Natascha McElhone is determined to put on a glittering performance even when the cameras have stopped rolling.The actress, who played Prince Philip’s confidante Countess Mountbatten of Burma in the hit Netflix drama, was seen wearing a pair of Ugg’s £95 Drizlita Glitter Boots on a shopping trip in North London. She completed the look with a flowing dress and two floral bags.McElhone, 51, said she was drawn to playing the Countess, Penny Knatchbull, in The Crown because of the uniqueness of ‘putting on screen a relationship between a man and a woman where perhaps it’s a ferocious friendship, and there isn’t a romantic element’.BBC star Alex’s hair-raising review The One Show’s Alex Jones did not get a good review from her mother for her latest BBC TV series, Reunion Hotel.The presenter reveals: ‘My mother said, “It’s a shame you didn’t think to do your hair before you started filming”.’Jones, 46, concedes her hair could have done with a bit of colour in it but offered a defence. The former Strictly contestant, who has three children with husband ",
        "Charlie Thomson, adds: ‘I said, “Mum, Annie [her youngest] was a baby, Charlie was not very well at the time, and there were another two children and a full-time job”.",
        "‘My mum went, “I know, but still — sometimes you just need to prioritise”.’Cartwheel of fortune for Mum’s girl, JoelyJoely Richardson is inspired by the sprightliness of her Oscar-winning mother, Dame Vanessa Redgrave, 86.Joely, 58, has shared a video with fans which shows her performing an impressive double-cartwheel on a secluded beach in Italy.",
        "‘My ma wanted me to post this when I showed her my pics from Sardinia,’ says the actress (right), whose daughter, Daisy Bevan, is 31.‘I have a very vivid memory of her doing cartwheels round the garden on my daughter’s first birthday. I remember thinking, “Wonder if I’ll be able to do that at her age?”. All these years later, I suppose I can.’Supercar maker McLaren hosted its first night tour of London since the pandemic at the weekend to promote women in motorsport. The convoy of £189,000 hybrid Arturas and GTs took enthusiasts from McLaren’s Knightsbridge headquarters to Mayfair, via a pit stop at Santa Maria Pizzeria in King’s Road. 'Most of our drivers were women,’ Saskia Jiggens, of Knightsbridge Partnership, tells me. ‘Going past Embargo nightclub in Chelsea, this guy shouted out, “Oh, my God, there’s even a chick driving this one”.’ A landmark victory for women’s equality. Coronation quiche is the order of the day this weekend, but King Charles is hoping for more fancy fare after he’s crowned. ",
        "The Royal Household is advertising for an ‘ambitious’ chef who’s willing to travel with His Majesty. The Demi Chef de Partie will be principally based at Buckingham Palace but must be prepared to cook at other royal residences such as Balmoral. ‘As you’d expect, standards are exceptionally high here and every day is busy, so you’ll need to be an ambitious and qualified chef,’ says the advert on the royal website, which does not provide the salary. ‘Attention to detail is vital.’ King Charles has a ‘deliciously self-deprecating humour’, says novelist Kathy Lette. ‘My favourite example took place in a Scottish castle owned by Billy Connolly,’ she explains. ‘Billy told me how Robin Williams and Eric Idle were teasing him about holding socialist beliefs while being lord of his own castle. ",
        "'“Come the revolution,” the comic quipped. “We’ll all live in castles.” The then Prince of Wales replied softly, eyes a-twinkle: “Well, I won’t.”'Scientist Robert Winston has been gathering data on the London Underground. Winston sits on a House of Lords committee investigating light and noise pollution. He said yesterday that he and his moustache had been on various Tube trips to measure the decibels. Noise levels on some lines, he said, were ‘painful’ and ‘terrifying’, and caused by ‘wheels that don’t seem to fit the rails’. "
    ]
}