{
    "articleURL": "/wires/reuters/article-12049145/LATAM-POLITICS-TODAY-Colombian-court-nullifies-senate-presidents-election.html",
    "content": [
        "Venezuela's Maduro commiserates with Putin on drone attack",
        "Nicaragua arrests 40 opposition figuresMexico president defends son over alleged corruptionLatam election influence operation linked to Miami firmMay 4 (Reuters) -The latest in Latin American politics on Thursday:Colombian court nullifies Senate president's electionBOGOTA - Colombia's top administrative court declared the election of Senator Roy Barreras to be invalid in a decision that opens the door for other legislators to be removed from their seats.The court, known as the Council of State, ruled that Barreras, the Senate's current president and an important backer of President Gustavo Petro's reform agenda in Congress, did not leave his old political party in time to run for election for his current party.\"The justice system's rulings are to be respected although they seem unjust to me,\" Barreras said on Twitter, adding that he would appeal the decision.Venezuela's Maduro commiserates with Putin after drone attackCARACAS - Venezuela President Nicolas Maduro said he had spoken by phone with Russian leader Vladimir Putin to \"express all the support of the Venezuelan people after the terrorist attack on the Kremlin.\"Russia has accused the U.S. of being behind what it says was a drone attack on Moscow's Kremlin citadel intended to kill Putin, an assertion the U.S. called \"ludicrous.\"",
        "Maduro and Putin also discussed deepening their countries' bilateral cooperation, Maduro said on Twitter.Nicaragua arrests 40 opposition figures in new round-up of criticsPolice have arrested 40 political opponents of Nicaraguan President Daniel Ortega and charged them with crimes including conspiracy and treason in a new round-up of government critics, according to relatives of five of the detainees.The opposition figures were detained on Wednesday night, taken to the capital Managua to be charged, then transferred back home to be placed under house arrest, the relatives told Reuters.The charges against the 40 were registered in the country's online judicial database.Mexico president defends son after report alleging corruptionMEXICO CITY - The Mexican president has defended one of his sons against corruption allegations, rejecting a media report that his son used his position to help friends win millions of dollars worth of contracts.This week Mexican news outlet Latinus published a report alleging that Andres Lopez Beltran, a son of the president, had helped friends snare public contracts worth over 100 million pesos ($5.6 million).President Andres Manuel Lopez Obrador acknowledged family friends had won government contracts, but said they posed no conflicts of interest.Latin American election influence operation linked to Miami marketing firmSAN FRANCISCO/WASHINGTON - A Miami-based digital marketing firm was behind a series of covert political influence operations in Latin America over the last year, Facebook-owner Meta said this week, a rare disclosure of an apparent U.S.-based misinformation-for-hire outfit.",
        "Predictvia, which is registered as a business in Florida, says on its website that it stands on the \"front line of the fight against misinformation\" and combats \"coordinated efforts to manipulate public discourse.\"(Compiled by Brendan O'Boyle and Steven Grattan; Editing by Paul Simao, Josie Kao and Sonali Paul)"
    ]
}