{
    "articleURL": "/news/article-12060885/The-real-life-Rain-Man-form-autism-means-hes-one-greatest-mental-athletes.html",
    "content": [
        "English writer Daniel Tammet has written nine books so far in his career  Daniel Tammet has been called the world’s greatest mental athlete, and you don’t need to be an intellectual whizz to understand why.",
        "His brain is a thing of wonder, capable of feats that seem almost super-human.In 2004, he was feted for setting a European record for pi memorisation — reciting the ratio of a circle’s circumference to its diameter to an astonishing 22,514 digits in five hours and nine minutes.The memory man, capable of solving the most complex equations in less time than it takes most of us to tap the numbers into a calculator, was celebrated as a mathematical genius, but numbers were just the beginning.In the years since, Daniel, 44, has written nine books, across an array of genres, and next year he will publish his tenth.",
        "His books have been translated into more than 20 languages. His publishers might want to save themselves some money by getting him to do the translation work himself, given that he speaks 11 of them. One, Icelandic, he learned in a week.‘That leaves a lot of languages I don’t speak,’ he points out, lest anyone think he’s run out of challenges. ‘With something like Japanese, I don’t even know the alphabet.’Do mere mortals feel intimidated, even inferior, in his presence, though? Halfway through our interview, I tell him that I expected to, so presumably it’s an occupational hazard? He looks horrified, even pained.",
        "‘Oh no! No one should ever feel inferior. I felt inferior for so long. I couldn’t do anything the other kids could do. I couldn’t ride a bike. I was ten before I could swim, while my brothers and sisters could swim at five or six. On the social side, it was hopeless. Everyone else had friends. I couldn’t make friends.‘I would ask: “What am I missing? Why can’t I do this?”. To this day, I still can’t drive a car. But at some point in my life, I stopped feeling inferior. I’ve never felt superior, though.‘I’ve just reached a point where I realise everyone is so different, and there is a richness in that.’Daniel was on BBC Radio 4 last week, supporting a call for ‘super memorisers’ to come forward for an academic study about why some people are especially good at retaining information.Volunteers who pass initial tests will be invited for MRI brain scans so that researchers at Cambridge University can assess whether there are differences in their brain function or structure.",
        "You don’t have to be able to recall a string of more than 22,000 digits — or learn a new language in a week — to qualify.Anyone who thinks they have a stellar memory can take the preliminary online quiz, which involves challenges such as memorising a phone number or a pattern of chess moves. Those who are considered to have passed with particularly flying colours may then get the call to come to Cambridge.",
        "This is, of course, elementary stuff for Daniel, though he knows what it’s like to be a research guinea pig. His own brain has been thoroughly scanned, including by the team behind the new study.He was diagnosed with autism at the age of 25, and has a rare related condition called savant syndrome, in which people with developmental disorders have amazing abilities.The most famous savant is a fictional one — the character Raymond Babbitt, as portrayed by Dustin Hoffman in the 1988 film Rain Man. Babbitt was based on a real person, Kim Peek, whose parents were once advised to place him in an institution, and told that a lobotomy would ‘cure’ his incessant talking, fidgeting and pacing.Daniel, whose own parents knew there was something ‘wrong’ when he started banging his head against the wall and walking around in circles, met Kim in 2004.He describes the encounter — the first time he had met a kindred soul who shared his love for books and facts and figures — as ‘one of the happiest moments of my life’.Although Daniel was born in Barking, east London, into a working class family — his dad Kevin was a sheet-metal worker and his mum Jennifer was a secretarial assistant — his life is now in Paris.",
        "He lives in a small but impeccably placed apartment near Notre Dame with his French husband Jerome Tabet, a 43-year-old photographer and artist, whom he met while promoting his 2006 autobiography.",
        "At night, he likes to trace the lights of the Eiffel Tower as they beam predictable patterns on to the walls. It might seem odd that someone who needs routine, order and familiarity has settled so far from home, but this has been a pattern in his life. When he was 18, he took off to Lithuania to study.‘I think there was an element of my condition making me fearless, bizarrely,’ he says.He tells me that when you never feel at ease, even in your own head, then home can be anywhere.He laughs about what they thought of him in Lithuania, where the people he met saw his Britishness before his autistic traits. ‘People in Lithuania would say to me: “You are so different, but you are British, eccentric”. It gave me a complete change of perspective, the idea that being on the spectrum isn’t just purely cognitive but almost cultural.’To most of us, numbers are just, well, numbers, sitting boringly on a page. Not so for Daniel, who has synesthesia — the phenomenon of experiencing one sense through another. ‘I don’t so much count numbers as dance with them,’ he says, explaining how, to him, every number has a three-dimensional shape, each with a distinctive colour.",
        "When numbers combine, his brain becomes a swirl of yellows, blues and greens. He not only ‘sees’ these numbers but feels them. ‘They are my friends,’ he adds. He feels pi — the never-ending number — most of all.When he describes getting to a crucial point in his famous pi recital, which involves a series of nines, you can actually feel the excitement bounce off him.",
        "‘It’s a point in pi — after 762 digits — that fascinates mathematicians. The chances of getting 999999 is literally one in a million, yet it comes after just 762. When I got there, my voice got deeper and my whole demeanour changed because nine is a very heavy number for me. It’s dark.’Among those who understood his reaction was the singer Kate Bush, who went on to write a song about pi, and Daniel’s relationship to it, which is mind-blowing in itself.‘Yes, but she got that, which was amazing because it meant I had found my voice. It’s just paradoxical that I had to find it in numbers before I could find it in words.’This may be a man with a mind-boggling memory — not for him are concerns about remembering all the passwords modern life now requires — who can do equations seemingly without thinking and write beautifully crafted prose (he has been compared to Hemingway), but he cannot use a mobile phone or drive a car.",
        "‘Technically, yes, I am disabled,’ he says. ‘But do I feel disabled, or abled? That’s difficult because there are things I cannot do — things that neurotypical people do without thinking.’Like driving? ‘Yes. I took the theory test twice and got 100 per cent each time, but the practical side was difficult. If I see a detail on a number plate I can be distracted, or if the light comes in a certain way it can divert my attention. At speed that can be dangerous.’In much the same way that I marvel at how he can multiply 384 by 6,943 (answer: 2,666,112) in his head, in seconds, so he marvels at my ability to change a clutch while not crashing the car.‘Neurotypical cognition fascinates me,’ he says, beaming. ‘You can make split-second adjustments without even realising you are doing it, and you don’t even give yourself credit for it.’The sad part is that it took so long for him to give himself credit for his more unusual strengths. At school, like so many people who are neurodiverse, Daniel was simply the odd kid who acted in weird ways.‘To the teachers I was the perfect student,’ he says. ‘But to the other children I was just weird.’ He was always last to be picked at sports. He was the one with no friends and, no, he was absolutely not happy to be in his own little world, even if it was a genius world.He is wary of suggestions that neurodiversity can be a ‘superpower’, because mostly it’s not.‘I still want to fit in as much as possible. If someone had asked me as a child, “Do you want to be like everyone else?” I would have said “Yes” in a heartbeat. I didn’t have the awareness that what I had could be special. It wasn’t a gift. I just didn’t want to feel left out, to be bullied for being different.’Kids like Daniel are still falling through the cracks, but he credits his parents, Kevin and Jennifer, for making sure he did not. ‘What they gave me was unconditional love and acceptance,’ he says.Daniel was the oldest of nine siblings and a very difficult baby who cried incessantly. At three he suffered from epileptic fits (which can be linked to autism). At school he simply didn’t know how to communicate, which is extraordinary given his eloquence and emotional fluency now. ‘I did not know how to talk to other children. I didn’t have the language. I remember getting our vaccinations and someone talking — joking, obviously — about our arms falling off. I took it literally. I was terrified.’He was a prolific reader. The school library was his sanctuary and he reckons he taught himself how to communicate by studying its books. It didn’t work immediately. ‘I’d go and emulate what I’d read, not realising the books were from the 1940s and 1950s. The other children would say: “Why are you talking funny? What is wrong with you?”.’He had to learn about making eye contact, too. ‘The teachers and my parents would say: “You have to look at me”, which I just didn’t understand. Then I’d look too much, and they’d say: “Stop staring”.’As well as books about the brain (his own, and others) he has written a detective novel where the lead character is neurodiverse, and makes connections that solve crimes.His next book has involved meeting others on the spectrum. He tells me of the blind autistic woman he met who can walk into a room and tell how many chairs are in there. This blows his mind, too. ‘There is so much we still do not understand about how the brain works,’ he says. Which is exactly why he supports so much scientific study.He could have monetised his genius more, though he says he has made a very good living from writing.After his pi triumph and a subsequent documentary about his life, a programme-maker in Los Angeles offered him his own TV show. He turned it down, because he ‘didn’t want to be a performing seal’.‘It was about the time they were poaching lots of British people, such as Piers Morgan and Anne Robinson. They offered me a TV series where I would be given time to study in a certain field, then be pitted against experts.‘It was life-changing money and I am from a very working-class background, so of course I was tempted, but ultimately those around me said: “Yes, it will change your life, but not necessarily in ways you want it to”.’It takes a man who knows his own mind — and all the complexities within — to make that decision.To see if you are a ‘super memoriser’ and for more information about the research, go to cam.ac.uk/research/news/search-is -on-for-super- memorisers-to-help-scientists-unlock-the-secrets-of-memory"
    ]
}