{
    "articleURL": "/femail/article-12038025/Princess-Dianas-designer-dresses-expected-sell-544-000-auction-LA.html",
    "content": [
        "The public can visit the gowns at the Museum of Style Icons from 5 MayRead More:  Royal works of art! The Queen and Princess Margaret's childhood drawings sell for over £11,000 at auctionThree of Princess Diana's designer dresses are expected to fetch up to £544,000 when they go up for auction in Los Angeles this summer.",
        "The late royal - who passed away at the age of 36 in 1996 - owned several bespoke gowns by designers Catherine Walker and Bruce Oldfield.The selection of dresses, which are being sold by Julien's Auctions, have not been seen by the public in over 30 years.The US-based auctioneers and Turner Classic Movies (TCM) jointly announced the sale of more than 1,000 objects closely associated with cultural figures, known as the Hollywood Legends collection.The two-day sale will take place on August 26 and 27 - one week before the 26th anniversary of Princess Diana's death. ",
        "The item expected to sell for the highest amount is the Bruce Oldfield dress the late royal wore to the premiere of Hot Shots! in November 1991. The auctioneers have estimated that the glistening red silk gown - which has billowing sleeves and gathered at waist - will fetch between £160,000 and £320,000.Princess Diana attended the film premiere in Leicester Square with president Arpad Goncz of Hungary and his wife. The stylish royal paired her show-stopping frock with a pearl choker and matching red satin heels. Alongside this silk gown, two of Princess Diana's Catherine Walker dresses will also be included in the auction.  The London-based French designer - who passed away in 2010 - was the royal's personal dresser for over 16 years and her brand is often worn by Diana's daughter-in-law the Princess of Wales.",
        "In 1986, Princess Diana wore a black and jade short-sleeved gown with a draped silk skirt to a gala dinner at the Royal York Hotel in Toronto.The vintage dress - which Diana wore with the Spencer tiara - is expected to sell for up to £160,000.",
        "Finally, the auction will also include a second Catherine Walker dress - which Diana wore to a private function.The slim-fitting strapless gown is made of white silk crepe and had bold bands of black velvet running across the top and middle. It also has a silk lining underneath.  The auctioneers are anticipating that this bespoke dress will sell for anywhere between £48,000 and £64,000. Ahead of the auction, Diana's dresses will be available for the public to see at the Museum of Style Icons at Newbridge Silverware in Co Kildare, Ireland, from May 5 - just one day before King Charles' coronation. They will be displayed alongside the museum's permanent Diana exhibition, which includes pieces like the pale pink Emanuel blouse worn in her engagement portrait by Lord Snowdon in 1981. Darren Julien, founder of the auction house, said: 'Julien's Auctions is pleased to announce our latest auction presentation with our esteemed partner TCM featuring two marquee collections that truly embody the stuff of legends, Warner Bros and Princess Diana.",
        "'Together, we look forward to celebrating 100 years of Warner Bros and over 10 centuries of the royal family with our special showcase of treasures from the legendary Hollywood movie studio and the beloved people's princess, one of the most photographed women in the world, who changed the monarchy forever and whose persona continues to captivate the public and Hollywood today through tributes and film and television works about her life.'Earlier this year, it was reported that Princess Diana's 'favourite designer' Bruce Oldfield has been picked by Queen Camilla to make her gown for King Charles' coronation.Oldfield, 72, had a professional relationship with Diana for 10 years and designed some of her most well known outfits.Over the years, he's also developed a close bond with Camilla and dressed her for several significant occasions.And one insider told The Sun he was the 'obvious' choice for Camilla ahead of King Charles's coronation on May 6.'Camilla has a very close friendship with Bruce spanning many years so in many ways it is the natural and obvious choice,' the source said.'Camilla trusts Bruce because he has really delivered on dresses for so many important occasions recently for her.'While Oldfield has not commented on the suggestion he's designing the gown, he previously said: 'I gave Diana her glamour and Camilla her confidence.' "
    ]
}