{
    "articleURL": "/news/article-12052427/TikTok-star-Bobby-Moudy-killed-suffering-money-worries.html",
    "content": [
        "Tragic TikTok star Bobby Moudy committed suicide due to mounting 'financial pressure', his family said in a statement FridayHis wife Jennifer has been left devastated by his passing - and now faces serious financial worries, his family said TikTok  star Bobby Moudy killed himself after being 'weighed down by financial pressures,' his family revealed. ",
        "A heartbreaking statement shared by his grieving family said: 'Bobby was full of life and laughs,' the statement read. 'But also weighed down by financial pressures. His wife, Jennifer and their three children are in an emotional and financial crisis as he was their rock.'Further details of Moudy's money woes have not been shared, although they are said to have left his wife in 'financial crisis.' ",
        "Heartbreaking tributes have poured in for the father following his suicide in Mississippi on April 28. The social media star and 'loving father and husband' garnered 360,000 followers and over 18.6 million likes on TikTok, and shared his last video just two days before his death.Moudy's family said it was 'with great sadness' they shared news of his death.  The performer leaves behind his wife Jennifer, and kids Kaytlin, Max and Charleigh, who were a regular fixture on his 'day-in-the-life' videos as they racked up millions of views.",
        "His last video was of his daughter Kaytlin, who featured heavily on his TikTok page over the years. The beloved father even said in his bio he was 'just here to embarrass my daughter'.In her own heartbreaking statement, Kaitlyn wrote: 'On April 28th my best friend was able to see our Heavenly Father.'He was the most amazing dad, brother, uncle, and friend. He had such an impact on not only his family but those around him.",
        "'He was and is still so loved by so many. He will forever be remembered. I hope you're hugging Louie tight for us. We're counting down the days until we see you again.'His wife Jennifer posted a tribute to her husband following news of his passing, with a montage of images of her late husband alongside the music to Israel Kamakawiwo'ole's version of Somewhere Over The Rainbow.She wrote: 'My precious Bobby! Go fund me in bio for his 3 babies.' In response to a fan's message about his death, she added: 'I keep thinking he will walk in the door any minute'.",
        "An obituary for the late star described him as 'an avid outdoor enthusiast' who 'enjoyed fishing, hunting and camping.'The obituary said after meeting Jennifer in 1999, the couple married in 2004 and started their family, where he became 'a devoted husband, father and brother'.'He was happiest showing his love and support for his kids,' it continued. 'He was often the loudest voice on the sidelines cheering on his children at their sporting and educational events.'He approached life with a contagious enthusiasm and a smile.'"
    ]
}