{
    "articleURL": "/wires/afp/article-12055927/Japanese-PM-arrives-South-Korea-landmark-summit.html",
    "content": [
        "Japan's Prime Minister Fumio Kishida said Sunday his \"heart aches\" for Koreans who suffered under colonialism, as Seoul and Tokyo seek a rapid reset of long-strained ties in the face of North Korean threats.",
        "Kishida was in Seoul on the first official bilateral visit by a Japanese leader to South Korea in over a decade. He met President Yoon Suk Yeol, who has made improving testy relations with Japan a top priority for his administration.The East Asian neighbours, both crucial security allies of the United States, have long been at odds over historic issues linked to Japan's brutal 1910 to 1945 colonial occupation of the Korean peninsula, including sexual slavery and forced labour.\"My heart aches as many people went through a very difficult and sad experience in the harsh environment at that time,\" Kishida said, speaking after the summit with Yoon.Yoon said Kishida's visit showed \"shuttle diplomacy\" -- regular mutual visits and high-level talks -- was back on track, after a lengthy pause during a bitter trade spat linked to the forced labour issue.\"Based on the friendship and trust I have with Prime Minister Kishida, I will promote deeper bilateral cooperation toward a new future,\" said Yoon, who was in Tokyo in March for a fence-mending visit.Bilateral ties were torpedoed in 2018, when South Korea's Supreme Court ordered Japanese firms to compensate the wartime victims of forced labour, enraging Tokyo and triggering an escalating series of tit-for-tat economic measures.But Yoon, who took office last year, has sought to bury the historical hatchet, earlier announcing a plan to compensate victims without direct involvement from Tokyo -- a move that was unpopular domestically, but helped improve ties with Japan.",
        "\"As the South Korean government moves forward... I am touched to see how so many people are opening their hearts to the future while not forgetting the hardships of the past,\" Kishida said Sunday.- 'Expression of sincerity' -Experts had widely predicted Tokyo would not offer a new apology, and Kishida stopped short of this, instead reaffirming the \"heartfelt apology\" made by previous administrations in Tokyo.\"There are parts of Kishida's statement that definitely fall short of our expectations,\" Choi Eunmi, a researcher at the Asan Institute for Policy Studies, told YTN.\"But even though he said it was his personal feeling, I would like to note his expression of sincerity. And I think this is meaningful as we are just taking our first step in restoring shuttle diplomacy.\"During their March summit, Kishida and Yoon agreed to end tit-for-tat trade curbs, with Kishida inviting the South Korean leader to a G7 meeting in Hiroshima this month.For Yoon, it is long overdue that the two countries \"end the vicious cycle of mutual hostility and work together\" to improve regional security, he told AFP in March before he flew to Tokyo.- 'Grave threat' -Efforts to mend ties come as North Korean leader Kim Jong Un, who last year declared his country an \"irreversible\" nuclear power, doubles down on weapons development and testing.",
        "Pyongyang has conducted a record-breaking string of launches in 2023, including test-firing the country's first solid-fuel ballistic missile -- a technical breakthrough.The United States and South Korea have in turn been ramping up their defence cooperation, staging a series of major military exercises including two trilateral drills involving Japan this year.\"Prime Minister Kishida and I shared the recognition that North Korea's nuclear and missile development poses a grave threat to peace and stability not only on the Korean Peninsula and Japan, but also throughout the world,\" Yoon said Sunday.The two leaders agreed to hold a trilateral meeting with the United States on the sidelines of the upcoming G7 summit.Yoon recently returned from a state visit to Washington, where he and US President Joe Biden agreed to boost the United States' nuclear defence of South Korea and improve cooperation with Japan.\"Further North Korean provocations and weapons developments are expected soon, so it is important for US allies to stay a step ahead of Pyongyang,\" said Leif-Eric Easley, a professor at Ewha University in Seoul.\"They can do so by better coordinating sanctions enforcement, intelligence sharing, missile defense exercises, and anti-submarine drills. Progress on such trilateral cooperation is likely to be highlighted by a Biden-Yoon-Kishida meeting on the sidelines of the G7 summit in Hiroshima later this month.\""
    ]
}