{
    "articleURL": "/wires/reuters/article-12055859/U-S-earns-spot-semis-International-Crown.html",
    "content": [
        "The United States lost Pool A to Sweden but still qualified for the semifinals at the Hanwha LifePlus International Crown on Saturday in San Francisco.",
        "The Americans (3-2-1) dropped one fourball match and clawed back to halve the second match against Sweden (5-0-1) in the team match-play event. The U.S. clinched a berth in the semis when China lost its second match to England.The U.S. will play Pool B winner Thailand in Sunday's semis while Sweden gets Australia, the runner-up to Thailand, the only team to go undefeated in pool play (6-0-0). Thailand swept Australia on Saturday.Lexi Thompson opens against Atthaya Thitikul of Thailand on Sunday morning. Patty Tavatanakit will then battle Lilia Vu followed by Moriya Jutanugarn and Ariya Jutanugarn of Thailand versus Danielle Kang and Nelly Korda.The International Crown is being played for the first time since 2018 due to the COVID-19 pandemic. The top eight countries in women's golf were determined by last year's Rolex Rankings and each country sent four of its top players to the unique team event.The countries were seeded and split into two pools, with teams competing in four ball (best ball) in a single round-robin format from Thursday to Saturday. One point will be awarded for a win and a half-point for a tie, with the top two countries advancing from each pool.Two semifinal matches will be played Sunday morning, each consisting of two singles matches and one foursomes (alternate-shot) match. The winning semifinal countries will compete in the final match on Sunday afternoon in the semifinal format.",
        "Sweden clinched Pool A when Anna Nordqvist and Caroline Hedwall defeated Korda and Vu 1 up. Hedwall and Nordqvist went 3-0-0 in four-ball competition.\"You knew it was going to have to be really strong play, and I think (we're) just proud of ourselves,\" Nordqvist said. \"We finished really strong yesterday to gain some momentum, and we came out firing pretty strong this morning.\"In the second match, the U.S. team of Thompson and Kang birdied three straight holes (Nos. 14-16) to take the lead before Maja Stark drained a birdie putt on the 18th to halve the match.\"I kind of liked it because it felt like they got mad, and that's kind of funny,\" Stark said of her birdie putt on 18. \"I just really wanted to make that putt. Just being able to perform under pressure like that is not something that I've really felt before because it's usually been, everything has just been about myself, but now I do it for my team and for Sweden. It's really nice to be able to come in clutch like that at the end.\"In other action Saturday, South Korea swept both matches from Japan while England and China split.Standings (W-L record, points)Pool A1. Sweden 5-0-1, 5 1/2 points",
        "2. United States 3-2-1, 3 1/2 points3. China 2-4-0, 2 points4. England 1-5-0, 1 pointPool B1. Thailand 6-0-0, 6 points2. Australia 3-2-1, 3 1/2 points3. South Korea 2-4-0, 2 points4. Japan 0-5-1, 1/2 point--Field Level Media"
    ]
}