{
    "articleURL": "/news/article-12057459/DAILY-MAIL-COMMENT-Police-protect-rights-majority.html",
    "content": [
        "Apparently in all seriousness, the civil rights group Liberty said the policing of Saturday's Coronation was 'becoming a human rights disaster'.",
        "It's true that 52 people were arrested in London on Saturday on suspicion of affray, breach of the peace and other public order offences. But a human rights disaster?Given the horrors committed by Russia in Ukraine, repression of dissidents from China to Iran and the unfolding crisis in Sudan, such hyperbole is not only infantile, but also deeply insulting to those whose freedoms are genuinely being crushed.Yes, there have been allegations of heavy-handedness by the police, and these will no doubt be fully examined and tested when those arrested on Saturday have their day in court.They are mainly activists from the anti-monarchist group Republic, and climate zealots from Just Stop Oil. In this free country, both organisations were, of course, entitled to express their opinions.",
        "But only until their protesting tipped into public disorder or interfered with the rights of millions watching in person or on television to enjoy a day of rare and glorious pageantry.And with hundreds of foreign dignitaries in London for the occasion, including heads of state, many would forgive the police if they did err on the side of caution.In the event, the whole weekend went off without any serious hitch.The uncouth booing of God Save The King by some Liverpool football fans was a shameful blemish. But it said far more about their own pathetic attention-seeking than the general public mood.",
        "From the start of Saturday's procession, through the ceremonials, to yesterday's concert and widespread street parties, the overwhelming atmosphere has been one of celebration. This shows that despite the efforts of those who would tear it down, our constitutional monarchy remains immensely popular and in rude health.Let's hope the Coronation brings another unanticipated benefit. Now the police have shown they can successfully stop disruptive protests, perhaps they will act more decisively in future against eco-extremists who glue themselves to major roads and try to bring cities to a halt.Labour's dodgy dealsAfter a severe bruising in the local polls, Rishi Sunak can take heart from shadow health secretary Wes Streeting's refusal to rule out a coalition between Labour and the Liberal Democrats after the next general election.The first thing it shows is that Labour is far from confident of winning an outright majority. The second is that Sir Keir Starmer will do anything to get his hands on the levers of power.Given the level of vicious opprobrium it levelled at the Liberal Democrats when it went into coalition with the Tories in 2010, Labour have some nerve to be considering a similar arrangement.",
        "What concessions would Sir Keir be prepared to make to Labour's junior partner – on proportional representation, gender recognition, green taxes and much else.",
        "In the local elections, we saw evidence of a backstairs stitch-up in the Tory stronghold of Bracknell, where Labour, Lib Dems and Greens stood down their own candidates in wards where one of the others had a better chance.As a result, the Tories won 45 per cent of the vote but just ten out of 42 seats. So the strategy was a success in its own cynical terms, but denied the electorate choice and skewed the democratic process.If Labour is prepared to go into a national coalition it should say so honestly and openly, rather than engaging in clandestine deals. When they go into the election booth, people have a right to know exactly what – and who – they are voting for."
    ]
}