{
    "articleURL": "/wires/reuters/article-12056465/Wagner-group-appears-U-turn-Bakhmut-withdrawal-Russia-keeps-missile-attacks.html",
    "content": [
        "May 7 (Reuters) - Russia's Wagner mercenary group appeared on Sunday to ditch plans to withdraw from Bakhmut in eastern Ukraine, saying they had been promised more arms by Moscow and suggesting they may keep up their assault on what Russia sees as a stepping stone to other cities in the Donbas region.",
        "Ukraine's general in charge of the defence of the besieged city said late on Sunday that Russia had intensified shelling, hoping to take Bakhmut by Tuesday, but he vowed to do everything to prevent it. May 9 is Victory Day in Russia, marking the anniversary of the defeat of Nazi Germany in World War Two.Elsewhere, Ukrainian and Russian media reported explosions across Russian-occupied Crimea, and a blast was reported overnight in the Black Sea city of Odesa. Russia's defence ministry said its air defences had detected and destroyed 22 Ukrainian drones over the Black Sea overnight.Wagner chief Yevgeny Prigozhin had said on Friday that his fighters, who have spearheaded a months-long assault on Bakhmut, would pull out after being starved of ammunition and suffering \"useless and unjustified\" losses as a result.But in an audio message posted on his Telegram channel on Sunday, he said: \"We have been promised as much ammunition and weapons as we need to continue further operations. We have been promised that everything needed to prevent the enemy from cutting us off (from supplies) will be deployed.\"Prigozhin, in an audio statement late on Sunday, said his units had advanced 280 meters (920 ft). \"We are moving forward. We are expecting to receive ammunition,\" he added. Prigozhin has previously made a number of premature claims of success.",
        "A spokesman for Russia's defence ministry did not respond to a request for comment after Prigozhin's latest statement.Russian officials have repeatedly sought to allay concerns that their forces on the front line have not received adequate supplies. Defence Minister Sergei Shoigu said on Tuesday, referring to the Russian army as a whole, that they had \"received the sufficient amount of ammunition\" to effectively inflict damage on enemy forces.On the Ukrainian side, Serhiy Cherevaty, spokesman for Ukraine's eastern command, said in response to Reuters questions about Prigozhin's comments that Russian forces have \"more than enough\" ammunition.He said Prigozhin's comments are aimed at distracting from the heavy losses Wagner has taken by throwing so many troops into battle.\"Four hundred eighty-nine artillery strikes over the past 24 hours in the area around Bakhmut - is that an ammunition hunger?\"Late on Sunday, Colonel General Oleksandr Syrskyi, the Ukrainian commander of ground forces in Bakhmut, said the Russians had increased shelling and were regrouping troops. Reuters could not independently verify the reports.\"The Russians still hope to capture the city by May 9. Our task is to prevent this,\" Syrskyi said on Telegram after what he said was a visit to the troops along the Bakhmut front line.Prigozhin's threat to pull out of Bakhmut highlights the pressure Russian forces are under as Ukraine makes its final preparations for a counteroffensive backed by thousands of Western-donated armoured vehicles and freshly trained troops.",
        "The battle for Bakhmut has been the most intense of the conflict, costing thousands of lives on both sides in months of grinding warfare.Ukrainian troops have been pushed back in recent weeks but have clung on in the city to inflict as many Russian losses as possible ahead of Kyiv's planned big push against the invading forces along the 1,000-km (620-mile) front line.EVACUATIONUkrainian President Volodymyr Zelenskiy said in his nightly video address that nine Ukrainian explosives experts who were engaged in de-mining were killed in a single Russian attack in the southern Kherson region on Saturday.\"They were ... restoring safety for our people,\" Zelenskiy said.The general staff of Ukraine's armed forces said on Sunday that Russians were continuing to remove what it described as looted property from frontline settlements in occupied areas of Zaporizhzhia region under the pretext of capturing civilians.In Mykolaiv, governor Vitaliy Kim said in a social media post that a building and territory belonging to an unspecified enterprise were damaged overnight after Russian long-range bombers targeted his southern region with five Kh-22 cruise missiles.In the eastern Kharkiv region, at least five people were injured after an S-300 missile struck a car park in the city of Balakliya, Governor Oleh Synyehubov said.",
        "In the southern city of Kherson, which Ukraine liberated last November but has been under constant Russian attack, six people were killed over the past 24 hours in a variety of strikes, Governor Oleksandr Prokudin said.Air raid alerts were also reported overnight in the capital Kyiv, as well as in other regions of the country.Russian forces have stepped up their long-range missile strikes on civilian and infrastructure targets in recent days.The overnight strikes coincided with Ukrainian and Russian media reports of multiple explosions across Russian-occupied Crimea. Reuters could not immediately confirm the reports.Baza, a Telegram channel with links to Russia's law enforcement agencies, reported that Ukraine sent a series of drones over the peninsula, with Russian air defence shooting down at least one over the port of Sevastopol.Reuters was not able to independently verify the reports.Strikes on Russian-held targets have intensified in the past two weeks, especially in Crimea. Ukraine, without confirming any role in those attacks, says destroying enemy infrastructure is preparation for a planned ground assault. (Reporting by Dan Peleschuk, Lidia Kelly, Elaine Monaghan; Writing by Dan Peleschuk, Hugh Lawson, Humeyra Pamuk, Matt Spetalnick; Editing by Frances Kerry, Angus MacSwan, Diane Craft and Sandra Maler)"
    ]
}