{
    "articleURL": "/news/article-12059437/Huge-air-conditioning-collapses-swimming-pool-Colorado-vacation-resort-injuring-six.html",
    "content": [
        "Survivors said they felt lucky to be alive following Saturday's horror collapse Two people were left with life-threatening injuries, according to authorities One hotel guest described the scene as 'like a war zone' with 'parents screaming'A massive air conditioning system has collapsed into a swimming pool at a resort in Colorado, leaving six people hurt and two with life-threatening injuries. ",
        "The huge piece of mechanical equipment crashed into the indoor pool at the Gaylord Rockies resort in Aurora at 9.50am on Saturday morning.There were 50 to 100 people in the pool area at the time, according to Aurora Fire Department. Shocking video footage taken at the scene shows the devastation caused by the fallen equipment, with filthy brown water spraying from an open pipe and injured guests at the side of the pool. Eight firefighters from a nearby station were already at the hotel doing training, and all six injured patients were transported to local hospitals.",
        "DailyMail.com reached out to the Aurora Fire Department for an update on those injured. Jamie Olson and her son Canon were at the pool when it happened, and he moved away from the area just before the horror collapse.Olson told FOX 31 how herself and her son helped a young girl who had terrible wounds.'It was a devastating experience. Canon was grabbing towels and the staff was doing the best they could to,' Olson said.'We had to help this little girl and we all worked together to make sure she was stable until paramedics arrived.'The girl was not immediately identified and her condition was not known Monday. Olson said how lucky she felt that her son was able to escape unscathed.   ",
        "'That section of the pipe was right where he was sitting. The poor sweet girl who got injured, he was right next to her.'She said that in the aftermath of the incident, the hot tub 'looked like it was filling with black', making it difficult to tell if anyone was still trapped inside.",
        "12-year-old Trevor Spykerman told CBS News Colorado that the collapse felt like it was happening in 'slow motion.' He said: 'When I saw all of it come down, most of it took like, five seconds to come down, and it brought all the other pipes down as well.'It smelled like oil... I thought maybe the roof would collapse soon and I thought maybe because of the oil smell, maybe something might catch on fire.'Spykerman hurt his feet evacuating the pool due to the debris but was otherwise uninjured. ",
        "Another survivor, Kolby Huseman, told the outlet how he was playing in the pool with with his 5-year-old son Levi when they heard the pipes above them start to make a noise. The family, from Houston, were at the hotel on vacation.  He says he looked up to see the large metal ducts come crashing down onto them.'I grabbed my son and kind of just, tucked him under me,' he said, and a part of the duct fell directly on his back, causing scratches from his shoulders to his waist and bruising all over his back. ",
        "'Right after it happened, it was kind of like a war zone - a lot of parents screaming for their kids,' he added. Huseman did not go to hospital and said he would get checked out when he got home. His son was uninjured other than a scraped knee. ",
        "It is not yet known what might have caused the collapse.  The Aurora City Mayor and city council said in a statement that it expected a 'thorough investigation', which would be up to the hotel to conduct. 'Our immediate focus is the wellbeing of those involved, and we thank our first responders for their quick response and care,' the statement said.   The hotel, which is a Marriott Bonvoy property, opened in 2018.The hotel said in a statement: 'We are devastated by this traumatic incident. On Saturday, our top priorities were to support emergency responders and render assistance to those directly impacted, and we’re very grateful to the Aurora Fire Department for their swift actions. 'Moving forward, we are focused on helping our affected guests and associates, and we are working with the appropriate experts to conduct a thorough investigation.'"
    ]
}