{
    "articleURL": "/news/article-12055209/Haters-really-wore-second-Trans-influencer-Dylan-Mulvaney-slams-misgendered.html",
    "content": [
        "Transgender influencer Dylan Mulvaney admitted 'haters really wore me down for a second' following the backlash over her partnership with Bud LightShe appeared on comedian Chelsea Handler's podcast, Dear Chelsea, and said she is 'not processing' the surrounding falloutBut Mulvaney revealed she has been left heartbroken by those who are misgendering her as a manTransgender influencer Dylan Mulvaney admitted 'haters really wore me down for a second' following the backlash over her controversial partnership with Bud Light. ",
        "There were worldwide calls for a boycott of America's best-selling beer after she shared a series of posts with her 11 million social media followers on April 1. Mulvaney sparked widespread fury with the partnership content which showed her sitting in a bathtub and swigging from custom Bud Light cans sporting her face.She appeared on comedian Chelsea Handler's podcast, Dear Chelsea, on May 4 and said she is 'not processing' the surrounding fallout.But she revealed she has been left heartbroken by those who are misgendering her as a man. ",
        "Mulvaney admitted to being worn down by the pile on of hate following her Bud Light posts and believes the 'haters' don't realize the impact it is having on her mental health. 'That's what I think a lot of these haters don't realize is that the Mental effects of misgendering in the media it breaks my heart because you know there are people calling me a man and I don't right now I feel like I'm not even processing any of it,' she told Handler in a podcast episode released on Thursday. 'I'm so scared to to do that deep dive and to know what the effects are and I'll say these haters they really wore me down for a second.",
        "'Dysphoria truly it feels like a darkness that kind of washes over you and it is those moments of being misgendered...that made me so sad.'But she revealed the fact that Handler had also received hate provided her with some comfort.Mulvaney said: 'But then they came for you Chels and I I thought oh my god this is my favorite woman in the entire world and the same people that are coming for me are coming for her.'Something clicked and I went \"oh my God maybe what they're saying isn't true\" because I'm now watching them take out someone I love and I know her truth and I stand by her and I love her so maybe the same goes for me.'It's almost easier when it's not about you and it's about someone you love or enjoy and I know we hadn't met yet but I actually was able to see in through your experience with them.'And Handler replied: 'Oh wow I love that. Yeah I mean I was saying this to you a little bit before we started, but you know the haters it's just like you have a big pile of stuff there's always going to be some negative stuff you know you have to learn how to focus on the positive and all the people that you're impacting and eventually it just rolls right off your back.'",
        "'And we both know how to have a good time exactly and that's what you know I don't think they want to see that,' Mulvaney added. ",
        "She spoke out against the criticism she has received since coming out as a transgender woman and insisted she's not a 'monster'. Mulvaney shot to fame with her Girlhood video series where she documented her first year transitioning as a woman. Bud Light sent her a can with her face on it to commemorate 365 days of her living as a woman which began the controversy. She said: 'It's sad that there are still so many people that are trying to use this really beautiful journey against me and twisting my words and taking things out of context.'But at the end of the day, I'm happier than I ever have been, because I could I can't imagine going back to that other person. It breaks my heart to think about it.'A lot of people don't have a Dylan in their lives to ask questions and I think that's kind of why I got online... I wanted to be that friend for people. I wanted to show that I'm not some monster.' Mulvaney posted herself drinking Bud Light at the start of April 2023 using the hashtag #budlightpartner. She posted the content to coincide with the NCAA March Madness tournament, before joking she didn't know what sport she was promoting.",
        "The disastrous marketing bid has seen sales for the American flagship beer plummet 26 percent, despite Anheuser-Busch reporting first-quarter earnings of $1.65billion and with conservatives everywhere professing to boycott the company.The company is seemingly facing outrage and potential boycott from all sides of the political spectrum, though largely centered around conservatives.The partnership with Mulvaney drew intense backlash from some quarters, with musician Kid Rock posting a video of himself shooting at cases of Bud Light, and country singers John Rich and Travis Tritt dropping ties with the brand.But media personalities like Joe Rogan and Howard Stern defended Bud Light's decision.Anheuser-Busch reported first-quarter earnings of $1.65billion, which topped Wall Street expectations.The brewer posted revenue of $14.21 billion in the period, which also beat forecasts, with the shares rising 6 percent since the beginning of the year and 12 percent in 12 months.",
        "It's unclear if the boycott had any impact on these figures, and whether a larger impact on the firm's finances will be visible for the second quarter of the financial year if the controversy and boycotts rumble on.The brewing giants now claim that the beer can and social media posts were not meant to be 'for production or sale to the general public.CEO Michel Doukeris disavowed the advertisement in an earnings call Thursday, insisting the ad was 'not a campaign,' and that an outside agency approved it without approval from Bud Light. ",
        "Todd Allen, most recently the global vice president of Budweiser, has been announced as the new vice president of marketing for Bud Light – after marketing vice president Alissa Heinerscheid and Blake took a leave of absence.After the post on April 1, Anheuser-Busch lost more than $6billion in market capitalization in just six days.The beer giant's stock roughly traded at just over five percent decrease in the total share value and the company's market capitalization stood at $113.33billion.Mulvaney posted several videos and images on Instagram for the paid partnership, but it is unclear exactly how much she was paid.   Her paid partnership with Nike promoting the brand's sports bra and leggings also caused widespread controversy.She posed in a series of photos and videos in the work out gear and furious feminists slammed the decision by Nike to give the coveted sponsorships for a prominent women's line to a transgender woman."
    ]
}