{
    "articleURL": "/wires/reuters/article-12038095/Sudan-military-faction-chiefs-agree-May-4-11-truce-princple-South-Sudan.html",
    "content": [
        "Khartoum area rocked by fighting despite supposed truce",
        "Humanitarian crisis grows as aid disruptedSouth Sudan brokers new 7-day ceasefire pactBy Mohamed NoureldinKHARTOUM, May 2 (Reuters) - Sudan's warring military factions agreed to a new and longer seven-day ceasefire from Thursday, neighbour and mediator South Sudan said, even as more air strikes and shooting in the Khartoum capital region undercut their latest supposed truce.Previous ceasefires have ranged in theory from 24 to 72 hours but been constantly violated in the conflict that erupted in mid-April between the army and a paramilitary force.South Sudan's foreign ministry said in a statement on Tuesday that mediation championed by its President Salva Kiir had led both sides to agree a longer May 4-11 truce, once the current one expires, and to name envoys for peace talks.It was unclear, however, how army chief General Abdel Fattah al-Burhan and paramilitary Rapid Support forces (RSF) leader General Mohamed Hamdan Dagalo might make it work this time.On Tuesday, witnesses reported more air strikes in the cities of Omdurman and in Bahri, both on the opposite bank of the Nile river from Khartoum.Pan-Arab television network Al Jazeera said Sudanese army warplanes were targeting RSF positions, and anti-aircraft fire could be heard from Khartoum.Army jets have been bombing RSF units dug into residential districts of the capital region. Conflict has also spread to Sudan's western Darfur region where the RSF emerged from tribal militias that fought alongside government forces to crush rebels in a brutal civil war dating back 20 years.",
        "The commanders of the army and RSF, who had shared power as part of an internationally backed transition towards free elections and civilian government, have shown no sign of backing down, yet neither seems able to secure a quick victory.REGION AT RISKProlonged conflict could draw in outside powers.Fighting now in its third week has engulfed Khartoum - one of Africa's largest cities - for the first time and killed hundreds of people. It has also created a humanitarian crisis, with around 100,000 forced to flee with little food or water to neighbouring countries, the U.N. says.Aid deliveries have been held up in a nation where about one-third of Sudanese had already relied on humanitarian assistance. A broader disaster could be in the making as Sudan's impoverished neighbours grapple with a refugee influx.\"The entire region could be affected,\" Egyptian President Abdel-Fattah al-Sisi said in a Japanese newspaper interview on Tuesday as a Burhan envoy met Egyptian officials in Cairo.The U.N. World Food Programme said on Monday it was resuming work in the safer parts of the country after a pause earlier in the conflict, in which some of its staff were killed.Port Sudan, where thousands of people have fled Khartoum seeking evacuation abroad, is the main entry point for aid, Michael Dunford, the WFP's East Africa Director, told Reuters.",
        "Kenya has offered its airports and airstrips near the border with South Sudan as part of an international humanitarian effort.'THE SITUATION IS A CALAMITY'Supplies sent to Port Sudan for other aid agencies were still awaiting safe passage to Khartoum, a road journey of about 800 km (500 miles), although Medecins Sans Frontieres (MSF) said it had delivered some aid to Khartoum.Some 330,000 Sudanese have also been displaced inside Sudan's borders by the war, the U.N. migration agency said.\"We lost most of our savings, spending power dropped and there are no sources of income ... The situation is a calamity,\" Hassan Mohamed Ali, a 55-year-old state employee, said during a stopover in Atbara, 350 km (220 miles) northeast of Khartoum, en route to the Egyptian frontier.\"We suffer from power and water cuts, our children have stopped school. What's happening in Khartoum is hell.\"Displaced Sudanese families have also made their way, sometimes on foot under scorching desert sun, hundreds of kilometres (miles) to Chad and South Sudan.The U.N. says 800,000 people could eventually leave.More than 40,000 people have crossed the border into Egypt over the past two weeks but only after days of delays after paying hundreds of dollars to make the 1,000-km (620-mile) journey north from Khartoum.",
        "It took Aisha Ibrahim Dawood and her relatives five days in a rented car to get from Khartoum to the northern town of Wadi Halfa, where the women and children crammed into a back of a truck that brought them to a queue at the Egyptian border.\"There is a lot of bureaucracy (to get into Egypt). Our suffering is unprecedented. (But) we can withstand anything - the sounds of gunfire (in Khartoum), the heat of the crowded truck,\" she said.(Additional reporting by Nafisa Eltahir in Cairo, Emma Farge and Gabrielle Tétrault-Farber in Geneva, Duncan Miriri in Nairobi and Ayenat Mersie in Dollow, Somalia; writing by Angus McDowall and Mark Heinrich; editing by Edmund Blair, Nick Macfie, Andrew Cawthorne and Cynthia Osterman)"
    ]
}