{
    "articleURL": "/wires/ap/article-12043553/NJ-GOP-seeks-wind-projects-halt-whales-benefit.html",
    "content": [
        "ATLANTIC CITY, N.J. (AP) - Republican state lawmakers and other New Jersey opponents of offshore wind turbines called Wednesday for a 30- to 60-day moratorium on construction work at such sites to see if it would lead to a decrease in whale deaths.",
        "Four state senators hosted a online hearing about offshore wind energy generation and whale deaths, three weeks after the most recent East Coast whale death was reported and despite the assurances of most scientists and conservationists that there is no correlation.The two-hour hearing came a week after Democrats, who control the Legislature and the governorship, held a similar hearing and many of New Jersey's major environmental groups said the greatest danger to whales is climate change, not offshore wind generation.\"I've been labeled a climate change denier and a tin-foil hat wearer,\" said Jim Hutchinson, managing editor of The Fisherman, a widely read New Jersey publication. \"We're defamed, denied, discarded and disparaged at every step along the way.\"\"One thing our side of the aisle gets accused of is not following the science,\" said Republican state Sen. Michael Testa. \"So what is the harm of waiting 30 or 60 days?\"Since Dec. 1, 32 dead whales have washed ashore between Massachusetts and Florida, according to the National Oceanic and Atmospheric Administration. The most recent death came on April 9, when a fin whale washed up on a sandbar in Virginia, according to NOAA spokeswoman Allison Ferreira.",
        "New Jersey has aggressively approved and cleared the way for a nascent offshore wind energy industry, with three offshore wind projects already approved and more being sought.",
        "What began in January as a request by the environmental group Clean Ocean Action for the Biden Administration to temporarily halt offshore wind site preparation work while the deaths are investigated rapidly grew into a politically polarized divide.\"We´ve gone too far, too fast,\" Cindy Zipf, the group´s executive director, said of efforts to approve offshore wind in New Jersey. \"Over 2.2 million acres is being allocated to offshore wind and 10,000 miles of cables. We became alarmed that it was plausible that activity going on offshore had to do with the whale die-offs. We felt there was a reason for investigation.\"Most of the state's major environmental groups support the expansion of offshore wind energy generation and have declined to join Clean Ocean Action in its call for a moratorium.Numerous federal agencies, including the NOAA, the Bureau of Ocean Energy Management, the Marine Mammal Commission and the New Jersey Department of Environmental Protection, have said there is no evidence linking offshore wind prep with whale deaths.Many panelists and witnesses at Wednesday's online hearing accused the administrations of President Joe Biden and New Jersey Gov. Phil Murphy, both Democrats, of turning a blind eye to concerns about offshore wind in a rush to establish the industry.\"You can't find evidence if you don't look for it,\" said Trisha DeVoe, a conservation biologist who works with the Miss Belmar Whale Watching business.",
        "\"We're being told, `Just accept what we tell you,´\" added state Sen. Anthony Bucco.Meghan Lapp of the Rhode Island-based seafood company Seafreeze, said the turbines will interfere with the radar fishing vessels commonly use, preventing them from operating among the structures, and other panelists said insurers will not cover vessels if they do so.\"Offshore wind is the single greatest existential threat to commercial fishing in the United States right now,\" Lapp said.As Republicans were holding their forum, a group led by former Democratic state Senate President Steve Sweeney held an event touting the economic and employment potential of offshore wind.U.S. Rep. Frank Pallone Jr., who represents part of the Jersey Shore and who led last week's Democratic-led forum, said pausing offshore wind projects wouldn't prevent whale deaths.\"We know that the climate crisis is the biggest threat to marine mammals and their habitats,\" he said in a statement Wednesday. \"The food source whales depend on is moving closer to the busy shipping lanes near the Port of New York and New Jersey as ocean temperatures rise, leaving them vulnerable to vessel strikes and entanglements.\"___Follow Wayne Parry on Twitter at www.twitter.com/WayneParryAC"
    ]
}