{
    "articleURL": "/wires/ap/article-12039923/Around-world-regatta-runs-giant-seaweed-flotilla.html",
    "content": [
        "A 5,000-mile-long flotilla of seaweed stretching from Africa to the Gulf of Mexico is slowing the boats in the around-the-world Ocean Race as they make their way from Brazil to Newport, Rhode Island.",
        "The Great Atlantic Sargassum Belt is getting caught on the boats´ rudders, foils and keels, disrupting the finely tuned hydrodynamics the teams in the Ocean Race spend millions on so they can minimize drag and maximize speed. Sailors say they expect the giant patch to get thicker as they sail away from the doldrums off the South American coast on the 5,550-nautical-mile (6,387-mile, 10,279-kilometer) leg to New England.\"We´ve just started to enter some patches of it. It´s very challenging,\" Team Malizia skipper Will Harris said Tuesday on a Zoom call from the boat's cockpit. \"The wind is just building, the trade winds, and you need to reduce drag as much as possible. When you have seaweed on the rudder and the foils it makes it really hard to hit our performance targets.\"A leafy brown algae with air pockets that look like berries, sargassum floats in the open ocean and provides a breeding ground, food and habitat for fish, sea turtles and marine birds. When it comes ashore and decays, it is a foul-smelling annoyance for resorts and a nuisance for humans or animals that step in it.The Great Atlantic Sargassum Belt is not new, but satellite images captured in February showed an earlier start than usual; scientists estimate there´s more than 10 million metric tons of sargassum this year in the belt, which stretches from the Western tip of Africa past the northern coast of South America, and between Mexico's Yucatan Peninsula and Cuba up toward the Florida Keys and the Gulf Coast.",
        "\"It was unbelievable (when) we got to the equator,\" 11th Hour Racing skipper Charlie Enright said. \"The keel is a nightmare, and you just have to monitor your situation relative to your competitors.\"",
        "The seaweed isn´t the only problem the teams have encountered.The Swiss Holcim-PRB boat, the overall race leader, dismasted on Thursday night, four days after leaving Itajai, Brazil, for the start of Leg 4 to Newport. The crew turned the boat around, using a combination of motor power and a jury-rigged mainsail - laid horizontally - and headed for Rio de Janeiro, where it made plans to resume the race.Holcim-PRB will ship the boat to Newport, giving up the chance to earn points on the fourth leg in order to be ready for the start of Leg 5 on May 21. A replacement mast is already on its way from France.\"It was not really a decision; it was impossible\" to remain in the leg, skipper Kevin Escoffier said in a Zoom call from shore in Rio on Tuesday. \"I can´t do anything about the rest of Leg 4. The only thing I can put energy on and focus on is to be back in Leg 5. To start on May 21 and to sail the best I can on the legs following.\"",
        "The boats use a common design, and Harris said competitors are trying to avoid running into the same problem. \"We have the same bits of gear on the boat, so we´ll be taking it cautiously,\" he said.The four other boats crossed the equator on Monday on the way to Newport, the only U.S. stop on the seven-leg, 32,000 nautical mile around the world race that began in Spain on Jan. 15. They are expected to arrive in Newport, the hometown of the 11th Hour Racing team, on May 10 and finish in Genova, Italy, in early July.Holcim-PRB leads the overall standings with 19 points, followed by the German boat Team Malizia with 14 points, 11th Hour Racing with 13, Biotherm with 10 and GUYOT environnement - Team Europe with 2.11th Hour Racing leads the current leg, with Malizia close behind in second. Points are awarded for finishes in each leg as well as in-port racing during the stopovers.\"It's been back and forth the last couple of days,\" Enright said. \"It's just important to get the last one.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}