{
    "articleURL": "/wires/reuters/article-12051127/Spurs-captain-Lloris-ruled-season-says-Mason.html",
    "content": [
        "LONDON, May 5 (Reuters) - Tottenham Hotspur captain Hugo Lloris will miss the rest of the season due to a hip injury, interim boss Ryan Mason said on Friday as the club try to keep alive their hopes of playing in Europe next season.",
        "Lloris was withdrawn at halftime during Spurs' humiliating 6-1 Premier League defeat at Newcastle United last month after conceding five times in the opening 21 minutes, with Fraser Forster replacing him in goal.Lloris, who joined Tottenham in 2012, has played nearly 450 times for the club, and the 36-year-old Frenchman has one more year to run on his contract. But British media have reported that he could leave the club at the end of the campaign.\"Hugo is out for the season. We had the results back. Obviously disappointing but we feared that initially, so he won't play again for us this season,\" Mason told reporters ahead of Saturday's clash against Crystal Palace.\"I can't speak about next season but what I can say is he's got a very important role for us until the end of the season.\"He's our captain and we need him to be a big part of the group, and he will be.\"Spurs are in seventh spot, nine points behind fourth-placed Manchester United after picking up one point in their last four matches.When asked about the speculation over who the club's next permanent manager would be, Mason said: \"Naturally, when there is uncertainty, there are going to be names (mentioned). That is part of football.",
        "\"But none of my energy or attention is going into outside noise or speculation.\"Within these walls, we are together, we are working together and we have got a common goal, which is trying to get as many results as possible until the end of the season.\"Palace, who have been in fine form since Roy Hodgson's return as manager, winning four of their last six games.\"I will always have a soft spot for Roy because he gave me my England debut,\" Mason said.\"But, of course, we are playing Crystal Palace in a very good moment - probably their best moment this season.\"So we understand it is going to be a difficult match but we are confident that in our stadium, in front of our fans, we can get a good result.\"Mason said Ryan Sessegnon will miss the rest of the campaign but right back Emerson Royal could return while it was \"too early to set a return date\" for midfielder Rodrigo Bentancur. (Reporting by Pearl Josephine Nazare in Bengaluru; Editing by Ken Ferris)"
    ]
}