{
    "articleURL": "/sport/football/article-12060811/Vinicius-Junior-reveals-uses-hyperbaric-chamber-prevent-injury-speed-recovery.html",
    "content": [
        "Vinicius Junior's post match routine includes use of a hyperbaric chamber The Brazilian spends up to 90 minutes in his own personal pod after matches We want REVENGE! Rodri insists Man City have a score to settle with Los BlancosReal Madrid danger-man Vinicius Jr will be in peak physical condition for Tuesday night’s blockbuster clash with Manchester City - thanks in so small part to his hyperbaric chamber.",
        "The Brazilian, pictured earlier this week, spends up to 90 minutes in his personal treatment pod after a match or training to speed up recovery and prevent injury.Hyperbaric chambers - which cost as much as £100,000 - increase air pressure inside the device, forcing the user’s lungs to collect up to 15 times more oxygen.Former Real Madrid captains Raul and Sergio Ramos both pioneered their use in Spain and the recovery technique is now popular with marathon runners, Padel players and many professional footballers.The Spanish giants set to defend their Champions League crown against a rampant Manchester City side, who are setting their sights on an historic treble. ",
        "Carlo Ancelotti's side warmed-up for the semi-final first leg clash at the Bernabeu with a 2-1 win over Osasuna in the Copa del Rey final,  with Vinicius playing a key role in the victory. The 22-year-old set-up two goals for Brazilian teammate Rodrygo, as Real celebrated their cup triumph - something they hope to repeat with another European Cup win in Istanbul next month. Real's packed schedule is in part why Vinicius has taken to using a hyperbaric chamber in preparation for the huge upcoming Champions League meetings with Premier League leaders Manchester City. Vinicius is on course for his best goal-scoring season yet, having already matched the 22 he scored last campaign - including the winner in the Champions League final against Liverpool."
    ]
}