{
    "articleURL": "/wires/ap/article-12046869/Shelling-Sudanese-capital-disrupts-aid-delivery-efforts.html",
    "content": [
        "CAIRO (AP) - Heavy shelling in the Sudanese capital of Khartoum on Thursday disrupted efforts to deliver badly needed aid to trapped civilians, after yet another fragile and frequently violated truce ran out, residents said.",
        "Sudan has plunged into chaos since fighting erupted in mid-April between the country´s two rival top generals. There is increasing concern for those trapped and displaced by the fighting, and aid workers and civilians have said there's a dire lack of basic services, medical care, food and water.In central areas of Khartoum, sporadic explosions could be heard Thursday, a day after the United Nations warned that the Sudanese people are \"facing a humanitarian catastrophe,\" and after the latest in a series of cease-fires expired earlier in the day.\"The situation is very dire,\" said Atiya Abdalla Atiya, who leads a key doctors union. \"All forms of shelling can still be heard in Khartoum, whether air or artillery shelling.\"Black plumes of smoke rising from downtown neighborhoods dotted Khartoum's skyline at midday. The fighting also raised questions about the viability of internationally backed initiatives seeking to bring an end to the violence that upended the African country's transition to democracy.The conflict started on April 15, preceded by months of escalating tensions between the military, led by Gen. Abdel-Fattah Burhan, and a rival paramilitary group called the Rapid Support Forces, or RSF, commanded by Gen. Mohamed Hamdan Dagalo.",
        "The fighting turned urban areas into battlefields and foreign governments rushed to evacuate their diplomats and thousands of foreign nationals out of Sudan.",
        "Both sides have traded accusations of truce violations over the past weeks. On Thursday, each side claimed its forces were the subject of attacks. The military said late Wednesday it clashed with RSF forces around key government institutions in Khartoum, including the Republican Palace in the capital's center.Cease-fire initiatives by the United States, Saudi Arabia and the East African bloc known as IGAD have all floated a path towards longer negotiations. But the warring sides have shown little commitment to even short-term promises to stop the fighting.The doctors´ group has in recent days warned that at least 60%, of hospitals located near areas of active fighting are out of service, either because they have been shelled or due to the shortage of medical personnel and supplies.Among those in a critical, life-threatening situation are some 12,000 patients with kidney failure with no access to dialysis facilities. \"People suffering from chronic diseases are dying at home because functioning hospitals are only attending to the wounded,\" said Atiya, of the Sudanese Doctors' Syndicate.The head of the U.N. children's agency, Catherine Russell, said from Kenya on Thursday that \"Sudan is teetering toward catastrophe\" and warned that children are increasingly caught in the crossfire.\"While we are unable to confirm estimates due to the intensity of the violence, UNICEF has received reports that 190 children have been killed and another 1,700 injured in Sudan since conflict erupted almost three weeks ago,\" she said.",
        "\"For the sake of Sudan´s children, the violence must stop,\" Russell added.Kuwait's government announced Thursday that it will be dispatching flights carrying medical and humanitarian supplies to the city of Port Sudan, on Sudan's Red Sea coast, the Gulf Arab country´s state-run news agency KUNA said. Sudan's state news agency reported that the first Kuwaiti plane carrying medical supplies and food aid arrived on Thursday afternoon.The flights are meant to deliver at least 75 tons of humanitarian assistance to the Sudanese heath authorities and the Sudanese Red Crescent.However, the lawlessness brought on by the violence has also thwarted aid distribution across Sudan, with looting and attacks on aid and medical facilities posing major setbacks.A coordinator for the U.N.'s refugee agency in the Darfur region, Toby Howard, said the organization's facilities in the areas of Nyala, South Darfur, El Geneina and West Darfur had been looted.Asked about who was doing the looting, Howard said it was common in the restive region even before the violence of the past two weeks.\"I would put it down to basically uncontrolled militias, bandits, criminals. Some of them are loosely affiliated with one of the two sides in the conflict,\" he said during a virtual news conference Wednesday from Kenya, where he relocated after his evacuation from Darfur.",
        "Port Sudan, the country's main seaport, experienced relative calm amid chaos elsewhere in Sudan and became a hub for tens of thousands of people looking to flee the fighting - and has now become the entry point for an international effort to get aid supplies into the country.The conflict has so far killed at least 550 people, including civilians, and wounded more than 4,900. The Sudanese Doctors´ Syndicate, which tracks only civilian casualties, said Thursday that 457 civilians have been killed in the violence, and more than 2,300 have been wounded.At least 334,000 people have been displaced inside Sudan, and tens of thousands more to neighboring countries - Egypt, Chad, South Sudan, the Central African Republic and Ethiopia, according to U.N. agencies.Thousands have funneled through crowded, desert crossing points between Egypt and Sudan in recent days, with many calling for aid groups to do more to provide the waiting crowds with basic assistance.On Thursday, the World Health Organization said its workers were on the ground at the Egyptian-Sudanese border crossing of Arqin to help meet urgent medical needs for the first time since the influx of people started.The U.N. refugee agency said that more than 50,000 people had crossed into Egypt alone, including 47,000 Sudanese and 3,500 third-country nationals, by Wednesday.",
        "The U.S. State Department said Thursday it has \"successfully completed\" the evacuation of more than 2,000 people from Sudan following the initial evacuation of U.S. Embassy diplomats and staff.Of all the evacuated, roughly 1,300 are American citizens, green card holders, Sudanese working for the embassy or nationals of U.S. partners and allies, deputy department spokesman Vedant Patel told reporters.___Associated Press writers Edith M. Lederer at the United Nations and Matthew Lee in Washington contributed to this report."
    ]
}