{
    "articleURL": "/sport/football/article-12059019/PSG-make-Bernardo-Silva-priority-signing-summer-unite-Luis-Campos.html",
    "content": [
        "Campos is pushing for PSG to move for Silva, who he signed for Monaco in 2014Silva is thought to be the 'priority signing' for the Ligue 1 side this summerEx-team-mate Kylian Mbappe is also said to be urging PSG to seal the dealParis Saint-Germain will reportedly make Manchester City midfielder Bernardo Silva their 'priority signing' in the summer transfer window.",
        "As reported by French news outlet Le10sport, transfer chief Luis Campos is working on signings for the summer and Silva tops the list for PSG.Campos, who brought Silva to the French League with Monaco back in 2014, wants to be re-united with the Portugal international this summer in Paris, the report claims.The pair are believed to share a strong bond but perhaps more importantly, Silva also has a close relationship with former Monaco team-mate and current PSG star Kylian Mbappe.Mbappe and Campos have reportedly been working on the arrival of Silva in Paris for almost a year and a deal could happen for the Man City star as soon as this summer.",
        "A deal was in the works last year, but Man City 'vetoed' his departure despite Silva's clear indication that he wanted to leave the club.PSG were said to be an option, but a move never materialised, and now Mbappe is 'more driven than ever' to re-unite with Silva, the report adds.In order to satisfy their star striker, PSG are working on the move and 'have officially opened the Bernardo Silva file'. Steps have been taken to make their intentions known to Silva, but it is unclear as to whether these approaches have been made to Man City or the player's agent.",
        "The midfielder is said to be attracted to 'the sporting challenge offered by PSG' as Mbappe is leading the pursuit for his friend.Silva and Mbappe lifted the Ligue 1 title together at AS Monaco before going their separate ways, signing for Man City and PSG.Barcelona have previously been linked with Silva but their current financial situation 'will not allow' a move to happen in this summer.With his contract expiring in 2025, Man City could take advantage of any offer from PSG during the summer transfer window and look to cash in on the 28-year-old while they can demand a high fee. "
    ]
}