{
    "articleURL": "/wires/ap/article-12040093/AUTO-RACING-NASCAR-heads-Kansas-Formula-One-Miami.html",
    "content": [
        "All Times Eastern",
        "NASCAR CUP SERIESAdventHealth 400Site: Kansas City, Kansas.Schedule: Saturday, practice, 5:05 p.m., and qualifying, 5:50 p.m.; Sunday, race, 3 p.m. (FS1).Track: Kansas Speedway.",
        "Race distance: 267 laps, 400 miles.Last year: Chase Elliott won after starting fourth.Last race: 2017 series champion Martin Truex Jr. of Joe Gibbs Racing ended a 54-race winless drought and won at Dover for the third time in his career.Fast facts: Truex became the third different Toyota driver to win. Chevrolet has won seven times and Ford once. ... Truex climbed to fourth in points, 40 behind new leader Ross Chastain. Christopher Bell is three back and Kevin Harvick is 38 behind. ... Bell still leads with eight top-10 finishes, two more than Ryan Blaney (fifth in points) and 100 more than Alex Bowman (15th). ... Bell leads in top-fives with five through 11 races. ... There are three two-time winners, and the highest in the points is Kyle Busch in eighth. He and fellow two-time winner William Byron have only been running at the finish in nine of 11 races.Next race: May 14, Darlington, South Carolina.Online: http://www.nascar.comNASCAR XFINITY SERIESLast race: Ryan Truex dominated at Dover, winning the first two stages, leading 124 of the 200 laps and claiming his first series victory by nearly 5 seconds.",
        "Next race: May 13, Darlington, South Carolina.Online: http://www.nascar.comNASCAR TRUCK SERIESHeart of America 200Site: Kansas City, Kansas.Schedule: Saturday, practice, 12:05 p.m., qualifying, 12:35 p.m., and race, 8 p.m. (FS1).Track: Kansas Speedway.Race distance: 134 laps, 201 miles.Last year: Eventual champion Zane Smith won after starting fourth.Last race: Corey Heim won at Martinsville on April 14.Fast facts: Three-time winner Austin Hill remans the points leader by four over John Hunter Nemechek and 38 over Chandler Smith. ... Hill has won a series-high three races.Next race: May 27, Concord, North Carolina.Online: http://www.nascar.comFORMULA ONECrypto.com Miami Grand PrixSite: Miami Gardens, Florida.Schedule: Friday, practice, 2 p.m. and 4:30 p.m.; Saturday, practice, 12:30 p.m. and qualifying, 4 p.m.; Sunday, race, 3:30 p.m. (ESPN).Track: Miami International Autodrome at Hard Rock Stadium.Race distance: 57 laps, 191.584 miles.Last year: Max Verstappen won after starting third.Last race: Sergio Perez kept the Red Bull team 4-for-4 in race wins this season.Fast facts: Verstappen leads teammate Perez by just eight points in the standings. Both have won twice through four races. ... Fernando Alonso is third, followed by seven-time champion Lewis Hamilton.Next race: May 21, Imola, Italy.Online: http://www.formula1.comINDYCARLast race: Scott McLaughlin surged past Romain Grosjean, took advantage of it and was scarcely challenged the rest of the way to his fourth IndyCar win in Alabama.",
        "Next race: May 13, Indianapolis.Online: https://www.indycar.comNHRALast events: Antron Brown won in Top Fuel and Matt Hagan won in Funny Car in Las Vegas.Next events: May 21, Ellwood, Illinois.Online: http://www.nhra.comWORLD OF OUTLAWSNext Events: May 5-6, Rossburg, Ohio.Online: http://worldofoutlaws.com/sprintcars___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}