{
    "articleURL": "/wires/reuters/article-12043455/U-S-climate-envoy-Kerry-says-China-invited-talks.html",
    "content": [
        "By Alexander Ratz, Sarah Marsh and Valerie Volcovici",
        "BERLIN, May 3 (Reuters) - U.S. climate envoy John Kerry said on Wednesday China has invited him to visit \"in the near term\" for talks on averting a global climate change crisis even as diplomatic relations between the world's two biggest greenhouse gas emitters remain tense.The United States and China must work together to address climate change, Kerry said in an interview with Reuters on the sidelines of a conference on global warming in Berlin.U.S. President Joe Biden has authorized the meeting but the timing remains to be determined and certain issues must still be clarified, Kerry said. China, for example, first must issue its plan to reduce methane emissions and advance in the transition away from coal, Kerry added.\"This has to be cooperative, notwithstanding other differences that do exist,\" said Kerry, a former U.S. secretary of state. \"This is not a bilateral issue. This is a universal global threat to everybody in every nation.\"Referring to the United States and China, Kerry added, \"The two biggest economies, biggest contributors to that problem need to be able to come together and work to try to help resolve it.\"Kerry said the United States may be able to help China on its methane strategy, a policy that Beijing was due to have announced last year but did not.",
        "China last year briefly suspended talks with the United States on climate, security and other areas in response to a visit to Taiwan by U.S. House of Representatives then-Speaker Nancy Pelosi.Although China subsequently resumed those talks, relations between the two countries deteriorated again after what the United States described as a Chinese spy balloon traversed American airspace in February, prompting Secretary of State Antony Blinken to postpone a scheduled visit to Beijing.The State Department since then has expressed a desire to reschedule Blinken's visit, though no date has been set. Blinken said on Wednesday he hopes to be able to reschedule it for sometime this year.Kerry said he held a virtual conversation with his Chinese counterpart Xie Zhenhua \"just a week or two ago.\"\"China has invited me to visit in the near term to be able to meet with him (Xie) to be able to work on work that we've been doing for several years, which is trying to find the pathway forward to be able to cooperate in ways that are beneficial to the world. And hopefully, we'll be able to do that,\" Kerry said.Kerry said he also briefly spoke with the Chinese representative attending the Petersberg Climate Dialogue in Berlin hosted by the German foreign ministry.",
        "Asked if China offered a constructive approach, Kerry called it too early to tell.\"I have to get into the meeting, I have to figure out exactly where we are,\" Kerry said.\"We're not pointing fingers and we're not out there trying to, you know, make this part of the other issues that are out there\" between the United States and China, Kerry added. \"This (climate change) is a free-standing issue which affects China as it affects the United States.\"OVERSHOOTING TEMPERATURE TARGET WOULD BE 'FRIGHTENING'China did not appear to have \"fully embraced\" the global goal agreed at a U.N. summit in France in 2015 of limiting global warming to 1.5 degrees Celsius (2.7 degrees Fahrenheit), Kerry said.\"It has embraced the U.N. Paris terminology, which is ... well below 2 degrees, and leaves up for grabs what that might mean,\" Kerry said of China. \"To me, there is certainly no way that 'well below 2' is 1.9 or 1.8 or 1.7.\"Kerry said the ability to actually achieve that target, however, was \"on the borderline right now.\"\"Some scientists would tell you we've already blown past it. Others will suggest ... we may shoot past it, but come back to it because of the technologies and other capacities we have to deploy clean energy,\" Kerry said.",
        "Overshooting is a \"frightening prospect,\" Kerry said, given the irreversible effects of passing a tipping point, like the melting of polar ice caps.As such, the next global climate conference, COP28, scheduled for Nov. 30 to Dec. 10 in the United Arab Emirates, is \"critical\" and the most important since 2015, Kerry said.The COP28 president Sultan al-Jaber has faced criticism for also being the head of the UAE's state oil giant, but Kerry said the COP offers \"an opportunity for us to bring people to the table who haven't been part of the process.\"Kerry said he supports Germany's proposal at the Petersberg Climate Dialogue to set a goal at COP28 to triple renewable energy by 2030, noting Europe's largest economy was a trend-setter in this regard. (Reporting by Alexander Ratz, Sarah Marsh and Valerie Volcovici; Additional Reporting by Michael Martina and Kate Abnett; Editing by Will Dunham)"
    ]
}