{
    "articleURL": "/news/article-12057783/Budget-2023-Albanese-raises-Centrelink-single-parenting-payment-age-cut-8-14.html",
    "content": [
        "Single parents to receive government support longerRead more about Tuesday's Budget Prime Minister Anthony Albanese has confirmed he will raise the age for the single parenting payment in the 2023 Federal Budget.",
        "Single parents will now be entitled to financial support on the Parenting Payment (Single) until their child is 14 in a commitment worth $1.9 billion.The decision has been widely tipped in the past few weeks and described as an opportunity for Mr Albanese to make up for a Gillard government move, which pushed single parents off the payment when their child turned eight. The PM has admitted that 'the sole parent payment is an area where we made a mistake'. ",
        "Mr Albanese said: 'Many single parents - overwhelmingly women - face difficulty balancing caring responsibilities and work. 'Those difficulties do not end when their child turns eight.' The updated plan will come into effect from September 20 of this year.Under the new policy, single parents who are currently on JobSeeker will receive an additional $176.90 per fortnight. In total, some 57,000 single parents (90 per cent of whom are women) will benefit. The payment is $922.10 per fortnight.",
        "'By age 14, children have typically settled into high school and need less parental supervision, and single parents are in a much stronger position to take on paid work,' Mr Albanese said. Historically, the single parents payment was for singles with children aged up to 16.But former prime minister John Howard, supported later by Julia Gillard, slashed the age to eight in an attempt to encourage parents back into the workforce. ",
        "Two advisory bodies urged the government to extend the payment and the eligibility criteria.It is understood mutual obligation requirements will still remain in place to continue to encourage parents to return to the workforce. The PM spoke about the decision on Nova radio in Perth on Monday morning, saying he knew 'firsthand what it's like to grow up with a single mum doing it tough'.'We want to look after single parents because we know that the role that they play in raising their children is such a priority for them and they’re deserving of more support,' he said.To read more about what to expect in Tuesday's Budget, click here."
    ]
}