{
    "articleURL": "/news/article-12053403/Denver-councilwoman-calling-white-businesses-taxed-pay-reparations-black-businesses.html",
    "content": [
        "Candi CdeBaca, a 37-year-old Democratic Socialist, on Thursday said she supported higher taxation for white business owners in DenverSpeaking at a forum of the Greater Metro Denver Ministerial Alliance, CdeBaca said the taxation was a form of reparation payable to black business ownersCritics pointed out that her suggestion would face constitutional and legal challenges A Denver councilwoman has sparked fierce debate after suggesting that white-owned businesses pay additional tax, which would be given in reparations to the owners of minority-owned businesses.",
        "Candi CdeBaca, a 37-year-old Democratic Socialist, told a business forum in Denver on Thursday that more needed to be done to provide reparations.'Capitalism was built on stolen land, stolen labors, and stolen resources,' said CdeBaca, speaking at a forum at the Greater Metro Denver Ministerial Alliance.She said business improvement districts could levy the racial tax.'You could be collecting those extra taxes from white-led business all over the city and redistributing them to black and brown-owned businesses,' she said.",
        "Critics seized on her plan, and pointed out that the plan would be illegal under federal and state law.CdeBaca's office said she was being 'targeted by a white nationalist mob'.The councilwoman said: 'I will not be silenced by the far-right playbook.'A nuanced discussion about reparations is necessary, but that opportunity has been taken from us by the right-wing outrage machine.'This kind of discussion is not going to happen in this media landscape.'Questioned by 9News about the plan, CdeBaca said the constitutionality of a race-based tax is 'not a factor' because the taxes from a business improvement district are 'voluntary.'A spokesman for Denver's Department of Finance said that was untrue.CdeBaca said that San Francisco's Legacy Business Program, which aims to help long-standing small businesses in rapidly gentrifying neighborhoods, was a 'similarly aimed' system - but the San Francisco plan does not consider the race of the business owners.",
        "CdeBaca's remarks came as communities across the country are wrestling with the idea of reparations - most notably in California.",
        "In San Francisco, a panel called The African American Reparations Advisory Committee has spent two years working on a proposal for the city.Their suggestions - 111 in total - include a $5 million lump sum given to every eligible black person; a $1 house; and a $97,000-a-year guaranteed income for 250 years.The city's board of supervisors will not decide on whether or not to adopt the recommendations until later this year, once the AARAC has submitted a final report.Another meeting has been scheduled for September.The state of California has formed its own taskforce, which has until July 1 to provide their complete set of recommendations.Before Christmas, St. Louis announced they were creating a commission to consider paying reparations to descendants of the victims of racist policies - raising interesting challenges in a struggling city of 300,000 where 45 percent of residents are black.Democrat mayor of St. Louis Tishaura Jones signed an executive order to create a nine-member volunteer commission to explore and recommend reparations - following a lead set by cities in Illinois, California and Rhode Island .'The people closest to the problems are closest to the solution,' said Jones.",
        "'I look forward to reviewing this commission's work to chart a course that restores the vitality of black communities in our city after decades of disinvestment. We cannot succeed as a city if one half is allowed to fail.'"
    ]
}