{
    "articleURL": "/wires/ap/article-12043873/Mississippi-governor-touts-tax-cuts-teacher-pay-raise-jobs.html",
    "content": [
        "RICHLAND, Miss. (AP) - Mississippi Gov. Tate Reeves told supporters at one of his first large-scale campaign events Wednesday that he has fulfilled promises to cut taxes, increase teacher pay and promote job development.",
        "The Republican said Mississippi, with 3 million residents, is competing against larger states partly because he did not impose heavy restrictions on businesses during the COVID-19 pandemic.\"I have a message to those governors in New York and California and Illinois,\" Reeves said, mentioning three states led by Democrats. \"Mississippi is coming to take your jobs. And we have no intention of ever giving them back.\"His remark drew cheers from more than 200 supporters at a construction equipment dealership in the Jackson suburb of Richland. Reeves held a smaller campaign event Tuesday on the Gulf Coast, where he had a strong showing in the 2019 election.Reeves, 48, is seeking a second term as governor. He previously served two terms as lieutenant governor and two as state treasurer. Early in his career, he was a financial portfolio manager.During the event Wednesday, Reeves ignored his two challengers in the Aug. 8 Republican primary, neither of whom has held public office. David Grady Hardigree once managed a computer repair business, and Dr. John Witcher founded a group of fellow physicians opposed to COVID-19 vaccine mandates. Reeves signed a law in 2022 saying state and local government agencies cannot withhold services or refuse jobs to people who choose not to get vaccinated against COVID-19.",
        "Reeves focused criticism Wednesday on Brandon Presley, the Democrat who will be on the ballot for governor in the Nov. 7 general election. Presley, 45, is finishing his fourth term as the elected public service commissioner for northern Mississippi. He previously served as mayor of Nettleton.\"We are not up against a local yokel, Mississippi Democrat,\" Reeves said. \"We are up against a national liberal machine. They are extreme. They are radical and vicious.\"Presley issued a statement Wednesday that criticized Reeves for taking part in fitness classes led by Paul Lacoste, a trainer who is among more than three dozen people or businesses being sued by the Mississippi Department of Human Services. The lawsuit, filed last year, seeks to recover welfare money that was misspent before Reeves became governor.\"Mississippians are fed up with Tate Reeves helping to funnel millions of dollars meant for working families to his celebrity friends and personal trainer while watching their rural hospitals on the brink of closure and feeling the squeeze from rising costs,\" Presley said.Mississippi, Louisiana and Kentucky have the only gubernatorial races in the U.S. this year.Democrats last elected a Mississippi governor in 1999. Republicans hold all statewide offices and supermajorities in the state House and Senate.Reeves started this year with nearly $2 million in one campaign fund and $5.9 million in another, according to records filed with the secretary of state's office.",
        "Presley started the year with $723,802, and his campaign announced Wednesday that he raised $1.35 million from January through April.An independent candidate, Gwendolyn Gray, will be on the general election ballot. Gray has worked for a state agriculture extension service and a community action agency. She has not filed a campaign finance report."
    ]
}