{
    "articleURL": "/femail/article-12056175/Dara-Huang-mother-Princess-Beatrices-stepson-shows-slender-legs-New-York.html",
    "content": [
        "Dara, 40, looked stunning as she walked along a street in the big appleREAD MORE: Princess Beatrice wears ornate £37,000 earrings for Coronation Dara Huang, the mother of Princess Beatrice's stepson Wolfie, has shown off her slender legs in a stylish black outfit as stepped out in New York.",
        "Edoardo Mapelli Mozzi's ex, 40, looked stunning as she walked along a street in the Big Apple, sporting stylish black shorts which she paired with a onyx belt with a gold metal buckle.The shorts showed off her slender figure and envious legs. She went for a dark wardrobe, sporting all black.Dara, who shares seven-year-old son Wolfie with Edo, paired her shorts with a long sleeved turtleneck top and black leather over-the-knee heeled boots, which tie up at the back. The Mail on Sunday has previously reported the mother-of-one follows a strict 'no carb' diet to maintain her slender frame.",
        "The interior designer and business owner also carried a grey Hermès Evelyne bag, which she wore over her shoulder as she texted on her phone while walking down the street.Dara is the ex-fiancé of Princess Beatrice's husband, Edoardo Mapelli Mozzi.The pair share a son together, Christopher (also known as Wolfie), who made his debut at the Christmas service in Sandringham last year.While Dara stepped out in the East-coast city, Edoardo and Princess Beatrice are busy carrying out royal duties as part of King Charles's Coronation.The Princess wore a hot pink gown from Beulah, costing £695. The belted ensemble accentuated her figure for an elegant and stylish display.Princess Beatrice also donned Garrard's pricey Blaze Pink Sapphire, Rubellite and Pink Opal Hoop Earrings - which retail for £37,000. ",
        "Edoardo, 39, sported a smart black suit, and black patterned tie. The royal pair entered the Abbey with Princess Eugenie, her husband Jack Brooksbank and Prince Harry. However, seven-year-old Wolfie did not attend the Coronation of King Charles and Queen Camilla. The highly accomplished U.S-born architect has an undergraduate degree from the University of Florida and transferred to Harvard  for her Masters in Architecture. Dara runs Design Haus Liberty, and also founded Vivahouse, which converts disused commercial properties into co-living spaces.   ",
        "After graduating from Harvard with a MA in Architecture, Dara  went on to work at architectural firms across Europe, including Herzog de Meuron in Switzerland and Foster + Partners in London.  She's worked on impressive projects such as the Tate Modern Museum in London, the Tribeca skyscraper, and 56 Leonard Street in New York. When Princess Beatrice and Edo announced their engagement, Dara told MailOnline: 'I wish the best for Edo and Beatrice and look forward to uniting our families.'In January 2020, a friend of the former couple told the Mail On Sunday they remain close, and that Dara still cuts Edo's hair and occasionally buys him clothes.Beatrice has reportedly welcomed Dara into her life, adopting a stepmother role to Wolfie.Despite spending much of the year travelling the world for her business, Dara has spent the past few years in west London."
    ]
}