{
    "articleURL": "/wires/ap/article-12045057/Taiwan-trade-chief-warns-against-unnecessary-fear-China.html",
    "content": [
        "WASHINGTON (AP) - Taiwan's chief trade representative says his country's semiconductor makers will expand production in the U.S. as much as they can afford to do so, but he insists Taiwan remains an ideal place for that production and other U.S. trade, business and investment, despite tensions with China.",
        "John Chen-Chung Deng spoke to The Associated Press on a visit this week to Washington, where he is leading a Taiwanese trade delegation and meeting with U.S. trade officials.Deng's visit comes at a time of intensifying efforts to harden the U.S. and Taiwanese militaries and economies against any threat from rival China. As part of this, President Joe Biden and Congress are moving to boost semiconductor production on U.S. soil in the event of any conflict disrupting exports from Asia, especially from Taiwan.Semiconductors make electronics ranging from phones to electric cars to advanced weapons run, and Taiwan produces more than 90% of the world's more advanced semiconductors.At the same time, Pentagon leaders have been touring the Indo-Pacific to rally regional allies in bolstering military defenses and deterrence. A House committee last month war-gamed a hypothetical attack by China on Taiwan and U.S. positions as part of a bipartisan congressional effort to find specific ways to boost deterrence.Deng said Americans should see these efforts as ensuring that Chinese President Xi Jinping will never feel confident enough to invade Taiwan, which China claims as its own.",
        "\"We should avoid any exaggeration or rhetoric which doesn´t reflect the true situation, that creates fear ... unnecessary fear,\" said Deng.He said the U.S. business community in Taiwan assures him it is still expanding and hiring. He cited the experienced workforce and support industries that Taiwan offers for semiconductor producers and for Google, Amazon and other U.S. businesses on its soil.",
        "Relations between the U.S. and China have hit dramatic peaks in tensions over the past two years as Xi's government asserts China's growing strength economically, diplomatically and militarily. That includes China underscoring its broad territorial claims in the region.China, for its part, accuses the U.S. of meddling in its internal affairs and pursuing a containment strategy against China to prevent its rise.Taiwan and China split in 1949 after a civil war and have no official relations. They are linked by billions of dollars in trade and investment. The Chinese Communist Party regularly flies fighter planes and bombers near Taiwan to enforce its stance that the island is obliged to unite with the mainland, by force if necessary.The Biden administration and Republicans and Democrats in Congress broadly support strengthening the U.S. and Taiwanese positions in the region to discourage any Chinese invasion of the island.For Taiwan, that swell in U.S. support overall has also brought renewed focus from Washington on the island's decades-old appeals to the U.S. to overhaul its tax and trade policies toward the island. Taiwanese leaders say the current U.S. policies make it hard for Taiwanese companies and workers operating in the United States, and could do more to help Taiwan strengthen trade relations with allies.",
        "The U.S. switched its diplomatic relations from Taipei to Beijing in 1979. Without formal relations and the kind of a tax treaty that the U.S. has signed with friendly nations that it recognizes, Taiwanese workers in the U.S. have to pay taxes in both the U.S. and Taiwan. That makes the already more-expensive U.S. prohibitively expensive for many Taiwanese.Treasury Secretary Janet Yellen in March called it an issue the U.S. needed to address. On Thursday, four senior members of the Senate Foreign Relations Committee - Democrats Bob Menendez, the chairman, and Chris Van Hollen, and Republicans Jim Risch and Mitt Romney - introd.uced legislation authorizing negotiation of a U.S.-Taiwan tax agreement.Meanwhile, the Biden administration is promising tens of billions of dollars to support construction of U.S. chip foundries and reduce reliance on suppliers in Taiwan and elsewhere in Asia, which Washington sees as a security weakness.Answering that U.S. call, Taiwanese chip giant Taiwan Semiconductor Manufacturing Corp. is building a chip plant in Arizona and plans a second, for a total investment of $40 billion.Deng said he hopes for resolution of the tax issue before that first Taiwanese plant starts operation in Arizona, given the double-tax burden the operation will face.\"Once they start to produce, this is a real problem,\" the trade official said.",
        "Taiwanese officials also hope in coming weeks to close an initial trade agreement with Washington, in a nod toward the free-trade pacts the U.S. has negotiated with South Korea and other allies.U.S. worries about angering China have helped keep Washington from signing a free-trade pact with Taiwan in the past. Deng argued the hoped-for U.S. trade agreement would boost the confidence of Taiwan and encourage other allies to increase trade with Taiwan as well.That would help Taiwan lessen its economic dependence on trade with China, now the customer for 35% to 40% of Taiwan's products, Deng said.He said Taiwan also sees the strategic point in Biden administration measures aimed at discouraging other countries from exporting semiconductors to China, to starve China's security forces of the advanced chips they need.Integrated circuits alone account for about 25% of Taiwan's GDP. When it comes to China's share of that, however, Taiwan \"realizes there's no sense in sending chips to them, to build up missiles aiming at us,\" Deng said."
    ]
}