{
    "articleURL": "/wires/ap/article-12048515/N-Carolina-legislature-approves-abortion-rules-veto-ahead.html",
    "content": [
        "RALEIGH, N.C. (AP) - North Carolina lawmakers on Thursday approved and sent to the governor a ban on nearly all abortions after 12 weeks of pregnancy, down from the current 20 weeks, in response to last year´s overturning of Roe v. Wade at the U.S. Supreme Court.",
        "The ban is one of the least onerous of a slew of bills Republican-led assemblies have pushed through in recent months since the high court stripped away constitutional protections for abortion. Other states have banned the procedure almost completely or throughout pregnancy.Nonetheless, the 29-20 party-line vote by the Senate was met with loud cries of \"Abortion rights now!\" from about 100 observers who had crowded into the gallery to watch the debate. Police quickly cleared the area, but protesters could still be heard shouting \"Shame!\" from outside the closed doors. The House passed the measure Wednesday night on a similar party-line vote.While perhaps less stringent, North Carolina's bill has far-reaching consequences. Before its passage, many women from nearby states with more restrictive laws had traveled to the state for abortions in later stages of pregnancy.Abortion-rights supporter Democratic Gov. Roy Cooper has pledged to veto the bill, calling it \"an egregious, unacceptable attack on the women of our state. While GOP seat margins and assurances from chamber leaders indicate a veto will likely be overridden, Republicans appear for now to have little wiggle room with votes for the bill to become law.Democrats unsuccessfully attempted several parliamentary maneuvers to get the measure sent back to committee during an hourslong debate. Senate Minority Leader Dan Blue of Wake County said it was unprecedented that all 20 members of the chamber´s Democratic caucus spoke on the floor about the bill. He called the abortion vote \"one of the most consequential things we have done in this chamber.\"",
        "State law currently bans nearly all abortions after 20 weeks of pregnancy. Starting July 1, the restriction would be tightened to 12 weeks. It also would place limits on new exceptions, capping abortions at 20 weeks in cases of rape or incest and 24 weeks for \"life-limiting\" fetal anomalies, including certain physical or genetic disorders that can be diagnosed prenatally. An existing exception for when the life of the pregnant woman is in danger would remain.The 46-page bill, which was revealed just this week after months of private negotiations by Republican legislators, also includes more medical and paperwork requirements for patients and physicians and licensing requirements for abortion clinics.GOP lawmakers also are promoting at least $160 million for such services as maternal health, adoption care, contraceptive services and paid leave for teachers and state employees after the birth of a child.Sen. Joyce Krawiec, a Forsyth County Republican who helped negotiate the measure, said during Thursday's debate that \"many of us who have worked for decades to save unborn babies for the sanctity of human life, we saw it as an opportunity to put forth a very pro-life, pro-woman legislation.\"\"This is a pro-life plan, not an abortion ban,\" she added.Cooper and other critics say the measure remains an attack on reproductive freedoms and denies women the ability to make their own health care choices.",
        "\"This bill is an extreme and oppressive step backwards for our society and one that will deny women the right to make decisions about their own health care and future,\" Democratic Sen. Sydney Batch of Wake County said during the debate.Batch and others also pointed to provisions of the bill that would make it harder to get abortions within the new legal time frame. They cite, for example, the requirement for women to make an in-person visit to a medical professional at least 72 hours beforehand. Under current law, the three-day waiting period can be initiated over the phone. The bill would also require a doctor to schedule a follow-up visit for women who have a medically induced abortion, increasing the hardship for some who work and those who travel to North Carolina from out of state.Republicans have been more aggressive in advancing measures that Cooper has opposed or previously vetoed following GOP seat gains in the November elections. The party gained veto-proof majorities in both chambers last month, when then-Democratic Rep. Tricia Cotham switched to the Republican Party. Cotham, who had spoken out previously for abortion rights but expressed a willingness to consider additional restrictions, voted for the bill Wednesday.In a video released late Thursday, Cooper identified Cotham and three other Republican legislators that he said had expressed temperate views on abortion and said viewers should urge them to uphold his upcoming veto. One of the four was absent for Wednesday's House vote.",
        "The measure contains other restrictions that Cooper had successfully vetoed in previous years. One would bar women from getting abortions on the basis of the baby's race or a prenatal diagnosis of Down syndrome. Another would require doctors and nurses to protect and care for children born alive during a failed abortion later in pregnancy.Still, North Carolina Republicans stung by some 2022 electoral defeats in suburban legislative and congressional districts where abortion was an issue ultimately declined to push more stringent prohibitions as other states have done.Meanwhile, at least 19 Democratic-dominated states have taken steps - through laws, constitutional amendments or executive orders - to protect access to abortion.Last year, Cooper signed an executive order shielding out-of-state abortion patients from extradition and prohibiting state agencies under his control from assisting other states´ prosecutions of those who travel for the procedure.Most of the states where the status quo on abortion hasn't changed are those where the political leadership is divided between the two parties.___Schoenbaum is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}