{
    "articleURL": "/tvshowbiz/article-12042259/Margot-Robbie-epitome-chic-oversized-black-blazer-jeans-departs-NYC-hotel.html",
    "content": [
        "Margot Robbie showed off her chic sense of style as she departed the Carlyle hotel in New York City on Tuesday night. ",
        "After dazzling at the star-studded Met Gala the night before, the Babylon star, 32, looked fresh-faced as she rocked a stylishly casual ensemble.Margot opted for an oversized black blazer and rolled up denim blue jeans.She paired the look with platform chunky black shoes and toted her belongings in a black Prada bag.Making a beeline to her car outside, she chose to go makeup free, highlighting her flawless complexion, and styled her long blonde hair straight. ",
        "The beauty appeared in good spirits as she carried her wrapped up dress alongside her and smiled at onlookers. The sighting comes after Margot made a show-stopping appearance at the 2023 Met Gala in NYC.The Oscar nominee showed off her abs in a clear PVC and black corseted gown while honouring the late Karl Lagerfeld by dressing in head-to-toe Chanel.Her dress was in a black silk chiffon from the label's haute couture spring/summer 1993 collection, and featured gold chains running down Margot's waistline.She wore her hair in classic Hollywood waves and accessorised with Chanel heels and 'Impression Florale' gold and diamond earrings from the Coromandel collection.She opted for a minimal makeup look with soft neutral eyeshadow and a nude lip.Margot, a longtime Chanel ambassador, walked on the red carpet solo; her husband Tom Ackerley was absent from the star-studded fashion event.",
        "The Suicide Squad star displayed her wedding ring on her right hand, and a bold gold ring on her left.",
        "Supermodel Cindy Crawford wore the original version of Margot's Met Gala dress and was seen showcasing the look on the runway at the Chanel Haute Couture show during Paris Fashion Week in January, 1993. 'I'm wearing Chanel, this dress was worn by Cindy Crawford in 1993. They remade it for me and it's obviously a Karl design. I feel really great in it, actually,' Margot told La La Anthony for Vogue of the ensemble.'It's incredible, obviously the Met is always an exciting night, but I had the great privilege of getting to know Karl to an extent,' she added of the night.'I was the last Channel ambassador that he picked, actually. It is an honor. I'm thrilled that they're honoring him tonight because he was exceptional.'Later in the evening, Margot and Cara Delevingne and continued the Met Gala celebrations as the BFFs rocked up together at an after party.But just six months ago, the Australian actress was forced to set the record straight after being pictured ‘crying’, seemingly outside Cara's house.Margot's teary-eyed outing in September came after the British model sparked health concerns with a series of disheveled public appearances.",
        "Cara had failed to show in NYC for the launch of her fashion collection honoring late designer Karl Lagerfeld held at chic restaurant Saga in the Financial District.Nor was she present at the Emmy Awards, alongside her fellow Only Murders In The Building stars.The actress toted her essentials around in a black-and-white handbag while adding inches to her enviable frame with black heels.",
        "The distressing pictures came a week after the one-time 'it girl' drew concern from her devoted fans by appearing erratic and out of sorts at Van Nuys Airport.But in a November interview with Vanity Fair, Margot insisted she wasn’t at Cara’s house at all and that she'd only had something in her eye.Explaining how her mum wanted to know if both she and Cara were ok, she told the magazine, ‘I’m like, “First of all, yes and yes.”‘\"And second of all, I’m not at Cara’s house, I’m outside an Airbnb that I was renting for five days! And I’m not crying!”‘I had something in my eye. I’m trying to grab my face mask, trying to hold a coffee cup, and I couldn’t get a hair outta my eye.’Half a year later, Cara and Margot seemed to have moved on from the drama as they were seen for the first time together again.",
        "The supermodel, 30, continued to showcase her bold new platinum look as she arrived clad in a skintight black gown with a leg-flashing thigh-split.Accessorising with a collared tie around her neck and cuffs, Cara elevated her height with platform boots.Her dress boasted a daring thigh-high split and she accentuated her height with platform lace-up boots."
    ]
}