{
    "articleURL": "/wires/reuters/article-12060135/Twitter-beats-disabled-workers-lawsuit-layoffs-now.html",
    "content": [
        "By Daniel Wiessner",
        "May 8 (Reuters) - A federal judge in California has tossed out a lawsuit accusing Twitter Inc of discriminating against workers with disabilities by requiring employees to report to the office and put in long hours working at high intensity.U.S. District Judge Haywood Gilliam in Oakland in a ruling issued late on Friday decided that plaintiff Dmitry Borodaenko, a former Twitter engineering manager, failed to show how policies set by CEO Elon Musk amid mass layoffs at the social media company disproportionately impacted disabled workers.But Gilliam gave Borodaenko, who lives in Scotts Valley, California, three weeks to file an amended lawsuit further detailing his claims in the lawsuit, proposed as a class action.Borodaenko, a cancer survivor, claims that Twitter fired him in November when he refused to stop working remotely.Musk, who acquired Twitter last year for $44 billion, said in a memo to staff in November that employees should be prepared to work \"long hours at high intensity\" or quit.Shannon Liss-Riordan, Borodaenko's lawyer, said on Monday that she planned to file an amended complaint adding new facts.\"Elon Musk has shown his utter lack of regard for disabled employees through his words and conduct,\" Liss-Riordan said.Twitter did not immediately respond to a request for comment. The company previously has said that its policies were not targeted at employees with disabilities.",
        "Gilliam on Friday also ruled that claims by a second plaintiff represented by Liss-Riordan, Abhijit Mehta, belong in private arbitration rather than court because Mehta signed an agreement to arbitrate employment-related legal disputes. Borodaenko opted out of the agreement.The lawsuit is one of several that Twitter is facing stemming from Musk's decision to lay off about half of the company's workforce. Twitter has denied wrongdoing in those cases, including ones claiming that female employees were targeted for layoffs and that the company failed to pay promised severance.Liss-Riordan also represents nearly 2,000 former Twitter employees who have filed legal claims against the company in arbitration. (Reporting by Daniel Wiessner in Albany, New York, Editing by Will Dunham and Alexia Garamfalvi)"
    ]
}