{
    "articleURL": "/wires/ap/article-12043663/Canadian-man-charged-counseling-suicides-2-deaths.html",
    "content": [
        "BRAMPTON, Ontario (AP) - Police in Canada arrested a man for allegedly selling a lethal substance to people at risk of self-harm and charged him with counseling suicide in the deaths of two Canadians.",
        "Peel Regional Police said the charges were lodged late Tuesday against Kenneth Law, 57, of Mississauga, Ontario, after an investigation into two recent deaths in the area.Law appeared briefly in a Brampton, Ontario, court, on Wednesday and his case was put over to next week.Police said Law used a series of websites to market and sell sodium nitrite, a substance commonly used to cure meats but that can be deadly.The Globe and Mail reported that Law confirmed before his arrest that he was selling sodium nitrite online but that he denied any wrongdoing. \"I´m selling a legal product, OK. And what the person does with it? I have no control,\" he was quoted as saying.Police said their investigation found that at least 1,200 packages were allegedly sent by Law to over 40 countries. Authorities did not specify what the packages contained, but Peel Regional Deputy Police Chief Marc Andrews urged anyone who received a shipment from Law to contact suicide hotlines and police.It is against the law in Canada for someone to recommend suicide, although assisted suicide has been legal since 2016 for people aged at least 18. Any adult with a serious illness, disease or disability may seek help in dying, but they must ask for that assistance from a physician.",
        "The Canadian Press reported that a coroner´s report it obtained from the United Kingdom appears to point to at least one death by suicide in the U.K. linked to a postal box in Mississauga and a company name that police linked to Law.Ontario Provincial Police issued a public safety warning about packages containing sodium nitrite being mailed out across the province that may have been sent to people at risk of self-harm. At least one of those companies lists a Kenneth Law as the site founder."
    ]
}