{
    "articleURL": "/wires/reuters/article-12041865/Freeport-Indonesia-divest-additional-10-stake-govt--minister.html",
    "content": [
        "By Fransiska Nangoy and Stefanno Sulaiman",
        "JAKARTA, May 3 (Reuters) - Indonesia's investment minister said on Wednesday that copper miner Freeport Indonesia must agree to sell an additional 10% stake to the government, as negotiations get underway for the U.S. company to extend its permit to operate in the country.Bahlil Lahadalia said the government will seek the cheapest pricing possible to increase its stake from 51% to 61% in Freeport-McMoRan's Indonesian unit, which controls one of the world's largest copper mines.\"We ask for Freeport's 10% divestment through a state company for as cheap as possible. I'm not asking to see the valuation,\" he said in an interview, adding that Freeport must agree to this requirement to be able to extend its mining permit which currently runs to 2041.\"If we are not thinking about this now, in 2041 there will be job losses and Papua's economy will be impacted,\" Bahlil said, referring to the region where Freeport's flagship Grasberg mine is located.He added Freeport will also be required to build a smelter in Papua in addition to the $3 billion project it is building in East Java. Partnership with Papuan businesses and meeting environmental standards would also be part of negotiations, Bahlil added.The $3.85 billion that Indonesia invested in the miner in 2018 via a state company has proven beneficial for the country, and the government expects to break even on that deal next year, he said.",
        "Although details of the new deal are still being discussed, he said, it is crucial for both parties to finalise Freeport's permit extension as early as possible to avoid a dip in output.Freeport Indonesia said it produced 3 million tonnes of copper concentrate in 2022, an annual record. The miner has in recent year transitioned into underground mining at Grasberg.(Editing by Kanupriya Kapoor)"
    ]
}