{
    "articleURL": "/tvshowbiz/article-12038239/Tony-nominations-2023-Mariah-Carey-earns-Tony-nod-producer-Like-Hot.html",
    "content": [
        "Mariah Carey has landed her first Tony nomination.",
        "The 54-year-old singer has been singled out for her producing efforts on the hit show Some Like It Hot.Film-turned-musical Some Like It Hot - which starred Marilyn Monroe and Tony Curtis on the big screen in 1959 - led the nominations with a total of 13. The stage adaptation opened on Broadway in December. Carey does not star in the show. Three of her major achievements include: Billboard's Artist of the Decade (1990s), World Music Awards' Best Selling Female Artist of the Millennium and a Grammy Award for Best New Artist in 1991. Throughout her career, Carey has won five Grammy Awards, 19 World Music Awards and 16 Billboard Music Awards. ",
        "Other shows that did well when the Tony nods were announced on Tuesday were &amp;Juliet, New York, New York and Shucked.Kimberly Akimbo, and a revival of Sweeney Todd: The Demon Barber of Fleet Street, also topped the list of nominations.Best new musical nominees were Juliet, Kimberly Akimbo, New York, New York, Shucked and Some Like it Hot.Sweeney Todd and Into the Woods were among the productions earning nods for best musical revival.Best new play nominees were Ain't No Mo', Between Riverside and Crazy, Cost of Living, Fat Ham and Leopoldstadt.August Wilson's The Piano Lesson and Suzan-Lori Parks' Topdog/Underdog earned nominations for best revival of a play, among other productions.",
        "Several Hollywood stars were nominated including A Doll’s House‘s Jessica Chastain, Prima Facie’s Jodie Comer, The Piano Lesson’s Samuel L. Jackson, and Topdog/Underdog‘s Corey Hawkins and Yahya Abdul-Mateen II.",
        "But Laura Linney for Summer 1976, and Oscar Isaac and Rachel Brosnahan for The Sign in Sidney Brustein’s Window were snubbed.This will be the 76th annual awards.The show is put on by the Tony Awards committee in New York City.The nominations were announced by Funny Girl star Lea Michele and Myles Frost, who won last year for his performance in MJ: The Musical. ",
        "Actress Ariana DeBose will again host the ceremony, scheduled for June 11 at New York City's United Palace theater.'I was honored to serve as host last year and even more so to be asked back,' DeBose previously said in a statement. 'So looking forward to celebrating this incredible season and the people who make the work happen. Here's to adding some uptown flavor to the magic of the Tony Awards.'The show will air live on CBS and on demand on Paramount+.",
        "Best Musical&amp;JulietKimberly AkimboNew York, New YorkShuckedSome Like It Hot",
        "Best PlayAin't No Mo'Between Riverside and CrazyCost of LivingFat HamLeopoldstadtBest Musical RevivalBob Fosse's Dancin'CamelotInto the WoodsParadeSweeney Todd: The Demon Barber of Fleet StreetBest Play RevivalA Doll's HouseThe Piano LessonThe Sign in Sidney Brustein's WindowTopdog/UnderdogBest Leading Actress of a MusicalAnnaleigh Ashford, Sweeney Todd: The Demon Barber of Fleet StreetSara Bareilles, Into the WoodsVictoria Clark, Kimberly AkimboLorna Courtney, &amp; JulietMicaela Diamond, Parade",
        "Best Leading Actress of a PlayJessica Chastain, A Doll's HouseSponsor MessageJodie Comer, Prima FacieJessica Hecht, Summer, 1976Audra McDonald, Ohio State MurdersBest Leading Actor of a MusicalChristian Borle, Some Like It HotJ. Harrison Ghee, Some Like It HotJosh Groban, Sweeney Todd: The Demon Barber of Fleet StreetBrian D'Arcy James, Into The Woods",
        "Ben Platt, ParadeColton Ryan, New York, New YorkBest Leading Actor of a PlayYahya Abdul-Mateen II, Topdog/UnderdogCorey Hawkins, Topdog/UnderdogSean Hayes, Good Night, OscarStephen McKinley Henderson, Between Riverside and CrazyWendell Pierce, Death of a Salesman"
    ]
}