{
    "articleURL": "/money/bills/article-12042349/Evri-delivered-BOX-instead-sons-Christmas-present.html",
    "content": [
        "Our reader had a smartphone and watch delivered to his son's home with EvriIt turned up as just an empty box and he was left out of pocketHave you been wronged by a firm? Email helen.crane@thisismoney.co.uk I am having trouble with parcel delivery firm Evri which means my son has still not received the present I bought him for Christmas 2021.",
        "Myself and his mother bought him a basic smartphone and a fitness watch, which he was going to use to help set up his own business as a personal trainer. The total cost of these was just over £250.But due to postal delays, they didn't arrive until after Christmas – by which time my son had already returned to his home in Norfolk.",
        "We posted it to him there, using the parcel service then known as Hermes but now rebranded Evri.The parcel was delivered, but when he opened it, it was completely empty. It had been sealed back up convincingly so he didn't realise it had been tampered with when he accepted it.I've spoken to Evri about this many times over the past year and a half, but have got nowhere. On occasions it has insinuated that we arranged for an empty parcel to be delivered to try and con the company out of money.The best offer I have had is for £20 compensation, less than 10 per cent of the value of the items. Can you help? G.A, SussexHelen Crane of This is Money replies: Sadly you are not alone in suffering parcel pain at the hands of Evri. It is the UK's largest parcel carrier, delivering more than three million packages every day and working for 80 per cent of the UK's biggest retailers.",
        "But Evri has been plagued by customer complaints about everything from lost and late parcels to packages being thrown around by employees – or turning up at car boot sales.",
        "Our weekly column sees This is Money consumer expert Helen Crane tackle reader problems and shine the light on companies doing both good and bad.Want her to investigate a problem, or do you want to praise a firm for going that extra mile? Get in touch:helen.crane@thisismoney.co.uk",
        "Last year, it was voted the country's worst delivery firm in a poll of 8,421 people by Citizens Advice - and in January an MP called for an investigation into Evri after it received 40,000 complaints.In your case, the firm delivered your son an empty box where his Christmas present should have been. It is shocking that it has taken almost a year and a half, as well as my involvement, to get this sorted.You told me you were upset to be essentially accused of stealing by Evri, and rightly so.More recently, it told you it had in fact found a mobile phone matching your description at one of its depots.But to get it, Evri said you would have to provide the IMEI number – the unique serial number given to all mobile phones, which is usually printed on a sticker inside the casing or on the box the handset comes in. You can also find it by typing a code into the phone itself.",
        "Unsurprisingly, you hadn't noted this down – in fact, you didn't even know what an IMEI number was until this sorry saga began. You asked the retailer you bought the phone from if it had a record, but it said it couldn't help.This was when you got in touch with me, and I questioned Evri about what was going on. It asked me if you had paid extra to have your parcel protected against loss or theft – which I didn't think was good enough.Anyone paying a delivery company to send an item should have a reasonable expectation that it will be delivered without incident.",
        "It also said you had been asked for an IMEI number but 'chosen' not to provide one.It seemed as if we had hit a brick wall. But after I explained the absurdity of these requirements to Evri, you heard from the firm again.This time, it said it was willing to pay you a settlement of £200. You are still around £50 out of pocket, but said you were happy to accept it if it meant the matter was finally brought to a conclusion.You have been assured the money will be in your account within the next five working days – so it seems this case is now all wrapped up.",
        "Poor service on the part of parcel firms is rife, and I feel that they often get away with it because most of their customers don't have a choice about using them.When we buy something online, we don't usually get to pick the company that delivers it – we simply get what we're given. This means that customers can't vote with their feet.That said, it is always worth complaining to a retailer if you are not happy with the delivery firm they choose. If enough people do this, it will pile on the pressure for them to switch.",
        "First Direct pays up after flight scam In March, I helped reader M.T to claw back £3,005 after she was scammed by someone pretending to be her bank, First Direct. The money was used to buy flights with the tour company Flights Guru, and it was that firm that paid back the bulk of the money. At the time, First Direct said it held M.T liable for the fraud because she handed over a one-time text message passcode to the scammer to authorise the transaction. It paid her only £155 to top up the money that Flights Guru subtracted for admin fees. However, M.T got in touch again this week to tell me that First Direct had looked at her case again following the publication of my story.  ",
        "She said: 'First Direct contacted me on Friday to say it had looked into my case further. It said the case should have been dealt with as fraud and they should have refunded my money straight away.'It has given me £350 by way of compensation towards the stress and anxiety this matter has caused me.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}