{
    "articleURL": "/wires/ap/article-12053149/Sweden-Australia-Thailand-advance-International-Crown.html",
    "content": [
        "SAN FRANCISCO (AP) - The semifinal field is nearly set at the International Crown LPGA team event with one day of pool play to go as Sweden, Australia and Thailand all clinched spots and the United States swept both matches Friday to move to the verge of advancing.",
        "Sweden remained perfect in Pool A by winning both matches against China, while Thailand swept defending champion South Korea and Australia beat Japan to advance out of Pool B on a cold and blustery day at TPC Harding Park.\"I feel like we´ve had a lot of fun this week, and I feel like that´s been working to our advantage,\" Sweden's Anna Nordqvist said.The U.S. has three points after two days in Pool A and will clinch the final spot in Sunday's knockout round by getting at least half a point Saturday against Sweden or if China doesn't sweep England.The International Crown is a match-play tournament featuring teams of four players from eight countries. The teams are divided into two pools of four countries with the top two from each group after three days of round-robin play of fourball competition advancing to the semifinals on Sunday. Teams get one point for each win and a half for a tied match.Lexi Thompson sealed the final U.S. match of the day when she holed a birdie putt from about 12 feet on the 16th hole to give her and Danielle Kang a 3-and-2 victory over England's Bronte Law and Jodi Ewart Shadoff.",
        "\"It was breaking quite a bit, so I played it about two-and-a-half cups out, a little bit uphill, so I knew I could be a little aggressive with it,\" Thompson said. \"But I was just trying to give myself a birdie opportunity going into that pin.\"",
        "Nelly Korda and Lilia Vu won for the second straight day, beating Alice Hewson and Liz Young 2 and 1 thanks to another strong back nine.Korda and Vu lost the first two holes, but fought back to tie it with birdies on the third and sixth holes and then won three straight holes from Nos. 12 to 14 to take control at the same part of the course that turned their first match on Thursday against China.\"I think it was time to make a move and then we´re just aggressive and it worked out that way,\" Vu said.Seven of the eight teams kept the same pairings on day two with only Japan switching up. Yuka Saso played with Hinako Shibuno a day after losing a match to Thailand with Ayaka Furue. Furue teamed with Nasa Hataoka.It didn't end up helping, with Furue and Hataoka losing 2 up to Australia's Minjee Lee and Stephanie Kyriacou. Saso and Shibuno tied Hannah Green and Sarah Kemp but it wasn't enough to stave off elimination.The toughest part for the Australians might have been dealing with the weather with temperatures in the 50s, a brisk wind and light rain at the end of the day. Green wore big white earmuffs to try to stay warm.",
        "\"We all have a lot of layers on,\" Kemp said. \"We grew up playing in just a shirt, that´s it, and shorts. So this is very different for us. When I have this many layers on I´m probably at least half a club less, and it got really windy out once we came out the back. The wind really started to pick up. I was uncomfortably cold when we got to 11 and 12, but was trying to do these little jumps and stuff. But we´re not used to this. We´d prefer the sun to come out tomorrow.\"Nordqvist and Caroline Hedwall birdied five of the first six holes to go 3 up and beat Yu Liu and Ruixin Liu 2 and 1. Madelene Sagstrom and Maja Stark beat Ruoning Yin and Xiyu Lin 2 and 1 in the other match.Thailand, which came into the week as the sixth seed, remained perfect this week with the sister tandem of Ariya and Moriya Jutanugarn beating South Korea's Hye-Jin Choi and In Gee Chun 2 and 1, and Patty Tavatanakit and Atthaya Thitikul beating Jin Young Ko and Hyo Joo Kim 3 and 2.This is the fourth time this tournament has been held after being canceled in 2020 because of the COVID-19 pandemic. Spain won the inaugural tournament in 2014, followed by the United States in 2016 and South Korea in 2018.",
        "This is the first professional women´s event to be played at TPC Harding Park, which has hosted several big events for the men, including the 2009 Presidents Cup and the 2020 PGA Championship.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}