{
    "articleURL": "/sport/football/article-12040951/Spanish-journalist-reports-rape-threats-police-abused-online-Real-Madrid-fans.html",
    "content": [
        "Reporter Maria Moran posted screenshots of abuse she had received onlineMoran was targeted by Real Madrid fans after asking Carlo Ancelotti a questionThe journalist confirmed she has now reported the threats to the Spanish police Spanish sports journalist Maria Moran has confirmed she has reported rape threats to the police, after receiving vile abuse on social media for a question she asked to Real Madrid manager Carlo Ancelotti.",
        "Moran had asked Ancelotti a question at a press conference about Vinicius Jr, after the winger was booked for protesting to the referee in their match against Almeria.The Brazilian star received his 10th yellow card of the season, which resulted in the winger receiving a second suspension.According to Spanish newspaper Marca, Moran asked 'Do you think that Vinicius could use a red card as a lesson for these continuous protests to the referees?'.'No, you don't need a red one,' Ancelotti replied. 'With all the yellow cards that he has had, I think that is enough.'",
        "A clip of the exchange was posted on social media, with the GolTV reporter confirming she received a series of vile threats since.Moran shared screenshots of the posts revealing accounts have made rape threats to her, while calling her 18-month-old daughter a 'b*****d'.Moran said has reported the threats to the Spanish police. 'These are some of the many comments that I am receiving for carrying out my work as a journalist. My daughter is 18 months old,' Moran wrote.'That they rape me, that my daughter is a b******, insults towards a baby... EVERYTHING is reported to the National Police.'Moran has since thanked fellow Spanish journalists for the support she has received after revealing the online harassment.",
        "Back in March, Moran alleged in an interview with Dutch outlet Story her former boyfriend and ex-Barcelona star Jasper Cillessen had 'threatened and blackmailed her several times'.Her comment came after reports in Spain claimed Moran is suing Cillessen for allegedly not paying his child's hospital costs.",
        "Moran gave birth to a baby girl called Cayetana in October 2021, but it was not until November 2022 that Cillessen was revealed as the father.She also posted a message on Instagram dedicated to her daughter on International Women's Day.Neither Cillessen, his agent or NEC responded to Moran's claims."
    ]
}