{
    "articleURL": "/wires/pa/article-12051297/Bournemouth-boss-Gary-O-Neil-not-risks-Marcus-Tavernier-s-fitness.html",
    "content": [
        "Bournemouth boss Gary O’Neil remains hopeful Marcus Tavernier will play again this season but vowed not to take risks with the injured winger.",
        "Tavernier sustained his third hamstring issue of the campaign shortly after scoring the winner in last week’s 1-0 success at local rivals Southampton.The 24-year-old subsequently sat out Sunday’s 4-1 thrashing of Leeds and has been ruled out of the Vitality Stadium clash with Chelsea.With Premier League survival almost certainly assured, O’Neil is under no pressure to rush back Tavernier and admits his main focus is on ensuring the player is fit and firing in time for the start of pre-season training.“We’re still not clear on exactly how long it would be,” the Cherries manager said of the injury.“Even if we were scrapping for points and desperate to stay in the Premier League, I’m still not sure. We haven’t had enough of the information back to let you know exactly when it would be.",
        "“But, of course, now that the situation has changed, there will be no rush.“If it’s three weeks that he should be out and we need to take four, we’ll take four. Whereas before it was like ‘right, it’s three weeks, let’s get him back for this game, let’s see if he can have an impact again’. Obviously that has changed.“My real focus at this moment with Tav is to make sure he is absolutely spot on by July 1 and we can get a real, good pre-season into him.",
        "“But that doesn’t mean we’ve seen the end of him this season. It might be that it’s a couple of weeks and he’s feeling fantastic and we’ll see him back on the pitch.”Bournemouth sit level on 39 points with Frank Lampard’s Blues ahead of their penultimate home fixture this term.Striker Kieffer Moore will join Tavernier on the sidelines due to concussion, while midfielder Hamed Traore will sit out a sixth successive game with a contact injury.While there is seemingly little left to play for, O’Neil is eager for his side to continue the fine form which has brought six wins from nine games.“There are still a lot of points available to us and, of course, as the head coach of the team, I’m desperate to put as many points on the board as possible regardless of the situation,” he said.“We really want to finish the season strong and then take that into the summer break with us.”"
    ]
}