{
    "articleURL": "/health/article-12045663/Im-nutritionist-school-vegan-dinners-WORSE-meat-options.html",
    "content": [
        "Schools are doing a 'huge disservice' to children by serving processed foods Some vegan meals lack iron, zinc, B vitamins and high quality proteinREAD ALSO: Parents share photos of children's vegan school dinners Vegan nuggets, beans and chips. A baked potato, bread and salad. Even a meat-free sausage roll.",
        "These are just some of the dreary-sounding, vegan school dinners served up to kids over the past few years.But top dietitians and nutritionists have warned that the eco-conscious push to adopt meat-free meals may come at a price.Instead of giving kids a roast with carrots and broccoli, they instead risk being served up ultra-processed food.These items, which can include meat substitutes, can contain poor quality ingredients and lack vital nutrients and vitamins, experts said. They told MailOnline that the ideal school dinner should include high-quality protein, healthy fats and a variety of vegetables or salad.",
        "Such an example could include a shepherd's pie, consisting of a hearty serving of potato, vegetables and lamb.Overall, the filling dish would come to around 580 calories, filling kids up and preventing them from snacking on crisps and chocolate as their school day draws to a close.It could be complemented with a banana and an apple in order to get kids closer to their five a day, according to Harley Street nutritionist Kim Pearson.Another expert suggested meat-free chilli as a vegan option. Parents last week shared pictures of their children's meat-free school dinners with MailOnline.",
        "One example included two stalks of broccoli, a bland portion of carrots, two roast potatoes, a sausage and a scoop of what appeared to be mash, alongside a mysterious white lump.",
        "Although vegan food can be healthy, nutritionists warn that without proper planning, food can be lacking in vital nutrients. Ms Pearson said: 'Processed vegan meat alternatives are not something I recommend for anyone. 'Whether it's processed meat or processed vegan alternatives, neither are good for children's health.'They often contain poor quality ingredients and a long list of additives.'Sadly, far too much of what children eat at school meals is ultra-processed, based on refined and nutrient-devoid carbohydrates, deep fried or high in sugar.'While some vegan meals can contain a range of nutrients and be balanced, experts warn this can take planning.Schools need to make sure vegan meals contain all essential amino acids and fatty acids, vitamins including D and B12 and nutrients including iodine and iron, claimed registered dietitian Dr Duane Mellor, of Aston University.It can also be difficult to cater for a range of dietary requirements when serving a vegan diet, as it becomes difficult to remove gluten, Dr Mellor said. He said: 'Unfortunately, it can be easier to try to replace meat with vegan alternatives, sometimes called meat analogues, such as vegan burgers and sausages, which can be higher in salt compared to the meat containing version.'Dr Mellor suggests a lentil and vegetable cottage pie or a mild bean chili with jacket potato or rice could be an ideal vegan dinner that would be suitable for children.",
        "He said: 'It is possible, but perhaps not naturally child-friendly at first glance, to have healthy and easy to make vegan foods using beans, peas and lentils.'Nuts are also great, although concerns about allergies may limit their use in school kitchens.'However, if meat was on the menu, Dr Mellor says a bolognese or a chilli packed with plenty of hidden veggies would be good options.",
        "'An ideal school dinner would consist of dishes made from whole foods,' according to Miss Pearson. 'It would incorporate high quality protein, healthy fats and a variety of vegetables or salad.'She suggests this ideal dinner could look like a shepherd's pie with plenty of veg. She said: 'A meal like shepherds pie provides high quality protein, fats and fibre from vegetables as well as essential micronutrients like iron, zinc, vitamin C and B vitamins. 'In dishes like this you can use cheaper cuts of meat meaning that it can be made affordably without relying on highly processed freezer-to-fryer options.'Other options Miss Pearson suggests include casseroles or stews, fish or pulses cooked in tomato and onion sauce or tray bakes, with steamed or roasted vegetables or salads on the side.It's not just the processed nuggets and chips Miss Pearson has a problem with but also the amount of sugar served to children for dessert. ",
        "She said: 'Children really do not need to be eating high sugar desserts like cakes and processed yoghurts. If schools did want to provide dessert, they should opt for fresh fruit.' ",
        "¿ Eat at least 5 portions of a variety of fruit and vegetables every day. All fresh, frozen, dried and canned fruit and vegetables count¿ Base meals on potatoes, bread, rice, pasta or other starchy carbohydrates, ideally wholegrain¿ 30 grams of fibre a day: This is the same as eating all of the following: 5 portions of fruit and vegetables, 2 whole-wheat cereal biscuits, 2 thick slices of wholemeal bread and large baked potato with the skin on¿ Have some dairy or dairy alternatives (such as soya drinks) choosing lower fat and lower sugar options¿ Eat some beans, pulses, fish, eggs, meat and other proteins (including 2 portions of fish every week, one of which should be oily)¿ Choose unsaturated oils and spreads and consuming in small amounts¿ Drink 6-8 cups/glasses of water a day¿ Adults should have less than 6g of salt and 20g of saturated fat for women or 30g for men a daySource: NHS Eatwell Guide  "
    ]
}