{
    "articleURL": "/news/article-12051851/Billionaire-Louis-Bacon-awarded-203M-defamation-case-against-Bahamas-neighbor-Peter-Nygard.html",
    "content": [
        "Peter Nygard, 81, must pay the record damages following the conclusion of a bitter, years-long defamation case brought by billionaire Louis BaconNygard spent $15 million orchestrating 'an all out effort... to destroy Bacon' which included false claims he was a KKK memberThe Canadian fashion mogul is currently in prison facing charges of sex trafficking Disgraced Canadian fashion mogul Peter Nygard must pay $203 million to billionaire hedge fund manager Louis Bacon following a bitter, years-long defamation case which has concluded in New York.",
        "Nygard, 81, was ordered to make the record payment after 'an all out effort... to destroy Bacon' which included false claims he was a KKK member who was guilty of insider trading, a ruling said.He spent a staggering $15 million to spread the highly damaging claims about Bacon 'out of hatred, ill-will, spite, and malice', wrote Layn Phillips, the supreme court-appointed special referee in the case.Nygard is currently being held in a Canadian prison facing charges which include trafficking underage girls for sex. He faces extradition to the United States over the allegedly decades-long scheme, which he denies.His false assertions about Bacon include that he was 'a member of the Ku Klux Klan and believer in white supremacy'. He also claimed Bacon was guilty of insider trading and was implicated in the death of an employee at his Bahamas property. ",
        "The defamation ruling, handed down on Thursday and seen by DailyMail.com, added: 'Any one of these would have been a significant assault on his character; the combination of all four depicted him as an evildoer of the highest order.'The effects were compounded by the almost decade-long duration of the smears and the global and multi-media distribution they were given-which included at one point a rally in the Bahamas at which participants wore t-shirts and held signs proclaiming [Bacon's] alleged racism.'",
        "The payout, a record for a defamation case in New York state, follows a spat between Nygard and Bacon which has rumbled on for more than a decade.The pair own neighboring properties on the paradise isle of New Providence in the Bahamas - and their feud reportedly began over a shared driveway.They also clashed over loud parties thrown by Nygard at his property in Lyford Cay, an exclusive private gated community. A conservation group which Bacon co-founded, Save The Bays, also successfully opposed plans by Nygard to develop his property.Nygard has since faced claims he ordered hitmen to kill Bacon and also orchestrated a campaign of harassment that included plotting a firebomb attack against a pastor linked to Bacon.In his ruling, Phillips said 'the overwhelming nature of the evidence' against Nygard in the defamation case 'was truly stunning'.But it's possible Bacon won't receive anything close to the $203 million he was awarded because Nygard's businesses are in bankruptcy. He was arrested in December 2020 and also faces a charge of racketeering.Bacon was awarded the damages after Nygard was found to have caused 'loss of standing and reputation, personal humiliation, mental anguish, and the loss of community and use and enjoyment of his property in the Bahamas'.",
        "Bacon, who is worth $1.6 billion according to Forbes, made his fortune as a hedge fund manager and is the founder of Moore Capital Management.Unlike Nygard, who was known for his garish displays of wealth, Bacon keeps a low profile and has committed a portion of his fortune to conservation.The ruling detailed how Bacon was concerned 'whenever he met someone' whether they were aware of the fake claims. 'The evidence showed that [Bacon] was humiliated by the false accusations; that his children faced unpleasant questions at school and were afraid to sleep in their beds; and that [Bacon] cut back over the years on normal activities that gave him pleasure, such as attending charitable events and visiting his home in the Bahamas, lest he be forced to deal with the lingering allegations.'The compensation was broken down as $50 million in compensatory damages, $10.3 million in mitigation damages, $100 million in punitive damages and $43.4 million to cover Bacon's attorneys' fees. "
    ]
}