{
    "articleURL": "/tvshowbiz/article-12055193/Hilary-Duff-enjoys-family-outing-Matthew-Koma-daughters-Banks-four-Mae-two.html",
    "content": [
        "Hilary Duff enjoyed a family outing in Los Angeles over the weekend with her husband Matthew Koma and their daughters Banks and Mae.",
        "The Lizzie McGuire star, who also shares an 11-year-old son called Luca with her first husband Mike Comrie, cut a stylish figure during her latest sighting.She and her husband coordinated outfits, both throwing on checked flannel tops as they surfaced during an unseasonably crisp May.Gathering her signature blonde locks up and hiding them under a baseball cap, she slung a pair of shades trendily from her neckline.Matthew and Hilary, who tied the knot in 2019, were spotted picking up a few juices for themselves and their children. ",
        "Shortly after Banks, four, was born Hilary hit the headlines by revealing she had blended the placenta into a smoothie and drunk it.In a more recent interview, she held forth to Women's Health about the way she feels about her body as a mother of three.'I’m proud of my body. I’m proud that it’s produced three children for me. I’ve gotten to a place of being peaceful with the changes my body has gone through,' she said.She arrived at her current state of mind possibly 'after having Banks,' she mused, noting that after she and her first husband split up she 'didn’t even know if I was going to have the opportunity to have another child.'Said she: 'So, being a mom again, maybe. It was a whole mix of things - of being settled and realizing that I’m powerful and talented and smart. All mental things.' ",
        "During the same interview she extolled the virtues of therapy, stressing the need to look after her emotional state as well as her physical condition.'We bust our a** to get our bodies in shape and to look the best we can. We get facials and Botox and our hair done and highlights and brows and lash lifts and all this s***,' the A Cinderella Story star revealed. 'But I want to work on the inside. That’s the most important part of the system.'On the professional front, Hilary is now the leading lady of a How I Met Your Mother spin-off called How I Met Your Father.",
        "The second and current season has seen the return of Neil Patrick Harris as Barney Stinson, the fan favorite lothario from the original series.'The first time that we ran lines together, Neil and I were in the hair and makeup room,' Hilary recalled to Entertainment Weekly.'It was just like he slipped into Barney, and I got a little flustered and I forgot all my lines. I couldn't remember any of my lines after that. It was a very exciting moment.''That's very sweet,' Neil said warmly: 'and ironically, you were forgetting your lines and then by the time we got onto set, you had memorized and learned all of your lines and I was constantly forgetting mine.'"
    ]
}