{
    "articleURL": "/wires/ap/article-12039889/California-bill-advances-requiring-Big-Tech-pay-news.html",
    "content": [
        "SACRAMENTO, Calif. (AP) - Big Tech companies such as Google and Meta might soon have to pay media outlets for posting and using their news content under a proposed California measure attempting to save local journalism.",
        "The bill, which cleared an important Assembly Judiciary Committee hearing Tuesday with bipartisan support, would require Google and Meta to share with California media companies their advertising revenue stemming from the news and other reported content. The amount would be determined through an arbitration process.Supporters of the bill said it would provide a \"lifeline\" to local news organizations that have seen their advertising revenues nosedive in the digital era. Opponents, including trade groups and some journalism groups, said the legislation would be an unprecedented mandate that violates the First Amendment.The bill would mandate that at least 70% of their revenue go to local news organizations to help pay for reporters' salaries. Big Tech companies would also be prohibited from retaliating against a news outlet for demanding a fee by excluding their content on the platforms.\"As news consumption has moved online, community news outlets have been downsized and closing at an alarming rate,\" said Assemblymember Buffy Wicks of Oakland, who authored the bill, said during the Tuesday hearing.The Democrat said that California has lost more than 100 news organizations in the past decade.",
        "\"The dominant type platforms, both search engines and social networks, have such unrivaled market power that newsrooms are coerced to share the content they produce, which tech companies sell advertising against for almost no compensation in return,\" she said, noting her bill is being backed by major journalism unions such as the News Media Alliance and Media Guild of the West, which represents The Los Angeles Times and other newsrooms.",
        "But critics of the bill said the legislation is unconstitutional for requiring online platforms to post content from all news organizations. It would also reward clickbait content and limit the ability for Google and Meta to fight misinformation on their platforms as it could be seen as retaliation, said a representative from Electronic Frontier Foundation, a digital rights group.Chris Krewson, executive director of LION Publishers, a national news group representing more than 450 independent newsrooms, said the bill is \"fundamentally flawed\" and wasn't written with small newsrooms in mind.The bill would mostly benefit newspaper chains and hedge funds that have gutted local newsrooms in the last few decades, he said. His group represents more than 50 local newsrooms in California, 80% of which are operations with five or fewer journalists. Most of those news outlets wouldn't meet the requirements to benefit, he said.\"I applaud the lawmaker for getting bipartisan support on this,\" Krewson said in an interview Tuesday. \"But this is backward.\"Over the last two years, LION Publishers has received at least $1 million in funding from Meta but Krewson said he's not speaking on the tech company's behalf.Similar efforts to bolster local news companies have been attempted across the United States, Australia and Canada, among others, with various levels of success. Australia adopted a law in 2021 that resulted in $140 million in payments to news companies from Google and Facebook last year.",
        "U.S. lawmakers are also pushing for similar initiatives, reintroducing a bill in March that failed in the last congressional session and would have allowed news companies to jointly negotiate an advertising rate with tech giants such as Google.Meta declined to comment on the California bill but pointed to a statement it made to the U.S. Congress in 2022 and another it made to the Canadian government this year when it threatened to pull all news content from its platform if the company would have to pay for news. Google didn't respond to an email seeking comment on the California bill.Despite clearing another hurdle Tuesday, questions remain about how the bill would be implemented. Some lawmakers noted that Meta's Facebook and Google do not operate the same way. Google scrapes news websites and provides users with summaries of reported content, while Facebook shows content such as photos, videos and articles to users based on their activities on the platform.Democratic Assemblymember Matt Haney of San Francisco said he's also concerned with how the state would ensure the money goes to local journalists.\"How do we actually make sure that this isn't simply profits handed from one company to another big company?\" he asked at the hearing Thursday.Wicks said she plans to have clarifications on those concerns before the June 2 deadline, which is the last day the Assembly could vote on the bill before it is taken up by the Senate. Democratic Gov. Gavin Newsom has not indicated whether he would back such legislation."
    ]
}