{
    "articleURL": "/news/article-12059415/Im-budgeting-blogger-never-buy-seven-non-food-items-grocery-store.html",
    "content": [
        "Ashley Schuering, 38, is a self-confessed 'grocery addict' and food bloggerShe frequently shares her best shopping 'hacks' to avoid running up big billsHere Schuering tells Dailymail.com how she cuts the cost of her weekly shop  A budgeting blogger and self-confessed 'grocery addict' has revealed the non-food items she always avoids in stores.",
        "Ashley Schuering, 38, frequently shares her best shopping hacks to help readers cope with the soaring cost of living through her blog 'Confessions of a Grocery Addict.'The rate of US inflation is currently at 5 percent, down from its peak of 9.1 in June 2022 but still around double the Federal Reserve's target range of between 2 and 3 percent. And some items have shot-up in price much more quickly than others. For example, the cost of cereal and baking goods increased by 13.6 percent in the year to March 2023, while fresh fruit declined by 1.5 percent. Schuering, from Nashville, Tennessee, insists the biggest mistake shoppers make is on convenient non-food items such as Tupperware or other food storage containers and branded cleaning products. Here she reveals the things she would never buy in store - and what she substitutes them for.",
        "Paper Towels 'Around six months ago I invested in a set of 'un-paper towels made from flannel,' Schuering told Dailymail.com.'They launder beautifully, stick to each other when you put them back on the roll and it has saved us so much money.'Previously she and her husband would buy a 12-pack of jumbo paper towel rolls from Costco between every four and six months. It would cost around $30 each time.     ",
        "She said: 'Granted, the flannels are about $15 upfront, which is about what you'd pay for that giant 12-pack at Costco, but they're still going strong after a half year of use.'Brands to sell reusable material paper towels include Three Bluebirds, Mioeco and Grove collective for $7, $25 and $13 respectively.",
        "Cleaning Supplies",
        "Schuering says customers often just pay for the packaging rather than the product when it comes to cleaning supplies.She advises households make their own products using ingredients such as white distilled vinegar and spent orange and lemon rinds.Alternatively she recommends all-purpose cleaning concentrates. She uses Dr Bronner's Sal Suds which costs $11 from Amazon.Toilet Paper Schuering says customers should never buy toilet paper at the grocery store as they can save money bulk buying alternatives online. In recent years a range of budget and eco-friendly toilet rolls which are bulk bought on the internet have exploded in popularity.'Costco used to be my go-to spot for toilet paper but now we use Groce's bamboo toilet paper to be more environmentally friendly,' she said.'Eight giant rolls costs just $8.99 and lasts our two-person working-from-home household more than a month.'Some brands - including Tushy and Cloud Paper - even offer cut-price subscriptions to have toilet roll sent to customers's doors each month.",
        "Tupperware  Tupperware bought from grocery stores tends to be too flimsy and overpriced, Schuering says. Delitainers - the food containers often used by take-out restaurants - can be bought in bulk on Amazon or a site called Westaurant Store.A pack of 36 is currently on sale on Amazon for $20 and Schuering insists they last longer.",
        "Zip-Top Bags Shop-bought zip-top bags are both bad for the environment and poor value for money.Schuering said: 'Getting reusable sandwich, snack, and gallon bags will save you a boatload in the long term.'She recommends one from manufacturer Grove which she says are 'affordable, durable and easy to zip.' Grove sells 25 100 percent compostable sandwich bags for $7.49 online. ",
        "Trash Bags  Schuering says the biggest mistake shoppers make is not bulk-buying products. For trash bags, she recommends Costco where she and her husband buy 200 bags at a time for $13. 'Since we recycle and compost regularly, the giant box we have now has literally lasted us since the beginning of 2021,' she said.",
        "Plant Food  As with cleaning products, Schuering says customers mostly pay for the packaging when they buy plant food. ",
        "'Not only is synthetic fertilizer like Miracle Grow not as good for your plants, it's also way marked up at the grocery store.",
        "'Do yourself a favor go to a nursery or farming co-op to get better quality plant food for less.'She adds that households should make sure they have their own compost bin to help with their gardening.'Using what would otherwise go in the trash to turn into gardener's gold is an easy and amazingly effective process. If you don't garden yourself, you can always sell it on FB marketplace,' she said."
    ]
}