{
    "articleURL": "/wires/reuters/article-12055779/Draw-extends-RSLs-unbeaten-streak-vs-Dynamo.html",
    "content": [
        "Real Salt Lake extended its unbeaten streak against the host Houston Dynamo to 11 matches when the teams played to a scoreless draw on Saturday night.",
        "Real Salt Lake is 5-0-6 against the Dynamo since Houston recorded a 5-1 victory on May 31, 2017.Real Salt Lake (3-5-2, 11 points) had a chance to prevail in the fifth and final minute of second-half stoppage time when Andres Gomez created some room and sent a left-footed shot on net. But Houston's Steve Clark made a diving stop to extinguish the opportunity.The Dynamo (4-3-2, 14 points) remained unscored on at home this season. Houston posted shutout victories in each of its first four home matches but the draw prevented it from tying the MLS record held by the Columbus Crew (five in 2020) for most consecutive home shutout wins to begin a season.Clark recorded five saves for the Dynamo, while Salt Lake's Zac MacMath had four.The Dynamo had two big chances late in the match in their bid to end the long run of futility against RSL.Adalberto \"Coco\" Carrasquilla had a superb chance in the 81st minute when he received a pass from Amine Bassi and was wide open. But Carrasquilla's right-footed blast was high and wide right of the net.Sebastian Ferreira had a chance in the 88th minute for the Dynamo, but his right-footed shot went over the net.Houston had a 16-13 edge in shots, but RSL put five on target to the Dynamo's four.",
        "Houston's Hector Herrera had a solid chance in the 55th minute. His right-footer shot caromed off an RSL defender, forcing MacMath to adjust and make a hand save.In the 66th minute, Gomez had room close to the net, but his right-footed blast bounced off the chest of Clark.Eight minutes later, RSL's Braian Ojeda took a right-footed shot that hit a Houston defender before Clark made the save.Earlier, Carrasquilla had a chance in the 10th minute but sent his left-footed shot wide right.In the 36th minute, Salt Lake's Jefferson Savarino couldn't get enough power behind a close-range, left-footed roller that Clark easily stopped.Four minutes later, Bertin Jacquesson's right-footer bicycle kick was stopped by Clark.Houston's Corey Baird, a former Salt Lake player, had a big chance in the 42nd minute, but his right-footed, close-range blast caromed off the crossbar.--Field Level Media"
    ]
}