{
    "articleURL": "/wires/pa/article-12047325/Julen-Lopetegui-warns-Wolves-war-secure-survival.html",
    "content": [
        "Wolves boss Julen Lopetegui has warned his players they are in the middle of a “war” as they attempt to ease themselves clear of the scrap for Premier League survival.",
        "Lopetegui’s men sit seven points above the drop zone ahead of Saturday’s clash with Aston Villa, in which victory could be enough to assure them of a place in next season’s top flight.However, last weekend’s 6-0 drubbing by unlikely Champions League contenders Brighton left them shell-shocked, and their Spanish manager knows there could be a lot of hard work still to be done.Lopetegui told a press conference: “We need points to achieve our aim. We had this need the last match and Saturday too, in the same way a challenge.“It’s about the will to win because this is our aim and we have to achieve our aim. It’s going to be hard, it’s going to be long, and we have to be ready in the good and bad moments.“We are in the middle of the battle. We are in the middle of the war, like a lot of teams. That’s why we have to put out 100 per cent energy in the next match. This is football so we have to be ready until the end.",
        "“Saturday we have a challenge and I’m sure the fans are going to understand the importance of the match, we are going to need this help, this environment, this energy in the bad moments. I am sure the fans are going to help a lot in the next match.”",
        "Wolves had eased their fears with wins over Chelsea, Brentford and Crystal Palace either side of defeat at Leicester, but a traumatic day at the AMEX Stadium prompted concerted soul-searching during the days which followed.Lopetegui said: “We were not happy, of course, but it sometimes happens. We analysed inside with the players and we have to be ready for the next challenge full of energy, full of confidence, because we are fighting for a big aim, a very hard aim, with a lot of teams involved.“We are going to be there until the end, so we have to be ready for the next match.”Lopetegui will make a late decision on defender Nelson Semedo, who limped off at Brighton with a knee injury which has forced him to miss two days’ training this week."
    ]
}