{
    "articleURL": "/sport/football/article-12042709/Arsenal-Declan-Rice-Moussa-Diaby-Wilfried-Zaha-Marc-Guehi-Mikel-Artetas-six-man-wish-list.html",
    "content": [
        "Bayer Leverkusen winger Diaby has emerged as a top attacking target for ArtetaThe Arsenal manager is also targeting a centre-back and two central midfieldersTeenage Southampton midfielder Romeo Lavia is of interest to the Gunners Arsenal will sanction a costly summer recruitment drive to close the gap on Manchester City - with France winger Moussa Diaby emerging as a lead target for Mikel Arteta.",
        "The Gunners moved to back the Premier League summit on Monday night with a 3-1 win over Chelsea as they returned to winning ways following a run of four games with victory that saw them relinquish control of the title race.And they are committed to strengthening their squad ahead of next season as they look to keep pace with City and ensure they are equipped for their long-awaited return to the Champions League.It is understood Arteta wants a new centre-back, possibly two central midfielders and a versatile attacker.Bayer Leverkusen forward Diaby is believed to be of serious interest to Arsenal.",
        "The 23-year-old has had an excellent season, scoring 14 goals so far - adding to his tally of 17 last term.Arteta wants to add further depth to his attacking options with Bukayo Saka, Gabriel Martinelli, Leandro Trossard and Reiss Nelson his main options in attacking midfield.Diaby is likely to cost in-excess of £50million, but the Gunners will face competition for the former PSG star’s signature with Manchester United, Newcastle and Real Madrid all linked with the exciting attacker.Wilfried Zaha is out of contract at the end of the season and is also a consideration for Arsenal, but they want to pursue a move for Diaby before exploring a potential free transfer for the Crystal Palace star.",
        "Their expected move to sign a new forward is set to be fuelled by the expected departure of Nelson, who Mail Sport can reveal has rejected the offer of a new contract amid a growing belief the forward will leave at the end of the season when his contract expires.It remains to be seen whether Arsenal make Nelson an improved offer before his deal expires in June. But his first-team chances will be limited at the Emirates in the future amid a feeling it may benefit his career if he plays regular football elsewhere.Brighton are interested and will make Nelson a formal offer, though there are other interested parties in the Premier League and abroad.West Ham captain Declan Rice is the Gunners’ priority target in central midfield.",
        "Rice is open to joining Arsenal now they have qualified for next season’s Champions League, but the Hammers’ £100million valuation of the England international could yet prove a stumbling block.Southampton’s teenage midfielder Romeo Lavia is also of interest, while the Gunners remain keen on Brighton’s Moises Caicedo.At centre-back, Crystal Palace’s Marc Guehi has impressed Arsenal’s recruitment specialists this season. But the Gunners are one of many Premier League teams, including Tottenham, keen on the England international this summer.With Bukayo Saka having agreed a new long-term contract and the club in talks with William Saliba over an improved deal, it is gearing up to be an expensive summer for the Gunners as they look to build on the success of this season.",
        "However, the north London will also look to offload some of their fringe players with the likes of Folarin Balogun, Kieran Tierney, Rob Holding and Emile Smith Rowe set to attract interest this summer."
    ]
}