{
    "articleURL": "/wires/pa/article-12050061/Bookings-Dublin-Rome-soar-Britons-head-abroad-coronation-weekend.html",
    "content": [
        "Britons are looking to make use of the extra bank holiday for the King’s coronation and escape the UK for a weekend getaway, new figures suggest.",
        "Accommodation search website Trivago said it has seen a doubling of UK bookings in Rome and nearly a doubling in Dublin over the coronation weekend, up 101% and 77% respectively.It comes as hotels in London and surrounding areas have ramped up their prices amid soaring demand from visitors from across the UK and overseas.",
        "Year on year rise in hotel rates in Windsor on the coronation day (Trivago)",
        "Prices of a hotel in the capital on the day of the King’s coronation have surged by 45% year-on-year to £203 on average, up from £140 a year ago, according to Trivago.As hotels increase their prices to capitalise on the expected surge in visitors surrounding Charles’s coronation, booking trends suggest that many visitors may be looking for accommodation further afield.Windsor rates have also shot up, rising above London hotel prices for the day, up 70% at £230 against £135 a year earlier as visitors look outside the capital to celebrate.",
        "With people casting their net wider than the capital to be able to travel into London for the day, rates in Slough have also soared – up by 51% to £122 on average.Figures show that searches for Windsor hotels have surged by 1,277% when compared with the same weekend a year earlier, with Slough up tenfold.",
        "But the booking trends also suggest many visitors are shunning London on the weekend of the ceremony.Data shows that the searches for the capital over the weekend are 7% lower than for the same weekend a year ago, and down a hefty 18% among searches in the UK only.When compared with 2019 pre-pandemic levels, searches for London in the UK and overseas on Trivago’s site are 30% lower that weekend.Hotel occupancy figures from STR, a division of global real estate data firm CoStar, also suggest London hotel prices may be putting visitors off.It found that, as of May 1, hotel occupancy stood at 73.1% for Friday and 71.8% on Saturday, below the 75.4% and 80.1% respectively seen a year ago.Trivago chief executive Axel Hefer said: “The areas around London are in drastic demand.“Windsor searches are up by seven times when compared with 2019 levels.“But a lot of people are avoiding London and staying more in the surrounding areas.”He added the event will be good for the UK travel sector and hospitality.“If hotels are full and restaurants are full, then everyone will be happy to make some money and make up some of the losses seen over the last few years,” he said.",
        "Among overseas visitors coming to the UK over the coronation weekend, the biggest interest is coming from US travellers, followed by those from the Netherlands, France and Italy, according to Trivago."
    ]
}