{
    "articleURL": "/wires/reuters/article-12060581/Senegal-opposition-leaders-presidential-bid-doubt-appeal-court-ruling.html",
    "content": [
        "By Ngouda Dione and Diadie Ba",
        "DAKAR, May 8 (Reuters) - The presidential bid of a popular Senegalese opposition politician was thrown into doubt on Monday after a court of appeal handed him a heavier suspended sentence in a libel case, triggering a small protest in Dakar that riot police quelled with tear gas.The ruling against Ousmane Sonko is the latest twist in a long-running legal saga that he has denounced as politically motivated - a standoff with the authorities that has fuelled unrest in what is widely viewed as one of West Africa's most stable democracies.In March, Sonko received a two-month suspended prison sentence in the libel case involving the tourism minister, a ruling that still allowed him to compete for the presidency in the February 2024 election.But Monday's appeal hearing extended the suspended sentence to six months, said lawyer Boubacar Cissé, who represents the minister.If Sonko does not successfully challenge the new sentence, it will likely preclude him from the race under the electoral code on candidates' eligibility, said Moussa Diaw, senior lecturer in political science at Gaston Berger University in the Senegalese city of Saint Louis.\"If this sentence is final, there is a good chance that his candidacy will be inadmissible,\" Diaw said. \"This could seriously sully the political dialogue.\"",
        "Sonko's lawyers declined immediate comment. He has six days to file an appeal with the Supreme Court.The earlier lighter sentence had been interpreted as an effort by authorities to defuse tensions with Sonko's supporters, who have repeatedly taken to the streets to protest. Their anger has added to rising discontent in some quarters with President Macky Sall's failure to rule out running for a third term in office.Senegal's constitution only allows two terms, but some fear Sall will use a recent tweak to the constitution to reset his mandate, which ends in 2024, allowing him to run again.Sonko, who came third in the 2019 election, has clout among Senegal's youth, many of whom struggle with under-employment and poor economic prospects. After Monday's ruling, some students at Dakar's Cheikh Anta Diop University threw rocks at the dozens of riot police gathered outside the campus, who fired tear gas in response.The skirmish could presage more unrest ahead as Sonko's legal troubles continue.Aside from the latest ruling, Sonko is also charged with raping a beauty salon employee in 2021 and making deaths threats against her. He denies all wrongdoing, but the outcome of that case could also affect his electoral eligibility. The next court hearing is scheduled for May 16. (Writing by Alessandra Prentice; Editing by Mark Potter and Sandra Maler)"
    ]
}