{
    "articleURL": "/wires/reuters/article-12038939/Syrians-Sudan-flee-war-second-time.html",
    "content": [
        "About 66,000 Syrians live in Sudan",
        "Some fear returning to war-torn homelandEvacuation efforts for Syrians have been complicatedBy Yazan Kalach and Orhan QeremanCAIRO/QAMISHLI, Syria, May 2 (Reuters) - Radwan Hisham Wahba fled Syria in 2012 for Sudan, hoping to build a new life after being shot when his country collapsed into civil war. Now, as violence engulfs his adopted home, he and many other Syrians living there are on the move once more.Days after escaping the bloodshed in Khartoum as military factions turned on each other in a new war, Wahba is camping in the streets of Port Sudan on the Red Sea coast waiting for passage to safety and another fresh start.\"Let's just say that wherever the Syrian goes he will live through war,\" said Wahba, from Zamalka near Damascus.\"You can't imagine what it was like for civilians and foreigners alike. Everyone was under indiscriminate bombardment. Rockets were fired and you didn't know where they would land,\" he said of the war in Khartoum.More than 66,000 Syrians ended up in Sudan after their homeland was torn apart by the conflict since 2011, according to U.N. figures, drawn by easy entry requirements.Many now seek to join the flood of foreigners who have left Sudan in past days, including in evacuations organised by their governments. Fearing a return to their shattered homeland, some Syrians are now stranded between two conflicts.",
        "\"We were very afraid because of the shelling and clashes, and the lack of electricity and water,\" said Sham al-Darzi, 45, explaining how she and her two sons and pregnant daughter had sheltered at home for a week before fleeing.The Syrian conflict drove a wave of migration as hundreds of thousands of people were killed and the economy collapsed, with more than half the pre-war population leaving their homes and millions seeking a new life overseas.\"When we came to Sudan we expected there to be psychological comfort. That we could at least work and establish a new life. But the war that happened here was a great shock,\" said Mahmoud Suweidan, 33, who left Syria only last year looking for work.He was shocked by the intensity of the fighting. \"We lived through 12 years of war. In Khartoum 12 days feels like 12 years,\" he said.FEARSMajor warfare in Syria has mostly stopped, though the country is still divided between government, rebel and Kurdish-controlled zones, but Darzi, along with some other Syrians Reuters spoke to, is unwilling to go back.She fears her sons will be conscripted for use in further bouts of warfare, having left Syria in 2013. Many Syrians also fear reprisals for supporting the wrong side.",
        "With people flooding to Port Sudan from Khartoum, prices have risen rapidly and few can afford the $83 a night that Darzi said landlords were demanding for an apartment. Like Wahba, she and her family are living in the street.\"All countries evacuate their nationals except the Syrians. No one cares about us,\" said Darzi, who is from al-Kiswah south of Damascus.Saudi Arabian state media has reported that Syrian nationals were among those evacuated to Jeddah by the Saudi navy last week, and Syria's Chams airline said it was running two flights from Port Sudan to Syria on Tuesday and Wednesday.But most have so far remained stuck in Port Sudan.Their disappointment at being unable to join an evacuation and their temporary stay in uncomfortable conditions in Port Sudan follow a hard and dangerous journey.\"It took us four and a half hours from Khartoum just to reach Madani (a town not far from the capital) because of the different checkpoints, the damaged roads and the burning tanks each side of the road,\" said Suweidan.It took him a total of 36 hours to make the full 800km (500 mile) drive. He said he had heard of a Syrian being killed at a checkpoint after an argument with the men manning it. (Reporting by Yazan Kalach in Cairo and Orhan Qereman in Qamishli, Syria; Writing by Angus McDowall; Editing by Andrew Cawthorne)"
    ]
}