{
    "articleURL": "/wires/reuters/article-12040693/Investors-big-Novo-Nordisk-stock-boost-obesity-drug-shows-heart-benefit.html",
    "content": [
        "Demand is soaring for Novo's weight-loss drug Wegovy",
        "Trial tests if Wegovy also has heart benefitsPositive trial data could widen insurance coverageWegovy only available so far in U.S., Denmark and NorwayTrial readout expected between June and AugustBy Maggie FickLONDON, May 3 (Reuters) - Positive trial data showing Novo Nordisk´s obesity drug helps save and extend lives, not just lose weight, could propel Europe's best-performing stock even higher, according to 10 investors and industry analysts interviewed by Reuters.Demand for the Danish company's weight-loss treatment Wegovy is soaring in the United States, leading it to significantly raise its full-year profit and sales expectations last month.But Novo faces challenges in getting broad health insurance coverage from European governments as well as insurers, and the U.S. Medicare health plan for older Americans that classifies weight-loss treatments as lifestyle drugs.Showing a clear medical benefit in addition to weight loss could change that.\"It doesn´t take a lot of leaps of faith to understand if you lose weight, you will have a lower risk of heart disease,\" said Jeff Elliott, lead health care portfolio manager at BMO Global Asset Management, and a Novo shareholder.\"But most insurance companies (...) may need to see that data, to definitively see the correlation between weight loss and improved outcomes.\"",
        "Novo launched a large-scale study involving 17,500 patients almost five years ago to assess whether Wegovy reduces the risk of major cardiovascular events like strokes or heart attacks in overweight or obese people with a history of heart disease.It has said it expects results between June and August, though analysts and investors will be looking for any signals on the outcome when Novo releases quarterly earnings on Thursday.The company declined to comment for this story citing its quiet period ahead of quarterly results.Barclays analysts reckon a positive outcome from the study, called SELECT, could boost uptake of Wegovy by a quarter by 2030 if the drug is approved for expanded use for treating cardiovascular conditions.Investors, including BMO and AllianzGI, said a reduction in the risk of a major cardiovascular event like a stroke of 17% or more would be considered a positive result which would likely boost Novo's shares.Less than 15% could put downward pressure on the stock while around 10% would be a major disappointment, some of the investors and analysts said.A 20% risk reduction could boost the stock to as high as 1,500 Danish crowns ($220), a third higher than its current price, Barclays said, while failure could see it fall to 900.",
        "In an informal poll of six analysts by Reuters, two agreed with Barclays' prediction that shares could be up by a mid- single-digit percentage if the trial shows a risk reduction of 17%. Four see a more muted reaction, saying they expected shares to rise only by a low-single-digit percentage.Some said the trial's importance has been overhyped. \"The trial will give important data, but it won´t give all the answers in one go and won´t blow the doors open for reimbursement,\" said UBS analyst Michael Leuchten.$100 BILLION MARKETThe stock's 140% rally since Wegovy's U.S. launch in June 2021 may limit the immediate upside for the shares too.Worth more than 340 billion euros ($372.91 billion), Novo overtook Nestle in March to become the second most valuable company on the pan-European STOXX 600 index after luxury goods group LVMH. Its shares are up more than 20% this year.Barclays estimates the global market of weight-loss therapies could be worth as much as $100 billion in the next 10 years, with most of the benefit accrued to early leaders, Novo and Eli Lilly.Booming demand and production issues have caused shortages of Wegovy though, forcing Novo to delay launching the weekly injection in most of Europe.Even with the medical benefit, investors say the company faces a challenge convincing Europe's cost-conscious health authorities to pay for the drug. It costs nearly $1,350 a month in the United States.",
        "In Europe, it is only available in Norway and Denmark, where it costs between $160 and $350 per month without reimbursement from private insurers.The countries' public health authorities have said they will reconsider their assessments of whether to cover the drug, which they currently do not, after publication of the SELECT trial data.But in an indication of the hurdles, Denmark's largest private insurer announced last week it will stop reimbursements from next January.\"What we have seen in Denmark with some providers already coming out and saying 'we can't do this for everybody' will happen elsewhere and will add some volatility,\" said Lars Skovgaard Andersen, investment strategist at Danske Bank.($1 = 0.9101 euros) ($1 = 6.7970 Danish crowns)(Reporting by Maggie Fick, Additional reporting by Nikolaj Skydsgaard in Copenhagen and Helen Reid in London; Editing by Josephine Mason and Emelia Sithole-Matarise)"
    ]
}