{
    "articleURL": "/news/article-12039743/Browns-Plains-ute-driver-captures-woman-running-road-case-suspected-insurance-fraud.html",
    "content": [
        "Woman was hit by car in southern BrisbaneViewers said it was likely staged accident Shocking footage has captured the moment a woman appeared to intentionally run into the path of an oncoming car.",
        "A ute driver had been making their way along a road in Browns Plains in Logan, southern Brisbane, just after 2am on Tuesday.As the car winded through a roundabout a woman can be seen in dashcam footage waiting nearby on the nature strip before jumping in front of the vehicle.Footage of the incident was uploaded to Twitter where social media users speculated whether or not the woman had been trying to commit insurance fraud. ",
        "The woman is seen in the dashcam footage leaping out in front of the car before being knocked to the ground.She then screams out in pain as a man rushes over to her and puts his hands on his head.The driver of the ute then quickly weaves around the pair and drives off down the road.Many social media users claimed the woman appeared to be waiting for the car to drive past and jumped onto the bonnet to claim money from the driver.'They definitely seemed set up. Didn't think I'd see that happening in Australia,' one person commented.'Damn, the fraudster looked legitimately injured. Should have picked something small like a Honda Jazz to pull this scam on instead of a ute with a bullbar,' said another.",
        "'Makes you wonder if these people ever get away with this s**t if the car doesn't have a dash cam. Thankfully they're so prevalent now these people get found out,' one wrote.",
        "Another social media user praised the driver of the ute for not stopping. 'Driving off was probably a good idea given the number of cars stolen around south-east Queensland,' one wrote.A Queensland Police spokesperson said police were aware of the footage.The driver reported the incident to police shortly after the incident however officers were unable to find the pair involved after arriving at the scene.No formal complaint has been made to police at this time but investigations are ongoing into the circumstances surrounding the incident."
    ]
}