{
    "articleURL": "/news/article-12056729/EXCLUSIVE-knackered-Anti-monarchists-insist-WONT-stage-protests-week.html",
    "content": [
        "EXCLUSIVE: Republic chief Graham Smith was arrested for protests yesterday He was released at 11pm last night after almost 16 hours in police custodySmith confirmed to MailOnline that the group are too tired to target more events The ringleader of the anti-monarchist group who attempted to rain on King Charles' parade yesterday has insisted that they are too 'knackered' to stage any more Not My King protests this week. ",
        "Speaking ahead of tonight's star-studded coronation concert, Republic's megaphone-wielding chief executive Graham Smith claimed neither he nor his group have the energy to cause further disruption.After spending almost 16 hours in police custody yesterday, Mr Smith told MailOnline: 'We are knackered really.'He added: 'We are going to regroup and plan to carry on in the future. We will sit down and decide this week.' The temporary pause on action comes amid the Met Police facing backlash over how it handled protesters at the King's Coronation yesterday afternoon.",
        "As King Charles and Queen Camilla prepared to be crowned at Westminster Abbey, Mr Smith was among dozens of anti-monarchist activists who were arrested - a move which the Republic chief labelled as a 'direct attack on our democracy'.",
        "After being released from custody, Mr Smith said today: 'There were no bounds - it was an an appalling attack on our rights. 'We were there for 16 hours and released at about 11pm last night.'  The Met confirmed that 52 people were arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the Coronation. Officers said they had seized multiple lock-on devices and hundreds of posters.Just Stop Oil activists were also arrested on The Mall, with protesters insisting they were only planning on waving flags and wearing T-shirts during the Coronation. ",
        "New legislation passed this week means protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison. In a 603-word statement following his release today, Mr Smith warned that his group are by no means done with making a stance despite eight of them being detained.Speaking on behalf of the group, he said: 'These arrests are a direct attack on our democracy and the fundamental rights of every person in the country.'He also accused police officers of being 'intimidating, heavy-handed, not willing to listen, not willing to co-operate or to engage', while he said they should 'hang their heads in shame'.",
        "Mr Smith added: 'We will not be deterred from further protest. We will protest on Trafalgar Square, we will protest on The Mall, outside Buckingham Palace, Clarence House and Kensington Palace. 'We will protest outside Downing Street and parliament, in Windsor and around the UK. As much as possible we will continue to protest wherever Charles goes, wherever William goes. We will continue to protest with one simple message: Charles is not our king, it is time to abolish the monarchy.'",
        "Mayor of London Sadiq Khan said he had demanded 'clarity' from the Met's leaders on the arrests.",
        "He tweeted: 'Some of the arrests made by police as part of the Coronation event raise questions and whilst investigations are ongoing, I've sought urgent clarity from Met leaders on the action taken.'However, in stark contrast, Culture Secretary Lucy Frazer argued that police got the 'balance right' between allowing protest and enjoyment of the King's coronation.She defended the Met after the force was heavily criticised by MPs and human rights groups over the arrests, denying that officers had gone too far.The Cabinet minister told Sky News' Sophy Ridge On Sunday programme: 'What they have to do is balance the right to protest, which is important in a democracy. At the same time there's the right of all those other people to enjoy what was a fabulous day.'I think, overall, they managed to get that balance right.'",
        "Footage on Twitter yesterday showed officers using their powers under the new Public Order Act, with a number of demonstrators in yellow 'Not My King' T-shirts having their details taken.In one video an officer said: 'I'm not going to get into a conversation about that, they are under arrest, end of.'Each time Republican protesters broke out into chants of 'Not my King', concerted boos and jeers went up from the rest of the crowd, before turning into cheers when the protesters were drowned out. ",
        "Republic group director Harry Stratton denied any megaphones or locking chains were being carried or seized, and that they hadn't broken any rules laid out by the force in a series of meetings - which included not mentioning Prince Andrew and the sex claims against him, which he denies.The Royal Family will be relieved to hear that tonight's Windsor Castle concert headlined by Lionel Richie, Katy Perry and Take That, will not be targeted by Republic activists. The Coronation Big Lunch is also taking place today as millions of Brits come together to share food and celebrate the monarch being crowned. Meanwhile tomorrow, hundreds of thousands of opportunities have been made available as part of The Big Help Out initiative. It appears none of these will be impacted by Republic."
    ]
}