{
    "articleURL": "/wires/reuters/article-12052117/Black-Sea-grain-deal-No-new-ships-authorized-Friday.html",
    "content": [
        "By Michelle Nichols",
        "UNITED NATIONS, May 5 (Reuters) - Ukraine, Russia, Turkey and the United Nations on Friday failed to authorize any new ships under a deal allowing safe Black Sea exports of Ukraine grain, which Moscow has threatened to quit on May 18 over obstacles to its own grain and fertilizer exports.Daily inspections of previously authorized ships continue, deputy U.N. spokesperson Farhan Haq told reporters. Officials from the four parties make up a Joint Coordination Centre (JCC) in Istanbul, which implements the Black Sea deal agreed in July.In an excerpt of a letter seen by Reuters, Russia told its JCC counterparts last month it will not approve any new vessels to take part unless their operators guarantee the transits will be done by May 18 - \"the expected date of ... closure.\"Ukraine has been putting forward daily a list of ships to be authorized. Once approved those ships are then inspected by the JCC officials near Turkey before traveling to a Ukrainian Black Sea port via a maritime humanitarian corridor to collect their cargo and return to Turkish waters for a final inspection.According to JCC data there is currently one ship authorized for inbound inspection and 25 ships awaiting an outbound inspection - all in Turkish waters; there are 13 ships in Ukrainian ports and there are 5 ships in transit toward Ukraine and 2 vessels in transit heading back to Turkey.",
        "There are eight vessels seeking authorization from the JCC, according to the Ukrainian sea ports website.The United Nations and Turkey brokered the Black Sea grain export deal to help tackle a global food crisis that has been worsened by Moscow's war in Ukraine. At the same time, Russia accepted a three-year deal in which the U.N. agreed to help try and remove any obstacles to its grain and fertilizer exports.While those Russian exports are not subject to Western sanctions imposed following the February 2022 invasion of Ukraine, Moscow says restrictions on payments, logistics and insurance are a barrier to shipments.Russia has said it will not extend the pact beyond May 18 unless its list of demands is met to remove those obstacles.Top U.N. trade official Rebeca Grynspan met with Russia's Deputy Foreign Minister Sergei Vershinin in Moscow on Friday to discuss U.N. efforts to \"to facilitate the unimpeded export of Russian food and fertilizer, including ammonia,\" Haq said.The deputy defense ministers of Russia, Ukraine and Turkey are due to meet next week to discuss the grains agreement. (Reporting by Michelle Nichols; editing by Grant McCool)"
    ]
}