{
    "articleURL": "/wires/reuters/article-12056865/Vida-Blue-decorated-ace-As-dynasty-dies-73.html",
    "content": [
        "Former American League MVP, Cy Young Award winner and three-time World Series champion Vida Blue died Saturday, the Oakland Athletics announced Sunday morning.",
        "The Athletics confirmed Blue's death but did not disclose a cause.Blue pitched 17 seasons in the majors, with his first nine (1969-77) coming in an Oakland uniform.The left-hander won the AL MVP and Cy Young Award in 1971 after posting a 24-8 record with a 1.82 ERA with eight shutouts and 24 complete games in 39 starts. He also helped the A's win the World Series in 1972, 1973 and 1974.\"There are few players with a more decorated career than Vida Blue. He was a three-time champion, an MVP, a six-time All-Star, a Cy Young Award winner, and an Oakland A's Hall of Famer,\" the Athletics said in a statement. \"Vida will always be a franchise legend and a friend. We send our deepest condolences to his family and friends during this arduous time.\"The Athletics also shared a video celebrating Blue on Twitter.After his career in Oakland, he moved across the bay to San Francisco, pitching for the Giants (1978-81, 1985-86).\"Vida Blue has been a Bay Area baseball icon for over 50 years,\" said Larry Baer, the Giants presidnet and CEO, in a statement. \"His impact on the Bay Area transcends his 17 tyears on the diamond with the influence he's had on our community.\"",
        "Blue posted a 209-161 record with a 3.27 ERA, 143 complete games and 37 shutouts in 502 career appearances (473 starts) with the Athletics, Giants and Kansas City Royals (1982-83).\"Vida Blue rest in peace, my mentor, hero, and friend,\" retired pitcher Dave Stewart wrote on Twitter. \"I remember watching a 19 year old phenom dominate baseball, and at the same time alter my life. There are no words for what you have meant to me and so many others. My heart goes out to the Blue family.\"--Field Level Media"
    ]
}