{
    "articleURL": "/wires/reuters/article-12045837/London-stocks-drop-Powell-calls-high-inflation-ECB-decision-tap.html",
    "content": [
        "Next jumps after maintaining profit forecast",
        "Shell gains on quarterly profit beatUK services PMI rises in MarchFTSE 100 down 1.1%, FTSE 250 off 0.6%(Recasts lede, adds comments, Next share move and services sector data in paragraphs 9 and 12)By Shristi Achar A and Amruta KhandekarMay 4 (Reuters) - London's FTSE 100 hit a one-month low on Thursday as a smaller interest rate hike by the European Central Bank did little to lift sentiment dampened by concerns about the banking sector, while Shell gained after posting upbeat earnings.The blue-chip index ended 1.1% lower, while the mid-caps index fell 0.6%.Financial stocks were the top drag on the FTSE 100, with the banking index down 1.7%, as renewed fears about a crisis among regional lenders in the United States hurt risk sentiment.\"We are seeing fears over the U.S. banking sector, and worries about potential contagion to Europe, rearing its head again,\" said Stuart Cole, chief macro economist at Equiti Capital.Meanwhile, the European Central Bank raised rates by 25 basis points on Thursday in the smallest move so far in its current cycle of rate hikes.However, unlike the U.S. Federal Reserve, the ECB said further tightening was likely given mounting price pressures.\"(Interest rate concerns) are dampening down the positive sentiment that's coming from the better earnings,\" said James Baxter, founder of Tideway Wealth.",
        "Oil giant Shell rose nearly 1% after posting a first-quarter net profit of $9.65 billion, which topped analysts' forecasts. Shares of Next Plc climbed 3.2% to the top of the FTSE 100 gainer list after the fashion retailer maintained its guidance for annual profit. Base metal miners, however were a drag, falling 3.4% despite a rise in metal prices, as a weaker-than-expected demand recovery in top consumer China dented sentiment.Among other major movers, Hargreaves Lansdown rose 1.1% after the investment manager reported a rise in its net new business, aided by a revival in investor sentiment.Data showed Britain's services sector kicked off the second quarter with its fastest growth in a year, but it passed the cost of rising wage bills on to consumers, adding pressure on the Bank of England to keep raising interest rates. (Reporting by Shristi Achar A and Amruta Khandekar in Bengaluru; Editing by Nivedita Bhattacharjee and Hugh Lawson)"
    ]
}