{
    "articleURL": "/wires/reuters/article-12047059/US-STOCKS-Wall-Street-falls-PacWest-woes-overshadow-Fed-pause-optimism.html",
    "content": [
        "PacWest slumps as it looks at strategic options",
        "First Horizon tanks as Canada's TD calls off buyout dealFed opens door to pause in tightening cycleIndexes down: Dow 0.31%, S&amp;amp;P 0.30%, Nasdaq 0.27%(Updates prices to open)By Ankika Biswas and Sruthi ShankarMay 4 (Reuters) - Wall Street's main indexes fell on Thursday after PacWest's move to explore strategic options deepened concerns about the health of regional banks, countering optimism from the Federal Reserve signaling a likely pause in interest rate hikes.PacWest Bancorp tumbled 45.2% to a record low after confirming it was exploring strategic options, including a sale, after shares of the regional lender and peers got hammered amid fears of a worsening banking crisis.Regulators seized troubled First Republic Bank and JPMorgan Chase agreed to buy majority of its assets earlier this week, marking the largest U.S. bank failure since the 2008 financial crisis.Canada's Toronto-Dominion Bank Group called off its $13.4 billion acquisition of First Horizon Corp on Thursday, triggering a drop of 37.9% in the U.S. regional bank's shares.Regional lenders including KeyCorp, Valley National Bancorp and Zions Bancorp fell between 4.9% and 5.9%, while Western Alliance Bancorp dropped 17.9%.The KBW Regional Banking index dropped 3.3%, while the S&amp;amp;P 500 Banks index fell 1.6%.\"PacWest is more evidence that the U.S. banking crisis is not over yet,\" said Stuart Cole, chief macro economist at Equiti Capital.",
        "\"It (PacWest) does appear that it is struggling, and I would be very surprised if it was not for the same reasons as those before it ... the market is circling all these regional U.S. banks like a vulture, looking which one to pick off next.\"The Fed raised interest rates by 25 basis points to the 5.00%-5.25% range and signaled a pause in its policy tightening, giving officials time to assess the recent bank failures, U.S. debt ceiling situation and sticky inflation.However, U.S. stocks dropped on Wednesday after Chair Jerome Powell said that it was too soon to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.U.S. interest rate futures priced in a pause in tightening at the Fed's June and July policy meetings, according to CME's FedWatch tool, while factoring in a nearly 50% chance of rate cuts at the September meeting.Data on Thursday showed the number of Americans filing new claims for jobless benefits increased last week as the labor market gradually softens amid higher interest rates, which are cooling demand in the economy.Apple Inc shares fell 1.4%, with the iPhone maker set to report quarterly results after the closing bell.At 9:38 a.m. ET, the Dow Jones Industrial Average was down 105.24 points, or 0.31%, at 33,309.00, the S&amp;amp;P 500 was down 12.35 points, or 0.30%, at 4,078.40, and the Nasdaq Composite was down 32.39 points, or 0.27%, at 11,992.94.",
        "Moderna Inc rose 1% on stronger-than-expected sales for its COVID-19 vaccine for the first quarter.Qualcomm Inc slumped 7.9% after the chip designer's third-quarter forecasts missed estimates, while Paramount Global Inc dropped 22.2% after missing first-quarter revenue estimates amid a weak advertising market in its TV business.Declining issues outnumbered advancers for a 2.04-to-1 ratio on the NYSE and a 1.69-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded two new 52-week highs and 14 new lows, while the Nasdaq recorded 16 new highs and 190 new lows.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Editing by Shounak Dasgupta)"
    ]
}