{
    "articleURL": "/wires/reuters/article-12054627/Navy-christens-USS-Cooperstown-honors-Hall-Fame-veterans.html",
    "content": [
        "The Navy christened the USS Cooperstown on Saturday, recognizing all military veterans -- including the 70 Baseball Hall of Fame members who interrupted their baseball careers to serve in the military.",
        "The ceremony will take place in New York City, where players such as Ted Williams and Bob Feller undoubtedly will be remembered. Williams flew 37 combat missions in World War II and Korea, and Feller missed four seasons to serve in the Army, enlisting after the bombing of Pearl Harbor in 1941.The USS Cooperstown joins the active fleet of Freedom-variant littoral combat ships. The Department of Defense describes LCS ships as \"fast, optimally-manned, mission-tailored surface combatants that operate in near-shore and open-ocean environments.\"Johnny Bench and Joe Torre represented their fellow Hall of Fame members are the ceremony.\"I can't begin to tell you what an honor it's going to be to represent the Hall of Fame,\" catcher Johnny Bench told USA Today ahead of the event. \"It will be an amazing, amazing thing. You look at guys like Ted Williams and Bob Feller and Jerry Coleman who gave up all of those years of their careers and lives, to enlist and fight for our freedom.\"Bench's father served eight years in the military.The list of baseball players who saw active duty for the United States reads like a who's who of baseball. Among them are Ty Cobb, Christy Mathewson, Tris Speaker and George Sisler, who fought in World War I. In WWII, Williams and Feller were joined by a list that includes Yogi Berra, Joe DiMaggio, Larry Doby, Stan Musial and Jackie Robinson.",
        "Ernie Banks and Willie Mays are among those who served in Korea.Staterooms on the 351-foot-long ship will be named after Hall of Fame members and will have a replica of their Cooperstown plaques on their doors.The motto of the USS Cooperstown is \"America's Away Team.\"Its next port is Mayport, Fla.--Field Level Media"
    ]
}