{
    "articleURL": "/tvshowbiz/article-12052379/Will-Smith-deserves-Hollywood-comeback-slap-says-actors-pal-Cedric-Entertainer.html",
    "content": [
        "READ MORE: Will Smith films Bad Boys 4 in Atlanta Will Smith deserves to have a Hollywood comeback after infamously slapping Chris Rock at the 2022 Oscars, says the actor's close pal Cedric The Entertainer.",
        "Smith, 54, sent shockwaves around the world when he slapped Rock, 58, onstage after he made a joke about his wife Jada Pinkett Smith's shaved head - resulting in a 10 year ban from the ceremony - after he had finally won the Best Actor gong.The Neighborhood star Cedric, real name Cedric Antonio Kyles, 59, also exclusively told DailyMail.com that he believes the pair will make amends but not in the near future.He added the slap was the result of a  long term bitter feud between the pair stemming from years of issues - not just the on the night joke about wife Jada. Lambasting efforts to cancel Smith's career, Cedric said: ‘People are human beings and they make human mistakes.‘So this idea of canceling people out of their lives and saying they can't exist anymore or they shouldn't, I feel that that's a bridge too far. ‘And it's usually done in the sense of blind internet power.",
        "‘It is people that have no real attachment to it, just giving an opinion for the moment, and then they jump on the wave and they create this thing that comes rushing at you that makes you look like the worst human being in the world.‘When it was a one mistake, it was a mistake.’",
        "He continued: ‘For me, I think the idea of canceling people for any kind of act, if it's not doing something to children, or a woman as a man, then again, if you're just, create an act, drunk driving or adultery, all these things that people want to cancel folks for; I feel like, again, we just don't allow ourselves enough opportunity to be human.’Cedric feels that Smith’s assault was prompted by a long term issue of Rock joking about her career in the past, not the one-liner about her hair.He admitted it was ‘weird’ timing that Smith’s temper would explode on the biggest night of his career.But the comedian feels both men suffered from that moment.He said: ‘A lot of people thought that it was the joke itself, but obviously there was true undertones that led to that kind of behavior, especially from Will Smith and from Chris Rock, to be honest.‘Eventually as a men, there is a degree of, both of them had great falls because of that.",
        " ‘One had the kind of physical experience happened to them, and the other one had the repercussions of it and saw that they were seen in a different way.'Because all of us feel like sometimes we're tough guys, you'll be like, oh, that guy said this to me. I'll do this.",
        "‘But you don't know how somebody would really respond to that or if that situation would be a detriment to who you are.’He also believes both stars ‘suffered’ from the incident with the humiliation of Rock from the attack also impacting him mentally.Cedric added that the ill feeling between Smith and Rock has run deep for a while so any kind of peace will 'not necessarily’ happen in the short term future.He said: ‘I do feel like, again, it was some things that the lines were crossed, like real lines.‘I think that we would love for the world to be a place where we could just get over it and get past it.‘But again, when people draw lines in the sand sometimes you get those hard arguments that we're going to have to deal with and may not be ready to deal with. But I am encouraged that they will get to it though.’Cedric added he is delighted Smith is back filming blockbuster Bad Boys 4.He believes that time will allow the two stars to make peace.‘For the most part, they're going to just keep pushing through in a short period of time.",
        "‘They'll be able to talk about it and get through it.",
        "‘But it's one of those things like a family argument, you just have to ease through it until somebody makes some good food and we sit down and eat. And then we are like ‘this is what happened. All right. So I believe that we are getting closer to that moment.’In his Netflix special, earlier this year, Rock pushed back at Smith for having displaced anger. He said: ‘Will Smith practices selective outrage.'Everyone that really knows knows I didn’t have anything to do with that s***. I didn’t have any entanglements.’Rock has reportedly refused to accept Smith’s apologies or efforts to make peace. Chris's long-awaited public response to being slapped by Smith has been met with high praise - with some calling it the 'best brutal takedown' in history. An industry source told People that Rock  'is riding high from the Netflix special.'They added: 'He said what he needed to say and doesn't give a s*** about the reaction either way. He isn't worried.'People have been waiting for [Rock's] reaction for a year. For the most part, I think it was well received. People don't expect sugarcoating from Chris Rock.'",
        "During his new Netflix standup special, Rock verbally hit back at Smith a year after the incident that saw Smith banned from the Academy. ",
        "In a nearly two minute segment, Rock fired off at Smith's decision to slap him on stage at the awards ceremony, making Smith and Jada Pinkett Smith the butt of his joke about her infidelity. 'Everybody called him a b**ch, and who's he hitting? Me,' Rock joked to a crowd that included a friend of Meghan Markle's who was spotted laughing backstage, according to Page Six. The comedian also took aim at the former 'Suits' actress during his special, saying she was 'acting all dumb' for not realizing the royal family are the 'OGs of racism.' Rock's rant has since been applauded on social media as 'the perfect/best way' to get back at Smith for the moment that changed both of their careers. The comedian made audience members and live viewers wait until the last ten minutes of 'Chris Rock: Selective Outrage' before he addressed the slap. ",
        "'You all know what happened to me, getting smacked by Suge Smith,' the comedian joked. Rock said: 'It still hurts. I got 'Summertime' ringing in my ears.'Bringing Jada up in the show, he addressed her affair and his frustration that he was the one who 'bore the brunt' of the couple's marital troubles.'Will Smith practices selective outrage,' Rock said, giving a nod to the special's title.",
        "'Everybody that really knows knows I had nothing to do with that. I didn't have any entanglements…She hurt him way more than he hurt me.'Cedric spoke before playing in the 16th Annual George Lopez Celebrity Golf Classic in Los Angeles. The event, which featured many stars from film, TV and music, came out to support Lopez's long running fundraiser.The mission of the George Lopez Foundation is to create positive, permanent change for underprivileged children, adults and military families confronting challenges in education and health, as well as increasing community awareness about kidney disease and organ donation. Funds raised will help send over 250 children suffering with kidney disease to summer kidney disease and transplant camp for a week. For more details visit https://georgelopezfoundation.org/"
    ]
}