{
    "articleURL": "/tvshowbiz/article-12039451/Emilio-Estevez-reveals-Laurence-Fishburne-saved-drowning-quicksand.html",
    "content": [
        "Emilio Estevez recalled when Laurence Fishburne saved him from drowning in quicksand and his legendary actor father Martin Sheen called The Matrix actor personally to thank him.",
        "Father and son duo Sheen, 82, and Estevez, 60, appeared on The Jennifer Hudson Show on Tuesday as they talked about the scary moment.Sheen and Fishburne, now 61, were on set of legendry 1979 film Apocalypse Now in the Philippines.Estevez said: 'We'd only known each other a couple of days and this was in the Philippines.'He explained that he and Fishburne were 14 at the time and came upon a small boat and suggested they get on it, however, it was too close to sure.",
        "Estevez then suggested to jump off the boat and push it offshore but he found himself in what he described as 'quicksand mud.'He explained: 'I was just sinking, oh my god, and I just saw Fishburne just looking at me going, \"Quick grab my hand!\" And he pulled me back up on to the boat, and we were bonded ever since.'Sheen revealed that the first time he heard of the incident was when he read the father-son memoir Along The Way: The Journey Of A Father And Son. After hearing of the incident he promptly 'called Mr. Fishburne to thank him for saving my son's life.'A year ago Sheen revealed that he regretted  adopting a stage name for show business.The actor, born Ramon Estévez, spoke with Closer Weekly Saturday about the career decision, saying, 'That's one of my regrets.'",
        "The Emmy-winning actor continued, 'I never changed my name officially. It's still Ramon Estévez on my birth certificate.'It's on my marriage license, my passport, driver's license. Sometimes you get persuaded when you don't have enough insight or even enough courage to stand up for what you believe in, and you pay for it later. But, of course, I'm only speaking for myself.'",
        "In the interview, the Dayton, Ohio native - who is father to stars Emilio Estevez, 60, and Charlie Sheen, 56 - said that he didn't stand in the way of his children entering show business.'I honestly have to say I wasn't aware of it,' he told the outlet. 'I was so self-involved and trying to be a provider that I wasn't aware of their inclination to being actors.'Sheen said he 'was doing a show one time, and Emilio showed up,' adding, 'I thought he was there to visit me, but he'd gotten a part in the same show.'The Apocalypse Now actor said 'the only influence' he had on son Emilio 'was to keep his name,' as 'when he started out, his agent was advising him to change his name to Sheen and he wouldn't do it.'And I thank God he didn't.'Sheen opened up about working with his son Estevez on his 2010 dramatic comedy The Way, saying the film filled him 'with the deepest gratitude and satisfaction' of all the roles he had in his career.",
        "'We made it in Spain about the pilgrimage to Santiago de Compostela and dedicated it to my father, who was from Galicia,' Sheen said. 'It was written, directed and starred my son Emilio Estevez. It is the best thing I've ever done.'Thousands of people have seen the film and been inspired to do the pilgrimage. That is a great source of satisfaction and pride.'",
        "Sheen also spoke about his stint on the acclaimed series The West Wing, in which he played the role of President Josiah Bartlet from 1999-2006.'It's the people - so many wonderful, wonderful people,' Sheen said, adding that he and late actor John Spencer 'were the oldest, so we were kind of like the parents.'He continued: 'But we all treated each other with such respect, passion and, above all, joy. I still get letters from people who are just discovering it, and a lot of young people were inspired to go into public life because of it. The blessings were just endless with that show, and they're still coming.'"
    ]
}