{
    "articleURL": "/wires/ap/article-12057831/White-Sox-score-11-2nd-beat-Reds-17-4.html",
    "content": [
        "CINCINNATI (AP) - Hanser Alberto had four hits, a career-high four RBIs and the Chicago White Sox scored 11 runs in the second inning to rout the Cincinnati Reds 17-4 on Sunday.",
        "The 11 runs are the most for the team in one inning in 16 years and third-most ever for the franchise. The White Sox had 11 runs in the fifth at Kansas City on Sept. 17, 2007.The offensive outburst could be a big boost for the White Sox who will be without designated hitter Eloy Jiménez for up to six weeks following his appendectomy.\"We lost Eloy and we'll miss him,\" Alberto said. \"We know what kind of player he is. We want him to come back to see a better team. We need to just go out there and have fun, score some runs, and do some damage.\"The White Sox, who've struggled this season with runners in scoring position, delivered plenty of big hits against Graham Ashcraft (2-1) in the second, sending 14 batters to the plate.Alberto hit a two-run homer to snap Ashcraft´s 33-inning homerless streak. Andrew Benintendi had a two-run single, and Andrew Vaughn tripled in two more runs.",
        "Ashcraft´s eight earned runs in the second eclipsed his season total of seven over five starts.\"(Alberto's) home run was a jam shot,\" Ashcraft said. \"But that´s no excuse. That´s when you get into the mental part of the game. I didn't want to come out and do that to the bullpen.\"",
        "Gavin Sheets hit a three-run homer off Casey Legumina to cap the historic frame.\"When you can get a couple guys on and put the ball into the seats, it's nice to see,\" White Sox manager Pedro Grifol said. \"It was a great job by our offense to keep the pressure on those guys.\"It was the most runs allowed by the Reds in an inning since April 13, 2003 against the Phillies when they gave up 13 in the fourth inning.Michael Kopech (1-3) allowed four solo homers by pitched six innings to earn his first victory of the season.\"The put some good swings on me, but our offense made my job a lot easier,\" Kopech said. \"Hopefully we can ride that momentum for a while.\"Jonathan India's ninth career leadoff home run tied him with Barry Larkin for third on Cincinnati's all-time list. Things took a turn for the worst from there.\"There is nothing fun about games like that, but it´s just one game,\" Reds manager David Bell said.RISPY BUSINESSThe White Sox came in batting .176 with runners in scoring position in their previous 14 games, after going 1 for 8 in Saturday night's loss. On Sunday, they were 8 for 13 (.615).\"The at-bats with runners in scoring position were really good,\" Grifol said. \"We put a lot of focus there.\"",
        "ON THE MENDJiménez was discharged from the hospital on Saturday night after undergoing an appendectomy at Good Samaritan Hospital in Cincinnati.\"I talked to him today and he sounded really good,\" Grifol said. \"When he answered the phone, he sounded like normal Eloy. He was obviously in big-time pain yesterday.\"Jiménez is hitting .258 with four doubles, four home runs, and 15 RBI.He was placed on the 10-day injured list on Sunday, and catcher Carlos Pérez was recalled from Triple-A Charlotte.TRAINERS ROOMWhite Sox: 3B Yoán Moncada (back) played five innings and homered on Sunday for Triple-A Charlotte. He will be reevaluated on Monday. ... Closer Liam Hendriks, who is coming back from stage 4 non-Hodgkin lymphoma, made his second rehab appearance for Charlotte on Sunday, allowing a run and two hits in an inning.Reds: OF Jake Fraley (lower back stiffness) who was scratched from the lineup on Saturday, was available off the bench on Sunday. ... 1B Joey Votto (shoulder surgery) is working out at Great American Ball Park, but there is no timetable for him to resume minor-league rehab.UP NEXTReds: RHP Luke Weaver (0-2, 7.88) will face RHP Max Scherzer (2-2, 5.56) in Tuesday's opener of a three-game series against the Mets.White Sox: RHP Dylan Cease (2-1, 4.58) will face RHP Zach Greinke (1-4, 5.25) in Monday's series opener in Kansas City.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}