{
    "articleURL": "/wires/reuters/article-12040793/D-backs-Brandon-Pfaadt-set-debut-vs-Rangers.html",
    "content": [
        "Arizona Diamondbacks top pitching prospect Brandon Pfaadt is going to have his hands full when he makes his major league debut against the Texas Rangers on Wednesday in Arlington, Texas.",
        "The Rangers are swinging the bats as well as anyone in baseball. They pounded the New York Yankees and All-Star Nestor Cortes in a 15-2 victory on Sunday, and then began their rally from a 4-1 deficit against Diamondbacks ace Zac Gallen on Tuesday en route to a 6-4 victory.Texas manager Bruce Bochy described his hitters as \"relentless\" during the comeback on Tuesday.\"We had some really good at-bats,\" Bochy said. \"This offense has shown they can come back from any score.\"Among the Rangers' top hitters at the moment are Ezequiel Duran, Marcus Semien and Robbie Grossman.Duran hit the go-ahead home run on Tuesday and matched his career best with three hits. Semien has reached safely in 16 of his last 17 games, including a 2-for-3 effort on Thursday, and has scored a team-high 26 runs. Grossman is riding a 12-game hitting streak, which is tied for the longest active stretch in the major leagues.The Rangers have scored 184 runs in their first 29 games, which is tied for the third most ever in franchise history (193 runs in 1998, 187 runs in 1996). And Texas' plus-74 run differential (184-110) is a franchise record for the first 29 games of a season.All of it adds up to be quite the test for Pfaadt, who is regarded as Arizona's top pitching prospect. He owns a career 3.58 ERA over 56 minor league starts.",
        "In five starts at Triple-A Reno this season, Pfaadt went 2-1 with a 3.91 ERA. He struck out 30 in 25 1/3 innings.Along with Pfaadt's debut, the other storyline to watch with the Diamondbacks continues to be the status of Corbin Carroll. The outfielder hasn't played since exiting the Saturday game due to a left knee injury, and manager Torey Lovullo told reporters that, while the team has ruled out worst-case scenarios, it is proceeding with caution.\"There's still some soreness in there that's getting worked out,\" Lovullo said. \"He feels good. Before we rush to put him on the field, we want to just make sure everything has been diagnosed and he feels right.\"On a positive note for Arizona, Christian Walker continues to produce at the plate. Walker went 2-for-5 with a home run on Tuesday. He is batting .340 (16-for-47) with four doubles, three home runs and 11 RBIs in his past 12 games.Texas left-hander Andrew Heaney (2-2, 4.38 ERA) will make his sixth start of the season on Wednesday. Heaney turned in a quality start in his previous outing, allowing three runs over six innings, but it was a losing effort against the Yankees on Thursday after he yielded three runs on four hits.Heaney gave up all three runs in the second inning that night, and he will look to avoid falling in an early hole again.",
        "Heaney will be making his first career appearance against the Diamondbacks. The 10-year veteran never faced Arizona last season when he pitched in 16 games (14 starts) for the Los Angeles Dodgers, who faced the Diamondbacks 19 times as NL West foes.--Field Level Media"
    ]
}