{
    "articleURL": "/wires/pa/article-12056797/William-reveals-son-George-big-fan-AC-DC-Led-Zeppelin.html",
    "content": [
        "The Prince of Wales has told royal fans his son Prince George is a big fan of rock bands AC/DC and Led Zeppelin during a surprise meet and greet.",
        "William and Kate greeted Big Lunch attendees and coronation concert-goers in an unannounced walkabout for around 40 minutes on The Long Walk in Windsor on Sunday.",
        "George, nine, played his first major ceremonial role at his grandfather’s coronation as a page of honour.Caroline Mulvihill, from the Rock Choir in Windsor and Maidenhead, spoke to William during the meet and greet.She told the PA news agency: “We were talking about the kind of music we do in Rock Choir and Will was telling us in their household they have a very diverse music taste and George is very much into AC/DC and Led Zeppelin. It was quite interesting to hear that.”Sam Leckenby, another choir member who spoke to William, added: “They mentioned they were quite pleased yesterday’s ceremony wasn’t the original five hours long. They were just really lovely.”",
        "The pair walked into the middle of a picnic area and greeted royal fans having their lunch and stopped to talk to children.Kate wore a light blue blazer paired with a white top, black trousers and white Vega trainers.Onlookers joked about her white shoes and warned her about the mud in Windsor.One young girl burst into tears when she met the princess as she was so overwhelmed.",
        "Kate was also seen picking up an Union flag for a child who dropped it.",
        "Both of the royals posed for pictures with onlookers and stopped to talk to groups.The crowds gave three cheers to the couple and many people crowded round to try to get a selfie with the pair.The princess was also heard telling well-wishers “I hope you had a good time as well” when they complimented her about how beautiful she looked at the coronation.William was heard jokingly asking crowds if they had brought bottles of alcohol with them to celebrate.Both royals told crowds how happy they were that the sun had come out for the celebrations at Windsor Castle.",
        "One royal fan told Kate: “Can I just say you looked absolutely beautiful yesterday. Absolutely stunning.” The princess thanked them for their compliments and posed for photos.William was heard asking children who performed in shows at Windsor how it went while Kate asked them what songs they played.The princess also complimented children on their Union Jack face paint.Well-wishers told the pair they had “done brilliantly” at the coronation.William was later heard telling a crying baby he needed to be “very happy today” as he spoke to her aunt who had run over to see the future King."
    ]
}