{
    "articleURL": "/wires/aap/article-12049383/Professors-15-year-journey-ends-273m-drug-deal.html",
    "content": [
        "Treating depression, dementia and schizophrenia with precision drugs may become possible after an Australian biotechnology company scored a $273 million deal.",
        "Kinoxis Therapeutics, based at the University of Sydney, will partner with global pharmaceutical company Boehringer Ingelheim to develop treatments based on its technology that targets specific brain receptors.Oxytocin, a neuropeptide or chemical produced naturally in the brain, plays a critical role in the regulation of social behaviour.Michael Kassiou, who has spent nearly 15 years researching the oxytocin system as a potential target for developing new treatments, said the industry-university partnership announced on Friday had been the highlight of his career.\"More than three million Australians suffer from illnesses that impair social functioning,\" he said.\"The oxytocin receptors in the brain have emerged as an attractive drug target but they have been intractable with small molecules.\"Professor Kassiou said his team's discovery of several series of small molecules, now licensed to Kinoxis, allow researchers to target the oxytocin receptor in ways not previously possible.By targeting the brain oxytocin system the partnership aims to treat disrupted social behaviour to improve the quality of life for people living with psychiatric disorders.Social dysfunction is a common symptom of many neuropsychiatric disorders and can manifest through social withdrawal, abnormal behaviour, aggression, or difficulty forming and maintaining relationships.Prof Kassiou led programs that discovered the novel molecules and then commercialised their potential therapeutic use by co-founding Kinoxis.",
        "Fellow co-founder Associate Professor Michael Bowen of the School of Psychology and Brain and Mind Centre, University of Sydney and Uniseed, Australia's longest-running venture fund, are among key backers.The oxytocin system is the most important system in the brain in regulating social behaviour and holds the most promise for treatment, Dr Bowen said.\"Social dysfunction is one of the most debilitating aspects of these disorders,\" he told AAP.\"There are currently no medications that specifically target these debilitating social behaviours and social dysfunction.\"The partnership with Boehringer Ingelheim, worth up to $A273 million in payments plus royalties on any future sales, establishes Kinoxis as a global player in the development of precision drugs, the university said.Dr Bowen said the arrangement allowed the team to take their research into the real world.\"It has accelerated the program at an incredibly rapid rate.\"It will also bring the university significant funding to support further research in the School of Chemistry, School of Psychology, and the Brain and Mind Centre.\"This major partnership ... is a shining example of why the university is so committed to supporting research translation and commercialisation and the innovators who want to bring their ideas to life,\" vice-chancellor and president Mark Scott said."
    ]
}