{
    "articleURL": "/sport/football/article-12043613/Erik-ten-Hag-admits-dark-transfer-budget-Man-United.html",
    "content": [
        "Manchester United face crucial summer in transfer market under Erik ten HagThe Dutchman has made no secret of his belief that squad needs a revampBut Ten Hag admitted he is unsure how much money would be available to him  Erik ten Hag admits he is in the dark over his transfer budget for the summer as Manchester United’s takeover battle drags on.",
        "Chief executive Richard Arnold told Ten Hag in November that he would have more money to spend under new owners, but the issue is unresolved six months later as the Glazer family consider bids from Qatar, Sir Jim Ratcliffe and several US hedge funds.Ten Hag has been left in limbo as he plans the next phase of his rebuild. The number of players leaving this summer could hit double figures, and the Dutchman has made signing a striker his priority as United pursue a £90m deal for Harry Kane. But Ten Hag said he has no idea how much he will have to spend on new players a month before the transfer window opens.‘I don’t know,’ he said. ‘The only thing I know is that Man United is one of the biggest clubs in the world. ",
        "'But you need funds to construct squads because the level from your players decides if you are successful or not. High-level players cost a lot of money.’Asked if it would be better to know where he stands as soon as possible, he replied: ‘Yeah, it’s clear what I want, but it’s not up to me. It’s about others in this club. I’m focusing on improving the squad and the team development.’As United prepared to face Brighton tonight on Thursday, Ten Hag was asked why he picked up a green and gold scarf thrown from the crowd in Sunday’s win over Aston Villa and waved the anti-Glazer symbol before handing it back to fans. ",
        "‘It was just polite,’ he explained. ‘I know what’s going around, what the symbol of it is, but this matter was just polite.’"
    ]
}