{
    "articleURL": "/tvshowbiz/article-12049031/Hacks-Season-3-shuts-production-duration-Writers-Guild-America-strike.html",
    "content": [
        "While the Writers Guild of America strike reaches its third day, another production casualty has been revealed, with HBO Max's Hacks halting filming.",
        "Sources close to the show revealed filming will be suspended throughout the duration of the writers strike, according to Deadline. The last writers strike in 2007/2008 lasted just over three months - 100 days, to be exact - though, given how far apart the WGA and the Alliance of Motion Picture and Television Producers (AMPTP) are, this strike could very well last much, much longer.Still, there are other shows that are planning on continuing filming with completed scripts, such as HBO's House of the Dragon and Amazon's Lord of the Rings.However, comedy shows like Hacks are much more dependent on writers being available on the set, and since that is not possible amid the strike, filming has been suspended indefinitely.Hacks is renewed for season 3 and will be available on Stan.",
        "The shutting down of Hacks is particularly fitting since writing itself is at the very heart of the show.Hacks follows a legendary Las Vegas stand-up comic named Deborah Vance (Jean Smart), who is in danger of losing her longtime residency at the Palmetto Casino.She brings on young comedy writer Ava (Hannah Einbinder) to work as her new head writer as they form a unique bond.Hacks was created by Paul W. Downs, Lucia Aniello and Jen Statsky, with Statsky revealing a snap on her Instagram story on Wednesday showing Hacks stars Hannah Einbinder and Poppy Liu on the picket line.",
        "The snap was one of many photos shared by the Writers Guild of America West Instagram, with both Einbinder and Liu wearing blue WGA shirts.Einbinder held a sign that read, 'Humanity Now!!!' while Liu's sign read, 'No A.I.!', which has been one of the guild's big sticking points, to regulate the use of A.I. in the writing of films and television shows. According to the WGA strike rules, no guild member can provide any writing services, including revisions of scripts written before the strike, for the duration of the strike.Filming started on Season 3 of Hacks started in late November after Thanksgiving and resumed in January after the holiday hiatus.",
        "Filming also paused in February as Smart underwent a successful heart procedure, with filming resuming in mid-March.It's unclear how much filming remains on Season 3 of Hacks, now that filming is shut down for possibly an extended period of time.Smart has won two straight Emmys for Outstanding Lead Actress in a Comedy Series for the first two seasons of Hacks, with Einbinder nominated for both seasons.Creators Downs, Aniello and Statsky also won an Emmy for writing, while Laurie Metcalf won Outstanding Guest Actress in a Comedy Series. "
    ]
}