{
    "articleURL": "/sport/mma/article-12055965/Sean-OMalley-calls-Aljamain-Sterling-UFC-288-win-against-Henry-Cejudo.html",
    "content": [
        "Sean O'Malley confronted Aljamain Sterling after his win against Henry Cejudo Sterling defeated Cejudo by split decision to retain his UFC bantamweight title RECAP: 'Funk Master' triumphs in thrilling five-round battle to set up 'Suga' clashSean O'Malley called out Aljamain Sterling in a foul-mouthed rant to tee up a mouthwatering bantamweight bout after Sterling triumphed at UFC 288.",
        "'Funk Master' defeated the returning Henry Cejudo in a thrilling five-round battle at the Prudential Centre in Newark, New Jersey in the early hours of Sunday morning.Sterling, now 23-3, defended his UFC bantamweight title for the third time with a split-decision win over former two-weight world champion Cejudo.But not long after the 33-year-old lifted his arm in the octagon, O'Malley stormed in to confront him in sensational scenes. Social media footage showed 'Suga', 28, wearing a garish red and black jacket, walk up the steps and make his way over to his potential next opponent.",
        "Warning - graphic language in below video. O'Malley - 16-1 after beating Petr Yan in October and now the UFC's No 2 contender after Merab Dvalishvili - said: 'You better hope you look better than tonight. You better hope you look better than that! You better be ready to cut weight, baby.'Sterling responded: 'You've had a whole year to work on your jiu-jitsu. Now Daddy Dana (White, UFC chief) ain't gonna babysit that a** no more. Before O'Malley added: 'You better be ready to go again. Soon, real soon. Get ready to cut weight real soon, baby. You'd better look better than that, b****. You better look better than that.'At the same time, the New Yorker continued: 'Get your a** in the big boy players, baby,' as the pair squared up, talked over each other and shouted in each other's faces before White stepped in to separate the duo.",
        "After O'Malley insisted 'You looked like s**t', Sterling questioned why he 'ran' by turning down the title shot, continuing: 'That's what I thought. 'Because I'd drag your a** up and down this octagon. Get the f*** out my cage. Get this piece of s*** out of my cage.' Cejudo's grand plan of a bold attempt to move up and challenge Alexander Volkanovski at featherweight have been scuppered at the first hurdle, and he suggested he'll call it a day again. Triple C knew he needed a huge fifth round and it was his most convincing five minutes. He pushed the pace, won the exchanges and dominated but it proved to be too little, too late for two of the judges."
    ]
}