{
    "articleURL": "/wires/reuters/article-12045781/EXPLAINER-Why-United-States-Philippines-issued-defence-treaty-guidelines.html",
    "content": [
        "By Martin Petty",
        "May 4 (Reuters) - The United States and the Philippines have agreed on new guidelines for their 1951 Mutual Defense Treaty, following multiple requests by Manila to make clear the conditions under which Washington would come to its defence.WHY DID THE PHILIPPINES WANT CLARIFICATION?Though the United States has reassured the Philippines their defence partnership is \"ironclad\", Manila has argued the seven-decade-old treaty needs updating to reflect a different global security environment.The renewed push under President Ferdinand Marcos Jr, who is in Washington this week, came as the Philippines complains of an increase in aggressive behaviour in the South China Sea by Chinese coast guard and fishing vessels suspected of being maritime militia.The Philippines, which relies heavily on energy imports, is also keen to start exploiting natural gas reserves in its exclusive economic zone (EEZ) that China also lays claim to.In seeking clarity about when its former colonial ruler would come to its rescue, the Philippines wanted a clear commitment from its ally and for China to back off.WHAT HAS CHANGED?Guidelines issued by the Pentagon now specifically mention that mutual defence commitments would be invoked if there were an armed attack on either country \"anywhere in the South China Sea\". Another addition specifies that coast guard vessels are among those protected.",
        "It also mentions the need to work together considering \"asymmetric, hybrid and irregular warfare and grey zone tactics\".The phrase \"grey zone tactics\" is often used to describe China's use of its coast guard and fleet of fishing vessels to assert its vast territorial claims in the South China Sea through non-military means, including blockades and intimidation and moves to disrupt fishing and energy exploration.China maintains its coast guard operates lawfully in its waters.WHY NOW?Tensions with China have increased lately. The Philippines last month accused China's coast guard of \"dangerous manoeuvres\" and \"aggressive tactics\" during a Philippine coast guard patrol near the Second Thomas Shoal, a reef occupied by a small Filipino navy contingent and located 105 nautical miles (195 km) off its coast.In February, the Philippines said a Chinese ship had directed a military-grade laser at one of its navy resupply vessels in the same area.The Philippines and some its neighbours have in recent years complained about the conduct of the Chinese coast guard and fishermen, after smaller boats were rammed, blocked or blasted with water cannon.China, which claims sovereignty over islands, reefs and waters as far as 1,500 km (932 miles) from its coast, including in the EEZs of five neighbouring countries, often accuses other vessels of provocations or trespassing.",
        "HOW DOES THIS CHANGE THE SITUATION?Knowing the circumstances in which the United States is treaty-bound to intervene could be a deterrent that makes Beijing rethink some of its South China Sea strategy to avoid confrontation with U.S. forces, including the conduct of its coast guard.But China could also use its vessels to test the limits of the U.S. defence commitment and try to undermine the alliance, putting Washington in a tricky position where it may be reluctant to step in through fear of an escalation or miscalculation.Some analysts have argued the Philippines and United States were better served by a more ambiguous mutual defence treaty. (Reporting by Martin Petty and Karen Lema; Editing by Kanupriya Kapoor)"
    ]
}