{
    "articleURL": "/tvshowbiz/article-12051735/Ed-Sheeran-beams-album-Subtract-released-winning-court-case.html",
    "content": [
        "Ed Sheeran beamed as he stepped out in Manhattan the day after winning his copyright trialThe singer threatened to end his career if he lost the case, but appeared in good spirits as he took a victory lap in New YorkSheeran smiled and held his hands aloft before climbing into a car and heading for an appearance at the Sirius XM studiosEd Sheeran was in good spirits as he stepped out in New York City on Friday just hours after winning his blockbuster copyright case.",
        "The singer, 32, was cleared of allegations his 2014 hit 'Thinking Out Loud' ripped off Marvin Gaye’s 'Let’s Get it On' at Manhattan federal court on Thursday.The pop star, who released his new album Subtract on Friday, beamed as he held his arms in the air before climbing into a car to head to the Sirius XM studios.He dressed in casual attire, wearing a pair of navy-blue trousers and a white T-shirt under a black jacket.Hitmaker Ed had on a pair of bright blue and white high top Nike trainers, with neon orange laces. ",
        "After making his morning appearance, Sheeran was later pictured at the Sirius XM studios on 6th Avenue, where he performed some of his songs just hours after his musical career was in the balance. He had previously threatened to quit the music industry if he was found guilty of ripping off Gaye's classic love ballad. Sheeran, who strongly denied the accusation his hit stole fundamental musical elements from Marvin's song, had faced a £79million lawsuit brought by the heirs of the song's co-writer, Ed Townsend.But he heard a verdict he was in the clear on Thursday after a jury comprised of three men and four women deliberated for less than three hours before reaching their decision.",
        "Speaking outside the court, Ed – who is worth £158m– said: 'I’m just a guy with a guitar who loves writing music for people to enjoy. I am not and will not allow myself to be a piggy bank.'Ed’s lawyer had said the case 'should never have been brought', and the singer staked his career on the outcome, saying during the case he would be 'done' with music if found guilty.The copyright lawsuit was first brought in 2018 by the estate of the late Ed Townsend, who co-wrote the 1973 R and B classic with Gaye.It said Ed and his co-writer Amy Wadge 'copied and exploited, without authorization or credit,' the composition of Let’s Get It On by copying various elements, including its 'melody, rhythms, harmonies, drums, bass line, backing chorus, tempo, syncopation and looping'.",
        "On Friday, Ed said he is felt 'lighter' now his new soul-baring album Subtract is 'in the world' and people are connecting with it 'on such a deep and meaningful level'.The album is the final one in his mathematical symbol series and was written against a backdrop of challenging events in his life last year, including his wife Cherry Seaborn being diagnosed with a tumour while pregnant, the death of his close friend Jamal Edwards and a copyright battle over his 2017 hit Shape Of You.",
        "The global star has said he used the album to channel the intense emotions which emerged from this difficult time, describing the songwriting process as his 'therapy'.In a video posted on Instagram, Ed said the process 'reminded me what I love about song writing' and described it as a 'hugely important album to me'.He captioned it: 'I kinda feel a bit all over the place at the moment. I made this album as a way to make sense of things that go on inside my head, and immensely proud of it.'I woke up this morning and just felt lighter. Lighter that the album is in the world, and lighter that people are connecting with it on such a deep and meaningful level.'The only thing I want from this album is that people feel something when they listen to it.",
        "'It makes us all feel less alone when we realise our most embarrassing, darkest feelings are things that everyone goes through.'The singer-songwriter also praised musician Aaron Dessner for bringing out a side of him he had 'buried down, out of fear and fake bravado', adding that the project will be 'one of the most important albums in my discography for many reasons'.Ed signed off the video telling fans: 'I will see you on tour this summer and next summer.'",
        "The album, which was released on Friday, has been praised by critics for its striking honesty and described as 'easily his best album', after he won his high-profile US copyright lawsuit."
    ]
}