{
    "articleURL": "/wires/reuters/article-12052795/US-bank-lending-touches-record-deposits-fall-Fed-data-shows.html",
    "content": [
        "May 5 (Reuters) - Deposits at U.S. commercial banks fell toward the end of April to the lowest in nearly two years, data released on Friday by the Federal Reserve showed, while overall credit provided by banks moved up, led by a record level of outstanding loans and leases.",
        "Deposits on a nonseasonally adjusted basis fell in the week ended April 26 to about $17.1 trillion, a drop of about $120 billion from the week earlier. That was the lowest level since June 2021, with deposits now having declined by more than $500 billion from the week before Silicon Valley Bank (SVB) collapsed in March.After record deposit outflows immediately after the failure of SVB and smaller Signature Bank within days of each other, deposits had stabilized into early April. They picked up again in the latter half of April, a period that typically has large outflows from accounts as the annual tax filing season comes to a close.On a seasonally adjusted basis, which takes that pattern into account, deposits have changed little since the end of March.At large U.S. banks deposits fell to $10.54 trillion from $10.61 trillion a week earlier, on a nonseasonally adjusted basis. Deposits at small banks totaled $5.32 trillion, compared with $5.34 trillion.Meanwhile, total banking system credit has yet to show the contraction many economists and policymakers anticipate to develop after the recent banking system turmoil and aggressive interest rate increases by the Federal Reserve over the past year. Regulators seized a third bank - First Republic - this week and JPMorgan Chase &amp;amp; Co, the largest U.S. bank, took over.",
        "Total banking system credit rose for a second week to $17.37 trillion led by an increase in loans and leases to a record high $12.11 trillion, on a nonseasonally adjusted basis, from $12.07 trillion in the previous week. Nevertheless, loan growth has flattened out in recent months: the annual growth rate has cooled from a double-digit pace late last year to about 9% as April was ending, suggesting tighter conditions are beginning to temper bank credit.(Reporting by Dan Burns; Editing by Josie Kao)"
    ]
}