{
    "articleURL": "/sport/football/article-12053833/Idrissa-Gueye-urges-Everton-team-mates-replicate-character-shown-feisty-Leicester-draw.html",
    "content": [
        "Everton have a mountain to climb as they look to avoid their landmark relegationSean Dyche's side are on a seven-game winless run with just four games to go Leicester 2-2 Everton: Foxes move out of the bottom three after a pulsating drawIdrissa Gueye praised the character on display from Everton in Monday's Premier League 2-2 against Leicester and urged his team-mates to stay confident as the team's relegation battle rolls on. ",
        "The match had been billed as 'loser goes down' with both teams starting the night in the relegation places. Everton swiped the early lead before falling 2-1 behind the Foxes at Goodison Park but Jordan Pickford was the hero of the hour as he stood firm to save James Maddison's attempt from the spot before Alex Iwobi's equaliser saw the points shared at the final whistle. The single point allowed Dean Smith's Leicester to climb up to 16th but the Toffees stay in 18th place with only four matches left to play. Manager Sean Dyche highlighted Everton's firepower - if not their accuracy - by drawing attention to his side's 23 shots at goal, the most the team have registered in a Premier League match for more than three-and-a-half years and Gueye said the performance was one to build upon before their trip to the south coast to face Roberto De Zerbi's zesty Brighton side on Monday. ",
        "'I think confidence is an important factor during this period of the season and it's something we can continue to cultivate and work on,' Gueye said on the club website. 'Because we're going to need plenty of confidence for the remaining games.'Looking back at the season, particularly away from home, there aren't too many examples where we've gone behind in the scoreline and managed to come back to earn a result. You need character to do that and I think we showed a lot of that against Leicester.",
        "'We know it's not easy, but we need to show that fight and that belief in ourselves. Confidence does breed better results.'Dyche has previously voiced concern over his players mentality after a string of lacklustre performances has seen the team garner only one win in their last eleven matches. Whilst Gueye stated that pressure was a familiar feeling in the dressing room, the thought of relegation has undoubtedly added tension. 'It would be much more pleasant if we were further up the table and challenging for trophies at the end of the season,' he contined. 'As players, we love to challenge ourselves and put ourselves under pressure.'It is a great source of motivation, but it would be preferable to be higher up the league. Being footballers, we've become used to having to play under pressure and that's something we're going to have to deal with again.'The Toffees have only averaged a point per game since Dyche's arrival at the start of February in the wake of Frank Lampard's sacking but the former Burnley manager is no stranger to a Premier League relegation battle, and Gueye seemed grateful for his coolheaded experience.  'He's a really cool guy. He's a cool manager,' he said. 'I think one of the reasons he was brought in was because he knows how to manage these situations. He's been in similar situations before and I think that's why the club decided to bring him in.",
        "'The smile he has and the confidence he has have managed to bring a renewed energy to the club. Not only is he instilling this joie de vivre, but he's also giving us an intensity to go right to the end.",
        "'We have to fight until the end. There's time for looking at the table at the end of the season, but not currently. The training sessions have been great and they're filling us with hope and energy ahead of each game.'His mantra is, 'the minimum requirement is maximum effort', and that's at all times. We must give it our all for the rest of the season.'As well as their own results, Everton's future in the Premier League could depend on the fates of a number of their relegation rivals. Nottingham Forest, Leeds, and Leicester all have just one more point than Everton, and West Ham are unlikely to feel entirely save, just four points ahead of them with matches against Brentford and Manchester United to come.  "
    ]
}