{
    "articleURL": "/sport/rugbyunion/article-12057569/CHRIS-FOY-ups-downs-thrills-spills-vintage-flight-season.html",
    "content": [
        "The Premiership season is drawing to a close and it has been a true vintage Crises, cracking tries and great games have contributed to memorable seasonA Premiership season like no other is almost at an end. The play-offs are still to come, but the last full round of matches took place on Saturday and most clubs are now heading into holiday mode.",
        "It is impossible to exaggerate how momentous the 2022-23 campaign has been, with financial trouble leading to the collapse of two clubs and budget cuts across the board, but also a vast array of gloriously entertaining matches full of tries, dazzling skills, furious intensity and narrow margins.Without the threat of relegation to focus minds, many fixtures in the second half of the season had a hollow feel and club-country overlaps were an issue as always, but there was an intriguing tussle for the play-off places, a hierarchy shift and plenty of sizeable, passionate crowds. Here, this column gives a verdict on the season’s highs and lows, key figures and standout features.",
        "Turbulence continuesSadly, the league campaign is ending how it started, with upheaval all over. The attempts to revive relegated Wasps and Worcester look increasingly murky, while London Irish only just averted a squad mutiny over delayed wages. Meanwhile, rumours persist about a future structure involving just 10 teams and Championship winners Jersey were denied entry.",
        "Breakthrough starHe is not on the official Premiership Rugby list, but it should be Joe Carpenter, Sale’s new full-back. The 21-year-old was thrust into the Sharks’ starting side due to injuries and thrived, going on to ride high in try scoring, metres-made and defenders beaten charts.",
        "Director of Rugby of the SeasonLeicester’s Richard Wigglesworth. He was thrown into the top job all of a sudden mid-season when Steve Borthwick answered his country’s call, lost three of his first four league games in charge, but then won six on the bounce to make the play-offs.",
        "Departing grandeesThe league is losing a number of its leading lights, including Bristol’s two backline Galacticos, Charles Piutau and Semi Radradra, whose presence has provided endless creative thrills. Others who will be missed include Jack Nowell and Sam Simmonds, Jack Willis, Dan Biggar, Ben Morgan, Billy Twelvetrees, Freddie Burns and Jackson Wray.Script-writer’s flourishChris Ashton has always had a knack for causing a stir and he managed it yet again by announcing his retirement, then scoring a hat-trick to become the first player to reach 100 Premiership tries, before receiving a red card in his last game.You really could make it up!",
        "Top tryNewcastle’s turbo-changed Argentina wing Mateo Carreras provided so many highlights in his early-season scoring spree, but the long-range strike at Northampton in October was the pick of a glittering bunch, with slaloming footwork to break from his own 22 and then pure pace.",
        "Better visibilityThe Premiership needs to raise its profile and there were two good moves in that regard — allowing quicker use of match clips to create social media engagement and the behind-the-scenes footage generated by clubs such as Northampton and Newcastle.",
        "Photo finishBath managed to snatch the last Heineken Champions Cup place ahead of Bristol, but it was a disappointing season for the West Country rivals. At least Finn Russell will be coming to the Rec next season to play in the premier cross-border event, in keeping with his marquee status.Best media foodGloucester. The pre-match meal at Kingsholm was truly magnificent — beef stew with Chianti accompanied by white truffle potato mash.Worst matchday trafficIt has to be Bath. It is a beautiful place and such an iconic location, but the cramped nearby roads simply were not designed to cope with a combination of tourists and hordes of rugby fans. For those visiting, go by train or factor in an overnight stay.",
        "Unity in adversityWorcester rallied behind Steve Diamond as they struggled to stay afloat and their collective spirit was epitomised as they beat Newcastle 39-5 in their last game before the club collapsed under its debts. The crowd ovation at 65 minutes — to reflect the percentage of pay Warriors staff had received — was a moving moment, before the squad partied into the night.Title predictionHistory dictates that home advantage is a significant factor in the play-offs, so on that basis it makes sense to forecast a Sale v Saracens final on May 27. While Sale have it in them to claim the title, Saracens will be favourites as they unleash a rested England contingent who are familiar with the surroundings at Twickenham.",
        "Team of the yearJ Carpenter (Sale); M Carreras (Newcastle), O Lawrence (Worcester/Bath), O Farrell (Saracens), C Murley (Harlequins); R du Preez (Sale), A Mitchell (Northampton); VR Ruskin (Gloucester), J Montoya (Leicester), M Riccioni (Saracens); H Tizard (Saracens), G Martin (Leicester); T Pearson (London Irish), J Wiese (Leicester), B Earl (Saracens)."
    ]
}