{
    "articleURL": "/tvshowbiz/article-12041117/Inside-Kevin-Costners-colourful-love-life-look-SEVEN-children-ages-39-12.html",
    "content": [
        "Kevin Costner's second wife Christine Baumgartner has filed for divorce from the Yellowstone star after 18 years of marriage and three children together.",
        "The actor, 68, and the model, 49, who married in 2004, are said to have split over 'irreconcilable differences' in a statement published on Wednesday. The former couple are requesting joint custody of their children, Cayden, 15, Hayes, 14, and Grace, 12.  Kevin also shares Annie, 39, Lily, 36, and Joe, 35 — with his ex-wife Cindy Silva, as well as son Liam, 26, with former partner Bridget Rooney. Last year in an interview with People the film star admitted that he is just an 'everyday family man' and like any other parent, is still 'trying to figure it out' as he navigates life with seven children. Here, MailOnline takes a look at Kevin's family, from his eldest daughter aged 39 to his youngest, aged 12. ",
        "Annie CostnerKevin welcomed his first child Annie, 39, with his first wife Cindy Silva on on April 15, 1984, in Los Angeles.Having been born into a showbiz family, Annie often accompanied her dad on set, and even starred as the younger version of Mary McDonnell's character, Stands With A Fist, in Kevin's 1990 film Dances with Wolves. Annie went on to feature as an untitled girl in Waterworld, The Baby-Sitters Club, The Postman, Lazy Teenage Superheroes and of course Yellowstone. She didn't take on much acting outside of her father's films, preferring to take the plunge into producing after attending Brown University and graduating with a degree in Latin American Studies. ",
        "Annie then went on to co-found Sound Off Films in 2014 and produced documentaries including everything from Katy Perry's Witness Tour documentary to a number of nature features. She also works as a real estate agent for Sothebys International in Los Angeles .The businesswoman married Daniel Arturo Cox on her father's Californian estate in 2016. They share two children.   ",
        "Lily CostnerKevin's second daughter to ex-wife Cindy was born on Aug. 4, 1986, in Los Angeles.  Like her older sister, Lily also starred her dad's film, 1995's The Postman as well as Noel Black's 1990 series, The Baby-Sitter club and Yellowstone. She has also worked alongside her famous dad in his American country rock band, Kevin Costner &amp; Modern West. A talented singer, she featured in his song's Oh Malley-Mae and Heaven's Gate amongst others, the latter is featured on the album Tales from Yellowstone. Lily attended university at Wesleyan University in Connecticut,  He told Huff Post in 2014: 'Lily is an amazing singer and songwriter. She can be a really huge star if that's what she wanted. I'm not sure she wants that. 'She's really gifted. Lily's way is not to knock doors down. She's seen the quality of life that we've had and sometimes the idea of stardom, I think, is a mystery to her.'",
        "Joe CostnerAlongside his two daughters, Kevin also shares a son Joe, with his ex-wife Cindy, born in Los Angeles on January 31 1988. Like his sisters he also featured in The Postman and 1996 film Tin Cup before going on to study History at The University Of Colorado Boulder. He has since taken on a more behind-the-scenes role, working as an audio engineer and production sound mixer. Speaking to Huff Post in 2014 Joe just graduated Boulder. He's really gifted in music. He's settling in on what his journey will be... and his mission. ",
        "Liam Costner After his divorce from his first wife, Kevin began a brief relationship with Bridget Rooney, the socialite niece of Pittsburgh Steelers owner Dan Rooney. The couple welcomed a son together, Liam in November 1996, although according to a report from People in 2002, Kevin insisted on a paternity test. The publication revealed that Kevin then 'set up a sizeable trust fund for Liam, and visits him occasionally but not on a regular basis.'Speaking shortly before the birth, Bridget told New York Magazine: 'I’m 110% sure who the father is. I’m just enjoying my pregnancy.'Liam choses to stay out of the spotlight. ",
        "Cayden Wyatt Costner Following his marriage to Christine Baumgartner in 2004, Kevin welcomed his fifth child, a son named Cayden in May 2007. ",
        "The actor shared his hesitance to become a father again, telling Parade after his birth 2008, that he was 'afraid I couldn't be an effective father.'Speaking about Cayden in 2004, Kevin told HuffPost: 'Cayden is just a good older brother. He's so full of life and adventure.'Hayes Logan Costner Kevin and Christine welcomed another son, Hayes on February 12, 2009.Speaking before his birth he told AP Radio that Hayes was 'a great Western name' and revealed he had names his son after a cowboy character in a Western he was planning to film.Hayes is set to star in his dad's upcoming film Horizon, alongside Sienna Miller and Sam Worthington. The film takes places both pre and post the American Civil War and depicts the expansion of the American west.The cast began filming in Utah in August 2022 and wrapped in November. A release date hasn't yet been announced.  'He's very good. Hayes plays the namesake character that I actually play in the movie. He's 13 years old and the screenplay's been around longer than that,' he told People, last year. ",
        "Grace Avery Costner Kevin and Christine welcome their third child, Grace on June 2 2010. The actor revealed that Grace was a 'daddy's girl' in an interview with E! News in 2015, he explained: 'I don’t say \"yes\" all the time but for a while, if you want that real good attention, you have to say \"yes\" a little bit more.'",
        "During an appearance on Today in 2020, Kevin said: 'She's sewing and she's dancing, but when she sees the ball bouncing out in the backyard I can feel her gravitating out with the boys - but everything has to stop when she plays.'"
    ]
}