{
    "articleURL": "/wires/pa/article-12054945/Marnus-Labuschagne-sparkling-Glamorgan-finding-fluency-crease.html",
    "content": [
        "Marnus Labuschagne believes he is starting to find some fluency at the crease with just over a month to go until the Ashes after a sparkling 170 for Glamorgan against Yorkshire.",
        "Labuschagne was given a let-off on 11 when a diving Finlay Bean could not cling on to a tough chance at backward point on the third morning of the LV= Insurance County Championship Division Two fixture.There was no second opportunity offered from Australia’s number three, who moved expertly through the gears at Headingley with a mixture of conventional and more unorthodox strokes.Ominously for England, who begin their bid to reclaim the urn at Edgbaston on June 16, this innings is the first time since returning for another stint at Glamorgan that Labuschagne has felt comfortable in the middle.“I have been a bit sort of all over,” Labuschagne said. “It hasn’t felt like it has come together until that innings.“That’s probably the most I’ve felt balanced at the crease, I felt like my head position was in a nice spot, my bat path was coming down nicely. That was probably the best time I batted.”Some counties have come under scrutiny for recruiting Australia players before the Ashes, with Steve Smith the notable example as he is adjusting to English conditions in a three-game stint with Sussex.Labuschagne, who has not looked back since getting his big break with Australia in the 2019 Ashes after starring for Glamorgan that summer, has another couple of fixtures with the Welsh county before linking up with his national side ahead of their World Test Championship final against India next month.",
        " For me it is taking it game-by-game and trying to build up that momentum that leads into the World Test Championship and the Ashes. But my focus is to win games for Glamorgan  Marnus Labuschagne  Despite contributing 235 runs to Glamorgan’s cause this week on a ground that will host the third Ashes Test in two months’ time, Labuschagne insisted his priorities are not on his international commitments.“I have given that much thought, but I have really enjoyed batting here,” Labuschagne said. “I have always enjoyed the bounce and carry.“It allows me to leave the ball nicely on length and be able to make good decisions early. There’s enough pace in the wicket that you can score quite freely, once the wicket quickens up a little bit.“For me it is taking it game-by-game and trying to build up that momentum that leads into the World Test Championship and the Ashes. But my focus is to win games for Glamorgan.”Labuschagne was watchful in helpful bowling conditions early on but motored along after going past his 104-ball half-century, requiring only 38 and 44 deliveries respectively for his second and third 50s.",
        "Dom Bess bore the brunt, conceding 58 runs in the 41 deliveries he sent down to Labuschagne, who also hit compatriot Mickey Edwards out of the attack with five fours in the space of six balls after backing away and agriculturally muscling across the line as the ball was dispatched to all parts.",
        "After his excellent innings, Labuschagne cheerfully admitted he will regale good friend and team-mate Smith about his efforts.“We speak most days so I’m sure he’ll have a debrief with me on his game and I’ll debrief him on what happens on my game,” Labuschagne said.“We’re quite across what’s going on, we sit back here and watch all the runs around the county. I’ve got a big interest in the game so I’m always watching.”Labuschagne’s knock helped Glamorgan declare on 352 for four but their push for victory was thwarted by rain wiping out the last session, with Yorkshire only needing to bat out the final day for a draw after being set a notional 492 for victory.“It’s slightly frustrating,” Labuschagne added. “We would’ve liked at least 20 overs at them before the close. It’s not ideal but we are going to have 96 overs to get 10 wickets (on Sunday).”"
    ]
}