{
    "articleURL": "/wires/afp/article-12039043/Fresh-rout-US-regional-banks-despite-First-Republic-deal.html",
    "content": [
        "Shares of US regional banks suffered deep losses on Wall Street Tuesday, dashing hopes that the resolution of First Republic's woes would end the crisis.",
        "While large banks like Citigroup and Bank of America fell, the ugliest losses came at the same regional banks that have seen pressure since the March demise of Silicon Valley Bank the risks facing the group.These include Los Angeles-based PacWest Bancorp (-24 percent), Western Alliance Bancorporation (-16 percent) of Phoenix, Zions Bancorporation (-11 percent) of Utah and Cleveland-based KeyCorp (-9 percent).The declines came on a turbulent day for global markets that saw oil prices slump on recession worries amid growing worries of a US debt default due to a standoff between Democratic President Joe Biden and the Republican-led House of Representatives.But the performance of bank stocks was a source of angst.\"There is clearly worry that this bank situation is not going to calm down after First Republic,\" said LBBW's Karl Haeling. \"It's just going to get worse.\"Haeling said the latest selloff poses challenges to the Federal Reserve, which is expected to lift interest rates again Wednesday.\"The market is saying today that they are just looking to other banks to go after,\" Haeling said.- Fleeting relief -The battering on Wall Street comes a day after JPMorgan Chase acquired most of First Republic in a deal engineered by the Federal Deposit Insurance Corporation, which had seized control of the weakened smaller institution.",
        "While the FDIC move prompted a sigh of relief, leading regional banks notably suffered losses on Monday in what turned out to be a forerunner of Tuesday's much worse session.At a briefing with reporters, Goldman Sachs analyst Ryan Nash said Tuesday there is \"going to continue to be pressure\" on bank deposits in the wake of the shift in Fed policy..The Fed's pivot to suddenly higher interest from a lengthy period of low or near-zero rates has forced banks to increase the interest they pay customers in order to avoid a loss of deposits.That dynamic means banks must compete with each other for deposits, cutting into profits. But Nash also said the role of deposit runs in the failures also affected bank clients.\"If you're a corporate treasurer, you have to be asking yourself, particularly after yesterday, does it make sense to leave my deposits in a bank where I might have to deal with any sort of resolution, whether it's being bought by a larger bank, or going through the FDIC process?\" Nash said.The resolution of the First Republic crisis also underlined the disadvantage of smaller banks next to a giant like JPMorgan, the nation's biggest bank by assets.While three other midsized banks -- PNC Financial Services, Fifth Third Bancorp and Citizens Financial Group -- participated in the FDIC bidding process, the agency picked JPMorgan because it offered more money and could more easily integrate the branches into its network, according to reports in US financial media.",
        "\"JPMorgan winning the deal shows that regulators will be willing to allow banks to fail and allow them to fall in the hands of big banks, which obviously is a negative for regional banks,\" Nash said.\"The FDIC is telling you, what all regional banks and regional bank analysts have known and feared for a while is that whether the regulator wants it or not, the JPMorgan and the like is the winning business mode and that does leave the regional at a big disadvantage.\""
    ]
}