{
    "articleURL": "/sport/football/article-12059863/Youre-not-fit-wear-shirt-Leicester-fans-FUME-half-capitulation-Fulham.html",
    "content": [
        "Leicester fans were fuming at the team after an awful first 45 minutes in LondonFoxes supporters yelled 'You're not fit to wear the shirt!' towards their players Read Matt Barlow's match report from Craven Cottage as Fulham won 5-3 Leicester City fans were left fuming at their team's first-half performance, which saw them fall 3-0 down to Fulham in the opening 44 minutes at Craven Cottage.",
        "The Foxes travelled to London for the first of their final four games which will decide Leicester's Premier League fate just seven years after lifting the famous trophy.  Footage showed visiting fans yelling 'You're not fit to wear the shirt!' in the direction of the leaving Leicester players after their first-half collapse.Dean Smith's side showed a little more fightback, scoring three times in the second half, but also conceded a further two to lose the match 5-3.  The result is likely to be a pivotal one in Leicester's bid to escape relegation from the Premier League - just seven years after their top-flight triumph in the 2015-2016 season. ",
        "Leicester went into Monday's game in 16th place, only ahead of Leeds United and Nottingham Forest on goal difference - which was hit by Fulham's rampant first-half goalscoring courtesy of Willian, Carlos Vinicius and Tom Cairney.Cairney and Willian both got their second goals of the game after the break.While Leicester instigated a fightback, with Harvey Barnes getting his own brace, and James Maddison converting from the penalty spot, they finished on the losing side of a 5-3 defeat next to the River Thames.  ",
        "Dean Smith was brought in to Leicester last month to try and get the team out of danger following the sacking of Brendan Rodgers, but performances like this mean that there are serious fears the Foxes will be plying their trade in the Championship in August.",
        "Leicester's fate as a Premier League side looked in serious jeopardy, before a win against Wolves and draws with Leeds and Everton pushed them closer to safety. However, the first-half at Craven Cottage may have a damaging effect on Leicester's Premier League survival, with their remaining games against Liverpool, Newcastle and West Ham.  Earlier this week, it was claimed that Swansea manager Russell Martin was a potential target for Leicester if they are relegated to the second-tier of English football.  "
    ]
}