{
    "articleURL": "/wires/ap/article-12048745/Bucks-fire-Budenholzer-coach-early-playoff-exit.html",
    "content": [
        "MILWAUKEE (AP) - The Milwaukee Bucks have fired coach Mike Budenholzer just over a week after their stunning first-round playoff loss to the Miami Heat spoiled a season in which they owned the NBA´s best record.",
        "Budenholzer´s ouster comes just two years after he directed the Bucks to their first NBA title in half a century. The move also comes three weeks after the NBA finalized Cleveland Browns owner Jimmy Haslam´s purchase of a 25% stake in the team.\"The decision to make this change was very difficult,\" Bucks general manager Jon Horst said Thursday in a statement announcing the move. \"Bud helped lead our team for five incredible seasons, to the Bucks´ first title in 50 years, and into an era of sustained success. We are grateful for the culture of winning and leadership that Bud helped create in Milwaukee.\"This is an opportunity for us to refocus and re-energize our efforts as we continue building toward our next championship season.\"The Bucks posted the most combined regular-season and playoff wins of any team during Budenholzer´s tenure and had the league´s best regular-season record in three of his five seasons on the job. He posted a 271-120 regular-season record and 39-26 playoff mark in Milwaukee.With a roster featuring two-time MVP Giannis Antetokounmpo, Budenholzer´s Bucks soared to heights the franchise hadn´t reached since Kareem Abdul-Jabbar was wearing a Milwaukee uniform in the early 1970s.",
        "But with the notable exception of that 2021 championship season, the Bucks couldn´t match their regular-season success in the postseason.",
        "The Bucks didn´t reach the NBA Finals during any of the three seasons in which they had the league´s No. 1 playoff seed. They had a 2-0 lead over Toronto in the 2019 Eastern Conference finals before losing four straight. They lost 4-1 in the second round to the Miami Heat in the 2020 East semifinals at the Walt Disney World playoff bubble.This year´s playoff exit was particularly devastating.The Bucks suffered fourth-quarter collapses in each of their last two games and lost 4-1 to the eighth-seeded Heat. They were just the sixth No. 1 seed to lose to a No. 8 seed in the opening round, and the only No. 1 seed that failed to win more than one playoff game.\"There´s a ton of disappointment when your season ends, no matter how it happens,\" Budenholzer said afterward. \"It´s a hard feeling. It´s a disappointing feeling.\"Milwaukee owned a 12-point lead at Miami in Game 4 before getting outscored 30-13 over the last six minutes of a 119-114 loss in which the Heat´s Jimmy Butler scored 56 points. They were up 16 at home to start the fourth quarter of Game 5, but lost 128-126 in overtime after Butler made a tying basket with half a second left in regulation.",
        "Budenholzer, 53, acknowledged the Bucks should have called a timeout after Butler´s tying basket, giving them a chance to make a buzzer beater that could have prevented overtime. The Bucks also declined to call a timeout when they got the ball back while trailing by two points in the closing seconds of overtime, and they weren´t able to attempt a shot before the game ended.Antetokounmpo said after the game the Bucks didn´t make enough adjustments in how they defended Butler, who averaged 37.6 points in the series.Antetokounmpo, who was playing with a bruised lower back, said he would have liked more opportunities to guard Butler.The removal of Budenholzer comes as the Bucks enter a critical offseason. Brook Lopez, a finalist for the NBA defensive player of the year award this season, is a free agent. Three-time All-Star Khris Middleton could become a free agent as well if he doesn´t pick up his $40.4 million player option for 2023-24.Budenholzer´s exit means that three of the last four NBA champions have since fired their coaches.Nick Nurse led Toronto to the 2019 title but was ousted last month after the Raptors´ season ended with a loss to the Chicago Bulls in a play-in game. Frank Vogel coached the Los Angeles Lakers to the 2020 championship and was fired after missing the playoffs last season. The exception is Steve Kerr, coach of the defending champion Golden State Warriors.",
        "\"On the one hand, we all know what we´re getting into when we get into this business,\" Kerr said Thursday when he was asked about Budenholzer´s firing. \"So my first response is not necessarily shock, it´s more disappointment because Bud is a fantastic coach... just won a championship and has been wildly successful in his coaching career. But this is the business we´re in.\"Budenholzer´s teams had some bad luck with injuries during the postseason.Middleton sprained his left medial collateral ligament in Game 2 of an opening-round series with the Chicago Bulls last year and missed the rest of the playoffs as the Bucks ended up losing their second-round matchup with the Boston Celtics in seven games.Antetokounmpo sprained his ankle in Game 4 against Miami in 2020 and missed the rest of that series, though the Bucks already trailed 3-0 when he got hurt. Antetokounmpo exited Game 1 of this year´s Heat series with the back issue that caused him to miss Games 2 and 3. The Bucks won the 2021 title even though a hyperextended knee prevented Antetokounmpo from playing the final two games of the Eastern Conference finals with the Atlanta Hawks..Budenholzer came to Milwaukee after going 213-197 in five seasons with Atlanta. He was an assistant coach with the San Antonio Spurs from 1996-2013 and was on Gregg Popovich´s staff for four championship seasons (1999, 2003, 2005, 2007).",
        "___AP Sports Writer Janie McCauley contributed to this report.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}