{
    "articleURL": "/sport/nba/article-12040173/New-York-Knicks-beat-Miami-Heat-111-105-tie-series-game-apiece.html",
    "content": [
        "Randle retuned form ankle injury to record a double-double with 25 pts &amp; 10 rebsJimmy Butler sat out for the Heat with a sprained right ankle suffered last gameDailyMail.com provides all the latest international sports news The A-List stars turned out in force Tuesday night to watch the New York Knicks bounce back and topple the Miami Heat in their Eastern Conference semifinals series. ",
        "Jalen Brunson scored 30 points and keyed the run the New York Knicks needed just in time to get by a Miami Heat team playing without Jimmy Butler, evening the Eastern Conference semifinals at a game apiece with a 111-105 victory Tuesday night.Julius Randle returned from a sprained left ankle that sidelined him in Game 1 with 25 points, 12 rebounds and eight assists, and RJ Barrett scored 24 points for the No. 5-seeded Knicks. Josh Hart finished with 14 points, 11 rebounds and nine assists.But it was Brunson, who pointed the blame at himself and said he had to be better after going 0 for 7 from 3-point range in the opener, who made the biggest plays in a game the Knicks trailed much of the way.And, the Knicks delivered the bounce back in front of New York royalty as director and renowned fan Spike Lee cheered on his team, while other stars watched on. ",
        "New Jets quarterback Aaron Rodgers was back at Madison Square Garden again after his weekend sports-fest. The four-time MVP has already been making the most of his time in New York City since being traded from the Green Bay Packers, first attending the Rangers' playoff game against the New Jersey Devils. He then returned to Madison Square Garden Sunday night for Game 1 of the New York Knicks' semifinal series against the Miami Heat before turning up for Game 2 Tuesday night too. ",
        "The NFL veteran was given a warm New York welcome as the MSG crowd gave out a loud cheer when his face was shown on the big screen. Looking slightly humbled, the signal caller smiled for the camera and waved to his adoring fans. Actors Jessica Alba and Michael Rainey Jr. were also in attendance, with Alba looking glamorous in a snake-skin print blazer to soak in the action. ",
        "Meanwhile tennis legend Roger Federer was not on the court for once as he watched the action with wife, one day after co-chairing the Met Gala. Alongside Dua Lipa, Federer was one of the chairs for the 2023 Met Gala Monday night as had said that it makes sense for athletes to be at the Met Gala because they've become a bigger part of the fashion world in recent years. Former New York Mayor, Michael Bloomberg, even made a rare appearance at the basketball game with wife Diana Taylor.  Caleb Martin scored 22 points in place of Butler for the Heat, who host Game 3 on Saturday afternoon. The Heat will hope to have Butler, the leading scorer in the playoffs who sat out after spraining his right ankle late in their 108-101 victory in the opener. They almost didn't need him.",
        "Miami had a six-point lead midway through the fourth quarter thanks to undrafted players Martin and Gabe Vincent before Brunson, who had been listed as questionable with a sore right ankle, took over.",
        "He made a 3-pointer that became a four-point play when Isaiah Hartenstein was fouled on the play, and the point guard then scored to knot it at 93.The Heat went back up 96-93 on Vincent's three free throws, but Josh Hart tied it with a 3 before Brunson hit a 3 and scored again to make it 101-96 with 2:48 remaining.Brunson went 6 of 10 behind the arc.Randle was originally hurt against Heat in a victory March 29 after starting the first 77 games.He returned for the start of the playoffs but wasn't sharp for much of the series against Cleveland before reinjuring the ankle in the Game 5 clincher.He was much better Tuesday for a Knicks team trying to advance to the Eastern Conference finals for the first time since 2000, when they got there after beating Miami in seven games.Randle had assists on two of the Knicks' first three baskets, with the Heat paying extra attention to him and leaving shooters open on the perimeter. But the No. 8-seeded Heat stayed right with them by making six 3-pointers and the Knicks led just 31-29 after one.Like in the opener, the Heat dug in defensively from there. ",
        "They limited the Knicks to just two baskets in the first 8 1/2 minutes of the second, building their lead to 46-38, and were ahead 54-51 at the break after Kevin Love's 3-pointer with 6.1 seconds remaining.",
        "The Knicks finally went back into the lead when Brunson hit a couple 3s and then another basket, but Vincent's basket sent Miami to the fourth with a 77-76 edge. Vincent scored 21 points, Max Strus finished with 17 points but missed part of the second half after going to the locker room with a bruised lower back. Along with the long list of famous personalities that is an extremely normal occurrence along 'celebrity row' at MSG, Knicks legends Carmelo Anthony, Amar'e Stoudemire, and Benard King were also in attendance."
    ]
}