{
    "articleURL": "/tvshowbiz/article-12039669/Ringo-Starrs-son-Zak-Starkey-joins-Oasis-Andy-Bell-Happy-Mondays-Shaun-Ryder-form-supergroup.html",
    "content": [
        "Glastonbury is set to be taken by storm after five 90s legends formed their own supergroup Mantra of the Cosmos. ",
        "Ringo Starr's son, and The Who drummer, Zak Starkey, 57, has joined forces with Oasis bassist Andy Bell, 52, as well as Happy Mondays' Shaun Ryder, 60, and Bez, 59. With Shaun telling The Sun: 'We've been making a new album for BMG. It's a bit of a mixture of all us lot together'.'It doesn't sound like the [happy] Mondays or [his current band] Black Grape, or Oasis or The Who, it's what we are doing all together'.Before adding: 'It's coming out very soon. we're doing Glastonbury with Manta of the Cosmos this year, It's coming out pretty soon'. ",
        "MailOnline have contacted the musician's reps for comment.  In March Lana Del Rey implied she could pull out of Glastonbury after the festival's line-up announcement.The singer, 37, is one of the acts that was revealed to be part of the line-up was displeased about how she was announced.Arctic Monkeys and Guns N’ Roses were announced as the final two headliners, joining Sir Elton John at the top of the bill. But Lana pointed out that she would be playing top billing on the Other Stage, which Glastonbury failed to mention.She also appeared all the way down the poster with more than 20 names of other acts listed before her.Lana showed her annoyance, by commenting on the official Glastonbury post on Instagram, writing: 'Thanks for announcing that I was headlining the other stage. Thumbs up.'",
        "According to reports, she also took to her own private Instagram to share the poster and add: 'Well, I’m actually headlining the 2nd stage.'Then hinting she may be pulling out, she said: 'But since there was no consideration for announcing that we’ll see.'",
        "Her fans took her side and commented on Glastonbury's post asking why Lana hadn't been listed higher.One said: 'Why Lana isn’t in the top row? Wtf'.While another echoed: 'Why isn’t Lana headlining the main stage.'And a third agreed, writing: 'Imagine not mentioning Lana in the caption she’s the biggest of all headliners'. It comes after Glastonbury Festival organiser Emily Eavis has spoken out in defence of the 'boring' line-up of all male acts.The line-up includes Lizzo, Lewis Capaldi, The War On Drugs, Christine And The Queens, Thundercat, Lil Nas X, Carly Rae Jepsen and Manic Street Preachers. Yet fans were quick to remark at the lack of female talent booked.Out of the 30 headline acts announced since 2010 only four have been women - Beyonce, Adele, Billie Eilish, Florence and the Machine - with Emily claiming it's due to a 'problem in the pipeline.' ",
        "She told The Guardian: 'We’re trying our best so the pipeline needs to be developed. This starts way back with the record companies, radio. I can shout as loud as I like but we need to get everyone on board.' ",
        "She added that they remain 'entirely focused on balancing our bill. It’s not just about gender, it’s about every aspect of diversity.' Emily went on to commit to having two female headliners next year and said Lizzo - who will perform just before Guns N' Roses - would have been booked to headline this year but the positions had already been locked in by the male acts. Yet fans were unimpressed, taking to Twitter to share: '@glastonbury do better!!! All male headliners? You can’t even blame lack of talent, there is a overwhelming WEALTH of amazing women to choose from';   'Always brilliant but that’s not the best line up. Elton should be Saturday night. Would be great to see ACDC headline one year. Eminem. Madonna. Phil Collins for the legend slot.'; 'Absolutely shocking compared to other years';",
        "'@glastonbury @ArcticMonkeys and @gunsnroses Worst Glastonbury line up in years if ever'; 'Situations like this year's Glastonbury lineup are a direct symptom of industry failures to support female artists from the ground up. Getting them on the smaller stages, on radio, at live venues.''No guys you don't understand, Glastonbury HAD to book Guns N Roses to headline a festival in 2023 because there are simply no women whatsoever in music'; 'During Women's History Month, Glastonbury Festival announced an all-male headline bill. In 2023. Tell me why we don't need this month one more time.';",
        "'Stormzy wasn't at big festival headliner status when he did Glastonbury and look what he did with the platform. Seems unusually backwards to not allow that same opportunity to literally any women.'; 'Just a bit boring';'During Women's History Month, Glastonbury Festival announced an all-male headline bill. In 2023. Tell me why we don't need this month one more time.' ",
        "Glastonbury 2023: Is the festival sold out? When's the ticket resale? Here's EVERYTHING you need to know about getting a wristband - after final two headliners announced."
    ]
}