{
    "articleURL": "/wires/reuters/article-12053489/NEWSMAKER-Turkeys-Kilicdaroglu-exits-Erodogans-shadow-election-race.html",
    "content": [
        "Turkey holds presidential election on May 14",
        "Opinion polls show Kilicdaroglu has slight leadAnkara could see new path after two decades under ErdoganKilicdaroglu backed by alliance of six opposition partiesBy Daren ButlerISTANBUL, May 6 (Reuters) - Stuck in Tayyip Erdogan's shadow throughout his career, opposition leader Kemal Kilicdaroglu believes his time has come to set Turkey on a new path and roll back much of the legacy of the man who has dominated politics for two decades.An alliance of six opposition parties named the earnest and sometimes feisty former civil servant as its candidate to take on Erdogan in the May 14 elections, which are seen as perhaps the most consequential in the country's modern history.Opinion polls generally show Kilicdaroglu, 74, holding an edge, and possibly winning in a second round vote, after an inclusive campaign promising solutions to a cost-of-living crisis that eroded the president's popularity in recent years.He has pledged a return to orthodox economic policies and the parliamentary system of governance, independence for a judiciary critics say Erdogan has used to crack down on dissent, and somewhat smoother relations with the West.The opposition's turnaround plan aims to cool inflation that hit 85% last year, even as it is expected to bring financial market turmoil and potentially the latest in a series of currency crashes.",
        "\"I know people are struggling to get by. I know the cost of living and the hopelessness of young people,\" Kilicdaroglu told a rally last week. \"The time has come for change. A new spirit and understanding is necessary.\"Detractors say Kilicdaroglu - who is scorned by Erdogan after suffering repeated election defeats as chair of the Republican People's Party (CHP) - lacks his opponent's power to rally audiences and fails to offer a clear vision for a post-Erdogan era.He is looking to build on the opposition's 2019 triumph when the CHP defeated Erdogan's ruling AK Party in Istanbul and other big cities in local elections, thanks to support from other opposition party voters.Even if he prevails, Kilicdaroglu faces challenges keeping an opposition alliance including nationalists, Islamists, secularists and liberals united. His selection as candidate came after a 72-hour dispute in which the leader of the second-biggest party, IYI's Meral Aksener, briefly walked out.He \"portrays a totally opposite image from Erdogan, who is a polarizing figure and fighter who ... consolidates his voter base,\" said Birol Baskan, a Turkey-based author and political analyst.\"Kilicdaroglu appears much more statesmanlike, trying to unify and reach out to those not voting for them... That is his magic, and very difficult to do in Turkey,\" he said. \"I'm not sure he will win, but he, Kilicdaroglu, is the right character at the right time.\"",
        "Polls suggest a tight presidential and parliamentary vote, which will decide not just who leads Turkey but what role it may play to ease conflict in Ukraine and the Middle East.Many wonder whether Kilicdaroglu can defeat Erdogan, the country's longest-serving leader, whose campaigning charisma has helped deliver more than a dozen election victories.But analysts say Erdogan is closer than ever to defeat despite his heavy hand on the media, courts and the government's record fiscal spending on social aid ahead of the vote.The opposition has stressed that Erdogan's drive to slash interest rates set off the inflationary crisis that devastated household budgets. The government says the policy stoked exports and investment as part of a programme encouraging lira holdings.HEALING OLD WOUNDSBefore entering politics, Kilicdaroglu worked in the finance ministry and then chaired Turkey's Social Insurance Institution for most of the 1990s. In speeches, Erdogan frequently disparages his performance in that role.A former economist, he became an MP in 2002 when Erdogan's AKP first came to power, representing the centre-left CHP, a party established by modern Turkey's founder Mustafa Kemal Ataturk which has struggled to reach beyond its secularist grassroots toward conservatives.However, he has spoken in recent years of a desire to heal old wounds with devout Muslims and Kurds.",
        "Kilicdaroglu rose to prominence as the CHP's anti-graft campaigner, appearing on TV to brandish dossiers that led to high-profile resignations. A year after losing a mayoral run in Istanbul, he was elected unopposed as party leader in 2010.At that party convention, a campaign song blasted across a packed hall describing him as \"a clean and honest\" man. Wearing a striped shirt and a black blazer, Kilicdaroglu told supporters: \"We are coming to protect the rights of the poor, the oppressed, the workers and labourers\".His election fuelled party hopes of a new start, but support for the CHP has since failed to surpass about 25%. Erdogan's AK party polled 43% in the last parliamentary elections of 2018.Still, some view Kilicdaroglu as having quietly reformed the party and sidelined hardcore \"Kemalists\" espousing a rigid version of the ideas of Ataturk, while promoting members seen as more closely aligned with European social democratic values.Critics say he has failed to bring flexibility to a static CHP and, in the end, imposed himself as presidential candidate over others who polled better head-to-head against Erdogan.Born in the eastern Tunceli province, Kilicdaroglu is an Alevi, a minority group that follows a faith drawing on Shi'ite Muslim, Sufi and Anatolian folk traditions.Last month he openly acknowledged this on social media, seeking to blunt any political attacks given Alevis' beliefs put them at odds with the country's Sunni Muslim majority.",
        "Nicknamed by Turkish media as \"Gandhi Kemal\" because of a passing resemblance with his slight, bespectacled appearance, he captured the public imagination in 2017 when he launched his 450 km \"March for Justice\" from Ankara to Istanbul over the arrest of a CHP deputy.Last week in the mainly Kurdish city of Van, thousands of people rallied for Kilicdaroglu, who has received the endorsement of the big pro-Kurdish Peoples' Democratic Party even though it is not in the main opposition alliance.\"I have been boycotting the elections since 2018 but I will vote for Kemal Kilicdaroglu this time. The rise of radical Islamists motivates me,\" said Faruk Yasar, 27, a Kurdish technician in the southeastern province of Batman. (Additional reporting by Burcu Karakas and Jonathan Spicer; Editing by Alexandra Hudson)"
    ]
}