{
    "articleURL": "/wires/reuters/article-12041447/Stocks-climb-red-traders-wait-Fed.html",
    "content": [
        "MSCI AxJ index down 1%; gold above $2,000 an ounce",
        "China and Japan out for holidaysFed decision due 1800 GMT, 25bp hike expected(Adds quote in paragraph 6, updates prices throughout)By Nell Mackenzie and Tom WestbrookLONDON/ SINGAPORE, May 3 (Reuters) -European stocks and U.S. stock futures rose on Wednesday with hopes hinging on the Federal Reserve signalling later in the day that U.S. interest rate hikes might peak soon and the soft landing that central banks have been angling for is in sight.The pan-European STOXX 600 index was up almost 0.5% after Tuesday's sharp selloff. S&amp;amp;P 500 futures edged up 0.1% but the mood was cautious, with banks in the crosshairs.On Tuesday, U.S. regional banks were hammered, with PacWest Bancorp down 27.8%, Western Alliance Bancorp , tumbling 15.1% and Comerica Inc falling 12.4%.The slide in regional bank stocks weighed on Wall Street, and oil was also left nursing large losses with fears that banks tightening up on lending along with a slowing job market were harbingers of a looming broader slowdown.Markets are all but certain the Federal Reserve will announce a 25 basis point rate hike at 1800 GMT. If that happens, the focus will be on whether or how hard Fed Chair Jerome Powell pushes back on investors' expectations for rate cuts by year's end.",
        "\"The hike will be a contemplative one that acknowledges heightened two-way risks and a narrower path to a soft-landing,\" said Vishnu Varathan, head of economics at Mizuho Bank in Singapore.In Europe, where the crisis of confidence in banks forced Credit Suisse into the arms of larger rival UBS six weeks ago, lenders are sharply turning off the credit taps, data on Tuesday showed, perhaps making a case for a smaller European Central Bank rate hike this week.\"This reinforces the idea of 25bps from the ECB this week rather than 50bps,\" said NatWest Markets' rates strategist Jan Nevruzi.\"The market consensus is for a soft landing and every hint in that direction, if you trust the Fed and the ECB, should be a source of good news for equities and credit,\" said Florian Ielpo, head of macro at Lombard Odier Investment Managers.Markets face a \"macro heavy week\" said Ielpo, with investors looking back at a strong first quarter earnings season but anticipating that Friday's U.S. jobs report might reveal a deteriorating macro economic situation.Markets in China and Japan were shut for a holiday. Hong Kong's shares fell, dragging MSCI's broadest index of Asia-Pacific shares, ex-Japan, down about 0.7%.Bonds and gold held gains. The dollar, slipping, was caught in the crosswinds of falling yields and rising nerves.",
        "EYES ON THE FEDCurrency markets were steady and awaiting direction from the Fed. The euro was last up 0.4% at $1.1042, ahead of Thursday's ECB meeting.Elsewhere, the Australian dollar lay flat after the previous day's 0.5% gain following a surprise rate increase from the Reserve Bank of Australia.Brent crude, which dropped 5% overnight, fell further and was last down about 2% to $73.83 a barrel.Gold hovered above $2,016 an ounce, little changed on the day.Two-year U.S. treasury yields fell 5 bps to around 3.94% and 10-year yields fell 4 bps to around 3.39% .Investors have a wary eye on the looming U.S. debt ceiling, with lawmakers squabbling and Treasury Secretary Janet Yellen warning the government might run out of money as soon as June 1.Yields on Treasury bills maturing around then have spiked .\"Either this game is over within a few weeks or we are going to see a suspension of the debt limit until later this year,\" said Rabobank strategist Philip Marey. \"In both cases, we are not likely to see any solution until financial markets start to panic.\" (Editing by Lincoln Feast and Kim Coghill)"
    ]
}