{
    "articleURL": "/wires/aap/article-12038735/Albanese-meets-King-Buckingham-Palace.html",
    "content": [
        "Prime Minister Anthony Albanese is expected to publicly swear allegiance to King Charles at his coronation after extending an invitation for the monarch to visit Australia.",
        "The prime minister had a private audience with King Charles at Buckingham Palace in London ahead of the coronation at the weekend.\"It was a pleasure to meet King Charles III again at Buckingham Palace and an honour to represent Australia at his coronation,\" Mr Albanese said after the meeting.Mr Albanese reiterated during the audience that the King and other members of the royal family were welcome to visit Australia.The prime minister is among a contingent of Australians invited to the coronation along with Governor-General David Hurley and state governors.In an interview with broadcaster Piers Morgan, Mr Albanese said he would do \"what is entirely appropriate as the representative of Australia\" when asked if he would swear the oath of allegiance to the King.Members of the public watching the coronation have been asked to join the oath, but several prominent ministers have said they will not take part in the pledge.Treasurer Jim Chalmers said he was \"unlikely\" to pledge allegiance or watch the ceremony.The Australian Republican Movement had called for Mr Albanese to stay silent during the oath.Australian Monarchist League national chair Philip Benwell said the prime minister was hypocritical for indicating he would swear allegiance while not doing more to encourage the nation to celebrate the coronation.",
        "\"This is the first coronation most Australians would be able to participate in ... he's blocked it because he is a republican, introducing a republic by stealth,\" he told AAP.Greens leader Adam Bandt said the government should be focused on the future.\"This should be a moment that we're having a debate about what kind of country we want to be,\" he said.\"Who should be our head of state, and the government seems to be taking that off the table.\"Mr Albanese told Morgan he had a lot of respect for King Charles despite being a lifelong republican, adding that he did not expect to see an imminent referendum on removing the monarch as head of state.\"When the demand is there, I'm sure a vote will be held,\" he said.The Australian delegation attending the coronation includes Matildas captain and football star Sam Kerr, singer Nick Cave, Aboriginal artist Jasmine Coe, comedian Adam Hills and London-based nurse Emily Regan.In honour of the coronation, the Australian government will contribute $10,000 to the West Australian conservation charity Friends of the Western Ground Parrot.Mr Albanese said King Charles long championed conservation and the government was pleased to mark the event by helping to protect the critically endangered bird.The King, who is the monarch of 14 overseas realms including Australia, will host a lunch for prime ministers and governors-general at Buckingham Palace and also attend a Commonwealth Heads of Government Meeting on Friday, the day before his crowning.",
        "Mr Albanese said he would be meeting with other world leaders to strengthen Australia's relationships around the world during his visit to the UK.On Sunday, Australia's Federation Guard will fire a national 21-gun salute from the Parliament House Forecourt, followed by a Royal Australian Air Force flypast."
    ]
}