{
    "articleURL": "/news/article-12039035/Karine-Jean-Pierre-blasts-dramatics-asked-claim-immigration-90.html",
    "content": [
        "Jean-Pierre said illegal immigration is down 90% but current trends could see another record breaking year Border agents say they have intercepted over 73,000 illegal immigrants in the past 10 days alone On Tuesday she shut down a question and said she was referring to parole programWhite House Press Secretary Karine Jean-Pierre got in a tense exchange at Tuesday's daily press briefing when she was asked to defend a claim that illegal immigration had dropped 90 per cent.",
        "Fox News correspondent Peter Doocy put the question to her, on a day when she also shut down a reporter's question about why President Joe Biden hadn't acknowledged his seventh grandchild amid a Hunter Biden custody dispute. 'You said yesterday that when it comes to illegal migration, you've seen it come down by more than 90%. Where did that number come from?' Doocy asked her.He tried to cite an increase in migration, as reported by Customs and Border Protection. 'I hear you, I'm about to answer, she told him amid cross talk. ",
        "'If the dramatics would come down just a little bit,' she admonished him, before telling him: 'I'm going to answer.' 'What's dramatic about asking a question?' he asked her. Then Jean-Pierre indicated that she was referencing a particular program at her Monday briefing.'So I was speaking to the parolee program.  As you know, the President put in place a parolee program to deal with to deal with certain countries on on ways that we can limit illegal migration. And we have seen the data has shown us that is gone down by more than a percent. That was what I was speaking to,' she said.Before Doocy could press her for clarification she told him: 'We're going to go. We're going to move,' and called on another questioner. ",
        "The parolee program she referenced Tuesday involves extending a program used for Venezuelans to Nicaragua, Haiti, and Cuba, letting up to 30,000 people per month from the countries be vetted and then come to the country for two year periods with work authorizations. She didn't otherwise provide a time window she was referring to with the 90 per cent figure. Bill Melugin, a Fox correspondent in Los Angeles called her cleanup effort 'false.''There was a window of time earlier this year where encounters with Venezuelans, Nicaraguans, and Cubans did temporarily dip 90% after a policy change, but other countries, like China, shot up over 800%. Illegal crossings, including Venezuelans, back at peak highs now.'Officials have made internal projections that southern arrivals could spike between 10,000 and 13,000 per day with the end of Title 42 restrictions May 11, CBS News reported.  The tense exchange came after she was accused of telling a 'blatant lie' after claiming that illegal immigration dropped by 90%. During a press conference on Monday, Jean-Pierre was questioned on how President Biden plans to deal with illegal immigration.The press secretary insisted the administration had already put forward efforts to address the ongoing issues at the border. She said: 'On his first day in this administration the President put forth a comprehensive immigration legislation and that's to show how serious he took this.",
        "'The system had been broken, it needs to be modernized, to be moved to the 21st century and so this is something the President has talked about.'In the meantime, he has tools that he has used to make sure that we do this, that we actually deal with the immigration system in a humane way, in a way that actually deals with what we are seeing at the border.'When it comes to illegal migration you have seen it come down by more than 90% and that is because of the actions this President has taken.'   Statistics published by the U.S Customs and Border Protection show that in March of this year there was 257,910 nationwide encounters across all borders.The figures for March brought the total number of encounters in the U.S. to 1,544,087 this year. Current trends could see the total number of crossings break last years record of 2.76 million. On social media, Jean-Pierre was slammed for her comments which GOP Chairwoman Ronna McDaniel said where a 'blatant lie'. ",
        "She tweeted: 'This is a blatant lie from the Biden administration. This is the worst border crisis on record.  'They created the crisis, and now they are denying it exists.'Senior advisor to former President Trump Stephen Miller tweeted: 'We are suffering through the largest tidal wave of illegal immigration in human history and it’s not even close.'",
        "Washington Free Beacon reporter Chuck Ross said: 'Maybe the biggest lie from the White House podium so far this year.'",
        "Meanwhile, US Border Patrol Chief Raul Ortiz shared an update on Monday of their work over the weekend and what they had halted going over the border.He tweeted: 'Past 72 hours. 2 agents assaulted, 22,220 apprehensions, 806lbs methamphetamine, 283lbs marijuana, 62lbs cocaine, 3 firearms, 5 maritime events, 2 sex offenders, 2 tractor trailer events, 1 convicted murderer, 1 gang member.'  Images shared by the Chief show a number of firearms, piles of cash and collections of bagged drugs ",
        "His most recent update means that in the past ten days alone the US Border Patrol has arrested 73,780 illegal immigrants, with just under 17,000 managed to escape into the country. Patrols across the country also intercepted 1052lbs of Meth, 820lbs of marijuana, 676lbs of cocaine, 13 firearms, 19 sex offenders, 6 gang members, 1 convicted murderer as well as 19lbs of heroin and 54lbs of fentanyl over the same time.  It comes after the Biden administration said they would be setting up migrant processing centers in Central and South America in an attempt to expedite deportations and further deter illegal immigration to the U.S. The first centers will be located in Colombia and Guatemala, which are two countries that have developed key choke-points for those attempting to transit through in order to migrate to the U.S.",
        "President Biden has also authorized the Army Reserves to deploy to the southern border as pandemic-era Title 42 is set to expire in two weeks. Title 42 allowed for the expedited expulsion of migrants from the U.S. in the midst of the public health emergency during the COVID-19 pandemic. Officials were able to use this policy in more than 2.7 million instances since March 2020 while processing migrants' asylum claims.But now that there is no longer a health emergency in the U.S., the policy is set to end on May 11. Republicans and border policy hawks have been highly critical of the program coming to an end, claiming there is no alternative to make sure the southern border is not overrun and even more overwhelmed once Title 42 expires.",
        "Internal projections show that migration at the southern border could spike by a whopping 10,000 to 13,000 per day when the policy comes to an end next month. Another method of deterring unlawful crossings after Title 42's end is the Biden administration working to finalize a rule to disqualify migrants from asylum if they did not seek humanitarian protection in a country they had to traverse to get to the U.S. and then entered the country illegally.Currently, migrants who illegally cross the southern border to claim asylum are many times released into the country to await a decision on their asylum claims. ",
        "This has led to millions without legal status disappearing into the country after release from Customs and Border Protection custody.The administration also announced it is expanding a program that allows migrants to come to the U.S. if they have family members who are citizens or permanent residents.While the current policy only applies to Haitian and Cuban migrants, the expanded version would also allow for citizens from Colombia, Guatemala, El Salvador and Honduras to participate in the family reunification program.",
        "Last month, 3,000 immigrants started trekking through Mexico as a large group to push towards the U.S southern border.  The asylum-seeking caravan had threatened to block roads or cause self-injuries  unless the Mexican government agreed to meetings or supply buses that would transport them to the capital. They had hopes of reaching Mexico City where they planned to pressure officials to provide them with exit visas that would allow them to continue to the United States.    In February of this year, Border Patrol agents testified before a government committee that the amount of fentanyl seized at the southern border was enough to kill nearly five times the population of the U.S."
    ]
}