{
    "articleURL": "/femail/article-12053549/Beautiful-blue-Zara-Tindall-looks-elegant-custom-Laura-Green-gown-attends-Coronation.html",
    "content": [
        "Zara Tindall, 41, looked elegant today as she attended the King's Coronation in London alongside Royal FamilyCORONATION LIVE BLOG: Click here to follow live updates throughout the day How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Zara Tindall accessorised her Coronation outfit with some very pricey jewellery today as she joined members of the Royal Family to mark King Charles' Coronation.",
        "The mother-of-three, 41, looked elegant as she was pictured wearing the 18ct White Gold drop earrings from Calleija, which retail for £29,900.Zara wore a smart blue and white custom dress by designer Laura Green as she arrived in London for the historic first Coronation in 70 years at Westminster Abbey, where Britain will hail its new King.She also donned a pale blue hat with chiffon detailing and wore her golden locks in a stylish updo. Zara, who is the King's niece, lives on Princess Anne's Gatcombe Park Estate in Gloucestershire with her former rugby player husband Mike Tindall and their three children, Mia, nine, Lena, four, and Lucas, two. ",
        "She was accompanied by her rugby ace husband Mike who picked up the colour of her outfit by donning a matching tie. Zara and Mike entered the Abbey hand-in-hand along with Princess Beatrice, Princess Eugenie, Prince Harry, Jack Brooksbank and Edoardo Mapelli Mozzi. Today's celebration comes after a late night for the couple, who yesterday partied at private members venue The Arts Club until 2am following a royal dinner.Zara and Mike have no official duties but are regulars at royal events, such as church services and the Jubilee.Zara is an accomplished equestrian and Olympian and despite being the niece of the monarch and cousin of a future king, she has kept a relatively low public profile and often spends her weekends at sporting events.",
        "Last week the athlete was across the pond in Lexington, Kentucky for an equestrian competition with her steed, Class Affair.Other members of the Royal Family - including Zara's cousins Princess Beatrice and Princess Eugenie - joined the couple to kick off the celebratory weekend last night. ",
        "The couple left Mayfair club Oswald's at 11pm after eating with other members of the Royal Family including Prince Andrew, Prince Edward and Princess Anne.The Tindalls then continued their evening at The Arts Club, where they left at around 2am and were photographed walking in the street looking for a taxi home.They were out just nine hours before the Coronation began at 11am at Westminster Abbey following the procession from Buckingham Palace, which started at 10.20am.One witness told MailOnline: 'After leaving Oswald's they carried on their evening partying at nearby the Arts Club where they left at approximately 2am.'The witness added that the Tindalls were then seen 'stumbling in the street while taking in all the Coronation bunting before getting into a taxi home'. Zara's uncle Charles had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the abbey from 6am to get one of the prime 2,300 seats inside.",
        "Charles will be crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain's place on the world stage.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.Nearly 2million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.",
        "The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.'There will be all the pomp and ceremony you could dream of, but as little of the \"them and us\" as possible,' one senior royal aide said last night.",
        "Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary's Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to 'pace herself' and also ensure 'the day was about her husband', sources said.'She loves him unconditionally and always wants him to shine,' a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.'The calm before the storm – perhaps metaphorically as well as literally,' a friend said with a nod to the dismal weather forecast, something the new King and Queen's celebrations have in common with the late Queen's Coronation in 1953."
    ]
}