{
    "articleURL": "/news/article-12043661/Ted-Cruz-gets-Democratic-rival-ex-NFL-player-Colin-Allred.html",
    "content": [
        "Rep. Colin Allred launched a campaign against Senator Ted CruzBoth men came out swinging against one anotherAllred has uphill battle as no Democrat has won statewide office in Texas in nearly 30 yearsRepublican Senator Ted Cruz got his first Democratic rival of the 2024 election on Wednesday - a former NFL linebacker and civil rights lawyer who launched his campaign with an attack on the senator.",
        "Democratic Rep. Colin Allred of Texas entered the race with a video focused on the Jan. 6, 2021, riot at the Capitol and filled with lines slamming Cruz. Allred said on the day MAGA supporters flooded the Capitol he was 'ready to take on anyone who came through that door,' while Cruz 'cheered on the mob' and 'hid in a supply closet.''We don't have to be embarrassed by our senator,' Allred said. 'We can get a new one.'",
        "Allred, 40, also criticized Cruz for going to Cancun with his family while millions of Texans suffered a power outage from a winter storm and claimed the senator would 'do anything to get on Fox News.' Cruz didn't take Allred's entry lying down. 'We can't let a radical leftist like Colin Allred flip our state blue in 2024,' he tweeted.And Cruz campaign spokesperson Nick Maddux called Allred 'too extreme for Texas,' attacking him for so-called 'woke' positions - a line Republicans are using against Democrats this election cycle.'Democrats have once again turned to a far-left radical to run for Senate. Not only does Colin Allred vote with Nancy Pelosi 100% of the time, but his voting record is completely out-of-touch with Texas. Allred wants men to compete in women’s sports, isn’t serious about addressing the crisis at the border, wants to take away law-abiding Texans’ guns, and is soft on punishing murderers,' Maddux said in a statement.",
        "Allred has an uphill battle ahead of him. Allred did flip a congressional seat from Republican to Democratic to win his first election to the House in 2018, prevailing in the traditionally Republican suburbs of Dallas.But Texas still remains predominately red. In 2020, Trump beat President Joe Biden in the Lone Star State by nearly 6 points. Allred shrugged off the odds.  'Some people say a Democrat can't win in Texas,' he said in a campaign launch video. 'Well, someone like me was never supposed to get this far.' Allred was a linebacker for the Tennessee Titans after playing college football at Baylor. When his playing career was over, he went to law school. He was born in Dallas. His father is black and his mother is white. He never knew his father and has spoken about how his mother raised him as a single mom.Allred and his wife Aly have two sons, Jordan and Cameron. In 2019,  Allred became the first member of Congress in its history to take paternity leave. He took two weeks off. In March 2021, he took leave again, this time for one month after the birth of his second son. He comes into the race with good fundraising chops. He's popular in the party and worked his way into leadership in just four years, to a position on House Minority Whip Katherine Clark's team. ",
        "Redistricting after 2020 put Allred in a safe Democratic seat - so his vacancy shouldn't impact Democrats' numbers in the House. ",
        "Cruz's latest approval ratings, which come from February, show that 40 percent of Texans approve of the job that he's doing and another 46 percent do not. Party affiliation plays a big role in Texans' views of the senator - with 78 percent of Republicans saying they approve of him and just 10 percent of Democrats sharing the same opinion. A month before he was narrowly reelected in 2018, Cruz had a 47 percent approval rating and a 42 percent disapproval rating, according to University of Texas-affiliated polling. At the time, 87 percent of Republicans approved of him, as well as 6 percent of Democrats. Democrats currently hold a narrow 51-49 majority in the Senate and face a tough electoral map in 2024, when their party will be defending 23 seats compared with Republicans' 10. Three of those Democratic seats are in states that then-President Donald Trump, a Republican, won in the 2020 election. "
    ]
}