{
    "articleURL": "/wires/reuters/article-12052723/Oilers-seek-better-effort-vs-Knights-latest-Game-1-flop.html",
    "content": [
        "The Edmonton Oilers find themselves in a familiar predicament heading into Game 2 of the Western Conference semifinals against the Vegas Golden Knights on Saturday afternoon in Las Vegas.",
        "For the seventh straight playoff series, Edmonton trails 1-0. The Oilers have rebounded to win three of the last four series, including this year's first-round series with the Los Angeles Kings in six games.So despite letting a four-goal performance by forward Leon Draisaitl go to waste in a 6-4 loss in Wednesday night's opener, Edmonton has been here before. The Oilers haven't won a Game 1 in a playoff series since 2017 when they did it in the second round against Anaheim.\"I can't explain the history of Game 1's,\" Edmonton coach Jay Woodcroft said. \"We look at each game in its own entity. We do have a history of getting better as the series goes on. ... I think the team that adjusts and continues to improve is the one that's going to win this series.\"Edmonton fell behind 3-1 in the first period in Game 1 but rallied to tie it 3-3 early in the third period on Draisaitl's second power-play goal of the game. But Vegas scored twice in just a 50-second span, starting with Ivan Barbashev's deflection goal just 61 seconds after Draisaitl scored, to make it 5-3.Draisaitl scored his fourth goal off Connor McDavid's feed at the 8:33 mark, but Vegas sealed it with Jack Eichel's empty-net goal with 34 seconds left.",
        "It was Edmonton's first regulation loss since a 7-4 setback at Toronto on March 11, a stretch that covered 53 days and 21 games (18-0-3).\"I think that was our first regulation loss in almost eight weeks,\" Woodcroft said. \"Saying that, we didn't play our best game, but I thought we were one shot away. When the game was 5-4, we had numerous chances to even it up. For me, it wasn't our best game yet the score was 5-4. So that's a good sign.\"\"It's nothing that they did,\" Draisaitl said. \"They're a good team, we know that. But it's nothing that we can't handle or we haven't seen. This is just on us not bringing our best game.\"The Oilers went 3-0-1 against Vegas during the regular-season.\"We made it too easy on them and that can't happen,\" defenseman Mattias Ekholm said. \"I think we gave them our B or C game. We can be a lot better.\"There was a much different perspective of the contest in the Golden Knights' locker room after their fifth straight playoff win.\"We were terrific,\" said Golden Knights goaltender Laurent Brossoit, who finished with 23 saves. .\".. We took it to them for 60 minutes. I even think the score wasn't necessarily indicative of how well we played.\"",
        "\"We're aware of their top guys and the damage they can do, but we like our team,\" Vegas coach Bruce Cassidy added. \"We feel if our team plays well, we're going to have success.\"Golden Knights captain Mark Stone, who posted a goal and an assist in Game 1, said his team expects \"a better push\" from the Oilers in Game 2.\"I don't think they loved their game,\" Stone said. \"We all had (a) pretty solid start. Got to bring a lot of the same intensity.\"--Field Level Media"
    ]
}