{
    "articleURL": "/wires/reuters/article-12046075/Would-Feds-Powell-loathsome-buffer-against-debt-default.html",
    "content": [
        "By Howard Schneider",
        "WASHINGTON, May 4 (Reuters) - Federal Reserve Chair Jerome Powell, asked on Wednesday about what the Fed would do in the event of a U.S. debt default, repeated the mantra of Fed leaders on that issue: A default is unthinkable, the U.S. government needs to pay its bills, and there was little the central bank could do to prevent an economic meltdown if it didn't.\"No one should assume that the Fed can really protect the economy and the financial system and our reputation globally from the damage that such an event might inflict,\" Powell said.Unsaid, however, is that just over seven weeks ago Powell showed - again - how willing he is to race beyond the red flags of central banking if the moment calls for it.As a member of the Fed's Board of Governors a decade ago, Powell called certain possible debt default responses by the Fed \"loathsome.\" Yet following the March 10 failure of Silicon Valley Bank the Fed took steps that resembled what it might also do with defaulted U.S. debt - agreeing to accept impaired securities, at face value, as collateral on loans to banks.The move broke a longstanding maxim of central banking that collateral is accepted only at reduced value to minimize the moral and financial risks of offering such loans. But it also helped curb possible financial turmoil on the reasonable assumption that the U.S. government would ultimately pay the full value of its Treasury bonds and bills even if they, for a time, traded below par.",
        "Accepting defaulted securities as collateral for Fed loans, or swapping \"good\" federal debt already held by the Fed for impaired debt held by private investors, would be an extreme variation on the theme - yet one that may prove less \"loathsome\" than the alternative economic collapse some predict would follow a default.To a bank, carrying \"underwater\" investments can be catastrophic, as the recent collapse of Silicon Valley Bank demonstrated. To a central bank, with no budget constraint and an elastic time horizon, it's just a matter of waiting out the politicians.The program set up by the Fed in response to the SVB failure makes the line between defaulted Treasury securities, on which a payment has been missed, and others, \"pretty indistinct,\" said Vincent Reinhart, a former top Fed staffer and now chief economist at Dreyfus and Mellon, now that any Treasury issue could in theory be used at face value to secure a loan from the Fed.\"They are just not going to be specific about what they will do because it validates a hypothetical they don't want to consider,\" he said.LAPSED CENTRIST?Powell joined the Fed in 2012 from a think tank where he focused on debt and deficit issues. He was a centrist at first uncomfortable with the central bank's aggressive forays into quantitative easing, the massive purchases of government bonds and mortgage-backed securities which expanded the Fed's balance sheet as well as its presence in private financial markets to fight off the 2007 to 2009 financial crisis.",
        "QE was at the time considered \"unconventional\" policy that many felt would be tucked away at some point, and the Fed's balance sheet shrunk back to more traditional levels.But the Fed of 2023 - post-pandemic and post Great Financial Crisis - is a different institution than the one overseen by chairs like Alan Greenspan or Paul Volcker, and different even than the one Powell joined.QE is now integral to the Fed's playbook, and its $7.8 trillion balance sheet central to how the Fed manages interest rates and monetary policy.Powell, chair since February of 2018 after he was promoted by then-President Donald Trump, has shown a repeated willingness to throw aside old practices when he felt it was necessary - even noting, in interviews early in the pandemic, that he had blown through traditional guardrails when the Fed, for example, agreed to intervene in private bond markets.He might not think central banks in theory should be buying the bonds of private companies; but if the alternative was a deep economic depression, purity could wait.On the eve of what would prove a disruptive outbreak of inflation, Powell in the summer of 2020 adopted a years-in-the making effort to shift the Fed's policy focus to put less weight on its price mandate and more on its goal of full employment, correcting what he had come to believe was a policy bias that kept more people out of work than was needed to keep inflation stable.",
        "The judgment proved controversial once inflation began its breakout run in 2021. Powell adapted, again, spearheading an aggressive round of interest rate hikes to control inflation and stating his willingness to pay the cost as needed in rising unemployment.A debt default may pose another tough decision for a Fed chair who's motto could well be to never say never. (Reporting by Howard Schneider; Editing by Andrea Ricci)"
    ]
}