{
    "articleURL": "/sport/rugbyunion/article-12043437/London-Irishs-game-against-Exeter-called-failure-pay-staff-players.html",
    "content": [
        "Doubts have emerged about London Irish’s game against Exeter going aheadSaturday's fixture could be cancelled due to concerns about insurance cover Further delay of wages has raised fears that a proposed buy-out is in jeopardyDoubts have emerged about London Irish’s last game of the season going ahead, as players and staff are still waiting for delayed monthly wages after another meeting and more promises that funds were on the way from America.",
        "The club gathered employees at their Hazelwood training ground in Sunbury-on-Thames for a late-morning update on the current situation, amid raised fears that a proposed buy-out of the Exiles is in jeopardy. Once again, the message was that, despite banking issues in the States, money is being transferred to cover pay roll, belatedly – but the Irish squad, management and back-room staff have been told much the same for several days and the on-going delay has led to growing tension.With three days to go until the final fixture of the season, at home against Exeter in Brentford, the slow progress of the long-anticipated purchase of the club is causing alarm in English rugby’s corridors of power, following the collapse of Worcester and Wasps last autumn. With wages not yet received, there is even speculation that the game could be cancelled due to concerns about insurance cover.",
        "Rob Baxter, Exeter’s director of rugby, has called for guidance, saying: ‘Here and now we have got to have some confirmation the game is going ahead. I really hope it does and things settle down. I don’t know any more than you do right now.’Sources have insisted to Mail Sport that the deal is set to go through and that the new buyers – who are keeping a low profile, but are being represented by former Premiership Rugby chief executive Howard Thomas – are due to be in attendance at the Gtech Community Stadium on Saturday. ",
        "But until the latest salary instalments are received and until the buy-out is fully confirmed, there is an understandable mood of near-panic among club employees and supporters alike."
    ]
}