{
    "articleURL": "/wires/ap/article-12059491/Nigeria-court-hears-oppositions-presidential-vote-challenge.html",
    "content": [
        "ABUJA, Nigeria (AP) - A Nigerian court on Monday began its hearing on separate suits filed by the opposition to challenge the incumbent party's victory in the country's presidential election.",
        "The presidential tribunal at the Court of Appeal in the capital, Abuja, heard the opening statements of lawyers representing opposition parties, which are the challenging the outcome of the February vote won by Bola Tinubu of the ruling All Progressives Congress.As the court hearing began, armed security personnel blocked major access roads and prevented a handful of journalists and lawyers from entering the facility. Some protesters waved Nigerian flags and displayed placards, alleging that the electoral process was flawed.\"Why I am demonstrating is because of the anger and the pain I have as a Nigerian not allowed to express and enjoy the resources of the land,\" said protester James Mike, who accused the Nigerian political class of pilfering the country´s wealth from huge mineral and crude oil resources.Nigeria's election commission declared Tinubu the winner of the election in a televised broadcast after he garnered 37% of the votes. But the two main opposition candidates rejected the result, questioning Tinubu´s qualification and alleging that results from the country´s 177,000 polling stations were tampered with.Analysts and observers said that the voting on Feb. 25 was largely an improvement from Nigeria's previous elections, but said that delays in uploading results might have given room for the figures to be tampered with.",
        "In separate petitions, both second-place finisher Atiku Abubakar of the Peoples Democratic Party and No. 3 finisher Peter Obi of the Labour Party argued that Nigeria´s electoral commission violated the provisions of the law in announcing the results of the election.Obi has said he has evidence to show he tallied the majority votes in the election while Abubakar has asked the court to disqualify Tinubu, alleging that he has a Guinean passport and therefore wasn't eligible to enter the presidential contest under the Nigerian Constitution.\"We are telling the court that he (Tinubu) is not qualified and contrary to the law, he did not put (the election commission) on notice that he has citizenship of another country,\" said Paul Ibe, a spokesman for Abubakar.In Nigeria, an election can be invalidated only if it´s proven that the national electoral body largely didn´t follow the law and acted in ways that could have changed the result. None of Nigeria´s presidential election results has ever been overturned by the country´s Supreme Court, though analysts said this year´s vote is peculiar with the heavy deployment of technology in the electoral process.The main opposition party has said without evidence that the ruling party is plotting to interfere with the court process, adding to tensions as the country awaits the judgment of the court while preparing for the inauguration of Tinubu as president. The court challenge though is usually a lengthy process and is expected to last for months, beyond May 29 when Tinubu is due to take over from incumbent President Muhammadu Buhari."
    ]
}