{
    "articleURL": "/sciencetech/article-12049907/Look-tonight-moon-change-COLOUR-billions-people-world.html",
    "content": [
        "Stargazers around the world will be treated to a penumbral lunar eclipse tonightThis is where the Earth casts a shadow on the moon, causing it to change colour This will be the deepest penumbral lunar eclipse to occur until September 2042Think you know what the moon looks like? Well, you may not recognise it tonight. ",
        "That's because, for billions around the world, our natural satellite is going to change from its usual bright white to a dark grey colour.This phenomenon is due to a deep 'penumbral' lunar eclipse, where the Earth's outer shadow - its penumbra - is cast on the full moon.It occurs when the Earth comes between the sun and the moon, blocking light from reaching the lunar surface.Billions of people across large parts of Europe, Africa, Asia, Australia and even Antarctica will have the chance to see it as it peaks at 6.22pm BST tonight.",
        "'The shadow of a planet produces an umbral and penumbral shadow depending on the location of the planet and the Sun,' Professor Don Pollacco of the University of Warwick told MailOnline.",
        "Billions of people across large parts of Europe, Africa, Asia, Australia and even Antarctica will have the chance to see the penumbral lunar eclipse as it peaks at 6.22pm BST tonight. Unfortunately, it is unlikely that people in the US and the UK will see the eclipse's effects this time.But you don't have to miss out if you are not in a region where it will be visible, as the Virtual Telescope Project will be livestreaming the event for astronomy enthusiasts everywhere.You will be able to catch the eclipse on their website or YouTube channel from 7.45pm BST (2.45pm ET).In the stream, the moon will rise above the region of Maremma in Tuscany, Italy. ",
        "'The darkest eclipses occur when the moon moves through the Earth's umbral shadow.'A penumbral eclipse occurs as the moon moving through the shadow of the Earth.'The event is expected to commence at 4.14pm BST on May 5 and last for just over four hours before ending at 8.31pm. Unfortunately, it is unlikely that people in the US and the UK will see the eclipse's effects this time.But you don't have to miss out if you are not in a region where it will be visible, as the Virtual Telescope Project will be livestreaming the event for astronomy enthusiasts everywhere.You will be able to catch the eclipse on their website or YouTube channel from 7.45pm BST (2.45pm ET).In the stream, the moon will rise above the region of Maremma in Tuscany, Italy.While this will be the deepest penumbral lunar eclipse to occur until September 2042, weather and patience is still required to observed these.Professor Pollacco added that spotting the moon's darkening can be quite difficult due to the sun's continued illumination.Yet during total lunar eclipses the Sun does not illuminate the Moon, often causing the lunar surface to change colour.'For a total Lunar eclipse, totality lasts hours. During these eclipses, the Sun does not illuminate the Moon, but instead light from the Sun goes through the Earth's atmosphere and reaches the Lunar surface,' Professor Don Pollacco said.   ",
        "'It is then reflected back to us. So instead of the Moon disappearing, it gets faint and often turns dark red – an impressive sight. Because whole hemispheres can see the eclipse these are much less rare than a Solar Eclipse and usually a typical location can see one of these every year.'At this time of year, the moon is typically referred to as the 'Flower Moon', 'Milk Moon' or 'Corn Planting Moon' - inspired by blooming plants during early May.",
        "This year's penumbral eclipse also comes as the Eta Aquarid meteor shower is set to peak between midnight and dawn on May 6.This spectacle will be visible from the UK in predawn hours but favours the Southern Hemisphere overall, according to Royal Museums Greenwich.Eta Aquarids are created from the debris left behind by Halley's Comet and happen every year from the middle of April until the end of May.Professor Don Pollacco explained: 'The Earth passes through a number of comet orbits every year and at these times we see an increase in meteor activity, depending on the density of dust previously ejected from the comet. 'The Eta Aquarid meteor shower, so called because the radiant is in the constellation of Aquarius, occurs when the Earth crosses through the orbit of a comet called Halley. ",
        "'These meteors are best seen from the southern hemisphere where the radiant in Aquarius is better seen. From the UK you might expect to see, maybe, 10 meteors an hour in clear, dark conditions.'",
        "A penumbral lunar eclipse occurs when the Sun, Earth, and Moon align in an almost straight lineWhen this happens, the Earth blocks some of the Sun's light from directly reaching the Moon's surface, and covers a part of the Moon with the outer part of its shadow, also known as the penumbra This kind of eclipse happens between 0 and 9 times per century on average. The last one took place on March 14, 2006. The next is due in August 29, 2059 A total lunar eclipse of the moon happens when the inner part of Earth's shadow, called the umbra, falls on the moon's face. At mid-eclipse, the entire moon is in shadow and can appear blood red"
    ]
}