{
    "articleURL": "/femail/article-12043073/Want-marry-daughter-ignore-Debretts-ask-father-first.html",
    "content": [
        "My girls feel that not asking for dad's blessing would've been mean-spiritedREAD MORE: My husband gave me a wedding ring after 25 years of marriageEach time, the nerves were palp-able. When our first son-in-law built up the courage to ask my husband Joe if he could marry our daughter, he started with: 'I've had a lot of girlfriends over the years . . .'",
        "It took a raised eyebrow from Joe for him to reach his point - that's why he was sure our girl was the one. Our youngest daughter's partner ended up babbling, too. He told Joe he never thought he could love anyone as much as he did his black Labrador Dusty and then said he wanted to marry her. He had to clarify: 'Not Dusty!'Our third daughter and her girlfriend chose to each approach their own father to discuss their wedding intentions before announcing their engagement.They felt it was a way of being traditional but also modern.",
        "Other than listening at the door while the chats were going on, I stayed out of proceedings. These were Joe's magic moments. He adored his girls from the moment they were born and I strongly believe he deserved to be cherished and respected in this way.After all, Joe, a college lecturer, had asked my late father for my hand four decades ago. It took him 12 hours to spit it out: he even left to go home to bed — after not managing it following endless cups of tea — only to return at 6am and blurt out: 'Mr Mangan, I'd very much like to get married!'Dad, still in his pyjamas, prompted: 'Oh, yes? And do you have anyone in mind?'",
        "Today this practice is considered the preserve of misogynistic dinosaurs. In its newest Coronation Edition, Debrett's, the bible of society manners, decrees that it is outmoded for boyfriends to seek permission to marry from a girl's father. It makes me furious that Debrett's has called time on a cherished custom.",
        "Many feminists will cheer the downgrading of what they see as an empty ritual. One they believe makes a mockery of women, treating them as a possession passed from one male to another. A sentiment with which - certainly in the case of my daughters - not all modern women agree.My girls are all independent women who nonetheless feel that not asking for their dad's blessing would have been mean-spirited.Yet they had friends who rubbished the notion of asking for Joe's consent. 'I decide who I marry,' declared one and another said: 'It's not 1823 and my dad doesn't own me — what's it even got to do with him?'The angry response? 'What do they plan to do? Walk up the aisle alone to the tune of Sisters Are Doin' It For Themselves while their dads sit watching, relegated to being just another guest?'",
        "Our youngest frankly told her friends that if they objected they should stay at home.",
        "Sadly, some families will not be lucky enough to have these golden moments. Death, divorce, illness or conflict can make it impossible.A few years ago, when I was having chemotherapy, I shared a hospital bay with a young man also being treated for cancer.When the side-effects got rough, he confided that he was driven to battle on so he could see his two daughters, then aged six and ten, married. Misty-eyed, he described how he looked forward to the moment he would be asked for permission to marry by their partners.",
        "I remember him saying: 'I'm not going to be a pushover, mind. I'll make those lads sweat.'And, he said his goal was to walk his daughters down the aisle. That in his head he could smell the flowers and hear the organ music.He didn't make it.I still remember the solid reassurance of my own dad's suited shoulder as I walked up to marry Joe. Our girls, in turn, all welcomed Joe's calming presence and delighted in his obvious pride on their special day.There are big moments in life where the political has to make way for the personal.So ditch Debrett's: if you have a dad you love, celebrate with him if you can. After all, it was your dad who loved you first."
    ]
}