{
    "articleURL": "/news/article-12058941/Nationwide-air-raid-alert-issued-Zelensky-vows-Putin-defeated-Nazism-was.html",
    "content": [
        "Ukraine issued a nationwide air raid alert following drone and missile strikes Attacks mount as Russia prepares for Victory Day celebrations tomorrow Russia launched its biggest swarm of drones for months against Ukraine today  after Volodymyr Zelensky vowed Russia will be defeated 'as Nazism was' on the eve of Moscow's dialled-down Victory Day parades.",
        "Officials said attacks hit cities including Kharkiv, Kherson, Kyiv, Mykolaiv and Odesa ahead of the May 9 victory day commemoration tomorrow, a symbolically important holiday for President Vladimir Putin.In Kyiv, the city's mayor said Russia had fired 60 Iranian-made kamikaze drones at Ukrainian targets, including 36 at the capital, all of which had been shot down. Debris hit apartments and other buildings, injuring at least five people.A food warehouse was set ablaze by a missile in the Black Sea city of Odesa, where officials reported three people were injured. The attack - which prompted nationwide air raid alerts - was the biggest drone swarm yet in a renewed Russian air campaign unleashed 10 days ago after a lull since early March.Kyiv said Moscow was also making a final, desperate push to try to capture the ruined eastern city of Bakhmut, to deliver Putin what would be his only prize for a costly Russian winter offensive, in time for tomorrow's celebrations that every year commemorate the Soviet Union's triumph over the Nazis. ",
        "Putin has relied heavily on Soviet-era rhetoric to justify his invasion of Ukraine.He claims his so-called 'special military operation' is an effort to bring about the 'denazification' of a belligerent imperial power backed by the west, a narrative that has been refuted by Kyiv and its allies - who say the invasion is an imperialistic land grab by Russia with the goal of eradicating a sovereign nation.",
        "Ukrainian President Volodymyr Zelensky countered this rhetoric today, saying Putin would be defeated 'as Nazism was', drawing comparisons between the Ukrainian defenders today and those who fought against the Nazis in the Second World War.Ukrainian officials are warning that Putin plans to capture frontline cities by May 9, with a video over the weekend showing Russian forces launching an attack on Bakhmut with what appeared to be white phosphorus.Aerial footage showed the city burning in a fiery inferno, in what appeared to be a desperate scorched earth tactic in a last-ditch effort to take the city.    ",
        "As the air alerts sounded in Ukraine today, military bloggers said they could have been triggered by a Russian warplane armed with advanced Kinzhal hypersonic weapons, which MailOnline has been unable to verify.Ukraine's air force claimed on Saturday to have downed its first Kinzhal missile over Kyiv using a newly acquired American Patriot defence system as strikes started to intensify.Russia has ramped up air attacks on Ukraine in the lead-up to Victory Day as experts anticipate the start of a long-awaited Ukrainian counter-offensive.On the frontline, ground forces commander Colonel General Oleksandr Syrskyi warned that Putin 'still hope[s] to capture [Bakhmut] by May 9.''Our task is to prevent this,' he said during a visit to the frontline city in eastern Ukraine.",
        "Countering Putin's rhetoric, Zelensky vowed Monday that Russian forces would be defeated in Ukraine just as Nazi Germany was beaten in 1945, during his own address commemorating the end of World War II. In a new break with Moscow, Ukraine marked Victory Day on Monday, rather than Tuesday, in line with the practice of its Western allies. Zelensky said he had signed a decree to officially change the date in future.He added: 'Recalling the heroism of millions of Ukrainians in that war against Nazism, we see the same heroism in the actions of our soldiers today.''Unfortunately, evil has returned. Just as evil rushed into our towns and villages then, so it does not. As it killed out people then, so it does now.''And all the old evil that modern Russia is bringing back will be defeated, just as Nazism was defeated.' The move to celebrate Victory Day on May 9 is just the latest in a series of steps Ukraine has taken in recent years to distance itself from Moscow, including by renaming streets and towns named after Soviet figures.Zelensky said Ukraine would instead mark Europe Day on May 9, which promotes peace and unity on the continent.The EU welcomed the move, and said European Commission head Ursula von der Leyen would visit Kyiv for talks with Zelensky on Tuesday.",
        "Russia and other ex-soviet states celebrate Victory Day on May 9, while most other European countries mark the date on May 8, due to the time difference when Nazi Germany signed to surrender in 1945.Western nations that celebrate Victory in Europe Day (VE Day) do so to mark the end of all combat actions in the Second World War, which was officially specified as as 23:01 Central European Time, which was already May 9 in Eastern Europe.",
        "Despite the importance of the holiday in Russia, many parades have been cancelled or limited due in part to security concerns. Last week, Russia accused Ukraine being behind a double drone attack that it said was an assassination attempt against Putin. Video showed what appeared to be two drones striking the Kremlin. Ukraine denied involvement.Russia has also lost much of the military hardware in its failed winter offensive it could have used to put on a show.At least six regions in Russia had scrapped celebrations before the drone strike on the Kremlin heightened fears last week.A Moscow official, speaking on conditions of anonymity, told The Guardian that 'there is a nervousness that I have never seen before' ahead of the holiday.Events could be important for Russia in keeping up morale and support for Putin's on-going war, which has taken a massive toll on Russian personnel.",
        "At home, support seems mixed at best. While there are issues in gathering reliable data, recent polling suggests around 43 percent are in favour of continuing the fight.Only 30 percent in February 2023 believed the narrative that the invasion of Ukraine was an pre-emptive attack needed to prevent a NATO invasion.Polling is made difficult by strict war censorship laws. In 2022, more than 20,000 people were detained for 'demonstrating anti-war sentiment in public' - and some sent to prison for dissent.Last month, a Russian pensioner was fined 40,000 rubles (£410) by a Russian court just for calling Zelensky a 'handsome young man'. Wilson Centre research notes loyalists are more likely to agree to be surveyed than regime opponents. Ukraine, which last year drove Russian forces back from the ramparts of the capital and recovered substantial territory, has kept its troops on the defensive for the past six months, but says it is preparing a massive counteroffensive in coming weeks. Many of the details of Ukraine's planned counteroffensive remain secret but Ukraine will seek to push through the contested regions in the east and south that have been pinned under artillery fire for months.Cities like Bakhmut in the Donetsk Oblast of eastern Ukraine have seen months of intense fighting between opposing factions, with civilian areas in-between razed during the clashes.",
        "However, Ukraine's Defence Minister has warned that raising expectations could lead to 'emotional disappointment'.American planners have raised also concerns that Ukraine will have only modest success in achieving its aims, to break Russia's land connection to the Crimean peninsula while exploiting weaknesses to reclaim contested territories in the east.Despite efforts to supply weapons and training to Ukraine, leaked documents from April warn that 'enduring Ukrainian deficiencies in training and munitions supplies probably will strain progress and exacerbate casualties during the offensive'.US Joint Chief of Staff Mark Milley has said since that Ukraine does have the leadership and morale needed to beat Russia.",
        "Russia's costly winter campaign captured almost no ground, apart from around the small eastern city of Bakhmut.Russian troops in Bakhmut are led by Wagner, a private army that recruited thousands of convicts from prison. Its boss announced last week that he would pull out of Bakhmut, denouncing the regular army for failing to give his fighters enough ammunition.However, he appeared to reverse himself on Sunday, saying he had now been promised the weapons he needs."
    ]
}