{
    "articleURL": "/tvshowbiz/article-12060775/Ariana-Madix-beams-joy-crop-steps-winning-MTV-Movie-TV-Awards.html",
    "content": [
        "She endured a heartbreaking ordeal these last few months, but Ariana Madix is clearly coming out on top.",
        "The Vanderpump Rules star, 37, was spotted with a huge smile on her face as she emerged after winning Best On-Screen Team at the MTV Movie &amp; TV Awards.Stepping out in Los Angeles on Sunday, Ariana looked happy as she displayed her toned abs in a summery, lace-up crop top paired with faded jeans.Ariana has been moving on after the demise of her nine-year relationship with ex Tom Sandoval, who had an affair with co-star Raquel Leviss.In true post-split fashion, Ariana, 37, even got some fresh ink - an alien tattoo etched into her forearm.",
        "She got the new tattoo at Kourtney Kardashian's Coachella party Camp Poosh, with tattoo artist to the stars JonBoy doing the honors.On Sunday, JonBoy shared snaps of Ariana proudly showing off her brand new ink last month as she posed with pink tinted hair and a Western festival look.Ariana was still smiling on Sunday, as she stepped out after scoring her new win at the MTV Movie &amp; TV Awards.She appeared to be saying goodbye to a friend who pulled up in their car, and wore a hippie chic crop top, faded jeans, and white trainers.Her blonde hair was scooped back into a bun and her nails were all done up long and metallic.",
        "While accepting the gong virtually with her co-stars Katie Maloney, Scheana Shay, and Lala Kent, she referenced the drama she had recently endured with her ex and Leviss.'Thank you, thank you, thank you. We have been through so many ups and downs. A tumultuous time in all of our lives,' she remarked.The star added, 'We are truly at our best when we come together as a team. So thank you! We did it.' ",
        "The trio of women donned the same black hooded sweatshirt that read in white letters: 'Everynite is VPR Nite.'Katie, who last year divorced husband Tom Schwartz, wore her dark bob haircut in a side part with a slight flip at the ends.She contributed, gratefully, 'Wow. Best on-screen team. Thank you so much, MTV, and especially to everyone that voted for us. Scheana added, 'The team isn't just us. I mean, we have an entire production team behind us that makes the show possible.'",
        "'This is so exciting. We won best team all because of you guys, the fans. Thank you so much for voting.'The mother-of-one's shoulder-length, ombre brunette and blonde hair was parted down the center and styled straight. And Kent added in a separate video, 'Hello, my loves. Thank you all for voting for me and my most favorite girls, Scheana, Katie, and Ariana. We are beyond grateful. This is crazy. Again, thank you guys so much.'",
        "The women beamed as Ariana, whose bright locks were pulled into a casual, low bun, held the red popcorn statue.",
        "Lala joined in virtually from a different location than her three costars, donning a white sweatshirt that said, 'Send it to Daniel,' a reference to a spat with Leviss. She was in good spirits in the pre-recorded clip, appearing with her frosty blonde locks flowing over her chest in an off-center part. Sandoval's infidelity began in August 2022 and lasted for seven months until Ariana discovered intimate FaceTime videos on Tom's phone between him and Raquel.Raquel has since checked herself into a mental health facility.The Missouri native later admitted his relationship with Ariana was 'just lacking intimacy' and 'connection.' He felt that they were remaining together to 'keep the optics up that [they] were solid' for their reality show and other business endeavors. "
    ]
}