{
    "articleURL": "/tvshowbiz/article-12049471/Bye-bye-Scandoval-drama-Vanderpump-Rules-Tom-Schwartz-intergalactic-reality-Stars-Mars.html",
    "content": [
        "Tom Schwartz is headed to escape the Scandoval drama - in a place akin to Mars.",
        "Schwartz, 40, is one of a dozen famous faces announced as contestants on the forthcoming Fox reality competition Stars on Mars, which will see celebs compete in a simulation of the Red Planet.The Woodbury, Minnesota-born reality star will appear on the series, which will be hosted by Star Trek alum and real life intergalactic adventurer William Shatner.The 12 celebrities will participate in competitions to colonize and conquer a simulation of Mars in a quest to be named 'the brightest star in the galaxy,' People reported.The Vanderpump Rules personality will be joined on the show by fellow reality star Porsha Williams of Real Housewives of Atlanta, musical artist Tinashe, Modern Family alum Ariel Winter, Superbad actor Christopher Mintz-Plasse, actress Natasha Leggero, and fashion entrepreneur Tallulah Willis.",
        "Other notable names from the world of sports to compete include Olympic figure skater Adam Rippon, NFL icons Marshawn Lynch and Richard Sherman, cyclist Lance Armstrong and WWE star Ronda Rousey. 'To any celebrities out there, don't try this at home,' said Shatner, who in October of 2021 was a passenger on Jeff Bezos's Blue Origin space shuttle during a flight to space.The reality show comes a year after Fox took another innovative stab at the genre with the series Special Forces: World's Toughest Test, which The Bachelorette's Hannah Brown won competing against notable names such as Mel B, Kate Gosselin and Kenya Moore.",
        "The trip to Mars comes at an opportune time for Schwartz, who for the last few months has been embroiled in the drama resultant from friend and business partner Tom Sandoval's headline-making split from Ariana Madix amid his affair with Raquel Leviss.",
        "Schwartz has publicly supported Sandoval in the wake of the scandal.He appeared on Watch What Happens Live last month to defend his longtime confidante and pledge to stand by his side amid his descent into reality TV villainy for his infidelity.'Tom, I know the whole world hates you, but I'm not gonna abandon you, old buddy. I'm not gonna abandon you,' Schwartz said.Schwartz said of Sandoval: 'He knows he's a monster for what he did. If you see him, give him a hug. Maybe he doesn't deserve it, but give him a hug. He's down bad.'He said in the appearance on the Bravo chat show, 'I'm not trying to evoke any sympathy for Tom, he knows what he did was disgusting. He knows he could not have handled that affair any worse.'Schwartz said that while he understands the anger against Sandoval, 'The vigilantism is getting a little out of control.'I want to remind people to take a breath. He knows what he did was terrible, so does Raquel, but the threats, it's getting out of control. The mob mentality is getting out of control.'",
        "Stars on Mars is slated to debut on Fox June 5 at 8/7c. "
    ]
}