{
    "articleURL": "/columnists/article-12044489/King-Charles-Coronation-missed-chance-make-visitor-boom-writes-JOHN-DICKIE.html",
    "content": [
        "This weekend the UK will host a spectacle that will be watched by millions across the globe – the King's Coronation. It is the first time in 70 years that people have had the chance to see history being made in the capital.",
        "That's why visitors from the UK and beyond will descend on London to soak up the atmosphere.The Coronation will provide a much-needed boost for London's leisure, hospitality and retail businesses badly hit by the pandemic. However, despite the scale of the occasion, we are not doing everything we should to attract high-spending visitors to this event or to maximise the capital's attractiveness to overseas tourism, which, in turn, will support jobs and growth.In 2019, according to Visit Britain, tourism in England contributed £106billion to the British economy and supported 2.6million jobs.",
        "After Brexit, the Government inexplicably decided to stop overseas visitors from being able to reclaim VAT on goods purchased here and then taken home. This puts us at an enormous disadvantage to the EU.American, Chinese, Indian and other visitors to continental European countries can claim back VAT when they leave. As can we Brits. But no visitors to the UK can.We are seriously losing out as a result. Figures from Global Blue show that 10 per cent of UK spending by international shoppers in 2019 has now moved to EU countries, which have kept VAT-free shopping.We are also lagging behind other European cities in attracting visitors from key markets. For example, spending by American shoppers in the UK is now back at 2019 levels, a welcome recovery from the dark days of the pandemic. ",
        "But our figure lags starkly behind France, Spain and Italy, which have virtually doubled their American spending. This is an issue that matters for the whole of the UK's flatlining economy.A week after the Coronation, Liverpool will host the music industry's biggest night – the Eurovision Song Contest. The event is predicted to be worth around £25million to the regional economy.Events like this in the UK would attract even more international visitors that would help turbocharge our economy if we brought back VAT-free shopping. By doing so, it would strongly support growth, generate £4.1billion gross added value annually, and create 78,000 jobs, according to Oxford Economics.Re-introducing the scheme would boost spending from visitors and more than compensate for the short-term loss of VAT receipts – delivering an extra £350million in tax revenues for the Exchequer every year. This would ultimately be a win-win for business, the economy and the country.Britain is competing in the global race for tourism with our shoelaces tied together. We must act now to restore VAT-free shopping so, for example, we are an attractive hop across the Channel for visitors to the Olympics in Paris next summer.The Government missed a trick by failing to seize the opportunity to bring back VAT-free shopping for international visitors ahead of the Coronation. We need to act now to show the world that Britain is open for business.",
        "John Dickie is the chief executive of BusinessLDN"
    ]
}