{
    "articleURL": "/wires/reuters/article-12060113/GRAINS-Chicago-grains-mixed-concerns-Ukraine-shipping-deal.html",
    "content": [
        "No agreement to extend Ukrainian export shipping",
        "Ukraine deal expires May 18Positive planting weather for U.S. soybeans(Updates prices, changes lead, changes headline, changes bullets, adds quotes in paragraphs 7 and 9, changes byline, changes dateline from previous HAMBURG)By Cassandra GarrisonMEXICO CITY, May 8 (Reuters) - Chicago wheat dipped off recent highs and corn rose on Monday, on uncertainty over whether Ukraine's safe shipping agreement for grain exports will be extended with the deal set to expire on May 18.Chicago Board of Trade most-active wheat lost 0.11% to $6.59-1/2 a bushel by 1000 CDT 1121 GMT, after hitting a two-week high of $6.69 a bushel.Corn gained 0.25% to $5.98 a bushel, soybeans rose 0.16% to 14.38-1/2 a bushel.Ukraine's reconstruction ministry said Russia has effectively stopped the Black sea grain deal by refusing to register incoming vessels.The deal expires on May 18. Moscow has threatened to quit the agreement, while Turkey and the United Nations are working to extend it.Ukraine a large corn and wheat exporter.\"Russia is no longer inspecting incoming ships to the Ukrainian ports, so it pretty much shuts down exports coming out of Ukraine,\" said Tom Fritz, a partner with EFG Group in Chicago.Wheat was also underpinned by signs U.S. hard wheat crops may not be in as good condition as hoped.",
        "\"There's lots of rhetoric out there about the hard red winter wheat crop in dire conditions, and whatever rain that materializes over the near term for Oklahoma and Kansas, it's probably too little too late,\" Fritz added.Soybeans were volatile as near-term planting weather in the U.S. looked positive.The agricultural markets were looking ahead to a U.S. crop progress reports due later on Monday and a monthly U.S. crop production report on May 12. (Reporting by Cassandra Garrison in Mexico City, Michael Hogan in Hamburg, additional reporting by Naveen Thukral in Singapore, editing by Susan Fenton and Barbara Lewis)"
    ]
}