{
    "articleURL": "/wires/reuters/article-12048633/Pressure-grows-regulatory-intervention-US-bank-rout-deepens.html",
    "content": [
        "WASHINGTON, May 4 (Reuters) - Pressure is growing on U.S. regulators to take more steps to shore up the country's banking sector as a renewed rout in regional lenders' shares forced PacWest Bancorp to explore options to bolster its balance sheet.",
        "Wall Street executives and bank analysts called for regulators to quickly provide more protection for bank deposits and consider other backstops, arguing only an intervention could stop the crisis -- which saw several regional lenders' shares plunge more than 10% on Thursday -- from spiraling. It was unclear, however, if the authorities would immediately step in.\"Investors are clearly continuing to focus on remaining players that are deemed the weakest,\" wrote UBS banking analyst Erika Najarian on Thursday.\"To stop the cascade before the market literally drives more bank failures, we wonder if it's time for the Treasury and the Fed to step up and potentially create some sort of backstop,\" wrote Najarian.Shares of Los Angeles-based PacWest slumped more than 40% in Thursday afternoon trading -- a record low -- after the lender confirmed a Reuters report that it was exploring strategic options, including a potential sale or capital raising.Western Alliance's shares pared losses after plummeting by nearly 60% on a Financial Times report, which it categorically denied, that the lender was exploring strategic options. On Wednesday evening, the bank said it had not seen unusual deposit outflows and had adequate liquidity.Meanwhile, Canada's Toronto-Dominion Bank Group on Thursday called off its $13.4 billion takeover of First Horizon Corp, citing uncertainty over when the deal would be approved by regulators, triggering a near 40% fall in the U.S. bank's shares.",
        "Major U.S. banks also lost ground on Thursday, with the S&amp;amp;P 500 Banks index falling nearly 3%.Activist investor Nelson Peltz told the Financial Times that deposit insurance should be extended, echoing billionaire investor Bill Ackman who on Wednesday tweeted that regulators' failure to expand the insurance regime \"hammered more nails in the coffin.\"Peter Orszag, CEO of financial advisory at Lazard Ltd , on Wednesday called on officials to at least signal their intention to guarantee uninsured deposits for a six-month period.Some regulatory experts, including former FDIC chair Jelena McWilliams, warned that increasing deposit insurance could encourage risk-taking, while others noted regulators have fewer tools to support banks following the 2008 financial crisis.The U.S. Treasury Department on Thursday said it was continuing to \"closely monitor\" market developments, but \"the banking system has substantial liquidity and deposit flows are stable.\" The Federal Deposit Insurance Corp. (FDIC) did not respond to a request for comment.The rout had also thrown the practice of short-selling, in which investors profit by betting against shares, back into the spotlight, with prominent law firm Wachtell, Lipton, Rosen &amp;amp; Katz calling on Thursday for securities regulators to restrict short sales in financial institutions.While the U.S. Securities and Exchange Commission (SEC) is not contemplating such a ban, Reuters reported Wednesday, its chair Gary Gensler said on Thursday the agency is focused on identifying any form of market misconduct.",
        "His comments followed a Reuters report that federal and state regulators were analyzing the possibility of market manipulation behind recent bank share moves.CONTAGIONThe latest crisis began in March when runs on Silicon Valley Bank (SVB) and Signature Bank led to their abrupt closures, leading depositors to move their cash to bigger banks.To stem the contagion, regulators took emergency steps to reimburse all customers at the two banks, while the Fed offered lenders additional liquidity.Government agencies are investigating the collapse of SVB. Goldman Sachs Group Inc, which was involved in key transactions that preceded SVB's downfall, disclosed on Thursday that it was cooperating with those probes.The markets appeared to calm late last month. But over the weekend, California-based First Republic became the third bank to fail. Regulators hoped its sale to JPMorgan would draw a line under the crisis, but the deal revived investor fears.On Monday, the FDIC floated possible reforms, including potentially raising the current insurance cap of $250,000 per-person per-bank, but such a permanent change would require congressional approval.\"Congress does not appear ready to exercise this option at this juncture. So if a change to FDIC coverage limits is not happening, then the risk is that we may be stuck with a structural headwind,\" said Carl Riccadonna, chief economist at BNP Paribas.",
        "Major banks and private equity firms have balked at offering lenders capital infusions without a government backstop because of concerns about booking losses.Raymond James analyst Ed Mills said regulators may also consider other options, including sending a signal that bank equity holders may be protected, or additional Fed funding, but added they were unlikely to move \"unless things significantly deteriorate.\" (Writing by Michelle Price; reporting by Saeed Azhar, Matt Tracy, Andrea Shalal, Hannah Lang, Medha Singh, Chibuike Oguh, Chris Prentice, Peter Schroeder and Svea Herbst-Bayliss, Carolina Mandl and David French; Editing by Andrea Ricci, Aurora Ellis and Deepa Babington)"
    ]
}