{
    "articleURL": "/wires/ap/article-12061301/Abortion-clinics-3-states-sue-protect-pill-access.html",
    "content": [
        "Abortion providers in three states filed a lawsuit Monday aimed at preserving access to the abortion pill mifepristone, even as the drug is threatened by a separate Texas lawsuit winding its way through U.S. court system.",
        "The lawsuit, filed in U.S. District Court in Virginia on behalf of clinics in Virginia, Montana and Kansas, is the latest legal action over the decades-old pill, which is part of the two-drug regimen used in most U.S. abortions.A federal judge in Texas issued a ruling last month that would have revoked the U.S. Food and Drug Administration´s longstanding approval of the pill, an unprecedented challenge to the federal drug regulator. But the Supreme Court blocked that decision and other limits from a lower court from taking effect while the lawsuit continues.Abortion-rights advocates and their opponents continue jostling for a legal foothold on the issue across the country.The clinics in Virginia, Montana and Kansas sued the FDA on Monday in federal court to force the agency to drop several longstanding restrictions on how mifepristone can be prescribed.But from a practical standpoint, the groups said they are seeking a court order that would shield mifepristone access in their states as the litigation over the drug proceeds. That is what 18 liberal states achieved last month when a federal judge in Washington state issued a ruling ordering the FDA to preserve access to mifepristone in those states, regardless of any conflicting court decisions. The ruling came shortly after the Texas decision, creating confusion for abortion providers and their patients.",
        "The plaintiffs in Monday´s lawsuit said they hope to prevent similar chaos as the legal battle over mifepristone accelerates. An appeals court in New Orleans is set to hear arguments in the Texas case later this month.\"Plaintiffs cannot retool their practices overnight with no notice - healthcare has no on-off switch. They and their patients require clarity around their continued provision of mifepristone,\" states the lawsuit, which was filed on behalf of the clinics by the Center for Reproductive Rights, a New York-based legal and advocacy group that works to ensure access to abortion.The group said it included abortion providers in Virginia, Montana and Kansas in the lawsuit because those states are not parties to either the Texas or Washington cases, but they have many lawmakers who are hostile to abortion access and \"are caught in the middle of this maelstrom.\"The FDA approved mifepristone, in combination with a second pill, as a safe and effective means of ending pregnancy in 2000. Mifepristone is sometimes used for alternate reasons, including managing miscarriages.At the time of the approval, the FDA imposed a number of restrictions on the drug, including requiring that prescribers undergo certification and that women sign an agreement form before taking it.In recent years, the FDA has made mifepristone easier to get, dropping a two-decade-old requirement that women pick up the pill in person. But the FDA has repeatedly concluded that the remaining requirements - including prescriber certification and patient forms - are necessary.",
        "In their lawsuit, the clinics argue that these restrictions \"stigmatize and undermine access to medication abortion.\"The abortion providers who are suing include: Whole Woman´s Health Alliance, a nonprofit organization that operates healthcare facilities in Charlottesville and Alexandria, Virginia; Whole Woman´s Health of the Twin Cities, LLC, in Minnesota, which provides telehealth services for medication abortion in Virginia, Maryland, Minnesota, New Mexico and Illinois; and Blue Mountain Clinic, a family practice in Missoula, Montana, which first opened in 1977 as the first and only abortion clinic in the state.Other providers named as plaintiffs include: Helen Weems, a certified nurse practitioner licensed to practice in Montana and owner of All Families Healthcare, a sexual and reproductive health clinic in Whitefish, Montana; and Trust Women, which operates clinics in Wichita, Kansas, and Oklahoma City, Oklahoma."
    ]
}