{
    "articleURL": "/wires/reuters/article-12046663/Israeli-owned-Aluminij-sign-green-deals-worth-141-mln-Glencore-Duferco.html",
    "content": [
        "By Daria Sito-Sucic",
        "MOSTAR, Bosnia May 4 (Reuters) - Bosnia's aluminium producer Aluminij has agreed deals worth a combined 250 million Bosnian marka ($141.2 million) with Swiss mining company Glencore Plc and steel group Duferco, enabling it to create a fully green product, its CEO said in an interview.Aluminij will sign on Friday deals for building a 60 Megawatt (MW) solar power plant and recycling facility for aluminium with Glencore, Amir Gross Kabiri told Reuters on Thursday.It will also sign agreements for building a new factory for green aluminium production for the automotive industry and for the production of aluminium wire with Duferco, he added.Completion is expected during 2025, he said.Aluminij, based in the southern town of Mostar, was closed down in 2019 over accumulated debts but was acquired the next year by Israeli M.T. Abraham Group, which leased its entire facilities for 30 years and restarted production.\"Our annual production capacity is 250,000 metric tonnes of billets, ingots and slabs,\" said Kabiri, the sole shareholder of the M.T. Abraham Group. He added output had increased from 75,000 tonnes as the company modernised its equipment from 2020.Aluminij was Bosnia's largest exporter in 2022, with more than 1 billion marka worth of exports, and also the largest importer in the Balkan country.",
        "The company's main goal is to provide fully green products by 2025.Aluminij was the first company in the Western Balkans that completed the Carbon Footprint Certification process, complying to CO2 footprint standards set for aluminium producers.The company will start building the solar power plant next year and it will have independent access to the grid which should prevent any power blackouts from occurring.\"It will provide us with electricity supply, renewable and stable, for the cast house, the anode plant and entire factory operation without electrolysis,\" Kabiri said.He added the construction of the Southern gas inter-connector, bringing natural gas from the LNG terminal at the Croatian island Krk to Bosnia, would enable the restart of the long-closed electricity-intensive electrolysis plant. He said the gas pipeline could be completed in the next three to five years. (1$ = 1.771 Bosnian marka) (Reporting by Daria Sito-Sucic Editing by Alexandra Hudson)"
    ]
}