{
    "articleURL": "/tvshowbiz/article-12052801/Gigi-Hadid-Leonardo-DiCaprio-spotted-leave-NYC-hotspot.html",
    "content": [
        "Gigi Hadid and Leonardo DiCaprio were seen slipping out of popular celebrity haunt Cipriani in New York City on Thursday night - amid reignited romance rumors.",
        "The 28-year-old supermodel - who recently shared behind the scenes snaps from the Met Gala - kept a low profile in a baseball cap and long brown coat.And the 48-year-old longtime actor also attempted to go under the radar in a black hat and matching bomber jacket.He also wore a black face mask that concealed the lower half of his visage during the weeknight outing. Leo, who for months has been linked to the mother-of-one, added jeans and white sneakers to complete his casual ensemble. ",
        "The runway regular's long blonde hair streamed out from underneath her head gear.She wore a clinging white shirt underneath her outerwear as she was seen walking down stairs at the favored hotspot. The two walked down the steps separately and were in good company as singer FKA Twigs also left the scene around the same time as them. Gigi and Leonardo have done little to squash dating rumors recently, as they were also spotted attending the same after party at Zero Bond following Monday night's Met Gala.The model couldn't hide her delight as she flashed a beaming smile while making her way into the same event as her rumored love interest.Hadid concealed her after party look underneath a black leather trench coat, after wowing on the red carpet in an incredible black sheer outfit earlier in the evening as she attended the annual fashion extravaganza.",
        "Leonardo made a low-key arrival at the star-studded bash sporting a black face mask and a basketball cap with his suit jacket and dark-wash jeans.It follows recent reports that the rumored love interests are 'still hanging out together' as they 'enjoy each other's company,' although 'her daughter is always top of mind and at the forefront of everything in her life,' according to an Entertainment Tonight source.The fashionista shares two-year-old Khai with ex-boyfriend Zayn Malik. ",
        "Gigi and Leo also fanned the fire of dating rumors after they were both seen at the same Oscars afterparty earlier this year - Beyonce and Jay-Z's bash at the legendary Chateau Marmont.Prior to that, Gigi was spotted exiting a pre-Oscars party in Los Angeles where the The Wolf of Wall Street actor was also in attendance.The two reunited shortly after a source told People the Guest In Residence founder 'hasn't seen him for a while. She just decided that she was done with him.''They are at very different places in life. She prioritizes being a mom,' the insider had continued at the time, further adding, 'It was never that serious anyway. It kind of just fizzled.'The model and actor were first romantically linked last year in September 2022 after they were seen spending quality time together during New York Fashion Week.",
        "It comes after Leo has reportedly been desperate to 'ditch' his image of only dating women under the age of 25 while settling down in a 'more mature' relationship.A source close to the actor laid bare his frustrations over the scrutiny he faces every time he is photographed with a young woman, while revealing that the Titanic star wants to find a 'real' relationship - much like the long-term romance he had with Camila.'He is not keen on the hype suggesting that he is seeking out these very young women,' the insider revealed to DailyMail.com in February.'He is looking for something more mature in the relationship department.'Leo was in a five-year-long relationship with model Camila Morrone, 25, from whom he split last year.",
        "On Friday Gigi reemerged in the big Apple as she donned a stylish light gray outfit.The runway regular rocked a pair of baggy trousers with thin white pinstripes and teamed it with a navy blue collared sweatshirt.She wore a hat with her modeling agency IMG's logo printed across the front.The blonde bombshell also wore sporty sunglasses and finished the look with white sneakers with green accents. "
    ]
}