{
    "articleURL": "/wires/ap/article-12056671/Brazils-Amazon-megaprojects-threaten-Lulas-green-ambitions.html",
    "content": [
        "RIO DE JANEIRO (AP) - After his swearing-in ceremony on Jan. 1, Brazil's Luiz Inácio Lula da Silva walked up the ramp to the presidential palace arm in arm with Indigenous leader Raoni Metuktire, instantly recognizable by his yellow headdress and wooden lip plate.",
        "But a major railway that would accelerate deforestation in Metuktire's ancestral land risks souring relations between the leftist leader and the chief of the Kayapó people. And it's just one of several mega-projects that activists and experts say would devastate the natural world - and seriously dent Lula's newfound image as a defender of the environment - if they proceed.Others include an oil drilling project near the mouth of the Amazon River; a highway that would slice through some of the Amazon rainforest´s most protected areas; and renewal of a giant hydroelectric dam´s license.\"Lula is talking about the environment, showing preoccupation with illegal mining, demarcating Indigenous territories. He´s already learned a lot, but needs to learn more. We´re still very worried,\" said Alessandra Korap, an Indigenous leader of the Munduruku people who recently won the Goldman Environmental Prize for work that included battling illegal mining.Under Lula´s predecessor, Jair Bolsonaro, deforestation soared to a 15-year high and environmental restrictions were weakened. The far-right leader filled key positions in environmental agencies with agribusiness allies and military officers. Indigenous peoples´ rights were trampled.After narrowly defeating Bolsonaro in last year's election, Lula has strived to put environmental protection and respect for Indigenous peoples´ rights at the heart of his third term. He resumed successful pursuit of international donations for the Amazon Fund that combats deforestation, launched a military campaign to eject illegal miners from Yanomami territory, committed to ending all illegal deforestation by 2030 and restarted the demarcation of Indigenous areas.",
        "But Lula faces difficult tests in the large infrastructure projects. While opponents regard them as catastrophic, some in Lula's Workers' Party continue to view them as essential for providing jobs and promoting growth. And Brazil, a developing nation, has heavy demand for socioeconomic benefits.THE OIL-DRILLING PROJECTIbama, Brazil´s environmental agency, will decide in coming months whether to license drilling in one sector near the mouth of the Amazon. Approval would surely lead to drilling in the whole region, said Suely Araújo, a former Ibama head now a public policy specialist with the Climate Observatory, a network of non-profits.\"It´s a matter of coherence. Lula´s speeches on environmental protection and the climate crisis are bang on point. But if oil exploration is intensified, it will mean expanding fossil fuels. There would be an inconsistency,\" Araújo said.During Lula´s first terms, huge offshore discoveries became a means of financing health, education and social welfare programs.\"To a large extent, this vision remains, meaning it will be very difficult to persuade the government to give up strategic projects, even when there are significant social environmental risks,\" said Maiara Folly, director of CIPO, a think tank focused on climate and international relations.With existing production set to peak in coming years, there's sharp interest in securing more off Brazil's northern coast. It's a unique and biodiverse location, home to little-studied swathes of mangroves and a coral reef.",
        "Araújo said the project risks leaks that would be carried elsewhere by strong tides.State-run oil giant Petrobras has earmarked almost half its five-year, $6 billion exploration budget for the area. CEO Jean Paul Prates said the first well would be temporary, and that the company has never recorded a leak in offshore drilling.Energy Minister Alexandre Silveira said in March that the area is the \"passport to the future\" for development in Brazil's northern regions. Lula has used the same term to describe the earlier offshore oil discoveries.Eighty civil society and environmental organizations, WWF Brasil and Greenpeace, have called for the license to be declined pending an in-depth study.THE HYDROELECTRIC DAMThe Belo Monte hydroelectric dam, a concrete colossus on the Xingu River, was planned under Lula and built by his successor, Dilma Rousseff. Supporters saw it as a way to generate jobs and add power to Brazil's grid.Indigenous populations and environmental campaigners fiercely opposed it, and studies show its impacts have been disastrous. Civil society organizations estimate tens of thousands of people were displaced, and experts attribute a local surge of violence to lost jobs. One area of concern is the Xingu's Volta Grande, or Big Bend, which has lost much of its water. That caused the disappearance of fish -- the basis of many Indigenous populations´ subsistence.",
        "Belo Monte is back on Lula´s agenda, with Ibama weighing whether to renew its license. The agency reported last summer that Norte Energia, the dam's owner, hadn't respected many of the conditions for its original license.Local media said Norte Energia proposed to distribute 20,000 reais (about $4,000) in compensation to nearly 2,000 fishermen.In January, researchers in the region published a letter environmental journalism website Sumauma calling on Lula and his administration to investigate and punish crimes and injustices surrounding the dam.\"Any government really committed to conserving the Amazon and fighting the climate crisis is obliged to recognize the problems caused by Belo Monte and to fix the damage and impacts caused,\" the letter said.Local populations are demanding the license be renewed only if Norte Energia agrees to use the water in a way that allows life in and around the river to be sustained.The license was originally issued under heavy pressure from Rousseff's government, said Folly. In a March interview with Sumauma, Lula's environment minister, Marina Silva, promised that this time, \"nobody is going to be coerced, as they were before, and this represents a total change.\"THE HIGHWAYThe BR-319 highway connects Porto Velho to Manaus. It was abandoned in the 1980s after falling into disuse, but the government has shown signs of wanting to repave it to facilitate the export of commodities.",
        "Environmentalists and scientists warn that could lead to uncontrolled deforestation in the region by increasing land speculation and giving easy access to land grabbers. After Bolsonaro announced that a section of the road would be repaved, deforestation in nearby areas quickly surged, according to Brazil´s national space agency.Lula told Radio Difusora last June that he favored reconstruction, calling it important for the economies of Amazonas and Rondonia states. Ibama's president Rodrigo Agostinho told the AP in March that the agency has slowed the permitting process in order to analyze carefully.THE RAILWAYSimilar concerns surround a 933-kilometer (around 580 miles) railway known as Ferrograo that would move grains from the heartland toward the Tapajos River for eventual shipping abroad.The project would mean fewer trucks moving soy and corn, and thus reduced carbon emissions. But it might also mean rising deforestation. A 2021 study from the Federal University of Minas Gerais projected deforestation of more than 230,000 hectares in Indigenous lands in Mato Grosso state by 2035 if it is completed.The railway is on hold pending a court's ruling on the constitutionality of a law that permitted felling forest in the Jamanxim National Park to make way for its crossing.In January, Lula's transport minister, Renan Filho, placed Ferrograo among top priority projects.",
        "Doto Takak-Ire, who like Chief Raoni is a leader of the Kayapó, said in a column published in O Globo newspaper in March that the project would threaten the survival of 48 Indigenous peoples, and called it \"the railway of Indigenous genocide\"."
    ]
}