{
    "articleURL": "/femail/article-12054435/Sovereigns-Orb-carried-King-Charles-weighs-staggering-1-3kg-features-stunning-amethyst.html",
    "content": [
        "The Sovereign's Orb is part of Coronation Regalia kept at the Tower of LondonRead more: True story behind Queen Camilla's crown and coronation jewels - key role of Cullinan diamond revealedAs King Charles III was crowned today in an historic ceremony, he was presented with a stunning collection of symbolic jewels.",
        "Alongside the glittering crowns and rings, the gold orb is perhaps one of the most symbolic items that was used during the ceremony.Such is its association with the Coronation, the ceremony for King Charles was given the secret codename 'Operation Gold Orb' after Queen Elizabeth's death last year.It was handed over to the King along with the Sovereign's Sceptre to form a mirror image of the Coronation portrait of his mother, the late Queen, who took on the role before him.The orb, which weighs a staggering 1.3kg, usually sits in the Tower of London as part of the Coronation Regalia and has played a central part of the crowning of monarchs for hundreds of years.",
        "Representing the globe, the Sovereign's Orb is a hollow sphere which is separated into three sections to represent the three continents known in medieval times.The sections are outlined by rows of precious jewels and it is mounted with clusters of emeralds, rubies and sapphires surrounded by rose-cut diamonds, and single rows of pearls.It also features a cross beset with pearls and rose-cut diamonds, with a sapphire in the centre on one side and an emerald on the other.Made in 1661, the golden orb weighs a staggering 1.3kg and features a showstopping amethyst that forms the 'monde' and measures more than an inch in each direction.",
        "The orb represents the Christian world and the join which runs across it depicts the equator.It is therefore a symbol of the monarch's power with the cross reminding the bearer that their power derives from God.During today's Coronation service, King Charles looked solemn as the orb was placed in his right hand by the Archbishop of Canterbury, Justin Welby.He was also presented with a number of symbolic regalia alongside the orb, including the two Sovereign's Sceptres.",
        "The Sceptre with Cross features the Cullinan I diamond - the largest colourless cut diamond in the world.In 1911, it was mounted in the Sovereign’s Sceptre by Garrard, the then Crown Jeweller, and is so large that the Sceptre – which was made for Charles II’s coronation in 1661 – had to be reinforced to take its weight. While holding the two sceptres, he wore the St. Edward's Crown - the historic centrepiece of the Crown Jewels which was also created for Charles II and is named after Edward the Confessor.In the 19th century it was made lighter and more comfortable to wear, and was given a new purple velvet cap.In December, it was announced it had been removed from the Tower of London, where it is normally kept, to be resized for the coronation.",
        "As he left Westminster Abbey, he was pictured holding the orb and sceptre and wearing the Imperial State Crown.The crown also features one of the Cullinan diamonds - a 317.4-carat cushion-cut stone which sits below the Black Prince’s Ruby.The newly-crowned King was seen wearing the crown as he waved from the balcony of Buckingham Palace alongside his wife, Queen Camilla.",
        "While the presentation of regalia could be seen by millions watching the Coronation ceremony, the anointing of the new monarch was kept private from viewers. Shielded from view with a specially commissioned screen, Charles was anointed with Holy Oil by the Archbishop of Canterbury as part of the proceedings. Depicting a tree with 56 leaves representing the Commonwealth nations, the hand-sewn design on the front of the screen had the King’s cypher at the base of the trunk showing the sovereign as a servant of the 'family of nations'.Sustainability - a long-held passion of the King - was a key theme of the design, even using poles made from a windblown oak tree from the royal estate at Windsor originally planted by the Duke of Northumberland in 1765 and special biodegradable thread.Charles selected iconographer Aiden Hart, a member of the Greek Orthodox Church who has created liturgical art and cathedral interiors for the Pope, Anglicans and his own faith during a 40-year career, to create the screen."
    ]
}