{
    "articleURL": "/wires/reuters/article-12044997/Rockies-pound-Brewers-straight-win.html",
    "content": [
        "Kris Bryant and Charlie Blackman homered, Alan Trejo and Elias Diaz had two hits each and the Colorado Rockies beat the visiting Milwaukee Brewers 7-1 in Denver on Wednesday night.",
        "Kyle Freeland (3-3) tossed five strong innings before leaving with an issue with his neck for the Rockies, who have won a season-high three straight.Owen Miller had two hits for Milwaukee, which has dropped three straight and six of their last nine.Both pitchers were sharp early as no runner made it past first base through the first three innings.Colorado finally got on the board in the fourth off Eric Lauer. Bryant reached on a one-out error, went to third on C.J. Cron's double to left and scored on a single to right by Diaz.Randal Grichuk followed with a walk to load the bases but Lauer struck out Ryan McMahon for the second out. Trejo then doubled off the wall in center to clear the bases and give the Rockies a 4-0 lead.Lauer (3-3) allowed four runs -- all unearned -- on four hits and struck out six in 4 2/3 innings.Freeland threw his first pitch of the top of the fifth and felt something in his neck, prompting manager Bud Black and a trainer to come out and check on him. He stayed in the game and struck out the side.He left after allowing three hits and striking out five in five scoreless innings.",
        "The Brewers got runners on the corners with two out in the seventh but Justin Lawrence came in and retired Tyrone Taylor on a lineout.Colorado extended its lead in the bottom of the inning. Jurickson Profar doubled off Hoby Milner and Bryant crushed his fourth homer of the season to chase Milner.The Rockies loaded the bases with one out but McMahon flew out to right and Taylor threw out Cron at home to end the inning.Blackmon hit a two-out solo homer in the eighth, his third of the season.Taylor had a bases-loaded sacrifice fly in the ninth for Milwaukee's only run.--Field Level Media"
    ]
}