{
    "articleURL": "/wires/ap/article-12047899/Tyre-Nichols-died-blunt-force-injuries-autopsy-shows.html",
    "content": [
        "MEMPHIS, Tenn. (AP) - Tyre Nichols died of blows to the head suffered when he was beaten by Memphis police during a January arrest, an autopsy report released Thursday showed.",
        "The autopsy said the manner of death was homicide. The report released by the medical examiner in Memphis described brain injuries, cuts and bruises to the head and other parts of the body.Nichols was Black, as were the five police officers fired and charged with second-degree murder and other counts after his death. They pleaded not guilty Feb. 17.Ben Crump, an attorney for the Nichols family, said they were briefed Wednesday on the autopsy report by the district attorney in Shelby County, which includes Memphis.\"The official autopsy report further propels our commitment to seeking justice for this senseless tragedy,\" a statement released by Crump´s law firm said.Nichols was stopped by police Jan. 7 for an alleged traffic violation and was aggressively pulled out of his car by officers. An officer shot at Nichols with a stun gun, but Nichols ran away toward his nearby home, according to video footage released by the city of Memphis and other police records.",
        "Officers who were part of a crime-suppression team known as Scorpion caught up with Nichols and punched him, kicked him and slugged him with a baton as he yelled for his mother.After the beating, officers stood by and talked with one another as Nichols struggled with his injuries while he was on the ground, video showed. One officer also took photos of Nichols as he was propped up against an unmarked police car, video and other records showed.",
        "Nichols was taken to a hospital in an ambulance that left the site of the beating 27 minutes after emergency medical technicians arrived, authorities said.Nichols, 29, died three days later. His funeral was held Feb. 1.Police said Nichols had been suspected of reckless driving, but no verified evidence of a traffic violation has emerged in public documents or in video footage, and Memphis Police Chief Cerelyn \"CJ\" Davis has said she has seen no evidence justifying the stop or the officers´ response. She disbanded the Scorpion unit after Nichols´ death.According to the autopsy, ethanol - or drinking alcohol - and tetrahydrocannabinol, or THC, were detected in Nichols' system. THC is found in marijuana.The concentrations of alcohol and THC detected were low, said Dr. Andrew Stolbach, a medical toxicologist with Johns Hopkins Medicine who reviewed the autopsy report at the request of The Associated Press.The alcohol level is \"about equivalent to a drink or two,\" Stolbach said. \"It´s a level that a lot of people would have after drinking socially, people capable of driving home legally.\"In addition to the five Black officers fired and charged with murder, one white officer who was involved in the initial traffic stop has been fired. That officer will not face charges for his role in Nichols´ death. Another officer who has not been identified also has been fired. An additional officer retired before he could be fired.",
        "Three Memphis Fire Department employees who were at the site of the arrest have been fired. Two Shelby County sheriff´s deputies who also were there were suspended.Nichols´ family, their lawyers, community leaders and activists have called for changes within the Memphis Police Department concerning issues related to traffic stops, use of force, improving transparency and other policies. The city council has passed an ordinance ending traffic stops based solely on a single secondary violation, such as an improperly placed license tag.Nichols´ mother has filed a $550 million federal lawsuit against the city, the police department and Davis. The city has declined comment on the lawsuit.___AP Medical Writer Carla K. Johnson in Washington state contributed. Associated Press reporter Rebecca Reynolds also contributed from Louisville, Kentucky."
    ]
}