{
    "articleURL": "/wires/aap/article-12058669/Kurtis-Patterson-steps-aside-NSW-cricket-captain.html",
    "content": [
        "Kurtis Patterson has stepped down as NSW captain amid a disastrous 2022-23 Sheffield Shield campaign.",
        "Patterson has captained the Blues for the past two summers but was dropped for the final match of last season as NSW went winless for the first time since 1938-39.Patterson had scored 417 runs at 29.78 last season but paid the price for a poor end to 2022-23.Patterson's decision follows the appointment of Greg Shipperd as full-time coach after Phil Jaques was axed in November.\"That was a disappointing finish to the season for Kurtis,\" Shipperd said.\"I have had contact with him today. We have identified some areas of his game and thinking.\"Losing the captaincy will allow him to concentrate on performing at his best. You can get consumed by captaincy and he gave it a terrific shot.\"It was team first and him second. We can flip that and get him back playing as good as he has ever been playing.\"Shipperd said he was yet to decide who would take on the job, after he handed it to Moises Henriques in the final round of last season.The Blues coach is also keen to make other changes, with more games at the SCG.NSW played Shield matches at Wollongong, Albury, and Drummoyne last season, and have not played more than three games a season at the SCG since 2016-17.",
        "The use of the SCG comes at a significant financial cost, while there are also challenges around venue availability.The Blues also do have another home option, with the Cricket NSW's base now set up at Silverwater and the ground meeting ICC compliancy.\"I am a strong believer that we have a strong presence at the SCG and at Cricket Central,\" Shipperd said.\"It's so players can understand the conditions, the winds and the environment.\"It's an important part of being in a competitive system. You need to have your own benefits in your own state from time to time.\"That does have an impact, and you only need to be off in terms of finding the edge a few per cent, and it can have a difference in winning or losing matches.\"NSW announced their contract list on Monday for 2023-24, with Chris Green earning his first state deal.Allrounder Daniel Sams has opted to pursue overseas T20 leagues, rather than take up a full-time contract."
    ]
}