{
    "articleURL": "/news/article-12041181/Rishi-Sunak-drafts-MI6-GCHQ-scams-crackdown.html",
    "content": [
        "PM has revealed National Fraud Squad will crack down on the 'despicable' crimeBritain's spies are being drafted in to help a new 'fraud FBI' go to war on scammers, it was announced today.",
        "The PM has declared that a National Fraud Squad is being set up to crack down on the 'despicable' crime that costs Britain nearly £7billion a year.MI6 and government listening post GCHQ will play a greater role in identifying overseas fraudsters. There will also be curbs on technology that helps scammers send out texts to huge numbers of people at once, and a blanket ban on financial cold calls - even if they are legitimate.That should mean that Brits know for sure it is a scam if they are approached unsolicited about an insurance or other product. Announcing the wide-ranging package of tough measures, Mr Sunak told the Daily Mail: 'The time has come to put the fraudsters out of business.'The Government's fraud strategy will 'take the fight to the scammers', he added.",
        "In wide-ranging measures, the Government will create a dedicated National Fraud Squad with 300 specialist investigators – rising to 500 by 2025 – to hunt down scammers. There will be a ban on unsolicited calls by insurance firms and other financial providers so the public knows any approaches they receive are dodgy.The beleaguered Action Fraud agency – recently slammed as 'unfit for purpose' by MPs – will be replaced with a £30million fraud reporting service by the end of this year.",
        "Law changes will be made to introduce longer jail terms for fraudsters. And banks could be allowed to delay processing transactions so suspicious payments can be investigated.Around 70 per cent of scams are believed to have their roots overseas, with the most common including tricking victims into transferring cash and phishing. One notable recent example is the 'Hi Mum' text con, where criminals masquarade as distressed children to get money out of parents.GCHQ already works with banks on fraud, but its role will be extended alongside MI6 to 'identify and disrupt' scammers abroad.Mr Sunak said: 'By blocking scams at the source, boosting protections for people and bolstering enforcement, we will stop more of these cold-hearted crimes from happening in the first place and make sure justice is done.'Officials will also work with tech firms to make it easier to report online scams with a single 'click'.Telecoms regulator Ofcom will take steps against scammers who 'spoof' legitimate phone numbers in a bid to fool victims into believing they are being called by a genuine organisation.Criminals will be prevented from getting hold of specialist equipment – known as 'SIM farms' which can send out millions of phoney messages.Home Secretary Suella Braverman said: 'It is vital we adopt a new approach to this threat.' ",
        "The new National Fraud Squad will be jointly run by the National Crime Agency (NCA) and City of London Police. Victims will have access to an 'online portal' where they can get step-by-step updates on their case, a spokesman added.",
        "The Government is to launch a review of the way fraud is prosecuted in a bid to speed up the justice system. Increasing maximum jail terms – currently 10 years in prison for fraud – will also be considered.An 'anti-fraud champion' role will be filled by Anthony Browne, a Conservative backbench MP and former chief executive of the British Banking Association. He said: 'We can use the technologies fraudsters are exploiting against them to stop them in their tracks.' The crackdown is a victory for the Daily Mail's Stop The Scammers campaign, launched in 2018, which set out a number of demands to tackle the insidious crime.Martin Lewis, founder of MoneySavingExpert, said: 'The measures are a good first step in the right direction. 'This is about putting enough resources in to build a dam to stop the flood.'"
    ]
}