{
    "articleURL": "/wires/afp/article-12041405/US-ex-general-urges-Taiwan-learn-Russia-Ukraine-conflict.html",
    "content": [
        "A retired US general on Wednesday urged Taiwan to heed lessons from Russia's war in Ukraine and bolster its unmanned drone defences, with the island facing increasing military threats from China.",
        "Democratic Taiwan lives under constant threat of invasion by China, which views the island as part of its territory to be reclaimed one day -- by force, if necessary.Retired US Marines lieutenant general Steven Rudder was part of a delegation of American defence contractors in Taipei on Wednesday to discuss the development of military hardware -- including unmanned aerial systems (UASs) -- with Taiwanese companies.Speaking on the sidelines of the defence industry forum, Rudder told reporters that Taiwan -- along with the rest of the world -- \"is learning from\" Russia's war in Ukraine.\"We've seen smaller UASs take a very prominent role and we've seen ground forces in distributed manners are able to create a factor of defensive firepower within an urban environment in ways that we haven't explored before,\" he said.This technology \"allows you to create coverage in areas where you don't have conventional forces\".Street-to-street urban warfare has been part of a wider Ukrainian counteroffensive since Russia invaded the country last year -- which has deepened fears a continent away that Beijing could follow through on threats to annex Taiwan.Taipei's military last year incorporated urban warfare into its annual war games, with reservists guarding sandbagged trenches in drills aimed at blocking enemies from gaining access to the capital.",
        "A growing number of Taiwanese civilians have also attended urban warfare workshops to learn combat skills.\"The current geopolitical situation in the region has created an urgency for (US-Taiwan) defence industrial cooperation,\" said Max Lo, head of the Taiwan National Drone Industry Association, during the forum.Urging the US to sell more advanced UASs to Taiwan, Lo said that the technology provided \"a valuable tool for gathering intelligence, carrying out precision strikes, and conducting a wide range of military operations\" in a flexible manner.The forum came the same day Taipei announced that China's military sent a drone to circle the island for the second time in a week -- a new surveillance tactic added to Beijing's near-daily war-plane flights into Taiwan's air defence identification zone (ADIZ).The BZK-005 drone, a long-range reconnaissance unmanned aerial vehicle, flew from the north to the island's east before it headed south and back west, according to a map released by Taiwan's defence ministry.\"We are closely watching how the situation develops but so far we have no information,\" said Taiwan's National Security Bureau Deputy Director-General Chen Chin-kuang, adding that Taiwan will work with allies \"to jointly stay on top of early warnings\".Beijing has ramped up its sabre-rattling in recent years and last month conducted its latest war games around the island in response to a meeting between Taiwanese President Tsai Ing-wen and US House Speaker Kevin McCarthy in California."
    ]
}