{
    "articleURL": "/wires/reuters/article-12056521/What-did-former-FCC-Chair-Newton-Minow-say-television.html",
    "content": [
        "WASHINGTON, May 7 (Reuters) - Newton Minow's first speech as chair of the Federal Communications Commission was his most memorable. In addressing leading U.S. broadcast executives on May 9, 1961, in Washington, he said television programming was a \"vast wasteland\" and something need to be done about it.",
        "Here are excerpts from that speech:* \"Your industry possesses the most powerful voice in America. It has an inescapable duty to make that voice ring with intelligence and with leadership.\"* \"When television is good, nothing - not the theater, not the magazines or newspapers - nothing is better. But when television is bad, nothing is worse.\"I invite each of you to sit down in front of your television set when your station goes on the air and stay there, for a day, without a book, without a magazine, without a newspaper, without a profit-and-loss sheet or a rating book to distract you. I can assure you that what you will observe is a vast wasteland.\"You will see a procession of game shows, violence, audience-participation shows, formula comedies about totally unbelievable families, blood and thunder, mayhem, violence, sadism, murder, Western bad men, Western good men, private eyes, gangsters, more violence and cartoons. And, endlessly, commercials - many screaming, cajoling and offending. And most of all, boredom.\"True, you will see a few things you will enjoy. But they will be very, very few. And if you think I exaggerate, try it.\"* \"Most young children today, believe it or not, spend as much time watching television as they do in the schoolroom ... It used to be said that there were three great influences on a child: home, school and church. Today, there is a fourth great influence and you, ladies and gentlemen in this room, control it.\"",
        "* \"We need imagination in programming, not sterility; creativity, not imitation; experimentation, not conformity; excellence, not mediocrity. Television is filled with creative, imaginative people. You must strive to set them free.\"* \"I say to you, ladies and gentlemen, I remind you of what the president said in his stirring inaugural. He said, 'Ask not what America can do for you; ask what you can do for America.' I say to you, ladies and gentlemen, ask not what broadcasting can do for you; ask what you can do for broadcasting. And ask what broadcasting can do for America.\" (Editing by Bill Trott and Diane Craft)"
    ]
}