{
    "articleURL": "/news/article-12058689/Pauline-Hanson-sells-1-1million-Maitland-pub-Pourhouse-slams-Albanese-property-prices.html",
    "content": [
        "Pauline Hanson more than doubled her money in 11 yearsBut she still has 'lost confidence in the national economy' Pauline Hanson has more than doubled her money after selling an investment pub and apartment property for $1.1million, 11 years after buying it for $449,000. ",
        "The boutique craft beer bar called The Pourhouse in the NSW Hunter Valley town of Maitland, also has a three-bedroom apartment which is rented out for $650 a week.But the One Nation leader is not celebrating the economy that allowed her to make such a huge profit, instead slamming the Albanese government for supposedly making life more difficult for real estate investors. 'As an Australian investor I have lost confidence in the national economy under this Labor government,' Senator Hanson's spokesman told the Sydney Morning Herald.'Property investment has become more and more unviable in Australia, and the government are demonising investors.",
        "'So when the opportunity came up to sell my interest in the property, I happily took it.'The senator feels the sudden increase in immigration after the end of the Covid pandemic has caused the rent, mortgage and cost of living pressures felt by many Australians.One of those cost of living pressures is the price of a beer, with Ms Hanson saying she was shocked to recently get charged $13.50 for a schooner at a Queensland bar.'I despair for Australians who like to have a drink at the local pub,' she said. Though she did not run The Pourhouse - she just rented the premises to the bar owners - Ms Hanson may be aware the venue has some eye-watering prices for its mouth-watering food. ",
        "The House marinated USA style pork ribs costs $35, while the Pourhouse 3.0 burger is $28 and the salt and pepper squid salad will set you back $24. Reserve Bank Governor Philip Lowe and many Australian economists disagree with Senator Hanson about the cause of the country's housing difficulties, saying the lack of properties being built, not the reopened borders, is to blame. Despite calling for something to be done about housing supply and costs, One Nation is not going to support Labor's Housing Australia Future Fund in parliament. ",
        "The fund would see $10billion invested to build 30,000 social and affordable homes over the next five years.In not supporting it because Ms Hanson thinks 30,000 homes is not enough, One Nation is aligned with the Greens, who hold the same view.   But the Greens do not back the controversial senator's other views on how to fix the housing crisis - by lowering immigration and banning all foreigners from owning real estate.Labor's proposed $10billion figure for 30,000 affordable homes may increase in the coming days, however, as it needs the Greens' backing to get the bill through the Senate. "
    ]
}