{
    "articleURL": "/wires/ap/article-12059867/Disney-parks-forefront-Igers-return.html",
    "content": [
        "It's been six months since Bob Iger canceled his retirement and stepped back into the top role at Disney to right a number of perceived wrongs under his handpicked successor, with one hovering right near the top: reconnecting with the Disney theme park die-hards and restoring their faith in the brand.",
        "Among his first acts as returning chief executive, Iger walked the Disneyland and California Adventure parks in Anaheim, California with Josh D´Amaro, chairman of Disney parks, experiences, and products. And there was Iger at Disney World in Orlando, Florida, Disneyland Paris and Tokyo Disney Resort, talking to guests and cast members alike and taking a personal interest in new projects that are underway.When Iger rejoined Disney as CEO in November, taking over control of the company from Bob Chapek, it was met with great fanfare by park loyalists who openly criticized Chapek on social media throughout his tenure.The perception among many fans is that Chapek had a \"business first, customer last\" mentality. Rising prices and reduced services rankled Disney devotees who felt that \"the magic is gone.\"Shortly after Iger's return, changes were rolling out at U.S. parks. Disney would no longer charge for overnight self-parking at its Walt Disney World resorts. Walt Disney World annual passholders would be able to visit the theme parks after 2 p.m. without a reservation (with some exceptions). There would also be free digital downloads of photos on rides for guests using Disney's Genie+ planning and ride reservation service.Character meet-and-greets have been ramped up again and new Disney characters being added. The annual pass at Disney World is back.",
        "\"I think that in our zeal to grow profits, we may have been a little bit too aggressive about some of our (theme park) pricing. And I think there is a way to continue to grow that business, but be smarter about how we price so that we maintain that brand value of accessibility,\" Iger said during the Morgan Stanley Technology, Media &amp; Telecom conference in March.Keeping all of Disney's faithful happy at its parks will always be a big ask, said Brandon Nispel, a senior equity analyst at KeyBanc.Even lowering ticket prices is not a universal win. Some will cheer cheaper entry, while others will complain about the big crowds that less expensive tickets bring with them.\"They´re going to always frustrate half the people, half the time,\" Nispel said.And then there's Disney's ongoing battle with the governor of Florida.Iger's has attempted to protect Disney World's theme park district from a takeover by Governor Ron DeSantis. Disney sued DeSantis in late April, alleging the governor waged a \"targeted campaign of government retaliation\" after the company opposed a law critics call \" Don´t Say Gay.\" Disney's legal filing is the latest salvo in a more than year-old feud between the company and DeSantis.Keeping politics at bay and upping the energy at parks is crucial to Disney at a time when its profit and revenue growth have slowed and profit margins at parks softened. By early November 2022, shortly before Chapek departed, Disney's stock had dropped about 50% from a year earlier.",
        "Solid growth at Disney parks helped to offset tepid video streaming and movies performances during the company's first quarter. Sales at its parks, experiences and products segment grew 21% in the period, while revenue for the segment that includes Disney´s movie business only edged up 1%.Parks are the most critical business Disney has from my perspective,\" Nispel said.The amount of money the parks generate keeps all eyes on the operations, especially Iger's.\"We're listening to guest feedback and we're continuously working to improve the quality and value of their experience,\" Iger said during Disney's most recent earnings call.And those improvements will continue into next year, with Disney announcing on Monday that some big updates are in store for Walt Disney World, including the return of Disney dining plans and offering some days that annual passholders and Disney cast members can visit Walt Disney World theme parks without needing a park reservation.Disney dining plans will return as an option for guests staying at Disney Resort hotels who buy a vacation package with arrivals starting in early January. Guests will be able to choose from the Disney Quick Service Dining Plan and the Disney Dining Plan.Theme park reservations will no longer be required for date-based tickets, also beginning on Jan. 9, 2024. Date-based tickets are the standard ticket option for guests. Non-dated tickets and other admission types may still require park reservations.",
        "Disney said it will also continue to offer early theme park entry to Disney resort guests for visits through next year and is working on ways for park goers to be able to plan with its Genie+ service and individual Lightning Lane selections before the day of their park visit.Watching with rising interest along with parkgoers are investors, who saw the company´s shares tumble during Chapek´s last year. Walt Disney Co. will post second quarter earnings results on Wednesday.On Monday, shares of Disney, based in Burbank, California, rose nearly 3%"
    ]
}