{
    "articleURL": "/sport/football/article-12045929/Liverpool-talks-sign-Alexis-Mac-Allister-World-Cup-winner-100-CENT-set-leave.html",
    "content": [
        "Alexis Mac Allister has impressed for Brighton with 10 goals and two assists The 24-year-old assisted Angel Di Maria's goal in the World Cup final in Qatar How Real Madrid won the race to sign Borussia Dortmund star Jude BellinghamAlexis Mac Allister spoke of his love for Brighton on Thursday night - but Liverpool have emerged as the frontrunners to sign the match-winner against Manchester United this summer.",
        "The 24-year-old, integral to Argentina winning the World Cup, has suitors across Europe after two stellar seasons on the South Coast. The expectation is that he will seal an estimated £70million move this summer and his father and representative, Carlos, is handling the negotiations.Mac Allister buried his 99th-minute penalty on Thursday night and said afterwards: 'Of course I was a little nervous. 'I'm very happy every time I have an opportunity to score a goal, so I'm very happy for the team. It's easy to play in this team. The way we play is very nice. My team-mates are fantastic. ",
        "'It's down to them as well. I'm really pleased to play with them and they help me to be a better player every day. 'To be honest, after the World Cup it was a little difficult to play straight away. We didn't have the time to celebrate properly. But it is what it is.'Last night's game descended into chaos as referee Andre Marriner struggled to keep control. He did not see the handball by Luke Shaw in stoppage time but was alerted to it by VAR Andy Madley.'Every defeat is a disappointment,' United boss Erik Ten Hag said. 'But in the end, to lose in the last second is annoying. In the end, we gave away the goal. We have to do our jobs to the end. We lose control and we lost the game. If you can't win, don't lose.' ",
        "Both Manchester clubs are among those keeping watch of the situation, with the former Boca Juniors man likely to cost up to £70million.Sources at the Amex Stadium claimed that the squad have openly discussed the prospect of Mac Allister sealing a switch to Liverpool in the coming months.Brighton - who are signing James Milner on a free transfer once his contract expires - are tough negotiators and also have clubs, including Chelsea, circling for fellow midfielder Moises Caicedo.",
        "Should Liverpool manage to secure Mac Allister, it will act as a significant boost for manager Jurgen Klopp, who wants an overhaul in that area of the pitch. The Reds pulled out of the race for Borussia Dortmund's Jude Bellingham, who Real Madrid are confident of signing, but want fresh faces to reenergise an ageing squad.Mac Allister has caught the eye with 10 goals and two assists from midfield for the Seagulls in all competitions. And they are set to face stern competition from their most bitter rivals, with reports linking Erik ten Hag's United to the player in April. Both sides are thought to be considering midfield rebuilds, with the Red Devils reportedly keen on bringing in greater creativity to their unit. The 24-year-old is still under contract at the club until 2025, with Brighton retaining an option to extend that deal by a further year, which could lead to the Reds requiring a substantial fee to prise him away from the Amex Stadium. ",
        "Should Brighton demand such a fee it could pose a problem for Klopp's side, who ruled themselves out of the race for England star Bellingham due to financial reasons. Bellingham, 19, is in advanced talks with Real Madrid, who look to have beaten the likes of Manchester City to the punch.Although negotiations over a fee are thought to be in an early stage, an estimated £115million will be required to allow the player to depart Borussia Dortmund, and his former club Birmingham City are set for a 15 per cent cut of any fee.Los Blancos' pursuit of the player is thought to have been lengthy, and future business this summer had been put on hold until a deal could be finalised for the midfielder. The player was invited by Real legend and former manager Zinedine Zidane to watch the Champions League final in his box last year, while influential chief scout Juni Calafat met with the player and his family in Chelsea in March. "
    ]
}