{
    "articleURL": "/news/article-12057975/Capitol-rioter-pink-beret-spotted-stealing-camera-equipment-Jan-6-ex-dumped.html",
    "content": [
        "A woman who is believed to have taken part in the Capitol siege has been identified as Jennifer Inzuza Vargas and arrested after the FBI tweeted her photoA man who used to date Vargas recognized her and informed the FBI about her involvement in the riotVargas claimed that she was in Washington, D.C., on the day of the Capitol riot to show support for Trump, not to participate in the violenceA woman who is suspected of participating in the January 6, 2021 Capitol siege has been identified after her ex-boyfriend spotted her wearing a pink beret in a photo posted by the FBI on Twitter. ",
        "Law enforcement were finally able to identify Jennifer Inzuza Vargas of Los Angeles after a man who used to date the a woman recognized her as being his ex-girlfriend who he had dumped for reading Hitler's manifesto, Mein Kampf. The man asked to remain anonymous over concerns him snitching could result in  harassment and threats against him. He gave details to the FBI about her alleged involvement in the riot.The man also went into detail as he recalled his relationship with her stating how the pair initially got on well when they first met in late 2018.",
        "'We weren't, like, trying to get married or anything,' he told NBC News. 'We were hooking up for a few months.' Things suddenly took a turn for the worse after she posted on his Discord, an instant messaging social platform, about reading Adolf Hitler's 1925 manifesto, Mein Kampf. It all appeared to go downhill from there with her fondness for the German dictator exposing Vargas' far-right political beliefs, which deeply troubled the man. After disagreeing with her views on immigrants coupled with her admiration for Hitler, he decided to end their relationship.'I was just instantly turned off, like, \"Yo, I don’t think this is going to work out\",' he said. “You’re, like, reading ‘Mein Kampf,’ you think immigrants don’t deserve X, Y, Z.”' ",
        "The man came forward to reveal how Vargas claimed that she was in Washington, D.C., on the day of the Capitol riot to show support for Trump and not to participate in the violence. She allegedly stated that she supported the police. The man recognized her in the FBI's tweet featuring a woman wearing a pink beret, and he promptly reported her to the authorities. 'I stopped dead in my tracks,' the man told NBC News. 'I'm like, \"That's Jenny.\"'Vargas was the 537th person added to the bureau's U.S. Capitol Violence webpage, which has functioned as a 'most wanted' list of January 6 participants since the investigation began more than two years ago. The FBI have since confirmed they are investigating Vargas based on the tip given to them by the man.",
        "'She’s super into politics, and I didn’t know anything besides the fact that Trump lost,' he ex said said. He knew she had been in Washington on January 6th but when asked, she denied having been there. 'Nope, cause I didn’t go into the [Capitol],' she wrote in a message to him. 'But you still crossed state lines to riot,' he replied.'I was there to support the president. Not to partake in that riot. I support the police,' Vargas responded.",
        "Online sleuths also provided further details about the woman known as '#PinkBeret' having cataloged her appearances in online footage.Vargas actively participated in the chaos during the breach of the Capitol.She is alleged to have stolen a black camera duffle bag, roamed the Capitol grounds, directed traffic outside Capitol doors, and distributed water bottles to fellow rioters in the Capitol Crypt. So far, no charges have been filed against Vargas. Vargas' case is one of hundreds waiting in the pipeline in which many months or even years have passed by between the time rioters have been identified and when they’ve been arrested. "
    ]
}