{
    "articleURL": "/sport/football/article-12045391/Under-fire-Chelsea-owner-Todd-Boehly-breaks-cover-claim-going-work-out.html",
    "content": [
        "Todd Boehly has been reflecting on his first year as co-owner of Chelsea It has been a disastrous season for the Blues, with multiple managers sacked Boehly called for some patience and vowed that the board will 'figure it out' Todd Boehly has urged Chelsea fans to keep the faith, insisting the ownership 'are going to figure it out' following a disastrous campaign that has them 12th in the Premier League.",
        "The Blues co-owner was speaking out on his first 12 months with Chelsea in Beverley Hills in conversation with Milken Institute chairman, Michael Milken. Chelsea are winless in their last nine games in all competitions, a run that stretches back almost two months, and they will end the season without silverware and without Champions League qualification.But Boehly, while understanding the 'demanding' nature of the fans, believes better times are on the horizon for Chelsea. 'The fans are demanding,' Boehly said.",
        "'You know they want to win and we get that we want to win. I think our view though was that this is a long-term project and you know we're committed to the long-term.",
        "Enzo Fernandez - £107m Mykhailo Mudryk - £88.5m Wesley Fofana - £75m Marc Cucurella - £60m Raheem Sterling - £47.5m Benoit Badiashile - £35m Kalidou Koulibaly - £33m Noni Madueke - £29mMalo Gusto - £26mCarney Chukwuemeka - £20mAndrey Santos -  £18mPierre-Emerick Aubameyang - £10.3mGabriel Slonina - £9mDavid Datro Fofana - £8mDenis Zakaria - loanJoao Felix - £9.7m loan",
        "'We very much believe that we're going to figure it out.' He added: 'We've got the best league in the world, we've got what I think is the top city in the world and we've got an unbelievable location in the top city in the world.'",
        "Boehly was speaking just days after Chelsea were humbled in a 3-1 loss to London rivals Arsenal.Fans in the ground could be heard chanting for former owner Roman Abramovich, and interim boss Frank Lampard offered a scathing assessment of issues off the pitch afterwards. 'Winning is just the best feeling there is,' Boehly continued, pointing to his success with the LA Dodgers.'You have to build a team and obviously the coach is the conductor of the team. So I think there is a lot we have learned.'That conductor is likely to be former Tottenham manager Mauricio Pochettino, who remains in talks to take the position in the summer.But having already spent £50m firing Thomas Tuchel and hiring - and later firing - Graham Potter, Boehly's next managerial appointment needs to be a success. 'In the time I've been here it's clear to see behind the scenes, on the training ground, the reasons why [things are going wrong],' interim boss Lampard said this week. 'If you're going to be a nice team to play against all the time it doesn't matter where you go. That won't change overnight but we better get there quickly.'The passive nature of our game you could attribute to many things. The players certainly care. ",
        "'They are low on confidence, but when you play for Chelsea you have to play a certain way even if you are low on confidence.'Whatever it is, it maybe doesn't even matter because the only thing that will get you out of it is understanding and working hard. 'The gap was the other way around for many years.'",
        "After losing at home to Brighton, a match which saw Boehly heckled by home fans from his executive box, he went into the dressing room at the final whistle.Boehly told Chelsea's stars their season was 'embarrassing' in his address. He also named some individuals, speaking to them directly, saying words to the effect of: 'This isn't good enough, this isn't what we brought you to the club for, you're not taking responsibility.'The Guardian claimed that Boehly, who was in the dressing room with fellow board members Behdad Eghbali and Hansjörg Wyss, 'singled out' one player for specific criticism. The American was criticised for his actions and a more recent trip to the dressing room, after a Champions League exit by Real Madrid, brought no such dressing down.  ",
        "Boehly has invested heavily and has yet to see the tangible success he envisioned when he bought the club alongside Clearlake Capital. But the American billionaire is convinced the slate will be clean heading into next season and he pointed to his success with the Dodgers in making them one of the most attractive teams to watch in Major League Baseball.",
        "For now Chelsea fans are eager to see the back of this season with a trip to Bournemouth this weekend followed by Nottingham Forest coming to Stamford Bridge.Lampard has yet to win since taking interim charge and will look to arrest that run down on the south coast.  "
    ]
}