{
    "articleURL": "/wires/ap/article-12041537/S-Korean-Japanese-officials-meet-ahead-leaders-summit.html",
    "content": [
        "SEOUL, South Korea (AP) - Senior South Korean and Japanese officials on Wednesday discussed strengthening relations and coordinating responses to North Korea´s nuclear and missile threats in a meeting in Seoul ahead of a summit between the countries´ leaders.",
        "South Korean President Yoon Suk Yeol will host on Sunday Japanese Prime Minister Fumio Kishida in their second summit since March. The two U.S. allies have been working to repair relations strained by historical grievances and tighten security cooperation to cope with North Korean nuclear threats.The talks between South Korean National Security Adviser Cho Tae-yong and his Japanese counterpart, Takeo Akiba, were focused on the trilateral security cooperation with Washington and encouraging further global efforts to stem North Korean attempts to evade U.N. Security Council sanctions to fund its nuclear arms program.Cho and Akiba also discussed facilitating the economic and cultural exchanges and aligning their broader strategies for the Indo-Pacific region, according to Yoon's office.They later participated in a broader meeting with economic and security officials that discussed issues related to supply chain resiliency, climate change and emerging technologies, Yoon´s office said.The summit on Sunday follows Yoon´s state visit to Washington last week where he and U.S. President Joe Biden agreed to strengthen nuclear deterrence to prevent North Korean aggression.",
        "Yoon, Biden and Kishida are also planning to hold a trilateral summit next month at the Group of Seven meetings in Hiroshima, where North Korea is expected to be among the major topics along with Russia´s war on Ukraine and China´s assertive foreign policy.",
        "North Korea has test-fired around 100 missiles since the start of 2022 as it continues to use the United States´ expanding military exercises with South Korea and Japan as a pretext to accelerate its weapons development.The weapons North Korea tested this year include intercontinental ballistic missiles designed to reach the U.S. mainland and shorter-range weapons potentially targeting South Korea and Japan. North Korean leader Kim Jong Un has punctuated the tests with threats to preemptively use his nuclear weapons in a broad range of scenarios where the North may perceive its leadership as under threat.North Korea´s intensified testing activity and threats of nuclear conflict have pulled Seoul and Tokyo closer together following years of bickering over history. During the summit in Tokyo in March, Yoon and Kishida vowed to rebuild their security and economic relations that had declined over disputes linked to Japan´s brutal rule of the Korean Peninsula before the end of World War II.The meeting, which was the first formal summit hosted by Japan since 2011, came after Yoon´s government took a major step toward improving ties by announcing plans to use South Korean funds to compensate Koreans who were enslaved by Japanese companies during the colonial period.The plan, which doesn´t require Japanese contributions, aims to end a row stemming from South Korean court rulings in 2018 that ordered Japanese companies to offer reparations to the forced laborers. Those rulings irked Japan, which insists all compensation issues were settled by a 1965 treaty that normalized relations.",
        "Yoon´s push to mend ties with Tokyo has triggered criticism from some forced labor victims and his political rivals, who demand direct Japanese compensation. But Yoon has defended his moves, saying closer ties with Japan are critical for dealing with a slew of regional challenges, especially North Korea.Japan´s Trade Ministry said last week that it started procedures to restore preferential trade status for South Korea, days after Seoul took a similar step for Tokyo and requested reciprocity. The countries in 2019 had downgraded each other´s trade status amid an erosion of ties caused by the forced labor rulings."
    ]
}