{
    "articleURL": "/sport/football/article-12061365/Rio-Ferdinand-stresses-Manchester-United-fans-frustrated-lack-title-challenge.html",
    "content": [
        "Rio Ferdinand has stressed that Manchester United have to be realistic Ferdinand says United never expected to challenge for the title this season According to Ferdinand, if United recruit well then they can push on Rio Ferdinand believes that Manchester United fans cannot be disappointed that the club haven't challenged for the Premier League title this season.",
        "United are in fourth place, 19 points adrift of league leaders Manchester City as Erik ten Hag's first campaign at Old Trafford draws to an close.Ferdinand was eager to point out that at the start of the season United's ambition was to qualify for the Champions League, while they have also secured the added bonus of winning the Carabao Cup. Speaking on his Vibe with FIVE podcast, Ferdinand said: 'You've got to be a realist. Man United's aspirations at the beginning of the season were never to win the league, it was to be finishing in the top four and if you got your hands on a trophy he swum the channel, whatever trophy it was. That's where he's at. 'Hopefully if we finish in the top four you can say well done. Because you start hovering around the top you've got to still stay realistic if you're at a football club. Man United can't get out of their pram.'",
        "Former United defender Ferdinand has backed ten Hag's side to push on further next season if they recruit well this summer. He said: 'New recruitment time this summer, recruit well and you can look a bit further beyond what we did at the start of last season. But to think that we're going to go, oh my God we're so disappointed we're not fighting for the league, that was never on the radar.'",
        "For now United are focused on attempting to finish in the top four. They are currently one point ahead of Liverpool, who have played a game more. United suffered a 1-0 defeat away to West Ham on Sunday, with an error from goalkeeper David de Gea gifting Said Benrahma a goal.Ten Hag's side have four league games remaining this season as they will take on Wolves, Bournemouth, Chelsea and Fulham. In addition, they have made it through to the FA Cup final, where they will face rivals Manchester City.  "
    ]
}