{
    "articleURL": "/sport/football/article-12046559/Man-United-vs-Arsenal-friendly-tickets-New-Yorks-MetLife-Stadium-start-pricey-171-each.html",
    "content": [
        "Some fans were left reeling at the high ticket prices in a supporters presale It marks the first time the two American-owned clubs will face each other DailyMail.com provides all the latest international sports news Ahead of one of the most anticipated matchups on the calendar for the Premier League's American summer tour, fans rushed to get tickets and were met with outrageous prices.",
        "Manchester United and Arsenal are set to play in the New York Metropolitan Area at MetLife Stadium in East Rutherford, NJ in July. It'll mark the first time the two historic football clubs have faced each other in the United States.But fans who waited to buy tickets when they went on sale at 9:00am this morning were shocked to find astronomically high ticket prices.The get-in-the-door price on Ticketmaster, the company rolling out the sales, started at $171 for nosebleed seats. For supporters section seats behind the goal, the prices were in the range of $300.Supporters were granted access to a presale yesterday, but scalpers had already sent prices soaring up - with some seats in the range of $600-700.",
        "Fans took to social media to express their outrage, with one saying, 'Dog I was interested in going to the ManU Arsenal friendly in Metlife until I saw those ticket prices.'Another wrote, 'Just logged on for the MetLife presale in case I wanted to change the date I fly back... tickets START at $171?! For the nosebleeds?? Are you JOKING?' New Haven, Connecticut's Arsenal supporters club, the 'New Haven Gooners', tweeted, 'We anticipated scalpers, but not to this degree... 'No one should have to pay the cost of a trip to London for a ticket to a FRIENDLY. You've got blood on your hands, Ticketmaster.'",
        "The rise in prices mirrors that of the debacle that was Ticketmaster's roll out of tickets to Taylor Swift's Eras Tour - but not to the same degree.It's an indication of how significant the event is - and also how popular football, or 'soccer', has become in the United States.Arsenal and Manchester United's clash is just part of the Premier League's plan to send multiple teams over to the USA to play summer warmup matches.",
        "The United States has grown significantly as a market for football - with the Premier League typically being the first stop for many fans who wish to dedicate themselves to the game overseas.Other teams participating include Chelsea, Brighton &amp; Hove Albion, Fulham, Brentford, Newcastle United, and Aston Villa.These matches will be played in Philadelphia, Atlanta, and Orlando as well as Harrison in New Jersey and Landover in Maryland. Of the eight teams playing in the United States, four of them are completely owned by Americans. It's part of a growing trend in the Premier League of American businessmen buying up clubs. This season, Bournemouth was bought by Bill Foley who owns the Vegas Golden Knights of the National Hockey League.",
        "In addition to the teams mentioned above, Liverpool is fully owned by Fenway Sports Group - headed by Red Sox owner John Henry. ",
        "Aston Villa is part-owned by Wes Edens, who also has the Milwaukee Bucks in his portfolio. Three of the four people who own Crystal Palace are Americans - including Josh Harris, who is trying to purchase the Washington Commanders.Outreach to America is considered essential in the growth of the game inside the country. Many of the top clubs in the world have established offices in New York City and have US branches of their operations.With the World Cup coming in 2026 - and the Copa America being played in the US next summer - America's footprint in the world football landscape is growing."
    ]
}