{
    "articleURL": "/wires/ap/article-12040805/Syrian-refugees-fearful-Lebanon-steps-deportations.html",
    "content": [
        "QAB ELIAS, Lebanon (AP) - Lebanese officials are cracking down on Syrian refugees against the backdrop of a worsening economic crisis and political stalemate, an escalation that has caused a panic among Syrians in the country.",
        "In recent weeks, the army has raided refugee camps and set up checkpoints to review the documentation of non-Lebanese citizens, arresting and in many cases deporting Syrians found not to have legal residency, according to refugees and humanitarian organizations.\"People aren´t sleeping in their houses ... and are afraid even to go to work,\" said a woman originally from the Syrian province of Idlib who is living in Lebanon´s eastern Bekaa Valley. Her husband was deported on April 10, along with 28 other men, after a raid on an apartment building in the Beirut suburb of Jounieh, she said, and she hasn´t heard from him since.Like other Syrians interviewed for this story, the woman spoke on condition of anonymity out of fear of reprisals.Her 4-year-old son asks where his father is every day, she said. She fears her husband has been put in one of Syria´s detention centers because - like many men who fled to Lebanon - he was wanted for dodging mandatory army service.Pressure has increased in other ways. Municipalities have put in place restrictive measures such as curfews for Syrians. The Interior Ministry announced Tuesday that it ordered municipalities to survey and register their Syrian populations and make sure they are documented before permitting them to rent property.",
        "It also asked the U.N. refugee agency to revoke refugee status from Syrians who go back and forth between Lebanon and their war-torn country. Last week, a committee of government ministers demanded that UNHCR hand over detailed personal information on refugees in its database.Lebanon hosts some 805,000 registered Syrian refugees, whose official status in theory protects them - although those who fail to keep their residency papers up to date can face deportation. The actual number of Syrians living in Lebanon after fleeing their country´s 12-year-old civil war is believed to be much higher as Lebanon's government ordered the United Nations to halt new registrations in 2015.Government officials have given varying estimates of the number of Syrians in the country, ranging from 1.5 million to more than 2 million. Lebanon is believed to have a population of around 5 million to 5.5 million citizens, but no census has been held for nearly a century.Since Lebanon´s economic meltdown began in 2019, officials have increasingly called for a mass return of Syrians, saying they are a burden on the country´s scarce resources and that much of Syria is now safe. The rhetoric has grown increasingly heated; a federation of trade unions recently declared a \"National Campaign to Liberate Lebanon from the Syrian Demographic Occupation.\"",
        "In recent interviews with local media, caretaker Social Affairs Minister Hector Hajjar claimed that refugees make up 40% of Lebanon´s population, which \"no country in the world would accept.\"Hajjar told The Associated Press that Lebanon's government can ensure that Syrians who qualify as refugees would not be deported, by exchanging data with the U.N. refugee agency.He referred questions about deportations to General Security, the agency in charge of enforcing immigration laws. Spokespeople for the agency and the Lebanese military did not respond to requests for comment and neither has made public statement on the deportations.The U.N. refugee agency said it has observed an increase in raids taking placing in Syrian communities and has received reports of Syrians being deported, including registered refugees. It said it \"takes reports of deportations of Syrian refugees very seriously.\"U.N. officials did not give a number of confirmed deportations. The Access Center for Human Rights, a group tracking conditions of Syrian refugees, said it documented at least 200 deportations in April.The United States, one of the Lebanese Army's largest donors, has expressed concerns about the deportations to Lebanese officials, said a spokesperson at the U.S. Embassy in Beirut who spoke on condition of anonymity as per regulations. Refugee returns should be \"voluntary, safe, and dignified,\" the spokesperson said. \"We have questions about the procedures followed in recent deportations and the extent to which those criteria were met.\"",
        "The anti-refugee campaign comes against the backdrop of stalled negotiations with the International Monetary Fund and a six-month deadlock in electing the country´s next president.Meanwhile, several Arab countries have moved towards a rapprochement with Syrian President Bashar Assad. Refugee returns have been on the agenda of recent regional talks, including a meeting of top diplomats in Jordan on Monday to discuss a political solution to Syria´s civil war.Mohanad Hage Ali, a senior fellow at the Carnegie Middle East Center, said refugees are serving as a scapegoat for Lebanese politicians at a time of heightened public anger over their failure to deal with the country´s economic and political crises.Refugees are \"sort of the punching bag that shows up when everyone needs one,\" he said. He suggested the crackdown could also be linked to Lebanon´s ongoing presidential deadlock.A leading presidential candidate, Sleiman Frangieh, is close to Damascus and has promised to use his connections to broker a deal for refugee returns. His likely rival, army chief Gen. Joseph Aoun, may be \"trying to showcase his ability to forcibly return the refugees,\" Hage Ali said.Lebanese authorities have periodically deported Syrians over the past few years, citing a regulation that allows for Syrians who entered without legal authorization after April 2019 to be forcibly removed.",
        "However, past deportations mostly involved small numbers and were carried out under formal procedures, giving the U.N. and human rights groups a chance to intervene and, in some cases, halt them.In contrast, recent months have seen increasing reports of the Lebanese Army summarily deporting those believed to be in the country illegally. Human rights organizations have cited cases of returning refugees being detained and tortured in Syria, allegations Lebanese authorities deny.A Syrian from Idlib who, along with his brother, was among those arrested in the April 10 raid in Jounieh, said the army dropped off the men in a mountainous area in the no-man´s land between the Lebanese and Syrian borders.He and some others managed to cross back into Lebanon on foot. Others, including his brother, were caught.The last communication he received from his brother, he said, was a voice message on April 11, saying: \"They brought us back and dropped us off in the same place and they´re going to turn us over to Syria.\"Many Syrians are lying low, hoping the anti-refugee campaign will blow over.\"Many of us are scared that we could be next,\" said another Syrian refugee in the Bekaa. \"Six of my friends were deported in the last raid.\"For some, the pressure campaign has had its intended effect.",
        "A young woman living in the Bekaa said that after her camp was raided and dozens of men were deported, her family decided to return to the Syrian city of Raqqa, which remains outside the control of the Damascus government.\"There is no security (there). We don´t have a house or any money,\" she said. \"But we don´t have another choice.\""
    ]
}