{
    "articleURL": "/sport/formulaone/article-12058743/Max-Verstappen-insists-fans-boo-hes-winning.html",
    "content": [
        "Max Verstappen was subjected to boos before and after the Miami Grand PrixIt was all the more obvious due to the pre-race driver introduction ceremony The Dutchman drove a brilliant race from starting ninth to go on and take victoryMax Verstappen has claimed he is targeted for booing only because he’s a winner.",
        "The world champion was subject to abuse before and after the Miami Grand Prix, which he won with a brilliant drive from ninth.His treatment was all the more obvious because the drivers were introduced on to the grid in a pre-race show dreamed up by Formula One’s progressive bosses led by chief executive Stefano Domenicali.Rapper LL Cool J conducted the ceremonies, with Verstappen the only driver to receive a hostile reception.The reigning double world champion, who leads his Red Bull team-mate Sergio Perez at the top of the standings by 14 points, said: ‘If I was driving at the back nobody would be doing anything in terms of reaction, right?",
        "‘It’s normal that they don’t like whoever is winning. So this is something which is absolutely fine for me as long as I stand on the top. 'That is the most important thing. I take the trophy home and they go back to their houses and they can have a nice evening.’Unsurprisingly, Verstappen was not a fan of the driver introductions. He was not alone, with Mercedes’ George Russell among the critics.Russell said it had interrupted his preparations and cited standing around in overalls for half an hour in the sun as undesirable.Verstappen’s take was slightly different. He said: ‘I had enough preparation before to speak to my engineers. But this is a personality thing. ",
        "'Some people like to be more in the spotlight, some people don’t. I personally don’t. So for me, what they did today is not necessary.‘I prefer to talk to my engineers, walk to my car, put my helmet on and drive.‘Of course, I understand the entertainment value. I hope we don’t have that every single time, because we have a very long season.",
        "‘It depends a bit on the crowd in terms of what entertainment they want.’But the initiative was not without supporters, led by Lewis Hamilton. The Mercedes star said: ‘Formula One is trying new things and trying to improve the show. I am in full support of that.‘I grew up listening to LL Cool J, and LL Cool J was there. You look over and will.i.am is there, too, and he is an incredible artist. I thought it was cool.’"
    ]
}