{
    "articleURL": "/news/article-12041363/Martin-Lewis-urges-Britons-check-theyre-eligible-pension-credit-YOU.html",
    "content": [
        "Financial expert Martin Lewis advised Brits to check eligibility for Pension CreditMr Lewis warned as many as one million pensioners could be missing outAnyone making a Pension Credit claim can have it backdated for three months ",
        "Financial expert Martin Lewis has shared his latest tip, that could be of huge benefit to pensioners across the UK. During an appearance on Good Morning Britain, Mr Lewis said that one million pensioners could receive Pension Credit, but have not yet applied for the scheme. The upcoming deadline to apply for Pension Credit is fast approaching, as it falls in less than three weeks on 19 May. Mr Lewis urged pensioners to apply, as anyone who does will not be fined or penalised if they do not meet eligibility criteria, stating: 'Don't stall, just call'. ",
        "In the Good Morning Britain segment, Lewis stated: 'Pension credit is a top-up benefit that helps those who are of state pension age who are not getting enough income.'Anyone wishing to apply for Pension Credit must be receiving no more than £220 per week from a single state pension. This limit increases to £320 for a couple, but both members must be state pensioners. Anyone wishing to apply for Pension Credit can do so up to four months before they become eligible to receive a State Pension.  Upon reaching State Pension age, you can make a claim for Pension Credit at any point, but it will only be backdated for three months.This means you could receive as many as three months worth of Pension Credit from your first payment if you were eligible during the backdated period. ",
        "You will also need to share some personal details including your National Insurance number, along with information about your income, savings and investments. You must also enter your bank account details if applying via telephone or by post. If you elect to backdate a claim, you will need details of your income, savings and investments from the date you want your claim to start.You are not able to use the calculator if you or your partner are deferring your State Pension or own more than one property. Additionally, it cannot be used by anyone who is self-employed or has any housing costs (such as service charges or Crown Tenant rent) which are neither mortgage repayments nor rent covered by Housing Benefit. In May 2019, the law changed so that a ‘mixed age couple’ - a couple where one partner is of State Pension age and the other is not - are considered to be a ‘working age’ couple when verifying entitlement to means-tested benefits.",
        "Upon applying, you will be asked a series of questions related to your residence, earnings and savings.  Once you have answered these questions, a summary screen shows your responses, allowing you to go back and change any answers before submitting. The Pension Credit calculator then displays how much benefit you could receive each week.",
        "Afterwards, follow the link to the application page to find out exactly what you will get from the DWP, including access to other financial support.There is also the handy option of being able to print off the answers you give using the calculator tool so you do not get stuck looking for the same details again. "
    ]
}