{
    "articleURL": "/wires/ap/article-12049361/Soccer-referees-wear-body-cameras-Sydney-violence.html",
    "content": [
        "SYDNEY (AP) - Body cameras will be worn by referees in an amateur Sydney soccer league a week after one of their colleagues had his jaw broken by a suspended player.",
        "The 45-year-old referee, Khodr Yaghi, needed reconstructive surgery and spent four nights in a hospital after being struck by a man who went onto the field at the end of a match in the city's west last week.Bankstown District Amateur Football Association said that from Friday, it will begin a body camera trial for referees in its senior men´s matches.\"Once the trial is running and we have evaluated its effectiveness, we will look to roll out body cameras in other competitions,\" the league said. Organizers are also cracking down on abuse directed at referees, saying some coaches and managers considered it \"their right to question or worse, argue or abuse referees.\"The man who struck Yaghi was charged by police with affray (threat of unlawful violence) and wounding with intent to cause grievous bodily harm. Local media have reported that the man, who was already serving a suspension from the league, is also an amateur boxer. He has been remanded in custody until June 28.England's Football Association began a trial of body cameras in lower-tier leagues in February in a bid to reduce abuse faced by its referees. With about 100 referees across four leagues using the equipment, the footage can be used as evidence in disciplinary hearings.",
        "The western Sydney-based Bankstown league has asked all its teams to form a guard of honor for referees at all matches this weekend.\"We want to actively demonstrate to the BDR (Bankstown Football Referees), that our participants care and support them, and anti-social behavior is not welcome in our game or Bankstown,\" the league´s board said.Yaghi´s jaw was broken in three places and he lost three teeth in an incident that has drawn widespread criticism.Former Australia international Craig Foster said it was \"absolutely horrific\" while the New South Wales state Sports Minister Steve Kamper sought assurances from the sport's provincial governing body that the strongest possible action would be taken.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}