{
    "articleURL": "/news/article-12039635/NJ-boarding-school-student-Jack-Reids-parents-reveal-conversation-suicide.html",
    "content": [
        "Jack Reid's parents have revealed their final conversation with their son who took his own life at Lawrenceville School in New Jersey after being bulliedElizabeth and Bill Reid spoke with 'Good Morning America' and said in their last talk with their son, he said:  'I'm doing better. I love you' A year after his death a school statement recognizes the failure of the school to protect Jack noting how inaction by teaching staff contributed to his deathIf you are having thoughts of suicide, call or text 988 to reach the National Suicide Prevention Lifeline or go to SpeakingOfSuicide.com/resources The parents of Jack Reid, the New Jersey boarding school student who took his own life after being bullied, have spoken out to share the last conversation they had with their son. ",
        "In a new interview with 'Good Morning America,' Elizabeth and Bill Reid said their son, 17, told them he was 'doing better' and said 'I love you,' before he killed himself. 'We were meant to see him the next morning and the last words we spoke to him about were, \"Dad, I'm doing better. I love you,\"' Bill said. His parents said officials at the prestigious Lawrenceville School where tuition is $76,000 a year knew about the relentless bullying and 'cruel behavior' Reid was enduring prior to his April 30, 2022 death. 'We were well aware of what was going on and we were encouraging him. He advocated for himself,' Bill said. 'He talked to the school. He talked to his friends.' Over the weekend, Lawrenceville released a statement saying 'there were steps that the school should have taken in hindsight and did not.'",
        "The statement released over the weekend was part of settlement between the school and Jack's parents. Elizabeth, who is a clinical psychologist, said she was in contact with her son before his death and that she saw no signs of what was to come. Part of the bullying the teenager had endured included unsubstantiated rumors that he was a campus rapist. During a Secret Santa gift exchange among his classmates, Jack was given a rape whistle together with a book about how to make friends.",
        "'Everyone in this room probably knows someone that was bullied as a child, and you do suffer the scars of that,' the devastated mother told GMA. 'This is a very serious issue and the Internet absolutely makes it even much worse for kids today,' she continued. As heartbroken as she is, Elizabeth told anchor George Stephanopoulos it's 'such a pleasure' to speak about their son. She said she was proud of Jack for being kind and living by 'the Golden Rule.'  'He had lots of friends, he loved his community and he was a leader,' she said before mentioning that the family is trying to use Jack's story to save other children. 'You lose a child, you look around at the rubble and you say, \"What can I make out of this?\" I know Jack would want to save other children. And that’s what we want to try to do,' Elizabeth said. ",
        "Although school staff were made aware of the bullying, the school has now admitted make an extraordinary admission of failure on the anniversary of Jack's death. 'There were steps that the School should in hindsight have taken but did not,' the school wrote in a lengthy statement. Most damning of all is the fact the school did not make a public or private statement that it had in fact investigated the rape and found the rumors about Jack and the entire story to be completely untrue. ",
        "Stephanopoulos asked why the school did not exonerate Jack after an investigation into the accusations. The school's officials admitted Sunday that they were aware of the bullying, but fell short in their obligation to protect him. 'We're very gratified by the admission of the school that there are things they could have done and should have done, including the intervention of adults in certain circumstances,' Bill said Monday speaking with GMA.   'We think that's a very courageous admission and we hope other institutions follow their lead... we're anxious to see the success of their plan to fight bullying on campus,' he continued. In a frank, honest and heart-wrenching admission the school, which ranks among the nation's top boarding schools, believes Jack's death could have been prevented and stated how 'there also were circumstances in which the involvement of an adult would have made a difference.'  'As we seek to improve as a community, we have examined our role and take responsibility for what we could have done differently. Lawrenceville's top priority is the physical, social, and emotional health, safety, and wellbeing of our students. We recognize that in Jack's case, we fell tragically short of these expectations,' the Sunday statement read. The agreement requires the school, which hosts 830 students, to undertake a series of corrective actions, including creating a new dean's position that will focus on mental health issues, with the goal of becoming a model for anti-bullying and student mental health. ",
        "'We feel like we both have life sentences without the possibility of parole,' Jack's mother, Dr. Elizabeth Reid, a clinical psychologist, said to the New York Times.'The only thing I'd love to change here is to get Jack back. I can't. I do know if he were alive, he would want me — both of us — to try to make something good out of this and honor him in the way he lived his life.''We think bullying, with the 1,000 times echo chamber of the internet and everybody knowing, is much more devastating to kids and, in Jack's case, produced a very impulsive act,' dad, William Reid said. 'He had to escape the pain from the humiliation he was feeling.' The school explained how after a student who previously had been disciplined for bullying Jack was expelled for an unrelated violation of school rules, Jack was allowed to return the school but was left largely unsupervised where students gathered.'Some harsh words were said about Jack,' the school revealed adding that administrators did not notify or check on Jack once he was back on campus.Later that night, Jack, who was a Dean's list student, took his own life, telling a friend that he could not go through the ordeal again. ",
        "He had a bible in one pocket of his gym shorts, as well as a note directing his parents to a Google document, in which he described his helplessness.  ",
        "'The School acknowledges that bullying and unkind behavior, and actions taken or not taken by the School, likely contributed to Jack's death,' the Lawrenceville School wrote.'We acknowledge that more should have been done to protect Jack.'Following his suicide, the school's board of trustees hired the law firm Petrillo Klein &amp; Boxer to investigate the circumstances surrounding his death. The investigation included interviews with 45 students, faculty members, and others, together with a review of more than 100 emails from students and school personnel, Jack's personal emails, phone records, text messages, and internet searches. 'We said from the beginning, 'Let's seek the truth and follow it where it leads us. Period,' ' Stephen S. Murray, Lawrenceville's head of school, said to the New York Times. 'And that's what we've tried to do every step of the way.'He added: 'This happened on my watch and I'm grief stricken. And yet I can't begin to compare that to the grief and sorrow of Bill and Elizabeth Reid.'The school say they are to introduce 'meaningful changes that will support the School's aspirations of becoming a model for anti-bullying and student mental health.'",
        "The settlement agreement and the school's admission of responsibility are aimed at honoring Jack, taking appropriate responsibility, and instituting meaningful changes that will help prevent something similar from happening again.The admission by Lawrenceville School is particularly rare with educational establishments not usually publicly accepting responsibility after a suicide. The Reids hope that something good can come out of their son's death by raising awareness about bullying, mental health, and suicide prevention. While at Lawrenceville, Jack was recognized as a leader by his peers and served as President of Dickinson House (one of the residential homes at the school).He also ran on the cross country and track teams and loved singing in choir groups.Before attending Lawrenceville, Jack had attended The Buckley School in New York City where tuition starts at $58,500 a year.If you are having thoughts of suicide, call or text 988 to reach the National Suicide Prevention Lifeline or go to SpeakingOfSuicide.com/resources for a list of additional resources. ",
        "We experienced the tragic loss of Jack Reid on April 30, 2022 and through great sorrow, came together in meaningful ways as a community. The Special Oversight Committee of the Board of Trustees conducted a five-month review of the circumstances surrounding Jack’s death by suicide, and produced a summary of findings that were shared with the community in December 2022.April 30, 2023The Lawrenceville School and William and Elizabeth Reid, parents of Jack Reid, have reached an agreement in the wake of the tragic loss of Jack, a Fourth Former in Dickinson House, who died by suicide on April 30, 2022. Jack was universally regarded as an extremely kind and good-hearted young man, with an unwavering sense of social and civic responsibility and a bright future. We continue to mourn this loss.As we seek to improve as a community, we have examined our role and take responsibility for what we could have done differently. Lawrenceville’s top priority is the physical, social, and emotional health, safety, and wellbeing of our students. We recognize that in Jack’s case, we fell tragically short of these expectations.Jack was a victim of bullying and other forms of cruel behavior at Lawrenceville over the course of a year, including in the form of false rumors in person and online. When these behaviors were brought to the attention of the School, there were steps that the School should in hindsight have taken but did not, including the fact that the School did not make a public or private statement that it investigated and found rumors about Jack that were untrue. There also were circumstances in which the involvement of an adult would have made a difference.In addition, on April 30, when the student who previously had been disciplined for bullying Jack was expelled for an unrelated violation of School rules, the School allowed him to return to Dickinson House largely unsupervised where students gathered, including some who said harsh words about Jack. School administrators did not notify or check on Jack. That night, Jack took his life, telling a friend that he could not go through this again. The School acknowledges that bullying and unkind behavior, and actions taken or not taken by the School, likely contributed to Jack’s death.In the ensuing months, the School undertook an investigation of the circumstances leading up to Jack's death. Reflecting on those findings, and discussing them with the Reid family, we acknowledge that more should have been done to protect Jack.Today's multi-faceted settlement with the Reids is aimed at honoring Jack, taking appropriate responsibility, and instituting meaningful changes that will support the School’s aspirations of becoming a model for anti-bullying and student mental health.Over the past year, we have focused on four broad lines of action: training and educational programs, House culture and healthy socializing, the structure of our Dean of Students office and disciplinary protocols, and general health and wellness. In addition to efforts undertaken over the past 12 months, we are planning the following:Lawrenceville will contract with a specialist on school bullying to help construct policies and training to identify and effectively address the behaviors that lead to bullying and cyberbullying.Lawrenceville will contribute to the Jack Reid Foundation, a foundation established by the Reid family focused on education and prevention of bullying.Lawrenceville will hire a Dean of Campus Wellbeing. This will be an endowed position focused on the variety of student mental health issues educational institutions face.Lawrenceville faculty, professional staff, and students will participate in trainings and workshops to raise awareness and promote better understanding of adolescent mental health.Consulting with outside experts as needed, Lawrenceville will continue to review and make improvements to its emergency response protocols and crisis response plans; it similarly will review the safety training it provides to faculty and staff to assure it aligns with best practices.Lawrenceville will make a recurring gift to a mental health organization to support research and best practices for suicide prevention in school environments.There is, of course, nothing that will ever make up for the tragedy of losing this promising and beloved young man. But it is the hope of all of us that Jack's memory is honored."
    ]
}