{
    "articleURL": "/tvshowbiz/article-12052399/Mama-June-Justin-Stroud-united-NYC.html",
    "content": [
        "READ MORE: Mama June reveals her bitter regret at 'blowing' more than $1 MILLION on COCAINE while battling addiction that nearly destroyed her familyHere Comes Honey Boo Boo star Mama June was spotted strolling in New York on Friday with her husband Justin Stroud while shooting a segment for Access Hollywood.",
        "The 43-year-old reality star had a courthouse wedding with Justin, 35, last March before a full family ceremony this February.Justin and June could be seen walking arm in arm during their outing with the outlet.At one point they sat down together on a park bench, where June could be seen gazing lovingly at Justin as they chatted cheerfully with one another.Their united front comes after a new clip of her reality show Mama June: Family Crisis bared some of the cracks in their relationship.",
        "During her interview with Access Hollywood, the star shared an update on daughter Anna's cancer battle.Mama June revealed that she has already done two rounds of chemotherapy with a third next week, she told the outlet.The star added that this round she is more sleepy and tired, noting that she has her 'bad days and she has her good days.'Mama June also jokingly called herself a 'junezilla' because her wedding will be featured on Mama June: Family Crisis, which returns on WEtv. The program, which has lifted the curtain on June's turbulent family life and battles with addiction, is set to premiere its new season this Friday.In the run-up to the episode, a promotional clip showed Justin taking June out to breakfast and confessing his regrets about their relationship.",
        "'You know, this ain't how I wanted this to go,' he said to his dumbfounded wife. 'Like, this whole marriage, you know, like, and how it went down, like that's not what I wanted, like that's not how I wanted it to go.' When June pointed out that he 'signed the papers too' at the courthouse, he countered that 'you asked me in jail. You know, it happened while I was in jail.'Justin admitted he was 'not really' copacetic with the courthouse circumstances of their first wedding, 'to be honest with you.'He continued: 'I was emotionally messed up, I was going through some things. Like, life isn't where I wanted to be at that point. You know, I just got out of rehab not too long before that, and just, I wasn't emotionally in it June.'However when June asked if he had not been 'emotionally into' her, he seemed perplexed, asking: 'What are you talkin' about?'June became convinced that he wanted to 'back out' of the marriage because she was experiencing 'all these medical issues,' but he assured her that was not so.",
        "Meanwhile June recently reunited with her daughter Anna 'Chickadee' Cardwell in the wake of her cancer diagnosis - just weeks after it was reported that she was working on their bond to mend their strained relationship.",
        "The mother-of-four - full name June Shannon - and her 28-year-old daughter seemed to have put their tough past behind them as they smiled for a selfie together in a hospital room.Chickadee -  who was diagnosed with stage 4 adrenal cancer - also posed for a selfie with a red medical cap on.It was a family affair as they rooted Chickadee on as Mama June was also joined by husband Justin Stroud in addition to her daughters Alana 'Honey Boo Boo' Thompson and Lauren 'Pumpkin' Efird.Chickadee's 10-year-old daughter Kaitlyn Elizabeth Clark could also be seen sitting on her mom's lap in a selfie.The group was later seen wearing yellow medical facemasks as they exited the hospital while putting on a united front.Earlier this month it was reported by TMZ that June was nurturing the bond with her daughter although their relationship has been tense in recent years.Insiders told the site that Mama June and Cardwell had begun mending their relationship about a year ago, but now they're a lot closer.",
        "In 2021, Anna was candid about putting distance between herself and her mother when June began a romance with Mark McDaniel, who Anna said sexually assaulted her in adolescence.Now the two are putting the past behind them as June is doing things like watching Anna's kids to help her cope with her new reality.",
        "It was also noted that June has been accompanying Anna to her doctor's appointments as she 'wants her daughter to know she has a support system.'Cardwell underwent her first chemotherapy session last month for stage 4 cancer in her liver, kidneys and lungs after being diagnosed in January with rare adrenal carcinoma.Doctors are now monitoring her progress before making any decisions regarding further treatment. The eldest daughter of Mama June Shannon reported experiencing stomach pains before testing and getting diagnosed.In recent images, Anna appeared with her eldest daughter, Kaitlyn, 10, as the rest of the family support her and remain hopeful.The TLC alum also took photos of herself in the middle of treatment at a hospital in Georgia.",
        "On Thursday, her 17-year-old sister, Alana 'Honey Boo Boo' Thompson, took to Instagram to confirm the devastating diagnosis by sharing an article published by TMZ. Thompson wrote alongside a screenshot of the post: 'This is what I mean when I say you never truly know what somebody is going through at home. No matter how famous they are.''Yes I'm very famous, but normal s*** happens to me and my family and y'all need to realize that ASAP,' she added.According to the American Cancer Society, adrenocortical carcinoma — also known as adrenal cortical cancer — is a disease that affects an estimated 200 Americans per year.",
        "Sources close to the family report that they are all 'very hopeful' Cardwell will pull through and overcome the rare disease.",
        "They also revealed that the family — as well as Anna's boyfriend Eldridge Toney — are all gathering together to take care of Anna and her two children — Kaitlyn and Kylee, 8.Cardwell first appeared on TLC's 2009 series Toddlers and Tiaras alongside her now-teenaged sister Alana and their family.In 2012, Alana received a spinoff series titled Here Comes Honey Boo Boo, which starred their entire family. Cardwell welcomed daughter Kaitlyn in 2012 and married her then-boyfriend Michael Cardwell two years later. They called it quits in 2017."
    ]
}