{
    "articleURL": "/wires/ap/article-12057841/Golden-Knights-look-answer-Oilers-series-1-1.html",
    "content": [
        "EDMONTON, Alberta (AP) - The Vegas Golden Knights were road warriors during the regular season. They will need to be again.",
        "Leon Draisaitl and Connor McDavid each scored twice and Edmonton knotted the series 1-1 with a 5-1 victory Saturday night. Vegas got a lone goal from Ivan Barbashev as the team fell flat after winning the opener 6-4 with goals from five different players.\"We need to do a lot better,\" left wing Reilly Smith told reporters ahead of Monday's Game 3 (8:30 p.m. Eastern, ESPN). \"It´s a game you just have to flush. We had a poor performance in Game 1 last series. We just have to find a way to bounce back.\"The Golden Knights finished the regular season tied for the second-most road points in the league. Whatever they do, they will need to contend with an Oilers team averaging 4.5 goals in the series behind a power play that went 3 for 6 in Game 2 and is now a league-best 14 for 25 in the playoffs.Edmonton defensveman Evan Bouchard has the power play humming, leading all teams with three special teams goals and nine assists over eight games.\"The power play is clicking,\" Bouchard said. \"I think that´s helping me grow in confidence and plays with the puck. We´re getting our chances. We´re putting them in.\"",
        "Leon Draisaitl has six goals with the man-advantage and Connor McDavid has three more. But Bouchard has been a difference maker in his own right.",
        "When Edmonton trailed 3-0 after the first period of Game 4 in the first-round series against the Los Angeles Kings, it was Bouchard´s power-play goal early in the second that kickstarted a comeback in a 5-4 overtime win to even that series.\"Because he´s had time last year understudying, it´s not all brand new to him,\" Oilers coach Jay Woodcroft said. \"He has an understanding of how it flows. He does have a big shot, but he brings a puck up the ice well, and the more experience he gets on it, the better he will be and he´s been pretty good.\"The Golden Knights were the NHL´s least-penalized team in the regular season. Giving the Oilers six power-play chances in Game 2 was uncharacteristic and ultimately the Knights´ undoing.\"What the penalties were it doesn´t matter,\" Vegas coach Bruce Cassidy said. \"They scored on them and we´ve got to find a way to limit those and do a better job killing them, which is not an easy task. We know that but we´ll just have to do a better job.\"DEADLINE DEALSFor Edmonton and Toronto, deals made at the trade deadline have paid off.Toronto went about a massive roster restructuring that saw forwards Ryan O´Reilly and Noel Acciari and defensemen Luke Schenn, Jake McCabe and Erik Gustafsson, and winger Sam Lafferty join the fold.",
        "Edmonton, meanwhile, made added defenseman Mattias Ekholm and then center Nick Bjugstad. Coach Jay Woodcroft said Ekholm has fit with his team \"like a glove\" since arriving from the Nashville Predators.\"We put a lot of work into trying to find the right person to complement our group,\" Woodcroft said, according to The Canadian Press. \"He´s a serious professional. He´s not somebody who just comes to the rink and waits for direction. He has a plan for what he wants to accomplish.\"Bjugstad was excited to join the Oilers after waiting for the Arizona Coyotes to find him a destination.\"I was sitting for four or five days at home, watching everyone get plucked off,\" he said. \"I was wondering what was going to happen ... it was kind of a stressful deal.\"Woodcroft said the excitement in Ekholm´s voice following the trade to Edmonton, a city that isn´t usually high on a player´s list of preferred destinations, was reassuring that the correct move for the right person had been made.\"That was excellent,\" Woodcroft said. \"Somebody who really embraces the weather and the northern climate, who wanted to be part of the proud history and tradition of our club.\"___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}