{
    "articleURL": "/wires/ap/article-12055617/S-Korean-Japanese-leaders-meet-improve-ties.html",
    "content": [
        "SEOUL, South Korea (AP) - Japan´s prime minister expressed sympathy for the suffering of Korean forced laborers during Japan´s colonial rule, as he and his South Korean counterpart Sunday renewed their resolve to overcome historical grievances and strengthen cooperation in the face of shared challenges such as North Korea´s nuclear program.",
        "Comments by Japanese Prime Minister Fumio Kishida during his summit with South Korean President Yoon Suk Yeol - their second meeting in less than two months - were closely watched in South Korea, where many still harbor strong resentment against Japan's 1910-45 colonial occupation of the Korean Peninsula.Yoon has faced domestic criticism that he had preemptively made concessions to Tokyo without getting corresponding steps in return. Kishida´s statement, which avoided a new, direct apology over the colonization but still sympathized with the Korean victims, suggests he felt pressure to say something to maintain momentum for an effort to improve ties.\"And personally, I have strong pain in my heart as I think of the extreme difficulty and sorrow that many people had to suffer under the severe environment in those days,\" Kishida told a joint news conference with Yoon, referring to the Japanese colonial period.He said he believes \"it is my responsibility as prime minister of Japan to cooperate with\" Yoon to forge stronger relations.Kishida arrived in South Korea earlier Sunday for a two-day visit, which reciprocates a mid-March trip to Tokyo by Yoon and marks the first exchange of visits between the leaders of the Asian neighbors in 12 years.",
        "The back-to-back summits were largely meant to resolve the countries´ bitter disputes caused by the 2018 court rulings in South Korea that ordered two Japanese companies to financially compensate some of their aging former Korean employees for colonial-era forced labor. Japan has refused to abide by the verdicts, arguing that all compensation issues were already settled when the two countries normalized ties in 1965.",
        "The wrangling led to the countries downgrading each other´s trade status and Seoul´s previous liberal government threatening to spike a military intelligence-sharing pact. Their strained ties complicated U.S. efforts to build a stronger regional alliance to better cope with rising Chinese influence and North Korean nuclear threats.In March, however, Yoon´s conservative government took a major step toward mending the ties by announcing it would use local funds to compensate the forced labor victims without demanding contributions from Japanese companies. Later in March, Yoon traveled to Tokyo to meet with Kishida, and the two agreed to resume leadership-level visits and other talks. Their governments have since taken steps to withdraw their economic retaliatory steps.Yoon´s push, however, drew strong backlash from some of the forced labor victims and his liberal rivals at home, who have demanded direct compensation from the Japanese companies. Yoon has defended his move, saying greater cooperation with Japan is required to jointly tackle North Korea´s advancing nuclear program, the intensifying U.S.-China strategic rivalry and global supply chain challenges.\"We should stay away from a thinking that we must not make a step forward because our history issues aren´t settled completely,\" Yoon said Sunday. He said that 10 out of the 15 former forced laborers or their families involved in the 2018 rulings had accepted compensation under Seoul´s third-party reimbursement plan.",
        "Kishida said: \"I´m struck by the fact that many people, despite their painful memories from the past, opened their hearts for the future as measures by the South Korean government related to (the fund) move forward.\"Kishida also reaffirmed his government upholds the positions of previous Japanese administrations on the colonization issue, including the landmark 1998 joint declaration by Tokyo and Seoul, but didn´t make a new apology. In that declaration, then-Japanese Prime Minister Keizo Obuchi said: \"I feel acute remorse and offer an apology from my heart\" over the colonial rule.Japanese governments have expressed remorse or apologies over the colonial period numerous times. But some Japanese officials and politicians have occasionally made comments that have been accused of whitewashing Tokyo´s wartime aggressions, prompting Seoul to urge Tokyo to make new, more sincere apologies.Ahead of his summit with Yoon, Kishida and his wife, Yuko Kishida, visited the national cemetery in Seoul, where they burned incense and paid a silent tribute before a memorial. Buried or honored in the cemetery are mostly Korean War dead, but include Korean independence fighters during the period of Japanese rule. Kishida was the first Japanese leader to visit the place in 12 years.\"Kishida´s comments about Koreans who suffered under Japanese colonialism may be criticized for not being more specific about historical perpetrators and more apologetic toward historical victims,\" Leif-Eric Easley, a professor at Ewha University in Seoul, said. \"But Kishida did visit South Korea´s national cemetery and said that his heartfelt views, respect for the past, and recognition of current global challenges produce a sense of responsibility for improving Seoul-Tokyo relations.\"",
        "Yoon said talks among Seoul, Tokyo and Washington are underway to implement their earlier agreement on a faster exchange of information on North Korean missile tests. Yoon said he and Kishida reaffirmed that North Korea´s nuclear and missile programs pose a grave threat to the two countries and the rest of the world.In late April, Yoon made a state visit to the United States and agreed with President Joe Biden to reinforce deterrence capabilities against North Korea's nuclear threats. During a joint news conference, Biden thanked Yoon \"for your political courage and personal commitment to diplomacy with Japan.\"Yoon, Biden and Kishida are expected to hold a trilateral meeting later this month on the sidelines of the Group of Seven meetings in Hiroshima to discuss North Korea, China's assertiveness and Russia's war on Ukraine. Yoon was invited as one of eight outreach nations.Kishida said he and Yoon would pay respects before a memorial for Korean atomic bomb victims in Hiroshima. In another apparent conciliatory measure, Kishida said Japan will allow South Korean experts to visit and inspect a planned release of treated but still radioactive wastewater from the damaged Fukushima nuclear power plant.___Yamaguchi reported from Tokyo.More AP coverage of the Asia-Pacific region is at https://apnews.com/hub/asia-pacific"
    ]
}