{
    "articleURL": "/wires/reuters/article-12059579/Breakaway-Moldovan-region-suggests-Russia-deploy-peacekeepers-RIA.html",
    "content": [
        "CHISINAU, May 8 (Reuters) - Moldova's unrecognised breakaway region of Transdniestria said on Monday it wanted Moscow to bulk up its small contingent of peacekeepers because of what it called growing security risks, Russia's RIA news agency reported.",
        "Though Moldova does not allow Russia to deploy new troops in Transdniestria, Russia has had hundreds of peacekeepers in the region since a bloody war between pro-Russian separatists and Moldovan government forces after the 1991 Soviet break-up.\"As long as Russia's peacekeeping mission continues, Moldova is constrained in any military plans and preparations against Trandsniestria,\" Leonid Manakov, the region's envoy to Moscow, was cited as saying by RIA.\"Transnistria has repeatedly applied for an increase in the number of Russian peacekeepers ...Tthere is such an option, and it is justified in terms of the worsening security risks...,\" he was quoted as saying.Moldova's ties with Russia are currently badly strained and have deteriorated rapidly over the course of Moscow's full-scale invasion of neighbouring Ukraine, which Chisinau has repeatedly condemned.Over the last year, Moldova's pro-Western government has accused Moscow of meddling in its internal affairs, stopped consuming Russian natural gas and applied to join the European Union.The Transdniestria settlement process, known as the 5+2 format, has ground to a halt during the war in Ukraine. Kyiv and Moscow are both participants in the settlement process.Vitalii Andrievschii, a political analyst, said Manakov's remarks could be aimed at pushing Moldova to reopen dialogue.Kremlin spokesman Dmitry Peskov told a regular daily briefing that he had nothing to say about Manakov's comments for now.",
        "Transdniestria lies on the border with southwestern Ukraine, not far from the Black Sea port of Odesa. Russia also has a small unit of troops in the region to defend a huge ammunition dump left there after the collapse of the Soviet Union.The peacekeeping force comprises 402 Russians, 492 Transdniestrians and 355 Moldovans, according to authorities in the region. (Reporting by Alexander Tanas; writing by Tom Balmforth; editing by Mark Heinrich)"
    ]
}