{
    "articleURL": "/sport/football/article-12055329/Lets-hear-refs-Footballs-lawmakers-urged-broadcast-field-conversations.html",
    "content": [
        "Football's lawmakers have been urged to broadcast referee conversationsMartin Cassidy, of Ref Support UK, believes it would 'change football overnight' He hopes it will also help with racial abuse, homophobic abuse, anti-SemitismFootball's lawmakers have been urged to broadcast referee conversations during games to stop incidents like Jurgen Klopp screaming at the fourth official.",
        "Martin Cassidy, CEO of referee charity Ref Support UK, believes allowing fans to hear what is said on the field would 'change football overnight' and end abuse of officials.Liverpool manager Klopp pulled his hamstring as he ran towards fourth official John Brooks to celebrate the late winner against Tottenham last week and was charged by the FA for accusing referee Paul Tierney of having something against his team.Klopp claimed Tierney said something untoward when he was cautioned, but refereeing body, the PGMOL, listened to the audio from their officials' microphones and claimed that Tierney 'acted in a professional manner throughout'.Cassidy, who believes Klopp acted like a Mercedes version of Neil Warnock, said broadcasting referee communications would have a positive impact at every level across the world.",
        "He said: 'If you knew someone was policing you outside the field of play, it would change football overnight. Two things would happen: either the players would behave or the referees and match officials would be exposed for not addressing the foul and abusive language.'It would have a major influence on the rest of the game globally because it is clear the actions of these players and managers are mimicked at grassroots level around the world.It isn't just about referee abuse, but racial abuse, homophobic abuse, anti-Semitism, all forms of abuse can be prevented with the live communications that all match officials use above National League level. I'm yet to see a justifiable reason not to do that. I don't know anyone who is against it other than FIFA or IFAB.'",
        "Football's lawmakers IFAB prohibit the live broadcast of referee communications and have no plans to change the rule but say they have no issue with recordings being made public after games. It comes after Mail Sport revealed Premier League referee chief Howard Webb is canvassing clubs over his wish to release audio of conversations between officials and VARs after matches in a bid to give fans a glimpse behind the curtain and reduce confusion over controversial decisions.Webb was widely praised during his time in the MLS for his openness, running a weekly YouTube show that reviewed all the controversial decisions and included the conversations between referees VARs. Premier League referees have been practising for more than a year for their communications to be broadcast to spectators and television viewers, with the feeling among officials that it cannot come soon enough.",
        "FIFA trialled a new NFL-style system at the Club World Cup, and will do it again at the Under-20s World Cup later this month, when the referees announced the VAR decisions to fans in the stadium, seen by many as the first step to opening up communications.The French FA recently tested it during Lyon's game against Nantes and later showed clips on Amazon Prime Video of referee Benoit Millot speaking to players and communicating with his officiating team. Millot was shown telling Nantes defender Fabien Centonze: 'You already have a yellow card, don't take any chances with this kind of stuff. Don't take risks, be clever.'",
        "It is nearly 35 years since referee David Elleray was miked up for Arsenal's game against Millwall in 1989, when Gunners captain Tony Adams accused Elleray of being a 'f****** cheat' and Elleray responded by telling Adams to 'stand up' in a headmasterly tone.While broadcasting the conversations from the referee's microphone would help fans understand controversial VAR decisions, it will also help protect officials from abuse in the Premier League down to grassroots football. 'We know how big the problem is,' said Cassidy. 'What we find is, right back to the Jose Mourinho days, when we see people acting like that we see a spike in calls to our hotline or our private messages.'Cassidy is a Liverpool fan and, on a personal level, hated to see Klopp's actions last Sunday. 'I cannot stand back and watch Klopp act like that and try to sell it off as passion as currency to justify his behaviour,' he said. 'Do you think Kenny Dalglish wasn't passionate? Or [Bob] Paisley and [Bill] Shankly, Joe Fagan, they were all as successful if not more so than Klopp. Were they not as passionate because they didn't show the emotion he does? I don't buy it. It's hurtful as a fan to see him acting like a Mercedes Neil Warnock. It's embarrassing.'",
        "Cassidy admits it works both ways: 'Weeks after calling for space between match officials and participants after the case between Constantine Hatzidakis and Andy Robertson, Paul Tierney went right up to Klopp. 'Klopp took a step back and Tierney continued to walk forwards, almost poking him in the chest. That's not a good look from a match official. We'd be hypocrites if we didn't call that out.'Jose Mourinho wore a microphone during Roma's 1-1 draw against Monza on Wednesday to 'protect' himself against referee Daniele Chiffi, who sent him off in September. 'I recorded everything,' said Mourinho. 'From the moment I left the locker room, to the moment I returned. I protected myself.'",
        "It did not stop Cheffi sending off Roma defender Mehmet Zeki Celik late into stoppage time. 'He [Cheffi] is the worst,' added Mourinho. 'Technically, he's horrible. Zero empathy. Zero communication.'Cassidy calls for much stronger punishments when players and managers are found guilty of abusing match officials. 'When the FA bring in points deduction for anyone abusing referees, that will prevent it,' he said.'Clubs get deducted points for financial irregularities but it doesn't happen with behaviour. That's not the right message.'You can even get prevented from being promoted because you haven't got enough seats or your changing rooms aren't big enough, but if your discipline is the worst in the country, up you go, no problem. When we start deducting points instead of pounds, it'll change.'"
    ]
}