{
    "articleURL": "/wires/reuters/article-12046853/Argentina-seeks-US-Brazil-support-faster-IMF-payouts--govt-sources.html",
    "content": [
        "By Bernardo Caram and Nicolás Misculin",
        "BRASILIA/BUENOS AIRES, May 4 (Reuters) - Argentina is seeking new easing of targets in its $44 billion deal with the International Monetary Fund and faster payouts, and is pushing to get key IMF members the United States and Brazil to support it, government officials said.The country is expected to return to talks with the IMF on Thursday over amending the deal, which has come under strain amid a historic drought that has battered the country's key cash crops soy and corn, a senior economy ministry official said.Three government sources, including the economy ministry official, confirmed that the country was seeking to accelerate disbursements, with some $10.64 billion of funds scheduled to be given currently between June and December this year.The talks, after the IMF eased program targets already in early April, come as Argentina's foreign currency reserves hit a seven-year low with the drought dragging down grains exports, the main source of dollars.That is threatening the country's ability to meet future debt obligations and make payments on trade. It has ramped up pressure on Argentina and the IMF to revamp the debt program, the largest extended to any country worldwide.The ministry official said backing from the United States and Brazil was key for the IMF talks, and was \"positive\" about it given the countries' broader support for Argentina's economy.",
        "The U.S. Treasury and White House did not comment on record about potential support for Argentina's talks with the IMF. Brazil's presidency did not respond to a request for comment.An IMF spokesperson said that the lender was working \"very closely\" with the Argentine authorities to strengthen the program in light of the impact of the severe drought.\"Discussions in the context of the next review are ongoing and continue in a constructive manner,\" the spokesperson said.U.S. support is important because it is the IMF's largest stakeholder. Brazil meanwhile is Argentina's main trade partner. Argentina would need to reach a technical deal with IMF staff before any agreement went to the board for approval.Argentina has battled major debt and currency crises for years and its bonds trade in distressed territory. Its current IMF loan deal replaced a failed $57 billion program from 2018. (Reporting by Bernardo Caram in Brasilia, Nicolas Misculin and Jorge Otaola in Buenos Aires; Additional reporting by Andrea Shalal in Washington; Writing by Rodrigo Campos; Editing by Adam Jourdan and Andrea Ricci)"
    ]
}