{
    "articleURL": "/femail/article-12050301/Shoppers-say-genius-10-98-food-lids-helping-save-money-waste-less.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information.  ",
        "Amazon shoppers have been raving about reusable lids that stretch to fill things like bowls and glasses, meaning food can last longer and you waste less. The BPA-free DigHealth Silicone Stretch Lids (two pack) cost just £10.98 on Amazon. They come in a range of sizes and stretch to seal bowls, jars, glasses, contains, food cans and so on. So, you can save food and therefore money.  DigHealth Silicone Stretch Lids (two pack)  Gone are the days when we need to chuck out our half-full can of cola or half-eaten apple! These unique lids come in a range of sizes and stretch to cover food. They're safe to use in a microwave, freezer and dishwasher. They also don't leak and are reusable (you can have them for years!), among other qualities.  £10.98  Shop",
        "At only £10.98, they can be seen as an investment. One Amazon customer even said that after a few months, they've 'paid for themselves a couple of times over'.The lids also come in handy when you've made too much food for dinner and want to avoid buying overpriced sandwiches during your lunch break tomorrow. They're microwavable, so you can simply stretch them onto a bowl or container and heat it up in work. ",
        "As well as being microwaveable, they have no leakage (rest assured!) and can withstand high temperatures. So, it doesn't matter if you got carried away embracing your inner Nigella and sautéed the stir-fry at the highest heat!",
        "The handy lids have impressively racked up over 10,000 five-star reviews on Amazon. Some shoppers have written how they love the fact they can now cover things like mugs of beans, while others noted how much money they've saved using them. 'Genius,' raved one happy customer. 'So many different sizes come in the pack, so always find one to fit your tubs, plates, cups, bowls, etc. 'There's even a tiny one to fit your mugs, you know when you've got leftover beans in a mug in the fridge this is perfect for that!' ",
        "'Fantastic items and good for the environment too!' a second agreed. 'Sizes fit almost any tub, fruits and anything else you want to save waste by keeping them fresher for longer. 'Great value for money as they have already paid for themselves a couple of times over and I only got them a few months ago.'A third penned: 'The sizes are excellent - the smallest goes over a small can of sweetcorn, the largest goes over my salad bowl, and there are many uses in between.' Never throw out leftovers, fruit, or even a glass of juice again and shop the Silicone Stretch Lids on Amazon for £10.98."
    ]
}