{
    "articleURL": "/wires/ap/article-12047321/Biden-issues-order-setting-path-sanctions-Sudan.html",
    "content": [
        "WASHINGTON (AP) - President Joe Biden signed an executive order on Thursday setting the path to sanction individuals involved in the recent violence in Sudan that's left hundreds dead and thrown the African nation into chaos.",
        "Biden said in a statement that his order will \"hold individuals responsible for threatening the peace, security, and stability of Sudan; undermining Sudan´s democratic transition; using violence against civilians; or committing serious human rights abuses.\"The president said the violence taking place in Sudan is \"a tragedy - and it is a betrayal of the Sudanese people´s clear demand for civilian government and a transition to democracy.\"Sudan´s fighting broke out April 15 between two commanders who just 18 months earlier jointly orchestrated a military coup to derail the nation´s transition to democracy.The power struggle between the armed forces chief, Gen. Abdel-Fattah Burhan, and the head of the Rapid Support Forces paramilitary group, Gen. Mohammed Hamdan Dagalo, has millions of Sudanese cowering inside their homes and has already displaced hundreds of thousands.\"I join the peace-loving people of Sudan and leaders around the world in calling for a durable ceasefire between the belligerent parties,\" Biden said.",
        "White House National Security Council spokesman John Kirby said the Biden administration had not settled on whether sanctions will be issued against the warring generals.\"I wouldn´t read it as a warning,\" Kirby said of the executive order. \"It´s the president setting up the proper authorities in case we want to use those kinds of tools.\"",
        "He said the administration and the Sudanese people want the generals to \"put down their arms, stop fighting, get back to the table to to work on a transition to civilian authority.\"Several countries have been racing to evacuate their citizens from the troubled nation though millions remain there amid a fragile ceasefire.The United Nations warned on Wednesday that the country´s people are \"facing a humanitarian catastrophe.\"The conflict has killed at least 550 people, including civilians, and wounded more than 4,900. At least 334,000 people have been displaced inside Sudan and tens of thousands more to neighboring countries Egypt, Chad, South Sudan, the Central African Republic and Ethiopia, according to U.N. agencies.Thousands of U.N. workers were evacuated a week into the fighting, and some U.N. agencies paused their services. The World Food Program suspended operations after three of its workers were killed in fighting in southern Sudan, but the agency has since said it will resume its work.The fighting has included unprecedented urban warfare in the capital, Khartoum."
    ]
}