{
    "articleURL": "/wires/ap/article-12045049/Lulas-gun-control-push-starts-counting-Brazils-guns.html",
    "content": [
        "SAO PAULO (AP) - Jonathan Schmidt just made the deadline, arriving at Federal Police headquarters in the center of Rio de Janeiro with a travel bag carrying a golden pistol and seven rifles, one peeking out of the zipper.",
        "\"I´m in love with guns,\" said Schmidt. \"I´d have over 2,000 if the government allowed.\"He had already registered his firearms with the army, as required by law for sport shooters like him, but experts have cast doubt on the reliability of its database, and said lax oversight has allowed such guns to fall into criminal hands. Schmidt was adding his guns to the police registry Wednesday on the final day to comply with a decree by Brazil´s new left-wing president - or face confiscation.Over four years in office, former President Jair Bolsonaro tried to convert a country with few weapons into one where firearm ownership and lack of regulation meant personal freedom.Now, his successor Luiz Inácio Lula da Silva has been moving to undo Bolsonaro´s pro-gun policies, and that started with requiring gun owners to register their weapons with police. After initial resistance, he started seeing success.But more than 6,000 restricted-use guns previously registered with the army, and which include assault rifles, were not presented to police by the May 3 deadline, Justice Minister Flávio Dino told reporters Thursday. Those are likely to have been diverted to criminals, and are now targets for investigation and potential seizure, he said.",
        "In Brazil´s last gun-control campaign, in 2003, Brazilians were invited to turn in their guns and receive a symbolic payment from the state. It boasted a high level of participation.",
        "In the eyes of right-wing Bolsonaro, however, the disarmament statute was a historic blunder. Echoing aspects of American conservativism, he was the first Brazilian presidential candidate to campaign on a pro-gun platform, saying \"good citizens\" are entitled to firearms to protect their families and assets. He altered the rules for how much ammunition one can possess and access to restricted guns. He repeatedly claimed that \"an armed populace will never be enslaved.\"Instituto Sou da Paz, a non-profit that monitors public security, estimates that the number of guns in civilian hands nearly tripled - to 2.2 million in a country of 214 million people - under Bolsonaro. It remains far lower than in the United States and Brazil has no constitutional right to bear arms.\"We had sharp growth in firearm access, including restricted-use weapons,\" Michele dos Ramos, who is leading the workgroup in charge of gun policy within the Justice Ministry, told the AP by phone. \"In order to write any guidelines to restructure gun and ammunition policies and regulations, it is important we have a diagnosis of the situation of these weapons.\"On his first day in office, Lula issued a decree requiring gun owners to register their weapons with the Federal Police and the original deadline was delayed by a month. At Rio´s Federal Police headquarters, officers have registered guns belonging to as many as 50 people per day.",
        "But people had been wary.\"There was a lot of concern primarily at the beginning when they arrived here. They believed we were going to confiscate their guns,\" Marcelo Daemon, the head of the Rio police´s department overseeing arms control, said in an interview in his office. \"A lot of fake news circulated on social media and people came here with fear.\"Some politicians had contributed to a general reluctance to register guns. On March 17, federal lawmaker Julia Zanatta shared a picture of herself holding a machine gun and wearing a T-shirt bearing the words \"COME AND TAKE IT\" and an image of Lula´s hand pierced by three bullet holes. Paulo Bilynskyj, a lawmaker and former police chief from Sao Paulo, shared instructions to follow in case one´s weapons were seized.\"We have a more armed country, a stronger gun culture, more representatives focused on the pro-gun agenda,\" said Carolina Ricardo, executive-director of Instituto Sou da Paz, adding that Congress will be the \"thorn in the side\" of groups pushing for stricter gun control. The so-called \"bullet caucus\" of pro-gun lawmakers gained dozens of new seats in last year´s election.Before the registration initiated by Lula´s government, the army gathered and retained data on gun ownership for sport shooters, collectors and hunters, known as CACs. Bolsonaro scrapped the requirement for such registrants to undergo the arduous process of submitting documentation, justification and psychological exams to the Federal Police, which for its part registers guns owned for self-defense, and so limited the force´s visibility on the total number of guns in circulation.",
        "Army data until recently showed 762,365 firearms were purchased by CACs since May 7, 2019, when Bolsonaro made major changes to firearm and ammunition access. But Instituto Sou da Paz and the Igarape Institute, another security-focused non-profit, estimate the figure fails to reflect roughly 100,000 additional guns, based on data collected via freedom of information requests. Late last month, the army quietly updated its database to reflect almost 200,000 more registered guns, according to the Justice Ministry.By requiring in-person registration, the government hoped to determine precisely how many guns and what types are no longer with their original owners and, potentially, in the hands of criminal groups.Minister Dino presented data Thursday showing 939,154 guns were registered with Federal Police, which includes most of those on the army´s database after the recent boost to its total.\"This (amount) is probably greater than the arsenal of practically all of the military police in the whole country,\" he said. \"We already have a lot of guns in private hands in Brazil.\"Gun advocates mostly came around, though some had encouraged their followers to do so only begrudgingly. Marcos Pollon, a federal lawmaker who leads a pro-gun group often compared to the National Rifle Association, in mid-March called the government effort \"absolutely illegal and unconstitutional.\" A week later, he published a video on YouTube, where he has over 150,000 subscribers, saying he registered his gun and that those who didn't would face the consequences.",
        "The Justice Minister plans to propose a new decree for Lula by May 15 to impose new rules for shooting clubs and gun shops, and limit the amount of guns and ammunition civilians can obtain.Schmidt, the gun owner in Rio, had viewed the government´s registration effort as an embarrassment. But now, he says, he recognizes it is important for the Federal Police to know of all weapons owned by civilians.\"This way, we remain legal,\" he said.___AP writer David Biller and producer Diarlei Rodrigues contributed from Rio de Janeiro"
    ]
}