{
    "articleURL": "/wires/ap/article-12040511/Davis-James-deliver-Lakers-Curry-Warriors-Game-1.html",
    "content": [
        "SAN FRANCISCO (AP) - LeBron James no longer has to do it all against Stephen Curry on the big stage, not even close. Anthony Davis plugs the middle and takes away the easy chances inside. Dennis Schröder has the energy to help chase No. 30 all over the court. D'Angelo Russell can hit a big shot with a hand in his face.",
        "That's the thing about these new-look Lakers - they take so much pressure off the game's all-time scoring leader and LeBron believes in them, even with the defending champions on a 14-0 run with their home crowd rocking.Davis had 30 points, 23 rebounds, five assists and four blocked shots, James added 22 points and 11 rebounds dueling with Stephen Curry in their latest postseason showdown, and Los Angeles held off a late flurry by the Golden State Warriors to win an entertaining Game 1 in the Western Conference semifinals 117-112 on Tuesday night.\"We´ve been playing playoff basketball for about 2 1/2 months now just to punch our clock to be able to play right now in the postseason,\" James said. \"We were very resilient tonight. ... We know how great they are on their home floor, so to withstand that, it´s another good step for our ballclub.\"James' 23 points were his third-fewest in 23 playoff games against the Warriors. His previous-low in a win was 27 in Game 7 of 2016 Finals.Jordan Poole missed a 3-pointer to tie it with 9.7 seconds left as the Warriors' rally in the closing minutes fell short. Curry's 3 with 1:38 left tied the game, then Russell answered right back before Davis blocked a shot by Curry moments later. James missed the first of two free throws with 1:05 to go.",
        "Poole's 3 with 2:48 remaining cut the Lakers' lead to 112-109, and James was called for traveling with 1:53 left.For all-time scoring leader James and Curry - who has the most 3-pointers ever and is reigning NBA Finals MVP - this is a new chapter in the long rivalry between the superstars after they faced off in four straight NBA Finals from 2015-2018 while James played for Cleveland.Curry scored 27 points, Splash Brother Klay Thompson had 25, and Kevon Looney grabbed a career-high 23 rebounds for his fourth game of this postseason with 20 or more. He also had 10 points and five assists. Thompson made a 3 with 5:19 to go that cut the Lakers´ lead to 112-104.The defending champion Warriors will try to even the series in Game 2 on Thursday night back on their home floor at Chase Center, where LA fans could be heard chanting \"Let's go Lakers!\" after the final buzzer.Davis dominated from the opening tip, making 9 of his first 10 shots, while Russell scored 19 points and dished out six assists against his former team.\"I thought AD had a great game. Obviously he dominated and he got blocked four shots and altered some others,\" Warriors coach Steve Kerr said. \"That´s what this team has been doing now for the last few months. They have been one of the best defensive teams in the league for a reason and he´s a huge part of that.\"",
        "James´ 3-pointer with 5:23 left in the third put the Lakers ahead by 10, 86-76. Then Thompson´s snazzy behind-the-back pass led to a dunk by Gary Payton II over James with 3:48 to go as Golden State cut it to 86-80 and forced a Lakers timeout.The Lakers finished off Memphis in six games Friday night and had a couple of extra recovery days to get ready as Golden State was pushed to the distance by the young Sacramento Kings and won Game 7 on Sunday. The Warriors were the first reigning champion to come back from behind 2-0 and win a playoff series.Curry went off for a playoff career-high 50 points, an NBA record for a Game 7. Kerr said he thought his team had an advantage having just played two days earlier.But the revamped Lakers took it to Golden State just as they did winning the final three regular-season matchups - and Los Angeles is a far different team than the one that lost 123-109 here on Oct. 18 to start the season.\"It was a quick turnaround but can´t dwell on it,\" Thompson said. \"... So the morale is not low. We know we let one slip away.\"LOONEY ON THE BOARDSLooney is leading the NBA in rebounds this postseason. He had seven rebounds by the 4:31 mark of the first and 13 by halftime on the way to double-digit rebounds in his sixth straight playoff game - with four 20-plus rebound performances.",
        "He is the first player with four 20-plus rebound games in a postseason since Dwight Howard in 2009.TIP-INSLakers: Thanks to Davis, the Lakers had 32 points in the paint in the first half to Golden State´s 12. The Lakers also were 16 of 17 from the free throw line in the first half and 25 for 29 overall - Davis making all eight of his attempts.Warriors: Curry dropped to 15-8 against James in the playoffs. ... The Warriors had been 13-0 all time - regular season and playoffs - when making at least 15 more 3s than their opponent (21 Tuesday to the Lakers' six). ... Golden State's 106 shots are the most field-goal attempts in a playoff game that ended in regulation since 1990, and the Warriors also had 106 in Game 1 of the 2017 finals against James and the Cavs.___AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP_Sports"
    ]
}