{
    "articleURL": "/tvshowbiz/article-12061523/Roxy-Jacenko-forced-deny-split-husband-Oliver-Curtis-rumours-rage.html",
    "content": [
        "Sydney public relations queen Roxy Jacenko has denied she has separated from her husband of 11 years Oliver Curtis.",
        "Rumours of trouble in their marriage - which famously survived an affair Jacenko had in 2017 while Curtis was serving time for insider trading - have been circulating in the eastern suburbs ever since Curtis moved to Singapore for a new job.Before he flew overseas, the couple was already living apart with Curtis working for a cryptocurrency start-up in Tasmania while his wife stayed behind in Sydney with their two children, 11-year-old Pixie and eight-year-old Hunter.The split whispers intensified last week when the Sweaty Betty PR founder announced she was selling the family's Vaucluse trophy home for $14million.But Jacenko, 43, and Curtis, 37, shut down the speculation on Sunday, telling Daily Mail Australia in a joint statement they were very much still together.",
        "'Where do people come up with such stuff? They are obsessed with that narrative,' said the couple, who tied the knot in a lavish harbourside wedding in 2012.Days before clearing up the rumours surrounding her marriage, the PR maven had announced the 'Jacenko-Curtises' were 'on the move' by selling their Vaucluse home.The couple purchased the swanky home for $6.5million in 2018, and they're looking to more than double that with a price guide of $14million.They extensively renovated the pad, adding a gym, hair salon, kids' playroom, and a specially made storage area for Jacenko's $1million collection of Hermès Birkin bags.",
        "The home also features a stunning marble kitchen, a fully stocked cellar, an extraordinary master bedroom, and swimming pool.Jacenko and Curtis also have a home in Tasmania, where he has been based for work for the last few years with his cousin Tim Rosenfield.'How do you and your husband manage living in different states?' one fan previously asked Jacenko during an Instagram Q&amp;A.'It's probably why he still likes me,' she responded.'He is doing very well with work so I am happy. I've got lots on, as do the kids, so it works. At least now the borders have opened he can come back on Fridays. Prior [to that] he was in Tassie full-time.'",
        "The latest rumours come after Jacenko wound down several of her businesses, the most notable being her PR agency Sweaty Betty, which she founded nearly two decades ago.In addition to closing her flagship public relations firm, she sold her candle business XRJCelebrations and scaled back the toy store Pixie's Pix.She still operates the influencer talent agency Ministry of Talent. ",
        "Jacenko and Curtis have weathered various storms in their marriage over the years. In 2016, Jacenko was diagnosed with breast cancer just three weeks after her husband was jailed for insider trading. Curtis was convicted and sentenced to two years in prison but was released after 12 months on a good behaviour bond.",
        "In 2017, while Curtis was behind bars at Cooma Correctional Centre, Jacenko had an affair with her ex-boyfriend Nabil Gazal. She later said the affair 'wasn't her fault' because Gazal, a millionaire property developer she had previously dated in the late 2000s, 'chased her' at a time when she was vulnerable.The relationship was exposed in late April 2017 when Daily Mail Australia published images of them passionately kissing at Gazal's Sydney apartment.At the time of the tryst, Curtis' release date was just eight weeks away.",
        "Curtis learned about his wife's infidelity while he was still in prison.Sources later claimed he decided to forgive Jacenko for her indiscretion if she forgave him for the past criminal behaviour that led to his conviction.Last year, as they celebrated their tenth wedding anniversary, Curtis shared a tribute to his wife and said he was glad they stayed together despite the 'odds being against them'.'Ten years married to this crazy girl... never a dull moment,' he wrote on Instagram. 'Odds were against us but I'm betting we will get to the half century at least. Love you to the moon and back. Happy anniversary,' he added. "
    ]
}