{
    "articleURL": "/wires/reuters/article-12046447/White-House-Russia-lying-accusation-U-S-drone-attack.html",
    "content": [
        "By Susan Heavey and Doina Chiacu",
        "WASHINGTON, May 4 (Reuters) - The United States dismissed Russia's allegation on Thursday that Washington was behind what it said was a drone attack on the Kremlin, saying Moscow's assertion was a lie.\"Obviously it's a ludicrous claim,\" White House national security spokesman John Kirby said hours after Russia blamed the United States for what it called an attack aimed at killing President Vladimir Putin.\"The United States has nothing to do with it. We don't even know exactly what happened here, but I can assure you the United States had no role in it whatsoever,\" Kirby said on CNN.Kirby said the United States does not encourage or enable Ukraine to strike outside its borders, and does not endorse attacks on individual leaders. Ukraine has denied launching any drones on the Kremlin.It was still unclear what exactly occurred at the Kremlin and the United States is still assessing the situation, Kirby said in television interviews Thursday morning.\"We still don't really know what happened,\" he told MSNBC.Putin's spokesman, Dmitry Peskov, said the United States was \"undoubtedly\" behind the alleged attack on Wednesday, without providing evidence.\"Peskov is just lying there, pure and simple,\" Kirby said.Kirby added that Putin was \"the aggressor\" in Ukraine and could end conflict by withdrawing from Ukraine's territory he invaded in February 2022.",
        "On CNN, Kirby also said he was not aware of any specific intelligence that Russia was targeting NATO's critical infrastructure systems.NATO's intelligence chief warned on Wednesday that Russia may sabotage undersea cables to punish Western nations for supporting Ukraine, as the alliance boosts efforts to protect undersea infrastructure following Nord Stream attacks in September.\"It's something we've been mindful of and watching as best we can since almost the beginning of the war,\" Kirby said on CNN. \"We're watching this very, very closely.\" (Reporting by Susan Heavey and Doina Chiacu Editing by Frances Kerry)"
    ]
}