{
    "articleURL": "/news/article-12039993/Ukrainian-engineers-design-DIY-rocket-families-build-gardens-fight-Russia.html",
    "content": [
        "The Trembita missile uses the same technology as German V1 used in WWIICreators claim rockets could have twice the range of US-made missilesUkrainian engineers have designed a DIY rocket that families can build in their own back gardens from everyday materials to rain terror on the Russian invaders.",
        "Dubbed the 'people's missile', the Trembita uses the same technology as the German V1 flying bombs, or Doodlebugs, used in the Second World War.The anti-Russian Vidsich protest group designed the 'garage-made' rocket which, while not as accurate as laser-guided missiles, should be able to travel around 87 miles.A barrage of 20 of the missiles could 'overcome enemy air defences and hit targets at a sufficient depth', the group has claimed. The rockets can carry up to 20kg of explosives or a thermobaric charge, and use a painfully loud 100-decibel engine. This, creators say, would strike fear into Russian soldiers in the same way that the distinctive whine of Hitler's Doodlebugs terrified Londoners during WW2.",
        "The genius of the improvised weapon also lies in its ability to deplete expensive Russian weapons, its developers say.By releasing a thermal signal picked up by enemy air-defence systems, the Russians would then fire expensive munitions to down the cheaply made rockets.'Our simple missile is incomparably cheaper than the shots of enemy anti-aircraft missile systems,' Vidsich told The Telegraph.The new weapons have been likened to V1 rockets, used by the Nazis on London towards the end of the Second World War.Some 5,000 V1s, the world's first cruise missile, were launched by the Germans to bomb London, causing a massive loss of life.",
        "The Trembita uses the same technology as the V1. It is effectively a motor-powered steel tube which is then attached to glider wings and fired from a catapult. Social media videos showing what appear to be prototypes of the new Trembita weapons seem to show its creators firing up a jet engine.By using gasoline as fuel, the rockets can fly up to 87 miles, giving them almost twice the range of the US-made M31 GMLRS missiles fired by America's M142 Himars launchers, which have proved one of Kyiv's most crucial armaments in the war. Weighing in at 100kg, these new missiles are expected to be able to reach speeds of 248mph.",
        "Hamish de Bretton-Gordon, a former Nato commander, said of the new weaponry, was optimistic about the role of the missiles. 'Improvised weapons can be very effective and the Ukrainians are very canny and the Russians pretty inept,' he said, saying the new rockets can help Ukraine to save on more expensive Western weapons.",
        "American M142 High Mobility Artillery Rocket Systems (Himars) launchers fire satellite-guided missiles.America has been supplying the weapons to Ukraine since June, and they have most commonly been armed with M31 GMLRS unitary rockets.They have proven invaluable as the rockets have twice the range of those Kyiv was using previously. Cost: $3.5millionCame into service: 2010Range of M31 GMLRS rocket: Up to 57 miles Speed of rockets: 1,900 mph ",
        "Ukrainians are no strangers to developing improvised weapons, from Molotov cocktails made by civilians when Vladimir Putin's forces first invaded to kamikaze drones. Drone racing groups such as the formidable Angry Birds team have been praised for their clever use of racing drones as weapons, turning the small devices into bombs that could be sent straight into enemy strongholds.Russia has also used drones in brutal attacks on Ukrainian positions and cities, with Iran reported to have sent 1,700 military drones to Putin's forces. Moscow has launched hundreds of Iranian drones, including the Shahed-136 suicide drones, and others that can conduct both strikes and reconnaissance. But in a spectacular attack in the early hours of today, suspected to have been carried out by Ukrainian drone teams, an oil storage depot in Russia exploded in a towering inferno.The strike - the latest in a series of apparent strikes by Ukraine on Russian territory - was only six miles from the Kerch Bridge built by Putin to link the Krasnodar region in Russia with Crimea, which he annexed in 2014.As the war drags on, Ukrainians continue to employ ingenious tactics to repel the Russian invaders. Saboteurs yesterday derailed a Russian freight train and destroyed power cables with explosive devices in a double blow for Putin.",
        "The train, carrying oil and construction materials, burst into flames following a detonation on the tracks in the Bryansk region, 37 miles from the Ukrainian border.",
        "Video taken shortly after the attack showed several destroyed carriages ablaze and lying on their sides, with dark smoke billowing into the air.Local governor Alexander Bogomaz said the explosive device went off 'on the 136th kilometre' of the railroad between Bryansk and the town of Unecha - a route used for transporting Moscow's military supplies.The sabotage attacks came as Kyiv prepares for a widely expected counter-offensive this spring, with Ukraine building up its mechanised brigades with armour supplied by its Western allies. ",
        "Russian Railways, the country's rail operator, said the attack on the freight train occurred at 10.17am Moscow time (07.17 GMT). It said the locomotive and seven freight wagons were derailed and the locomotive caught fire. Meanwhile, the White House said on Monday that Russia has suffered 100,000 casualties, with more than 20,000 killed in action, during just the past five months amid the grinding conflict in Ukraine.It reflects how Moscow's hopes of rapid victory have given way to a brutal war of attrition that carries a huge cost.Coupled with previous estimates by US officials it could put the total number of Russian casualties at 200,000 since Moscow invaded last year. ",
        "John Kirby, White House security spokesman, said Russia's attempt at an offensive in the eastern Donbas region, through the city of Bakhmut, had largely failed.'For Russia this attempted effort, particularly in Bakhmut, has come at a terribly, terribly high cost,' he told reporters.'Russia has exhausted its military stockpiles and its armed forces and since December alone... we estimate Russia has suffered more than 100,000 casualties, including over 20,000 Killed in action, nearly half of whom were Wagner soldiers, the majority of whom were Russian convicts that were thrown into combat... [without] sufficient combat training, combat leadership, or any sense of organisational command and control.'He said the information was based on newly declassified intelligence, but did not offer further details. "
    ]
}