{
    "articleURL": "/wires/ap/article-12043683/Michigan-Democrats-act-protect-abortion-rights-workers.html",
    "content": [
        "LANSING, Mich. (AP) - Michigan Democrats continued efforts to protect abortion rights Wednesday as the state Legislature advanced a bill that would outlaw companies from retaliating against employees for receiving abortions.",
        "The bill passed along party lines in the Michigan House after previously having been approved by the Senate in March. It would amend the state´s Elliott-Larsen Civil Rights act to prohibit employers from treating a worker differently for terminating a pregnancy.\"No one should lose their job or have to worry about their employment when making a decision that relates solely to their bodily autonomy,\" said Democratic Rep. Felicia Brabec of Ann Arbor.Democratic Gov. Gretchen Whitmer is expected to sign the legislation, and has emerged as a leader in the movement to protect abortion rights.Dr. Sarah Wallett, Michigan´s chief medical operating officer, testified in March during a Senate committee hearing in favor of the legislation.\"Whatever factors go into a person´s decision to end a pregnancy, it is certainly none of their bosses' business,\" Dr. Wallett said. \"Having an abortion has no impact on somebody's ability to perform a job.\"It would be the second time this year that Democrats have amended the state's decades-old civil rights law. In March, Whitmer signed legislation that added LGBTQ+ protections by permanently outlawing discrimination on the basis of sexual orientation or gender identity.Since the fall of Roe last year, protecting abortion rights has been a priority for Michigan Democrats, who control both chambers of the Legislature and the governor´s office. In last November's midterms, voters overwhelmingly approved a ballot measure that enshrined abortion rights in the state's Constitution.",
        "Republicans who spoke out against the bill prior to the vote were opposed to legality of abortion as a whole and said it could be an infringement of religious freedoms. The Michigan Catholic Conference, the public policy arm of the Catholic church in Michigan, said in a statement that they were in \"strong opposition\" to the legislation.The Elliott-Larsen Civil Rights Act prohibits discrimination in employment, housing and public services based on religion, race, color, national origin, age, sex, height, weight, familial status or marital status."
    ]
}