{
    "articleURL": "/wires/reuters/article-12055645/Landon-Donovan-Hope-Solo-National-Soccer-Hall-Fame-inductions.html",
    "content": [
        "The National Soccer Hall of Fame inducted its 2023 class and a belated member of the 2022 class with U.S. team members Landon Donovan and Hope Solo among the inclusions Saturday in Frisco, Texas.",
        "The full list of athletes and contributors honored included Donovan, Solo, DaMarcus Beasley, Lauren Cheney Holiday, Kate Sobrero Markgraf, Jill Ellis and Slavisa \"Steve\" Zungul.Donovan, whose 57 goals tie for the all-time lead in USMNT history with Clint Dempsey, notched 157 appearances for the men's team, which included three World Cups and an Olympics appearance. He spent 15 seasons in the MLS, retiring as the league's all-time goal-scoring leader with 145.\"I've always tried to be mindful of those who came before and quite literally laid the foundation for us,\" Donovan said. \"Generations before us gave us the opportunity to be here, and I'm grateful. Part of our job has been to make it better for the next generation. When you stand in a building like the Hall of Fame, it makes you realize we did a lot of work to get to this point.\"Solo, who deferred induction in 2022, was also honored Saturday. Her career included two Olympic gold medals and a World Cup title over the course of 202 international matches in goal. She was named FIFA's outstanding goalkeeper in 2011 and 2015, a reflection of one of the more dominant stretches in net ever turned in by a professional.\"I have a lifetime of memories filled with the highest of highs and the lowest of lows,\" Solo said. \"I left everything that I had to my country, to my teams, to my coaches, to the Federation and to the fans.\"",
        "As a defender and midfielder, Beasley became the first American on the men's side to ever play in four World Cups. His run included 126 appearances for the national team and 11 seasons in MLS, where he won a pair of U.S. Open Cup titles.\"Without my family, I would not be here,\" Beasley said. \"I don't mean here, on the stage. I mean as a person. My family stays with me. They've been to every World Cup, to all the countries I've played in. This is about family.\"Zungul, known as the \"Lord of All Indoors,\" played 11 years in the Major Indoor Soccer League after immigrating from Yugoslavia in 1978. He was the league's MVP six teams, the MISL scoring leader six times and a seven-time league champion.By the time Zungul had retired following the 1989-90 season, he had amassed an incredible 715 goals to go along with 527 assists (1,242 points) in 455 games.Ellis, the coach who guided the U.S. team to World Cup titles in 2015 and 2019, headed up USWNT for seven seasons, also helming the Under-20 U.S. team in 2010.\"I've been so very fortunate and blessed in soccer to experience incredible highs,\" Ellis said. \"But the times that were hard, the mistakes, the moments that stung were equally as important.\"",
        "Holiday totaled 133 appearances for USWNT, winning Olympic gold in 2008 and 2012.\"When you play, the Hall of Fame isn't in your mind,\" Holiday said. \"I didn't play to be a Hall of Famer. I wanted to win at the Olympics and win gold medals and win World Cups, so I think this is just the cherry on top.\"Markgraf appeared in three World Cups and three Olympics over the course of 201 games over 12 years. She won the World Cup in 1999 and gold medals in 2004 and 2008.\"It's not about me, it's about the people who helped me make this journey,\" Markgraf said. \"The most important part is how I got here, and I would not be here without my family.\"Former soccer writer Grant Wahl was also honored posthumously as the recipient of the Colin Jose Media Award.--Field Level Media"
    ]
}