{
    "articleURL": "/tvshowbiz/article-12061525/Pedro-Pascal-goes-casual-takes-photo-fan-LA-winning-three-MTV-Movie-Awards.html",
    "content": [
        "Pedro Pascal was spotted out and about in West Hollywood, California on Monday, one day after he snagged three MTV Movie &amp; TV Awards.",
        "The 48-year-old star — who recently endearingly talked about his anxiety — was dressed casually in a white Rolling Stones tour T-shirt.The Chilean–American actor added black shorts as he stepped out with tousled hair and a graying beard.Pedro was approached by a female fan dressed in burgundy biker shorts and a black T-shirt.The award-winning entertainer smiled for a selfie with the fan as she excitedly flashed a peace sign.",
        "Pascal added multicolor striped socks to his look, finishing with sleek beige sneakers with gummy soles and a forest green accent color.The actor, who was born in Santiago, Chile, wore eyeglasses at some points during his outing and gulped a green juice.It comes after his hit show The Last of Us won three major awards at MTV's stripped down awards show. Pedro, who plays Joel in the series, delivered a trio of speeches to collect his golden popcorn trophies, the first of which saw him win big for Best Hero.Getting emotional during his remarks, Pascal praised 'young people' as the 'real heroes' and said they 'deserve real heroes.''I want to say thank you, MTV Movie &amp; TV Awards,' he began. 'I am a child of MTV, I grew up on MTV. This means the absolute world to me.",
        "'I wish we could all be together so I could look into your eyes and tell you that all the young people in the world are my heroes and I wouldn't be here if it weren't for you.'The Mandalorian star continued: 'You deserve a world that serves your interests, you deserve to be healthy, you deserve to be safe, you deserve for your individual rights to be fought for and protected.' ",
        "Concluding his remarks, Pascal said, 'You deserve real heroes in this world because you are real heroes to me.'Pedro soon returned to the telecast in another pre-recorded video message when The Last of Us won Best Show.'Thank you MTV Movie &amp; TV Awards,' he started. 'I am accepting these golden popcorns on behalf of show creators Craig Mazin, and Neil Druckmann, and our entire amazing cast and crew from the U.S. and from Canada, who worked tirelessly and passionately to make this show. 'They made it a family experience, one of the best experiences of my life.' Referencing the ongoing Hollywood writers' strike, he added: 'We are all thanking HBO and Naughty Dog, and standing in solidarity with the WGA that is fighting very hard for fair wages. 'We thank you, we love you. I'm going to take these [golden popcorns] to bed with me.'",
        "Pedro returned once more to accept the award for Best Duo, winning with his Last of Us co-star Bella Ramsey.Pascal's celebrity pals also expressed excitement for his wins as they chatted in a group text.Natasha Lyonne, Katherine Waterston, and playwright Jeremy O. Harris were among others in the friends' thread.After he won, Harris wrote, 'This is huge to me. My dream,' while Lyonne said, 'Congratulations pedro!!' ",
        "Katherine chimed in with, 'Pedro! Congratulations!' and Pascal replied with a photo of himself posing with the gongs in a backyard space.'Awwwwwwwwwwww come on no big deal,' he wrote to his buddies.Jeremy took to Twitter to share a screenshot of the exchange along with an added message.'I’ve now been nominated for 3 Tony Awards but Pedro Pascal just climbed my Everest. Do you have one too @nlyonne? These are more important than Oscars,' he tweeted."
    ]
}