{
    "articleURL": "/wires/reuters/article-12058111/FOREX-Dollar-rates-watch-traders-wait-loans-data.html",
    "content": [
        "By Tom Westbrook SINGAPORE, May 8 (Reuters) - The dollar was catching its breath on Monday after dropping last week when the Federal Reserve hinted at an end to the U.S. rate increase cycle, with traders turning their focus to U.S. inflation and bank lending data for the week ahead. Sterling, which hovered at $1.2633, just below an 11-month high hit on Friday, was also in traders' minds ahead of an expected Bank of England rate increase on Thursday. The euro, which has rallied nearly 16% from September lows, was losing a little bit of momentum at $1.1021 and has struggled to break resistance at $1.11. The yen slipped slightly, reflecting Friday's move higher in U.S. bond yields that followed strong jobs data. The dollar/yen was last 0.2% higher at 135.05. Last week the Federal Reserve and the European Central Bank each raised rates by 25 basis points and offered varying degrees of caution about the outlook, which markets took as signals that rate rises are slowing or stopping. U.S. interest rate futures are pricing about a one-third chance of a rate cut as soon as July, according to the CME FedWatch tool - even though stronger-than-forecast U.S. jobs data released on Friday suggests that might be premature. \"The Fed has tended to guide away from the possibility of rate cuts this year, which is somewhat at odds with a rates market which is pricing in cuts,\" HSBC analysts said in a note. \"If the Fed is proved right over the course of 2023, then it will make it harder for the dollar decline to extend,\" the analysts wrote. \"But for the time being, the market is likely to run with the theme of a peak in Fed rates justifying a clear peak in the dollar.\" The U.S. dollar index dropped for a second week in a row last week, losing about 0.4%. The Antipodean currencies also logged solid gains last week, but remain short of clear breaks into new territory. The Aussie dollar was steady at $0.6749 in early trade but faces a hurdle around $0.68. The New Zealand dollar held at $0.6298, with resistance around $0.6365. Later Monday, the Fed's loan officer survey might show whether and how hard banks are tightening up on credit after three U.S. lenders failed over recent weeks - which could weigh on the dollar if it puts downward pressure on interest rates. Traders will also be watching headlines from Capitol Hill as lawmakers attempt to negotiate an impasse over the looming U.S. debt ceiling, with the Treasury Secretary warning the government might be unable to pay debts by June 1. U.S. inflation data is due on Wednesday. \"There is a risk that regional bank issues could escalate, posing a broader risk to the financial system and taking the dollar (higher),\" said Standard Chartered's head of G10 FX research, Steve Englander. \"However, the resilience of big banks makes that unlikely, in our view,\" Englander said. \"We think that the escalation of debt-ceiling concerns is a more likely source of risk-off dollar strength via demand for immediate dollar liquidity.\" ======================================================== Currency bid prices at 0024 GMT Description RIC Last U.S. Close Pct Change YTD Pct High Bid Low Bid Previous Change Session Euro/Dollar $1.1021 $1.1019 +0.01% +0.00% +1.1036 +1.1016 Dollar/Yen 135.0050 134.7900 +0.26% +0.00% +135.2850 +134.9900 Euro/Yen &amp;lt;EURJPY=EB S&gt; 148.80 148.57 +0.15% +0.00% +149.0800 +148.6400 Dollar/Swiss 0.8906 0.8905 +0.03% +0.00% +0.8912 +0.8908 Sterling/Dollar 1.2632 1.2631 +0.02% +0.00% +1.2638 +1.2627 Dollar/Canadian 1.3381 1.3374 +0.06% +0.00% +1.3385 +1.3371 Aussie/Dollar 0.6750 0.6750 -0.01% +0.00% +0.6755 +0.6747 NZ Dollar/Dollar 0.6300 0.6293 +0.08% +0.00% +0.6303 +0.6294 All spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ (Reporting by Tom Westbrook.)"
    ]
}