{
    "articleURL": "/wires/pa/article-12054569/Andy-Murry-reaches-Challenger-event-final-France-seal-50-return.html",
    "content": [
        "Andy Murray guaranteed a return to the top 50 with victory over Harold Mayot to reach the final of the ATP Challenger event in Aix-en-Provence.",
        "The Scot, currently ranked 52, took a late wild card into the second-tier tournament after losing in the first round of the Madrid Open and has made the most of the opportunity with four victories in a row.They have all come against French players, and Murray comfortably brushed aside 21-year-old Mayot, ranked 241, 7-5 6-1 to set up a finale against American Tommy Paul.One consequence of the decision to extend the clay-court Masters events in Madrid and Rome to two weeks each has been the strong Challenger fields this week, with Paul a top-20 player and Australian Open semi-finalist in January.Murray is through to his first clay-court final since the French Open in 2016, and he said on atotour.com: “(It will be) a great challenge for me. Tommy has had a great year so far, playing the best tennis of his career.“He’s played well this week also. He’s a brilliant athlete. My game I think is in a good place. I feel like I’ve played much better the last couple matches. (I) hope for another good performance tomorrow.”",
        "Murray has certainly gained in confidence through the week and pulled well clear with a run of seven games in a row, Mayot bowing to the pressure being exerted on him by double-faulting to give away the opening set.",
        "Finishing off matches has at times been a struggle for Murray in recent years and he wobbled slightly, missing two match points at 5-0 before finally taking his fifth opportunity to clinch it.It is Murray’s second final of the season after the ATP Tour event in Doha in February, where he lost to Daniil Medvedev.The Scot is bidding for his first title since Antwerp in 2019, while, should he beat Paul, he would claim his first trophy at Challenger level for 18 years.He would also climb to just outside the top 40, which would be a major boost to his hopes of being seeded for Wimbledon."
    ]
}