{
    "articleURL": "/femail/article-12041453/Omid-Scobie-reveals-Harry-Meghan-wait-time-welcomed-coronation.html",
    "content": [
        "Omid Scobie said Harry and Meghan had to wait for Coronation invitationHe added they were not sure if they were 100 per cent welcome after Spare Read More: Omid Scobie says Frogmore Cottage was Sussexes' 'one space in UK'Omid Scobie has revealed that Prince Harry and Meghan had to wait 'for some time' to get confirmation that they were 100 per cent welcome at the Coronation in London.",
        "The royal author, 41, who penned the couple's biography Finding Freedom, said Harry never questioned whether he would go or not, however he wasn't sure if he would be invited. Speaking to Holly Willoughby and Phillip Schofield on This Morning, the journalist added: 'There was never any question on whether he would want to come or not, it was a question at one point on whether he would be invited, I think.'From what I understand the Sussexes had to wait for some time to really get the confirmation whether they were 100 per cent welcome at this event. Of course this all follows the release of Spare.'But for Harry there was certainly no question about [attending]. Ultimately he is fifth in line to the throne. He is a Counsellor of State.",
        "'There is a serious constitutional reason for him to be here and he takes that seriously, even though he’s not a working member of the Royal Family.'He added that the occasion would also be an emotional one for the Duke, insisting: 'As we have heard from him time and time again in his interviews, despite the pain that he has experienced from his own family he still cares for them.'So much can happen over time and I don't think he would want to look back and regret not being there for that moment.'",
        "Speaking about Harry's role in the Coronation, Scobie acknowledged that he wouldn't have any official role except to 'be here'.He said: 'Unfortunately there is nothing carved out in the ceremony for him and I would imagine if Harry and Meghan were working royals still, and everything had worked out differently, there may have been some way for them to have been orchestrated into it, or at least to be visible on that big balcony. 'But obviously that's not the case and people are wondering where Harry will be. Will he be with the civvies or will he be with his family members, and if he is what row will he be in? ",
        "'I think people will be watching to see that almost as a reflection of where he stands with his family today. But he gets no say in it.'Speaking about the contact that Harry has had with his father since the release of his tell-all memoir, Spare, Scobie claimed the pair have spoke a few times over the phone. He said: 'Obviously this is the first time he sees his family face to face since the release of Spare. But I don't think people know there has been a somewhat regular pattern of conversation between him and his father since the release of that book.",
        "'Now, have they discussed the details and the points that he wanted to go into? From what I hear, no. But he has had contact with his dad.",
        "He went on to say some of the conversations had been negative, including the 'loss of Frogmore cottage', adding: 'They lose the keys to that any week now and he would have spoken to his father about that.'Scobie also claimed that Harry spoke about the Coronation over the phone with the King and made it clear that he wanted to be a part of it. However, in contrast to his relationship with King Charles, he said Harry's bond with Prince William is still frayed, adding: 'There has been minimal contact since the Queen's funeral.' Elsewhere, he revealed that Meghan had decided not to attend the Coronation to 'protect her peace'.He said: 'She is aware just how much of the spotlight goes on her when she sets even a foot near the story.'It's portrayed as intentional. Should she come over and just stand next to her husband, the commentary and the narrative of the day would have been very different.'The author insisted that some of the Royal Family may be relieved that Meghan won't be at the Coronation because they 'would rather the attention didn't go on to her'. ",
        "He said: 'If you look back at some of Harry and Meghan's biggest problems it was all down to the fact that the attention was always on them at times when it shouldn't have been.' "
    ]
}