{
    "articleURL": "/wires/pa/article-12041617/Sam-Allardyce-hoping-make-difference-Leeds-Premier-League.html",
    "content": [
        "New Leeds manager Sam Allardyce accepts he is taking over a club “in a lot of trouble” – but remains hopeful of making an impact in the fight for Premier League survival.",
        "Having already removed director of football Victor Orta, the Yorkshire club announced the departure of Javi Gracia on Wednesday morning along with his backroom staff.Allardyce, 68, becomes Leeds’ third permanent manager of the season, with Gracia having replaced Jesse Marsch in February.The former Bolton, Newcastle, West Ham and England boss has been out of work since the end of the 2020-21 season after failing to save West Brom from top-flight relegation.It was the first time Allardyce had been relegated from the Premier League in his 30-year managerial career and he left The Hawthorns six months into an 18-month contract.Allardyce, who also had spells in charge of Newcastle, Blackburn, Sunderland, Crystal Palace and Everton, is hoping for an immediate response from a demoralised Leeds squad who are languishing in 17th place, out of the relegation zone only on goal difference.“I know it (Leeds) is in a lot of trouble,” Allardyce told talkSPORT.",
        "“I have seen a lot of trouble before and – I could have done a little bit more time, but four games – hopefully we can make a difference and keep this fabulous club in the Premier League.”Allardyce added: “(I was) shocked (to get the opportunity), I never thought at this stage of the season there would be jobs offered.",
        "“When the phone popped up with a name that I knew pretty well, I knew who it was straight away, so it took me about two seconds to say yes.”Allardyce is reported to have agreed a basic salary of £500,000 for his four games in charge, with a £2.5million bonus if he can keep Leeds up.",
        "Former MK Dons, Charlton and Oxford boss Karl Robinson will be Allardyce’s assistant. Former Leeds striker Robbie Keane is also expected to join the backroom staff.Leeds travel to leaders Manchester City on Saturday, before hosting third-placed Newcastle.The final two games of the season are a trip to West Ham, one of Allardyce’s former club, and the visit of European hopefuls Tottenham.“Obviously they ae very difficult games, Man City, Newcastle, West Ham and Spurs,” Allardyce said.“You can all point out where the easiest fixture might be and of course, there are no easy fixtures in the Premier League, but we can only go and do what we can try and achieve.”Leeds have lost five of their last seven games, with Sunday’s 4-1 reverse at Bournemouth following 4-1, 5-1 and 6-1 defeats to Arsenal, Crystal Palace and Liverpool respectively earlier last month.“We have conceded 28 goals in the last 10 or 12 games, and the first thing that we’re going to have to do is to stop that if we are going to get out of trouble,” Allardyce said.",
        "“Because it means that we are needing to score two and three goals every game to try and win it and if we are left to do that, that would be nearly an impossible task.“I am doing all I can with the staff who are most important in the support they are going to give to try and get the players out of trouble.”On Sunday, fans’ group the Leeds United Supporters Advisory Board issued a vote of no confidence in both the club’s board and Gracia.The players subsequently issued a statement on Monday apologising for their performance at Bournemouth and for failing to acknowledge fans at the team hotel.",
        "Gracia leaves Leeds after only 12 games in charge. The Spaniard collected 10 points from his first six fixtures, but a dreadful run of results in April left the club in a downward spiral.“I’m grateful for this opportunity and proud of the team, both players and coaching staff. That’s how I would like to summarize my time at Leeds United,” Gracia said in a statement.“I would have preferred a different moment, but the circumstances have changed. We arrived on a short three-month contract, and we did it because we believed in this team.“We considered our chances and had confidence, and we know it is possible. We are not talking about miracles, but about the efficient result of a well done work and a process of improvement.”"
    ]
}