{
    "articleURL": "/wires/pa/article-12059007/Special-constable-Penny-Lancaster-proud-honoured-coronation-role.html",
    "content": [
        "Special constable Penny Lancaster has said she is “tremendously proud and honoured” to have been part of the police force working on Saturday for the King’s coronation.",
        "The former model and TV presenter, 52, who is married to Sir Rod Stewart, began volunteering with City of London Police after appearing in Channel 4 show Famous And Fighting Crime, in which celebrities swapped their day jobs with those of emergency service professionals.She later completed her training to become a special constable in April 2021.Lancaster told ITV’s Good Morning Britain (GMB): “It was the most fabulous day and of course, tremendously proud and honoured to have been given that opportunity, along with the City of London Police, that I’m a special constable for.“There were the regular officers and then the specials (on duty) and, of course, we volunteer our time to help with the duties of policing, and we were stationed on Whitehall, right opposite 10 Downing Street, just behind New Scotland Yard.”In September last year Lancaster took to the streets of central London as part of the policing operation for the Queen’s funeral procession.There were around 11,500 police on duty in London on Saturday, with Lancaster explaining her shift ran from 6am to around 4pm.She told GMB: “We got to know the members of the public that were in front of us quite well. And there were people travelling from Miami and Scotland and Wales and all over.",
        "“And it was just incredible to see the different generations there were, you know, grandparents with their little chairs out, and there were little toddlers on dads’ shoulders, and everyone (with) painted faces and waving flags.“So we got to chat and engage with the public and, of course, our priority was to make sure that the ceremony and the passing of the carriages, the procession went smoothly without being interrupted.”Asked about the briefing she had been given for the day, she explained: “So all ran smoothly where we were based, we worked very closely with the Met, and they were in full PPE protection.",
        "“So they had their armour and batons and handcuffs, whereas myself and the officers that were on the route itself, were in our very smart tunics. We didn’t have that type of protection.“So there were two barriers, so the crowd were behind two barriers with the Met officers within the crowd, and they had armed forces, it was well covered.“Our main message to us was to be smart and look smart, and to be alert and just to inform our inspectors and those officers in the crowd if we saw anything suspicious but luckily it was a fantastic atmosphere…”.Lancaster added that they had also been briefed about “some of the dangers that could occur”, including horses getting spooked and said that “if someone attempted to come over the barrier, I would have most certainly intervened”.",
        "The Loose Women panellist said she was “really, really proud of our royal family and the connection that they have around the world”."
    ]
}