{
    "articleURL": "/wires/ap/article-12058573/Yoon-Kishida-vow-better-Seoul-Tokyo-ties-following-summit.html",
    "content": [
        "SEOUL, South Korea (AP) - South Korean President Yoon Suk Yeol on Monday called for officials to map out specific steps to hasten security and economic cooperation with Japan following his weekend summit in Seoul with Japanese Prime Minister Fumio Kishida.",
        "Kishida during Sunday´s meeting expressed sympathy toward Koreans forced into industrial slavery during Japan´s 1910-45 colonial rule of the Korean Peninsula as the leaders vowed to overcome historical grievances and strengthen cooperation in the face of a nuclear North Korea and other challenges.The summit, which was the second meeting between the leaders in less than two months, drew a mixed reaction in South Korea. Critics, including Yoon´s liberal opponents who control majority in the National Assembly, said Kishida´s comments fell short of a meaningful apology and accused Yoon of letting Japan off the hook over its past aggressions while pushing to repair bilateral ties.Others saw the summit as a sign that the two key U.S. allies are finally moving forward after years of bickering as they step up their three-way partnership with Washington.After the summit, Yoon said Seoul, Tokyo and Washington are engaging in talks to implement their earlier agreement on a faster exchange of information on North Korean missile tests. Yoon also said he wouldn´t rule out Japan´s possible participation in future nuclear deterrence consultations between Washington and Seoul to better cope with North Korean nuclear threats.Yoon, Kishida and President Joe Biden are expected to hold a trilateral meeting later this month on the sidelines of the Group of Seven meetings in Hiroshima to discuss North Korea and geopolitical uncertainties created by Russia´s invasion of Ukraine and China´s assertive foreign policy. While South Korea isn´t a G-7 country, Yoon was invited as one of eight outreach nations.",
        "Yoon during a meeting with his chief sectaries on Monday instructed them to establish follow-up measures to carry out bilateral security, economic and technology cooperation and facilitate culture and youth exchanges between the countries, which were discussed in his meeting with Kishida. Yoon´s office didn´t elaborate.Speaking to reporters before departing Seoul, Kishida said he hoped to further strengthen his personal relationship with Yoon and \"work together to carve out a new era.\"Kishida, who earlier on Monday separately met with groups of South Korean lawmakers and business leaders, stressed the need for facilitating people-to-people exchanges between the countries, which he said would \"help further promote our mutual understanding and give widths and thickness to our relations.\"Kishida´s visit to Seoul reciprocated a mid-March trip to Tokyo by Yoon. It's the first exchange of visits between the leaders of the countries in 12 years.The back-to-back summits were largely meant to resolve bitter disputes triggered by South Korean court rulings in 2018 that ordered two Japanese companies to compensate some of their former Korean employees for forced labor before the end of World War II. Those rulings irked Japan, which insists all compensation issues were settled by a 1965 treaty that normalized relations.The wrangling led to the countries downgrading each other´s trade status and Seoul´s previous liberal government threatening to spike a military intelligence-sharing pact. Their strained ties complicated U.S. efforts to build a stronger alliance to counter challenges posed by North Korea and China.",
        "Relations thawed after Yoon´s conservative government in March announced a domestically contentious plan to use local corporate funds to compensate the forced labor victims without demanding Japanese contributions. Yoon later that month traveled to Tokyo to meet with Kishida, and the two agreed to resume leadership-level visits and other talks. Their governments have since taken steps to withdraw their economic retaliatory steps.Kishida´s trip to Seoul drew intense public attention in South Korea, where many people still harbor resentment over Japan´s colonial occupation.In a news conference Sunday, Kishida avoided a new, direct apology over the colonization but still sympathized with the Korean victims, saying he personally feels \"strong pain in my heart\" over their ordeals, in an apparent effort to maintain momentum for improving ties.He reaffirmed his government upholds the positions of previous Japanese administrations on the colonization issue, including the landmark 1998 joint declaration by then-South Korean President Kim Dae-jung and Japanese Prime Minister Keizo Obuchi, in which Obuchi said: \"I feel acute remorse and offer an apology from my heart.\"Kishida also said he and Yoon would pay respects before a memorial for Korean atomic bomb victims in Hiroshima during the G-7 meetings. He addressed South Korean concerns about food safety following Japan´s 2011 nuclear disaster, saying Tokyo will allow South Korean experts to inspect a planned release of treated radioactive water from the damaged Fukushima nuclear power plant.",
        "Seoul's Foreign Ministry said the South Korean inspection team will consist of experts from related government agencies and organizations and that it will soon hold talks with Japanese officials to set up their visit planned for May 23-24.Bong Young-shik, an expert at Seoul´s Yonsei Institute for North Korean Studies, said it was notable how Yoon´s government carefully tempered public expectations before the summit, which made it easier for both governments to present the outcome as substantial.\"For both the South Korea and Japanese governments, the resumption of `shuttle diplomacy´ in itself is a win,\" he said, referring to regular visits between leaders.Yoon had faced criticism at home that he had preemptively made concessions to Tokyo without getting corresponding steps in return, and opposition politicians and some newspapers described the summit as a disappointment.\"Normalizing relations between South Korea and Japan is a necessity, and I am in favor of it, but not at the cost of our national interests, national dignity, history and justice,\" said Democratic Party leader Lee Jae-myung, who narrowly lost to Yoon in last year´s presidential race.The conservative Chosun Ilbo, South Korea´s biggest newspaper by circulation, acknowledged that Kishida´s comments were insufficient to ease South Korean frustrations over history but also said that the summit reflected the countries' \"desperate\" need for cooperation.",
        "\"South Korea and Japan are in need of greater cooperation in the wake of recent events like Russia´s invasion of Ukraine and China´s maritime assertiveness that threatens its neighbors. The countries´ need to jointly respond to North Korean nuclear and missile threats is greater than ever. Moreover, the countries face similar challenges related to their slowing economies and declining populations,\" the newspaper said.\"This is not the time to be stuck in the past.\"__AP writers Hyung-jin Kim in Seoul and Mari Yamaguchi in Tokyo contributed to the report.More AP coverage of the Asia-Pacific region is at https://apnews.com/hub/asia-pacific"
    ]
}