{
    "articleURL": "/tvshowbiz/article-12052489/Im-Celeb-South-Africa-viewers-SLAM-green-teams-teamwork-yellows-continue-winning-streak.html",
    "content": [
        "I'm A Celeb viewers slammed the green pride's 'rubbish' teamwork during the latest Bushtucker Trial on Friday.",
        "Joe Swash's team failed for the third time in a row as the yellow's stormed to victory and beat them by a whopping 20 minutes.The challenge saw the celebs working together as they held ropes and manoeuvred a ball through a maze. However while the yellows, with Dean Gaffney as captain, completed the task in six minutes their competitors limped past the finish line at 25 minutes. Taking to Twitter one fan wrote: '25 V 6, the green teams should just go home now'.",
        "While another, referencing the time difference, said: 'The greens don't really work well together as a team but they deserve the [prize] for once'A third commented green team Fatima Whitbread's aggressive style saying: 'Fatima would make me so anxious and scared and non-verbal'.And another said: 'Awww I feel bad for the green team'. More gushed over the winners impressive technique: 'Got it in one' and 'OMG, the yellow team were in control they deserved to win.Elsewhere in the episode, Joe Swash was given a taste of his own medicine after upsetting fellow campmates with his constant flatulence.The soap star was awoken from his slumber by his own bodily functions, before Olympian Fatima Whitbread, 62, returns the favour - declaring herself 'Fart-ima'. Following the treacherous storm Joe, 41, discussed his jungle diet of rice and beans saying: 'They make me very windy. I'm doing a lot of farting.'",
        "As the camp laughed about his toilet noises, he cheekily added: 'I woke myself up with my own fart.'",
        "In retaliation, Fatima decided to prank her campmate and walked over to break wind near him.Laughing that her fart was more powerful as she's an Olympian, Joe said: 'It came out with some velocity… it was definitely a more powerful fart than I've ever done myself.'It comes after Joe likened  Fatima to his wife Stacey Solomon as they can both order him around without him realising.During Thursday's episode, Fatima woke up Joe while the campmates were asleep and asked him to put logs on the fire.The former EastEnders actor obliged and got out of bed but admitted in the Bush Telegraph he didn't understand why Fatima couldn't just put the logs on herself if she was already awake.However, soap star Joe said he did as she asked as he has a 'soft spot' for the former Olympic athlete. He said: 'If you're awake, just chuck the wood on the fire? But it's Fatima, she gets away with it. I do feel love for Fatima.' Fatima later dished out which campmates would handle the daily chores and wrote them all out on a whiteboard. ",
        "The former javelin thrower went around to each campmate and explained why she had given them each task.",
        "In the Bush Telegraph, Joe said: 'Stacey's the only other woman who could boss me around in a really nice way and without me realising I'm being bossed around, which is really clever.'It comes as Stacey admitted she forgot to watch her husband's triumphant return to the jungle this year.Speaking on Instagram, she said: 'I will be honest with you both of us forgot he was even in it, so we missed it yesterday.'However, the star insisted they would catch up soon and watch the show in bed together.She added: 'He filmed it so long ago and we've both got baby brain right now and completely forgot about it.'I'm A Celebrity... South Africa continues Monday at 9pm on ITV1 and ITVX, catch up on the full series on ITVX."
    ]
}