{
    "articleURL": "/wires/afp/article-12049913/Indonesia-says-using-quiet-diplomacy-help-solve-Myanmar-crisis.html",
    "content": [
        "Indonesia is using \"quiet diplomacy\" to speak with all sides of the Myanmar conflict and spur renewed peace efforts in the violence-racked country, its foreign minister said Friday.",
        "Myanmar has been riven by unrest since the military putsch that ousted Aung San Suu Kyi's government in February 2021, with the junta's bloody crackdown on dissent sparking social unrest and an economic crisis.Indonesia, Southeast Asia's biggest economy and this year's chair of the Association of Southeast Asian Nations (ASEAN) bloc, is hoping to kickstart a five-point plan agreed with the Myanmar junta two years ago after mediation attempts to end violence failed.\"In the early stages of its chairmanship, Indonesia decided to take a non-megaphone diplomacy approach,\" Retno Marsudi told a press conference.\"The aim is to provide space for the parties to build trust. Quiet diplomacy doesn't mean Indonesia doesn't do anything.\"She said Jakarta's diplomacy since the start of the year included 60 engagements with all sides of the conflict that would \"hopefully become capital for further efforts\" to solve the crisis.Those included Myanmar's shadow government made up of mostly ousted opponents of the junta, the military-appointed government and ethnic minority armed groups.A foreign ministry official told AFP that every ASEAN member was informed of the talks with all parties.Her comments came ahead of the first of two annual ASEAN leaders summits hosted by chair Indonesia -- with the first taking place next week on the island of Flores, to which Myanmar's junta has not been invited.",
        "The five-point plan calls for an end to violence and for talks between the military and the rebels but the junta has largely ignored it, resulting in it being barred from top-level summits.The bloc, criticised for its inaction over the deepening crisis, condemned the military last month for air strikes in the central Sagaing region that reportedly killed dozens of people."
    ]
}