{
    "articleURL": "/wires/ap/article-12049457/AP-News-Brief-12-04-m-EDT.html",
    "content": [
        "At least 8 fake electors have immunity in Ga. election probe",
        "ATLANTA (AP) - The prosecutor investigating possible illegal meddling in the 2020 election in Georgia has agreed to immunity deals with at least eight Republican fake electors who signed a certificate falsely stating that then-President Donald Trump had won the state.Defense attorney Kimberly Debrow revealed the existence of the immunity deals in a court filing Friday, saying her eight clients had accepted the agreements last month. The filing does not identify the people who were offered immunity deals.Last July, Fulton County District Attorney Fani Willis´ office revealed that each of the 16 people who signed the false elector certificate was a target of her investigation, which is examining whether Trump and his allies committed any crimes while trying to overturn his narrow election loss.The 16 fake electors met at the state Capitol on Dec. 14, 2020, and signed a certificate declaring falsely that Trump had won the presidential election and declaring themselves the state´s \"duly elected and qualified\" electors.The news of the immunity deals shows that Willis continues to work on her case as she prepares to make decisions on whether to seek charges this summer. In letters sent to law enforcement agencies late last month, she advised them to prepare adequate security as she intends to announce her charging decisions between mid-July and early September.",
        "___Charges in NYC chokehold death may hinge on 'reasonableness'NEW YORK (AP) - The potential criminal charges against a U.S. Marine veteran who put Jordan Neely in a fatal chokehold aboard a New York City subway train might depend on whether a \"reasonable\" New Yorker would have acted similarly.Neely, a locally-known Michael Jackson impersonator who friends say suffered from worsening mental health, died Monday when a fellow rider pulled him to the floor and pinned him with a hold taught in combat training.Neely had been screaming at other passengers but hadn't attacked anyone, according to a freelance journalist who recorded video of his final minutes.The man who administered the chokehold, Daniel Penny, said through his lawyers Friday that he was only protecting himself after Neely threatened him and other passengers.\"Daniel never intended to harm Mr. Neely and could not have foreseen his untimely death,\" said his lawyers, Thomas Kenniff and Steven Raiser.___Trump's video deposition in rape lawsuit made publicNEW YORK (AP) - A video recording of former President Donald Trump being questioned about the rape allegations against him was made public for the first time Friday, providing a glimpse of the Republican's emphatic, often colorful denials.Jurors got to see the video of Trump's October 2022 deposition over the past few days at the trial over a lawsuit filed against him by advice columnist E. Jean Carroll. Written transcripts of Trump's testimony had also previously been made public, but not the recording itself.",
        "The video was made available Friday to news organizations covering the proceedings.The video shows Trump answering questions in his trademark navy suit and a bright blue tie. He called Carroll's claim that he raped her in a luxury Manhattan department store \"a false, disgusting lie.\"\"It´s a disgrace. Frankly it´s a disgrace that something like this can be brought,\" Trump said.___Mayorkas: US border 'very challenging' as asylum limits endBROWNSVILLE, Texas (AP) - U.S. Homeland Security Secretary Alejandro Mayorkas said Friday that authorities faced \"extremely challenging\" circumstances along the border with Mexico days before pandemic-related asylum restrictions end.A surge of Venezuelan migrants through South Texas, particularly in and around Brownsville, has occurred over the last two weeks for reasons that Mayorkas said were unclear. On Thursday, 4,000 of about 6,000 migrants in Border Patrol custody in Texas´ Rio Grande Valley were Venezuelan.Mayorkas noted that Mexico agreed this week to continue taking back Venezuelans who enter the U.S. illegally after asylum restrictions end Thursday, along with Cubans, Haitians and Nicaraguans. Migrants have been expelled from the U.S. more than 2.8 million times since March 2020 under what is known as Title 42 authority.The secretary reaffirmed plans to finalize a new policy by Thursday that will make it extremely difficult for migrants to seek asylum if they pass through another country, like Mexico, on their way to the U.S. border.",
        "\"The situation at the border is a very serious one, a very challenging one and a very difficult one,\" Mayorkas said.___Man gets 14 years in 1/6 case, longest sentence imposed yetWASHINGTON (AP) - A Kentucky man with a long criminal record was sentenced Friday to a record-setting 14 years in prison for attacking police officers with pepper spray and a chair as he stormed the U.S. Capitol with his wife.Peter Schwartz´s prison sentence is the longest so far among hundreds of Capitol riot cases. The judge who sentenced Schwartz also handed down the previous longest sentence - 10 years - to a retired New York Police Department officer who assaulted a police officer outside the Capitol on Jan. 6, 2021.Prosecutors had recommended a prison sentence of 24 years and 6 months for Schwartz, a welder.U.S. District Judge Amit Mehta sentenced Schwartz to 14 years and two months in prison, followed by three years of supervised release.Mehta said Schwartz was a \"soldier against democracy\" who participated in \"the kind of mayhem, chaos that had never been seen in the country's history.\"___Berkeley professor apologizes for false Indigenous identitySAN FRANCISCO (AP) - An anthropology professor at the University of California, Berkeley, whose identity as Native American had been questioned for years apologized this week for falsely identifying as Indigenous, saying she is \"a white person\" who lived an identity based on family lore.",
        "Elizabeth Hoover, associate professor of environmental science, policy and management, said in an apology posted Monday on her website that she claimed an identity as a woman of Mohawk and Mi´kmaq descent but never confirmed that identity with those communities or researched her ancestry until recently.\"I caused harm,\" Hoover wrote. \"I hurt Native people who have been my friends, colleagues, students, and family, both directly through fractured trust and through activating historical harms. This hurt has also interrupted student and faculty life and careers. I acknowledge that I could have prevented all of this hurt by investigating and confirming my family stories sooner. For this, I am deeply sorry.\"Hoover´s alleged Indigenous roots came into question in 2021 after her name appeared on an \"Alleged Pretendian List.\" The list compiled by Jacqueline Keeler, a Native American writer and activist, includes more than 200 names of people Keeler says are falsely claiming Native heritage.Hoover first addressed doubts about her ethnic identity last year when she said in an October post on her website that she had conducted genealogical research and found \"no records of tribal citizenship for any of my family members in the tribal databases that were accessed.\"___Listen both ways: Blind walkers winning safer road crossingsCHICAGO (AP) - After a retinal disease left him legally blind, architect John Gleichman was struck by a taxicab while walking home near Chicago's Lincoln Park Zoo - at the same intersection where a 4-year-old girl was killed by a hit-and-run driver years earlier.",
        "Although Maya Hirsch's death in 2006 ignited a citywide crusade for pedestrian safety improvements, almost all the electronic upgrades since then have been for people who can see. Nearly 3,000 Chicago intersections are now equipped with visual crossing signals, yet fewer than three dozen include audible cues.A federal judge ruled in March that such disparity in the nation's third-largest city violates the Americans with Disabilities Act, a second landmark victory for blind residents who challenged the accessibility of a major city's signalized crosswalks.\"Every time I go out to go downtown for a meeting, I have to think I could get hit today and not make it home,\" said Gleichman, 65, who has been struck four times times by vehicles while navigating the city with his white cane since being diagnosed as legally blind in 2005. He considers himself fortunate to have escaped serious injury each time.Future court proceedings could decide how many audible crossing signals Chicago must install, but a similar case in New York City suggests it could be substantial. A federal judge there appointed an independent monitor and in December 2021 gave officials a decade to gradually make at least 10,000 of its approximately 13,000 signalized intersections accessible to blind pedestrians. It´s already well ahead of schedule.___Paraguay far-right populist presidential candidate arrestedBUENOS AIRES, Argentina (AP) - Paraguayan police on Friday detained Paraguayo Cubas, a far-right populist who came in third in Sunday´s presidential election and encouraged his supporters to protest over his unsubstantiated claims that the vote was marred by fraud.Cubas was being held in preventive detention under an order by the Attorney General´s Office that is accusing him of breach of the peace, Police Commissioner Gilberto Fleitas said in a radio interview.Cubas, the candidate of the National Crusade Party who received 23% of the votes Sunday, was broadcasting live on Facebook when officers detained him outside his hotel in San Lorenzo, around 15 kilometers (9 miles) from Asunción.Fleitas said Cubas got into a police vehicle \"without any difficulty,\" but he continued streaming live.In his broadcast from inside the police vehicle, Cubas chatted with officers and focused the camera on his handcuffs. \"You can see now I´m being imprisoned,\" he said. \"All the criminals in this country should be handcuffed like Paraguayo Cubas.\"___TurboTax customers to receive checks for $141M settlementWASHINGTON (AP) - Millions of Americans who qualified for free tax services - but were instead deceived into paying TurboTax for their returns - will soon get settlement checks in the mail.In a settlement last year, TurboTax's owner Intuit Inc. was ordered to pay $141 million to some 4.4 million people across the country. Those impacted were low-income consumers eligible for free, federally-supported tax services - but paid TurboTax to file their federal returns across the 2016, 2017 and 2018 tax years due to \"predatory and deceptive marketing,\" New York Attorney General Letitia James said.All 50 states and the District of Columbia signed the May 2022 settlement, which was led by James.Consumers eligible for restitution payments do not need to file a claim, the New York Attorney's General Office said Thursday. They will be notified by an email from Rust Consulting, the settlement fund administrator, and receive a check automatically.Checks will be mailed starting next week, and continue through the month of May. The amount paid to each eligible consumer ranges from $29 to $85 - depending on the number of tax years they qualify for.___Royal Drama: King´s fractious family on stage at coronationLONDON (AP) - King Charles III lives in a palace, travels in a chauffeur-driven Bentley and is one of Britain´s richest men, but he's similar to many of his subjects in one very basic way: His family life is complicated - very complicated.There´s a second wife, an embarrassing brother, and an angry son and daughter-in-law, all with allies who aren´t shy about whispering family secrets in the ears of friendly reporters.The new king will hope to keep a lid on those tensions when his royally blended family joins as many as 2,800 guests for Charles' coronation on May 6 at Westminster Abbey. All except Meghan, the Duchess of Sussex, are attending.How Charles manages his family drama over the coming weeks and years is crucial to the king´s efforts to preserve and protect the 1,000-year-old hereditary monarchy he now embodies. Without the respect of the public, the House of Windsor risks being lumped together with pop stars, social media influencers and reality TV contestants as fodder for the British tabloids, undermining the cachet that underpins its role in public life.Royal historian Hugo Vickers says people should look past the sensational headlines and focus on what Charles accomplishes now that he is king."
    ]
}