{
    "articleURL": "/wires/reuters/article-12059613/Alberta-set-wildfire-relief-oil-firms-shut-output.html",
    "content": [
        "By Rod Nickel and Nia Williams",
        "May 8 (Reuters) - Cooler weather across Alberta on Monday helped firefighters battling widespread wildfires in Canada's main oil-producing province, but the government said it could be months before all the blazes are brought under control.Alberta declared a state of emergency on Saturday in response to wildfires that have displaced nearly 30,000 people and prompted energy producers to shut in at least 280,000 barrels of oil equivalent per day (boepd), more than 3% of Canada's output.By Monday afternoon 98 wildfires were still active, with nearly 30 classified as out-of-control.More than 700 firefighters had been deployed and Alberta had requested a further 1,000 from other provinces, who were expected to arrive over the next week, officials said.The provincial government also invited volunteers with firefighting skills to register with the province to help tackle the blazes. The government wanted to utilize the many people across the province with firefighting expertise, particularly in Indigenous communities, Alberta Premier Danielle Smith said.\"Some of these fires might continue on for several months so if we can use resources that are already here, the people who are able to help, we want to be open to doing that,\" Smith said at a press conference.The premier also announced emergency payments of C$1250 ($935) for Albertans forced to evacuate for seven days or longer.",
        "ALBERTA SEEKS FEDERAL HELPAlberta has formally requested help from the federal government, including military assistance, and Smith spoke with Canadian Prime Minister Trudeau earlier in the day.\"We talked a lot about the different ways the federal government can help and we will be working to make sure that we're supporting Albertans right across the province as necessary,\" Trudeau said in televised remarks.Canada is the world's fourth-largest crude producer, and about 80% of its oil comes from Alberta. The fires primarily affected light oil and natural gas producers, who shut in operations as a precaution. There have been no reports of injuries or damage to facilities so far.\"While we remain optimistic for a safe and quick resumption of production, the impacts to some affected companies could be meaningful if volumes are impacted for an extended period of time,\" analysts at Stifel FirstEnergy said in a research note.Canadian daily natural gas exports to the United States fell to 6.7 billion cubic feet on Sunday, their lowest since April 2021, according to data provider Refinitiv.Pipeline company Enbridge Inc said its assets were operating as normal but the company did \"expect some minor fluctuations in volumes as some customers upstream may be impacted\", according to a statement.TC Energy said it has shut down two compressor stations on its NGTL gas pipeline system, which connects most of the natural gas produced in western Canada to domestic and export markets.",
        "\"Other sections of the NGTL system and other pipeline systems continue to operate safely and we continue to monitor the situation closely,\" TC said in a statement.Alberta is also Canada's biggest cattle-producing province. Some ranchers were moving livestock away from fires to rodeo grounds or other public places, but no cattle are known to have died from fire or smoke, said Karin Schmid, an official at the Alberta Beef Producers industry group.Farmers in some areas are already dealing with drought, and the fires will likely further set back the growth of hay and grass to feed cattle, Schmid said. ($1 = 1.3372 Canadian dollars)(Reporting by Denny Thomas and Sam Jabri-Pickett in Toronto, Rod Nickel in Winnipeg, Scott DiSavino in New York and Nia Williams in British Columbia; Editing by Kevin Liffey, Grant McCool and Sonali Paul)"
    ]
}