{
    "articleURL": "/tvshowbiz/article-12050409/Nicole-Scherzinger-looks-glamorous-grey-sequin-jumpsuit-heads-dinner-London.html",
    "content": [
        "Nicole Scherzinger cut a glamorous figure in a grey sequin jumpsuit as she enjoyed dinner in Soho, London on Thursday evening. ",
        "The former Pussycat Doll, 45, looked sensational in the eye-catching dazzling number which boasted a plunging neckline and wide legged trousers.She wore her long dark tresses poker straight, as they fell past her shoulders styled in a centre parting. Nicole applied a flawless palette of makeup for the evening, including a perfect winged eye liner and pink lipstick. The singer's outcoming comes shortly after Nicole posed in a colourful patterned bikini as she swam underwater in a fun Instagram video last month.",
        "The singer displayed her jaw-dropping figure in the two-piece as she was filmed underwater.The TV personality let her long dark tresses cascade behind her as she made her way though the lavish pool.Nicole was seen at the start of the video walking from a bedroom onto a balcony overlooking the swimming pool.The Masked Singer judge looked stunning in a pink satin floral midi dress and accessorised with gold jewellery.The beauty styled her long dark locks in luxurious waves as she threw the patterned bikini from the balcony.Just as the swimwear went out of sight, the clip transitioned to Nicole diving into the water.She wrote: 'Too warm, no time for stairs'.Nicole has been dating former rugby player Thom Evans, 38, since he appeared on The X Factor: Celebrity in 2019 when Nicole was a judge on the show.",
        "The couple were forced to hit back at split rumours in February after The Sun claimed they had gone their separate ways.In July 2022, it was reported Nicole and Thom had got engaged after he popped the question during a romantic trip to Mykonos.The Pussycat Doll was said to have accepted the sportsman's proposal during their idyllic getaway.A friend of the couple told the Daily Mail's Richard Eden: 'They are getting married', with Thom knowing Nicole was 'the one' since they met on The X Factor: Celebrity.The hunk gushed of their romance: 'Within the first couple of days with Nicole it was just awesome, and it has been awesome ever since.'Thom previously opened up on his relationship with Nicole, telling how he was 'massively punching above my weight! I've hit the jackpot!'"
    ]
}