{
    "articleURL": "/wires/reuters/article-12045921/Hong-Kong-March-retail-sales-jump-40-9-fourth-month-growth.html",
    "content": [
        "March tourist arrivals soar 1,363 times y/y vs Feb's 557 times",
        "Government sees support from inbound tourism, private spending(Adds tourism numbers, retail data breakdown)HONG KONG, May 4 (Reuters) - Hong Kong's March retail sales rose 40.9% from a year earlier, the second biggest percentage rise on record, as consumer and visitor spending continued to improve, though the low base of comparison also contributed, government data showed on Thursday.Sales increased to HK$33.6 billion ($4.28 billion) in a fourth consecutive month of growth. That compared with a 31.3% rise in February and a record of 44.8% jump in February 1988.Strict COVID-19 restrictions have weighed on Hong Kong's economy since early 2020, grinding tourism to a halt and battering sales at bars, restaurants and shops.All border checkpoints were reopened fully in early February while the city dropped its COVID-19 mask mandate from March 1 in a move to lure back visitors and restore normal life more than three years after stringent rules were first imposed in the financial hub.\"The recovery of inbound tourism and private consumption should continue to benefit the retail sector,\" a government spokesperson said. \"The disbursement of a new round of consumption vouchers will render further support.\"The government launched a promotional campaign earlier in March called \"Hello Hong Kong\" to bring back tourists and businesses, and also launched a \"Happy Hong Kong\" campaign late last month to boost local spending and the economy.",
        "In volume terms, retail sales increased 39.4% year-on-year in March, the biggest percentage rise on record. That compared with a revised 29.7% growth in February and the second biggest growth of 33.1% recorded in February 1988.Hong Kong's economy is expected to benefit this year from recovering consumer spending on the mainland and a rebound in travel. The city's economy grew 2.7% in first quarter as outlook brightens, snapping four consecutive quarters of contraction.The Asian financial hub's economy is expected to grow 3.5%-5.5% this year after shrinking 3.5% in 2022.Tourist arrivals in Hong Kong in March soared to 2.45 million from 1.46 million in February, and compared with 1,800 visitors in March 2022 when China was still observing strict controls to prevent the spread of COVID19.Among the arrivals, mainland visitors jumped to about 1.97 million in March from 1.11 million in February, Hong Kong Tourism Board's data showed.In March, sales of jewellery, watches, clocks and valuable gifts, which before the pandemic were mostly to tourists from mainland China, jumped 165% from a year earlier, data showed.Benefiting from borders reopening, jewellery chain operators Chow Tai Fook said its same store sales for Hong Kong and Macau jumped 96.5% on year for January-March, while smaller rival Luk Fook's same store sales in the two cities were up 124% for the period.",
        "($1 = 7.8481 Hong Kong dollars) (Reporting by Donny Kwok and Twinnie Siu; Editing by Mark Potter &amp;amp; Simon Cameron-Moore)"
    ]
}