{
    "articleURL": "/wires/pa/article-12043597/Joe-Hawkins-explains-Exeter-left-ineligible-Wales.html",
    "content": [
        "Wales international Joe Hawkins is “gutted” to miss out on the World Cup after prioritising his “professional development, personal development and financial security” by agreeing to join Exeter.",
        "The 20-year-old centre – who will join the Chiefs from Ospreys at the end of the season – said he has been deemed ineligible to play for his country, with his five caps falling short of the 25 required by the Welsh Rugby Union for players playing outside Wales.However, Hawkins has insisted he had little choice with no contract on offer in his native country, and claimed he was previously being “underpaid”.He said in a statement on his social media accounts: “Gaining my first cap for Wales in the Autumn Internationals was an incredibly proud day for my family and I, and continuing to wear the Welsh jersey in the Six Nations fulfilled a childhood dream of mine.“Unfortunately, I have been deemed ineligible to play for Wales and the opportunity to play in the World Cup is no longer a possibility. I wish the boys and staff the best of luck and I am truly gutted I can’t share this journey with them.“I want to acknowledge that by signing for the Exeter Chiefs, my first professional contract, I have fully prioritised my rugby career. I have done so with my professional development, personal development and financial security in mind.",
        "“The turbulent period in Welsh rugby, where there were no contracts on offer in Wales, put all out-of-contract players under pressure. Witnessing the number of players currently out of a job in Wales has reinforced my decision.",
        "“Further, while I have spent the last three years playing professional rugby, and later, international rugby, I have been held to an ‘academy contract’, being significantly underpaid.”Hawkins was not included in Warren Gatland’s 54-man preliminary World Cup training squad when it was announced on Monday, but has vowed to use his time in England to fulfil his potential.He said: “As a passionate rugby player, my ultimate goal is to fulfil my potential for both my club and country, despite this being put on hold for now.“However, I am very grateful and excited to focus on next season with my new club. I am determined to work hard and achieve success with my new team-mates at Sandy Park over the coming years.”"
    ]
}