{
    "articleURL": "/news/article-12043343/Pictured-Retired-post-mistress-77-battered-death-home-man-79-arrested.html",
    "content": [
        "Maya Devi discovered with head injuries at house near Hornchurch, east LondonA man was arrested after she was found just after 9.30pm last night, on May 2 This is the retired post-mistress who was found battered to death at her home last night.",
        "Maya Devi, 77, was discovered with head injuries at a house near Hornchurch, East London, just after 9.30pm.A 79-year-old man was arrested on suspicion of murder after handing himself into a local police station.Today it emerged that Ms Devi was due to go on holiday to Lanzarote next week.She was a regular at the Havering Asian Social and Welfare Association (HASWA) community centre close to her home, where she practised Yoga and met friends for lunch.",
        "Close friend, Nirmala Leal, an outreach worker at HASWA, saw her just hours before she was found dead.Ms Leal told MailOnline: 'I spoke to Maya yesterday afternoon, about 1.30pm, and she seemed to be in a good mood. In fact she was excited as she was going on holiday next week.'She had come to the community centre for yoga, which she did every week, and told me that she wouldn't be in from Wednesday as she was going to Lanzarote for six days with a female friend.'Maya was such a lovely lady, really warm-hearted. She loved singing as much as yoga and had a smile for everyone.'I can't believe this has happened and that she has gone. I saw her just a few hours before her death, it doesn't seem real that I won't see her again.'",
        "Ms Devi was originally from India but had been living in Britain for more than 50-years.She and her husband ran the post office in Rainham, Essex, before retiring a few years ago.More recently she helped out at HASWA, of which her husband is a former director, and she was one of the organisers of the Vaisakhi celebrations at the centre at the weekend.Manjit Singh, HASWA's project development officer, said: 'Maya had been coming here for the last four-years and was a really popular member.'She would turn up at least four days a week. To begin with she was quiet and fairly withdrawn but gradually she came out of her shell and was full of so much fun and happiness.'She came to our lunches and picnics and loved the seaside outings to places like Eastbourne and Hastings.'She had the best smile and a little glint in her eye. I loved her company.'There was never any mention of any unhappiness or unpleasantness at home, so I'm shocked that this has happened to her.'This has really left us all numb because Maya was the gentlest, kindest and most wonderful lady.'The three-floor end terrace home of Ms Devi and her husband Tarsame Singh was today cordoned off by police. ",
        "Neighbour and friend, Kartar Singh Panesar, 87, told MailOnline: 'I just don't know what happened or why. They were a lovely couple, I never once saw or heard them argue. I certainly didn't hear anything last night. 'The first I knew was when the police turned up. 'Tarsame used to run the post office in Rainham for many years but recently retired but sometimes if there were staffing difficulties he'd still help out there as he knew how everything worked. 'He and his wife have been living in Britain for more than 50-years. They are both from India and before moving to Hornchurch, they lived in East Ham. 'They have a son and two daughters, who are all devastated. We all are.'"
    ]
}