{
    "articleURL": "/wires/reuters/article-12055707/Cristian-Espinoza-helps-San-Jose-hand-Los-Angeles-FC-loss.html",
    "content": [
        "Cristian Espinoza has been one of the best players in Major League Soccer, winning the award for the league's Player of the Month for April.",
        "May is off to a great start, too, after Espinoza scored two goals to lead the San Jose Earthquakes to a 2-1 win over Los Angeles FC Saturday at Levi's Stadium, home of the NFL's San Francisco 49ers.The win for San Jose (5-3-3, 18 points) gave LAFC (5-1-3, 18 points) its first loss of the season. The key play was the Earthquakes' Jeremy Ebobisse drawing a foul in the box against LAFC's Denil Maldonado in the 81st minute, and Espinoza stepped up to take the penalty and converting it.Espinoza opened the scoring in the eighth minute.Pinpoint passing from Jackson Yueill, Cade Cowell, Ebobisse and Jamiro Monteiro set up Espinoza for his seventh goal of the season. Monteiro slipped a pass between two LAFC defenders for Espinoza for the finish.In the 30th minute, LAFC's Denis Bouanga, himself an early-season MVP candidate, was waiting near the goal to kick in a saved shot from Mateusz Bogusz. Bouanga has 14 goals across all competitions this season.LAFC had been the only team left in MLS without a defeat so far this season. The defending MLS Cup champion has played just nine games because of a heavy Concacaf Champions League schedule, which contributed to MLS postponing LAFC's scheduled regular season match against the Houston Dynamo last weekend.",
        "After steamrolling three teams in aggregate-goal series, LAFC has advanced to the Concacaf Champions League final at the end of May. But doing so forced them to alter their MLS regular season schedule.Goalkeeper J.T. Marcinkowski had six saves as LAFC had seven shots on goal against San Jose. The Earthquakes managed only three shots on goal but made two for the win.All of the last six games between the two teams have been won by the home team.--Field Level Media"
    ]
}