{
    "articleURL": "/tvshowbiz/article-12042853/Bethenny-Frankel-discusses-battle-long-Covid-autoimmune-disorder.html",
    "content": [
        "Bethenny Frankel has emotionally discussed her battle with long Covid and an autoimmune disorder as she searches for answers about her health on a trip to New Orleans.",
        "The RHONY star, 52, who has spoken openly about her struggle with POTS, a blood circulation disorder which causes weight gain, bloating, dehydration and aches, told fans she was on a 'medical research trip' due to feeling scared and fragile.'In a video the star said: 'When I had my near-death fish reaction — because I'm allergic to regular fish, not shellfish -  the worst part about it is, I was 60/40, when I got to the hospital, I was unconscious and they thought I was going to die because of the blood pressure.'The blood pressure is a big problem here, and that's why the dizziness, and dehydration leads to it — it's a whole thing' - adding she regularly has 'severe aches and pains in my neck.'The star recounted how she had 'blew up like a tick' due to severe dehydration while on a trip to Aspen', saying the experience 'scared her' and left her feeling 'very fragile.'",
        "She said: 'I have to get to the the bottom of this for me and my daughter.' 'We just think that these things are who we are and normal, and the thing is you're a machine and it's telling you that it's broken down and you have to listen to it. So I'm here to listen to it.\"",
        "'And you know what's great? I'm going to be able to help you. I'll be able to report back.\"In the video caption she wrote: 'I am on a medical journey and I’m serious about getting answers. From long COVID to body pain to dehydration to dark circles to autoimmune disorders, it’s a lot to process and digest. I’ve learned that doing things piecemeal in life and in health doesn’t work. I need to tackle this puzzle and I’m taking you with me. Bear with me, because I’m also learning a new language.'I don’t care how I look. I don’t care how others think I look. I care about how I feel and about being healthy for my daughter, my loved ones and for you.'My journey begins now with X-rays and MRIs and research and diet changes. I am being thorough and serious about this not only for me but for you. I know many can’t afford the time or the resources to get these answers. I know all of our struggles are different but from what I’m hearing, many are the same. I’m on it. Xo.'In February Frankel took to Instagram and TikTok on Thursday to update her fans on why her face has been 'looking different' in recent videos.",
        "'Many of you are asking why my face looks different in my makeup videos and it's because I am messed up. I am not doing that great,' she shared in an Instagram video.",
        " She later took to TikTok with more clips, and at one point her voice cracked as she broke down in tears while talking about staying healthy for her daughter Bryn Hoppy, 12.'My real thing is the terror of just not being healthy for my daughter. That's the biggest thing. Who cares about the rest of it, I just want to be healthy for her.' POTS (Postural orthostatic tachycardia syndrome) is a blood circulation disorder that causes your heart to beat faster than normal after transitioning from sitting down to standing up. Patients diagnosed with POTS can experience rapid heart rate, low blood pressure, fainting and lightheadedness. The reality TV star first took to Instagram, writing: 'There were some comments about my face looking different in recent videos, so here is why.''I'm bloated, swollen and I've gained 4 lbs in 3 days because my body is desperately hanging on to any water it can,' the star explained.",
        "She went on: 'A while back I shared what has been a serious battle with POTS. This is an auto-immune disorder that seems to have been drastically exacerbated since COVID. I know there are many of you out there, so thanks for all of the information. It’s certainly a condition to manage.'",
        "'I suffer from chronic severe dehydration. I have always experienced extremely low blood pressure and dehydration, but it’s gotten exponentially worse.''I make a tremendous effort to stay hydrated, get IV’s, and I haven’t had liquor for 6 months. I’m basically on the case,' Frankel added.'Altitude and a dry climate (in my favorite place in the world to do my favorite sport) present additional challenges.'At the end of her statement she reminded her followers to think twice before commenting on someone's appearance: 'PS. When you comment on someone’s physical appearance, you may not know exactly what they’re enduring personally, physically and emotionally.'",
        "Postural tachycardia syndrome (PoTS) is an abnormal increase in heart rate that occurs after sitting up or standing.Some typical symptoms include dizziness and fainting. PoTS affects a range of people but is most common in girls and women aged 15 to 50.Some people have mild symptoms, while others find the condition affects their quality of life. PoTS often improves gradually over time, and there are some medicines and self-care measures that can help. SOURCE: NHS"
    ]
}