{
    "articleURL": "/wires/reuters/article-12058207/Three-die-raging-fires-consume-swaths-Russias-Urals--officials.html",
    "content": [
        "May 8 (Reuters) - At least three people have died in raging fires that have consumed swaths of Russia's Urals mountains, destroying hundreds of houses, forcing evacuations and prompting a number of investigations, officials said on Sunday.",
        "Minister of Emergency Situations Alexander Kurenkov flew to the Kurgan region in Russia's south early on Monday, where wildfires have spread to a number of settlements.\"A difficult situation has developed,\" Kurenkov said in a post on the ministry's Telegram channel.The Kurgan region's investigative committee opened a criminal investigation into a large-scale fire that killed three on Sunday and destroyed a number of houses and local businesses.\"The spread of the fire became possible due to potential negligence on the part of responsible officials,\" the committee said in a statement posted on its website.Six of the 13 wildfires in the region were contained, Russia's TASS state news agency reported.Massive fires have also engulfed the Sverdlovsk region and south of it, the Tyumen region, in the Urals.A gunpowder depot fire that forced the evacuation of a small village in the Sverdlovsk region was contained by Sunday evening.But the regional ministry of emergency situations said that 53 other fires were still ongoing, engulfing more than 33,000 hectares (127 square miles) of forests,According to the SOTA independent news site, some of the fires in the Sverdlovsk region were caused by explosions and arson. Reuters was not able to independently verify the report.At the end of April, a fire of unknown origin killed one and left hundreds of people homeless in the Sverdlovsk's region.",
        "More than 120 buildings were destroyed in two small villages in the Tyumen region on Sunday, TASS agency reported, citing local emergency services.Some 23 wildfires were ongoing across the region, TASS reported.(Reporting by Lidia Kelly in Melbourne; Editing by Jacqueline Wong)"
    ]
}