{
    "articleURL": "/wires/reuters/article-12054749/Lampard-delighted-step-Chelsea-end-winless-run.html",
    "content": [
        "BOURNEMOUTH, England, May 6 (Reuters) - Chelsea's interim manager Frank Lampard said he was happy to see his side finally playing like a team after they snapped a nine-match winless run in all competitions with a 3-1 victory at Bournemouth on Saturday.",
        "Chelsea have looked a fractured outfit after a number of arrivals in the last two transfer windows and three different managers this season, but they showed glimpses of finally gelling together as a unit to end a six-match losing run.While Chelsea are still 11th in the Premier League with four games left, Lampard said the win would be a boost as they look to end the season on a high after just their second away victory of the year.\"I'm happy. We came in off the back of a tough run, it's been a tough year and there is a lot work to do,\" Lampard told the BBC.\"But the performance and the result in isolation are really good, we deserved to win the game. It's a nice step forward for the lads. To work hard and come to a place that has been very hard for a lot of teams this year... I'm very happy.\"In the modern game, those changes are huge. It's important with the squad that we have that people feel like they can come in and affect the game. We've worked towards that and I think every one of them did.\"Lampard said there were still a lot of players finding their feet, especially youngsters, and urged them to 'grasp' confidence from the performance.",
        "\"Typically at Chelsea, one or two have fed into the group and now we have more. It's understandable that as a group finding rhythm and confidence can be difficult,\" Lampard added.\"This is a first step. It won't be plain sailing but there is talent there and the players need to come together to get us to where we want to be.\"Chelsea's next game is at home against relegation-threatened Nottingham Forest next weekend, but tougher tests await with their last three games of the season against top-four sides Manchester City, Manchester United and Newcastle United. (Reporting by Rohith Nair in Bengaluru Editing by Toby Davis)"
    ]
}