{
    "articleURL": "/sport/football/article-12056079/SCOUTING-REPORT-Real-Madrids-Vinicius-Man-City-nightmares-frailties-exploit.html",
    "content": [
        "Real Madrid defeated Osasuna 2-1 on Saturday to win their 20th Copa del Rey Los Blancos now prepare to face Manchester City in Europe on Tuesday evening Mail Sport's Lewis Steele delivers a scouting dispatch from a long night in SevillaIt was the small hours of Sunday by the time King Felipe VI had completed his dash from one coronation in London to another in Seville.",
        "The Spanish monarch shook hands with football royalty as Real Madrid won the Copa del Rey for a 20th time - thanks to a Rodrygo brace.But Carlo Ancelotti's side had no time for partying.Los Blancos jetted straight back to the capital to rush some recovery and prepare for Tuesday's era-defining Champions League semi-final with Manchester City, where they will search for a 15th European Cup crown.And below, Mail Sport delivers a scouting dispatch from a long night in Seville…",
        "VINICIUS UP THERE WITH THE BESTOsasuna had waited 18 years for a cup final - and nearly went into financial abyss in the meantime - but just two minutes were on the clock when their hearts were broken.Vinicius Junior squared up to his marker and danced past two defenders before producing a sublime assist for his compatriot Rodrygo.It begs the question: is there a more complete winger in world football than Vinicius? With 22 goals and 21 assists, few have better numbers this season. Real fans even sang 'Vinicius Ballon d'Or' during celebrations in Madrid's Plaza de Cibeles.He gave Jon Moncayola a torrid evening with darting runs and searing pace - his stats have the 22-year-old as the best dribbler in world football. Manchester City's defenders might have had nightmares on Saturday night if they tuned into this match.",
        "ETERNAL MIDFIELD HAS AMPLE BACK-UPSLuka Modric spent 82 minutes of this game on the substitutes' bench until the 2018 Ballon d'Or winner replaced a tired Toni Kroos to a huge ovation.It feels that the pair, Kroos now 33 and Modric 37, are eternal in Real's midfield but their days are slowly becoming numbered.No need to worry, though. Eduardo Camavinga, Aurelien Tchouameni and Fede Valverde are ample replacements, with the small matter of Jude Bellingham likely to follow this summer.Uruguayan gem Valverde often takes up an extremely advanced position just behind Karim Benzema, and causes problems in behind as the Frenchman drops short.With Manchester City keeping a notoriously high line, Valverde could be a thorn to watch out for. Saying that, though, if he doesn't do the defensive dirty work, City could pick Real apart.Tchouameni, who scored against England in the World Cup, looked a little leggy towards the end of the final on Saturday and Madridistas suggest he is yet to rediscover his best levels after his fine tournament for France in Qatar.",
        "DEFENSIVE FRAILTIES?Eduardo Camavings is one of those players who make football a joy to watch, with the Frenchman's balletic movement and silky passing skills in tight spaces.But in the left back position which Ancelotti has deployed him in recent months, Camavinga's mercurial talents are wasted.",
        "He links up well with Vinicius but looks shaky defensively and, with Bernardo Silva likely to start on the right wing for City on Tuesday, he could be targeted by Pep Guardiola.There are no worries on the other flank, though. Dani Carvajal put in a warrior-like performance as Real won their first Copa del Rey since 2014. Not many full backs have pocketed Jack Grealish this season but Carvajal is a good bet to break that trend.In central areas, though, Erling Haaland will be licking his lips with the brutish defender Eder Militao suspended. Osasuna exploited Antonio Rudiger when he came on as a substitute here.The German has started five of 10 Champions League matches this season but will play on Tuesday in Militao's absence.And Kevin De Bruyne will be on a revenge mission after Rudiger fractured the Belgian's eye socket in the 2021 Champions League final at Chelsea."
    ]
}