{
    "articleURL": "/wires/reuters/article-12038229/Key-Fed-officials-low-rate-world-likely-return-one-day.html",
    "content": [
        "By Michael S. Derby",
        "May 2 (Reuters) - For all the assertions that the pandemic and the inflation surge that followed it have put an end to the low-interest-rate era, key officials at the Federal Reserve and elsewhere still see a return to that world as a likely outcome down the road.The Fed is nearing the endgame to its epic monetary policy battle to cool off inflation, with higher-for-longer pledges by U.S. central bankers more or less the norm for guiding the interest rate outlook.But that may not mean higher forever.That's because many Fed policymakers - and others - believe the underlying trends that kept interest rates depressed before the pandemic - weak productivity, an aging population and other demographic forces as well as entrenched demand for safe assets - will eventually reassert themselves.The key to this outlook is something called \"R-Star,\" or the level of rates that's neither stimulative nor restrictive to growth. The measurement allows Fed officials and markets to benchmark how stimulative or restrictive interest rate policy is at any given point.Measuring R-Star took a blow from the pandemic and the New York Fed stopped publishing its public estimate in 2020, as events scrambled its model.In the decade or so before the 2007-2009 financial crisis, R-Star had ranged between 2% and 3.5%, the New York Fed data shows. After that it had bounced between just above and below 1%. The last New York Fed estimate from June 2020 - as the economy was just beginning its rebound from the recession triggered by the pandemic - pegged it at 0.4%.",
        "To translate that into a real-world rate, it's essentially added to the Fed's longer-run inflation estimate. Forecasts in March from policymakers eyeballing a longer-run Fed rate of 2.5% with a long-run inflation estimate of 2% suggest they still see longer-term R-Star at around 0.5%.\"I would say ... the neutral interest rate is still very low. Is it as low as it was in 2019? I'm not sure if it's exactly that low\" but it's lower than where it sits right now with inflation still running so high, New York Fed President John Williams said last month.Speaking several days later, Philadelphia Fed President Patrick Harker agreed and said while current R-Star is higher than it was pre-pandemic, he expects long-running trends like weak productivity to reassert themselves eventually and bring it back to its formerly low level.Meanwhile, William English, a former top Fed staffer now at the Yale School of Management, agrees R-Star will likely move back down. \"(B)asically, high saving, soft investment, and strong demand for safe assets seem likely to persist\" and will again drag down the overall level of interest rates.Last month economists at the International Monetary Fund also predicted that low rates would return once inflation is quashed.BRIGHT OR BLUR?Putting R-Star into practice as a lodestone for policy has never been easy.",
        "Williams, an architect of the concept, has himself gone hot and cold on it. In May 2018 he said R-Star \"continues to shine brightly\" as a policy guide, only to appear to reverse himself a few months later, saying \"what appeared to be a bright point of light is really a fuzzy blur.\"\"It's a very meaningful concept, in theory, but a difficult one to both gauge and use in practice,\" said Matthew Luzzetti, Deutsche Bank's chief U.S. economist.Most agree the huge blast of pandemic stimulus coupled with disruptions in the economy have changed current economic dynamics, at least for now. A higher current R-Star is likely why very aggressive rate rises by the Fed over the last year have yet to either make a big dent in high inflation or to push up unemployment toward a more sustainable level.Luzzetti reckons current R-Star is likely closer to 1% given how the economy has been responding to Fed tightening.A higher short-term R-Star has implications for the Fed. The central bank is almost certain on Wednesday to raise the federal funds rate target range by a quarter percentage point to between 5% and 5.25%.But it may have to go higher.Piper Sandler economists said recent Fed forecasts show a upward and unusual drift higher in some officials' estimates of the longer-run Fed rate.",
        "\"R-star estimates, in the rough ballpark of around 30 basis points to 100 basis points, are not too off-the-mark,\" meaning \"monetary policy now just isn't that tight,\" they wrote in April. \"As such, and barring further bad news about credit conditions, banks and non-banks alike, the risks might skew toward more, rather than less near-term policy tightening.\"More clarity on R-Star may arrive in coming months. Williams last month said he and his staff where taking into account how events of the last few years had affected their models, and are working toward a relaunch. (Reporting by Michael S. Derby; Editing by Dan Burns and Andrea Ricci)"
    ]
}