{
    "articleURL": "/news/article-12052487/Prince-Harry-jetted-UK-coronation-commercial-American-Airlines-flight-morning.html",
    "content": [
        "Harry flew on American Airlines flight AA136, which landed at 11.23am in LondonKing Charles Coronation LIVE: Royals at Buckingham Palace as Kate dazzles Prince Harry jetted into UK for the coronation on a commercial American Airlines flight yesterday morning amid gobsmacked passengers, MailOnline can reveal.",
        "Harry flew in from Los Angeles on American Airlines flight AA136, which landed at 11.23am at London Heathrow on Friday.The Duke of Sussex landed in the UK for his 24-hour visit for King Charles III's Coronation - leaving his wife and two children at home.Harry is said to be flying back to California straight after the historic ceremony ends this afternoon so he can make it back to see Archie on his fourth birthday.Harry was expected to spend a final night at Frogmore Cottage on Friday after his father decided to evict him and his American wife just days after the release of his memoir Spare.While the Duke of Sussex will see his father King Charles III crowned at Westminster Abbey, he will have no formal role in the service and may even be sat several rows back from his brother William and other working royals.",
        "Royal commentators have considered whether he will even be allowed to fit within the processions to the Abbey. They have also suggested that he could face 'uniform humiliation' as he may not be allowed to wear his military garb. It is understood the duke will only be in the UK for around 24 hours so he can get home for his son Archie's fourth birthday, which is the same day as the Coronation.",
        "Regarding Harry's brief visit, a source told The Sun: 'Harry will be in and out of the UK in 24 hours. He will only be doing the Coronation service then leaving.'Asked in an interview in January whether he would attend the Coronation if invited, Harry said 'the door is always open'.It was then reported last month that the duke would be coming to the Coronation alone, leaving Meghan at home with their children Archie and Lilibet.Buckingham Palace later said it was 'pleased to confirm' the Duke of Sussex would be at Westminster Abbey today. There had been uncertainty at the Palace over the Sussexes' attendance.",
        "It was said to have left royal officials unable to sign off arrangements for seating plans, transport and security, as the duke's confirmation came after the official RSVP date.Coronation organisers admitted that they were stressed about Harry's plans and said that it was like 'trying to communicate with Mars'.Recently, Harry and Meghan's celebrity friend Gayle King declared they are in a 'really good place' and have made the 'best' decision for Meghan to stay in the US while Harry attends the Coronation in London. Ms King has said it is 'right' that Harry will fly to the UK for May 6, missing Archie's fourth birthday, because he will be supporting his father in Westminster Abbey on the biggest day of his life.",
        "It came as Meghan signed a mega-money deal with a talent agency representing Dwayne 'The Rock' Johnson, LeBron James and Serena Williams that will earn her tens of millions of dollars and heralds the start of her very public comeback."
    ]
}