{
    "articleURL": "/wires/reuters/article-12050523/Shipments-Ukraine-slowing-Black-Sea-grain-deal-deadline-nears.html",
    "content": [
        "By Jonathan Saul",
        "LONDON, May 5 (Reuters) - The pace of shipments from Ukraine under a U.N.-backed initiative has slowed as concerns grow over ships getting stuck if a deal is not renewed later this month, according to sources and data.Russia, which is one of the key parties involved, said it will keep talking although Moscow has threatened to quit on May 18, which has created more uncertainty for traders and shipping companies trying to plan ahead.Under the accord, Ukraine has been able to export some 29.5 million tonnes of agricultural products, including 14.9 million tonnes of corn and 8.1 million tonnes of wheat.However, the number of ships coming in to pick up cargoes has dropped this week to two vessels a day from three to four ships on average daily in the past three weeks, data from the agreement's joint coordination centre showed.Danish shipping group NORDEN, which is active in transporting grains, is among companies not sending ships into the region.\"We are not participating in that trade at the moment ... It is a risky area - it is very hard to predict what will happen,\" NORDEN´s Chief Executive Jan Rindbo told Reuters.\"Things can change quickly ... from the time you agree to go in and pick up a cargo and until the time the ship actually arrives.\"",
        "Every shipment takes on average at least nine days currently and involves sailing into one of three Ukrainian ports involved in the pact and undergoing required inspections.Analysis from maritime and commodities data platform Shipfix showed the number of cargo orders - global requests for available ships to transport grains from Ukraine - fell to 355 in April from 489 orders sent to the market in March.There were currently 107 forward grain orders for ships in the market with 94 for May and only a few orders for the forward months ahead, Shipfix data showed.There are between 40 to 60 commercial ships still stuck in all of Ukraine's ports that have been unable to leave due to tight restrictions on what vessels are allowed to leave the corridor, which has added worries over more assets getting held up if no agreement is reached.Insurance for ships going in has been vital, and the war-cover policies need to be renewed every seven days, costing thousands of dollars.Rates have remained stable around 1% of the value of a ship for weeks, according to market estimates.Insurance industry sources say that for now there is no change in cover arrangements although conditions could alter quickly.\"We would expect a significant re-addressing of what is currently charged and the way it´s underwritten if the grain corridor agreement is not extended and if there is an escalation of the conflict,\" one industry source said.",
        "\"Uncertainty is not good for anyone.\"(Reporting by Jonathan Saul, editing by Nigel Hunt and Susan Fenton)"
    ]
}