{
    "articleURL": "/sport/football/article-12055267/Liverpool-set-appoint-German-executive-Jorg-Schmadtke-new-sporting-director.html",
    "content": [
        "Two sporting directors have walked away from Liverpool over the past yearLiverpool are looking to bring in their next sporting director shortlyGerman executive Jorg Schmadtke has emerged as the frontrunner for the role Liverpool are reportedly set to appoint experienced German executive Jorg Schmadtke as their new sporting director.",
        "Michael Edwards and his successor Julian Ward have both walked away from the position at Anfield over the last 12 months and the Reds are keen to bring in a fresh face ahead of what promises to be a crucial summer for the club.According to The Telegraph, talks between Liverpool and Schmadtke have accelerated, and the 59-year-old is now the leading contender for the role.Schmadtke may be an unfamiliar name on these shores, but he has built a successful career for himself in his homeland.Having played for Fortuna Dusseldorf, Freiburg, Bayer Leverkusen and Borussia Monchengladbach during a 13-year professional career as a goalkeeper between 1985 and 1998, Schmadtke has moved behind the scenes post-retirement.",
        "He started as a sporting director at Aachen in 2001 and has since held the same position at Hannover and FC Cologne.His experience is likely to be welcomed on Merseyside, with Liverpool looking to bounce back from a disappointing campaign. After winning a cup double last term, Liverpool will finish this season trophyless, and look likely to miss out on the top four despite winning their last six games.They beat Brentford 1-0 on Saturday to close to within a point of fourth-placed Manchester United, but have played two more games than the Red Devils.",
        "The club are expected to spend heavily to rebuild the squad this summer, with their midfield an area of the team that is likely to be strengthened significantly.",
        "Having pulled out of the race to sign Jude Bellingham last month due to the costs involved, Liverpool have now turned their attention elsewhere and have been heavily linked with moves for Brighton's Alexis Mac Allister and Chelsea's Mason Mount.Should he be named Liverpool's new sporting director, Schmadtke, who is believed to be an ally of Jurgen Klopp's, would work closely with chief scouts Dave Fallows and Barry Hunter to try and get major deals over the line.Liverpool's recruitment in the early days of Klopp's tenure was widely praised, with the club able to bring in the likes of Mohamed Salah, Virgil van Dijk and Alisson to help them win every major trophy available.Their signings in recent years have been more questionable, though, and, if appointed, Schmadtke would need to ensure the club get the right players through the door to compete with the likes of Manchester City and Arsenal next season. "
    ]
}