{
    "articleURL": "/wires/ap/article-12048185/Eflin-goes-7-masterful-innings-Rays-sweep-Pirates.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Zach Eflin pitched seven scoreless innings, Randy Arozarena hit one of three Rays homers and Tampa Bay beat the Pittsburgh Pirates 3-2 Thursday to finish a three-game sweep of small-budget teams off to outstanding starts.",
        "Taylor Walls and Yandy Díaz also homered for Tampa Bay, and Eflin (4-0) scattered three hits and struck out 10. The right-hander allowed just one baserunner to reach scoring position, when Carlos Santana hit a two-out double in the seventh.\"We're rolling right now,\" Walls said.After Ryan Thompson had a perfect eighth, Jason Adam gave up Santana's two-run, two-out double in the ninth before getting his second save and completing a four-hitter. Adam struck out Connor Joe with two on to end it.The Rays have scored a major league-best 210 runs and allowed an MLB-fewest 96. Tampa Bay also tops the big leagues with 67 homers, while allowing the fewest with 20.Tampa Bay, at 26-6, is off to the best start through 32 games since the 1984 World Series champion Detroit Tigers went 27-5.",
        "The NL Central-leading Pirates (20-12) have lost a season-high four straight.Pittsburgh starter Vince Velasquez (4-3) left after just three innings and 54 pitches due to elbow discomfort and will undergo tests.The umpires had Eflin remove a ring from his glove hand before the start of the second inning during a conference on the mound with Rays manager Kevin Cash present. Eflin said other umpire crews had let him wear the ring, but this one told him he'd be ejected if it wasn't removed.",
        "\"This is the first crew that's really given me trouble about taking the ring off.\" Eflin said.Eflin got married in 2020 and has been wearing the ring since the start of the 2021 season. He put the ring in his pocket at first and later on his necklace.One day after Pittsburgh manager Derek Shelton was ejected for arguing about how the pitch clock was operating at times, several Pirates expressed displeasure with plate umpire Manny Gonzales' strike zone. Seven of the Pirates' 10 strikeouts against Eflin were called third strikes.When asked if he thought the umpires were taking anything out on him, Shelton replied, \"I would hope not.\"\"That's not how it should go,\" Shelton added. \"You should call the game how should be. All I know our hitters had a lot of questions about pitches.\"Walls' homer with one out in the second ended Velasquez's career-best scoreless streak at 19 1/3 innings. Velasquez allowed one run and two hits overall.Arozarena made it 2-0 on a leadoff homer off Jose Hernandez in the fourth. Díaz went deep during the eighth. It was the eight homer this season for each player.CHEERING SECTIONThe Rays are formally opening \"Randy Land\" on Friday night, a left-field seating section saluting the popular Arozarena.",
        "It will be open for Friday games, with fans getting an Arozarena T-shirt. If he homers, legal age fans get a free beer.\"I'm hoping to hit a home run so that everybody drinks happily,\" Arozarena said through a translator.TRAINER'S ROOMRays: LHP Josh Fleming, who took a 113.1 mph infield single Tuesday off his left foot, played catch and will have a bullpen session on Friday. He hopes to pitch Sunday.UP NEXTPirates: LHP Rich Hill (3-2) and Toronto RHP Chris Bassitt (3-2) are Friday night's starters.Rays: RHP Yonny Chirinos (1-0) will start or follow an opener Friday against New York Yankees RHP Jhony Brito (2-3).___ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}