{
    "articleURL": "/wires/afp/article-12038213/Bring-Emirates-airline-boss-welcomes-Saudi-competition.html",
    "content": [
        "The UAE's Emirates airline does not feel threatened by ambitious expansion plans in neighbouring Saudi Arabia and welcomes increased competition, its president said on Tuesday.",
        "Saudi Arabia has announced a new national carrier, Riyadh Air, and a big new airport in the capital to handle up to 120 million travellers per year.But Emirates president Tim Clark, who put the cost of the plans at $2.5-3 trillion, said there was a long way to go for Saudi airlines and other competitors, including Air India which ordered 470 Airbus and Boeing planes in February.\"You've now got Saudi Arabia announcing these huge plans, the likes of which nobody's really seen before,\" Clark told journalists at the Arabian Travel Market industry fair in Dubai.\"They made statements such that they want 100 million tourists into Saudi Arabia by 2030. But you don't need one airline, you need 10 airlines to do that,\" he added.Saudia and Riyadh Air, which together announced orders for 78 Boeing 787 Dreamliners in March, will be complemented by NEOM Airlines, flying from NEOM, a $500 billion futuristic city being built from scratch, from 2024.\"Paradoxically, you'll hear me saying that the more carriers that come into play, they've got quite a good chance going forward of being profitable,\" Clark said.With annual air traffic at four billion worldwide before the pandemic, and rising by four-six percent per year, seven billion passengers could be flying every year by the 2030s, he added.",
        "But Riyadh Air and Air India also need to be served by \"seamless, wonderful\" airports, Clark said, if they are to follow the model of Dubai-based Emirates which flies out of one of the world's busiest air hubs.- 'Room for one more?' -\"Do I see this as a threat to us? No, I don't think so. Because Emirates has spent the best part of 35, 36 years building its brand,\" Clark said.\"Never in my wildest dreams did I think that Emirates would have it all its own way in perpetuity... but is there room for more? Well, bring it on.\"Clark would not pre-empt next week's earnings announcement but said it had been a \"good year\", with a seat factor or passenger load of nearly 80 percent last week.Emirates reported record half-year profits of $1.2 billion in November as it bounced back to profit after a $1.1 billion loss in the post-pandemic 2021-2022 financial year.The United Arab Emirates' biggest airline should regain its full pre-pandemic network of destinations by summer next year, Clark said, when \"20-25\" Airbus A380s grounded for technical reasons are able to fly again.In January, Emirates flew a Boeing 777 with one engine powered entirely by sustainable aviation fuel -- made from biomass, recycled food oil and synthetic fuel from captured CO2 or green hydrogen -- calling it a \"milestone\".",
        "However, Clark said there were major hurdles to adopting sustainable fuel, pointing to a lack of supply and the cost of repurposing refineries.\"I don't think we should over-promise. I think we should say what we're doing and I intend to get the job done,\" he said.\"But... you will not fly an A380 to Los Angeles, with 500 passengers on board burning 200 tonnes of fuel, on anything other than fossil fuel for the time being.\""
    ]
}