{
    "articleURL": "/femail/cleaning/article-12048967/Sydney-cleaner-Charlotte-Bosanquet-transforms-gross-shower-hadnt-cleaned-year.html",
    "content": [
        "Charlotte Bosanquet cleans hoarder's homesTransformed grimey showerA woman who specialises in cleaning hoarders homes has shared a clip of a 'disgusting' shower that hadn't been washed in over a year.",
        "Charlotte Bosanquet, founder of Care Cleaning Services, posted the 'extremely satisfying' video of herself cleaning a bathroom that was caked in mould and grime.In the clip, she begins by putting on a pair of rubber gloves and removing all the products, including shampoo, dirty sponges, and shower gel that were covered in sludge.Next, she sprays liberal amounts of a product called shower clean inside the shower, covering the tiles, floor, and door.She then began to tackle the grout, getting in between tiles with a brush.",
        "'It brought it up so nicely,' the Sydney-based cleaner said in a video posted to Tiktok, before adding it was 'so satisfying'.Charlotte then scrubbed the shower screen with a sponge, starting at the top and working her way to the bottom cleaning in a circular motion to remove soap scum.Next she covered screen with a window cleaner to get rid of the residue, before  using a screen cleaner to get rid of the rest of the water.'Oh my god it turned out so perfect, literally looks new,' she said.",
        "Finally, she used a cleaning product called  gumption go over the tiles.Many of Charlotte's followers were wowed by the new look.  'Omg I need you in my life to clean my shower,' wrote one.",
        "'I love how you say “satisfying” clean rather than “disgusting” like some other people say. Not putting people down for how they keep their homes,' wrote another.'Love this you’re the best,' commented a third.",
        "'Holy wow, satisfying don't even cut it,' said another.It comes after Charlotte told Daily Mail Australia  the first time she stepped into a hoarder's flat she found in 'overwhelming'.'The first time I cleaned a hoarder’s home it was extremely tiring but the most rewarding thing I have ever accomplished. Being able to help people that feel there is no way out is the best feeling in the world. You just have to put your head down and go for it,' Charlotte told FEMAIL.",
        "'It is so easy to assume why someone's house is the way it is, but there are so many factors that contribute to a hoarder's home,' the 20-year-old said on TikTok. 'Mental health plays a significant role in the cleanliness of one's home so before comment, think about what you're saying.'Videos shared on TikTok show exactly what Charlotte sees when she enters a home, and how it looks once she's done cleaning it. 'I started the business about a year ago now when I was in university. It was meant to be a little side hussle to earn some extra cash as I was living out of home but once I started and saw the need for cleaners in Sydney, I knew I had a passion for it and needed to make the company bigger,' Charlotte told FEMAIL. ",
        "'I got into the industry by making as many connections as possible for advertisement and getting my business name out there and just giving myself no other choice than to make it happen!'",
        "The work itself is intensive and Charlotte starts her day with a double shot espresso. Getting the work done can take anywhere between two and six hours.  Due to the huge amount of work involved to get the job done, Charlottetold Mamamia she charged anywhere between '$5,000 to sometimes into $20,000 or more' to clean a hoarder's property. After arriving at the property, she first maps out all areas to evaluate what needs to be done, then starts by disposing of all waste - which is a time-consuming process. 'I put on some gloves, use some heavy duty bin bags so they don't bread and rip in the middle of the elevator,' she said in a video. Charlotte usually comes across anything from rotten fruit and vegetables to cardboard boxes, overfilled leaking bin bags, and dirty dishes.Next, she declutters and organises the space she's cleaning. At times Charlotte also needs to wash piles of filthy dishes. At times Charlotte also cleans the walls, tidies up the laundry and bathroom, and cleans dirty clothes piled onto the floor.",
        "Ultimately Charlotte and her team work to improve the lives of their clients rather than change their habits. ",
        "She's even worked public holidays at times because she knew if she didn't the mess would've gotten 'out of hand' for some.Charlotte has nine people working for her business which first started out as a hobby. Previously she revealed how much she makes each week. Without working any more than five hours a day, Charlotte brings home around $3,745 per week. In one day she earned $1,000 for three hours of work.",
        "Despite being praised for her transparency, the attention the video received meant Charlotte was forced to hit back at trolls who accused her of overcharging clients or lying about how much she makes.'How much I make in a week as a 20-year-old cleaning business owner,' she said on TiKTok.On Monday, Charlotte earned $630 for five hours work. She then said she made $470 for four hours work on Tuesday. The cleaner worked from 9am to 11.30am on Wednesday and earned $600 for the two and a half hours.The next day she brought home $600 again for four and a half hours. She worked from 10am to 2pm on her laptop on Friday for $500.The average salary of a cleaner is $1,066 per week, a sum the young cleaner brought in in just three hours one day.",
        "Monday: 10am - 3pm ($630)Tuesday: 9am - 12pm ($470)Wednesday: 9am to 11.30am ($600)Thursday: 7am - 11.30am ($600)Friday: 10am to 2pm ($500)Sunday: 11am - 2pm ($1000) (Source: Care Cleaning Services Sydney) "
    ]
}