{
    "articleURL": "/news/article-12048589/Trans-comedian-appeared-Bud-Light-commercial-says-company-used-Dylan-Mulvaney-make-money.html",
    "content": [
        "Ian Harvie said he never felt that Anheuser-Busch was a genuine ally to transgender people in a new interviewHe said the company was only ever interested in using hot-button issues to make money, suggesting that's why it partnered with Dylan MulvaneyHarvie's remarks came as the CEO of Anheuser-Busch unceremoniously disavowed the disastrous stuntA transgender comedian who appeared in a 2016 Bud Light commercial now claims the company was 'never genuine' and used hot-topic issues, such as its partnership with trans Dylan Mulvaney, to make money. ",
        "Speaking to Ad Age, Ian Harvie said he never felt Anheuser-Busch was a genuine ally to transgender people — even when he appeared in a commercial proclaiming that 'gender identity [is] really a spectrum and we don't need those labels.'He said he felt the company was only ever interested in using hot-button issues to make money.And, he slammed the company for failing to support transgender TikTok star Dylan Mulvaney as it faced backlash for partnering with her.Harvie's remarks came as the CEO of Anheuser-Busch unceremoniously disavowed the disastrous stunt –  insisting it was 'not a campaign' while a letter to retailers says it was 'just one can.'",
        "In 2016, Harvie — a transgender man — appeared in an ad for Bud Light with Amy Schumer and Seth Rogen.The television spot said that Bud Light is not just for men and women but for 'people of all genders,' and noted 'Gender identity — it's really a spectrum, and we don't need those labels.'Rogen then added: 'Beer should have labels, not people.'We don't care,' he said at the end. 'We'll sell you a beer.'But now, years later, Harvie says he never really felt supported by the company.'I don't believe in the allyship of Anheuser-Busch,' he told Ad Age. 'It's not about diversity, it's about dollars.'",
        "Harvie added he too only partook in the commercial because he needed the money. 'It was about the dollars for me too, honestly,' Harvie admitted. 'I'm a working comic actor. I was thrilled to be in the presence of Amy Schumer and glad to get a nice paycheck from that.'But, he said, 'I'm 30 years sober —  I don't even drink.'I didn't believe in the allyship from the get-go,' he added.",
        "The comedian also accused Anheuser-Busch of trying to profit off of Dylan Mulvaney,  26, who became a TikTok star with her series '365 Days of Girlhood,' which documents her year-long transition.'They looked at her socials and just said, \"You know what? Here's a topic that's hot right now, Why don't we pay this person to do a promotion?\"And, he said, he was 'disturbed' that Anheuser-Busch never issued a statement of support for Mulvaney in the aftermath.'They should have doubled down,' Harvie argued. 'They should have said, \"You think it's offensive to have a trans person promoting Bud Light? Well here's 10 more.\"'He said the Mulvaney campaign was different from his 2016 advert because trans women face more hatred then men.'As much as I do feel scared and in danger — I just traveled to Florida and my eyes were peeled for sure — the truth is that transphobic responses are so much more visceral around trans women than trans men,' Harvie argued.",
        "'This is largely rooted in misogyny and transphobia combined,' he said, adding that in 2016 many viewers probably did not realize he was transgender.But, Harvie said, he does not think the public boycott of Bud Light will have a major effect on the company — even as sales for the American flagship beer plummeted 26 percent since the launch of Mulvaney's March Madness campaign.'The truth is that Kid Rock and his followers are still going to drink it,' Harvie said of the singer who famously shot up a case of Bud Light.'They're going to scream about it, but they'll keep drinking it,' he argued. 'It doesn't change the taste or the price point for them. They're not microbrew heads.' ",
        "After Mulvaney posted a video on her socials saying she was partnering with Bud Light and showing off a can with her face on it on April 1, the company lost more than $6billion in market capitalization in just six days.The beer giant's stock roughly traded at just over 5 percent decrease in the total share value and the company's market capitalization stood at $113.33billion.And in just the first week after the campaign launched, Bud Light dollar sales dipped 6 percent, as Coors Light rose 3.5 percent and Miller Lite 3.1 percent. ",
        "Between April 2 and April 15, the overall volume of Bud Light sales at bars and restaurants dropped by 34.7 percent.Bud Light has now declined into the fourth spot of the most popular draft beer during the second week of the controversy – losing out to Coors Light.",
        "It was later revealed that Bud Light's vice president of marketing Alissa Heinerscheid was hired to overhaul the company's marketing image in June 2022 and create a new campaign for the beer giant.She spoke out just two days before the controversial campaign and said the company had a 'fratty' image that needed to be changed.Heinerscheid took a leave of absence as the company dealt with the blowback from the campaign in the aftermath, with the company's vice president for mainstream brand, Daniel Brand, stepping down just a few days later.The firm said both bosses 'decided' to temporarily step down, but their decisions were reportedly not voluntary.'Given the circumstances, Alissa has decided to take a leave of absence which we support. Daniel has also decided to take a leave of absence,' the company said.Executives now say there was no 'management awareness' of the now-infamous campaign and have blamed it on an outside ad agency.",
        "On Thursday, Anheuser-Busch CEO Michel Doukeris told investors in an earnings call that there is 'misinformation' spreading on social media about the company's team-up with Mulvaney.",
        "'We need to clarify the facts that this was one camp, one influencer, one post and not a campaign,' he said in an earnings call.'We will continue to learn, meet the moment in time, all be stronger and we work tirelessly to do what we do best: Bring people together over a beer and creating a future of more cheers.'Doukeris also said Bud Light will triple its marketing spend this summer in a bid to woo customers back to the tarnished brand and added that the company is 'providing direct financial support' to the frontline workers affected by the boycott.Meanwhile, a letter was sent to retailers, bars and restaurants by Grey Eagle – which distributes Anheuser-Busch products around St Louis.It read: 'Anheuser-Busch did not intend to create controversy or make a political statement.'In reality, the Bud Light can posted by a social media influencer that sparked all the conversation was provided by an outside agency without Anheuser-Busch management awareness or approval.'Since that time, the lack of oversight and control over marketing decisions has been addressed and a new VP of Bud Light marketing has been announced.'"
    ]
}