{
    "articleURL": "/sport/football/article-12055959/Eurovision-Brighton-captain-Lewis-Dunk-admits-Seagulls-dreaming-Europe.html",
    "content": [
        "Brighton captain Lewis Dunk has opened up on the club's European ambitionsThe Seagulls are seventh in the league but have three games in hand on Spurs And Dunk admits he and his team-mates are dreaming of European competition Lewis Dunk pauses while he thinks about how he should answer. Have the Brighton players been talking about Europe? ",
        "He knows what he's supposed to say, what players always say, that they're only thinking about the next match and nothing more. One game at a time.He just can't bring himself to do it. He's the captain of Brighton and they've just done the league double over Manchester United with a 99th-minute Alexis Mac Allister penalty. They were sixth in the table until Tottenham beat Crystal Palace to leapfrog them on Saturday but have three games in hand, starting at Everton on Monday, and playing some of the most exciting football in the Premier League under Roberto De Zerbi.So, have Brighton been talking about Europe? 'Errr, sometimes… of course,' says Dunk. 'Would you?' If you were Dunk, why wouldn't you? Brighton have never played in Europe.",
        "It was the 26th anniversary only a few days ago of their 1-1 draw with Hereford at Edgar Street to avoid relegation from the Football League and potential oblivion. Dunk's a Brighton lad, too, who joined the club aged 12. The club played in League One when he made his debut against Millwall at the end of the 2009-10 season and, apart from a brief loan spell at Bristol City, he's been there ever since and their captain for the last four years with more than 400 appearances for the club.",
        "Now, he and Brighton are on the cusp of a once in a lifetime opportunity. 'Hopefully it's not once in a lifetime,' interjects the centre-back with a grin. 'Hopefully, we can be around here next season too. It's a great time. I have been on a journey with this club and to be fighting for Europe with six games to go in the Premier League. 'When I first came through, I'd have probably laughed at you. But now it is a reality and I am enjoying every single moment, leading the boys out, keeping them positive and fighting for everything. How can you not enjoy what I'm doing? We are aware of where we are but we aren't getting carried away. It shows how we are as a team.'Dunk's still on a high after the incredible finish to their victory over United. Brighton had created a ton of chances but looked destined to be thwarted… until Luke Shaw stuck his arm in the air in second-half stoppage time to concede the crucial penalty.'There's no better feeling than the last-minute winner,' says Dunk. 'They are the best moments in football and when you're doing it in front of your home crowd. 'Alexis to step up and put it in the top corner in the last minute shows cojones…can I say balls? Balls. Big balls! I was confident he was going to put it in the back of the net. He's been in pressure moments for us.'",
        "Even if World Cup winner Mac Allister did take a while to compose himself before striking the ball past David De Gea. 'He took a bit too long, though,' laughs Dunk. 'I think the stadium went quiet for 10 seconds. I was ready to run in for the rebound. Next time, I'm going to ask him to go a little bit quicker!'",
        "The contest, on the whole, was not so jovial. Dunk received a yellow card for a clash with United winger Antony while both players and fans became increasingly frustrated with referee Andre Marriner.'Antony kicked Alexis, I'm the captain, I'm not going to let him kick my team-mate so I went over,' explains Dunk. 'It was a bit of nothing. I got booked for it, so, we move on. I don't really want to speak about the referees. I'd rather speak about us winning a home game to keep pushing us up the league.'It was a result, too, that provided some revenge from their defeat against United on penalties in the FA Cup semi-final at Wembley, a result they followed up by losing to Nottingham Forest.Since then, however, Brighton have responded with two wins — including a 6-0 demolition of Wolves. Dunk continues to be the rock at the heart of the defence, a sight Gareth Southgate could not fail to miss from his seat in the Amex on Thursday.",
        "They have the chance to make it a third straight victory on Monday night against relegation-threatened Everton.'The had the disappointment of the semi-final and then the disappointment at Forest. That wasn't us, I think we carried a bit of that [FA Cup defeat] over. To bounce back with two massive wins shows the character and the fight that we have got to keep fighting for this European spot.'We've got another massive game on Monday, it's going to be a different test, and we are going to have to be ready to beat Everton.'Brighton have passed most of the tests they've faced under De Zerbi, a manager so passionate about football he used to go to bed with a pen and paper by his bed to note down the ideas that would wake him up in the middle of the night and such a clear plan.",
        "So clear, in fact, that Dunk admits he could play in attack if De Zerbi's desperate. Add that with their remarkable recruitment record, led by the secret algorithm of owner Tony Bloom that analyses players to spot the brightest talents before anyone else like Moises Caicedo and Kaoru Mitoma.'It's credit to the club bringing those youngsters in from nowhere,' says Dunk. 'When they come in, I feel bad, but I don't know where they've come from but you see them in one training session and you understand why they're there. ",
        "'And the way this manager works, everyone knows every single position on the pitch and everyone knows what they should be doing. 'I could play number 10 for this manager because I know what I should be doing. I wouldn't do a very good job but I know what I'm supposed to do! Everyone's eager to learn, even the senior players are willing to learn like the young boys.'It's for all those reasons — the recruitment, the manager, the talent and the desire — that mean Brighton are no longer a plucky minnow blessed to nick the odd point here or there against the big boys but a team who more than holds its own against them and believe they can do so.With Arsenal, Newcastle and Manchester City still to play in their quest to bring European football to Brighton, Dunk knows they will have to keep that positive mindset.'When I first came into Premier League after promotion, we turned up to those games and hoping to win, which is reality when you're a promoted side,' says Dunk.'It's tough and I don't know how long it took for us to beat a top side. Now we're in a different place as a club and as a squad and as a group. We are confident against anyone and we can we feel that we can beat anyone on our day.'"
    ]
}