{
    "articleURL": "/wires/reuters/article-12040213/Australia-March-retail-sales-post-slowest-annual-growth-14-months.html",
    "content": [
        "SYDNEY, May 3 (Reuters) - Australian retail sales grew at their slowest annual pace in 14 months in March in a warning sign for consumption that will only get worse following a surprise hike in interest rates this week.",
        "Retail sales rose a modest 0.4% in March from February, when they edged up just 0.2%, data showed on Wednesday. Sales of A$35.31 billion ($23.53 billion) were up 5.4% on a year earlier, but that was down from 6.4% growth in February.The figure, however, was slightly above the median forecasts of a 0.3% monthly rise.While shoppers spent more on food and eating out, they cut back on clothing, household goods and department store spending amid cost of living pressures and higher borrowing costs.The burden from mortgage payments is set to mount further after the Reserve Bank of Australia (RBA) hiked rates to a decade high of 3.85% on Tuesday, a major surprise for markets and a majority of economists that had looked for an extended pause.Treasurer Jim Chalmers said on Wednesday the hike was a \"brutal reminder\" of economic challenges facing the country and urged restraint in the upcoming federal government budget next Tuesday to avoid adding to Australia's inflation problem.\"It was a pretty, pretty brutal reminder of the challenges that are in our economy, particularly this inflationary challenge. And a really difficult day for Australians who are already under the pump.\"Marcel Thieliant, economist at Capital Economics, estimates sales volumes probably fell by around 0.5% in the first quarter, from the prior quarter.",
        "\"While retail sales values rose at a decent pace in March, we estimate that sales volumes fell the most since 2021's lockdowns last quarter and that weakness has further to run,\" said Thieliant.\"We think that consumption growth will slow to around 0% q/q this quarter and next.\"RBA Governor Philip Lowe has warned that the central bank cannot take too long to bring inflation to heel, after the RBA maintained its forecast that inflation is only set to return to the top of the 2-3% target range by mid-2025.Markets are now pricing around a one-in-three chance of a further hike to 4.10% by August, on top of an eye-watering 375 basis points in hikes since May last year.($1 = 1.5004 Australian dollars) (Reporting by Wayne Cole and Stella Qiu; Editing by Christian Schmollinger and Jacqueline Wong)"
    ]
}