{
    "articleURL": "/news/article-12049711/Charless-biographer-Jonathan-Dimbleby-says-King-oath-allegiance-abhorrent.html",
    "content": [
        "King Charles' close friend Jonathan Dimbleby today revealed that the monarch would find the call for millions of citizens to 'pay homage' to him at the Coronation 'abhorrent'.",
        "The broadcaster, 78, who will be in Westminster Abbey to see the monarch crowned tomorrow, said Charles would agree with the unexpected backlash to the decision, declaring: 'That it is so different from the King that I know.'He said: 'I can think of nothing that he would find more abhorrent. He's never wanted to be revered. He's never wanted anyone to pay homage to him, except in mock terms as a joke. He wants, I think, to feel that people will share in the event. I don't quite know how this might have happened'. He appeared to blame Archbishop of Canterbury Justin Welby for the so-called 'chorus of millions' to swear allegiance in the historic service. The so-called 'homage of the people' is a new addition to the ancient ceremony, announced by Lambeth Palace a week ago, but the King's friend has called it 'rather ill advised'.It is not known if Mr Dimbleby has discussed the issue with His Majesty, but given their closeness, his intervention is the most explosive yet in the row. Some have claimed previously that Charles' biographer is 'wheeled out' when 'Charles is in a corner'.He called the oath 'most bizarre', claiming it was likely to be the result of 'miscommunication', adding it was 'so different from the king that I know to ask for or expect homage'. ",
        "'I don't know for certain but it would seem to me that this was an initiative by the archbishop who, as we know, is strongly evangelical, who thought it would be a good thing to give everyone a chance to pay that homage. I think it was well-intentioned and rather ill-advised', he said.",
        "Dimbleby became a personal friend and biographer of Prince Charles after interviewing him on TV in 1994 when the royal sensationally confessed his affair with Camilla Parker Bowles. He recently defended Charles over the cash for honours scandal. Last year he also branded Prince Harry as 'not the brightest' and claimed he is 'led by the nose' by wife Meghan Markle.Dimbleby, giving an insight into the King's personality, described him as a 'perfectionist'.He added: 'If there were a Mastermind on the histories of coronations he would definitely have it as his special subject and he would emerge triumphant. He knows his history. He believes therefore it's got to be done really well.'Charles has been 'closely involved' with the performance of the coronation, Dimbleby said, referring to the King's interest in the theatre and acting.'There is an element of performative in him. He is a thespian, he loves the theatre, so he wants it all to work really well,' he added.",
        "The King also wanted to be personally involved in choosing clothes to reflect his role as a 'humble petitioner', Dimbleby revealed.He said: 'He wanted to make sure that his clothes, for instance, made it possible for him initially to be what the role is, almost seeking the approval of the nation to become King, almost a humble petitioner, and then to emerge triumphant of this extraordinary pageant, of which he is the star.'As King, Charles will focus on diversity and harmony in the country, leading as a 'monarch for our times', Dimbleby said.'He sees his role, I think - I have talked about it with him - as being doing his best to achieve a sense of overarching harmony in a very diverse and often rather troubled, very troubled, often divided United Kingdom.'That's what will be his lodestar, his guiding sense of duty.'Dimbleby added that Charles understands he can no longer share political views as King and in public will 'only speak when he knows that he is expressing a consensus as defined by the government of the day'.'He will honour the customs and he will be very much a monarch for our times because he is a 21st century person,' he said.",
        "The Archbishop of Canterbury's office this weekend revealed plans to make the ceremony more of a 'People's Coronation' by scrapping the historic rite of aristocrats pledging their oath to the new sovereign.",
        "Only the Prince of Wales will now kneel before the King and pledge to be his 'liege man of life and limb'.In a trailblazing move Lambeth Palace said citizens of the UK and Commonwealth would be offered the chance to 'make their homage in heart and voice to their undoubted King' instead.But the move sparked much debate yesterday as members of the public discussed whether they would heed the call. That led to a Lambeth Palace source stressing that it was an 'invitation' for people watching the ceremony on Saturday to take part by vocally offering their 'true allegiance' to the monarch and his heirs, rather than an 'expectation or request'.",
        "The order of service will read: 'All who so desire, in the Abbey, and elsewhere, say together: I swear that I will pay true allegiance to Your Majesty, and to your heirs and successors according to law. So help me God.'A spokesman for Lambeth Palace said: 'The Homage of the People is particularly exciting because that's brand new.'Our hope is at that point, when the Archbishop invites people to join in, that people wherever they are, if they're watching at home on their own, watching the telly, will say it out loud – this sense of a great cry around the nation and around the world of support for the King.'",
        "While it was clear there is no diktat, both Buckingham Palace and Lambeth Palace were clearly taken aback yesterday by the strength of feeling the invitation provoked.Many felt their well-meant rallying cry played into the hands of Republicans and critics of the ceremony, sparking an outpouring of comment on social media.Labour MP Clive Lewis told The Guardian that he thought the proposed oath would be 'either unwelcome or ignored by many'.Republic, the anti-monarchist organisation, said it was 'an offensive and tone-deaf gesture that holds the people in contempt'.But Transport Secretary Mark Harper told Sky News he would be swearing the oath and said MPs already pledge allegiance to His Majesty.He said the Coronation would be a 'fantastic opportunity' and a 'great showcase for Britain around the world'.Labour MP Shabana Mahmood agreed, saying it was a 'lovely idea to involve the people' and that the oath was a 'lovely touch'.Last night a Lambeth Palace source clarified that the invitation was very much optional and simply an opportunity for people to join in should they so wish.They said: 'This is very much an invitation rather than an expectation or request, as you can see from the Archbishop's introduction to the homage.'It's simply an opportunity offered by the Archbishop so that, unlike previous coronations, those who wish to join in with the words being spoken by the Abbey congregation could do so in a very simple way.",
        "'For those who do want to take part, some will want to say all the words of the homage; some might just want to say, 'God Save The King' at the end; others might just want it to be a moment of private reflection.'They added: 'We live in a wonderfully diverse society with many different perspectives and beliefs, and it's quite right that people decide for themselves how they relate to this moment.'For those who may wish to join in, we hope it's a moment of joy and celebration – both in the Abbey, and in homes around the country and beyond.'The Homage of the People is one of a number of significant updates to the ancient ritual to make it more inclusive and up to date.Key roles will be handed to representatives of other faiths, as well as the Church of England. Female members of the clergy will also be involved for the first time.Queen Camilla will also become the first consort ever to be anointed with Holy oil in full public view.While her husband's anointing will take place behind a screen, his wife has dispensed with the canopy previously used by sovereign's wives such as The Queen Mother and Queen Mary.Sources said it was her personal preference and would also help 'speed up' the ceremony."
    ]
}