{
    "articleURL": "/femail/lifehacks/article-12058063/Mothers-Day-gift-hack-glam-bottle-wine-bought-mum-flower-bouquet.html",
    "content": [
        "Woman adds a flower bunch to top of wine bottle Millions were wowed by the 'beautiful' gift hack A creative woman has come up with a handy hack to make the DIY gift for someone who's 'impossible to buy for'.",
        "The woman glammed up a bottle of wine she bought for her mum by adding a homemade flower arrangement on top.The DIYer placed a dry foam block that florists use to arrange bouquets on top of the wine, filled it with fresh flowers then wrapped up the bottle in patterned paper. Millions were wowed by the simple gifting trick and said it looked similar to  professional flower arrangements worth hundreds of dollars. She started her creation by wedging a flower foam brick, also known as an oasis, on the top of the wine bottle and cutting it to size. Scroll down for video ",
        "Bunnings sells a 23cm Artificial Flower Accessory Dry Foam Brick for $5.98. The woman then pours water over the foam which quickly absorbs and keep the flowers fresh. She then wraps the block in clingfilm to catch excess water from dripping on the wine bottle and the paper she will later wrap it in.'Now for the fun part,' she says as she starts she starts to insert pink roses into the brick. She cuts the flower stems short at an angle so they can pierce through the clingfilm easily. She spreads the roses out and adds pink and white chrysanthemums as well as lilies and gerberas in the gaps until the brick is no longer exposed. ",
        "To give the arrangement some more 'pizzazz', she adds some baby's breath as well as some leaves and eucalyptus for extra greenery before wrapping the bottle in floral paper.   She places the bottle on top of the paper then folds it upwards and secures it with a scrunchy as an extra gift. 'As part of the gift you can take a nice big scrunchy and slide it up over the bottom. The quickest mother's day gift you've ever seen,' she said. Her video has racked up more than 5.2million views as many in the comments were thankful for the 'beautiful' Mother's Day gift idea. 'Very creative. Wonderful arrangement and thoughtful,' one viewer said.  'This would be a WONDERFUL teacher appreciation gift,' added a second. 'That is super neat, people go to throw the flowers away and SURPRISE! a bottle of wine,' a third wrote.Some thought the gift would be just as stylish without the wrapping paper and scrunchy while other shared tweaks they would try.'I would have left the bottle to be seen, this is a great idea and looks lovely,' one person replied.  'Or hear me out...Cut the block in half and have enough for TWO projects!' another suggested.    'She could've put a ribbon turned into a bow instead of the scrunchy,' a third recommended.   ",
        "'That oasis needs to soak in water to hydrate it properly - flowers will be dead in a day,' explained a fourth.  A florist added the flowers would stay looking fresh for up to a week and even longer if the block wasn't covered in clingfilm. 'Once the oasis (green foam) dries out you can't water it as it is covered in cling wrap. It's a great idea though,' she said. "
    ]
}