{
    "articleURL": "/femail/article-12056933/Dip-new-trend-list-honey.html",
    "content": [
        "Emma Rowley samples VIP's honey from Hollywood and Buckingham Palace READ MORE: Are YOU a victim of honey-laundering? Expert reveals nearly ALL supermarket honey is FAKE Marrying zesty citrus with subtle herby notes and a wonderful aroma that's reminiscent of freshly cut hay . . .' Reading the tasting notes, you might think you're opening a bottle of wine, not a pot of honey.",
        "But this is no ordinary honey — it's produced by truly royal bees, housed in Her Majesty Queen Camilla's Wiltshire garden.And now, it's available for you to luxe up your toast.Actors Julianne Moore and Will Ferrell have joined the VIP honey-selling brigade, as has David Beckham, sharing on Instagram a snap of one of his honey jars labelled DBee'z Sticky Stuff.Intrigued, I channeled my inner Pooh Bear to see which of the A-list golden nectars hits the sweet spot . . .",
        "THE QUEEN BEEFortnum's Coronation Queen Consort Honey (£40 for 200g, £5.95 delivery, fortnumandmason.com)",
        "Produced by bees living in hives in Queen Camilla's private garden and collected by Fortnum's own bee-keeper, this limited-edition honey arrives in a beautiful sea-green box decorated with a golden crown, as this is part of the royal grocer's Coronation collection (still on sale). Proceeds go to Mirabel, a charity supporting survivors of sexual violence in Nigeria, a nod to the Queen's work in this area.The result is a pot of amber with a mellow, almost fruity sweetness, to be enjoyed spread on crumpets.JEZZA'S JARBee Juice and Honey Dipper (£16.50 for 340g, £5.25 delivery, diddlysquatfarmshop.com)",
        "Placing an order with the Diddly Squat Farm shop, made famous in Jeremy Clarkson's hit Amazon show, Clarkson's Farm, I get an apologetic message from 'Team Diddly'. They ask me to 'bear with them' if my purchase is slightly delayed, due to the large volumes they're processing — cue visions of Clarkson melting down among his hives.",
        "Despite that, my jar arrives within a few days, with Jezza's smiling face on the label and a little wooden dipper to match.The honey is made by bees buzzing about wildflower meadows and oilseed rape fields, and the taste is sweetly uncontroversial, unlike its maker. The perfect breakfast treat for anyone still mourning the original Top Gear line-up.SWEET STING Il Palagio Chestnut Honey (€8 [£7] for 240g, €28 [£24] delivery, palagioproducts.com)",
        "Sting and his wife Trudie Styler make a range of honey at their Tuscan estate. Getting hold of it requires visiting the website to make your pick of flavours 'from dark, robust Chestnut, to mild and delicate Acacia', with, alarmingly, no obvious prices — then ordering over email.My Chestnut version arrives so securely wrapped I have to take a carving knife to it. The thick, dark honey really does have a distinctive, aromatic flavour, with a bittersweet kick. Not one for the kids.Unsurprisingly, shipping a glass container from Italy is not cheap, so if you're feeling flush you could soften the blow by ordering some Message In A Bottle wine, too. (Yes, that's what it's really called.)LADY B'S COMBDaylesford Organic 20th Anniversary Limited Edition Chunk Honey (£50 for 800g, £7 delivery, daylesford.com)",
        "This huge jar arrives in a box lined with an immaculately clean approximation of hay: shredded spruce from Britain and Sweden. It has a pretty wooden keepsake lid engraved with a bee, celebrating 20 years of the organic farm shop founded by Lady Bamford that draws the Cotswolds glitterati in droves. A long chunk of honeycomb floats like an iceberg in the creamy, flavoursome honey — and, like an iceberg, it's much bigger than it appears, extending deep into the centre. A luxe gift.",
        "HIGHGROVE HONEYHighgrove Royal Orchard Summer Honey, 200g (£7.95 for 200g plus £5.95 delivery, fortnumandmason.com)",
        "Camilla is not the only royal to dip into honey. Duchy Organic, the food brand founded by King Charles, sells honey made by bees feasting on organic meadows in Romania, a major producer of the stuff, it turns out (£3.70 for 340g, Waitrose). Alternatively, at Fortnum's you can buy a stately-looking ceramic pot of Highgrove Royal Estate honey for a cool £60 for 500g, harvested from hives in a corner of His Majesty's private gardens in Gloucestershire.But this more affordable jar of golden, runny honey is made by bees living in an old paddock at Highgrove. The result? A delicious floral honey fit for a king — without breaking the bank.DOWNTON DELIGHTHighclere Castle Honey (£7.50 for 454g, £3.95 delivery, highclerecastleshop.co.uk)",
        "Never mind Lady Grantham, Lady Carnarvon is the true doyenne of Highclere Castle, the Hampshire seat that is Downton Abbey in the ITV drama.Like most stately homes it has a gift shop, which you can visit online to buy the honey produced on the estate. Delivery is prompt and my jar arrives in a reused box — 10/10 for recycling effort. Clear, golden, fragrant: just what the butler ordered."
    ]
}