{
    "articleURL": "/wires/afp/article-12045615/Taking-high-road-India-infrastructure-drive-counters-China.html",
    "content": [
        "Freshly laid roads, bridges, upgraded military camps, and new civilian infrastructure dot the winding high Himalayan route to the Indian frontier village of Zemithang -- which China renamed last month to press its claim to the area.",
        "It is in the far northeastern Indian state of Arunachal Pradesh, almost all of which Beijing insists falls under its sovereignty as \"South Tibet\".The Asian giants fought a war in 1962 over their 3,500-kilometre (2,200-mile) divide, now known as the Line of Actual Control, and it remains disputed to this day, with sporadic clashes and regular diplomatic manoeuvres.Culturally largely Tibetan, Arunachal Pradesh is savage territory for battle, with mountain passes as high as 4,750 metres (15,000 feet) still covered in snowdrifts as late as May, and thickly forested slopes lower down.Now both powers are engaged in major construction drives to reinforce their positions.New Delhi bristled at Beijing's announcement renaming Zemithang -- dubbed \"Bangqin\" -- and 10 other sites in April.Foreign ministry spokesman Arindam Bagchi said the state \"is, has been, and will always be an integral and inalienable part of India\", adding: \"Attempts to assign invented names will not alter this reality.\"Beijing has sought to change the facts by force before.Zemithang, just a few kilometres from the boundary, and picture-postcard Tawang, the main town in the district -- home to the biggest and oldest Tibetan Buddhist monastery outside Lhasa -- were both seized by Chinese forces in 1962 as they inflicted a humiliating defeat on Indian troops before retreating.",
        "The Indian army officer charged with preventing a repetition is Brigadier N.M. Bendigeri, who commands thousands of troops in Tawang.Hundreds of his men clashed with Chinese forces in December.And three years ago in Ladakh, at the western end of the frontier, 20 Indian and four Chinese soldiers were killed in brutal hand-to-hand combat.Beijing's announcements \"won't change a thing here\", Bendigeri said.But in fact, Chinese actions are profoundly changing the once neglected and remote region.- Balancing act -",
        "Worried about China's build-up on the other side, Prime Minister Narendra Modi's government has pumped billions of dollars into ambitious connectivity projects, to boost civilian presence, and establish new paramilitary battalions.India has scaled up its defences, deploying cruise missiles, howitzers, US-made Chinook transport helicopters and drones.At the same time, in an indication of New Delhi's constant geopolitical balancing act, India is part of the Shanghai Cooperation Organization, which includes China and Russia.As the grouping's current chair, on Friday it hosts a meeting of its foreign ministers in Goa.But in the face of China's increased assertiveness under leader Xi Jinping it has also become a member of the so-called Quad with the US, Australia and Japan, set up to counter Beijing.Within days of Beijing's renaming announcement, India's powerful interior minister Amit Shah launched a $585 million \"vibrant villages\" scheme for civilians along the border.",
        "\"India wants peace with everyone,\" said Shah at Kibithoo, one of the first Arunachal Pradesh villages overrun in 1962.\"But no one will be able to encroach on even an inch of our country's land\".- 'Dual-use ghost villages' -New Delhi has expressed alarm over its neighbour's push to develop \"xiaokang\" -- meaning well-to-do villages in Mandarin -- along the Line of Actual Control.Bendigeri fears they will be \"dual-use ghost villages\", intended to alter realities on the ground.He also worries the People's Liberation Army could use them during a conflict, echoing the way Beijing has built militarised artificial islands in the disputed South China Sea.",
        "But India's capacity to respond is constrained by the fact its military budget is, according to the Stockholm International Peace Research Institute, little more than a quarter of China's.And New Delhi can only persuade civilians to stay in the areas, rather than compel them.Modi's government said last year it had sanctioned 35 infrastructure schemes and 2,319 kilometres of roads in the state.Souvenir vendor Tenzin Dorjey, 35, says more tourists are coming to his shop in Tawang, but it is still 12 hours from the nearest airport.\"If the roads improve, everything improves for us and the people who want to come here,\" he said.",
        "The showpiece project is a tunnel under the Sela pass which Colonel Ravikant Tiwari of the Border Roads Organisation said will be the world's longest tunnel at an altitude of 4,000 metres.It will provide \"all-weather connectivity\" and \"boost strategic defence infrastructure\" where snowstorms regularly cut the existing road every winter, he said, as an army of workers laboured in freezing conditions.- 'We are Buddhists' -Zemithang is where the Tibetan spiritual leader the Dalai Lama entered India when he fled into exile in 1959.The location of his crossing has become a pilgrimage site for his followers, who pass India's last army post and cross a rickety old bridge over a raging river to pray at a \"holy tree\" he reportedly planted at the time.",
        "A large Chinese military camp is visible on a slope about a kilometre ahead.Residents used to have \"close ties with people from Tibet but things changed after 1962\", said local Sangey Tsetan, 61.\"We remember. We are not the same. We are Buddhists and they're Communists.\""
    ]
}