{
    "articleURL": "/wires/ap/article-12053427/Booker-scores-47-Durant-adds-39-Suns-beat-Nuggets-121-114.html",
    "content": [
        "PHOENIX (AP) - Devin Booker has carried a massive offensive load for the Phoenix Suns in these playoffs, averaging more than 35 points per game despite defenders draped all over him in most games.",
        "Faced with a nearly must-win game on Friday night, he somehow did even more.Booker scored 47 points, Kevin Durant added 39 and the Phoenix Suns beat the Denver Nuggets 121-114 to cut Denver´s lead to 2-1 in their Western Conference semifinal series.\"It's all I know, this is all I dreamed of as a kid,\" Booker said. \"I've dedicated a lot of my life, moved away from my family when I was young, to pursue being in these moments.\"Booker had another ultra-efficient scoring night, shooting 20 of 25 from the field, including 5 of 8 from 3-point range. Durant shot just 12 of 31 from the field, but made 14 of 16 free throws.\"They knew what we had to do to win this game,\" Suns coach Monty Williams said.",
        "The Suns will try to even the series in Game 4 on Sunday in Phoenix.The Suns took a 90-88 lead into the fourth quarter, retaking the lead after the Nuggets erased a 15-point halftime deficit. Phoenix scored the first nine points of the fourth - including the final two on Durant's fast-break dunk - to push their advantage to 99-88.They wouldn´t trail in the fourth quarter. Durant started 1 for 9 from the field but made 11 of his final 22.",
        "\"It's frustrating not making shots, because that's what I'm paid to do,\" Durant said. \"But there also comes a time when you've just got to figure it out and push through it.\"Denver's Nikola Jokic - who finished second in the MVP voting on Tuesday to Philadelphia´s Joel Embiid - finished with 30 points, 17 assists and 17 rebounds.Jamal Murray led the Nuggets with 32 points, while Michael Porter Jr. added 21 points and 12 rebounds. Murray said he was disappointed he didn't contribute more down the stretch.\"I had some great looks at the end of the game and that would have kept us right there,\" Murray said. \"I feel like they pulled away because of that. I have to be more locked in, more relaxed down the stretch.\"Denver coach Michael Malone said his team played well at times, but that the defense against Booker was \"unacceptable.\" Booker repeatedly got near the rim for short jumpers or layups, which contributed to the 20 of 25 shooting night.\"I wasn´t a math major but that is a really high percentage,\" Malone said. \"We have to be a lot better.\"The Suns put Cameron Payne in the starting lineup to take the place of 12-time All-Star Chris Paul, who suffered a strained left groin in the Game 2 loss and didn't play on Friday. Payne - a playoff hero for a few games two seasons ago when Paul was out - scored seven points, including a big 3-pointer early in the fourth.",
        "Williams also shook up the bench rotation, giving Terrence Ross, Jock Landale and TJ Warren more minutes. Landale finished with six points and nine rebounds, while Warren hit a couple crucial buckets in the final minutes to help the Suns keep the lead.Booker scored 27 points in the first half on 12-of-15 shooting to push the Suns ahead 67-52 by halftime. Durant added 21, including 11 points on free throws.AYTON BENCHEDIt was a tough night for Suns starting center Deandre Ayton, who finished with just four points and nine rebounds in 26 minutes.Ayton was so ineffective that Williams benched the former No. 1 overall pick in favor of Landale, who was providing much more energy and rebounding. Booker said it's his job to help Ayton push through the tough times.\"That's life,\" Booker said. \"We've been around long enough to understand that not every night is going to be your night. It's doing other things to make up for it. ... Energy and effort always has to be high, especially around this time. You can't get flustered, you can't get in your own head. I could see that a little with him today, so it's my job to pump him up.\"TIP-INSNuggets: Jokic had 10 assists in the first half. ... Had a 51-41 rebounding advantage.",
        "Suns: Durant shot 16 of the team's 18 free throws. He had all of them until Booker shot two free throws in the final seconds.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}