{
    "articleURL": "/wires/afp/article-12060041/EU-cancels-Israel-reception-extremist-ministers-participation.html",
    "content": [
        "The European Union said Monday it was cancelling its Europe Day reception in Tel Aviv after the extremist Israeli minister representing the government stood firm in his intention to participate.",
        "In a statement, the EU delegation to Israel said it would still celebrate Europe Day on Tuesday but regretted that \"this year we have decided to cancel the diplomatic reception, as we do not want to offer a platform to someone whose views contradict the values the European Union stands for.\"Reports began emerging in Israeli media on Sunday about the EU's discontent over National Security Minister Itamar Ben-Gvir's being the government representative to the Tel Aviv reception.Israeli government officials confirmed on Monday that Ben-Gvir \"was designated (by the government) to attend the EU event\".Ben-Gvir, who has a history of inflammatory remarks about Palestinians, was charged more than 50 times in his youth with incitement to violence or hate speech. He was convicted in 2007 of supporting a terrorist group and inciting racism.He has advocated annexation of the Israeli-occupied West Bank, where he lives in a Jewish settlement. Such settlements are considered illegal under international law.Ben-Gvir, head of the far-right Jewish Power party, issued a statement saying he was the assigned representative, and had \"confirmed his arrival.\"He also provided details on the speech he planned to deliver at the diplomatic reception.\"The minister thinks that even if the EU representatives do not support his opinions, as per their statements, they understand very well that Israel is a democracy, and in a democracy you are allowed to hear other opinions too,\" Ben-Gvir's office said in a statement.",
        "On Monday, a spokesman for EU foreign policy chief Josep Borrell said they were \"consulting\" on what to do regarding the reception.\"We don't endorse the political views of Mr Ben-Gvir. We don't endorse the political views of his party because they are in stark contradiction with all the values and principles the EU stands for and believes in,\" Peter Stano told reporters in a briefing.Later in the day, the EU's Israeli delegation announced it was cancelling the diplomatic reception, but would still hold the \"cultural event for the Israeli public\" to celebrate \"the strong and constructive bilateral relationship.\"Following their announcement, Ben-Gvir lashed out at the EU, accusing it of hypocrisy and \"undiplomatic mouth-shutting.\"Europe Day is the annual celebration of European unity and peace. It marks the anniversary of the 1950 Schuman Declaration, a few years after the end of World War II, which laid the foundation for today's 27-nation EU bloc."
    ]
}