{
    "articleURL": "/news/article-12049981/B-M-closing-store-TODAY-leaving-customers-just-hours-shop-shuts.html",
    "content": [
        "The major retailer announced last month it is closing a number of stores in MayBut B&amp;M is bucking the High Street trend by often replacing closed store B&amp;M is closing another store today, meaning customers have just a few hours to bag bargains there before its doors shut for the final time.  ",
        "The store on Saddler Street in Bishop Auckland, County Durham, is open today until 5pm and has apologised for the 'inconvenience' caused to customers. As a result, customers in the area will need to travel two miles to their next closest B&amp;M store in Shildon. The closure comes as the major retailer announced last month it would be closing stores across the UK in May - despite a 'very good performance' over the Christmas period with revenue increasing by almost an eighth.But many of the closures come as B&amp;M opens shops in nearby locations instead. ",
        "B&amp;M's decision to close stores but open new ones elsewhere, stands in contrast to the strife on the High Street that has seen many chains close doors permanently and without replaceent. Major bank branches and big-name brands such as M&amp;Co, Marks &amp; Spencer and Clintons have announced recent closures. Some 76 bank branches are closing for HSBC, Barclays, Lloyds, NatWest, TSB and Halifax spread across England, Wales, Scotland and Northern Ireland.Banks say they are cutting branches because they have noticed big drops in the number of customers visiting, as people opt for using their mobile phones or computers to manage their money instead. But closures are expected to isolate older or more vulnerable customers who do not have access to internet or online banking and require in-person advice.",
        "Following the pandemic, high street footfall has dropped, leaving British high streets struggling to stay afloat.Brands have had to manage soaring energy bills, which have exacerbated the financial strain on struggling companies, whilst customers also affected by the cost-of-living crisis attempt to cut back on spending.In February, fashion giant M&amp;Co announced it would shut all 170 of its shops - putting 1,910 jobs at risk.",
        "Banks are closing swathes more branches across the country.This will affect towns where other banks have already shut their doors.Our map shows where closures are due. &gt; Will you lose your bank branch? Check our interactive map ",
        "As well as retailers shutting up shops, food and drink chains have taken a hammering too, with Wetherspoons and Frankie &amp; Benny's announcing closures.With shoppers being hit by ballooning costs, many are now spending less money on non-essential items to drive down their weekly bills.The increasing popularity of online shopping and deliveries has also seen footfall in British high streets plummet, piling even more pressure on retailers.B&amp;M shuts stores but opens new ones nearby A B&amp;M store in Widnes, Cheshire will shut on Wednesday, May 17, moving to a new location in the same town before it reopens on Wednesday, May 24. B&amp;M released the following statement on their website: 'Your B&amp;M Widnes store is moving from its current location at Bowers Retail Park to its new home at Widnes Trade Park (formerly The Range).'",
        "'We apologise for any inconvenience caused while we bring you a bigger and better B&amp;M store.'The chain's Burnden Retail Park store in Bolton, Greater Manchester will also close for good on May 24. However, shoppers will still be able to visit a nearby B&amp;M, with another branch located in close proximity on Manchester Road.The chain has shut down five of its stores already in 2023, including: Castlegate Shopping Centre, Stockton - February 25Maesglas Retail Park, Newport, Wales - March 4Boucher Road, Belfast - March 26Queens Drive Retail Park, Kilmarnock - March 26Broadwalk Shopping Centre, Bristol - March 29",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}