{
    "articleURL": "/wires/aap/article-12045071/Storm-set-Souths-Mitchell-best.html",
    "content": [
        "Latrell Mitchell may have gone missing in their last clash but Cameron Munster expects the South Sydney superstar to be front and centre of their Magic Round match on Saturday night.",
        "The top four teams square off at Suncorp Stadium with Melbourne looking for a repeat of their 18-10 victory in round five.After that match Mitchell was criticised for his lack of involvement in the first half, contributing only three runs for 27 metres.While the Rabbitohs were unable to peg back back Melbourne's lead, the fullback had a much more influential second half and since that game has kicked on to become one of the competition's form players.Munster expected Mitchell to be a handful for his team for 80 minutes this time around.\"Latrell's obviously come back to his playing best,\" the Storm playmaker told AAP.\"I know he got a lot of criticism at the start of the year about not being involved enough but he's proved those critics wrong with where he's playing at the moment.\"He's playing with confidence and free-flowing ability ... we've got a big job against him this weekend.\"Munster said they would be keeping close tabs on Mitchell to try to limit his time and space with the ball, while he also named Souths trio Cody Walker, Cameron Murray and Campbell Graham as major threats.\"When it's a big occasion, Latrell usually stands up, so maybe they'll be expecting a big game from him, and I'm sure he'd be expecting a big game from himself,\" Munster said.",
        "The Test No.6 said he was looking forward to seeing newly re-signed Nelson Asofa-Solomona put his stamp on the match, after he helped turn momentum the Storm's way last round against the Warriors.\"Nelson's re-signing is obviously a big thing and he played really well coming back from injury against the Warriors and he changed the game for us,\" Munster said of the giant Kiwi prop.\"The stuff in the game that he did allowed me and Harry (Grant) to play our style of footy so I'm happy to have him back.\""
    ]
}