{
    "articleURL": "/wires/reuters/article-12045879/Fear-recedes-Ukraines-volunteers-war-just-job.html",
    "content": [
        "By Manuel Ausloos",
        "ON THE FRONTLINE IN DONETSK REGION, Ukraine, May 4 (Reuters) - A fter months of living in trenches and bunkers near Ukraine's southeastern frontlines, Artem and his fellow soldiers have lost the fear they once felt.The war ebbs and flows for the 30-year-old volunteer from a small town near Chernihiv, in the north of the country, that came under siege early on in Russia's full-scale invasion of Ukraine more than a year ago and was briefly occupied.Despite the regular thud of artillery and the whirring of a helicopter overhead, things have been relatively quiet of late for the unit located close to Russian positions.The soldiers spend much of their time peering through binoculars, waiting, listening, scrolling through smartphones, clearing away mud and checking their weapons - including machine guns provided by the United States and Germany.The last Russian attack was about a month ago, when some 30 Russian troops were mown down by two machine guns, said the group's commander, Dmytro. Reuters could not independently confirm battlefield reports.\"There is always danger here, but over time you get used to it, and all your senses seem to sharpen,\" Artem told Reuters during a recent reporting trip to the position.\"You no longer feel the fear that you had at the beginning,\" added Artem, who has been based in the eastern Donbas region for some six months. He and his comrades, mostly volunteers, rotate regularly through the trenches, four days on, four days off.",
        "They share their position with a cat and her seven kittens, who help to keep the mouse population down.'JUST A JOB'The narrow trenches are cut deep into black earth, reinforced in places by sandbags.Dugouts are cramped but provide shelter from artillery shelling, mortars and weapons dropped from drones - munitions that pose a threat to both sides along around 1,200 km (750 miles) of frontlines in eastern and southern Ukraine.\"We have a place to eat, to sleep, we have a roof over our head. I don't think we need much more here, once you have the necessities covered,\" said Artem, who gave only his first name for security reasons.\"You can sleep, you can eat, and you find yourself in an illusion of safety. Nothing else matters.\"He joined up to fight the Russians soon after the invasion began, motivated by patriotism and a desire to protect his parents, friends and girlfriend.\"Over time, when you understand that they are all safe, it just becomes a job.\"He has not been home for some time, preferring to wait for the conflict to end so that he will not be sent back to the trenches when his leave ends.Ukrainian authorities are planning to launch a major counteroffensive in the coming weeks which they hope will shift the momentum in the war and push the Russians back towards the borders of 1991.",
        "Until then, Artem and his comrades wait and prepare for the next skirmish. (Editing by Nick Macfie)"
    ]
}