{
    "articleURL": "/wires/ap/article-12058275/Betts-Outman-homer-Dodgers-stun-Padres-5-2.html",
    "content": [
        "SAN DIEGO (AP) - Mookie Betts hit a game-tying homer with two outs in the ninth inning and James Outman hit a two-run shot in the 10th to give the Los Angeles Dodgers a 5-2 win over the San Diego Padres on Sunday.",
        "\"I was just looking for something that was hittable. ... I didn't really think I got it, to be honest,\" Outman said of his homer. \"It was an important series for us.\"The Dodgers won two of three games in the series in the first meeting between the teams since the Padres stunned Los Angeles in the NL Division Series in October.With the Padres leading 2-1, San Diego reliever Josh Hader got two outs before Betts homered over the left-center field fence to tie the game.\"I wasn't sure what was going to happen. As I saw him (Padres left-fielder Juan Soto) running I thought it had a chance and fortunately it went over,\" Betts said of his game-tying home run. \"He (Hader) threw it over the plate and I was able to just put a good swing on it. That was a tough at-bat.\"In the 10th, Michael Busch drove in the go-ahead run ahead of Outman's shot.",
        "\"Just trying to be aggressive and put the ball in play,\" Busch said of his game-winning hit. \"There is nothing like it, it is pretty sweet to help this team get a win, especially in a place like this, where it is tough to win.\"Dodgers reliever Caleb Ferguson (2-0) earned the win and Evan Phillips earned his fifth save with a scoreless 10th inning. Brent Honeywell (2-1), who pitched the 10th inning for San Diego, took the loss.",
        "Manny Machado had three hits and an RBI for the Padres. Fernando Tatis Jr. had a double and made a spectacular sliding catch in the second inning to rob Max Muncy of a hit.Padres starter Joe Musgrove was sharper in his third start of the season then his first two starts. He gave up one run and three hits in five innings while striking out five.The Dodgers knocked him out in the sixth after Will Smith doubled to drive in Freddie Freeman, who reached second on a two-base error by San Diego left fielder Juan Soto.Padres´ relievers Tim Hill and Steven Wilson combined for the three outs in the inning without allowing the tying Dodgers run. The Padres slim held up until the fateful ninth inning.The Padres jumped on Dodgers starter Julio Urias in the first inning. Tatis and Machado hit consecutive doubles to give San Diego a 1-0 lead. Later in the inning, Xander Bogaerts hit a ball up against the wall in right-field that Betts got his glove on but could not haul in for a 2-0 San Diego lead.The Padres slim lead held up until the fateful ninth inning.\"I mean, it´s baseball, right? I think I made, you know, obviously one mistake, but getting behind as well,\" Hader said of the Betts homer. \"You don´t put yourself in a good favor when you fall behind to a good hitter like that.\"",
        "Padres manager Bob Melvin concurred: \"It´s gonna happen sometimes. Hader´s been absolutely fantastic, and he had one more out to get, and Mookie Betts is a tough customer.\"SOUTHERN CALIFORNIA RIVALRYThe last time the Padres won a regular season home series against the Dodgers at Petco Park was when they swept them in three games from June 21-23, 2021. Since then, San Diego has lost all four series versus Los Angeles. In the regular season since August 24, 2021, the Padres have gone (6-25) against the Dodgers.UP NEXTDodgers: RHP Tony Gonsolin (0-0, 3.38) takes the hill to start a three-game series on Monday night at the Milwaukee Brewers.Padres: RHP Michael Wacha (2-1, 5.46) opens a three-game series on Tuesday night at the Minnesota Twins.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}