{
    "articleURL": "/wires/reuters/article-12059099/MORNING-BID-Debt-ceiling-countdown.html",
    "content": [
        "May 8 (Reuters) - A look at the day ahead in U.S. and global markets from Amanda Cooper.",
        "U.S. Treasury Secretary Janet Yellen didn't pull any punches on Sunday when she said failure to resolve the impasse over the debt ceiling in time could trigger a \"constitutional crisis\". And not just that. The last time there was a major showdown over the debt limit in 2011, it cost the United States its prized triple-A credit rating. A repeat would call the federal government's creditworthiness into question, Yellen says.Scope Ratings, which is seen as the leading European credit rating agency, on Friday said it had placed the United States' AA long-term issuer rating under review for a possible downgrade.This is the last full week lawmakers in Washington have to hash out an agreement. According to the legislative calendar, there are only six days this month when the House and the Senate are in session when President Joe Biden is in Washington.Biden, who meets congressional leaders on Tuesday, last week sharply criticized \"MAGA\" Republicans for their refusal to vote in a higher federal debt ceiling, signalling that there would be little compromise on May 9.\"The last thing this country needs ... is a manufactured crisis,\" he said.Most analysts believe there will be a resolution to the crisis in time, but markets show investors are not taking any chances. The cost of insuring against the risk of a U.S. sovereign default has soared to its highest since at least 2011 and is on a par with that of China, according to data from S&amp;amp;P Global Market Intelligence.",
        "The yield on a one-month T-bill, which matures roughly around the time of the deadline, is now at its furthest above that on the benchmark 10-year Treasury note in at least 20 years, showing the premium that investors now demand to hold very short-term U.S. debt.Monthly payrolls data on Friday, which showed the U.S. economy created far more jobs than expected last month, is adding to the case for the Federal Reserve to keep interest rates higher for longer.Five hundred basis points worth of interest-rate rises in just over a year and the hottest inflation in decades have put the strength of the U.S. economy, and its banking system in particular, to the test.The collapse of three mid-tier lenders in a few weeks has severely shaken consumer and investor faith. So Monday's Federal Reserve's Senior Loan Officer Opinion Survey is likely to attract a lot more attention than usual.The 'SLOOS', which includes up to 80 large domestic banks and 24 U.S. branches and agencies of foreign banks, will show the extent to which lenders say credit has tightened in the first quarter of the year.Goldman Sachs says it expects to see 60.2% of respondents reporting a tightening in lending standards, which the bank says is \"a level tighter than the dot-com crisis but less extreme than during the financial crisis or the height of the pandemic\".",
        "Key developments that could provide more direction to U.S. markets later on Monday:* March wholesale inventories* Three and six-month Treasury bill auctions* KKR &amp;amp; Co. Q1 earnings* PayPal Q1 earnings(Reporting by Amanda Cooper; Editing by Ed Osmond)"
    ]
}