{
    "articleURL": "/wires/reuters/article-12051533/Former-Mets-All-Star-RHP-Matt-Harvey-announces-retirement.html",
    "content": [
        "Former New York Mets right-hander Matt Harvey announced his retirement from Major League Baseball on Friday.",
        "Harvey, 34, admitted that he relished his time with New York after beginning his career with the Mets in 2012. In fact, he shared a photo from an April 2013 appearance with the club in his Instagram post.\"To the fans and most importantly NY Mets fans: you made a dream come true for me,\" Harvey wrote. \"A dream I never could have thought to be true. Who would have thought a kid from Mystic, CT could be able to play in the greatest city in the world, his hometown. You are forever embedded in my heart.\"Dubbed \"The Dark Knight,\" Harvey quickly became a tabloid star in New York due to his love of the nightlife.Harvey returned from Tommy John surgery in 2014 to help New York win the National League pennant in 2015. His career effectively went south from there, however, as he struggled in 2016 and 2017 before the Mets traded him to the Cincinnati Reds in 2018. He also pitched for the Kansas City Royals, Los Angeles Angels and Baltimore Orioles before last pitching in the majors in 2021.\"With all the amazing memories came a lot of injuries and tough times,\" Harvey wrote. \"The realization that those amazingly powerful moments that make me thrive as a pitcher and help my teammates and city win are no longer possible.",
        "\"Believe me I wish I could have done more and brought more of those amazing moments back to life. I have to say this is my time to say thank you, and goodbye.\"Harvey was suspended 60 games by Major League Baseball at the start of the 2022 season for distributing a prohibited drug of abuse in violation of MLB's drug program.Harvey was one of four players to testify in federal court in February 2022 that former Angels communications director Eric Kay provided drugs that contributed to the death of Tyler Skaggs. Kay was later found guilty on charges of drug distribution and drug conspiracy.An All-Star in 2013, Harvey posted a 50-66 record with a 4.42 ERA in 180 career games (172 starts) with the Mets, Reds, Angels, Royals and Orioles.--Field Level Media"
    ]
}