{
    "articleURL": "/wires/ap/article-12049273/Britain-start-free-trade-New-Zealand-Australia.html",
    "content": [
        "WELLINGTON, New Zealand (AP) - Britain's free trade agreements with New Zealand and Australia will come into force by the end of this month, the leaders from the three nations said Friday.",
        "The announcement came while the prime ministers from the two Southern Hemisphere nations are in London for the coronation of King Charles III.The deals are part of Britain's efforts to expand its economic ties after it left the European Union. Both deals were first agreed to in 2021.New Zealand officials say its deal will help boost sales of products like wine, butter, beef and honey, and will increase the size of its economy by up to 1 billion New Zealand dollars ($629 million).New Zealand Prime Minister Chris Hipkins said it was a gold-standard agreement.\"The market access outcomes are among the very best New Zealand has secured in any trade deal,\" Hipkins said in a statement.",
        "British Prime Minister Rishi Sunak said the deal with New Zealand reflected the close relationship between the nations.\"This deal will unlock new opportunities for businesses and investors across New Zealand and the United Kingdom, drive growth, boost jobs, and, most importantly, build a more prosperous future for the next generation,\" Sunak said in a statement.Australian Prime Minister Anthony Albanese said it would mean more market access for its exporters.\"So for beef, for our sheep products, for our seafood, for our other products it will mean much greater access to the British market,\" Albanese told the Australian Broadcasting Corp. in an interview.",
        "Albanese said it would also mean greater access for younger Australians to work in Britain and vice versa after the terms of a working holiday arrangement were expanded.A similar scheme between New Zealand and Britain has also been expanded, increasing the length of working visas from two years to three years and the maximum eligible age from 30 to 35."
    ]
}