{
    "articleURL": "/femail/real-life/article-12045339/Astrologer-Rose-Smith-says-UK-King-Charles-III-Coronation-date-wrong-mercury-retrograde-eclipse.html",
    "content": [
        "Astrologer warns royal family about 'unfortunate' coronation dateRose Smith said the date of the eclipse was a 'bad omen' An astrologer fears the Royal Family's decision to schedule King Charles III's coronation on May 6 could lead to a 'troubled reign'.",
        "Rose Smith claims the combinations of Mercury and Pluto in retrograde, a full moon in Scorpio and a lunar eclipse on the coronation date is 'bad news'.Speaking to FEMAIL the intuitive astrologer claimed the placement of the stars could foretell a shortened reign or abdication.'Eclipses can result in unforeseen events, surprise revelations, and can traditionally be a bad omen,' she said.She also warned that such a significant event at this time could lead to changes in the 'collective psyche and emotional landscape' around the United Kingdom.'King Charles is going to be torn between what he wants to do versus what he has to do for the country,' Ms Smith said.",
        "'He will be under pressure to abdicate. Or, he will radically transform the monarchy to something that works for him.'The astrologist revealed that Babylonian scholars believed eclipses could predict a king's well-being or even his death.The astrologer said eclipses also uncover secrets.'This eclipse is in Scorpio – the most secretive sign of the Zodiac,' she said. 'I wouldn't be surprised if all of a sudden unknown information surfaced from within the Royal family.'King Charles is a Scorpio, so will be more strongly affected by the full moon and lunar eclipse energy. she explained.'A lunar eclipse in Scorpio in the fourth house of King Charles III's natal chart is a highly intense and transformative event. The fourth house is associated with family, home, roots, and emotions - and Scorpio is a sign that's associated with deep psychological and emotional intensity, transformation, and power.'",
        "The coronation ceremony is an initiation rite during which the monarch of the United Kingdom is formally invested with regalia and crowned at Westminster Abbey.It usually takes place several months after the death of the previous monarch so as to not interrupt a mourning period.The timing of a coronation has varied throughout history, with King Edgar being crowned 15 years after his accession in 957.Based on tradition in the eighteenth and nineteenth century, monarchs typically let at lease one year pass between their accession and coronation.King Charles III’s coronation date was announced in October 2022, and Buckingham Palace set the date to ensure there was a sufficient amount of time to mourn Queen Elizabeth II.The date was agreed upon by the Royal household, the Church of England, and the British government.King Charles III might have a special reason for the date as it coincides with the late Princess Margaret's wedding anniversary and Prince Archie's birthday.",
        "Ms Smith said the lunar eclipse moon in Scorpio is opposite Uranus and the sun will bring intense upheaval and changes in King Charles' public life and kingship.'This will cause strong emotional conflict, especially at home and with his family,' she said.'The Uranus and the Sun opposition signals an intense push-pull – so some kind of blow-up may be afoot, even a rebellious or revolutionary one. An independent revolt of some kind will probably be on King Charles's mind.'",
        "Ms Smith said that, as an astrologer, she wouldn't have chosen this day as it 'doesn't have sufficient useful energy to aid a kingship'.'I don't believe he has a strong constitution. Trouble could be brewing, and it will be a time of intense emotion.'The astrologist predicted that May 6 could be a time of endings, closures, and deep emotional releases related to the Royal family.",
        "Ms Smith also warned that Mercury being in retrograde signalled intense delays.'Mercury rules communication, travel, messages and electrical devices. These can be thrown into havoc during a retrograde, and miscommunication and misunderstandings are common.''As King Charles has a fixed sign Scorpio sun, he will likely be affected by miscommunications and misunderstandings, not only regarding his coronation, but moving forward as well.''Travel plans and important legal documents (such as coronation documents) are also likely to be similarly affected.'Pluto, the planet of power, control and permanent change, also recently moved into the Aquarius sign for the first time in more than 250 years.On May 1, 2023, Pluto started its retrograde back into the sign of Capricorn, and it won't return to Aquarius until January 2024.Ms Smith said of particular historical note, the American and French revolutions, the beginning of the Industrial Revolution, and the establishment of the Church of England by King Henry VIII, all coincided with Pluto being in the sign of Aquarius."
    ]
}