{
    "articleURL": "/news/article-12052599/Alex-Jones-heard-berating-ex-wife-Kelly-2009-clip-reminiscent-Steven-Crowder-video.html",
    "content": [
        "In a chilling, 2009 audio clip obtained by DailyMail.com, Alex Jones can be heard chiding ex-wife Kelly and threatening to get himself another familyIt comes after shocking video was leaked featuring fellow political commentator Steven Crowder berating his eight-months-pregnant wife Hilary Speaking to DailyMail.com, Kelly, who divorced the Infowars founder in 2015, said the footage was all too familiar and said she endured similar treatment Calling her 'trashy' and a liar, yelling that he hates her, and chiding her for being 'decadent': this is disgraced Infowars boss Alex Jones caught on tape berating his ex-wife Kelly while she tells him she forgives him and begs him to be nice to her.",
        "The six-minute clip, obtained exclusively by DailyMail.com, was recorded in November 2009 and began with an argument over the whereabouts of an iPhone.In the chilling audio, Jones can be heard criticizing his then-wife's parents before threatening her with 'consequences' and telling her he's going to get himself another family.Kelly – now Kelly Nichols – says she was ill with pneumonia at the time. On the tape she attempts to remonstrate with her husband but he continues to rant while screaming that she has to 'stop kicking me around'.",
        "The couple eventually divorced six years later, in March 2015, while custody of their three children was settled after a jury trial in 2017.Although both have since remarried, Kelly, 54, says she is still trapped in a legal battle with Jones over his failure to pay $2,000-a-month child support or contribute to medical expenses for their youngest daughter, a 15-year-old who lives with her mother.Jones, 49, has pleaded poverty after two courts ordered him to pay nearly $1.5 billion to parents of children killed in the 2012 Sandy Hook school shooting. Last year he filed for bankruptcy, claiming he had assets of up to $10 million but debts of up to $10 billion. Kelly says 'vindictive' Jones has hit her with repeated motions and amendments to keep her locked in litigation – and that she has been forced to remortgage her home to pay the legal fees as a result.",
        "The harrowing tape bears a striking resemblance to the bombshell Ring footage featuring alt-right political commentator Steven Crowder berating his eight-months-pregnant wife Hilary that was leaked late last month. In the clip, Crowder, 35, can be heard telling her to 'f***ing watch it' before accusing her of 'refusing to do wifely things' and telling her he doesn't love her.Her family released a statement after the clip emerged and said she had been hiding his 'mentally and emotionally abusive behavior' from her loved ones.Speaking exclusively to DailyMail.com, Kelly said the footage was all too familiar and said she endured similar treatment at the hands of Jones – who appeared on last Wednesday's edition of Louder with Crowder to discuss what he described as 'a Slavic civil war' between Russia and Ukraine.She told DailyMail.com: 'I've watched the horrible video of Steven Crowder gaslighting and threatening his wife, Hilary, while she was pregnant.'I've also watched Steven Crowder's terrible spin where he uses authoritarian and alt-right dog whistles to describe his wife. You can watch Steven Crowder abusing his wife and threatening her, talking to her like she is his property, and gaslighting her – then his response is to project the abuse on to Hilary.'",
        "She added: 'Crowder is using his massive, powerful, and dangerous platform to defame Hilary, while playing to the basest of his audience's misogynistic and bully proclivities.",
        "'These are similar tactics to those used by Alex and his attorneys, who appeared on Infowars to defame me after I prevailed in a jury trial.'The result was I was harassed and stalked for years, and still am, including at my home as recently as last month by a stranger who yelled about me about how 'great' Alex is.'Kelly has previously told DailyMail.com how she had wanted to leave the marriage in 2005 but said it took a decade for her to pluck up the courage to go.She also told how Jones would routinely belittle her and, she claims, sometimes be physically violent – and would also scream and shout at her in front of their three children.Jones did not respond to a request for comment.  'He definitely had no problem being angry and upset with me in front of them,' Kelly said. 'He made me feel worthless and isolated me from friends and family and tore me down as a person.'Alex, by the end of the relationship, was calling me things like Dairy Queen – DQ – in reference to my weight.'But at the beginning, it was more like, your friends don't like you, your family doesn't care about you, they're all crazy.'He's like a professional programmer, he's an influencer, he's a manipulator. I was an accomplished person but in isolation and with constant attacks on your person…",
        "'He made me believe I didn't understand what was going on.'",
        "Life with Jones involved never traveling by air because he 'was paranoid about TSA' and family vacations taken on a tour bus with regular stops to make clips for Infowars.Although she was awarded custody of all three children, son Rex, 22, and older daughter Charlotte, 19, now live with Jones.Their mother says the Infowars boss has complicated their relationship by telling them that she is 'being investigated for terrorism by the FBI' and threatening to cut them off if they cross him.She added: 'He controls all their communications. He locks their cellphones up in a safe.'He's telling them direct lies about me such as when one of my children asked me if I'd been investigated by the FBI for terrorism, for bombing and I was like, no. it's as overt as that.'There's no privacy. They have to line up and it is complete coercive control. I told my daughter I would protect her and she said he's a powerful man who can influence minds. It's terrible.'Kelly says she now fears for the future of Hilary Crowder, 36, and her one-year-old twins and says her experience of slugging it out in the family courts shows just how difficult it can be. ",
        "'It makes perfect sense that overt abusers like Crowder and my ex, Alex Jones would join forces on the tails of the tragic revelations from Hilary Crowder's leaked video,' Kelly added. 'Men like Crowder and Alex are overtly misogynistic and love playing the 'victim' when they are the perps, and a lot of their sick audience eats it up. I would wager that Alex had Crowder on fast dial when the video was leaked and helped Crowder with his spin. ",
        "'They are two carrion bully birds of a feather, and they use their fake news like a weapon: to inspire hate, fear, and misogyny and keep ahold of the money they make misleading and endangering America.' Crowder, whose wife filed for divorce in 2021, has already threatened to unseal their divorce papers and make Hilary's confidential medical records public. Kelly said Jones used similar tactics to silence her – including endless motions in court and regularly disparaging her to his army of fans on Infowars.She told DailyMail.com: 'The support available is scant, the attorneys that file or defend litigation for abusers are many, and they have no problem doing what they do, which they know destroys kids' and moms' lives.'Family court is the opposite of what you likely believe it is. I think Hilary was very brave in the video and I know that she can prevail personally by reclaiming her power, which I know she is trying to do by divorcing the monster, Steven Crowder.'",
        "Kelly added: 'I'm not a lawyer, and I can't offer legal advice, but if I were Hilary, I'd try a new path and sue for defamation and harassment.'I'd also cut to the chase and demand the dissolution of my marriage and property and sole custody right away. In my experience, attorneys on both sides will just run up the fees.'It's clear that Steven Crowder is a sick man and an abuser: you don't need to pay 'experts' and attorneys millions of dollars to see what is already clear online.'I'm very moved by America's support of Hilary Crowder, and I hope people will stay focused on her truth and learn a little bit more about the machinations of our broken family court system.'"
    ]
}