{
    "articleURL": "/sport/nfl/article-12051279/Travis-Kelce-says-people-f-ing-ill-think-hed-chug-real-Lombardi-trophy.html",
    "content": [
        "The Chiefs tight end performed the audacious act during NFL Draft weekendThe 33-year-old's brother, Jason, also chugged in front of fans that weekend DailyMail.com provides all the latest international sports news Super Bowl LVII champion Travis Kelce has sensationally claimed that people 'are absolutely f***ing ill' if they think he'd have chugged beer out of the real Lombardy trophy before spiking it. ",
        "During NFL Draft weekend in Kansas City, the tight end was on stage with some of the music industry's biggest names, including Rick Ross and Machine Gun Kelly for his 'Kelce Jam' festival.He brought the energy to the party by cracking open a canned tequila soda cocktail before drinking it off of what appeared to be a replica of the Lombardi Trophy in front of thousands of festival goers.The 33-year-old's final act on stage was to slam the NFL trophy into the ground as well as the soda can, stunning the audience in the process. On Thursday, the two-time Super Bowl champion addressed the wild moment with his brother Jason on their popular 'New Heights' podcast.",
        "'You just talked about Pat [Mahomes] handing you the trophy at the draft...,' Jason initially told his younger brother of two years, who chuckled and reminisced for a second before replying 'Haha hell yeah, let's get to the good stuff.' 'You took that trophy, went straight to the Kelce Jam...,' then said Jason before Travis intervened, knowing exactly what his older brother about to bring up. 'No, no 'f***ing way.' 'Well we got video proof and we're gonna play it right now...,' Jason added before showing a clip of the Chiefs tight end on stage during the first weekend of May and telling his brother: 'There's the footage of you desecrating a historied trophy of the NFL in more ways than one... how did it feel to slam an icon?'",
        "'The people are absolutely f***ing ill if you think I would ever disrespect the actual Lombardi trophy like that,' Travis responded. 'Travis you would definitely disrespect the Lombardi trophy,' Jason chimed in. '1000 percent a replica of it, ok...I have way too much respect for the game and the history of the game...' Travis added.Despite criticizing his younger brother, Jason also joined in on the beer-chugging action during the 2023 Draft, showing his delight at the Eagles picking ex-Georgia Bulldog Jalen Carter as its new defensive tackle (DT) in late April.He was seen raising a pint to Eagles fans in Kansas City, where this year's draft took place, saying 'Yes sir!', before immediately starting to chug. The six-time Pro Bowler was done with his beer in less than three seconds before raising his hands in the air out of excitement, celebrating the latest addition to his team's roster with fans."
    ]
}