{
    "articleURL": "/sport/football/article-12038267/Diogo-Jota-gave-apology-Oliver-Skipp-Liverpool-tunnel.html",
    "content": [
        "Diogo Jota caught Skipp in the face, drawing blood, with a dangerous challengeBut the Reds striker showed his remorse in the tunnel after the Anfield clash Having not been sent off Jota scored the winner for Liverpool in a 4-3 victoryDiogo Jota has apologised to Oliver Skipp after his high foot during Liverpool's dramatic late win against Tottenham on Sunday drew blood from the midfielder.",
        "The Reds striker was incredibly fortunate not to be sent off for dangerous play as he raised his foot while Skipp was leaning in with his head to nod away the ball as they competed for possession.Spurs were left seething at the injustice they suffered following the 81st minute foul, with Jota then going on to score a dramatic winning goal in stoppage time to seal a 4-3 victory.But footage from Liverpool's official YouTube channel showed Jota apologising to Skipp in the Anfield tunnel immediately after the Premier League clash following the incident that left Skipp needing stitches.The Spurs star was carrying his boots while walking in the opposite direction to Jota before the latter reaches out for a handshake having held his hands together in a sign of initial apology.",
        "Jota's Reds team-mate Trent Alexander-Arnold, walking close by, also reaches out with a sporting slap to Skipp's arm as Jota says 'no intention', for the high foot, and 'sorry'.Following the brief embrace the pair then walk off in opposite directions once more.While Skipp appeared to accept Jota's apology, Tottenham interim boss Ryan Mason was furious with the decision not to send Jota off.Spurs had come back from 3-0 down to equalise in stoppage time through Richarlison, only for Jota to then grab the winning goal just 99 seconds later in the fourth minute of added time.",
        "‘It was a big decision, a crucial decision and one you can’t really miss. I find it hard and impossible to really understand why,’ Mason said.",
        "‘It's decided the game… I can understand referees and officials on the pitch missing it – even though my feeling was an instant red card because when your studs are showing and you're five-and-a-half feet off the ground, and make contact with a player's head, and draw blood, and there is a gash, I think it ticks all the boxes.'Probably more so an experienced referee in the VAR room (David Coote), you want him to help the official on the pitch in that moment.’But Liverpool boss Jurgen Klopp defended Jota, insisting he meant no malice, and suggested Mason’s focus should be elsewhere.‘We got a red card for a similar situation, that’s true, but Diogo was not at all intentional - he didn’t see the head and went then with the foot. The foot was high and Skipp went with the head there. That can happen. If he gives a red card, we cannot change that. That’s how it is. I really think Ryan has other things to worry about.’ ",
        "Jamie Redknapp, who played for both clubs, however, disagreed with Klopp.'I think it is a red card you’re endangering the opponent and that’s the letter of the law,' he said on Sky Sports. 'And to compound it that’s the man who scores the winning goal.",
        "'You can understand why he [Mason] is furious about it, and you can see it is a nasty challenge.'I don’t think he [Jota] is that sort of player. He doesn’t mean to hurt anybody but when you put your foot that high, you can see, it’s a nasty gash as well he gets and for me that’s a red card.'"
    ]
}