{
    "articleURL": "/tvshowbiz/article-12055975/Chris-Brown-Usher-perform-Lovers-Friends-music-festival.html",
    "content": [
        "Chris Brown performed at the Lovers &amp; Friends festival in Las Vegas, Nevada on Saturday.",
        "The R&amp;B singer — who celebrated his 34th birthday the day before and ended off the night by getting into a brawl with Usher, 44 — seemed to be in good spirits as he took the stage.The Look At Me Now songwriter appeared unscathed considering he had gotten into an alleged altercation with his longtime friend the night before at his roller rink party.As he performed ahead of Usher at the one-day festival, he showed off the ink adorning his body in an all-white baseball jersey and cutoff sweat shorts.Other R&amp;B and hip-hop artists who took the stage at the festival include: Da Brat, Lil' Kim, Jhene Aiko, Boyz II Men, Pitbull, Nelly, and Miguel.",
        "The F.A.M.E. hitmaker looked casual and cool in the all-white outfit that he teamed with a navy Los Angeles Dodgers baseball cap.His bright blue hair peeked out from underneath the hat with an upside down logo.He also sported tall, white socks as well as crisp white sneakers adorned with black laces and trim.The Grammy winner further accessorized with gold-framed round glasses as well as layers of gold chains with colorful charms around his neck.He also wore chunky gold chain bracelets and eye-catching diamond stud earrings. Usher looked effortlessly stylish decked out in an all-black, leather ensemble as he took the stage at the festival. ",
        "He donned an oversized leather jacket teamed with the matching black pants and leather gloves. As he performed, he also modeled a pair of oval-shaped and black-framed sunglasses. ",
        "The Confessions hitmaker left the top half of his jacket unbuttoned to show off his many eye-catching jewelry pieces on his neck.The eight-time Grammy winner accessorized with various chains adorned with diamonds and cross pendants.Despite reports that Usher and Chris got into a violent altercation last night, he appeared to be unwounded and did not have a 'broken nose'.While hosting his friend's birthday party, insiders said Usher stepped in when Chris was 'intoxicated' and being 'disrespectful' to Teyana Taylor.When the actress did not respond to his advances, according to the sources, Chris started arguing with Usher. Earlier in the day at the festival, Da Brat — who is currently expecting her first child with her wife Jesseca 'Judy' Harris-Dupart, 41 — also gave a show-stopping performance.At one point, the 49-year-old rapper was also seen showing PDA and giving a quick kiss to her partner.The Funkdafied hitmaker showed off her baby bump in a Chicago Bulls jersey with a cutout in the middle as her wife watched at the side of the stage. ",
        "The soon-to-be mother matched her pregnant wife in a sultry, hooded and halter-style Valentino dress. ",
        "Da Brat was seen styled from head-to-toe in Chicago Bulls merch that was tailored to show off her growing baby bump and unique style. She donned the jersey with the matching basketball shorts over a pair of opaque black tights. The performer also accessorized with a red hat with the Bulls logo at the front. She was dazzling in a sparkling chain necklace, a diamond-encrusted watch, and her massive wedding ring. Peeking out from underneath her reddish-brown twist braids were also a pair of diamond-shaped, silver statement earrings. For makeup, she looked glamorous in a shimmering eyeshadow look and full, fluttering eyelashes. Last February, the couple announced that they were expecting their first child together. In March, they held a lavish gender reveal party and also shared that they would soon be welcoming a son together in a few months. ",
        "Lil' Kim, 48, also took the stage at the festival for an exciting stage where she performed all of her greatest hits.The rapper sported a cropped T-shirt and tight-fitting leggings to show off her toned figure.The reality TV star styled her platinum blonde tresses in loose waves that cascaded across her shoulders and down her back.For accessories, she rocked various gold and silver jewelry pieces as well as a diamond chain with her Queen Bee Entertainment logo.",
        "The same design was also emblazoned across her shirt with gold rhinestones.Jhene Aiko, 35, looked ethereal in a pair of white, flowing pants. The singer-songwriter teamed the pleated trousers with a daring halter-style top made up of brown rope and gold beads. For accessories, she donned a pair of gold, conch-shaped earrings and cat-eye sunglasses. ",
        "Boyz II Men also put on an iconic performance at the music festival.The vocal harmony group from Philadelphia — comprising of baritone Nathan Morris alongside tenors Wanyá Morris and Shawn Stockman — donned all-white matching outfits as they performed their legendary hits.In contrast, Pitbull, 42, was seen in an all-black ensemble for his performance. The rapper donned a black button-down and satin tuxedo vest underneath a leather jacket. The Timber hitmaker sported fitted black trousers and modeled his usual black sunglasses. Nelly, 48, put on a casual display in a black graphic T-shirt and the same-color cargo shorts as he performed.The Dilemma singer and rapper — who recently sparked reconciliation rumors with Ashanti 11 years after their split — donned a red baseball cap that matched the red checkered pattern on his socks.The three-time Grammy winner accessorized with layers of silver and diamond-encrusted chains around his neck and also wore a pair of stylish sneakers.",
        "Miguel, 37, put on a stylish display in a light gray, leather ensemble. The All I Want Is You singer and songwriter wore a collared vest teamed with the matching pants.50 Cent, 47, looked casual and cool in a white T-shirt with a colorful skull on the front. He donned a white flat bill cap and accessorized with lots of gold chunky chains.",
        "The Lovers &amp; Friends music festival is a throwback hip-hop and R&amp;B festival that happened for the first time last year.The event that was previously slated to be held in Los Angeles at the same venue that the L.A. Galaxy team play in.Due to the pandemic, however, the festival — originally planned to be a weekend-long affair — was postponed in both 2020 and 2021.The first-ever Lovers &amp; Friends festival was held in downtown Las Vegas in 2022, and this year, the one-day event was held Las Vegas Festival Grounds."
    ]
}