{
    "articleURL": "/news/article-12056501/QLD-crime-wave-Vigilantes-led-Torin-OBrien-homes-alleged-offenders-Rockhampton.html",
    "content": [
        "Angry mob of about 100 took justice into their own hands Vigilantes led by former One Nation candidate Torin O'Brien An angry mob of about 100 vigilantes tried to take justice into their own hands by showing up at the doorsteps of alleged thugs and demanding police take action.",
        "The group, led by kickboxer turned One Nation candidate Torin O'Brien, are fed-up with spiralling rate of crime in the Queensland town of Rockhampton.Sunday's tense demonstration targeting suspected theives and violent offenders was triggered by a spate of recent break-ins including at Ms O'Brien's sister's home in the suburb of Wandal.'There's clearly been zero leadership surrounding this crime wave of gross little ferals,' the gym owner posted online urging people to support the demonstration.'The town is angry and the police are worried… good, maybe they can feel our fear and will do more, but we all know it's the government and court system letting us down….'However, if one guy on Facebook can find literally all the info from their entire crew the police can stand side by side and demand change from the top. Stop being so gutless and take a stand WITH US.'",
        "The rally started with a meeting at 2pm with the riled-up ground marching to the homes of alleged offenders, first surrounding a house in the Norman Gardens suburb.Several people from the mob knocked on the front door and windows of the home, demanding that the occupants come outside.A juvenile inside the house was reportedly armed with a machete, though did not come out of the home.",
        "Within minutes, swarms of police arrived at the street, with one of the vigilantes sarcastically saying he had never seen the police arrive so quickly.Other members of the crowd shouted: 'You won't do your job properly'.A police officer negotiated with Mr O'Brien until about 3.30pm before the crowd moved to another suburb, Berserker, followed by police.The leaders again knocked on doors and spoke to residents, while others watched on, many filming the proceedings on their phones.",
        "The group then moved on to a third address before returning to the house they first visited in Norman Gardens.About 4pm Mr O'Brien told everyone to go home and that he would meet the police to discuss the issue in the coming days.But some people refused to leave, demanding immediate action.This led to the arrival of more police, with dogs, with more than a dozen officers and eight police vehicles at the tense scene.Police issued a 'move on' direction, effective immediately and lasting for 12 hours.The remaining 18 protestors left at that point, rather than facing getting arrested for ignoring the direction.In order to get the addresses of alleged offenders, M O'Brien had offered a $5000 reward for anyone to give up names on social media.",
        "But Mr O'Brien denies that he and the group are violent vigilantes, insisting they are just law abiding citizens who won't put up with the surging rate of crime any longer."
    ]
}