{
    "articleURL": "/sport/mlb/article-12055391/Aaron-Judge-set-return-New-York-Yankees-TUESDAY.html",
    "content": [
        "Aaron Judge has been hitting in the batting cage and running this week The star slugger is now set to return for the New York Yankees on Tuesday DailyMail.com provides all the latest international sports newsNew York slugger Aaron Judge, out since April 27 with a right hip strain, is expected to return for the Yankees' game Tuesday against the Oakland Athletics.",
        "New York manager Aaron Boone made the comment Saturday before the team's game at the Tampa Bay Rays in St. Petersburg, Fla., not far from the Yankees' minor league complex in Tampa.Judge worked out Friday and Saturday at the Tampa complex, hitting in the batting cage and running. He also shagged flyballs during the Yankees' batting practice ahead of their Friday game against the Rays.'I think he's doing really well,' Boone said. 'I think we're going to be in a good spot come Tuesday to where he's done everything for several days.'That was the calculus in this weekend,' Boone added. 'It's like, do we want to push him back out there if he's 85, 90 percent? 'I wasn't comfortable doing that just because I don't want a strain to turn into a bad situation where we're talking six, eight weeks.'",
        "Judge missed his eighth game Saturday, with Tuesday the first day he is eligible to come off the injured list. He injured the hip when sliding headfirst into third base on a caught stealing April 26 in Minnesota, then played the next night in Texas before leaving the game early with hip soreness.The 2022 American League MVP was batting .261 with six home runs and 14 RBIs through 26 games. A career .283 career hitter, Judge broke the AL home run record last season with 62 dingers and also led the majors in RBIs (131), runs (133) and slugging percentage (.686).",
        "The four-time All-Star signed a nine-year, $360 million deal to remain with New York after last season.Boone also commented on other Yankees players sidelined with injuries. Third baseman Josh Donaldson (right hamstring strain), out since April 6, has been working out with Judge. Donaldson will intensify his drills this coming week before a possible rehabilitation assignment in the minor leagues.Designated hitter Giancarlo Stanton (strained left hamstring), out since April 16, is making progress with no timetable to return.'He's doing well.' Boone said. 'I've been kind of encouraged with how his progress has gone pretty well.'Right-hander Luis Severino (low-grade lat strain) is scheduled for at least three rehab starts for Triple-A Scranton-Wilkes-Barre beginning Wednesday. Left-hander Carlos Rodon, who like Severino hasn't pitched this season, was out for a left forearm strain and now has back issues. He's scheduled to get an injection on Tuesday."
    ]
}