{
    "articleURL": "/wires/afp/article-12045645/Israel-says-killed-3-suspects-murders-UK-Israeli-women.html",
    "content": [
        "Israel said its security forces shot dead three Palestinians blamed for killing a British-Israeli woman and two of her daughters last month, in a raid in the occupied West Bank on Thursday.",
        "Two suspects in the killings and a third man accused of helping them were killed in a joint operation in Nablus by the army, police and Shin Bet security service, a statement said.Palestinian Islamist group Hamas, which controls the Gaza Strip, said all three men killed in what it termed an \"assassination\" were from its ranks, hailing them as \"heroes of resistance\".",
        "Israel had identified them as the \"murderers of Leah, Maia and Rina Dee\" who died after the April 7 attack on their vehicle near Hamra in the Jordan Valley, the Shin Bet said, using their Hebrew names.The army said troops recovered two M-16 assault rifles and an AK-47 from the apartment where the suspects were holed up.As the Israeli forces entered the city, clashes erupted with groups of Palestinians who threw stones at military vehicles.An AFP photographer heard gunfire erupt near the Old City around 7:00 am (0400 GMT) as dozens of Israeli army vehicles raced to the scene from multiple directions.",
        "The Lions' Den militant group claimed its fighters were involved in the clashes and had attacked the Israeli forces with \"bullets and explosive devices\".Huge crowds later gathered in central Nablus for the funerals of the three men, their bodies wrapped in the green flags of Hamas.",
        "- Widower 'comforted' -",
        "Israeli Prime Minister Benjamin Netanyahu hailed the successful conclusion of the weeks-long manhunt.\"We settled accounts with the murderers of Lucy, Maia and Rina Dee,\" he said in a statement.\"Our message to those who harm us, and those who want to harm us, is that whether it takes a day, a week or a month, you can be certain that we will settle accounts with you.\"Widower Leo Dee said in a statement he was \"comforted\" to hear the men had been killed, adding that he had \"asked for the opportunity to speak with the terrorists' families\".",
        "The family lives in an Israeli settlement in the West Bank, which has been occupied by Israel since the 1967 Six-Day War. All settlements are deemed illegal under international law, although Israel disputes this.The Palestinian health ministry confirmed three people had been killed in the morning raid in the Old City of Nablus.\"Two of the martyrs have completely distorted features due to the intensity of the shooting, which makes it difficult to identify them,\" the ministry said.- Huwara shooting -",
        "Hours later, in the town of Huwara, south of Nablus, a Palestinian woman was shot dead after attempting to stab an Israeli soldier, the army said.",
        "It added that a soldier was \"lightly injured\" in the alleged attack.Iman Odeh, 26, was \"killed by a bullet to the chest fired by the occupation soldiers in Huwara, south of Nablus,\" a Palestinian health ministry statement said.The Nablus raid came just days after violence flared along the Gaza border following the death of a Palestinian hunger striker in Israeli custody on Tuesday.Palestinian militants fired more than 100 rockets from Gaza in response to the death of Khader Adnan, 45, a leading figure in Islamic Jihad in the West Bank, who died in prison following an 87-day hunger strike.Israel launched tank fire and air strikes on Gaza which the army said targeted Hamas military sites, killing a Palestinian man.",
        "The latest violence brings to 106 the number of Palestinians killed in the Israeli-Palestinian conflict so far this year.Nineteen Israelis, one Ukrainian and one Italian have been killed over the same period, according to an AFP count based on official sources from the two sides.These figures include combatants as well as civilians, and, on the Israeli side, include three members of the Arab minority."
    ]
}