{
    "articleURL": "/tvshowbiz/article-12051703/Moonshiners-star-Craig-Landry-hospitalized-crashing-electric-unicycle-shattering-jaw.html",
    "content": [
        "WARNING: Graphic image below Moonshiners star Craig Landry was hospitalized after a horror electric unicycle accident shattered bones in his jaw, face and hand last month.",
        "Landry, 49, was left with serious facial injuries after the accident near his home in ear his home in New Iberia, Louisiana on April 24 - which saw him airlifted to University Medical Center in New Orleans and undergoing surgery to fix his shattered jaw.A GoFundMe launched by Landry's manager states: 'It was found that he suffered multiple broken bones to his face, jaw, hand, and broken teeth. 'We are unclear, so far, as to the extent of the injuries to the rest of his body such as his back, neck, and legs due to inflammation but doctors  scheduled him for surgery on April 28, 2023 to have his jaw wired as it is completely shattered.'His brother Richard told TMZ that Landry does not remember how the accident occurred and only recalls waking up in the ambulance, after a few women found him knocked out unconscious.",
        "Richard said he does not believe Landry was under the influence but that he does suffer from high blood pressure and may have blacked out during his ride.   Moonshiners is an American docudrama television series on the Discovery Channel  that dramatizes the life of people who produce (illegal) moonshine in the Appalachian Mountains of Kentucky, North Carolina, South Carolina, Tennessee, and Virginia. Landry has appeared on the show since 2021.",
        "Richard also revealed that Craig is now at home recovering, but still in a lot of pain and will need further facial surgeries. Craig will be unable to work for the foreseeable future while he fights to recover.The GoFundMe, which has thus far raised more than $6000, also reads: 'Anyone that has ever met Craig knows what a kind hearted, sincere, and genuine person he is. This unfortunate event is truly devastating and will effect him for years to come.",
        "'I am asking our Moonshiner’s community and all who know and love Craig to come together and help in any way possible if you can. No donation is too small and every penny will be greatly appreciated.'I will update you guys as often as possible. On behalf of Richard and Craig Landry, we thank you for your love, prayers, and support in this very scary time.'On March 4 Landry's co-star Josh Owens broke his neck, back, arm and legs in a motorcycle crash. The crash happened while the TV star was taking part in a motorcycle race at Florida's Daytona International Speedway."
    ]
}