{
    "articleURL": "/health/article-12047983/Mother-woke-pain-one-face-told-brain-tumor.html",
    "content": [
        "Andreea Vanacker, from Canada, woke up one morning with pain on her faceDoctors later diagnosed her with a brain tumor that was pressing on a nerveREAD MORE: Brain tumor signs from hearing voices to blurred vision revealedA mother-of-two who woke up with an electric shock-like pain on the right side of her face was shocked to learn brain tumor.",
        "Andreea Vanacker, from Montreal, Canada, said the feeling emerged without warning one morning and would strike every time she went to talk, laugh or even eat.Doctors said the pain was caused by a large benign tumor inside her skull pressing down on the nerve responsible for controlling facial muscles. They said its size suggested it had been growing unnoticed for at least 10 years.Ms Vanacker eventually had the tumor removed via surgery where doctors had to remove part of her skull and cut into her brain. They managed to take out the entire tumor, but she said it took a year for her to recover her strength.",
        "Ms Vanacker, who is also a CEO for management consultancy SPARKX5, was proud of her healthy lifestyle — avoiding alcohol, coffee, ensuring she exercised regularly and getting at least seven hours of sleep every night.So it came as a complete shock when she woke up one morning in July 2020 to feel a searing pain coursing down the right side of her face.'I'd always been healthy and had never experienced anything like this; I knew this was not good news,' she wrote for the Insider.",
        "Hearing voices, having blurry vision and suddenly losing interest in your hobbies are just some of the lesser-known symptoms. ",
        "'I was mainly experiencing intense pain that felt like electric shocks on the right side of my face anytime I would move my facial muscles.'She booked an online consultation for the next day — in-person appointments were difficult at this point because of the Covid pandemic — and saw a doctor who diagnosed her with trigeminal neuralgia, a chronic pain condition triggering severe facial pain.She was booked for a second appointment with a neurologist but said over the following days the pain became so bad she became afraid to even twitch her facial muscles.She also started to suffer problems with her balance, she said, making it difficult to move around.At her next appointment, doctors confirmed the diagnosis and said surgery was her only option to get rid of the tumor given its large size.But they warned the surgery was risky and in severe cases could leave patients struggling with paralysis or balance problems for the rest of their lives.'I was speechless,' she said. '[Me and my husband] decided not to tell our kids until we knew more about the risks of the surgery.'She booked appointments with several other neurologists, who all gave the same recommendation.For one she showed an MRI she had ten years ago to ask if the tumor had been present then. They said that it was but was much smaller, which likely led to it being missed.",
        "After a long search she opted to get surgery from the best neurologist in Montreal, who she met for the first time in September 2020.She described feeling 'terrified' as he described the surgery, which involved cutting out part of her skull and then getting through brain tissue to reach the tumor.But at 7am on November 9, 2020, Ms Vanacker went under the knife for a nine-hour operation to remove the whole tumor.When she came around the next day, her neurologist came to say the operation had been a success and the tumor had been removed.'How are you feeling, and can you smile at me?', he asked.She said: 'Despite the immense pain I was in, I was able to smile. I could not believe it.'I learned that he'd successfully removed the totality of the brain tumor without any damage to my facial nerve, and I was in total awe — and relief.'She then described a long road to recovery involving multiple appointments with doctors and check-ups with her neurosurgeon.It took about two months before she began to taper off her pain medications when pain in the trigeminal nerve started to recede.At five months after surgery she was also allowed to do light exercise again, before spending a year building her strength back up. Her skull still felt painful until about 18 months after the operation. ",
        "'It was one of the most challenging times of my life, and my husband and kids helped me through it,' she said.'All I want to do is live my life with joy and bring joy to others.'Ms Vanacker has shared her story to raise awareness of brain tumors and warn others of the warning signs of their presence.An estimated 700,000 Americans are living with a benign brain tumor, which is not cancerous and does not spread to other organs.But they can be slow-growing, meaning symptoms are slow to appear. Warning signs include headaches, blurry vision, losing feeling or movement in a limb and trouble with balance.Doctors will normally opt for surgery to remove the tumors, but they can also use chemotherapy or radiation therapy to kill the cells.More than 19 in 20 patients with benign brain tumors survive for more than five years after their diagnosis, data shows."
    ]
}