{
    "articleURL": "/tvshowbiz/article-12058113/Chelsea-Handler-gives-breast-exam-topless-encourages-men-vasectomies.html",
    "content": [
        "Chelsea Handler gave herself a breast exam while encouraging men to get vasectomies in a new video shared on Sunday.",
        "In the clip posted to Instagram, the 48-year-old comedian — who joking introduced herself as 'Chesty Handlerberg' — was completely topless as she protected her modesty with her hands. While giving herself a mammogram, the Fun Size actress also encouraged men to contribute to contraceptive efforts and to consider getting vasectomies.The television host wrote in her caption: 'Men, it's time to do your part.' The day before, she invited Dylan Mulvaney on her Dear Chelsea podcast to discuss the backlash the transgender influencer faced following her partnership with Bud Light.",
        "The clip began with Handler sitting in bed and wearing nothing else except various pieces of dainty, gold jewelry. The producer started by saying: 'Oh hello, it's me, Chesty Handlerberg. You caught me giving myself a mammogram. All good, you two?'She then continued: 'As a women with natural breasts — not that that has anything to do with this — it is time to explore vasectomies.'The author explained that women have always been the ones bearing the burden of sexual responsibility.'Since the beginning of time, women have been ducking and diving and dodging pregnancy face first or pikachu first and, frankly, they're exhausted,' she added.'We've had to listen to men say things like, \"Girl, but using a condom doesn't feel so good\" or \"can't you just take birth control?\" Or \"oops, I forgot to pull out\". Enough, you little horny little pigs in blankets,' she said.",
        "Handler then talked about the types of contraceptives used by women and the negative side effects they come with.'Do you know how painful it is to get an IUD placed? It feels like a mouse trap in your uterus. And sometimes those things don't even catch all the mice,' she said.",
        "'And birth control? You think I want to be an adult woman with acne? Or have mood swings? Or get a period so heavy it feels like a hoover dam just broke? I don't,' she added. Then, she went on to express that women should not be responsible for all of the contraceptive efforts and said more men should be getting vasectomies.'Everybody already hates women enough, I don't need my insides to join in on the fun,' she added. 'Women are tired of making concessions for men — especially in the bedroom.'We have already been through enough letting you wear socks while you penetrate us,' she continued. 'So, man up, men, and if you can't do that, enjoy the company of your hand.'Vasectomies,' she said animatedly as if narrating a commercial. 'One snip and that's it.'"
    ]
}