{
    "articleURL": "/tvshowbiz/article-12046553/How-watch-King-Charles-IIIs-Coronation-Australia.html",
    "content": [
        "Millions of people around the globe will tune in to watch King Charles III and Queen Consort Camilla be crowned at Westminster Abbey in London on Saturday.",
        "All the pomp and splendor will start at 7.30pm with the King's procession to Westminster Abbey. The Coronation will begin at 8pm. Daily Mail Australia reveals where Australian can watch the televised ceremony in what's being dubbed 'the event of the century'. ",
        "Channel SevenFrom 4pm: Longtime journalist Michael Usher and former BBC royal correspondent Angela Rippon live from London along with David Koch. The coverage will continue Monday with live crosses to the Coronation Concert at Windsor Castle from 5.30am. At 7.30pm, an encore screening on 7 and 7Plus. Channel Nine From 5pm: Ally Langdon and Peter Overton will be joined by royal confidant Dickie Arbiter and commentator Camilla Tominey at Westminster. From 7.30pm: Switch to BBC coverage. Channel TenFrom 4.30pm: National Affairs editor Hugh Riminton will be joined by UK correspondent Johnpaul Gonzo live in London.ABC From 5pm: The Drum journalist Julia Baird will lead a panel including Jeremy Fernandez and presenter Stan Grant. The panel will also include republican movement co-chair Craig Foster and writer Kathy Lette. From 7.30pm, it will play the BBC's coverage live from London. SBSSunday, 9.30pm: Kristy Young will host a highlight package with guests as they talk through the ceremony and concert. ",
        "Having ascended to the throne in September 2022, following the death of Queen Elizabeth II, King Charles III is set to officially be crowned as the reigning monarch of the United Kingdom.",
        "It will be the first coronation of a British monarch in well over half a century, after the late Queen enjoyed a 70-year reign.Huge crowds are expected to line the streets of London to catch a glimpse of the royals, with the most ardent already camped out on The Mall."
    ]
}