{
    "articleURL": "/wires/aap/article-12045675/Force-turn-Sevens-playmaker-Burey-against-Crusaders.html",
    "content": [
        "The Western Force have turned to unheralded playmaker Max Burey as they embark on what's traditionally the toughest club challenge in world rugby, and the 24-year-old is taking it all in his stride.",
        "Burey, who featured for the Australian Sevens team in Singapore and Hong Kong last month, has been named at five-eighth for Saturday's Super Rugby Pacific clash with the Crusaders in Christchurch.The Wagga product has endured a hectic few weeks, flying back and forth across Australia to play club rugby in Sydney and train with the Force in Perth during the week.His efforts have paid off, with a knee injury to Bryce Hegarty in last week's loss to Queensland opening the door for Burey to get his Super Rugby debut against the Crusaders.Taking on the Crusaders on enemy territory should be a daunting task - but not for the laid-back Burey.\"They're a pretty big-name team, they've got a lot of stars,\" Burey told reporters on Thursday.\"But for me, what better way to challenge yourself and see where you're at.\"I'm a pretty relaxed sort of guy - just kick the feet up, and when it's time to flick the switch, I'm pretty confident I can do it.\"Not to dwell on the things too much, just get into it and put your shoulder through someone.\"Burey, who made his Sevens debut for Australia last year, sees his future in the 15s form of the game, and he knows a strong display for the Force could open doors for a permanent Super Rugby deal.",
        "\"It's definitely a good opportunity for me,\" he said.\"How I perform will dictate my future, but I'm not too fazed by that.\"I'm pretty happy with sitting at the pub telling blokes I used to play on that TV.\"Force forwards coach Jimmy Duffy, who stepped in for the ill Simon Cron to front the media on Thursday, is confident the big occasion won't ruffle Burey.\"What I've observed is that every time he gave a command to the group, forwards or backs, there was an action that followed pretty quickly,\" Duffy said.\"That's a huge part of being in that role.\"The Force will also unleash former Wallabies enforcer Isi Naisarani against the Crusaders.Naisarani signed for the Force last month following his stint in Japan, and he will be heavily relied upon as the team attempt to pull off a massive upset.The 10th-placed Force (3-6) are yet to win on the road this season, and they face a Crusaders outfit who will be desperate to bounce back from last week's 34-24 loss to the ladder-leading Chiefs.The Crusaders (6-3) have been bolstered by the return of All Blacks star Will Jordan, who has recovered from a migraine-related condition that had grounded him since last September."
    ]
}