{
    "articleURL": "/wires/reuters/article-12052601/Warriors-look-improve-road-mark-Lakers-Game-3.html",
    "content": [
        "The defending champion Golden State Warriors have regained their edge and now hit the road, which is not as intimidating of an endeavor as it once was.",
        "The Warriors evened their Western Conference semifinal series against the Los Angeles Lakers at a game each after a convincing 127-100 victory in Game 2, with the matchup now headed south for Game 3 on Saturday.The No. 7-seed Lakers showed their fortitude in Game 1, leaning on stars Anthony Davis and LeBron James for a 117-112 victory. But it was the Warriors' stars who were on display Thursday as Klay Thompson made eight 3-pointers on his way to 30 points and Stephen Curry added 20 points and 12 assists.Shooting from distance is what the Warriors do, with the team going 21 of 42 from 3-point range (50 percent) in a rate that was vastly improved on their 21-of-53 performance (39.6 percent) in the series opener. The 42 made 3-pointers through the first two games of playoff series is an NBA record.\"I would say I relaxed a little bit more,\" Thompson said after his 9-for-25 overall shooting performance in Game 1. \"I was not happy with my Game 1 performance. Shot the ball very inefficiently. Probably rushed some shots, and (Thursday) I just let it come to me, and I was telling myself to stay patient and it paid dividends.\"Now comes a road game following a regular season when the Warriors won just 11 times away from their building. But they won a pair of road games in their first-round series against the Sacramento Kings, including the Game 7 clincher.",
        "\"They are going home for Game 3,\" said Curry, who played through foul trouble and a double-team defense in Game 2. \"They are probably going to be energized and rejuvenated there, so we have to show up there with the same mentality that we had (Thursday) and not expect that fatigue is going to be a factor at all in the series.\"The Lakers received 30 points and 23 rebounds in a dominating Game 1 performance from Davis, but he was held to 11 points on 5-of-11 shooting in Game 2 and had just seven rebounds. James scored 23 points, while Rui Hachimura added 21 off the bench.\"I took all the same shots I took in Game 1; I just missed them: elbow jumpers, pocket passes to the floater, same exact looks,\" Davis said. \"I didn't shoot no shot that I didn't shoot in Game 1. Just missed them. That's all.\"The Lakers led 33-26 after one quarter, but the Warriors took control with a 41-point second quarter, then made a statement with 43 in the third quarter.\"We're still the best defensive team in the league, if not one of them, so that doesn't change,\" James said. .\".. You give credit where credit is due. We move on to the next game. But our defense, that's where we hang our hat. That doesn't stop no matter who we're playing against.\"",
        "The Lakers are trying to follow a similar pattern to their first-round series victory over the Memphis Grizzlies. Los Angeles won the series opener on the road, lost Game 2 and came home to take a commanding 3-1 series lead with a pair of victories.--Field Level Media"
    ]
}