{
    "articleURL": "/wires/reuters/article-12050707/Exchange-operator-Cboe-profit-rises-market-volatility-lifts-trading-volumes.html",
    "content": [
        "By Siddarth S and John McCrank",
        "May 5 (Reuters) - Cboe Global Markets on Friday reported first-quarter profit above Wall Street expectations, as the exchange operator's trading volumes swelled on market gyrations amid a banking crisis and rising interest rates.Cboe, which provides trading platforms for equities, foreign exchange and derivative products in various regions, reported adjusted earnings per share of $1.90, 3 cents above analysts' mean estimate, according to Refinitiv data.\"These record-breaking first-quarter results were driven by strong volumes across our derivatives franchise, specifically our proprietary index option products,\" Chief Executive Ed Tilly said on an analyst call.Investors turned to the Chicago-based company's proprietary products, such as options linked to the VIX volatility index and the S&amp;amp;P 500, as they rejigged portfolios to hedge against economic and financial risks.Demand for Cboe's options contracts that are opened on the same day they expire, commonly referred to as 0DTE (zero-days-to-expiry), surged, making up nearly 43% of overall first quarter SPX volumes and nearly 45% of April's SPX volume.\"This really allows investors to pinpoint the uncertainty in the daily news cycle to trade around that news without buying weeks or months of premium to hedge against or take a position in short-term moves,\" Tilly said.Cboe's options revenue jumped 28% from a year earlier to $280.7 million.",
        "Cboe last week launched a one-day volatility index linked to the VIX, providing real-time information about the current trading day's expected volatility.\"Although not yet tradeable, it's an exciting development as future product implementations could become an exciting growth driver,\" CFRA analyst Alexander Yokum said in a client note.Net revenue rose 13% to $471.4 million.Cboe's results wrapped up a strong quarter for exchange operators, with New York Stock Exchange-parent Intercontinental Exchange Inc, Nasdaq Inc and CME Group all beating profit estimates. (Reporting by Siddarth S in Bengaluru; Editing by Krishna Chandra Eluri and Jonathan Oatis)"
    ]
}