{
    "articleURL": "/wires/reuters/article-12045953/Gold-takes-breather-Fed-fuelled-run-near-time-peak.html",
    "content": [
        "Gold still has prospects to rise further - analyst",
        "ECB's interest rate decision due at 1215 GMTLofty prices tarnish gold's lustre in top Asian retail hubs(Updates prices)By Arundhati SarkarMay 4 (Reuters) - Gold prices steadied on Thursday after accelerating to a near-record high as the U.S. Federal Reserve signalled its rate hiking run might finally have hit a pause, with elevated economic risks seen fuelling robust demand for safe-haven bullion.Spot gold ticked up 0.2% to $2,042.43 per ounce by 1145 GMT after climbing earlier to $2,072.19, just shy of a record high of $2,072.49 touched in 2020.U.S. gold futures rose 0.7% to $2,051.40.\"Gold bugs are spoilt for options now on what could propel gold higher again and the key takeaway is markets are vulnerable and it doesn't really matter what the first domino to fall might look like,\" said independent analyst Ross Norman.\"The next item dealers are watching that could conceivably flip gold into new all-time highs is Friday's U.S. Non Farm Payrolls.\"Fed Chair Jerome Powell said inflation remains the chief concern, and the U.S. economy has a greater chance of avoiding a recession, but would not rule out a mild one.\"(Additionally,) the debt ceiling debacle will rumble on and together with long-term sticky inflation at a higher than current priced in level we see the prospect for higher (gold) prices still,\" Saxo Bank analyst Ole Hansen said.",
        "In the short term, gold may consolidate with support around $1,982, Hansen added.Economic uncertainties and lower rates boost demand for zero-yield bullion.Markets now see a 93.4% chance of a pause in Fed rate hikes in June, and analysts said upcoming economic data would be scanned to confirm this, likely fuelling some volatility. The ECB's rate decision was also on the radar.In the physical market, lofty prices have tarnished demand in top Asian retail hubs.Among other precious metals, spot silver rose 0.2% to $25.63 per ounce, platinum ticked up 0.1% to $1,050.15 and palladium advanced 0.6% to $1,432.15.(Reporting by Arundhati Sarkar and Ashitha Shivaprasad in Bengaluru; Editing by Krishna Chandra Eluri and Sohini Goswami)"
    ]
}