{
    "articleURL": "/sport/nba/article-12040021/Philadelphia-76ers-erupt-cheers-teammate-Joel-Embiid-named-2022-23-NBA-MVP.html",
    "content": [
        "The 76ers gathered to watch as Joel Embiid was named the NBA MVP TuesdayThe star's teammates congratulated him with James Harden hugging himDailyMail.com provides all the latest international sports newsJoel Embiid's Philadelphia 76ers teammates had a heartwarming reaction to him being announced as the 2022-23 NBA MVP Tuesday.",
        "The entire team were gathered in what appeared to be a function room in their hotel as they watched the announcement live. Before the announcer could even finish reading the star forward's name out, his teammates erupted into cheers and applause. Embiid, clearly overcome with emotion, put his head into his hands as he soaked the moment up before the rest of the 76ers broke into chants of 'MVP.'James Harden then leapt from his seat and wrapped the league's freshly crowned MVP in a massive hug from behind. ",
        "The rest of their teammates then joined the point guard in circling Embiid with Harden looking up and exclaiming, 'he's crying.'The Philadelphia roster began light-heartedly ribbing Embiid for his tears with some patting his shoulder. Embiid earned his first NBA MVP trophy Tuesday night, edging two-time winner Nikola Jokic of the Denver Nuggets.The 29-year-old from Yaoundé, Cameroon, averaged 33.1 points to win his second straight scoring title, averaged 10.2 rebounds and tied a career high with 4.2 assists per game.Embiid played in 66 games, the second-highest total of his career, but again has been hit with injuries in the playoffs.He has been sidelined with a sprained right knee that cost him one game of the playoff sweep against Brooklyn and the opening game of the Eastern Conference semifinals against Boston which was won by Philadelphia on Monday night.",
        "Jokic finished runner-up and Giannis Antetokounmpo of the Milwaukee Bucks was third.Embiid has been determined to win -- and campaigned for -- the MVP trophy for years. The third overall pick of the 2014 draft, Embiid missed his first two full seasons with injuries before settling in as one of the top big men of his generation.",
        "He was at his best this season when he totaled three 50-point games, including a career-high 59 against Utah in November. He had 13 total 40-point games.When Embiid totaled 52 points and 13 rebounds in a win against the Celtics in April, coach Doc Rivers boldly declared, 'The MVP race is over.'Embiid certainly didn't argue that night with his coach or Sixers teammates who stumped on his behalf.'They're probably right,' Embiid said. 'But we have bigger goals in mind.'Embiid's injury could be the deciding factor in the 76ers´ chase for the NBA championship. The Sixers are trying to win their first NBA title since 1983 and advance past the second round for the first time since 2001 - which was the last time a Sixer won the MVP award.Allen Iverson was named league MVP in 2001. Other 76ers to capture the league's top individual award: Julius Erving, 1981; Moses Malone, 1983; and Wilt Chamberlain, 1966-1968."
    ]
}