{
    "articleURL": "/wires/ap/article-12058579/Pakistan-Afghan-Taliban-agree-boost-trade-lower-tension.html",
    "content": [
        "ISLAMABAD (AP) - Pakistan and Afghanistan's Taliban-appointed government have agreed to boost trade and lower tensions along their border amid a surge in militant attacks on security forces, officials said Monday.",
        "Pakistani Foreign Minister Bilawal Bhutto Zardari and Afghanistan´s Taliban-appointed foreign minister, Amir Khan Muttaqi, struck the deal Sunday in Islamabad, according to Pakistan's Foreign Ministry. The agreement is designed to improve bilateral trade, combat terrorism and boost bilateral ties.Local media reported that Muttaqi on Monday urged Pakistani authorities to consider holding talks with the Pakistani Taliban, who are a separate group. There was no immediate response from Islamabad. But earlier talks hosted by the Afghan Taliban in Kabul had proved futile. Since then, Pakistan has said there will be no talks with the militants known as Tehreek-e-Taliban Pakistan.Pakistan has recently expressed concern over a surge of attacks by the TTP. Islamabad has demanded the Taliban in Kabul do more to rein in the group - which has stepped up attacks on Pakistani security forces in recent months.At the end of the Pakistan-hosted mini-summit of China, Afghanistan and Pakistan, the Foreign Ministry in Islamabad on Monday issued a joint statement. It said the three sides stressed the need to prevent any individual, group or party \"to use their territories to harm and threaten regional security and interests or conduct terrorist actions and activities.\" These include the Pakistani Taliban and the ethnic Uighur militant group, called the East Turkestan Islamic Movement.",
        "It said all three sides underscored the need to refrain from intervening in the internal affairs of Afghanistan and to promote Afghan peace, stability and reconstruction. The diplomats from the three nations agreed \"to further deepen and expand their cooperation in the security, development and political domains based on the principles of mutual respect, equal-footed consultation and mutual benefit.\"",
        "Earlier, Bhutto Zardari and Muttaqi also held talks with China's Foreign Minister Qin Gang, a departure from recent years when such dialogue had been on hold, according to analysts, who say China is expanding its influence in the region. China also has played a role in the resumption of Saudi-Iran diplomatic ties.In Pakistan, Beijing is bankrolling the so-called China-Pakistan Economic Corridor, or CPEC - a sprawling package that includes such projects as road and power plant construction and boosting agriculture production.The package is considered a lifeline for this impoverished Islamic nation, which is currently facing one of its worst economic crises amid stalled talks on a bailout with the International Monetary Fund.CPEC, also known as the One Road Project, is part of China´s Belt and Road Initiative, a global endeavor aimed at reconstituting the ancient Silk Road and linking China to all corners of Asia.Qin arrived in Islamabad on Friday and met with President Arif Alvi, Foreign Minister Bhutto Zardari and Pakistan's powerful army chief, Gen. Asim Munir. During these meetings, he was assured that Pakistan will boost security for all Chinese nationals who are working on multi-billion dollar projects in cash-strapped Pakistan.",
        "China has been demanding more security from Pakistan for its nationals residing and working in the Islamic country since 2021, when a suicide bomber killed nine Chinese and four Pakistanis in an attack in Pakistan´s volatile northwest.According to a Foreign Ministry statement, Bhutto Zardari and Muttaqi on Sunday \"held a candid and in-depth exchange on key issues of mutual concern, including peace and security, as well as trade and connectivity.\" The two sides \"reaffirmed their desire to pursue continuous and practical engagement,\" it said.According to the Afghan embassy, Muttaqi and his delegation met with Bhutto Zardari and other officials. \"During the meeting, matters of mutual interest, Afghan-Pak political, economic, and transit relations as well as challenges of Afghan Refugees in Pakistan have been discussed,\" it said on Twitter early Monday.Pakistan's military said Muttaqi also met with Munir, the army chief, to discuss \"issues of mutual interest including aspects related to regional security, border management, and formalization of bilateral security mechanisms for improvement in the current security environment.\" Munir sought enhanced cooperation to \"effectively tackle the common challenges of terrorism and extremism,\" the statement added.Relations between Pakistan and the Afghan Taliban have featured ups and down in the past year.In February, the two sides shut the main Afghan-Pakistan border crossing at Torkham, stranding people and trucks carrying food and essential items. After a Pakistani delegation traveled to Kabul for talks on the crisis, the border was reopened after a week and Muttaqi's visit to Islamabad was planned.",
        "Afghanistan's Taliban have been shunned by most of the international community for harsh and restrictive measures they have imposed since seizing power in August 2021, when U.S. and NATO troops were in the final weeks of their pullout from the country after 20 years of war. The Afghan Taliban has banned girls from education beyond the sixth grade and barred women from most jobs and public life."
    ]
}