{
    "articleURL": "/news/article-12057361/Sydney-Melbourne-Brisbane-weather-Cold-blast-warning-issued.html",
    "content": [
        "Temperatures dipped up to 10C below averageAustralia's south-east hit with rain, hail and snow Severe weather warnings remain in place in NSW Forecasters have warned that a freezing polar blast that hit Australia over the weekend sending temperatures plunging is here to stay. ",
        "Melbourne, Sydney, Adelaide, Canberra and Hobart were in the grips of a cold front over the weekend with temperatures struggling to get past 14C anywhere in Australia's south-east.Snow and hail blanketed parts of Victoria, NSW and the ACT, where overnight temperatures dipped below zero.Temperatures plummeted below the May average by as much as 5C in NSW, 8C in South Australia and 10C in Tasmania.Ski resorts welcomed falls of fresh powder a month out from the the start of ski season.NSW and Victoria remain in the firing line on Monday as cold and gusty southerly winds smash the coast.Overnight temperatures in Sydney plunged as the mercury dipped to 10.5C at Sydney Airport 4am Monday but the apparent temperature was a chilly 8C as cold winds blasted the Harbour City.Melbourne was also chilly with the mercury plunging to 7.5C at Melbourne Airport. The apparent temperature was an icy 1.6C.",
        "While the cold front has moved off the NSW coast, a second blast of cold air is expected to come in from the south of the country over the next few days.  The Bureau of Meteorology on Monday issued a severe weather warning for the Sydney and Illawarra regions with damaging winds along the coast.Large and powerful southerly waves will also smash the coast from the mid north coast right down to Ulladulla in the south with hazardous surf warnings in place.",
        "Sydney will reach a top of 18C of Monday but it it will feel much colder due to the blustery winds. 'We've seen a narrow band of storm wrapping up the coast, which is an equivalent of a category two cyclone,' Channel Seven meteorologist Tony Auden told Sunrise.'Thankfully they're not on the coast but we have a lot of wind over land, warnings for damaging wind gusts up to 100k/h south of Sydney down to Ulladulla with gusty winds up to 50k/h wrapping around up as far as northern NSW and Queensland as well.'Those winds are whipping a huge seas, potentially with wave heights up to 8-9m off NSW coast. As that low moves away, that energy source to move north and away.''We are expecting a fair bit of erosion on beaches and could see inundation in low-lying areas.'",
        "Snow is expected to fall at 600m in Tasmania, 800m in Victoria and as low as 900m in NSW, according to Bureau of Meteorology senior meteorologist Dean Narramore.'We've seen temperatures anywhere from four to eight degrees below average in Tasmania, Victoria and NSW and on Monday that cold air will get up into Queensland,' Mr Narramore said.'We're likely to see widespread inland frosts through northern Victoria, much of NSW. We could even see frosts get up into parts of Queensland on Monday and Tuesday.'",
        "Mr Narramore described it as 'a sure sign that winter is on its way.'The cold front coming through NSW is expected to form into a low pressure system from Sunday night.",
        "Storm force and gale wind warnings are in place for southern waters including Batemans Coast, Eden Coast and Illawarra.Strong wind warnings are also in place from Sydney up to the mid north coast and Byron.Another cold front is expected to impact Western Australia on Wednesday, bringing with it rain, storms and strong winds, Mr Narramore said.It's expected to bring wet and cold weather to Adelaide on Thursday, before weakening and moving into Victoria and Tasmania.",
        "PERTH Monday: Min 15, Max 25. Possible shower.Tuesday: Min 15, Max 25. Showers increasing.Wednesday:  Min 15, Max 21. Showers.Thursday: Min 8, Max 19. Partly cloudy. ADELAIDEMonday: Min 8, Max 17. Shower or two.Tuesday: Min 15, Max 25. Showers increasing.Wednesday:  Min 15, Max 21. Showers.Thursday: Min 8, Max 19. Partly cloudy. MELBOURNEMonday: Max 15. ShowersTuesday: Min 9, Max 19. Shower or two.Wednesday:  Min 9, Max 19. Partly cloudy.Thursday: Min 10, Max 21. Mostly sunny. HOBARTSunday: Max 12. Possible shower.Monday: Min 3, Max 15. Shower or two.Tuesday: Min 8, Max 15. Shower or two.Wednesday:  Min 7, Max 15. Cloudy.Thursday: Min 6, Max 16. Mostly sunny. CANBERRAMonday: Min -1, Max 13. Frost, mostly sunny.Tuesday: Min -1, Max 15. Frost, partly cloudy.Wednesday:  Min 0, Max 16. Sunny.Thursday: Min 1, Max 16. Partly cloudy. SYDNEYMonday: Min 9, Max 18. Shower or two, windy.Tuesday: Min 10, Max 20. Mostly sunny.Wednesday:  Min 10, Max 20. Possible shower.Thursday: Min11, Max 21. Shower or two. BRISBANEMonday: Min 10, Max 22. Sunny.Tuesday: Min 7, Max 23. Sunny.Wednesday:  Min 11, Max 24. Mostly sunny.Thursday: Min 13, Max 23. Shower or two. DARWINSunday: Max 33. Sunny.Monday: Min 24, Max 34. Sunny.Tuesday: Min 24, Max 34. Mostly sunny.Wednesday:  Min 22, Max 33. Sunny.Thursday: Min 22, Max 33. Sunny. Source: Bureau of Meteorology"
    ]
}