{
    "articleURL": "/tvshowbiz/article-12057119/Will-Poulter-reveals-moving-reason-dressed-Toy-Storys-Sid.html",
    "content": [
        "Will Poulter has spoken out about the heartbreaking reason he once went dressed as Sid from the movie Toy Story for Halloween.",
        "The actor, 30, was tasked by GQ with going undercover on social media to find out what people were saying about him.Taking to Twitter, the Guardians of the Galaxy Vol. 3 star stumbled across a message from someone asking why he dressed as the character Sid Phillips from Toy Story back in 2017.They wrote: 'Thought he hated this comparison, so how did this happen in the end? Knowing him he must have done it for a reason.'While Will insisted he dressed up as Sid as people were comparing him to the film character, he revealed there was a much more serious reason behind his decision.",
        "'I did do it in light of some of the comparisons between me and Sid from Toy Story that were going around on the internet,' he explained.'I work with Anti-Bullying Pro and the Diana Award, I did it during anti-bullying week to raise awareness of that organisation. 'So, that was that.'The organisation's website states that 'The Diana Award Anti-Bullying Program raises awareness of bullying behaviour and supports schools and young people to tackle it across the UK and beyond.'Staff provide school training, webinars for educators, and programs that target racist and sexual bullying.Before heading out for Halloween in 2017, Will shared a picture of himself dressed as Sid on social media at the time.",
        "He could be seen wearing a black T-shirt with a white skull on the front while he held a doll of the flick's character Sheriff Woody Pride and a magnifying glass.Will wrote at the time: 'This Halloween I thought I should respond to the comparisons with Disney Pixar's biggest bully next door and go as Sid from Toy Story!",
        "'In addition to having a laugh at my expense I wanted to try and raise some attention for a cause I am an ambassador for! @antibullyingpro.'As this month is Bullying Prevention Month in the USA and Antibullying Week in the U.K. is just around the corner.'I would really appreciate it if you could please give them a follow before you like or share and help support the cause to make school a safer and happier place for young people.'Thank you! @antibullyingpro #HappyHalloween #Antibullying' "
    ]
}