{
    "articleURL": "/wires/ap/article-12055787/Diamondbacks-survive-wild-9th-walk-Nationals-8-7.html",
    "content": [
        "PHOENIX (AP) - Lourdes Gurriel Jr. had four hits, including a tying homer in the ninth, and pinch-hitter Pavin Smith walked with the bases loaded to force in the winning run as the Arizona Diamondbacks beat the Washington Nationals 8-7 on Saturday night.",
        "Gurriel hit his third homer of the season on the first pitch from Kyle Finnegan (1-2). The play was challenged by Washington because left fielder Stone Garrett leaped to catch the ball and hit a fan in the process, but the call stood.Gurriel said he talked to hitting coach Joe Mather before the at-bat, getting information about Finnegan.\"He ran down some of the pitcher's repertoire and I put a good swing on it,\" Gurriel said through a translator.Gurriel also made a sliding catch on a ball in foul territory in left field. He finished 4 for 5 at the plate.\"Just a good approach but also putting in a lot of work with the coaches, coming in early and getting that work in,\" he said.",
        "Christian Walker followed Gurriel's homer with a single, and Corbin Carroll walked. After Dominic Fletcher sacrificed and Geraldo Perdomo was intentionally walked, Smith took a 3-1 pitch out of the zone to end the game.Miguel Castro (1-0) got one out for the victory.Washington trailed 6-2 before it scored five runs in the ninth, including four with two out. Lane Thomas' two-run homer off Andrew Chafin gave the Nationals a 7-6 lead. Keibert Ruiz, who drove in three runs for Washington, also homered in the inning against Scott McGough.",
        "\"We made it a battle,\" Nationals manager Dave Martinez said of the ninth-inning rally. \"I can't say enough about what our team did, it showed a lot of fight.\"As for Gurriel's home run, Martinez said: \"It was tough to see from our angle. You gotta ask and let them make a judgement.\"The score was 2-2 going into the bottom of the seventh. Arizona's Alek Thomas tripled leading off against Carl Edwards Jr. and scored on Ketel Marte's single.Thomas, who entered the game batting .170, also hit an RBI single during the Diamondbacks' three-run eighth against Mason Thompson. Carroll knocked in the first run of the inning with a pinch-hit single, extending his hitting streak to 11 games.Diamondbacks starter Tommy Henry pitched six innings of two-run ball, lowering his ERA from 6.52 to 5.17. He allowed six hits, struck out three and walked two.Emmanuel Rivera put Arizona in front with a solo homer against MacKenzie Gore in the first. The drive to left was his first homer of the season.Washington rallied with two runs in the fourth on Ruiz´s double. Luis García and Joey Meneses singled ahead of Ruiz´s line drive to left.Arizona tied the game in the sixth. Gurriel led off with his third single of the game and advanced to third on Walker´s bloop single to right. Gurriel scampered home on a wild pitch.",
        "Gore struck out nine in six innings. He permitted two runs and eight hits.TRAINER´S ROOMNationals: 3B Jeimer Candelario was out of the lineup after being hospitalized briefly for dehydration following Friday´s game. Martinez said before the game everything was fine and that Candelario would be at the ballpark on Saturday. ... CF Victor Robles was removed for pinch-hitter Alex Call in the fourth. Robles walked and was thrown out stealing in the third. Martinez said after the game that Robles hurt his back on the slide.Diamondbacks: Carroll began the game on the bench after homering on Friday in his first start after he missed three games earlier in the week with a left knee contusion. He batted for DH Evan Longoria in the eighth.NEXT UPWashington RHP Trevor Williams (1-1, 3.41 ERA) starts against Arizona RHP Ryne Nelson (1-2, 6.39 ERA) in Sunday´s series finale.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}