{
    "articleURL": "/wires/reuters/article-12059217/Brazils-Itau-Unibanco-quarter-net-profit-14-6.html",
    "content": [
        "SAO PAULO, May 8 (Reuters) - Itau Unibanco Holding SA , Brazil's biggest private bank, reported on Monday first-quarter recurring net profit up 14.6% year-on-year, boosted by a larger loan portfolio with better spreads even as provisions for bad loans increased.",
        "The bottom line of 8.44 billion reais ($1.7 billion) was broadly in line with expectations of 8.42 billion in a Refinitiv poll of analysts, but marked a shift from other large Brazilian lenders as they reported lower income in the period.Peers Bradesco and Santander Brasil both outperformed market consensus in the first quarter, but saw their net profits diving 37.3% and 46.6% on a yearly basis, respectively.Shares in Itau were trading up 0.6% in the morning, roughly in line with Brazil's Bovespa stock index.\"Numbers were close to what we flagged in our April 10 preview, which we see as good news as forecasting and following Itau's results have been quite predictable,\" analysts at BTG Pactual said. \"Another decent set of quarterly results.\"Itau said in a securities filing the results were driven by the \"positive effect\" of a larger loan portfolio, which coupled with a \"gradual change in the mix to loans with better spreads\" led to a 20% increase in its financial margin with clients.The bank's consolidated loan book totaled 1.153 trillion reais in the quarter, up 10.4% from the previous year.Loan-loss provisions hit 9.0 billion reais, up 28.7% from a year ago but decelerating from the 9.90 billion set aside in the previous quarter, when it was hurt by extra provisions related to the bankruptcy of retailer Americanas SA and said cost of credit would likely increase in 2023 from 2022.",
        "JP Morgan analysts dubbed it a \"clean in-line quarter\" for Itau, highlighting asset quality metrics as especially good in light of seasonality and \"well better than Bradesco\".Itau's return on average equity, a widely followed gauge of profitability, reached 20.7% in the first quarter, up from 20.4% a year ago.($1 = 4.9528 reais) (Reporting by Gabriel Araujo; Editing by Alexander Smith and Mark Potter)"
    ]
}