{
    "articleURL": "/wires/reuters/article-12051063/Pakistan-India-talks-hurt-Delhis-decision-end-Kashmir-special-status-Pakistan-foreign-minister.html",
    "content": [
        "By Krishn Kaushik",
        "GOA, India, May 5 (Reuters) - India and Pakistan each blamed the other for their frosty relations on Friday and reiterated entrenched diplomatic positions on issues such as Kashmir and terrorism, suggesting no thaw in ties is likely anytime soon.The foreign ministers of the nuclear-armed rivals spoke bitterly at separate press conferences after a meeting of the Shanghai Cooperation Organisation (SCO) regional bloc in the Indian coastal state of Goa.Pakistan's Foreign Minister Bilawal Bhutto-Zardari told reporters that India's decision to scrap the special status of the disputed region of Kashmir in 2019 had undermined the environment for holding talks between the neighbours.\"The onus is on India to create a conducive environment for talks,\" Bhutto-Zardari said.India's Foreign Minister Subrahmanyam Jaishankar responded by saying Kashmir's special status was \"history\" and suggesting that Pakistan backed terrorists in Kashmir.In comments in an interview to India Today TV channel broadcast later, Bhutto-Zardari said Islamabad was willing to engage and address any concerns New Delhi might have but New Delhi will also have to address Islamabad's concerns.Both countries claim Kashmir in full but rule only part of it, and they have fought two of their three wars over control of the Himalayan region.India has for years accused Pakistan of helping Islamist militants who have battled Indian security forces in its part of Kashmir since the late 1980s.",
        "Pakistan denies the accusation and says it only provides diplomatic and moral support for Kashmiris seeking self-determination.The special status given to the Indian state of Jammu and Kashmir was revoked in 2019 when New Delhi split it into two federally controlled territories. Pakistan calls the moves illegal and wants them rolled back.India's 2019 decision led the two countries to downgrade their diplomatic ties in tit-for-tat moves.Bhutto-Zardari's visit to India is the first by a Pakistani foreign minister in 12 years and has garnered a lot of media attention in both countries.The Pakistani foreign minister said that, despite his rare visit to India, there was no change in the status of diplomatic relations.Responding to Bhutto-Zardari, India's Jaishankar said the article of the Indian constitution that had given special status to Jammu and Kashmir \"is history\" and the \"sooner people realise it, the better\".He also described Pakistan's position on Kashmir as effectively backing terrorism.\"Victims of terrorism do not sit together with perpetrators of terrorism to discuss terrorism,\" Jaishankar told reporters.\"Victims of terrorism defend themselves, counter acts of terrorism, they call it out, they delegitimise it, and that is exactly what is happening,\" he said. (Additional reporting by Gibran Peshimam and Shivam Patel; Writing by YP Rajesh; Editing by Hugh Lawson)"
    ]
}