{
    "articleURL": "/wires/pa/article-12053079/Celebrations-Charles-crowned-day-ceremony-pageantry.html",
    "content": [
        "The King will be crowned at Westminster Abbey by the Archbishop of Canterbury during a coronation ceremony dating back centuries.",
        "Cries of “God Save the King” will ring out around the abbey after St Edward’s Crown is placed on Charles’ head by Archbishop Justin Welby.",
        "The senior cleric said the coronation served as “a powerful reflection and celebration of who we are today, in all our wonderful diversity”.He said people will be struck by the “majesty and sacred wonder” of the service, but also hoped they would find “ancient wisdom and new hope”.The event will bring together around 100 heads of state, kings and queens from across the globe, celebrities, everyday heroes and family and friends of the couple, with Charles’ estranged son the Duke of Sussex expected to attend.",
        "9am: The congregation arrives at Westminster Abbey10.20am: The King and Queen's procession sets off from Buckingham Palace11am: Charles and Camilla arrive at the Abbey and the coronation ceremony begins12pm: The King is crowned1pm: The service ends and Charles and Camilla begin a procession back to the Palace in the Gold State Coach2.15pm: The King, Queen and other royal family members appear on the Palace balcony for a flypast",
        "Invited guests include David and Victoria Beckham, musician Lionel Richie, French President Emmanuel Macron, King Willem-Alexander and Queen Maxima of the Netherlands, Prime Minister Rishi Sunak and US First Lady Jill Biden but her husband President Joe Biden will not be attending.",
        "The day will be a display of pomp and pageantry, with the nation’s Armed Forces promising a “spectacular” event when the King and Queen process through the streets of the capital.The event is the military’s largest ceremonial operation since Queen Elizabeth II’s 1953 coronation, with 9,000 servicemen and women deployed and 7,000 of these performing ceremonial and supporting roles.",
        "A relaxed looking Charles went on a walkabout in The Mall on the eve of the coronation on Friday with the Prince and Princess of Wales, whose son Prince George will be one of the King’s Pages of Honour.During the surprise event Kate described the coronation, which will also see Queen Camilla crowned, as a “great moment for celebration” and when quizzed about her children replied they were “Excited, a bit nervous obviously with a big day ahead – can’t wait actually”.A massive security and policing operation, dubbed Golden Orb, is under way that will see 11,500 police officers on duty on Saturday alongside more than 9,000 military personnel taking part in the ceremony.The policing plan has been re-examined after a security incident outside Buckingham Palace on Tuesday evening when a man who allegedly had a knife threw shotgun cartridges over the palace gates.",
        "Representatives from the nation’s faith communities will play an active role in the coronation of a monarch for the first time in history.",
        "The archbishop described the service as “foremost an act of Christian worship” but said new elements reflected the “diversity of our contemporary society”.New ground has been broken in other areas, from the inclusion of female bishops for the first time, to the use of Welsh, Scottish Gaelic and Irish Gaelic languages.But the inclusion of the homage of the people, an invitation for those watching to make their own pledge to Charles, has provoked criticism with broadcaster Jonathan Dimbleby, a friend of Charles who wrote the King’s authorised biography, saying the monarch would find it “abhorrent”."
    ]
}