{
    "articleURL": "/wires/reuters/article-12045965/Stocks-euro-sag-ahead-expected-ECB-rate-hike.html",
    "content": [
        "By Marc Jones",
        "LONDON, May 4 (Reuters) - Europe's stock markets and the euro sagged on Thursday as investors waited for another European Central Bank rate rise after the U.S. Federal Reserve signalled that its marathon hiking run might finally have hit pause.Another rout in regional U.S. bank shares overnight was hardly helping spirits, but with gold a whisker away from a record high and oil higher after a tough few days, focus was naturally on Frankfurt.Economists polled by Reuters expect the ECB to raise its borrowing rates for a seventh meeting in a row albeit the consensus is for a smaller quarter-point move rather than the half-point jumps it has been favouring recently.Matt Ward, a portfolio manager in the global equities team at Barings, said after the Fed had done a decent job \"threading the needle\" on Wednesday with its quarter point rise, the ECB would be watched closely.\"I am not in the camp of expecting a shock 50 basis point hike, but it's tough to see anything but a continuation of the hawkish tone,\" he said, pointing to the run of relatively robust data and low unemployment in key countries like Germany.That likely ECB tone was evident in the bond markets where benchmark government bond yields, which drive the cost of borrowing across Europe, were nudging higher.",
        "It was fractional stuff though. Germany's 10-year yield was up just 1 basis point at 2.26% and well down from where it was a month ago, while Italy's was only 2 bps higher at 4.152%.\"We're basically in limbo right now until the decision,\" which comes at 1215 GMT, said Piet Haines Christiansen, chief strategist for fixed income at Danske Bank.The Fed on Wednesday dropped a key line that had been in its previously statements on the need for further rate increases, yet Fed Chair Jerome Powell pushed back against expectations that it will soon start cutting them.It will \"take some time\" for inflation to fall he said, so \"it would not be appropriate to cut rates\" this year.It came too as another U.S. regional bank, PacWest Bancorp , reported troubles, reminding investors of the precarious health of some banks despite regulators' assurances around containing the crisis that started with the collapse of Silicon Valley Bank and Signature Bank in March.\"The Fed decision was widely expected, so it didn't provide much of a shock to financial markets,\" said Tina Teng, market analyst at CMC Markets, in Auckland. \"However, I think the whole economic playout is not positive, especially the recent banking rout from the regional banks.\"APPLE EYED",
        "Frontrunning the ECB, Norway's central bank raised its benchmark interest rate by 25 basis points to 3.25%, as expected, and added it was likely to hike again in June, and beyond if the Norwegian crown stays weak.European stocks languished, with the STOXX 600 down 0.5% led by the carmaking and tourism sectors.MSCI's 47-country index of world shares was slipping back into the red too as were Wall Street futures were tech giant Apple was due to reports earnings later.Asia had been more upbeat although trade has been thinned this week by Japanese holidays.China's benchmark index opened weaker as mainland markets returned after their May Day holidays but rebounded to end broadly unchanged.U.S. bond markets had rallied on Wednesday after the Fed meeting, as did Fed Funds futures, the latter implying a 52% chance of a rate cut as early as July.The Japanese yen strengthened 0.1% versus the greenback at 134.51 per dollar, adding to its more than 1% rise on Wednesday.Back in Europe, the euro turned lower having briefly flirting with a one-year peak, while Britain's pound also went flat having touched a roughly 11-month high of $1.25925 in Asia.Mizuho analysts said the excitement over the implied pause in Fed tightening might be overdone and that the Fed's guidance \"is merely more contemplative\".",
        "Brent oil prices rose 1% to $72.83 a barrel on Thursday but it was a fraction of their 9% slump seen over past three days.(Additional reporting by Harry Robertson in London and Rae Wee in Singapore; Editing by Christina Fincher)"
    ]
}