{
    "articleURL": "/news/article-12044839/Federal-Budget-2023-claims-surplus-Jim-Chalmers-Katy-Gallagher.html",
    "content": [
        "Treasurer Jim Chalmers set to deliver surplus This would be federal Labor's first since 1989 The Labor government is reportedly expecting to post a surplus in the federal Budget on Tuesday night in an astonishing fiscal turnaround. ",
        "Sky News political editor Andrew Clennell said the small surplus would be possible as higher iron ore, coal and gas prices boosted government revenue, while low unemployment reduced the welfare bill.It would be the first Budget surplus since 2007, when the Coalition was in power before the Global Financial Crisis worsened.But it would also mark the first federal Labor Budget in the black since 1989, when 18 per cent interest rates during an era of high inflation led to a recession two years later. Scroll down for video ",
        "Sky News predicted a $37billion turnaround in revenue, since Labor's October Budget, would erase the $36.9billion deficit that had been predicted for 2022-23 and produce a small surplus of $100million.Finance Minister Katy Gallagher did not deny a possible surplus during an interview aired on Thursday morning. 'People will have to wait for Tuesday night to see the Budget in full,' she told Sky News. 'There's a significant improvement in the short term but the longer-term years, the out years of the Budget and into the medium term remain a significant Budget challenge.' Even if a surplus does materialise, economists are only expecting it to be temporary, as a moderation in unusually high commodity prices reduced government revenue in coming years.",
        "The last time a federal Labor government delivered a surplus in 1989, the late Bob Hawke was prime minister and Paul Keating was treasurer.",
        "The incumbent Treasurer Jim Chalmers was an 11-year-old schoolboy in Brisbane. The return to surplus in Prime Minister Anthony Albanese's first term would a first-term feat last achieved in 1997 when John Howard was a new Liberal PM and Peter Costello delivered the second of his 12 Budgets.The Hawke government was in power for five years before it returned to a surplus in 1988, having won the 1983 election during a prolonged recession and drought.Dr Chalmers was a senior policy adviser to former Labor treasurer Wayne Swan when he announced a Budget surplus in 2008, only for that to be undone as the GFC led to two stimulus packages worth $52billion, including one which funded $900 cheques.",
        "This surplus in 2023 is all the more remarkable considering the previous Coalition government led by Scott Morrison spent $300billion on Covid welfare measures in 2020 and 2021, leaving $1trillion in gross government debt. The Budget deficit of $213.7billion, announced for 2020-21, comprised 11 per cent of GDP, the highest since World War II, as JobSeeker was temporarily doubled and employers received JobKeeper wage subsidies to keep staff on their books during the Covid lockdowns.",
        "The pandemic meant Liberal treasurer Josh Frydenberg had to break a 2019 promise of a $7.1billion surplus, however, the Budget deficit ended up being much smaller - at $161billion - as the resources sector experienced a China-led boom.The latest fiscal turnaround is also coinciding with a surge in immigration with Treasury now expecting 400,000 new permanent and long-term arrivals in 2022-23, a level significantly higher than the October Budget forecast of 235,000. Net overseas immigration last year climbed above 300,000 for the first time since 2009.With another 318,000 expected in 2023-24, that would see 718,000 people arriving to live over two financial years, adding to inflationary pressures but also boosting government revenue. ",
        "Unemployment remains at a 48-year low of 3.5 per cent, which reduces the government's JobSeeker expenses as income tax funds rise.Higher commodity prices boost revenue and gross domestic product, thanks to higher royalties. ANZ economists were a little less excited, forecasting an $8billion deficit in 2022-23, which would still be much smaller than the $36.9billion deficit predicted in the October Budget.'A larger population and prices higher than previously estimated will drive the nominal GDP and revenue upgrades,' they said.The Commonwealth Monthly Financial Statements for March reported total receipts, from July 2022 to March 2023, were $14.9billion higher than estimated, while expenses were $8.4billion lower.",
        "As commodity prices moderated again, ANZ economists Adelaide Timbrell and Madeleine Dunk predicted a bigger $24billion deficit for 2023-24.  'The tight labour market and strong employment growth have been important drivers of the smaller deficit,' they said.'On commodity prices, we expect Treasury to continue taking a conservative approach to future commodity price estimates.'"
    ]
}