{
    "articleURL": "/health/article-12054963/Crohns-disease-patients-left-agony-cautious-doctors.html",
    "content": [
        "Half a million Britons suffer from Crohn's disease which can cause extreme painAbout a fifth of these patients can keep symptoms under control with drugsScores of Britons with a debilitating bowel disease are missing out on ‘life-changing’ surgery that can put their chronic illness into remission, experts fear.",
        "About half a million Britons suffer with Crohn’s disease, which causes agonising pain, diarrhoea, exhaustion and extreme weight loss.For about a fifth of patients, the condition, where the gut lining becomes inflamed, can be kept under control with medication.But for the vast majority the drugs won’t keep the disease at bay for long, and they will eventually require an operation to remove damaged portions of their bowel.According to guidelines set by NHS watchdog the National Institute For Health And Care Excellence (NICE), surgery should be considered ‘as an alternative to medical treatment early in the course of the disease’.",
        "However, experts have warned that this isn’t happening and that doctors don’t offer the procedure unless all other options have failed – by which time the damage to the bowel is more complex and harder to treat.‘For a lot of patients, the drugs will stop working effectively within a year or so,’ says Dr Nilofer Husnoo, an expert in Crohn’s disease based at Sheffield Teaching Hospitals NHS Foundation Trust. ‘And the longer they wait for surgery, the worse the damage to the gut. This makes the condition more difficult to treat in the long term.‘The norm for doctors is focusing on medication, but patients end up suffering more.’",
        "Instead of offering surgery when two or three medicines have failed, Dr Husnoo says, in some cases an operation should be given as the first or second treatment.‘There are some patients for whom surgery wouldn’t be too complex and could grant them big chunks of time in remission,’ she adds. ‘These are young people who have busy, active lives – we have to give them the best chance.’",
        "One 2013 analysis by experts at Leeds Teaching Hospital NHS Trust found that Crohn’s surgery rates had halved since 2003.Yet studies show that when surgery is given early in the disease – after trying just one or two medications – three-quarters of patients don’t require medication for the following five years.‘People are often worried about having surgery, but once they do they find it is life changing,’ says Ruth Wakeman, director of services, advocacy and evidence at the charity Crohn’s &amp; Colitis UK. ‘Patients often wish they’d had it done earlier.‘It is really important that surgery is not seen as a last option.’Crohn’s disease, for which there is no cure, is mainly diagnosed in adults in their 20s or 30s. The most common type is called ileocolitis, where the damage affects the end of the small intestines and the large intestine, or colon.",
        "On top of the pain and exhaustion, Crohn’s sufferers usually struggle to absorb enough nutrients from regular diets. The exact cause of the disease is unknown, but it is thought that a genetic fault leads the immune system to attack healthy gut tissue. It has historically been treated using immuno-suppressant drugs to dampen the immune system and reduce the inflammation.But over the past 20 years, more powerful drugs called biologics have emerged which block the proteins in the body that lead to inflammation. It means surgery – known as a bowel resection – is now seen as a more risky alternative.In a small number of cases, the operation can lead to patients ending up with a stoma – where the bowel is diverted out of the body on the abdomen and replaced with a bag.Dr Husnoo says it is a shame that concerns about this outcome often puts patients off having surgery. ‘Surgery now is very different to surgery 20 years ago,’ she says. ‘Thanks to new, minimally invasive techniques and specialist surgeons, it is rare to fit a stoma these days. And if all goes well, the patient will usually be out of hospital within five days. Even if patients do have a stoma, it is generally temporary and can be reversed a few months later.",
        "‘All of these developments make it a more attractive option now than it would have been years ago, but the stigma around surgery perhaps hasn’t gone yet.’One patient who waited four years to have a bowel resection operation is 31-year-old Charlotte Hartill, a dental nurse from Plymouth.Following her diagnosis in 2010, she went through six drugs in an effort to keep her flare-ups under control. Every two to three months, a treatment would stop working.‘They weren’t doing anything,’ she says. ‘I was in pain for months and months and constantly in the bathroom.’As a result, Charlotte lost two stone and suffered serious side effects, including a swollen pancreas and the skin condition psoriasis. She eventually went back to her specialist nurse for help.‘She examined me, conducted tests and said I needed urgent surgery,’ Charlotte adds.In 2014 she underwent the operation to remove the damaged area of her bowel.‘I got my quality of life back,’ she says. ‘If I’d done it earlier, I probably wouldn’t have needed to go through so many different treatments. I wish I had considered surgery a couple of years earlier – it’s given me a fresh start.’"
    ]
}