{
    "articleURL": "/wires/ap/article-12048629/ACLU-sues-amid-Missouri-GOP-spat-abortion-measure-cost.html",
    "content": [
        "JEFFERSON CITY, Mo. (AP) - The Missouri ACLU on Thursday sued statewide officials for stonewalling a constitutional amendment to restore abortion rights as the attorney general pushes for a price tag on the proposal that is 1 million times higher than what the state auditor has estimated.",
        "At issue is a power struggle between two Republican statewide officials - Attorney General Andrew Bailey and Auditor Scott Fitzpatrick - that has delayed supporters from collecting required voter signatures on the ballot measure.The proposed constitutional amendment would protect abortion rights and pregnant women, as well as access to birth control. Currently, most abortions are outlawed in the state. There are exceptions for medical emergencies, but not for cases of rape or incest.Because Bailey, a gubernatorial appointee who took office in January, disagrees with Fitzpatrick's cost estimate and won't give what has traditionally been considered perfunctory approval, Republican Secretary of State Jay Ashcroft said he also can't give petitioners the administrative approval to begin gathering signatures, according to the lawsuit.Supporters need signatures from 8% of voters in six of the state's eight congressional districts in order to get the abortion-rights measure on the 2024 ballot.The ACLU in response sued all three Republican officials on behalf of petitioners, asking a Cole County judge to rule Bailey's actions unconstitutional.\"The unilateral actions of the unelected Attorney General to hold hostage the people´s constitutional right to the initiative process is an attempt to subvert direct democracy to prevent Missourians from voting on the fundamental right to reproductive freedom,\" said Tony Rothert, director of Integrated Advocacy at the ACLU of Missouri, in a statement.",
        "Fitzpatrick's office in March found the proposal would have no known impact on state funds and an estimated cost of at least $51,000 annually in reduced local tax revenues, although \"opponents estimate a potentially significant loss to state revenue.\"Bailey in an April 11 letter to the auditor estimated the price tag could be at least $51 billion. He cited a local estimate that southwestern Missouri's Greene County could see a $51,000 annual loss in tax revenue because of allowing abortions could mean fewer residents, and Bailey's office roughly multiplied that across Missouri's 114 counties.\"Aborting unborn Missourians will have a deleterious impact on the future tax base,\" Bailey wrote.He also claimed the state could lose all federal Medicaid health care funding, roughly $12.5 billion for the upcoming fiscal year, by allowing abortions.Fitzpatrick wrote in an April 21 response to Bailey that while he personally finds the petition \"extremely morally objectionable, that is not a sufficient reason for me to claim the state could lose $12.5 billion of federal funds annually.\"He wrote to Bailey that there is no evidence Missouri is at risk of losing all Medicaid funding if the amendment passes, and \"no legal opinion presented to me, including yours, provides analysis supporting the claim that Missouri´s Medicaid funding could be lost.\"",
        "\"As much as I would prefer to be able to say this IP would result in a loss to the state of Missouri of $12.5 billion in federal funds, it wouldn´t,\" Fitzpatrick wrote. \"To submit a fiscal note summary that I know contains inaccurate information would violate my duty as State Auditor to produce an accurate fiscal note summary.\"Madeline Sieren, a spokeswoman for Bailey, did not respond to an Associated Press question about the allegations that the attorney general overstepped his authority. But she said the office will \"continue to use every tool at our disposal to defend the sanctity of life.\""
    ]
}