{
    "articleURL": "/wires/ap/article-12038689/Greece-looks-Vienna-new-boost-Parthenon-Sculptures.html",
    "content": [
        "ATHENS, Greece (AP) - Museums in Austria and Greece are discussing the potential return to Athens of two ancient Greek sculptures, a move which could have a knock-on effect for the world's thorniest cultural heritage dispute: the fate of the British Museum's Parthenon Sculptures.",
        "The talks announced by Austria's foreign minister on Tuesday concern two small pieces of the 2,500-year-old marble works from the Acropolis. The sculptures are now held in Vienna's Kunsthistorisches Museum.If a deal for their return is struck, it would be Greece's third in a few months with the handful of European museums that own little bits of the Parthenon Sculptures.That could increase pressure on the British Museum to return its own, much larger collection, among the global debate on cultural restitution.Austrian Foreign Minister Alexander Schallenberg discussed the issue with his visiting Greek counterpart, Nikos Dendias, in Vienna, the foreign ministry said.Schallenberg said that \"technical talks are currently under way\" between the Kunsthistorisches Museum and the Acropolis Museum in Athens \"about the possibility of a loan,\" according to Austrian Foreign Ministry spokeswoman Antonia Praun.",
        "Sounding optimistic, Dendias voiced \"deep satisfaction\" at the development, but didn't provide any details on the terms being discussed. The two museums didn't immediately respond to requests for comment.\"This will add to a series of highly symbolic gestures that may create a positive momentum\" for the return of the sculptures from the British Museum, Dendias said after meeting with Schallenberg.In January, the Vatican Museums - in a \"donation\" from Pope Francis - returned their three small parts of the sculptures, shortly after a museum in Palermo, Sicily, sent back its one piece.",
        "\"So, (Vienna's) will be the third one,\" Dendias said. \"And this, for us, is of huge importance.\"In February, the chair of the British Museum said the U.K. and Greece were working on a deal that would see his institution´s Parthenon Marbles displayed in both London and Athens. Nothing has been announced since.The two relief sculptures in Vienna measure 26 by 29 centimeters (10 by 11 inches) and 36 by 35 centimeters. The one depicts two bearded men, and the other two young riders and the head of a horse. They were part of the 160-meter-long (520-foot) frieze that ran around the outer walls of the Parthenon, dedicated to Athena, goddess of wisdom.Carved between 447-432 BC, the frieze and other sculptures remained largely intact until the temple - used by the Turkish garrison as a gunpowder store - was blown up during a siege in 1687. About half the surviving works were removed by British diplomat Lord Elgin in the early 19th century, while Athens was still under Ottoman Turkish rule. Since 1816 they have been a key part of the British Museum's collections.Greece claims they were illegally acquired during a period of foreign occupation. British officials have rebuffed repeated demands for their return to Athens.Most of the other works are in the Acropolis Museum, with scattered fragments in Paris, Copenhagen, Munich and Wuerzburg in Germany, and Vienna.",
        "___Grieshaber reported from Berlin."
    ]
}