{
    "articleURL": "/sport/tennis/article-12042407/TV-presenter-hits-trolls-relationship-Matteo-Berrettini.html",
    "content": [
        "Italian tennis star Matteo Berrettini is enduring a difficult season due to injuryHis TV presenter girlfriend has hit out at trolls accusing her of being the reasonSpeaking to Vanity Fair, Melissa Satta rubbished idea sex is behind his injuries The girlfriend of tennis star Matteo Berrettini has taken a swipe at trolls who blame their relationship for his injury woes.  ",
        "Former Maxim model Satta, 37, was previously married to ex-Barcelona midfielder Kevin Prince-Boateng.The pair, who share a son, Maddox, were married from 2016 through until 2020, before separating. Satta was accused of having too much sex with Boateng, which she refuted, and now her relationship with Berrettini is being scrutinised. 'It was something that had been going on for months, when our story became known in January,' she told Vanity Fair, of the abuse she's received. ",
        "'[They say] \"Berrettini doesn't win because Satta is distracting him, she's too demanding\"… But I held back.'Satti, who was once featured as a model in Sports Illustrated, added: '[This has happened before] with my ex-husband [Boateng] who suffered from pubalgia. 'Even there they attacked me saying that we had too much sex and that was the cause of his physical problems.'[The injury Berrettini has] is an injury in the same place as the one in 2021, when I didn't know him. But in any case - do I really have to answer to these people?'Berrettini himself has come out to totally rubbish the claims that his ills are anything to do with their relationship. Speaking ahea of the Monte Carlo Masters 1000 event last month, Berrettini said: 'I cannot conceive how a relationship can allow you not to do your job, but people talk.",
        "'We live in the era of social media, where everyone can say anything and it seems to me as if general education has been lost. In the end, however, I am happy, this is what matters.'",
        "Berrettini, the former world No 6, has seen his world ranking tumble and he is currently on a tennis break.He attended the Met Gala on Monday without Satta but her social media activity has her tagged in various other events across New York City.Berrettini, runner-up at Wimbledon in 2021, wore an all-black tuxedo set, paired with a bow tie, all designed by Boss, one of his sponsors.The Italian has not played since pulling out of the third round of the Monte Carlo Masters through injury. "
    ]
}