{
    "articleURL": "/news/article-12042671/Moment-7ft-6in-alligator-thrashes-handler-catches-homeowner-lurking-garage.html",
    "content": [
        "Chris Drummond was going to work when he found an alligator in his garageHe called the 'Gator Girls' to help safely and humanely remove the reptileThis is the shocking moment a specialist gator handler wrestled with a 7ft 6in beast in South Carolina after a homeowner found it lurking in his garage.",
        "Chris Drummond, from Charleston, was going to work on 28 April when he found the reptile near his car. He said it 'scared the living s*** out of me' before calling experts to come and help.Footage shared shows three catchers outside Chris' garage, with one placing a catchpole around the alligator's neck before dragging it out of the space.The alligator is then seen wildly thrashing on the ground before the handler can bring it under control.",
        "In the video, the City of Charleston Animal Protective Services expert managed to pull the reptile along the driveway and load it into the back of their vehicle.Recovered, Chris explained: 'Who are you gonna call? The Gator Girls.'",
        "He said the alligator 'must have spent the night in the garage. When I opened the garage door to get in my car there he was...'One local resident commented: 'That'll wake you up faster than any energy drink.'Another, called Raymond, remarked: 'Those women are awesome. That is too cool.'Cantey said: 'Poor gator, just looking for a gatorette.'Chris' partner, Paulann Perry, joked back: 'Not gonna find her in our garage.'The South Carolina Department of Natural Resources said the animal was moved to a natural pond outside the neighbourhood.Some five million alligators live in south-eastern US, with two million located in Louisiana and over a million in Florida.",
        "The remaining population is scattered from eastern Texas all the way to the coast of North Carolina.South Carolina is estimated to be home to around 100,000 alligators.In June last year, an 11ft alligator was euthanized by the South Carolina Department of Natural Resources after it killed an unknown victim in Myrtle Beach.Five officials were initially called to the scene at the Myrtle Beach Golf and Yacht Club, where they determined that an alligator had taken hold of someone and retreated back into a nearby pond.",
        "Between 1948 and 2004, 376 injuries and 15 fatalities as a result of alligator attacks had been reported across the United States.Alligator interactions with humans become more likely the more people spend near water, according to the Florida Fish and Wildlife Conservation Commission, but alligators will seldom attack if unprovoked.The probability of being injured in an unprovoked attack is about one in 3,100,000."
    ]
}