{
    "articleURL": "/wires/pa/article-12044207/Mark-Hughes-tells-Bradford-respond-automatic-promotion-hopes-end.html",
    "content": [
        "Mark Hughes lamented how a frantic affair at Gresty Road put paid to Bradford’s automatic promotion hopes.",
        "The Bantams needed to round off the campaign with wins against Crewe and in their finale against Leyton Orient.But after mounting a second-half comeback to cancel out Dan Agyei’s first-half double for the Railwaymen they were undone by a penalty deep into stoppage time converted by Chris Long.They now need a point from Monday’s home clash with the League Two champions to secure a play-off place.“You’re always at risk of a ball dropping into certain areas when it becomes an end-to-end game like it did,” said Hughes.“Anything can happen and we need to get our foot on the ball and take control of it which we didn’t do.",
        "“But given the circumstances, being 2-0 down we had to have a really strong response and we did show good resilience. But there were quite a few consecutive errors which led to us conceding the goals.“We’ve now got a huge game and we have to pick ourselves up for Leyton Orient next Monday. We’ll have a huge following next time out with a point needed to secure our play-off place.“Ideally we’d have liked to have settle it tonight, but we’ve still got everything to play for. I expect that we will get a reaction from the players against Orient and I know it’s what they are capable of.”",
        "In the first half, Bradford were caught out by the pace and power of Agyei who tore away and beat keeper Harry Lewis at his near post.It got worse when Agyei doubled the lead, tapping in Long’s low cross in the 43rd minute.But Bradford flexed their muscles with a blistering start to the second period and Andy Cook powered a header home from Richie Smallwood’s corner.Goalkeeper Tom Booth fumbled under pressure and Jamie Walker slid the ball home into an empty net for the leveller.When Smallwood tripped substitute David Amoo, Long blasted the penalty home for Crewe’s winner.“We gave a really good account of ourselves and it was important to do that for the other teams in the league,” stressed Crewe boss Lee Bell.“The boys played some really good football and for us to finish on a high at home like that with a really good performance was really pleasing.“The players have become more adept at dealing with that sort of situation and I thought we would be the better football team too. The players were magnificent.“We’re up to 13th and it is a good achievement to get on this run at home. We want to make this a difficult place for teams to come.",
        "“It was a terrific penalty from Chris Long and Dan Agyei ran himself into the ground.”"
    ]
}