{
    "articleURL": "/sport/football/article-12041641/Tony-Adams-joins-Rio-Ferdinand-Petr-Cech-inducted-Premier-League-Hall-Fame.html",
    "content": [
        "Tony Adams is the 19th player inducted into the Premier League Hall of FameREAD: Legendary Manchester United defender Rio Ferdinand is also inductedREAD: Ex-Chelsea and Arsenal keeper Petr Cech joins Ferdinand in Hall of Fame Tony Adams has joined Petr Cech and Rio Ferdinand in being inducted into the Premier League Hall of Fame for 2023.",
        "The former defender - who played solely for Arsenal during his distinguished career - was selected after a vote by fans across the world from a 15 person shortlist.Adams becomes the 19th player to join the Hall of Fame after eight legendary stars were inducted in both 2021 and 2022 and Ferdinand and Cech were added this year.He joins Sir Alex Ferguson, Arsene Wenger, Ferdinand and Cech in the 'Class of 2023', with Ferguson and Wenger the first managers to ever be inducted.Adams is one of the greatest centre-backs in Premier League history and was an early great of the top flight during its first 10 years, before he retired in 2002.",
        "He made his senior debut for the Gunners in 1983 - meaning his career spanned three decades - and had already won two league titles before the incarnation of the Premier League. Adams was captain of the Gunners during the first 10 years of the competition, racking up 255 appearances and securing 115 clean sheets along the way.This meant he had a remarkable record of keeping a clean sheet in 48.5 per cent of games in which he played 90 minutes in - a record for players to have played 200 or more full matches.Known as 'Mr Arsenal', Adams was a club legend in every sense of the word and helped the Gunners to their first Premier League title in 1997-98.",
        "The former defender was the man to seal their triumph, as he netted a memorable 89th minute goal in a 4-0 win against Everton in May 1998.This was part of a domestic double, with Arsene Wenger's side also winning the FA Cup that season - something they repeated again during Adams's final campaign in 2001-02.",
        "He remains the only ever Arsenal player to captain the club to three top flight titles across three different decades and is immortalised in a statue outside the Emirates Stadium. The legendary defender becomes the seventh former Gunner to be inducted into the Hall of Fame after Dennis Bergkamp, Thierry Henry, Patrick Vieira, Ian Wright, Arsene Wenger and Petr Cech.",
        "And the 56-year-old was delighted to have joined many of his team-mates as he reflected on his achievements.'I loved being a footballer and I love Arsenal Football Club,' he told the Premier League.'Every time I put that shirt on, I felt proud, and it forever holds a special place in my heart.'I spent over twenty years of my life at Arsenal and enjoyed being part of several generations at the club and have countless great memories from that time, but scoring the goal that helped us to win our first Premier League title in 1997-98 was a magical moment and a career highlight for me.",
        "'I’m very pleased to join the Premier League Hall of Fame. It’s an honour to be recognised and voted for by the fans who make the game what it is.'He continued: 'I’m certainly in good company when you look at the guys it includes and I’m happy to be listed alongside the likes of Thierry Henry, Dennis Bergkamp, Patrick Vieira and Arsène Wenger.'",
        "The Hall of Fame launched in 2021, with inaugural inductees including David Beckham, Dennis Bergkamp, Eric Cantona, Thierry Henry, Roy Keane, Frank Lampard, Steven Gerrard and Alan Shearer.In 2022, Sergio Aguero, Didier Drogba, Vincent Kompany, Wayne Rooney, Peter Schmeichel, Paul Scholes, Patrick Vieira and Ian Wright, were the next group to be inducted into the Hall of Fame.Sir Alex Ferguson, Arsene Wenger, Rio Ferdinand, Petr Cech and Adams are the first five individuals to be added in 2023. To be eligible for the Premier League Hall of Fame, individuals must have been retired as of 1 January 2023, and only their Premier League career is considered in their candidacy. It recognises and celebrates those who have an exceptional record of success and have made a significant contribution to the Premier League since its inception in 1992. It is the highest individual honour awarded by the league. ",
        "Ferdinand, Cech and Adams were voted from the 15 person shortlist for 2023. Listed in full, this was: Tony Adams, Ashley Cole, Gary Neville, Sol Campbell, Jermain Defoe, Michael Owen, Michael Carrick, Les Ferdinand, John Terry, Petr Cech, Rio Ferdinand, Yaya Toure, Andrew Cole, Robbie Fowler and Nemanja Vidic.An event celebrating the 'Class of 23' will be held in London this evening. ",
        "1. Alan Shearer2. Thierry Henry3. Eric Cantona4. Roy Keane5. Frank Lampard6. Dennis Bergkamp7. Steven Gerrard8. David Beckham 9. Patrick Vieira 10. Wayne Rooney11. Paul Scholes12. Didier Drogba13. Peter Schmeichel14. Sergio Aguero15. Vincent Kompany16. Ian Wright17. Sir Alex Ferguson18. Arsene Wenger 19. Rio Ferdinand 20. Petr Cech "
    ]
}