{
    "articleURL": "/wires/ap/article-12060237/Outraged-letter-carriers-demand-action-stop-robberies.html",
    "content": [
        "PORTLAND, Maine (AP) - Postal carriers have more worries than snow, rain or the gloom of night keeping them from their appointed rounds. They're increasingly being robbed, often at gunpoint, from Maine to California.",
        "Robberies of postal carriers have exploded, surging 78% to nearly 500 in 2022, according to data provided by U.S. Postal Inspection Service to The Associated Press under the Freedom of Information Act.Letter carriers are demanding action from the U.S. Postal Service.\"The National Association of Letter Carriers is outraged and angered by the assaults, armed robberies and even murders that America´s letter carriers increasingly face as they deliver the mail. These attacks are completely unacceptable,\" said Paul Barner, the union´s executive vice president.The Postal Service said it´s adapting and implementing new measures to address the robberies, which are taking a toll on letter carriers tasked with delivering about 162.1 million pieces of first-class mail each day.\"Every postal employee deserves to work in safety and to be free from targeting by criminals seeking to access the public´s mail,\" said Michael Martel, spokesperson for the inspection service.",
        "The robberies have more than quadrupled over a decade, the data show. Weapons were used in most of the 496 robberies, injuring 31 postal carriers, last year. One, Milwaukee letter carrier Aundre Cross, was shot to death, leading to three arrests.\"They definitely need some type of security,\" said Cross's friend, Jared Tangle. \"They need someone watching their back, so they can do their jobs safely.\"",
        "Many of these criminals are becoming more sophisticated and organized. Some are targeting the special keys that carriers use to access collection boxes and to deliver mail in apartment buildings.A case this January north of Boston was typical. A letter carrier in Peabody was on his route when a 20-year-old man told him, \"Give me your keys\" and \"Hurry up or I´ll shoot you\" while pointing a semi-automatic handgun at the carrier, law enforcement officials said. The assailant fled but was later arrested.In March, a postal carrier was slashed with a machete in Lowell, Massachusetts. That assailant also was located and arrested.The Postal Service leadership is preparing to announce more measures to address the problem, USPS spokesperson Dave Partenheimer said.Already, the service is working to enhance collection box key and lock technology; implement dual authentication to make keys less attractive targets for criminals; and \"harden\" blue collection boxes to prevent tampering, while continuing to work closely with other law enforcement agencies to bring the criminals to justice, Partenheimer said.Partenheimer added Monday that the USPS is in the process of briefing congressional committees on its responses to postal crime.Theft of mail carries a penalty of up to five years in prison, and possession, concealment or disposal of property carries a sentence of up to 10 years in prison, Martel said. Assault carries a sentence of up to 10 years for a first offense, and up to 25 years for a subsequent offense, he said.",
        "\"We will continue to adapt to evolving security threats and implement expanded measures to safeguard our employees and preserve the security of the mail that our customers expect and deserve,\" Partenheimer said.But Barner said letter carriers \"demand solutions now.\"\"While we will continue to engage with the Postal Service and relevant law enforcement agencies to develop measures that will enhance the safety of letter carriers, the fear and the danger that letter carriers are confronting has to end,\" Barner's statement said.___Follow David Sharp on Twitter @David_Sharp_AP"
    ]
}