{
    "articleURL": "/wires/ap/article-12040623/Writers-strike-looks-long-fight-Hollywood-braces.html",
    "content": [
        "LOS ANGELES (AP) - Hollywood writers picketing to preserve pay and job security outside major studios and streamers braced for a long fight at the outset of a strike that immediately forced late-night shows into hiatus, put other productions on pause and had the entire industry slowing its roll.",
        "The first Hollywood strike in 15 years commenced Tuesday as the 11,500 members of the Writers Guild of America stopped working when their contract expired.The union is seeking higher minimum pay, more writers per show and less exclusivity on single projects, among other demands - all conditions it says have been diminished in the content boom of the streaming era.\"Everything´s changed, but the money has changed in the wrong direction,\" said Kelly Galuska, 39, a writer for \" The Bear \" on FX and \"Big Mouth\" on Netflix, who picketed at Fox Studios in Los Angeles with her 3-week-old daughter. \"It´s a turning point in the industry right now. And if we don´t get back to even, we never will.\"The last Hollywood strike, from the same union in 2007 and 2008, took three months to resolve. With no talks or even plans to talk pending between the WGA and the Alliance of Motion Picture and Television Producers, which represents studios and productions companies, there is no telling how long writers will have to go without pay, or how many major productions will be delayed, shortened or scrapped.\"We´ll stay out as long as it takes,\" Josh Gad, a writer for shows including \"Central Park\" and an actor in films including \"Frozen,\" said from the Fox picket line.",
        "The AMPTP said in a statement that it presented an offer with \"generous increases in compensation for writers as well as improvements in streaming residuals\" and was prepared to improve its offer \"but was unwilling to do so because of the magnitude of other proposals still on the table that the guild continues to insist upon.\"The writers were well aware that a stoppage was likely. Yet the breakoff of contractual talks hours before a deadline that negotiations in previous years have sailed past for hours or even days, and the sudden reality of a strike, left some surprised, some worried, some determined.\"When I saw the refusals to counter and the refusing to even negotiate by the AMPTP, I was like on fire to get out here and stand up for what we deserve,\" Jonterri Gadson, a writer whose credits include \"A Black Lady Sketch Show,\" said on a picket line at Amazon Studios as she held a sign that read, \"I hate it here.\"All of the top late-night shows, which are staffed by writers that pen monologues and jokes for their hosts, immediately went dark. NBC´s \"The Tonight Show,\" Comedy Central´s \"Daily Show,\" ABC´s Jimmy Kimmel Live,\" CBS´ \"The Late Show\" and NBC´s \"Late Night\" all made plans for reruns through the week.",
        "NBC´s \"Saturday Night Live,\" which had been scheduled to air a new episode Saturday, will also go dark and air a rerun, and the two remaining episodes in the season are in jeopardy.The strike´s impact on scripted series and films will likely take longer to notice - though some shows, including Showtime's \"Yellowjackets,\" have already paused production on forthcoming seasons.If a strike persisted through the summer, fall TV schedules could be upended. In the meantime, those with finished scripts are permitted to continue shooting.Union members also picketed in New York, where less known writers were joined by more prominent peers like playwright and screenwriter Tony Kushner (\"The Fabelmans\") and \"Dopesick\" creator Danny Strong.Some actors including Rob Lowe joined the picket lines in support in Los Angeles. Many striking writers, like Gad, are hybrids who combine writing with other roles.Speaking from his acting side, Gad said of his fellow writers, \"We are nothing without their words. We have nothing without them. And so it´s imperative that we resolve this in a way that benefits the brilliance that comes out of each of these people.\"The other side of his hyphenated role could be in the same space soon, with many of the same issues at the center of negotiations for both the actors union SAG-AFTRA and the Directors Guild of America. Contracts for both expire in June.",
        "Streaming has exploded the number of series and films that are annually made, meaning more jobs for writers. But writers say they´ve been made to make less under shifting and insecure conditions that the WGA called \"a gig economy inside a union workforce.\"The union is seeking more compensation for writers up front, because many of the payments writers have historically profited from on the back end - like syndication and international licensing - have been largely phased out by the onset of streaming.Galuska said she is among the writers who have never seen those kind of once common benefits.\"I´ve had the opportunity to write on great shows that are very, very popular and not really seen the compensation for that, unfortunately,\" she said.The AMPTP said sticking points to a deal revolved around so-called mini-rooms - the guild is seeking a minimum number of scribes per writer room - and the duration of employment contracts.Writers are also seeking more regulation around the use of artificial intelligence, which the WGA's writers say could give producers a shortcut to finishing their work.\"The fact that the companies have refused to deal with us on that fact means that I´m even more scared about it today than I was a week ago. They obviously have a plan. The things they say no to, are the things they´re planning to do tomorrow.\" ___",
        "Jake Coyle and David Bauder in New York, and Krysta Fauria and Jonathan Landrum Jr. in Los Angeles, contributed."
    ]
}