{
    "articleURL": "/wires/ap/article-12038757/Almost-half-midterm-voters-cast-ballots-early-mail.html",
    "content": [
        "Almost half of all voters in the 2022 midterm elections cast their ballots before Election Day either by mail or through early voting, with Asian and Hispanic voters leading the way, according to new data the U.S. Census Bureau released Tuesday.",
        "The heavy use of both early voting and voting by mail occurred even as Republican-led states have tightened rules on both voting methods over the last two years, and it marked a steep rise from the two previous midterm elections in 2018 and 2014. Only the 2020 presidential election, during the worst part of the COVID-19 pandemic, had a greater share of of U.S. voters who cast ballots early or by mail - more than two-thirds of voters did so.In the 2022 midterm elections, two-thirds of Asian voters and almost three-fifths of Hispanic voters cast ballots by mail or at early-voting sites, while less than half of white and Black voters did so, according to Census Bureau survey data.Unusual dynamics drove midterm turnout last year including the U.S. Supreme Court decision earlier in the year allowing states to ban abortion and the repudiation of deniers of the 2020 election results in political swing states.In fact, 52.2% of people eligible to vote in the U.S. cast their ballots, a midterm mark surpassed in the past 20 years only by the 2018 congressional elections which had 53.4% turnout. More than 69% of voting-age citizens were registered to vote, the highest rate for a midterm election in two decades, according to the survey.",
        "More than a quarter of registered voters who failed to cast their ballots in 2022 said they were too busy or had a work or school conflict, the most common excuse given in the survey. Asian and Hispanic registered voters gave that reason at a higher rate than Black and white registered voters.",
        "The next most-common reason for registered voters failing to cast their ballots was \"not interested, felt my vote wouldn't make a difference,\" at more than 17%, an increase of more than 2 percentage points from 2018. White voters, Hispanic voters and voters identifying as some other race had higher rates of this response than Asian and Black voters, according to the survey.Colorado had the highest turnout rate for registered voters at 95%. Colorado joined with Hawaii, Oregon and Washington in having 95% or more of its voters cast ballots by mail or early voting.West Virginia had the lowest registered turnout rate at 61.4%, while Alabama had the lowest share of citizens casting ballots early or by mail at 3.6%.Republican-led states have tightened voting rules as former President Donald Trump and his allies continue to baselessly claim his defeat in 2020 was due to widespread election fraud. Republican lawmakers and their allies say the new laws are meant to ensure election integrity. But Democrats and voting rights activists say they are based on conspiracy theories and will end up disenfranchising voters, especially young people and minorities.",
        "Some of the measures in GOP-controlled states have banned 24-hour polling places and drive-thru voting, restricted the use of drop boxes for mailed ballots and reduced the number of ballot drop boxes.___Follow Mike Schneider on Twitter at @MikeSchneiderAP"
    ]
}