{
    "articleURL": "/wires/reuters/article-12046611/Cardinal-Health-raises-annual-profit-forecast-specialty-drug-demand.html",
    "content": [
        "May 4 (Reuters) - Cardinal Health Inc raised its annual profit forecast on Thursday after the drug distributor beat Wall Street estimates for the third quarter, as demand for specialty medicines in a post-pandemic market boosted sales at its pharmaceuticals unit.",
        "Rival AmerisourceBergen Corp also raised its full-year profit forecast on Tuesday after beating quarterly earnings estimates, banking on post-pandemic demand for costly specialty therapies amid a decline in COVID-related sales.Specialty drugs are costly medications that treat complex, chronic and rare conditions like cancer and rheumatoid arthritis, among others.On an adjusted basis, Cardinal Health now expects to earn in the range of $5.60 to $5.80 per share in 2023, compared with its prior forecast range of $5.20 to $5.50 per share. Analysts on average were expecting $5.48 per share, according to Refinitiv IBES data.The company now expects a full-year profit growth of 10.5% to 12% in the pharmaceutical unit, compared with its earlier forecast of 4% to 6.5% growth.The pharmaceutical unit logged a 23% jump in quarterly profit, driven by higher generic drug distribution and specialty drug demand. Revenue rose 14% to $46.8 billion in the third quarter.Meanwhile, the drug distributor expects its medical segment to see an about 50% drop in annual profit as the unit has been struggling with lower volumes and pricing, particularly for its PPE kits. The unit manufactures and distributes Cardinal Health branded medical and surgical equipment.Cardinal Health's total sales came in at $50.5 billion, beating analysts' average estimate of $49.71 billion, according to Refinitiv IBES data.",
        "Excluding one-off items, the company earned a profit of $1.74 per share, topping Street expectations of $1.49 per share. (Reporting by Mariam Sunny in Bengaluru; Editing by Subhranshu Sahu)"
    ]
}