{
    "articleURL": "/wires/ap/article-12039447/Officials-US-send-Ukraine-300-million-military-aid.html",
    "content": [
        "WASHINGTON (AP) - The U.S. is sending Ukraine about $300 million in additional military aid, including an enormous amount of artillery rounds, howitzers, air-to-ground rockets and ammunition as the launch of a spring offensive against Russian forces approaches, the Pentagon said Wednesday.",
        "The new package includes Hydra-70 rockets, which are unguided rockets that are fired from aircraft. It also includes an undisclosed number of rockets for the High Mobility Artillery Rocket Systems, or HIMARS, mortars, howitzer rounds, missiles and Carl Gustaf anti-tank rifles. The weapons will all be pulled from Pentagon stocks, so they can go quickly to the front lines.The latest shipment comes as Ukrainian officials say they are readying a counteroffensive - with Ukrainian Defense Minister Oleksiy Reznikov declaring they are in the \"home stretch, when we can say: `Yes everything is ready.´\" Ukrainian officials have said they are stockpiling ammunition to stow it along potentially long supply lines.Reznikov said Monday that the key things for the assault´s success would be \"the availability of weapons; prepared, trained people; our defenders and defenders who know their plan at their level, as well as providing this offensive with all the necessary things - shells, ammunition, fuel, protection, etc.\"The U.S. in recent months has declined to say exactly how much materiel will be sent to Ukraine, but the latest package resembles other previous deliveries. It includes trucks, trailers, spare parts and other maintenance assistance.This is the 37th package of Pentagon stocks to go to Ukraine since the war began in February 2022, and it brings the total U.S. military aid to about $36 billion.",
        "Officials have said the weapons and other equipment will help as Ukraine prepares to shift from what has been a long and bloody winter stalemate, focused on heavy fighting in Ukraine´s east, particularly around the town of Bakhmut in the Donetsk province.The General Staff of Ukraine´s armed forces said Russia was continuing to concentrate its efforts on offensive operations in Ukraine´s industrial east, focusing attacks around Lyman, Bakhmut, Avdiivka and Marinka.___Follow the AP´s coverage of the war at https://apnews.com/hub/russia-ukraine"
    ]
}