{
    "articleURL": "/femail/article-12050813/Kate-Middleton-wears-Meghans-signature-490-Aquazzura-heels.html",
    "content": [
        "Kate Middleton, 41, stepped out in pair of Aquazzura heels favoured by MeghanRead more: For all the latest Royal news, pictures and video click here Kate Middleton appeared to make a subtle nod to her sister-in-law the Duchess of Sussex today as she stepped out in a pair of Meghan Markle's favourite heels.",
        "The Princess of Wales, 41, joined her husband Prince William and the King for the Realm Governors General and Prime Ministers Lunch at Buckingham Palace today ahead of the Coronation tomorrow.The royal mother-of-three opted to for a smart white dress for the occasion, which featured an elegant black trim.However it was her stiletto which were particularly eye-catching - for the Princess opted to wear a pair of £490 Aquazzura heels often worn by Meghan during her time as a working royal. The Duchess wore the Bow Tie Pump 105 black heels, which feature a flirty bow, for her first ever solo royal engagement, as well as a number of other occasions.",
        "Meghan’s Aquazzura obsession began long before meeting her prince.Aquazzura, founded in 2012, was not a household name when Meghan started wearing the shoes. For her engagement photocall, she wore the label’s £490 suede Matilde heels, and white Aquazzuras for the evening reception at her wedding.And while it's not the first time the Princess of Wales has worn the brand, it's certainly the first time she has stepped out in the black Bow Tie Pump 105 heels, which Meghan wore a number of times during her time in the royal family. She first wore the heels for the Queen's Young Leaders reception in June 2018, shortly after her wedding. ",
        "Meanwhile she donned the shoes another time for the Centenary of the Armistice Service at Westminster Abbey on November 11 2018. The Duchess also opted for the heels a number of times during her royal tour of Australia and New Zealand. In total, she was pictured in the heels 9 times during her time in the royal family.  The brand's founder Edgardo is rather a prodigy. Born in Colombia and raised in Miami and London, he studied at the London College of Fashion and, at 23, worked for Roberto Cavalli.Two years on, he set up Aquazzura — its HQ is in Florence — and the brand is known for bold patterns and metallics. ",
        "Aquazzura means ‘blue water’ in Italian and on each sole is the company’s gold pineapple logo. Sold in high-end department stores, prices range from £370 to £1,500. Edgardo lives in a 15th-century palazzo with partner, Ricardo D’Almeida Figueiredo, 46, who had a PR agency. ‘When I started the brand, it was all about Italy and the Riviera,’ Edgardo says. ‘There, you see stone pineapples outside villas. The pineapple is a symbol of hospitality.‘Then I discovered that in Asian cultures, the gold pineapple is a symbol of good fortune.’King Charles III and senior royals including the Princess of Wales were all smiles at a Buckingham Palace lunch for VIPs today as excitement ramped up with less than 24 hours until Britain's first Coronation for 70 years.",
        "His Majesty was joined by working royals at a special lunch for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.",
        "The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence were also at the event. Completing the royal contingent were the Duke and Duchess of Gloucester and the Duke of Kent. But there was no invite for Prince Andrew, who was seen driving around Windsor this lunchtime.There were 42 attendees in total, including UK Prime Minister Rishi Sunak, Australia's republican Prime Minister Anthony Albanese, and Prime Minister of New Zealand Chris Hipkins.Charles, Queen Consort Camilla and Prince William had been at Westminster Abbey this morning for final rehearsals ahead of the Coronation tomorrow, around the time Prince Harry may have landed in the UK.His Majesty and his wife waved to crowds as he was driven down The Mall to the church for further preparations, before a run of diplomatic duties including hosting a Buckingham Palace lunch for VIPs.But the monarch looked shocked by the heavy rain as he passed thousands of people who are camped out along the route from the Abbey to the Palace including the packed Mall, dubbed Chaztonbury.",
        "Charles was joined by working royals at a special lunch for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.After today's lunch, the King, who is head of the Commonwealth, will also attend a Commonwealth Heads of Government leaders meeting and garden reception at London's Marlborough House this afternoon."
    ]
}