{
    "articleURL": "/news/article-12044743/Twitter-fact-checks-Rashida-Tlaib-calling-Israel-apartheid-state.html",
    "content": [
        "Rep. Rashida Tlaib was instantly fact checked on Twitter after she referred to Israel as an 'apartheid state'The fact check pointed out that the 21.1 percent of Arabic people living in Israel have equal rights under the lawTlaib also said that the nation was 'born out of the ethnic cleansing of Palestinians' something that was also deemed inaccurate  'Squad' member Rashida Tlaib has been called out by Elon Musk's Twitter for referring to Israel as an 'apartheid state.' ",
        "In a tweet, the Michigan lawmaker alleged that the state of Israel was 'born out of violence and the ethnic cleansing of Palestinians.' Tlaib was commenting on Rep. Kevin McCarthy's visit to Israel this week in which he praised the special relationship between the two countries. 'Speaker McCarthy wants to rewrite history but the apartheid state of Israel was born out of violence and the ethnic cleansing of Palestinians. 75 years later, the Nakba continues to this day,' the tweet read.  Her message became the subject of an almost live fact check that pointed out the various mistakes in Tlaib's tweet. This marks the seventh time that Tlaib has called Israel an apartheid state on her official Twitter. It's noted in the fact check that the state of Israel was created following the United Nations General Assembly Resolution 181.",
        "The fact check also pointed out that the 'ethnic cleansing' referred to by Tlaib 'affected both Jewish and Arab communities caught up in the war initiated by 5 Arab states who opposed the existence of Israel.' The final point noted that Israel has 21.1 percent Arab students with full and equal rights. Nakba is a Palestinian phrase used to describe the formation of Israel. Tlaib has been banned from visiting Israel due to her support of the widely condemned economic boycott group BDS.  ",
        "Community Notes is Twitter’s crowd-sourced fact checking project. Last month, Twitter owner Elon Musk promised that there would be 'no exceptions' to the fact checking system. The South African noted that the fact checking would extend to heads of state, celebrities and even himself. Tlaib's tweet comes as conservatives continue to scrutinize Silicon Valley algorithms, which many view as biased against the right. During his visit to Israel, Rep. McCarthy addressed Israel's parliament in a rare honor awarded to the highest-ranking Republican in U.S. politics at a time of fraught relations between Israel’s government and Democratic President Joe Biden. ",
        "Speaker Kevin McCarthy and Israeli Prime Minister Benjamin Netanyahu portrayed the speech as a nod to bipartisan U.S. support for Israel as it marks 75 years since its creation.Critics say the platform given to McCarthy — he’s only the second House speaker to address the Knesset, after Newt Gingrich in 1998 — is a pointed jab at Biden. The Californian said the U.S. 'cherishes its unbreakable bond' with Israel, pledged continued funding for security assistance, and added that the countries must 'remain resolute in our commitment that Iran will never acquire a nuclear weapon.'  Meanwhile, Tlaib has long been criticized for speaking out about Israel and Palestine. In 2021, Tlaib was blasted after paying tribute to Palestinian PhD student who died after ramming her car at Israeli checkpoint before running at soldiers with a knife.",
        "The congresswoman also sparked backlash after writing a tweet claiming Israel was dehumanizing Palestinians by withholding the body of Mai Afana, who was reportedly killed after attacking Israeli Defense Force soldiers.And in 2021, Omar criticized the House of Representatives vote to give $1 billion to Israel for its Iron Dome missile-defense system.'We should also be talking about the Palestinian need for protection against Israeli attack,' Tlaib said during the debate. The same year, Tlaib struck a familiar chord by calling Israel and 'apartheid state' on Twitter. 'The U.S. must condition funding to uphold human rights, and end the funding entirely if those conditions are not met,' she added. "
    ]
}