{
    "articleURL": "/wires/ap/article-12055795/LeBrons-Lakers-rout-Warriors-127-97-2-1-series-lead.html",
    "content": [
        "LOS ANGELES (AP) - LeBron James didn't take a shot in the first quarter of Game 3 for the first time in his NBA-record 275 playoff appearances, and the Los Angeles Lakers' home crowd rumbled with mild uncertainty each time he passed the ball instead.",
        "Turns out James and his Lakers were just taking a while to warm up before they steamrolled the Golden State Warriors.Anthony Davis had 25 points and 13 rebounds, a slow-starting James finished with 21 points, eight assists and eight rebounds, and the Lakers took a 2-1 lead in their second-round playoff series with a 127-97 victory Saturday night.D'Angelo Russell hit five 3-pointers while scoring 21 points for the seventh-seeded Lakers, who remained unbeaten at home in the postseason with a strong defensive effort against the reigning NBA champions. Los Angeles seized control in the middle quarters, outscoring the Warriors 63-38 to turn Game 3 into a laugher.\"We´re one of the best defensive teams in the league, if not the best,\" James said. \"For us to reach our potential, we have to defend at a high level. Not one team in this league tests you more in that than Golden State, so we have to be alert for a test on every single possession.\"James curiously didn't shoot the ball until well into the second quarter, yet he led the way while Los Angeles pulled away. The 38-year-old also mixed in a handful of plays that defied his age and 20 years of NBA experience, making a deft spin move and blocking a shot on the other end shortly after he leaped the front row of fans and ran well up into the stands following a deflection.",
        "\"That´s just how the game was going,\" James said of his unusual start. \"I didn´t want to force it. Just let the game come to me and make my imprint when needed.\"Stephen Curry scored 23 points and Andrew Wiggins had 16 in a collective stinker for the Warriors, who committed 19 turnovers and never mounted a response to the Lakers on either end in the second half. Golden State went 13 for 44 on 3-pointers - making just 10 while the game was still competitive - after hitting 21 in each of the series' first two games in San Francisco.Game 4 is Monday night in Los Angeles.Davis had an impressive bounce-back game under both baskets, blocking four shots and leading the Lakers' latest strong defensive effort. Los Angeles has built its 16-5 run since March 17 on defense, and the Warriors couldn't hit enough shots from the perimeter to counteract their disadvantages in size and athleticism.\"After that first quarter, guys just really turned it up,\" Lakers coach Darvin Ham said. \"They dialed up their competitiveness, and their communication was great. ... We were just playing a really physical, forceful downhill game.\"Klay Thompson had 15 points and seven rebounds for the Warriors, but the rest of the roster beyond their top three scorers struggled mightily, combining for just 18 points before coach Steve Kerr pulled his starters with 9:11 to play. Draymond Green had two points in 23 minutes while playing with foul trouble.",
        "\"As ugly as this was tonight, we have an opportunity to respond on Monday, so there´s no point in dwelling on it and hanging our head and getting discouraged,\" Thompson said. \"We know how to respond. We´ve done it in our existence for 10 years here.\"The Warriors were held under 100 points for only the fifth time in 92 games this season. They also got two technical fouls for arguing with the officials, who whistled Golden State for 22 fouls to the Lakers' 21.\"You can´t get distracted by stuff you can´t control,\" Curry said. \"As much as it´s frustrating, it´s the test that every team has to go through throughout the series, blocking out that stuff as much as we can. We obviously know who we are and what we´re capable of, all the things we always say after a loss.\"After an exciting opener, this much-anticipated playoff rematch between generational superstars James and Curry has featured more garbage time than memorable thrills. After Ham sat down his stars before the fourth quarter of Game 2, Kerr pulled the plug while facing a 26-point deficit early in the fourth quarter of Game 3.FIGHT ONJames´ son, Bronny, announced his decision to play at the University of Southern California about two hours before tipoff. The 18-year-old was among the top uncommitted recruits in the nation, and he chose to stay close to home with a loaded Trojans team coming off its third straight NCAA Tournament appearance. Bronny James, USC hoops coach Andy Enfield and Trojans football coach Lincoln Riley all attended Game 3.",
        "TIP-INSWarriors: JaMychal Green stayed in the starting lineup even with Kevon Looney available to play in Game 3. Looney missed Game 2 with an illness. ... Andre Iguodala has increased his workload and should return to practice next week, Kerr said. The veteran has been out since March 13 after having surgery on his left wrist. ... Moses Moody got a flagrant foul in the second quarter for tripping Davis.Lakers: James passed Kareem Abdul-Jabbar for fifth place on the NBA's career playoff rebounding list. ... Another celebrity-laden sellout crowd gathered for the Lakers' longest playoff run in their home arena since 2012. Fans near courtside included Michael B. Jordan, Kim Kardashian, Woody Harrelson, Don Cheadle, Dustin Hoffman, Nia Long, Adele, Andy Garcia, Kevin Hart and quarterback Bryce Young, the Pasadena native and No. 1 overall pick by Carolina in last month's NFL draft.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}