{
    "articleURL": "/tvshowbiz/article-12044885/Anne-Hathaway-shows-effortlessly-cool-style-family-outing-New-York-City.html",
    "content": [
        "Anne Hathaway looked effortlessly cool as she stepped out for a family stroll with husband Adam Shulman in New York on Wednesday.",
        "The Devil Wears Prada star, 40, sported a navy blazer with baggy jeans and a lilac button-up for the outing.The actress - who recently stunned in Versace at the Met Gala - finalized the look with a pair of white sneakers and black Chanel sunglasses.The mother-of-two added a touch of color to the outfit with a bright pink Valentino purse slung over her shoulder. Hathaway and Shulman, 42, have been married since 2012 and share sons Jonathan Rosebanks Shulman, seven, and Jack Shulman, three.",
        "The New York native wore her long brunette tresses pulled into a bun for the outing. She accessorized with a pair of small gold hoops and appeared to go bare-faced for the day.Meanwhile Adam sported a black jacket over a navy T-shirt and jeans. The outing comes after Hathaway's night out at the Met Gala on Monday, where she looked every inch the sexy bombshell in a plunging white Versace gown.The star - who is the face of the brand's Icon campaign - modeled a look stitched together with gold safety pins.The Armageddon Time beauty teased her perky cleavage in the look, which was extremely low cut and boasted a thigh-high slit.Anne turned heads in the ensemble, commanding attention as she rocked its fingerless opera gloves.",
        "It also came with a jacket that she draped over her arms during some red carpet moments.",
        "Anne's look piggybacked off Liz Hurley's iconic black safety pin Versace dress from 1994.Anne's getup was created with tweed and she described the look as a 'marriage between Versace and Chanel.' Hathaway recently discussed how her work commitments take a second seat now that she's a mother. In an October interview with Sirius XM's Jess Cagle, Anne spoke about being 'choosier' when it comes to picking roles, saying: 'I have to say, the \"kids\" thing has been the biggest shift.''[Kids] kind of re-prioritized everything,' she told Cagle. 'So it's actually made me a bit choosier because something really has to be so excellent to spend time away from them because they're so precious to me.'Calling her sons 'the most sacred part of [her] life by a long shot,' Anne went on to add: 'When I do accept something, it puts greater pressure on me to make it worth the time that I've spent away from them.'The Les Miserables star previously revealed that she knew Shulman was 'the love of her life' right away, but that she met him at a complicated time.'I knew from the second I met him that he was the love of my life. I also knew that I couldn't have met him at a worse time,' she stated in an interview with Harper's Bazaar UK in 2013.",
        "Hathaway was still recovering from a difficult breakup, causing her to be apprehensive at first.'I took my trust out for a ridiculous joyride with him,' she said. 'It was scary.'The Princess Diaries star gave her future husband a chance, explaining that their relationship 'kept getting better and better.''He walks into a room,' gushed Anne, 'and I light up. I can't help it.'"
    ]
}