{
    "articleURL": "/wires/reuters/article-12055389/Athletics-announcer-Glen-Kuiper-suspended-indefinitely.html",
    "content": [
        "Oakland Athletics play-by-play announcer Glen Kuiper was suspended indefinitely on Saturday, one day after using a racial slur during Friday's broadcast of a game between the A's and Kansas City Royals.",
        "Kuiper used the N-word when discussing the Negro Leagues Baseball Museum in Kansas City.Kuiper apologized Saturday through NBC Sports California, the entity that suspended him and said it will continue to review the incident.\"I could not be more sorry and horrified by what I said,\" Kuiper said in a statement. \"I hope you will accept my sincerest apologies.\"On Friday, Kuiper was speaking pregame on NBC Sports California, and referring to the Negro Leagues Baseball Museum when he appeared to say, \"We had a phenomenal day today. (N-word) League Museum and Arthur Bryant's Barbeque.\"Prior to the sixth inning, Kuiper said, \"A little earlier in the show, I said something, didn't come out quite the way I wanted it to. And I just wanted to apologize if it sounded different than I meant it to be said. And like I said, I just wanted to apologize for that.\"The A's issued a statement on Twitter, \"The language used by Glen Kuiper during today's pregame broadcast is unacceptable. The Oakland Athletics do not condone such language. We are working to address the situation.\"Bob Kendrick, the president of the Negro Leagues Baseball Museum, released a statement Saturday in support of Kuiper.\"I'm aware of the unfortunate slur made by Glen Kuiper,\" Kendrick said. \"I welcomed Glen to the NLBM yesterday and know he was genuinely excited to be here. The word is painful and has no place in our society. And while I don't pretend to know Glen's heart I do know that my heart is one of forgiveness. I hope all of you will find it in yourselves to do the same!\"",
        "Kuiper, 59, has been an announcer on A's games since 2004. His older brother, Duane, is a longtime San Francisco Giants announcer who played 12 seasons as a major league infielder.--Field Level Media"
    ]
}