{
    "articleURL": "/health/article-12059181/Six-warning-signs-ovarian-cancer.html",
    "content": [
        "Changes in bowel habits and persistent bloating are key signs of the cancer The disease kills 11 women daily in Britain, according to Target Ovarian CancerBloating, changes in bowel habits and needing to pee more often are common signs of irritable bowel syndrome (IBS), ovarian cysts or even lactose intolerance. ",
        "But, when persistent, they can also be symptoms of ovarian cancer — the disease that kills 11 women every day in Britain, on average, or 4,000 a year.It also kills three times as many women in the US every year, figures show. However, symptoms of the disease are not always obvious, meaning it is often detected late — when it is harder to treat. Here, MailOnline reveals the six key warning signs for the cancer on Ovarian Cancer Awareness Day.",
        "Bloating or an increase in the size of the abdomenIt's usually a tell-tale sign that you're constipated. But persistent bloating — not just bloating that comes and goes — is also a key sign of ovarian cancer, according to the NHS.  Concerningly however, just one in five UK women can name bloating as one of the main symptoms of the disease, charity Target Ovarian Cancer, says.The swelling may be caused by trapped fluid — ascites — that lines the wall of the stomach, Ovarian Cancer Action notes.In advanced stages of ovarian cancer, bloating can become so severe that the abdomen becomes visibly swollen.In some cases this has been mistaken for a pregnancy bump. ",
        "Those experiencing severe and visible bloating should seek an immediate appointment with their GP and ask for urgent referrals for further investigations, the charity urges.",
        "Feeling full quicklyAscites — the same fluid build-up that causes bloating — may also result in feeling full more quickly. This is another key symptom of ovarian cancer, which also makes finishing even small meals difficult, according to the NHS.The Gynae Centre, a private clinic in London, says this 'may make you feel nauseous, uncomfortable or like you are already full' if it affects the gastrointestinal tract. If you regularly experience any one or more of these symptoms, which aren't normal for you, it's important that you contact your GP. The GP or practice nurse may refer you for more tests or to see a specialist in hospital if they think you have a condition that needs to be investigated. Loss of appetiteJust like bloating, loss of appetite can also be caused by a tumour or ascites.This can cause you to not feel hungry because the fluid pushes against other organs in your stomach.A loss of appetite could be independent of bloating and feeling full or could be as a result of these symptoms. Experts recommend keeping a symptom diary to keep track of any symptoms you experience and whether they change. You can also take this to your doctor to keep them aware of your condition. ",
        "Pain in abdomen that doesn't go awayPersistent pain in the abdomen is another key symptom of ovarian cancer, according to the NHS. But the uncomfortable feeling is similar to period cramps, leading women to assume these stomach troubles are harmless. If your pain improves when your stress is alleviated, then your symptoms are likely related to stress. Tumours growing in the pelvis however can cause pain in the lower abdomen, according to the Centers for Disease Control and Prevention. If the tumour spreads in the in the abdomen or the pelvis, it can irritate the tissue in your lower back, experts say.Needing to pee more oftenNeeding to go to pass urine more often could a be a sign of an infection. But it's also potentially a symptom of ovarian cancer.This sign of cancer is not widely known, however. Just one in 100 women know about it, according to Target Ovarian Cancer.When a tumour grows on the ovaries, it can push against the bladder — causing more frequent trips to the toilet.Ascites in the pelvis, compressing the bladder, can also cause women to feel like they need to urinate more frequently. Internal pressure can also block your ureters, which are the tubes that connect the kidney to the bladder, according to Cancer Research. ",
        "If this happens, the urine is unable to drain away, which can cause the kidney to swell.Changes in bowel habits or symptoms of irritable bowel syndromeDiarrhoea or constipation are common signs of IBS or even food poisoning.But it's also a common sign of ovarian cancer. Some gastrointestinal issues may occur as a result of the growing tumour placing pressure on nearby organs such as the bowel. If you are aged 50 or older and develop symptoms of IBS for the first time, it is worth undergoing a test, according to Macmillan Cancer Support. IBS can cause bloating and changes in bowel function, however it does not usually start after the age of 50, the charity notes.",
        "About 80 percent of ovarian cancer cases are diagnosed in the advanced stages of the disease.At the time of diagnosis, 60 percent of ovarian cancers will have already spread to other parts of the body, bringing the five-year survival rate down to 30 percent from 90 percent in the earliest stage.  It’s diagnosed so late because its location in the pelvis, according to Dr Ronny Drapkin, an associate professor at the University of Pennsylvania, who's been studying the disease for more than two decades.'The pelvis is like a bowl, so a tumor there can grow quite large before it actually becomes noticeable,' Dr Drapkin told Daily Mail Online.",
        "The first symptoms to arise with ovarian cancer are gastrointestinal because tumors can start to press upward.When a patient complains of gastrointestinal discomfort, doctors are more likely to focus on diet change and other causes than suggest an ovarian cancer screening.Dr Drapkin said it’s usually not until after a patient endures persistent gastrointestinal symptoms that they will receive a screening that reveals the cancer.‘Ovarian cancer is often said to be a silent killer because it doesn’t have early symptoms, when in fact it does have symptoms, they’re just very general and could be caused by other things,’ he said.‘One of the things I tell women is that nobody knows your body as well as you do. If you feel something isn’t right, something’s probably not right.’"
    ]
}