{
    "articleURL": "/wires/ap/article-12052831/Paraguay-far-right-populist-presidential-candidate-arrested.html",
    "content": [
        "BUENOS AIRES, Argentina (AP) - Paraguayan police on Friday detained Paraguayo Cubas, a far-right populist who came in third in Sunday´s presidential election and encouraged his supporters to protest over his unsubstantiated claims that the vote was marred by fraud.",
        "Cubas was being held in preventive detention under an order by the Attorney General´s Office that is accusing him of breach of the peace, Police Commissioner Gilberto Fleitas said in a radio interview.Cubas, the candidate of the National Crusade Party who received 23% of the votes Sunday, was broadcasting live on Facebook when officers detained him outside his hotel in San Lorenzo, around 15 kilometers (9 miles) from Asunción.Fleitas said Cubas got into a police vehicle \"without any difficulty,\" but he continued streaming live.In his broadcast from inside the police vehicle, Cubas chatted with officers and focused the camera on his handcuffs. \"You can see now I´m being imprisoned,\" he said. \"All the criminals in this country should be handcuffed like Paraguayo Cubas.\"Cubas had been telling supporters since Monday that he was heading to the capital to lead a series of protests that had led to isolated clashes with police, largely outside the electoral court in Asunción.",
        "\"We will remain on the streets until Paraguayo Cubas is released,\" said Juan Reyes, one of hundreds of Cubas supporters who took part in demonstrations outside the electoral court.At least 208 people have been detained \"for disturbance of public peace and other punishable offenses within the framework of the demonstrations taking place in the national territory,\" police said Thursday.",
        "Efraín Alegre, who as the candidate of a broad-based opposition coalition came in second place during Sunday´s election, demanded Cubas be released along with everyone who has been detained in protests this week.\"We demand the release of Paraguayo Cubas and all citizens imprisoned for demanding transparency,\" Alegre wrote on social media.Alegre, who received 27% of the vote Sunday, conceded the race shortly after polls closed, but then on Monday called for a manual count of votes and an international audit of the country´s electronic voting system after Cubas aired his fraud allegations.The Organization of American States, which deployed an observation mission for the election, said Tuesday there was \"no reason to doubt the results\" of the vote count.Santiago Peña of the long-ruling Colorado Party easily won Sunday´s presidential election with 43% of the vote.Over the past few days, Cubas has published images of supporters welcoming him in different parts of the country as he made his way toward the capital from Ciudad del Este, a city on the border with Brazil and Argentina.Some 1,500 to 1,800 law enforcement officers were deployed outside the electoral court Friday for the protest staged by Cubas supporters. Authorities also prepared for any demonstration outside the police station where Cubas was taken.",
        "___Associated Press photo journalist Jorge Sáenz in Asunción contributed to this report."
    ]
}