{
    "articleURL": "/wires/pa/article-12046961/Cleverly-UK-s-30-evacuation-flights-helped-2-450-people-flee-Sudan-violence.html",
    "content": [
        "Almost 2,500 people were moved to safety from Sudan on 30 UK evacuation flights, the Government has said.",
        "Foreign Secretary James Cleverly said a total of 2,450 people were helped during the “longest and largest” evacuation of any Western country, with the final flight departing Port Sudan on Wednesday evening.The Government said the majority of those evacuated from the African nation were British nationals and their dependents.It added the UK helped evacuate 1,200 people from other nations, including the United States, Ireland, Netherlands, Canada, Germany and Australia.Sudanese army chief General Abdel Fattah Burhan and his rival General Mohammed Hamdan Dagalo, the head of a paramilitary group known as the Rapid Support Forces (RSF), were allies in an October 2021 military coup that halted Sudan’s fraught transition to democracy, but they have since turned on each other.",
        "Mr Cleverly said: “The UK has co-ordinated the longest and largest evacuation of any Western country and brought 2,450 people to safety from Sudan.“We remain focused on supporting those who are in desperate need of humanitarian assistance and continue to press for a long-term ceasefire.”Defence Secretary Ben Wallace added: “I am truly grateful for the dedication and professionalism of the men and women of our Armed Forces who have evacuated more than 2,000 people from Sudan from over 20 countries and continue to provide medical and humanitarian support from Port Sudan, supported by the Royal Air Force.",
        "“Their efforts are a source of national pride.”The UK said it is providing an initial £5 million of aid in South Sudan and Chad to help those fleeing the violence.International development minister Andrew Mitchell said: “The package we have announced today will provide food, shelter, medical care and clean water for tens of thousands of people who have fled the violence in Sudan.“While this aid will help alleviate some of the immediate suffering in the region, the ongoing violence is creating huge additional needs.“The UK continues to pursue all diplomatic avenues to end the violence, de-escalate tensions and secure safe humanitarian access, including engaging with the African Union and partners to help co-ordinate these efforts. There can be no aid without safe access and a ceasefire which is permanent. Maybe we were derelict in our duty. Maybe we were derelict in our responsibility. Fine, that’s yesterday. What we’re talking about today is doing something that is consistent with our values  Martin Griffiths, United Nations  UK evacuation flights landed in Cyprus before commencing the second leg of the trip to the UK.Several MPs earlier this week raised concerns over cases they needed help with, including an 11-month-old boy and a heavily-pregnant woman.The UK has said officials continue to help those wanting to leave Sudan.",
        "A renewed 72-hour ceasefire was due to end at midnight on Wednesday in Sudan, with the Foreign Office warning “violence could escalate”.Martin Griffiths, the United Nations under secretary general for humanitarian affairs and emergency relief co-ordinator, arrived in Port Sudan on Wednesday to seek guarantees for the safe passage of aid deliveries.He said: “It’s not as if we’re asking for the moon. We’re asking for the movement of humanitarian supplies and people. We do this in every other country, even without ceasefires.”Speaking to BBC Radio 4’s Today programme, he said it was “unfair” to suggest the UN did not see the conflict coming or was slow to respond.“There are a lot of people didn’t see it coming. A lot of people in Sudan who didn’t see it coming.“Maybe we were derelict in our duty. Maybe we were derelict in our responsibility. Fine, that’s yesterday. What we’re talking about today is doing something that is consistent with our values.”"
    ]
}