{
    "articleURL": "/news/article-12055043/San-Fran-progressives-BAN-lesbian-Asian-setting-Dem-club-title-family-it.html",
    "content": [
        "Cyn Wang, who worked for the Obama Administration, attempted to set up a group called the Westside Family Democratic ClubWang was sure her club would be approved by the Democratic County Central Committee (DCCC) without incident, however they were met with backlashThey were accused of being racist and secretly backed by Republicans, among other things  San Francisco Democrats have been called 'mean girls' after they banned a lesbian Asian from setting up a liberal club in the city.",
        "Cyn Wang, who worked for the Obama Administration, attempted to set up a group called the Westside Family Democratic Club, but was stopped because the title contained the word 'family' and for backing a recall of a woke school board.The Chinese immigrant has long been a Democrat, and on paper looks like the perfect candidate to represent a liberal group. Wang voted for Biden in 2020, labeled herself an intersectional feminist, and denounced the Republican Party as 'the biggest threat to our democracy.' She also married a Mexican immigrant, who got her green card this month; runs a small family business and sends her daughter to a public school.  Wang was sure her club would be approved by the Democratic County Central Committee (DCCC) without incident, but when she and her other club members logged onto the Zoom meeting, they were sorely mistaken. ",
        "The group was met with backlash, accused of being racist, and even being secretly funded by Republicans. 'My mouth was agape,' Wang told the San Francisco Chronicle. 'Those allegations could not be more false.''Fighting systemic racism is one reason I’m involved in local Democratic politics. To me, it lifted the veil on how narrow of a definition they have of what being a Democrat means.' Even DCCC member Janice Li said the meeting gave 'mean girl' mentality. ",
        "'It’s that ‘You can’t sit with us’ mentality that makes me very uncomfortable with the state of San Francisco politics,' Li told the Chronicle. 'It’s very: \"You’re not even allowed in.\" It’s very Mean Girls.' San Francisco politics have always been a battle ground and the group planned on getting more voters registers in Districts One, Four and Seven, according to the San Francisco Chronicle, and they wanted families to get more involved, rather than ditching the city - hence why family was in their club's name. Wang wanted a more welcoming party for families, especially on the westside, where very few clubs existed. She even helped start the San Francisco Parent Coalition, which focused on recalling two of three school board members last year and a few parents she met there helped found her new club. ",
        "The club wanted to focus on improving the public school system, cleaning up the streets, getting more houses built, and strengthening the public transportation in the city - all causes local Democrats supported. In addition, they met all the requirements to be chartered - a point Honey Mahogany, a DCCC chairman, highlighted. Despite that, they were met with negativity and a local tenant activist even told them: 'F**k you.' 'F– you, Westside Family Democratic Club!' Jordan Davis said at the meeting. 'I yield my time! F– you!' ",
        "Davis has been to several political events in San Francisco and always used strong language and often left the podium yelling obscenities. Local Brandee Marckmann, who opposed the school board recall, starkly accused them of being conservative: 'I know a Republican when I see one.' DCCC members were reportedly grilling Parag Gupta - one of the parents from the parent coalition who helped found the westside club - who was left shocked by the harsh questioning. ",
        "They asked him their income levels, racial backgrounds, sexual orientations, gender identities, and even if they voted on the school board recall. 'We’re just starting out,' Gupta told the DCCC. 'We seek to be an inclusive club, and we seek to be representative of all demographics, genders, races and inclusive of all families. If someone considers themselves a family, we consider them a family.' Despite his attempt to reconcile the criticism, the DCCC garnered enough votes to shut them down temporarily - even though not all members voted. Keith Baraka, a DCCC member, abstained from voting due to the public commenters concerns, but later told the Chronicle that he had spoken with Wang and would support the group if they went up for charter again. Peter Gallotta, who voted to table the chartering, said he questioned why the club wanted to be chartered rather than just become an advocacy group. ",
        "'I think we need to reform our application process so we have more, and better, information as members before we give a stamp of approval,' he told the Chronicle. Mahogany, the only member to defend the group, said another charter vote will be set up soon."
    ]
}