{
    "articleURL": "/wires/ap/article-12060267/Americans-bet-220B-sports-5-years-legalization.html",
    "content": [
        "ATLANTIC CITY, N.J. (AP) - Americans have bet over $220 billion on sports with legal gambling outlets in the five years since the U.S. Supreme Court cleared the way for all 50 states to offer it, and the industry shows few signs of slowing despite some recent scandals that have put a spotlight on wagering safeguards.",
        "When Sunday's anniversary of the court ruling in a case brought by New Jersey arrives, two-thirds of the country will offer legal sports betting, with additional states likely to join in coming months or years.The fast-growing industry is also far-reaching: its advertisements reach into most U.S. homes during sporting events and even non-sports programming. Few TV viewers have been spared from repeated ads featuring a Caesar character discussing sports gambling with members of the Manning football dynasty, or from actor Jamie Foxx placing sports bets in between takes on a film set.\"While the milestones of legalized sports betting that have led up to now are remarkable, this industry is excitingly still far from being fully realized,\" said Jason Robins, CEO of DraftKings, one of the industry's two dominant companies. \"Legal betting is already part of mainstream sports culture, and I anticipate this trend will grow as adoption increases. The accessibility right now for fans to place a live, micro-bet during a game, for example, shares parallels with other smartphone-powered capabilities like hailing a ride, buying a stock, or playing a podcast.\"On May 14, 2018, the Supreme Court decided a case that had begun 10 years earlier in New Jersey as the longest of long shots: a bid to overturn a federal law, the Professional and Amateur Sports Protection Act, that restricted sports betting to just four states that met a 1991 deadline to legalize it.",
        "Since then, some once-unthinkable changes have happened: Professional sports leagues, which fought New Jersey tooth and nail right up to the Supreme Court in an ultimately unsuccessful effort to prevent legal betting, now partner with gambling companies, slather their ballparks with sports betting advertising and some even have betting outlets in their stadiums. Betting odds are now an integral part of broadcasts of many games.",
        "Legalization of sports betting has opened up opportunities: additional tax revenue for states, a small auxiliary revenue stream for casinos and horse tracks, and a way to keep many people away from the dangers of unregulated offshore gambling web sites.It's also caused problems: Those treating compulsive gambling say calls to their hotlines seeking help have increased significantly in the five years since sports betting was legalized and made available on cell phones. Keith Whyte, executive director of the National Council on Problem Gambling, says calls to the 800-GAMBLER help line have increased by 15% over the last five years as \"states began the fastest and largest expansion of gambling in our history.\"Several NFL players have been suspended for betting on games, and some colleges that struck partnerships with sports leagues illegally marketed sports betting to students under the legal age of 21, prompting leagues and gambling companies to revise their policies.",
        "Gambling integrity was in the news again last week when Ohio, Pennsylvania and New Jersey regulators ordered their sports books to stop taking bets on the University of Alabama baseball team after suspicious activity was identified in an Alabama-Louisiana State University game on April 28. Alabama baseball coach Brad Bohannon was fired amid an investigation that began when one of the numerous companies monitoring sports betting data and other activities found what it considered suspicious activity and tipped off gambling regulators. No criminal charges have been filed.The $220 billion figure includes wagers made through the end of March in most states, according to the American Gaming Association, the gambling industry's national trade group. It is up from the $125 billion that had been wagered at the four-year mark.Consider this: Sports books generally keep about 10% of all the money they handle, after paying out winning bets to customers.Achieving profitability has been a long, hard slog. FanDuel became the first to report a profitable quarter in the second leg of 2022 and expects to be profitable for 2023. DraftKings expects its first profitable quarter at the end of this year, and BetMGM expects to enter the black in the second half of this year.Sports betting has also kept the Meadowlands Racetrack in northern New Jersey, just across the Hudson River from New York City, alive.",
        "\"Sports betting has saved the day,\" said Jeff Gural, who operates the track in East Rutherford that includes a FanDuel sportsbook, which combined with FanDuel's online operation takes in nearly 50 cents of every dollar wagered on sports in New Jersey.\"I don't think the Meadowlands would be open as a racetrack now without sports betting,\" he said.The amount of money kept by sports books as winnings over the last five years is $17 billion, according to the American Gaming Association, the gambling industry's national trade group.Over that same period, sports betting taxes on operators have generated almost $3.6 billion: $3 billion for state and local governments, and $570 million for the federal government. In many cases, an individual state's take amounts to a drop in the bucket.While additional money for state governments was used as a selling point for legal sports betting, another goal was consumer protection, allowing customers to bet with entities regulated by the government, where their deposits are secure and there's no danger of a sports book suddenly disappearing with someone's cash.The avalanche of advertising for sports betting has also triggered a backlash, to the point where the gambling industry and most major professional sports leagues adopted stronger standards for their own advertisements. These were widely seen as an attempt not only to do something about the proliferation of gambling, and particularly sports betting ads, but also to be seen as doing something and hopefully head off threatened government regulation of sports betting ads.",
        "Five years in, just two companies - FanDuel and Draft Kings - control over 70% of the legal sports betting market in the US, according to the gambling analytics firm Eilers &amp; Krejcik.In the 12-month period ending with Feb. 2023, FanDuel has just under 46% of the market, while DraftKings has over 25%. BetMGM has nearly 12%, Caesars Entertainment has 6.7%, and no one else has more than 2.4%, the company said.What will the next five years look like? Chris Krafcik of Eilers &amp; Krejcik predicts more multi-faceted deals among teams, leagues and stadiums, and among betting operators and media companies, hotel chains, and beverage companies.Krafcik said sports betting companies could develop VIP-focused retail destinations, and look to expand \"hyper-casual\" online wagering.The trend of gambling companies locating sportsbooks in or next to pro sports stadiums is likely to continue. Sports books as a whole may slow down their promotional spending to rein in costs. And uncertainty should continue in the near term about the prospects for online sports betting in California, the nation's largest state, and in Florida, where it is tied up in litigation.The industry is constantly coming up with new ways to bet, too. One fast growing trend is so-called microbetting, which can be a series of rapid-fire bets. In baseball, it could involve how fast the next pitch will be; whether it will be put into play; whether that ball will be caught for an out, or become a single, double, triple or home run.",
        "Those who treat problem gambling are particularly concerned about this type of betting for its capacity to lure gamblers into one wager after another in a very short period of time, potentially racking up large losses quickly.___Follow Wayne Parry on Twitter at www.twiter.com/WayneParryAC"
    ]
}