{
    "articleURL": "/wires/pa/article-12043245/Chris-Packham-tells-tiger-fraud-libel-trial-People-know-I-m-not-Jason-Bourne.html",
    "content": [
        "Chris Packham has said people know he is “not Jason Bourne” and would not think he went “pliers in hand” to rescue tigers, the environmentalist has told the High Court.",
        "The TV presenter is suing three men for libel over nine articles which included claims he defrauded and “manipulated” people into donating to a charity to rescue tigers while knowing the animals were well looked after.The strongly denied allegations, repeated in several tweets and videos, relate to Mr Packham’s involvement with the Wildheart Trust, which runs a wildlife sanctuary on the Isle of Wight.Dominic Wightman, editor of the online site Country Squire Magazine, is defending the libel claim along with writer Nigel Bean and a third man, Paul Read.",
        "On the second day of the trial on Wednesday, the BBC Springwatch presenter began his evidence, spending most of the day in the witness box at the London court.Lawyers for Mr Wightman and Mr Bean have said the articles in the claim could be defended as true while Mr Read said he was not responsible for the publications as he was a “mere proofreader”.Nicholas O’Brien, representing Mr Wightman and Mr Bean, alleged Mr Packham fraudulently raised money by saying five tigers needed to be rescued from a circus when they did not need a rescue – allegations referred to in court as “tiger fraud”.In his written evidence, Mr Packham said the tigers, which had been used in a Spanish circus, had been left in a holding facility before they came into the care of animal welfare group AAP.",
        " I don’t think that at any stage the public were under the misapprehension that I was going out with pliers in hand to go and rescue the tigers myself  Chris Packham, environmentalist  They were then moved to the Wildheart Animal Sanctuary as their “forever home”.Discussing a fundraising video posted by Mr Packham about the need to “rescue” the tigers, Mr O’Brien said: “This was the beginning of a fundraising effort to support the transfer and accommodation of the tigers.“These tigers were at AAP and not in need of rescue whatsoever.”Mr Packham denied this, adding the tigers’ owners had “abandoned them in appalling conditions for nearly a year” and that AAP had limited capacity.He continued: “They are part of a chain of rescue. Whilst the animals were at AAP recovering and getting decent medical care, providing a forever home is very much part and parcel of a rescue process.”Mr O’Brien said Mr Packham was involved in a “sustained” fundraising campaign based on “misleading statements” about the tigers’ status and history.He said: “You have allowed members of the public to believe that the tigers are in immediate danger – that you have yourself been trying to rescue them.”Mr Packham told the court “people know me as not Jason Bourne” and they would not think he was cutting the bars of circus cages.",
        "He also said: “I don’t think that at any stage the public were under the misapprehension that I was going out with pliers in hand to go and rescue the tigers myself.“We were very clear about the role of AAP and our role in the rescue process,” he said, adding: “I refute your allegation that we have attempted to mislead the public.”Mr O’Brien asked: “If those tigers had been unlawfully locked up in a zoo and you sent people with wire cutters to free them, that would be a rescue.”Mr Packham replied: “I suppose in a James Bond sense they could.“We would go through all the necessary legal hoops. We wouldn’t be busting into a zoo.”The trial before Mr Justice Saini is due to conclude on May 12, with a decision expected at a later date."
    ]
}