{
    "articleURL": "/tvshowbiz/article-12038539/Doja-Cat-blasted-VAPING-Met-Gala-despite-ban-smoking-throat-surgery.html",
    "content": [
        "Doja Cat has been blasted for vaping on the Met Gala despite Anna Wintour banning smoking and it being nearly a year after she had an abscess surgically removed from her throat.",
        "Eagle-eyed fans caught the talented 27-year-old singer and rapper - who also left an interviewer baffled that night - exhaling a cloud of vapor in the background of the Vogue livestream.Many took to social media to call out the star - real name  Amala Ratna Zandile Dlamini - given the event's rules and her prior operation.One Twitter user wrote: 'did she or did she not like JUST have throat surgery and cancel her your cause of vaping? [skull emoji] lmaooo'Another shed light on Vogue editor-in-chief Anna Wintour's ban on vaping and smoking at fashion's biggest night as they wrote: 'doja's ass is never being invited back to the met gala because she was vaping i'm crying.'",
        "DailyMail.com reached out to reps for Doja Cat. It has been made clear that there was no nicotine in the device and that it only had contained a flavored water vapor.In May 2022, the Woman hitmaker had said that she was done vaping after undergoing surgery on one of her tonsils to remove an abscess.The singer-songwriter revealed her procedure to fans in a tweet she posted May 19, 2022 where she also said that she may soon have bad news for fans.'dr. just had to cut into my left tonsil. i had an abscess in it. my whole throat is f**ked so i might have some bad news for yall coming soon,' the Kiss Me More singer said.",
        "'i was taking f**kin antibiotics but forgot that i was taking them and then i drank wine and was vaping all day long and then i started getting a nasty a** growth on my tonsil so they had to do surgery on it today,' she explained. She then gave fans way more information than many of them wanted with a series of tweets that followed. 'he poked up in dere with a needle twice and then sucked all the juice out and then he took a sharp thing and cut it in two places and squoze all the goop out in dere,' she wrote. 'i cried and it hurt a lot but im ok.'She then explained that she was planning on quitting the vape for a while but said she wouldn't throw it out when one fans suggested it.",
        "'Throwing them away just instills panic. I'm addicted but I'm not weak,' the Woman singer wrote. 'I was literally staring at my vape today that normally i'd hit a thousand times a day and hit it two times instead. I'ma try to go cold turkey for now but hopefully my brain doesn't need it at all by then.'She went on to say that throwing away the vape wouldn't help because 'Right now I NEED THEM. I don't WANT them rn because im in pain. But my brain is addicted to it.'",
        "Meanwhile Wintour, 73, has also made it clear that smoking is the number one offense for anyone who is able to make the guest list.Museum curator Andrew Bolton was asked the 'best way to never be invited back again' during a CBS Mornings interview which aired Monday morning to which he simply responded: 'Smoking.' That same night Doja left an interviewer baffled as she meowed through an entire red carpet chat at the Met Gala 2023.The rapper dressed as late Chanel icon Karl Lagerfeld's famously pampered feline Choupette as she posed up a storm in a glittering white dress, complete with cat ears and heavy facial prosthetics.As she walked the red carpet she was stopped by TikTok journalist Emma Chamberlain who proceeded to ask her a series of questions but she answered with nothing but meows.The Vogue interviewer took in her incredible dress and asked - 'so who made it?' to which she replied with a meow.",
        "The interviewer then looked taken aback and simply said 'wow' while looking around awkwardly. She then carried on trying to do the interview properly and said: 'Okay then, something a little bit different. So what was your inspiration for tonight - be honest with me and give me some detail.'Again Doja Cat simply replied with a series of longer meows as the journalist looked on helplessly and even covered her mouth with her hand in shock.",
        "She then continued with her questions and asked: 'So what are you excited to see? Is it your first Met?'And continuing her theme Doja Cat simply meowed back at her.  Doja Cat transformed into a feline with striking facial prosthetics as she made an unrecognizable turn on the red carpet at the event.She dressed as Choupette as she posed up a storm in a glittering white dress, complete with cat ears - leading the stars who dressed as the cat for the event.Doja, who is no stranger to eye-popping red carpet looks, wore heavy facial prosthetics which gave her a cat-like nose, mouth and lifted upper eyes as she arrived.The star's gown featured cute cat ears and a glittering open back, with the dress flowing into a dramatic ruffled train.",
        "The star sported feline flicks of liner and a collection of dazzling jewelery.Jared Leto donned a full furry suit in Choupette's likeness for the carpet while Lil Nas X stripped off and was covered in silver paint and whiskers for his turn on the red carpet.The biggest night in fashion took place on Monday night with a slew of the industry's most notable stars walking the red carpet to showcase their glamorous and daring looks.",
        "The 2023 Met Gala returned to the Metropolitan Museum of Art in New York City, with everyone from Kim Kardashian to Paris Hilton attending the fundraising event.Since 1948, stars have ascended the majestic staircase into a very exclusive party where no selfies are allowed.In keeping with tradition, the event was held on the first Monday of May and the annual extravaganza kicked off at 6:30PM EST on May 1.The ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019.His beloved cat, Choupette, was even invited to the festivities. The decision to honor Karl sparked controversy given the many offensive remarks he has made over the years, from slamming the #MeToo movement to opposing same-sex marriage.'I'm against it for a very simple reason: In the 60s they all said we had the right to the difference. And now, suddenly, they want a bourgeois life,' he told Vice of same-sex marriage. 'It's difficult to imagine—one of the papas at work and the other at home with the baby. How would that be for the baby? I don't know. I see more lesbians married with babies than I see boys married with babies. And I also believe more in the relationship between mother and child than in that between father and child.' ",
        "While he ultimately showed his support for same-sex marriage at his spring 2013 Chanel haute couture show, he still said he was 'less keen' on same-sex couples adopting children, according to AP.Along with the Vogue editor-in-chief, Anna Wintour, who runs and hosts the annual event, the 2023 MET Gala was co-hosted by Penelope Cruz, Dua Lipa, Michaela Coel and also Roger Federer.While the show may be known for its glitzy and over-the-top red carpet - with details of what occurs inside often remaining mysterious - at its heart, it is a fundraising event for the Metropolitan Museum of Art's Costume Institute.Last year, the 2022 MET Gala alone raised a grand total of $17.4 million, reported Billboard. This year the price of admission was raised from $30,000 to $50,000, according to Page Six. But even if you have the funds, that doesn't guarantee you entry into the party.Every guest has to be invited, and a waiting list exists for the coveted golden ticket.And status matters, according to The New York Times, meaning the hottest stars are a shoo in for an invite.Heiress Paris was among the biggest names to attend the event, in what marked her first ever Met Gala.However it didn't go off without a hitch, as her grand Met Gala entrance was blocked by angry climate change protestors who laid in front of her vehicle.But the small disruption didn't stop the billionaire from arriving on the red carpet and stunning an off-the-shoulder leather dress.The best dressed of the night included Met vet Kim, who wowed in an incredible pearl dress, as she seemingly revisiting her Playboy look from 2007 by accident.Kim wore custom Schiaparelli, covered in 50,000 pearls that were hand-strung and draped onto her body.The mother of four revealed that she wanted pearls because 'what is more Karl' than 'iconic Chanel pearls,' she said during her interview on Vogue.com's livestream.",
        "Pregnant Rihanna, Gisele and Emily Ratajkowski also honoured Karl in their statement gowns as they brought their A-game to the red carpet.Meanwhile, Blake Lively, a frequent attendee, announced she would not be attending the party this year. 'I will be watching,' she said, according to People.As for Wintour's role in the bash, Vogue's editor-in-chief organises the party and oversees the guest list and even the menu. She has served as the Met Gala's chairwoman since 1994 and continues to serve look after look at every event."
    ]
}