{
    "articleURL": "/wires/ap/article-12054871/Elevated-cancer-rates-near-Kansas-chemical-spill.html",
    "content": [
        "WICHITA, Kan. (AP) - Kansas health officials have identified elevated levels of liver cancer among people living in several historically Black neighborhoods in Wichita where groundwater was polluted by a rail yard chemical spill.",
        "The Kansas Department of Health and Environment released a study Friday that found a liver and biliary tract cancer diagnosis rate of 15.7 per 100,000 people in the contamination zone, which was more than double the statewide rate of 6.4 per 100,000, The Wichita Eagle reports.Among non-Hispanic Black residents, the diagnosis rate was even higher, at 23.9 per 100,000.Experts believe that the spill of trichloroethene (TCE), a common solvent that is used to clean off paint and remove grease, could have happened as early as the 1970s, although it wasn't identified until 1994. It created a plume of polluted groundwater that runs for 2.9 miles (4.67 kilometers) from the Union Pacific Railroad rail yard site.TCE can cause cancer in humans - \"especially kidney cancer and possibly liver cancer and non-Hodgkin lymphoma,\" according to the U.S. Environmental Protection Agency.But State Epidemiologist and Environmental Health Officer Dr. Farah Ahmed cautioned that there is no way to know definitively if TCE is responsible for the outsized number of liver cancer diagnoses.\"The study can only really report on whether an increase was observed, not the cause of the increase,\" Ahmed said.According to the Kansas Department of Health and Environment report, all but one of the nearly 2,800 properties in the contaminated area were connected to city water before the spill is believed to have occurred, meaning it´s unlikely people would have drank directly from contaminated groundwater wells. But there are other risk factors for TCE exposure, which occurs when a person breathes, ingests or touches the chemical.",
        "According to the EPA, water is contaminated if it contains more than 5 parts per billion of TCE.Two thirds of the 66 water quality tests conducted in May 2021 - 40 to 50 years after the chemical spill - found samples with higher-than-acceptable levels, including samples of as much as 823 TCE parts per billion.Sedgwick County Commissioner Ryan Baty was critical of health officials during a briefing Friday.After hosting a forum about the contamination site in 2003, the state did not hold another public meeting about it until November 2022, when community members learned about the presence of TCE for the first time and asked for a health study to be conducted.\"This is really a systematic failure of communication,\" Baty said.Wichita City Council member Brandon Johnson said the city and county are working to secure free cancer screenings for residents and former residents of the affected area. Officials want Union Pacific to contribute to the cancer screening fund, but the railroad could not be reached for comment by the paper.The railroad is already on the hook to pay $13.9 million for the cleanup, which started nearly a decade ago."
    ]
}