{
    "articleURL": "/wires/reuters/article-12048213/Belize-PM-signals-possible-break-British-monarchy-Guardian.html",
    "content": [
        "May 4 (Reuters) - Belize Prime Minister Johnny Briceno said the country is \"quite likely\" to be the next state to leave the Commonwealth and become a republic, The Guardian newspaper reported on Thursday, days before Britain crowns its next monarch.",
        "Similar interest has been shown by the Bahamas and Antigua and Barbuda, fellow Caribbean members of the 56-country association that evolved out of the British Empire, almost all former colonies, and includes about 2.5 billion people.In an interview with The Guardian, Belize's center-left prime minister did not specify if he would draft a bill to become a republic, but the motion would first need parliamentary approval before being put to a public referendum.A Lord Ashcroft opinion poll published this week found that 43% of Belize respondents said they would vote to become a republic if a referendum were called tomorrow, and 9% said they were unsure or would not vote. Michael Ashcroft is a peer and businessman who runs the polling company. He is a former senior figure in the Conservative Party.In the interview with the Guardian, Belize's Briceno also criticized UK Prime Minister Rishi Sunak's refusal to apologize for Britain's role in the transatlantic slave trade, which enslaved and killed millions of people over four centuries.Indigenous organizations from 12 Commonwealth countries had on Wednesday called for a formal apology for crimes against humanity committed under colonial rule and a process of reparatory justice.Caribbean nations have long urged governments to apologize and pay financial compensation such as aid or debt forgiveness to help address economic disadvantages faced by people of color.",
        "The Ashcroft poll found that clear majorities in England, Scotland and Wales opposed the idea of King Charles issuing an apology for the UK's role in slavery.Jamaica, which has a bitter history of slavery, has already begun a process to decouple from the monarchy, following in the footsteps of Barbados in 2021, Dominica in 1978 and Trinidad and Tobago in 1976. (Reporting by Sarah Morland in Mexico City, Jose Sanchez in Belmopan and Kate Chappell in Kingston; editing by Grant McCool)"
    ]
}