{
    "articleURL": "/wires/ap/article-12043761/Real-not-reported-Kremlin-drone-attack-unsettles-Russia.html",
    "content": [
        "TALLINN, Estonia (AP) - As Russian officials tell it, two Ukrainian drones flew into the very heart of Moscow under the cover of darkness, reaching the Kremlin before they were shot down at the last minute.",
        "A cloud of questions hangs over the claim.Why did the Kremlin announcement come about 12 hours after the purported incident? Why did no reports of explosions emerge prior to the announcement on the messaging apps that remain full of chatter despite Russia's crackdown on media and criticism of the war in Ukraine? Why didn't videos of the purported attacks appear until after the announcement? Why haven't the images been verified?A drone attack on the Kremlin would be the most severe penetration of Russian airspace since German teen Matthias Rust landed his little single-engine plane on the fringes of Red Square in 1987. Announcing the attack - or even faking it - risks Russia undermining its citizens' trust in its frequent assertions of military superiority.Adding to that humiliation is that the incident occurred less than a week before Victory Day, Russia's paramount military holiday. In some of the videos of the claimed attack, the decorated viewing stands and tribune for the day's ritual Red Square military parade can be seen prominently.For President Vladimir Putin, the confession of Ukrainian drones reaching the Kremlin could be justification for a brutal step-up of attacks on Ukraine. Russian officials persistently contend - repeated evidence to the contrary - that the military goes after only military targets.",
        "Severe retaliation is already in the wind, including threats aimed specifically at Ukrainian President Volodymyr Zelenskyy, who denied attacking the Kremlin.\"After today's terrorist act, no variant remains other than the physical elimination of Zelenskyy and his clique,\" said former Russian president and deputy chairman of the Russian security council, Dmitry Medvedev,The chairman of the powerful lower house of parliament, Vyacheslav Volodin, compared the Ukrainian government with the terrorist Islamic State and said he will demand \"the use of weapons capable of destroying it.\"Russia´s nuclear doctrine says the country can use nuclear weapons if it comes under a nuclear strike or if it faces an attack with conventional weapons that threatens \"the very existence\" of the Russian state. The West has accused Putin of nuclear saber-rattling during the Ukraine warBut Phillips O'Brien, a professor of strategic studies at University of St. Andrews, downplayed the possibility related to the alleged Kremlin attack.\"You´re not going to say, `Now that there has been an attack with a tiny drone, now we can go nuclear,´\" he said.Commentator Abbas Gallyamov, a former Putin speechwriter who has fled the country, also raised doubts.\"If enemy drones reach the Kremlin, it means that any other object on the territory of the European part of Russia is generally defenseless,\" he said. \"Therefore, I do not believe that this was a provocation conceived by the Kremlin in order to influence public opinion.\"",
        "If Ukraine had indeed attacked, \"consider it a performative strike, a demonstration of capability and a declaration of intent: Don´t think Moscow is safe,\" said Mark Galeotti, a Russian military and security analyst at University College, London.Less clear, he said on Twitter, \"is whether it shakes Russians´ nerve or angers them.\"Russians' nerves already have been frayed by attacks, either likely from Ukraine or from domestic opponents, that have risen sharply in recent weeks.Two freight trains derailed this week in bomb explosions in the Bryansk region that borders Ukraine. Notably, the region's authorities did not blame Ukraine, which could be an attempt to whitewash Ukrainian sabotage capacities.But Bryansk authorities in March claimed that two people were shot and killed when alleged Ukrainian saboteurs penetrated the region. The region also has been hit with sporadic cross-border shelling, including one that killed four people in April.Ukrainian drones reportedly have penetrated deep into Russia several times. In December, Russia claimed to have shot down drones at airfields in the Saratov and Ryazan regions. Three soldiers were reported killed in the attack in Saratov, which targeted an important military airfield.Earlier, Russia reported shooting down a Ukrainian drone that targeted the headquarters of its Black Sea Fleet in Sevastopol in Russia-annexed Crimea.",
        "In addition, two prominent supporters of Russia's war in Ukraine have been killed on their home ground. Darya Dugina, a commentator with a nationalist TV channel, died in a car bombing outside Moscow that officials blamed on Ukraine. And authorities said Ukrainian intelligence was behind the killing of prominent pro-war blogger Vladlen Tatarsky, who was killed in April when a bomb inside a statuette he was handed at a party exploded.___Follow AP's coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"
    ]
}