{
    "articleURL": "/wires/ap/article-12061121/Chaos-Kumbaya-How-debt-limit-standoff-end.html",
    "content": [
        "WASHINGTON (AP) - Just how does this debt limit standoff end?",
        "Plenty of scenarios are being publicly and privately gamed out, but no one knows for sure. The possibilities range from kumbaya to economic chaos with plenty of possibilities in between.So far, neither President Joe Biden nor House Speaker Kevin McCarthy, R-Calif., is giving ground ahead of talks slated for Tuesday. Biden wants to increase the government's $31.4 trillion legal borrowing limit, so that the federal government can continue to pay its bills and the risk of a historic default goes away. McCarthy and other GOP lawmakers want a deal that guarantees trillions of dollars in spending cuts before they sign on to raising the debt limit.Time is short: The Treasury Department warns the U.S. could default as soon as June 1 if there is no deal.A look at potential outcomes:LET'S AGREE TO DISAGREE",
        "The president wants to disarm the whole debate by having Republicans make a public commitment that the U.S. won't default. He'd then be ready to discuss spending, taxes and other budget issues.He wants an assurance from McCarthy that the U.S. can keep paying all of its bills by having the ability to keep borrowing. The president says he's ready to have a public debate with GOP lawmakers about the budget, just not with the world's largest economy held \"hostage.\"",
        "\"As I´ve said all along, we can debate where to cut, how much to spend, how to finally move the tax system where everybody begins to pay their fair share,\" Biden said. \"But not under the threat of default.\"It's unclear how many GOP lawmakers share his definition of default. Some suggest a default would only apply to unpaid debt, while the administration wants to include the salaries of federal workers, repayments for contractors and aid to the poor, veterans, schools and others.Shortly before the House narrowly passed a bill with $4.5 trillion in deficit savings along party lines, McCarthy said the U.S. would not default. But he is still linking that issue directly to spending cuts in a way that Biden wants to avoid.\"Addressing the debt requires us to come together, find common ground, and reduce spending,\" McCarthy said last month. \"Let me be clear: Defaulting on our debt is not an option, but neither is a future of higher taxes.\"REPUBLICANS HOLD TIGHTCongressional Republicans could hold firm and force Democrats to wobble.McCarthy has a slim majority in the House: 222 Republicans, compared to 213 Democrats.His debt limit bill would reverse discretionary spending to 2022 levels, then place a 1% cap on increases going forward. The bill also would reverse Biden's forgiveness of student loan debt, his increased funding for the IRS and the tax incentives created in 2022 to encourage the adoption of clean energy. Those cuts would extend the debt limit through March 31, 2024, or up to an additional $1.5 trillion.",
        "GOP conservatives such as South Carolina Rep. Ralph Norman and others say they won't back anything less than that bill House Republicans passed on April 27 with 217 votes.But Senate Majority Leader Chuck Schumer, D-N.Y., won't let that bill make it through the Senate. Neither will Biden. The question as the deadline approaches is whether Republicans stay united and that causes Democrats to cave. There is also the risk that dissent within the GOP caucus could put McCarthy's speakership at risk, which could then make it even more challenging to reach an agreement.The question is what kind of an agreement could get through the House, the Senate and the Oval Office.GET AN EXTENSIONWashington loves to put things off - the old \"kick the can down the road\" routine.There is the possibility that lawmakers could agree to a short-term extension, pushing the debt limit expiration to Sept. 30, when a federal budget also needs to be passed.This would be in line with the GOP's effort to sync the budget debate with the debt limit, while also removing the immediate risk of a default. It's the option government officials generally discuss in private with the most optimism.Still, House Minority Leader Hakeem Jeffries tried to pour cold water on that idea in a Sunday interview with NBC News.",
        "\"I don´t think the responsible thing to do is to kick the can down the road,\" Jeffries said, even as he prioritized the importance of avoiding a default.MARKETS GO CRAZYWall Street could save the day, sort of, by having a meltdown.Along with economists, Senate Budget Committee Chairman Sheldon Whitehouse, D-R.I., has indicated that a stiff market selloff could force Republicans to retreat. Their donors would holler about the pending financial losses and give every lawmaker an incentive to be the hero and rescue the jobs and retirement savings of millions of Americans.Joe Brusuelas, chief economist at the consultancy RSM US, said in a Monday email that the talk of a potential default already is making it more expensive for investors to buy insurance on U.S. Treasury notes. But the panic is largely contained, so far, from the broader stock market that many voters and lawmakers follow.14th AMENDMENTBiden could play the Constitution card.The 14th Amendment became part of the Constitution after the Civil War. It states that the \"validity of the public debt of the United States, authorized by law, ... shall not be questioned.\"Laurence Tribe, an emeritus Harvard University law school professor, wrote Sunday in The New York Times that Biden can argue he has a constitutional duty to avoid default and thus can blow past the debt limit to continue the spending Congress has already approved. On Monday, a union of government employee s sued Treasury Secretary Janet Yellen and Biden to make the argument that they are constitutionally obligated to disregard the debt limit.",
        "As a former senator, Biden likes to defer to Congress. But when pressed about invoking the 14th Amendment during last week, he kept his options open.\"I´ve not gotten there yet,\" he told MSNBC.Sen. James Lankford, R-Okla., said Biden cannot act unilaterally. He told ABC News that the Constitution is \"very clear that spending - all those details around spending and money actually has to come through Congress.\"MINT A COINThis is among the many creative - and unlikely - solutions circulating on the internet. The idea is that the government could mint a $1 trillion platinum coin and use it to avoid a default. Basically, there is a loophole in the law that could allow the U.S. to mint a coin of any denomination if it's made of platinum.That has at least one big problem: Yellen ruled out the idea in a January interview with The Wall Street Journal, calling it \"something that's a gimmick.\"DEFAULTThis is the scariest possibility.If there's no deal, the U.S. government could reach its \"X-date\" - the moment when it no longer can pay all of its bills. The Treasury Department would no longer be able to use accounting strategies to keep the government open. If the government were no longer able to borrow, unpaid bills would mount and the government would default.",
        "But, but, but ... not all defaults are the same.The U.S. could briefly miss some payments, and the risk of things getting worse could jolt lawmakers into reaching a deal. But even a \"brief\" default would cost the economy 500,000 jobs, according to a White House analysis. A \"protracted\" default would cost 8.3 million jobs, according to the analysis, almost as many job losses as there were during the 2008 financial crisis."
    ]
}