{
    "articleURL": "/tvshowbiz/article-12039413/How-did-MasterChef-star-Jock-Zonfrillo-die-police-say-death-not-treated-suspicious.html",
    "content": [
        "Jock Zonfrillo died of natural causes and nothing unusual or suspicious was discovered in the hotel room where he was found dead, Daily Mail Australia understands.",
        "The MasterChef star, 46, was found dead by police at Zagame's House hotel in Melbourne at about 2am on Monday, just metres away from his former inner-city home in Carlton.Daily Mail Australia can reveal that when the police entered the hotel room to conduct a welfare check, officers believed that Zonfrillo had died of natural causes and found nothing unusual or suspicious.It will now be for the Coroner to determine the specific cause of death.",
        "When Victoria Police confirmed the death of MasterChef Australia star Jock Zonfrillo, they issued a statement saying his death was 'not being treated as suspicious'.This phrase is often used by police media officers when a famous person has died - but what exactly does it mean? And does it suggest a particular cause of death?In the simplest terms, when a death is not thought to be suspicious, it means nobody else was involved.This could mean the person died by accident, natural causes or suicide.",
        "When police say a death is 'not being treated as suspicious', it implies they are sure, beyond reasonable doubt, that no crime could have occurred.By contrast, a death is considered suspicious when its circumstance or cause is medically or legally unexplained, or inadequately explained.Zonfrillo, who was appointed a judge on MasterChef in late 2019, was found dead by police at the Melbourne hotel Zagame's House at about 2am on Monday.",
        "A Victoria Police spokesperson told Daily Mail Australia: 'Police attended a Lygon Street address for a welfare check and located a man deceased about 2am on May 1.'The 46-year-old man's death is not being treated as suspicious.'A report will be prepared for the coroner.Zonfrillo is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.",
        "The hotel where he died is metres away from his former inner-city home in Carlton.He and his family had moved out of the four-bedroom townhouse to start a new life in Rome three weeks earlier.Their old home went back on the rental market in April for $3,000 a week.Before he died, Zonfrillo had come back to Australia to promote the fifteenth season of MasterChef, which was due to premiere at 7:30pm on Monday night but has since been postponed.His wife and children stayed behind in Rome and were expecting Zonfrillo to rejoin them once he had completed his publicity duties for Channel Ten this week.For confidential support call the Lifeline 24-hour crisis support on 13 11 14 "
    ]
}