{
    "articleURL": "/sport/football/article-12050743/Sam-Allardyce-admits-hes-looking-emulate-success-Roy-Hodgson-Neil-Warnock-Leeds.html",
    "content": [
        "Sam Allardyce wants to keep Leeds up to match the success of other managersRoy Hodgson kept Crystal Palace in the top flight after replacing Patrick VieiraNeil Warnock pulled off a great escape with Huddersfield in the Championship  Sam Allardyce wants to do it for the 'oldies' by becoming the third veteran manager to rescue a side this season following the feats of Roy Hodgson and Neil Warnock.",
        "The 68-year-old has been brought in as the boss of relegation-threatened Leeds for their final four games, beginning his survival mission at league leaders Manchester City on Saturday.Allardyce's return to football comes after 75-year-old Hodgson was reappointed at Crystal Palace in March and steered them to Premier League safety. Warnock, meanwhile, completed a great escape in the Championship with Huddersfield on Thursday after returning there in February at the age of 74.'I am hoping it is going to be a trio,' said Allardyce. 'There's Roy, Neil and me and I hope I get something similar to them in terms of results in the next four games. It would be good for the oldies, wouldn't it?'When Allardyce was unveiled at Leeds on Wednesday, he claimed that 'far too many people think I'm old and antiquated' and that he is 'as good' as Saturday's opposite number Pep Guardiola. ",
        "In response, the City boss admitted Allardyce 'is right' and that he, Hodgson and Warnock have 'incredible experience' and 'know the game perfectly'. 'We have always got on,' said Big Sam on Guardiola. 'He is a great guy. I think he is brilliant and done a huge amount for the Premier League. 'It is great to be pitting your wits against coaches like him.",
        "'Let's hope an element of surprise works in our favour. 'Pep can second guess based on what I've done in the past but that is quite a while ago and it's a different team.'Defensively, the team will have to be the best it's been this season. It's been a bit frail but we are going to try to put that right while we are here.'Allardyce has also tried to lighten the mood on the training ground and admits he has been delighted with how his players – who have not won in five games – have responded.",
        "'I couldn't be any more pleased about the fact the players have aired their views, which is very important for me,' he said.'We have created a bit of an atmosphere and made the training ground a nice place to come. If I find an opportunity, I crack a joke. I am trying to put a smile back on the face.'There's been a bit doom and gloom and we have to try to lift that. We can do that to a certain degree, but the only way we lift that in the end is to start getting the results. After the game, I'd like to be able to smile because that will be one magnificent result for me if we get one.'",
        "Allardyce also dropped a big hint he will drop out-of-sorts goalkeeper Illan Meslier and replace him with Joel Robles at the Etihad on Saturday. 'It is probably the biggest decision I have to make,' he added. "
    ]
}