{
    "articleURL": "/wires/aap/article-12047831/Victorian-injecting-laws-pass-marathon-debate.html",
    "content": [
        "Victoria's only medically supervised injecting room will become permanent after state parliament pushed through controversial new laws during a marathon sitting.",
        "A bill to make the North Richmond facility permanent passed the upper house 22 votes to 14 late on Thursday night following more than seven hours of debate.\"This is not a straight forward proposition,\" Labor minister Harriet Shing told the chamber.\"But for that service we would be in a situation where that part of Melbourne would be riven with an ever-growing volume of drug-related activity; the type of which has caused so much concern for so many people speaking in the chamber this evening.\"Bedding this facility down into a permanent operation will enable move lives to be saved.\"The Drugs, Poisons and Controlled Substances Amendment (Medically Supervised Injecting Centre) Bill 2023 will be sent to the governor for royal assent.Amendments to the legislation from the Greens, coalition, Legalise Cannabis and the Liberal Democrats were all defeated.The Greens were pushing for pregnant women and people under 18 to be able to use the centre in line with an independent review recommendation that was rejected by the government.Under the coalition's proposed \"safe zone\" changes, the North Richmond facility would have been required to move more than 250 metres away from a nearby school.Ms Shing suggested enrolments at the school had remained \"largely stable\" over the past five years, and said fencing was upgraded, an electronic lock and video intercom system added and CCTV cameras set up to keep students safe.",
        "The supervised injecting room was opened in June 2018 as part of a two-year trial, which was extended until mid-2023.The centre has been highly contentious but the independent review, led by public health researcher John Ryan, found it safely managed almost 6000 overdoses and saved 63 lives.Liberal MP Nick McGowan accused the government of misrepresenting data from the report to tell Victorians that the injecting room saves lives.\"It is a lie. It is verbal diarrhoea,\" he told the upper house.As of March, there were 50 heroin-related deaths in the local council area in the 42 months since the facility opened, down from 68 deaths during the preceding 42 months.A second supervised injecting room has been earmarked for central Melbourne after the government bought a building near Degraves Street.Former Victoria Police commissioner Ken Lay is expected to hand his long-awaited final report on a possible location for the second facility to the government by the end of the month."
    ]
}