{
    "articleURL": "/news/article-12051071/Mystery-500lb-pounds-alphabet-noodles-pasta-dumped-NJ-lake-solved-neighbor.html",
    "content": [
        "Keith Rost, 33, of Old Bridge, said his military veteran neighbor was the culprit behind the 500lbs of dumped pasta at Iresick Brook in New JerseyRost said his neighbor, who was not named, was moving out of his mother's home after her death and suspected the extra pasta was from a COVID stockpileThe bizarre pollution was discovered last month when a resident took a stroll along the wooded area near their home in Old Bridge The mystery behind why 500lb of pasta was dumped at a New Jersey stream may have been solved by a local man who claims a veteran clearing out his late mother's home is responsible. ",
        "Keith Rost, 33, of Old Bridge, said the unidentified man dumped the oodles of alphabet noodles and pasta at Iresick Brook on April 28 after his mother died. He said he believed the man's mother had stockpiled the food during the pandemic and was simply trying to ditch the excess. 'I really feel like he was just trying to clear out his parents' house and they were probably stocked up from COVID,' Rost told NBC New York. 'My grandparents always had a cupboard full of cans and pasta, just to be safe.' Rost claims that the pasta was uncooked when it was dumped, but heavy rains had softened the massive mound, making it appear that it was cooked. The city cleaned up the mess on the same day, to Rost and his neighbors' relief.  'That would have been a big mess to start cleaning all the flies in the house [and] maggots,' he told NBC New York. ",
        "The bizarre pollution was discovered last month when a resident taking a stroll along the wooded area near their home in Old Bridge Township spotted the peculiar piles of pasta.The resident initially contacted their township to report the dump, then contacted local advocate Nina Jochnowitz, who previously ran for city council in the sixth ward.",
        "Jochnowitz told DailyMail.com: 'The resident thought it was hay at first but when they got closer saw it was tons of cooked pasta.'She followed up with her own email to the township, but when she also did not hear back, she took the matter into her own hands and went down to the site to take pictures. She posted the mountains of carbohydrates on her public Facebook page for locals to eat up.Within hours public works cleaned up the needless noodles. 'You might say, 'Who cares about pasta?' But pasta has a PH level that will impact the water stream,' Jochnowitz told The Philadelphia Inquirer.'That water stream is important to clean up because it feeds into the town's water supply...It was one of the fastest cleanups I've ever seen here.'Jochnowitz praised Public Works Director Kasey Lenning for their response but took the opportunity to note the public cleanup issues plaguing the area which she said has become an eyesore and a 'dumping area' where garbage is thrown.'We are the only town in Middlesex County that has failed to provide bulk garbage pickup for its residents,' she said. 'This has been going on for at least a decade.'",
        "Old Bridge Township located in Middlesex County has a population of 66,000.",
        "'The Department of Public Works cleaned it up. They are a great group of people. When given the right opportunity they do the right thing,' she said. 'Unfortunately, they are typically overwhelmed.'The garbage issue has been a bone of contention with many of its residents and with Jochnowitz when she was running for office.'The Mayor [Owen Henry] thinks the $20 cost for bulk garbage pickup for each homeowner is too much money and I brought it up when I was running for city council and it has been a conversation for years.'She added: 'When it rains here, it smells like sewage.'The local advocate shared another mess she coordinated and got cleaned up was when 300 tires were thrown in an estuary lake She said the county helped clear it out, but a pile of trash from the incident still remains that the township still has not removed, the Inquirer reported."
    ]
}