{
    "articleURL": "/tvshowbiz/article-12055483/As-Eurovision-comes-Liverpool-160-million-viewers-including-King-No-pressure-Mae.html",
    "content": [
        "This year’s Eurovision Grand Final in Liverpool has the Royal seal of approval King Charles told Mae Muller that he would be ‘watching with great interest’This year’s Eurovision Grand Final has the Royal seal of approval. During a visit to the venue, the Liverpool Arena, the King told the UK entrant Mae Muller that he would be ‘watching with great interest’ and ‘egging her on’. ‘Thank you. No pressure,’ she joked.",
        "Eurovision is one of television’s great event nights. Whether you’re a super-fan or you couldn’t care less, it provides spectacle, a real sense of watch-along community and some brilliant pop music.At last year’s contest, held in Italy, the UK fielded its strongest entry for years with Sam Ryder’s Space Man, but no one begrudged the Ukrainians their victory with Kalush Orchestra’s ebullient Stefania.In happier times, this year’s event would have been held in Ukraine but, because of the Russian invasion, the UK offered to host and Liverpool won the contest to stage it.For the first time in the UK’s Eurovision history, both semi-finals (Tuesday and Thursday, 8pm) will be live on BBC1. UK viewers can vote in the second semi-final. But it is the final, in which 26 countries compete, that is set to attract more than 160 million viewers globally.",
        "Graham Norton and Mel Giedroyc (top, with commentator Rylan Clark) will provide the waspish commentary, while Ted Lasso’s Hannah Waddingham, pop star Alesha Dixon and Ukrainian singer Julia Sanina take on hosting duties.A performance from Kalush Orchestra will get the show under way, and we’ll hear from 2022 runner-up Sam Ryder during the first interval. The second interval act celebrates Liverpool’s pop heritage, with six past Eurovision acts reinterpreting some classic hits.",
        "The beauty of Eurovision is that you can watch it with amused detachment, you can watch it as a competition and try to work out the various countries’ voting strategies based on their geo-political allegiances, or you can watch it simply as a pop music festival.And who is going to win? At the time of writing, the bookies have Sweden’s entry, Tattoo, sung by 2012 winner Loreen, as the odds-on favourite. The UK’s entry, Mae Muller’s I Wrote A Song, is less favoured but it’s certainly not out of the running."
    ]
}