{
    "articleURL": "/sport/nhl/article-12061255/Chicago-Blackhawks-win-NHL-draft-lottery-putting-inside-track-draft-Connor-Bedard.html",
    "content": [
        "Chicago picks first for the first time since 2007 when they took Patrick KaneConnor Bedard finished his WHL season with 143 points in only 57 games DailyMail.com provides all the latest international sports news After a season full of struggle and strife, the Chicago Blackhawks have won the NHL draft lottery and have claimed the No. 1 overall pick.",
        "This is the first time Chicago has won the NHL draft lottery since 2007, when they selected Patrick Kane.With this pick, they will have the rights to draft one of the most hyped hockey prospects in the sport's history: Canadian forward Connor Bedard.In this past season playing in Canada's major junior ranks with the Regina Pats of the Western Hockey League, Bedard scored an eye-watering 71 goals and 72 assists for 143 points in just 57 games.They also won with the third best odds of grabbing the top pick - with just an 11.5 percent chance of going number one overall. ",
        "Anaheim, the NHL's worst team in 2022-23, had the best odds with an 18.5 percent chance at the top pick, followed by Columbus (13.5 percent), Chicago (11.5), San Jose (9.5), Montreal (8.5), Arizona (7.5), Philadelphia (6.5), Washington (6), Detroit (5), St. Louis (3.5), Vancouver (3.0).Other teams in the lottery, but unable to get the top overall pick, include Ottawa (2.5), Buffalo (2), Pittsburgh (1.5), Nashville (0.5) and Calgary (0.5).This is sure to spell pain and doom for the Central Division, which was just getting used to Chicago not being as dominant as their teams that won three Stanley Cups in the 2010s.The first of those titles came in 2010 - as the team decided to cover up the sexual assault of one of its players, Kyle Beach, by then assistant coach Brad Aldrich.",
        "Chicago will now get to have a smooth transition from that era - led by Kane and captain Jonathan Toews - into a new one led by Bedard. The Blackhawks had the worst goals for per game rate in the entire league.Bedard may not have been able to power Regina into the Memorial Cup - the championship series for Canada's junior leagues - but he helped lead Canada to a gold medal in the 2023 World Junior Championships.There, he led the tournament in scoring with nine goals and 14 assists for 23 points and was named the most valuable player of the event.With moves and vision that have been compared to Maple Leafs winger Mitch Marner, speed and skating similar to Oilers center Connor McDavid, and a shot likened to the release of Toronto center Auston Matthews, NHL executives — especially the ones whose teams sit near the bottom of the standings — have to be dreaming of what Bedard would mean for their franchise.",
        "'What a talent,' Marner said in January. 'He's got a lot of skill … his shot's unreal. But his work ethic, his compete on pucks has been great to watch.'For all the gaudy numbers Bedard put up, however, he declined to discuss those accomplishments in the wake of the gold medal, saying, 'I want to talk about us and what we accomplished.'",
        "His coach at world juniors, Dennis Williams, said he was impressed with how a player already mentioned in the same breath as Connor McDavid and Sidney Crosby handled the demands.'A lot of people look at what he does on the ice and don't realize just how humble and cerebral a kid he is,' Williams said, according to The Canadian Press. 'I couldn't imagine being in his shoes with the amount of attention and pressure he gets night in, night out. He's mature beyond his age.'The draft combine takes place in Buffalo from June 4-10 and the draft itself takes place in Nashville on June 28 and 29."
    ]
}