{
    "articleURL": "/news/article-12044663/How-Australia-celebrated-coronation-Queen-Elizabeth-1953-King-Charles-III-prepares.html",
    "content": [
        "Queen Elizabeth II's Coronation was held June 2, 1953Cities and townships across Australia hosted hundreds of paradesState Dinners, balls, competitions, and sports events were hosted Celebrations lasted from Monday June 1 through Wednesday June 3With the Coronation of King Charles III just hours away, royal watchers are gearing up for the second crowning ceremony in a century - but it will be a much more muted affair on our shores than back in 1953.",
        "The last Coronation, when a 25-year-old Queen Elizabeth II was watched by 27 million TV viewers in the UK alone as she ascended the throne, also saw 30,000 Australians head to London to see the event live.Those who stayed behind enjoyed days of celebrations and festivities which began on Monday, June 1, and lasted through to Wednesday, June 3.All citizens were told to keep the night of Tuesday June 2 free, so they could watch the groundbreaking live broadcast of the event which began at 7.15 pm EST and lasted seven hours. Thousands of parades in every township across the country were organised, as well as state dinners, sporting events, a public holiday and Coronation balls.Souvenirs and mementos were printed by the tens of thousands for those who took part in the festivities, including pins, stamps, and a special coronation booklet which was given to many children who participated in the parades. ",
        "In New South Whales, Premier Joseph Cahill announced that the day of the Coronation - June 2 - would be a public holiday and that every schoolkid would get a free copy of the Coronation booklet.The night before, a banquet was hosted by the State at Hotel Australia which included an address from the then-Governor and was chaired by the acting Premier. ",
        "The menu was an entrée of oysters, followed by steamed whiting, roast turkey and ham, iced asparagus, and a 'Bombe Coronation' dessert, served with coffee.On the day itself, Sydney's Coronation pageant was held at the Sydney Showground followed by a reception at Government House and fireworks over the harbour.",
        "In Wagga Wagga, 10,000 souvenir copies of ceremony programmes were printed for the largest crowd the city had ever seen.More than 1,600 civilians, military, and children marched in the parade between police motorbikes, horse regiments, armoured vehicles, and decorated floats.The Mayor of Wagga at the time requested all houses along the parade-route to hang Coronation displays in their windows and decorate the building with flags and bunting. Newcastle saw 2,000 marchers parade through the city after a giant mass in Christ Church Cathedral began the day with an attendance totaling in the thousands.The Bishop of Newcastle, Rev, F. de Witt Batty, joined the Lord Mayor as both participated in the Entrance Procession.A reported overflow of more than 2,000 spectators were left outside, unable to squeeze into the halls of the Cathedral for the mass.220kms north of Newcastle, the only recorded Aquatic Parade took place in Laurieton, where more than 40 decorated boats sailed along the coast carrying locals and dignitaries.",
        "The parade consisted of fishing trawlers and hire launches, with one decorated log punt flaunting government officials and 'a number of young ladies in fancy dress', as reported by the since-defunct Manning River Times.Laurieton's local council purchased £84 of high-grade fireworks, equivalent to $5,634 in 2023, which were launched into the sky following the boat show.As the explosions lit up the sky, merchants strolled through the crowds below selling special Coronation buttons.",
        "Capital cities in the east saw both fighter and stunt planes soared across the coast in 'colour shows' organised by the Royal Australian Air Force. Point Cook in Victoria, Richmond in NSW, and Amberley in Queensland saw the fighters fly over, which were described as 'focal points of the nation's salute to the new Queen' by Minister for Air, Sir William McMahon. In Melbourne crowds flocked to the Royal Exhibition Building in Carlton where a giant 'E II R' crown was positioned above a performance on the stage below.A figure sat on a throne while soldiers with muskets fought first nations people wielding spears and shields before an audience of hundreds of spectators.A special 'Coronation Cup' was hosted on the other side of the city at Flemington's raceway, with a trophy valued at £100 going to the winning racer of the day, roughly equal to $6,708 today.",
        "Perth and Adelaide saw some of the largest crowds on record as people clamored to the streets to become a part of history.More than 5,000 people participated in Perth's parade at Gloucester Park on the night of the Coronation, their largest march in front of their biggest audience to date.Troops and squadrons brandished heavy artillery during the parade, which was followed by another firework show which concluded roughly an hour before the live Coronation was set to begin via radio broadcast.47kms south from Perth, in Rockingham, a dancing marathon began Saturday at 8pm, with a prize of £5 for each day the winner had boogied through.Fifteen men entered the marathon competition, with belays of women partnering with them as they moved around the Rockingham town block.The last record of the dance said that the finalists were still dancing strong into Tuesday as other Coronation celebrations began. In Adelaide 5,000 marched on Wednesday morning, mostly consisting of troops from the RAA and school cadet units and were accompanied by 10O military vehicles.It was largest crowd the city had seen since the end of World War II. Other councils lit up their town halls for the entire Coronation week and people were told to keep the night of June 2 free so that they could watch the UK broadcast.",
        "Prime Minister Robert Menzies wife, Pattie Menzies, wore a frock with gold brocade, encrusted with pearls with green and gold beads for the Coronation.Fashion was deemed a significant statement during the week, and recommended colours were Imperial purple, crimson, white and blue.For food, an Aussie spin on 'Empire dishes' were used at parties and balls, including Novia Scotia soup, South Africa spiced fruit soup, New Zealand Whitebait Patties, Toronto lobster cups, Canadian Turtle Mountain Turnovers, doughnuts and the signature dish: England's Elizabethan Pie.The week was also a celebration for the people of Australia, with civil honours, amnesty and takeaways for the kids provided by the Queen and local leaders.The Mayor of Mount Gambier, SA, wrote to the Premier requesting he mint medallions to all schoolchildren in honour of the Coronation, and hundreds children were given special glass tumblers by the Coronation Celebration Committee in Gingin, WA.The Gingin Roadboard chairman, W J de Burgh, donated £20 ($1,341 today) to the Celebration Committee, who then invited him to speak before the crowd of 200 children and 150 adults. 'It was old in human history 400 years ago when the first Queen Elizabeth rode through the streets of London to her crowning ceremony,' Mr Burgh said.'Through all the years that have since passed, the vast majority of our forefathers battling against the swords of ignorance and fighting, have strived to uphold that pledge.",
        "'If we do our duty and uphold this work, our children will come into the finest heritage of any peoples anywhere. Through all this time our monarchy has grown and mellowed until it now stands and is the symbol of this pledge.'Around 11,500 Australians were awarded the Coronation Medal by the freshly minted Queen Elizabeth II, one of her first acts as the head of the Commonwealth. A Coronation amnesty also freed 120 prisoners across NSW prisons, with every single prisoner in the state having two weeks shaved off every year of their sentences.This was granted to all prisoners in the state except '4lifers', who were to remain prison for the rest of their lives. ",
        "This old English dish used to be oven-cooked, but its modern counterpart is more easily and daintily done on the top of the stove. Rabbit was always the traditional choice, but chicken or veal could be substituted.For four people take a good-sized rabbit and soak it in salted water for 30 minutes after jointing it. After that, rinse well and remove all fat before covering it with fresh water, which is then bought to boil and skimmed.Add juice of a lemon before covering the pan again with a weighted lid.Simmer for 1.5 hours or until very tender. After 1 hour, add three or four oz. of lean bacon rashers cut in bits and a generous teaspoon of mixed herbs. When cooked, remove the rabbit and bacon before straining the liquid. Measure it (adding water if necessary) and return to the pan. Add a level dessert spoon of gelatine for each breakfast cup liquid (including a sherry glass of white wine). Soften gelatine in a little of the liquid and when dissolved then the wine. Remove from stove and cut the rabbit meat from bones in nice pieces.Arrange in a brown earthenware (or ovenglass) casserole with the bacon, one or two sliced hard boiled eggs, and some cooked green peas and carrot dice. Let the top layer be particularly attractive. Gently pour in the wine-flavoured liquid so that it covers the meat. Chill until set. Garnish prettily. Serve with a minted potato salad. (Source: The Herald, 1953) "
    ]
}