{
    "articleURL": "/tvshowbiz/article-12042027/Love-Islands-Jess-Shears-sets-pulses-racing-floral-colourful-lingerie.html",
    "content": [
        "Jess Shears set pulses racing on Wednesday as she posed for a saucy lingerie video. ",
        "The former Love Island star, 29, donned an array of underwear for the spring-themed clip and revealed she likes to wear a variety of colours.Her footage started with her looking at the camera as she donned a pink flowery set and moved onto her in a neon yellow number. The stunning star later sported green spotty lingerie and pouted and posed in the ensemble as she looked into the distance. In the Instagram post, she wore her brunette locks in a straightened style and showcased her slender figure.",
        "Jess captioned her post: 'Spring time favourites from @loungeunderwear. 'Colour is not my thing when it comes to clothes but I love mixing it up with underwear.'It comes after Jess looked incredible as she posed naked on Instagram with her baby boy in April.The beauty stripped down to showcase the difference between being nine months pregnant to holding her son at nine-months-old. The TV personality styled her long brunette tresses poker straight as they cascaded down her back as she cradled her little boy. She was all smiles wearing a radiant palette of makeup to accentuate her beauty as she posed for the sweet snap. In a second snap, Jess showcased her huge baby bump before giving birth to her son as she posed holding flowers. ",
        "The reality star also shared a third picture of her 'giant chubby baby' who sat on the floor donning a sweet beige baby grow which had a cute bear on the front.",
        "She penned: 'A few weeks late but 9 months in vs 9 months out. Last slide has me in tears. Look at my giant chubby baby.'Jess shares her son, who she has decided not to reveal his name for now, with husband Dom Lever. The couple are also parents to a second son Presley, two, who they welcomed in May 2019, seven months after tying the knot. The pair met on Love Island in 2017 and became the first contestants to have sex in the secret hideaway.They announced their engagement after three months of dating and married in a romantic ceremony in the Greek Island of Mykonos in October 2018.The pair became the second couple from the ITV2 show to say 'I do', weeks after Olivia Buckland and Alex Bowen married in a lavish Essex ceremony.",
        "In February 2018, Jess and Dom 'tied the knot' in a fake wedding during a Valentine's Day themed episode on ITV's Good Morning Britain.The couple stripped down to minimal clothing as they entered into a playful ceremony with presenter Richard Arnold, who had been ordained for the occasion.",
        "Jess and Dom announced they were expecting their child seven months later in May."
    ]
}