{
    "articleURL": "/wires/pa/article-12060175/Coventry-clinch-play-place-point-Middlesbrough.html",
    "content": [
        "Coventry claimed a final-day point to clinch a Sky Bet Championship play-off place after earning a 1-1 draw at Middlesbrough – who they will now meet in the two-legged semi-final.",
        "On a dramatic day in the promotion race, Boro and Coventry finished fourth and fifth respectively to keep their dreams of a Premier League return alive.They will now meet again on Sunday, May 14 at the Coventry Building Society Arena before returning to the Riverside for the second leg on Wednesday, May 17.Coventry, who knew they needed to avoid defeat to stay in the play-off zone, secured the lead in the 22nd minute through Gustavo Hamer’s clinical strike.But in stoppage-time at the end of the first half Cameron Archer hit his 11th of the season to level things up to raise some nerves among the home supporters.While Coventry fans, whose side were relegated from the top-flight in 2001, prayed Middlesbrough would not score again just in case it mattered, the key result at Millwall went in their favour and they were left celebrating.",
        "With Middlesbrough’s play-off place already assured, this was more about whether Michael Carrick’s men could do anything to affect the battle for the remaining two spots up for grabs.Sky Blues boss Mark Robins, who named an unchanged side, knew they needed at least a point to guarantee their own place and played with the confidence of a side which had lost just one of their last 16 games.",
        "Coventry were quick to make their intentions clear. Within two minutes of the first whistle Hamer had already forced goalkeeper Zack Steffen into a strong save.Steffen did well to turn behind the Brazilian’s low drive with his leg after he had been played in down the right.Josh Eccles was next to go close for the visitors. He was afforded too much space deep in the final third so carried and then drilled a yard wide of the left-hand post from 22 yards.And after a period of toing and froing, with much of the play outside both boxes during that spell, Coventry took the lead.Hamer was again in the thick of things. He was picked out in space and instead of going himself he tried to play in Viktor Gyokeres.The ball bounced off the striker and fell invitingly for Hamer to control and then power an unstoppable drive inside the bottom right corner of Steffen’s net.After that Coventry chased everything, closing down the men in red shirts, but just when it looked like they might get to half-time in front Archer struck.Alex Mowatt’s first-time shot from Riley McGree’s run and pass actually hit Archer, who then quickly instinctively turned and hammered high into the top left corner of Ben Wilson’s goal from six yards.",
        "After the restart Middlesbrough had more of the ball without really testing the goalkeeper, with Coventry more reserved than in the previous half.McGree, who had already had a couple of half chances, was the most creative Middlesbrough man and he curled an effort into the arms of Wilson from 18 yards.With news filtering through of Sunderland’s goals, Coventry pushed forward more. Kyle McFadzean had an opportunity from a corner but he headed over from eight yards in a crowded box.But events at Millwall, where Blackburn won, meant Coventry and Sunderland had joined Middlesbrough and Luton in the play-off spots to battle it out for a Wembley appearance."
    ]
}