{
    "articleURL": "/wires/ap/article-12042665/Kudermetova-defeats-Pegula-reach-Madrid-Open-semifinals.html",
    "content": [
        "MADRID (AP) - Carlos Alcaraz made sure he will get to celebrate his 20th birthday on the court at the Madrid Open come Friday.",
        "The defending champion overcame a tough test from Karen Khachanov on Wednesday, rallying late in the second set for a hard-fought 6-4, 7-5 win that set up a semifinal against Borna Coric on his birthday.It was Alcaraz's 150th tour-level match, and his 117th victory to leave him with a winning percentage (78%) currently better than the likes of Pete Sampras, Boris Becker and Andre Agassi.\"My dream in tennis right now is to become one of the best tennis players in history,\" Alcaraz said. \"I know that this is a big dream, (it) probably is too big. But in this world, you have to dream big and you have to think big, as well. I want to be part of the the best tennis players in history. And I will work for it.\"Women's No. 1 Iga Swiatek also made it to the last four in the Spanish capital, cruising to a 6-0, 6-3 win over Petra Martic.Alcaraz was down 4-1 and 5-2 in the final set before winning the final five games to secure his fourth straight-set victory in Madrid. The top-seeded Spaniard improved to 27-2 this year, having dropped only one set in his last 19 victories. He will be playing in his third Masters 1000 semifinals of the season.",
        "\"I knew I had to keep fighting no matter what,\" Alcaraz said. \"I had to stay strong because I knew that I would have my opportunities, and gladly I took advantage of the first one that I had to close out the match.\"Alcaraz converted on his first match point after the 10th-seeded Khachanov had taken control of the second set with an early break. The Russian had two break opportunities to go up 5-1 before Alcaraz rallied for the victory. The Spaniard, who finished with 31 winners, had converted on his first break opportunity to go up 4-3 and win the first set.Alcaraz had cruised past last year's runner-up Alexander Zverev in the previous round, while Khachanov - a semifinalist at the Australian Open this year and at the U.S. Open last year - had beaten fifth-seeded Andrey Rublev.Alcaraz is trying to become the first player this season to win two Masters 1000 titles, after having already lifted the trophy in Indian Wells. He successfully defended his title in Barcelona and also won in Buenos Aires.If Alcaraz wins the title again in Madrid, he will regain the No. 1 spot in the world rankings if he plays at least one match in Rome.Coric, the 17th seed, made it to the semifinals with a 6-3, 6-3 win over Daniel Altmaier.",
        "Swiatek was in control from the start against the 27th-seeded Martic, who had upset 2021 French Open champion Barbora Krejcikova in the previous round.Swiatek won the first seven games and needed just over an hour to make it to her first semifinal in Madrid.\"I feel like I´m playing better and better every day,\" Swiatek said. \"This is pretty great, because I didn´t know if that was going to be possible at the beginning of the tournament. But I was patient and I was hoping to get that feeling, and today was for sure a good day.\"Swiatek will next face Veronika Kudermetova, who reached the semifinals of a WTA 1000 event for the first time by upsetting third-seeded Jessica Pegula 6-4, 0-6, 6-4.It was the fourth consecutive three-set win for the 12th-seeded Kudermetova, who came to Madrid on a four-match losing streak.\"I feel so happy and proud of myself, because every match I played three sets,\" the fifth-ranked Kudermetova said. \"Before this match, every match was almost three hours. Today, only two hours, I feel fresh.\"Pegula was trying to reach her second consecutive final in Madrid. She was runner-up to Ons Jabeur at the clay-court tournament last year.The American struggled on her serve and showed frustration at times, including by knocking her racket onto the ground. She was broken three times in both the first and third sets, though needed only 22 minutes to get through the second as Kudermetova won only five points.",
        "The last player to reach the Madrid semifinals by winning four straight three-set matches was Dominika Cibulkova in 2016, when she was runner-up to Simona Halep.Second-seeded Aryna Sabalenka faces ninth-seeded Maria Sakkari in the other women´s semifinal.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}