{
    "articleURL": "/tvshowbiz/article-12037969/Waterloo-Road-return-date-REVEALED.html",
    "content": [
        "The return date of Waterloo Road has been revealed.",
        "The BBC has announced that a new series will hit screens on Tuesday 16th May at 8pm, airing on BBC One and BBC iPlayer.The brand new series of seven episodes - which stars Angela Griffin, Adam Thomas and Kym Marsh - will also available in full on BBC iPlayer that day.To celebrate the news, first-look images from the new series have been released, to give audiences a glimpse of what they can expect as new faces bring fresh dramas to the school.One new pupil causes fireworks, while elsewhere secrets come to the fore with potentially devastating consequences for those involved.",
        "Fractured relationships, brutal betrayals and life-changing moments: all in a day's work for head Kim Campbell (Angela Griffin) and her team.Following the news that fan favourite and former deputy head, Andrew Treneman (Jamie Glover) is returning to the show, audiences will be kept guessing whether Kim's old flame is back with good intentions or not.Meanwhile, new boy Myles (Osian Morgan), who has been let go by a football Academy and is struggling to come to terms with a life back in mainstream education.He makes it clear that he's not there to make friends and immediately sets about leaving a lasting impact on the school.Elsewhere, love is in the air this term as new couples get together and hidden feelings come to the surface.",
        "The students and staff embark on another term of romances and friendships, all whilst navigating issues including mental health, racism, the cost-of-living crisis and being LGBTQ+.The popular drama series returned in January after an eight-year hiatus following a revival in audiences on BBC iPlayer during the first lockdown.Returning for another term will be Angela Griffin (Kim Campbell), Adam Thomas (Donte Charles) and Kym Marsh (Nicky Walters).",
        "Also returning are Vincent Jerome (Lindon King), James Baxter (Joe Casey), Jo Coffey (Wendy Whitwell), Shauna Shim (Valerie Chambers), Neil Fitzmaurice (Neil Guthrie), Rachel Leskovac (Coral Walker), Katherine Pearce (Amy Spratt), Ryan Clayton (Mike Rutherford) and Sonia Ibrahim (Jamilah Omar).Joining the cast this series will be Paul Bazely (Benidorm, Black Mirror, Cruella, Pirates of the Caribbean) and Jenny Platt (Coronation Street, The Bay) as parents of pupils.Olwen May (Coronation Street, Happy Valley, Emmerdale) and James Quinn (Early Doors, Coronation Street) are also set to make an appearance at the school. New student Myles Massey played by Osian Morgan joins established pupils including Adam Abbou (Danny Lewis), Priyasasha Kumari (Samia Choudhry), Noah Valentine (Preston Walters), Adam Ali (Kai Sharif), Alicia Forde (Kelly-Jo Rafferty), Francesco Piacentini-Smith (Dean Weever), Liam Scholes (Noel McManus) and Lucy Eleanor Begg (Caz Williams). Scarlett Thomas returns as Izzy Charles and fellow junior student casting includes Summer Violet Bird (Tonya Walters), Ava Flannery (Verity King), Thapelo Ray (Dwanye Jackson), Inathi Rozani (Zayne Jackson), Chiamaka (ChiChi) Ulebor (Shola Aku) and Sahil Ismailkhil (Norrulah Ashimi). ",
        "Fans of the show will be able to get all the behind the scenes information from Waterloo Road – The Official Podcast which will also be returning with hosts Adam Thomas and Priyasasha Kumari.Launching on BBC Sounds on Saturday 6th May, the podcast will feature celebrity guests and the Waterloo Road cast as they look back at the show's legacy and take audiences on a nostalgic journey through the years.The audio show will countdown to the return of the new series and is the perfect listen for fans who have been with the show since it started.The new series – Waterloo Road's twelfth in total, and the second since Waterloo Road returned to the BBC at the start of this year - was filmed in Greater Manchester."
    ]
}