{
    "articleURL": "/sport/othersports/article-12041989/Tori-Bowie-track-field-athlete-dies-aged-32.html",
    "content": [
        "According to her management company, sprinter Tori Bowie has died Bowie had won multiple world titles and Olympic gold in the 4X100m relayDailyMail.com provides all the latest international sports newsREAD MORE:  Bowie was 'seven to eight-months PREGNANT' and had history of erratic behavior, neighbors revealThe family of American sprinter and Olympic gold medalist Tori Bowie have spoken out following her tragic death at the age of 32. ",
        "Bowie was a track and field star who sprinted to glory in the 2016 Olympics. She last competed on the world stage in 2019, at the Qatar World Championships, but spent the last four years living quietly in Florida. She was found dead in her home in Winter Garden on Tuesday. Her cause of death is yet to become public. The Orange County Sheriff's Office said she was found at 1pm after someone called to request a welfare check at her home. No foul play is suspected, but her cause of death remains unconfirmed.  ",
        "On social media, her grieving sister hinted at mental health problems. 'People who pretend to be happy have some of the saddest souls and people who do not try to convince the world that they are happy have the most genuine souls, because they are content with just being them for them and nobody else,' she said in a Facebook post. It's unclear whether Bowie was living alone in the home where was discovered yesterday.Public records show she defaulted on the property in 2021. It was scheduled for foreclosure in 2022, but the auction was canceled. Bowie grew up in Sand Hill, Mississippi. Her mother dropped her and her sister off at foster care when she was an infant, but they were later adopted by their biological grandmother. ",
        "She attended Pisgah High School, where she began competing as a track athlete. In a video after she shot to stardom, she said she'd struggled her 'entire life' but was inspired by her family and faith.'I come from a small town called Sand Hill, Mississippi. where I come from, we're not supposed to succeed. It's been a struggle since day one. My birth mom dropped me off in foster care when I was two years old.'My entire life has been a struggle. It's amazing hearing it, it's something I always dreamed of. It's humbling. I've been through so much and I haven't let anything defeat me yet.'I'm a champion in that sense, not just on the track. I want to be up there with Naomi Campbell, taking over the runway not just the sport. 'We're blessed when we get to wake up and we get a whole new day to do something different. I feel like every day is a celebration for me.'",
        "US record holder and three-time world champion Noah Lyles led the tributes to Bowie. He responded to her management agency's statement on Twitter, saying: 'I can't believe this. 'I had just heard word of her going to be with her sister back home and now this. This breaks my heart to hear and I will keep the family in my prayers.' ",
        "One of Bowie's competitors, Jamaican Olympic champion Shelly-Ann Fraser-Pryce also paid tribute, tweeting, 'My heart breaks for the family of Tori Bowie. 'A great competitor and source of light. Your energy and smile will always be with me. Rest in peace.'",
        "Kenyan Olympian javelin thrower Julius Yego was among the first to share condolences, tweeting:  'So devastating and shocking to learn of the passing on of Tori Bowie'The world of athletics have lost a great champion and patriot of the sport, rest in peace Tori. Condolences to the greater family of Tori Bowie, together in prayers'After winning the bronze medal at the 2015 World Championships, Bowie qualified for the US Olympic Team for the Rio Olympics in 2016.There, she qualified to race for Team USA in the finals of the 4x100 meter relay, the 100m and the 200m.She won silver in the 100m dash, finishing with a time of 10.83 and just behind gold winner Elaine Thompson of Jamaica who snagged a 10.71. In the 200m event, Thompson won gold again and Holland's Dafne Schippers won silver as Bowie finished with the bronze.But alongside fellow sprinters English Gardner, Allyson Felix, and Tianna Bartoletta, Bowie helped Team USA retain the gold in the 4x100m relay by running the anchor leg and outlasting Jamaica's Shelly-Ann Fraser-Pryce.",
        "A year later at the 2017 World Athletics Championships in London, she took home the gold medal in the 100m and again in the 4x100m relay.At the 2019 World Championships in Qatar, Bowie made the semifinals of the 100m but did not start after qualifying. She was not part of the women's 4x100m team - with Team USA finishing third with an entirely new cast of Dezerea Bryant, Teahna Daniels, Morolake Akinosun, and Kiara Parker.Her final Instagram post from October of 2019 showed a video competing in the long jump at that same event with the caption, 'What a journey what a journey... finishing 4th in the world considering I've been away from it for 5 years is a huge accomplishment for me! ",
        "'Let's just say I'm looking forward to Tokyo! To everyone chasing their dreams out there keep the courage and determination! I know I will.'But according to records from the 2020 US Olympic Team Trials, Bowie didn't compete in qualifying for the 100m, 200m or the long jump.According to Runners World, Bowie hadn't competed since June 4 of last year, when she finished 5th in a 200m race in Florida.In addition to her success on the track, Bowie was a model off of it. ",
        "She posed for ESPN The Magazine's annual Body Issue and was featured in a Valentino campaign."
    ]
}