{
    "articleURL": "/sport/nrl/article-12059001/Warriors-sponsor-threatened-1million-lawsuit-accusing-NRL-referees-cheating.html",
    "content": [
        "Jason Paris claimed on Twitter referees are biased against the Warriors Warriors had two players sin-binned in 18-6 loss to Penrith on SaturdayThe NRL has strongly defended the match officials and their integrity A Sydney lawyer has warned the chief executive of the Warriors' main sponsor that he could face a defamation payout worth $1million after questioning the integrity of NRL referees.",
        "Jason Paris, CEO of telco One NZ, went on a social media rampage during the Warriors' 18-6 Magic Round loss, accusing officials of 'cheating of the highest order'.Speaking to News Corp, lawyer Paul McGirr argued that Paris' comments implied he considered the 'cheating' worse than 'Lance Armstrong, [the] cheating scandals at the Olympics by East Germany and Russian doping scandals'.McGirr added Paris' remarks appeared to be 'defamatory' and could carry a hefty financial cost. 'It leaves very little doubt that he is referring to the person officiating the bunker [Chris Butler] and also the referee [Todd Smith],' he said.",
        "'Defamation proceedings are notoriously and extremely expensive in legal fees and settlement amounts.'You would want to have some concrete evidence behind you if you’re going to be accusing an official of cheating. It could cost him between $500,000 and $1million, there is no cap, depending on the damage to the reputation of the two referees.'McGirr's comments came as the NRL’s referees’ union sought legal advice over Paris' remarks. 'It’s not called for and the comments are appalling,' said Matt Cecchin, the boss of the Professional Rugby League Match Officials - which represents the game’s elite referees. 'It does nothing to help and improve officials within our game, or any officials really. That’s why we’ll do whatever we can to ensure comments like this are stamped out of our game, and stamped out of any game for any officials. ",
        "'Any sort of mention of the word bias, be it conscious or unconscious, is just unacceptable. It hurts our game at every level.'We feel strong enough to seek legal opinion and based on the information we’ll pursue whatever means necessary to ensure that it’s seen as a deterrent for anyone who thinks about making any such comments around bias.'On Monday, however, Paris doubled down. ",
        "In a tweet, he withdrew his allegation that the referees were 'cheating', but insisted there was 'unconscious bias' against the Warriors.'I do believe that there is unconscious bias happening every week against the Warriors and it needs to be addressed.'All we want is consistency, but we are not getting it,' he said.  'Take opinions out of it and analyse the video footage from past games and compare our decisions vrs (sic) other teams.'I think it will find that we are being disadvantaged - then we can work out why and take steps to fix it.'The Warriors were perplexed by referee Todd Smith's decision to overlook a possible high tackle on captain Tohu Harris from Panthers enforcer Moses Leota.Dallin Watene-Zelezniak was also sent for a head injury assessment after being glanced in the face by a Tyrone Peachey swipe that went unpunished.",
        "Adding to their frustrations was the fact the Warriors also had rookie Demitric Sifakula (striking) and Jackson Ford (hip-drop tackle) sent to the sin bin.",
        "Meanwhile, NRL football boss Graham Annesley has launched a blistering defence of his referees. While he didn't elaborate on the Harris high shot, explained that the adjudications on Sifakula, Ford and Watene-Zelezniak were correct.'I'll be measured as much as a I can; I'm a bit hot under the collar over this stuff,' he said.'There is no comment that could be worse.'The referees work very, very hard to do their best, not just at the NRL level but kids at the park on the weekend.'The nature of the game is that there will be disagreement about the decisions that they make.'We can question their decision making, but we can't question their integrity.'It questions the integrity of the entire NRL administration because we appoint these people.'He said suggestions of a bias against the Warriors were laughable.",
        "'I can go to eight losing clubs on any given week and they'll all tell me they didn't get the rub of the green,' he said.'This is not something that's peculiar to a team in New Zealand.'NRL chief executive Andrew Abdo has also lashed Paris' commentary and confirmed an investigation into his remarks was underway.",
        "Warriors officials will meet with the organisation this week to review the decisions in question but it's understood the NRL is uncertain how to proceed with any penalty, given Paris isn't a member of the Warriors' staff."
    ]
}