{
    "articleURL": "/tvshowbiz/article-12057379/Long-time-friends-Leonardo-DiCaprio-Woody-Harrelson-spotted-having-dinner-West-Hollywood.html",
    "content": [
        "Long time friends Leonardo DiCaprio, 48, and Woody Harrelson, 61, got together on Saturday night to share a bite.",
        "The Oscar winner and Cheers alumnus were spotted at a West Hollywood hot spot.Leo — who attended the same Met Gala after party as his ex Gigi Hadid — wore jeans and a black zip-front hoodie with a black ball cap.Woody, meanwhile, wore a tan jacket over a white T-shirt with green pants, and he also had a black cap on.In 2013, DiCaprio helped produce the Christian Bale–starring crime drama Out Of The Furnace, which Harrelson costarred in.",
        "Both men were also spotted at the Los Angeles Lakers vs. Golden State Warriors NBA playoff game at Crypto.com arena on Saturday night.There were many celebs taking in game three of the Western Conference Finals.Adele, Kim Kardashian, Kevin Hart, Pat Sajak, Michael B. Jordan, Dustin Hoffman, Don Cheadle and Nia Long were all spotted taking in the Lakers victory.Woody is currently starring alongside Justin Theroux in the HBO limited series White House Plumbers.Harrelson plays E. Howard Hunt to Theroux's G. Gordon Liddy. David Krumholtz, Judy Greer, Kathleen Turner and Domhnall Gleeson also star in the series about the presidency of Richard Nixon and the Watergate scandal that brought it to an end.The Natural Born Killers actor has also been in the news lately amid speculation that he and Dallas Buyers Club star Matthew McConaughey might be biological brothers.",
        "'McConaughey's mom had a relationship with my dad right around the time he was conceived. That seems like a big coincidence,' he said in an interview for Esquire's video series Explain This.",
        "'And his dad did say, you know she was going to the hospital to give birth and he goes, \"That ain't my son.\" And he didn't go to the hospital,' the True Detective star said.But they don't know for sure, with the Zombieland star adding, 'Well, I don't know because we haven't done the testing, but I can say that there's a lot of almost insane coincidences.'Meanwhile, the Titanic actor is reportedly still romancing model Gigi Hadid, 27.They were both spotted at Stella McCartney and Baz Luhrmann's Met After Party with Casamigos on May 1, when an insider revealed that they are 'still spending time together.'"
    ]
}