{
    "articleURL": "/wires/reuters/article-12042065/EXPLAINER-Sudans-conflict-Whos-backing-rival-commanders.html",
    "content": [
        "By Aidan Lewis and Lisa Barrington",
        "CAIRO, May 3 (Reuters) - Military rivals locked in a conflict that erupted in Sudan on April 15 both courted foreign backing in the years leading up to the fighting.That support could now influence the course of the power struggle between army chief Abdel Fattah al-Burhan and the leader of the paramilitary Rapid Support Forces (RSF) Mohamed Hamdan Dagalo, commonly known as Hemedti, as well as efforts to stop the violence.The conflict has brought open warfare to Sudan's capital Khartoum and sparked new unrest in the western region of Darfur, displacing hundreds of thousands of people within Sudan and sending 100,000 fleeing across its borders.The influence of outside players has loomed over events in Sudan since the overthrow of former leader Omar al-Bashir during a popular uprising four years ago.WHO SUPPORTS BURHAN?Burhan's most important backer is Egypt, which shares a border with Sudan that more than 40,000 people have crossed since the fighting began.In both countries, the military has assumed a dominant role in the decades since independence and has intervened following popular uprisings - in Egypt when former army chief Abdel-Fattah al-Sisi led the ousting of democratically elected President Mohamed Mursi a decade ago, and in Sudan when Burhan led a military takeover in 2021.",
        "Diplomats and analysts say Egypt feels comfortable dealing with Burhan and sees him as the most likely guarantor of its interests, including in negotiations over the Grand Ethiopian Renaissance Dam being constructed on the Blue Nile upstream of Sudan and Egypt.In recent months, as much of the international community backed a transition plan involving the main civilian coalition to emerge from Sudan's 2019 uprising, Cairo created a parallel track of negotiations involving figures closer to the army.During the current fighting Egypt has joined calls for an effective ceasefire while saying they consider the conflict an internal matter for Sudan. On Tuesday Egypt's foreign ministry received an envoy for Burhan.Diplomats and analysts say Cairo is crucial to applying any short-term pressure on Burhan.WHO SUPPORTS HEMEDTI?The most important regional ally for Hemedti before the conflict was the United Arab Emirates.Hemedti has presented himself as a bulwark against Islamist-leaning factions that established deep roots in the army and other institutions under Bashir. The UAE has aggressively sought to roll back Islamist influence across the region.The UAE has provided Hemedti, who grew rich through the gold trade, with a platform for channelling his finances as well as public relations support for the RSF, said Andreas Krieg, Associate Professor at King's College, London.",
        "Analysts however say the UAE has also sought to hedge its bets, retaining ties to Burhan and the army and joining the Quad, a grouping that has taken the lead on diplomacy on Sudan and includes the United States, Saudi Arabia and Britain.\"While it publicly supports the policy approach by the Quad, it has used its networks to create an alternative influence hub with Hemedti and the RSF,\" said Krieg.Hemedti had also cultivated ties with Russia. Western diplomats in Khartoum said in 2022 that Russia's Wagner Group was involved in illicit gold mining in Sudan and was spreading disinformation. Hemedti said he advised Sudan to cut ties to Wagner after the U.S. imposed sanctions on the private military contractor. Wagner said on April 19 that it was no longer operating in Sudan.WHICH OTHER POWERS HAVE INFLUENCE?Saudi Arabia has had close ties to Burhan and Hemedti, both of whom sent troops to the Saudi-led coalition in Yemen.As it steps up its diplomatic ambitions across the Middle East, Riyadh has asserted itself in mediating over Sudan while also looking to protect its economic ambitions in the Red Sea region, said Anna Jacobs, Senior Gulf Analyst with Crisis Group.\"Saudi Arabia is focused on Red Sea security, which is integral to Saudi Vision 2030 and investments along the Red Sea like Neom,\" she said, referring to the futuristic city backed by Saudi Crown Prince Mohammed bin Salman.",
        "Saudi Arabia and the United States have been leading efforts to secure an effective ceasefire.East African powers Ethiopia and Kenya also hold some sway due to their prominent role in regional diplomacy and previous mediation in Sudan.South Sudan hosted peace talks between the Sudanese state and rebel groups in recent years, and was designated as one of the countries that could host talks over the current crisis.Israel, which had been hoping to move forward in normalising ties with Sudan, has also offered to host talks.WHAT'S THE WEST'S POSITION?Western powers swung behind a transition towards elections as the military shared power with civilians after Bashir's overthrow, offering direct financial support that was frozen when Burhan and Hemedti staged a coup in 2021.Led by the United States, they supported a new transition deal that was meant to be finalised in early April. However the deal instead helped trigger the eruption of fighting by creating a stand-off over the future structure of the military.Critics say the U.S. was too lenient with the generals.\"Their strategy was stability and their basic misconception was that they would get stability by backing the apparently strong and decisive and cohesive players who happened to be in power,\" said Alex de Waal, a Sudan expert and head of the World Peace Foundation at Tufts University.",
        "(Reporting by Aidan Lewis in Cairo and Lisa Barrington in Dubai, Editing by William Maclean)"
    ]
}