{
    "articleURL": "/tvshowbiz/louise-redknapp/article-12056257/Louise-Redknapp-looks-sexy-leather-Antigoni-Buxton-leave-London-hotspot.html",
    "content": [
        "Louise Rednkapp and Love Island's Antigoni Buxton were spotted leaving London's Chiltern Firehouse, on Saturday night.",
        "Louise, 38, looked sexy in leather, opting for a black shirt teamed with matching leather leggings that featured lace-up detail on the sides.The former Eternal star completed her chic look with a pair of black stiletto heels as she was captured in her car with a pal after making her way out of the building.Louise added dainty jewellery to her sleek ensemble, including a rhinestone necklace and star-shaped silver earrings.The Angel Of Mine hitmaker styled her blonde bob with a slight side parting with her front shorter locks to frame her face.",
        "The singer showcased her beauty with a shimmery light pink eyeshadow and a matching lipstick - as she looked relaxed and in good spirits.Meanwhile, Antigoni, 26, showed off her figure in a barely-there co-ord, comprising a tiny black cut-out crop top and a matching mini skirt.While flaunting her toned midriff, she layered an oversized black and white bomber jacket to add a sporty note to the glamorous look.Antigoni gave herself some extra inches with tight black leather knee boots, and appeared in great spirits as she made a stylish exit.She donned a light make up palette with a touch of peachy blush on her cheeks, nude shimmery eyeshadow and a nude lipgloss to pout her lips.",
        "Antigoni wore her long curly golden tresses loose with a side parting.",
        "Last month, Louise gave fans something to look forward to as she posed up a storm to promote her new single High Hopes.Taking to Instagram, the British pop star put on a stylish display in a red sequin dress and black bomber jacket.With the jacket falling off either sides of her shoulders, Louise revealed the racy nude sheer straps of the dress.Offering a sultry stare to the cameras, the ex-wife of footballer Jamie Redknapp rocked a glamorous palette of make up, including a brown smokey eye.Louise wore her trademark golden locks into a loose bob which she wore in a centre parting, so that her tresses fell naturally and framed her pretty face.",
        "Her blonde tresses were styled stylishly out of place to offer a dishevelled look.Captioning the snaps, Louise wrote: 'Get ready to sing this one out loud!!!'High Hopes along with Super Magic and all of my solo singles feature on my new Greatest Hits album which is out 2 June! Thank you everyone for the continued support over the last 30 years! Love Lou xxx'Louise also put on a sultry display as she flashed her bottom in her latest music video. ",
        "She shared the new video ahead of the release of her new greatest hits album on June 2."
    ]
}