{
    "articleURL": "/sport/football/article-12061273/Rio-Ferdinand-predicts-twist-two-Premier-League-title-race-backing-Man-City.html",
    "content": [
        "Rio Ferdinand doesn't think there's enough twists in the title race for Arsenal Ferdinand names Gunners' Martin Odegaard as the club's player of the season The ex-United star stressed fans can't be frustrated by a lack of a title challenge Rio Ferdinand still thinks there could a twist in the tale in the Premier League title race, but is still backing Manchester City to retain their championship crown. ",
        "Arsenal's win over Newcastle on Sunday saw the Gunners go one point behind Pep Guardiola's men at the top the table, having played a game more than their title rivals. Earlier in the week, City continued their rampant form by seeing of Leeds with a 2-1 win at the Etihad, and Guardiola's side remain the favourites to win their fourth title in five years. Mikel Arteta's side are still in pole position to pounce on any City mistake, but former England defender Ferdinand thinks that although we may still see some twists, the title is out of Arsenal's grasp. ‘There’s a twist or two still left, I think,’ Ferdinand told his YouTube channel. ",
        "'But I don’t think there will be enough for Arsenal to go and win it.'As much as I banter Arsenal, what they have done this season is nothing short of amazing.‘You have given this juggernaut of a team (Man City) a run for the title for the whole of the season, Remarkable stuff.’Despite backing Man City to hold off the Gunners, Ferdinand was impressed with their win over the Magpies on Sunday and in particular the performance of captain Martin Odegaard.The Norwegian opened the scoring in the 2-0 win, making it 15 goals and eight assists for the 24-year-old this season, and Ferdinand believes his been Arsenal's player of the season. ",
        "‘Odegaard, your Player of the Season, came up trumps again,’ Ferdinand said about his display at St James’ Park.'He did a few bits in that first-half which were different level.’ ",
        "Ferdinand, who last week was inducted into the Premier League Hall of Fame, also believes Arteta will be pleased with how his side have bounced back following their 4-1 defeat to Man City last month. Adding: ‘I think Mikel Arteta will have been so pleased with how Arsenal recovered after the game at the Etihad. 'You got dismantled, destroyed, dispatched. Morale was down.’Arsenal will host Brighton next Sunday as they look to keep up the pressure on Manchester City, who travel to Everton earlier in the day - three days after their Champions League semi-final against Real Madrid at the Bernabeu.  "
    ]
}