{
    "articleURL": "/news/article-12041219/McDonalds-burger-sparks-investigation-woman-served-raw-McSpicy-New-Zealand-chain.html",
    "content": [
        "Woman served raw chicken burger at McDonald'sNew Zealand officials looking into the incident An investigation has been launched after a woman was served raw chicken at a New Zealand McDonald's.",
        "Ordering at the New Lynn McDonald's on Memorial Drive, Auckland, on Tuesday evening, Sara Screw chose a McSpicy Bacon Deluxe which, after biting into the burger, had been served dangerously raw.Ms Screw experienced stomach cramps throughout the night and was unable to fall asleep until 5am, Stuff reported.Raw chicken can contain potentially deadly bacteria such as Salmonella and Campylobacter.The nation's Ministry for Primary Industries is actively investigating the incident after Ms Screw made a formal complaint.",
        "'I took a big bite and it tasted funny, and it was very chewy,' Ms Screw said.'I opened it up but the patty was covered by sauce so I couldn't see anything.'I took another bite, and that's when I realised it was completely raw.' After having already taken two bites out of the raw burger, Ms Screw drove back to the restaurant to inform them of the mistake.However the staff allegedly informed Ms Screw that too much time had elapsed for them to remake the burger.'They assumed I wanted another burger, but why would I want that?' she said.'I'm never eating McDonald's again.'A McDonalds spokesperson said they are taking the incident 'very seriously'.'The restaurant immediately investigated, including several attempts to contact the customer this morning,' the spokesperson said.",
        "Ms Screw indicated she had not received any correspondence from the fast food chain. ",
        "'Restaurant management are following up with the staff personally and reminding all staff of the correct procedures,' Vincent Arbuckle, the food safety deputy director-general for the Ministry of Primary Industries, said.'Businesses providing food services to the public are required to have a registered food control plan to ensure the food they provide is safe and suitable for customers' consumption.'The concern with raw or undercooked chicken is that it can be the source of sickness-causing bacteria, such as campylobacter.'Salmonella causes salmonellosis which can lead to diarrhoea, fever and stomach cramps within 8 to 72 hours after being exposed.Campylobacter bacteria, which causes campylobacteriosis, causes similar symptoms as salmonellosis and can also be recovered from for a healthy person. While most healthy people recover from the diseases, in some cases the disease can become life-threatening."
    ]
}