{
    "articleURL": "/sport/cricket/article-12044717/Ashes-stars-Stuart-Broad-Jimmy-Anderson-ask-artificial-intelligence-dismiss-Steve-Smith.html",
    "content": [
        "Stuart Broad and Jimmy Anderson fear Steve SmithEnglish quicks desperate to win Ashes on home soilUsed an AI bot to seek answers ahead of first TestThe series officially begins in Edgbaston on June 16England stars Stuart Broad and Jimmy Anderson know Steve Smith will be a crucial cog in Australia's campaign to retain the Ashes this year - and the veteran quicks are prepared to go above and beyond to find any way to take his wicket.",
        "In a video promotion for Sky Sports, Broad and Anderson recently turned to an artificial intelligence (AI) bot for possible ways to keep 'Smudge' walking back to the dressing rooms in record time.The AI began by stating what many English fans and players already know - 'getting Steve Smith out can be challenging.'Advice from the bot to get Smith off his game included using short-pitched bowling, strategic field placements and a varied attack.Both champion pace bowlers initially played along, with Broad declaring on camera that 'knowledge is power'.",
        "When the bot declared Smith is a 'world class batsman who is difficult to get out', the 36-year-old kept his composure, before saying, 'Yep, I know that bit.'And when the bot then told Anderson to 'vary' his bowling - but also 'maintain his consistency', he could be heard sarcastically stating, 'Make your mind up!'Banter aside, with more than 1000 Test wickets between them, Broad and Anderson will be crucial figures for the hosts.But both men fear Smith, given his record against England is imposing, averaging just under 60 with 11 hundreds in 32 matches.When in the UK, Smith has an imposing average of 65 - and at the last Ashes staged in England back in 2019, he plundered 744 runs across his seven innings, including three tons and one double century.",
        "But there is cause for optimism.'Bazball' under coach Brendon McCullum has yielded 10 wins in 12 Tests for England, with Broad labelling the attacking form of cricket a 'breath of fresh air'.'I've been so lucky to have experienced so much in my career, but for enjoyment and fun and turning up not knowing what each day will bring ... yet having a freshness to it has been unbelievable,' he said.",
        "'I think the biggest compliment I can give is that part of me wishes I was 23 again. Part of me wishes I was learning my trade in this environment. 'I learnt under Andy Flower who made me a pretty tough cricketer and strong character. He made me deliver under pressure.'But imagine being [young gun batsman] Harry Brook now and coming in with that freedom and backing?'Since Baz took over, part of my unofficial role is to get the crowd going.'I thrive on it, it gets me going. The lads will come to me at times and say 'do you think it's time to get the crowd going?' and I'll say 'go on then.'Broad also stated the last English 4-0 horror show on Australian soil 'wasn't a real Ashes series.''In my mind I don't class that as a real Ashes. The definition of Ashes cricket is elite sport with lots of passion and players at the top of their game,' he said.",
        "'Nothing about that series was high level performance because of the Covid restrictions. The training facilities, the travel, not being able to socialise. I've written it off as a void series.'The Ashes start on June 16 with the first Test at Edgbaston."
    ]
}