{
    "articleURL": "/news/article-12053125/Girlfriend-Aussie-exchange-student-Alex-Shorey-ate-rat-poison-investigated-Taiwan.html",
    "content": [
        "A 45-year-old woman may have poisoned Alex ShoreyMr Shorey, 24, ingested a severe amount of rat poisonThe woman, reportedly his girlfriend, is the sole suspectThe female friend of an Australian exchange student who was poisoned in Taiwan is now being investigated after local police found 'relevant evidence' in her home. ",
        "Taipei City Police looking into the poisoning of Queensland student Alex Shorey, 24, said on Wednesday that they'd searched the house of a 45-year-old Taiwanese woman - reported in local media as Mr Shorey's girlfriend - and made suspicious findings.Local media are reporting that rat poison was found, similar to what was in Mr Shorey's system when he arrived at Taipei Medical University Hospital. It's unknown if the alleged poison found was identical to the superwarfarin - a highly toxic poison that stops blood from clotting - that he had ingested.The woman is now the sole suspect of a criminal investigation and is barred from leaving the country.",
        "Taipei Police had previously announced that a criminal investigation had been opened to figure out whether Mr Shorey was deliberately poisoned. '[We] searched the home of a female friend and found relevant evidence', ABC reported.'Police questioned this female friend on Thursday and restricted her from leaving Taiwan,' a spokesman said.Mr Shorey was flown back to his home town of Toowoomba, 130km west of Brisbane, in an emergency evacuation from Taiwan after medical staff were finally able to stabilise his condition.His father, Stephen Shorey, was informed of Taipei Police's criminal investigation before he accompanied his son for the flight back to Australia on Wednesday.",
        "Earlier, police in Taiwan had said that they were figuring out whether the poisoning was an act of 'criminal intent', although nothing was confirmed until they had searched the female's home.'It's all speculative at the moment. All that's been confirmed is the poison,' Mr Shorey's uncle, Ross Shorey-Kitson, told 7News.It was initially suspected that Mr Shorey had accidentally consumed the poison from contaminated street food at the end of March before he was rushed to hospital prior to Easter. This theory was dropped after medical examinations found that he couldn't have eaten an amount large enough to have prompted the extreme symptoms he had.Mr Shorey had noticed blood in his urine in early April before he woke up covered in blood soon after. He was checked into the ICU at Taipei Medical University Hospital after experiencing abdominal pain and nausea, which quickly worsened to hypovolaemic shock, haemorrhaging and an anaphylactic reaction once staff began treating him.A language barrier added to the confusion on how to treat him as his condition deteriorated, causing severe organ damage, respiratory failure, and anaemia.Six days after being checked into the ICU, he also experienced a severe allergic reaction to a vitamin K treatment, resulting in cardiorespiratory collapse. These complications stifled efforts by his family to bring him back to Australia after they launched a GoFundMe to raise the funds to afford a medical evacuation. ",
        "Despite quickly raising more than $200,000, the flight was repeatedly delayed until his condition strengthened to the point where he was able to withstand the eight-hour flight.In total the family raised $208,682 after nearly 3,000 people donated to help get Mr Shorey back to Australia. The initial target of the campaign was $172,000 which would have covered his medical evacuation, with the rest of the money going towards his treatment. Mr Shorey's family posted an update on April 25 after the overwhelming amount of money raised confirmed that they could bring him home.'We have attempted three flights over the past few weeks, each one of them cancelled as Alex's condition deteriorated further just prior to departure as the poison worked through his body, causing further complications,' they wrote in an update.'So to have the reassurance that we can now fund the medical support and specialised medical retrieval services he needs is utterly amazing.'"
    ]
}