{
    "articleURL": "/sport/football/article-12048717/Luke-Shaw-blames-Man-United-loss-Brighton-finishing-admits-handball-cost-game.html",
    "content": [
        "Brighton are sixth in the Premier League after beating Manchester United 1-0The only goal came from the penalty spot in the ninth minute of injury timeLuke Shaw, who gave away the penalty, criticised a soft decision in the build-upLuke Shaw has criticised the decision to award Brighton a free kick in the build-up to their 99th minute winner against Manchester United on Thursday.",
        "With the score level at 0-0, Shaw appeared to block Julio Enciso from running onto a flick outside the box, and the referee awarded a foul against the England left back.The free kick led to a corner, which deflected off Shaw's raised hand inside the penalty area. After a VAR check, the spot kick was given and duly put away by Alexis Mac Allister.It was a classy penalty hit across his body into the side netting, and the latest goal ever scored against the Red Devils. The result means United have still taken just one point from their eight games against the Premier League's top nine.",
        " Shaw felt the free kick should not have been given, as he told Sky Sports: 'Before the corner the free kick was never a foul. I am not looking for excuses, but it shouldn't have been a foul that led to the corner. So maybe that corner shouldn't have even happened.'United boss Erik ten Hag agreed with his fullback, as he said: 'There were so many bad tackles tonight, but that, a fair block, gets a whistle.'Paul Ince played down their complaints though, as he felt you have to 'deal with the corner, whether it's a foul or not. 'It's the last moment, you need focus, concentration, and then you come away with a point,' he added. 'You come away and you've got to dig in, but today you see Antony sulking, you've got to get on with it. I didn't see that from United today.'",
        "Jamie Redknapp added that Ten Hag's side 'didn't do enough' against Brighton, and that the manager 'has to work on' their away form. Despite his grievances with the referee, a crestfallen Shaw did admit his late error had cost United a point. 'I own up to it, take it on the chin, it cost us the game but it is tough,' he said. 'I can't even explain why my hand is up there, it's a silly mistake that cost us a point. It is totally disappointing and I lost us a point at the end.'The fullback also felt his side's poor finishing was partially to blame for the loss, adding: 'The problem is we don't score. We had three or four big chances in the first half we should be scoring. That is happening a lot of times this season. 'It comes down to my mistake at the end but with the chances we had we should be scoring. The game is completely different if we score with the chances we make.'",
        "His manager agreed, insisting his side had to be 'more clinical'. Despite the loss, United are still well placed to finish in the Champions League places as they sit four points ahead of fifth-placed Liverpool with a game in hand.",
        "They also face a relatively straightforward run-in, with their final five games of the season coming against West Ham, Wolves, Bournemouth, Chelsea and Fulham.As for Brighton, the win moves them within four points of Jurgen Klopp's side with two games in hand, meaning they have an excellent chance of securing European football for the first time in their history.They will next be in action against relegation-threatened Everton on Monday. "
    ]
}