{
    "articleURL": "/femail/article-12057843/Is-Big-Help-near-volunteer-King-Charles-Coronation-project.html",
    "content": [
        "Thousands across the UK are encouraged to take part in the Big Help Out READ MORE: For all the latest Royal news, pictures and video click hereThe Coronation and its concert have proved to be a buzzing success in getting the country to come together and celebrate.",
        "And it's still not over, as today King Charles III and Queen Camilla are encouraging people to come together in communities and volunteer as part of the Big Help Out Initiative.The scheme, which aims to inspire a new generation of volunteers by giving people a taster of what they can achieve, has been backed by celebrities across the country.It takes part on today's Bank Holiday as part of the official Coronation celebrations. Here, FEMAIL tells you how you can roll your sleeves up and get helping...",
        "IS THERE A BIG HELP OUT NEAR ME? To see if a project near you is offering volunteering opportunities, just use The Big Help Out app to search by postcode, type of activity and the organisation they would like to work with.It is available on the Apple app store and Google Play. More than 1,500 charities have signed up. The Big Help Out has been organised by The Together Coalition and leading charities.In Somerset, people can take part in a taster session at their local Age UK charity shop.And in Shropshire, the Ramblers is calling on people to walk on local paths and record any issues.Scout groups will let people try activities that their volunteers do regularly, such as climbing, archery, or campfire cooking.Loved Island's Faye Winter, 27, helps out with the charity The Guide Dogs for the Blind Association and has praised the initiative.",
        "'It's a fantastic cause and I would recommend volunteering to anyone who is able to donate some of their time,' the reality star said.",
        "WHAT CHARITIES CAN I GET INVOLVED WITH?There are thousands of charities which are signed up for The Big Help Out, including huge organisations like The National Trust, the RSPCA, British Red Cross and Citizens Advice.Other worthy causes include St John Ambulance, Samaritans the NSPCC. There are endless opportunities which are bound to cater to causes you're passionate about. CAN I ORGANISE A VOLUNTEERING EVENT? You can organise a volunteering event by going to The Big Help Out website.'The more people who organise an event, the bigger the Big Help Out will be,' it reads.'Thousands of organisations, from the smallest local community groups to some of the UKs biggest names are doing just that.'Everything you need to know to organise an event can be found on the app or on the event's site. 'And don’t forget to spread the word in your communities and on social media by using or adapting the helpful designs in our toolkit,' it added.WILL ANY OF THE ROYALS BE VOLUNTEERING?The Prince and Princess of Wales are expected to spend the Coronation bank holiday volunteering with some of the UK's largest charities.The senior royals will likely participate in the event - a nationwide day of service aiming to create both a tangible tribute to the King's history of public service and echo his hope of creating a lasting legacy from the first crowning of a British monarch in 70 years.",
        "William and Kate are understood to believe the day of charitable giving is a 'fantastic' idea, royal insiders told The Telegraph. The Big Help Out is being organised by several prominent public figures including Brendan Cox, widow of murdered Labour MP Jo Cox. ",
        "Launching the initiative, Chief Scout Bear Grylls said: 'Volunteering has always been a huge part of what makes this country great – from families looking after evacuees during the Second World War to neighbours looking out for each other during the pandemic.'But it's not just in times of crisis that we step up. Volunteering is what powers our communities, from Scout leaders to football coaches, collecting the shopping for an elderly neighbour to helping out at the school fete.'The Big Help Out will put volunteering centre stage for a day and give people easy ways to join in.'He added: 'We're delighted to be a central part of the Coronation weekend, particularly given The King and Queen Consort's long history of support for volunteering.'",
        "Organisers hope for an 'unprecedented' community response. Catherine Johnstone, chief of the Royal Voluntary Service, described it as a 'wonderful opportunity' for people to come together.Mr Cox, co-founder of the Together Coalition, said: 'How we mark the Coronation will reflect the kind of country we are. We hope an opportunity to volunteer will leave a long-lasting legacy in communities around the country.'",
        "Stuart Andrew, minister for civil society, said: 'The Big Help Out is a fitting tribute to the King's life of public service and the Queen Consort's long-standing support for volunteering. It will give individuals the chance to see the wider benefits volunteering can bring to their own wellbeing and to efforts to tackle loneliness.'Learn more at the initiative's website www.thebighelpout.org.uk"
    ]
}