{
    "articleURL": "/sport/football/article-12044107/Erling-Haaland-does-not-think-Dixie-Dean-breaking-Premier-League-goal-scoring-record.html",
    "content": [
        "Manchester City moved top of the Premier League with a 3-0 win over West HamErling Haaland scored the second to break the single season PL goal recordHe claimed afterwards he 'does not think' about goal scoring records Erling Haaland claimed he 'does not think' about goal scoring records after netting his 35th league strike of the season.",
        "The Man City striker's chip in their 3-0 win over West Ham took him past Alan Shearer and Andy Cole to record the highest single-season tally in Premier League history.He could still play another nine games across all competitions, and with 51 goals  already, Dixie Dean's record of 63 goals in a top flight season could be in danger.Despite breaking a Premier League record that has stood since 1995, Haaland played down the achievement.Speaking to Sky Sports after the game, he said of the landmark goal: I’m really happy and proud, of course I knew about it [the record].",
        "'Me and Jack [Grealish] spoke before the game and he said he wanted to give me the assist for the record. It was the perfect ball. It was the really perfect bounce as I chip the ball. It was a nice feeling, especially to win the game is also really important.'Grealish played an excellent pass into Haaland down the left wing, who scored the home side's second with a delicate chip.On the prospect of breaking further records, the 22-year-old added: 'I don’t think of this, I sleep tonight and then I think about three points against Leeds. I will go home now and play some video games and then sleep.'Despite being pressed twice on which video games he was playing, Haaland refused to answer as it was 'too embarrassing.' ",
        "He also spoke of a 'nice feeling' when his teammates gave him a guard of honour after the game, despite it being 'really painful' as they hit him on the back, before touching on City's chance of winning the treble.",
        "'Everyone knows its possible,' he said, 'but we can not think about Manchester United in the FA Cup final now, we just have to think about Leeds. We have nine games and they’re all finals.' City's win on Wednesday puts them back on top of the Premier League with a game in hand over second place Arsenal.They still have to face relegation-threatened Leeds and Everton, as well as European hopefuls Brighton plus Brentford and Chelsea.Guardiola will also be desperate for a first European trophy in Manchester, as his side prepare to face Real Madrid in the first leg of their Champions League semi final on Wednesday May 17. "
    ]
}