{
    "articleURL": "/news/article-12060919/Las-Vegas-Middle-School-hard-lockdown-adult-shot-active-incident.html",
    "content": [
        "An adult was shot at the Ed Von Tobel Middle School in Las Vegas at around 12:30pm and was transported to a local hospitalNo other injuries were reported and all of the students were accounted for Police say the suspect is 'still outstanding' A Las Vegas middle school was put on 'hard lockdown' after a male member of staff was shot at the school. ",
        "Around 12:30pm on Monday, Las Vegas Metro police reported a shooting at Ed Von Tobel Middle School on N. Pecos Road.Officials said the adult male was struck by gunfire and taken to the hospital. There are no other injuries reported, Metro police said, and the school has been cleared.Police are now hunting for the suspect, who they described as 'still outstanding.' But authorities said there is no further threat at the time. 'This was not an active shooter,' authorities said at a news conference, explaining that investigators have determined that the shooting was an 'isolated incident.' Authorities have not yet identified the victim, but he is said to be in stable condition. The suspect has not yet been identified.",
        "In a letter to parents, Principal Leonardo Amador said: 'The safety of our students is the number one priority at Von Tobel Middle School. 'As always, we want to keep you informed of important issues happening within our school community. 'The school has been placed on a hard lockdown due to a police investigation,' he said. 'Students are safe in their classroom.' Under a hard lockdown, a school must lock all of its doors and students must hide until they are released.All the students have been accounted for, police said, and Clark County School District Police said they will be conducting a 'controlled release' of the students as parents were pictured eagerly awaiting any news outside.",
        "Two nearby elementary schools were also placed on lockdown. ",
        "In a statement, the Clark County Education Association said it was not surprised by the shooting on Monday given the lack of security at schools.It said: 'Our hearts go out to the adult injured this afternoon in the shooting at Von Tobel Middle School, and we hope for their speedy recovery.'We are deeply saddened by this news, but, unfortunately, we are not surprised. The lack of safety in our schools is nothing short of a crisis, and with hundreds of deadly weapons confiscated already on CCSD campuses this school year, CCEA has been loud and clear that we believe this situation was a school shooting waiting to happen. 'We have been loud and clear that our governor and our lawmakers must act with urgency to address this crisis in the current legislative session—before an event like the one that happened occurred.'We are fortunate that no one was killed in the shooting today, but we cannot afford continued inaction, and we should not expect to be so fortunate the next time,' the group continued.'There are currently two pieces of legislation before the legislature—AB285 and AB330—which are designed to curb this violence in our schools.'Both bills passed out of the Assembly with overwhelming bipartisan support and are awaiting hearings in the Senate. ",
        "'We urge a swift passage of these bills so we can finally ensure that every bus, every classroom, and every campus in CCSD are safe, for our students and staff alike.'"
    ]
}