{
    "articleURL": "/femail/article-12054375/Ex-Play-School-host-Baroness-Floella-Benjamin-performs-ancient-role-Kings-Coronation.html",
    "content": [
        "Baroness Floella Benjamin played key role in Coronation at Westminster AbbeyREAD MORE: Who is Floella Benjamin? From BBC presenter to OBE - and that one time she turned down David Bowie!Royal fans have shared their delight after seeing ex-Play School host Baroness Floella Benjamin perform an ancient role in the King's Coronation. ",
        "The former children's TV presenter, and now an author and peer who chaired the Windrush Commemoration Committee, carried Charles's sceptre, known as the Rod Of Equity And Mercy, at the Westminster Abbey service in London.The 73-year-old was awarded an OBE in 2001 and was considered a close ally of the late Queen and other British royals.Today the mother-of-two was praised for elegantly delivering on the honour of carrying the sceptre ahead of King Charles's arrival at the ceremony.The baroness was photographed donning a regal-red floor-length outfit as she gracefully made her way to the front of the service to fulfil her role.",
        "Only 50 people were selected to participate in the extraordinary ceremony, many of them military representatives and other officials.People from around the world couldn't seem to get enough of the political peer's starring role as they reminisced on the 'childhood legend' who stole the show for some.Taking to Twitter, one person wrote: 'That brief moment when people of a certain age across the nation came together in a cry of \"ooo, it’s Floella Benjamin from Play School and Play Away.\"'Another added: 'It was Floella Benjamin that did it for me, for some reason. Central figure of my early childhood.'A third agreed, tweeting: 'My highlight was my childhood legend Floella Benjamin.'",
        "One added: 'Imma let you finish, but Floella Benjamin had the best sceptre handling.'One person said: 'When I saw her I squealed \"oh my goodness it's Floella Benjamin!!\" Genuine love! She's beautiful, kind and holds a place in all of our hearts.'Meanwhile another tweeted: 'Best bit about the #Coronation (for me) was seeing the icon, Baroness Floella Benjamin.'",
        "Known as one of Britain’s first black children’s TV presenters, the Baroness is one of the most successful names in showbiz, with a 50-year career spanning theatre, film, radio and television.Born in Pointe-a-Pierre, Trinidad, she first arrived on English shores as a Windrush child in 1960 at the tender age of 10.Now she sits in the House of Lords as Baroness Benjamin of Beckenham, has authored over 30 books including her 2022 biography ‘What Are You Doing Here?', and has been awarded a Special Lifetime Achievement BAFTA Award."
    ]
}