{
    "articleURL": "/tvshowbiz/article-12048915/David-Kochie-Koch-sticks-rude-finger-Sunrise-host-Natalie-Barr-live-cross.html",
    "content": [
        "Things took an awkward turn on during a live cross on Sunrise on Friday, when David 'Kochie' Koch stuck his finger up at co-host Natalie Barr on air. ",
        "The co-hosts were having a bit of friendly banter when Kochie, 67, who was broadcasting from London, got 'offended' at Nat, 55, taking a playful dig at his Peaky Blinders-style newsboy cap.'Kochie, looking good,' Matt Shirvington told him, before Nat took a cheeky swipe. 'Uncle Arthur!' Nat said. Kochie laughed it off, before hilariously sticking up his rude finger while live on air. ",
        "'He's upset, he's visibly upset,' Matt said. 'It becomes you, it's beautiful,' Natalie said through laughter.  'Despite all of that i'll take it off now. No, I'm offended,' he said, before carrying on with the job. ",
        "One viewer also shared a screenshot of Kochie sticking up his finger and asked: 'Did he know he was on?' Kochie did the live cross from London and was seen standing outside of Buckingham Palace ahead of King Charles' coronation on May 6. It comes after Kochie scored a major royal scoop on Wednesday when he reported on a man 'throwing shotgun cartridges' into the grounds of Buckingham Palace.As police arrested the man who was reportedly heard shouting, 'I'm going to kill the King,' in the nights leading up to the incident, a 7News crew caught the whole ordeal on camera. ",
        "Kochie and his team were camped outside performing obligatory pre-coronation coverage in preparation for King Charles III and Queen Consort Camilla's arrival.",
        "A well-placed cameraman spotted the drama unfolding at the gates of Buckingham Palace and whipped his camera out just in time to film the man's arrest before another news station could catch wind of it.Witnesses said the man was seen throwing a 'number of items' in the residence grounds before he was arrested. A witness told The Sun that the suspect had stationed himself outside the palace over the 'last few nights' and was heard shouting: 'I'm going to kill the King.'Police say they are not currently treating the incident as terror-related. It is understood it is being treated as an isolated mental health incident.Buckingham Palace confirmed the King and Queen were not in residence when the incident occurred, but a Royal spokesperson would not answer whether any other relatives or family members were there when it unfolded. "
    ]
}