{
    "articleURL": "/wires/pa/article-12048899/Soldiers-emergency-service-workers-medal-supporting-coronation.html",
    "content": [
        "More than 400,000 people – including members of the armed forces and emergency service workers – are to be given a medal for their efforts to support the King’s coronation.",
        "The medal is a gift from the nation to commemorate the coronation for the people who will make the service on May 6 happen, the Department for Culture, Media and Sport said.Everyone actively contributing to and supporting the event will be awarded it, including police officers, choristers, military personnel and ambulance workers.The medals, made of nickel silver, and featuring a portrait of Charles and the Queen Consort on one side and the royal cypher, a laurel wreath and the date of the coronation on the other, are expected to be given to more than 400,000 people.",
        "Its ribbon is made up of red, blue and white vertical stripes.Culture Secretary Lucy Frazer said: “The coronation medal will act as a reminder of the important part each person has played in this moment of history.“From our armed forces who protect our country to the emergency services who care for us at home, alongside those volunteers who are giving up their time to make this event so special, I am delighted that we can mark their contribution to this special day, and for each and every day that they go above and beyond serving their country.”Deputy Prime Minister Oliver Dowden said: “The coronation would not be possible without the dedication and selfless service shown by our armed forces and other public servants.",
        "“This medal is a fitting recognition of their efforts and a thank you from the nation. It will be worn with pride for years to come.”",
        "The medal will also be given to serving members of the police, fire, emergency services, prison services and armed forces who have completed five full years of service.Living individual recipients of the George Cross or of the Victoria Cross will also receive one.Home Secretary Suella Braverman said: “This medal is a symbol of the critical role our emergency services will play in this potentially once-in-a-lifetime opportunity to honour our new King.“However, it rightly also goes further and recognises not just those who are helping at the coronation, but the heroes across our emergency services, such as the police, fire and rescue services, that go to work every day to protect and support us all.”The first coronation medal was awarded in 1603, under the reign of King James I."
    ]
}