{
    "articleURL": "/wires/aap/article-12047843/Walters-tough-love-Broncos-rise-Cartwright.html",
    "content": [
        "Successful head coaches in the NRL must make tough calls on their rosters and Brisbane assistant coach John Cartwright says Kevin Walters has been prepared to make them.",
        "It is one of the reasons why Cartwright says ladder leaders the Broncos have been prospering ahead of the Magic Round clash with Manly at Suncorp Stadium on Friday night.In his first season at the helm in 2021 Walters inherited an outfit that had collected the wooden spoon. He then allowed players such as Matt Lodge, Tevita Pangai Jnr and Tom Dearden to part ways with the club despite being on contract.Those decisions received criticism in some quarters but ultimately allowed Walters to build the roster that now has the Broncos firing with players such as Pat Carrigan, Payne Haas and halves partners Adam Reynolds and Ezra Mam all taking the lead in positions that were vacated.Cartwright, who stood in for a flu-ridden Walters at Broncos training on Thursday, spent eight years as head coach of the Gold Coast and is qualified to speak on the subject.\"There is a lot of hard work to get the roster where it is now,\" Cartwright said.\"It is never easy to move players on that are contracted. He made some really tough decisions that only good coaches make.\"If you sit back and hope that the problem will go away, your career goes away.\"Kevin made some tough calls. He backed it up. He showed confidence in these players and they are starting to repay him.\"",
        "Walters has also followed a path trodden by his old mentor Wayne Bennett in appointing an experienced assistant such as Cartwright, who could also slot in as a head coach at any club.Coaches that feel threatened will often not do that, but Cartwright has been a rock for Walters, while also retaining his straight-shooting ways.\"I just try and offer as much support as I possibly can,\" Cartwright said.\"That is not always saying yes either. He wants you to say what you are actually feeling. That is how I see my role.\"I am there to assist him in any way and what is happening at the moment (by filling in as head coach) is a good example.\"It is a great feeling that he has the trust in you to go out and get the job done.\"Cartwright said that as an assistant he didn't feel the level of pressure that comes with being head coach of the Broncos, but he added that he \"sees it\" while pointing towards the 100-plus fans watching the club train on Thursday.\"You are lucky to get 10 people at training at some of the clubs I have been at but there are a pack of people here watching with high expectations,\" he said."
    ]
}