{
    "articleURL": "/sport/football/article-12060385/Brighton-1-5-Everton-Abdoulaye-Doucoure-Dwight-McNeil-score-braces.html",
    "content": [
        "Abdoulaye Doucoure and Dwight McNeil both scored braces in dominant winJason Steele scored an own goal, with Alexis Mac Allister's also on targetRe-live the action as Everton move out of the drop zone with stunning vitoryIn that split second, as Dwight McNeil rounded Jason Steele and celebrated before he had even put the ball in the net, the troubles of a club in turmoil evaporated.",
        "Everton have been so dislocated from happiness, you wondered if it would ever return, but in the 76th minute there it was: 3000 fans, who had undertaken a 550-mile round trip, deliriously bounced on the South Stand; a coaching staff under pressure to deliver roared as their tension released.Few had given Everton chance of succeeding at Brighton and many anticipated this would be a day when they were pushed ever closer to the brink but, in adversity, a group of players with questions to answer conjured the club’s best away day since a 1-0 win at Old Trafford in December 2013.Numerically, this was their most emphatic victory on the road since trouncing Burnley, managed then by Sean Dyche, 5-1 on Boxing Day, 2018 but plain numbers don’t do this justice. Brighton, who have become everyone’s second club, were flattened; in the process, Everton rose from the dead.McNeil was an emblem for it all, a marauding runner with a left foot like a magic wand, but everywhere you looked you saw outstanding quality: Dominic Calvert-Lewin looked like an England striker, Yerry Mina was a giant, Abdoulaye Doucoure a totem. What has taken them so long?",
        "There are still three games to go in this most torturous relegation battle and, therefore, plenty of time for Everton to mess things up yet it seems inconceivable how, with this spirit, desire and quality, it will be they who slither into the Championship.",
        "To think Brighton started the day looking to solidify their hopes of qualifying for Europe. By the end, if you had come into this stadium unaware of the table, you would have thought it was the team in salmon pink with grand designs on the top six: that is how well Everton played.Football’s ability to balance itself out never ceases to fail. Brighton had the scored their latest ever Premier League goal last Thursday (99 minutes) but the yin to that yang was them conceding their earliest ever Premier League goal here (35 seconds).‘We didn’t forget the Manchester United win,’ hissed Roberto De Zerbi and you could not argue with his point.Some fans hadn’t even reached their seats when Nathan Patterson won possession, nudged a pass forward to Alex Iwobi and he set Calvert-Lewin scampering clear. With time and space to pick a cross, the England international squared to Doucoure and he did the rest.What a start. Fulham’s skewering of Leicester had helped the mood of travelling supporters but this was what really mattered. All they ever want is to see their team giving them something to believe in and how the grasped on to it, singing and roaring them on relentlessly.You were inclined to wonder why it has taken so long for this group to show this level of ability but that question can be answered on another day: this was all about a game plan being ruthlessly executed and a team hoisting itself above that dreaded dotted line.",
        "Brighton looked jaded yet they played an inexplicably high line, resembling a boxer trying to goad an opponent by leaving his chin open. It was madness and, eventually, Everton counterattacked and hit them flush twice to put them through the ropes.",
        "BRIGHTON (4-2-3-1) Steele 5: Caicedo 4, Webster 4 (Colwill 46mins 6), Dunk 6, Estupinan 4: Gross 4, Mac Allister 5: Buonanotte 4 (March 46mins 6), Undav 4 (Encisco 46mins 5), Mitoma 6: Welbeck 5 (Ferguson 46mins 6) Subs not used Sanchez (GK), Ayari, Gilmour, van Hecke, MoranGoals – Mac Allister (79)Booked – DunkManager – Roberto De Zerbi 5EVERTON (4-2-3-1) Pickford 8.5: Patterson 7, Mina 8, Tarkowski 7, Mykolenko 7: Garner 7, Gana Gueye 8: Iwobi 8, Doucoure 8, McNeill 9: Calvert-Lewin 8.5 Subs not used: Begovic (GK), Holgate, Keane, Onana, Gray, Maupay, Davies, Coady, SimmsGoals – Doucoure (1, 30), Steele (o.g 35), McNeil (76, 90)Booked – Mina, Gueye, DoucoureManager – Sean Dyche 8Attendance – 31,567Referee – S Hooper 6",
        "It was Doucoure who would double Everton’s lead. He won a tackle on the edge of his own box, poked possession on to Gana Gueye who, in turn, set McNeill scuttling down the left. His cross was beautiful and the Malian, having galloped 70 yards, thrashed in a volleyed finish.",
        "De Zerbi was incredulous, hectoring his coaches about the amount of space and non-existent challenges but this was all about Everton, who looked like they were capable of scoring every time they motored into wide open spaces.That is precisely what happened the next time they broke. Again it was from deep, Iwobi playing a one-two with Calvert-Lewin before sending Doucoure on his way. The pass went a little too far wide but he retrieved it and gave it to McNeil, whose cross went in off goalkeeper Jason Steele.Few could believe what they were seeing. Everton had not scored three times away from Goodison since February 6, 2021 but they were playing like men possessed and a fourth should have arrived on the stroke of half-time, only for young James Garner to fluff his lines, allowing Steele to save.Four changes at half-time showed how enraged De Zerbi was by what he had seen. To their credit, Brighton – particularly Solly March – kept asking questions after the break and it need some super saves from Jordan Pickford, plus a crossbar stopping Evan Ferguson, to prevent anxiety spreading.",
        "Once the storm had been weathered, though, opportunity was there for Everton and how they took it. McNeil, the game’s outstanding performer, waltzed in the goal that settled things and while Alexis Mac Allister got a consolation, Everton had the final word.",
        "Fittingly, it was McNeil, who darted down the left again and unleashed a crackerjack drive that arrowed into the top corner. The home fans flocked to the exits in their droves, their opposite numbers wouldn’t go home. Happiness does that to you."
    ]
}