{
    "articleURL": "/wires/aap/article-12038615/Path-avoid-economic-crash-RBAs-sights.html",
    "content": [
        "Retail sales lifted a modest 0.4 per cent in March but the spending on non-essentials is pulling back as cost of living pressures bite.",
        "The 0.4 per cent lift in official Australian Bureau of Statistics retail turnover figures follows a modest 0.2 per cent uptick in February.While sales have lifted for the third month in a row, ABS head of retail statistics Ben Dorber said monthly turnover was sitting at a similar level to six months prior due to a slowdown in spending on discretionary goods.Food-related spending drove the monthly uptick, with Mr Dorber largely chalking that up to the high food inflation.\"Businesses in cafes, restaurants and takeaway food services are passing on their rising costs to consumers through price rises, while also benefitting from strong demand driven by the continued return of large-scale cultural and sporting events,\" he said.Sales across cafes, restaurants and takeaway food services lifted 1.5 per cent, whereas food retailing lifted one per cent.But spending on discretionary items has started to dry up in response to higher interest rates and cost of living pressures.Clothing, footwear and personal accessory retailing fell the most, dropping one per cent, followed by household goods, which sunk by 0.4 per cent.Mr Dorber said the bureau's quarterly retail sales volumes, due next week, would shed some light on how high inflation was influencing turnover growth numbers.Inflation fell back to seven per cent in the March quarter from its likely peak of 7.8 per cent in the December quarter.",
        "The retail trade data follows the Reserve Bank's decision to hike interest rates on Tuesday by another 25 basis points.Treasurer Jim Chalmers said the move surprised markets, with the benchmark S&amp;P/ASX200 index plunging 0.8 per cent in the three minutes after the central bank's announcement.Asked if the hike blindsided the government as he put the finishing touches on the federal budget, Dr Chalmers said he did not pre-empt or second-guess decisions by the independent central bank.\"We've got our own job to do and that's my focus,\" he told reporters in Canberra.\"One of the important tasks of the budget is to make sure that we can provide cost of living relief without adding substantially to the inflationary pressures in our economy.\"Speaking at an event in Perth on Tuesday night, RBA governor Philip Lowe said he was confident he could deliver a soft landing for the economy after the board pulled the trigger on another interest rate hike.Asked if the central bank was playing \"recession roulette\" by hiking rates again, he told an RBA board dinner in Perth the \"narrow path\" to dodge a recession \"wasn't getting any narrower\" but there was still uncertainty clouding the outlook.He also said returning inflation to target while preserving most jobs hinged on the population believing inflation would come down quickly."
    ]
}