{
    "articleURL": "/wires/ap/article-12038505/Kenyan-pastors-appear-court-deaths-parishioners.html",
    "content": [
        "NAIROBI, Kenya (AP) - Two pastors based in coastal Kenya have appeared in court over the deaths of more than 100 of their congregants, many of whom are believed to have starved to death.",
        "Pastor Paul Mackenzie was released by one court in the town in Malindi before being rearrested and presented at an upper court in the town of Shanzu.Mackenzie was first arrested two weeks ago over links to cultism for asking his followers to starve to death in order to meet Jesus.More than 100 bodies have been exhumed from dozens of mass graves on his property within Kilifi County. Children are believed to be among the dead, but it is unclear how many, as some of the bodies are in poor condition.The higher court has authorized Mackenzie´s detention until Friday, when an application to hold him for a further 30 days pending terrorism investigations will be heard.His wife, Rhoda Maweu, was arrested on Monday night from a hideout in the coastal town of Mtwapa after weeks on the run.",
        "Autopsies on 40 of the bodies found on Mackenzie´s property revealed that the causes of death ranged from starvation to strangulation and suffocation.Pastor Ezekiel Odero, whose church is in the same county as Mackenzie´s, has also appeared in court. He will remain in custody for a further two days as investigations continue.His followers trouped in large numbers outside the court Tuesday, praying for his release.Odero was arrested last week in connection to the deaths of dozens of his congregants at his megachurch, which draws thousands of people from across the country.",
        "He is also being investigated for his links to Mackenzie.After Mackenzie closed his church in 2019, Odero bought a television channel from him.Mackenzie had been charged in 2017 over the deaths of children at his church. In 2019, he closed the church and moved to a ranch in a forested area of Kilifi county, where hundreds of families built houses.One of his followers told The Associated Press that it was at this time that a plan to starve till death in order to meet Jesus was hatched and his followers started dying.Human rights groups had been sounding the alarm for months until April, when police began investigating and mass graves were discovered at the ranch.Currently, police are conducting search and rescue missions on the 800-acre (325 hectares) property and at an even bigger ranch nearby. So far, 48 people have been rescued alive and 24 arrests made, according to Coast Regional Commissioner Rhoda Onyancha.The operation to dig for more bodies has stalled even as the government announced a dusk-to-dawn curfew in the area and redeployed all senior police commanders to pave the way for a thorough probe."
    ]
}