{
    "articleURL": "/news/article-12056371/Texas-mass-shooting-Americas-199th-gun-massacre-2023-nation-bloodiest-year-EVER.html",
    "content": [
        "The massacre in Allen, Texas was the 199th mass shooting in the U.S. this year  Saturday's shooting was one of the deadliest of the year, with nine dead so farThe rate at which mass shootings are occurring in 2023 outpaces previous years America is on course to have its bloodiest year on record after Saturday's Texas mall massacre brought the number of mass shootings in the U.S. this year to 199.",
        "The rate at which mass shootings have occurred in the U.S. this year has also far exceeded that of recent years, according to data from the Gun Violence Archive.The county surpassed the grim milestone of more than 100 mass shootings on March 5 - nearly two weeks ahead of the date on which the figure was hit in 2022.The horrifying data comes after a gunman killed at least eight people at Allen Premium Outlets in Allen, Texas on Saturday before being shot dead.",
        "At least 74 people have been killed or injured in school shootings, including the mass shooting in Nashville, Tennessee at The Covenant School in late March, according to one report.The Nashville mass shooter, Audrey Hale, was one of just five female mass shooters in history when she gunned down six people, including three children, before cops shot her dead.In April, Connor Sturgeon, a young employee of the Old National Bank in Louisville, Kentucky, killed five people at his workplace before he was also shot dead, bringing the number of mass shootings in the U.S. to 146. There have been at least 12 mass shootings in Texas alone in 2023, including the latest one on Saturday at Allen Premium Outlets which left eight people and the shooter dead, making it one of the deadlier mass shootings of the year.",
        "The mass shooting in Monterey Park, California, in January, is so far the deadliest of the year after 12 people – including the shooter – was killed.Eight people were killed during a shooting on January 4 in Cedar City, Utah, when Michael Haight killed his wife, their five children and his mother-in-law before turning the gun on himself",
        "The Gun Violence Archive (GVA), a non-profit research database that tracks shootings across the US, defines a 'mass shooting' as those with a minimum of four victims shot, either injured or killed, not including any shooter. As well as active-shooter incidents such as those in Louisville, 'mass shootings' include accidental firearm incidents, armed robberies, familicide, home invasions and drive-bys, among others.The GVA does not differentiate, for instance, between a gang shooting and a school shooting when they compile these statistics.Another database, published by USA Today, tracks a much narrower category known as 'public mass killings', which are defined as events in which four or more people are killed, not including the attacker, in a public place such as a school or a bank.The most public mass killings to ever occur in a single year in America has been ten.The Allen massacre was this year's fifth in the same number of months, meaning that the country is potentially on track to set a new record.",
        "So far 14,672 people have died in 2023 due to gun violence, including more than 8,000 people through suicide by gun, as well as more than 6,000 who were the victims of homicide, murder, and unintentional shootings.The terrifying death rate is not surprising with about 120 guns for every 100 Americans, according to the Switzerland-based Small Arms Survey.No other nation has more civilian guns than people. In the U.S., 44 percent of adults live in a household with a gun.",
        "About one third of individuals own a gun personally, according to a November 2020 Gallup survey. And a third of US adults believe there would be less crime if more people owned guns.The latest U.S. mass shooting rocked the small city of Allen, Texas - a suburb about 20 miles outside of Dallas. The lone gunman began his rampage at about 3:30pm on Saturday, forcing a mass evacuation and leaving residents desperate for answers.Dashcam footage showed the moment the gunman, dressed in full SWAT garb, pulled up to the outdoor outlet before opening fire with his AR-15- on unsuspecting civilians, including children.The scene quickly resembled a warzone with at least four bloodied bodies seen lying outside the H&amp;M where the gunman began his assault.Saturday's shooting occurred just shy of the one-year anniversary of the mass shooting in Uvalde, Texas which saw nineteen children and two adults fatally shot by an 18-year-old gunman with an assault weapon.",
        "'We are horrified by today's senseless tragedy and outraged by the violence that continues to plague our country,' Allen Premium Outlets said in a statement Saturday night,",
        "'Our thoughts and prayers are with the victims, their families and others affected by this heinous act. We are thankful for the police officer's heroic actions and for the support of all the first responders.'Texas Governor Greg Abbott said his office had sent state officials from multiple agencies to aid Allen police with their investigation, including the Texas Department of Public Safety (DPS) and the Texas Rangers.'Our hearts are with the people of Allen, Texas tonight during this unspeakable tragedy,' he said in his written statement.'I have been in contact with Mayor Fulk and DPS Director McCraw as well as other state and local leaders and offered the full support of the State of Texas to local officials to ensure all needed assistance and resources are swiftly deployed.'Mayor Kevin Fulk, a lifelong resident of Allen, added: 'Today is a tragic day for the city of Allen ... We know the days ahead will be difficult and somber.'"
    ]
}