{
    "articleURL": "/news/article-12042623/Sex-harassment-allegations-against-Kevin-Costner-massage-Scottish-hotel-2004-resurface.html",
    "content": [
        "Costner was accused of performing a sex act while getting a massage from a masseuse at the five-star Old Course Hotel in St Andrews, ScotlandHe was staying at the hotel in 2004 during his honeymoon with BaumgartnerThe allegation resurfaced amid the news that Baumgartner has filed for a divorceA criminal complaint was never made and Costner was not sued directly. There is no suggestion the allegation is linked to the divorce Kevin Costner was accused of sexual harassment in 2004 by a masseuse at a luxury hotel in Scotland during his honeymoon with wife Christine Baumgartner.",
        "The allegation has resurfaced online after Baumgartner filed for a divorce from Costner. Costner, then 49, was accused of harassing a masseuse, 34, during a massage at the five-star Old Course Hotel in St Andrews, Scotland. He was staying at the hotel in October 2004 during his honeymoon with Baumgartner and the allegations emerged in a lawsuit filed by the masseuse against the hotel, which claimed she was sacked after reporting the incident.The woman, who was not named, said Costner dropped his towel and exposed himself. A criminal complaint was never made and Costner was not sued directly. There is no suggestion the allegation is linked to the divorce.'It was disgusting,' she said. 'And even though he was a Hollywood film star I can't believe he thought he could get away with it. He abused me and I considered that a criminal act.'",
        "A spokesman for Costner said on Wednesday: 'The referred to allegations were not true then and are not true now. Further, Mr. Costner was never part of any legal proceeding.'Costner was initially kept anonymous in the lawsuit but an employment tribunal in Scotland later said there was no reason his identity could not be reported. The woman, who sued the hotel for unfair dismissal and sexual discrimination, later settled the case.",
        "She said that instead of supporting her, the hotel - owned by Costner's American businessman friend, the late Herb Kohler - made her feel increasingly unwanted.At the time, Costner's publicist said the case was 'never about' the actor and was 'a dispute between a hotel and an ex-employee'. The rep said the claims '[tarnished] what was a wonderful time spent at this resort with his wife'.Baumgartner, who tied the knot with Costner in 2004, filed the petition to separate from the Oscar and Emmy winning actor on Monday.It comes six months after she told him to quit Yellowstone because his busy filming schedule was impacting their family.The split is said to be due to 'irreconcilable differences,' with Baumgartner asking for joint custody of their three children - Cayden, 15, Hayes, 14, and Grace, 12. Costner, 68, has taken on a new Western project that he is set to direct, produce and star in and has a mammoth shooting schedule of 220 days. And there are rumors he may star in the sixth season of the hit series Yellowstone. ",
        "Costner went to the Milano Restaurant and Bar in Las Vegas with his cast and crew following a special pre-screening of his new western movie project Horizon: An American Saga.Owner and chef Laura Migliorini posed for a picture with Costner alongside manager and partner Laura Trent.",
        "She shared the snap on Instagram and wrote: '@kevincostnermodernwest what a pleasure it was to host this wonderful dinner at @milano_restaurant_bar for such a wonderful actor!' Baumgartner reportedly gave Costner an ultimatum in October to quit the popular neo-Western show, Yellowstone, because he would be filming in Montana for months at a time and away from their family who live in Los Angeles. 'It's really knocked a hole in their family life,' a friend of hers told Radar. 'She wants a firm commitment this is his last season — or he might have to hit the dusty trail!' But Costner continues to lead a busy lifestyle as he finished filming the first of four installments for his new western Horizon: An American Saga in November before he started shooting again the following spring. Production for the second film began in mid-April in southern Utah before Baumgartner filed for divorce on Monday. Costner wanted to shoot all four parts of the project, which involves 170 speaking roles, back to back.'So, I'll probably shoot for eight months,' he previously told Variety. 'It's a mountain — a mountain of time.' 'I'm as pressed as I've ever been in my life in terms of the responsibilities and the amount of decisions I'm having to make every day, between doing what I'm doing every day for 'Yellowstone' and my own [work]. ",
        "'There's a lot of people standing behind me waiting for me to make decisions and things like that.'",
        "Horizon is an ambitious project which spans 15 years of 'the pre- and post-Civil War expansion and settlement of the American West' and it sees him directing for the first time since Open Range in 2003. Each film, which will be released three months apart from each other, is close to three hours long.And after the quadruple release, Horizon is going to be broken into a series for television - each with 42-minute episodes. Costner has played patriarch John Dutton III in Yellowstone since 2018 but he reportedly only wanted to film the back half of the season for just one week as he was busy with the Horizon project.It is unclear when production will begin on the new episodes for Yellowstone Season 5, or if those episodes will feature the death of John Dutton.But Paramount network president Keith Cox said he was 'very confident' that Costner would return for the rest of the fifth season.There are even rumors that Costner might return for a sixth season of the hit series. "
    ]
}