{
    "articleURL": "/news/article-12043705/Bed-Bath-Bust-Bankrupt-retailers-fire-sale-disappoints-just-10-PERCENT-discounts.html",
    "content": [
        "Bargain hunters flocked to Bed Bath &amp; Beyond to take advantage of the store's discounts following its bankruptcy But shoppers left feeling disappointed after the retailer offered smaller deals than expected The big box brand's collapse has come as a shock to faithful customers after it once commanded a fleet of 1,500 locations across AmericaShoppers hoping to find a bargain at bankrupt retailer Bed Bath &amp; Beyond's closing sale have slammed the store for its lackluster last chance discounts. ",
        "The iconic retailer suffered a post-pandemic disaster that ultimately ended in Chapter 11 bankruptcy last week, leading it to 'slash' prices to empty some of its defunct stock. But Manhattan patrons expecting regular 'everything must go'-style sales were left frustrated, with the store-wide discounts barely topping the brand's regular sales. 'They always had a 24/7 sale,' shopper Mira Bel told DailyMail.com. 'It's the same, you'd expect more with them closing... it's so rare that a shop is closing, but they don't really have much of a sale.' ",
        "Eager shoppers anticipated saving a few dollars with the collapse of the once-powerful big box brand. But numerous shoppers streaming through the flagship store in Manhattan's Chelsea neighborhood left with empty shopping carts after failing to find any real deals.'We came just to see what was here, and well - not impressed' said Eileen Keller. 'I don't see any bargains.'Her sister-in-law Janet Reisel clutched a handful of 20 percent-off coupons, only to discover the business had ended its voucher program the day before and transitioned to a 'huge' discount sale to sell off its inventory. 'Now they're offering 10 percent when we used to get 20,' she added. ",
        "Unlike Black Friday-esque shopping sprees where customers revel in often-aggressive product grabbing, Bed Bath &amp; Beyond's botched bargain promotion brought a quiet, disappointed feeling. ",
        "'The prices weren't so far worth coming out for,' said Wes Triplett, who admitted the only item he would buy was a Kleenex dispenser. 'I actually came down here with a friend, and she walked out faster than I did.' 'I'm sad that it's going though, it's been a great store.' 'I thought it was going to be 30 to 70 percent off,' added Seri Westerbeck, who said she visited the store specifically to find a deal. Another disgruntled buyer said the store's attempts at a sale didn't meet expectations: 'I mean it's only 10 percent off... its nothing revolutionary.' However, she added that the store's disappearance from high streets will be 'a shame', because 'basically everything will be online now.' ",
        "The decline of Bed Bath &amp; Beyond has stunned fans of the iconic store, which once commanded a fleet of 1,500 locations across America. Its collapse came after a period of relative success, where the Covid-19 pandemic saw homeowners trapped inside, causing a surge in demand for Bed Bath &amp; Beyond stock.The company attempted to roll out a series of new products to capitalize on the new demand in 2021. But when the retail industry was subsequently hit with supply chain problems, the company's bold plan suffered.Bed Bath &amp; Beyond would lose millions in its unsold stockpile, setting up a lengthy spell of decline that has resulted in reports of an imminent bankruptcy.",
        "As it faced a poor financial outlook, the business kicked off 2022 with a devastating earnings report that showed its net sales fell 28%, while its net losses ballooned by over $75 million.By April, the company reported it was running at a net loss of $159 million, compared to a $9 million profit the year before, according to Retail Dive.",
        "With the company's finances spiraling, its CFO Gustavo Arnal, 52, jumped from his 18th floor apartment to his death in Manhattan in September.His suicide came days after the embattled retailer announced it was shuttering stores and laying off workers, alongside news that Arnal - as well as the company - were being sued over accusations it artificially inflated the firm's stock price in a 'pump and dump' scheme.The business previously announced plans to end the year with just 480 stores, but when its stock price plummeted last month, executives failed to sell off enough of its stock value to prevent defaulting on its loan. DailyMail.com has contacted Bed Bath &amp; Beyond for comment. "
    ]
}