{
    "articleURL": "/news/article-12049111/NSW-Police-launch-search-Hampton-State-Forest-near-Jenolan-missing-woman-Jessica-Zrinski.html",
    "content": [
        "Desperate search for missing woman ramped upPolice searching Hampton State Forest in central-west NSWJessica Zrinski vanished without a trace in NovemberA large-scale search has been launched in bushland for a woman who vanished without a trace from Sydney five months ago.",
        "Jessica Zrinski, aged 30, was last seen in Bossley Park in Sydney's south-west on November 25 before her concerned family reported her missing to police five days later.Local police conducted extensive inquiries before homicide detectives took over the investigation under Strike Force Keder.Inquiries have since revealed Jessica was captured on CCTV in the carpark of a hotel on Mimosa Road at nearby Greenfield Park around 10pm on November 28 before she got into a blue Holden Commodore station wagon 10 minutes later.The vehicle is believed to have travelled west on the M4 and Great Western Highway towards the Blue Mountains.On Friday, investigators launched a land search in the Hampton State Forest about 25km north of Jenolan in central-west NSW as part of the ongoing investigations.",
        "Detectives believe Jessica may have entered or visited the state forest sometime after getting into the Holden Commodore.Investigators have vowed to leave no stone unturned in their ongoing investigations.'Our investigators are conducting this search to find some trace that Jessica may have been here and will leave no stone unturned in our quest to locate her,' Homicide Squad Commander Detective Superintendent Danny Doherty said.'We strongly urge anyone who may know any further information on Jessica's whereabouts to please come forward. We want to find her and provide her family with much-needed answers.'",
        "The extensive search will include officers from PolAir, the Dog Unit, the Rescue and Bomb Disposal Unit along with SES and NSW RFS volunteers.The search of the 5,200-hectare forest will continue through to Sunday.The search was launched several week after investigators released eerie CCTV of Jessica's last known movements on November 28.She was wearing an orange singlet top, long black leggings, flat shoes and carried a cream handbag at the time.",
        "'Investigators have been told Jess is a friendly, approachable person who is known to seek lifts with people she didn't necessarily know,' Det Supt Doherty said at the time. 'It's been almost six months without anyone seeing or speaking with Jess, and we want to speak to anyone who may have had any interaction with her on the night of Monday 28 November 2022 into the following morning.'The reality is that detectives are investigating all lines of inquiry, including whether she has met with foul play.'Ms Zrinski is described as of Caucasian appearance, 165cm tall, thin build and has blonde hair.She also has tattoos on her right index finger, inside her left wrist and on the back of her neck.Anyone with information is urged to contact Crime Stoppers.",
        "November 25, 2022 - Jessica Zrinski was last seen in person around 10pm in the Bossley Park area November 28, 2022 - 8.35pm. She is captured on CCTV footage in Bossley Park, walking south along Zadro Avenue9.45pm. The 30-year-old is then captured again outside a club on Prairie Vale Road9.50pm. She is then captured walking east on the same some road 9.53pm. Ms Zrinski is seen on CCTV footage in the carpark of a Mimosa Road hotel at Greenfield Park. She is seen getting into a blue Holden Commodore station wagon10.09pm. The station wagon is seen leaving the hotel carpark. It is believed to have then travelled west on the M4 motorway and Great Western Highway towards the Blue MountainsDecember 3, 2022 - Ms Zrinski's family report her disappearance to authorities after they could not get in touch with her or locate her whereaboutsDecember 5, 2022 - NSW Police issue a missing persons alert for Jessica ZrinskiJanuary 20, 2023 - CCTV footage is released by police of Ms Zrinski walking through suburban streets in Bossley Park on November 28April 14, 2023 - New images of a blue Holden Commodore station wagon the missing woman was seen getting into on the night of her disappearance are released by police with hopes motorists will be able to come forward with further information "
    ]
}