{
    "articleURL": "/wires/pa/article-12039075/Man-arrested-shotgun-cartridges-thrown-grounds-Buckingham-Palace.html",
    "content": [
        "A man has been arrested outside Buckingham Palace after throwing suspected shotgun cartridges into the palace grounds, police said.",
        "The Metropolitan Police said he was detained at around 7pm on Tuesday after he approached the palace’s gates in central London and threw a number of items.He was held on suspicion of possession of an offensive weapon after he was searched and a knife was found, but he was not carrying a gun. There have been no reports of any shots fired, or any injuries to officers or members of the public  Chief Superintendent Joseph McDonald  Cordons were put in place after he was found with a “suspicious bag” but have since been removed, the force added.A controlled explosion was conducted as a precaution, Scotland Yard said, and the detonation was heard live on GB News.Neither the King nor the Queen Consort were at Buckingham Palace at the time of the incident.But Charles did host Australian Prime Minister Anthony Albanese during an audience at the palace earlier on Tuesday.",
        "The items thrown into the palace grounds “have been recovered and will be taken for specialist examination”, the Met said.Police say they are not currently treating the incident as terror-related.It is understood it is being treated as an isolated mental health incident.Chief Superintendent Joseph McDonald said: “Officers worked immediately to detain the man and he has been taken into police custody.",
        "“There have been no reports of any shots fired, or any injuries to officers or members of the public.“Officers remain at the scene and further inquiries are ongoing.”",
        "Buckingham Palace declined to comment and said the incident was a matter for the Met Police. A ring of steel is expected in the capital for Charles’s coronation at Westminster Abbey on Saturday.Policing minister Chris Philp has described it as a “huge policing operation”, and heads of state and foreign royals from around the world are set to travel to the UK.In February, Jaswant Singh Chail, then 21, admitted a charge under the Treason Act of trying to harm the late Queen.He was caught in the grounds of Windsor Castle with a loaded crossbow on Christmas Day 2021, close to the late Queen’s private residence, where she and other members of the royal family were at the time.The former supermarket worker had scaled the perimeter of the grounds with a nylon rope ladder at around 6am – wearing black clothes, gloves and a metal mask – and later told an officer: “I’m here to kill the Queen.”Chail, from Southampton, Hampshire, appeared at the Old Bailey by video link in February and pleaded guilty to three charges, including an offence under the Treason Act.",
        "He also admitted to making a threat to kill the Queen and having a loaded crossbow in a public place."
    ]
}