{
    "articleURL": "/news/article-12050605/Isaac-Martin-jailed-killing-accused-murderer-Zlatko-Sikorsky-Wolston-Correctional-Centre.html",
    "content": [
        "Zlatko Sikorsky killed by inmate Isaac Martin Martin said it might have been 'payback'Sikorsky was accused of murdering girlfriend An inmate who killed a murderer in prison said the attack may have been 'payback' for him allegedly taking the life of his teenage girlfriend. ",
        "Zlatko Sikorsky, 37, was punched in the head at the Wolston Correctional Centre, southwest of Brisbane on November 10, 2020, and died 10 days later in hospital.He'd been charged with murdering 16-year-old Larissa Beilby in 2018, after her body was found in a barrel in the back of a ute in Stapylton, on Queensland's Gold Coast.Sikorsky was due to stand trial at the end of 2019 facing charges of murder, interfering with a corpse, deprivation of liberty and torture.Fellow inmate Isaac James Martin, 29 - who lived in the cell next door to Sikorsky - on Friday pleaded guilty to one count of unlawful striking causing death in Brisbane Supreme Court.",
        "When a prison guard asked Martin if he was upset about Sikorsky's death he said: 'Maybe God let it happen for a reason? Maybe payback or karma for what he did to that young kid?' 'I don't give a f**k, I don't really care,' he said, the Courier Mail reported.The court heard Martin had a severe personality disorder, as well as narcissistic and psychopathic traits due to a difficult childhood where he was neglected by his mother.At the time of the attack, Sikorsky and Martin had been chatting outside of their cells and were believed to be friends.",
        "Crown prosecutor Philip McCarthy said there didn't appear to be any tension between the pair before Martin suddenly launched his fist to the left side of Sikorsky's face.",
        "Sikorsky then collapsed and smacked his head on the ground before spending the next ten days in hospital where he eventually succumbed to his injuries.Martin had told inmates Sikorsky was his 'best friend' and that 'he didn't mean to hurt him', but said he'd been hearing things.Among his reasons for punching his fellow inmate, Martin said he believed Sikorsky and others were planning to attack him.Martin was serving two cumulative sentences when he killed Sikorsky, and had a criminal history stretching back a decade. He was on Friday sentenced to 11 years jail. He'd been eligible for parole in July this year after serving time for assault. Martin must now serve 80 per cent of his new sentence before being eligible for parole. "
    ]
}