{
    "articleURL": "/wires/ap/article-12046689/Atlanta-shooting-suspect-charged-murder.html",
    "content": [
        "ATLANTA (AP) - The suspect in a mass shooting in Atlanta that left one woman dead and four others wounded has been charged with one count of murder and four counts of aggravated assault, Fulton County Jail records show.",
        "Deion Patterson waived his first court appearance Thursday, a day after police say he opened fire in the waiting room of an Atlanta medical practice. Authorities swarmed the city´s midtown neighborhood shortly after noon Wednesday in search of the shooter. Patterson, 24, was captured hours later in Cobb County, just northwest of Atlanta, after several residents there called 911 to report seeing someone who matched his description.Patterson was being held without bond. Shawn Hoover, an attorney appointed to represent him, said he met with Patterson Thursday morning.\"He is a veteran and suffers from apparent mental health issues,\" Hoover wrote in an email. \"My team is investigating the details and circumstances of the charges to provide him with zealous, effective, and timely representation.\"Atlanta Police Deputy Chief Charles Hampton Jr. declined Wednesday to discuss any details of the investigation or a possible motive, saying, \"Why he did what he did, all of that is still under investigation.\"Patterson had an appointment at a Northside Medical building and opened fire shortly after arriving in an attack that lasted about two minutes, law enforcement officials said at a news conference Wednesday night.",
        "Patterson then went to a Shell gas station and took a pickup truck that had been left running and unattended, authorities said.",
        "Amy St. Pierre, 38, was pronounced dead at the scene. She left behind a husband and two young children.The Centers for Disease Control and Prevention, where she worked, \"is deeply saddened by the unexpected loss of a colleague,\" spokesperson Benjamin Haynes said in a statement.St. Pierre has done research aimed at reducing pregnancy-related deaths, according to a 2021 research report she co-authored. That research involved a CDC program called \"Enhancing Reviews and Surveillance to Eliminate Maternal Mortality.\" A key aim of the initiative is to work toward \"the elimination of preventable maternal mortality in the United States.\"\"She was driven by compassion, both in her work in the field of maternal mortality, and in her everyday life,\" her family said in a statement issued Thursday. \"Amy was selfless always, she wanted more for others but never for herself. Generous supporter of worthy causes, she was the social conscience of our family.\"Patterson used a semi-automatic handgun to shoot St. Pierre according to arrest warrants released Thursday. He also shot Alesha Hollinger in the face, and fired multiple shots into Jazzmin Daniel's abdomen, the documents state. Another woman, Lisa Glynn, was shot in the abdomen; and Georgette Whitow was shot in the arm, the records show.The four women who survived remained hospitalized Thursday, authorities said. Three of the four were in the intensive care unit, said Dr. Robert Jansen, chief medical officer at Grady Memorial Hospital.",
        "Daniel has been able to communicate with her loved ones by using her hands and fingers, her father said Thursday.\"She just keeps giving us the thumbs-up,\" Quentin Daniel told The Associated Press.Daniel, 25, is an intake nurse at the midtown clinic, where she is among the first to interact with patients at the clinic, her father said. She was to have been transferred to Northside Hospital just north of the city on Friday.She's also missing her 1-year-old child, who is being cared for by relatives, he said.Jansen said he´s been able to speak to two of the women, who told him they are grateful for the care they´re getting, \"but they realize that this is a horrific event and the fact that they were in a health care facility just makes it worse.\"\"Physically, they all have a ways to go,\" Jansen said. \"I think psychologically and mentally, we have to also remember that, the impact on them and their families. You know, you can´t underestimate how traumatic this is. And they have a long way to go.\"Patterson was arrested after 911 calls from residents near the Braves' stadium.One man who lives in an apartment complex near there called to say he had been walking his dog when he saw the distinctive footprints from a pair of Nike Air Force 1 sneakers in the mud, according to 911 calls released Thursday. Since he rarely saw any prints other than his own in the mud, he thought it could be related and called 911. After hearing about the shooting, another resident saw a man in a hoodie and carrying a black bag throw something in a pond. Dispatchers worked with her and others to pinpoint the location.",
        "The shooting comes as cities around the U.S. have been wracked by gun violence and mass shootings in 2023.Patterson´s mother, Minyone Patterson, who police said had accompanied her son to the medical office, told the AP by phone Wednesday evening that her son, a former Coast Guardsman, had \"some mental instability going on\" from medication that he began taking Friday.She said her son had wanted Ativan to deal with anxiety and depression but the Veterans Affairs health system would not give it to him because they said it would be \"too addicting.\" She´s a nurse and said she told them he would only have taken the proper dosage.\"Those families, those families,\" she said, starting to sob. \"They´re hurting because they wouldn´t give my son his damn Ativan. Those families lost their loved ones because he had a mental break because they wouldn´t listen to me.\"She ended the call without saying what medication her son had been taking.Doctors´ offices and medical clinics in the U.S. have increasingly become targets of gun violence. And many physicians who prescribe pain medication report being threatened by patients, such as those being given alternatives to opioids or being weaned from addictive painkillers.According to the American Academy of Pain Medicine, more than two-thirds of pain specialists surveyed during a 2019 violence education session reported being threatened by patients at least once per year. And nearly half said they had been threatened over opioid management.",
        "___This story was first published on May 4, 2023. It was updated on May 5, 2023 to correct the age of the woman killed. Amy St. Pierre was 38, not 39 as police had said."
    ]
}