{
    "articleURL": "/money/markets/article-12047127/L-G-halts-production-modular-homes-factory-putting-475-jobs-risk.html",
    "content": [
        " L&amp;G began building prefab houses at its Selby factory in 2017Today it said it would 'cease production of new modules at the factory'The division racked up losses of £37m last year, and £174m overall Legal &amp; General is to halt production at its modular housing factory near Leeds after years of weak demand, putting 475 jobs at risk.",
        "The group, one of Britain's biggest insurance and pension firms, began building prefab houses at its Selby factory in 2017 as a national shortage of affordable homes made the concept come back into fashion.But today, L&amp;G said it would 'reduce business activity and cease production of new modules at the factory'.It will also review and assess 'potential strategic options' for the division, which racked up losses of £37million for last year, and a £174million cumulative loss since it was set up seven years ago.",
        "It is understood that the group has launched consultations with all 475 staff at the L&amp;G Modular Homes business, with plans to make the majority of workers redundant.L&amp;G blamed long planning delays and the impact of the pandemic for weakness in the firm's pipeline of orders for new homes.The company has also faced significant rises in timber and steel prices, which have been putting pressure on the cost of producing homes. Bill Hughes, chairman of Legal &amp; General Modular Homes' board, said it was no longer 'sustainable' to continue producing more modules.'We are therefore reluctantly proposing to reduce business activity and cease production of new modules at the factory,' he said.'Regrettably, this includes commencing consultation with all employees around the proposal to make the majority of modular homes roles redundant.",
        "'We recognise this will be a challenging and uncertain period for our staff and we will be actively exploring redeployment opportunities and supporting them during this difficult time.'The last time the UK used factory-built homes at scale was after the Second World War, when the Government commissioned hundreds of thousands of prefabs to house those left homeless by air raids.In the past few years, the concept has become fashionable again – though in a much more high-tech form - amid a Government push to get more homes built and make buying a property more affordable.Modular homes are built from scratch in factories and then are shipped out by road to their final locations.",
        "Beleaguered tech firm Wandisco has announced it will lay off around 30 per cent of its staff as part of a 'reorganisation and review process' of the company.It said the job cuts were 'difficult but necessary' and would affect all areas of the company, both operationally and geographically.It comes just less then two months after the software provider suspended trading of its shares on the junior AIM market after uncovering 'significant, sophisticated and potentially fraudulent irregularities' in the previous year's financial statements.Professional services group FRP Advisory was subsequently appointed to lead an investigation into the matter. The Financial Conduct Authority is also conducting a probe into the alleged fraud.In a short statement to shareholders, chairman Kenneth Lever said: 'The proposal to reduce the Company's overall headcount was considered at great length. 'Regrettably, the proposed action is a necessary step to responsibly position WANdisco for long-term growth.'We are working through the process as sensitively and supportively as we can, providing those directly impacted with as much information and support as possible and at all times in full compliance with local law.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}