{
    "articleURL": "/news/article-12057345/Astonishing-moment-blind-autistic-pianist-Lucy-13-stuns-Coronation-Concert.html",
    "content": [
        "Lucy Illingworth performed Bach's Prelude in C Major at Windsor Castle tonightTens of thousands of spectators at King Charles' Coronation Concert were left speechless this evening as 13-year-old blind and autistic pianist Lucy Illingworth gave a jaw-dropping performance. ",
        "The pianist, who is part of Queen Camilla's patronage the Amber Trust, was one of the talents chosen to perform at concert taking place in the grounds of Windsor Castle.  Playing a rendition of Bach's Prelude in C Major, the teenager prompted smiles and applause from the Princess of Wales and Princess Charlotte, leaving the newly crowned King and Queen speechless. The stunning performance from the blind musician came just months after Lucy melted hearts with her winning performance for the Channel 4 series The Piano. ",
        "Those on social media watching the concert from home were quick to applaud the youngster, who is from West Yorkshire, with some even being brought to tears.Lucy, who was born with cancerous tumours in her eyes and is largely non-verbal, left the 20,000 people sitting in the crowd at Windsor Castle stunned, with those watching from home being equally blown away by the moving performance.One person on social media wrote: 'The Coronation Concert is incredibly emotional - amazing performances by Lucy and the Romeo and Juliet ensemble.'Another added: 'Wow Lucy - you had me in tears. What a wonderful talent and a beautiful young lady. Bravo!' A third said: 'Lucy Illingworth, you are astonishing.'The pianist was one of a number of star-studded performances taking place at the King's celebration this evening, which Buckingham Palace promised would be filled with 'global music icons and contemporary stars'. ",
        "Nicole Scherzinger sang a popular Disney hit, Olly Murs took to the stage to show off his moves and Steve Winwood sang to thousands of cheering spectators. The King and Queen, whose Coronation ceremony took place at Westminster Abbey yesterday, were joined by their family members to watch the spectacular show that is being hosted by Downton Abbey star Hugh Bonneville.Lucy shot to fame earlier this year after taking part in the Channel 4 series The Piano, which seeks to find the best amateur pianists in the country invites performers to play in front of a set of judges. ",
        "Her flawless rendition of Debussy's Arabesque in the series finale shot her to fame, capturing the hearts of the whole nation. Classical pianist Lang Lang, one of the judges, called her a 'genius', while pop star Mika said hers was the 'performance of the evening'. Music has always been more than a simple hobby for Lucy - it has been a way which she communicates because she is globally developmentally delayed and struggles to hold a conversation.The teenager has a chromosome 16 duplication which causes autism traits, developmental delay and intellectual disability.Speaking after winning the show her mother Candice, who attended tonight's performance alongside her, said: 'I always knew she would be on a big stage one night.",
        "'I said to the producers, \"You have seen in my daughter what I have seen for years\".'"
    ]
}