{
    "articleURL": "/news/royals/article-12055027/Among-52-Coronation-arrests-two-women-man-plot-throw-rape-alarms-horses.html",
    "content": [
        "Militant activists were arrested in the Soho area just hours before processionConcerns raised stunt could lead to injuries or death after MoS investigationRead more: Animal rights activists plotting summer of protests at UK horse racesTwo women and a man were arrested over a plot to throw rape alarms at horses during King Charles's Coronation.",
        "The militant activists were arrested in the Soho area at 2am this morning - just hours before the procession.It comes just weeks after senior security sources told the Mail on Sunday protesters were plotting to sabotage the Coronation in this way.Concerns were raised at the highest level of Government in April that the stunt could lead to serious injuries or even deaths if spooked horses bolt into the crowds lining the route. A 37-year-old woman, a 59-year-old woman and a 47-year-old man were taken to a south London police station where they were questioned. ",
        "Deputy Assistant Commissioner Ade Adelekan said: 'The intelligence we received led us to be extremely worried about the potential risk to public safety. 'We are aware of and understand there is public concern over these arrests. However, the matter is still under investigation.' The 47-year-old man was also further arrested on suspicion of handling stolen goods. All three have since been released on bail pending further enquiries.It was reported that the three arrested were members of the Westminster City Council's night time volunteers.Councillor Aicha Less, Cabinet Member for Communities and Public Protection, said yesterday: 'We are deeply concerned by reports of our Night Stars volunteers being arrested overnight. 'This service has been a familiar and welcome sight in the West End for a long time and have extensive training so they can assist the most vulnerable on the streets late at night.",
        "'We are working with the Metropolitan Police to establish exactly what happened, and in the meantime, we are in touch with our volunteers to ensure they are receiving the support they need.'",
        "Showing the power of the horses, terrifying footage showed the moment a spooked charge reversed into crowds lining the route of the King's procession.The horse's rider, a member of the Life Guards, desperately tried to rein his steed in as it spun across the road.The Mail on Sunday investigation found organisers feared that Just Stop Oil eco-activists would join forces with other groups to orchestrate a mass disruption of the May 6 event.Anti-monarchist group Republic urged its 41,000 followers on Facebook to protest at the Coronation, while Just Stop Oil has hinted on social media it could be the 'final boss level' for its campaign of chaos. The group was behind a protest in which orange powder was thrown on a table at the World Snooker Championship in Sheffield on April 16.The rape alarm plan caused particular concern among officials because of the unpredictability of the horses' reaction.Security sources did not specify which group or groups were behind the plan, but said police and other security officials 'planned to take a robust response with protesters who attempt to disrupt proceedings'.",
        "One said: 'It's not practical to frisk members of the crowd for rape alarms, but we will move swiftly if they try it.'",
        "Former Grenadier Guardsman Julian Perreira likened the tactic to terrorism and warned it could result in the deaths of soldiers and spectators. Writing in the Mail on Sunday, he said: 'If a cavalryman – with the full weight of his gleaming ceremonial breast-plate and helmet – was thrown from his terrified horse, he could easily be killed. 'And just imagine the horrifying consequences of several 1,500lb horses bolting into a packed crowd of spectators. 'Dozens of members of the public, including children, could end up dead or seriously injured.'News of the planned attack came as:Thousands of Extinction Rebellion eco-zealots gathered for a second day of protests in London, staging an enormous silent 'die-in', by lying on The Mall;TV wildlife presenter Chris Packham spoke at the event, heaping praise on extreme activist groups Animal Rising and Just Stop Oil, while criticising the RSPB and the Wildlife Trust – despite being vice-president of both organisations – for their 'lack of activism';Animal Rising protesters stormed the track at Ayr Racecourse in a bid to stop the Scottish Grand National, leading to 25 arrests, a week after they failed to stop the Grand National at Aintree thanks to a Mail on Sunday exposé;Protesters prepared to share the capital's streets with tens of thousands of runners taking part in the London Marathon today.",
        "Commons Speaker Sir Lindsay Hoyle also condemned the rape alarm plot, saying: 'Mindless behaviour of this sort would be utterly and totally unacceptable on any day.",
        "Fact-box text",
        "'But it would be reckless beyond belief to seek to sabotage the Coronation by scaring the horses, not just for the animals' own welfare but for the safety of the thousands of spectators lining the route. I hope the authorities will do all they can to prevent such insanity.'And former Cabinet Minister Jacob Rees-Mogg said: 'This is not legitimate protest – this is hooliganism with a veneer of protest.'",
        "Charlie Lane, a horse expert and former commanding officer of The King's Troop Royal Horse Artillery, said that if rape alarms went off 'some horses will react more violently than others'.He added: 'I would be distinctly uncomfortable about it. There is a risk that individual riders are going to fall off, there is a risk horses are going to be injured.'Dr Debbie Marsden, an equine behaviour expert, said: 'If a horse spooks, they all have their own way of reacting to it. They are likely to throw their heads up and/or leap to the side away from the object. If one horse reacts, it can cause a bit of a chain reaction. It could lead to an accident.'Separately from the briefing from security sources, the MoS has independently discovered that the hard-Right English Constitution Party has used Twitter to urge supporters to protest at the Coronation, and 'bring rape alarms'.The danger posed by bolting horses was dramatically demonstrated in June 2020 when a terrified police horse careered down Whitehall during a violent Black Lives Matter protest in London. PC Nicky Vernon was slammed into a traffic light, suffering a collapsed lung, broken collarbone and shattered ribs, after her horse bolted when thugs threw missiles at police.",
        "In 1981, a teenager at Trooping the Colour fired six blanks from a gun as the late Queen rode past. Her horse initially shied and cantered forward, but the Queen, an experienced rider, quickly regained control.",
        "Scotland Yard chief Sir Mark Rowley has vowed to clamp down on protesters who try to disrupt the event. 'We will do everything we can to make the Coronation the special moment it ought to be,' he told the London Assembly's Police and Crime Committee in January.But Phoebe Plummer, spokeswoman for Just Stop Oil, has vowed that they 'won't stop until we win'. During a Zoom call with fellow eco-activists last Wednesday she said: 'We know the rapid social change must come from civil resistance... history has proved [it] effective time and time again.'Republic's activists wore yellow T-shirts and wave yellow placards along the procession route. When the newly crowned King passed in his gold state coach, they plan to boo loudly and chant: 'Not my King.'The Metropolitan Police made a total of 52 arrests to around the Coronation for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance.The Labour Party is also facing questions over its links to anti-monarchist campaigners.Activists from Labour For A Republic are urging their party to pledge to replace the King with an elected head of state.Tory MP Huw Merriman said last night: 'At a time when the country is coming together to celebrate, Labour continues to associate itself with campaigns to abolish the monarchy and cause massive constitutional uncertainty.'",
        "Potentially lethal stupidity that is nothing short of terrorismBy Julian Perreira Former Grenadier GuardsmanHurling rape alarms at the feet of horses during the King's Coronation procession would not only be shocking and monumentally stupid – it could prove deadly.If a cavalryman, with the full weight of his gleaming ceremonial breast-plate and helmet, was thrown from his terrified horse, he could easily be killed.And imagine the horrifying consequences of several 1,500lb horses bolting into a packed crowd of spectators.Dozens of members of the public, including children, could end up dead or seriously injured.As a former member of the Grenadier Guards for 14 years, I marched alongside these magnificent horses at five Trooping the Colour ceremonies and regularly lined procession routes during parades of the Household Cavalry.",
        "The horses – impressive beasts at least 16 hands high – would come within inches of my face.The Army meticulously trains its horses to be prepared for the excitement of a major public ceremony: the loud music, gun salutes, unfurling of flags and cheering crowds.The horses are also trained in how to respond to the unexpected: a spectator who suddenly opens an umbrella or perhaps throws a bunch of flowers into their path. A protest like this, however, would be completely different.",
        "The way that the animals would react to the sudden piercing noise of dozens of rape alarms being thrown at them is unknown – and potentially disastrous.I remember the shocking scene in June 2020 when a spooked police horse bolted during a violent Black Lives Matter protest on Whitehall in London.It first slammed into a traffic light, sending its female rider flying to the ground, before running into the crowd and then directly into a demonstrator. It was a miracle no one was killed.There is legitimate protest but throwing rape alarms at horses is potentially a lethal action that would target innocent people.You have families with young children who could potentially lose their lives as a result of a mindless and dangerous protest. As far as I am concerned, that is terrorism.Those activists contemplating such an extreme act should also bear in mind that the guardsmen who line the route are not simply there for ceremonial purposes. They would instantly respond to any attack on the procession.Indeed it was a Scots Guard called Alec Galloway who swiftly overpowered a 17-year-old who fired six blank cartridges at the late Queen during Trooping the Colour in 1981.For their own sake, I hope that it is the Metropolitan Police who get to any protesters who attempt this first, because I am sure they would not like the experience of being rugby-tackled by a 6ft 7in Guardsman – or being hit by the butt of his rifle.I know that the guardsmen, police and others charged with keeping the public safe will be fully prepared to deal with these idiots.Row over bid to limit Coronation medalsBy Claire Ellicott, Kate Mansey and Charlotte Griffiths King Charles is said to be furious that some members of the Armed Forces and the police may miss out on special commemorative Coronation medals.Details of the medal were expected to have been announced by now, but a row over Government funding is said to be holding up plans.There are fears that the cost of decorating hundreds of thousands of uniformed personnel could run to £35million – and that there is not enough metal to do it.However, sources close to the King said that he wanted all serving frontline members of the police, fire, emergency services, prison services and the Armed Forces to be given a medal – just as they were during the Queen's Platinum Jubilee last year. They said: 'The King is furious about it. He believes that all service personnel who take part in the Coronation should receive a medal for doing so, along the lines of previous celebrations.'",
        "While about 120,000 medals were issued at the Queen's Coronation in 1953, only 10,000 are expected this time – though sources dispute this figure.These are expected to go to key people involved in the big day, as well as members of the Royal household.Last night, sources said that attempts by Defence Secretary Ben Wallace to give every serving member medals were being resisted by Suella Braverman's Home Office.They said: 'Ben is insisting that every member of the Armed Forces should get a medal – about 220,000. But other departments, led by Suella in the Home Office, are trying to block it.'It is sheer spite, because they don't want to be made to look bad by the MoD.'However, Home Office sources said that while they supported the plans, they had raised concerns about how they would be funded amid fears that the money would have to come out of existing budgets.One said: 'We support giving Coronation medals to Armed Forces personnel and other uniformed officers. Along with other departments, we've asked for a cross-Government approach to provide the funding for these medals.'The medal is not expected to be ready in time for May 6, but will be handed out at a later date. Its design is yet to be unveiled, but the Department for Digital, Culture, Media and Sport (DCMS) has said it is still considering options.A Coronation medal was made for Queen Elizabeth II when she was crowned. It featured a portrait of the Queen on one side and her Royal cypher on the other, and was given to members of the Royal Family, government officials and members of the Armed Forces.Coronation medals have been issued for each British monarch since the Coronation of King George IV in 1821. They have also been issued by other Commonwealth realms, such as Canada, Australia and New Zealand.Medals have also been issued to commemorate the late Queen's Silver, Golden and Diamond Jubilees.A DCMS spokesman said: 'As with other major state occasions, we are considering options for a Coronation medal. More details will be announced in due course.'A source disputed the £35million figure and said the issue with metal had not been raised by officials."
    ]
}