{
    "articleURL": "/wires/reuters/article-12045043/Chinas-skidding-factory-sector-taps-brakes-economic-recovery.html",
    "content": [
        "Factory activity unexpectedly cooled in April on weak demand",
        "Economy likely lose momentum in Q2(Adds tourism revenue data and economists' comments)By Ellen Zhang and Ryan WooBEIJING, May 4 (Reuters) - China's factory activity unexpectedly contracted in April as orders fell and poor domestic demand dragged on the sprawling manufacturing sector, a private survey showed on Thursday, imperilling the broader economic outlook for the second quarter.The Caixin/S&amp;amp;P Global manufacturing purchasing managers' index (PMI) fell to 49.5 in April from 50.0 in March. The 50-point index mark separates growth from contraction on a monthly basis.The reading missed expectations of 50.3 in a Reuters poll and marked the first contraction since January when the exit from zero-COVID policies led to a wave of infections across China and briefly hit production lines.It echoes a similarly disappointing official PMI released on Sunday and reflects the unevenness of China's economic recovery, with the services sector so far outperforming manufacturing and helping the world's second-largest economy grow a robust 4.5% year-on-year in the first quarter.Data this week showed tourism spending during the five-day May Day holiday that ended on Wednesday rebounded to pre-COVID-19 levels. However, given a subdued property market and weak demand from overseas, analysts say the economy faces persistent headwinds as the government aims to achieve full-year growth of around 5%.",
        "\"The latest survey readings are consistent with still rapid growth at the start of the second quarter, but momentum is slowing relative to what was achieved in the first quarter,\" said Julian Evans-Pritchard, head of China Economics at Capital Economics.Production growth slowed for the second straight month in April as weaker-than-anticipated new orders dampened output, the private Caixin survey showed.New orders shrank for the first time in three months, although new export orders swung back to growth from a contraction in March.Muted client demand led manufacturers to cut their staffing levels at the quickest pace since January. This was mostly through attrition, though some firms also trimmed headcount to cut costs.Both input costs and selling prices at factories slumped at the quickest rate in about seven years, with the steep drops in selling prices spurred by attempts by firms to attract new business.Despite the downbeat data, manufacturers' optimism picked up with firms citing new product releases and supportive government policies. Investment in new equipment was also expected to drive growth, some said.The soft demand has caught the attention of policymakers with the politburo, a top decision-making body of the ruling Communist Party, stressing last week that boosting demand is key for a sustained recovery.The latest PMIs may lower expectations for the economy in the second quarter, said Zhou Hao, economist at Guotai Junan International.",
        "\"But to what extent the economic recovery momentum will weaken, the market is not sure,\" Zhou said.\"The manufacturing sector will be under pressure in the second quarter, and won't get any relief at least until June.\"(Reporting by Ellen Zhang and Ryan Woo; Editing by Sam Holmes &amp;amp; Shri Navaratnam)"
    ]
}