{
    "articleURL": "/money/meandmymoney/article-12054059/Chef-TV-presenter-Ken-Hom-talks-MONEY.html",
    "content": [
        "Chef and TV presenter Ken Hom was so hungry as an only child, growing up in Chicago, he still finds himself dreaming about food in his 70s. ",
        "The Chinese-American star of Saturday Kitchen tells Donna Ferguson he grew up 'very, very poor' and was arrested for shoplifting at the age of ten.Ken, 74, shot to fame in the UK in the 1980s when the BBC commissioned him to present Ken Hom's Chinese Cookery. After successful treatment for prostate cancer more than ten years ago, Ken became ambassador to Prostate Cancer UK and has pledged the charity a six-figure sum when he dies.More than a million people have used Prostate Cancer UK’s online risk checker. Check your risk today and find out more about the most common cancer in men at prostatecanceruk.org/risk-checker What did your parents teach you about money?They taught me to be very careful with it and never throw anything away because if you are not careful, you could end up with nothing. My father passed away when I was eight months old, so I was brought up by my mum in Chinatown, Chicago. She came from China, never spoke English and worked in a factory that made Chinese food for the American army. We were very, very poor, and she earned the equivalent today of about £60 a month.",
        "I often went hungry as a child. I was so skinny when I started school that I was given a test to see if I had tapeworms. I still dream about food. A psychotherapist recently told me that the fact I still dream about food is due to my childhood poverty and that fear of not having enough to eat is still in the recess of my mind.",
        "Are you frugal l like your mum?My mum was so frugal that when I started making money and bought her a first-class ticket to fly somewhere, she would cash it in to go economy. When I asked her why, she'd say she was putting the money aside, for me. I'd say, 'But that's my money – and I'm giving it to you!'You could call me mean – I care for the environment. For instance, when people send me envelopes, I save them and reuse them.What was your first job?Working in my uncle's restaurant business from the age of 11.At the age of ten, I had been caught shoplifting by the security guards at a department store. I had been taking things I liked – and didn't have. I remember wrapping them up and putting them under the Christmas tree for myself.Then I got caught. I was arrested, and my uncle, who was a very successful businessman, came to interpret because my mother didn't speak English. He said he would take me in at the restaurant, and I was released.It was a good lesson – I never stole again. My uncle became my surrogate father, and I worked in his restaurant kitchen, doing prep work at weekends and during school holidays for two dollars an hour, and I watched how he ran his business. He made a lot of money.",
        "Have you ever struggled to make ends meet?Yes – when I was about 25 and living in Berkeley, California. I didn't have a job, so I was struggling until I started teaching Chinese cookery classes to pay the bills. Until then, I had only cooked for friends. Back then, Americans didn't really know how to cook Chinese food unless they were Chinese, so the classes were a success.One thing led to another, and soon I was able to make the best investment of my life because the house I was renting went up for sale. It was cheap – $25,000 – but I had to borrow from friends and family for the down payment.I borrowed extra to redo the kitchen and then started giving classes for 20 students at a time from my home. Those classes led to my first book – I was commissioned by a major New York publisher to create a photographic book showing techniques of how to cook Chinese food in pictures.Have you ever been paid silly money?I was once paid a five-figure sum to run a pop-up restaurant for a hotel in Dubai – for a week! Corporate work can be very lucrative. Since I became known in the 1980s for cooking what was then called 'East meets West' cuisine, I have been hired by five-star hotels all over the world to cook fusion food.",
        "What was the best year of your financial life?It has to be 1981 when I was hired to be one of the stars of a reward scheme for a soft drink firm. I was paid $35,000 to teach eight cookery classes to its top distributors in Hong Kong.Although I earned more during the 1990s, I needed the money I earned more in 1981.I used it to pay off my mortgage. That's why I see it as my best year. Plus, I was doing what I loved doing, so it felt like I had won the lottery. What is the most expensive thing you have bought for fun?A vintage Rolex watch, which I bought in the 1980s for £8,000 when I used to collect watches. But in the 1990s, I started going to places like Brazil, where you can't wear a watch like that, or you'll get mugged. So I decided to sell it, and got £18,000 for it. Some of my best investments have been in watches and wine. I once spent $2,000 on a Methuselah of champagne [eight bottles in one]. I was going to open it at home for the year 2000 but ended up at another party, so I never did.",
        "Later, I read that the same bottle had sold for £10,000. I said, 'What the hell, I'm not going to open that – I'll hang on to it as an investment.' And in 2008, I sold it for £26,000.",
        "What is your biggest money mistake?Investing in the stock market when I was in my 20s. I didn't lose my money because I bailed out before that happened. But you have to devote a lot of time to studying it, and I didn't have time to do that.The best money decision you have made?Buying my first home and selling it in 1997 for $337,000. Investing in property was my best money decision as it brought stability to my finances.Do you save into a pension?I saved into a pension from the age of 14, but I cashed it in when I was in my 50s. It was invested in the stock market, and I decided I didn't want that. I have put the money in stable investments like bonds instead. That has been a fantastic decision.Do you own any property?I own a small flat in Paris, a house in South West France and a condominium in Bangkok, where I live part of the time. Each property has only one bedroom, so I can't have guests.They have all been fantastic investments. Collectively they are probably worth around £2million. The flat in Paris, for example, I purchased for £100,000 in 1991, and it's now worth more than £600,000.",
        "If you were Chancellor, what is the first thing you would do?I would make sure everyone has enough to eat. I think it's unconscionable that in a society like ours, people still go hungry. I would increase funding for food banks and education programmes that teach people how to cook seasonal food to save money. I would also work on stopping food waste.Do you donate money to charity?I donate a lot to Action Against Hunger and Prostate Cancer UK. I'm planning to leave large legacies to charity because I want my money to go to people who need it. Of course, some money will go to my family, because I don't want them to struggle, but the bulk of it will go to charity.What is your number one financial priority?To leave these great legacies to charity. So many people have helped me in my life, and this is the best way I can think of to give back. My philosophy is: you come into the world with nothing, and you're going to leave it with nothing.More than a million people have used Prostate Cancer UK’s online risk checker. Check your risk today and find out more about the most common cancer in men at prostatecanceruk.org/risk-checker ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}