{
    "articleURL": "/wires/pa/article-12043121/Elon-Musk-threatens-reassign-National-Public-Radio-s-Twitter-account.html",
    "content": [
        "Elon Musk threatened to reassign National Public Radio’s Twitter account to “another company”, according to the non-profit news organisation, in a continuing dispute between Mr Musk and media groups since his 44 billion dollar acquisition of the social network last year.",
        "“So is NPR going to start posting on Twitter again, or should we reassign @NPR to another company?” he wrote in one email late on Tuesday to NPR tech reporter Bobby Allyn.NPR stopped tweeting from its main account after Twitter abruptly labelled the group’s main account as “state-affiliated media” last month, a term that has also been used to identify outlets controlled or heavily influenced by authoritarian governments.Twitter then changed the label to “government-funded media”.NPR said both labels were inaccurate and undermined its credibility — noting that it operates independently of the US government. Federal funding from the Corporation for Public Broadcasting accounts for less than 1% of NPR’s annual operating budget, the company said.The last tweets on NPR’s main account are from April 12 when it shared a thread of other places readers and listeners could find its journalism.",
        "Twitter temporarily labelled other news organisations — including the BBC and PBS — as “government-funded media”. PBS also stopped using its Twitter account in response.An article written by Allyn late on Tuesday detailed the messages the billionaire owner of Twitter sent regarding NPR’s account. Mr Musk pointed to NPR’s choice to stop tweeting as the reasoning behind possibly reassigning the account.“Our policy is to recycle handles that are definitively dormant,” he wrote in one email. “Same policy applies to all accounts. No special treatment for NPR.”",
        "According to Twitter’s online policy, the platform determines an account’s inactivity based on logging on — not tweeting. Twitter says users should log in at least every 30 days to keep their accounts active, and “accounts may be permanently removed due to prolonged inactivity”.Mr Musk’s comments and his actions do not always match and it is uncertain if he will reassign NPR’s handle, regardless of Twitter’s published policy on account activity.Asked by NPR who would be willing to use its Twitter account, Mr Musk replied, “National Pumpkin Radio”, along with a fire emoji and a laughing emoji, NPR reported. Hard to imagine a more potent example of Musk’s willingness to use Twitter to arbitrarily intimidate and retaliate against any person or organisation that irks him  Liz Woolery  It is unknown if NPR has logged into its account, which currently has a blue tick without the previous “government-funded media” label, since April.Mr Musk disbanded Twitter’s media and public relations department after the takeover.It is the latest volley in what many experts describe as a chilling and uncertain landscape for journalism on Twitter since he acquired the company in October.In addition to removing news organisations’ verifications and temporarily adding labels like “government-funded media” on some accounts, he abruptly suspended the accounts of individual journalists who wrote about Twitter late last year.",
        "Liz Woolery, digital policy lead at literary organisation PEN America, said it is “hard to imagine a more potent example of Musk’s willingness to use Twitter to arbitrarily intimidate and retaliate against any person or organisation that irks him, with or without provocation”.“It’s a purely authoritarian tactic, seemingly intended to undermine one of the country’s premier and most trusted news organisations — one that is especially important to rural communities across the US,” she added."
    ]
}