{
    "articleURL": "/femail/article-12046725/Paulina-Porizkova-reveals-mystery-new-boyfriend-Grace-writer-Jeff-Greenstein.html",
    "content": [
        "Paulina first announced that she was dating someone new last weekNow, she has revealed her mystery beau's identity by posting a PDA-filled snapShe said they met over Raya and have been together for three months now Paulina Porizkova has finally shared the identity of her mystery boyfriend. The former supermodel, 58, has revealed that she's dating Will &amp; Grace writer Jeff Greenstein - confirming their love by sharing an intimate snap that showed them enjoying a very passionate kiss in front of the Eiffel Tower in Paris on Thursday.",
        "Sports Illustrated Swimsuit alum Paulina first announced that she was dating someone new via Instagram last week - nearly two years after her split from screenwriter and director Aaron Sorkin.At the time, she posted a photo that showed her and someone else's shadow kissing, writing, 'Love is in the air,' but she stayed tight lipped about who her new beau was.Now, days later, she has announced that her latest love interest is the successful TV writer, producer, and director, while gushing over him in a post commemorating their three-month anniversary.",
        "'Three months of laughter, kisses, banter, love, and unalloyed goofiness,' she captioned a sweet shot that featured them sharing a smooch in front of the popular tourist attraction. 'Celebrated in the goofiest of ways in the most romantic city in the world.'The new couple donned matching striped shirts, red scarves, and black berets as they locked lips.",
        "The 58-year-old revealed that they met off the dating app Raya. She posted a snap that showed them both removing the app from their phones, which she captioned, 'This is what commitment looks like these days.'Deleting the dating app on which we met. Thank you @Raya and goodbye.'She also thanked her followers for the support, adding, 'Thank you, thank you all ever so much for the outpouring of love and support for my happiness. I’m overcome with your generosity.' ",
        "On his account, Jeff commemorated their love by posting an adorable image that featured them both laughing, which he captioned, 'I think you can tell.' Paulina opted for a pink sweater and similar-colored scarf, while he wore a jean jacket over a button-down light blue shirt. Both of them smiled from ear to ear as he rested his hand on her lap. Jeff, from Atlanta Georgia, originally, is best known for being the showrunner of the popular sitcom Will &amp; Grace, but he's also behind a slew of other shows including Dream On, Partners, Getting Personal, and State of Georgia.",
        "In addition, he wrote episodes for The Charmings, Mr. Belvedere, Friends, Parenthood, and Desperate Housewives over the years. The mother-of-two, who was previously married to Ric Ocasek for 30 years, first revealed in March that she was 'in the early days' of dating someone new.She shared the news on the HollywoodLife Podcast while discussing the relationship self-help book Us by Terrence Real.",
        "'[After reading it], I thought, \"The next man I meet where I feel like the potential for a relationship is going to go somewhere, I'm going to make them read this book before we get anywhere for real,' she explained. 'And so I can say, I've just handed that book up to somebody.'",
        "She added that her new partner did read the book, and it sparked the 'most amazing conversation.' 'We had the most amazing conversations about ourselves and where we are going and what we want,' she revealed. 'So it was a fantastic conversation piece, actually.' At the time, she also admitted that she was still struggling with 'trust issues,' adding, 'My work is cut out for me.'Paulina's ex Ric died unexpectedly of cardiovascular disease at age 75 in September 2019. They were separated and going through a divorce when she found him dead inside their shared Manhattan townhouse. ",
        "The day after The Cars frontman died, she learned he had cut her out of his will just weeks before, claiming she had 'abandoned' him. He left her without any money to live off of, including her own earnings. The cover star was forced to sell their home amid the pandemic for $10 million - far less than the $15.25 million they had previously listed it for in 2016.She later reached a settlement with her late husband's estate and received what was owed to her per New York state law, which was one-third of Ric's assets.Paulina's first public relationship after her late husband's death was with Aaron, 61, with whom she attended the Oscars in 2021.",
        "She announced their split on Instagram that July after roughly three months together. She has been open about her struggles with dating and meeting her men in her 50s after three decades of marriage. 'It's a small pool. Dirty, little puddle. Girls, ladies, it sucks. It turns out that, on the dating apps, men our age, my age, that are willing to sleep with women our age have slept with all my girlfriends already,' she explained on Red Table Talk last November.'So there's, like, these five guys we keep passing around. They're like, \"So did you sleep with him yet? Yeah, don't bother. OK, cool, thanks.\"' "
    ]
}