{
    "articleURL": "/sport/formulaone/article-12054885/Miami-GP-Jeff-Bezos-hops-McLaren-pit-wall-Elon-Musk-takes-tour-Red-Bull.html",
    "content": [
        "Musk was spotted chatting with Red Bull Team Principal Christian HornerDuring FP3 Bezos was reportedly on the McLaren wall talking to the driversDailyMail.com provides all the latest international sports newsThe Miami Grand Prix is guaranteed to attract the rich and famous but before the big race is even underway it has already captured the attention of two extremely wealthy famous faces. ",
        "Elon Musk took a break from his Twitter overhaul this weekend to jet down to south Florida for the Miami Grand Prix. Ahead of FP3, the Tesla boss was spotted chatting with Red Bull Team Principal Christian Horner on Saturday.Holding his son in his arms, Musk appeared to have been given a tour of the current Constructor Championship leaders garage. The SpaceX chief was seen trying on a pair of headphones, while Horner watched on. ",
        "Horner revealed that Musk was there at the invite of Larry Ellison, executive chairman of the team's title sponsor Oracle.'We were talking about batteries, regeneration and so on. Great to have them here this weekend,' he told Sky Sports. However, the 51-year-old wasn't the only billionaire in the paddock. Not to be outdone, Amazon owner Jeff Bezos was also spotted at the Miami International Autodrome. But Bezos wasn't hanging around with the favorites but rather one of the underdogs for the weekend, McLaren. The billionaire was picked up by TV cameras working on the team's pit wall with the McLaren engineers. ",
        "It appears McLaren CEO Zak Brown even stepped down to allow Bezos a seat at the wall. But some Formula One fans have pointed out that Bezos could have split loyalties with Amazon's IT services company AWS sponsoring Ferrari. ",
        "However, not everyone was pleased to see the two billionaires barging their way into the sport. 'Team bosses pandering to celebs and Elon Musk, Zak Brown fluffing a pillow for Bezos on the McLaren pit wall, empty grandstands, a crap circuit and another boring race seemingly inevitable due to a subpar surface. Welcome to Miami,' another fan ranted. "
    ]
}