{
    "articleURL": "/femail/article-12050995/Secret-symbolism-hidden-Queen-Camillas-coronation-robe-revealed.html",
    "content": [
        "For all the latest Royal news, pictures and video click here  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk After months of anticipation, King Charles' Coronation is finally upon us.",
        "And there is one particularly sweet detail in today's ceremony to keep your eyes peeled for - the incredible tributes on the trail of Queen Camilla's Coronation robe. After the crowning and anointing, Camilla and the King will emerge in their spectacular Robes of State. Camilla's robe boasts hand embroidery using gold thread and depict meaningful symbols of nature, notably specific insets and flowers which hold special meaning for the couple and the wider Royal Family as a whole.Among the flowers embroidered onto the garment are lily of the valley - which was Queen Elizabeth's favourite bloom, lady’s mantle, myrtle, maidenhair fern,  cornflowers, delphiniums and national emblems - the rose, thistle and shamrock.",
        "Camilla’s new robe, expertly decorated by the Royal School of Needlework (of which Camilla is patron), have also been adorned with bees and beetles to reflect the Royal couple’s affection for the natural world.Fittingly, an earlier insight into Charles' vision of his Coronation - the event invitation - also boasted similar imagery, with depictions of flowers and insects. This natural theme nods to his love of nature, sustainability and climate conservation, as a monarch who has always held preservation of the environment close to his heart.As a champion of sustainable fashion, today, Charles will don the same Robe of State worn by his grandfather King George VI for his Coronation in 1937, which boasts a 15ft train.",
        "And his wife too will recycle an old garment, donning a robe first made for Queen Elizabeth II in 1953 and resized for the ceremony.The velvet on both robes has been restored by the Royal School of Needlework and the lining and gold lace by Ede &amp; Ravenscroft.Here are the touching details you need to know... 1. Lily of the valley",
        "In a touching tribute to the late Queen Elizabeth, Lily of the Valley - her favourite flower - is included on Camilla's robe (as well as being featured on the invitation for the event).The flower, which regularly makes an appearance during royal events, was also part of the Queen's wedding bouquet when she and Charles tied the knot in 2005 in Windsor.And going back to 1953, the bloom was also featured in Queen Elizabeth's coronation bouquet when she was crowned at Westminster Abbey.Throughout the Queen's reign, the flower was often included in displays around Buckingham Palace and other royal residences.And the flower holds special meaning for other members of the royal family too, with Kate, the Princess of Wales carrying it in her wedding bouquet when she married Prince William in 2011. 2. Lady's mantle",
        "Camilla has previously described lady's mantle, which symbolises love and comfort, as her favourite flower.",
        "Discussing the plant in 2020, the then-Duchess said: 'This acid-green fluffy-flowered plant is one of the best ever foliage plants for the garden and the vase.'Thanks to how easy the plant can be to tend, she added: '[It's a] must for every gardener.' It had been speculated that the Queen may carry a bouquet of the small white and yellow flowers for today's coronation. 3. Thistle (and roses, and a shamrock)",
        "As well as boasting flowers and plants that hold a deep personal significance to the couple, the robe also features national emblems.Adopted in the fifteenth as a symbol of England and becoming a symbol of the Tudor monarchy formed during that epoch, the rose is one of the flowers on Camilla's robe.On top of this, the rose also bears some other symbolism, expressing promise, hope, and new beginnings.Meanwhile, the thistle has been a recognisable symbol of Scotland for more than 500 years, and also makes an appearance.And Ireland is represented on the lavish purple garment via its national plant - the shamrock.  4. MyrtleMyrtle was another bloom that made its way into the wedding bouquet of Queen Elizabeth when she tied the knot with Prince Philip in 1947. In fact, a royal bride's bouquet always contains a sprig of myrtle, in a tradition that dates back to Queen Victoria's time when the monarch's daughter, Princess Victoria, carried it among her bridal flowers in 1858.",
        "The Duchess of Cambridge, the Queen, Diana, Princess of Wales, and Queen Camilla all had myrtle in their wedding bouquets. Myrtle, a glossy, evergreen shrub, which represents hope, is said to bring luck and fidelity. 5. Maidenhair fernSymbolising purity, the maidenhair fern was perhaps chosen by the King, who is believed to be a fern enthusiast.",
        "Other floral depictions on the fabric also carry special personal significance, with delphiniums representing King Charles' favourite flowers.According to the Palace, the robe also features cornflowers, which were depicted on the specially-designed coronation invitation too.6. Bees (and a beetle)When it comes to the robe's embroidery, it's not flowers and plants representing the natural world the King loves so much.Also featured are some insects (which, fittingly enough, are particularly attracted to some of the specific flowers sewn into the fabric). ",
        "Speaking about the garment, a Buckingham Palace spokesperson said: 'For the first time, insects including bees and a beetle feature on the Coronation Robe.'The bumble bee is known as a symbol for communication, abundance and fruitfulness, which could also be a nod to the values King Charles holds dear during his reign. The spokesperson continued, explaining that the creatures' presence 'draws on the themes of nature and the environment and reflecting their Majesties’ affection for the natural world'.",
        "Queen Camilla's cypher ",
        "Also featured on the lavish robe is the Queen's official cypher, also expertly embroidered in gold thread.The symbol features a swirling 'CR' monogram under a Crown, with the letters standing for Camilla Regina (which is Latin for Queen).Camilla's cypher is based on the Tudor crown, much like her husband's, however, hers is more elaborate and stylised.The symbol, which was selected by Her Majesty from a series of designs, is also used by her on personal letterheads, cards and gifts. It was designed by Professor Ewan Clayton, a calligrapher on the Faculty and Academic Board of The Royal Drawing School, in collaboration with Timothy Noad, Herald Painter and Scrivener at The College of Arms. "
    ]
}