{
    "articleURL": "/sport/nfl/article-12060245/Aaron-Rodgers-trade-Jets-teams-trip-Malibu-convinced-QB-come-New-York.html",
    "content": [
        "The Jets convinced Rodgers to come to New York with a trip to his Malibu homeSince then, the team has seen ticket and merchandise sales skyrocket DailyMail.com provides all the latest international sports newsThe trade that brought Aaron Rodgers to the New York Jets has already resulted in a 400-percent spike in season-ticket and suite sales for the team, not to mention another $1 million in purchases on the quarterback's apparel at the Fanatics website.",
        "More importantly, the deal may well end with the Jets' first Super Bowl title in 55 years, which is what the team brass were thinking when they boarded private jets to visit Rodgers at his Malibu home in early March.As reported by the New York Post's Brian Costello, the widely celebrated move began with that trip, which was supposed to be a covert operation until paparazzi picked up the scent and encamped outside Rodgers' house. Jets owner and former US Ambassador to Great Britain, Woody Johnson, his brother, Christopher, head coach Robert Saleh, general manager Joe Douglas and newly hired offensive coordinator Nathanial Hackett were ultimately pictured leaving the residence.One week later, Rodgers announced his intention to play for the Jets, and by late April, he would be traded from the Green Bay Packers in exchange for first- and fifth-round pick swaps in 2023, as well as a conditional first- or second-round pick in 2024.The following is the story of how Jets' dream of acquiring a franchise quarterback became a reality:",
        "Following the team's encouraging – and ultimately, disappointing – 7-10 campaign, the Jets were faced with an overwhelming need at quarterback.Former second-overall draft pick Zach Wilson had struggled for the second consecutive season, and even given his tantalizing arm strength, the Jets brass wanted to bring in a veteran.",
        "As Costello reports, Johnson told his staff that he would 'absolutely' spend on an elite quarterback, which he felt was the team's 'missing piece.'Among the other possibilities mentioned in the Post's reporting were former Raiders quarterback Derek Carr, who ultimately landed with the Saints, Giants quarterback Daniel Jones, who would go on to re-sign with the team, and the 49ers' Jimmy Garoppolo, who landed in Las Vegas.But the Jets instead decided to focus their attention on acquiring Rodgers, who remained under contract in Green Bay after signing a four-year, $200 million contract extension with the Packers before the 2022 campaign.Douglas got on the phone with Packers GM Brian Gutekunst to convey the Jets' interest around the same time he hired Hackett – a former Green Bay assistant coach with close ties to Rodgers.",
        "In February, the 39-year-old Rodgers went on his widely reported 'darkness retreat,' remaining secluded in a cabin in Southern Oregon for several days.As he later revealed to YouTube host and former NFL punter Pat McAfee in March, Rodgers entered the retreat leaning towards retirement, before mulling a return with the Packers and a move to the Jets.By then, the Packers had made it clear that they were ready to move on from Rodgers and begin a rebuilding process with younger players. As a result, Green Bay gave New York permission to speak with Rodgers before a trade could be negotiated.",
        "At the time, in early March, the Packers were hoping to get two first-round picks, as the Seattle Seahawks got for Russell Wilson and the Detroit Lions received for Matthew Stafford in similar trades.However, the Jets weren't interested in sending two first-round picks to Green Bay for a player who could retire after only one season.Regardless, Johnson &amp; Co. still wanted to talk to Rodgers, which began with a few phone conversations on March 6. Saleh then suggested to the rest of the Jets brass that they should fly to Rodgers to show the four-time MVP how serious they were about acquiring him.By Tuesday, Saleh, Douglas, team president Hymie Elhai and Hackett boarded a flight from New Jersey, while the Johnson brothers fly in separately from Florida (Woody) and Colorado (Christopher).",
        "Instead of a firm pitch, the Jets arrived in Malibu with the intention of listening to Rodgers and his thoughts about the team.'We had a nice conversation,' Rodgers later told reporters. 'I told them, 'Listen, I'm not ready to make a decision about anything. I want to get back into my workouts and see how it feels to really hit it hard for a week and to see if that drive and passion is still there.'",
        "Rodgers had still not committed to the Jets by March 10, when he spoke to Douglas by phone, but finally made up his mind on the night of March 12.'Aaron's playing and he wants to be a New York Jet,' Rodgers' agent David Dunn told Douglas.Naturally, Douglas was thrilled, telling the Post that he muffled his screams of joy to avoid waking up family members. He even began firing off text messages to Jets personnel until 4am, hoping someone would be awake to share in his excitement.Later, Saleh would pour some cold water on the moment by reminding Douglas that the Packers had yet to agree to a trade, but the Jets gained some leverage days later, when Rodgers told McAfee's audience that he wanted to play for New York.'My intention is to play for the New York Jets,' Rodgers told McAfee, confirming reports that he had requested a move to the Jets rather than return to the Packers or retire after 18 NFL seasons.Unfortunately for Rodgers and the Jets, the Packers were in no rush to complete any deal.The two sides talked during the league meetings in Arizona later that month, by which time the Packers had softened their asking price.",
        "With the draft serving as a 'soft' deadline, according to Costello, the two teams finally reached an agreement on April 26. Douglas would run the specifics by Johnson, who signed off on the offer, before the two teams put the requisite paperwork together.",
        "'We have our quarterback,' Douglas told Jets staff to a round of applause.In the coming days, Rodgers would be introduced to Jets fans in a wildly popular press conference, watched by nearly 1 million fans on the team website.'I'm an old guy, so I want to be part of a team that can win it all,' Rodgers said. 'I believe this is a place we can get that done.'"
    ]
}