{
    "articleURL": "/wires/reuters/article-12048367/Devils-seek-better-start-vs-Hurricanes-Game-2.html",
    "content": [
        "The New Jersey Devils will look for a better start when they play the host Carolina Hurricanes in Game 2 of their Eastern Conference second-round series on Friday night in Raleigh, N.C.",
        "Less than 48 hours after clinching their series against the New York Rangers in seven games, the visiting Devils were outshot 11-1 and outscored 2-0 in the first period of Game 1 against the better-rested Hurricanes, ultimately losing 5-1.\"We didn't get to our game,\" Devils captain Jesper Bratt said. \"We were a little sloppy on the puck. We were a little slow getting to pucks and supporting each other. When you're not supporting each other against a team like this ... you're not going to create that much.\"Devils coach Lindy Ruff pulled goalie Akira Schmid after the Hurricanes stretched their lead to 3-0 at 5:02 of the second period but insisted after the game that it wasn't Schmid's fault.\"I could've taken multiple players out,\" he said.That substitution seemed to right the ship, as the Devils played Carolina even the rest of the way until the Hurricanes scored an empty-net goal with 3:16 left.\"We know that New Jersey is going to play better,\" Carolina coach Rod Brind'Amour said. \"After the first period, they showed what they can do and they're a very scary team. For us to win, we're going to have to have everybody contributing.\"An effort similar to Carolina's performance in Game 1 would certainly be welcome.",
        "\"I don't think anyone had a poor game,\" Brind'Amour said. \"Twenty guys contributed, which we have to have.\"Like most teams this time of the season, the Devils and Hurricanes are far from 100 percent healthy.Carolina is without forwards Andrei Svechnikov (knee), Teuvo Teravainen (hand), Max Pacioretty (Achilles) and Ondrej Kase (concussion), with only Teravainen possibly returning this series.Svechnikov had 23 goals and 55 points in 64 games before sustaining his season-ending injury in March.New Jersey played Game 1 without right wing Timo Meier, the highly sought trade deadline acquisition, who took a big hit from Jacob Trouba of the Rangers in Game 7 on Monday.Meier, who scored 40 goals during the regular season, including nine with the Devils after he was traded from the San Jose Sharks on Feb. 26, is day-to-day, Ruff said.Brind'Amour said the Hurricanes will continue keeping close tabs on New Jersey center Jack Hughes, who scored 99 points during the regular season but was held scoreless in the series opener while finishing minus-3.\"We know when he's out there, everyone does,\" Brind'Amour said. \"Even when he's maybe not having the best night, he still snapped a couple in there. Dynamic, dynamic player for them and he's not the only one. They got other guys too, but he's obviously the cream of the crop there.\"",
        "Carolina will continue to look for forwards like Sebastian Aho, Seth Jarvis and Jesper Fast to pick up the offensive slack.Carolina forward Jack Drury also returned to the lineup for Game 1 after getting injured in Game 4 of the first-round series against the Islanders.Jesper Boqvist returned for the Devils on Wednesday, replacing Meier. Boqvist played in five of the seven games against the Rangers.--Field Level Media"
    ]
}