{
    "articleURL": "/columnists/article-12057469/The-late-Queens-friend-LADY-GLENCONNER-compares-Saturdays-Coronation-Majestys-1953.html",
    "content": [
        "On Saturday morning, I was up at dawn in a flurry of preparations, just as I had been for the Queen’s Coronation 70 years ago, getting ready to attend her son’s.",
        "It would be a long day, we’d been told, so I packed a carton of apple juice in my handbag and a packet of fruit pastilles to sustain me. (I didn’t want to risk the awful prospect of almost fainting at Westminster Abbey, as I had nearly done, before a watching world, in 1953.)This time round, there had been emails instructing us on protocol and appropriate attire: day dress, no tiaras; hats optional. I love dressing up, so of course I bought a lovely hat, made by Polly, Countess of Leicester, who is married to one of my cousins and our nearest neighbour at Holkham Hall, my childhood home in Norfolk.My skirt and jacket were by Caroline Charles, whom I’ve known for 60-odd years. I like to know how the fabric moves before I buy, so I never shop online: the skirt swishes nicely and has a small frill at the hem. I wore the jacket with white gloves. (Does one do that these days? I don’t know; but I did.)I wore my drop pearl earrings — they’re cultured pearls I bought myself in Portugal — and a pearl necklace very like one Queen Camilla often wears. My parents gave it to me as a wedding present and the clasp is an 18th-century diamond button my husband Colin (Tennant, Lord Glenconner) gave me.",
        "One rarely gets a chance to wear one’s medals but here was a golden opportunity. So, of course, I pinned them onto my jacket: my LVO (Lieutenant of the Royal Victorian Order), Jubilee Medal and, of course, my Queen’s Coronation Medal.",
        "Very few people were wearing the latter but I’m one of the small and dwindling number who played a significant part in Queen Elizabeth II’s Coronation. I was one of Her Majesty’s six aristocratic Maids of Honour, entrusted with carrying her train.This time, I attended as one of the King’s oldest friends: at 90, I’ve known His Majesty since he was born — longer than almost anyone else alive, I suspect — and I’m very fond of him.As I was driven to Westminster Abbey in steady rain, I was reminded of the wet, grey day of the Queen’s Coronation. The crowds lining the streets were just as fervently royalist but dressed much more colourfully than the post-war well-wishers in their drab colours and rationed fabrics.Leaving home at 6.15am, I was at the Abbey early, by 6.45, and during the quarter of an hour wait I was looked after beautifully.A charming policeman greeted me and I was offered a chair to sit on in the street as I waited for a very nice lady to take me through security. I was worried she’d confiscate my carton of apple juice, as they do at airports, but she allowed me to keep it and I was one of the first into the Abbey.",
        "The seats weren’t allocated so I bagged a very good one right by the pulpit, next to John Kerry, the American politician, now U.S. Special Presidential Envoy for Climate, a cause so very close to our King’s heart. He seemed quite amazed that I’d been there for the Queen’s Coronation.I was so glad, too, to be sitting in the midst of friends. We were the chosen few, I guess: there were just 2,000 in the congregation against 8,000 for the Queen’s Coronation.Before the start of proceedings, I did try to whizz down the nave and chat to a few people but a rather officious man asked me what I was doing. I pretended I wanted to look at the flowers but he told me I couldn’t, so I scurried back to my seat and took in all the outfits instead.Almost all the women wore hats. It’s a shame there were no tiaras. I remember how, when the Queen was crowned, all the peeresses’ white-gloved arms went up and they put on their coronets in one fluid, synchronised movement. It was ravishing; as if a flock of swans was taking flight.This time, only the sheikhs’ wives wore real bling. One guest from the Middle East wore a huge pink ballgown with what looked like a dazzling breastplate of diamonds.",
        "Seventy years ago, there were no lavatories in the Abbey and in the most desperate cases, ladies were relieving themselves in their handbags. This time round, fortunately, there were ample Portaloos and I don’t think anyone was reduced to extreme measures.",
        "Inevitably, as I took in the wonderful and moving spectacle of it all, my mind was often transported back all those years. Prince Louis, at five years old, only attended part of the ceremony, just as King Charles — then just four — had when his mother was crowned.I remember the young Prince Charles talking in a stage whisper to his granny, the Queen Mother, and saying he knew the crown was very heavy.Only the other day, King Charles told me how cross he’d been, as a little boy, about having his hair smarmed down for his mother’s Coronation. A barber had come from Trumpers’ in Jermyn Street with some sticky unguent which he’d plastered on the Prince’s hair.He’s quite grey today and slightly balding, but my fondest recollections are of a sweet little boy who used to adore my mother, my younger sister and me. He once said: ‘I was absolutely in love with you’ — and of course we loved him, too.My mother would let him drive round Holkham and I found a letter from him to her the other day. ‘Thank you so much for letting me drive your van and the Jag,’ he wrote. We used to have a pottery and the van was used to transport the pots. That was how the young prince learned to drive.",
        "I recall, too, Princess Anne minding terribly that she was not going to her mother’s Coronation — but she was there on Saturday, of course, riding behind the King and Queen’s coach on horseback with a vital role as the King’s Gold Stick in Waiting (the original close-protection officer).In the Abbey she sat, wearing a large feathered hat, in front of Prince Harry, rather obscuring his view. I’m very glad that Harry was there and the King will be so pleased he came, too.Harry chatted amiably to his cousin Princess Eugenie, of whom he is very fond, and to her husband Jack Brooksbank — they’ve both been to stay with him in America. I understand Harry flew back very soon after the Coronation.There were many moments during the service when I was almost moved to tears. When I saw the King carrying the orb and sceptre, I just wanted to cry. I thought: ‘Well done. How wonderful!’ He’s been through so much and is so very obviously in love with Camilla.She is such a wonderfully good sport. My father gave the Royal Family a beach house on the coast at Holkham, right next to a nudist beach, and I always chuckle when I remember how Camilla encountered one of the naturists — fortunately he had a towel round his waist — and discovered he was a local headmaster.",
        "I’m sure the King must be wondering if he’ll live up to his mother, and I must assure him he will. Like Camilla, he’s so interested in people; so sympathetic. Every member of the congregation was either a friend or someone who deserved to be there because of their work for the charities he supports — and he does so with such passionate conviction.And how wonderful the music was! The King said to Andrew Lloyd Webber, who was commissioned to write the music to go with Psalm 28: Make A Joyful Noise: ‘I want something hummable.’ And that’s exactly what Lloyd Webber gave us. It was perfect.I loved the fact that there were girls in the choirs (in 1953, there were only boys) and the gospel choir, swaying to the music as they sang, was quite lovely.The historical heart of the service, the anointing of the new monarch with holy oil, was the same solemn ritual it has always been. The King was divested of his robes and wore just a simple shift for this private and sacred moment, which took place, away from the public gaze and TV cameras, behind screens.When the Queen was anointed, I, as one of her privileged Maids of Honour, watched the Lord Great Chamberlain — the 5th Marquess of Cholmondeley — help her into the simple white shift she wore over her elaborate dress for the consecration. The Marquess had never dressed himself, let alone anyone else, so he was particularly ill-suited to his role of helping with costume changes.I joked to the current Lord (David) Cholmondeley about his grandfather’s ineptitude when we chatted at the King’s Coronation.Coincidentally, David Cholmondeley’s son Lord Oliver, 13, was, with Prince George, one of the King’s five Pages of Honour. Queen Elizabeth’s pages were given swords and, of course, had begun to attack each other at the earliest opportunity, as boys can’t resist a sword fight. I did wonder whether that was why the pages on Saturday hadn’t been given swords.Last week, I wrote about my own moment of drama during the Queen’s consecration. Trussed up in my beautiful but constricting boned silk dress and starving after a long day without food, I’d almost fainted during the most holy part of the service.It was only when Black Rod (Lieutenant General Sir Brian Horrocks), standing next to me and seeing me wobbling dangerously, pinioned me to a nearby pillar that I steadied myself and managed to save myself from collapsing.As it happened, that same blessed pillar was directly opposite my seat on Saturday. I looked at it and felt thankful for my fruit pastilles — although I’m confident the current Black Rod, Sarah Clarke, would have come to my aid had I felt faint.I was pleased, too, that Queen Camilla’s companions were able to sit down (if they’d felt woozy they wouldn’t have had as far to fall), while we Maids of Honour stood throughout the entire service.Queen Camilla’s called her attendants ‘companions’ and one was actually her sister Annabel Elliot, whose husband Simon died a month ago. Annabel was so sad that Simon wasn’t there to see their grandson Arthur, ten, in his role as one of the Queen’s Pages of Honour.Camilla chose three of her grandsons, twins Gus and Louis Lopes, 13 (Gus had his arm in a sling because he broke it recently) and Freddie, 13, by her son Tom, to join Arthur as her pages.Of course I was able to chat quietly to John Kerry, telling him who was who and giving him a running commentary on proceedings. He asked me, ‘What’s going on now?’ during the consecration, and I was able to explain, beat by beat. He said I was a good tour guide and he was absolutely charming.He was amused when I told him the Archbishop of Canterbury had given me a sip of brandy to fortify me after Queen Elizabeth had been consecrated. I doubt very much that tots of spirits would have been dispensed in the Abbey by the Archbishop on Saturday.We all waved like mad as our dear new King and Queen left in their very uncomfortable gold coach — but I had to wait until I got home to sit down and enjoy a stiff vodka and tonic. Anne Glenconner is the author of the memoirs Lady In Waiting and Whatever Next?, published by Hodder &amp; Stoughton."
    ]
}