{
    "articleURL": "/tvshowbiz/article-12059681/Jennifer-Lawrence-joined-husband-Cooke-Maroney-baby-son-Cy-New-York-City.html",
    "content": [
        "Jennifer Lawrence and her husband Cooke Mulroney joined a group of friends outside a fire station in New York City's Tribeca neighborhood on Monday morning.",
        "The 32-year-old performer appeared to be making the most of her outing as she carried an iced coffee for part of the excursion, while her spouse held their son Cy, aged one, close to his chest.Lawrence kept it casual in a sleeveless black top that was tucked into a pair of loose-fitting blue jeans.The Hunger Games franchise star also donned a pair of Adidas Samba sneakers and accessorized with a pair of jet-black sunglasses and a beige cap.The actress, who recently appeared in the trailer for the upcoming comedy feature No Hard Feelings, married her husband in 2019, and they welcomed their son into their lives in 2022.",
        "The Academy Award-winning actress tied much of her beautiful blonde hair into two braids that fell onto her chest.Mulroney opted for a white t-shirt, slim-fitting navy blue pants and Vans Old Skool sneakers.After their visit to a fire station, Jennifer was seen walking in a park. Lawrence and her husband initially began dating in 2018 and became engaged the following February before they tied the knot in in October of 2019.The actress was previously linked to her former collaborators Nicholas Hoult and Darren Aronofsky.It was confirmed that the performer was expecting to become a mother in September of 2021, and she gave birth to Cy last February. ",
        "Lawrence previously opened up about becoming a mother during an interview with Vogue, where she acknowledged that the topic was tricky to address.'It's so scary to talk about motherhood. Only because it's so different for everybody,' she said.The Mother! actress subsequently stated that she was instantly taken with her son after he entered her life.",
        "'The morning after I gave birth, I felt like my whole life had started over. Like, \"Now is the first day of my life.\" I just stared. I was just so in love,' she stated.Lawrence then expressed that her life had completely changed after becoming a mother.'My heart has stretched to a capacity that I didn't know about. I include my husband in that,' she said.She added: 'The euphoria of Cy is just—Jesus, it's impossible. I always tell him, \"I love you so much it's impossible.\"' "
    ]
}