{
    "articleURL": "/wires/aap/article-12058165/Budget-cost-shifting-not-slash-cut-burn.html",
    "content": [
        "The finance minister says no one will be left in the lurch despite the Labor government announcing billions in budget savings and shifted spending in the May budget.",
        "Katy Gallagher announced the $17.8 billion in rearranged spending on Monday, with $7.8 billion of that in re-prioritised defence force funding that had already been flagged.Senator Gallagher agreed the total sum wasn't small, but the government wouldn't be aggressively cutting back funding for key programs.\"This is sensible, it's across the board, but it's not just - it's not anything like you would see us just removing programs and leaving people in the lurch,\" she told ABC News.\"It's not slash and cut and burn, in a sense.\"Senator Gallagher said the re-prioritisation program was more about examining the existing flow of money in the budget and funnelling it into \"current pressures\" and \"future needs\".\"Because this can't be an exercise in adding on all the time, we can't just think we want to do something new, therefore we add it into everything we're already doing.\"The government has also been under pressure to prove its nearly $15 billion in cost-of-living relief won't fuel inflation, which could keep prices higher for longer and possibly lead to more interest rate hikes.The finance minister said the funding was \"very carefully calibrated and targeted\", and affordable thanks to \"savings on the other side of the budget\".\"We're trying to do a few things, cost of living relief, investing in the future productive side of the economy but also repairing the budget at the same time to deal with the debt and deficit that we inherited,\" she said.",
        "While high inflation remains a pressure point, the strong labour market, population growth and elevated commodity prices could be enough to thrust the budget back into the black.EY Oceania chief economist Cherelle Murphy said the budget would likely end up close to balance, or maybe even in surplus.This is a massive improvement on the $36.9 billion deficit forecast at the time of the October 2022 Budget.In pre-budget analysis by the consultancy, Ms Murphy said an unexpectedly strong labour market, higher wages, more migration than anticipated, and Treasury's continued practice of underestimating commodity price forecasts would deliver a temporary improvement to the bottom line.However, she said these short-term sweeteners wouldn't fix the structural deficit.Ms Murphy said the government would need to do three things to move the budget into structural balance - not add to spending without offsetting it elsewhere, change policies to lower spending and boost revenue over the long term, and put policies in place to help the private sector boost productivity.She also said the treasurer should bank all the revenue windfall, not \"most\" as he has been promising.\"In reality, he needs to bank all of it and make tough decisions about existing policy to put Australia's federal budget back on track.\""
    ]
}