{
    "articleURL": "/wires/pa/article-12048007/Ed-Sheeran-happy-winning-copyright-lawsuit-Marvin-Gaye-song.html",
    "content": [
        "Ed Sheeran has said he is “obviously very happy” after winning a US copyright lawsuit over his song Thinking Out Loud, but vented his frustration at having missed his grandmother’s funeral for the trial.",
        "The British musician was alleged to have used parts of Marvin Gaye’s Let’s Get It On for his 2014 hit, which claimants said shared “striking similarities” with the 1973 soul classic.",
        "He was taken to court by the family of Ed Townsend, who co-wrote Gaye’s song.After his win, Sheeran described himself as “just a guy with a guitar who loves writing music for people to enjoy” and criticised the lawsuit.Speaking outside court in New York, he said: “I’m obviously very happy with the outcome of this case and it looks like I’m not going to have to retire from my day job after all. These claims and the people who manipulate songwriters for their own gain need to be stopped so that the creative process can carry on and we can all get back to making music  Ed Sheeran  “At the same time, I am absolutely frustrated that baseless claims like this are allowed to go to court at all.”He added: “Having to be in New York for this trial has meant that I have missed being with my family at my grandmother’s funeral in Ireland. I won’t get that time back.“We need songwriters and the wider musical community to come together to celebrate and support creativity.",
        "“These claims and the people who manipulate songwriters for their own gain need to be stopped so that the creative process can carry on and we can all get back to making music.“I am not and never will allow myself to be a piggy bank for someone to shake.”Sheeran thanked the jury for “making the decision that will help protect the creative process of songwriters here in the United States and all around the world”, and “all the songwriters, musicians and fans who have reached out with messages of support” for him.He also thanked his legal team and the co-writer of Thinking Out Loud, Amy Wadge.The trial in New York included several live singing performances by Sheeran.After deliberating for just under three hours, jurors found Sheeran had not infringed on the family’s copyright interest in Gaye’s song.Sheeran stood up and hugged members of his legal team as the verdict was returned.It comes just a day after the singer was forced to miss the funeral of his grandmother due to being stateside for the trial, though he reportedly watched it via livestream.During the trial, jurors heard from numerous industry experts and musicologists, as well as Sheeran himself.At one point in his testimony, the musician picked up his guitar to play a rendition of Thinking Out Loud, to explain his songwriting process.",
        "He reportedly became frustrated at times, describing the testimony of one of the plaintiff’s expert witnesses as “criminal” and said he found the entire case “really insulting”.Townsend’s family brought the case against Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing, in 2017.Their original complaint claimed Sheeran had infringed on their interest in Gaye’s song by copying its “harmonic progressions, melodic and rhythmic elements” – which they described as the “heart” of the track.“The defendants copied the ‘heart’ of Let’s (Get It On) and repeated it continuously throughout Thinking (Out Loud),” their claim stated, adding it had been done “without consent, credit or compensation”.“As a result, members of the public have been deceived and/or confused into thinking that Thinking (Out Loud) is the independent creation of the defendants.”The complaint added the conduct, which had resulted in “illegal revenues”, had been “knowing and willful”.The family requested a preliminary and permanent injunction against any future recording, distribution or public performance of Thinking Out Loud.During the trial, Ben Crump, representing the Townsend family, had said the case was about “giving credit where credit is due”.The verdict in the US trial follows a similar but separate copyright case that Sheeran faced in London last year over his 2017 hit Shape Of You."
    ]
}