{
    "articleURL": "/news/article-12055457/On-House-Parliament-goes-blue-red-white-honour-King-Charles-Coronation-Night.html",
    "content": [
        " The historic home of the UK government is illuminated in colours of Union Jack Iconic landmark lit up in honour of coronation of King Charles III on Saturday Celebratory images and messages have been projected onto nearby Big Ben The Houses of Parliament were lit up in dazzling red, white and blue as part of a series of landmarks that have been illuminated in honour of King Charles III's coronation on Saturday. ",
        "Shimmering against the night sky, the historic home of the UK government was lit up in the colours of the Union Jack just hours after the King was officially crowned as the reigning monarch at Westminster Abbey.The ceremony marked the first coronation of a British monarch in well over half a century, after the late Queen, who died last September, enjoyed a 70-year reign.Situated on the north bank of the River Thames, the iconic landmark - which is also known as the Palace of Westminster - attracted the attention of delighted royal fans who have flocked in their thousands to the capital for the Coronation weekend.The Houses of Parliament lie just metres from another famous landmark, Big Ben, which was also lit up in a colourful tribute to the King, intermittently changing from blue to red.",
        "Poignant messages and images have been projected on to the 96m tower, including pictures of the national plants of England, Scotland, Wales and Northern Ireland - the rose, thistle, daffodil and shamrock - as well as the words of the national anthem wrapping around the tower and the phrase, 'Happy and Glorious'. The 180-year-old building has also been illuminated with the phrase: 'Long may he reign.'The projection culminates with the Coronation emblem, designed by Sir Jony Ive, a British product designer and chancellor of the Royal College of Art.",
        "The projections snaked on to the Elizabeth Tower, with the flowers and plants blooming on the side of the historic landmark, reflecting the King's love of nature and the environment.When the invitations for the ceremony were sent out last month, they were adorned with images of flowers, birds, insects and the Green Man - while the royal couple's thrones were re-used rather than made new, as would be customary.",
        "During Saturday's ceremony, an ornate, three-sided screen shielding Charles as he was anointed King depicted a tree with 56 leaves representing the Commonwealth nations.Other London landmarks that have been lit up over the weekend to mark the King's coronation include Tower Bridge, London Bridge, Guildhall and Mansion House. The colourful displays will continue into Sunday night, from 8pm until midnight, to coincide with the BBC’s Lighting Up The Nation event, as part of the Coronation Concert.Among those taking part are towns, cities and regions of Blackpool, Sheffield, Cardiff, Edinburgh, Newcastle and Gateshead, Cornwall and Belfast.A choreographed lighting display will envelope Blackpool’s well-known seafront attractions, while Sheffield Town Hall will showcase a spectacular light-up moment for a community gathering in the Peace Gardens.Newcastle’s Tyne Bridge and Gateshead’s Millennium Bridge will be lit up creating beautiful reflections in the water in front of an audience gathered on Baltic Square at Gateshead Quayside.",
        "A memorable light show will be created in Belfast, while in Edinburgh, a public event will take place in Princes Street Gardens.A spectacular drone show will be brought to Cornwall at the Eden Project to light up the sky, while the Biomes turn multicoloured for viewers at home and an audience of specially invited guests from the local volunteer community.Meanwhile in Cardiff, a display of drones will illuminate the night sky above the Wales Millennium Centre."
    ]
}