{
    "articleURL": "/tvshowbiz/article-12054701/Will-Poulter-supports-single-crutch-outside-Good-Morning-Americas-studio-NYC.html",
    "content": [
        "Will Poulter was spotted outside Good Morning America's studio in New York City on Friday morning.",
        "The 30-year-old performer supported himself with a single crutch during his appearance and stopped to sign a few autographs for a group of fans.The actor used his time on the program to promote the release of Guardians Of The Galaxy Vol. 3, in which he stars as Adam Warlock, and he previously warned his fans about the difficulty of emulating his body transformation.Poulter wore a dark green turtleneck sweater that was tucked into a pair of light brown cargo pants during his time outside of the program's set.The Midsommar actor also donned pairs of light green socks and beige Birkenstock-style sandals.",
        "The performer has not made any public comments about the cause of his injury as of yet.Poulter began his time on the program by stating that, although he was initially intimidated about the prospect of working on a Marvel movie, he quickly endeared himself to the project's cast and crew.'It's a little bit scary, initially, from the outside looking in, because I was a fan first and foremost... they're the nicest group of people and they make it so easy as a newbie coming in. [I] couldn't have been made to feel more welcome,' he recalled.The We're The Millers star also spoke about getting into makeup to portray Adam Warlock and discussed the difficulty of removing it all at the end of each shooting day. ",
        "'There's a very, very talented group of in charge of that. I literally can take no credit. I sit there and do nothing. Getting it off is a surprisingly long process...I would wear trash bags, actually, and we would go to town on the hot towels and wipes,' he said.Poulter briefly spoke about how Adam Warlock was more of an imperfect character than many would expect.'It became pretty clear they weren't going for perfect when they cast me, they were going in a different direction with the role,' he said.The actor went on to discuss his fitness routine for the project and thanked the individuals who helped get him into shape. ",
        "'I had to give, kind of, superhero my best shot. I was really lucky, I worked with a team of guys who were able to help me go through that process in a way that was safe and natural and protected my mental health,' he said.Poulter subsequently discussed how the Guardians franchise's longtime creative team quickly made him feel welcome as he worked on the project.'They had so much advice and wonderful tips to pass on that, I think, are kind of unique to being part of movies like this and working on these sets, which have specific challenges, and I was super grateful for that,' he said.",
        "The actor also singled out one cast member that assisted him with keeping himself in shape as they worked on the movie. 'Chris [Pratt] was particularly helpful when it came to the physical side of things, he's gone through that himself, and so he was able to kind of pass on some really, really helpful workout stuff,' he said.The first Guardians Of The Galaxy movie, which also starred performers such as Zoe Saldana, Dave Bautista and Bradley Cooper, premiered in 2014. The Marvel Cinematic Universe entry was followed up by a 2017 sequel, and its characters subsequently appeared in both Avengers: Infinity War and Avengers: Endgame.Development on the third Guardians Of The Galaxy movie was revealed to the public in April of 2017, and director James Gunn was famously fired and then re-hired to work on the project.",
        "Poulter was later revealed to have been cast as Adam Warlock in October of 2021.Other new additions to the cast of the movie were Maria Bakalova and Chukwudi Iwuji, who voice Cosmo The Spacedog and play the High Evolutionary, respectively.Guardians Of The Galaxy Vol. 3 premiered in Paris this past April, and it was released to the public on May 5.The movie has become both a commercial and critical success, and it currently holds an 81% fresh rating from critics surveyed by Rotten Tomatoes. "
    ]
}