{
    "articleURL": "/wires/ap/article-12049511/Press-group-China-biggest-global-jailer-journalists.html",
    "content": [
        "WASHINGTON (AP) - China was the biggest global jailer of journalists last year with more than 100 behind bars, according to a press freedom group, as President Xi Jinping´s government tightened control over society.",
        "Xi's government also was one of the biggest exporters of propaganda content, according to Reporters without Borders. China ranked second to last on the group´s annual index of press freedom, behind only neighbor North Korea.The ruling Communist Party has tightened already strict controls on media in China, where all newspapers and broadcasters are state-owned. Websites and social media are required to enforce censorship that bans material that might spread opposition to one-party rule.Xi, China´s most powerful figure in decades, called during a 2016 meeting with journalists who had been awarded official prizes for them to adhere to \"the correct orientation of public opinion.\"Xi is pursuing a \"crusade against journalism,\" Reporters Without Borders said in a report Wednesday. It called China's decline in press freedom \"disastrous.\"Beijing operates what is regarded as the world's most extensive system of internet controls. Its filters try to block the Chinese public from seeing websites abroad operated by news outlets, governments and human rights and other activist groups.",
        "Chinese journalists have been prosecuted on charges of spying, leaking national secrets and picking quarrels, a vague accusation used to jail dissidents. Others are subjected to surveillance, intimidation and harassment.Journalist Dong Yuyu, who worked at a ruling party-affiliated newspaper and is a former Harvard University fellow, faces espionage charges after being detained for more than one year, his family said last week.",
        "In 2022, Chinese-born Australian journalist Cheng Lei was tried in China on national security charges but has yet to learn the verdict, Australian Foreign Minister Penny Wong said in March.Cheng worked for CGTN, the English-language state TV channel aimed at foreign audiences. She was detained in August 2019 and accused of sharing state secrets.In Hong Kong, the Communist Party forced a prominent newspaper, Apple Daily, to shut down as part of a crackdown on pro-democracy sentiment.Apple Daily's founder, Jimmy Lai, was convicted of fraud last year that his supporters said were politically motivated. Six other former executives of the newspaper pleaded guilty."
    ]
}