{
    "articleURL": "/health/article-12042855/Early-warning-signs-pancreatic-cancer-Maria-Menounos-reveals-secret-battle.html",
    "content": [
        " Talk show host Jerry Springer died at age 79 from pancreatic cancer The disease has only a 12.5 per cent survival rate after five years Early signs are easily missed, and there is no standard screening method for it",
        "TV star Maria Menounos has revealed she has been secretly battling one of the most deadly forms of cancer.",
        "The 44-year-old - who is expecting her first child this summer - was diagnosed with stage 2 pancreatic cancer in January.Stage 2 cancer can be contained. It usually means the tumor is larger than in stage 1, but has not started to spread to surrounding tissue.Pancreatic cancer has been dubbed a 'silent killer' due to how easy it is to overlook the symptoms. While the death rates of many cancers have dramatically decreased over time, the survival rates for pancreatic cancer are uniquely low. Part of the problem is that most diagnoses happen after the cancer has already metastasized, or spread. Just 13 per cent of cases are confined to their primary site, according to the National Cancer Institute (NCI).Cancers like this are difficult to catch in the initial stages as symptoms such as stomach pain and bowel troubles are easily missed or could be attributed to other health problems.A 2022 survey by the Pancreatic Cancer Action Network found that 83 per cent of adults are unaware of the signs of the disease. Though there is no standard screening method for pancreatic cancer, experts stress that spotting the early symptoms could save lives. These are five of the early warning signs of the disease: JaundiceJaundice, the yellowing of the skin and eyes, is one of the most common early symptoms of pancreatic cancer.",
        "It's caused by the build-up a bilirubin, a yellowish-brown substance made by the liver. The liver releases bile, a fluid meant to aid digestion, which contains bilirubin. In normal liver function, bile moves through ducts into the intestine and helps to break down fats. However, when bile ducts become blocked, bilirubin builds up, turning the skin and eyes yellow. This happens because the pancreas is close to the body's common bile duct, so tumors press on the duct, even when they are still small and undetectable on scans. However, tumors on the lower part of the pancreas do not press on the duct until they have spread throughout the organ, which happens in the later stages of the disease. Pancreatic cancer can also metastasize to the liver.Other signs of jaundice include dark urine, light-colored or greasy stools and itchy skin. ",
        "Stomach PainCancers that initially form in the body or lower parts of the pancreas can quickly grow large, pressing on nearby organs.This cancer also presses on the nerves around those organs.  One of the nearby organs is the stomach.The Pancreatic Action Network estimates that about 70 per cent of patients experience this pain at the time of diagnosis.At first, it may come and go, getting worse as you lie down or eat. As tumors grow, the pain may become more constant and last longer.  ",
        "Back Pain Pain may also radiate from the stomach to the back. This pain is most often localized to the mid-back, or just below the shoulder blades. It may also reach the shoulders.Similar to stomach pain, this is most common when tumors are found in the tail of the pancreas, or the lowest part. ",
        "Shocking result was revealed in a survey by doctors at Henry Ford Health in Detroit, Michigan.",
        "This pain also tends to worsen when lying down or just after eating, like stomach pain.  Sudden Weight LossPeople with pancreatic cancer may have little to no appetite.The suppressed appetite may be caused by a lack of functional pancreatic enzymes, which help break down fats, carbohydrates, and proteins. This can cause unintentional weight loss, which is often an indication in general that something is medically wrong. Malignant cells can also sap the body's nutrients, which means a patient needs more calories. If the patient isn't getting a necessary amount of calories, they're more likely to lose weight. Floating Stools  Unusual changes in bowel movements could be a sign of pancreatic cancer.While this happens after any sudden dietary changes, such as adding foods like broccoli, beans and lentils into your diet, floating stools could be linked to a lack of bile. The liver makes this to filter waste such as toxins and excessive cholesterol. ",
        "Not enough bile in stools could be an indication of bile acid malabsorption. When bile isn't properly absorbed, it causes chemical imbalances.If a tumor blocks the pancreatic duct, insufficient nutrients from the pancreas could lead to poor absorption and diarrhea since undigested food passes through the digestive tract too quickly. This results in the stool having too much fat, causing it to float or appear greasy or pale.  "
    ]
}