{
    "articleURL": "/wires/reuters/article-12046915/Italian-foreign-minister-calls-Paris-trip-French-insults.html",
    "content": [
        "By Crispian Balmer and John Irish",
        "ROME/PARIS, May 4 (Reuters) - Italian Foreign Minister Antonio Tajani called off a trip to Paris on Thursday, saying the French interior minister had offended Italy and its Prime Minister Giorgia Meloni with unacceptable \"insults\".Earlier, the French minister, Gerald Darmanin, told RMC radio that Meloni was \"unable to solve the migration problems on which she was elected\" and accused her of \"lying\" to voters that she could end a crisis over growing numbers of boat migrants.News of his comments came as Tajani was preparing to fly to Paris to see his French counterpart - a trip that was aimed partly at improving relations between the two European Union countries that have grown increasingly brittle.France swiftly issued a statement in which it sought to reassure Rome of its willingness to work closely with Italy, but it was not enough to persuade Tajani to catch his plane.\"If there is no respect for Italy I cannot take part in a bilateral meeting with a government that includes a minister who offended us for no reason,\" Tajani told RAI public television, calling it a \"stab in the back.\"It was the latest in a series of clashes between Paris and Rome since Meloni took office last October at the head of a nationalist, conservative government which has a very different world vision to that of French President Emmanuel Macron.",
        "Darmanin is very close to Macron and lashed out at Rome last November, accusing Meloni's government of being \"selfish\" for refusing to let a charity rescue ship dock in France, forcing it instead to head to France.Italy has seen a surge in migrant arrivals since Meloni won power last year. More than 42,400 people have landed in Italy so far in 2023, against around 11,220 in the same period last year.Meloni's Brothers of Italy party and its coalition partner, the League, pledged a tough crackdown on illegal migrant entries in last year's election campaign and on Thursday parliament approved a law that toughened prison terms for human traffickers and reduced asylum rights for new arrivals.Darmanin compared Meloni to the far-right French leader Marine Le Pen, a political foe of Macron. \"The extreme right has a vice. That of lying to the population,\" he said.\"I have nothing to do with the extreme right,\" Tajani, who belongs to former premier Silvio Berlusconi's conservative Forza Italia party, shot back. \"(Italy) has a centre-right government, not extreme right.\"Meloni's Brothers of Italy has roots in a neo-fascist party founded after World War Two by Mussolini nostalgics. She insists that she and her party have long evolved into mainstream conservatives.In a subsequent statement, the French government spoke of \"mutual respect\" between Paris and Rome and said it wished to work jointly \"to face the common challenge of rapidly increasing migratory flows, particularly from the central Mediterranean\". (Reporting by Angelo Amante and Crispian Balmer in Rome and John Irish and Tassilo Hummel in Paris, editing by Mark Heinrich, Nick Macfie, Christina Fincher and David Gregorio)"
    ]
}