{
    "articleURL": "/tvshowbiz/article-12053955/Ex-Brookside-star-Ann-Marie-Davies-devastated-split-husband-Karl-Robinson.html",
    "content": [
        "Former Brookside actress Ann Marie Davies has told friends of her heartache after splitting from her football manager husband Karl Robinson. ",
        "Ann Marie, 47, who married Karl in June 2010, has been left devastated after her 13-year marriage ended when he moved out of the family home.Just weeks later Karl, 42, - who became the football league’s youngest ever manager aged 29 - was sacked from his latest job at Division One strugglers Oxford United. The couple had been together for nearly 20 years and share a 17-year-old daughter, Jasmine. The actress declined to comment on the split but told MailOnline: ‘I am going through a divorce at the moment. It’s been a very challenging time for myself and my family.’ ",
        "Friends told how Ann Marie - who took a step back from acting to support her husband’s career - had been left reeling by the break up. One said: ‘They’ve been separated for seven months. There’s lots of things that have happened over a long period of time. ‘It’s been a very difficult time for Ann Marie and her family - she has got a 17-year-old daughter. There’s lots of heartache in terms of the family situation. ‘She just wants to keep her head held high and look after herself and her daughter.’ Ann Marie starred in Brookside from 1998 to 2001, taking on the role of Katrina Evans, who ran a children’s nursery in the Channel 4 soap. ",
        "It was around this time that the actress, who was born in Birkenhead, met Karl who was playing for a local football team. She went on to appear in Doctors and Heartbeat before putting her acting career on hold when Karl landed his first big job in football management replacing Paul Ince at Milton Keynes Dons in 2010. The appointment saw Karl, who had previously coached at Liverpool’s youth academy and Blackburn Rovers, become the youngest manager in the football league. After six years at the club he went on to take charge at Charlton Athletic before moving to Oxford United in 2018. ",
        "He was sacked at the end of February after a run of eight games without a win and the club is battling to avoid relegation from League One. Ann Marie, who now runs her own business providing mental wellbeing programmes, is said to have had little contact with her husband since the split. The friend said: ‘Ann Marie is dealing with a tricky time in her life right now. ‘She has been leading her own life trying to keep her head into her work, into her family and just trying to get rid of all the noise. ‘She doesn’t know where he is because he’s here, there and everywhere. ‘She is not willing to say anything publicly - she would rather keep her dignity.' ",
        "In an interview with the Liverpool Echo in 2012, Ann Marie told how she had uprooted from Merseyside to be with her husband after months apart when he took the job in Milton Keynes - nearly 170 miles from home. She said: ‘It was a decision I made to keep the family together. I was practically a single parent and it’s difficult. I was juggling motherhood with my own career but it was difficult for him to travel back and forth. Ann Marie, who married Karl in June 2010, admitted she struggled at first saying: ‘I’m a sociable person with friends who constantly pop round for a cuppa and my family are in Merseyside, so I missed them. ‘But 12 months on I’m really enjoying it. I have settled in, as has our daughter Jasmine; I have met new friends and, of course, I’m proud to be able to support Karl. I like being a football manager’s wife!’ Ann Marie, who has played volleyball for England, has represented the UK In Mrs Universe and won Mrs British Empire.",
        "Last year she finished second runner-up in the Ms Great Britain Classic content for women aged 45 and over. After he was sacked from his latest job, husband Karl told how his family had been bombarded with abuse in his final months at the club.",
        "He said his mother had to leave the ground during one away match and told the BBC 72+ podcast: ‘My daughter got constant criticism on Instagram and had some horrendous things said to her over the last two or three months.‘I’m sick and tired of the old “it's part and parcel of what you do, you get paid to do it. We get paid to take criticism, but our families don't get paid to listen to that and take that either. But is it part of modern day society? It may just be nowadays.’"
    ]
}