{
    "articleURL": "/wires/reuters/article-12044843/Jose-Trevino-Yankees-walk-10th-beat-Guardians.html",
    "content": [
        "Pinch hitter Jose Trevino hit a game-ending single with one out in the 10th inning as the host New York Yankees earned a 4-3 victory over the Cleveland Guardians Wednesday night.",
        "The Yankees had runners at second and third following a sacrifice bunt by Isiah Kiner-Falefa. Cleveland pulled its infield and outfield in for Trevino, who batted for Kyle Higashioka.Trevino then won it when he lined an 0-2 slider from Trevor Stephan (1-1) into center field to easily score automatic runner Oswaldo Cabrera.It was Trevino's fourth career walk-off hit and third since joining the Yankees before last season. Trevino's hit gave the Yankees their first series win since taking two of three at home from the Los Angeles Angels April 18-20.Albert Abreu (1-0) quickly got through the middle of Cleveland's lineup in the top half to set it up.After striking out Amed Rosario, Abreu intentionally walked Jose Ramirez and then induced Josh Naylor into a double play.Willie Calhoun hit a tying single in the ninth off Emmanuel Clase that scored pinch runner Aaron Hicks from third. Hicks entered as New York's second pinch runner after Oswald Peraza appeared to injure his right ankle stealing second during an at-bat to DJ LeMahieuCalhoun's hit occurred after Cleveland took a 3-2 lead on Oscar Gonzalez's pinch-hit single in the ninth against Clay Holmes.Myles Straw started the rally by doubling to left when Kiner-Falefa could not make a sliding catch. Gonzalez batted for Cam Gallagher and lofted a fly ball into short center field as Kiner-Falefa, center fielder Harrison Bader and shortstop Anthony Volpe converged.",
        "Bader, who returned Tuesday from an oblique injury, attempted a diving catch. Instead, Bader's head collided with the right knee of Kiner-Falefa, who was making his first career start in left field.Bader was checked out by a trainer before exiting.Cleveland starter Shane Bieber allowed solo homers to Calhoun and Jake Bauers in the fifth among five hits in eight innings. Bieber struck out four and walked one.Josh Bell and Andres Gimenez hit back-to-back RBI singles in the first after New York second baseman Gleyber Torres could not complete a double play and first baseman Anthony Rizzo committed an error.New York starter Clarke Schmidt allowed two unearned runs on six hits in 4 1/3 innings.--Field Level Media"
    ]
}