{
    "articleURL": "/wires/pa/article-12051641/David-Starkey-denies-claim-PM-not-fully-grounded-culture-racist.html",
    "content": [
        "Historian David Starkey has denied his remarks about Rishi Sunak not being “fully grounded in our culture” were racist, saying he was referring to the Prime Minister being a “typical international liberal” with no interest in British “values”.",
        "The academic was accused of making derogatory references to Mr Sunak’s British Indian descent and Hindu faith when he made the initial comment on Thursday.Dr Starkey returned to GB News to defend himself on Friday, claiming his remarks had been “wilfully misconstrued” and that he had “never ever, ever said anything racist in my life”. He's never shown any sign of an understanding of our history or of a concern with it  Historian David Starkey  But he went on to attack Mr Sunak’s education and career in the United States, which he said made him a member of a “highly technical elite”.He said: “Even when he became – I think it was on the point of becoming Prime Minister – he had an American green card. His wife is non dom.”Dr Starkey said that at Oxford, Mr Sunak read “that terrible degree called PPE (Philosophy, Politics and Economics), which has destroyed our governing class”, going on to California’s Stanford business school.He added: “So we have a Prime Minister who is astonishingly intelligent, but I think sees things as an MBA (Master of Business Administration).“What he campaigns about is money. He thinks in terms of spreadsheets.”",
        "Dr Starkey described the Prime Minister as a member of a “highly technical elite”.",
        "He said: “Mr Sunak has never talked about values…“He’s never shown any sign of an understanding of our history or of a concern with it. All his speeches are technical.”The historian batted away accusations of racism that arose from his original comment.“What I was trying to emphasise was nothing to do with race,” he said, claiming that had been wrongly inferred by the “usual witch hunters who hate GB News and hate me in particular”.Dr Starkey sparked the row when, in his Thursday appearance on the TV channel, he said Mr Sunak – the first non-white occupant of No 10 – was “a man of immense talent, of extraordinary skill, but really not fully grounded in our culture”.Asked to explain his comment, made as he criticised the Prime Minister for being “invisible” in preparations for the coronation, he said: “In terms of religion.”Tory MPs including former party chairman Nadhim Zahawi and Caroline Nokes reportedly slammed the remarks as “ill-informed”, and “vile and racist”.Dr Starkey has been embroiled in controversy in the past, including for saying in an interview that slavery was not genocide because there are “so many damn blacks”."
    ]
}