{
    "articleURL": "/wires/pa/article-12057753/Poetic-prelude-coronation-light-heralds-new-phase-new-chapter.html",
    "content": [
        "A poem debuted at the coronation concert told of a new phase as city skies were lit up across the nation “like a smile”.",
        "James Nesbitt performed a spoken word piece entitled We’re Lighting Up The Nation, written especially for the occasion by the chairman of the Royal Society of Literature Professor Daljit Nagra.The Cold Feet star said: “No one’s an island when each is at home in the hope and glory! Born free – we’re a plucky bunch of every shade.",
        "“From the bronze of the Celts across our Roman roads to Windrush and beyond, today, just now, the spectacular parades of light travelling from Windsor to iconic heartlands across the realm so the kingdom be unified.“Imagine Edinburgh Castle near monuments for Scott and Burns, or imagine across the waters of Belfast our titanic dockyard and the blood-sweat, the toil that launched a thousand ships.“Over there’s Blackpool for Punch &amp; Judy, glad rags for the tango and foxtrot, and out for a pint of Newkie Brown by the Gateshead Bridge, that harp of the Toon, the Tyne – it’s all mine.“Now all Yorkshire beams from the hall of seven-hilled Sheffield, now my heart’s with the famed anthem, the land of my fathers at Cardiff Millennium!“Everywhere I look, from the golden miles of Leicester with their chicken masalas and jollof rice to an eco-haven amid the botanical gardens of Cambridge like the oasis at Eden with its rainforest under a dome, to our bold promise of the cliffs of Dover, everywhere I look, within our shores, I feel a new phase, new chapter must begin, just now, so let’s light up the nation like a smile!”",
        "Paloma Faith performed Lullaby at the Windsor concert as towns and cities across the country were lit up.The singer wore a puffy pink dress, a black headband and long shiny gloves as light shows took place in 10 towns and cities, including Sheffield, Blackpool, Edinburgh, Belfast and Newcastle.The displays also included the Welsh dragon, spanning 140m, beamed into the sky above Cardiff, whilst a watering can hovered above the Eden Project’s famous Biomes in Cornwall.",
        "Prof Nagra, Professor of Creative Writing at Brunel University London, said his poem was about the nation coming together and he was honoured to be asked to write the poem by BBC One and the Palace on behalf of the royal society.His references to staples of British culture and mentions of major cities around the country drew large cheers from the crowd.“My poem is about the nation coming together as various iconic sites around the United Kingdom are lit up,” Prof Nagra, whose Sikh Punjabi parents moved to Britain from India in the late 50s, said.“It’s packed with references to British cultural moments. For example, the opening line refers to John Donne’s great poem that opens ‘No man is an island’. I imagine he said this when he was the Dean of St Paul’s and speaking, as it were, to the nation.”"
    ]
}