{
    "articleURL": "/news/article-12059591/Anheuser-Busch-CEO-blames-social-media-misinformation-Bud-Light-boycott.html",
    "content": [
        "Michel Doukeris doubled down on claims that Dylan Mulvaney was never a partner with Bud Light and said cans featuring her face were never for saleHe blamed 'misinformation and disinformation' for the boycott, which sent sales crashing 26 percentHe previously blamed an outside ad agency for the campaign and said executives were never made aware of it The CEO of Anheuser-Busch has continued to deflect blame for the Dylan Mulvaney fiasco, and claims social media 'misinformation' triggered the boycott of Bud Light, sending sales crashing 26 percent. ",
        "Michel Doukeris doubled down on his claims that transgender TikToker Dylan Mulvaney was never a partner with the American beer company and said cans featuring her face were never going to be on sale for the general public.He blamed 'misinformation and disinformation' that was spread online for making people believe  cans with Mulvaney's face were being rolled out for sale across the US, when only one souvenir can had been produced and sent to the influence to mark the one year anniversary of her transition from male-to-female.It is just the latest excuse Anheuser-Busch executives have made for the calamitous advertisements, after previously saying it was created by an outside ad agency and nobody in the company were aware of the campaign — despite two of Bud Light's marketing executives stepping down in the aftermath.Doukeris told the Financial Times over the weekend: 'People often talk about this topic in social media like noise.'You have one fact and every person puts an opinion behind the fact. And then the opinions start to be replicated fast on each and every comment.'By the time that 10 or 20 people put a comment out there, the reality is no longer what the fact is, but is more (about) what the comments were.'The global CEO added: 'We never intended to make it for general production and sale for the public...it was one post. It was not an advertisement.' ",
        "Explaining what he claims happened as the 'misinformation' took hold, Doukas continued: 'But as the rumor that it was a campaign spread, he said, there were videos of billboards showing the Dylan Mulvaney can digitally and '10 million people [were] watching and commenting.''That had nothing to do with Bud Light, it was just like pure social media creation,' he said. The comments came just one week after Doukeris told investors: 'We need to clarify the facts that this was one camp, one influencer, one post and not a campaign.'We will continue to learn, meet the moment in time, all be stronger and we work tirelessly to do what we do best: Bring people together over a beer and creating a future of more cheers.'But in a letter sent to retailers, bars and restaurants by Grey Eagle — which distributes Anheuser-Busch products around St. Louis — executives said the advertisement campaign was created and approved by an outside ad agency partnering with Bud Light.It read: 'Anheuser-Busch did not intend to create controversy or make a political statement.'In reality, the Bud Light can posted by a social media influencer that sparked all the conversation was provided by an outside agency without Anheuser-Busch management awareness or approval.'Since that time, the lack of oversight and control over marketing decisions has been addressed and a new VP of Bud Light marketing has been announced.' ",
        "During the fallout of the advertisement, the company announced that vice president of marketing, Alissa Heinerscheid, took a leave of absence and the vice president for mainstream brand, Daniel Blake, stepped down from his post.The firm said both bosses 'decided' to temporarily step down, but their decisions were reportedly not voluntary.'Given the circumstances, Alissa has decided to take a leave of absence which we support. Daniel has also decided to take a leave of absence,' the company said.But the decision came after it was revealed that Heinerschied gave an interview to a business podcast in which she said she wanted to make Bud Light less 'fratty' and more 'inclusive'. Just two days later, Mulvaney - who began transitioning to a woman in 2021 - announced that she was partnering with the company.And by April 14, US CEO Brendan Whitworth delivered an apology to consumers upset about the apparent partnership.'We never intended to be part of a discussion that divides people. We are in the business of bringing people together over a beer,' he said in a statement.He added: 'My time serving this country taught me the importance of accountability and the values upon which America was founded: freedom, hard work and respect from one another.''I care deeply about this country, this company, our brands and our partners,' he added.",
        "'I spend much of my time traveling across America, listening to and learning from our customers, distributors and others. Moving forward I will continue to work tirelessly to bring great beers to consumers across our nation.'",
        "In her video posted on TikTok at the start of April, Mulvaney could be seen drinking Bud Light with the hashtag #budlightpartner.It implies that she was paid for the partnership, despite the brewing giants now claiming that the beer can and social media posts were not meant to be 'for production or sale to the general public.'It's unclear how much Mulvaney was paid to promote the drink, with gay bars and LGBT beer drinkers now joining conservatives in deserting Bud Light. Unlike right-wingers who say Mulvaney should never have been chosen as a face of the campaign, LGBT supporters say Bud Light acted shoddily by throwing her to the wolves as controversy reached a fever-pitch.  In the wake of the video, Anheuser-Busch lost more than $6billion in market capitalization in just six days.The beer giants stock roughly traded at just over 5 percent decrease in the total share value and the company's market capitalization stood at $113.33billion. And in the first week after the video was posted, Bud Light dollar sales dipped 6 percent, as Coors Light rose 3.5 percent and Miller Lite 3.1 percent. ",
        "Singer Kid Rock even posted a video of him opening fire on several cases of their beer as their sales dropped 17 percent in the week of April 18.By comparison, Coors Light saw sales rise by 10.6 percent, while Miller Lite scooped up even more profit with sales rising 11.5 percent. Then, between April 2 and April 15, Beer Board says that Bud Light's overall volume of sales at bars and restaurants dropped by 34.7 percent.Bud Light has now declined into the fourth spot of the most popular draft beer during the second week of the controversy – losing out to Coors Light.",
        "In an earnings call on Thursday, Doukeris said Anheuser-Busch's sales fell 26 percent, after reporting first-quarter earnings of $1.65billion, which topped Wall Street expectations.The brewer posted revenue of $14.21 billion in the period, which also beat forecasts, with the shares rising 6 percent since the beginning of the year and 12 percent in 12 months.The brand's slide in sales, Doukeris said, accounted for just 1 percent of the brewer's global volumes.  He noted that it was 'too early' to comment on its impact for the year.In the meantime, he said, the company is 'providing direct financial support' to the frontline workers impacted by the boycott.",
        "And over the summer, Doukeris vowed, Bud Light will triple its marketing in a bid to win back drinkers.",
        "Meanwhile, gay bars in Chicago have pledged not to sell Bud Light in the wake of Doukeris' statements walking back Anheuser-Busch's involvement with Mulvaney.The bar with four locations throughout the Windy City, 2Bears Tavern Group, denounced Anheuser-Busch after the company 'abandoned' their support of Mulvaney, 26, on Thursday.It went on to refer to Doukeris' response as 'cruel' and 'hateful' while insisting the beer company simply fed into 'anti-trans' criticism. 'Anheuser-Busch's decision to drop its support of Mulvaney in response to ignorant and hateful objections by some of its customers shows how little Anheuser-Busch cares about the LGBTQIA+ community, and in particular transgender people, who have been under unrelenting attack in this country,' the bar wrote in a statement.'CEO Brendan Whitworth's excuse that Anheuser-Busch \"never intended to be part of a discussion that divides people\" was tantamount to saying that the rights and safety of transgender people are topics worthy of debate.' The group will also discontinue other Anheuser-Busch brands, including Busch Light and Goose Island 312, it said."
    ]
}