{
    "articleURL": "/news/article-12038869/Chad-Daybell-predicted-wifes-death-eight-months-murder.html",
    "content": [
        "Alice Gilbert, a friend of Tammy Daybell's, told Vallow's murder trial that Daybell claimed 'he had a vision Tammy's time on Earth was coming to an end' 'He didn't know how or when - but he didn't see her living past the age of 50,' Gilbert told the Ada County Courthouse in BoiseDaybell and Vallow are accused of killing his 49-year-old wife in October. The month before they allegedly murdered her children JJ, seven, and Tylee, 16Chad Daybell predicted his wife's death eight months before he and Lori Vallow allegedly murdered the mother-of-five.",
        "Alice Gilbert, a friend of Tammy Daybell's, told Vallow's murder trial on Tuesday that Daybell claimed 'he had a vision that Tammy's time on Earth was coming to an end.''He didn't know how or when - but he didn't see her living past the age of 50,' Gilbert told the Ada County Courthouse in Boise.Vallow, 49, and Daybell, 54, are accused of killing Tammy at the couple's home in Rexburg, Idaho, in October, 2019. She would have turned 50 the following May.The doomsday couple, who married two weeks after Tammy's death, are further accused of killing Vallow's children JJ, seven, and Tylee, 16, in September, 2019.",
        "Gilbert, who wept at times on the stand, told jurors she was 'shocked' when Daybell introduced them to Vallow as his girlfriend just a week after Tammy's funeral.'They came in and sat on the couch. They were quite affectionate with each other,' she recalled.'It was abnormal for us to see Chad that way. His arm was around her, he had his arm over her legs. She was giggling and laughing. For my husband and I, we were embarrassed just because we hadn’t seen Chad that way. They looked like teenagers.'Gilbert said she asked if Vallow had any children. She said the pair claimed Vallow had a daughter who'd died recently - without explaining how or mentioning her younger brother JJ.",
        "'I had the impression that Lori had no other children, that she was an empty nester. I thought the daughter who had died was like an older daughter who died of cancer or illness or something,' Gilbert told the court. After cops started searching for the missing children, Tammy's body was exhumed in December, 2019. An autopsy - which Daybell had refused following her death - found that she had died as a result of asphyxiation.Gilbert, who had attended the same Mormon temple as Daybell in Rexburg, said she confronted him over the kids' disappearance when he visited her home after Vallow's arrest in Hawaii in February, 2020.Daybell asked if Gilbert and her husband Todd would lend him money so that he could post Vallow's bond.'When he asked us to do this bond, I felt like 'because you are asking this of us, I am going to ask you some questions'', Gilbert recounted.'I asked him: \"Where are the kids Chad. Doesn't Tylee deserve a life, a car, a boyfriend.\" And he said: \"She didn't like people and she didn't like me.\"'Prosecutor Lindsey Blake asked if anything struck Gilbert about the response.Gilbert said it did 'because he used \"didn't\" - he used the past tense.'She also told jurors of Daybell's unusual demeanor following his wife's death and that the funeral arrangements were made 'very quickly.' ",
        "Gilbert said she went over to visit the Daybell property the morning of Tammy's death.'The children were stunned. They were all on the couch and chairs and they could hardly speak. They were stunned. Chad was not stunned,' she testified.Gilbert said she went to visit some of the Daybells adult children in the following days.She recounted how their daughter Emma said of her father that 'he didn't want anything to do with her or her siblings.'Gilbert told the court how their son Garth said 'he was hoping he wouldn't lose his dad too.' A few days after the funeral, GIlbert said she wanted to check on Daybell to see how he was doing. She called him and asked if she could come over and visit, he refused but told her he would come over to her home instead. 'He came in and he sat in the kitchen. We asked him how he was doing and he said, \"Well I'm doing really good\", and that he had met the woman that he was going to marry,' Gilbert testified. 'We were shocked and he went on to say how beautiful she was.' Vallow and Daybell tied the knot on a beach in Kauai on November 5, 2019. Receipts show she purchased her own wedding ring on Amazon almost three weeks before Tammy's death. ",
        "The children were missing for almost a year before their corpses were found buried in Daybell's yard on June 9, 2020.During the opening, prosecutor Lindsey Blake described how charred remains were all that was left of Tylee.She told jurors: 'You will hear it explained as a mass of bone and tissue. That's what was left of this beautiful young woman.'Tylee's DNA was later found on a pickaxe and shovel in a shed on the property. JJ's body was wrapped in trash bags and duct tape - the tape binding his arms in front of him and wrapping around his head.",
        "The two children and Daybell's previous wife Tammy were all killed because they stood in the way of the couple's relationship, the State says. 'Remember, the defendant will remove any obstacle in her way to get what she wants, and she wanted Chad Daybell,' Blake told jurors.'The defendant used money, power and sex to get what she wanted.'Jurors have heard from friends and relatives of Vallow that she and Daybell believed the children were 'dark' and referred to them as 'zombies' before they disappeared.'The common theme was the body has to be destroyed,' Blake said. 'The defendant and Chad used their self-proclaimed religious teachings to justify their actions to others — their actions from affair to murder.'",
        "Prosecutors say the couple planned to use life insurance money from Tammy's death, and that Vallow kept collecting and spending the children's social security and benefits after they died.The trial opened on April 10 and the State is still laying out its case. Vallow denies two counts of first-degree murder and three counts of conspiracy in the deaths of her two children and Tammy Daybell.She further denies grand theft for allegedly collecting government benefits on behalf of her children after they were killed.Daybell is being tried separately.",
        "July 11, 2019: Lori Vallow's husband, Charles Vallow, is killed by her brother, Alex Cox, in Arizona. Police initially rule that Alex acted in self defense but reopen the case months later after the children are reported missing. August, 2019: Lori moves children JJ and Tylee to Rexburg, Idaho, close to where her future husband Chad Daybell lives with his wife Tammy.September 8, 2019: Tylee is seen alive for the last time during a trip to Yellowstone National Park with Lori, JJ and Alex. In the following weeks Lori tells people that her daughter is studying at Brigham Young University's Idaho campus.September 23, 2019: The last time JJ is seen at his school in Rexburg. Lori emails the school the following day claiming she is moving the family to California for a new job. October 2, 2019: Brandon Boudreaux, the ex-husband of Lori's niece Melani Pawlowski, is targeted in a drive-by shooting in Arizona. Police identify the vehicle carrying the shooter as a Jeep registered to Charles Vallow, Lori's late husband. October 19, 2019: Chad's wife Tammy, 49, dies at their Idaho home. An obituary states that she passed away peacefully in her sleep. Chad declines an autopsy and her death is listed as due to natural causes.October 25, 2019: A friend of Tylee receives a vague 'miss you' text from her phone but says that it didn't sound like the teen.   November 5, 2019: Lori and Chad tie the knot on a beach in Kauai. Receipts indicate that Lori purchased her own wedding ring from Amazon nearly three weeks prior to Tammy's death. November 26, 2019: Out-of-state relatives ask Idaho police to perform a welfare check on JJ. Lori and Chad claim he is in Arizona with relatives and ask their friend, Melanie Gibb, to lie and say she took the boy there for Thanksgiving. Police soon learn that no one has seen JJ or Tylee, since September. November 27, 2019: Police execute a search warrant related to the children at Lori's home and discover that she and Chad have fled Idaho.December 11, 2019: Tammy's body is exhumed from a Utah cemetery and her death is reclassified as suspicious.December 12, 2019: Lori's brother, Alex Cox, is found dead in a bathroom in his Arizona home. Months later an autopsy determines that he died of natural causes while he had the overdose drug Narcan in his system. December 21, 2019: Rexburg police issue the first press release about JJ and Tylee, revealing they believe their disappearance could be linked to Tammy's death and asking the public for information.December 24, 2019: Lori and Chad issue a statement through an attorney saying they love their son and daughter and look forward to addressing 'allegations once they have moved beyond speculation and rumor'.December 30, 2019: Police accuse Lori and Chad of lying to investigators and say they believe the couple know where the kids are or what happened to them.January 3, 2020: Police search Chad's home in Salem and remove 43 items, including tech devices and journals. They also comb over sections of the snow-covered yard with rakes and metal detectors.January 26, 2020: Lori and Chad are seen for the first time in months as police serve them with two search warrants in Kauai. Lori is also served with a court order to produce the children to authorities in Idaho in five days. The couple are approached by the media while officers serve the documents and refuse to say anything about the children.January 30, 2020: Lori misses the court deadline to produce the children to Idaho authorities.February 20, 2020: Lori is arrested in Kauai and charged with two felony counts for desertion and nonsupport of dependent children, and one misdemeanor count each for resisting and obstructing an officer, solicitation of a crime, and contempt of court. March 5, 2020: Lori is extradited to Idaho, where she is held on $1million bond at Madison County Jail.March 17, 2020: Lori professes her innocence in a statement through her attorney as two other members of her defense team quit and the judge removes himself from the case. March 24, 2020: Court documents filed in the divorce of Lori's niece Melani and her husband Brandon Boudreaux allege that Lori told people she believed her children were zombies before they disappeared. April 9, 2020: Authorities reveal they are investigating Lori and Chad for murder, attempted murder and conspiracy in connection with Tammy's death. June 9, 2020: Police search Chad's home in Salem for the second time and discover human remains in the backyard. Chad is taken into police custody and charged with destruction or concealment of evidence.May 25, 2021: Lori and Chad are charged with first degree murder in the deaths of the children. Chad is also charged with first-degree murder in the death of his wife Tammy. May 27, 2021: Lori is deemed incompetent to stand trial on the murder charges in Idaho. August 5, 2021: Prosecution announces it will seek the death penalty for Chad. April 11, 2022: Lori is restored competency. Criminal proceedings against her in Idaho are ordered to continue. April 14, 2022: Lori is taken to the Madison County Jail in Rexburg, Idaho, by Fremont County Sheriff officers.April 10, 2023: Lori Vallow goes on trial for the murders of JJ, 7, and Tylee, 16. "
    ]
}