{
    "articleURL": "/tvshowbiz/article-12045403/Who-Matty-Healys-famous-exes.html",
    "content": [
        "Pop megastar Taylor 'is madly in love' with The 1975 frontman Matty Healy and the pair are ready to go 'public'... weeks after her split with Joe Alwyn Matty Healy is believed to be the new man in Taylor Swift's life following her recent break-up from Joe Alwyn, with sources claiming they are 'madly in love'.",
        "The 'new couple' are rumoured to be making their first public appearance together this weekend when the singer performs in Nashville, Tennessee.Taylor's songs have become synonymous with her exes and she is believed to have penned tracks about A-listers Jake Gyllanhaal, Tom Hiddleston and Harry Styles. However before being linked to the princess of pop, 33, the 1975 rocker already has a string of high profile romances under his belt.Not to be outmatched by his new love interest, Matty has previously dated household names including FKA twigs and Halsey.",
        "News of the new romance comes just weeks after it emerged that Taylor split from her boyfriend of six years Joe, 32, after the pair 'struggled' with their 'career differences'.As fans of the two singers react to the news that they are the latest celebrity power couple to emerge, MailOnline takes a look back at Matty's past romances.FKA twigsMatty's most recent public relationship was with singer-songwriter FKA twigs, 35, whose real name is Tahliah Debrett Barnett, which ended last year.They were first rumoured to be linked in 2020 before the couple confirmed their romance with an Instagram post just weeks before lockdown.However the pair called things off due to 'work commitments', including the promotion and release of the fifth album from The 1975. ",
        "A source told The Sun at the time: 'Sadly things haven't worked out. Those around them thought this was going to be it but it hasn't been the case.'There was no massive row or fallout. When lockdown ended they both found themselves pulled in different directions with work commitments.'The insider went on to explain that twigs is feeling 'naturally upset' since splitting with singer but is being 'supported' by close friends.Since the split, fans of Matty's band have suggested that their hit I'm In Love With You was inspired by the relationship.",
        "Following his latest break-up, Matty became known for his signature 'kiss with a fan' segment during the 1975 performances.The controversial move caused quite a stir, especially after he asked to check a gig goers ID before planting a kiss on her.However in a hint at his blossoming romance in January, Matty revealed he would no longer be kissing fans out of respect for 'Queen' Taylor.Canadian model Charlotte Briar D'Alessio While it was never confirmed, after his split from twigs, Matty was briefly linked to  Canadian model and influencer Charlotte Briar D'Alessio late last year.According to The Sun, the pair had been seeing each other for a number of weeks, with the model often spotted backstage during the bands US tour. ",
        "A source told the publication: 'Matty and Charlotte have been quietly dating for a number of weeks and are head over heels for each other.'It is early days and they are taking things slowly but it is clear to everyone who knows Matty how keen he is on her.'They have been really subtle about being seen together, but backstage at his gigs, Charlotte is often there.'",
        "Gabriella Brooks Matty's longest relationship is believed to be with Australian model Gabriella Brooks, 33, who he dated for four years between 2015 and 2019.However it was reported at the time of their split that Gabriella grew tired of Matty's relentless partying and they decided to go their separate ways.A source said: 'Matty is great when he's on form but he isn't the easiest person to be with and leads a very unconventional life. There has been a lot of strain on their relationship, not helped by him being on tour a lot this year. 'He parties a lot at home when he's there and Gabby had just had enough. She doesn't want to lead her life like that.'",
        "The couple were first linked in 2015, however they didn't confirm their relationship until making their red carpet debut at the Brit Awards in 2017.",
        "Gabriella was dating Matty during the time of his heroin addiction and supported him through his stint in rehab.Speaking after their relationship ended, Matty confessed his addiction issues had taken their toll on the romance and it was incredibly hard for her.HalseyBack in 2015 prior to his romance with Gabriella, it was speculated that Matty was romancing singer Halsey, 28, after she was spotted at one of his band's gigs.The rumour mill went into overdrive when the hitmaker collaborated with the 1975 on their song Ghost, with fans claiming it was due to her and Matty's relationship.However things took a turn when it was claimed that the rumoured lovers had fallen out, with Halsey insisting they were 'not friends' in 2016. ",
        "The very same year Halsey collaborated with Matty's band on their track Ghost and further fueled the speculation, but things quickly turned sour and it was reported the pair had fallen out.In 2018 there was clearly no love lost as she accused The 1975 of 'fake activism' in a since-deleted tweet.Aliana LohanBefore this, Matty is said to have enjoyed a fling with Lindsay Lohan's younger sister Aliana, who goes by Ali, 29.While it was never anything more than a rumour, the singer and the American Actress are claimed to have had a dalliance in December 2014. ",
        "Taylor Swift Currently, Matty is said to be dating Taylor as she reportedly moves on with another British heartthrob just weeks after her split from actor Joe Alwyn. The 33-year-old singer is said to be 'madly in love' with the frontman, after their long-term friendship blossomed into romance.The duo - who first met in 2014 - are now gearing up to go public with their romance during her concert in Nashville, Tennessee on Friday, reports The Sun.Yet despite the short turnaround, Taylor is said to be besotted with Matty - who is the son of Loose Women star Denise Welch and Benidorm actor, Tim Healy. ",
        "The rumoured romance with Matt is the latest in a string of British boyfriends for Taylor, who - as well as her last relationship with Joe - has dated Harry Styles, Calvin Harris, and Tom Hiddleston. An insider told the publication: 'She and Matty are madly in love. 'It's super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out.'The source went on to insist that there was no crossover in Taylor's love life, despite news of her split from Joe emerging last month, insisting that the pair actually broke up in February. Taylor is currently in the middle of the US leg of her The Eras Tour while The 1975 are on their At Their Very Best concert tour, but the source insisted they have kept in constant communication by texting and Face Timing.",
        "The source added: 'As two international megastars, they understand the pressures of one another’s jobs better than anyone, and are incredibly supportive of their respective careers.'They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.'Taylor just wants to live her life, and be happy. She’s told pals Matty is flying to Nashville over the weekend to support her on the next leg of her tour.'DailyMail.com contacted representatives for Taylor for comment. ",
        "Back in 2015, Matt denied romance rumours with Taylor but confirmed they had been texting each other frequently. After rumours began circling he confirmed on Australian radio: 'It's fake. It's all bloody fake. It's a farce!'Yeah, we met each other, we exchanged numbers in the same way that a lot of people in this kind of world do and we spoke occasionally.'And she's the biggest pop star in the world and I'm in Australia. There's no like, relationship or anything happening. It's just funny how people really, really buy into that.' Their rumoured flirtation had begun the previous year when Matt wore Taylor's 1989 album T-shirt during one of the band's gigs, and she followed suit by sporting one of their tour tops. In January, Taylor cuddled up with Matty's famous mom Denise Welch who was every inch the proud mother as her son performed at London's 02 Arena. The Loose Women star shared a sweet picture with Taylor Swift from backstage, after the singer made a surprise appearance on stage during the gig. Denise, 64, couldn't wipe the smile off her face as she posed with the hitmaker, posting a picture on Instagram. 'Oh what a night at a sold out 02. So proud I can't even begin!!' Denise's post was captioned.In the image, Taylor looked chic in a black blazer, with her dark blonde locks tied up in a bun and a pop of red lipstick. She beamed as she wrapped an arm over Denise's shoulder. Earlier in the night, Taylor shocked fans as she performed chart-topper Anti-Hero for the first time during a surprise appearance at The 1975's gig.Matt previously revealed the band worked with Taylor on her latest album Midnights, but their tracks didn't make the cut."
    ]
}