{
    "articleURL": "/femail/article-12050621/Foodies-wild-ahead-Coronation-King-Charles-pizzas-celebratory-sandwiches.html",
    "content": [
        "Foodies have been going wild with dishes ahead of the Coronation tomorrowRead more: For all the latest Royal news, pictures and video click here Have you made a celebratory Coronation dish? Email your photos to harriet.johnston@mailonline.co.uk  Foodies have been going wild with their celebratory dishes ahead of the King's Coronation tomorrow. ",
        "Having ascended to the throne in September 2022 after the death of his mother, Queen Elizabeth II, Charles will be crowned King on Saturday, 6 May, 2023.And while thousands of people are expected to be in London to catch a glimpse of the procession, millions more will watch coverage of the coronation across Britain.Many have been whipping up dishes and meals to celebrate the big event, with some very humorous and impressive results.One person crafted a meaty sandwich apparently celebrating the King's 'sausage' fingers, complete with tomato buttons and even a cheese signet ring.",
        "Meanwhile a pizza restaurant in Glasgow is marking the big day with their King Charlie Pizza.Sharing a post on Facebook, Villaggio Pizza wrote: 'To commemorate our new monarch we have produced our King Charlie Pizza. 'It's a one-off and not available to order, unfortunately, but we do have all our usual great food.'The eatery is not the only one to be marking the big day this weekend. M&amp;S have released a special edition of their Colin the Caterpillar cake, featuring a crown atop his head, ahead of the Coronation.A post on their official Instagram read: 'To celebrate the coronation of Their Majesties King Charles III and Queen Camilla, we're SO excited to share our limited-edition Coronation Colin @official_colinthecaterpillar.",
        "'This extremely chocolatey cake is covered in edible royal decorations and topped with decadent chocolate crown jewels!  Who's going to be grabbing one of these ahead of the bank holiday weekend?!'Other bakeries were quick to share their tributes to the King ahead of the big day. Baked In Bunbury shared a snap of their incredible Charles shaped cake on Instagram, much to the delight of their followers.They wrote: 'A cake fit for a King! We’ve got our bunting up, the clotted cream is in the fridge and we are ready to party on Saturday!'The bakery also shared a snap of a cake moulded into the shape of a corgi, posting: 'We’re getting in the Coronation mood here at Baked In Bunbury! 'If you’re looking for a centrepiece for your own big celebration get in touch today to see how we can help!'",
        "Meanwhile another bakery created a Coronation Cookie, featuring a Freddo chocolate biscuit in the centre. It comes as it emerged The Coronation quiche created in honour of the new King has had its limelight stolen - with shoppers appearing to favour Coronation chicken ahead of the celebrations this weekend.Quiches are filling up trolleys as a party food classic, but the raw ingredients needed to make the Coronation quiche have not been in popular demand, according to The Times.",
        "Meanwhile, searches for Coronation chicken - created for the crowning of the late Queen in 1953 - have doubled on the Waitrose website this week.As the nation prepares to come together for celebratory street parties, searches for festive favourites such as trifle have soared and bunting and flags have popped up across the country.But no supermarket has seen increased interest for the Coronation quiche ingredients, the newspaper reported.Appearing to take inspiration from the monarch's love of gardening, the dish features spinach, broad beans and tarragon. But it faced initial criticism when it was announced amid at a time when one of the key ingredients of the dish, eggs, was in national shortage.Even the most vocal royal supporters have since disparaged the dish with former Cabinet minister, Jacob Rees-Mogg, admitting that he will not be tucking into a coronation quiche because he finds the savoury meal 'disgusting'. 'I don't like quiche, it's disgusting, I wouldn't dream of having it - and it's got broad beans in it, which are loathsome,' he said.French food experts have also claimed the proposed dish is not a quiche but is, instead, a tart. Experts from the area of Lorraine, where the dish gained prominence, have insisted that there is only one kind of quiche – and that is a Quiche Lorraine.",
        "The Great British Bake Off judge Dame Prue Leith however has given her stamp of approval to the Coronation quiche, judging it to be 'absolutely delicious'.The chef and TV presenter became one of the first people to try the official coronation pastry at a special Big Lunch at Westminster Abbey in April, attended by faith leaders from across the country.A Big Lunch ambassador, Dame Prue, 83, praised the dish for being 'seasonal'.'The quiche was absolutely delicious,' she said. 'There was no soggy bottom, the custard was not overcooked and dry, and the balance of tarragon was perfect - a really good quiche.'Quiche is universal. Even cold, if the ingredients are right and the pastry is nice and buttery, it will taste great.'I remember when quiche Lorraine was something very special 60 years ago. It is still one of the best pastries to make.'"
    ]
}