{
    "articleURL": "/wires/reuters/article-12038829/Kosovo-Serbia-agree-share-information-missing-1990s-war.html",
    "content": [
        "PRISTINA, May 2 (Reuters) - Kosovo and Serbia pledged on Tuesday to work together to locate Kosovo war-era burial sites to identify the remains of those still missing from the 1998-99 conflict.",
        "Almost 24 years later, 1,621 people remain missing from the war that left more than 13,000 people dead. The majority of those killed and still missing are ethnic Albanians.The issue has remained an obstacle towards thawing relations between the two former foes.\"More than twenty years after, their families continue to live in grief, unaware of the whereabouts of their loved ones,\" EU's foreign policy chief Josep Borrel, who mediated the deal, said in a statement.\"Families have the right to know the fate of their relatives, as does society at large.\"The deal was reached late on Tuesday between Kosovo's Prime Minister Albin Kurti and Serbia's President Aleksandar Vucic. The two are in Brussels for a high-level meeting which is part of EU mediation efforts to help the countries normalise relations.Both parties have agreed to share documents, including those that are classified, and to use satellite data and other technology to detect the sites of suspected mass graves.The largest mass grave from the war found so far, containing the bodies of more than 800 Kosovo Albanians, was discovered in 2001 in a police compound near Belgrade.The war began in 1998 when ethnic Albanians in Kosovo, then a province of Serbia, took up arms in an uprising against rule from Belgrade. It ended in June 1999 after NATO intervened. Kosovo was then governed administratively by the UN.",
        "Kosovo declared independence in 2008 but Serbia refuses to recognise the statehood of its former province.In March, Pristina and Belgrade verbally agreed to implement a Western-backed plan aimed at improving ties but little progress has been seen since.An outstanding issue still to be settled is how much autonomy to grant to Kosovo's Serb minority, who form around 5% of the population. (Reporting by Fatos Bytyci, Editing by Rosalba O'Brien)"
    ]
}