{
    "articleURL": "/wires/ap/article-12042795/With-no-venue-cup-final-Greek-soccer-turmoil.html",
    "content": [
        "ATHENS, Greece (AP) - Rival club owners have been accused of a \"concerted and organized effort\" to disrupt Greek soccer.",
        "The country's soccer federation has failed to find a venue for the Greek Cup final between AEK Athens and PAOK Thessaloniki on May 24 after seeking assistance to host the match in Cyprus, England, Germany or Australia.Two local stadiums, in the central Greek cities of Volos and Larissa, have also been ruled out after safety inspections.\"The fans of AEK and PAOK and those in general should be aware that the (federation) is facing an concerted and organized effort to stop the Greek Cup final from taking place under the pretext of preventing fan violence,\" the federation said Wednesday. \"Every effort will be made to hold the final at a neutral ground and even if this obstructionist effort continues. The final will go ahead.\"Greek Cup finals in the past have been repeatedly marred by violence, and federation officials say this year´s game will likely take place in front of only a select group of supporters.The debacle regarding the venue ends another year of turmoil in Greek soccer with heated public spats between rival tycoon club owners, many with fortunes in shipping, energy and the news media.Referees from overseas were again used to officiate major games. But Polish match officials pulled out of a Greek match last month following a reported altercation with passengers at Athens International Airport.",
        "The incident prompted UEFA to withdraw its support from the referee assistance program.\"UEFA was deeply saddened and highly disturbed to learn about another incident concerning the abusive and violent behavior towards football referees delegated to officiate recent matches in the Greek championship,\" UEFA president Aleksander Ceferin wrote in a May 1 letter to the Greek soccer federation. \"We must prioritize the safety of our match officials, who must be kept away from such hostile and dangerous situations.\"Greek officials said the decision was unlikely to impact the three remaining rounds of the league playoffs because referees had already been selected.AEK Athens and city rival Panathinaikos currently lead the standings with 76 points each from 33 games. Defending champion Olympiakos trails by 10 points despite the high-profile signings of former Real Madrid duo Marcelo and James Rodriguez, who were both released during the season.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}