{
    "articleURL": "/femail/article-12052817/Royals-dazzling-display-designer-finery-Buckingham-Palace-reception.html",
    "content": [
        "British and foreign royalty mingled at a dazzling eve-of-Coronation receptionREAD MORE: For all the latest Royal news, pictures and video click hereBritish and foreign royalty mingled with other VIP guests at a dazzling eve-of-Coronation reception at Buckingham Palace tonight.",
        "As King Charles was charmed by an elegant Crown Princess Mary of Denmark, greeting her warmly with a kiss on the cheek, the Princess of Wales posed for an official photograph with US first lady Dr Jill Biden and Olena Zelenska, the first lady of Ukraine.Despite a busy day of rehearsals, welcome events and a walkabout, Kate, 41, looked unruffled in a £360 royal blue dress by Self-Portrait. She was accompanied by Prince William.The reception was organised as a chance for the King to greet his guests because there will be no formal event outside the Coronation itself today.A Who’s Who of foreign royalty and heads of state crowded into the Palace’s Picture Gallery, as well as the Music Room and Blue Drawing Room, as staff circled with drinks and canapés.",
        "Prince Albert and Princess Charlene of Monaco – striking in Terrence Bray lavender trousers with a one-shouldered top – were also there, along with King Philippe of Belgium and daughter Princess Elisabeth, who wore a £3,609 Giorgio Armani navy dress.Princess Lalla Meryem of Morocco stopped for photographers at the Grand Entrance, as did Grand Duchess Maria Teresa and Grand Duke Henri of Luxembourg. Glamorous Queen Rania of Jordan - sporting a button-down midi dress from Schiaparelli, costing £8,000 - and her husband King Abdullah were welcomed warmly by King Charles, an old friend. ",
        "Queen Letizia of Spain cut a typically glamorous figure in green. She opted for a £850 Victoria Beckham frock.",
        "There was also a good show of Scandinavian royalty including Crown Prince Haakon and Crown Princess Mette-Marit of Norway and King Carl Gustaf of Sweden and Crown Princess Victoria.Meanwhile, Crown Princess Mary of Denmark, dressed in a £1,195 Andrew Gn gown, attended the event with her husband Frederik, Crown Prince of Denmark.Also there was Prime Minister Rishi Sunak, his wife Akshata Murty wearing a daring lace blue dress, costing £400 from Self-Portrait."
    ]
}