{
    "articleURL": "/wires/ap/article-12051741/UEFA-details-new-cup-final-security-plans-Paris-chaos.html",
    "content": [
        "GENEVA (AP) - After UEFA was widely blamed for security failures at the chaotic and life-threatening Champions League final last year, it published action plans on Friday for future cup finals.",
        "The move was demanded in February by UEFA-appointed investigators of the 2022 final in Paris.UEFA said it created a \"senior level incident control group\" to oversee its highest profile games, will have more of its own security staff at stadiums, and will issue only digital tickets to fans instead of paper ones.UEFA also pledged to \"actively engage\" with host city police commanders and improve communication with local organizing officails and the finalist teams, including fan groups. \"Dedicated UEFA supporter liaison officers\" will be appointed for finals.Crowd modelling assessments are also being ordered by UEFA for its four club competitions finals due to be staged in the next five weeks at Istanbul, Budapest, Prague and Eindhoven.The Champions League final is on June 10 at Atatürk Olympic Stadium in Istanbul.",
        "UEFA was given a deadline of next Monday to update plans for managing cup finals by an investigation team which published a damning 220-page report in February into the chaos at Stade de France last May before and after Real Madrid´s 1-0 win over Liverpool.The biggest club game in world soccer almost became a \"mass fatality catastrophe,\" the investigation panel wrote, concluding, \"It is remarkable that no one lost their life.\"Police in Paris used tear gas on fans who were stuck in congested, slow-moving queues for hours before the game, which was eventually delayed by about 40 minutes. UEFA initially blamed late-arriving Liverpool fans for the delayed kickoff.",
        "But the failures were on UEFA plus French soccer and public authorities for \"an overly securitized approach, unilateral actions by police, an overwhelming focus on misperceived public order threats posed by Liverpool fans, poor cooperation with the event organizer, lack of engagement with supporters, and over reliance on munitions.\"Making 21 recommendations to UEFA, the panel wrote three months ago that \"supporters arriving in the host city without access to match tickets should never be understood or treated as inherently a public order problem but facilitated as tourists who are traveling to be a part of the festival the authorities are seeking to promote.\"UEFA committed on Friday to creating a welcoming atmosphere at finals including in the \"last kilometer\" of fans´ approach to stadiums through security cordons, which should have more appropriate signs. Dedicated UEFA staff should be at each block of entry turnstiles to help fans with ticket issues.Also noting the duties of others, UEFA said it \"continues to rely on the local expertise and responsibilities assumed by stakeholders\" including stadium operators and national soccer federations.UEFA´s action plan was praised by the head of the European fan representative group which is its official liaison.\"We have experienced first-hand the increased level of supporter engagement over the last year and welcome the strengthened approach to the integration of supporters´ perspectives in the preparation of the finals,\" Ronan Evain, the executive director of Football Supporters Europe, said in a UEFA statement.",
        "Madrid could return to the Champions League final. The defending champion plays Manchester City in the semifinals this month. The winner will advance to play AC Milan or Inter Milan.The Europa League final is on May 31 in Hungarian capital Budapest, with the semifinals lineup of Juventus vs. Sevilla and Roma vs. Bayer Leverkusen.The Europa Conference League final is on June 7 in the Czech capital Prague. In the semifinals, West Ham plays AZ Alkmaar and Fiorentina faces Basel.The Women's Champions League final, between Barcelona and Wolfsburg, is on June 3 in the Netherlands at Eindhoven.The Paris security failure followed security and other issues for fans at two previous UEFA showpiece games: The men's European Championship final between England and Italy at Wembley in July 2021 and the Eintracht Frankfurt-Rangers final of the Europa League in Seville 10 days before Paris.UEFA offered to refund the price of tickets for all Liverpool fans who were at Stade de France and some Real Madrid fans and other spectators.Some Liverpool fans have said they will file a legal suit against UEFA, and Madrid offered to help its fans to file their own claims.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sport"
    ]
}