{
    "articleURL": "/wires/ap/article-12052419/Sudan-s-warring-sides-send-envoys-talks-Saudi-Arabia.html",
    "content": [
        "ASWAN, Egypt (AP) - Sudan´s two warring generals sent their envoys on Friday to Saudi Arabia for talks aimed at firming up a shaky cease-fire after three weeks of fierce fighting that has killed hundreds and pushed the African country to the brink of collapse, three Sudanese officials said.",
        "The negotiations would be the first between Sudan´s military, led by Gen. Abdel-Fattah Burhan, and the paramilitary Rapid Support Forces, commanded by Gen. Mohammed Hamdan Dagalo, since clashes broke out on April 15.According to the three - two senior military officials and one from their paramilitary rival - the talks will begin in the Saudi coastal city of Jeddah on Saturday, following concerted efforts by Riyad and other international powers to pressure the warring sides in Sudan to the negotiating table.The three officials spoke to The Associated Press on condition of anonymity to discuss the upcoming peace talks. No timeframe was given for the length of the talks.The fighting has turned Sudan's capital of Khartoum and other urban areas into battlefields and pushed hundreds of thousands from their homes. There is increasing concern for those trapped and displaced by the fighting, and aid workers and civilians have said there is a dire lack of basic services, medical care, food and water.Foreign governments have rushed to evacuate their diplomats and thousands of foreign nationals out of Sudan. Saudi warships have been ferrying those fleeing from Port Sudan, on Sudan´s Red Sea coast, which has now become the entry hub for aid sent to the embattled nation.",
        "A series of fragile and often violated cease-fires over the past three weeks has failed to stop the fighting. Fierce battles raged Friday in areas around the military´s headquarters and the international airport in Khartoum, according to residents. https://apnews.com/article/sudan-military-rsf-conflict-civilians-port-sudan-war-bd675f2ce360e7d40f4926c81057cdbf",
        "According to the three officials, the talks in Jeddah would address the opening of humanitarian corridors in Khartoum and the adjacent city of Omdurman, which have been the centers of the battles.One of the military officials said the talks are part of an initiative proposed by Saudi Arabia and the United State. He said they would also discuss providing protection to civilian infrastructure, including health facilities.The RSF official said Saudi and American officials would facilitate the talks. He said they would also discuss a mechanism to monitor the cease-fire and confirmed on Friday that the RSF delegation had left for Jeddah. Sudan's military also later its delegation had departed to Saudi Arabia, saying the talks would discuss \"details of the truce,\" without elaborating.U.S. Secretary of State Antony Blinken, meanwhile, discussed the initiative in a phone call with Saudi Foreign Minister Prince Faisal bin Farhan, the Saudi Foreign Ministry said in a statement. It said the initiative aims to \"prepare the ground\" for dialogue to deescalate tensions in the African country. The statement also did not provide further details.U.S. State department spokesperson Matthew Miller said Blinken expressed his \"gratitude for Saudi Arabia´s invaluable assistance in facilitating the safe arrival in Jeddah of U.S. citizens and their family members departing Sudan.\"",
        "The two top diplomats \"affirmed their countries´ intensive collaboration on diplomatic work to bring about an end to the fighting in Sudan,\" Miller said.The U.N. envoy in Sudan, Volker Perthes, lauded the move as \"a positive sign,\" but cautioned about high expectations from the meeting.\"It is a positive sign, a sign of getting more realistic, realizing that there will be no easy or quick win,\" he told the AP from Port Sudan. \"We need to realize, however, that this is a first encounter.\"The meeting may be \"exploratory rather than concrete,\" he said and added that achieving a \"lasting cease-fire\" would need more than one meeting.The battle for control of Sudan, which capped months of tensions between Burhan and Dagalo, has so far killed at least 550 people, including civilians, and - as of Monday - wounded more than 4,900, according to the Sudanese Health Ministry.The Sudanese Doctors´ Syndicate, which tracks only civilian casualties, said Friday that 473 civilians have been killed in the violence, and more than 2,450 have been wounded.James Elder, a spokesman for the the U.N. children agency, said at least 190 children have been killed and 1,700 have been wounded in the fighting.\"This means that every single hour, you have seven boys or girls ... killed or injured,\" he said at a press conference Friday in Geneva. \"I think this is underlining the enormity of how violent this is.\"",
        "The power struggle has put millions of Sudanese in the line of gun battles, artillery bombardments and airstrikes. So far, at least 334,000 people have been displaced inside Sudan, and tens of thousands more have crossed to neighboring countries - Egypt, Chad, South Sudan, the Central African Republic and Ethiopia, according to U.N. agencies.The U.N. World Food Program projects that the number of acutely food insecure people in Sudan will increase by between 2 million and 2.5 million people - raising the number to a total of 19 million people - in the next three to six months if the current conflict continues, U.N. deputy spokesman Farhan Haq said. The U.N. refugee agency announced that $445 million will be needed to support an estimated 860,000 Sudanese refugees fleeing Sudan to five countries affected by the emergency.___Associated Press writer Matthew Lee in Washington contributed to this report."
    ]
}