{
    "articleURL": "/wires/ap/article-12044759/Abrams-Nats-squeeze-past-Cubs-2nd-straight-night-2-1.html",
    "content": [
        "WASHINGTON (AP) - Jake Irvin had dozen of relatives and friends fly in from his native Minnesota to witness his major league debut for the Washington Nationals - and then he hit the \"O\" on the back of Nico Hoerner's jersey with the first pitch of his career.",
        "\"I gotta imagine I'm one of few to do that, right?\" Irvin said. \"Just laugh it off, man. Next hitter.\"Things improved significantly from there for the 26-year-old right-hander, who held the Chicago Cubs' potent lineup to two singles over 4 1/3 innings. Four Washington relievers gave up four singles the rest of the way, and the Nationals turned four double plays to beat the Cubs 2-1 on a damp and unseasonably chilly Wednesday night.\"This is something you dream of from the day you pick up a baseball,\" Irvin said. \"I'm on top of the world and props to the team, man. Guys played great behind me.\"CJ Abrams had a tiebreaking RBI single in the seventh inning for the second consecutive game for the Nationals, and the shortstop contributed to all four of those double plays, including a grounder by Patrick Wisdom that he fielded cleanly to get the game's last two outs.After Marcus Stroman pitched six crisp innings for the Cubs, the Nationals went ahead on four pitches by Adbert Alzolay (1-1). Lane Thomas tripled down the left-field line, the only extra-base hit of the game, and Abrams lined the next pitch to center.",
        "Carl Edwards Jr. (1-1) retired the side in the seventh, Hunter Harvey worked the eighth and Kyle Finnegan gave up back-to-back hits to start the ninth but wiggled free for his seventh save.",
        "\"I think we played one of our best games of the year,\" Nationals manager Dave Martinez said. \"Close game, catching the ball, playing good defense, turning some double plays, heads-up baserunning.\"The Cubs have lost five of six, all to NL East foes, and fell to .500 for the first time since April 9.\"Sometimes it's just baseball, to be honest,\" Stroman said. \"It's hard to kind of nitpick and say what it is. There could be a stretch when we win five, six close games in a row down the road. It´s a long season.\"The 6-foot-6 Irvin was rated by Baseball America as the prospect with the best control in the Nationals' system, but he battled some adrenaline-fueled wildness. After plunking Hoerner, he walked four batters, including two in the fifth to end his night. Andres Machado came on and got a double-play grounder on his first pitch to end the threat.\"We can't seem to get the ball in the air, get the ball to fall with two outs,\" Cubs manager David Ross said. \"You can look back on a couple scenarios where maybe we could have been a little more patient.\"The Nationals put runners on second and third with one out in the fifth, but Stroman struck out Alex Call and retired Luis García on a broken-bat grounder to short. Stroman pounded his glove in satisfaction as he walked off the mound.",
        "Stroman allowed one run on five hits. He has given up two runs or fewer in six of his seven starts but is winless since April 7.Seiya Suzuki had an RBI single in the first for Chicago. The Nationals tied it in the second when Joey Meneses singled, moved to third on a single by Jeimer Candelario and scored on Dominic Smith's double-play grounder.IN MEMORIAMThe Nationals held a moment of silence before the game for longtime team physician Dr. Bruce Thomas, who died Tuesday night of complications from a recent surgery.ROSTER MOVEThe Cubs sent C Luis Torrens to the Baltimore Orioles for cash.TRAINER'S ROOMCubs: C Yan Gomes, who was hit in the head by a backswing on Monday night, was placed on the seven-day concussion injured list, retroactive to Tuesday. Chicago recalled RHP Javier Assad from Triple-A Iowa. ... RHP Kyle Hendricks (right shoulder) made a rehab appearance for Iowa on Wednesday, allowing four runs in 2 2/3 innings. ... RHP Codi Heuer (Tommy John surgery) was set to throw one inning at the Cubs' training facility in Arizona.Nationals: Reinstated INF Ildemaro Vargas (left shoulder) from the 10-day injured list and optioned SS Jeter Downs to Triple-A Rochester.UP NEXTCubs right-hander Jameson Taillon (0-2, 4.50 ERA) who's been sidelined with a left groin strain, will come off the 15-day IL and start Thursday's series finale, Ross said after the game. Left-hander Patrick Corbin (1-4, 5.74) will pitch for Washington.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}