{
    "articleURL": "/wires/reuters/article-12049427/UK-PM-Sunaks-Conservatives-lose-seats-early-local-election-results.html",
    "content": [
        "LONDON, May 5 (Reuters) - British Prime Minister Rishi Sunak's Conservatives lost dozens of seats in local elections in England with voters punishing his party over political scandals, sluggish economic growth and high inflation, early election results showed on Friday.",
        "While governing parties often struggle at mid-term elections, the results will be the largest, and possibly last, test of voter sentiment before the next general election which is expected to be held in 2024.The Conservative Party suffered a net loss of 88 seats on local councils that were up for re-election, the early results showed. The main opposition Labour Party, which is hoping to gain hundreds of seats in a mid-term vote, added 64 seats.The Liberal Democrats had a net gain of 24 seats.The results will decide more than 8,000 council seats in 230 local government authorities who are responsible for the day-to-day provision of public services such as bin collections and schools.John Curtice, Britain's best-known pollster, said based on the results so far, the Conservatives could face a net loss of about 1,000 seats, which would be one of the party's worst performances in local elections in recent memory.Sunak has tried to restore the credibility of the Conservatives since he was made prime minister in October following months of economic chaos, strikes, and political scandals.The Conservatives changed prime ministers three times in the past year after Boris Johnson was ousted partly over parties held in government buildings during COVID-19 lockdowns, and Liz Truss was brought down following a gamble on tax cuts that shattered Britain's reputation for financial stability.",
        "In the local elections, the Conservatives were facing a fight on two fronts: with the main opposition Labour Party seeking to reclaim seats in the so-called Red Wall areas in north and central England, and the Liberal Democrats attempting to make gains in the south.In early results, Sunak's party lost control of three councils Brentwood, Tamworth and North Leicestershire. Labour won Plymouth in a key battleground area regarded as important to the party's hopes of winning the next general election.Johnny Mercer, a member of parliament for the area, said it had been a \"terrible\" night for the Conservatives.The Labour leader Keir Starmer visited Plymouth early in the local elections campaign as the party threw resources into winning back control of the council.A full picture of the state of the parties will not become clear until later on Friday when most of the councils will announce their results. (Reporting by Andrew MacAskill; Editing by Michael Perry)"
    ]
}