{
    "articleURL": "/tvshowbiz/article-12053953/Julie-Bishop-mocked-elaborate-outfit-Kings-Coronation.html",
    "content": [
        "Julie Bishop has attracted criticism for the elaborate designer ensemble she wore to the Coronation of King Charles III on Saturday. ",
        "The former Australian Minister for Foreign Affairs stunned in a fitted beige dress with floral motifs and matching hat, which towered on her head. But not everyone was impressed, with several viewers watching the ceremony at home comparing her to a 'toilet dolly' - a type of decorative doll that was popularly used as a toilet roll holder in the 1970s. 'Julie Bishop dressed as a toilet dolly. Pomp now getting underway' joked one person on Twitter. 'WTF why did Julie Bishop marry Commander Lawrence in The Handmaids Tale? Mrs Putnum is a dead ringer but doesn’t dress like a toilet paper holder' another said. ",
        "'Julie Bishop's stylist is as effective as Morrison's empathy coach' someone else chimed in while another said the outfit looked like a 'hazmat suit'. 'OMG! What the hell has Julie Bishop wearing! Mutton dressed as lamb!' said another.Others liked the look, with one writing: 'Julie Bishop at the coronation looking riveting… with a touch of welding a bit of panel beating and some spray painting!'   Bishop earlier shared a glimpse inside Westminster Abbey ahead of the ceremony to her Instagram Stories. ",
        "The 66-year-old beamed alongside American singer Lionel Richie in the image. 'And I take my seat at the Coronation next to Lionel Ritchie, Prince's Trust Global  Ambassador' she wrote in her caption. ",
        "'I'm excited about attending today the coronation of their Majesties,' Bishop told The Daily Telegraph on her way into the venue earlier. 'I chair the Prince's Trust in Australia and it's also a wonderful opportunity to highlight the great work of King Charles around the world in two countries with employment and education. So, it's an amazing opportunity.' ",
        "Bishop, Nick Cave and soccer superstar Sam Kerr are among a handful of Australians invited to King Charles III's Coronation.Prime Minister Anthony Albanese and his partner Jodie Haydon will lead the group of Australians attending the ceremony at Westminster Abbey, in London.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.At Saturday's coronation, he and Queen Consort Camilla will be officially crowned by the Archbishop of Canterbury, Justin Welby."
    ]
}