{
    "articleURL": "/news/article-12053957/Nation-holds-breath-King-Charles-makes-face-signing-Coronation-Oath-fountain-pen.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's Coronation How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk As millions of people around the world tuned in to the King's Coronation today, many will have watched with bated breath for one fateful moment of the proceedings.",
        "It was, of course, the King's signing of his Coronation Oath, shortly after entering Westminster Abbey with Queen Camilla.This time, he made only the slightest grimace as screwed the top back on to the fountain pen.His wife Camilla appeared to stifle giggles as she watched her husband, who has previously made a joke over his stationery faux pas. The monarch's pet peeve with leaky, awkward pens has become something of a running joke since his ascension.At his proclamation at St James' Palace last September, he frantically motioned to an aide to move a pen box - gifted to him by Harry and William - from his desk because it was getting in his way as he attempted to sign the document.The rare glimpse of the monarch's annoyance tickled many viewers. Tongue-in-cheek observations and memes flooded social media following the awkward moment. One said the table holding the documents 'was about the size for balancing a TV dinner on'. Another viewer said: 'Well that's the next step. Extraordinary to witness. King Charles a little flustered with the pen situation.'And later that month, the monarch was given a pen 'just in case' by well-wishers on his walkabout in Cardiff. ",
        "In October 2022, the King was at Royal Hillsborough Castle near Belfast ahead of a service of reflection at St Anne’s Cathedral. While signing a book, the 73-year-old first exclaimed ‘Oh god, I’ve put the wrong date down’ before passing the pen to his wife Camilla, the Queen Consort, as she pointed out he had got the date wrong earlier in the day too.",
        "As he got up he looked down at his finger which had apparently been stained with ink from the fountain pen before shrieking: ‘Oh God, I hate this.'Camilla was then caught on camera saying: ‘Oh look, it’s going everywhere, hang on' while holding the pen out in her right hand.It was taken away by an aide while she appeared to wipe her fingers with her other hand.In the background, the King can be heard saying: ‘I can’t bear this bloody thing! What they do, every stinking time,’ wiping his fingers with a paper handkerchief and leaving the camera view. Camilla then used a different pen to sign the book.The King is known to carry his own fountain pen when he is frequently called on to sign visitors' books during royal visits.",
        "The monarch and his wife smiled to the congregation as they walked through the church for a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.Westminster Abbey has been the scene for every one of the past 38 coronations dating back to William the Conqueror in 1066, and a solemn Charles clearly felt the weight of history on his shoulders eight months after the death of his beloved mother Queen Elizabeth II. ",
        "The monarch had been heir to the throne since the age of three, and was ready to finally embrace his day of destiny with the woman he loves by his side.Before his crowning moment the King was anointed with holy oil away from public view. Minutes earlier Charles swore on the Bible and kissed it, having taken the oath: 'I, Charles, do solemnly and sincerely in the presence of God profess, testify, and declare that I am a faithful Protestant, and that I will, according to the true intent of the enactments which secure the Protestant succession to the throne, uphold and maintain the said enactments to the best of my powers according to law.'His family were sat closest to him in a 2,300-strong congregation, although Prince Harry was sat in the third row, away from Prince William, his wife and children, and other working royals.",
        "The two-hour service, pared back from his mother's in 1953, is a pivotal moment in the history of the Royal Family will balance ancient tradition and a future in the 21st century. In it Charles became the first monarch to pray publicly at a coronation - praying for grace to be 'a blessing to all... of every faith and belief', and to serve after the pattern of Christ.",
        "A special personal prayer was written for the King to reflect the 'loving service' theme of the service, and the words were inspired in part by the popular hymn I Vow To Thee My Country.He said: 'God of compassion and mercy whose son was sent not to be served but to serve, give grace that I may find in thy service perfect freedom and in that freedom knowledge of thy truth. Grant that I may be a blessing to all thy children, of every faith and belief, that together we may discover the ways of gentleness and be led into the paths of peace; through Jesus Christ our lord. Amen.'Prime Minister Rishi Sunak read The Epistle - Colossians 1: 9-17 to the congregation.Lambeth Palace said that although Mr Sunak is a Hindu, he is reading as Prime Minister so there is no issue over his personal faith during the Anglican service.Prince George and the other pages of honour were sitting behind the King in Westminster Abbey as Charles swore the Coronation Oath.George's gaze could be seen flitting about the church from his seat behind his grandfather.The prince and his fellow pages then stood behind the kneeling Charles, holding the corners of his trailing robe, as he prayed.",
        "The King then signed copies of the Oaths, presented by the Lord Chamberlain, while the choir sang.At the beginning of the service, a Welsh language piece was sung with the choir, together with Sir Bryn Terfel singing Kyrie Eleison.As the bells of Westminster Abbey rang out, the King and Queen left the carriage. Camilla got out first followed by Charles after a short pause outside the church.The King waved and spoke to his grandson Prince George, a future king, who was among the pages of honour. His parents the Prince and Princess of Wales entered the abbey last before the royal couple arrived.As he arrived for the two-hour service, the Abbey's bells peeled as crowds stood in the rain cheering the arrival of the King and his wife. The entered the Abbey to state trumpeters, with the congregation standing as the royal couple entered."
    ]
}