{
    "articleURL": "/news/article-12045255/Models-popular-LG-Smart-TV-product-recalled-Australia-major-powerboard-fault.html",
    "content": [
        "LG Smart TV issue urgent recall15 models could do 'serious injury'Fire and electric shock risksMore than 10 models of a popular LG Smart TV have been recalled over fears that one of the unit's components could fail and 'cause a flame', presenting electric shock risks.",
        "Sold at major electronic retailers both nationally and online, the 15 affected models include some 65-inch and 77-inch TVs manufactured between February 2016 and September 2019.These units were sold at Harvey Norman, The Good Guys, JB Hi-Fi, Bing Lee, Betta and NARTA.Product Safety Australia (PSA) told consumers that the risk of serious injury was caused by a fault with the X capacitors in the power board.'(It) can deteriorate and may fail unsafely at the rear of the TV which can cause a flame and exit smoke,' it said.",
        "'Risk of serious injury or electric shock and risk of smoke inhalation or flame to occur.'Consumers have also been urged to refrain from using liquid to try to extinguish smoke or fire in instances where this may occur due to the risk of electric shock and serious injury.'(Instead), immediately leave the vicinity of the TV and turn the main power to the property off,' PSA said.An LG Electronics spokesperson told NCA NewsWire that the company had been conducting 'a thorough investigation into the affected models'.'(We are) now conducting a voluntary recall encouraging remaining customers to contact us to replace the power board in selected television models ... to prevent a possible issue whereby the power board could overheat and fail,' the spokesperson said.",
        "'The issue is isolated to one component and other parts of the television are not affected ... as LG Electronics uses fire-retardant materials that meet international safety standards for TV products, any overheating is extremely unlikely to lead to fire but could in extreme cases pose a potential electrical or smoke hazard.'Anyone in possession of an affected unit has been asked to contact LG Electronics Australia on 1800 643 156, whereby a technician can be organised to replace the power board free of charge.LG said it was 'confident' that replacing the power board would prevent the problem from occurring.In cases of 'irreparable damage', the TV will be replaced free of charge.",
        "o 65E6 (2016)o 65G6 (2016)o 77G6 (2016)o 65B7 (2017)o 65C7 (2017)o 65E7 (2017)o 65G7 (2017)o 65W7 (2017)o 77W7 (2017)o 65W8 (2018)o 77C8 (2018)o 77W8 (2018)o 65W9 (2019)o 77C9 (2019)o 77W9 (2019)"
    ]
}