{
    "articleURL": "/wires/ap/article-12038775/Vasilevskiy-says-struggled-heavy-workload.html",
    "content": [
        "TAMPA, Fla. (AP) - Andrei Vasilevskiy doesn't know if the heavy workload over the past four seasons is to blame.",
        "But the two-time Stanley Cup-winning Tampa Bay Lightning goaltender feels as if his body let him down in the second half of the season.And he believes he knows why.\"My mistake was that I didn´t really pay attention to my recovery,\" Vasilevskiy said on Tuesday, three days after Tampa Bay was eliminated by Toronto in a first-round playoff series.\"The first 30, 35 games, I felt as usual but then me and my body weren´t on the same page, I guess,\" Vasilevskiy added. \"All those small injuries came out at the same time. Good lessons, another experience. This season really showed me that I have to be smart about it. So, if I want to be a workhorse I have to recover well.\"Vasilevskiy started 71 playoff games as Tampa Bay won the Cup in 2020 and '21, earning playoff MVP honors the second time, before losing to Colorado in last season's final. He went 34-22-4 in 60 regular-season games this season, but lost 12 of his final 20 outings.",
        "He has played more hockey since the bubble playoffs began in August 2020 than anyone else in the NHL: 14,769 minutes over 242 games in the regular season and playoffs. The next-closest over that time is Winnipeg's Connor Hellebuyck at just under 11,372 minutes over 192 games.",
        "\"We´ll find out next year if it was too many games or just something else,\" Vasilevskiy said.Vasilevskiy's goal-against-average of 2.65 and .915 save percentage during the regular season were his worst since the 2015-16 season.However, the Lightning have been impacted by salary-cap related player losses over the past couple of seasons, including standout defenseman Ryan McDonagh and winger Ondrej Palat.\"At some point will it take a toll? I'm sure it does,\" Lightning coach Jon Cooper said of Vasilevskiy's heavy workload. \"So, he's probably being a little harder on himself. You take a few months off, his body will heal. He's still a young man, keeps himself in terrific shape but the mind's got to heal and I think that will be probably be the best part there.\"Vasilevskiy, 28, plans to rest for the next five to seven weeks.\"More opportunity to prepare your mind and body for the next season properly,\" Vasilevskiy said. \"Something we didn´t have the last few years. I don´t normally like to take too much time off, but at the same time I understand that it´s something I need right now. Be smart next season about it, and what I have to change during the offseason, during the season just to stay more fresh.\"",
        "INJURIESTampa Bay general manager Julien BriseBois confirmed that defenseman Erik Cernak has a concussion stemming from a check to the head by Toronto's Michael Bunting in the series opener that prompted a three-game suspension.Lightning defenseman Victor Hedman sat out Game 2 against the Maple Leafs with a hip impingement.Center Brayden Point played with a rib cage cartilage fracture after a hit by defenseman Morgan Rielly in Game 3.OFFSEASON DECISIONSCaptain Steven Stamkos will be entering the final year of his contract next season and talks about an extension will begin this summer.Left winger Alex Killorn is an unrestricted free agent and might be the next salary-cap related departure. He has played 11 years for Tampa Bay.Forward Corey Perry, who turns 38 on May 16, plans to keep playing. The unrestricted free agent has 417 goals in an 18-year career.___AP NHL: https://apnews.com/hub/NHL and https://twitter.com/AP_Sports"
    ]
}