{
    "articleURL": "/tvshowbiz/liberty-poole/article-12059527/EXC-Love-Islands-Liberty-Poole-admits-toxic-habit-left-unable-recognise-herself.html",
    "content": [
        "Love Island star Liberty Poole has admitted to having a 'toxic habit' before entering the dating show in 2021.",
        "The reality personality, 23, who appeared on series seven, revealed she felt the need to edit her photos - despite being a size 6/8 - to the point where she no longer recognised herself.In an exclusive interview with MailOnline during Shein's summer pool party, Liberty candidly admitted to struggling with body dysmorphia in the past.She explained: 'These days on social media we need to be more real. As a young girl I really suffered with comparing myself to other girls on social media. 'I went through a period where I struggle with low self-esteem. I never felt good enough or pretty enough.'",
        "Speaking about her life before appearing on the ITV2 dating show, Liberty said: 'I look back on my old photos and I now realise how much I used to edit my waist and my face, it didn't look like me. 'When I saw myself on TV and then my photos, it was like I had body dysmorphia. I got into editing my photos where it didn't look like me anymore. 'I used to be a size 6-8 before going on the show, it was the skinniest I'd ever been in my life, but I still edited my waist to be smaller. I didn't even look normal!'The influencer added: 'So even though I've put on weight since leaving the villa, I'm just embracing it instead of trying to change it because it is a really toxic habit to get into and I don't want to promote that.'",
        "Liberty recently confessed she was 'tempted' to edit a bikini snap to 'lift her natural boobs and shrink her bloating', but then decided she wanted to show off her normal body and squash beauty standards.She said: 'Still to this day I feel like I stand out and I'm a bit different, but I want to encourage girls to embrace themselves and be a positive role model on social media.' Liberty has previously detailed the horrific trolling she receives on a regular basis, including one instance where she was told she has a 'big tummy'. Last year, she was verbally abused by a 'group of lads' who called her a 'catfish' while makeup and fake tan free at the airport.She explained: 'For me, I've never let online comments affect me. I'll read it and forget about it five seconds after because if someone feels they have to comment on you they have nothing better to do or they aren't happy with themselves. 'What I struggle with is the the in-person comments, like I had a bad incident at the airport where someone told me I'd went downhill since the show. 'I don't relate to celebs having to always look glam, we are normal people who can go out without makeup on. So I never let anything affect me permanently, I think it is a bit s**t and then I try turn it into a positive.'",
        "Liberty rose to fame on Love Island's seventh series in 2021, where she was lauded by viewers for recognising her self-worth when she ended her relationship with then boyfriend Jake Cornish and left the villa just days before the final.Following Liberty and Jake's break-up, rumours began to swirl back in September 2021 that she was dating fellow-islander Brad McClelland.Liberty was also linked with reality TV heartthrob Joey Essex after fans spotted them hanging out at an influencer event together. The public eye is a tricky place to navigate a relationship, as Liberty explained: 'I've found it really hard. I've dated a couple of times since leaving the villa. 'I was dating this one guy and I said let's keep this on the low as I had been through a big public break-up, but after two weeks him or his friends leaked that we were dating to the press. I felt completely used for his own ego and he didn't respect my privacy.'When I'm dating someone, I'd rather they don't know who I am. But it in inevitable that they find out but for me it is how they react after as I'm a pretty good judge of character. 'I can honestly say I haven't changed since leaving the villa, I'm the same girl and I just want to be seen for me but since being on the show dating has been so difficult.'",
        "The Brummie beauty added: 'I've never ever been one to use dating apps, even before Love Island. 'I believe in old school romance and I'm a strong believer in everything happens for a reason.'",
        "Liberty now boasts 1.4 million followers on Instagram and often works with big brands such as Shein and Steve Madden.The former Dancing On Ice star revealed the most famous account to slide into her DM's was The Playboy Mansion.She explained: 'They messaged me asking if I want to be on their platform which is amazing! I don't judge people who promote their body in that way, sexuality should be owned and empowered, but for me OnlyFans is just not something I would ever do.'So I wouldn't do something similar. I don't judge people who do it but it isn't my vibe so I didn't actually reply but it was a honour to be approached by them.'",
        "Body dysmorphic disorder (BDD), or body dysmorphia, is a mental health condition where a person spends a lot of time worrying about flaws in their appearance. These flaws are often unnoticeable to others.People of any age can have BDD, but it is most common in teenagers and young adults. It affects both men and women.Having BDD does not mean you are vain or self-obsessed. It can be very upsetting and have a big impact on your life.Symptoms of BDDYou might have BDD if you:worry a lot about a specific area of your body (particularly your face)spend a lot of time comparing your looks with other people'slook at yourself in mirrors a lot or avoid mirrors altogethergo to a lot of effort to conceal flaws – for example, by spending a long time combing your hair, applying make-up or choosing clothespick at your skin to make it 'smooth'BDD can seriously affect your daily life, including your work, social life and relationships. BDD can also lead to depression, self-harm and even thoughts of suicide. You should visit your GP if you think you might have BDD. If you have relatively mild symptoms of BDD you should be referred for a type of talking therapy called cognitive behavioural therapy (CBT), which you have either on your own or in a groupIf you have moderate symptoms of BDD you should be offered either CBT or a type of antidepressant medication called a selective serotonin reuptake inhibitor (SSRI)If you have more severe symptoms of BDD, or other treatments don't work, you should be offered CBT together with an SSRI.Source: NHS"
    ]
}