{
    "articleURL": "/news/article-12038527/Wrexham-AFC-owners-Ryan-Reynolds-Rob-McElhenney-join-open-parade-Blake-Lively.html",
    "content": [
        "Club held an open-top bus victory parade today for thousands of Wrexham fansWrexham AFC has gained global appeal since the Hollywood actors took overWrexham AFC owners Rob McElhenney and Ryan Reynolds smiled and waved at adoring football fans as the club embarked on its victory tour through the city yesterday. ",
        "Thousands of fans lined the streets of Wrexham in celebration of the club winning the National League with a record total of 111 points and being promoted to the fourth division of English football.The celebrity owners will reportedly jet the team off to Las Vegas as a reward. Reynolds and McElhenney were at the Racecourse Ground to join the celebrations when promotion was clinched with a 3-1 win over Boreham Wood last month. Wrexham said today's parade was also to celebrate the achievements of their women's team, who achieved promotion to Adran Premier, the highest level of league competition for the women's game in Wales. ",
        "Wrexham went head-to-head with their rivals Notts County last month and all but won the league after beating Luke Williams' side 3-2 thanks to Ben Foster's heroics in goal.Yesterday, thousands of fans lined the streets to catch a glimpse of Phil Parkinson's men and the club's Hollywood owners. It is believed some even travelled from New Zealand and the USA. Reynolds and McElhenney were spotted waving to the crowd while on the women's team bus as they celebrated their promotion. Queen's song 'We are the Champions' blared out of the speaker on the bus as they made their way along the 3.5-mile route. While supporters let off red flares to create an even greater atmosphere for the parade. ",
        "Fans said that what Reynolds and McElhenney have done for their club 'means everything' as they celebrated promotion to the English Football League.Long-time supporter Jason Jones said that the work of the two 'big names' was 'surreal'.'Fifteen years of non-league football that at times has been really depressing, it's been dreadful,' he said. 'But the two big names came in, they bought us and this is what they've done ... it's surreal, to be honest.'It's a once-in-a-lifetime [thing] – for A-list celebrities to come in and do this. It just wouldn't work with anybody else, would it?'When these guys came in we knew something special was going to happen, and it has.'",
        "Ahead of the parade, Wrexham AFC chief executive Fleur Robinson said: 'It's been a huge effort by everybody, on the pitch and off it, and this is a great opportunity for us to thank the community of Wrexham for their incredible support.'We are looking forward to commemorating a truly memorable and record-breaking season together.'Nigel Williams, Wrexham Council's lead member for economy and regeneration, said: 'I'm sure that people will be out in large numbers to show their support for both successful Wrexham champion teams, it will be a fantastic momentous occasion for Wrexham.'I would encourage everyone attending to spread themselves out along the entire route to get a good view of the parade.'",
        "The club, which was down on its luck before the takeover by Reynolds and McElhenney, has gone on to earn global interest.The documentary 'Welcome to Wrexham' was streamed around the world and has made household names of players such as Paul Mullin and the manager Parkinson.The club also attracted the attention of US tourists in Wales, with celebrities such as Will Ferrell and Hugh Jackman also turning up at games to show their support. But the drama on the field has demanded attention, with Wrexham involved in some thrilling matches on the way to promotion, including a 3-2 win over its rival Notts County last month.Wrexham has announced it will play the LA Galaxy II at Dignity Health Sports Park on July 22 as part of a summer tour in the United States. Games against Premier League teams Manchester United and Chelsea have also been scheduled."
    ]
}