{
    "articleURL": "/tvshowbiz/article-12048147/Billie-Lourd-honors-late-mom-Carrie-Fisher-Hollywood-Walk-Fame-star-unveiling.html",
    "content": [
        "Billie Lourd sported a dress featuring her mother's most iconic role as she participated in an emotional celebration of Carrie Fisher's life and career on Thursday with the unveiling of the late Star Wars actress' star on the Hollywood Walk of Fame.",
        "The 30-year-old Booksmart actress was joined at the unveiling by Carrie's longtime friend and Star Wars costar Mark Hamill, 71, who looked nearly as excited as Billie.The event was perfectly timed to honor Fisher — who died on December 27, 2016, at just 60 — as the event took place on Star Wars Day, the informal holiday on May 4, which happens to sound a bit like the famous phrase, 'May the Force be with you.'Lourd was emotional as she delivered a speech honoring her late mother's enduring legacy at the ceremony in Southern California.A teary Lourd said she was grateful her two young children with Austen Rydell, 30 - son Kingston Fisher, two and daughter Jackson Joanne, four months - would be able to see their late grandmother in the iconic film series.",
        "'I feel so lucky that even though they won't get to meet my mom, they will get to know a piece of her through Leia,' Lourd said, according to People. 'And I will get to tell them that the little lady in the TV is my momby, their grandmomby. Leia has become a family heirloom, and not just for my family.'She added of the Walk of Fame honors, 'I can't wait to bring my kids here when they're old enough to understand how cool it is.'",
        "In addition to crowds of adoring fans, the event was also populated by top-notch C-3PO and R2-D2 stand-ins.Billie looked as if nothing could spoil the day for her, even though she didn't invite her late mother's siblings after she accused them of 'capitalizing on her' death for fame and money.Billie put on a busty display in her dress, which featured a black top with a plunging neckline and a cutout just below her cleavage.The dark material was enlivened with silver sequins, while the dress' skirt featured a scene of Carrie from the original 1977 Star Wars, which was retroactively titled Star Wars: Episode IV — A New Hope. Her mother was featured in Princess Leia's most iconic outfit, with a billowing white dress and her iconic side buns.Billie paired the look with a set of open-toe heels, and she accessorized with dangling diamond earrings while adding tear drop–shaped sparkles just below her eyes. She wore her long blond hair swept back and tied into two pigtails. Earlier, she donned a tasteful gray trench coat, though she ditched it as things warmed up. ",
        "Joining the rising star was her father Bryan Lourd, co-chairman of the high-profile talent agency Creative Artists Agency (CAA). He was married to Carrie from 1991–1994, before they divorced and he came out as gay. Bryan posed with his daughter in a tasteful tan suit with brown leather shoes. ",
        "Billie also showcased her infectious grin while posing with the director J.J. Abrams, who helmed 2015's The Force Awakens and 2019's The Rise Of Skywalker, both of which Billie was featured in. Abrams wore a gray–blue suit with a tie-free blue shirt.Mark Hamill more a cool black leather motorcycle jacket with a blue polo shirt, dark pants and black leather boots, along with stylish browline glasses.He was joined by his wife Marilou York, who wore an elegant pale blue tweed jacket and a lacy white ensembleMark was among the speakers honoring Carrie at the event.During his speech, he recounted the first time he came face to face with the Postcards From The Edge screenwriter, whom he met when she was 19 and he was 24.'Every expectation I had was just obliterated,' he gushed about the encounter, via NPR. 'She was so charming, so funny, so adorable, so wise beyond her years, I just couldn't believe it. And brutally frank!'",
        "He admitted that it wasn't always smooth sailing with the actress — who led a multifaceted career as an in-demand script doctor, a novelist, and a one-woman stage show performer — though he wouldn't have changed a thing. 'She played such a crucial role in my personal and professional life and both would have been far emptier without her. Was she a handful? Was she high-maintenance? No doubt! But everything would have been drabber and less interesting if she hadn’t been the friend that she was,' he said. ",
        "When it was Billie's turn to sing her mother's praises, she recounted her unsuccessful first introduction to the Star Wars saga. She recalled complaining, 'It's too loud, mama,' and she asked her mother, 'Is that lady in the TV you?'It wasn't until she was old enough for middle school that she was suddenly swamped by classmates who were in awe of her famous mother.'That day I realized, staring at the screen, that no one will be as hot or cool as Princess Leia,' Billie said.'Leia is more than just a character. She’s a feeling. She is strength. She is grace. She is wit. She is femininity at its finest. She knows what she wants and gets it. She doesn’t need anyone to rescue her because she rescues herself and even rescues the rescuers. And no one could have played her like my mother,' she added.Elsewhere in her speech she opined on her mother's solid place in popular culture.'My mom used to say you weren’t actually famous until you became a Pez dispenser. Well, people eat candy out of her neck every day,' she joked, according to the Associated Press. 'I say you aren’t actually famous until you get a star on the Hollywood Walk of Fame,' she added. 'My mom is a double-whammy — a Pez dispenser and has a star on the Hollywood Walk of Fame now. Mama, you’ve made it.' ",
        "Posing with Billie at the ceremony was the Los Angeles City Council member Hugo Soto-Martinez, who presented her with a framed proclamation congratulating her late mother for her varied career and her new Hollywood Walk of Fame star.The radio host Ellen K. was also featured as one of the speakers praising the Hannah And Her Sisters actress.Missing from the ceremony were Carrie's siblings, and Billie previously confirmed to DailyMail.com that she did not invite them to the unveiling.",
        "Carrie's brother Todd and half-sisters Joely and Tricia expressed their outrage about not getting invites. In her statement, Billie claimed that they had 'capitalized on her mother's death,' and she said their actions after her death had 'hurt her deeply.'However, she coldly clarified that 'there is no feud' between her and her uncle and aunts as they 'have no relationship' to speak of.Todd later claimed in a statement to The Wrap that he had no idea why Billie had not invited him, and he bemoaned that the family 'could we not stand together for a moment, set aside our differences, and celebrate Carrie Fisher's legacy in the way she deserves and the way she would have wanted.'"
    ]
}