{
    "articleURL": "/news/article-12050013/William-Harold-Matheson-walk-free-murdering-ex-Lyndsay-van-Blanken-Sydneys-east.html",
    "content": [
        "William Harold Matheson to walk free from jailServed 19 years for murdering Lyndsay van Blanken in 2003A man who strangled his ex-girlfriend with cable ties before stuffing her body in a cricket bag and dumping it in a unit block garage will soon be released from prison, against the wishes of his victim's family.",
        "William Harold Matheson will walk free after serving almost 19 years for the 2003 murder of Lyndsay van Blanken.Her decomposing remains were found in January 2004 about six weeks after she went missing from Sydney's eastern suburbs.She was seen arguing with Matheson at Bondi Junction train station on November 24, and wasn't seen again until her body was discovered inside a Queens Park unit block after complaints by residents of a foul smell.",
        "The then 18-year old had recently become engaged to another man after breaking off her relationship with Matheson, who she met when he performed two years earlier at her mother's wedding.The skilled cellist was described as controlling and when the relationship ended he became obsessed and started stalking Ms van Blanken, with police saying he eventually killed her in a jealous rage.He was convicted of the murder and sentenced to 25 years jail in 2006 with a non-parole period of 18 years.The State Parole Authority said in a statement on Friday Matheson had been granted parole, after it accepted the advice and recommendations of the Serious Offenders Review Council and Community Corrections.The authority said Matheson must be released anytime between May 26 and no later then June 9.He will face strict parole conditions including having to wear an electronic ankle bracelet and to avoid certain areas of the state, including Nambucca Shire, Hills Shire and Coffs Harbour.",
        "He is banned from any form of contact with the victim's family and must continue to comply with psychiatric medication and treatment.",
        "Matheson had an initial parole application denied last year but has now been designated as being at low risk of reoffending.Ms van Blanken's mother Cynthia told Channel 9 she believed if Matheson was released he would kill again.'He's actually served the equivalent of my daughter's age, which isn't fair,' she told host Ally Langdon earlier this week.'Matheson brutally killed my youngest daughter purely because he didn't get his own way.'In granting parole, James Wood KC, who chaired the panel of five members, said to refuse or defer parole would risk increasing Matheson's possibility of becoming institutionalised.'Release at the end of sentence or deferral of release without the opportunity of undertaking a sufficient period of support and supervision on parole ...particularly in a case such as this ... is likely to be counterproductive,' he said.'The authority acknowledged the concerns of the van Blanken family and friends and extended its deepest condolences for the devastating loss of Lyndsay.'Matheson will be monitored 24/7 by corrections and will have to submit to ongoing long-acting injectable medication and psychiatric treatment."
    ]
}