{
    "articleURL": "/wires/reuters/article-12055399/Soccer-Rodrygo-double-fires-Real-Madrid-Spanish-Cup-final-win-Osasuna.html",
    "content": [
        "SEVILLA, Spain, May 6 (Reuters) - Rodrygo struck twice and Vinicius Jr dazzled as Real Madrid beat Osasuna 2-1 on Saturday to win their 20th Copa del Rey title and first since 2014.",
        "Brazilian Rodrygo scored the opener after two minutes but Carlo Ancelotti's side were pegged back when Lucas Torro equalised 13 minutes after the break.Rodrygo, however, tapped in a loose ball in the 70th minute to claim a much needed win for Real and a confidence boost after a run of poor results as they prepare to host Manchester City in their Champions League semi-final first leg on Tuesday.Real have lost two of the last three games and are virtually out of contention in LaLiga, sitting 14 points behind leaders Barcelona.Yet against Osasuna, they were dominant thanks to a brilliant performance by Vinicius, who was virtually unstoppable down the left channel and was involved in the build up to both Rodrygo's goals with superb individual runs.Rodrygo scored the opener with a tidy finish through a forest of legs after Vinicius dribbled past several defenders on the left wing and delivered a perfect cross with the outside of his boot.Real had almost 65 percent of the possession and Vinicius created several opportunities that his team mates failed to make the most of it.Rodrygo missed a sitter half an hour into the game after another Vinicius run and Osasuna almost scored on the counter attack through Abde, but a desperate Dani Carvajal managed to clear the ball off the goalline.",
        "A little later, David Alaba hit the crossbar with a free kick and Vinicius almost scored himself with a curling shot from the edge of the box that went just wide.Real, however, took their foot off the gas in the second half and allowed Osasuna to level with Torro finding the net with a low shot from the edge of the penalty area.Rodrygo, however, scored the winner when he finished from close range after Vinicius's run and cross found Toni Kroos whose shot was deflected off a defender before ending up at the feet of Rodrygo at the far post.\"I'm very happy because I have just won the only title I didn't have with Real Madrid at only 22 years old. It's an amazing feeling,\" Rodrygo told Movistar Plus.\"We were talking this week about how long it has been since Real Madrid have not won this competition and I, personally, was missing it too. I scored two goals... it was a very special night for me.\" (Reporting by Fernando Kallas in Madrid Editing by Toby Davis)"
    ]
}