{
    "articleURL": "/news/article-12039615/Meet-McDonalds-septuagenarian-employee-Wallsend-NSW.html",
    "content": [
        "Retiree joined Maccas six years ago Local legend among staff and customersHopes to inspire other older Aussies An Aussie senior citizen has ditched retirement to take up a job at McDonald's.",
        "Former disability sector worker Daryl Holmes, 72, spent one day in retirement before realising he had too much spare time on his hands and wasn't ready to put his feet up just yet.He applied for a job at Wallsend McDonald's in Newcastle, north of Sydney, where he's become a local legend much-loved by customers and colleagues.The customer experience leader greets customers and assists them in using the self-serve kiosks before going the extra mile to bring their food to their tables and ensuring they're looked after.",
        "'I've been playing golf all my life and for me, I've always loved to work,' Mr Holmes told 2GB's Chris O'Keefe.'My wife was still working and had several more years to work so I wasn't going to sit back.'I was going to go out and find something that I could actually apply myself to and enjoy it at the same time.'Despite undergoing two knee operations, he's now been at McDonald's for six years and is one of the fast food chain's oldest Australian employees.Mr Holmes enjoys passing on his life knowledge and being a grandfather figure to younger colleagues.'I just talk about the importance of enjoying what you do, learning from it and making sure they've got someone when times are tough to talk to,' he explained.",
        "'I'm just like their grandfather.'",
        "He was also asked if they offered him advice of their own.'Not what I repeat on radio,' Mr Holmes laughed.'I work with some amazing young people. The kids we have are unbelievable, it's a real privilege to work with them.'The one thing I keep saying to them is 'I can't do my job successfully if you're not doing yours successfully. 'It's about building teamwork. If something's not right, nobody's going to get into trouble, we've just got to fix it so the customer is the prime focus of what we do.' Another favourite part of the job is McDonald's annual Monopoly promotion, where Mr Holmes dons a moustache, top hat and bowtie to play board game mascot Rich Uncle Pennybags in-store.",
        "Mr Holmes hasn't ruled out working at McDonald's until he's in his 80s.He encourages fellow older Aussies who may be thinking about coming out of retirement.'There's a lot of work out there,' he said.'Employers want to know what you can do, not what you can't. If you can say to people \"I can do this,' you have a very good chance of selling yourself.'"
    ]
}