{
    "articleURL": "/wires/reuters/article-12042545/US-STOCKS-Wall-St-gains-ahead-Fed-meeting-outcome.html",
    "content": [
        "Private payrolls rise by 296,000 jobs in April",
        "Federal Reserve decision at 2 p.m. ETEli Lilly up as its Alzheimer's drug succeeds in studyAMD slumps after weak forecastIndexes up: Dow 0.10%, S&amp;amp;P 0.29%, Nasdaq 0.40%(Updates prices to open; adds details on services sector activity in paragraph 9)By Ankika Biswas and Sruthi ShankarMay 3 (Reuters) - Wall Street's main indexes climbed on Wednesday after a selloff in the previous session, with investors assessing the latest economic data ahead of the outcome of a Federal Reserve policy meeting later in the day.Major U.S. stock indexes dropped over 1% on Tuesday as regional bank shares tumbled on renewed fears over the financial system and as investors tried to gauge how much longer the Fed may need to hike interest rates.PacWest Bancorp and Western Alliance Bank on Wednesday rebounded from previous session's steep falls and rose 11.6% and 6.5%, respectively, while the KBW Regional Banking index advanced 2.3%.\"There's a reasonable belief that some regional banks could be exposed to similar circumstances (the recent bank failures) given rising rates and that we're heading right into a Fed meeting in which they're continuing to raise,\" said Jason Pride, chief of investment strategy and research at Glenmede.While the Fed is widely expected to deliver a 25-basis point interest rate hike, investor focus will be on cues if further hikes are on the cards given inflation remains above the U.S. central bank's 2% target level.",
        "\"The Fed may want to deliver as little in the way of guidance as possible, keeping the door open for a pause or even an additional hike,\" Saxo Bank analysts said.Major global central banks have embarked on an aggressive interest rate hike campaign to tackle sticky inflation, with the Fed already having hiked its benchmark rates nine times by 475 basis points to a range of 4.75%-5.00% since March 2022.ADP National Employment's report showed U.S. private employers boosted hiring in April, but there were signs that the labor market was slowing amid higher interest rates.The U.S. services sector maintained a steady pace of growth in April, but higher input prices indicated inflation could remain elevated for some time.At 9:50 a.m. ET, the Dow Jones Industrial Average was up 34.45 points, or 0.10%, at 33,718.98, the S&amp;amp;P 500 was up 11.76 points, or 0.29%, at 4,131.34, and the Nasdaq Composite was up 48.15 points, or 0.40%, at 12,128.66.Analysts expect quarterly earnings for S&amp;amp;P 500 companies to decline 1.4% from a year earlier, according to IBES data from Refinitiv, compared with a 5.1% drop expected at the start of April.Eli Lilly and Co gained 4.3% and hit a record high as the company's experimental Alzheimer's drug slowed cognitive decline by 35% in a closely watched late-stage trial, helping healthcare shares top sector indexes.",
        "Advanced Micro Devices slumped 8.4% after the chipmaker forecast quarterly sales below estimates due to a weak PC market, pushing rival Intel Corp up 3.1%.Estee Lauder Cos Inc slid 21.3% as the MAC lipstick maker forecast a bigger drop in full-year sales and profit.Advancing issues outnumbered decliners for a 2.11-to-1 ratio on the NYSE and a 2.25-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded 19 new 52-week highs and two new lows, while the Nasdaq recorded 30 new highs and 76 new lows.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru, Additional reporting by Amruta Khandekar; Editing by Shounak Dasgupta)"
    ]
}