{
    "articleURL": "/tvshowbiz/article-12051579/Danniella-Westbrook-shows-results-facial-reconstructon-surgery-beach.html",
    "content": [
        "Danniella Westbrook posed up a storm in a blue bikini on the beach in Portugal after 'the most frightening few days' saw her back in hospital following major facial reconstruction surgery.",
        "The former EastEnders actress, 49, had a string of procedures in Turkey last week in a desperate bid to save her collapsing face.Danniella had a thread lift, liposuction in her cheeks and lips, fat grafting on her chin and her jawline etched after her septum collapsed from excessive drug use in 2002.And the TV star is continuing her recovery in Portugal as she soaked up the sun at the beach in a blue bikini on Friday.Danniella pulled her blonde tresses up in a pink headscarf as she cooled off from the sun in the ocean. ",
        "The soap star showcased a hint of underboob as she raised her arms behind her head in the sea. Since her procedure, Danniella has been wearing thick bandages around her head and nose, but took them off last Saturday.The television personality has been shaken after a health scare saw her back in hospital, hours after landing in Portugal.Taking to her Instagram Stories on Sunday, she penned: 'Only I could land back in Portugal after surgery only to end up in hospital.'The pain I've experienced is unreal, most frightening few days. Need it like a hole in the head, literally.'When Danniella first woke up after the lengthy procedure, she said she looked 'like she had done 10 rounds with Tyson Fury'.",
        "She has wanted the reconstruction for the last seven years, but was unable to find a surgeon who would operate because her septum had completely collapse.She told The Sun: 'I was very fearful. My mum and my son Kai were on the phone constantly - I wrote up a will before I left and my son is the executor of that.",
        "'But luckily I'm still here and I've come through the other side. Someone is looking over me. I looked like I'd gone 10 rounds with Tyson Fury.'But the swelling has actually gone down really quickly. I'm already happy with the results.'Danniella says she paid for the surgery herself despite being offered freebies from clinics all over the world, after a health scare last year left her in intensive care because she struggled to breathe through her nose.Now in the recovery stage, Danniella has to just stick to ibuprofen and paracetamol, because any pain killer stronger could be a trigger for her past cocaine addiction.Danniella previously revealed she needed five operations to correct her 'collapsing' face due to a previous cocaine addiction and osteoporosis, and was planning to have it done on the NHS.She told The Sun: 'I've spent the last seven years trying to get somebody to do it, but they said no in case it failed and they got struck off.",
        "'Plastic surgeons wanted £500,000 to change my face, so I thought I was never going to get it done. It was only because I went into intensive care before Christmas.'I couldn't breathe because I had a cold. There was a build up of fluid and after I fell asleep I couldn't wake up properly and ended up in ICU.'I was sent over to Aintree Hospital in Liverpool and it's only because I was put in front of the right doctors, or else I'd still be waiting now to find someone. 'They're doing it for me under the NHS now.'Danniella previously underwent a rib insertion procedure in 2018, after osteoporosis rotted away her cheekbones and gums and, after spending the last year getting lip filler and Botox, in addition to surgery on her face, she is hoping to get back to her best.The actress' battle with drugs has been well-publicised, and she famously had her nose reconstructed after her septum collapsed from excessive cocaine use in 2002.",
        "At the height of her use it was reported she would take up to five grams of cocaine a day, blowing close to £250,000 on the drug.The star has since embarked on multiple rehab stints in order to battle her demons - and revealed she was finally clean in June 2021, after attending a clinic in Mijas, Spain.",
        "Danniella first appeared in EastEnders in 1990 at the age of 16 and acted on the soap for three years.She returned in 1996 but her time was cut short when her off-screen behaviour got her sacked.She returned again shortly after, but was axed again in 2000 after further disruptive behaviour, admitting she blew £100k on cocaine at the time.The part was recast between 2002 and 2005, and played by Kim Medcalf, but Danniella returned to the role once more in 2009 until 2010.She was back once more in 2016 for the storyline surrounding on-screen mother Peggy Mitchell's death, which is to date her final appearance."
    ]
}