{
    "articleURL": "/tvshowbiz/article-12050025/Jock-Zonfrillo-said-children-brought-euphoria-heartbreaking-interview-death.html",
    "content": [
        "Jock Zonfrillo admitted in one of his final interviews that he struggled to feel many highs in life because of his former heroin addiction.",
        "However, his children brought him a rare sense of joy, and before his death he spoke candidly about his addiction issues, and how his children put him in a 'euphoric state'. The 46-year-old MasterChef star was found dead in a Melbourne hotel on Sunday, and it is believed he died of natural causes.",
        "Zonfrillo is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.Speaking to the No Filter podcast with Mia Freedman in August 2021, Zonfrillo admitted that his head was 'fried' from his addiction to heroin.   ",
        "'As an ex-heroin addict I have cooked certain parts of my brain, so when me and Loz [his wife Lauren] go for a sunset walk and she's like \"Omg this is the best moment\" and I'm like \"it's just a sunset.\" I can't see the same beauty and joy,' he said.  'It's because you have reached such highs that a normal high isn't high anymore.'Asked if there is anything in his life that does give him a high, the Scottish chef said cooking does, but his children bring him a greater euphoric feeling.   ",
        "'Restaurants and cooking for other people, sharing, teaching is amazing,' he said.  ",
        "'But a thing that puts me in a euphoric state is my children, my eldest is 20 and my youngest is 7 months. 'On Sunday I got up and put on an old tracksuit and didn't get out of it all day. We played Lego, read books, I was on all fours going around the house as a horse and I had the best time of my life.' The 46-year-old added that having a family with his wife Lauren was 'the ultimate high' and that because he had such a special relationship with his own grandfather, he couldn't wait to be a grandfather too one day.   'I have had two failed marriages and I had this weird thing where I wanted to be a nono, a grandfather,' he said.",
        "'It was weird because I hadn't even had kids yet.' Channel 10 postponed the launch of its 15th series of MasterChef Australia after learning of the judge's death, and announced on Wednesday that it will premiere this Sunday, with the full support of the chef's grieving family.Production wrapped on the 62-episode season at MasterChef HQ in Flemington, Melbourne, last month.The new season reportedly cost 'millions' to make, and producers are now looking to add a special 'tribute' episode to Zonfrillo before confirming his replacement."
    ]
}