{
    "articleURL": "/tvshowbiz/article-12039085/Jon-Bon-Jovi-reacts-son-Jake-getting-engaged-Millie-Bobby-Brown-young-age.html",
    "content": [
        "Jon Bon Jovi reacted to his son Jake's whirlwind engagement with Millie Bobby Brown on Tuesday when he sat down for a radio interview with Andy Cohen. ",
        "The legendary rockstar, 61, appeared on Cohen's Radio Andy and was asked if he 'worries' about his 20-year-old son rushing into marriage with the Stranger Things star, 19.'I don't know if age matters,' declared Bon Jovi. 'If you find the right partner and you grow together, I think that would be my advice, really, is growing together is wise.'The It's My Life hitmaker has been married to his high school sweetheart Dorothea Hurley for 34 years – secretly tying the knot at the Graceland Wedding Chapel in Las Vegas in 1989.The couple share three other children – Stephanie, 29, Jesse, 28, and Romeo, 19 – and Bon Jovi revealed that three out of his four children are currently engaged.",
        "The Livin' on a Prayer singer told Cohen: 'I think that all of my kids have found the people that they think they can grow together with and we like 'em all.'Jake popped the question last month and presented the Enola Holmes star with a dazzling rock estimated to be worth $75,000 to $150,000. The pair announced their engagement via Instagram, posting a monochrome picture of Jake embracing his new fiancee from behind as she showed off her impressive diamond. Captioning the photo, Millie wrote: 'I've loved you three summers now, honey, I want 'em all.'",
        "Jake also posted an announcement to his own Instagram account – where his bio reads 'actor/producer/all around cool guy' – simply writing 'forever' alongside two snaps of the couple.Millie has shared that the pair's nearly three-year romance began over Instagram – becoming friends through the platform before their romance was sparked.Answering the internet's most searched questions about her, Brown said: 'We met on Instagram. And we were friends for a bit, and then, what can I say?'The British actress introduced Jake to her 63.4M followers in June 2021 with a cute photo, but it wasn't until she posted a picture of him planting a kiss on her cheek that they were 'Instagram official.'",
        "Jake wished Millie happy birthday in February by posting a collection of romantic photos and penning a very sweet caption.'Another year around the sun together,' he wrote. 'Happy 19th to the girl of my dreams. I love you more than words can describe. Everything about you is golden down to the core.'And prior to their engagement, the young lovebirds rang in the New Year together with Millie's beloved family of animals. Captioning a slideshow on Instagram, she wrote: 'Endlessly in love with the year I've had! Grateful for my friends, family, donkey (Bernard), my doggies, my puppies teeth, and my partner for life. Here's to another year with you and the wonderful people and animals around us. Let's do it again but better!'"
    ]
}