{
    "articleURL": "/wires/reuters/article-12045173/WHO-experts-weigh-world-ready-end-COVID-emergency.html",
    "content": [
        "By Jennifer Rigby and Emma Farge",
        "LONDON, May 4 (Reuters) - A panel of global health experts will meet on Thursday to decide if COVID-19 is still an emergency under the World Health Organization's rules, a status that helps maintain international focus on the pandemic.The WHO first gave COVID its highest level of alert on January 30 2020, and the panel has continued to apply the label ever since, at meetings held every three months.However, a number of countries have recently begun lifting their domestic states of emergency, such as the United States. WHO Director-General Dr Tedros Adhanom Ghebreyesus has said he hopes to end the international emergency this year.There is no consensus yet on which way the panel may rule, advisors to the WHO and external experts told Reuters.\"It is possible that the emergency may end, but it is critical to communicate that COVID remains a complex public health challenge,\" said Professor Marion Koopmans, a Dutch virologist who is on the WHO panel. She declined to speculate further ahead of the discussions, which are confidential.One source close to negotiations said lifting the \"public health emergency of international concern\", or PHEIC, label could impact global funding or collaboration efforts. Another said that the unpredictability of the virus made it hard to call at this stage.",
        "\"We are not out of the pandemic but we have reached a different stage,\" said Professor Salim Abdool Karim, a leading COVID expert who previously advised the South African government on its response. Karim, who is not on the WHO panel, said if the emergency status is lifted, governments should still maintain testing, vaccination and treatment programmes.Others said it was time to move to living with COVID as an on-going health threat, like HIV or tuberculosis.\"All emergencies must come to an end,\" said Lawrence Gostin, a law professor at Georgetown University in the United States who follows the WHO.\"I expect WHO to end the public health emergency of international concern. If WHO does not end it... [this time], then certainly the next time the emergency committee meets.\" (Reporting by Jennifer Rigby in London and Emma Farge in Geneva; Editing by Alexandra Hudson)"
    ]
}