{
    "articleURL": "/sport/cricket/article-12058217/Cricket-boss-denies-touching-mans-penis.html",
    "content": [
        "Former Cricket Australia executive accused of assaultFollows two alleged separate incidents in 2016 and 2019Timothy Joseph Whittaker, 38, has pleaded not guilty Text messages sent by a former senior Cricket Australia employee after a colleague accused him of allegedly performing a sex act on him while he was asleep have been read to a court.",
        "Timothy Joseph Whittaker, 38, took the stand at the Melbourne Magistrates' Court on Monday at his contested hearing for two allegations of inappropriate sexual touching without consent.Mr Whittaker, Cricket Australia's former head of communications who spoke for the organisation during the Cape Town ball tampering scandal in 2018, has pleaded not guilty and denies the allegations.He stands accused of touching two colleagues' penises in separate alleged incidents in January 2016 and March 2019.Both men have claimed they allegedly woke up in Mr Whittaker's bed, after nights of heavy drinking, to find him rubbing their penises.",
        "Prosecutor Sharn-Adelle Coombes read several text messages sent by Mr Whittaker to one man shortly after he left the accused man's apartment about 5.30am.She told the court Mr Whittaker texted the man at 5.36am saying; 'yo where are you?', before receiving a brief phone call in response.Minutes later he fired off more messages reading: 'You just can't ring me and say that mate'.'Sorry but what the actual f**k,' the message read.'Come up and have a drink... there's no f**king way I was doing that dude.'You can't just say that s**t and hang up.'Under cross-examination, Mr Whittaker agreed he sent those texts but said it was to 'gather more information'.",
        "'(From the phone call) I knew he was accusing me of something, but I couldn't make it out,' he said.'It was shocking....I wasn't comprehending. I wanted to follow up with him and see if we can talk about this.'He told the court he was barely awake at the time and 'processing' what was alleged, saying it was a 'dumb call' to invite the man up for a drink.Mr Whittaker told the court he did not have a sexual interest in the complainants and denied even being in bed with either man.He said in the first alleged incident, in 2016, he slept on the couch while the man and a friend took his bed, while in 2019 he slept in his bed after the alleged victim fell asleep on his couch.",
        "Earlier, the court heard the first complainant said did not report the alleged incident until 2021 because he believed Mr Whittaker was asleep and gave him the benefit of the doubt.He told human resources at Cricket Australia in December 2021 he now suspected Mr Whittaker was pretending to be asleep after hearing 'rumours' of other complaints.The second complainant told the court he had no memory of allegedly moving from Mr Whittaker's couch to his bed following an end of season Cricket Australia party in March 2019.",
        "He claimed when he woke up, Mr Whittaker allegedly rolled over and pretended to be asleep.Ms Coombes told the court there was a 'stark similarity' between the two allegations.'The complainants are unknown to each other, there's no suggestion they have spoken or have any knowledge of each other,' she said.On Monday, Magistrate Timothy Gattuso rejected a no-case submission by Mr Whittaker's barrister, Dermot Dann KC, to find his client not guilty of the first allegation.He had argued that, while the defence did not concede there was sexual touching, the prosecution had not proven Mr Whittaker was awake when the alleged act occurred.'He (the alleged victim) said he believed for years he was asleep,' Mr Dann said.'His ultimate position is, because he's heard a rumour, he's changed his mind. The defect goes to a central element of the case.'Under Victorian law, prosecutors must prove a person accused of sexual offending made a conscious, voluntary and deliberate decision to engage in the conduct.But Ms Coombes argued the evidence of the alleged victim was that Mr Whittaker allegedly had his hand down the complainant's pants and made a 'deliberate movement'.The hearing continues."
    ]
}