{
    "articleURL": "/news/article-12048235/Power-expel-migrants-two-years-Title-42-expires-Sens-Tillis-Sinema-working-fix.html",
    "content": [
        "The bill would allow agents to continue expelling migrants immediately without court hearings for two years but wouldn't rely on public health Current law allows agents to turn away migrants who claim asylum or other avenues that could give them legal status to enter for public health reasons Comes as Title 42 is expected to end next week  A bipartisan pair of senators are introducing a proposal that would temporarily replace Title 42 with a similar policy that would allow for immediate expulsion but would not be based on the Covid-era public health emergency. ",
        "The bill, being led by Sens. Tom Tillis, R-N.C., and Kyrsten Sinema, D-Ariz., would allow agents to continue expelling migrants immediately without court hearings for two years as Title 42 is set to expire next week on May 11. It is separate from a broader immigration proposal the pair have in the works. The current law allows agents to turn away migrants who claim asylum or other avenues that could give them legal status to enter for public health reasons. 'Despite our repeated calls, the Biden Administration failed to plan ahead and implement a realistic, workable plan; our legislation gives them more time to put a plan in place,' Sinema said in a statement.“The Biden Administration has failed to secure the border and the situation will get even worse once Title 42 is allowed to expire. It's clear that Congress must immediately step in,' Tillis said, adding their bill would help avoid 'the catastrophic fallout at the border.'Republicans have called on the Biden administration to find an 'adequate substitute' for Title 42 after the health emergency expires when migrants crossing the southern border into the U.S. are expected to spike between 10,000 and 13,000 per day, a border official recently told Congress. ",
        "The legislation would need 60 votes to push it through the Senate and is unlikely to pass before the Covid-era health policy expires. ",
        "Next week the House is expected to vote on its own immigration and border security plan.  On Tuesday members of the Senate Judiciary and Senate Minority Leader Mitch McConnell signed on to a letter calling on the Biden administration to extend Title 42.  There is a rapidly forming migrant caravan in Mexico, and some have estimated that there are as many as 35,000 asylum seekers waiting to cross over into the interior of the U.S. after May 11.The number of migrants apprehended at the border in March jumped 25 percent over the previous month to 162,000.New data from April reveals that there were 210,000 illegal migrant encounters. The total over the 2023 fiscal year so far is at 1.4 million.The administration has said it is preparing to encounter nearly 400,000 migrants each month after Title 42 ends, a huge figure that makes it difficult for border patrol to contain the surge into the interior of the country.",
        "Border agents say they have intercepted over 73,000 illegal immigrants in the past 10 days alone. The Biden administration announced Tuesday it will send 1,500 troops to the southern border by May 10, ahead of Title 42's termination - a move Republicans are branding as 'ridiculous political theatre.'At the request of the Department of Homeland Security, the agency will 'provide a temporary increase of an additional 1,500 military personnel, for 90 days, to supplement CBP efforts at the border.' ",
        "The Defense Department will deploy the troops for about three months to help out U.S. Custom and Border Patrol agents, but will not be engaged in active 'law enforcement' work. "
    ]
}