{
    "articleURL": "/wires/reuters/article-12042499/EU-envoys-seal-deal-joint-ammunition-buying-Ukraine.html",
    "content": [
        "By Andrew Gray",
        "BRUSSELS, May 3 (Reuters) - The European Union moved ahead on Wednesday with plans to buy urgently needed artillery shells for Ukraine as well as ramping up the bloc's ability to produce munitions.Ambassadors from EU countries agreed details of a 1 billion euro ($1.1 billion) scheme to jointly buy ammunition for Ukraine after weeks of wrangling that had frustrated leaders in Kyiv.Meanwhile, the European Commission, the EU's executive, launched a plan to use more than 500 million euros to help European arms firms boost capacity by upgrading equipment, opening production lines and training staff.\"We stand by our promise to support Ukraine and its people, for as long as it takes. But Ukraine´s brave soldiers need sufficient military equipment to defend their country,\" European Commission President Ursula von der Leyen said.Artillery rounds, particularly 155mm shells, have become critical to the conflict as Ukrainian and Russian forces wage an intense war of attrition. Officials say Kyiv is burning through more rounds than its allies can currently produce.Wednesday's EU moves are part of a three-track plan agreed by foreign ministers in March with the aim of delivering 1 million shells and missiles to Ukraine within 12 months.The first track sets aside 1 billion euros to reimburse EU countries for sending munitions from existing stocks.",
        "That has only yielded about 40,000 shells so far, according to officials, underlining the importance of the other tracks.The second track is the joint purchase scheme - a landmark step for the EU, as defence procurement has largely been the preserve of national governments acting on their own.But the scheme could not be finalised for weeks while governments argued over eligibility rules.EUROPEAN PRODUCTIONMinisters had already agreed to limit the scheme to firms from the EU and Norway. But diplomats said France - a champion of a stronger EU defence sector, with a substantial arms industry of its own - insisted production itself should take place in Europe.That stance frustrated other EU members, including eastern and Baltic countries, Germany and the Netherlands, who argued European firms would need at least some components from outside the EU to make enough shells on time.Details of Wednesday's compromise were not immediately available. But diplomats said they had been working on a text stating that European production has priority but some components from further afield may be needed.The deal clears the way for the signing of contracts, which officials have said they aim to conclude by the end of May.The third track is the programme launched on Wednesday, aiming to ramp up capacity so EU countries can provide more munitions to Ukraine and replenish their own stocks.",
        "\"For the EU, this is really breaking new ground,\" said Camille Grand, a defence specialist at the European Council on Foreign Relations think tank.Grand said the European Commission deserved credit for trying to find new ways to boost the defence industry. But he said it was an open question whether 500 million euros would have a major impact.Companies will also need to be confident they will get enough orders for years to justify investments to increase capacity, said Grand, who was previously a senior NATO official.He said NATO could play a role in reassuring industry as it plans to set new guidelines for ammunition stockpiles that are likely to be more ambitious than the previous ones.The Commission aims to get approval from EU governments and the European Parliament for its proposal by mid-July. ($1 = 0.9065 euro) (Reporting by Andrew Gray; Editing by Andrew Cawthorne and Jonathan Oatis)"
    ]
}