{
    "articleURL": "/wires/reuters/article-12051801/Fed-data-flow-June-meeting-opens-jobs-gusher.html",
    "content": [
        "By Ann Saphir and Howard Schneider",
        "May 5 (Reuters) -A critical flow of data heading to the Federal Reserve's June meeting, and a possible rate hike pause, began Friday with a stronger-than-anticipated jobs report showing U.S. payrolls and wage growth remain resilient.Data showing theeconomy added 253,000 jobsin April, with hourly wages growing at a 4.4% annual rate, are just the first in a series of reports, including fresh information on prices beginning next week, that the Fed will receive before the June 13-14 meeting. The report did not in itself change broadmarket expectationsthat the Fed next month will hold the policy rate steady in a 5% to 5.25% range.But it does show an economy that continues to surprise.Job growth is trending down, with three-month average payroll gains now at 222,000 versus more than half a million at the start of 2022.That \"will encourage monetary policymakers that the labor market continues to shift into a better balance,\" said Nick Bunker, head of economic research at the Indeed Hiring Lab.But the April jobs report also shows how \"sticky\" many of the economic variables the Fed is watching have become. Wage gains are moving sideways, for example, at a level central bankers feel is ultimately inconsistent with falling inflation.Fed Chair Jerome Powell this week was pointed in saying he did not think current wage increases were necessarily causing higher prices, noting the two \"tend to move together\" in ways that are hard to disentangle. Yet a productivity report this week showed output per worker falling over the first three months of the year and unit labor costs spiking.",
        "\"The labor market surprisingly remains hot and tight,\" Nationwide Chief Economist Kathy Bostjancic wrote. \"We...believe that the Fed will remain on hold for the remainder of the year, but if inflation readings surprise to the upside...then odds start to rise that the Fed might feel the need to raise rates a bit further.\"With the jobs data again undercutting evidence of a looming recession, she said the April numbers \"should reduce the market expectations of rate cuts unfolding as soon as the third quarter.\"Traders in futures tied to the Fed's policy rate did pare bets for rate cuts beginning as soon as the July meeting, yet still feel the Fed will be prompted to move from battling inflation to protecting growth with rate reductions beginning in September and continuing through the remainder of the year.The April jobs report also makes new economic projections due at the Fed's June meeting all the more consequential.The central bank does not want the job market to crash.But Fed projections in March that the unemployment rate would hit 4.5% by the end of the year now would mean a sharper decline in labor market conditions, with less time left, after the unemployment rate fell in April to 3.4% from 3.5%.Changes in the unemployment rate can be driven by different aspects of the labor market, and in this case was caused in part by a drop in the number of job seekers, with the labor force falling slightly. The number of unemployed - those out of a job but actively looking for work - declined.",
        "The Fed also will receive the May unemployment report before the next meeting, and revisions of past month's estimates, as they did this time, could make conditions appear less tight than initially thought.Yet all things equal, the updated policymaker projections in June would have to account for a tighter-than-anticipated job market, and estimate how that changes the course of inflation.It may not alter policymakers' sense of the interest rate that is \"sufficiently restrictive\" to slow inflation from a current level more than double the Fed's 2% target. Between stress in the banking industry and a possible federal debt limit crisis there are reasons to be cautious about further rate increases.But it could add to their commitment to keep rates high for even longer, with time now allowed to substitute for further rate increases.\"We have a view that inflation is going to come down not so quickly,\" Powell said at a Wednesday press conference. \"It'll take some time. And in that world, if that forecast is broadly right, it would not be appropriate to cut rates, and we won't cut rates.\"(Reporting by Howard Schneider, Ann Saphir and Lucia Mutikani; Additional reporting by Herbert Lash; Editing by Mark Heinrich, Chizu Nomiyama and Andrea Ricci)"
    ]
}