{
    "articleURL": "/news/article-12048173/MCCAIN-dont-want-celebrity-sex-lives-rammed-throat-DID-America-pornified.html",
    "content": [
        "Really Gwyneth – your vagina candle monologues are too much.",
        "Maybe her PR team thought that she needed some humanizing after 'Almond Mom' Paltrow went on a 'wellness' podcast in March and much of the civilized world recoiled.We all knew that Gwyneth did some weird stuff, but we weren't aware that her health regime included blowing ozone gas up her behind and eating 'bone broth' for lunch.Well, now she's back on the podcasts – and it's not going any better.Hey – public relations geniuses! Did you ever consider that the less we hear from Gwyneth the better?This time she appeared on the wildly popular 'Call Her Daddy' podcast with Alex Cooper. These interviews frequently get very personal, to say the least, and Paltrow did not hold back – especially when it came to sex, sex, and more sex.Without much encouragement, she spilled the beans about her intimate relations with aging Hollywood heartthrob Brad Pitt and Mr. Jennifer Lopez, a.k.a. Ben Affleck.You see Gwyneth was with them both – in their prime. And she described how both men performed in the bedroom.'Brad was like the sort of major chemistry, love of your life, kind of, at the time and then Ben was, like, technically excellent,' Paltrow divulged, before noting, 'I can't believe my daughter's listening to this.'",
        "Yes, your daughter is listening, but so are millions of other people. You're on a podcast, not gossiping with the girls over a Chardonnay.Then Paltrow engaged in a charming round of 'F***k, Marry, Kill'. This game is usually played around tables crowded with beer cans in frat houses across the America. In it, players are asked to decide, between three people, who suffers which fate.",
        "Paltrow's choices were Brad, Ben, and her ex-husband and Coldplay frontman Chris Martin.Spoiler alert: Affleck dies.OK, fine – I get it. Men have done this since the beginning of time. They brag about their conquests and compare their partners, but that doesn't make it right for Paltrow to do it before an audience of millions.After all, she knew what she was getting into. This podcast frequently veers into the intimate and even vulgar, so she can't claim that she was caught off guard.Is she not aware of the phrase TMI? Too Much Information.Paltrow is just one of many celebrities who suddenly think that it's appropriate to share their private sexual business with the world.Most recently pop star Meghan Trainor and actress Rachel Bilson made headlines for telling raunchy tales.Trainor told podcast listeners about her struggles during intercourse with her husband, which is fair enough because she seems to have a condition that makes sex painful. But she absolutely revels in it.",
        "'I've been talking about how tight I am and my husband is so very big,' she said. 'I thought that was our problem.'I'm truly sorry that you're having trouble Meghan, but it is your problem.Bilson has even less of an excuse after she recently opened up about her particular predilections.'I like missionary. [But] I've learned that if you want to have an orgasm during sex, you have to be on top… I want to be f****** manhandled.'That just sounds dangerous.For good measure, The OC star lamented how much she misses her ex-boyfriend Bill Hader's large penis.Now it's tempting to blame millennials for this complete lack of self-awareness and self-control by public figures, but it's not just them.Who can forget the legendary sex life of talk show host Kelly Ripa and her husband Mark Consuelos?",
        "Here's just some of what I've learned, against my will, about their bedroom escapades:They had sex at Andy Cohen's home on Fire Island, on the set of All My Children and in a public bathroom.Their daughter walked in on them while in the act when she was 18 and Kelly 'made eye contact with her'. (Now that her daughter is 21 and living at home she has to knock on doors before entering. It's a good rule of thumb if your parents mate like rabbits.)",
        "And the kicker – Ripa once passed out while having sex with her husband. Ok, that's enough for one column.This ABC porny-couple is only outdone by their ABC News-counterpart George Stephanopolous and his wife Ali Wentworth.In her book, Wentworth joked that female friends 'gasp and scream like I've confessed that I shot my dog' when they hear how often she and Stephanopoulos do it.She answered reports about her and George possibly getting a divorce by saying 'you show me a couple who is having sex twice a day, who is getting divorced.'Please God, keep Ali away from a podcast studio.Now, I'm aware of the criticism that I will get for taking this position. I can see the tweets now: 'If you're so horrified by these comments Meghan, then why are you repeating them?'Well, I'm making a point. American culture is pornified.",
        "Everything, everywhere from the Met Gala red carpet to morning talks shows are about skin, side-boob and shock factor.I consider myself a sex-positive person. I'm open and honest about likes and dislikes, but with my husband, not all of daytime television viewing America.Whatever happens behind closed doors is your business and that's the point.For all the time that I've spent in the public eye, I've never delved deeply into these topics, because I am protective of my personal life. But I was also raised in a conservative, waspy family, where - quite frankly – sex lives weren't openly flaunted.",
        "While on-air, I always felt my mother and late-Grandmother Roberta peering over my shoulder, ready to keel over with a heart attack if I ventured into issues of my sexuality.Honestly, I once thought the way I was raised was provincial and outdated. But today, as a mother of two girls, I am grateful for it. My daughters don't deserve to be subjected to TMI details about their mom and dad. I'm happy that I've set an example of modesty.Yes, strong women are confident in their sexuality. But that doesn't mean that they should be pushed and prodded by society into wearing in on their sleeves. Self-control is the first step toward self-respect.We're now living in a time of extreme overexposure. It robs young people of their innocence, and it deprives them of the experience of exploring the mysteries of life on their own terms.So, thank you, Cindy. This is about 20 years too late, but you were right all along.Paltrow should take a page out of your book."
    ]
}