{
    "articleURL": "/wires/reuters/article-12049323/Indonesia-quietly-engaging-key-stakeholders-Myanmar-crisis--foreign-minister.html",
    "content": [
        "By Kate Lamb and Ananda Teresia",
        "JAKARTA, May 5 (Reuters) - Indonesia has for months been quietly engaging Myanmar's pro-democracy shadow government, its ruling junta and ethnic minority armies, its foreign minister told Reuters, in an effort to kick-start a peace process as violence intensifies.As chair of the Association of Southeast Asian Nations (ASEAN) this year, Indonesia has been working intensively behind the scenes to deescalate the crisis in Myanmar, Retno Marsudi said in an interview, highlighting for the first time her country's moves to try to bring to the table the key players in Myanmar's conflict.Retno declined to give details about the discussions with different stakeholders but said Indonesian diplomats had held more than 60 \"engagements\" with all parties involved.The move comes amid frustration within ASEAN at Myanmar's State Administrative Council, as the junta is known, over its failure to implement a peace \"consensus\" that its top general agreed to with the bloc two years ago.\"We have engaged almost everybody - the State Administration Council, National Unity Government (NUG) and ...ethnic armed rebel groups as mandated by the five-point consensus,\" she said.\"We tried to be as inclusive as possible.\"Representatives of the Myanmar junta and two armed ethnic groups did not immediately respond to requests for comment.A spokesperson for the NUG said it is cooperating with the ASEAN chair as it is \"trying for a peace dialogue\".",
        "Myanmar has been wracked by violence and economic turmoil since the military seized power in a coup in 2021 and launched a violent crackdown on opponents, some of whom fled overseas to form a government-in-exile. Others joined armed resistance groups nationwide, which are allied with the NUG and several ethnic minority armies in fighting the junta.\"Indonesia continues trying to play a bridging role to reduce a deep and sharp gap among the stakeholders,\" Retno said.Retno spoke ahead of next week's meeting in Indonesia of ASEAN leaders, who have been losing patience with the junta over its lack of progress and its military's continued attacks on opponents.The bloc has barred Myanmar's generals from attending its high-level meetings until progress is demonstrated.Alongside Indonesia's quiet diplomacy, government and think-tank representatives from Myanmar and its neighbours, including India and China, held talks in New Delhi late last month as part of a secretive effort to resolve the Myanmar crisis. (Editing by Kanupriya Kapoor, Mark Heinrich, Martin Petty)"
    ]
}