{
    "articleURL": "/sport/football/article-12040677/Daniel-Levy-reservations-35-year-old-Julian-Nagelsmanns-age-offering-Tottenham-job.html",
    "content": [
        "Julian Nagelsmann was sacked as Bayern Munich boss and is looking for next jobTottenham are interested but Daniel Levy 'has concerns about the German'Tottenham chairman Daniel Levy has reservations about Julian Nagelsmann's age in considering making him Spurs boss, according to reports.",
        "The 35-year-old is out of work having been sacked by Bayern Munich, who replaced him with compatriot Thomas Tuchel. According to The Sun, Levy is keen to ensure Nagelsmann is respected by the senior playing group, who are close to him in terms of age, although the issue is not thought to be a deal-breaker.They report that his outspoken views, which irritated bosses at Bayern, are also a worry for the under-fire Spurs chairman. Levy is considering his next appointment after a disastrous season for the north London club. ",
        "Nagelsmann was under consideration for the Chelsea vacancy but withdrew from the process after being spooked, thinking he was a shoo-in before they also interviewed other candidates including Mauricio Pochettino, who looks set to take over. Spurs, meanwhile, remain manager-less. Antonio Conte was dismissed after a blistering attack on the club and his own players' mentality. Cristian Stellini, Conte's deputy, was then brought in as interim boss but won only one game and was axed after a brutal 6-1 mauling at Newcastle. And now Ryan Mason is in charge, leading the side to a 2-2 draw with Manchester United followed by this weekend's heartbreaking late 4-3 defeat by Liverpool. Nagelsmann remains favourite to take over at Spurs and is still regarded as one of the brightest young coaches in the game. ",
        "Mail Sport have been told that Nagelsmann is not demanding full control of transfers if he takes over at the club, contrary to reports elsewhere. A further complication is the lack of a sporting director after Fabio Paratici's appeal against his two-year ban from football was rejected, prompting his resignation. The role in Juventus' financial scandal led to his ban and subsequent departure from Spurs, who have no manager or sporting director at present. With the looming transfer saga around Harry Kane still to come this summer, it is a time of great uncertainty at the club.  "
    ]
}