{
    "articleURL": "/wires/afp/article-12040789/Thai-PM-runner-hails-new-baby-secret-power.html",
    "content": [
        "One of the front-runners in Thailand's general election hailed her newborn son as her \"secret power\" Wednesday as she presented the baby to the media after giving birth just two weeks before polling day.",
        "Paetongtarn Shinawatra, daughter of billionaire ex-premier Thaksin Shinawatra, vowed to get back on the campaign trail for the May 14 vote after giving birth on Monday.The 36-year-old has been first or second in surveys of voters' preferred choice of prime minister and her Pheu Thai party -- the latest incarnation of the political movement founded by her father -- is leading most opinion polls.\"I believe that good things come with babies, so this is a blessing for my family,\" she told reporters at Bangkok's Praram 9 hospital.\"My children are my secret power to work and to live life.\"A heavily pregnant Paetongtarn was a near-constant presence at campaign rallies in searing tropical heat until just a week before giving birth.The baby, named Prutthasin Sooksawas and nicknamed \"Thasin\" in honour of her father, is Paetongtarn's second.She described her emotions on delivering him safely, after his heart rate fell during labour.\"Once I heard his cry, my tears fell. I felt relief that he was safe. I am glad he is safe,\" she said.",
        "There was less joyful news Wednesday for Paetongtarn in the polls, where the leader of the rival opposition Move Forward party, Pita Limjaroenrat, overtook her as voters' preferred prime minister.The latest round of the closely-watched poll by the National Institute of Development Administration (NIDA) put Pita on 35 percent, ahead of Paetongtarn on 29.",
        "In party preferences, Pheu Thai still leads Move Forward -- a left-leaning reformist movement -- by 38 percent to 34, but the gap is narrowing.Napisa Waitoolkiat, a political analyst at Naresuan University, said the pregnancy and birth might help win over swing voters.Emilie Pradichit, of feminist human rights organisation Manushya, said she had sent out a strong message in a patriarchal society.\"By actively participating in the electoral process, while also sharing about her pregnancy, she is breaking barriers,\" she told AFP.\"It challenges the notion that pregnancy and motherhood are incompatible with political careers.\"- Return of Thaksin? -Pheu Thai has said it is targeting a landslide to try to secure the PM spot -- which under the junta-scripted constitution requires the support of the military-appointed senate.But Paetongtarn said she would not rule out alliances to build a governing coalition.\"I'm open to the parties that are going to support our policies and our conditions,\" she said.It is the second election since the 2014 coup that ousted Paetongtarn's aunt Yingluck from power.",
        "Pheu Thai won most seats at the last poll in 2019, but coup leader Prayut Chan-O-Cha stitched together a coalition to hold on to power.The baby's birth has increased speculation about a possible return to Thailand by Thaksin, who lives in exile to avoid corruption charges he says are politically motivated.",
        "Paetongtarn said her father, 73, wants to return to Thailand but not to get involved in politics again.\"He always says he wants to return home to raise his grandchildren. He never said he wants to return home to be PM,\" she said.Thaksin, still much loved in Thailand's poor rural areas for his populist welfare policies, is loathed by the powerful military and royalist elites.For two decades, Thai politics has been dominated by a tussle between the Shinawatras and this royalist-military establishment.Parties linked to the family have won most seats at every election since 2001, but seen two prime ministers removed by coups and two by court orders."
    ]
}