{
    "articleURL": "/news/article-12053971/Social-media-gives-verdict-King-Charles-coronation.html",
    "content": [
        "Viewers were quick to pick out the lighter moments of the glamorous ceremony CORONATION LIVEBLOG: Click here to follow live updates throughout todayPrincess Anne's massive feather hat, blocking the view of Prince Harry behind her, was one of the major talking points on social media during the King's Coronation today.",
        "Viewers from around the world were quick to pick out the lighter moments of the glamorous ceremony at Westminster Abbey this morning.Among them was the Princess Royal's huge headwear, positioned directly in front of Harry, who was relegated to the row behind his relatives for the showpiece event.Many speculated whether it was a deliberate move to 'punish' the Duke of Sussex, who has been outspoken in his criticism of the Royal Family in his autobiography Spare and recent Netflix series.Others also compared it to the moment Harry's wife Meghan was obscured by a giant candle during the Queen's funeral last year.",
        "One tweeted: 'Princess Anne has played a blinder in that hat, from certain angles it completely obscures Harry. It's the Jubilee candle all over again, but more outrageously feathery.'Another wrote: 'It's HILARIOUS that Harry is stuck sitting behind Anne who is wearing a giant hat with a plume on it as part of her uniform. No view for Harry!'A third added: 'Princess Anne's hat with the tall feather is this year's candle.'The Duke was seated between Princess Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for ten years. They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edoardo Mapelli Mozzi. ",
        "Only the senior working royals had a front row seat to the historic ceremony, made up of Prince William and Princess Catherine of Wales, the Duke and Duchess of Edinburgh - Edward and Sophie - and their children Lady Louise and James the Earl of Wessex, as well as the ever-popular Anne and her husband Sir Tim Laurence.Also in attendance was young Prince Louis, the star of the Platinum Jubilee when he stole the nation's hearts with his cheeky antics on the balcony.He was caught on camera once again today, offering a smile and a wave to the crowd from the car he was travelling to the Coronation in.Some viewers said the moment brought them to tears while others described it as 'cute'.There was also an outpouring of emotion over pictures of him holding hands with older sister Charlotte at the start of the ceremony.",
        "Elsewhere, coronation anthem Zadok The Priest was trending on Twitter for its similarity to the Champions League theme tune.The much-recognised music, played at the start of football matches in Europe's premier club competition, was written by English composer Tony Britten in 1992, but is famously based on Zadok The Priest - first produced by George Frideric Handel for the coronation of King George II in 1727.",
        "The confusion was evident when the song began in Westminster Abbey during the ceremony.One user wrote: 'I thought they were playing the Champions League theme for a moment!'Another joked: 'Just watched the Coronation for the sole purpose of seeing the Champions League anthem being sung. Buckingham 1-0 Downing.'A third added: 'Does being crowned King automatically qualify one for the Champions League?!'Meanwhile, US singer Katy Perry has left royal spectators in stitches after being spotted wandering round Westminster Abbey like a lost lamb. The 'California Gurls' singer, who will perform at the Coronation Concert at Windsor Castle tomorrow, was caught by fans searching far and wide for her seat. Unable to see thanks to an impressive fascinator, she can be seen cocking her head and spinning around in circles in desperate search for her place.Alongside British Vogue editor Edward Enninful, the pop star was pictured arriving at the abbey this morning in a lilac head piece and a large pearl Vivienne Westwood choker.It was also revealed today that she will stay at Windsor Castle tonight before performing tomorrow alongside music legend Lionel Richie, as well as Take That, Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel.",
        "Another celebrity guest at the ceremony was magician Dynamo, who was spotted turning up with Stereophonics singer Kelly Jones at Westminster Abbey.",
        "Many queried why Dynamo, real name Steven Frayne, was there amongst such a star-studded line-up of guests including Ant and Dec and Katy Perry.People took to Twitter in their droves to express their confusion about the guest being at the event. One person wrote: 'Wonder what kind of chat Dynamo and Kelly Jones from the Stereophonics are having at the #Coronation do.'While someone else said: 'How has Dynamo ended up at the Coronation.'Another person wrote: 'I can't believe Huw Edwards didn't recognise the world's greatest magician Dynamo smh.'Elsewhere, viewers were forced to double-take during the ceremony when a Welsh opera singer appeared to be the spitting image of Ed Balls.As the historic service at Westminster Abbey got under way, Welsh language piece Kyrie Eleison was sung by bass-baritone Sir Bryn Terfel, alongside a choir.It marked the first-ever Welsh language performance at a coronation, in a fitting tribute to Charles' former role as the Prince of Wales.But while Sir Bryn, 57, sang the beautiful song, described as a 'cry from the deep soul of the hills and valleys of Wales', viewers were in stitches over a striking resemblance between him and the former Labour education secretary, who served under Gordon Brown's government from 2007 to 2010.One person said: 'Why is Ed Balls singing at the coronation?'",
        "A second wrote: 'Lost my glasses and proper thought that was @edballs singing #Coronation'.Another added: 'Fair play to Ed balls . Didn’t know he could sing. #KingsCoronation'.A fourth joked: 'Ed Balls was wasted on Strictly #Coronation'.",
        "Meanwhile, the King almost had an embarrassing moment during the coronation as the Archbishop of Canterbury struggled to put the crown on his head.Millions watched Justin Welby place the crown on Charles's head - and continued to watch as the Archbishop of Canterbury battled to keep it there.Royal fans flocked online to express their shock and worry that the precarious crown could fall off at any moment.One wondered whether there would be a 'Cinderella-style hunt' for a head that would fit the crown.Thankfully for King Charles III, the crown eventually settled on his head.Royal onlookers were shocked at the trouble Welby had making the crown fit. One said: 'I mean... that crown didn't really fit, dit it? Had to really smash it on there.'Another quipped: 'There's probably good reasons why they didn't, but why am I wondering why nobody checked if the crown fitted?'Justin Welby was struggling there to fit it.'Similarly, a nation held its breath during the King's signing of his Coronation Oath - thought this time, he made only the slightest grimace as he screwed the top back on to the fountain pen.",
        "The monarch's pet peeve with leaky, awkward pens has become something of a running joke since his ascension.",
        "At his proclamation at St James' Palace last September, he frantically motioned to an aide to move a pen box from his desk which was getting in his way as he attempted to sign the document.The rare glimpse of the monarch's annoyance tickled many viewers. Tongue-in-cheek observations and memes flooded social media following the awkward moment. One said the table holding the documents 'was about the size for balancing a TV dinner on'. Another viewer said: 'Well that's the next step. Extraordinary to witness.  King Charles a little flustered with the pen situation.'"
    ]
}