{
    "articleURL": "/wires/ap/article-12038037/Former-Ohio-attorneys-general-fight-supermajority-amendment.html",
    "content": [
        "COLUMBUS, Ohio (AP) - Efforts Tuesday by Republican state lawmakers moving to ask Ohio voters this August to raise the threshold for passing future constitutional amendments - with the idea of thwarting a November abortion rights question - were again plagued by delays.",
        "The contingent championing the idea had continued to press forward even as former attorneys general of both parties joined a growing chorus in opposing their plan. Other foes the idea include a coalition of more than 200 labor, faith, voting rights, civil rights and community groups, the state's four living former governors and, as of Tuesday, the Ohio Libertarian Party.Two Ohio House committees that had separate possible votes scheduled Tuesday failed to act before Republican House Speaker Jason Stephens´ deadline to set the next day´s House calendar. Once it was missed, Stephens canceled the session. The next House session is scheduled for May 10, the deadline that the secretary of state has set for an as-yet-hypothetical August ballot.One of the committees was canceled after what appeared to be a stalemate over legislation establishing a $20 million special election this summer, with some lawmakers balking at the fact that it would reverse a bill they supported just a few months ago that eliminated most such elections.The other committee saw its business extend into the afternoon, as lawmakers heard hours of opposition testimony on a joint resolution that would place an issue on that ballot asking to raise the threshold for passing constitutional amendments from 50%-plus-one to 60%. The resolution eventually cleared the committee.",
        "Five former Ohio attorneys general wrote a letter to every state senator and representative Monday opposing the plan, a move that follows opposition from former Republican Govs. Bob Taft and John Kasich and former Democratic Govs. Ted Strickland and Richard Celeste.",
        "Republicans Betty Montgomery and Jim Petro and Democrats Richard Cordray, Lee Fisher and Nancy Rogers all told lawmakers they are uniquely positioned to comment on the proposal, given the state attorney general's key roles in reviewing citizen-led initiatives and litigating on the state's behalf.\"Constitutions are designed to endure, and major changes in fundamental constitutional arrangements should not be made unless the changes are supported by a careful understanding of the policies being changed and the consequences of the proposed changes,\" they wrote. \"Such changes should not be made without the opportunity for participation of those most intimately affected by the constitution - the people. Clearly, that has not happened in this rush to revise our constitution.\"The former top lawyers said Ohio's existing initiative process has \"worked well\" as a vehicle over more than a century for a host of policy changes impacting Ohioans - including creation of county home rule, a 10-mill limit on unvoted property taxes, legislative term limits and setting a minimum wage.State Rep. Brian Stewart, the House resolution's Republican sponsor, defended the resolution at a meeting of the House Constitutional Amendments Committee. He and GOP Secretary of State Frank LaRose introduced the 60% proposal during last year's lame duck session, with LaRose arguing it would be \"a win for good government\" that would protect the state's founding document from deep-pocketed special interests.",
        "Republican Gov. Mike DeWine, who is also a former state attorney general, has said he would sign the August special election bill, should the politically fractured Ohio House get it through a floor vote. Asked last week how that squares with his signing of a bill in January that eliminated August special elections, which were held up as expensive, low-turnout assaults on democracy, DeWine said \"it's inconsistent.\"He noted that the legislation also contained a long list of other election law changes that he supported, including a strict new photo ID requirement.The Senate passed its versions of both measures last month. House action could send the 60% supermajority proposal direct to voters without the governor's signature, but the Republican behind the plan have said votes would fall short unless it can be placed on an August ballot.Another question is how many votes the supermajority resolution would need to pass the House. Normally, the required three-fifths would amount to 60 of 99 House votes. However, since last year's election, one House member has died and one was hired for a job in the DeWine administration. It ultimately would be up to Stephens whether or not that lowers the required number of votes from 60 to 59."
    ]
}