{
    "articleURL": "/wires/aap/article-12040949/Powerful-gay-hate-inquiry-given-two-month-extension.html",
    "content": [
        "The judge overseeing a wide-ranging inquiry into historic gay hate crimes has been granted more time to complete his final report.",
        "With documents still being sought and hearings expected to run into June, NSW Supreme Court Justice John Sackar was under the pump to report back to Governor Margaret Beazley by June 30.The governor on Wednesday allowed an extension to August 30.The special commission of inquiry has been examining the manner and cause of death in dozens of unsolved suspected hate crime deaths in NSW between 1970 and 2010, among other potential gay hate homicides.The office of the inquiry welcomed the extension, saying it was required because of the significant volume of work being undertaken.\"To date, the inquiry has received and reviewed over 120,000 documents from a range of institutions including but not limited to the NSW Police Force, the Coroners Court of NSW, the Office of the Director of Public Prosecutions, NSW Health and NSW Births, Deaths and Marriages,\" a spokeswoman said.\"The Inquiry has heard evidence in public hearings about the social and cultural context in which suspected LGBTIQ hate crime deaths occurred, as well as extensive evidence from NSW Police Force witnesses (about Strike Forces Parrabell, Neiwand, Taradale and Macnamir) and expert witnesses.\"Premier Chris Minns said the extra time ensured victims, their families and the broader community would get the comprehensive report they deserve.",
        "Attorney-General Michael Daley said no one should have to \"endure the distress of not knowing what happened to someone they love\".\"These unsolved deaths have left loving families without answers for too long,'' he said.\"This inquiry is a powerful investigative tool to shine a light on past wrongs with expert scrutiny and help provide families with a measure of closure.\"The inquiry resumes on Friday to take evidence about the death of American mathematician Scott Johnson in 1988 that couldn't be mentioned while his killer was being tried.Scott Phillip White pleaded not guilty to murder in February but guilty to manslaughter, accepting legal responsibility for Dr Johnson's death at cliffs at Manly."
    ]
}