{
    "articleURL": "/wires/pa/article-12056309/Coronation-celebrations-continue-military-parade-Glasgow.html",
    "content": [
        "Cheers rang through the centre of Glasgow as hundreds of military personnel gathered for a special parade to mark the King’s coronation.",
        "It followed the coronation ceremony on Saturday and was set to be one of the main celebrations north of the border.The city’s Lord Lieutenant, Jacqueline McLaren, made a speech in George Square to launch the event, which also included inspection of a guard of honour and three cheers for the King and Queen, followed by the national anthem.As well as military servicemen and women, veterans and cadets as young as 10 gathered for the march to Glasgow Cathedral.",
        "In her speech, the Lord Lieutenant, who attended the coronation at Westminster Abbey on behalf of Glasgow on Saturday, congratulated Charles and Camilla.She told the crowd: “I would like to thank you all for attending today to mark this historic occasion.“I was honoured, as the city’s representative of Their Majesties, to accept their invitation to witness the historic ceremony at Westminster Abbey – a memorable and once-in-a-lifetime event.",
        "“On behalf of the city on this day, which marks the first full day of our new King’s reign, I wish the royal couple longevity, happiness and wisdom.“I met the King for the first time in October last year at the opening of the refurbished Burrell Collection.“I look forward to welcoming King Charles III and Queen Camilla back to Glasgow very soon.”",
        "The parade then progressed through the city to the cathedral, which was one of the locations broadcasting the coronation live, for a thanksgiving service.Scores of people also attended West Princes Street Gardens in Edinburgh for the broadcast.Meanwhile, more than 200 Coronation Big Lunch celebrations have been registered across the weekend.Some 1,500 people attended the Church Green in the Royal Deeside village, on the doorstep of the Balmoral estate.Ballater businesswoman Wendy Cobban, who helped organise the event, said: “Ballater holds a special affection for the King and Queen, as the village has had strong ties with the royal family since the time of Queen Victoria.",
        "“I think that the local residents feel a more personal relationship with the King and Queen, they are looked upon as friends and neighbours.“Locals and tourists will come together and enjoy the events of the weekend in an atmosphere of fun and celebration in Ballater, a place that holds a special place in the King and Queen’s hearts.”More than 300 people turned out for a picnic at the Millennium Hall grounds in the village of Gartocharn on the banks of Loch Lomond.The Coronation Big Lunch initiative, from the Eden Project, forms part of the celebrations for the coronation weekend.The Queen has been patron of The Big Lunch initiative since 2013 and The Big Lunch was set up four years previously to encourage neighbours and communities to share food.",
        "On Saturday, both celebrations and protests took place in Scotland as the coronation was marked.Gun salutes were fired at Edinburgh and Stirling Castles to mark moment the King was crowned.Thousands attended an independence march and rally in Glasgow, while in Edinburgh hundreds of people gathered on Calton Hill for an anti-monarchy rally organised by Our Republic."
    ]
}