{
    "articleURL": "/wires/reuters/article-12040567/Julio-Urias-rebounds-Dodgers-win-fifth-straight.html",
    "content": [
        "Julio Urias rebounded from a pair of subpar road starts to give up one hit over seven innings and the Los Angeles Dodgers rolled to a 13-1 victory over the visiting Philadelphia Phillies on Tuesday to extend their winning streak to a season-best five games.",
        "Mookie Betts drove in three runs with three hits, rookie Miguel Vargas had three doubles among his four hits, and Freddie Freeman hit a home run as the Dodgers moved one victory away from a perfect 6-0 homestand.Bryce Harper made his season debut for the Phillies 160 days after undergoing Tommy John surgery and went 0-for-4 with three strikeouts as the designated hitter. Former Dodger Trea Turner hit a home run for the only Phillies hit against Urias.Urias (4-3) had a season-best 10 strikeouts and just one walk. Last year's National League ERA champion was coming off road starts against the Chicago Cubs and Philadelphia Phillies when he gave up a combined 11 runs over nine innings.Phillies starter Matt Strahm (2-3) gave up four runs on six hits over 3 1/3 innings with one walk and five strikeouts. His outing came a day after Phillies starter Taijuan Walker went 3 1/3 innings. Phillies infielder Kody Clemens pitched for the second consecutive day.The Dodgers took a 1-0 lead in the first inning on a sacrifice fly from Max Muncy. Betts made it 3-0 one inning later when his two-out single to center field scored James Outman and Vargas.Turner's home run in the fourth inning, his third of the season, got the Phillies on the scoreboard. Betts added another RBI on a single in the fourth inning as the Dodgers led 4-1.",
        "Chris Taylor dunked a two-run single into left field in the seventh inning for a 6-1 Los Angeles lead and Vargas made it 8-1 with a two-run double to right-center two batters later. Freeman's two-run homer in the eighth, his fifth, made it 10-1. Vargas drove in his third run five batters later.--Field Level Media"
    ]
}