{
    "articleURL": "/wires/ap/article-12039717/Court-hears-appeal-prosecutor-suspended-DeSantis.html",
    "content": [
        "MONTGOMERY, Ala. (AP) - Federal appeals judges on Tuesday heard arguments over whether Florida Gov. Ron DeSantis wrongly suspended an elected state prosecutor last year after comments he made opposing abortion prosecutions.",
        "The three-judge panel of the 11th U.S. Circuit Court of Appeals heard oral arguments in an appeal filed by Andrew Warren in seeking to regain his job. The Republican governor last year suspended Warren, a twice-elected state attorney for Florida's Hillsborough County and a Democrat, accusing him of neglect of duty.DeSantis suspended Warren last year over the elected prosecutor´s signing of a statement, along with other prosecutors across the country, opposing criminal charges against abortion providers, or women seeking abortions, as well as his policies on not charging people with some minor crimes. Florida has a 15-week abortion ban and DeSantis last month signed into law a ban on abortions after six weeks of pregnancy.DeSantis has used his executive powers to promote an aggressive conservative agenda, as he eyes a potential White House bid.An attorney for Warren argued that DeSantis punished Warren for being a dissenting voice, violating his constitutional right to free speech, and nullifying the election that brought Warren to office.\"Hundreds of thousands of Floridians voted to elect Andrew Warren because they agreed with the beliefs and the viewpoints that he expressed. Governor DeSantis canceled Mr. Warren and every single vote that was cast for him because Mr. Warren´s viewpoints don´t follow the governor´s preferred orthodoxy,\" Warren´s attorney David O´Neil argued.",
        "O´Neil said the only proper remedy is to reinstate Warren to office.The two sides presented diverging interpretations of the governor's motives as well as a judge's January ruling dismissing Warren's lawsuit.\"There was abundant evidence that conduct was driving this decision,\" Henry Whitaker, solicitor general for Florida, told the panel.Two of the judges on the panel questioned Warren's lawyer whether the reasons cited by DeSantis, and later cited in the judge's decision dismissing Warren's lawsuit, were about performance or speech and where is the dividing line between the two.Judge Kevin Newsom said the abortion statement sounds \"pretty close\" to blanket non-prosecution agreement.\"Whether or not the abortion commitment is, or is not, a true blue blanket non-prosecution policy, we're still in conduct land and not in speech land, it seems to me,\" Newsom said.O´Neil responded that the statement was about Warren's \"political viewpoint\" and that DeSantis punished Warren because he didn't like that viewpoint.Warren issued a statement after the arguments, saying, \"from the beginning, we´ve believed that the law is on our side, and we hope that the court sees it this way.\"\"I´ve spent my career as a prosecutor, serving my community, state, and country. I believe with every fiber of my being in fighting for our freedoms, our democracy, and the rule of law - and that´s what this fight is about,\" Warren said.",
        "U.S. District Judge Robert Hinkle, in dismissing Warren's lawsui t in January, wrote that federal law prevents him from returning the prosecutor to office."
    ]
}