{
    "articleURL": "/wires/reuters/article-12050647/Used-car-retailer-Carvanas-shares-soar-upbeat-second-quarter-forecast.html",
    "content": [
        "By Kannaki Deka",
        "May 5 (Reuters) - Shares of Carvana Co rose 33% before the bell on Friday after the online used-car retailer forecast a surprise core profit for the second quarter, offering some relief to investors amid solvency concerns around the company.Carvana shares plunged 98% last year after the company struggled to offload used cars purchased at higher prices during the pandemic as demand fell on affordability concerns.The stock is heavily shorted, with short interest hovering around 51.2% of the float, according to Refinitiv data.Carvana, known for its car vending machines, has cut costs and been attempting to restructure its debt, some of which was taken on to buy auction firm ADESA's U.S. physical auction business.\"I think the major headwinds that have faced the business over the year are largely subsiding,\" Chief Executive Officer Ernest Garcia said on a call with analysts on Thursday after the company reported a smaller-than-expected first-quarter loss.Carvana said its adjusted earnings before interest, taxes, depreciation, and amortization,(EBITDA) were expected to be positive in the second quarter, a step Garcia had touted before as the first in turning the business around.Analysts, however, were still cautious.\"This stock isn't for the faint of heart, given ongoing solvency concerns and a very real risk of macro deterioration,\" Piper Sandler analysts said in a note on Friday, as they bumped up their price target on the stock by $1 to $21.",
        "\"Despite beating what were likely low expectations, we are still concerned about trends for used car retailers, given moderating ASPs (average selling price) and potential declines in demand with higher interest rates,\" D.A. Davidson analysts said in a note on Thursday.Carvana shares have risen 52% so far this year amid interest from retail investors. (Reporting by Kannaki Deka in Bengaluru; Editing by Subhranshu Sahu)"
    ]
}