{
    "articleURL": "/femail/article-12043185/Harry-Styles-wimp-dodging-Emily-Ratajkowski-ex-Olivia-Wilde-Met-Gala.html",
    "content": [
        "Jenni Murray calls Harry Styles a coward for avoiding potential awkwardness at New York's event of the yearREAD MORE: Olivia Wilde and Emily Ratajkowski BOTH going to Met Gala following Harry Styles 'betrayal' Serial dating can obviously have a devastating effect on one’s social life, as the singer and lothario Harry Styles has discovered. ",
        "Invited to New York’s event of the year, the Met Gala, he chose to avoid it ‘like the bubonic plague’ according to a friend. The reason? Both his ex-girlfriend, director of his last film Olivia Wilde, and his current squeeze, the woman with whom he’d swiftly moved on, Emily Ratajkowski, were expected to turn up. What a wimp. The two women, formerly friends, duly turned up and went to the same after-party. What’s the betting a friendship has been rekindled and a coward forgotten?",
        "I was only three, but Queen’s Coronation made me the feminist I amI didn’t expect to feel excited about the Coronation, but I can’t wait for Saturday when I shall sit on my sofa and delight in the spectacle that no one does better than the British. The anticipation is taking me right back to June 2, 1953, the Coronation of Queen Elizabeth II. I had just turned three and earlier that week my dad had come home with a television. He worked, at the time, in a TV repair shop and his boss had given him the telly for the express purpose of enabling us to see the first ever live broadcast of such a significant event. Of course, everyone in the street had seen my dad carrying the big box into our council house. No one else in the neighbourhood had their own, so we had a string of visitors knocking on the door, asking if they could ‘just pop round on the day’.",
        "All were made welcome.There was to be a party on the day in the huge barn of a nearby farmer. It was to be fancy dress for the children and I insisted on being a fairy — something of a test for my mother who had a great many talents, but needlework was not one of them.She managed to put together something white and floaty with wings. I had a wand and a tiara she’d found in a toy shop in town. First thing in the morning I was dressed up and ready for the show.Our tiny sitting room was crammed with people. I sat on the floor at the front and stared in disbelief as the beautiful young woman, sitting in her gold coach alongside her dashing husband, was drawn through the crowded streets of London by eight stunning grey geldings.It was a fairy tale and I, always blessed with a vivid imagination, convinced myself that I too could be a queen.",
        "We had no idea of how colourful the procession was — the screen was black and white — but we could see how stunning the Queen’s gown was and how beautiful her six maids of honour were, carrying her long, long robe of state. ",
        "Some of our guests, more widely travelled than me, had called out place names as the procession had passed by — Trafalgar Square, Marble Arch, Oxford Circus — and I imagined myself setting off one day to cover the nearly 200 miles from Barnsley, Yorkshire, to London to see all the places she was passing.I remember everything I saw on TV that day, but I think the most powerful memory is my realisation that I was watching a woman being the centre of attention.There were lots of men around her — her husband, the peers of the realm and the clergy — but she was the person who mattered. They all walked behind her and bowed to her.It was my first indication that a woman could be something other than a wife, cook, cleaner and mother. She was a mother, but she also had power. It was a profound moment for a little girl at a time when girls were generally thought to be secondary to boys.It was just as well the party was to be held in a barn. It rained all day — as it’s scheduled to do this Saturday — but nobody stayed at home. Barnsley, a coal mining town, was a strongly Left-wing constituency. I remember my mother scoffing that if we put my dog Taffy forward as a Labour candidate he’d be elected to Parliament.",
        "Yet I don’t remember anyone in our community expressing republican sentiments.Everyone was delighted to be celebrating the Coronation of The Queen and God Save the Queen rang out often on that day.I remember being exhausted as the party came to an end. All the children were given a piece of cake and a sixpence to take home. I still have the sixpence. It’s dated 1953 and has the young Queen’s picture on it.It had been a wonderful day and the best part of it was the way it brought our community together; all determined to love and respect our new head of state.There have been times in my life when I’ve had my doubts about the monarchy. As an atheist, I never stood up in the cinema at the end of a film in the days when God Save The Queen was played.I wondered why some were born to riches and privilege and others to nothing. I asked myself why the royals needed so many houses when so many had nowhere to live. Then I grew up and saw the good the Royal Family has done.In the early 1980s, I interviewed the then Prince Charles about the Duchy of Cornwall. I found a man with a great sense of humour.",
        "He dubbed me the KGB but was happy to answer those difficult questions about wealth and privilege. He was even willing to invite a whole BBC crew to join him in his sitting room for drinks, which he poured himself.King Charles knows his job and he has a wife, Queen Camilla, who knows her job too. I’ve met her several times and always been impressed by her charm, her easy chatter and the ready smile.So I shall be wishing the King and Queen my best on Saturday but won’t be swearing to pay true allegiance. It’s the God thing again. Save King Charles will be fine, but ‘May the King live forever’ is surely a prayer too far.Proof it’s your face or figureWatch out for the unwanted results of rapid weight loss caused by one of the new injectable drugs, Ozempic or Wegovy.There are reports of rapid facial fat loss, leading to unexpected saggy, wrinkly skin.It was Barbara Cartland who told me years ago: ‘Darling, it’s either your face or your figure.‘Try to retain a little plumptitude.’Best ever advice.Michael Palin has always seemed the kindest and happiest of men, proudly thanking his wife, Helen, for keeping the home fires burning as he travelled the world earning their living making programmes. ",
        "As he announces her death, after 57 years of marriage, he thanks her again for being the ‘bedrock of my life’.May she rest in peace and may he find some comfort from his three children who share his ‘indescribable loss’.",
        "No way am I doing No Mow May!Sorry, but I won’t be taking part in No Mow May, an initiative proposed by a British conservation charity to help plants and wildlife.I have a new mower. The old one broke down. It will be used to cut my grass primarily because I can’t stand daisies in my lawn.Too many memories of making endless daisy chains on the boundary as my father played cricket.Daisies remind me of utter boredom. They shall be gone."
    ]
}