{
    "articleURL": "/tvshowbiz/article-12051957/Elizabeth-Olsen-looks-chic-long-black-coat-multi-hued-scarf.html",
    "content": [
        "Elizabeth Olsen showed off her chic but casual sense of style as she stepped out for lunch with friends in London's Soho on Friday.",
        "The Doctor Strange In The Multiverse Of Madness star, 34, wore a khaki green top which she teamed with a pair of black denim jeans.Actress Elizabeth wore a long black coat which she left unbuttoned and she had a black bag draped over her shoulder.She added a splash of colour to her ensemble by opting for a many-hued scarf which reached right down to her knees.Screen star Elizabeth completed her look by wearing a pair of chunky black boots while she shielded her eyes behind a pair of dark sunglasses. ",
        "The US star appeared in good spirits as she chatted to her friends in the street, flashing a broad smile.It comes after Elizabeth spoke out about being nicknamed 'mother' by her fans online.The fashion designer doesn't appear to like the unusual moniker, branding it 'odd'.'I think it's very odd. Mothers are great, I guess. It makes me feel like, old? Cause I think the people saying it must be young? Like I'm not sure,' she told Entertainment Tonight at the LA premiere of her new limited series Love &amp; Death.Elizabeth was titled 'the internet's mom' a while ago, but the phrase gained popularity after she presented at this year's Oscars with Pedro Pascal, famously dubbed the 'internet's daddy'.",
        "She appeared to laugh and cry at the same time as she was asked about the title saying: 'I really don't get it. My friends have tried to explain to me that it's, like, a good thing. I don't know.'She also expressed her willingness to work with Pedro in the future and praised him, saying, 'I would love to work with Pedro, we've been friends for a long time, and I was happy to be able to be standing up there with him.'The nickname could have possibly originated because her iconic character Wanda / Scarlet Witch became fixated on the idea of becoming a mother after dreaming about her kids from Earth-838 and desperately wanted the children she saw in her dreams.",
        "Elizabeth's new limited HBO show Love &amp; Death is a true crime series adapted from the gruesome murder of small-town Texas housewife Betty Gore – played by Lily Rabe, whose husband was having an affair with her killer — friend and neighbor, Candy Montgomery (Olsen).Gore's cheating husband is played by Kirsten Dunst's husband, Jesse Plemons, and the series has earned solid reviews so far from critics.The first trailer for Love &amp; Death dropped in February and showed Elizabeth fully inhabiting the role of a churchgoing mother who would eventually pick up an ax and murder her friend in 1980.",
        "'Something has been bothering me a little,' she says in the trailer. 'I have done all the things a wife is supposed to do. The house, the meals… Where is the payback?'Written by David E. Kelley, the show is another chilling adaptation of Candy Montgomery's disturbing tale, portrayed by Jessica Biel last year in the titular Hulu series Candy.Elizabeth is the younger sister of the Olsen Twins, who rose to fame when they were children after starring as Michelle Tanner in the hit comedy show Full House.",
        "Elizabeth got her first leading role in 2011 in Martha Marcy May Marlene. She became a household name around 2015 when she starred as Wanda Maximoff/The Scarlet Witch in the Marvel Studios film Avengers: Age of Ultron.During an interview amid a segment for Good Morning America, the star opened up about her decision to remove her social media accounts.'I feel like I had a good mental health relationship with Instagram,' she stated, adding that it 'didn't give me a lot of joy in my life.'She also explained that deleting her social media has 'made me really intentional with what I consume from what I'm reading or the internet.'"
    ]
}