{
    "articleURL": "/wires/reuters/article-12048365/Bumble-beats-quarterly-revenue-estimates.html",
    "content": [
        "By Vansh Agarwal",
        "May 4 (Reuters) - Bumble Inc beat estimates for first-quarter revenue on Thursday as user spending on its eponymous dating app remained strong despite a looming recession, sending the company's shares up 7% in aftermarket trading.The parent company of Bumble, Badoo, and Fruitz, benefited from strong user growth during the quarter as more people opted to pay to find love and companionship.Bumble, however, reported its slowest revenue growth since going public in February 2021, with first-quarter revenue rising 15.7% year-over-year.New features such as \"Compliments\", which allows users to engage by sending a note before they decide to connect, have helped Bumble cope with high inflation and rising interest rates.The company said during its earnings call that so far 15% of Bumble's monthly active users had sent a compliment, and it was confident in its ability to grow that number.Bumble competes with Tinder-owner Match Group Inc which on Tuesday forecast second-quarter revenue below analysts' expectations, but said it is seeing signs of growth at Tinder.\"Bumble's strength in attracting female users should help them defend their market share against competitors, as they differentiate themselves by empowering women to make the first move,\" said Nicholas Cauley, an analyst at Third Bridge.The company reported revenue of $242.9 million in the three-month period ended March 31, compared with analysts' estimates of $241.0 million, according to Refinitiv data.",
        "Total paying users increased to 3.5 million in the reported quarter, from 3 million a year earlier. Total paying users for Bumble app grew 31% to 2.3 million, while those for Badoo App and other paying users declined 7.4% to 1.1 miilion.The Austin, Texas-based company forecast current-quarter revenue between $254 million and $258 million, the mid-point of which is slightly below analysts' estimates of $256.63 million. (Reporting by Vansh Agarwal in Bengaluru; Editing by Shailesh Kuber)"
    ]
}