{
    "articleURL": "/wires/reuters/article-12041709/UK-regulator-hopes-lure-companies-listings-overhaul.html",
    "content": [
        "By Iain Withers and Kirstin Ridley",
        "LONDON, May 3 (Reuters) - Britain's stock market rules are set to be radically simplified in an effort to help lure major company listings back to London under plans unveiled by the financial watchdog on Tuesday.Britain's appeal as a global financial centre has lost its lustre as companies, such as UK chip designer ARM, have sought listings in rival hubs such as New York and after the country was largely cut off from the European Union by Brexit.In an attempt to reverse a 40% decline in the number of London listings since 2008, the Financial Conduct Authority (FCA) is proposing partially lifting the regulatory burden on companies and streamlining the rulebook.It suggests replacing Britain's existing 'premium' and 'standard' listing segments with a single category, removing eligibility requirements that can deter newer firms, being more permissive on dual class share structures and removing mandatory shareholder votes on transactions such as acquisitions.\"We want to encourage more companies to list and grow in the UK, versus other highly competitive international markets,\" said FCA Chief Executive Nikhil Rathi.Speaking to Sky News on Wednesday, he called for a wider debate in Britain about whether to boost the level of risk market participants can take.\"That means there is upside for investors, but it also means sometimes things will go wrong, and that's part of a healthy dynamic capital market ... We want to strike that balance,\" he said.",
        "But experts expressed concerns at the reform push.\"We strongly support the principles behind listing rule reform ... but eroding shareholder rights risks undermining market standards, and this is not the right answer,\" said Richard Wilson, CEO of trading platform interactive investor.Scott McCubbin, UKI IPO Leader at auditor EY, advised caution when removing key investor protections, such as the ability to vote on key transactions.\"Importantly, revising listing regulation is just one piece of the puzzle,\" he said.\"A comprehensive package of measures across listings and other areas such as secondary markets, tax, retail investor access, forward guidance, analyst coverage, regulatory capital treatment and labour is needed, rather than a siloed approach.\"The FCA began consulting on potential changes to its listing regime in March and the more detailed proposals will undergo a further round of consultation ending on June 28.The FCA said it aimed to make \"substantial progress\" on the reforms by the end of this year. (Reporting by Iain Withers and Kirstin Ridley, Editing by Mark Potter and Ed Osmond)"
    ]
}