{
    "articleURL": "/tvshowbiz/article-12053801/EastEnders-star-Jack-Ryder-looks-unrecognisable-former-character.html",
    "content": [
        "EastEnders star Jack Ryder looked unrecognisable from his former character on Friday - 20 years after he departed the soap. ",
        "The actor - who was known for his boyish good looks and floppy curtains - made his Albert Square debut in November 1998 at the age of 17 as Jamie Mitchell. Jack, now 41, has transformed his image since his last Walford scenes, which saw his character tragically killed in a car accident in December 2002.Since moving on from acting he is now an established film and theatre director and published his first children's book in 2020. Sharing a photo to Instagram, Jack could be seen sporting a much shorter haircut and a perfectly groomed beard as he went to collect his daughter. ",
        "Throwing up a peace sign for the camera, he captioned: 'Now, enough of all this acting talk and mentoring business. 'I’m off to collect my baby girl and spend the weekend watching Button Moon and being jumped on! Have a great one guys!'After his departure from the soap Jack married Kym Marsh ini August 2002, they divorced in 2008. He welcomed a daughter with his long-term partner, Ella, in 2021 and he splits his time between London and France. The update comes after the EastEnders heartthrob admitted that fame at a young age was 'tough to cope with' as he reflected on his career. Speaking on Lorraine last summer, Jack said 'no one can prepare you for it' and that he 'just kept his head down and got on with it'. ",
        "Speaking about his meteoric rise to fame, he told Lorraine: 'Yeah, no one can prepare you for it. It was before social media, the last kind of golden era of TV. 'My last episode I think got something like 25million viewers. I love the work. The fame side was tough to cope with at that age. I just kept my head down and got on with it.'",
        "On the programme viewers were also shown an unrecognisable throwback snap of Jamie as he arrived in Walford as a teenager. During the interview Jack added that he is still in touch with some of his old cast mates including Dean Gaffney, Natalie Cassidy and Steve McFadden.He said: 'Me and Dean Gaffney and Natalie (Cassidy) and even Steve McFadden I bumped into, it was his 60th birthday and we had a little chat. 'We're all loosely in touch and have fond memories together.'"
    ]
}