{
    "articleURL": "/wires/reuters/article-12051503/CDC-scale-data-collection-US-ends-COVID-health-emergency.html",
    "content": [
        "By Ahmed Aboulenein",
        "WASHINGTON, May 5 (Reuters) - The U.S. Centers for Disease Control and Prevention (CDC) said on Friday it would stop reporting or monitoring COVID-19 case data and transmission rates after the government ends the pandemic's public health emergency designation next week.The agency will stop using its color-coded COVID-19 Community Levels (CCL) system, which relies on those metrics to track the spread of the virus and will instead primarily rely on hospital admission data.The government on May 11 will end the COVID-19 public health emergency that allowed millions of Americans to receive vaccines, tests, and treatments at no cost during the pandemic.\"The changes that we're discussing today are happening because the end of the Public Health Emergency means that CDC will have less authority to collect certain types of public health data,\" said CDC Principal Deputy Director Dr. Nirav Shah.The current CCL system relies in part on aggregate case rates, he told reporters on a press call, but some local jurisdictions may stop reporting that data after May 11.\"There has been a 99% concordance between the community levels, which are being retired, and the new hospital admission driven metrics,\" he said.\"We will still be able to tell that it's snowing, even though we're no longer counting every snowflake.\"",
        "Data on hospitalizations will still be collected nationwide, although weekly instead of daily, and will provide a detailed look at trends down to the county level, Dr. Brendan Jackson, who leads the CDC's COVID-19 Response, said on the call.Hospitals are required to report admissions data beyond May 11 and until April 30 of next year.The CDC will continue to provide COVID death rates but will no longer rely on aggregate case data reported by local jurisdictions and will instead use national death certificate data, Jackson said.COVID-19 surveillance will be folded into a wider integrated strategy for monitoring respiratory viruses, he said, adding that some data reporting including demographic case data, the CDC's work on long COVID, and wastewater surveillance for the virus will continue past May 11. (Reporting by Ahmed Aboulenein Editing by Bill Berkrot)"
    ]
}