{
    "articleURL": "/tvshowbiz/article-12039807/GBBOs-Prue-Leith-hopes-sensible-new-host-Alison-Hammond-help-end-shows-cheeky-innuendoes.html",
    "content": [
        "The Great British Bake Off's Prue Leith has said she hopes 'sensible' new host Alison Hammond will help end the show's and her co-star's saucy innuendoes. ",
        "The judge, 83, declared her new colleague 'charming and funny' as she prepares to replace comedian Matt Lucas, 49, on the beloved Channel 4 competition show.Despite the series being known for it's cheeky jokes with 'soggy bottoms' and 'hot baps' Prue revealed she hopes Alison will help raise the tone. Speaking about hosts Matt, Noel Fielding, 49, and fellow judge Paul Hollywood, 57, she said: 'I never get the jokes, you know... all this stuff about innuendo and things'.'I feel I'm really glad Alison's coming, cause at least she's a woman and she'll be a little more sensible'.",
        "Telling Nick Grimshaw and Angela Hartnett on their Dish podcast, she laughed: 'Those three men, they're like three children,'Before adding: 'The word sausage puts them into...'However Prue failed to finish her sentence when the hosts collapsed into fits of giggles. Back in March Alison confirmed she would replace Matt Lucas as the host of The Great British Bake Off.The This Morning presenter had originally been mooted as a potential replacement for Little Britain star, who announced he would be stepping down as host last year, in February. Matt co-hosted the Channel 4 show alongside Noel Fielding since 2020 but he decided his time on the programme is over Lucas joined the show in series 11, replacing fellow comedian Sandi Toksvig who left the programme after three seasons. ",
        "Taking to Instagram she confirmed her new role on the Channel 4 show by sharing a video of herself and co-host Noel Fielding alongside judges Paul Hollywood and Prue Leith as iced figurines atop a large Bake Off-themed cake.",
        "Staging a mock press conference, Hammond's voice is heard as she films the figurines.'Breaking news everyone,' she announces. 'Alison Hammond is joining the team of the Great British Bake Off. Alison, have you got any words whatsoever?' Zooming in on her iced caricature, she adds: 'Do you know what? I'm just so very excited. As you can see, all my colleagues are absolutely speechless. We're so very happy and we can't wait to get started!' Captioning the post, she wrote: 'It’s OFFICIAL!!! It’s happening The Great British Bake off! Let’s have it!' The new host was given an additional welcome from show regular Hollywood, who admitted he was looking forward to working with her. Taking to Instagram, he wrote: 'welcome!!!!! looking forward to seeing you in the tent, you’re going to love it.' "
    ]
}