{
    "articleURL": "/tvshowbiz/article-12041273/EXC-Alison-Kings-ex-fianc-David-Stuckey-expecting-baby-new-girlfriend-WEEKS.html",
    "content": [
        "Alison King's ex-fiancé David Stuckey is expecting a baby with his new girlfriend in just a matter of weeks, MailOnline can exclusively reveal.",
        "The Coronation Street star, 50, split with her toyboy partner, 41, just 12 months ago, parting ways 'amicably' after drifting apart.But it can now be revealed the IT consultant has moved on with small business owner Jenny Burr - with a baby boy due later this month.David is living with his new girlfriend, a single mum from Wilmslow, and they even enjoyed a family getaway to Santorini last August with her son from a previous relationship. David also shares two sons with a former partner.He had been set to marry Alison, 50, in a Greek ceremony three years ago before their plans were thwarted by coronavirus restrictions.",
        "A source told MailOnline: 'It seems David has moved on, with a baby boy due this month.'There are loads of pictures on Facebook of him with his new girlfriend. They even went on a family holiday to Santorini in Greece.'It was on the Facebook account for her handmade stationery business that Jenny announced her pregnancy last month.She wrote: 'So for those of you that don’t know…we have some exciting news at SSD HQ!'I’m due mid May, so in 4 weeks I will be taking a little break which means you’ve got the next few weeks to get your orders in! ",
        "'Watch this space as we will be offering lots of discounts and last chance to buy items over the next couple of weeks!'I will of course keep you updated when baby arrives and when we open back up I have some very exciting news and new products to share with you!'MailOnline has contacted David and Jenny for comment, as well as representatives for Alison.",
        "David's split from Alison was revealed last May.The soap star had planned to exchange vows with the IT consultant in Greece before coronavirus restrictions forced them to cancel their May 2020 ceremony with just weeks to go.But the couple - who began dating in March 2018 - soon 'grew apart' and 'parted amicably'.A source said: 'Alison and David have sadly decided to separate. They were very much in love for a long time but have ended up growing apart.'They parted amicably and both wish each other the best in the future.'David popped the question with a ring he designed himself during a romantic sunset cruise in Portugal - which they nearly had to cancel thanks to a slew of ominous clouds on the horizon.Officially introducing her fiance during an interview with OK! Magazine in 2019, the star also revealed that she had 'an inkling' David was going to propose and made sure she brought along a Rolex on the trip as an engagement present for him.",
        "Revealing that the proposal happened just a few days before their one-year anniversary, she explained: 'I had an inkling he was going to pop the question because he kept putting something on my finger and going: \"right, close your eyes and forget this ever happened!\"''We’d also discussed marriage, too. I think we both went from \"no, we don’t ever need to get married\" to \"oh, we really want to get married!\"'Alison explained that the lead-up to the proposal wasn't all smooth sailing, as they were met with 'black clouds over the sea while driving towards the port at Albufeira.'However, with a team of dedicated crew-members, the cruise carried on as planned, and IT Salesman David got down on bended knee to pop the question with a ring he had designed himself.Alison gushed: 'I’d bought him a Rolex as an engagement present too. I said: \"Yes please,\" and then I gave him the watch! It was perfect, even though it didn’t go to plan!'Discussing their age gap, she claimed that he's 'already very mature' and wanted someone with children, as he was a father himself. With the proposal happening over the summer, a source told The Sun at the time that Alison is 'very excited' after her partner popped the question. ",
        "The source said some of Alison's closest friends in the cast such as Kym Marsh and Jane Danson were thrilled to learn of her engagement news.They said: 'Ali is so popular with everyone on the cobbles. They think it's wonderful.Detailing their love story, the actress, who is known for playing Carla Connor on Corrie, revealed that they met in March 2018 after being set up by their mutual personal trainer.'The engagement is a lovely surprise. Ali is over the moon. Ali has ­obviously endured heartache in the past. But she is hoping those days are now firmly behind her. She is very excited about what the future holds.'It comes after Alison broke off her engagement to Corrie sound technician Adam Huckett in 2012. The couple share daughter Daisy, ten.Despite getting engaged in September 2011 on a trip to Paris, it was revealed in October 2012 that the pair had split.Alison then dated Hollyoaks assistant director Paul Slavin, after the couple were spotted together in 2016."
    ]
}