{
    "articleURL": "/news/article-12046509/Putin-no-option-use-tactical-NUKES-Ukraine-says-Kremlins-ex-space-agency-chief.html",
    "content": [
        "Dmitry Rogozin - a former deputy prime minister - called for use of tactical nukesHis alarming statements come just one day after a drone attack on the KremlinA prominent Russian politician who once commanded Russia's Space Agency has said Vladimir Putin now has 'no option' but to use tactical nuclear weapons in Ukraine.",
        "Dmitry Rogozin - the former head of Roscosmos who also served as deputy prime minister - declared that Moscow is facing defeat in its war with Kyiv unless the dictator unleashes his atomic weapons in a recent video.'It must be said that under our doctrine we have every right to use tactical nuclear weapons,' said Rogozin, who was dressed in military fatigues with a customised AK-47 assault rifle slung over his shoulder.'That is precisely what they are there for — this great equaliser.'For now, there is a clear disparity in the forces and conventional weapons in favour of the enemy,' he said, pointing to the West's support of Ukraine's war effort. 'Therefore the best method to destroy [Ukraine's] counter-offensive is to use tactical nuclear weapons, with understandable consequences, of course.'I think there is no other option at the moment.'Rogozin's alarming statements come just one day after the Kremlin suffered a drone strike in what some believe was an assassination attempt on Putin. ",
        "Until last year, Rogozin was in charge of testing Putin's range of giant nuclear weapons - the 'Satan 2' or 'Sarmat' intercontinental ballistic missile - and Moscow's array of space satellites.",
        "But he has since become a mouthpiece for the Russian war effort, appearing in images and videos ostensibly from close to the front lines in Russian-held territory in Ukraine. ",
        "In his latest video, Rogozin admitted Russian forces are facing deep trouble in Ukraine's expected imminent counter-offensive, unless Putin goes nuclear.He clearly implied Moscow is facing defeat to a better equipped enemy - a stunning admission given Russia's numerical superiority in troop numbers.'I want to say we are waiting for the [Ukrainian] offensive, we are ready for it,' he said.'We understand that it will be very hard because they have a lot of power on their side, but nobody on our side will give up their positions.'With the war in Ukraine now well into its second year, Putin has begun upping the ante - scrapping the only remaining nuclear arms treaty with the US, and most recently vowing to send nukes to Belarus.But Yevgeny Prigozhin, the head of the Wagner mercenary group responsible for much of Russia's limited success in Ukraine, has ruled out a nuclear response to the drone attack on the Kremlin.The Wagner chief discounted the possibility of using nuclear weapons on Ukrainian soil and denounced Moscow's tried and tested approach of nuclear sabre-rattling, arguing that Western countries will stop taking Russia seriously.  'We look like clowns threatening to 'nuke' a child's drone,' he said.",
        "A former Russian ambassador to NATO, Rogozin earlier in the war sought to scare the West with threats over Russian nuclear weapons.",
        "He was wounded in December as Ukraine struck a shell at his 59th birthday party in a Donetsk hotel.Two men were killed, and the pro-Putin war enthusiast sustained considerable injuries which required him to be airlifted to Moscow last month.Now Rogozin - promised a future state job by Putin - is in the war zone heading a group of military advisers and the Royal Wolves research and technology centre.He is leading a training effort in electronic warfare and drone piloting.Meanwhile, Vladimir Putin continues to expand Russia's nuclear capabilities despite regular foot soldiers complaining of a lack of equipment, ammunition and armour on the front lines in Ukraine. Moscow is now planning to launch a new Pacific fleet of submarines that will carry lethal Poseidon nuclear missiles as early as next year. Since the Russian despot invaded Ukraine, Putin's propagandists have continued to threaten the West with a nuclear holocaust - and the rhetoric has continued to escalate in recent months. According to Russia's TASS news agency, the division of submarines to carry these underwater doomsday torpedoes could be ready to launch by the end of 2024 or in the first half of 2025.",
        "Moscow said in January that it had produced the first set of the devastating Poseidon weapons - a blend of torpedo and drone - four years after Putin announced the fundamentally new type of strategic nuclear weapon, confirming it would have its own nuclear power supply. ",
        "In late March, Russia said that the coastal infrastructure for the submarines that would carry the Poseidon torpedoes will be finished on the Kamchatka Peninsula, where Russia's Pacific Fleet's ballistic nuclear missile submarine base is located.'The decision to form a division of special-purpose nuclear submarines in Kamchatka has been made,' TASS cited an unidentified defence source as saying. 'We are talking about December 2024 or the first half of 2025.'Russia has claimed that the lethal Poseidon weapons - made up of a 65ft tube that is almost 6ft in diameter -  would be unable to be stopped by current nuclear defences. Once launched, it acts like a drone where it can be remotely guided to its target. "
    ]
}