{
    "articleURL": "/health/article-12054565/Scientists-recruit-2-000-Britons-link-psoriasis-arthritis.html",
    "content": [
        "More than 150,000 Britons suffer with psoriatic arthritis according to research Researchers want to discover the link between the skin condition and arthritis The link between the skin disease psoriasis and developing arthritis later in life will be explored in a first-of-its-kind study.",
        "Psoriasis causes red, flaky and itchy patches of skin all over the body, and studies show that around a third of sufferers will also eventually be diagnosed with the painful joint condition.While more than 150,000 people in the UK have these two conditions – known as psoriatic arthritis – scientists do not know what triggers it.Experts say this study of 2,000 Britons could help scientists uncover crucial risk factors and develop treatments that prevent this illness.The participants, who will have been diagnosed with psoriasis but not have arthritis symptoms, will be tracked over a number of years to see if they develop psoriatic arthritis.",
        "They will have regular blood tests and take a genetic examination to identify any tell-tale patterns in their DNA.Scientists from the medical research group Hippocrates will be looking for common factors between patients who develop psoriatic arthritis. It is thought that specific inherited genes play a role as the condition often runs in families. Smoking and obesity have also been linked.But Professor Laura Coates, a rheumatologist at the University of Oxford and one of the researchers, says there are other factors to consider: ‘We want to see whether you’re more likely to get arthritis if your psoriasis is very severe, compared with those who have mild symptoms. We also will explore whether medication patients take to treat psoriasis has any impact, as well as underlying health conditions like heart disease and depression.’",
        "She hopes that the results of the study will help doctors better manage psoriatic arthritis, saying: ‘If the key indicators are weight and diet, for example, we might suggest people with psoriasis follow a certain diet.‘It’s possible that this data will eventually lead to us discovering a treatment to stop psoriatic arthritis before it can begin to take hold.’"
    ]
}