{
    "articleURL": "/tvshowbiz/article-12044057/What-TV-legend-Jay-Leno-brings-donuts-WGA-strike-picket-lines-did-2007-strike.html",
    "content": [
        "Jay Leno provided donuts to writers on the picket line in Burbank, California as the Writers Guild of America's strike commenced Tuesday.",
        "Leno, 73, was pictured outside Walt Disney Studios handing out boxes of treats from famed LA franchise Randy's Donuts, giving the scribes a pick-me-up as they persisted on the picket line.A number of the union members serenaded the beloved comedy icon with kind words for his presence and contribution in footage captured on social media, thanking him and telling him, 'We love you Jay.'The car-loving comedian pulled up to the proceedings in a blue sedan, and wore his trademark ensemble of a denim blue shirt and jeans as he distributed the donuts.  The former host of The Tonight Show previously showed his support for striking writers during the 2007 strike.",
        "On the first day of that strike, he pulled up to Universal Studios on a Harley-Davidson and passed out Krispy Kreme donuts.The strike in 2007-08 went on for 100 days, with Leno's The Tonight Show heavily impacted by it. NBC ran reruns until January of 2008.Leno, in an effort to keep non-writers on the show employed, penned his own punchlines and opening monologues in returning to the air.Leno has been involved in a number of dangerous mishaps in recent months, as in November was hospitalized after he was burned in a garage fire his Burbank while working on one of his classic cars. ",
        "He underwent numerous restorative medical procedures in the wake of the accident. He was treated for third-degree burns at the Grossman Burn Center in West Hills, California in the wake of the incident, remaining at the facility for 10 days amid his recovery.Leno in December penned a column for The Wall Street Journal in which he spoke about his mindset in the wake of the traumatic incident.'You have to joke about it,' he said. 'There's nothing worse than whiny celebrities. If you joke about it, people laugh along with you.'In January, Leno broke his collarbone  and a pair of ribs in a Las Vegas motorcycle accident in which his bike was derailed by a stray wire on the road. ",
        "He was seen as the Writers Guild of America commenced with their plans to go on strike amid broken talks with the Alliance of Motion Picture and Television Producers. The WGA and AMPTP have not slated a day to continue with the negotiations. WGA committee co-chair Chris Keyser told Deadline he had no timetable as to when the strike could come to a conclusion.'You never…know,' Keyser said. 'But I will say that up until this morning, we only struck once in 35 years, and we only do it when we see an existential threat to writing as a profession, as we did when we contemplated the idea that streaming would not pay us adequately, where we had no projections there.",
        "'So, I think writers understand that they need to hold together, and we'll hold together until we solve this problem.'"
    ]
}