{
    "articleURL": "/tvshowbiz/article-12060595/Beyonces-Renaissance-World-Tour-outearn-Taylor-Swifts-Eras-Tour-600MILLION.html",
    "content": [
        "Beyonce's Renaissance World Tour could outearn Taylor Swift's phenomenally successful Eras Tour by a whopping $600million, Forbes has revealed.",
        "The Crazy In Love hitmaker, 41, will begin her first solo tour in seven years on May 10 at Stockholm's Friends Arena - with the star set to do battle with 33-year-old Swift's 52 date concert tour, which broke Ticketmaster records with single day sales of two million.However, Queen Bey's 41 date tour, which ends in North America in September, could gross between $275 million and $2.57 billion from tickets alone - which smashes The Eras Tour's $1.9billion projection.Therefore, billionaire Beyonce could make nearly $2.2 billion from the tour, $600million more than the $1.6 billion Swift could earn,The estimates are based on projected high numbers of fans buying tickets and high average ticket prices of around $700, the publication reports. ",
        "VIP packages for the tour range from $3757 to $5000. The estimate is also based on artists raking in a huge share of merchandise proceeds, leaving them with 80 per cent of tour revenues, minus expensesBeyonce released Renaissance, her seventh studio album containing the hit track Break My Soul, in July 2022.The album won the Grammy for Best Dance/Electronic Album in February.Beyoncé's last solo tour was the Formation World Tour in 2016 to support her sixth album, Lemonade - in 2018 she went on the On The Run Tour with her husband, Jay-Z.",
        "As with previous tours, Beyoncé will make her mark offstage, too, with BeyGOOD, the initiative she founded in 2013 to support people and programs around the world.In various cities throughout the tour, BeyGOOD will support entrepreneurs through Black Parade Route luncheons, celebrating small business owners, with grant opportunities being awarded and a foray of services with global partners to promote business sustainability.One thousand small businesses will be supported with a commitment, while BeyGOOD will also support students through scholarship funds that will be given to colleges and universities in ten different cities along the tour.",
        "Each school will be given one hundred thousand dollars and will select the student recipients.BeyGOOD’s total scholarship commitment during RENAISSANCE WORLD TOUR will be one million dollars.The world tour comes after Beyoncé returned to the stage with a grand performance in Dubai, marking her first concert in four years.",
        "May 10: Stockholm, SE (Friends Arena)May 14: Brussels, BE (Baudoin Stadium)May 17: Cardiff, UK (Principality Stadium)May 20: Edinburgh, UK (Murrayfield)May 23: Sunderland, UK (Stadium of Light)May 26: Paris, FR (Stade de France)May 29: London, UK (Tottenham Hotspur Stadium)May 30: London, UK (Tottenham Hotspur Stadium)June 2: London, UK (Tottenham Hotspur Stadium)June 6: Lyon, FR (Groupama Stadium)June 8: Barcelona, SP (Olympic Stadium)June 11: Marseille, FR (Orange Vélodrome)June 15: Cologne, DE (Rheinenergiestadion)June 17: Amsterdam, NL (JC Arena)June 18: Amsterdam, NL (JC Arena)June 21: Hamburg, DE (Volksparkstadion)June 24: Frankfurt, DE (Deutsche Bank Park)June 27: Warsaw, PL (Pge Nardowy)July 8: Toronto, CA (Rogers Centre)July 9: Toronto, CA (Rogers Centre)July 12: Philadelphia, PA (Lincoln Financial Field)July 15: Nashville, TN (Nissan Stadium)July 17: Louisville, KY (Cardinal Stadium)July 20: Minneapolis, MN (Huntington Bank Stadium)July 22: Chicago, IL (Soldier Field)July 26: Detroit, MI (Ford Field)July 29: New York, NY (Metlife Stadium)July 30: New York, NY (Metlife Stadium)August 1: Boston, MA (Gillette Stadium)August 3: Pittsburgh, PA (Heinz Field)August 5: Washington, DC (FedEx Field)August 9: Charlotte, NC (Bank of America Stadium)August 11: Atlanta, GA (Mercedes Benz Stadium)August 16: Tampa, FL (Raymond James Stadium)August 18: Miami, FL (Hard Rock Stadium)August 21: St. Louis, MI (Dome at Americas Center)August 24: Phoenix, AZ (State Farm Stadium)August 26: Las Vegas, NV (Allegiant Stadium)August 30: San Francisco, CA (Levi's Stadium)September 2: Los Angeles, CA (Sofi Stadium)September 3: Los Angeles, CA (Sofi Stadium)September 11: Vancouver, CA (Bc Place)September 13: Seattle, WA (Lumen Field)September 18: Kansas City, KS (Arrowhead Stadium)September 21: Dallas, TX (AT&amp;T Stadium)September 23: Houston, TX (NRG Stadium)September 27: New Orleans, LA (Caesars Superdome)",
        "The musical icon was taking to the stage to celebrate the opening of new luxury hotel Atlantis The Royal, which managed to draw out a bevy of international stars.Despite the high profile of the event, the hitmaker tried to tamp down on the publicity by banning recording and forcing attendees to lock up their phones ahead of the show.Still, a few intrepid attendees managed to keep their cameras free and shared videos of Beyoncé belting out her hits, including Halo.She was reportedly paid $24 million for the performance at the luxury resort for the invitation only concert, according to TMZ.The Dubai concert is Beyonce's first live performance since appearing at a Tribute to the late Kobe Bryant and his daughter, Gianna, in 2020.Her rendition of Be Alive from the film King Richard at the 2022 Oscars ceremonies was taped.Fans had been hoping that the long-awaited release of Renaissance meant a tour would be on the cards.There's also potential for some very special guests to join her.In putting the album together, she enlisted the help of such artists as Drake, Pharrell Williams, The-Dream, Skrillex - and none other than her own husband Jay-Z.The dance-heavy album features 16 tracks, including the previously released single Break My Soul, which dropped last month.",
        "The other 15 other tracks are: I'm That Girl, Cozy, Alien Superstar, Cuff It, Energy, Church Girl, Plastic Off the Sofa, Virgo's Groove, Move, Heated, Thique, All Up in Your Mind, America Has a Problem, Pure/Honey and Summer Renaissance.There could be potential for more shows down the line as Beyonce previously described the album as a 'three-act project.'In her note, she re-stated the album's creative process took three years and detailed working throughout the pandemic, calling it a 'time to be still, but also a time I found to be the most creative.'She went on to say: 'Creating this album allowed me a place to dream and to find escape during a scary time for the world.'It allowed me to feel free and adventurous in a time when little else was moving.'My intention was to create a safe place, a place without judgment, a place to be free of perfectionism and overthinking.'A place to scream, release, feel freedom. It was a beautiful journey of exploration.'Renaissance debuted in the top spot on the Billboard 200 albums chart, marking the best-selling week from a female artist this year, and second best-selling of the year.It sold 332,000 equivalent album units in the week through August 4, Billboard reported, citing stats from Luminate.",
        "The album was the first from a female artist to land atop the Billboard 200 this year, as the last female artist to achieve the feat was Adele with her album 40 last December.The record went on to top the charts for its first six weeks, from December 4, 2021 thru January 8, 2022.Renaissance is Beyonce's first solo studio album since her groundbreaking visual album Lemonade from 2016, in which she famously confronted the questions around her marriage to Jay-Z and his fidelity.Beyonce and Jay-Z have been married since 2008 and have welcomed three children into the world - Blue Ivy, 10, and twins Sir and Rumi, five.Beyonce has released four albums since 2016's Lemonade, although none of them were solo studio efforts.In 2018, she dropped Everything Is Love, with Jay-Z under the name the Carters.In April of 2019, she released Homecoming, an album accompanying her 2018 headlining performance at Coachella.That summer she followed with The Lion King: The Gift, a companion album to the Disney film that featured several new Beyonce songs (a deluxe edition of that album featuring three additional tracks was released a year later)."
    ]
}