{
    "articleURL": "/news/article-12058431/Reverend-Bill-Crews-slams-shameful-Macquarie-banker-Nick-OKane-earning-57million-year.html",
    "content": [
        "Respected Reverend slams banker's annual salaryMacquarie Bank executive earned $57million in 2023Bill Crews provides for people who 'can't afford food'One of Australia's most respected church ministers has slammed a banker's eyewatering $57million pay packet as 'shameful'. ",
        "The Reverend Bill Crews, who is a close friend of the Dalai Lama, has been supporting the homeless and disadvantaged in Sydney for decades. The Good Samaritan provided for more than 1.1million people during the pandemic and has hosted Christmas Day lunches for those in need for more than 30 years. Crews took to Twitter on Monday morning, asking his followers: 'Did you read the reports of a banker earning $57 million in a year? 'Surely earning that much money isn't a reason for pride, but a shameful indictment on inequality in Australia… Today I feed people so poor they can't afford food, medicine let alone a roof over their head.'His tweet came after it was revealed a top executive at Macquarie Bank earned a total remuneration of $57.6million in the bank's 2023 financial year.",
        "Nick O'Kane, Macquarie's global head of commodities and markets, earned more than Macquarie Bank CEO Shemara Wikramanayake. It was almost 50 per cent more than he earned in 2022 when he still had a pay package worth an incredible $36.2 million, the bank's annual report reveals. Ms Wikramanayake's total 'award remuneration' for 2023 weighed in at a mere $32.8million by comparison, up from $25.8 million in 2022. The massive paydays came as the Sydney-based global financial services firm registered a record $5.2billion profit after tax for the year. ",
        "The bulk of Mr O'Kane's awarded pay came in $39.8million of retained profit share, which is a rolling program paid out over seven years.That was almost double his $21.3million retained profit share in 2022.His base wage was very humble by comparison at just $723,419 in 2023, up $98 from his $723,321 salary in 2022.But he also took home an available profit share of $17million, up from $14million the previous year. Ms Wikramanayake's base pay was $821,081.Mr O'Kane, who joined Macquarie in 1995, is now expected to be the highest earner of all Australian Stock Exchange company executives, or very close to it.The bank earned its 'millionaire's factory' nickname for its generous pay and bonus structure over the past 20 years but it insists all rewards are performance related. 'I think if you have an idea, and it's a great idea, bring that to management and articulate what that idea is and go for it,' Mr O'Kane said on the bank's website.",
        "'Because at Macquarie we are the type of organisation where we have a bias to saying yes.'If you have a great idea, you will get the opportunity to be able to chase that idea down and build a business and you never know what that might come into.'",
        "Twitter users were quick to reply to Crews's tweet.  'Utterly revolting. No one is worth that. Australia needs a wealth tax,' one said. \"Banker earning $57 million in a year\". Obscene at so many levels,' another wrote.Sex under the desk, envelopes stuffed with cash, 16-hour days and the strip club at lunchtime - life in leading bank's 'Millionaires' Factory'By CANDACE SUTTON FOR DAILY MAIL AUSTRALIA In its rise to the top ranks as one of Australia's most respected investment banks and a breeding ground for young and wealthy traders, Macquarie Bank has earned a reputation as a 'work hard, play hard' outfit with its fair share of scandals.In the new book 'The Millionaires' Factory', the turbocharged atmosphere of Macquarie included people having sex in its showers or under the desk, and drinking from the well-stocked booze fridge as they worked 12 to 16 hour days.In the lead-up to the global financial crisis of 2008, the partying culture at Macquarie was such that going to a 'gentleman's club' up the road was a tradition every Wednesday lunchtime - but only for the male bankers - and one day pornographic magazines were found in one of the toilets.And as the book, 'the inside story of how Macquarie Bank became a global giant' written by The Australian newspaper's Joyce Moullakis and Chris Wright' reveals, there was an annual 'White Envelope Day'.",
        "This was the 'eagerly awaited' day when bonuses were awarded, and Macquarie's senior bankers would be called in to the head of department's office to receive a sum which could mean they could buy a new car or new house.'You always knew who got a million dollar plus,' the authors quote one insider, and then the staff would retreat to the nearby bars to celebrate in 'the high octane debauch that would follow'.The booze fridge opened at midday, and by the early 2000s - when Macquarie's after-tax profits went from $250 million in 2002 to $1.803 billion in 2008 - the partying culture was endemic.Young tyros were doing deals, and among the culture was one of celebrating the banks success - which as the book's authors went to print was 19,000 staff and a current market cap of $70 billion.The parties were held in five-star hotels, on yachts and included lavish gifts for Macquarie's loyal workers, including at one Christmas time a keyring from the luxury jewellery house Tiffany.",
        "The Millionaires' Factory charts Macquarie's beginnings in 1969 as an Australian subsidiary of the English merchant bank Hill Samuel, its growth in the 1980s during financial deregulation and the floating of the Australian dollar.Macquarie weathered the 1987 global share market crash remarkably well, thanks to a policy of risk management that many credit for ensuring its unbroken history of profitability.",
        "But Macquarie's reputation as one of the top rank financial trading houses in the world did not come without its scandals, and the book concedes that Macquarie 'has had its fair share'.Simon Gautier HannesIn 1996, he was overseeing the a $2 billion takeover of the transport company TNT by the Dutch telecommunications firm KPN, with Hannes advising its long-term client TNT.The fee for Macquarie was somewhere between $5 million and $10 million.",
        "As court hearings would later reveal, Hannes began withdrawing sums which would eventually amount to $90,000 in the name of Mark Booth.He had opened a cash management trust account with a broker in that name and, the court would find, was essentially requesting a broker to invest the $90,00 in TNT.Hannes was convicted of insider trading and served 15.5 months in prison before a retrial which added a further four-and-a-half months to his minimum jail sentence.Ian ChalmersIn 2006, Ian Robert Chalmers - known at Macquarie Bank as 'Rocky' - was jailed for five-and-a-half years with a minimum of three-and-a-half years.But in 2007, then aged 43, the NSW Court of Criminal Appeal increased his sentence to 12 years, with a non-parole period of eight years.He had been found guilty of conspiring to import cocaine, not less than the commercial quantity, in a smuggling ring, which used Sydney Airport baggage handlers to help bring the drug into Australia.",
        "In the second half of the 1990s, Simon Hannes was considered a great banker with a sharp mind who had earned the right to become Macquarie's then youngest ever executive director at the age of 29.A private schoolboy who was closely related to photographic industry pioneer and founder of Hanimex, Jack Hannes, he was regarded as something of a genius, although a loner.By that time, he had left Macquarie, where he had been hired to work in markets and stockbroking.",
        "An expansive character known for his excessive behaviour even for the high-flying scene at Macquarie, his vocal performance in the trading pit caused his colleagues to say he sounded a lot like Sylvester Stallone in the Hollywood star's movie series about boxer Rocky Balboa.Chalmers was accused of smuggling 30kg of cocaine into the country in a scheme that would pay couriers to travel to South America and then return to Sydney on a flight with drug-filled luggage. Baggage handlers were in on the scam.He was a drug taker who helped organise the cocaine flights, and on appealing his sentence, three judges of the NSW Court of Criminal Appeal decided the criminality of Chalmers' offending had been greater than originally thought.Chalmers, who has since been released from prison, told the book's authors that his sentence was about drug addiction, not about a play hard culture in the banking industry and it was 'a problem across the board'.Chilean trip scandalDescribed by The Millionaires' Factory as 'one of the weirdest scandals to rock Macquarie', were the allegations made on a trip to Chile.The report alleged two Macquarie Bank colleagues drugged another with valium and laxatives during a business trip to the South American country more than a decade ago.Not reported until 2017, the story included photos of the alleged victim with a smiley face and joke moustache drawn in black on the unconscious man's face.Within hours of the prank, emails circulated among Macquarie stockbrokers in Melbourne and Sydney said in a mock threat 'don't fark with me, u end up down the rabbit hole'ASIC and Ross HopkinsLast year, the corporate regulator the Australian Securities and Investment Commission took action against Macquarie Bank for for failing to monitor the conduct of third parties, including a convicted financial adviser who embezzled $2.9 million dollars.Ross Hopkins was not a Macquarie Bank executive, but rather a third-party financial adviser and sole director of QWL, which provided clients with advice on self-managed superannuation funds.Hopkins stole superannuation funds from 13 clients, and ASIC use his example to attack Macquarie for 'insufficient monitoring' of transactions.ASIC claimed a fraud monitoring system with manual checks to confirm transactions were legitimate would have prevented and detected unauthorised transactions.",
        "'Macquarie failed to properly detect and prevent these unauthorised fee transactions, many of which were over $10,000 each,' ASIC said, 'Mr Hopkins' conduct is an example of what can go wrong when banks do not properly monitor their systems and implement appropriate processes.'Macquarie remediated Hopkins' clients approximately $3.5m.Between October, 2016 and October, 2019, Hopkins had exercised almost complete control of his clients' super which allowed him to transact on their accounts.He used his clients' funds for holidays, rent, paying his own credit card debts and repaying personal loans.Hopkins was banned from financial services last year and sentenced to six years in prison. "
    ]
}