{
    "articleURL": "/tvshowbiz/article-12055191/Katy-Perrys-glam-squad-takes-FIVE-dressing-rooms-backstage-ahead-Coronation-concert.html",
    "content": [
        "Katy Perry's glam squad is reportedly set to take up five dressing rooms backstage when she performs at the Coronation Concert at Windsor Castle on Sunday.",
        "The 'California Gurls' singer, 38, is said to have flown in with a royal-sized entourage in tow for her appearance at the star-studded Coronation, where she will headline.The American singer-songwriter - who took a week off her Las Vegas residency to appear at the glitzy bash - is reportedly expected to have more than 50 aides on site at Windsor Castle.The entire squad, which has taken up five dressing rooms, consists of hair and makeup artists, stylists, costume designers, her sound engineering team, her lighting specialists, and her dance team, according to The Mirror.Her entourage had reportedly earlier travelled to the venue in ten Mercedes people carriers and were allocated five dressing rooms to get Katy ready for the big show.",
        "A source also revealed to the publication that Katy's backstage room includes luxury sofas, fresh flowers, and a refrigerator with a glass door.Another source added: 'Katy has easily the biggest entourage of any on the bill.'They continued: 'But she has a trusted team who she always works with and relies upon. They know exactly how she likes things done… and will make sure they’re done to the letter.'However, they insisted that Katy isn't 'over the top' when it comes to her backstage squad.When speaking to Extra TV earlier this month, Katy gushed over the fact that she had been asked to perform at King Charles The Thirds Coronation Concert.",
        "She said 'I’m grateful to have been asked. It’s very exciting.'She continued: 'It [the invite] was very regal – I loved it. I’m an ambassador to one of his foundations… he asked me to sing and it all aligned.'",
        "The much-anticipated Concert comes after Katy was unveiled last month as part of the line-up for the Windsor Coronation Concert.it comes before Katy was spotted today taking a picture of herself on Westminster Abbey's memorial to Winston Churchill - just hours after being mocked for failing to find her seat - and later tripping in her heels outside.The Firework singer, who will perform on Sunday, took a quick snap of her feet while she stood on the stone dedicated to the wartime Prime Minister.And earlier today, Perry was also caught by amused fans looking like a lost lamb searching far and wide for her seat.The star, who was unable to see thanks to an impressive fascinator, was seen cocking her head and spinning around in circles in a desperate search for her place.",
        "And Katy, who was dressed head-to-toe in lilac with an enormous headpiece and Vivienne Westwood choker, comically tweeted following the ceremony that her fans were 'not to worry' as she found her seat.In further antics, the singer was also spotted taking selfies with guests in the historic abbey and stumbling in her tall white heels as she left the ceremony with fellow guests.",
        "Alongside British Vogue editor Edward Enninful, the pop star was pictured arriving at the abbey earlier this morning.It was also revealed that she will stay at Windsor Castle tonight before performing alongside music legend Lionel Richie, as well as Take That, Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel.The event, which will take place on the grounds of Windsor Castle, will be in front of a crowd of 20,000 members of the public and invited guests and broadcast across BBC television and radio stations.",
        "As a special honour in return for her performance, Katy is being allowed an exclusive stay in the royal residence of the 1,000-year-old castle.Katy said she is 'really excited' about her 'wild' sleepover at the royal residence.'I'm really excited… I might be posting a lot because I'm gonna be in a castle, for real. This is wild,' she told Extra TV.Asked about her Coronation invite, she said: 'It was very regal. It was like a cursive I have never seen [before]… I loved it.'The 38-year-old paid homage to Vivienne Westwood in her lilac outfit from the late designer.She showcased her slim frame in a pencil dress teamed with a coordinating short-sleeved jacket, boasting a nipped-in waist, and matching opera gloves.",
        "She accessorised with an enormous dish-style net fascinator while wearing a Vivienne Westwood necklace and carrying her belongings in a white top-handle bag from the designer.",
        "Katy arrived alongside VIP guests who since 6am were queuing for a mile to get one of the prime 2,300 seats inside. The Abbey was full at just before 9am.Stars seen taking their seats in the church included Katy Perry, Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement.TV favourites Ant and Dec, along with Repair Shop star Jay Blades, was also in attendance at the service, which is set to be seen by more than 100 million people around the world.They watched Charles be crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.It also shone a spotlight on Britain’s place on the world stage in the UK's biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965 with 7,000 servicemen and women marching with the King and Queen.MailOnline has contacted Katy’s representatives for comment."
    ]
}