{
    "articleURL": "/wires/reuters/article-12058393/Wallabies-flyhalf-Cooper-returns-Gordon-Lolesio-head-head.html",
    "content": [
        "By Nick Mulvenney",
        "SYDNEY, May 8 (Reuters) - Wallabies flyhalf Quade Cooper played his first meaningful minutes of rugby for more than nine months in Japan at the weekend, while coach Eddie Jones watched two other contenders for the gold number 10 shirt go head-to-head in Melbourne.Jones has made it clear since his return as coach that Cooper is very much in his plans for the World Cup later this year, but which other flyhalves will be in his squad for France is a matter of some conjecture.The 35-year-old has been sidelined since rupturing his Achilles tendon in August last year but played the first half of Hanazono Kintetsu Liners' 36-14 win over Urayasu D-Rocks in the Japan Rugby League One promotion/relegation playoffs on Sunday.Playing alongside his long-time halfback partner Will Genia, Cooper helped Kintetsu to a 19-7 halftime lead as they took a big step towards retaining their place in the top flight for next season.\"It was a great feeling being back out there,\" Cooper said in a Twitter post.\"Was nice to be part of the win and continue the journey another week. Felt good physically and clocked my third fastest accelerations in the four years I've been at this club, which is a good sign, and also my second best top speed.\"",
        "Jones selected Ben Donaldson, who won his first two caps on last year's November tour, and the uncapped Carter Gordon in his first training squad last month, snubbing 17-cap flyhalf Noah Lolesio.Donaldson has had a difficult season with the underperforming New South Wales Waratahs in Super Rugby Pacific, initially shunted to fullback and failing to impress when an injury to Tane Edmed won him back the number 10 shirt.Lolesio clearly thought he had a point to prove to the watching Jones on Sunday when his ACT Brumbies took on Gordon's Melbourne Rebels and shouted out his rival's name after grounding the ball for his second try of the first half.\"Noah's super-competitive, he's someone that wants to be better and better every week,\" said Brumbies coach and former Wallabies flyhalf Stephen Larkham.\"It's good to see that bit of passion come out with those emotions there. Obviously, he scored two tries and if someone puts 10 points on the board, you've got to be happy with that.\"Although he ended up on the losing side, Gordon did his chances of getting a crack at a Wallabies shirt no harm with another impressive performance in his breakout season.With his long, blonde hair clearly marking him out, the 22-year-old scored an opportunist try and oozed class in his playmaking with two of his passes, the second an absolute pearl, setting up tries for winger Lachie Anderson.",
        "\"Carter's been good this whole year,\" said Rebels coach Kevin Foote. \"Just got to keep building that relationship between him and the guys on the outside and game managing well.\"With perhaps an eye on the toughness Jones is looking for in his players, Foote made it clear that Gordon had played that well despite missing training during the week because of a \"grumbling hip\".The South African also emphasised Gordon's defensive toughness, a quality that marks him apart from Cooper and Lolesio.\"Before this game, I think he'd made 36 more tackles than any other back on our team,\" he said.\"So, he's prepared to put his head in there and I'm sure Eddie will be looking at that thinking 'that's pretty brave'.\"(Reporting by Nick Mulvenney, editing by Peter Rutherford)"
    ]
}