{
    "articleURL": "/wires/pa/article-12042441/Anne-thanks-officers-preparing-coronation-new-military-role-emerges.html",
    "content": [
        "The Princess Royal has been appointed the Senior Colonel of the Household Division by the King, it has emerged.",
        "Anne, who is Colonel of the Household Cavalry’s Blues and Royals, was given the role by Charles when he became Colonel in Chief of the Household Division’s regiments on the Queen’s death.Her new position was confirmed by Buckingham Palace after she visited a central London barracks to thank senior military who worked through the night rehearsing servicemen and women for the coronation.",
        "Anne visited Wellington Barracks near Buckingham Palace and chatted to officers and senior non-commissioned officers of the Household Division who will take part in processions escorting the King to and from Westminster Abbey.When the coronation procession is staged after Charles is crowned, Anne will travel on horseback behind the gold state coach carrying the King and his wife.In her role as Senior Colonel, the princess will host a traditional dinner for her fellow Household Division Colonels – who include the Princess of Wales, the Colonel of the Irish Guards – on the eve of the Trooping the Colour ceremony.At the event it is decided which regiment will be given the honour of trooping their colour the following year.With last-minute preparations for Saturday’s coronation ramping up, early morning rehearsals were staged in the capital, revealing the first glimpses of the grandeur of the planned processions.",
        "Hundreds of soldiers, many on horseback, marched from Buckingham Palace past Trafalgar Square and Downing Street to Westminster Abbey shortly after midnight on Wednesday.The diamond jubilee state coach and gold state coach travelled down The Mall as part of the dry-run for the full event.Royal fans waited for more than three hours for the parade to make a return trip."
    ]
}