{
    "articleURL": "/sport/racing/article-12052547/Frankie-Dettori-make-amends-freak-fall-landing-2000-Guineas-Chaldean.html",
    "content": [
        "Dettori dramatically fell from hot favourite Chaldean in Greenham StakesThe legendary jockey will seek to land the 2000 Guineas on his farewell tourIt will be intriguing to see how Dettori rides his race from stall three on SaturdayChaldean (Newmarket, 4.40) may have undergone an unorthodox preparation for a Classic, but that may not prevent him from providing Frankie Dettori with another winning chapter on his farewell tour.",
        "Just days after winning the Italian 2000 Guineas for the first time, the Italian bids to add a fourth British equivalent to an illustrious c.v. after the unfortunate circumstances which saw his mount finish the Greenham Stakes without him in situ.While the separation of the partnership exiting the Newbury stalls was unfortunate, the outing was not lost on Chaldean who ran up the straight with relish to finish alongside winner Isaac Shelby.The ground at Newbury was deep, so completing a seven-furlong gallop without a rider and a bruising final furlong duel just a fortnight before Saturday’s feature may even be a positive.We will know the answer to that conundrum, but the son of Frankel improved with each start last term and his experience of the Newmarket Dip, gained from a gritty success in the Dewhurst Stakes last autumn, may stand him in good stead.",
        "It will be intriguing to see how Dettori rides his race from stall three, especially as the Ballydoyle challenge is grouped together in stalls 12 and 13.Chaldean is versatile tactically, so it would be no surprise to see him slide along at the head of affairs before trying to steal a march on Auguste Rodin and Little Big Bear, both of whom look huge dangers.",
        "Aidan O’Brien’s duo boast markedly different profiles. Futurity Trophy winner Auguste Rodin is likely to want further than a mile in time, while Little Big Bear boasts explosive speed as he displayed when trouncing Persian Force in the Phoenix Stakes.TAHIYRA (Newmarket, 3.40) boasts the potential to be an exceptional filly this season and her explosive turn of foot could settle tomorrow’s 1000 Guineas."
    ]
}