{
    "articleURL": "/tvshowbiz/article-12060657/Boris-Becker-cuts-dapper-figure-alongside-glamorous-partner-Lilian-awards-Paris.html",
    "content": [
        "Boris Becker may well be preparing for the 'final phase of his life' - but it still includes glamorous red carpet ceremonies if his latest public appearance is anything to go by. ",
        "The disgraced former tennis ace was seen leaving the Laureus World Sports Awards in Paris alongside elegant girlfriend Lilian de Carvalho Monteiro on Monday evening after mingling with a star-studded guest list of sporting greats. Becker, 55, had attended the ceremony little more than five months after being deported to his native Germany from Britain, where he served eight months of a two-and-a-half year prison term for hiding millions in assets, despite declaring himself bankrupt.  The three-time Wimbledon champion looked appropriately dapper in a black three piece suit and polished dress shoes, teamed with a crisp white shirt and skinny dark tie. Meanwhile partner Lilian looked nothing short of sensational in a dazzling burgundy gown which boasted a large cut out. She elevated her frame in a pair of towering heels and toted her belongings around in a black clutch. The African actress accessorised with a pair of bold chunky gold hoop earrings and applied a flawless palette of makeup including a bold smokey eye shadow. ",
        "The appearance comes after Becker claimed he was forced to make friends with the 'tough boys' in prison to survive, while vowing to win 'the fifth set' of his life. In an interview with 5 Live Breakfast, he said incarceration was a 'real punishment' but that he had discovered that he is a 'survivor'.  ",
        "The tennis great served eight months of his two-and-a-half year sentence for hiding millions of pounds worth of assets to avoid paying off debts. He served time at HMP Wandsworth and Category C Huntercombe Prison near Henley-on-Thames in Oxfordshire.The six-time Grand Slam singles champion was released from prison in December and deported to his native Germany. Addressing questions about whether he will return to punditry roles on the BBC in the near future, he said he was talking to the 'responsible people'. The German, who had lived in the UK since 2012, was expected to serve half of his sentence behind bars but was released in December and deported from the UK. ",
        "He is thought to have been transferred to a lower security jail, Category C Huntercombe Prison near Henley-on-Thames in Oxfordshire, for foreign criminals awaiting deportation in May 2022.He was previously being held at Category B Wandsworth Prison in south-west London, according to reports.The six-time Grand Slam champion qualified for automatic deportation because he is a foreign national who does not have British citizenship and received a custodial sentence of more than 12 months.He is not allowed back on UK soil until October 2024.  Speaking ahead of the release of a new documentary about his life and career, Becker said that the time in prison was a 'real punishment' and that anyone who said it wasn't very hard was dishonest.  ",
        "'It's a real punishment. It's supposed to be a punishment, being incarcerated and anyone who says prison life isn't hard and isn't difficult is lying. 'I think it's a really difficult life and from where I am coming from, I've never been incarcerated before so it was a very brutal, new, very different experience to what you see in the movies or what you heard from stories.' Becker said he had been forced to make friends with the 'tough boys' in prison to make sure he was safe, saying prison is 'very dangerous'.  ",
        "'Prison is very dangerous. As I said, it's a dangerous place, you fight every day for survival. 'I was surrounded by murderers, by drug dealers, by rapists, by people smugglers, by dangerous criminals. 'Quickly you have to surround yourself with the 'tough boys' as I would call them, because you need protection. If you think you are better than everybody else, then you lose. So that was the harsh reality of this every day, facing different people. The former tennis ace said he learned a lot about himself while in prison, including that he is a 'mensch' - a German word for a person with integrity. "
    ]
}