{
    "articleURL": "/sport/football/article-12056639/Pierre-Emerick-Aubameyang-looking-terminate-Chelsea-deal-facilitate-Barcelona-return.html",
    "content": [
        "Pierre-Emerick Aubameyang is reportedly looking to end his Chelsea contractThe striker appeared to confirm his desire to join Barcelona on Tiktok The move would facilitate an easier return to Barcelona where he played in 2022Pierre-Emerick Aubameyang has admitted he would like to return to Barcelona amid reports the out-of-favour striker wants to terminate his Chelsea deal early to get back to the Nou Camp. ",
        "Asked about his next move on the DjamLife Tiktok channel, Aubameyang said: 'I'd like to return to Barcelona… but we will see.' The Catalan champions-elect have been limited on the attacking front since Memphis Depay left the club to join Atletico Madrid in January - although that has not hit Barcelona's domestic performance.With an eye on next season, Xavi's side want a replacement striker, with Brazilian Vitor Roque among those names being touted as a possibility for Barca next season. Spanish outlet Sport report that Aubameyang is looking to terminate his deal at Chelsea to help set up a possible move to Barcelona for next season.",
        "After his Arsenal contract was cancelled by mutual consent, Aubameyang played 18 games for Barcelona in 2022, scoring 11 times. In September, Chelsea purchased the 33-year-old from the Catalan giants for £10.3m, but he has struggled to fit in at Stamford Bridge, and was left out of their Champions League squad for the knockout stages.Barcelona must sell players to make up a financial deficit, and their cash-strapped status means that they will struggle to buy players, but could take on players without a transfer fee - such as Aubameyang if Chelsea let him leave for nothing.The Gabonese striker has two years left on his contract at Stamford Bridge, but he had been in contact with his former Barcelona teammates about a potential return behind Robert Lewandowski.",
        "Chelsea won 3-1 win at Bournemouth on Saturday afternoon, to move 11th in the Premier League table.Barcelona are 13 points clear at the top of LaLiga, but do not play again until they travel to Espanyol next Sunday.  "
    ]
}