{
    "articleURL": "/wires/ap/article-12039489/Howard-U-picks-African-diaspora-scholar-president.html",
    "content": [
        "WASHINGTON (AP) - Howard University is turning to an experienced scholar of the African diaspora to serve as its new university president.",
        "Ben Vinson III, currently the provost at Case Western Reserve University in Cleveland, will officially take over as president from the retiring Wayne Frederick on Sept. 1. Vinson is a historian specializing in studies of the African diaspora, particularly in Latin America.His appointment comes at a crucial time for the historically Black university; the venerable institution is riding a wave of national prominence, with illustrious alumni, major funding boosts and high-profile staff additions.Vinson called the Howard position, \"the honor of a lifetime,\" in a statement put out by the university.\"Howard´s incredible legacy, its remarkable trajectory, combined with the fine talent of its faculty and staff, situate Howard at the uppermost echelons of higher education,\" he said.Vinson grew up partially in the D.C. area and graduated from high school in neighboring Alexandria, Virginia. His list of academic roles includes senior positions at Johns Hopkins University in Baltimore and George Washington University in Washington.",
        "\"I look forward to returning to the DMV (the greater D.C. area), which I consider home, and working with the broader campus community to fortify Howard and help build upon its incredible tradition of delivering excellence, truth, and service to greater humanity,\" he said.Long one of the jewels of the Historically Black College and Universities network, Howard is enjoying a season of plenty. High-profile alumni like Vice President Kamala Harris and the late \"Black Panther\" actor Chadwick Boseman have brought fresh prominence and rising enrollment numbers. Major benefactors like NBA star Steph Curry and MacKenzie Scott, the ex-wife of Amazon founder and Washington Post owner Jeff Bezos, have come to Howard with significant donations.",
        "The university has also leveraged its prominence to secure a string of headline-grabbing faculty members. Two of America´s most prominent writers on race relations, Nikole Hannah-Jones and Ta-Nehisi Coates, joined the university in 2021, and famed actress and Tony Award winner Phylicia Rashad now heads the College of Fine Arts."
    ]
}