{
    "articleURL": "/money/cars/article-12059637/The-used-cars-fallen-risen-value.html",
    "content": [
        "Value of some used SUVs and city cars has jumped by almost 30% since 2021The biggest price fallers are electric cars, with Tesla Model 3 and VW e-Golf More than half UK car owners think cars always go down in value The value of some used SUVs and city cars has jumped by almost 30 per cent over the last two years thanks to a combination of high demand and low stock.",
        "Research by second-hand sales platform Motorway also found that cars that can be used for trade, such as vans and private hire vehicles, are in high demand with dealers and can get great prices when sold in fair condition with relatively low miles throughout their lifespan.But despite average used car prices continuing to rocket, the value of some models has plummeted by more than a quarter in the last twelve months.The biggest price fallers are electric cars, as a combination of factors has dragged down EV valuations, including rising stock of used vehicles, increased supply of showroom-fresh cars and salary sacrifice tax break incentives to buy new.We reveal the list of risers and fallers below. ",
        "If you are selling your car, you will usually get the best price by doing so privately.Many people are put off doing this as they don't want the hassle of advertising it, or to deal with potential buyers, but a little effort can earn you a lot more.The typical alternative has been to part exchange a car when you get a new one, but this will often lead to the dealer offering you a low price - particularly as they may not actively want your old car.Quick sale services are likely to get you the lowest offer - although can compete with part exchange depending on the car.Another option is to find a dealer who actually wants your car. Motorway's service allows car sellers to get dealers to compete to offer them the best price. &gt; Check how much your car is worth with Motorway's value finder*This is Money has a commercial partnership with Motorway and will earn a small commission if you use it to sell your car. This does not affect our editorial independence.",
        "Prestige cars, ranging from the big powerful BMW 8 Series, to Audi's E-Tron electric SUV have also depreciated sharply in the last year, with Motorway putting that down to the fact 'they can be much more expensive to maintain than cheaper options'.It added: 'Not to mention that these aspirational models are upgraded and redesigned every few years, leaving the existing car stock on the road downgraded to \"runout\" status,' it added.Electric city cars previously in high demand, including the BMW i3 and Renault Zoe have dropped in price too. However, used petrol city cars like the Vauxhall Corsa or Citroen C1 have appreciated in value over the past couple of years, mostly because they tend to represent low mileage for age as they might have been used for making short, local trips.'City cars from trustworthy, but not overly expensive brands, can hold their value very well compared to larger, more luxury cars,' Motorway added.Its research also shows that many motorists do not track the value of their cars and might not be aware they could be raking in much more than anticipated from selling them. Nearly one-third of Londoners plan to sell their vehicle in the next six months because of costs associated with the confirmed ULEZ expansion alongside the rising cost of living. ",
        "But more than two fifths, or 41 per cent, of car owners have no idea how much their car is worth, while a further 52 per cent think cars always go down in value. Motorway's new data unveils that this isn't always the case, listing the best and worst cars you can have for resale value. Top 5 used cars with the biggest price increasesVauxhall Corsa Up by 14% from 2021 to 2022, then 16% from 2022 to 2023 ",
        "In terms of the biggest percentage risers, the Vauxhall Corsa, the top selling car in the UK, has recorded the most sizeable increase in price. It is also one of the models to have seen the most constant growth since 2021.Average values rose by 30 per cent over the last two years, having increased by 14 per cent between 2021 and 2022 and by another 16 per cent over the last year. Hyundai Santa Fe Up 9% from 2021 to 2022, then 20% from 2022 to 2023 ",
        "The Hyundai Santa Fe mid-size SUV has also gone up in price by almost 30 per cent in the last two years.However, it saw the biggest jump in average values last year, when prices rose 20 per cent, following a 9 per cent increase between 2021 and 2022.Vauxhall MokkaUp 7% from 2021 to 2022, then 22% from 2022 to 2023 ",
        "Average used values for the Vauxhall's Mokka have risen by 29 per cent over the last two years, with a 22 per cent increase in the last year alone.Mini One Up 8% from 2021 to 2022, then 20% from 2022 to 2023",
        "The average price for a used Mini One - the entry level model - has gone up by 28 per cent since 2021, with a 20 per cent jump in the last year alone.Nissan JukeUp 4% from 2021 to 2022, then by 21% from 2022 to 2023",
        "Average prices for the Nissan Juke have gone up by a quarter since 2021, but the biggest jump in values was last year, when they went up by 22 per cent.Top 5 used cars with the biggest price fallsTesla Model 3 Down 5% from 2021 to 2022, then down 33% from 2022 to 2023",
        "Used versions of the popular Tesla Model 3 - the second most-bought new electric car in Britain in 2022 - have crashed in value the most over the past couple of years. Average values, which fell 5 per cent between 2021 and 2022, tumbled 33 per cent in the last year. Volkswagen e-GolfDown 3% from 2021 to 2022, then down 26% from 2022 to 2023",
        "Another electric car, the Volkswagen e-Golf, has seen the second biggest drop in used valuations - a total of 29 per cent over the past two years.",
        "VW only briefly sold all-electric e-Golf models in the UK - between 2014 and 2020 - but it was culled from the range when it launched its ID.3 EV. BMW 8 Series Down 11% from 2021 to 2022, then down 14% from 2022 to 2023 ",
        "The luxury sports car BMW 8 Series has depreciated steadily over the past couple of years. Average used valuations have fallen 14 per cent in the last year, following an 11 per cent drop between 2021 and 2022.Audi E-TronUp 8% from 2021 to 2022, but then down 25% from 2022 to 2023",
        "Used versions of Audi's electric SUV, E-Tron, rose in price two years ago, but have plummeted by a quarter over the last year.BMW i3Up 6% from 2021 to 2022, but then down 22% from 2022 to 2023.",
        "Used models of BMW's smallest, cheapest and first-ever electric vehicle, the i3, rose in value by an average 6 per cent between 2021 and 2022, but plummeted 22 per cent in the last year.",
        "Every car depreciates at a different rate, and it's hard to predict what will happen long term, with a variety of factors and buyer sentiment coming into play.'Age, mileage, and condition are the three most commonly-quoted factors used to appraise a car's value, before looking at real-time prices being fetched in the used-car market,' Motorway says.'The typical annual mileage for most UK drivers is around 8,000 miles, and most cars are ready for the scrap heap by 150,000 miles. 'Condition slips with age thanks to wear and tear as well as accidental damage. 'For some cars, external factors such as market conditions can end up having as strong an effect on value than the age/mileage/condition matrix.'In fact, in 2021, shortages in new cars meant that many used cars temporarily increased in value – some, quite significantly. 'In order to stay on top of your car's value, and remain aware of how it changes over time, it's imperative to track the depreciation rate.'How to avoid car depreciation? 'There's no real way to affect the benchmarked value that your make and model represents in the automotive market,' says Motorway.'However, you can control the condition and mileage of your car in order to get the best price within your car's normal range. 'Even if your model typically loses a lot of value, you can present a \"best in class\" unit by taking good care of it, and the price you fetch will reflect that.'Motorway allows you to track the value of up to six-passenger vehicles for free, with 'Car Value Tracker' tool, which uses real-time sales data from Motorway's marketplace.&gt; Check how much your car is worth at Motorway**This is Money has a commercial partnership with Motorway and will earn a small commission if you use it to sell your car. This does not affect our editorial independence. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}