{
    "articleURL": "/sport/football/article-12048791/MLS-teams-crash-worlds-50-valuable-clubs-LAFC-ranked-16th-900M-valuation.html",
    "content": [
        "Data compiled by Sportrico shows the Red Devils are valued at $5.95B LA Galaxy, Atlanta United, Seattle Sounders, New York City FC also make the cut DailyMail.com provides all the latest international sports news The world's 50 most valuable soccer clubs are worth a total of $73billion, according to a new report, with 18 MLS club having landed on that list, surprisingly outgunning the nine in the English Premier League.",
        "Data compiled by Sportico shows Manchester United at the top of the pack, closely followed by Real Madrid and FC Barcelona, of La Liga, to complete the podium. The Red Devils are valued at $5.95B and have generated $776million in revenue during the 2021-22 season. The first U.S. team to emerge among a roll dominated by prestigious European clubs is Los Angeles FC -- one of the youngest teams in MLS, considering that the club was founded eight years ago. Owned by Brandon Beck, the co-chairman of gaming company Riot Games in the US, and Larry Berg, a former private equity senior partner, the Black and Gold are ranked 16th in terms of value ($900M) and revenue ($100M in 2021-22). ",
        "Arch rivals LA Galaxy, owned by American billionaire Philip Anschutz, are just a spot behind LAFC. Considered to hold the record for the most MLS Cup titles, having won five times in nine appearances, the Galaxy generated $100M in the 2021-22 season and is valued at $865M. The last club on the top 50 list to be valued at $1B or above is Inter Milan, of Serie A. The Nerazzurri, owned by several private firms, are ranked 15th overall - a spot before LAFC.Atlanta United trails the Galaxy by one spot, lying in 18th place among the top 50, to complete the podium of the most valued soccer clubs in both the world and the US. ",
        "Established nine years ago and owned by Arthur Blank - the co-founder of Home Depot - The Five Stripes are valued at $855M and generated $103M during the 2021-22 MLS season. Sportrico's rankings also include the Seattle Sounders (22nd), Toronto FC (24th) and D.C. United (25th). Among teams in the Big Apple, New York City FC comes out on top, as the club hold a $690M valuation, creating $55M in revenue last season. The club's ranked 27th in the top 50 list.The New York Red Bulls are No. 50 at $525M, generating $50M in revenue in 2021-22."
    ]
}