{
    "articleURL": "/wires/ap/article-12049487/Hard-read-Oregon-GOP-boycott-comes-reading-level.html",
    "content": [
        "SALEM, Ore. (AP) - Republicans blocking votes on bills about abortion, gun control and gender-affirming health care in Oregon this week have based their boycott on an obscure, 44-year-old state law that requires bill summaries to be written at the reading level of an eighth- or ninth-grader.",
        "GOP leadership says their walkout - which marked its third day on Friday - is about \"every bill\" but that two bills that would expand protections for abortions and transgender health care and place more limitations on gun ownership \"specifically don't qualify\" under the 1979 law.Democrats say Republicans didn't take issue with the writing style of bipartisan bills they backed earlier in the session until hot button issues were on the table. The fate of the contested bills is now unclear. Republicans have staged walkouts before, but this year legislators with 10 unexcused absences are disqualified for reelection, thanks to a new voter-approved constitutional amendmentSenate President Rob Wagner declared Friday's planned session a bust after 12 senators - none of them Democrats - stayed away. He accused them of trying to derail the abortion and gender-affirming health care measure.\"It is abundantly clear that there is a concerted effort to undermine both the people and bring the Legislature to a halt, in violation of the constitution of the state of Oregon,\" Wagner said from the podium. He said the Senate would attempt to convene every day, including weekends.Sen. Lynn Findley was one of two GOP senators who showed up on Friday, after being absent since the boycott started Wednesday. Asked if he returned because of the new constitutional amendment, he said: \"No, I've got work to do,\" then brushed off additional questions.",
        "The 1979 law that Republicans are justifying their stay-away with specifically requires bill summaries to have an eighth- or ninth-grade reading level - measured by a score of at least 60 on something called the Flesch readability test. It's unclear if it was ever followed or consulted for past bill summaries, but a Republican Senate employee recently dug it out the Capitol archives.\"It´s important that we follow the law because, if we´re passing laws today, are we just expecting in, you know, 20, 30, 40 years that people are just going to ignore the laws that we have on the books that we all passed? I don´t think we would appreciate that,\" said Senate Republican leader Sen. Tim Knopp.\"And so I´m pretty sure that the legislators that did that back then also wanted the law followed.\"The namesake of the Flesch test was Rudolf Flesch, a Vienna-born psychologist and readability expert specializing in the art of plain talk.Designed in the 1940s to measure how easy it is to read and understand a text, the readability test factors word and sentence length to determine a text's grade level. Scores range from 1 to 100, with 100 being the easiest to read and 1 being the most difficult. A score between 60 and 70 indicates an eighth- or ninth-grade reading level.",
        "Flesch's readability formula inspired lawmakers across the country in the 1970s to use the test to make insurance policies easy-to-read for everyday consumers. In 1975, scientist J. Peter Kincaid refined the formula into the Flesch-Kincaid Readability test to help U.S. Navy personnel improve technical documents.By 1979, Oregon lawmakers had figured out a way to use the Flesch test to shape legislation with plain language, too. Senate Bill 543 passed with overwhelming bipartisan support at the time.Gary Wilhelms, the Oregon house minority leader in 1979, was one of 31 bipartisan votes to pass the bill. On Monday, the 85-year-old Republican addressed the resurfacing of the law in a statement released by the GOP senators.\"Transparency prevailed then as it should today,\" Wilhelms said. \"The law is the law, and I'm glad the Senate Republican Caucus is attempting to enforce this statute today.\"In an interview with The Associated Press, Wilhelms said his memory of the political moment in 1979 that shaped the readability law is fuzzy. He described it as \"minor legislation.\"An early opponent was Republican Rep. Ted Bugas. At the time, he called the legislation \"a turkey\" with \"no virtues and no teeth.\"Justin Brecht is the senior policy analyst for the Senate Republican caucus who knocked the dust off the old, forgotten law. But even with that legislation, it would take more digging and a legal opinion to understand how it fit into the GOP playbook.",
        "\"Well, at first it was, `Well, what´s this statute that it says these measure summaries have to comply with?´\" Brecht said. \"Most don´t even know what the Flesch readability standard is.\"Republican lawmakers have until May 12 before those with 10 unexcused absences will be banned from reelection under a ballot measure passed by 70% of Oregon voters last year.___Komenda reported from Seattle. Associated Press writer Claire Rush in Salem, Oregon, also contributed.___The Associated Pressreceives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP´s democracy initiative here. The AP is solely responsible for all content."
    ]
}