{
    "articleURL": "/tvshowbiz/article-12042443/Vanessa-Feltz-61-attempts-STRADDLE-Jack-Whitehall-34-flirty-exchange.html",
    "content": [
        "Jack Whitehall and Vanessa Feltz enjoyed a very flirty exchange on Wednesday's episode of This Morning. ",
        "The pair's cheeky relationship goes back years, yet Jack quipped that the crew on the ITV daytime show would always try and keep them apart. Appearing solo on the show to discuss his tour, talk soon turned to Vanessa, with Jack, 34, quipping to Holly Willoughby and Phillip Schofield: 'You stick me over there in the pen and she's on the sofa because we're not allowed to sit together, which I think is outrageous.''I know why you do it. It's because if the viewers saw me and Vanessa Feltz together on the sofa then they'd see our fizzing chemistry and bubbling sexual chemistry - then you two would be out of a job.'Yet to his surprise, Vanessa, 60, then came bounding out from the wings, running over to cuddle the comedian.  ",
        "Vanessa quipped: 'The chemistry is fizzing, I can barely contain it. 'The things I want to do right now, I can't describe. Well, I could describe, but I better not.'The newly-single star - who recently split from Ben Ofoedu after 16 years together - went on to jokingly pretend to straddle the star before sitting down and giving him another cuddle. Jack is no stranger to mentioning Vanessa on the ITV show, previously discussing their flirty encounter. He said: 'I was flirting with her giving her the eye, no one told me she was on to talk about animal bereavement!",
        "'It always happens to me, earlier on I was having a cigarette in my dressing room and the producer caught me!Back in May 2020, Vanessa playfully joked she would love a hall pass with Jack Whitehall after he lusted over her when she did a racy lingerie shoot. The This Morning agony aunt said she was sure her then-fiancé Ben would understand if Jack joined her for a night of passion.",
        "While in December 2019, Jack said Vanessa had given him heart palpitations as she showed off her incredible 3.5 stone weight loss in a very sexy photoshoot. Of Jack's crush, Vanessa told New Magazine at the time: 'I know and it's entirely mutual. I'm delighted, thrilled and honoured, if he wanted to come and join me in lockdown, I'm sure Ben would understand. 'I'd like a hall pass for one interlude with Jack Whitehall, that would be fantastic.' While Jack may joke about his love for Vanessa, in reality he's loved-up with model Roxy Horner. The smitten couple have now been dating for more than two years and reside in Jack's £17.5million, five-bed home in Notting Hill with their pooch Coco.In March last year, Roxy praised Jack for being her 'rock' amid her Type 1 diabetes diagnosis.'Jack's been my absolute rock, he's so lovely. He was there when I got diagnosed. My parents and my family live in Australia, so he has been my family. We're amazing,' she told The Sun."
    ]
}