{
    "articleURL": "/wires/aap/article-12053201/Why-Croker-wouldnt-listen-Stuarts-retirement-call.html",
    "content": [
        "Canberra veteran Jarrod Croker remembers the day Ricky Stuart sat him down and told him he needed to retire from the NRL.",
        "It was late 2021, the Raiders were in the league's COVID-enforced biosecurity bubble and Croker's body was failing him.The Raiders captain had been battling a string of knee injuries since the 2020 pre-season and, by his own admission, was losing his way on the field.Stuart was torn, feeling unable to drop Croker to reserve grade out of respect, but unable to subject him to the rigours of the NRL for another season.\"His body was just not coping with the loads and he was in a position where I was feeling the pain that he was under,\" Stuart recalled.Closing in on 300 NRL games and with two years to run on his contract, the chat left Croker with plenty to consider.\"I just had to go back and think about what I really wanted to do,\" he said.\"At that stage, I think I was 30. I still felt like I had a lot to give and wasn't ready.\"I just wanted to get the knees right and prove that I could still go.\"Proving that meant undergoing revolutionary stem-cell surgery which, as Croker saw it, was the only way to resurrect his troublesome knee and his rugby league career.The procedure aims to trigger damaged tissue to begin repairing itself by injecting stem cells into the knee. It can yield mixed results.",
        "\"If it didn't work, I wouldn't have been able to keep playing,\" Croker, 32, said.\"I reckon my knee went from 50 to 85 per cent with the stem cell (treatment).\"Despite Stuart's initial concerns, Croker toiled away in reserve grade for the beginning of the 2022 season - something he never felt too proud to do - before finally returning to first-grade that May.But Croker managed only one appearance before suffering a season-ending shoulder injury that required more surgery.Croker became used to Canberrans stopping him in the street to ask if he had retired yet, such was the extent of his absence.With his beloved Raiders down 1-4 to begin 2023 and outside backs Xavier Savage and Nick Cotric in the casualty ward, Croker's teammates began bugging Stuart to give the veteran another chance.\"If they want to play with a bloke, I'm only sitting in the box,\" Stuart said.\"They're out there with him, they know better than me.\"The coach agreed, and the Raiders haven't lost since.Croker grabbed his first NRL try in two years during the one-point defeat of the Dolphins last week and scored what proved the decisive four-pointer in Canberra's 34-30 Magic Round win over Canterbury.\"It's been a while since I've scored a try like that,\" Croker said.",
        "\"In front of a big crowd, my wife and kids were in the crowd. It was pretty special.\"Croker is now three weeks away from becoming the second man in history to play 300 Raiders games.But with one eye on his past and the other on his body, Croker is not yet allowing himself to dream of the milestone.\"When you're like this, you can't take your foot off the pedal,\" he said.\"I'm just happy to be back playing, happy to get the chance to play with Papa (Josh Papali'i) and Jack (Wighton), Rapa (Jordan Rapana), the boys I've spent the majority of my life with.\"It's not being a big hero, beating my chest saying, 'I'm not going to give up'. I just love playing footy and I love playing for the Raiders.\""
    ]
}