{
    "articleURL": "/femail/article-12039927/The-shortcuts-change-way-eat-good-Glucose-Goddess-Jessie-Inchauspe.html",
    "content": [
        "Long-held assumption that eating sweet or starchy for breakfast is importantBut the science shows that starting the day this way does the exact oppositeAre you a martyr to mood swings, brain fog and outbursts of irrational anxiety? Do you drop into bed at night feeling exhausted but unable to sleep?",
        "Perhaps you have just become accustomed to feeling under par, and you've learned to rely on coffee and sugary snacks to keep you functioning. But what you probably won't have done is traced these symptoms back to what you ate for breakfast.And no wonder — because we don't instantly feel the effect. Metabolic processes take hours to unfold, compound over time and become mixed with all the other things that happen in a day, so connecting the dots takes a bit of detective work.As a biochemist, I have long been fascinated by the impact fluctuating blood sugar levels can have on our health and mood, but it was only when I started measuring my own blood glucose levels using a continuous glucose monitor (which reads glucose levels in the blood through a very thin wire piercing the skin on the upper arm) that I made the connection between what I ate for breakfast and how I felt throughout the rest of the day.And what I discovered turned everything I thought I knew about healthy eating on its head.",
        "There is a long-held assumption that eating something sweet or starchy for breakfast is important to give our body energy. But the science shows that starting the day this way does the exact opposite.",
        "Eating sweet and starchy foods give us pleasure by releasing dopamine in our brain but because starches and sugars turn to glucose during digestion, they lead to a glucose spike.",
        "If you can't bear the thought of life without Honey Nut Cornflakes (or similar) eat a bowl as a dessert after lunch or dinner when the sugar will have much less impact on your glucose levels.",
        "We may be well-intentioned, thinking that breakfast gives us energy, when in fact it hurts our body's ability to make energy efficiently, making us tired and kicking off all kinds of side effects. We eat sugary breakfasts over and over again yet feel more and more chronically fatigued.For one thing, the glucose spike from a sweet breakfast has been shown to damage the energy-producing centre of our cells (our mitochondria). And the rapid spike in glucose is almost always followed by an equally dramatic fall hours later (as a rush of insulin is released to remove excess glucose from the blood) which drops you into an energy slump that can only be rectified by a strong coffee and a mid-morning biscuit. This sets you up for a cycle of spikes and dips all day: cravings, fatigue, sugar addiction.Unfortunately, Western diets lean towards breakfasting on glucose-spiking foods such as cereal, toast and jam, croissants, granola, muesli bars, oats and fruit juice — even fruit smoothies and acai bowls are composed of mostly starch and sugar.",
        "As a child I'd wolf down pancakes slathered in Nutella before rushing out of the house, much to the dismay of my mother who thought she was being healthier by only sprinkling a little sugar over her bowl of Special K.But when I tested the impact of my mother's favourite breakfast on my blood glucose levels I found it triggered a massive spike, followed by a big crash two hours later. Just as bad as the spike and drop from my chocolate pancake. A chocolate croissant has an equally dramatic effect — pain au raisin, too.The wrong breakfast can deregulate our glucose levels for the rest of the day, so lunch and dinner in turn go on to create ever bigger spikes.",
        "Typically, granola is packed full of starch and sugar, causing a huge breakfast glucose spike. This gets its sweetness from whole fruit, and uses Greek yogurt to pack it full of protein.Makes: 4 portions1 teaspoon coconut oil1½ teaspoons ground cinnamon100g pumpkin seeds 50g pecans 50g unblanched almonds or hazelnuts (or use blanched, if you prefer) + salt Preheat the oven to 200c/180c fan. Place coconut oil in a medium bowl and melt in the microwave. Stir in the cinnamon and a pinch of salt. Add the pumpkin seeds, pecans and almonds or hazelnuts and toss them in the cinnamon mixture. Transfer the mixture to a baking tray lined with baking paper and toast in the oven for 7 minutes. Remove the nuts and seeds from the oven and leave them to cool. Once cold, transfer them to an airtight container and store them for up to 2 weeks. To serve, put a good dollop of yogurt in a bowl and top with 2–3 tablespoons of the granola and a small handful of berries.",
        "I uncovered research that shows your bowl of 'healthy' cereal can take blood sugar up to shockingly high levels previously thought to be only attainable by people with diabetes. More shocking still? The most popular cereal brands that we feed our kids before school contain three times as much sugar as the one used in that study.Blood sugar roller coasterWhen we eat starchy and sweet food, our body converts it to glucose in the blood so it can be delivered around the body to cells where it is used for energy. Eat too much sugary or highly processed food (such as breakfast cereal) and your blood glucose levels will spike. And unfortunately, these spikes carry consequences that can harm both our physical and our mental health.The body's natural response to a glucose spike is to release the hormone insulin which takes that glucose out of the blood and stores it in our liver, muscles and as fat for possible future use — that's one of the ways we get fatter. It is a carefully calibrated system which works well when blood glucose levels are relatively stable. But sweet foods can cause dramatic spikes, followed by alarming drops in glucose.This blood sugar roller coaster can leave you feeling tired, low, tormented by cravings and insatiable hunger, and, unbeknown to you, it will also be triggering a state of chronic inflammation which accelerates the ageing process and leaves you vulnerable to disease. ",
        "It can even affect hormone levels, making menopausal symptoms worse, and in the long-term this inflammation can leave you more vulnerable to life limiting diseases such as type 2 diabetes and Alzheimer's disease.Through wearing the sort of continuous blood glucose monitor diabetics often use, I have been able to identify many supposedly health foods which can damage your health.I have also been able to record how wonderfully flat your glucose curve can be when you follow my hacks. When I first started posting graphs on Instagram that showed the blood glucose impact of different food combinations, my following grew rapidly.Now, I've got a thriving community of 1.8 million followers happily keeping their blood glucose levels stable by following my advice — and finding it makes a huge difference to the way they feel.In this series from my new book, The Glucose Goddess Method, I will share some of the delicious recipes I have devised to get you off the blood sugar roller coaster for good by flattening your glucose curve, starting with the savoury breakfasts that hold the key to keeping blood sugar levels stable throughout the day.Glucose and wrinklesThe inflammatory process triggered by spiking glucose accelerates a process called glycation in every cell in the body. ",
        "Although glycation is a natural part of ageing, if it happens too fast, the body can start to deteriorate: joints can become inflamed as osteoarthritis sets in, organs can start to suffer, and your brain function can fade.",
        "As I will explain in Monday's Daily Mail, drinking a tablespoon of vinegar helps to flatten glucose spikes and can be added to a herbal tea made with a teaspoon of turmeric and a pinch of black pepper. ",
        "But the place you might notice glycation most clearly is on your face. Glycation and inflammation are responsible for damaging the collagen that holds our tissues together, causing sagging skin and wrinkles. Glucose spikes can exacerbate skin conditions such as acne, rosacea, eczema and psoriasis, too.Although there are many reasons any one of us might age faster than another, too many uncontrolled glucose spikes play their part.Luckily, research shows that when we eat in such a way that flattens our glucose curves, inflammation throughout the body is tamed, and it is clear that getting glucose spikes under control can improve the health of our skin.Switch from sweet to savouryBy switching to a savoury breakfast your glucose levels will steady and those mid-morning biscuit cravings will subside. You'll unlock energy in your cells, prevent your brain from falling into craving cycles and tame your hunger.You'll also create smaller spikes for lunch and dinner and get your glucose levels on an even keel. Just this one simple change will help slow the aging process throughout your body and you will also help your skin age more slowly — so fewer wrinkles, too.The 10-minute movement trickOne clever way to flatten the glucose spike from a meal is to move for ten minutes after eating.You could pop out for a quick walk, run up and down a few flights of stairs, even busy yourself tidying up the kitchen — playing with the children or grandchildren counts too, as long as you're moving.The key here is to get some of the muscles in your body activated so that they soak up excess glucose in your blood from your last meal.",
        "The more and the harder a muscle contracts, the more energy it needs.The more energy it needs, the more glucose it will be sucking out of your blood.If you stay sitting at the table when you finish eating, or lay in front of the TV, the glucose from your meal is likely to cause a spike.",
        "If you don’t eat breakfast, just make sure the first meal of the day (whatever time it is) is savoury. Keep away from pastries and say no to porridge — oats do not make a good savoury breakfast. They are mostly starch and create big glucose spikes.",
        "But if you move around a bit after eating, some of the glucose you have just eaten will be used up by your muscles.If you've got to walk the dog, try to time it for after a meal. Need to pop to the shops? There's no time like after lunch.Your rising glucose levels give you a 90-minute window, so aim to get up from the table and do something active within 90 minutes of eating (even if that means staying in your seat for 80 minutes and setting an alarm to remind you to get active in the final ten minutes).You don't even have to stand up to gain the benefits — as long as you can get enough muscles working to soak up the glucose.So why not keep a weight or heavy object by your couch, and if you watch TV after dinner, do some bicep curls with it.Recent studies show seated calf raises work, too: while sitting down and with both feet on the ground, holding on to the table with your hands, press through the balls of your feet to raise your heels and set them back down. Do this for 10 minutes.This activates your soleus, a calf muscle that is particularly helpful in soaking up glucose from the blood.",
        "Adapted from The Glucose Goddess Method by Jessie Inchauspé, to be published by Penguin Books Australia on 16 May at RRP $36.99. You can pre-order your copy here. ",
        "1. Make protein the centrepiece of  your breakfast — it will keep your glucose levels steady, and it will keep you feeling satiated. Choose from Greek yogurt, tofu, meat, cold cuts, fish, cheese, cream cheese, protein powder, nuts, nut butter, seeds and eggs (scrambled, fried, poached or boiled) or any leftover protein from last night’s supper. It is perfectly OK to eat eggs every day.2. Include healthy fats. Scramble your eggs in butter or olive oil and add slices of avocado, or stir five almonds, chia seeds or flaxseeds into your Greek yogurt (choose 5 per cent fat, not fat-free).3 Add fibre when possible. It can be challenging to accept the idea of vegetables for breakfast, but you get extra points if you do. Mix spinach into your scrambled eggs or avocado on your toast, and experiment with mushrooms or tomatoes, courgettes, artichokes, sauerkraut, lentils or lettuce, nuts and seeds.4. Nothing sweet (except whole fruit if you like). No dried fruit or fruit juices, no honey, agave or other sugars. Add a little whole fruit for flavour if you enjoy it, but nothing else. You can eat sweet food at any other time — just not for breakfast.5. Add starches if you want. Bread, potatoes or a tortilla are OK on the side if they work with your other ingredients, but they shouldn’t be eaten on their own for breakfast. You can eat all the carbs you want during the rest of the day.6. Make it substantial. A good savoury breakfast should keep you feeling full for four hours. If you feel hungry before lunch, you can up the quantities and double or even triple your breakfast recipe. Plan what you are going to have the night before so that you don’t get tempted into reaching for something sugary in the morning."
    ]
}