{
    "articleURL": "/wires/reuters/article-12060911/Shares-rise-dollar-flat-ahead-U-S-inflation-data.html",
    "content": [
        "Dollar under pressure",
        "Global equity indexes edge upBanks tighten credit in Fed surveyBank of England seen hiking again this weekBy Herbert Lash and Amanda CooperNEW YORK/LONDON, May 8 (Reuters) - A gauge of global equity markets rose and the dollar was mostly flat on Monday as expected talks in Washington about the debt ceiling raised concerns while U.S. inflation data later this week should add clarity on Federal Reserve monetary policy.Treasury yields rose on increased optimism that the worst stresses in the U.S. regional banking system may be over, while gold edged higher on the tepid dollar and crude oil advanced about 2%.U.S. President Joe Biden and top Republicans and Democrats from Congress are set to sit down this week to try to resolve a three-month standoff over the $31.4 trillion U.S. debt ceiling and avoid a crippling default before the end of May.Biden is due to meet at the White House on Tuesday with Republican House of Representatives Speaker Kevin McCarthy for the first time since Feb. 1.\"Unfortunately it's probably market turmoil that's going to create the political cover for Biden and McCarthy to come up with some kind of a deal,\" said Jack Ablin, chief investment officer and founding partner at Cresset Wealth Advisors.",
        "\"My sense is it may mean some market disappointment and volatility in order to make that happen,\" he said.Even though the markets have done well this year, it's been a narrow market, said Rhys Williams, chief strategist at Spouting Rock Asset Management.\"I think 20 stocks are most of the gain, if not all of the gain, of the S&amp;amp;P 500. The average stock has not done so well,\" Williams said.MSCI's gauge of stocks across the globe, which is tilted toward U.S. assets, gained 0.19%, while in Europe the pan-regional STOXX 600 index rose 0.35% as non-U.S. stocks are seen outperforming in the months ahead.On Wall Street, the Dow Jones Industrial Average fell 0.2%, the S&amp;amp;P 500 gained 0.02% and the Nasdaq Composite added 0.1%.The dollar remained relatively weaker against most of its major peers. The dollar index rose 0.079%, and the euro fell 0.15% to $1.1002.Sterling, which has gained 4.4% against the dollar this year, earlier hit a 12-month high of 1.2668 ahead of an expected Bank of England rate increase on Thursday.Friday's robust U.S. payrolls report has prompted investors to dial back their expectations for the timing and size of the Fed's first interest rate cut. Wednesday's consumer price data is expected to show core inflation slowed moderately.",
        "\"The market is ready for a good slowdown here, despite the jobs number we saw on Friday,\" said Tom di Galoma, co-head of global rates trading at BTIG in New York.\"The Fed is probably done. I don't think they're going to be tightening any further,\" he said. \"There was enough last week to tell me that the Fed is in a pause.\"The two-year Treasury yield, which typically moves in step with interest rate expectations, was up 8.5 basis points at 4.007%.The gap between yields on two- and 10-year notes , seen as a recession harbinger when the short end of the yield curve is higher than longer-dated securities, was inverted at -49.0 basis points.Money markets show investors expect U.S. rates to have now peaked and could end this year at about 4.35%.The dollar has fared better on the yen as the Bank of Japan remains the only central bank in the developed world to not have tightened policy.The dollar rose 0.22% against the yen.U.S. banks tightened credit standards over the first months of the year and saw weakness in loan demand from businesses and consumers, Fed survey data released on Monday showed in the latest indication that higher central bank interest rates were starting to bite in the finance sector.",
        "The Fed's quarterly Senior Loan Officer Opinion Survey, or SLOOS, among the first measures of sentiment across the banking sector since the recent run of bank failures, showed a net 46.0% of banks tightened terms of credit for a key category of business loans for medium and large businesses compared with 44.8% in the prior survey in January.Bullion regained ground after a sharp retreat in the previous session, ahead of the inflation data that could shed light on the outlook for U.S. interest rates.Spot gold added 0.3% to $2,022.37 an ounce.Oil rose as U.S. recession fears eased and some traders took the view that crude's recent price slide was overdone with three straight weekly declines for the first time since November.U.S. crude rose $1.82 to settle at $73.16 a barrel, while Brent settled up $1.71 at $77.01.(Additional reporting by Wayne Cole; Editing by Alison Williams, Christina Fincher, Jonathan Oatis and Cynthia Osterman)"
    ]
}