{
    "articleURL": "/wires/reuters/article-12042693/US-Senator-Rubio-seeks-probe-Fords-Chinese-partnership-nickel-plant.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 3 (Reuters) -U.S. Senator Marcio Rubio on Wednesday asked the Biden administration to investigate Ford Motor Co's plan to partner with PT Vale Indonesia and China's Zhejiang Huayou Cobalt in a $4.5 billion nickel processing plant in Indonesia.Rubio, who is the top Republican on the Senate Intelligence Committee, said the venture threatens U.S. national security and asked the Justice, State, Treasury, Commerce, Homeland Security departments as well as the Securities and Exchange Commission to investigate the plan.Ford had no immediate comment.Rubio's letterto Secretary of State Antony Blinken cited Huayou calling the project \"one of the flagship projects under the Belt and Road Initiative\" when Ford announced the deal in March.Rubio said the Chinese Belt and Road Initiative is one of the primary mechanisms China \"uses to spread its influence around the world and gain control of critical infrastructure and natural resources.\"The investment is Ford's first in Indonesia and underscores growing appetite among automakers for raw materials used in producing electric vehicle (EV) batteries, which account for about 40% of a vehicle's sticker price, aiming to cut costs and close the gap on EV market leader Tesla.Ford´s efforts \"to increase the exposure of the United States to depend on supply chains controlled by companies subservient to the CCP has grown more brazen and visible over time, especially with regard to critical minerals and electric vehicle (EV) batteries,\" Rubio said a in a letter to Attorney General Merrick Garland.",
        "Indonesia, which has the world's biggest nickel reserves, has been trying to develop downstream industries for the metal, ultimately aiming to produce batteries and electric vehicles.Vale and Huayou began construction of the plant in November and commercial operation is expected to start in 2026.Rubio in March introduced legislation that took aim at Ford's deal to use technology from Chinese battery company CATL as part of the automaker's plan to spend $3.5 billion to build a battery plant in Michigan.He had already asked the Biden administration to review the deal to use technology from CATL.Rubio wants to block tax credits for electric vehicle batteries produced using Chinese technology, in a bid to prevent Chinese companies from benefiting.(Reporting by David Shepardson, editing by Deepa Babington)"
    ]
}