{
    "articleURL": "/sport/football/article-12056351/Atalanta-0-2-Juventus-English-youngster-Samuel-Iling-Junior-scores-Serie-goal-debut.html",
    "content": [
        "Samuel Iling-Junior scored his first Serie A goal as Juventus beat Atalanta 2-0 It was also the English youngster's first full debut after joining the club in 2020Dusan Vlahovic scored late on to secure the win and put Juve second in the tableSamuel Iling-Junior opened the deadlock for Juventus, scoring his first Serie A goal in what was a dream full debut for the club, to help his side beat Atalanta 2-0 on Sunday. ",
        "The home side battled hard to come back in the second half, and while they did look like they could nick a late equaliser, they failed to convert their chances, with Dusan Vlahovic scoring in the eighth minute of injury time to seal the win for the Old Lady. After a cagey first half, it took nearly an hour of play for the first goal to come. But it was a special moment for the young English prospect, who netted his first Serie A goal in the 56th minute. After battling hard to regain possession in the middle of the pitch, the 19-year-old advanced on the Atalanta penalty area and slid a pass through to Adrien Rabiot on the left wing. The Frenchman then played a fast cross into the box that bounced off several players before falling to the young English star, who tapped in to give the away side the lead. ",
        "The former Chelsea academy player moved to Juventus in 2020 and has worked his way through the ranks at the club's youth system to break into the first team to make nine Serie A appearances this season.While Iling-Junior made no mistake in converting his chance, the story of the match was how both sides failed to really test both Wojciech Szczesny and Marco Sportiello in goal, missing several notable opportunities inside the first 45 minutes. ",
        "Angel Di Maria had a close chance early on, but curled his shot wide of the left upright. Giorgio Scalvini then came close for Atalanta, but also failed to keep his header on target, with the ball glancing just off the post.Marten de Roon hammered a thunderous shot into the box from around 25-yards soon after, and shouts for a went up for a hand ball went up amongst the home side but the referee did not buy it.In the second half, substitute Jeremie Boga had his afternoon cut short early, after he was helped from the field after suffering a nasty looking ankle injury having unfortunately only just come on ten minutes earlier.  ",
        "Luis Muriel was brought on in the 60th minute of the match for Mario Pasalic, and provided the inspiration the home side needed, driving through the centre of the pitch past Juve defenders but narrowly slid his thumping shot wide of the goalmouth. And Atalanata started to gain a footing in the match, mounting several attacks on Juventus and looked as though they could pull a goal back late on in the match.  Former Chelsea defender Davide Zappacosta looked to have clinched a last-gasp equaliser, but his driving low effort shot crashed against the post, much to his frustration. ",
        "Despite their best efforts, Atalanta, who had 24 attempts during the game, couldn't muster up an equaliser. In the dying embers of the match, Vlahovic would capitalise on a late counter-attack and seal the victory for the away team, blasting an impressive shot past Sportiello from outside the penalty area.The win sees Max Allegri's side move to second in the Serie A standings, two points clear of Lazio who were defeated 2-0 by AC Milan on Saturday. Atalanta, meanwhile, will stay sixth in the table behind Milan, who go three points clear of them in fifth place. ",
        "ATALANTA: (3-4-3) Sportiello (GK); Toloi; Djimsiti; Scalvini; Maehle; De Roon; Ederson (Boga 50'; Soppy 65'); Zappacosta; Pasalic (Muriel 60'); Koopmeiners; Zapata.  Subs not used: Musso (GK); Rossi (GK); Demiral; Okoli; Rossi. Goals: NoneBookings: MaheleCoach: Gian Piero GasperiniJUVENTUS: (4-2-3-1) Szczesny (GK); Danilo; Rugani; Alex Sandro; Cuadrado; Fagioli; Locatelli; Rabiot; Iling-Junior; Di Maria; Milik.Subs not used: Perin (GK); Pinsoglio (GK); Barbieri; Bonucci; Bremer; Chiesa; Gatti; Kean; Kostic; Miretti; Perin; Pogba; Soule; Vlahovic.Goals: Iling-Junior (56'); Vlahovic (90+8')Bookings: Rabiot; Vlahovic.Coach: Max AllegriReferee: Daniele Doveri Player of the Match: TBAVenue: Gewiss StadiumAttendance: TBA",
        "Full match report to follow... "
    ]
}