{
    "articleURL": "/news/royals/article-12052989/Camilla-use-controversial-ivory-sceptre-coronation.html",
    "content": [
        "The 3ft sceptre has been a fixture of the ceremony since 1685 Anti-hunting campaigners have called for it to be bannedCamilla has been cheered by African conservationists for not backing down over the use of the Ivory Rod with Dove during the Coronation service.",
        "The 3ft sceptre has been a fixture of the ceremony since the crowning of James II in 1685.Despite the ivory having been taken from an elephant that had been dead for centuries, anti-hunting campaigners have called for it to be banned.Camilla has refused to bow to pressure and will be adorned with it today.Dr Rodgers Lubilo, chairman of the Southern Africa Community Leaders Network, said: ‘I am pleased Queen Camilla has ignored the naysayers to wear this beautiful item.",
        "'This can only help conservation.’He also slammed the activists as ‘totally out-of-touch with the reality that ivory is a vital economic resource with important historical as well as cultural values’.Dr Lubilo said: ‘The demand by the animal rights groups that Queen Camilla should not use an historic ivory rod is totally unreasonable.‘Even our own chiefs use ivory and other animal parts such as tails and skins as symbols of the greatness and richness of African culture and their role in preserving it.’Siyoka Simasiku, Director of the Ngamiland’s Council of Non-governmental Organisations in Botswana, also welcomed the move. He said: ‘In Southern African countries, the ivory of elephants that die of natural causes is a symbol and source of our communities’ livelihood.’",
        "They say that the money generated from the ethical trade of ivory from elephants that die from natural causes can fund vital animal conservation work.",
        "It came after Chieftainess Rebecca Banika of Botswana cheered the move by Camilla.‘It’s indeed a good move for the Queen of England to show support for the need to use wildlife products such as ivory,’ she said.‘We see this as support for communities co-existing with wildlife such as those in elephant-over-populated Botswana. We need trade in surplus ivory to help us survive.’The sceptre was made by the royal goldsmith Sir Robert Vyner for Mary of Modena and has been used to crown every Queen Consort since."
    ]
}