{
    "articleURL": "/wires/aap/article-12052765/Liberal-MP-Stuart-Robert-retires-triggers-election.html",
    "content": [
        "The federal opposition will pre-select a local candidate to run in the Fadden by-election following the shock retirement of Liberal MP Stuart Robert.",
        "The shadow assistant treasurer on Saturday announced he was stepping away from parliament after 16 years to focus more on family.\"My family has stood with me throughout this time, through thick and thin,\" Mr Robert said in a statement.\"It is now time for my family to have a husband, a father and a son to stand by them.\"Mr Robert served as the minister for veterans' affairs, the minister for the national disability insurance scheme and the minister for government services under the Turnbull and Morrison governments.Opposition Leader Peter Dutton thanked Mr Robert for his service, saying he worked hard across a number of portfolios.\"He has contributed significantly to his own local electorate in Fadden. He's been a central figure in the Morrison government,\" Mr Dutton told reporters in Tasmania.Mr Robert's retirement will trigger a by-election in the north Gold Coast seat of Fadden.Former Liberal senator Amanda Stoker has already been touted as a potential candidate but Senator Anne Ruston brushed off the suggestion.\"I'm sure a really strong field of fantastic candidates in Queensland will put their hand up,\" she told reporters on Saturday.Mr Dutton also said the Liberals would look local for a candidate.\"I've already heard a few names mentioned about prospective candidates,\" he said. \"We'll pre-select somebody who understands that part of the goalpost.",
        "\"And we should be in that seat, frankly, pre-selecting somebody who can be a future cabinet minister or leader of our party.\"In his retirement statement, Mr Robert acknowledged his time in parliament had \"not been the smoothest ride\".He has faced allegations he was linked to a Canberra lobbying and consulting firm that helped companies secure lucrative government contracts.A government review found 19 contracts needed further investigation over a lack of appropriate record keeping and were not considered as having delivered bang for buck.Mr Robert denied any wrongdoing, saying there were no findings of clear misconduct.He also fronted the Royal Commission into the Robodebt Scheme in March, where he admitted he had personal doubts about the way debts were being calculated.Mr Robert said he continued to publicly back the Centrelink scheme due to his obligations as a cabinet minister.The Liberal MP on Saturday maintained he was proud of what he had achieved in politics, saying it had been a privilege to serve the Australian people.He also called for a more civil federal parliament.\"I do fear division has well and truly entrenched itself in the current parliament,\" Mr Robert said.\"A kinder and gentler parliament it is not.\"Mr Robert said he had some final duties to fulfil over the coming weeks before finishing up.",
        "The Fadden by-election will be another test for the federal opposition, who lost the Aston by-election in Victoria earlier this year.It was the first time a government won a seat off the opposition at a by-election in more than 100 years."
    ]
}