{
    "articleURL": "/wires/ap/article-12053361/WV-candidates-fighting-2020-voters-not-much.html",
    "content": [
        "CHARLESTON, W.Va. (AP) - Some Republican officeholders in West Virginia are already revving up campaigns for governor in 2024. But first, they have to sort out what happened in 2020.",
        "Years after Democrat Joe Biden was declared the White House winner, Secretary of State Mac Warner and Attorney General Patrick Morrisey say they remain concerned his victory was not legitimate. They persist in those views despite repeated investigations, audits and court cases concluding there was no evidence of widespread voter fraud or improper counting that could have changed the results in Donald Trump's favor.Warner, who runs elections in West Virginia, toed the line for more than two years before going on a talk show this week to say he can \"now firmly say\" he believes the election was stolen.\"That election was thrown, it was stolen, and we should not rest easy,\" he said on Talk Radio WRNR in the state's Eastern Panhandle.Asserting that the 2020 presidential race was stolen has been a staple for some Republicans. Trump himself has fanned those accusations, though he has recently shifted his complaints somewhat from specific disputes about voting procedures in swing states. He has embraced broader claims that tech companies, the media and federal intelligence officials colluded to cover up incriminating information found on the laptop of Biden´s son Hunter.It's these allegations Warner says he finds credible, pushing past the denials by social media executives and federal law enforcement that they were pressured by Democrats to suppress the story. In an interview this past week, Warner called the alleged actions \"treasonous\" and said they need to be examined more deeply before the next election.",
        "But even in West Virginia, where Trump twice carried every county, some voters see recurring concerns about 2020 as nothing more than a GOP check-off.\"It doesn´t matter what Republican is going to be in the field, they´re all going to say that 2020 was fake,\" said Trevor Southerly, a 20-year-old community college student from Moorefield. \"It´s a political move, and they have to make the move or they´re going to lose.\"Southerly said what draws him to Morrisey is his support for school choice programs and expanding West Virginia's energy production workforce.The Republican Party, Southerly said, has become too focused on \"national issues\" and talking points instead of what matters to people at the local level - especially in West Virginia, which consistently ranks among the highest in the nation for poverty and overdose death rates and among the lowest for life expectancy and educational attainment.He thinks Morrisey has better plans to address those issues.Serving as attorney general since 2013 has given Morrisey an opportunity to promote his self-described role as the state's \"conservative fighter.\" He has defended laws passed by the Republican-controlled Legislature on school choice, transgender participation in sports and abortion.Before that, he joined a lawsuit to overturn the 2020 election that was dismissed by the conservative-dominated U.S. Supreme Court.",
        "In an interview this past week, Morrisey repeated past claims about \"significant irregularities\" in the 2020 election. He refused to say definitively whether he believes Biden's victory was fraudulent.\"He´s serving as the president of the United States. We know that that´s what´s going on right now,\" Morrisey said.After West Virginia was the last in the nation to certify a presidential winner in 2020, Army veteran Warner said he supported the state´s involvement in the legal effort to challenge the results.Warner also made an appearance at a \"March for Trump\" rally in Charleston after the election, where he appeared to be holding up a \"Stop the Steal\" sign.Warner was one of the first GOP election officials to opt to withdraw from the Electronic Registration Information Center, a nonpartisan group with a record of combating voter fraud. Trump has characterized it as a \"terrible\" system that \"´pumps the rolls´ for Democrats and does nothing to clean them up.\"But Warner never said publicly before this week that he believes the election was stolen, saying that view has crystallized in his mind as new information has come out.But even voters who agree say other issues matter more.Ken Drum, who leads the GOP in Harrison County, said he doesn't believe Biden won the race legitimately, but his top concern is finding a candidate who will keep almost all abortions illegal in the state and protect gun rights. For him, that's Morrisey.",
        "Dee Truman, a welder´s helper from Roane County, said she trusts Warner because his family has lived in West Virginia for six generations and he understands why preserving coal and getting the state´s gas pipelines going again are important to workers like her.She said she has concerns about election security nationally after 2020, but she´s been impressed by Warner's work to remove people from the voting rolls who he said weren´t eligible to vote. His office says that since 2017, it has identified 300,000 people, in a state of 1.8 million, no longer able to vote because they moved, died or were convicted of a felony. During Warner´s tenure, 260,000 new voters have registered.Truman said those efforts make her feel like West Virginia is \"probably one of the safest\" states when it comes to election security.Lori and Tim Smith are both registered independents and run a Marshall County business helping people make homes and business accessible for people with disabilities. Lori Smith, 54, said changes Warner made as secretary of state have saved them hours of paperwork.Warner also started a pilot project that allowed military and overseas citizens to use a mobile voting application. That mattered to Tim Smith, an Army veteran, who had experienced challenges voting when he was deployed.",
        "\"He is wanting people to legitimately, rightfully vote and eliminate any type of cheating, quite honestly,\" Lori Smith said. \"I don´t feel that there´s anything wrong with wanting to make a system more efficient and more fair.\"The Associated Pressreceives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP´s democracy initiative here. The AP is solely responsible for all content."
    ]
}