{
    "articleURL": "/news/article-12053317/Services-NSW-stabbing-Haymarket-Sydney-Mahmoud-Salhab-paperwork-rage-alleged-stabbing.html",
    "content": [
        "Man who allegedly stabbed Services NSW worker 'mentally unstable'Mahmoud Salhab, 37, was charged after he allegedly stabbed workerPolice say the attack was due to the employee being unable to help him Police allege the stabbing of a Services NSW worker in Sydney's CBD was due to the employee being unable to amend the customer's paperwork.",
        "Mahmoud Salhab, 37, from south-west Sydney, did not appear at Parramatta Bail Court on Saturday after he was charged with intent to cause grievous bodily harm.His lawyer told the court his client, accused of stabbing the NSW public servant in an unprovoked attack, is experiencing mental health issues and requested he moves to a mental health facility, a request the magistrate denied.Salhab allegedly turned up to the service centre in Haymarket about 9am Friday to amend his birth certificate. They also allege he sat on the lounge while the worker fought for his life. ",
        "His lawyer Javid Faiz requested his client be transferred to a mental health facility, under section 25 of the Cognitive Impairment Act 2020.'He's mentally not in a stable position,' Mr Faiz told the court, adding that Surry Hills Police Station where he is currently detained 'had some concerns for their protection'.Magistrate John Bailey denied the request on the basis there was 'insufficient information' to make the order.Instead, he requested a psychiatric report be made available for the next court date.Outside court, Mr Faiz told reporters his client had experienced mental health issues 'for quite some time now'.'He's undergone treatment in the past,' Mr Faiz added.",
        "The police fact sheet, sighted by The Daily Telegraph, states the 54-year-old employee approached Salhab in the lobby of the building on Rawson Pl, Haymarket before becoming aggressive when the staff member was unable to help him.",
        "Police allege Salhab began 'fidgeting' with his hands behind his back before pulling out a knife and allegedly stabbing the Services NSW employee at his workplace in Haymarket in Sydney's CBD at about 9.20am on Friday.The facts state by the time the employee pressed a duress alarm on his lanyard, he had been stabbed in the chest multiple times in a 'frenzied and uncontrolled attack'.The government worker suffered lower back, chest and shoulder wounds during the attack and remained in intensive care late on Friday after undergoing surgery at St Vincent's Hospital.Mr Salhab did not make a bail application and bail was formally refused.The matter was adjourned to be heard at the Downing Centre Local Court on June 23.Lifeline 13 11 14Beyondblue 1300 22 4636"
    ]
}