{
    "articleURL": "/femail/article-12046971/Kate-Middleton-stuns-recycled-red-Eponine-coat-Soho.html",
    "content": [
        "The Princess of Wales looked chic in a recycled bespoke red Eponine coatKate oozed patriotism in the red coat with blue lining and a white dress Read More: Kate and William take the TUBE as they pop for a pint in Soho The Princess of Wales looked patriotic in a bespoke red Eponine coat as she stepped out in Soho today.",
        "Kate Middleton, 41, cut an elegant figure in a vibrant coat which featured satin blue lining to resemble coronation bunting as she joined Prince William at the Dog and Duck pub.The royal proved her sustainable fashion prowess once again as she previously donned the coat visiting the National Portrait Gallery in 2021.The London boutique is a favourite of the mother-of-three's as it's known for taking inspiration from the silhouettes of the 1950s and 1960s.She paired the striking coat with a white Suzannah dress, which she has previously worn to Wimbledon, and a white Mulberry bag and matching Jimmy Choo heels.",
        "The coat, which is from their Autumn/Winter 2018 collection, features a mandarin collar and pretty button detailing. The royal accessorised with Maria Black earrings and her long brunette locks fell loose in a centre parting. Her glam makeup enhanced her naturally flawless complexion and featured a subtle smokey eye. William and Kate travelled on the Elizabeth Line from Acton Main Line station to Tottenham Court Road, the nearest stop to Soho, where they stopped off to pull pints and chat to hospitality staff at the Dog and Duck pub. The prince and princess wanted to meet and thank Transport for London (TFL) workers who will be working throughout the coronation weekend.Asked about the royal family’s preparations for Saturday, Kate said: ‘Yes, it’s going to be a very busy time. We’re getting there. I still feel like we’re trying to get ducks in a row.’",
        "After being handed their Oyster cards by an aide and welcomed to Acton station by Andy Lord, TFL’s commissioner, the couple met with Carinne Spinola, a train driver and Cameron Finch, a customer service assistant, and talked about their career aspirations.Once on board the train, they sat with a group of TFL workers, including David Pearce, a fleet manager, Liam Grindley, a service and infrastructure manager and Maria Serco, a maintenance engineer.",
        "Speaking about her conversation with Miss Spinola, Kate told the group: ‘It’s nice to meet a female train driver, obviously a profession women are keen on getting into. She said the job was advertised on Mumsnet.’It was the couple’s first trip on the Elizabeth Line, which the late Queen Elizabeth opened almost a year ago on May 17, 2022.Royal aides said the couple do ‘occasionally’ travel by tube in a private capacity.‘What’s the feedback you’ve been getting since it opened?’ William asked.‘Everyone loves it,’ Mr Grindley told him, explaining how it had made many journeys across London shorter and easier.‘And how green are we now,’ asked William, laughing. ‘You know I’ve got to ask that question!’",
        "William heard how the line’s trains are electric, and how much of the earth that was dug up to build the line, was moved and re-used for a nature reserve. ‘It’s good, it clearly gets thought about now,’ he said.",
        "Speaking to Miss Serco about the opening of the line last year, William said: ‘I can’t quite believe it has been nearly a year. It’s quite nice to get the chance to see it all, after my grandmother opened it.’Asking the group which of them would be working this weekend, Kate asked: ‘Do you think there’s going to be extra pressure on the service during the coronation weekend? How do you manage that?’One of the group then asked how the royal family’s preparations were going, and Kate replied: ‘Yes, it’s going to be a very busy time. We’re getting there. I still feel like we’re trying to get ducks in a row.’After the short journey from Acton, via Paddington to Tottenham Court Road, the couple were presented with gifts by Mr Lord – a plaque tile of a TFL Roundel, or “Crowndle” as Mr Lord described it, inscribed with “King Charles III,” and a TFL roundel lightbox for Prince George, Princess Charlotte and Prince Louis.",
        "Dozens of stunned onlookers then rushed towards the escalator with their phones, to film the couple as they made their way up the escalator.Speaking after the couple had left the station, Mr Lord said: ‘It was amazing to welcome them on their first visit on the Elizabeth Line. It’s coming up to the anniversary of the Queen opening it, and they were very impressed with it.’",
        "Miss Serco said of William: ‘He was very interested in the technology, how we put the concrete in, the apprenticeships and training we offer. And I told him how much interest we’ve had from other countries around the world. It was really nice to thank them for all the royal family’s endorsement of the Elizabeth Line. We always knew we had their support. We feel the link to the royal family.’Kensington Palace also invited tube and train enthusiast, Francis Bourgeois, whose real name is Luke, to ride on the train with William and Kate as an observer.He has more than a million followers on Instagram, and royal aides said it was hoped he might bring the experience to a ‘younger audience’.William and Kate then walked through the streets of London to the Dog &amp; Duck Pub to hear how it’s preparing for the coronation weekend from members of staff and to meet representatives from other hospitality and recreation businesses in the area.The couple were served pints of cider - and Kate took a sip. William also pulled a pint of special coronation beer behind the bar brewed by Nicholson’s - appropriately called Kingmaker Pale Ale.He was given the honour of pulling the first pint of it."
    ]
}