{
    "articleURL": "/wires/reuters/article-12058029/Guardians-Tigers-turn-young-arms-series-opener.html",
    "content": [
        "Hitters from both teams might be doing a lot of guesswork as the Detroit Tigers arrive in Cleveland for the beginning of a three-game series against the Guardians on Monday.",
        "None of the hitters on either team have faced the opposing pitcher before, although Cleveland rookie right-hander Tanner Bibee has generated plenty of buzz since arriving to the big leagues.The touted 24-year-old made a solid major league debut on April 26 in Cleveland against the Colorado Rockies, striking out eight in 5 2/3 innings and earning the decision in a 4-1 Guardians victory.In his most recent start, against the Yankees in New York, Bibee took a no-decision in a 4-2 Guardians loss despite holding the Yankees to two runs in 5 1/3 innings with five strikeouts.Bibee (1-0, 2.45 ERA) has a pitch repertoire featuring a fastball clocked as high as 99 mph, a slider, changeup and curve, and is developing a sweeping slider.Despite his youth and inexperience at the major league level, Bibee has yet to walk a batter over 11 innings pitched.\"He competes, he throws all his pitches for strikes -- there's a lot to like with this kid,\" Guardians manager Terry Francona said after Bibee's start against New York. \"We're going to enjoy watching to see how good he can get.\"The Tigers will counter with a youthful pitcher of their own in left-hander Joey Wentz.After a promising rookie season in 2022 in which Wentz was 2-2 with a 3.03 ERA in seven starts, the 25-year-old left-hander has struggled thus far in 2023. Wentz has allowed six home runs in six starts for an 0-3 record with a 6.67 ERA, while striking out 22 batters.",
        "Wentz gave up three of those homers in his last start, when he settled for a no-decision in the Tigers' 6-5 win at home against the New York Mets on Wednesday, but Detroit manager A.J. Hinch said he still has confidence in the young southpaw.\"He's throwing the ball fine,\" Hinch said after that game. \"Joey was throwing the ball fine, he just couldn't keep it in the ballpark. It wasn't like he was out of control in the game.\"Cleveland's hitters will hope that Wentz might be the tonic to their offensive woes of late. The Guardians have scored more than three runs just once in their last seven games, but they took two of three in their series against the Twins with a 2-0 win Sunday.\"Our bats aren't coming together as much as we'd like,\" Guardians slugger Josh Bell said. \"Maybe we're waiting for the weather to turn hot, and maybe our bats will get hot. Hopefully, there's more to come and we can start slugging soon.\"The Tigers recorded a three-game sweep of the New York Mets and won their first two games in St. Louis before having their five-game winning streak snapped on Sunday when they lost 12-6 to the Cardinals.\"We're chipping away at the wins and losses, but the style of play and the offense warming up is a good sign,\" Hinch said. \"They just had more offense.\"",
        "--Field Level Media"
    ]
}