{
    "articleURL": "/news/article-12052635/We-hold-balance-power-election-SNP-claim.html",
    "content": [
        "SNP's Stephen Flynn said his party would be in 'prime position to pull the strings'It comes after experts said Labour will not win a majority in next general electionThe SNP could hold the balance of power at the next election, the party's Westminster leader claimed yesterday.",
        "It came after experts predicted that Labour will not win an overall majority in a national vote based on its performance in this week's local elections.The Scottish National Party's Stephen Flynn said the results suggested the SNP could be 'in prime position to pull the strings' of a minority government after the next general election.Labour would have a nine-point lead over the Tories if England's local election results were extended to cover the whole of Britain, according to BBC projections.Professor Michael Thrasher, election analyst for Sky News, said applying this week's local voting trends on a national scale indicated Labour would become the largest party at the next general election, but it would 'fall short of winning an outright majority'.",
        "The Greens last night celebrated making history after taking overall control of an English council for the first time.The party increased its tally of councillors in Mid Suffolk from 12 to beyond the 18 required to take charge, with one of its candidates unseating the previous Tory council leader Suzie Morley.The Conservatives went into Thursday’s election with 16 councillors, but suffered a catastrophic loss.Adrian Ramsay, the Green Party national co-leader, said he hoped the breakthrough would lead to greater Green representation. The Greens also became the largest party in East Hertfordshire with 19 councillors after the Tories lost 23 seats. A Lib Dem councillor in Greater Manchester has won a second seat – 160 miles south on Cotswold District Council. Chris Twells secured Tetbury with Upton, while already representing Ordsall, Salford. He must attend a meeting at each council every six months to keep his seats.",
        "This means Sir Keir Starmer would probably have to form a deal with another party – such as the Liberal Democrats or the SNP – to govern, despite the Labour leader vowing last year that he would never form a coalition with the SNP.Tory peer Gavin Barwell yesterday said Labour had not proved it had the momentum at the ballot box to hand Sir Keir the keys to Downing Street.Lord Barwell, the chief of staff to former prime minister Theresa May, compared Labour's performance to that of Ed Miliband, who enjoyed success at the local elections during his leadership in the early 2010s before tanking at the 2015 general election, in which David Cameron's Conservatives won a majority.It came after Sir Keir, emboldened by victories in places including Plymouth, Stoke-on-Trent and Swindon, hailed an 'amazing set of results' for his party.He told jubilant activists in Chatham, Kent: 'Make no mistake – we are on course for a Labour majority at the next general election.'Results from Thursday's local elections showed the Tories losing control of councils across England, but the vote appeared to be split between Labour, the Liberal Democrats, the Greens and independents in many areas, rather than Tory voters defecting straight to Labour.And there were some setbacks, particularly in Slough, where Labour lost 17 seats and control of the authority, which it effectively left bankrupt two years ago. The Tories are now the biggest party, with half of the 42 councillors.",
        "Lord Barwell admitted the results were 'bad' for the Tories, but added: 'The general election result is not in the bag yet.' He said: '[The results are] better than they've [Labour] done at any point since 2010, but it's only a bit better than Ed Miliband did. 'It's nothing like as good as what Tony Blair was doing in the mid-1990s. They suggest the most likely result at the next election is a hung Parliament with Labour as the biggest party, not an outright Labour victory.'Polling expert Professor Sir John Curtice said projected figures – based on the swing at local level between Thursday's votes and the 2019 general election – would result in Labour taking 312 seats at the next parliamentary election, slightly short of the 326 required for a majority, with the Tories on 226.Mr Miliband enjoyed huge success at the 2012 local elections, hammering the Tories by increasing Labour's number of councils from 43 to 75. But by the 2015 general election, any hope of Labour's popularity locally translating to a Miliband premiership was torpedoed. Labour suffered a net loss of 26 MPs, while the Tories added 24 seats to gain an overall majority in the Commons.Lib Dem leader Ed Davey dodges questions on whether he would prop up Keir Starmer in No 10 after shocking the Tories by seizing council stronghold of Windsor, by James TapfieldLib Dem leader Ed Davey dodged questions over whether he would prop up Keir Starmer in power today after shocking the Tories in Windsor.",
        "Sir Ed hailed seizing control of the council as he visited the town, staging an awkward photo op with a large clock to show Rishi Sunak his 'time's up'.He said he was proud that Katy Perry and Lionel Richie would be performing in Lib Dem territory at the coronation concert this weekend.But he repeatedly ducked questions on what he will do if Labour falls just short of a majority at the next general election.The Lib Dems boasted about making inroads into the so-called 'Blue Wall' after a grim set of local elections for the PM.",
        "With results still flowing in, the Tories have lost control in Brentwood, Tamworth, North West Leicestershire, Hertsmere, East Lindsey, South Kesteven, East Hertfordshire and South Gloucestershire.The setback in Windsor was particularly striking as it is in the supposedly safe constituency of former leader Theresa May.Worryingly for Mr Sunak the pummelling has been coming in both 'Red Wall' areas and traditional heartlands.The premier tried to put a brave face on the 'disappointing' results this morning, insisting he would focus on the public's 'priorities' such as cutting inflation.Labour celebrated victories in Plymouth, where the Tories had been running a minority administration, and Stoke-on-Trent - a key battleground ahead of next year's general election. They were also jubilant about a mayoral win in Middlesbrough.",
        "In Medway, where his party took charge to end 23 years of blue rule, Sir Keir hailed 'fantastic results across the country'.'Make no mistake, we are on course for a Labour majority at the next general election,' he said.However, elections guru Professor Sir John Curtice said while the results were impressive for Sir Keir it remains unclear whether they are good enough to suggest he can win outright. That would require a massive swing owing to the scale of the Tory victory in 2019.Sir Ed was repeatedly challenged on Sky News over whether he would be willing to prop up Sir Keir in power if there was a hung Parliament.'I'm focused on beating those Conservative MPs and SNP MPs in Scotland, where I think the Liberal Democrats have a really good chance, and I'm increasingly confident about our ability to beat Conservative MPs at the next general election,' he said.'I don't think the Conservatives can be removed from Government if Liberal Democrats don't beat those Conservative MPs.'The Lib Dems were smashed at the 2015 election after five years in coalition with the Tories, meaning the party would be highly unlikely to agree to another formal alliance. However, there has been intense speculation about a tie-up to target the Conservatives at the next election, and support a minority Starmer administration.",
        "In Windsor, Sir Ed said: 'Voters across the country have sent a clear message in these local elections, a message so loud that even someone as out of touch as Rishi Sunak can't ignore it.'People are fed up with waiting hours for an ambulance, waiting in vain for the police to show up after a break-in, or for real action to bring down soaring energy bills and food prices."
    ]
}