{
    "articleURL": "/wires/reuters/article-12044047/PacWest-explores-strategic-options-amid-stock-price-plunge-source.html",
    "content": [
        "By Anirban Sen",
        "NEW YORK, May 3 (Reuters) - PacWest Bancorp is exploring strategic options, including a potential sale or capital raise, after a liquidity boost it announced in March failed to inspire confidence in its ailing share price, a person familiar with the matter said.PacWest is hoping to avoid the fate of other regional lenders that were taken over by U.S. regulators in the last two months by proactively finding a solution that bolsters its finances, the source said, asking not to be identified because the matter is confidential.A PacWest spokesperson did not immediately respond to a request for comment.PacWest has branches in California as well as Durham, North Carolina and Denver, Colorado. Itsaid on March 22it secured a$1.4 billion asset-backed financing facility from investment firm Atlas SP Partners.The Los Angeles-based lender said in its first-quarter earnings last week that its deposits had stabilized after some customers pulled their money, but investors have continued to sell the bank's shares amid concerns about its future.PacWest shares dropped 58% on the news on Wednesday to $2.88 a share. The stock has lost almost 90% of its value since the regional banking crisis started on March 8.The crisis has led to the Federal Deposit Insurance Corporation taking over regional lenders Silicon Valley Bank, Signature Bank and First Republic Bank and selling them in whole or parts to other banks.",
        "Shares of other regional banks also fell after First Republic Bank collapsed last weekend and was sold to JPMorgan Chase &amp;amp; Co.Major banks and private equity firms have balked at offering capital infusions to regional lenders without a government backstop because of concerns about booking losses on their low-yielding assets such as loans and investment portfolios,Reuters has reported. (Reporting by Anirban Sen in New York, editing by Deepa Babington)"
    ]
}