{
    "articleURL": "/wires/reuters/article-12044803/Zack-Greinke-Royals-shut-Orioles.html",
    "content": [
        "Zack Greinke pitched five scoreless innings for his first win of the season, Vinnie Pasquantino went 3-for-4 with three RBIs and a home run, and the Kansas City Royals evened up their home series against the Baltimore Orioles with a 6-0 win on Wednesday.",
        "Greinke (1-4) delivered his best outing of the season, striking out three with three hits and no walks, en route to his first win since Aug. 11 of the 2022 campaign. He came out after just 44 pitches -- a coach's decision, via the Kansas City Star -- but the bullpen maintained the club's first shutout since last Sept. 19.Taylor Clarke, Aroldis Chapman, Amir Garrett and Josh Staumont each pitched an inning in relief. Clarke struck out two in the sixth inning with the Royals holding a 1-0 lead after Pasquantino's fourth-inning, solo home run.The homer was Pasquantino's sixth of the season.In its half of the sixth, Kansas City added another run when Pasquantino drove in Bobby Witt Jr. on a double.After Chapman's scoreless seventh, the Royals erupted for four more runs. After Nick Pratto and Michael Massey got aboard with consecutive singles, Maikel Garcia drove in Pratto on a sacrifice fly.The floodgates opened with two outs on Baltimore starer Kyle Gibson (4-1), who took his first loss of the season. He surrendered a run-scoring double to Kyle Isbel, who in turn scored on Witt's triple the next at-bat.Pasquantino continued his outstanding performance with a double to drive in Witt off of relief pitcher Keegan Akin. Pasquantino was one of four Royals batters with a multiple-hit outing, as Pratto finished 3-for-4 while Massey and Isbel each went 2-for-3.",
        "Baltimore threatened to break up the shutout in the ninth inning when Ryan Mountcastle doubled off of Staumont, but the reliever forced Anthony Santander and Gunnar Henderson into consecutive flyouts.The Royals seek back-to-back wins for just the second time this season and a series win in Thursday's rubber match with Jordan Lyles on the mound. Rookie Grayson Rodriguez gets the start for Baltimore.--Field Level Media"
    ]
}