{
    "articleURL": "/wires/reuters/article-12047695/LATAM-POLITICS-TODAY-Argentina-seeks-US-Brazilian-support-faster-IMF-payouts.html",
    "content": [
        "Spain to consider removing ELN from EU's terror list",
        "Latam election influence operation linked to Miami firmBahamas expands citizenship rights for kidsClimate shocks may push Brazilians into extreme povertyMay 4 (Reuters) -The latest in Latin American politics on Thursday:Argentina seeks US, Brazilian support for faster IMF payouts, sources sayBRASILIA/BUENOS AIRES - Argentina is seeking new easing of targets in its $44 billion deal with the International Monetary Fund and faster payouts and is pushing to get the United States and Brazil, both key IMF members, to support it, government officials said.The country is expected to return to talks with the IMF on Thursday over amending the deal, which has come under strain amid a historic drought that has battered the country's key cash crops soy and corn, a senior economy ministry official said.Spain to study removing ELN from EU's terror list, Colombian leader saysMADRID - Colombian President Gustavo Petro on Thursday said Spain will look at removing the left-wing Colombian guerrilla group known as the National Liberation Army (ELN) from the European Union's list of designated terrorist organizations during the upcoming Spanish presidency of the EU Council.At a joint press conference with Spanish Prime Minister Pedro Sanchez in Madrid, Petro said Spain would \"study the possibility\" of removing the ELN from the list to make progress towards a truce or ceasefire in Colombia's six-decade conflict with rebels and crime gangs.",
        "Latin American election influence operation linked to Miami marketing firmSAN FRANCISCO/WASHINGTON - A Miami-based digital marketing firm was behind a series of covert political influence operations in Latin America over the last year, Facebook-owner Meta said this week, a rare disclosure of an apparent U.S.-based misinformation-for-hire outfit.Predictvia, which is registered as a business in Florida, says on its website that it stands on the \"front line of the fight against misinformation\" and combats \"coordinated efforts to manipulate public discourse.\"The Bahamas to grant citizenship to children born to foreign mothers out of wedlockChildren born out of wedlock to Bahamian fathers and foreign mothers will be granted citizenship at birth, Bahamian Prime Minister Philip Davis said, after the Caribbean nation's Privy Council upheld a 2020 court ruling.In a statement, Davis said the decision marked \"an important step towards ensuring equal citizenship rights for all children, irrespective of their parent's marital status. It is expected to impact the lives of many individuals in our nation positively.\"This move leaves Barbados as the only country in the Western Hemisphere that does not incorporate gender equality in its citizenship laws, according to the U.N. Refugee Agency, which warns that such laws increase risks of child statelessness.Climate shocks could push 3 million Brazilians into extreme poverty, World Bank says",
        "BRASILIA, May 4 (Reuters) - Climate shocks could push millions of Brazilians into extreme poverty by 2030, a report by the World Bank on Thursday said, urging the country to accelerate investments towards renewable energy sources.The poorest people in the South American nation would be affected by natural disasters, especially floods and droughts, rising food prices and reduced labor productivity, the report says.Brazil is well-positioned to source more renewable energy, as almost half of its energy supply, including more than 80% of its electricity, comes from renewables, compared with world averages of between 15% and 27%, respectively, the report added. (Compiled by Steven Grattan; Editing by Paul Simao)"
    ]
}