{
    "articleURL": "/sport/football/article-12054409/Jamie-Redknapp-Micah-Richards-Sam-Allardyces-decision-drop-Illan-Meslier.html",
    "content": [
        "Jamie Redknapp and Micah Richards agreed with Sam Allardyce's selection callAllardyce decided to drop Leeds number one Illan Meslier for Man City clashdecided to give Joel Robles his first Premier League start for LeedsJamie Redknapp and Micah Richards believe that Sam Allardyce made the correct decision in dropping Illan Meslier to the bench for Saturday's clash with Manchester City.",
        "Goalkeeper selection was the biggest call that Allardyce had to make for his first game in charge as the new Leeds boss since he was appointed in midweek.Meslier had been hauled into the firing line for poor performances throughout April that saw Leeds concede 23 goals across seven Premier League matches.Allardyce decided to drop the young number one and instead handed former Everton shot-stopper Joel Robles his first Premier League appearance since 2017.Redknapp insisted pre-match that Meslier is suffering a confidence crisis following a torrid run of form, but believes that the 23-year-old will go on to become a top goalkeeper.",
        "'I think Meslier will become a very good keeper, it's just right now he is lacking confidence,' Redknapp said on Sky Sports.'It happens to everybody and he [Allardyce) needed to take him out the firing line.'He will be a good keeper, he has all the attributes to do so, this year must just be really difficult playing with the way Leeds play he will always concede goals,' he added.Relegation-threatened Leeds have conceded more goals than any other side in the English top-flight this season as they teeter on the edge of the drop zone.Their last clean-sheet came at the end of February when Leeds snatched a hard-fought 1-0 home win over bottom-of-the-table Southampton.",
        "Saturday's trip to Pep Guardiola's Premier League leader's marks a sixth consecutive match where Leeds have changed their defence, with former boss Javi Gracia previously tinkering to try and find immediate solutions.",
        "Former City full-back Richards explained that inconsistencies in defensive organisation means that any goalkeeper would concede plenty of goals for Leeds this season. 'It is how many chances Leeds concede as well, the back four, it's difficult, when you are changing constantly trying to find that solidarity at the back you will concede chances.'His form hasn't been great but he will go on to be a top goalkeeper. Good decision to take him out for a game or two and restore that confidence,' he added.Robles' first Premier League start for Leeds saw him concede twice within 27 minutes as Ilkay Gundogan scored with efforts from long-range."
    ]
}