{
    "articleURL": "/news/article-12055901/Travel-tourism-bodies-plead-no-increase-Passenger-Movement-Charge-leave-Australia.html",
    "content": [
        "Travel sector begs for no extra leaving taxFederal budget expected to impose $20 hikeCurrently most people over 12 pay $60 Australian travellers could be forced to pay more with the federal government considering increasing the amount of tax lumped onto airfares. ",
        "Most travellers over the age of 12 are whacked with a $60 Passenger Movement Charge (PMC) to leave the country's shores but this could go up to $80 for each person if next week's federal budget brings in a forecast $20 hike.Three leading travel bodies have joined forces to write directly to Prime Minister Anthony Albanese begging to be spared an increase.They claim the industry cannot possibly afford the hike as it could dissuade holidaymakers from jetting overseas.",
        "The chief executives of the Australian Airports Association, Australian Federation of Travel Agents, and the Tourism and Transport Forum are asking for a five-year freeze on the charge, which they claim is one of the most expensive in the world. 'The tourism industry has gone through a terrible, terrible time with Covid and is a long way from recovered,'  Tourism and Transport Forum CEO Margy Osmond told Channel Nine.They argued the industry has already been ravaged by the Covid pandemic border closures, and that another tax hike was an unnecessary blow.Ms Osmond said international travel is only about 60 per cent of what it was before Covid.'This is not the time to increase or apply a tax to the tourism industry,' she said.Australian Federation of Travel Agents chief executive Dean Long made the point that the PMC had increased 500 per cent since its inception.",
        "'It's is a tax on Australians leaving the country to reconnect with loved ones,' he said pointing out that 49 per cent of Aussies having a parent spent overseas.   He argued even a $20 increase would hurt the travel sector as Australians are already staying at home more because of the pressure they are under from higher costs of living.'If the government wants to support tourism and the travel industry, they need to think twice before raising this tax, given the massive impact it will have on Australians and tourists alike,' Mr Long said. ",
        "Australian Airports Association CEO James Goodwin asserted an increase would put travel sector jobs at risk. The tourism chiefs claim the charge was already raking $1.2bn into the government's coffers annually before the pandemic hit.Federal treasurer Jim Chalmers has refused to confirm whether the PMC increase will be in the budget to be delivered on Tuesday.The PMC was introduced in 1978 at $10 and is used by the Commonwealth to help fund international passenger processing into Australia.Everyone has to pay upon leaving Australia except for those with special exemptions, which include airline crew, emergency passengers, officials or workers on various types of business and some traditional peoples performing cultural trips."
    ]
}