{
    "articleURL": "/wires/pa/article-12049533/Australian-leader-says-served-US-pursuing-Julian-Assange.html",
    "content": [
        "Australian Prime Minister Anthony Albanese has said there is “nothing to be served” by the ongoing incarceration of Julian Assange as he expressed frustration at the United States’ continuing efforts to extradite the WikiLeaks founder and Australian citizen.",
        "Mr Albanese’s comments on Friday in an Australian Broadcasting Corporation (ABC) interview appeared to escalate diplomatic pressure on the United States to drop the charges against the 51-year-old, who has spent four years in Britain’s Belmarsh Prison fighting extradition to the US.Before that, Mr Assange had taken asylum for seven years in the Ecuadorian Embassy in London.Mr Albanese said Mr Assange’s case had to be examined in terms of whether the time Mr Assange had “effectively served” was in excess of what would be “reasonable” if the allegations against him were proved.",
        "“I just say that enough is enough. There is nothing to be served by his ongoing incarceration,” Mr Albanese said.“I know it’s frustrating, I share the frustration. I can’t do more than make very clear what my position is and the US administration is certainly very aware of what the Australian government’s position is.”Mr Assange has battled in British courts for years to avoid being sent to the US, where he faces 17 charges of espionage and one charge of computer misuse that stem from WikiLeaks’ publication of a huge trove of classified documents in 2010.American prosecutors allege he helped US Army intelligence analyst Chelsea Manning steal classified diplomatic cables and military files that WikiLeaks later published, putting lives at risk.",
        "To his supporters, Mr Assange is a secrecy-busting journalist who exposed US military wrongdoing in Iraq and Afghanistan.Mr Albanese said there was a “disconnect” between the US treatment of Mr Assange and Ms Manning.Then-US president Barack Obama commuted Ms Manning’s 35-year sentence to seven years, which allowed her release in 2017.",
        "Mr Albanese said he has advocated for Mr Assange in meetings with US administration officials.On Friday, he declined to say whether he would raise Mr Assange with US President Joe Biden when Mr Albanese hosts the US leader along with leaders of India and Japan in Sydney on May 24.“The way that diplomacy works… is probably not to forecast the discussions that you will have, or have had with leaders of other nations,” he said.“I’ll engage diplomatically in order to achieve an outcome.”Mr Albanese said he did not want to get into an argument about whether Mr Assange’s alleged actions were right or wrong.Mr Albanese noted a British district court decision, since overturned, that rejected the extradition request on the grounds that Mr Assange was likely to kill himself if held under harsh US prison conditions.“I am concerned about Mr Assange’s mental health,” Mr Albanese said.“There was a court decision here in the United Kingdom that was overturned on appeal that went to Mr Assange’s health as well and I am concerned for him.”"
    ]
}