{
    "articleURL": "/femail/article-12038655/Queen-high-street-Kate-Middleton-dresses-Charlotte-34-Boden-jumper-birthday-portrait.html",
    "content": [
        "Princess Charlotte looked relaxed in an oversized knit and blue jeansRead More:  Prince and Princess of Wales delight royal fans as they share new photo of Princess Charlotte for her eighth birthdayShe might have access to the some of the world's top designers - but for her daughter's annual birthday portrait, the Princess of Wales opted to dress Princess Charlotte in a bargain high street buy.",
        "This evening, Prince William and Kate Middleton released a new portrait of their daughter to thank royal fans for their well wishes on Charlotte's eighth birthday.Looking happy and relaxed in front of the camera, Charlotte was pictured in a blue-and-white striped jumper from Boden as she snuggled up with the family's beloved black cocker spaniel Orla.The £34 jumper - which has been reduced to just £23.80 in the sale - has an oversized fit and 'balloon sleeves' for extra comfort.On the inside, the knit has a bright yellow seam and practical white ribbed cuffs - which Charlotte had rolled back.",
        "The garment caters to children aged two to 14 and is also available in a muted pink hue.To finish off Charlotte's outfit, Kate dressed her daughter in a white button-up blouse and a pair of blue jeans. Kate Middleton has long been a fan of the British brand Boden and has been pictured wearing several of their designs in recent years.In 2020, she sported their frosted blue Scallop Cardigan as she completed royal engagements over Zoom in lockdown and also modelled the brand's bubblegum pink jumper on a visit to a school in east London in March 2021.But this isn't the only occasion Charlotte has modelled the best of the British high street.",
        "Last night, the couple released another new image of Princess Charlotte ahead of her birthday.Photographed by her mother, as in previous years, she showed off Charlotte's gap-toothed grin in the image to mark the occasion. The youngster was pictured sitting on a white wicker chair and wearing a £70 floral dress from the upmarket label Trotters.",
        "She has also worn Trotters dresses for previous portraits, including a snap released to mark her fourth birthday.Back in 2019, she was pictured in Trotters' £70 Lily Rose Betsy dress, featuring a blue floral Liberty print, puff sleeves and a Peter Pan collar.She has also regularly been spotted in blue plimsolls from the children's retailer.The firm describes today's birthday portrait dress as 'ideal for the warmer weather'.It features a classic round neckline and large statement willow collar, as well as a miniature floral print.And it's not just Charlotte who wears outfits from the upmarket brand, with Kate also dressing her sons Prince George and Prince Louis in the label.",
        "Most recently, the siblings all wore the brand for Kate and William's 2022 Christmas card.Sophie Mirman and Richard Ross opened the doors to the first Trotters store on King's Road in Chelsea in 1990, and have since gone on to open six more, win countless awards and numerous high-profile fans.",
        "Sophie and Richard were involved in the establishment of the now defunct shop Tie Rack and went on to create Sock Shop before launching Trotters.In a previous interview with the Mail's Femail section about their brainchild, the duo said: 'Trotters was the first store dedicated solely to children.'Catering from top to toe, and offering a fantastic range of clothes, shoes, books and toys, the store also boasts a hairdressing department with a giant fish tank.It truly is a one-stop shop and there is always a buzzing atmosphere. Shoes are always professionally fitted aboard the famous in-store Trotters plane, train or ship."
    ]
}