{
    "articleURL": "/news/article-12040563/Long-rain-Met-Office-warns-showers-expected-King-Charles-Coronation.html",
    "content": [
        "London is set for showers on Saturday with highs of 20C being possibleRoyal fans lining the Mall on Coronation day may need to bring umbrellas – as the Met Office warns light rain could fall on the procession.",
        "Charles's Coronation day is set to be the warmest on record, with temperatures in London set to reach 20C during sunny breaks in widespread cloud, according to the Met Office.Elsewhere around Britain, the mercury is set to reach only the mid to high teens.According to Met Office analysis of coronations since Edward VII in 1902, the current warmest on record was that of George V on June 22, 1911, when temperatures reached 17C. On the late Queen Elizabeth II's coronation, on June 2, 1953, the maximum temperature was just 11.8C.Coronations in the 20th century were also generally dull, with no sunshine recorded on George V or George VI's coronations and only 1.2 hours when Queen Elizabeth was crowned.The Met Office has no earlier records as meteorology is a relatively new science and records do not extend back to coronations in the 19th century and before.",
        "The unsettled forecast for Coronation Day and the bank holiday follows settled but mostly cloudy weather until mid-week, which had previously been predicted to extend into the weekend. Charles' grandfather George VI had a washout for his coronation in 1937, with 8.2mm of rain.A daily weather report from June 2, 1953, shows the weather on the late Queen's Coronation day was similar to the forecast for this Saturday.",
        "The report reads: 'During the afternoon the cloudy and wet weather continued across eastern districts which persisted well into the evening. Western areas continued to enjoy the best of the weather with many places having a dry day with good sunny spells.'There was a moderate to fresh north or north-easterly airflow across the whole country. It was a cold day for early June, particularly down the east coast and really quite miserable here given all the cloud and rain as well.'",
        "Met Office deputy chief forecaster Steven Keates said: 'On Saturday we will see showers developing from late morning in some central, eastern and northern areas, but also with some sunny spells through the day.'At this stage it looks like London could avoid the showers in the morning before some develop through the afternoon.'Heavier rain is expected to move into the southwest of the UK and heavy showers are likely for parts of Northern Ireland.'Winds will remain light away from the far north where gusty winds will begin to ease. The warmest temperatures, of 20C, are possible in London in any sunshine, with mid to high teens possible elsewhere.' The Met Office predicts the rest of the bank holiday weekend is set to remain showery.It said: 'With celebrations continuing through the Bank Holiday, Sunday will see areas of rain breaking up into heavy, possibly thundery showers for many parts of England and Wales. The driest and brightest weather looks set for parts of Northern Ireland and northern Scotland.",
        "'Monday is more uncertain at this stage, with the current outlook (being) to remain unsettled.' Drier and brighter weather is expected to return next week."
    ]
}