{
    "articleURL": "/sport/nba/article-12042677/Philadelphia-76ers-star-Joel-Embiid-set-return-court-Wednesday-nights-Game-2.html",
    "content": [
        "Embiid was just named the 2023 NBA Most Valuable Player Tuesday night He is recovering from an injury that has kept him out since sweeping Brooklyn DailyMail.com provides all the latest international sports news Philadelphia 76ers star Joel Embiid will be returning to the team for Wednesday night's Game 2 of the Eastern Conference semifinals against the Boston Celtics.",
        "According to ESPN sources, barring any setbacks, Embiid - who was named 2023 Most Valuable Player Tuesday night - will take the court. Embiid was seen on Wednesday morning for the team's shootaround after telling his teammates on Tuesday night that he would try to be back for tonight's game.TNT studio host Ernie Johnson asked Embiid during an interview after the announcement of his 2023 MVP award Tuesday whether he would take the court for Game 2, and Embiid said, 'We shall see.'The Athletic reported Wednesday morning that Embiid was much stronger in his behind-the-scenes comments to teammates, vowing to be on the court as Philadelphia seeks a 2-0 series lead.",
        "Embiid led the league in scoring for the second straight year, posting a career-high 33.1 points per game to go with 10.2 rebounds, 4.2 assists and 1.7 blocks.He shot a career-high 54.8 percent from the field, thanks to 58.7 percent shooting from inside the arc. Embiid added 66 3-pointers and 66 steals.An All-Star every season since 2017-18, Embiid made the All-NBA second teams in 2017-18, 2018-19, 2020-21 and 2021-22.The 76ers managed to beat the Celtics 119-115 without Embiid available in Game 1 due to a knee injury. The injury is widely reported to be a Grade 1 LCL sprain, and Sixers coach Doc Rivers told reporters that Embiid is doubtful for Game 2 Wednesday in Boston.",
        "Embiid said Tuesday night that his focus wasn't on trophies, but championships.'We're going to celebrate for five minutes and then we're going back to business. We got a series to win,' Embiid said. 'I'm just so proud of them, obviously, winning yesterday. That was a big one and we've got a few more coming. 'I'm just so proud of them to be able to make sure to give me some time to really allow me to heal and get back to myself. And I'll be back, and we've got more work to do.'"
    ]
}