{
    "articleURL": "/wires/ap/article-12061531/Texas-mall-shooting-victims-include-guard-young-sisters.html",
    "content": [
        "DALLAS (AP) - The people killed in a shooting at a mall near Dallas include two elementary school-age sisters, a couple and their 3-year-old son, a young engineer and a security guard. The victims represent a multicultural cross-section of the area's increasingly diverse suburbs.",
        "Cox Elementary School students Daniela and Sofia Mendoza, grades four and two, were among those slain Saturday at Allen Premium Outlets, according to officials in the Wylie Independent School District. They were remembered as \"the kindest, most thoughtful students with smiles that could light up any room,\" Principal Krista Wilson said in a letter to parents.Also killed at the outdoor shopping center were three members of a Korean American family: a couple and one of their sons, who was 3. Another son was wounded, said Myoung-Joon Kim, head of mission at the Consulate of the Republic of Korea in Dallas. The parents were identified by the Texas Department of Public Safety as Kyu Song Cho, 37, and Cindy Cho, 35.Porter Legal Group said in a Facebook post on Tuesday that they were shocked and crushed to learn that Kyu Cho, a managing attorney, was among the victims.\"Although Kyu has only been with our firm for a year, it was immediately apparent that he is one of the most thoughtful, caring and considerate people we have ever had the pleasure to know and work alongside. He was that way as a leader, mentor, and friend at our organization too. He was loved and respected by his and our entire team,\" the post said.",
        "Andria Gaither, assistant manager at the mall's Tommy Hilfiger store, said she was devastated to learn that one of the dead was Christian LaCour, a 20-year-old security guard who previously worked at the clothing store and often stopped in to chat. Gaither herself had run for her life when shots rang out.",
        "Just a few nights earlier, she had called LaCour when a customer wanted to come inside after hours. He came and asked the man to leave, then offered a security escort to her and two teenage employees.\"He wanted us to feel safe,\" Gaither said.\"I´m just in shock,\" she added. \"He was very young, very sweet, came in all the time to visit with us.\"Also killed was Aishwarya Thatikonda, 26, who was from India, held a graduate degree in construction management and worked as a civil engineer at the Dallas-area firm Perfect General Contractors.She was \"always prepared to give her very best,\" company founder Srinivas Chaluvadi said in an email.He said her parents live in Hyderabad, India, where her father is a judge.\"She came to the United States with a dream to make a career, build a family, own a home and live forever in Dallas,\" Chaluvadi said.Chaluvadi said Thatikonda would have turned 27 next week and that she had become like family: \"She attended birthday parties at my home, we celebrated festivals together and we had family dinners.\"",
        "An aunt of the Mendoza sisters said their mother was still hospitalized and asked for prayers.\"Please pray for our now broken family. The girls have left a void that nothing in the world could ever fill. Please pray for their mom, my sister, and her broken heart,\" wrote Anabel Del Angel in a fundraising post verified by GoFundMe. She also asked for prayers for the girls' father.Jena Blue, who lives down the street from the Mendoza family, has been to their garage sales and seen Ilda Mendoza walk her two daughters to school.\"She just seemed like a mom just like me,\" Blue said.For Halloween, she said the Mendozas would have a screen playing movies while another neighbor would serve snacks and drinks.\"Whenever you would round the corner right by their house, you´d get like a hot dog, a treat and chips. And watch a movie,\" Blue said.Elio Cumana-Rivas, 32, was also killed, authorities said. His brother, Gregory Smith Cumana, said that Cumana-Rivas, who was from Venezuela, had moved to the U.S. \"in search of the American dream,\" ABC News reported.Authorities are investigating Garcia's motive for the attack, which ended when the suspected gunman - 33-year-old Mauricio Garcia - was fatally shot by police.An Associated Press review of his online activity shows he had a fascination with white supremacy and mass shootings, and large Nazi tattoos.",
        "Official have cautioned that the investigation is ongoing and in its early stages.___Alvarez reported from New York and Reynolds from Louisville, Kentucky. Associated Press writers Michael Balsamo in Washington, Terry Tang in Phoenix and Audrey McAvoy in Honolulu contributed.___The contribution line has been corrected to reflect that Alvarez reported from New York, not Los Angeles."
    ]
}