{
    "articleURL": "/news/article-12039739/Jock-Zonfrillo-death-MasterChef-judge-writing-new-cookbook-planned-open-sandwich-bar.html",
    "content": [
        "Jock Zonfrillo was writing a cookbook He was also developing new sandwich barChef tragically died on Sunday in MelbourneJock Zonfrillo was in the early stages of planning a new restaurant and had started working on a cookbook prior to his shock death, Daily Mail Australia can reveal. ",
        "The star chef hoped to open a sandwich bar before he was tragically found dead in Zagame's House on Melbourne's famed Lygon Street in the early hours of Monday. He'd been scouring potential locations for the restaurant and workshopping new recipes for his cookbook, which was in development with the backing of Simon and Schuster.The publishing house also collaborated with Zonfrillo on his hit memoir, Last Shot, in 2021, which detailed his battles with addiction and rise to the top of the culinary industry.Zonfrillo constantly shared recipes on his Instagram account which sparked a frenzy among his fans to try them at home and report back to him.",
        "He taught everything from how to roast the perfect potato to oysters and roasted peri peri chicken.It's unclear if these were the recipes he was preparing to share in his cookbook, or what stage he was up to in the process.The impending projects were keeping Zonfrillo busy, alongside filming his hit Network Ten program, MasterChef, which was due to air just hours after his death was publicly announced.The future of the show is currently up in the air. Zonfrillo had no restaurants at the time of his death after being forced to closed three in the past five years.",
        "His restaurant Orana, which opened in 2013, was once considered the pinnacle of Australian cuisine and voted the nation's best in 2019, but both its start and end were far less glamorous.",
        "On opening night, not a single diner came, despite glittering reviews from critics a week earlier. Zonfrillo needed it to be a success. He had just enough money to pay the overheads for two weeks. 'It was so expensive to run,' he wrote in his memoir. 'I had a s**tload of credit cards I kept maxing out - whatever it took to keep the restaurant going until the Australian people realised what we were trying to do.'At the time, he was hot off a job as Penfolds' head chef and was highly respected on the culinary scene. Despite running at a $360,000 loss in that first year, 2014 saw a turn of the tide and the bookings started rolling in - until Covid hit. Orana was the first to bring Indigenous ingredients into the fine dining scene and won international acclaim.Downstairs, beneath the restaurant, he launched Bistro Blackwood, a more casual eatery. ",
        "He launched a casual food truck called Nonna Mallozzi after his Italian nonna in 2018, serving pastas, fries and paninis our of a blue van lodged between a barber shop and a bar. Shortly after, it moved into a permanent space on Rundle Street, just down the road from his other two venues.",
        "As his career outside of the kitchen went from strength to strength, Zonfrillo's businesses were struggling.Nonna Mallozzi closed less than seven months after opening, in July 2019. Signs posted to the venue windows revealed the leaseholder was in arrears by $8,700 for rent. The company posted losses of $140,000 in that time.Bistro Blackwood closed its doors in December 2019, and within months, Covid had hit, temporarily shuttering Orana.",
        "Zonfrillo said in his memoir he 'ran the numbers with lockdowns looming and realised even if we could open again in a few months, we'd have to sell out every sitting at every service in order to break even'.'It was clear that wouldn't happen for a long time.'He and his staff had no idea how long it would take for the pandemic to pass, but running on such tight margins to begin with meant that keeping afloat was untenable. 'The decision to shutter was gut-wrenching,' he said.'It was really emotional. It felt like a funeral to have to close the place. Everything we'd fought for had been a struggle; not one thing about that place had ever been easy, and this was the hardest thing we'd ever had to do.'It's understood the business owed about $1.4million, but settled for about $90,000. Creditors included Zonfrillo and his wife, Lauren Fried.",
        "Zonfrillo's tragic death is not being treated as suspicious by Melbourne police."
    ]
}