{
    "articleURL": "/tvshowbiz/article-12041595/Helen-Flanagan-sends-temperatures-soaring-number-busty-bikinis-Tenerife.html",
    "content": [
        "Helen Flanagan sent temperatures soaring as she posed up a storm in a number of bikinis for a photo shoot in Tenerife on Instagram on Wednesday. ",
        "The former Coronation Street star, 32, showcased her sensational figure as she uploaded a series of behind the scenes clips from her latest swimwear shoot.She displayed her cosmetically enhanced cleavage in a triangle lilac two-piece from Moda Minx which boasted gold metal detailing. The I'm A Celebrity South Africa star styled her long blonde tresses in loose waves as they cascaded down her back as she struck a number of poses. Helen later changed into a yellow bikini in the same style as she flashed her gorgeous smile by a swimming pool.  ",
        "She looked incredible as she played with her long locks and applied a flawless palette of makeup to accentuate her beauty. The mum-of-three wowed as she changed into a bright pink bikini as she lay by the edge of the pool displaying her toned figure. Helen gushed it was 'the most fun day' as she beamed while posing on the villa steps in a busty blue two piece.She penned: 'Excited to share with you my @modaminx edit for this summer. It was really empowering to do this shoot with being a mummy of three x 'There is something to suit every body shape and to make you feel amazing. @modaminx is such a natural collaboration for me as I just love the brand. Super glam and super girly'.",
        "It comes after I'm A Celebrity South Africa fans hailed praise on Helen after she appeared 'like a new woman' while taking on the latest trial during Monday's episode of the ITV show.The ex soap actress was forced to overcome her fear of heights alongside Amir Khan, 36, and Myleene Klass, 45, after they were faced with the terrifying 'World's End' challenge.Marking the show's highest ever trial, they were told that they would all be climbing a crane-like structure 1,100m high, in a bid to unhook stars and attach them to themselves and win stars for camp.",
        "And - surpassing all expectations - the trio returned with all 11 stars for camp, with Helen leading the line.Ahead of the challenge, they were told that they had only 11 minutes to collect all the stars.Helen, who earlier in the series raised eyebrows over her dramatic approach, was first along the plank, telling herself: 'You're safe and you're fine'.She then picked up the first star.Myleene, not far behind, grabbed the second, with a shaky Amir finally clutching onto the third.Constantly repeating her reassuring phrase, Helen continued to smash the trial - even joking along the way 'Who am I?'Whilst Helen and Myleene eased through the daunting task, it was Amir who was left struggling.",
        "At one point the boxer falls over - joking 'The jewels are alright don't worry'.",
        "Acknowledging her changed attitude at the end of the trial, Helen told hosts Ant and Dec: 'I just thought I can't come back and be the person that can't do it.'I need to come back and show them I can. I thought it was my moment, let's just do it!'Taking to Twitter as the episode aired, fans also couldn't believe what they were watching, claiming Helen was a 'new woman'.One fan wrote: '@helenflanagan1 is a new women!! She should be so so so proud of herself! She's stopped patting her lips all the time too which is great ❤️ #ImACeleb #helenflanagan'A second said: Erm where is the real @helenflanagan1, Wow that was impressive #ImACeleb''Absolutely thrilled for them completing that trial. Helen did fantastic considering the last time she did the jungle she wouldn’t do any trials. #ImACeleb', a third added.'Helen is like a completely different woman to the first time she was on this and I am so proud of her', another pointed out."
    ]
}