{
    "articleURL": "/sport/nrl/article-12041005/Canberra-Raiders-young-star-left-fighting-life-intensive-care-horror-car-accident.html",
    "content": [
        "Jacob Iosefa is being treated in intensive care following a car accidentThe young centre crashed on his way back to Canberra on Monday nightIosefa signed a two-year deal with the Raiders only two weeks ago  Canberra Raiders junior Jacob Iosefa is 'fighting for his life' after suffering 'life-threatening injuries' just two weeks after signing with the NRL club.",
        "In a statement, the Raiders said he was being treated in the intensive care unit at Canberra Hospital following a car crash on Monday evening. According to News Corp, Iosefa suffered a fractured neck and bleeding on the brain and has been placed in an induced coma by the doctors.Initial scan suggest he may have avoided spinal damage, but it is understood the full extent of his injury will be only be assessed once is brought back from his induced coma.News Corp reported the crash happened as Iosefa was driving back to Canberra and his car clipped a truck while overtaking it. It is understood the player was travelling alone.",
        "The club added Iosefa's family have travelled from Wagga Wagga in New South Wales to be alongside him. Incidentally, Iosefa was back in Wagga Wagga to visit his family at the weekend just as the Raiders played the Dolphins in Wagga Wagga.'The Canberra Raiders can confirm SG Ball player Jacob Iosefa remains in Canberra Hospital in the intensive care unit, following a motor vehicle accident on Monday evening,' the statement from the club read.'The Raiders have been assisting Jacob and his family who have travelled from Wagga Wagga to be with him. 'As well as supporting teammates and school friends while Jacob is in hospital.",
        "'Until there is more information, the Raiders will not be making further comment out of respect to his family. The club will continue to support Jacob and his family.'A product of Mt Austin High School in Wagga Wagga, Iosefa moved to Canberra to pursue his rugby league dream and joined the Raiders SG Ball team.He featured in the centres for the team that lost to eventual premiers Parramatta in the semi-final of the Under-19 competition last season and is highly regarded by the Raiders.Friends of Iosefa have set up a GoFundMe page to help raise money for the family and assist with medical bills, food and accommodation  while the player is in hospital."
    ]
}