{
    "articleURL": "/news/article-12059267/Oklahoma-Gov-defends-decision-close-PBS-station-indoctrination-children.html",
    "content": [
        "Shows on the network include 'Sesame Street,' 'Mister Rogers' Neighborhood,' and 'Clifford The Big Red Dog'Gov. Stitt's veto means that the network will cease operations this year unless legislature overrides itHe also criticized a Newshour feature that included parents' support for gender-affirming treatments – including puberty blockersOklahoma's governor has defended his decision to defund his state's PBS affiliate over children's programs he deemed inappropriate - including a drag queen reading a story to children.",
        "Kevin Stitt, a Republican, blocked the funding for the state's PBS station through to 2026 with the move, listing several shows on OETA that it finds 'objectionable'.Shows on the network include 'Sesame Street,' 'Mister Rogers' Neighborhood,' and 'Clifford The Big Red Dog' - which features lesbian parents. The network will cease operations this year unless  legislature overrides the veto.The governor's office claims that a segment of 'Let's Learn' was objectionable, with a children's book titled 'The Hips on the Drag Queen Go Swish, Swish, Swish' being read by Lil Miss Hot Mess.Speaking to Fox News Digital, Stitt said: 'OETA, to us, is an outdated system. You know, the big, big question is why are we spending taxpayer dollars to prop up or compete with the private sector and run television stations?",
        "'And then when you go through all of the programming that's happening and the indoctrination and over-sexualization of our children, it's just really problematic, and it doesn't line up with Oklahoma values.'He also criticized a Newshour feature that included parents' support for gender-affirming treatments for transgender children  – including puberty blockers.There was also a gay character in 'Wok It Out Wombats', which airs on OETA, as well as Clifford the Big Red Dog introducing LGBTQ characters.",
        "His office also criticized Pride Month programming, which included a special about a town of Christians, drag queens who 'step into the spotlight to dismantle stereotypes,' and a same-sex wedding featured on PBS Kids' 'Odd Squad.'Governor Stitt has pushed back at claims by his critics that the shows are 'educational', adding: 'When you think about educating kids, let's teach them to read and their numbers and counting and letters and those kind of things.'I mean, some of the programming that we're seeing… it just doesn't need to be on public television.'He claims that if the programming is so popular, then it could be picked up by other broadcasters that don't require taxpayer dollars to stay afloat.The Governor said: 'Oklahoma taxpayers are going, 'Hey, hang on, time out for just a second. That's not my values.",
        "'I'm just tired of using taxpayer dollars for some person's agenda. I represent the taxpayers. There's so much television, there's so much media.'Maybe in 1957 you could have made an argument that you needed a public television station. That's totally outdated at this point.'All those towers and our communications, that's all owned by the state and whether we continue to fund an outdated public television station with taxpayer dollars, or we let the free market work, we're still going to have the same capabilities, the same assets, the same towers.",
        "'Our DPS system is what rolls out the Amber Alerts, for example. None of that's going away.'So that's just people confusing the issue, not being clear with their mission, trying to make excuses of why the tax dollars should still fund this outdated system.'",
        "However, his claims have angered more left-leaning politicians, with Democrat State Representative Monroe Nichols branding the move as an attack by Stitt on 'public education and underrepresented Oklahoma communities.'OETA board member Ken Busby objected to the decision and said a civilization can't survive without supporting arts and culture, according to KTUL.It comes after Stitt banned all sex reassignment procedures for minors in the state, including irreversible gender transition surgeries and hormone therapies.He joined at least 15 other states with similar laws. "
    ]
}