{
    "articleURL": "/wires/reuters/article-12042881/Barrick-not-interested-bidding-Tecks-copper-assets.html",
    "content": [
        "By Divya Rajagopal",
        "TORONTO, May 3 (Reuters) - Barrick Gold Corp is not interested in bidding for the copper assets of Teck Resources Ltd as there are few synergies between the companies, CEO Mark Bristow said in an interview with Reuters on Wednesday.Bristow's comments come at a time when Canadian mining company Teck has rebuffed a $22.5 billion unsolicited bid from Swiss mining company Glencore Plc and said it is exploring its own simplified diversification that includes opening its metals and coal business to a competitive bidding process.\"We don't think we bring any synergies to that party,\" Bristow told Reuters, adding that even if Teck does a clean split of its copper and coal business, its debt is a problem.\"We would just have to take over the debt and we still get the assets that don't bring synergies.\"Barrick has been building its copper business organically and said it is exploring copper drilling opportunities in countries such as Chile and Argentina. In the first quarter of 2023 it produced 88 million pounds of copper, down from 101 million pounds a year ago.\"We have always said that if you want to be relevant as a gold miner you have to be in copper business,\" Bristow added.Gold is often a byproduct of copper, a critical metal required for electrification and the transition to a greener economy. That has pushed many global miners to hunt for more production assets. Canada's Lundin Mining Corp in March bought a 51% stake in a copper mine in Chile for $950 million.",
        "With limited copper mines available, large mining companies have been looking at separating their base metals and coal businesses to unlock potentially high value from the former.Earlier on Wednesday, Barrick beat Wall Street expectations for first-quarter profit, as higher gold prices outweighed a decline in production. Barrick shares were up 1.2% by late morning, in a flat broader market.Teck last month withdrew its plan to split its coal and metals business after it failed to secure shareholders' approval. The company's board rejected the offer from Glencore and said it would come up with a new simplified plan of separation.Bristow said Glencore's proposal made a \"lot of sense\" as Glencore could handle Teck's debt and had offered a clean split of Teck's business.Glencore has offered to sweeten its offer to Teck and has said it will take its offer directly to shareholders if Teck's board does not engage. (Reporting by Divya Rajagopal; Editing by Sharon Singleton and Mark Potter)"
    ]
}