{
    "articleURL": "/news/article-12049351/US-home-listings-plunged-21-April-new-homeowners-reluctant-locked-high-rates.html",
    "content": [
        "Home listings are down nearly a third from the same period in 2019Experts suggest that the pandemic boom market is finally settling down High mortgage rates since last September are deterring potential buyers Home sales plunged 21 percent in the United States during the month of April, as new prospective homeowners appear to be scared of being 'locked in' to higher mortgage rates. ",
        "The number of new listings continued what appears to be a trend, as listings are down 31 percent from 2019. The 2019 figure was used as a benchmark as it happened before the pandemic. In April 2021, home listings were up 41.5 percent over 2019.  Mortgage rates have gone over 6 percent since September of 2022, causing the once-booming housing market to finally settle.Experts suggested those high-mortgage rates are deterring new buyers, who don't want to be stuck at over six percent. Higher mortgage rates mean homeowners pay more in interest over the life of the loan. ",
        "The number of homes under contract went down 23 percent in April compared to the same month last year.The median listing price for a home was at $430,000 in April, according to Realtor.com. That was up 2.5 percent from a year ago and the slowest growth rate since April 2020. 'This means that there were still fewer homes available to buy on a typical day in April than there were a few years ago,' said the website's home buying expert, Danielle Hale.In addition to worsening conditions for buyers, sellers may not be finding exactly what they want on the market.In April of 2023, 12.2 percent of listed homes had cut their listing price, with Hale suggesting the market was finally coming down to where things were before the pandemic. ",
        "Homes have stayed on the market for an average of 49 days during the past month, an increase of 17 days from this point last year. Markets that saw housing booms during the pandemic and brought in more newcomers than other cities are now seeing prices drop.The greatest declines came in Austin (down 8.8 percent year-over-year), Las Vegas (7.1 percent) and Houston (4.6 percent). The highest price increases year-over-year happened in Memphis (31.7 percent), Milwaukee (21.7 percent) and Kansas City (21.1 percent).  ",
        "In a poll for the site, over 33 percent of potential sellers cited their reasoning as wanting to take advantage of the current market. Hale said that despite the current state of the market, sellers with long lines of equity in their properties may still get what they wanted. 'Sellers who have built up home equity are better positioned to find their next home in a cooling market,' she said. But they 'may need to temper expectations for the sale of their current home.' However, according to economist Jiayi Xu, the days of the boom for selling homes may not be seen again.'A lot of sellers want to wait until home prices go high again,' says Xu. 'Given all of the uncertainties in the housing market, I don't [think] that's going to happen soon.' "
    ]
}