{
    "articleURL": "/tvshowbiz/article-12044209/Russell-Crowe-reveals-hes-blacklisted-Kings-Coronation.html",
    "content": [
        "He may be one of Australia's most celebrated actors, but Russell Crowe will not be among the celebrities attending the Coronation of King Charles III on May 6.",
        "The Hollywood star, 59, said on Thursday he was likely snubbed because he failed to follow strict protocol when he last met members of the British Royal Family.He called Prince Harry and Prince William 'mate' when he greeted them at an event, despite having been told to address them using formal language.When asked by radio host Dan Anstey on Triple M Breakfast Brisbane whether he was heading to London for the Coronation, Crowe said he 'didn't get the call'.'It's probably due to last time I was introduced to royalty,' he added.",
        "'The equerry [an officer of the British royal household], he comes to talk to you and then goes, \"Listen, when you talk to a prince, you refer to them as this, this, this and this.\" The thing is, that's just not in my DNA,' Crowe explained.'I'm always respectful and I'm always very pleased to meet people, but the \"your highness\" thing, it's just not in my nature.'I called Prince Harry and William \"mate\". I though the equerry was going to pass out.'Elsewhere in the interview, New Zealand-born Crowe said he considered himself Australian, having lived in the country for 49 of his 59 years.'I lived here between the age of four and 14, and went back to New Zealand - supposedly home - but it wasn't home to to me,' he said.",
        "He revealed he returned to Sydney as soon as he turned 21, but also identified with his Maori heritage.Crowe became an unlikely defender of King Charles amid the push for Australia and New Zealand to ditch their ties with the British monarchy and become republics.He was quick to jump to the King's defence on Twitter, calling him a 'good bloke' who 'was kind' and 'also funny'.Reflecting on when he met the monarch 20 years ago at a premiere in London, Crowe tweeted: 'The man who would be King was kind. He was also funny.'"
    ]
}