{
    "articleURL": "/wires/aap/article-12056221/Waiting-time-rollercoaster-facing-surgery-patients.html",
    "content": [
        "Patients wanting elective surgery are waiting longer on public hospital lists than they did before the pandemic.",
        "Data released by the Australian Institute of Health and Welfare show 6.3 per cent of patients waited longer than a year for elective surgery - a decrease from 7.6 per cent from the previous year during the height of the pandemic - but an increase from 1.8 per cent in 2017-18.Sociologist Adrian Webster, head of Health Systems Group at the institute, described the impact of the COVID-19 pandemic on the healthcare system as a \"waiting times rollercoaster''.Speaking at the annual conference of Australia and New Zealand College of Anaesthetists in Sydney, Dr Webster highlighted the increasing delays in elective surgery numbers.He cited data that showed patients in 2021/22 wanting hip replacements waited three months longer than they did five years ago.The worst waiting times were in regional and remote areas, and were still in decline.\"We're not back to pre-pandemic levels on performance,\" he said.Anaesthetists at the conference were told their specialities featured at the frontline during the pandemic.Federal Health Minister Mark Butler told conference delegates in a video presentation they had played a critical role throughout the pandemic and would continue to do so \"as we come out the other side\".\"The work that you have performed in a health system that has been under enormous strain has just been extraordinary,\" he said.",
        "\"Every year approximately four million Australians will require care from an anaesthetist - from those having routine procedures to those in emergency and intensive care settings.\"Taking pressure off public hospitals through strengthening Medicare will help the states and territories address the backlog in elective surgery that currently exists in the public system.\"The government will continue to provide support by funding the cost of additional elective surgery procedures delivered by states and territories under the national health reform agreement, particularly procedures that have been deferred by the pandemic.\"Dr Webster's presentation followed an announcement by the World Health Organization that COVID-19 was no longer a global health emergency.More than three years after the WHO declared the outbreak a pandemic, there have been more than 765 million confirmed cases of COVID-19 worldwide, with nearly seven million deaths.It declared an extraordinary event that constituted a public health risk to other countries through the international spread of disease on 30 January 2020.In Australia, 13,021 deaths have been registered by the Australian Bureau of Statistics with or from COVID-19 since the start of the pandemic.COVID-19 continues to spread, remaining a global health threat, but at a lower level of concern."
    ]
}