{
    "articleURL": "/wires/aap/article-12061037/Cowboys-Cotter-joins-Maroons-middle-forward-logjam.html",
    "content": [
        "North Queensland warhorse Reuben Cotter has put his hand up to join a burgeoning group of middle forwards in contention for Queensland in the State of Origin series opener.",
        "The 24-year-old was dynamic with and without the ball in the Cowboys' 20-6 win over Sydney Roosters on Sunday where he played the style of football that led to him being given his Maroons debut in the opening game last year by coach Billy Slater and his fellow selectors.Cotter was outstanding in that 16-10 win but suffered a hamstring injury and missed the last two games of the series, won 2-1 by the Maroons.\"I would love to be there Game One. I love pulling on that jersey, even though I have only done it once,\" Cotter said.\"If Bill picks me, I will be ready.\"The Maroons had Pat Carrigan, Tino Fa'asuamaleaui, Josh Papalii and Lindsay Collins play in all three Origin games last year and that quartet are expected to be chosen as middle forwards for the May 31 clash in Adelaide.Cotter, Jai Arrow, Tom Gilbert, Corey Horsburgh, J'maine Hopgood, Christian Welch, Tom Flegler and Moeaki Fotuaika are among other contenders striving for selection.\"Queensland is in a really good position in terms of depth there. There is competition for spots,\" Slater said.\"I look at a guy like Tom Flegler. He was involved in all three camps last year and didn't quite get a jersey. He wasn't far off.",
        "\"Tom Gilbert did a fantastic job when he was thrown in there (in Game Three). The next (two) weeks is going to be really important for that group.\"\"There are a lot of players capable. We had 22 players play for Queensland last year but we only get the opportunity to pick 17 so there are going to be players that played last year, and got the job done, that won't find themselves in the side in the first game.\"Cotter would have almost certainly been retained for the entirety of last year's series if he'd not been injured.\"Obviously i would have loved to have played in the next two but with the hamstring I couldn't do that,\" he said.\"I wanted to be out there. Game Three the boys won and that was pleasing. Billy brought us into camp for that last one as well I was happy to be a part of it.\"It is no surprise who Cotter's Maroons hero is.\"Gorden Tallis was a big one, just for the way he played. His physicality. I just love it,\" he said.And his favourite Origin moment from Tallis?\"Just the one where he snagged some bloke twenty metres over the sideline,\" he said.That bloke was NSW's Brett Hodgson who Tallis rag-dolled over the sideline in the 2002 decider.",
        "\"Just the passion. I love the passion side of it. I think that is what makes our game so great,\" Cotter said.\"I try to play like that.\""
    ]
}