{
    "articleURL": "/sport/football/article-12047605/Harvey-Barnes-leave-Leicester-summer-amid-Tottenham-Aston-Villa.html",
    "content": [
        "Harvey Barnes has scored 10 goals in 30 league games for Leicester this seasonHe could leave the club this summer amid interest from Spurs and Aston Villa The winger is yet to enter extension talks on a contract that runs until 2025 Harvey Barnes could follow James Maddison out of the exit door at Leicester this summer with a number of Premier League rivals thought to be tracking the winger.",
        "Barnes has scored 10 goals in 30 league appearances in a struggling team this season and is likely to attract bids at the end of the season.The 25-year-old was valued at £60million when Newcastle enquired this time last year and both Tottenham and Aston Villa are believed to be watching developments closely. Villa will target at least one wide man over the course of the summer while Spurs are likely to pursue homegrown players in their next recruitment.Unlike Maddison, who has only one more year on his contract, Barnes is tied to Leicester until 2025 but there have yet to be meaningful discussions about signing a new one. ",
        "Even if Leicester survive, there will be a huge overhaul of playing staff at the end of the campaign, with eight first-teamers out of contract and the chance to cash in on Barnes and Maddison.Spurs have also been following Maddison, along with Newcastle – who bid about £35m last summer – and both Manchester clubs. Leicester are approaching the end of an era but need players like Barnes, Maddison and Jamie Vardy to haul them clear of trouble over the final four games. Leicester are above the bottom three on goal difference alone.Ahead of Monday’s trip to Fulham, Vardy has found form again. After a miserable season, he has scored each of his last two games under interim boss Dean Smith and looks somewhere near his sharpest.",
        "Even though Vardy has a year left on a lucrative contract, his Leicester future was in serious doubt if Brendan Rodgers had stayed in charge. But since the change in the dugout the Foxes are once again looking to their talisman in the final four games of the season.Smith said: ‘People will have seen in the last few games the hunger, desire and work rate he has shown. As he puts it, his legs are still there, and his brain is still there. He scored against Leeds and Everton and he is in a good place.",
        "‘He knows he’ll be judged on goals and he’s not really had the pitch time to earn those goals or chances.'But he won a penalty against Wolves, scored against Leeds, and scored and hit the bar against Everton. He’s in a good vein of form and with four games to play we need that.‘It wasn’t a case of rebuilding his confidence but we had to play more to what we feel are his strengths. He is very intelligent at making runs but he needs the balls to go into the areas where is running.‘If you put the ball into those areas he will make things happen. We have to have the supply line to him and he has to make the runs.’"
    ]
}