{
    "articleURL": "/femail/article-12059549/Princess-Wales-reveals-affectionate-nickname-Prince-Louis.html",
    "content": [
        "The Princess of Wales affectionately called her son 'poppet' in Slough today READ MORE: For all the latest Royal news, pictures and video click hereThe Princess of Wales has revealed an affectionate nickname for her youngest son as she and her husband got their children to roll their sleeves up for The Big Help Out today.",
        "Five-year-old Prince Louis was out for his first public engagement today as he joined the family to renovate a building in Slough.And as he put his best foot forward to help out with the arduous tasks at hand, Kate, 41, praised her 'poppet's' hard work.Elsewhere, she was heard lovingly calling her little one 'Lou bug'. The royals' decision to bring their young family was kept secret until they arrived in order minimise any fuss for the youngsters who are being slowly introduced to the idea of public engagements.",
        "The family were also insistent that the children get 'properly stuck in' and lend a hand - which they certainly did.The children set to work straight away with Charlotte and Louis helping to paint a planter and George joining his father with some drilling.The eldest continued drilling, clearly loving the task in hand, while the Princess of Wales then took her two youngest children off to try their hands at another activity.Louis was given a wheelbarrow to fill with sand and took to the task with huge enthusiasm.He tried to push a heavy wheelbarrow full of sand which proved a bit too heavy for him, trotted off to get an empty one, picked up a shovel and filled it.",
        "'Ouffff!' He shouted as he dig away without any help,.'Good job Lou,' encouraged the princess.His mother came up to him and asked: 'Do you want to put in a bit more? Do you want a hand? Good job.'",
        "Determined Louis refused all offers of help, however, and pushed the heavy wheelbarrow himself around the Scout hut, to where other volunteers were helping build a path.'Well done, good job, Lou-bug,' Kate said.He loved the task so much that he carried on shuttling back and forwards with his wheelbarrow without either of his parents around.Kate repeated the affectionate nickname when the family gathered around to toast some marshmallows for S'mores, while helping little Louis place his sweet treat on a stick.'Pop that in the fire, Lou-bug' she said, giving her youngest an empty skewer to dispose of. Inside the scout hut the family added their handprints to a tree on the wall made up of all those who have contributed to the volunteer effort.'Hey poppet,' Kate told Louis as her younger child delightedly grabbed a brush. She encouraged him to paint her hand first, liberally covering it with yellow paint.He then led his mother by the hand and encouraged him to place her hand on the wall. 'Ready, steady, go. Good job!' the Princess of Wales smiled.",
        "But that clearly wasn't going to be enough for Louis and, as his mother washed her hands, he went off to get some paint for himself.He first chose some yellow paint and started putting it on his hands with the princess's encouragement before make his own handprint. 'Good job,' Kate encouraged.Louis then decided to have a go again, looking carefully to make sure every spot of skin was covered, before find another spot on the mural to place his hand.'Do you want to put it next to me?' asked Kate.Louis washed his hands carefully - but then decided that simply wasn't enough. He covered his mother's, and then his own hand, with blue paint. 'One more!' he urged her.",
        "They were then joined by Charlotte who wanted to make her own.Louis proudly pointed out his handprints. 'Look! There, there, there and there!'The couple and their three children were out and about again to mark the third day of the King's Coronation, and Charles III's life of service.The Princess of Wales has been Joint President of the Scouts since 2020 and the royals joined volunteers in resetting a path, digging a new soakaway, sanding and revarnishing the front door, adding planters to the front of the building and adding a mural to create a lasting legacy of the Big Help Out's work. ",
        "William and Kate,who were casually dressed, wore scarfs from the 3rd Upton Scout Group as they mingled with scouts and leaders taking part in The Big Help event – one of thousands across the country to mark the end of the coronation.Mr Madigan said the Big Help Out event was to make improvements to the scout hut, including building a ramp at the rear of the scout hut to make it more accessible.",
        "As the Princess of Wales left she stopped to talk to local resident Donna Robinson who was standing by a barricade with her seven year old daughter Ciara.The Princess, casually dressed in a blue top and dark coloured trousers, held on to Louis's hand as she stopped to say hello and asked Donna how old her daughter was.Donna said: 'She asked what year Ciara was and was lovely.'Other senior royals including the Duke and Duchess of Edinburgh, the Princess Royal and the Duke and Duchess of Gloucester, are also getting involved in volunteering today.Princess Anne and her husband, Vice Admiral Sir Timothy Lawrence, are at a civic service recognising local volunteers at Gloucester Cathedral, which will be followed by a special reception for invited volunteers and charity representatives from across Gloucestershire. Sophie, Duchess of Edinburgh, as a patron of Guide Dogs, is attending a puppy training class at the Guide Dogs Training Centre in Reading with her husband, Prince Edward.",
        "There are over 8million opportunities to get involved today, with more than 52,000 events happening across the nation.The 3rd Upton Scouts Hut was built in 1982 and is used by a variety of community groups in the area, including the local mosque, a senior citizens contact group for members of the Asian community and the Scout group themselves. The building is also used by 'Slough All Nations,' a group with heritage spanning across St. Kitts &amp; Nevis, and which provides recreation and leisure activities to improve health and wellbeing and promote community cohesion.  Among other planned events, the Royal Parks is holding a drop-in session in Green Park in central London, close to Buckingham Palace, where volunteers can plant wild flowers in the same spot where the public laid floral tributes to the late Queen.The Duke of Gloucester, the late Queen's first cousin, and his wife Birgitte are meeting young volunteers at a Coronation party at St Mark's Coptic Orthodox Church in Kensington, west London.Meanwhile, Prime Minister Rishi Sunak is helping out at a lunch club, Labour leader Sir Keir Starmer will hit the phones with the NHS Volunteer Responders scheme, Welsh First Minister Mark Drakeford is volunteering at a local charity shop, and Scotland's First Minister Humza Yousaf is volunteering at a local community larder.",
        "Mr Sunak said: 'The Big Help Out is not only a chance for everyone to come together to mark His Majesty's Coronation, it's also a reminder of how each and every one of us can help make a change for the better.'It is this community spirit that binds us and makes us stronger as a country, and I hope that as part of the legacy of this historic moment of national unity, people will be inspired for years to volunteer, to help out and to make a difference to others around them.'"
    ]
}