{
    "articleURL": "/wires/ap/article-12060903/Shell-Fire-reignited-Texas-plant-extinguished.html",
    "content": [
        "HOUSTON (AP) - Crews have finally extinguished a fire at a Houston-area petrochemical plant that had been burning on and off for days, according to Shell, which operates the plant.",
        "Fire fighters first responded to the blaze at the Deer Park facility on Friday afternoon. On Saturday morning, Shell said the fire had been extinguished. But a few hours later, Shell announced the fire had reignited.The fire was finally extinguished on Sunday night, Shell spokeswoman Natasha Qamar said Monday. The reignited fire was contained in a controlled area.\"Air monitoring is ongoing and has not detected any harmful levels of chemicals affecting neighboring communities. There is no danger to the nearby community,\" Shell said.The city of Deer Park did not issue a shelter-in-place order for residents during the fire.The fire had started at plant´s olefins unit, which makes plastics and rubber. The unit was undergoing routine maintenance at the time of the fire.",
        "Nine workers who were sent to a hospital were released after undergoing precautionary medical evaluations. The cause of the blaze remained under investigation.Shell said Sunday that the large amount of water being used to extinguish the blaze had exceeded the plant´s wastewater storage capacity and was being released into the Houston Ship Channel.A floating barrier or boom was being used to prevent any chemical products from the plant from running off with the wastewater and contaminating the channel, Qamar said.After some rain on Sunday, a \"light sheen\" was seen outside the boom but it has been cleaned up, Shell said.",
        "\"Our teams are working around the clock to verify the environmental and safety precautions of the actions taken thus far,\" Harris County Judge Lina Hidalgo, the county´s top elected official, said in a statement Sunday night.Local environmental groups were not reassured by Shell´s statements that the community was not in danger.\"History has shown that these early statements are for the benefit of industry public relations and not public health,\" said Jennifer Hadayia, executive director of Air Alliance Houston.Facility fires are not uncommon in the area, with the large presence of the petrochemical industry. In March, an explosion and a fire erupted at a facility owned by INEOS Phenol in nearby Pasadena, Texas, leaving one injured.A fire in 2019 at a facility owned by Intercontinental Terminals Company burned for days and though it caused no injuries, it triggered air quality warnings. ___Follow Juan A. Lozano on Twitter: https://twitter.com/juanlozano70"
    ]
}