{
    "articleURL": "/wires/ap/article-12058915/ASEAN-leaders-tackle-regional-crises-tropical-resort.html",
    "content": [
        "LABUAN BAJO, Indonesia (AP) - A picturesque tourist destination will host crisis-weary Southeast Asian leaders with sun-splashed tropical islands, turquoise waters brimming with corals and manta rays, seafood feasts, and a hillside savannah crawling with Komodo dragons.",
        "The sunshiny setting is a stark contrast to the seriousness of their agenda.Indonesian President Joko Widodo picked the far-flung, rustic harbor town of Labuan Bajo as a laidback venue to discuss an agenda rife with contentious issues. These include the continuing bloody civil strife in Myanmar and the escalating territorial conflicts in the South China Sea between fellow leaders of the Association of Southeast Asian Nations.The 10-nation regional bloc and its member states will meet for three days starting Tuesday, with the growing rivalry between the United States and China as a backdrop.U.S. President Joe Biden has been reinforcing an arc of alliances in the Indo-Pacific region to better counter China over Taiwan and the long-seething territorial conflicts in the strategic South China Sea which involve four ASEAN members: Brunei, Malaysia, the Philippines and Vietnam. Indonesia, this year´s ASEAN chair, has also confronted Chinese fishing fleets and coast guard that have strayed into what Jakarta says was its internationally recognized exclusive economic zone in the gas-rich Natuna Sea.Widodo, who's in his final year on the world stage as he reaches the end of his two-term limit, said ASEAN aims to collaborate with any country to solve problems through dialogue.",
        "That includes Myanmar where, two years after the military power grab that forced out Aung San Suu Kyi´s administration and sparked a bloody civil strife, ASEAN has failed to rein in the violence in its member state. A five-point peace plan by ASEAN leaders and the top Myanmar general, which calls for an immediate stop to killings and other violence and the start of a national dialogue, has been disregarded by Myanmar´s ruling military.",
        "ASEAN stopped inviting Myanmar´s military leaders to its semiannual summits and would only allow non-political representatives to attend. Myanmar has protested the move.In an additional concern involving Myanmar, Indonesian officials said Sunday that 20 of their nationals, who were trafficked into Myanmar and forced to perform cyber scams, had been freed from Myanmar´s Myawaddy township and brought to the Thai border over the weekend. During the summit, ASEAN leaders planned to express their concern over such human trafficking schemes in a joint statement, a draft copy of which was obtained by The Associated Press.Indonesian Foreign Minister Retno Marsudi said her country, as ASEAN chair, has tackled the Myanmar crisis in a non-adversarial way.\"Colleagues certainly know that in the early stages of its leadership, Indonesia decided to take a non-megaphone diplomacy approach,\" Marsudi said. \"The aim is to provide space for the parties to build trust and for the parties to be more open in communicating.\"Widodo´s choice of a seaside venue with stunning sunrises and sunsets and the sound of birds chirping all day complements that approach.The Indonesian leader also hoped the high-profile ASEAN summit would put Labuan Bajo and outlying islands, dotted with white-sand beaches and even a rare pink-sand beach, under the global tourism spotlight.",
        "\"This is a very good moment for us to host the ASEAN summit and showcase Labuan Bajo to the world,\" said Indonesian President Joko Widodo, who flew in Sunday with his wife to a red-carpet welcome flanked by military honor guards and dancing villagers with flower-filled headwear.But there are a few hitches.The far-flung fishing town with only three traffic lights and about 6,000 residents is acutely short of hotels for ASEAN´s swarm of diplomats, delegates and journalists. Many had to arrange to share rooms.Unlike the more popular Bali resort island or the bustling concrete jungle of a capital Jakarta, which has hosted international conclaves in upscale hotels and convention centers, Labuan Bajo is a far smaller town that a visitor could cross from end to end with a brisk two-hour walk. There are no public buses, and villagers mostly move around by walking, riding scooters or driving private cars.A small team of local technicians with hard hats were flown in to lay cables and expand internet connections at the venues on short notice.On Sunday, Labuan Bajo´s small airport was jampacked with visitors. Teams of diplomats and journalists arrived to welcome streamers announcing the upbeat summit motto, \"ASEAN Matters: Epicentrum of Growth.\"Outside the airport named after the Komodo dragons, traffic quickly built up under the brutal noontime sun.",
        "When the sun rose Monday morning, workers were still cementing some roadsides around the venues - a day before the summit opening.Andre Kurniawan, who works at a dive center in Labuan Bajo, said the infrastructure developments would be a boon for Labuan Bajo villagers. \"We were isolated from some areas before and now they are open and the areas are getting better. I hope that Labuan Bajo can be a better tourist town in the future,\" he said.Azril Azahari, chair of an association of Indonesian academic experts on tourism, told the AP that Labuan Bajo was not ready and apparently was chosen to host the summit on short notice. \"The hotel facilities and the lodging have become a problem. There is a ship being used for accommodation and it´s not a lodging ship,\" he said.Welcoming visitors to her coffee shop ahead of the summit, Suti Ana said even though it wasn´t the best time for Labuan Bajo to host, ASEAN would boost local businesses. \"But we cannot wait, so this is the time,\" she said.Choosing the small port town was not a bad idea, Azril said, if it came with adequate planning and government investments in infrastructure.Located on the western tip of Flores island in southern Indonesia, Labuan Bajo, aside from its beaches and diving and snorkeling spots, has been better known as the gateway to the Komodo National Park - a UNESCO World Heritage site and the only place in the world where Komodo dragons, the world´s largest lizards, are found in the wild.",
        "Environmentalists and tourism analysts fear that a wider public interest could put further stress on the already endangered Komodo dragons. Only about 3,300 were known to exist as of 2022.\"If more people come, sooner or later the Komodo dragons cannot breed in peace, this can be a problem,\" Azahari said, citing longstanding fears that the Komodos could face extinction without full protection.Despite the odds, Indonesian officials said they would do everything to successfully and safely host the ASEAN summit in Labuan Bajo.\"If there´s any commotion along the way, that will be a big stain on the nation´s dignity,\" Edistasius Endi, the regent of Labuan Najo´s West Manggarai district, said in a statement.___Associated Press journalists Jim Gomez and Achmad Ibrahim contributed to this report.___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}