{
    "articleURL": "/tvshowbiz/article-12053271/Padma-Lakshmi-joined-daughter-Krishna-Lakshmi-Dell-Taste-Nation-season-2-screening.html",
    "content": [
        "Padma Lakshmi looked stunning as usual as she attended the season two screening of her Hulu show Taste The Nation on Friday evening in New York City.",
        "The 52-year-old chef - who recently spoke about making her Sports Illustrated debut - was accompanied by her 13-year-old daughter Krishna Lakshmi-Dell.The Indian-born food connoisseur looked fabulous in a shimmering brown jumpsuit with a plunging neckline.The beauty teased her ample cleavage in the look, which was sleeveless and wrapped at her waistline.It had long, wide pant legs that covered her footwear as she walked the event's red carpet. ",
        "For her part, Padma's mini-me looked great in an olive green pantsuit with a double-breasted blazer.The teen's trousers were pleated down the center and punctuated with textured black booties.The young lady, whose father is venture capitalist Adam Dell, wore her long, purple-highlighted brunette locks in loose curls.She smiled with pride as she posed next to her successful mother on her big night.Padma accessorized with extra large hoop earrings and wore her long, dark hair in spiral curls.The Top Chef host also flaunted a watch and added a face of flattering makeup complete with a glossy nude lipstick. ",
        "Padma was supported by her many famous friends at Friday evening's gathering, including Chris Rock, and chefs Sophia Roe and Marcus Samuelsson.The 58-year-old Selective Outrage star was dressed casually in a navy blue bomber jacket and dark cargo pants.",
        "The longtime comedian added a black beanie hat and wore silver headphones around his neck.Rock added a black t-shirt and light-colored sneakers as he graced the Crosby Street Hotel with his presence.Sophia pulled her lustrous, dark, curly locks into an updo with blunt, textured bangs.She wore a long, statement-making cream coat and a coordinating graphic t-shirt, then added gold and brown patterned pants.The look was finished with black leather loafers and she wore a light face of makeup.Marcus made a statement in a casual getup that included a houndstooth patterned Gap sweatshirt.The 52-year-old Ethiopian-born restaurateur added a blue baseball cap and loafers with a leopard print.",
        "Other attendees included Nigerian-American chef Kwame Onwuachi and Kerry Diamond, the founder and editor of Cherry Bombe magazine.Kwame, 33, showed his fashion sense in an orange, black, and purple button-down shirt and black pants.He added a pair of black Jordan sneakers with a white sole and a black hat.Kerry was a sight to see in a long, pink and black dress with a leopard print pattern throughout.She finished the look, which had a ruffled hemline, with a pair of pointy-toe black heels.Diamond supported Padma via an Instagram post shared with her site's 199,000 followers on Friday morning.",
        "She wrote in the caption, along with a promotional image, 'The new season of “Taste the Nation with Padma Lakshmi” launches today on @hulu!''Don’t miss @padmalakshmi on this delicious and thought-provoking journey to examine American foodways,' the caption continued.'Add to your watch list. And congrats to Padma! What a week. @time 100, @sportsillustrated swimsuit issue &amp; “Taste the Nation.” Quite the feat!' finished the message.",
        "Canadian food writer Gail Simmons was also present for the premiere on Friday. The 46-year-old cookbook author attended the screening in a button-down shirt covered in a tomato pattern. She added deep blue jeans with gold hardware accents and finished with shimmery metallic gold booties.The star wore her light brown hair down, styled straight and arranged in a center part.Actress Susan Sarandon also turned up for the affair, keeping casual in dark jeans and a vintage black leather motorcycle jacket.The 76-year-old Hollywood icon looked great with her locks slightly tousled and styled with short bangs.She finished off her ensemble with a pair of green and white sneakers. ",
        "In a new interview with Haute Living magazine Padma said she thinks she wins at the TV chef game because she's relatable.'I spend a lot of time — especially when I'm filming — trying to make people feel comfortable,' the star told Laura Schreffler.",
        "'I don't think I intimidate. I mean, I try to be as warm and approachable as I can, because I remember being intimidated by a lot of people growing up,' she added.The single parent added, 'I think on Top Chef, for so long, my position and my role on that show caused people to think I was more intimidating than I am — I had to be stoic in my role — but that's not me normally.'She has been on Top Chef since 2006 and she created Taste the Nation in 2020, with the second season returning on Friday.'You know, it was a new skill for me to interview people,' she admitted.'I mean, I'm a food writer. Before Taste the Nation, I could count on one hand the times I had to interview people, and those were at a literary festival or a food festival — it wasn't for anything very high stakes. 'It was something I had to learn on set, and I'm still learning,' Lakshmi explained.",
        "'I think the reason I learned [how to become an interviewer] so quickly is that I'm genuinely interested,' Lakshmi confided.'The whole show is created around all of my various interests: history, food, people, languages, traveling. I'm genuinely curious.'",
        "Lakshmi said she tried to approach every community with fresh eyes.She wants to go into a community, learn about their food, have your questions answered, and then repeat."
    ]
}