{
    "articleURL": "/wires/reuters/article-12051951/D-C-United-streak-tough-test-FC-Cincinnati.html",
    "content": [
        "FC Cincinnati coach Pat Noonan isn't spending much time reviewing early-season video of his next opponent, but instead is concentrating on what streaking D.C. United have done lately.",
        "D.C. United (4-4-2, 14 points) carry a three-game MLS winning streak into the match at Eastern Conference co-leader Cincinnati (6-1-3, 21 points) on Saturday.\"The focus for us has been on their last three or four games,\" Noonan said. \"Defensively they're very organized. You can see the improvements on that side of the ball. They're in good form and deserving of these results.\"Throw in a U.S. Open Cup victory and D.C.'s four wins in a row equal the number victories it had in the previous 33 games (4-21-8) in all competitions back to May 2022.\"We want to keep this going and not relax for anything,\" D.C. midfielder Victor Palsson said. \"Now, we have to give even more.\"D.C.'s surge is led by Christian Benteke, the former Liverpool, Aston Villa and Crystal Palace forward who scored on a bicycle kick in the 3-0 victory over Charlotte FC on April 29. He has five goals for the season.D.C. United will be without captain Steven Birnbaum due to a hip injury, the team announced Friday.Meanwhile, Cincinnati is getting goals from an unexpected source. Defender Yerson Mosquera's header enabled Cincinnati to tie New England 1-1 on April 29 in a matchup of conference leaders.He also scored in a 1-0 win against Inter Miami and his pair of goals rank him behind the three goals each for Austin FC's Jon Gallagher and Caleb Wiley of Atlanta United for the most by defenders this season.",
        "Cincinnati has won all five home matches this season and is 8-1-2 in the past 11 games there over two seasons.With the game Saturday starting a stretch of three straight at home, Noonan hopes to put some separation between Cincinnati and the field.\"It's nice to have a stretch of games here where, based on our current position and the success we've been able to have at home, we have an opportunity to hopefully stay in a position that we're in or jump a position,\" he said.--Field Level Media"
    ]
}