{
    "articleURL": "/money/cars/article-12050317/Do-know-BMW-stands-for.html",
    "content": [
        "BMW was founded in 1916 and is one of the largest car producers in the worldREAD MORE: Do you know what WD-40 stands for?To car fans, the name BMW is synonymous with quality, but even enthusiasts may not have paused to consider what the brand name actually means. ",
        "The famous BMW logo we see today is a result of the evolution of the German brand that started more than 100 years ago. The automobile company - and one of the largest car producers in the world - manufactures both vehicles and motorcycles and was founded in 1916.BMW stands for 'Bayerische Motoren Werke', which means 'Bavarian Motor Works' or 'Bavarian Engine Works Company' - named after its place of origin in Munich, Bavaria, Germany.",
        "However, the firm was initially named Bayerische Flugzeugwerke AG back in 1916 and was later renamed to Bayerische Motoren Werke, now known as BMW, in 1922.One of the company's original founders Karl Rapp had preferred to model the brand after himself and call it Rapp Motorenwerke GmbH. At the time, BMW was known to manufacturer aircraft engines and other machines which it produced from 1917 to 1918 and again from 1933 to 1945. In fact, BMW's first product was a straight-six aircraft engine called the BMW IIIa, designed in the spring of 1917 by engineer Max Friz.BMW didn't become an automobile manufacturer until 1928, when it purchased the now defunct automobile manufacturer Fahrzeugfabrik Eisenach.The first car ever sold as a BMW was a rebadged Dixi called the BMW 3/15 and throughout the 1930s, BMW expanded its range into sports cars and other luxury vehicles.",
        "The BMW logo itself was first introduced in 1917,  with the circle shape of the logo still remaining the same until today.The circular blue and white logo evolved from the Rapp Motorenwerke company logo, which featured a black ring bearing the company name.BMW retained Rapp's black ring, but added a decorative plate bearing a reference to the blue and white flag of the Free State of Bavaria.However, as the local law regarding trademarks forbade the use of symbols of sovereignty on commercial logos, the design was immediately altered to comply, but retained the colours blue and white.BMW explained that there was no real need for a symbol in the early days, as their main business focused on the production and maintenance of aircraft engines for the German Air Force.It added that their very first advert lacked any BMW symbol or emblem. ",
        "Car insurance bills have a habit of creeping up, so comparing prices for the best deal is a wise move. New rules introduced to stop insurers bumping up renewal quotes haven't had the desired effect and it still makes sense to check for better deals on the comparison sites. We suggest:MoneySupermarket*Confused.com*GoCompare*Uswitch*Mail Finance* Also check Direct Line and Aviva, which do not appear on comparison sites.* Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. Car insurance: can you save money? &gt; Tips to cut the cost of car insurance &gt; Beware of these sneaky car cover fees ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}