{
    "articleURL": "/news/article-12051167/Google-engineer-31-jumps-death-14th-floor-tech-companys-NYC-headquarters.html",
    "content": [
        "A Google engineer, 31, jumped to his death from the 14th floor of the company's New York City headquarters The man, who has not been publicly identified, was found on the ground on the 15th Street side of the building around 11.30pm A Google engineer, 31, jumped to his death from the 14th floor of the company's New York City headquarters. ",
        "The man, who has not been publicly identified, was found on the ground on the 15th Street side of the building around 11.30pm on Thursday. Police received multiple phone calls about the incident and authorities said he was found unconscious. He was rushed to Bellevue Hospital, where he was later pronounced dead. Officers found handprints on the 14th-floor ledge, where an open-air terrace is located, sources told the New York Post. There was no suicide note left behind, according to the Post. ",
        "DailyMail.com has contacted Google for comment.  This is the second Google employee to reportedly take their own life as fellow coworker Jacob Pratt, 33, was found dead inside his apartment on February 16. Pratt appeared to have hanged himself, an NYPD source told the New York Post.According to his LinkedIn, Pratt was a partnership leader at the company and had been for a year and a half. He started at Google as an agency manager in May 2019.'His interests in advertising and technology lead him to a dream job as an accounting manager at Google in Manhattan,' his obituary said.Their deaths came shortly after Google laid off roughly 12,000 of its global workforce. It is unclear if face a job threat. Google's parent company Alphabet axed 12,000 jobs in the latest savage round of white collar layoffs sweeping across the tech sector. ",
        "Sundar Pichai, Alphabet's CEO, said the losses affect teams across the company including recruiting and some corporate functions, as well as some engineering and products teams.The mass reduction comes just days after rival Microsoft Corp said it would lay off 10,000 workers, and Amazon started to fire its 18,000 workers as the 'richcession' rips through the world's biggest firms in recent months. The most in-demand workers right now are blue collar employees, while white-collar workers have seen major job losses in the last year.The phenomenon has been dubbed 'richcession' by those in the field.If you are experiencing suicidal thoughts or actions, please call the National Suicide Hotline at 988.  "
    ]
}