{
    "articleURL": "/sciencetech/article-12060769/Can-guess-unusual-origins-todays-tech-giants.html",
    "content": [
        "Samsung's mom and pop grocery became a $326.2 billion tech juggernaut  Sony's $115.46 billion market cap began with a failed rice cooker prototypeREAD MORE:  12 weird tech patents from Amazon's floating blimp warehouse to Apple's windowless self-driving carA canny business pivot can be crucial to a company's survival.",
        "But some of the world's most famous tech companies switched strategies so dramatically that you'd barely recognize their past lives.In today's economic climate, the conventional wisdom is that 90 percent of all start-ups fail. So it's probably a for the best that Nokia switched from toilet paper to telecommunications and that Samsung traded dried fish for consumer electronics.Test your knowledge below:",
        "Samsung: from dried fish to smartphonesSamsung started its life as Samsung Sanghoe, a grocery trading store that sold dried fish, noodles and vegetables in Daegu, South Korean in 1938.After World War II, Samsung's owner Lee Byung-chul moved the company into manufacturing, first opening a sugar refinery and then founding a clothing company in 1954. Before it became known as a challenger to Apple and Sony, Samsung was famous for owning the largest woolen mill ever built in Korea at that time.But it wasn't until 1970 that Samsung began to make a name for itself with consumer tech products: first black-and-white televisions, then color TVs, calculators and even air conditioners.Lee made another unusual gamble in 1983: opening a semiconductor plant to supply chips to US and Japanese tech firms. Apple's young iconoclastic co-founder, Steve Jobs, was among the first to visit the plant—the beginning of a beautiful friendship that only soured once Samsung emerged as one of Apple's direct competitors.",
        "In 2011, Apple accused Samsung of lifting designs for both the iPhone and iPad, suing their former chipmakers for $2.5 billion over alleged patent infringement.Samsung ultimately was ordered to pay just under $600 million.To put that in perspective, Samsung's market cap today is $326.2 billion USD or about $10.9 pounds of Korean dried anchovies ($29.99 per Lb.) on Amazon.Nokia: from Finnish-made toilet paper to telecommunicationsWell over a century before the company became synonymous with its indestructible brick of a cell phone, Nokia began as a wood pulp mill. Its paper goods, including Nokia toilet paper, were a signature product of the brand.Established in 1865 near the Tammerkoski Rapids in southwestern Finland by mining engineer Fredrik Idestam, Nokia got its name from the Nokianvirta river along which Idestam established his second mill in 1871.",
        "By the middle of the 20th century, Nokia's expansion had led to mergers with Finnish Rubber Works, which manufactured Nokia wellington boots and tires, and Finnish Cable Works, which laid the groundwork for Nokia's telecommunications cable and electronics business.The company was a true pioneer in mobile phone technology, introducing the Mobira Senator car phone in 1982 and the Mobira Talkman portable car phone in 1984.These days, following a botched, billion-dollar attempt by Microsoft to acquire Nokia's mobile phone business, the Finnish firm has pivoted back sharply to telecom infrastructure. It's partnered to build 5G wireless radio base stations in Japan and is now preparing to expand its businesses off-world.",
        "In 2020, Nokia signed a $14.1 million deal with NASA to erect the first-ever 4G mobile network on the moon.Sega: from slot machines for military bases to a racing hedgehogSega began as a legalized gambling racket. Founded as Service Games, Hawaii in 1946, the company distributed slot machines and other coin-operated devices to US military bases across Hawaii in the postwar Pacific.Decades before it was trashing its video game competitor Nintendo in rude '90s ads, Sega was crowding out its Chicago slot machine competitor, Mills Novelty Co., by purchasing Mills' own High Top machines and refurbishing them as the Sega Bell.Sega Bells were sold across the Pacific by Service Games in Japan, Korea, Taiwan, and the Philippines.",
        "Into the 1950s, as Mills struggled to expand into the overseas markets that Sega had already dominated with their own machines, Mill's advertisements would warn customers about their 'imitation and rebuilt machines from Japan and elsewhere.'Sega's transition from slot machines to coin-operated video arcade games and then home consoles seems inevitable now, but the firm still had to continue out hustling its competitors.It released a clone of Atari's Pong, called Pong-Tron in 1973. And in 1980, it opened a rival to Atari founder Nolan Bushnell's Chuck E. Cheese family pizza arcade franchise, which they called P.J. Pizzazz.Not quite as memorable as Sonic the Hedgehog, but quick thinking nonetheless.",
        "Flickr: from online role-playing games to photo sharing The photo-sharing site Flickr was launched by the Vancouver-based company Ludicorp in 2004 based on tools that they had originally created for what they'd hoped would be a massively multiplayer online roleplaying game (MMORPG).Ludicorp's MMORPG, Game Neverending, proved to be less feasible than revolutionizing photo-sharing for the millennial era of digital cameras.",
        "'It turned out the fun was in the photo sharing,' Ludicorp co-founder Caterina Fake told USA Today in 2006.Fake believes that many of the site's most winning features, designed to share fun images from the roleplaying game's activities, never would have come into existence had the team made a premeditated attempt at producing a general interest photo-sharing app.'Had we sat down and said, \"Let's start a photo application,\" we would have failed,' Fake says. 'We would have done all this research and done all the wrong things.'Sony: from a wooden rice-cooker to an electronics empireThe first invention ever made by Sony, under its original name the Tokyo Telecommunications Research Institute, was an electric wooden rice cooker prototyped in 1945.  The company's founder, Masaru Ibuka, had built the device in the wake of Japan's defeat in World War II, hoping to create a product that utilized the nation's new electrical grid.But the appliance, a crude network of aluminum electrodes affixed to the bottom of a wooden tub, struggled to produce reliable or tasty rice. Faced with a unregulated and inconsistent electricity, plus wide variations in rice strains, the cooker often yielded overcooked mush or an unwelcome, undercooked crunch.  ",
        "Thankfully, Ibuka had his first worldwide hit was in 1957, a pocket sized transistor radio, dubbed the TR-63.",
        "Music and high-tech audio electronics soon became the soul of Ibuka's company. The following year, the Tokyo Telecommunications Research Institute rebranded as Sony Corporation: it's new name was the combination of the Latin word for sound, 'sonus,' and 'sonny,' then a fairly common slang term for young man. According to Sony's own corporate history, the combination is 'supposed to represent a very small group of young people who have the energy and passion towards unlimited creations and innovative ideas.' Exactly the kind of people, in other words, who would enjoy making games for the Sony's PlayStation consoles today. "
    ]
}