{
    "articleURL": "/wires/reuters/article-12059531/Ukraine-moves-day-mark-Nazi-surrender-shift-West.html",
    "content": [
        "Russia marks Victory Day over Nazis on May 9",
        "Zelenskiy says he will move anniversary to May 8Move would align Ukraine with Western countriesRussian foreign ministry calls Zelenskiy 'traitor'(Adds details on change, Russian foreign ministry spokeswoman)By Elizabeth PiperKYIV, May 8 (Reuters) - President Volodymyr Zelenskiy moved on Monday to formalise the day that Ukraine marks the allied victory over Nazi Germany in World War Two as May 8, aligning it with Western nations in a repudiation of the Soviet past quickly condemned by Moscow.Speaking to Ukrainians on a hill overlooking Kyiv, Zelenskiy said \"the old evil\" had returned, this time waged by a \"modern Russia\" pursuing the same goal as the Nazis of \"enslavement and destruction\" - but that it would not succeed.Zelenskiy said he had submitted a bill to parliament officially making May 8 Ukraine's day of remembrance and victory, while May 9 would become Europe Day. Zelenskiy wants Ukraine one day, after the war, to join the European Union.\"We are returning to our state an honest history without ideological influences. It is on May 8 that most nations of the world remember the greatness of the victory over the Nazis,\" he said in a video posted on the president's Telegram channel.Nazi Germany's unconditional surrender came into force at 11:01 p.m. on May 8, 1945, which was already May 9 in Moscow.",
        "Russia marks the day on May 9, a key national event with huge military parades and commemorations of the enormous sacrifices made by the then-Soviet Union, which lost some 27 million citizens in defeating Nazi Germany.Ukraine first moved the commemoration to May 8 in 2015, accusing Russia, which had annexed Crimea and fuelled an insurgency in its east the year before, of using the anniversary to whip up Russian nationalism. But it did not formalise the change for fear of stoking internal divisions.\"Today, I signed the relevant decree, and every year from tomorrow, May 9, we will commemorate our historic unity - the unity of all Europeans who destroyed Nazism and will defeat 'rashism',\" Zelenskiy said, using a word Ukrainians have coined to describe what they call Russian fascism.\"The unity that brings peace closer.\"'JUDAS'The Kremlin said May 9 would remain sacred for many in Ukraine.\"There are veterans there too who took part in the Great Patriotic War, and their relatives, for whom this day is and will remain sacred,\" Kremlin spokesman Dmitry Peskov said when asked about the change.Russia's foreign ministry spokeswoman Maria Zakharova went further.\"What is worse than an enemy? A traitor. That is Zelenskiy, the embodiment of Judas in the 21st century... An accomplice of the fascists 80 years later,\" she said, adding he had betrayed the memory of the Ukrainians who died fighting the Nazis.",
        "Moscow has stepped up attacks on Ukrainian cities including the capital Kyiv in the leadup to May 9, and some commentators say President Vladimir Putin wants to secure some kind of victory in the grinding war to coincide with the holiday.Zelenskiy said Europe could not let that happen and it was again time to defeat \"evil\" together \"to ensure that no one ever enslaves other peoples or destroys other countries again\".\"We do not yet know the date of our victory, but we know that it will be a holiday for the whole of Ukraine, for the whole of Europe, for the whole of the free world.\"(Additional reporting by Moscow bureau, editing by Mark Heinrich, Gareth Jones and Philippa Fletcher)"
    ]
}