{
    "articleURL": "/wires/pa/article-12058337/Vintage-plane-King-learned-fly-takes-sky-Coronation-air-show.html",
    "content": [
        "The King’s lifelong connection to the skies was marked on Sunday with the small red aircraft in which he learned to fly delighting aviation and military enthusiasts in Bedford.",
        "The 70-year-old Royal de Havilland Chipmunk WP903 was among the vintage aeroplanes to take to the skies on Sunday for Shuttleworth aerodrome’s King and Country Air Show.The dayglo red, single-engined primary trainer was used by the future King at RAF Tangmere in 1969 while he was a student at Cambridge University.",
        "The young prince flew solo for the first time in the tandem, two-seat aircraft on January 14 1969 before being awarded his private pilot’s licence two months later and his RAF Preliminary Flying Badge on August 2.In August 1971 he was presented with his RAF wings.Built in 1952, the Royal Chipmunk affectionately known as “the Red Dragon” served with the RAF Queens Flight from September 20 1960 to June 12 1964.In addition to Charles, the Chipmunk was also used to teach the Duke of Kent and the late Queen’s cousins Prince Michael and Prince William to fly.",
        "William, brother of the Duke of Gloucester, would die in an air crash while piloting his plane in a competition in 1972 at the age of 30.In 1979, the WP904 would be detached from the RN Grading Flight to teach the then-Prince Andrew.On leaving the RAF in 1974, WP903 was acquired by the Culdrose Gliding Club and served as a Glider Tug until December 1996.",
        "Since 2001, the Chipmunk has been operated by the Henlow Chipmunk Group and based out of the Old Warden Aerodrome near Bedford since 2020.",
        "Two Edwardian-era aircrafts also made a rare appearance at Sunday’s King and Country Air Show at Shuttleworth.Representing the very beginning of manned flight in the UK, the two fragile aeroplanes can only be flown in near-windless conditions.Fortunately for all involved, the day’s wind speeds were under 5mph.",
        "The Roe IV Triplane was an early British aircraft designed by Alliott Verdon Roe and built by AV Roe and Company (later to become AVRO, manufacturer of the WW2 Lancaster bomber). It was first flown in September 1910 and only one example was made.It has a top speed of around 25mph.The example that took to the air for the King and Country Air Show was an exact replica of the original made for the 1965 film Those Magnificent Men in Their Flying Machines, starring Stuart Whitman, Sarah Miles, Robert Morley and Terry-Thomas.",
        "It was later donated to the Shuttleworth Collection, Sunday’s air show host.Flying alongside the Roe was the Bristol Boxkite which was first flown in 1910.The latter aircraft has a more modern engine and was based on the design of the French Farman III biplane.",
        "It was built by the Bristol and Colonial Aeroplane company (later the Bristol Aeroplane company).The example on display on Sunday was another exact replica constructed for Those Magnificent Men in Their Flying Machines."
    ]
}