{
    "articleURL": "/sport/football/article-12056843/Rangers-1-0-Aberdeen-Michael-Beales-return-winning-ways-thanks-Todd-Cantwells-volley.html",
    "content": [
        "Todd Cantwell struck a superb volley from James Tavernier's deep corner Despite Rangers' win, Celtic have sealed the title after their win over HeartsMichael Beale's side go 29 points clear of the visitors, who remain third  To stand any chance of overhauling Celtic over the course of 38 games next season, Rangers are going to have to make slender wins like this a matter of routine.",
        "In order to achieve that, it goes without saying that performances will have to be markedly better.After a wretched few weeks which confirmed that his side will end the campaign without silverware, Michael Beale just needed a win here to stop the bleeding.The Rangers manager got his wish with a victory which was just about deserved yet lacked any real pizazz.Todd Cantwell’s sumptuous volley in the second half proved the difference and was one of the few moments of quality either side produced.",
        "Little Beale witnessed will have changed his view that a major rebuild is required at Ibrox this summer.The major positive came from the performance of Ross McCrorie in goal.Without a start since August 2021 against Celtic, the long-term understudy to Allan McGregor didn’t put a foot or a glove wrong.",
        "Rangers: (4-4-2): McCrorie 7, Tavernier 7, Goldson 7, Davies 5 (Souttar 45) Yilmaz 6, Lundstram 6, Raskin 6 (Kamara 65) Cantwell 7, Hagi 6 (Wright 65) Matondo 5 (Morelos 65) Sakala 5 (Arfield 65).Subs not used: McLaughlin, King, Devine, Lowry.Scorers: Cantwell 65.Booked: Cantwell.Aberdeen: (3-5-2): Roos 7, Pollock 6, MacDonald 6, Scales 6, Coulson 6, Ramadani 6, Duncan 5 (Barron 76) Clarkson 5 (Bavidge 88) Hayes 6, Miovski 6 (Watkins 76) Lopes 5 (Morris 80).Subs not used: Lewis, MacKenzie, Markanday, Richardson, Kennedy.Scorers: None Booked: Clarkson, MacDonald.Referee: John Beaton.Attendance: 46,961.Man of the match: Robby McCrorie.",
        "You’d be extremely surprised if he’s not in line to play in the final Old Firm game of the season next Saturday.Too many of McCrorie’s team-mates didn’t grasp the chances afforded to them, though.Beale was scathing in his assessment of his forward players afterwards and little wonder.While the displays of Cantwell and Nicolas Raskin continue to offer hope that the core of his side will be up to the task next season, some serious improvements will be required in the final third.Fashion Sakala and Rabbi Matondo started as a front two ahead of a diamond here. Neither looked comfortable any time they got within sight of the target.Alfredo Morelos’ cameo role was miles away from the required level and did not pass without a caustic comment from Beale at the end. The Colombian’s time at Rangers is coming to a close in truly lamentable fashion. Bluntly, you would not be surprised if we’d already seen the last of him.This was not a day for strikers. With 18 goals each thus far, Aberdeen’s front two – Luis ‘Duk’ Lopes and Bojan Miovski – arrived at Ibrox with high expectations. They departed nursing an injury in Miovski’s case and much regret in that of Lopes.Twice in the first half Miovski teed his partner up and on both occasions he badly erred. A veteran of many a tight battle at Ibrox, Barry Robson probably knew what was coming next.",
        "The considerable crumb of of comfort for the Dons is that they remain five points clear of Hearts with just four games to play.A home win over Hibs next Saturday will inch them closer to a third-placed finish few thought possible at the turn of the year.Beale’s unfamiliar line-up stemmed partly from necessity and partly from a desire to give others a chance.While injuries denied Malik Tillman, Ryan Kent, Borna Barisic and Antonio Colak any involvement, the exclusions of McGregor from the squad and Morelos – from the starting side – were made with an eye on the future.Sakala filled the Colombian’s shoes with McCrorie, Ridvan Yilmaz, Ianis Hagi and Matondo also brought into the team which lost the Scottish Cup semi-final to Celtic.",
        "There was no second career clash of the McCrorie brothers on account of an injury sustained by the Dons’ defender Ross.Perhaps as a result of so many changes, Rangers were largely devoid of rhythm.Cantwell floated a couple of early chances wide with Angus MacDonald ensuring John Lundram’s strike was deflected over the bar.The Dons were indebted to their keeper Kelle Roos for keeping the door shut up until the interval.Bravely throwing himself at the feet of fashion Sakala, he prevented the forward from converting Hagi’s knock-down.",
        "He denied Sakala in similar fashion soon after following a neat exchange of passes with Matondo and again foiled the Zambian by getting down to block his shot at his near post.He was less convincing when fielding James Tavernier’s strike on the cusp of half-time although the ball did appear to move in the air.For all that, Aberdeen could – and probably should – have ended the first period ahead.",
        "Miovski spun Ben Davies and accelerated away from the Englishman. His cross to the far post seemed certain to be converted by Lopes only for McCrorie to stick out a leg and block.Miovski played intelligently throughout before limping off. Dropping deep, he sent Lopes clear with another ball over the top. His chip beat McCrorie but dropped onto the roof of the net.As ever, there was an edge to this fixture. The Dons were incensed when Liam Scales was felled off the ball by Cantwell. Believing that the Rangers man had been guilty of no more than a push, referee John Beaton produced a yellow card plus one for the protests of Leighton Clarkson.The Dons were perplexed as to why Beaton saw nothing amiss when Connor Goldson appeared to wrestle Lopes to the ground in or around the box late in the first half.",
        "The visitors needed a stroke of good fortune to stay on level terms early in the second half when skipper Jonny Hayes fired Matondo’s cross onto the underside of his own bar. McCrorie then did well to tip Scales’ dipping header over the top.It was telling that after 65 minutes of failing to find the breakthrough with their combination play, Beale’s men managed it with the most straightforward set piece you’ll ever see.",
        "Tavernier simply hung up a corner deep to the far post. Unmarked, Cantwell still had much to do. He caught the ball flush on the volley with his right-foot. This time Roos could only watch it fly into the far corner.One of four players then introduced by Beale, Scott Wright was only denied a wonderful solo goal against his former club by the slightest of deflections.A second goal would have ended the contest but Hayes did just enough to nudge Wright’s cross away from the arriving Tavernier.McCrorie didn’t have much to do but when required he did his case for an extended run on the side no harm. Another smart stop with his legs to deny Shay Morris kept his side in front.On a day that won’t live long in the memory, the Rangers keeper’s contribution was conspicuous for all the right reasons..",
        " "
    ]
}