{
    "articleURL": "/wires/ap/article-12048773/Feds-continue-probe-4-bald-eagle-deaths-Arkansas.html",
    "content": [
        "PYATT, Ark. (AP) - Federal and state wildlife authorities are asking for the public's help in catching whoever might be responsible for the deaths of four bald eagles in Arkansas' Marion County earlier this year.",
        "The U.S. Fish and Wildlife Service last month put up a $5,000 reward for tips that lead to the arrest and conviction of those who killed the federally protected birds discovered Feb. 13 near Pyatt, the Arkansas Democrat-Gazette reported.A joint investigation by the Arkansas Game and Fish Commission and the U.S. Fish and Wildlife Service determined that the birds were shot between mid-January and mid-February. In addition to the eagles, authorities found red-tailed hawks, a domestic dog and white-tailed deer in the vicinity that had also been shot and killed.\"There´s, I think, evidence that somebody probably shot (the birds) from the road, but I don´t even know that they´re 100% certain of that,\" said Rob Finley, the Arkansas Game and Fish commissioner for the area where the eagles were killed. \"I know that they did set up a little bit of an operation to see if ... the people ever came back, but never did.\"Finley said that is when the U.S. Fish and Wildlife Service took the lead on the investigation.Bald eagles are federally protected and if killed, violators could face up to a $250,000 fine and up to two years in federal prison if convicted. While protected, bald eagles are no longer considered endangered. They were removed from the endangered list in 2007.",
        "\"The bald eagles do migrate in and out of the state quite a bit now,\" Arkansas Game and Fish Commission spokesperson Randy Zellers said. \"We do have nesting bald eagles in the state. But we (also) see an influx of bald eagles every winter, primarily with the waterfowl migration. When the waterfowl come south, a lot of eagles will follow them down (to prey on).\"Anyone with information about the bald eagles killed in Marion County should contact the U.S. Fish and Wildlife Service at (501) 513-4470 or the Arkansas Game &amp; Fish Commission at (833) 356-0824."
    ]
}