{
    "articleURL": "/tvshowbiz/article-12052395/Manchester-City-football-player-Jack-Grealish-reveals-wants-father-one-day.html",
    "content": [
        "He has exclusively told MailSport 'I think I would be a sick dad,' as he shared his own hopes to start a familyJack Grealish has revealed that he wants to be a father one day and start a family with his girlfriend Sasha Attwood.",
        "The Manchester City footballer recently said he was 'lucky' he had 'the best upbringing' and said he wants to treat his children the same way his parents treated him. Now, he has exclusively told MailSport 'I think I would be a sick dad,' as he shared his own hopes to start a family.He said: 'I was lucky that I had the best up bringing. I love my mum and dad so much, they did everything for me. It makes me want to do the same for my own children when I do have them.'But he insisted he is in no rush to have children because he is currently enjoying life at the moment and his romance with childhood sweetheart Sasha.",
        "He went on: 'I am not sure when that will be. I think I need to grow up a bit first. To me, everything is about enjoying life. I am so blessed doing what I am doing but I do need that balance between football and the rest.' The midfielder also touched on how he's had to get secretive when it comes to going on a night out to an 80's club. 'Sometimes I like to go out and let my hair down, I am not gonna sit here and lie and say I don't go out. What's the point? It's also pointless telling you I am here at 8am going in the gym and that's the reason I am playing well. It's not.' ",
        "He continued: 'The reason I am playing well is because I feel fit, confident, good in myself and like I am at home here. But I still love an occasional drink and going out with my friends. That's just normal.' Jack was also questioned on how he copes with trying to go out for fun-filled nights out in Manchester or Birmingham amid his global fame.To which Jack responded with: 'I just look after myself more now. In the old days I would have one drink and think I had this invisible cloak on where nobody could see me.' He continued: 'Now I just have people who look after me and I go to more secretive places. I have actually been really good these last few months. I have not been out much and told myself I wouldn't until I had a medal or two round my neck'.He also jokingly added that he was gonna buy a wig to try and disguise himself when on nights out during the summer. ",
        "'I love going to 80s clubs and just chilling at the bar. I would love to be able to do that. That's why in the summer I am gonna buy a wig…' Jack has 31 England caps and, for now, one Premier League title. As well as being a Gucci ambassador, he also recently signed a record-breaking boot deal with Puma. ",
        "He has been written about in Vogue, Tatler and GQ and was also featured on the front cover of FACE magazine. Jack met his high-school sweetheart Sasha Attwood, 27, in school at St Peter's Roman Catholic Secondary School in Solihull at the age of 16 and they have been together ever since. However in the past, like many celebrity couples they have been hit by many scandals and rumours. The couple have been in a long term on and off relationship and the pair of them have never been overly public about their relationship and have always tried to keep it away from the media. However, in the past, they briefly broke up but rekindled their romance and reunited before the beginning of the Euros. The pair, who keep their relationship pretty private, have been dating since they were teens.And Sasha has been supporting her childhood sweetheart throughout his career, often wearing sport shirts with the wording 'Grealish' on the back. ",
        "A source reportedly told Birmingham World that Jack has made it very clear that he sees his future with Sasha. The young couple have also sparked engagement rumours many times but there has been no confirmation. However, the Man City footballer recently spoke about his desire to get married one day. ",
        "He told The Face: 'My mum and dad are married, so of course I want to do that. I know it's easy to say, but the goal for me is just to be happy, man. I think that's the most important thing in life.' "
    ]
}