{
    "articleURL": "/wires/aap/article-12048129/Folau-set-World-XV-clash-Eddie-Jones-Baa-Baas.html",
    "content": [
        "Israel Folau will be spearheading one side, and Eddie Jones doing his tactical best to stop him when two of Australian rugby's biggest names get set to return for a compelling Twickenham duel at the end of the month.",
        "Folau is being earmarked to play in a star-studded backline for a World XV who'll be taking on the world-famous Barbarians invitation side which will be overseen by Wallabies coach Eddie Jones.It will be Jones's first return to Twickenham since he walked out on England to instead take the reins of his home country's World Cup challenge - so it will be fascinating to see the 'homecoming' reception he will get from the fans at 'HQ'.But it will also be Folau's return to the ground where he played his last of his 73 Tests for the Wallabies, scoring two tries as they fell to an emphatic 37-18 defeat to England, orchestrated by ... who else but Jones.The 34-year-old's inclusion in a world side coached by World Cup-winning New Zealand coach Steve Hansen is not likely to be met with universal appreciation after Folau was sacked by Rugby Australia in 2019 after homophobic and offensive social media posts.He resurrected his sporting career, switching codes to play rugby league in France and has since returned to rugby, playing in the club game in Japan while switching his national allegiance to Tonga through his family links. He hopes to play for them at the World Cup.Folau will play in a spectacular World XV back division that will also include Jones' star Wallabies flyer Marika Koroibete, the brilliant Fijian Semi Radradra and his own Tongan teammate, former All Black Charles Piutau.",
        "Koroibete won the John Eales Medal for the second time last month and Jones will get a close look at how a coach of Hansen's standing plans to go about neutralising one of his key weapons.For the May 28 fixture, Jones has been busy putting together a Baa-Baas team featuring Welsh stars Rhys Webb and Taulupe Faletau, Springbok Andre Esterhuizen and some of his former England charges, like star wingers Jonny May and Jack Nowell."
    ]
}