{
    "articleURL": "/news/article-12050391/US-tourist-arrested-Israel-hauled-flight-America.html",
    "content": [
        "He had arrived in Jerusalem that same morning with no issues or suspicionsThe man claimed to be in Israel for a 'diving trip'An American tourist was arrested in Israel upon boarding a flight back to the US, after announcing to an air hostess that another passenger had planted a bomb in his bag.",
        "The man, 43 - who only planned to be in Israel for a day and flew in from New York on Thursday morning - was removed by the air hostess and sent back to border control in Ben-Gurion airport after boarding the plane back to the States on Thursday night.He informed them that he didn't want to be on the aircraft, as a passenger in 'blue clothes' planted 'a bomb in his personal backpack,' The Jerusalem Post reported.He had arrived in Jerusalem that morning with no issues or suspicions. The man claimed to be in Israel for a 'diving trip'. ",
        "After border control officers conducted an investigation, no bomb was found in his hand luggage, but instead they found 'photocopied pages' which discussed the 'burning of Jerusalem' from a book called Kings of the Desert. The tourist is due to be flown back to the US within the next 24 hours. 'Not a routine night, but in situations like these, the officers don't hesitate,' said the Israeli Airports Authority to N12. 'They immediately involve the security forces.'Another bizarre case involving explosive devices was recorded last April in Ben-Gurion airport, when an American family set off a bomb scare after showing security officers an unexploded bomb shell they found from their visit to Golan Heights, which they had packed in their suitcase.",
        "Video at the time which circulated on social media showed panicked passengers scrambling at the departure hall. The Israel Airports Authority had announced a man was hospitalized with injuries sustained as he tried to flee over a baggage carousel. The 32-year-old injured passenger named Uri later spoke to Yedioth Ahronoth about the incident after suffering a rib fracture and pulmonary hemorrhage.He said: 'My whole body hurts. I do not understand what happened there, there should be protocols for such things instead of creating chaos. I am currently thanking God that the damage is not serious.'There was a lot of shouting, but I did not know what was there. I just felt I had to run away for my life.'The Israel Airports Authority said the family was allowed to board their flight after an interrogation by security staff, who gave them the all clear."
    ]
}