{
    "articleURL": "/wires/reuters/article-12053413/Angels-edge-Rangers-10th-inning-wild-pitch.html",
    "content": [
        "Zach Neto scored from third base on a 10th-inning wild pitch to lift the Los Angeles Angels to a 5-4 victory over the Texas Rangers on Friday in Anaheim, Calif.",
        "Rangers reliever Josh Sborz entered the game to face Anthony Rendon with runners on first and third and one out in the bottom of the 10th. However, his first pitch to Rendon was a breaking ball low and away that caromed off the glove of catcher Jonah Heim and went to the backstop, allowing Neto to score without a play.Angels reliever Carlos Estevez (1-1) threw a scoreless top of the 10th to get the victory, stranding designated runner Ezequiel Duran at second base with two strikeouts, a walk and an infield grounder.The Rangers were one out away from a 4-1 win, but Chad Wallach hit a two-run double off Will Smith in the bottom of the ninth to get the Angels within 4-3.Luis Rengifo followed with a broken-bat single to center, scoring Wallach from second to tie the game.Rangers right-hander Dane Dunning threw five scoreless innings in his first start of the season. All eight of his previous appearances this season came out of the bullpen, but he has been called upon to take the rotation spot of ace Jacob deGrom, who is out with an inflamed right elbow.Dunning was sharp, needing just 72 pitches to get through five innings. He allowed two hits -- both singles -- and one walk while striking out three.",
        "Brock Burke followed Dunning with two scoreless innings. Jonathan Hernandez pitched the eighth for Texas, giving up an RBI single to Mike Trout, before the Angels rallied to tie the game in the ninth against Smith.The Rangers took a 1-0 lead against Angels starter Tyler Anderson in the third inning after Marcus Semien led off with a walk and later scored on a sacrifice fly by Adolis Garcia.Anderson had some bad luck in the fourth as the Rangers added two more runs to take a 3-0 lead. With runners on first and second and one out, Semien hit a high fly ball, but left fielder Taylor Ward lost the ball in the twilight sky.The ball bounced off the warning track and over the fence for a ground-rule double, scoring Duran from second base. One out later, Nathaniel Lowe hit a sharp one-hopper to shortstop, but Neto's throw to first was wide for an error, allowing Leody Taveras to score from third.Anderson lasted five innings, but he needed 103 pitches to get there. He gave up three runs (two earned) on five hits and five walks with six strikeouts.--Field Level Media"
    ]
}