{
    "articleURL": "/wires/reuters/article-12047569/Atlanta-judge-denies-bail-suspect-medical-building-shooting.html",
    "content": [
        "By Rich McKay",
        "ATLANTA, May 4 (Reuters) - A former U.S. Coast Guardsman accused of killing a woman and wounding four others in a shooting in an Atlanta medical building was denied bail on Thursday.The suspected gunman, identified as 24-year-old Deion Patterson, had waived his right to appear at the court hearing during which Fulton County Magistrate Judge Holly Hughes denied bail and ordered him held on one count of murder and four counts of aggravated assault, her clerk said.The suspect is accused of opening fire in the Northside Medical facility in the city's busy Midtown area at about 12:30 p.m. on Wednesday. He then fled on foot to a nearby gas station where he commandeered a pickup truck that had been left running unattended and drove away.He was taken into custody about eight hours later without incident after an undercover officer spotted him north of the city in suburban Cobb County, police said.The woman killed in the shooting was 39-year-old Amy St. Pierre, an employee of the U.S. Centers for Disease Control and Prevention, the agency said.\"Our hearts are with her family, friends, and colleagues as they remember her and grieve this tragic loss,\" the agency said in an online statement.The four wounded women ranged in age from 25 to 71 and all four remained in the hospital on Thursday, officials said. Two of them were in critical condition and underwent additional surgeries at Grady Memorial Hospital on Thursday.",
        "The wounded were identified in court documents as Lisa Glynn, Georgette Whitlow, Jazzmin Daniel and Alesha Hollinger.Patterson had an appointment at the Midtown facility on Wednesday. The motive for the shooting and whether the suspect knew or specifically targeted any of his victims had yet to be determined, police said.The mother of the suspect said he was upset that doctors would not refill his prescription for an anti-anxiety drug, a local ABC affiliate and other media reported.His mother, identified as Minyone Patterson in local media, told the Atlanta-Journal Constitution that her son had a \"mental break.\"The gunman arrived at the medical center with his mother but she was not injured, police said. They said she and other family members were cooperating with investigators.Patterson joined the U.S. Coast Guard in July 2018 and was discharged from active duty in January, after having last served as an electrician's mate second class. (Reporting by Rich McKay in Atlanta and Brendan O'Brien in Chicago; Editing by David Gregorio and Bill Berkrot)"
    ]
}