{
    "articleURL": "/wires/reuters/article-12057659/Wyndham-Clark-breaks-victory-Wells-Fargo.html",
    "content": [
        "Wyndham Clark pulled away from Xander Schauffele to earn his first PGA Tour victory and a $3.6 million check at the Wells Fargo Championship on Sunday in Charlotte, N.C.",
        "At a star-packed \"designated event\" with a purse of $20 million, the 80th-ranked golfer in the world played his best golf over the weekend to break away from the field, following Saturday's round of 63 with a 3-under 68.With a 19-under 265 at Quail Hollow, he finished four shots clear of Schauffele, the world No. 5.Clark had never won in his first 133 events on the PGA Tour dating to 2019.\"It's been a long five years to get to this point on tour,\" Clark said on the CBS broadcast. \"I thought I would have had one earlier, but it was well worth the wait and I'm so, so grateful.\"He opened his final round with a two-shot lead but bogeyed the par-4 first hole. Schauffele, his playing partner, then tied him with a birdie at the par-4 third and took a brief solo lead at 16 under by birdieing the par-4 seventh.Over the next two holes, Clark took back the lead for good. He placed his second shot at the par-4 eighth inside 4 feet to set up birdie and at the par-4 ninth Schauffele three-putted for bogey.Clark turned it on, birdieing Nos. 10, 12, 14 and 15 before a closing bogey. The birdie run included a 19-foot birdie putt that steered right to left at the par-4 12th.",
        "Schauffele couldn't keep up, finishing with a 70 with four birdies and three bogeys.\"There's so much that goes into this,\" Clark said. \"There's so many times that I wanted to cry and break clubs -- and I did break the clubs sometimes -- in this journey, and to get to this point is so sweet.\"Clark dedicated the win to his mother, who died from breast cancer while he was attending college.\"My mom obviously is not here. I wish she was but I know she's watching,\" Clark said.Harris English (69 Sunday) and Englishman Tyrrell Hatton (70) tied for third at 12 under. Tommy Fleetwood of England (70) and Adam Scott of Australia (71) tied for fifth at 11 under.World No. 3 Rory McIlroy of Northern Ireland sank an unlikely 72-foot eagle putt at the par-5 10th hole en route to a final-round 72. He finished tied for 47th at even par.--Field Level Media"
    ]
}