{
    "articleURL": "/news/article-12039657/Man-24-charged-murder-amateur-rugby-player-32-stabbed-death-Cornwall-club.html",
    "content": [
        " Devastated friends and family paid tribute to the victim named as Michael AllenA man has been charged with murder after a 'much-loved' amateur rugby player was stabbed to death in a Cornwall nightclub during a fight that left seven men and women hospitalised.",
        "Michael Allen, 32, from Liskeard, was pronounced death at the scene following a serious altercation near the Eclipse nightclub in Bodmin, shortly after 3am on Sunday.Jake Hill, 24, from Bodmin, has been charged with one count of murder, three counts of attempted murder and two counts of causing grievous bodily harm with intent.He is being held in remand and is due to appear before Truro Magistrates’ Court on Wednesday.One person remains in hospital as they recover from surgery following the attack, while a further six people injured in the incident have been discharged.",
        "A statement from Mr Allen's family, issued by Devon and Cornwall Police, said: 'Mike was simply a much-loved son, brother, grandson and uncle, who loved his dogs.'Messages have also been left by friends via a tribute website set up at Bodmin Rugby Club.Paying tribute to the rugby player, Bodmin RFC said Mr Allen's humour had left a mark on the club. In a post on Facebook, the rugby club said: 'It is with great sadness that we can now announce the passing of our player and friend Mike Allen (Chabel).\"Mike came to the club earlier this season and quickly became a big part of our squad. His humour and kindness has left a mark on us all and we will miss him dearly. ",
        "'Our thoughts are with Mike's family at this devastating time. There is a memorial set up outside the rugby club where people are welcome to come to pay their respects and lay flowers. Fly high brother.'Friend Lachlan Blackshaw posted on Facebook a photo of Mr Allen, nicknamed 'Chabel', in his rugby kit. The post said: 'It was a pleasure Chabel. Never Forgotten Brother. Run hard for ever.'A second friend, Ollie Brooks, posted: 'It was a pleasure Chabel. Fly high brother.' Aran Pridham posted on Facebook: 'Rest in peace Mike will never forget you for the happy, amazing person you were, you will be sadly missed buddy x'.Detectives were today given more time to question a 24-year-old man from the town who has has been arrested on suspicion of murder, attempted murder and causing grievous bodily harm with intent.",
        "Police were called at 3.15am on Sunday to the area of Victoria Square in Castle Canyke Road following reports of a person with a knife and multiple people with suspected stab wounds.Police officers will be there to help support the local community and a community hub will run from 4pm-6pm on Monday and then twice daily from 10am-midday and 4pm-6pm for the next week. Eclipse nightclub wrote on Facebook: \"Everybody from the Eclipse are deeply saddened by the incident on Castle Canke Road in the early hours of Sunday and our thoughts are with the victims and their families at this time.' ",
        "Sam Perring posted on Facebook: 'Absolutely devastated and heartbroken. All the laughs, adventures and impossible sideways BMW moments we've had through the years. Love you so much mate.'NHS staff nurse Alex Rhodes wrote: 'What a horrible, cruel world we live in. Michael, love you always cuz.'Chris Rich added: 'Literally can't believe what I've heard. Always such a lovely guy you didn't deserve anything like that to happen to you and no one should have to worry about going out and something like this happening. Absolutely vile.'And Christine Zammit said: 'So sad, another good one taken way too soon. Thinking of all his friends and family at this tragic time. This world is a cruel place.'Forensic teams were yesterday combing the street outside the nightclub, which is opposite the headquarters of the 165 Port and Maritime Regiment RLC, one of the British Army's largest reserve unit. One forensic officer searching in a bush appeared to be holding a foot-long knife.Detective inspector Ilona Rosson said the force was treating the attack as an isolated matter and no one else was sought in connection with the stabbings. She added: 'This is a live and active police investigation and I would urge people not to speculate on social media, but if you have information which may assist us, please report it.'",
        "Supt Rob Youngman said it was not yet known whether the victim and alleged knifeman knew each other.He added: 'At this moment in time we are working to continue to understand the motivation behind this incident. The relationship, if any, between those involved is not clear at this stage. We believe some members of the group who were injured had been in Eclipse nightclub. They were then outside in Castle Canyke Road when the incident happened.'Supt Youngman also urged anyone who might have video footage from the area to provide it to detectives. Cornwall councillor Leigh Frost described the attack as 'shocking and devastating.''Bodmin is a small town and it's not rife with crime, it's quite a friendly place,' he added. 'We are a strong community and we will pull together and get though this together. My thoughts are with everyone involved, the victim and his family.'I also praise the emergency services for responding so quickly and the police for ensuring there is a full investigation.'Bodmin Mayor Phil Cooper said the town council was 'saddened by this tragic incident'.'We never expected this to happen in our town and I send thoughts and best wishes to the families of everyone affected,' he added.'Bodmin is a fantastic community and we will support the victims and their families in every way we can.'",
        "Mike was a keen rugby player for Bodmin RFC and rival rugby clubs lined up to pay respects to him.Camelford RFC said: 'We extend our deepest and heartfelt condolences to Bodmin RFC, and all family and friends, after the tragic news of the passing of Mike Allen.'Helston RFC added: 'The thoughts of everyone here at Helston RFC are with Bodmin RFC today. The tragic loss of Mike Allen will be felt by all. Our condolences to his family, friends and club.'Detective Inspector Ilona Rosson from the Major Crime Investigation Team said: 'Our investigation continues into this matter, and we continue to ask the public for their help.'If you have any information that relating to this murder and have yet to have spoken with the police, please come forward immediately. The information to have, no matter how small you may feel it could be, could be vital to our investigation.'Police have created a Major Incident Public Reporting (MIPP) page as part of the investigation into this incident.The MIPP allows members of the public who may have information to directly send large files such as Doorbell, CCTV and Dashcam footage that could assist in a police investigation.Anyone with any information is asked to report this to Devon and Cornwall Police via the Major Incident Public Reporting site, under Operation Limbas: https://mipp.police.uk/operation/50DC23S08-PO1"
    ]
}