{
    "articleURL": "/news/article-12047245/Proud-Boys-leader-three-guilty-seditious-conspiracy-Jan-6-riot.html",
    "content": [
        "Proud Boys Enrique Tarrio, Ethan Nordean, Joseph Biggs and Zachary Rehl were all found guilty of the charges after they broke into the CapitolThe jury in Washington D.C. could not reach a verdict against a fifth man, Dominic Pezzola, and have been instructed to keep deliberating Prosecutors say the groups were intent on keeping Democrat Joe Biden out of the White House at all costsProud Boys leader Enrique Tarrio and three other members of the group have been found guilty of seditious conspiracy over the January 6 riot.",
        "Ethan Nordean, Joseph Biggs, Zachary Rehl and Tarrio were all found guilty of the charges after they broke into the Capitol following the 2020 election. The jury in Washington D.C. could not reach a verdict against a fifth man, Dominic Pezzola, with the others facing a maximum of 20 years in prison. All four men face a range of charges, including three separate conspiracy charges, obstructing the Electoral College vote and tampering with evidence.The case is one of the most serious brought in the unprecedented attack, which unfolded on January 6, 2021.",
        "Tarrio, from Miami, was a top target of the Justice Department, which has now secured seditious conspiracy convictions against the leaders of two major extremist groups.He was also convicted of obstructing Congress’ certification of President Joe Biden’s electoral victory and obstructing law enforcement as well as two other conspiracy charges. The Proud Boys leader was cleared of an assault charge stemming from a co-defendant who stole an officer’s riot shield. Tarrio has been behind bars since his arrest in March 2022, and showed no emotion as the verdict was read – hugging his lawyers and shaking hands with members of his team. Prosecutors say the groups were intent on keeping Democrat Joe Biden out of the White House at all costs.",
        "He led the neo-fascist group — known for street fights with left-wing activists — when Trump infamously told the Proud Boys to 'stand back and stand by' during his first debate with Biden.Nordean, of Auburn, Washington, led a Proud Boys chapter, with Rehl leading a group in Philadelphia.Biggs, of Ormond Beach, Florida, was a self-described Proud Boys organizer while Pezzola was a group member from Rochester, New York.",
        "Unlike the other defendants in this trial, Pezzola is not alleged to have a leadership position in the organization and was inactive in Proud Boys group chats.",
        "The judge has instructed jurors to continue deliberations on Pezzola as well as other counts against all five defendants on which they did not reach verdicts.Tarrio wasn't in Washington on the day the Capitol was stormed - because he had been arrested two days earlier in a separate case.He was arrested on January 4  for bringing high-capacity rifle magazines to DC and was ordered out of the city. But prosecutors said he organized and directed the attack by Proud Boys, with the group viewing itself as 'Trump's army' and was prepared for 'all-out war' to stop Biden from becoming president.The Proud Boys were 'lined up behind Donald Trump and willing to commit violence on his behalf,' prosecutor Conor Mulroe said in his closing argument.",
        "Prosecutors say that they were at the front lines of the mob on Capitol grounds and were there when the first barriers were breached.During the trial, the court heard that hundreds of messages were exchanged between the group leading up to the riot.The group saw Biden and other left-leaning politicians as a threat to the country and spoke about needing  'war,' 'revolution,' and firing squads for traitors.Tarrio wrote 'Do what must be done' on social media as they swarmed the Capitol, and when asked what they should do next, he replied: 'Do it again.'In another message, he wrote: 'Make no mistake. We did this.'Defense lawyers denied there was any plot to attack the Capitol or stop Congress' certification of Biden's win.Tarrio's attorney tried to blame Trump, arguing the 45th president incited the mob's attack when he urged the crowd near the White House to 'fight like hell.'Nayib Hassan said: 'It was Donald Trump's words. It was his motivation. It was his anger that caused what occurred on January 6th in your beautiful and amazing city.",
        "'It was not Enrique Tarrio. They want to use Enrique Tarrio as a scapegoat for Donald J. Trump and those in power.' Jurors listened to testimony from several officers who defended the Capitol on January 6 as well as FBI agents who investigated the Proud Boys.",
        "Two of the defendants gave evidence, denying that there was ever a specific plan to take the Capitol. Initially, the trial was estimated to last give to seven weeks, but was delayed over a four-month period. New information was introduced throughout the case, as well as a delay being caused because a juror thought they were being followed.  The investigation has become the largest for the Justice Department in American history, and it hadn't tried a seditious conspiracy case in over a decade.Last year a jury convicted another extremist group leader, Oath Keepers founder Stewart Rhodes, of the Civil War-era charge last year."
    ]
}