{
    "articleURL": "/wires/ap/article-12046981/Karatsev-ends-Zhangs-run-reach-Madrid-Open-semis.html",
    "content": [
        "MADRID (AP) - Jan-Lennard Struff thought he was done at the Madrid Open when he lost to Aslan Karatsev in the final round of qualifying last week.",
        "Then he got an unexpected spot in the tournament's main draw as the so-called lucky loser and has really made it count, upsetting fourth-seeded Stefanos Tsitsipas 7-6 (5), 5-7, 6-3 on Thursday to set up another shot at Karatsev - this time in the semifinals.The big-serving German is just the third lucky loser to reach the semifinals of a Masters 1000 tournament.Women's No. 1 Iga Swiatek and No. 2 Aryna Sabalenka both won their semifinals and will meet for the title on Saturday. It will be a rematch of the final in Stuttgart two weeks ago, when Swiatek won. It will be the first time the top two ranked players meet in a WTA 1000 final since then No. 1 Serena Williams beat second-ranked Li Na for the 2014 Miami Open title.\"I really want to have this revenge,\" Sabalenka said.The 33-year-old Stuff gets a chance to avenge a 6-4, 6-2 loss to Karatsev in qualifying. He only made it into the main draw because another player withdrew.",
        "Struff had lost only five service games in the main draw en route to the quarterfinals and relinquished only one against Tsitsipas on his way to victory in the Spanish capital.\"It feels amazing. It was a very, very hard battle,\" Struff said. \"Very, very happy that I played this well today.\"",
        "The fifth-ranked Tsitsipas was coming off a final appearance at the Barcelona Open, where he lost to Carlos Alcaraz. He was a runner-up to Novak Djokovic in Madrid in 2019.Defending champion Alcaraz faces 17th-seeded Borna Coric in the other semifinal.Karatsev reached his first Masters 1000 semifinal after ending a strong run by Chinese player Zhang Zhizhen 7-6 (3), 6-4.The veteran Russian saved all three breaks points he faced in the first set and converted his only opportunity in the second.\"Aslan is playing amazing this week so far and he beat me pretty easily in qualies, I need to say,\" Struff said. \"I didn´t play the best tennis in that match, but he made me play not good, I feel like. I think we need to analyze it now, focus on the match tomorrow and I hope I can do better.\"Karatsev has been ranked as high as 14th. In 2021, he became the first man on his Grand Slam debut to reach the Australian Open semifinals.He became only the second qualifier to make the semifinals in Madrid.\"I started the year inside the top 100 then I dropped and lost some matches,\" he said. \"You have to keep going and believe, and I have a team behind me that is always supporting me and believing in me.\"",
        "Swiatek cruised past 12th-seeded Veronika Kudermetova 6-1, 6-1 to make it to her first final in Madrid and set up the rematch with Sabalenka, who advanced 6-4, 6-1 over Maria Sakkari.Swiatek improved to 27-1 on clay since the start of last season. She will play in her seventh career WTA 1000 final, tying Caroline Wozniacki for the most appearances in the final at this level before turning 22 since the WTA 1000 events began in 2009.\"I'm just happy that I have a chance to be in the final,\" Swiatek said.Sabalenka, the 2021 champion in Madrid, opened with a 3-0 lead before the ninth-seeded Sakkari broke back. She then won nine of the last 11 games, including the last five, to comfortably close out.\"It was actually my best match of the tournament,\" Sabalenka said. \"I´m super happy with the level that I played, and especially with my mental game.\"The Australian Open champion is seeking her fifth WTA 1000 title and 13th career title overall.It will be only the third time in the last 40 years that the top two ranked women's players face each other twice on clay in a single season.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}