{
    "articleURL": "/wires/pa/article-12054921/Marnus-Labuschagne-hits-big-century-Glamorgan-dominate-Yorkshire.html",
    "content": [
        "Marnus Labuschagne took advantage of a reprieve to record a mammoth century on the third day of Glamorgan’s LV= Insurance County Championship game against Yorkshire and put down a marker for the Ashes.",
        "The Australian batter was dropped on 11 by a diving Finlay Bean, who got two hands to the ball but could not cling on at backward point.Labuschagne spectacularly went through the gears thereafter to record 170 not out off 207 balls in Glamorgan’s 352 for four declared, leaving Yorkshire 492 to claim an unlikely victory on the last day.George Balderson and Josh Bohannon put Lancashire in a strong position against Nottinghamshire at Trent Bridge but both came up short of centuries.The two shared a partnership of 188 for the second wicket in Lancashire’s second innings before Balderson fell for 91 and Bohannon 92 but, on 219 for four, Lancashire lead by 184 heading into the final day.There was concern, though, for England pace bowler Olly Stone, who had to leave the field after picking up an injury.",
        "James Rew gave another demonstration of his immense potential as Somerset built a strong position against Northamptonshire at Taunton.The 19-year-old wicketkeeper contributed 89 to help the home side extend their first innings total from 199 for four to 412 all out, a lead of 157. Tom Kohler-Cadmore, unbeaten on 95 overnight, fell for 130.Northamptonshire faced a tricky 20 overs before the close, ending on 66 for one having lost Ricardo Vasconcelos and seen fellow opener Hassan Azad forced to retire hurt.",
        "Derbyshire secured a third batting point against Leicestershire, declaring on 350 for seven to lead by 228 before rain brought an end to play.The weather was a factor across the country, with Essex managing just nine runs in 22 minutes against Surrey to reach 24 without loss in their second innings and extend their lead to 83.No play at all, meanwhile, was possible in the games between Hampshire and Warwickshire and Worcestershire and Sussex."
    ]
}