{
    "articleURL": "/sport/rugbyunion/article-12061321/Eddie-Jones-praises-NRL-Brisbane-Broncos-risky-tactic-hint-Wallabies-play-him.html",
    "content": [
        "Jones is a huge rugby league fan May alter style of Wallabies attack Has spruiked benefits of kicking Wallabies coach Eddie Jones is an unabashed fan of rugby league and incorporating it in the 15-man code - and now he has sung the praises of the Broncos' game plan in a curious nod to how the national side could play under him.",
        "Jones was talking at a meeting for budding rugby union coaches when he spruiked the merits of not only a strong kicking game, but putting boot on ball early in the tackle count.Specifically, the shrewd 63-year-old mentor noted the ladder-leading Brisbane Broncos, who have shocked the NRL with an 8-2 start to the season thanks to the brilliance of veteran half Adam Reynolds.Traditionally, rugby in the southern hemisphere has not generally based its attack or defence on a strong kicking game, or the old schoolyard game of forcings back, as the critics like to call it. On the flip side, in the northern hemisphere, a lot of emphasis is placed upon kicking, being it bombing the ball up or stretching the field, given a lot of games are often played in cold, wet weather. ",
        "It's a delicate battle of chess for many national coaches, but with Jones indicating that it wasn't a case of how much a side kicks, but how well they do so, it points to a potential shift in tactics for the Wallabies, whose traditional bread and butter is running rugby. Jones highlighted Ireland - currently ranked No.1 in the world - and their strong kicking game, led by star flyhalf Johnny Sexton.But then his league obsession came to the fore, and he described for the budding coaches present how the Broncos have built their brilliant attack this year on a somewhat risky ambush tactic. ",
        "Led almost exclusively by the pinpoint boot of Reynolds, the Broncos have scored more tries off kicks (14) than any team in the competition - and in a nod to Jones' comments, they certainly don't have the most kick metres.Crucially, they also have the most tries on the fourth tackle (15), using the element of surprise to their advantage as sides focus increasingly on using video analysis and plans in defence. Essentially, they want to catch the defence napping, something the Brumbies did to perfection in round one against the Waratahs, highlighting exactly the way a similar line of thinking can work in rugby union. ",
        "It can be a gamble that can concede field position if it doesn't come off - but when it works, it's a certain try in most instances. Broncos fullback Reece Walsh, one of the most in-form players in the competition, also managed to catch the defence unawares on the third tackle in the side's thumping over Manly.He grubbered for hattrick hero Selwyn Cobbo despite many tackles still left in the count, with Sea Eagles fullback Tom Trbojevic nowhere to be seen behind the line.Either way, it's clear Jones is keen to incorporate rugby league players, coaches and tactics in his second stint as Wallabies coach.",
        "He's already poached Roosters superstar Joseph-Aukuso Suaalii, a schoolboy union prodigy, on a monster $1.6million-a-year contract, as well as recruiting NRL legend Brett Hodgson to act as the Wallabies defence coach.You get the feeling he is only just warming up. Watch every Super Rugby game and Test match, ad-free, live and on demand on the Home of Rugby, Stan Sport. "
    ]
}