{
    "articleURL": "/news/article-12059139/British-tourist-seriously-ill-husband-killed-suspected-carbon-monoxide-poisoning-Majorca.html",
    "content": [
        "Scottish tourist was found unconscious on the floor at a house in Cala Mesquida Her partner was found dead, killed by suspected carbon monoxide poisoning A British tourist is in intensive care in hospital in Majorca following a suspected carbon monoxide leak which claimed the life of her husband.",
        "The 39-year-old holidaymaker was rushed to Manacor Hospital on Saturday, found unconscious next to her lifeless partner, 40, at a house in Cala Mesquida.The pair, who have not been officially named, had flown from their home in Edinburgh to spend time at a family-owned property.A relative is said to have called emergency services after being unable to raise them.An investigation into the tragedy was ongoing as of Monday, although initial local reports have pointed to the cause being a faulty gas-powered fridge.",
        "Well-placed sources said they were investigating the possibility deadly carbon monoxide gas had been seeping out all night while the couple slept in the main bedroom.The couple have not been officially named but the woman at the centre of the drama is understood to be an Edinburgh-based former bank worker.",
        "Her husband, who has been described locally as coming from the UK, is believed to have been born in Spain and acquired British nationality through marriage.He moved to Edinburgh several years ago to work in financial services after spending time in London.His wife is believed to be unaware her partner has died because of the severity of her condition.A local hospital source confirmed on Monday she was 'serious' in intensive care.The latest tragedy occurred less than five months after a similar drama claimed the lives of a British couple at their expat home in Majorca.",
        "Michael Rowan, 62, and his 56-year-old partner Sharon Price were found lifeless at their country property near the picturesque town of Selva, around an hour's drive from Cala Mesquida, on December 19 last year after their worried UK-based son got someone to go round and check on them.A subsequent post-mortem confirmed they died of carbon monoxide poisoning at the farmhouse they had moved to the previous year.Their bodies lay undiscovered for two days.Local reports at the time linked the intoxications to a leak in a wood burning stove through loose-fitting pipework that meant poisonous fumes entered the room where it was installed.The motor of a portable generator said to have been kept inside the property, despite recommendations appliances of this kind should be kept outside, is also believed to have produced the odourless and colourless gas blamed for the couple's deaths.",
        "The nearest town to Cala Mesquida, famed for its beautiful sandy beach and popular with Germans and British, is Capdepera which is about five miles away.The house where the latest gas leak tragedy occurred has been described as a rural property.Unconfirmed local reports say it is owned by the dead man's father."
    ]
}