{
    "articleURL": "/wires/reuters/article-12040691/FOREX-Dollar-defensive-mood-jobs-data-spotlight-Fed.html",
    "content": [
        "By Ankur Banerjee",
        "SINGAPORE, May 3 (Reuters) - The dollar eased on Wednesday, with investors expecting a hike in U.S. interest rates later in the day, but unsure how long the Federal Reserve will keep policy tight considering the latest gloomy jobs data and U.S. debt ceiling and banking sector risks.U.S. job openings fell for a third straight month in March and layoffs increased to the highest in more than two years, data showed on Tuesday, offering some hope that the softening in the labour market could aid the Fed's fight against inflation.The dollar index, which measures the U.S. currency against six rivals, fell 0.128% to 101.710, after sliding 0.245% on Tuesday.The Fed is widely expected to raise interest rates by 25 basis points when it concludes a two-day meeting on Wednesday and investor focus will be on whether the Fed hints at a pause or further tightening.Bank of Singapore currency strategist Moh Siong Sim said markets are expecting rate cuts towards the end of the year due to the stress in the U.S. banking system. But, Moh reckoned the Fed might seek to downplay the prospect for lower rates as data is showing that while \"the U.S. economy is slowing, it is not slowing fast enough to bring inflation back to the 2% target.\"",
        "The Fed's meeting comes as U.S financial markets are reeling from the weekend failure of San Francisco-based First Republic Bank as well as worries that the government could run out of cash after June 1 without a debt ceiling hike.The yield on 10-year Treasury notes slid 13.3 basis points to 3.440% on Tuesday, while the yield on the 30-year Treasury bond dropped 8.5 basis points. With Japan closed for holiday, cash Treasuries were untraded Wednesday.Blerina Uruci, chief U.S. economist at T. Rowe Price, said the Fed is unlikely to be ready to declare the end of tightening for this cycle and run the risk of the data forcing its hand to make a U-turn.\"Banking sector stress is a factor that will come under consideration, but the Fed will likely conclude that a combination of the market measures announced so far and a well-capitalized banking sector will give it the needed room to pursue bringing inflation down to its 2% target.\"Meanwhile, the euro firmed 0.23% to $1.1024 after rising 0.2% overnight ahead of the European Central Bank's regular policy meeting on Thursday.Data on Tuesday showed euro zone inflation accelerated last month but underlying price growth eased unexpectedly, adding to arguments for a smaller interest rate hike from the ECB.",
        "According to pricing in derivatives markets, traders think there is roughly an 85% chance of a 25 bp ECB hike on Thursday, and a 15% chance of 50 bps.Ryota Abe, an economist in global markets and treasury department at Sumitomo Mitsui Banking Corporation, said markets have priced in more rate hikes in the euro area than in the United States. \"If the difference in rates between the two regions become clearer, DXY (dollar index) may fall below the 100 mark.\"Elsewhere, the Australian dollar rose 0.11% to $0.667, a day after the Reserve Bank of Australia surprised markets by lifting the cash rate to 3.85% and said further tightening may be required to tame inflation.The kiwi rose 0.40% to $0.623, while sterling was last trading at $1.249, up 0.21% on the day.The Japanese yen strengthened 0.40% to 136.01 per dollar, clawing back some of its losses from last week when the Bank of Japan stuck to its ultra-loose monetary policy.(Reporting by Ankur Banerjee in Singapore; Editing by Jacqueline Wong &amp;amp; Simon Cameron-Moore)"
    ]
}