{
    "articleURL": "/wires/pa/article-12050343/King-Homage-People-abhorrent--says-Jonathan-Dimbleby.html",
    "content": [
        "The King will find the Homage of the People “abhorrent”, according to his friend, broadcaster Jonathan Dimbleby.",
        "Dimbleby got to know Charles after writing his official biography in the 1990s and said his “thespian” side means he has been closely involved in the performance side of the coronation.But the presenter branded the invitation to the public to swear allegiance to the King during the coronation ceremony “ill advised”.",
        "The writer told BBC Radio 4’s Today programme: “I can think of nothing that he would find more abhorrent.“He’s never wanted to be revered, he’s never wanted – so as far as I know – to have anyone pay homage to him except in mock terms as a joke.“He wants, I think, to feel that people will share in the event and I don’t quite know how this might have happened.“I don’t know for certain but it would seem to me that this was an initiative by the archbishop, who as we know is strongly evangelical, who thought it would be a good thing to give everyone a chance to pay that homage.“I think it was well intentioned and rather ill-advised.”",
        "Lambeth Palace last week announced the modern addition to the ceremony, which replaces the Homage of the Peers, but said the liturgy – the words and actions of the service – had been created in consultation with the King, Archbishop of Canterbury Justin Welby and the Government.",
        "Critics have condemned the move, with the pressure group Republic describing the new homage as “offensive, tone deaf and a gesture that holds the people in contempt”.Lambeth Palace has stressed it is an invitation rather than a request.“We live in a wonderfully diverse society with many different perspectives and beliefs, and it’s quite right that people decide for themselves how they relate to this moment,” a spokesman for the archbishop’s office said.In 1994, Charles confessed to Dimbleby – during a primetime television documentary accompanying the biography – to adultery, saying it only happened after his marriage to Diana, Princess of Wales had “irretrievably broken down”.",
        "Dimbleby, giving an insight into the King’s personality, described him as a “perfectionist”.He added: “If there were a Mastermind on the histories of coronations he would definitely have it as his special subject and he would emerge triumphant. He knows his history. He believes therefore it’s got to be done really well.”Charles has been “closely involved” with the performance of the coronation, Dimbleby said, referring to the King’s interest in the theatre and acting.“There is an element of performative in him. He is a thespian, he loves the theatre, so he wants it all to work really well,” he added.",
        "The King also wanted to be personally involved in choosing clothes to reflect his role as a “humble petitioner”, Dimbleby revealed.",
        "He said: “He wanted to make sure that his clothes, for instance, made it possible for him initially to be what the role is, almost seeking the approval of the nation to become King, almost a humble petitioner, and then to emerge triumphant of this extraordinary pageant, of which he is the star.”As King, Charles will focus on diversity and harmony in the country, leading as a “monarch for our times”, Dimbleby said.“He sees his role, I think – I have talked about it with him – as being doing his best to achieve a sense of overarching harmony in a very diverse and often rather troubled, very troubled, often divided United Kingdom.“That’s what will be his lodestar, his guiding sense of duty.”Dimbleby added that Charles understands he can no longer share political views as King and in public will “only speak when he knows that he is expressing a consensus as defined by the government of the day”.“He will honour the customs and he will be very much a monarch for our times because he is a 21st century person,” he said."
    ]
}