{
    "articleURL": "/news/article-12061453/Remains-tech-CEO-vanished-nearly-two-years-ago-abandoned-Santa-Monica-building.html",
    "content": [
        "Beau Mann, 39, was last seen in November 2021: he texted 911 while in an Uber, was dropped off at Santa Monica Boulevard and never seen againOn Monday, Santa Monica Police Department announced that remains found on April 25 were confirmed as belonging to MannHis cause of death remains unknown: his fiancee Jason Abate described him as 'a beautiful soul' A Los Angeles-based tech executive who vanished two years ago has been found dead, police in Santa Monica confirmed on Monday.",
        "Beau Mann, 39 was last seen at around 2pm on November 30, 2021, on camera at a 7-Eleven near the offices of Sober Grid, a digital health app he founded to help those struggling with addiction.Mann then got in an Uber, and while inside the vehicle he texted 911. He was dropped off in Santa Monica and never seen again.On Monday, Santa Monica police confirmed that human remains found in an abandoned apartment building were those of Mann. His cause of death remains unclear.",
        "His fiance Jason Abate wrote on Facebook: 'I can't move even a inch without seeing you because everything has a memory of us and I can't breath. 'You're not just 'remains' found I can't stand one more time I hear about your 'remains'. Please stop saying remains, just stop saying dental records. 'Please don't let anyone cut your beautiful soul that was bigger than life down to just remains.'Born in Post, Texas, Mann's parents split up when he was young, and he grew up traveling between his father's house in Texas and his mother's in Massachusetts. He had spent Thanksgiving 2021 with family in Texas, and had just returned to Los Angeles, seemingly in good spirits.Abate said he last spoke to him on the night before he vanished. ",
        "Mann's company, based in Boston, said in a statement that he was a 'light'.'After an experience in his early years with drugs and addiction, he turned his focus and passion towards helping others,' the firm said. 'In 2015, he created the first digital app to house a 24/7, online, worldwide community for people in recovery.'Sober Grid has 'saved thousands of lives' and will continue to 'save thousands more,' according to the company.The abandoned apartment building, on the 2900 block of Santa Monica Boulevard, was less than a mile from where Mann was dropped off, leading Facebook sleuths on the page Find Beau Mann asking why it was not thoroughly searched.",
        "One posted a video of the dilapidated, boarded-up complex, saying it had become a slum where drug users and homeless people congregated. Abate, who lives in Michigan, raised the alarm when Mann suddenly stopped replying to his calls and messages.He said it was not unusual for the busy tech executive to go a day or so without replying, but when time passed, he became alarmed. Abate called the LAPD, who met Mann's assistant at his apartment to do a wellness check. The assistant filed a missing persons' report on December 4, 2021. "
    ]
}