{
    "articleURL": "/money/holidays/article-12041913/Cheap-car-hire-bagged-cancelling-current-booking.html",
    "content": [
        "The cost of renting a car is falling, but many drivers are locked in to earlier dealsMany car hire firms will let you take a cheap deal up to 48 hours before your trip Travellers with hire cars already booked could take advantage of falling prices by cancelling and rebooking a new deal - with no charge.",
        "Many people with summer trips planned will have booked rental cars earlier this year from firms charging over the odds. Some firms were charging 72 per cent more than normal due to vehicle shortages and soaring repair costs.But the good news is that the cost of hiring a car is falling - and the even better news is you can likely rebook your older expensive deal. ",
        "Car rental costs in Europe have fallen by up to £156 for a seven-day booking, according to car hire excess insurer iCarhireinsurance.The insurer said the cost of hiring a medium-sized car such as a Volkswagen Golf or Ford Focus for a European holiday would cost an average of £518 this summer.That is down £60 from £578 if booked in January instead.The company looked at prices from Sixt, Hertz, Avis, Budget, Enterprise and Europcar in European destinations Barcelona, Crete, Dalaman, Dubrovnik, Faro, Milan and Nice.The biggest saving is in Barcelona where it cost, on average, £590 if booked in January, compared to £434 now, a saving of £156.  In Faro, it cost an average of £657 in January, which has fallen to £517 now - a saving of £140.This year, car hire prices are still significantly higher than in 2019, when the average weekly price if booked in May was £358.",
        "However, the 2023 prices are still around £142 less across the seven destinations than last year.How to rebook your hire carErnesto Suarez, iCarhireinsurance chief executive, said: 'If you've already booked your hire car, check your cancellation policy, as you may be able to switch to a better deal at no charge. 'Prices may continue to fall, but they may also increase particularly if demand outstrips the supply of cars in popular destinations. 'Therefore, it's a good idea to secure the hire car you want as soon as possible but use a company which offers 48-hour free cancellation, so you have the option of changing if you find a better value deal nearer to your departure.'How to save money on car hireLook beyond the airportIf you are travelling by plane to your holiday destination it might be tempting to use a rental company that is inside the terminal building.However, rental companies outside of the terminal can, in many cases, be less expensive.It is also worth looking into rental companies that are based in the suburbs. These are often cheaper than the ones in the city centre.Don't be stung by fees If you are dropping your car off in a different place to where you picked it up, it is worth comparing car hire companies before you book. Many rental firms charge a one-way fee.",
        "Some do not charge any extra if you do not return the car to the same location you collected it, and some are upfront about the additional cost associated.However, others will hide one-way fees in the small print.",
        "Top up the tank in advance Most hire firms will provide the car with a full tank of fuel and request that it is returned with the tank brimmed.Knowing this, many airports have on-site or local fuel stations - but these can charge a premium.Do your research before you travel and locate a fuel station within five miles of where you need to drop the car off. ",
        "Check for damage If you have paid for a zero excess waiver, damage is not going to be an issue. But if you have not then you will need to put in the time to protect yourself from additional charges.At pick-up, always check the car for bumps, dents and scratches, both inside and out.The rental company staff will give you a form showing all the damage to the car but you should always check it yourself and report anything that is not listed on the diagram.Take pictures of any damage you see as evidence, too.And if you arrive at the rental desk at night, request for the car to be moved to a well-lit area so you can inspect any damage before you even step inside it.",
        "Consider insurance too Excess liability is the amount the hirer pays if the hire car is damaged or stolen, even if it is not the hirer's fault. The study found that the average excess liability for damage and theft was around £1,400 for a medium-sized car.Excess waiver insurance, which protects drivers from this sort of bill, is usually the priciest add-on for travellers at the rental desk. The price of top-level cover for a week can vary from £33 to £202, with the cheapest prices normally coming from independent insurers - not the ones recommended by car hire firms.Make sure the insurance covers tyres and windscreens, as well as damage and theft.Only book what you need Car hire firms' tariffs are based on the size of the vehicle you book. Make sure you only book a car that is reasonable for your needs. Shop around It makes sense to shop around, as car hire firms can charge very different amounts.Smaller car hire firms are likely to be cheaper than big brands.Suarez added: 'It definitely pays to shop around as prices do vary across the rental companies, and it's really important to check the prices of any extras you may need, so there are no costly surprises when you pick up the rental car.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}