{
    "articleURL": "/sport/football/article-12061399/Martin-Keown-claims-Declan-Rice-EXPENSIVE-Arsenal-Liverpool.html",
    "content": [
        "Martin Keown thinks Arsenal and Liverpool won't be able to afford Declan Rice The England star has attracted the eyes of a number of Premier League clubsThe Hammers are prepared to sell Rice for a fee of around £100m this summerMartin Keown believes Declan Rice will be too expensive for Arsenal and has even priced the West Ham star out of Liverpool's reach, too.",
        "Rice is expected to leave the London Stadium this summer, having recently rejected a new deal at the club and is at the top of a number of club's shopping lists ahead of next season. The England midfielder has attracted interest from Chelsea, Manchester United, Liverpool and Arsenal, with the Hammers putting a price tag of around £100m on his head. However, Keown believes that two of those clubs - former side Arsenal and Jurgen Klopp's Liverpool - would struggle to meet West Ham's valuation.  ‘I think Declan Rice is going to be too expensive for Arsenal, quite frankly,’ Keown told talkSPORT. ",
        "‘I think he will be too expensive for Liverpool as well who have been in the Champions League now for a number of years. 'He’s a player Arsenal will like but not with those costs involved, I think it’s too much. Looking at Arsenal’s business, I don’t think it’s a route they will go down.'I don’t think they’ve got the money, even though the Champions League will bring some more revenue. I don’t see him as a player Arsenal can afford to buy.’Arsenal are in the market for a midfielder, having failed to capture Brighton's Moises  Caciedo in January, and have been heavily linked in making a move for Rice in the summer. ",
        "While Liverpool's biggest issues this season have come from midfield and are also looking to add new faces in the department, especially after pulling out of the race for Jude Bellingham. Former Gunners defender Keown believes West Ham will have to cash-in on the prized asset, and at price that may beyond his old club. He added: ‘I’m sure Arsenal will be interested but there’s going to be a transfer fee isn’t there and it will be enormous.'West Ham will want to cash in as he runs down his contract. They need to do the right business and take advantage of him.",
        "'Rice has helped to keep them in the Premier League so he’s done his side of the bargain.’The Hammers captain starred as West Ham defeated Manchester United 1-0 in the Premier League on Sunday, a result that saw them go seven points clear of the bottom three. With Premier League survival almost secured, Rice will turn his attention to West Ham's European campaign this week, as they travel to the Netherlands to face AZ Alkmaar in the semi-finals of the Europa Conference League. If the East London side can overcome the Dutch team, then they could find themselves in a European final against either Fiorentina or Basel.  "
    ]
}