{
    "articleURL": "/wires/ap/article-12038491/Packers-extend-QB-Jordan-Loves-deal-2024.html",
    "content": [
        "The Green Bay Packers and quarterback Jordan Love have agreed to terms on a one-year contract extension that makes his deal run through 2024, according to a person familiar with the situation.",
        "The person spoke to The Associated Press on the condition of anonymity because the extension hasn´t been announced.Although the person didn´t reveal terms, ESPN and NFL Network reported that the extension included $13.5 million in guaranteed money and could be worth up to $22.5 million.The extension comes as Love prepares for his first season as the Packers´ starting quarterback following last week´s trade of four-time MVP Aaron Rodgers to the New York Jets.Tuesday marked the deadline day for teams to decide whether to pick up the fifth-year options on contracts for their 2020 first-round draft picks. The fifth-year option on Love´s deal would have been worth about $20.3 million.Packers general manager Brian Gutekunst had been asked Saturday after the draft about the option and that coming deadline.",
        "\"It´s a lot of money for a guy who hasn´t played, but at the same time, obviously we´re moving forward with him,\" Gutekunst said at the time. \"So we´ll figure that out by Tuesday.\"The two sides instead agreed on this extension.Love has made one career start while backing up Rodgers over the past three seasons. He has completed 60.2% of his passes (50 of 83) for 606 yards with three touchdowns and three interceptions. The Packers traded up four spots in the first round to select Love out of Utah State with the 26th overall draft pick in 2020.",
        "Love will head a Packers quarterback room that also includes rookie fifth-round pick Sean Clifford from Penn State and 28-year-old Danny Etling, who has never appeared in an NFL game.\"I like that room right now and all those guys need reps, so I think we´ll probably see how these guys do before we think about bringing in a veteran right away,\" Gutekunst said Saturday. ___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}