{
    "articleURL": "/wires/ap/article-12048207/US-tangible-progress-Armenia-Azerbaijan-peace-talks.html",
    "content": [
        "WASHINGTON (AP) - Secretary of State Antony Blinken said Thursday that Armenia and Azerbaijan have made \"tangible progress\" in U.S.-hosted peace talks between the two former Soviet republics that have repeatedly clashed over the disputed territory of Nagorno-Karabakh.",
        "The four-day negotiating session did not produce a peace agreement, but Blinken said he believed a deal could be \"within sight, within reach\" and praised the two sides for coming together to try to find common ground.He said reaching an agreement would be \"not only historic but would be profoundly in the interests of the people of Azerbaijan and Armenia and would have very positive effects even beyond their two countries.\"The closed-door discussions were held far from the media spotlight at the State Department´s Foreign Service Institute in northern Virginia. The Armenian and Azeri foreign ministers, who led their delegations, did not speak at the closing ceremony.U.S. engagement in the conflict could be seen as a challenge to Russia´s influence in an area it regards as being within its sphere of influence. Although Russia brokered the last significant deal between the two sides and now maintains troops in Nagorno-Karabakh, it has been more recently preoccupied by the conflict in Ukraine. And, while Blinken spoke of progress, there was no sign that a peace deal was at hand.The mountainous region of Nagorno-Karabakh, which is smaller than the U.S. state of Delaware, has significant cultural importance to both Armenians and Azeris.",
        "It had a substantial degree of autonomy within Azerbaijan when it was part of the Soviet Union. As the USSR deteriorated, Armenian separatist unrest broke out, later turning into a full-scale war after the Soviet Union collapsed.",
        "Most of the Azeri population was driven out by the end of the fighting in 1994. Ethnic Armenian forces backed by Armenia took control not only of Nagorno-Karabakh itself but of sizable surrounding Azerbaijani areas.For the next quarter-century, Nagorno-Karabakh was a \"frozen conflict,\" with Armenian and Azerbaijani forces facing off across a no-man´s land and occasional clashes. In September 2020, Azerbaijan launched a full-scale assault to take the region. The fierce fighting lasted six weeks.The war ended with a Russia-brokered armistice under which Azerbaijan regained control of parts of Nagorno-Karabakh and all the surrounding territory previously occupied by Armenians. Russia sent a peacekeeping force of 2,000 troops to maintain order, including ensuring that the so-called Lachin Corridor road that connects Nagorno-Karabakh to Armenia remains open.In mid-December last year, Azeris claiming to be environmental activists began blocking the road, saying they were protesting illegitimate mining by Armenians. Armenia contends the protests are orchestrated by Azerbaijan.In turn, Azerbaijan alleges that Armenians have used the corridor to transport land mines into Nagorno-Karabakh in violation of the armistice terms.Last month, at least seven soldiers were killed in clashes between Armenian and Azerbaijani forces. Armenia claimed a sniper killed one of its soldiers near the village of Sotk. Azerbaijan denied that and said Armenians opened fire with small arms on its forces, who returned fire.",
        "Azerbaijan has repeatedly alleged that Armenians have used the Lachin Corridor to bring weapons and ammunition into Nagorno-Karabakh."
    ]
}