{
    "articleURL": "/wires/ap/article-12038483/Trump-accusers-friend-says-E-Jean-Carroll-telling-truth.html",
    "content": [
        "NEW YORK (AP) - A woman testified Tuesday that Donald Trump molested her with what seemed like \"40 zillion hands\" on an airline flight in the late 1970s - years before writer E. Jean Carroll says the former president sexually assaulted her at a Manhattan department store.",
        "Meanwhile, Trump´s lawyer said the former president has decided against testifying, answering the biggest outstanding question about the closely watched case. Trump has given sworn deposition testimony, and excerpts could be played for the jury.Jessica Leeds, 81, of Asheville, North Carolina, told jurors at a civil trial arising from Carroll's lawsuit that Trump grabbed her chest and ran his hand up her skirt as they sat side by side in first class on a New York City-bound jet. After a few seconds, she said, she wriggled free of Trump, told him \"I don't need this\" and stormed to the back of the plane.\"There was no conversation. It was like out of the blue. It was like a tussle,\" Leeds testified. \"He was trying to kiss me, trying to pull me towards him. He was grabbing my breasts. It was like he had 40 zillion hands. It was like a tussling match between the two of us.\"Carroll's lawyers called Leeds to the witness stand in an attempt to show that Trump has a history of assaulting women and that Carroll's claims were part of a pattern, not a one-off incident. Another woman is expected to testify at the trial that she too was victimized by Trump.Trump, a Republican, has repeatedly denied the women's claims. He contends the allegations are politically motivated attempts to smear his reputation and deny him the White House. He has said Carroll lied to sell books and that she´s not his \"type.\"",
        "Trump used similar language in denying Leeds' allegations, telling supporters at a 2016 rally, \"Believe me, she would not be my first choice.\"Leeds first went public with her account of the alleged airplane assault in the final weeks of Trump's 2016 campaign, telling jurors that she decided to do so because she was \"furious\" about Trump's claim at a debate that he had never touched women against their will.Carroll, a former magazine advice columnist, publicly aired her allegations against Trump in 2019, when she published a memoir. She testified over three days ending Monday that Trump raped her in the dressing room of Bergdorf Goodman, a luxury department store.Lisa Birnbach, a longtime friend of Carroll, testified that an emotional and hyperventilating Carroll telephoned her minutes after her encounter with Trump to report what occurred. She said she told Carroll that Carroll had been raped and urged her to go to the police, but Carroll refused, leading them to argue before Birnbach agreed never to speak of it again.Leeds said she was in her late 30s, working in sales and sitting in coach aboard a Braniff Airways flight from Dallas or Atlanta to New York's LaGuardia Airport, likely in 1979, when a flight attendant invited her to sit in the only empty aisle seat in the first-class cabin, next to Trump.",
        "Trump introduced himself, Leeds said, but she didn´t know who he was at the time. Working then as a real estate developer, Trump had not yet achieved the heights of his fame and was still a few years from opening Trump Tower in Manhattan.Leeds said she sat with Trump for several hours and ate a nice, first-class meal, but that their conversation was otherwise forgettable. Then, she said, \"all of a sudden Trump decided to kiss me and grope me.\"Leeds said she fought back as Trump seemed to get more aggressive, pressing his weight into her, jostling her seat and pinning her in it. No passengers intervened, and no employees from the now-defunct airline came to her rescue, she said.\"It was when he started putting his hand up my skirt that gave me strength. I managed to wriggle out of my seat and storm back to my seat in coach. I don´t think there was a word or a sound made by either one of us,\" Leeds recalled. She said the encounter, \"seemed like forever, but it probably was just a few seconds.\"After landing in New York, Leeds said she stayed on the plane until everyone else left to avoid running into Trump again. She said she kept the incident to herself, regarding it as one of the \"rigors of travel.\"",
        "She did not report it to the airline, the police or her boss because, she said, it was an era when \"women didn't complain about things in the workplace.\"A few years later, Leeds said she saw Trump at a Manhattan gala with his first wife, Ivana, who was pregnant. But Leeds didn't say anything. Instead, she told jurors it was Trump who piped up. She recalled him using a crass word in recognizing her as the woman \"from the airplane.\"The Associated Press typically does not name people who say they have been sexually assaulted unless they come forward publicly, as Carroll and Leeds have done.___On Twitter, follow Larry Neumeister at https://twitter.com/lneumeister and Michael Sisak at https://twitter.com/mikesisak. Send confidential tips by visiting https://www.ap.org/tips/."
    ]
}