{
    "articleURL": "/wires/reuters/article-12047161/Germanys-former-chancellor-Schroeder-loses-case-Bundestag-office-back.html",
    "content": [
        "BERLIN, May 4 (Reuters) - Former Chancellor Gerhard Schroeder, derided by many Germans for his friendship with Russian President Vladimir Putin, on Thursday lost his legal bid to keep a government-funded office after being stripped of it last year.",
        "Schroeder, 79, had filed a lawsuit against a decision by the budget committee of the Bundestag lower house of parliament to withdraw his privileges after dismay at his refusal to distance himself from Putin following Russia's invasion of Ukraine.The Bundestag had said Schroeder, Social Democrat Chancellor from 1998 to 2005, was no longer carrying out duties in his capacity as former chancellor so did not deserve the publicly-funded office and staff to which he had been entitled.A Berlin administrative court rejected Schroeder's case, saying it was not convinced that Schroeder had a right to the 50-year-old practice of former chancellors getting an office.\"Another argument is that the constitutionally-guaranteed budgetary sovereignty of the Bundestag would be violated,\" said the court in a statement.Schroeder has described Putin as a personal friend. Last year, he visited the Russian leader in Moscow and said afterwards that Russia wanted a negotiated solution to the war in Ukraine. Ukrainian President Volodymyr Zelenskiy branded Schroeder's behaviour as \"disgusting\".Long criticised for his close links to the Russian energy sector, including the Nord Stream gas pipeline, Schroeder stood down last year from the board of Russia's state-owned oil company Rosneft and declined a nomination for a board position at Gazprom.In March, the SPD decided Schroeder could remain a party member as he had not violated any party rules. A local chapter of the SPD had sought to expel him. (Writing by Madeline Chambers; editing by Matthias Willias and Rosalba O'Brien)"
    ]
}