{
    "articleURL": "/news/article-12046783/Jordan-seeks-testimony-CIA-intel-officials-Hunters-laptop.html",
    "content": [
        "Former CIA Director James Brennan will give a transcribed interview to the subcommittee led by Jim Jordan on May 11Former Director of National Intelligence James Clapper will sit before the subcommittee on May 17Both were part of the 51 former intel officials who signed letter claiming the laptop had 'all the classic earmarks of a Russian information operation'Biden and his campaign at the time cited the letter to discredit the laptopThe House Subcommittee on Weaponization of the Federal Government will receive testimony from two top intelligence officials who were behind a push to label the Hunter Biden laptop as 'disinformation' as the investigations into President Biden's son ramp up.",
        "Former CIA Director James Brennan will give a transcribed interview on May 11 and former Director of National Intelligence James Clapper on May 17, a source familiar with the plans told DailyMail.com.Both Brennan and Clapper signed a letter by 51 former intelligence officials who claimed Hunter's laptop had 'all the classic earmarks of a Russian information operation.'The subcommittee, led by Chairman Jim Jordan of Ohio, has already interviewed Mike Morrell, a former deputy CIA director and acting CIA director, who said that a conversation with Biden's Secretary of State Antony Blinken 'absolutely' triggered his interest in organizing the letter, which went out just before the 2020 election. Biden and his campaign at the time cited the letter as reason to discredit the laptop.Jordan and House Intel Chair Mike Turner sent a letter to Blinken last week telling him that they were examining the letter. ",
        "'As part of our oversight, we have learned that you played a role in the inception of this statement while serving as a Biden campaign advisor, and we therefore request your assistance with our oversight.' The chairmen wrote that on the same day Blinken and Morell had a call, Blinken emailed the former CIA spook a USA article saying the FBI was examining whether the laptop was part of a disinformation campaign.",
        "Morell was also asked about his intent in garnering support for such a statement.  'One intent was to share our concern with the American people that the Russians were playing on this issue,' Morell said. 'And, two, it was to help Vice President Biden.'Jordan asked Morell, 'You wanted to help the vice president why?' Morell replied, 'Because I wanted him to win the election.'Morell said he was assisted by Marc Polymeropoulos in rallying intel heavyweights to cast doubt on the laptop. Other former CIA directors, including Brennan and Leon Panetta ultimately signed on to the document. 'Although the statement's signatories have an unquestioned right to free speech and free association—which we do not dispute—their reference to their national security credentials lent weight to the story and suggested access to specialized information unavailable to other Americans,' Turner and Jordan wrote. ",
        "Emails from Hunter's abandoned laptop show Blinken and his wife Evan Ryan have long had contact with the first son. On multiple occasions, Hunter forwarded communications about setting up meetings with Blinken to fellow board members of Burisma.The pair even met at the State Department in 2015 while Hunter was on the board of Burisma. The laptop, which had been left in a Delaware repair store, was touted by Rudy Giuliani, Donald Trump's lawyer, as providing evidence of supposed corruption among the Biden family.",
        "The laptop included explicit photos of the troubled Hunter Biden naked, with prostitutes, and taking drugs, as well as a massive trove of  emails and texts between the 53-year-old and his father and the rest of the Biden family as well as business associates who were eager to meet his former VP and then-future president dad. "
    ]
}