{
    "articleURL": "/sport/football/article-12050653/Real-Madrid-set-make-Jude-Bellingham-HIGHEST-earner.html",
    "content": [
        "The England international is thought to be closing in on a lucrative move to SpainHe had initially been linked with Liverpool, who have since pulled out of a dealNow Bellingham is instead poised to join European champions Real this summer Jude Bellingham is set to become Real Madrid's second-highest earner according to stunning reports which reveal the details of his proposed contract.",
        "Bellingham, 19, has been heavily linked with a move to Madrid in recent weeks after Liverpool pulled out of a deal for the Borussia Dortmund midfielder. Now, the details of his proposed contract at Real Madrid have been revealed in a report by SER Deportivos.The report states that Bellingham will sign a six-year contract which sees him become the club's second highest earner behind Eden Hazard, who is believed to rake in around £380,000 per week.Furthermore, Bellingham will have a reported release clause of £875million, the equivalent of €1billion.",
        "While it was claimed earlier this week that Los Blancos are close to reaching an agreement over the move, the transfer fee has still not been revealed.SER Deportivos' report also states that in recent weeks the 'operation' of the transfer took a huge swing in Madrid's favour due to Liverpool ruling themselves out of the race for Bellingham.This was down to the 'high cost' of the transfer along with Liverpool's 'problems certifying their qualification for the Champions League' while facing an uphill battle to finish in the Premier League top four - which was important for Bellingham.Therefore, Manchester City and Madrid were believed to be frontrunners as Paris Saint-Germain watched on from afar.Yet with the Englishman already informing Real of his desire to join them, it is believed that negotiations will be handled smoothly as the club's strong relationship with Dortmund will help matters when agreeing a fee.",
        "The European champions are yet to submit an official bid and will likely propose an initial £100million, but do not anticipate any issues over agreeing a final fee as Bellingham is expected to become a Real Madrid player by July.Madrid chief scout Juni Calafat is said to have met Bellingham's father in London last month and is keen to see the midfielder lead Los Blancos into a new era alongside Aurelian Tchouameni and Eduardo Camavinga.It remains to be seen when a deal will be announced, but reports suggest Bellingham is poised to put pen to paper on a lucrative deal in Spain. "
    ]
}