{
    "articleURL": "/sport/cricket/article-12054935/Australia-run-machine-Marnus-Labuschagne-sends-ominous-Ashes-warning-majestic-century.html",
    "content": [
        "Labuschagne hit a majestic unbeaten hundred for Glamorgan at HeadingleyHe shared an unbroken 130 with fifth-wicket partner Billy Root - brother of JoeFast bowler Neser claimed a hat-trick in career-best figures of seven for 32 Marnus Labuschagne sent out an ominous pre-Ashes warning yesterday with a majestic unbeaten hundred for Glamorgan at Headingley.",
        "Labuschagne overcame testing overcast conditions in Leeds, the venue for this summer’s third Test between England and Australia, to repel the Yorkshire attack on the third morning alongside overnight partner Sam Northeast.The 28-year-old, number one-ranked Test batter, returned to the crease unbeaten on seven and ground out his second half-century of the match from 104 balls.His one aberration in his 170 not out came early in that wicketless first session - when, on 11, Finlay Bean got two hands to a flying chance above his head at backward point.Once to a half-century, however, Labuschagne thrust the foot to the floor. Toying with off-spinner Dom Bess, he swept and reverse swept three fours in one over, and had struck 17 in all when he celebrated three figures - his second 50 occupying just 38 deliveries.",
        "‘It hasn’t felt like it has come together until that innings,’ Labuschagne said, of his time in this summer’s LV= County Championship.‘That's probably the most I've felt balanced at the crease, I felt like my head position was in a nice spot, my bat path was coming down nicely.‘First innings I felt like I batted alright: gritty, not much rhythm at all, and the wicket was a bit tacky and slow, tough to score.",
        "‘But for me it is taking it game by game and trying to build up that momentum that leads into the World Test Championship and the Ashes.’Northeast’s departure for 66 did not slow the post-lunch tempo as Labuschagne took full toll on a Yorkshire attack devoid of Ben Coad due to a groin niggle. The Australian later shared an unbroken 130 with fifth-wicket partner Billy Root - younger brother of England’s Joe - in his side’s 352 for four declared.‘I have had four innings here now at this venue and I have always enjoyed the bounce and carry,’ he continued, referencing the fact that he also passed 50 twice here during the 2019 Ashes.‘I feel it allows me to leave the ball nicely on length and be able to make good decisions early. Once the wicket quickens up a little bit, there’s enough pace in it that you can score quite freely.'Rain delayed Yorkshire starting a notional pursuit of a 492-run target until this morning.Labuschagne’s batting masterclass followed a bowling one by his fellow Australian Michael Neser.Neser was not named in the 17-strong squad for next month’s first two Tests here, but has been told by chief selector George Bailey to be prepared for the final three when the tourists re-evaluate their personnel.",
        "It therefore might be significant that that trio of matches begins at Headingley, where until his spectacular entrance a few days ago, Neser had never played a first-class match.The 33-year-old immediately showed himself to be a horse for this particular course with a hat-trick in career-best figures of seven for 32, as Yorkshire folded for just 106 on Friday.Doubts over Josh Hazlewood’s fitness, following an Achilles strain, mean a call-up may come sooner, but the Sheffield Shield’s reigning player of the year intends to be oven-ready should he be thrust straight into the heat of the Ashes.‘I would love to be part of that squad but Bails was very clear where I stood and the scenarios in which I might come in,’ Neser told Mail Sport.‘He pretty much encouraged me to keep going because a spot might open up and at least if that does arise, I will have games under my belt.‘I don’t know if I am next in line but I will be sticking my hand up if something does come up.’Neser was a non-playing member of Australia’s tour party here four years ago, and has developed his skills with the Duke’s ball on British pitches either side of his making his Test debut in the 2021-22 Ashes.",
        "His previous five-wicket haul in the Championship was also against Yorkshire two years ago - on that occasion in Cardiff he failed to convert a hat-trick opportunity - amongst a hugely impressive first-class record here of 72 victims at 21.65 runs each.",
        "So what has three seasons with the Welsh county taught a bowler very much in the traditional seamer’s mould rather than an out-and-out quick?‘There’s a couple of things. Obviously, you can get such a different variety of conditions here in England,’ Neser continued.‘One day, we rock up and it’s nipping around and swinging, but then the sun can come out and it stops swinging and the pitch can then seem quite flat and nice to bat on, so you have to go through the tempos with the bat and with the ball, knowing when to hold and when to attack.’If Neser maintains his form, do not rule out a similarly dramatic entrance from stage left to that of Labuschagne midway through the 2019 series."
    ]
}