{
    "articleURL": "/news/royals/article-12051651/Prince-Harry-Andrew-NO-formal-role-Coronation.html",
    "content": [
        "Read more: Your ultimate, minute-by-minute guide to the King's Coronation Princes Harry and Andrew will have no formal role at the Coronation of King Charles at Westminster Abbey today, Buckingham Palace has confirmed. ",
        "As was widely expected, the Duke of Sussex, 38, and Duke of York, 63, will be mere spectators to the historic occasion given that they are no longer working royals. The two men will also be absent from the procession behind the Gold State Coach that will carry the newly crowned King and Queen to the Palace after the ceremony.It means they will miss out, too, on stepping out onto the balcony at the Palace for a traditional photo op following the service.  All eyes will be on Harry as he faces his relatives in public for the first time since he criticised Charles, Camilla and the Prince and Princess of Wales in his explosive tell-all memoir Spare.",
        "His wife Meghan Markle will remain at home in California with their children, Archie and Lilibet, celebrating the former's fourth birthday which falls on the same day. Sources last month suggested that other family members – with the possible exception of Princesses Beatrice and Eugenie – had no interest in talking with Harry at the Coronation beyond the most basic of greetings. It came after the prince publicly called on his family to apologise to himself and Meghan for what they saw as slights against them. He also demanded that his father and brother sit down with him before May 6 to thrash their issues out - a meeting which never came to fruition.",
        "Adding fuel to the fire, Harry also indicated he has enough material to fill another book, which is likely to make the royals wary of encountering him.He is set to make a quick exit after the Coronation, flying back to the US to mark Archie's birthday, and is expected to attend only the abbey ceremony.Sources previously said the decision by Meghan to remain in California had come as a relief in some circles, following fears her presence could have heightened family tensions.It is also understood there was real concern in the Sussex camp about the public reception the couple would have received if they attended the Coronation together.Friends, including Meghan's biographer Omid Scobie, suggested her decision was largely due to the Coronation falling on the same day as Archie's fourth birthday.",
        "The couple had delayed answering their invitation for weeks, causing difficulties for organisers tasked with complex seating plans, transport and security for senior members of the Royal Family, world leaders and other dignitaries.Sources described the negotiations as a game of 'transatlantic ping pong', and Harry was said to have wanted numerous assurances about arrangements.Coronation organisers admitted that they were stressed about Harry's plans and said that it was like 'trying to communicate with Mars'.",
        "Prince Andrew stepped down from public life after his disastrous Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein.The late Queen's disgraced second son went on to pay millions to settle a civil sexual assault case to a woman he claimed never to have met.Virginia Giuffre sued him for allegedly sexually assaulting her when she was 17 after she was trafficked by Epstein. Andrew denied the claims.Ahead of his legal settlement, his mother stripped him of all of his honorary military roles, including Colonel of the Grenadier Guards, and he gave up his HRH style."
    ]
}