{
    "articleURL": "/wires/ap/article-12048309/DoorDash-beats-Q1-forecasts-expands-services-markets.html",
    "content": [
        "DoorDash posted stronger-than-expected results in the first quarter as it expanded into new markets overseas and new delivery categories at home.",
        "The San Francisco company said Thursday that its total orders rose 27% to 512 million in the January-March period. That was well above the 493 million orders Wall Street forecast, according to analysts polled by FactSet.Based on its first quarter results, DoorDash raised its guidance for gross order value, which is the total dollar value of all orders plus taxes, tips and DashPass membership fees. DoorDash now expects full-year gross order value between $63 billion and $64.5 billion, up from $60 billion to $63 billion previously.DoorDash shares rose nearly 5% in after-market trading.DoorDash acquired the Finnish delivery service Wolt Enterprises last summer, allowing it to expand in 22 countries where it previously had no presence, including Germany, Sweden, Hungary and Israel.DoorDash CEO Tony Xu said many European restaurants and stores are coming online for the first time.",
        "\"I think a lot of the fast growth that you´re seeing by Wolt is their ability to serve all of the categories,\" Xu said during a conference call with investors Thursday.In the U.S., the company said orders from convenience stores, groceries and other newer categories are growing faster than its traditional restaurant deliveries. DoorDash, which began delivering groceries in 2020, most recently announced a partnership with Aldi in February. DoorDash also launched nationwide delivery from Starbucks in January.",
        "\"We are becoming more and more of a multi-category destination,\" Xu said. \"I think that is telling us that customers expect DoorDash to be able to deliver upon those experiences.\"DoorDash said its revenue jumped 40% to $2 billion for the quarter. That was ahead of the $1.9 billion Wall Street forecast.But the company continued to struggle with the cost of expansion and integrating with Wolt. DoorDash said its sales and marketing expenses rose 20% in the quarter, partly because it had to attract more drivers as its business expands.DoorDash's research and development costs rose 56%. Xu said DoorDash is experimenting internally with generative artificial intelligence and seeing if it could improve productivity or customer service. AI could one day save the manual work that now goes into digitizing maps and store catalogs, Xu said, or it could make users' shopping experience smoother.DoorDash reported a net loss of $162 million, or 41 cents per share. That was narrower than the 58-cent loss analysts forecast."
    ]
}