{
    "articleURL": "/health/article-12051131/World-Health-Organization-boss-says-pandemic-no-longer-global-health-emergency.html",
    "content": [
        "The global health leaders said the virus no longer constitutes an emergencyThe UN organization fell short of declaring the pandemic over all-togetherREAD MORE: Expert warns that cryptic Covid strains linger across country Covid is no longer a global emergency, according to leaders at the World Health Organization (WHO) — a symbolic moment the pandemic is near its end. ",
        "Tedros Adhanom Ghebreyesus, director-general of the UN health agency, said Friday: 'It's with great hope that I declare COVID over as a global health emergency.'However, he stopped short of declaring the pandemic over, warning that the virus still posed a threat in developing countries that have not had access to vaccines. It comes as the final pandemic restrictions in the US are set to end Thursday months after President Joe Biden declared the pandemic 'over' for America.The pandemic, which triggered once-unthinkable lockdowns, upended the global economy, and killed at least 7million people across the world.",
        "At the briefing Friday, Dr Tedros said the pandemic is likely responsible for around 20million deaths — due to reporting issues and testing inconsistencies. 'It isn't a snap decision. It's something we came up with over time,'  Dr Maria Van Kerkhove, an American infectious disease specialist at the WHO, said in response to a question about why the agency made this decision so late.Professor Didier Houssin, a WHO member from France, said the agency first considered lifting the emergency in January.However, a massive Covid surge in China around the new year that triggered fears of a new strain with traits that had never been seen before made them reconsider.The health agency first declared Covid an international crisis on January 30, 2020. At that point, no major outbreaks had been recorded outside of China. ",
        "However, the WHO leaders now say it is time for countries to treat Covid as they do other infectious diseases. 'The ending of the emergency is emphatically not the end of Covid as a public health problem,' Prof Mark Woolhouse of the University of Edinburgh, in Scotland, said.'Rather, it is a recognition that we are no longer seeing major surges in infections, severe illness and death. 'Hopefully, the large wave in China at the beginning of the year – precipitated by that country's abrupt exit from their Zero Covid strategy – will be the last event of such magnitude.'",
        "A 300-page report highlights a series of previous failures at the Wuhan Institute of Virology.",
        "Dr Michael Head, a senior research fellow at the University of Southampton, said: 'One slightly counter-intuitive aspect is that the WHO has downgraded COVID-19 from a public health emergency, yet the sustained multi-country transmission means it still meets most widely used definitions of a 'pandemic'. 'However, we are clearly in a different phase of handling COVID-19, the impact of the virus is clearly much less than it was, and the WHO decision is reasonable.' More than three years later, the virus has caused an estimated 764million cases globally and about 5billion people have received at least one dose of vaccine.",
        "In the US, the public health emergency declaration made regarding COVID-19 is set to expire on May 11. President Joe Biden ended the Covid national emergency on April 11.On this day, wide-ranging measures to support the pandemic response, including vaccine mandates, will end. Many other countries, including Germany, France and Britain, dropped many of their provisions against the pandemic last year.When Tedros declared COVID-19 to be an emergency in 2020, he said his greatest fear was the virus' potential to spread in countries with weak health systems he described as 'ill-prepared.'In fact, some of the countries that suffered the worst COVID-19 death tolls were previously judged to be the best-prepared for a pandemic, including the US and the UK. An estimated 1.1million Americans died from Covid, the most of any nation. In the UK, more than 200,000 deaths have been logged. Dr Kerkhove said the true number of deaths from Covid could be much higher than recorded.'We know its far higher than the 7million deaths that have been reported,' the expert said. The US also recorded more cases than any other nation, eclipsing the 100million mark. An estimated 24million were suffered in the UK.WHO decided to lower its highest level of alert on Friday, after convening an expert group on Thursday. ",
        "The UN agency doesn't 'declare' pandemics but first used the term to describe the outbreak in March 2020, when the virus had spread to every continent except Antarctica.That decision came long after many other scientists had said a pandemic was already underway.The WHO is the only agency mandated to coordinate the world's response to acute health threats, but the organization faltered repeatedly as the coronavirus unfolded.It recommended against members of the public wearing masks to protect against Covid for months at the start of the pandemic. It later began to recommend the face coverings.Numerous scientists also slammed WHO's reluctance to acknowledge that Covid was frequently spread in the air and by people without symptoms.",
        "Dr Tedros was a vociferous critic of rich countries who hoarded the limited supplies of Covid vaccines, warning that the world was on the brink of a 'catastrophic moral failure' by failing to share shots with poor countries.Most recently, the WHO has been struggling to investigate the origins of the virus. After a weeks-long visit to China, WHO released a report in 2021 concluding that COVID-19 most likely jumped into humans from animals, dismissing the possibility that it originated in a lab as 'extremely unlikely.'But the UN agency backtracked the following year, saying 'key pieces of data' were still missing and that it was premature to rule out that Covid might have ties to a lab.",
        "A panel commissioned by WHO to review its performance criticized China and other countries for not moving quicker to stop the virus and said the organization was constrained both by its limited finances and inability to compel countries to act.The WHO decision means little to the way that some nations will operate coming out of the pandemic.In the US, the Covid emergency was ended last month, with the overall public health declaration set to end next week."
    ]
}