{
    "articleURL": "/news/article-12056311/Culture-Secretary-Lucy-Frazer-says-looking-closely-BBC-funding.html",
    "content": [
        "Lucy Frazer said that review will look at a 'variety' of options for funding the BBC Lucy Frazer today insisted she is looking 'very closely' at the BBC licence fee - as she dismissed calls to de-politicise the appointment of its chair.",
        "The Culture Secretary praised the corporation's coverage of the coronation, saying it is a 'valued institution' that shows the UK's 'soft power'.But she highlighted that a review of the funding model is under way, and will be looking at a 'variety' of options for funding. In a round of interviews this morning, Ms Frazer also confirmed that Rishi Sunak will get the final say on the broadcaster's new chair - after Richard Sharp quit amid a row over his part in a loan to Boris Johnson. She dismissed calls from Keir Starmer for the next chair to be independently appointed, pointing out that had not been the case when Labour was in power and candidates should not be 'disqualified' for political ties. ",
        "The government has long made clear it is looking at different funding models for the BBC, warning that the licence fee is losing public support as streaming services change the broadcasting landscape.The charge has been frozen at £159 annually for the past two years, but next April is expected to rise by £13 in line with inflation.The current funding deal runs out in 2027. Speaking on the BBC's Laura Kuenssberg On Sunday, Ms Frazer said: 'We are reviewing the licence fee. I've started that review.'We will be looking very closely at its funding arrangement.",
        "'I do think it might need to look at a variety of sources for its funding.'I'd like to ensure the BBC is properly funded. The licence fee isn't the only way.'Confirming that the PM will appoint the next chair of the BBC - who plays a key role in safeguarding its independence - following a selection process, Ms Frazer said it would be wrong to rule people out because of party political ties.'If they happen to have political allegiances... I don't think that should disqualify them if they are the best candidate for the job.' Baroness Nicky Morgan, a Tory former Cabinet minister, is among the names said to be in the frame for the key role.  Mr Sharp resigned after an independent report found he had twice breached the rules on public appointments.",
        "He was said to have failed to reveal two 'potential conflicts of interests' when he applied for the top job at the corporation. One was failing to declare that he passed on an offer from an acquaintance to help with Mr Johnson's personal finances - although he stressed he had no subsequent involvement. Stepping down last month, he insisted the breaches were 'inadvertent' but quit because he feared he would 'become a distraction from the corporation's good work'. ",
        "Speaking to Times Radio, Ms Frazer said: 'I think the BBC is a fantastic institution..'The BBC is so important to us, nationally and internationally (it) is an important democratic voice across the world. 'It shows our soft power, I, you know, shows the values that we have in Britain, that we think are so important, and I think it is a fantastic institution.' She added: 'I think the BBC is a valued institution here in the UK '"
    ]
}