{
    "articleURL": "/tvshowbiz/article-12048799/Jennifer-Lopez-gushes-husband-Ben-Affleck-father.html",
    "content": [
        "They are raising five children together in their blended household.",
        "And Jennifer Lopez gushed about her husband Ben Affleck's parenting abilities during an appearance on The View on Thursday.The pop sensation, 53, said watching Ben, 50, raise their children 'brings tears to my eyes'.'He's an amazing dad. It brings tears to my eyes. He is honestly the best dad I've ever seen. He's so involved, he teaches me about how to interact with the kids sometimes.'Jennifer called Ben the type of father anybody would ask for - a 'present, loving dad who cares.'  ",
        "'He's just so in tune, he's such a brilliant guy anyway, like he's so learned in so many things, and you can just tell when he's had his kids, he read every book and everything you could possibly learn about children, and he applies it and is present and that's all you can ask for, is a present, loving dad who cares and who shows up every single day, and that's who he is.'Jennifer and Ben combined their families after tying the knot last year - the Waiting For Tonight songstress has 15-year-old twins Emme and Max with her ex-husband Marc Anthony, while Affleck has Violet, 17, Seraphina, 14, Samuel, 11, from his previous marriage to Jennifer Garner. Now a mother of teenagers, Jennifer said it has been difficult watching her children starting to 'individuate' themselves from her. ",
        "'I'm experiencing this now, we all experience it for the first time with our own kids, and you're just like \"Oh, this is what she was talking about,\"' she explained. 'This is the time where your kids don't want to talk to you, and they kind of individuating from you, and it's all necessary, and intellectually I understand it. But my heart! My heart!'Outside of her life at home, Jennifer's film career has continued thriving - she will star in the upcoming film The Mother, set for release on Netflix on May 12.The action film sees Jennifer play an assassin determined to do anything to keep her young daughter safe.The role required lots of combat scenes, and Jennifer stepped up to the challenge with plenty of training.",
        "'That was one of those ones where you really have to train a lot, where you really have to do the fight training and you have to do the sniper training... It was a lot of fun but it's a lot of work,' she said.While Jennifer, who is now in her early 50s, wishes she would have gotten more of these kinds of roles when she was a little younger, she still says it was an 'empowering' experience.  'And it's funny, you know I wish I would have gotten a lot of these types of roles that I'm getting now, funnily enough, when I was a little bit more, you know, spry.",
        "'A little bit younger, let's just say it. And it's exciting to be able to do it now, I think for me, it's really kind of empowering and makes me feel strong and good.'The Jenny From The Block singer described how her background in dance helped her pick up the fight routines. 'It was regular fight training, but it was choreographed. You have to be efficient, I can't be fighting eight hours a day. After an hour, I'm like, OK! 'So they had to be real efficient and we choreographed almost like a dance, which is good for me since I'm a dancer, so I can kind of do it step by step and I just learn it from there.'"
    ]
}