{
    "articleURL": "/wires/reuters/article-12053411/Fernando-Tatis-Jr-blasts-2-HRs-power-Padres-past-Dodgers.html",
    "content": [
        "Fernando Tatis Jr. drove in three runs with a pair of homers off Clayton Kershaw Friday night as the host San Diego Padres defeated Los Angeles 5-2 in the opener of a three-game series.",
        "It was Tatis' second, two-homer game against the Dodgers' ace, who lasted only 4 2/3 innings in his shortest start of the season.Tatis' first homer leading off the third tied the game at 1-1. His third homer of the season came on a 2-and-2 fastball and traveled 405 feet to center.Tatis' second homer of the game snapped a 1-1 tie and followed a Kershaw walk to Trent Grisham leading off the fifth inning. The go-ahead drive came on a slider and was pulled 375 feet into the left field stands.Yu Darvish (2-2) gave up two runs (one earned) on four hits and a walk with six strikeouts in 6 2/3 innings to earn the win. Josh Hader picked up his 11th save.Kershaw (5-2) took the loss, giving up four runs on eight hits and five walks with seven strikeouts. The five walks equaled his total from his first six starts. Dodgers pitchers gave up a total of 11 walks.The win was the Padres' fifth in the last six games and snapped a six-game Dodgers winning streak.The Dodgers took a 1-0 lead in the first and threatened to score more before an unusual double play got Darvish rolling.Mookie Betts drew a game-opening walk and moved to third on Freddie Freeman's double to center. Wil Smith popped out before Betts scored on Max Muncy's ground out to first. But Freeman was stranded at third.",
        "Miguel Vargas hit a one-out triple in the Dodgers' second. But David Peralta lined out to second baseman Ha-Seong Kim, who threw to third to double up Vargas. Peralta was the first of 13 straight Dodgers retired by Darvish.The Padres scored a third run in the fifth after Tatis' second homer. Manny Machado and Juan Soto followed with singles and Jake Cronenworth drew a bases-loaded walk after Kershaw struck out Xander Bogaerts and Nelson Cruz. Machado scored on Kim's infield single.The Dodgers pulled to within a run in the seventh. Smith singled and scored when Tatis fumbled Jason Heyward's double down the line in right. The Padres loaded the bases with one out in the bottom of the eighth on three walks from Wander Suero and scored the game's final run when Bogaerts grounded into a force out.--Field Level Media"
    ]
}