{
    "articleURL": "/tvshowbiz/article-12046137/Im-Celebritys-Ian-Dicko-Dickson-spotted-getting-post-jungle-haircut.html",
    "content": [
        "It's back to reality for I'm A Celebrity... Get Me Out Of Here! contestant Ian 'Dicko' Dickson. ",
        "The final for the 2023 series aired last Sunday and some of the campmates returned home to Australia this week after Liz Ellis was crowned Queen of the jungle. Dicko, 60, wasted no time in sorting out his hair after spending three weeks in the South African jungle. He was photographed getting a well-needed trim on Tuesday on the Sunshine Coast as he settled back into his normal life. The former Australian Idol judge sported a new shorter do as he wore a pair of grey cargo trousers, a grey jumper and a purple t-shirt underneath. ",
        "He looked in high spirits as he went for a meeting in sunny Cotton Tree after sprucing up his appearance. Dicko was the fourth out of 14 contestants to be booted out of the I'm A Celebrity jungle in the latest series. After being eliminated, he told hosts Julia Morris and Dr Chris Brown that he was 'really grateful' for the experience and has made lifelong friends.",
        "'I wasn't expecting the lessons I was going to get out of this experience and I really was not expecting to fall in love with strangers like I did. I feel really grateful,' he said.Dicko was also correct in his guess of who would win the show, as he revealed at the time that he believed it would be Liz Ellis.",
        "'I've got absolutely no doubt about it [that she will win] as long as she gets to present her light every night,' he said.'She's one of the single most impressive human beings I've had the pleasure of ever spending time with.'",
        "While on the reality show, Dicko insisted that he is a different person than the persona he showed while judging Australian Idol in the early noughties. He opened up to his campmates about the time that he famously fat-shamed singer Paulini Curuenavuli on the singing competition when he told her that she needed to 'choose more appropriate clothes or shed some pounds'.The former reality TV judge broke down as he told his campmates that he's not the same person he was then.",
        "'I don't feel like that guy Dicko on television 20 years ago. I am a different person. It is interesting for me to feel how that impacts on the person I am today,' he said.'Maybe each time I tell it and it invokes an emotion in me, it takes me nearer to working out how I actually feel about it. It probably tears a layer away and that is a good thing.'He added that he had a 'chip on his shoulder' during that period of his career.",
        "'I had to prove myself but I just set about trying to be the cold hard facts guy and it was pretty brutal at times,' he said. "
    ]
}