{
    "articleURL": "/wires/ap/article-12052535/Colorado-politicians-seek-power-block-social-media-users.html",
    "content": [
        "DENVER (AP) - Colorado lawmakers pushed a bill to the governor´s desk that would allow politicians to block social media users from their private accounts, just weeks after the U.S. Supreme Court announced it would consider to what extent that's legal.",
        "The bipartisan measure Colorado´s Democrat-controlled Legislature approved Thursday allows lawmakers to block people for any reason they choose. The rule wouldn´t apply to some politicians' accounts, such as one of Gov. Jared Polis´ Twitter accounts, @GovofCO.The idea has sparked a national debate as social media becomes an increasingly popular tool for politicians to squeeze arguments into 280-character Tweets, laud their successes, air their grievances, and announce official business - all of which blurs the line between personal accounts and public forums.That fuzzy line has already spurred a litany of lawsuits, including one against former President Donald Trump, but legal precedent remains slim.The bill takes a swing at delineating between public and private accounts: a politician's social media page is public if it's required for the position or uses taxpayer dollars - managed by an official's staff, for example. Public accounts can be those that are passed from one officeholder to the next, such as @WhiteHouse, used by both Trump and President Joe Biden.The legislation effectively defines a private account, which could block others, as a page not supported by government resources and not required for the office. It can be kept after a politician leaves office, such as @realDonaldTrump.The legislation's bipartisan sponsors argue that it's merely drawing a line between public and private lives and liken it to a town hall - if two constituents began screeching at each other or harassed or intimidated onlookers, they would be rightfully removed.",
        "\"(It's having) the same treatment from the physical world to the social media world,\" said Rep. Matt Soper, a Republican and one of the bill's sponsors. Soper said it appears to be the first bill of it's kind in the country and argued that it's a step forward in grappling with \"the wild, wild West of our generation.\"The bill would allow a politician to block a user \"for any reason,\" and detractors worry it staunches the public's access to their representatives and limits their ability to voice opinions and engage in debate.\"The U.S. Supreme Court acknowledged that social media is an instrument for `speaking and listening in the modern public square,´ and that it affords 'perhaps the most powerful mechanisms available to a private citizen to make his or her voice heard,'\" said Catherine Ordoñez, the ACLU of Colorado´s policy counsel, in a committee hearing on the bill.\"Legislators following the text of this bill will regularly violate the First Amendment rights of the individuals interacting with their social media accounts,\" said Ordoñez.U.S. Rep. Marjorie Taylor Greene and Trump, on his long-held @realDonaldTrump account, have both faced lawsuits for blocking other Twitter users. A lower court ruled that Trump violated the First Amendment whenever he blocked a critic to silence a viewpoint, but the Supreme Court declined in 2021 to hear the case, partly citing Trump's account being then-suspended from the platform.",
        "Greene settled her case, a common outcome of such litigation. At least two similar lawsuits in Colorado were also settled, leaving the topic largely void of legal precedent.The Colorado bill is modeled off a 2022 federal court ruling that sided with the city manager of Port Huron, Michigan, who was sued for blocking someone and removing their posts from a Facebook page he used to communicate with the public. That case is now heading to the Supreme Court, which will not hear the case before fall.The legislation outlines the criterion to determine whether an elected official's account is private, but it generally does not include the account's content. On a private page, for example, an elected official could still largely post about their work, bills they were supporting or opposing, announcements or political discussions.\"If I´m at a bar and I decide to talk to my friend about a bill I´m running ... Does that make my conversation public?\" argued Rep. Leslie Herod, a Democrat and one of the bill's sponsors. \"As an elected official, every single part of our lives is not public.\"Herod argued that the intent of the law is largely to stop some who may harass or intimidate from chilling the free speech of others who are engaging in good-faith online.",
        "Tim Regan-Porter, CEO of the Colorado Press Association, pushed back, arguing that what politicians say about their work as elected officials is salient to the public and, consequently, reporters.\"It´s not just important what the law says, but what the intent was, why they chose to do it, and what parties might have influenced them,\" he said, \"and pronouncements on social media can give clearer understanding of what went into a decision.\"Colorado Gov. Jared Polis didn't not immediately respond to questions regarding his position on the bill.___Jesse Bedayn is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}