{
    "articleURL": "/tvshowbiz/article-12042395/Bucks-Fizzs-Cheryl-Baker-didnt-earn-penny-winning-Eurovision.html",
    "content": [
        "Buck's Fizz icon Cheryl Baker has revealed she didn't get a single penny - or any perks for that matter, for winning Eurovision with the group in 1981.",
        "Speaking ahead of this year's competition on May 13, Cheryl, 69, told The Sun: 'The artists make nothing from the contest, not a single penny. We have one trophy to share, which I’ve never had in my house ever after forty-two-years. You don’t win any money, it’s the prestige.'It opens so many doors. By winning Eurovision, our single was a global hit and we got to travel the world. We had loads of hit singles and hit albums. We were always travelling around the world to perform and that was because we won Eurovision.'Maybe there was money, but if there was we didn’t see it and, it wouldn’t have been a lot. It was all about the prize and the trophy, the fact that you’ve won, that is a big enough prize – we didn’t need any money.'Cheryl added that she doesn't recall any perks and certainly no goody bags when you win. ",
        "In a previous interview, she said it was the tearaway skirts the ladies wore during their routine which secured them their first place win.'I think it changed how people think of Eurovision because up until then it had been all about the song, she said. 'And then suddenly we came along and it was not just about the song, it was about the performance and the outfit.' ",
        "Meanwhile, Cheryl claims bandmember Mike Nolan, 68, currently has ownership of the trophy and won't let anyone else have it - but he has left it to her in his will. Bucks Fizz were formed specially for the Eurovision Song Contest and as a result, they became one of the best-selling UK pop acts of the 80s.Cheryl has said there is 'no downside to winning' and admits she is still earning her living from the fact she was in a band that won. This year will see singer Mae Muller, 25, enter the contest with her track, I Wrote A Song. Swedish act Loreen remains the favourite to win, having first won Eurovision back in 2012 with her track Euphoria. "
    ]
}